{
    "id": "1dmsu0s",
    "title": "I've been wondering about this issue for the longest time but haven't been able to find an answer. ",
    "url": "https://i.redd.it/qdtj5q4u7d8d1.jpeg",
    "selftext": "India is second globally in most number of pending court cases, with more than 5 crore pending court cases. \n\nLastly why is no one talking about this?",
    "flair": "Law & Courts",
    "score": 38,
    "num_comments": 34,
    "created_utc": 1719167571.0,
    "convurl": "https://i.redd.it/qdtj5q4u7d8d1.jpeg",
    "comments": [
        "Indian judges have 7 months of vacation - they work 8 hours on regular days and then have 7 months of vacation",
        "Are you serious!? Why thought?",
        "Are you serious!? Why though? \n\nHow does it name sense to give ANYONE more than half a year as vacation??",
        "Maybe the population is too much.",
        "Let me answer this being a first-hand victim of this nonsense.  \n\nSo, my dad was arrested for some crap some ppl filed against him and his brother. Well, the brother went 'missing', and they got my dad. My 69yro dad had to go spend almost 2 yrs in local jail. It took 2 years and about 20lakhs in bribe to even get his file on top of the bundle for the allahbad high court Judge to even glance at. \n\nWhatever the fkn case is idc but the fact that it takes all that long and $ to even be heard is the part why everyone languishes. \n\nThe kicker is if any senior citizens have special spot in the judiciary to be heard first given their age. It's like little relaxation the govtprovides . \n\nAt first it took months to even get a date in the lower (local) court because we had to grease the palms of the guard who got us to a lawyer who got us to the tehsildaar who then got us to DM who took us to mulayam singh. That's how far and up we had to go. All this for a classic land grab case. Dad owned it and local mla's buddies wanted 2ecres to open a 'resort' . None of it happened because we took everyone to court. First of all the judges in lower sessions and high court, incl delhi, won't show up to work. Even the senior judges work from 10am-12noon, and then they literally leave. Add to that the corruption which starts the minute you actually want justice. Fuk this. I'm glad we're not in India anymore. We all migrated. \n\nWould we dot it again? No.",
        "We have less judges per capita and the limited judges we have are on holidays most of the time.",
        "No they don't, don't spread misinformation. The majority of judges are at the lower level where they don't get anything more than two weeks and work for 6 days a week throughout the year, you arsehole.",
        "Exactly! It breaks my heart to hear your story. I'm sure there are many thousands of people with the same story out there. \n\nMy problem is no one here talks about this. And that's the real tragedy.",
        "I do know about the low strength of judges per unit population compared to better countries in terms of judiciary. \n\nMy question is why is something not being done about it!?",
        "A district court judge in Kerala once told - we are lucky to get a good stenographer, only a few courts have them.They are used to record court proceedings for the benefit of everyone. \n\nWe lack everything - from judges, to police, to forensic examiners - both techological and medical, to court employees etc. And its not just judiciary. We lack traffic police, bureaucrats, government servants everyone. India's problem is its absolutely small and miniscule government workers.",
        "Number of judges and their working time in the year are way too less\n\nEspecially HC and honorable SC\nAdd to that lawyers wanting to extend hearings so that they keep getting paid\n\nIt is a complete mess.",
        "My take, we've become too comfortable with our material lives. And become afraid of pissing off the wrong people or not wanting to go to the cops or the legal route in fear of losing our precious lives. Because the people in power haven't felt the consequences of their actions for so long, it's led to this massive power imbalance. If we'd kept them on their toes all along, wouldn't have been the case. 🤔",
        "Exactly! Then shouldn't this be talked about this more! I barely see this as even a topic of discussion in India.",
        "Completely agree!",
        "We are running the judiciary on one third of the judges that we actually need. Each judge is so overburdened that they can't properly decide the case if they ever hope to clear their case load.\n\nThe government is not interested in recruitment because they know that they would get in serious trouble if the judiciary was even running half strength. A lot of the corruption in our country is enabled by the fact that the people in power know that even if they are sued, it will take an immense amount of time for anything to happen.\n\nThere's also the corruption in the judiciary itself. You don't make much money as a judge, and often you'll be posted to some far off area in the middle of nowhere. A significant minority of judges take bribes. However, most judges just try and do their job without getting into trouble. Judges who try and get too aggressive often get taken care of, especially in the lower courts.\n\nThe answer would be that currently, no one wants the judiciary to improve. Lawyers and court support staff (registry and all) are able to earn their living only because the courts are slow. And I'm saying that applies when they're working completely honestly. 70% of lawyers in our country basically facilitate things in court, they've never argued a case. The government doesn't want a functional judiciary because the judiciary is a check on their power, and who wants that? They also have the advantage of being the organisation that has to recruit the judges, so they just don't. Additionally, the police also don't want an effective judiciary because that will cause problems for them when they do illegal shit or don't work properly... Which they do very often.\n\nDo you see, how no one really wants things to get better? Half the people on here are idiots saying judges go on vacations and don't work, when the reality is that most judges are so overworked they often don't see their children awake. But they are also easy targets, as compared to confronting the despair which is knowing that no one wants to really improve the judiciary, because even a properly staffed judiciary would be a catastrophic problem for the people in power.\n\nYou can also read this:\nhttps://www.livelaw.in/lawschool/articles/judicial-efficiency-beyond-working-hours-and-vacations-supreme-court-258847#:~:text=In%20conclusion%2C%20judges%20work%20just,such%20as%20bail%2C%20eviction%20etc.",
        "Dude that's so much trash. Most judges are handling multiple benches at a time, and hence cannot stay at the same bench for too long. Please educate yourself.",
        "So while all the shit is happening in the country including kejrival case and neet one where is cji? Why hasn't the review petition of pmla heard yet? What about the money bill case?",
        "The court closes for two weeks during this period. Even then matters are being heard by vacation benches. As for what the CJI is doing, you can actually see that because he made it mandatory for every court to broadcast their hearings online. Go and attend court for one single day, and then say that they are not working.\n\nPlease read this article, if you really wish to educate yourself:\nhttps://www.livelaw.in/lawschool/articles/judicial-efficiency-beyond-working-hours-and-vacations-supreme-court-258847#:~:text=In%20conclusion%2C%20judges%20work%20just,such%20as%20bail%2C%20eviction%20etc.",
        "What can we as citizens do? Are we completely powerless to do anything about this?!",
        "Cool will read it!",
        "It should be... But courts have a power called... Power to charge for contempt\n\nAnd judiciary is the only organ in the country that has no checks and balances...\n\nTyranny of the unelected...",
        "True true. This is why I felt making a post about this might help try to start a conversation that is high time we all had",
        "It's a very complex problem. As a single citizen, the only thing you can do is try to become a judge and help out those you can. Many people become judges with that intention,, but the job burns out even the best of us.\n\nThe problem needs to be addressed root and stem. As a country we need to elect leaders on the basis of real issues instead of religious and caste lines. Consider this. An issue this pivotal, which affects one entire pillar of our democracy, has never been brought up by a single party.\n\nTry and remember the last time a party said they will work on recruitment of judges. It is just not important enough for them to even care.\n\nSolving a problem like this is the work of decades and multiple generations. We will have to vote for the parties that talk about real issues. Once we force all parties to stop talking about religion and caste and start talking about we get them to start working on the issues instead of just talking. You see where this is going? Solving this problem probably entails that you will not live to see the final result, which will probably come in 2090 or something.",
        "No they don't dude. Give me any high court calender which has 7 months of vacation.",
        "Your comment is something I myself could have written it resonates so much with me. \n\nI request you to please bring this issue to light in front of as many people as you can in real life or on social media. \n\nMaybe if enough people talked about it, we could trigger a change.\n\n🙏🏻",
        "I am trying. If you'll see my comment history, I've been wasting my time recently trying to convince and shift people even a little bit towards reasonable beliefs, and failing spectacularly.\n\nIt's a fine line. If you push too hard, people will fight back to protect their beliefs, because changing your beliefs hurts. So you have to find that sweet spot where you educate people without being too patronising or pushy. \n\nA thing I do is I use movies to slowly make them see where they're wrong and what they can do. It is a long process. It took me about 4 years to change the beliefs of three of my friends. Most people on here would abandon those friendships rather than genuinely work on changing their beliefs. It's hard work..but try it. Things like this can have a treble effect, and you never know if you change the beliefs of one pivotal person who brings about a thought revolution.",
        "The real problem is low number of judges per unit population which is pithy compared to countries with stronger judiciaries.\n\nhttps://preview.redd.it/sa50bvyvnf8d1.png?width=1080&format=pjpg&auto=webp&s=84a116c4cfe5101cf36e2d2532e99bb78da8a9b6",
        "Absolutely! I completely agree with you.\n\nI try to do the same! \n\nAs a citizen, I thank you for these conversations you're trying to bring to the table, as few others will do the same. Still, you're not alone",
        "And yet it shocks me that at the same time, unemployment is the raging issue in politics.",
        "Govt has lakhs of open positions. Doesn't want to fill them. These are just existing posts and not new ones needed to cover population needs.",
        "Exactly! If the government had the political will to do something about it, the employment issue wouldn't have been as big an issue as it is today",
        "It does not have the money to pay the salaries."
    ],
    "cleaned_text": "ive wondering issue longest time havent able find answer india second globally number pending court cases crore pending court cases lastly one talking ",
    "cleaned_title": "ive wondering issue longest time havent able find answer",
    "cleaned_selftext": "india second globally number pending court cases crore pending court cases lastly one talking",
    "cleaned_comments": "indian judges months vacation work hours regular days months vacation serious thought serious though name sense give anyone half year vacation maybe population much let answer firsthand victim nonsense dad arrested crap ppl filed brother well brother went missing got dad yro dad go spend almost yrs local jail took years lakhs bribe even get file top bundle allahbad high court judge even glance whatever fkn case idc fact takes long even heard part everyone languishes kicker senior citizens special spot judiciary heard first given age like little relaxation govtprovides first took months even get date lower local court grease palms guard got us lawyer got us tehsildaar got us dm took us mulayam singh thats far go classic land grab case dad owned local mlas buddies wanted ecres open resort none happened took everyone court first judges lower sessions high court incl delhi wont show work even senior judges work amnoon literally leave add corruption starts minute actually want justice fuk im glad india anymore migrated would dot less judges per capita limited judges holidays time dont dont spread misinformation majority judges lower level dont get anything two weeks work days week throughout year arsehole exactly breaks heart hear story im sure many thousands people story problem one talks thats real tragedy know low strength judges per unit population compared better countries terms judiciary question something done district court judge kerala told lucky get good stenographer courts themthey used record court proceedings benefit everyone lack everything judges police forensic examiners techological medical court employees etc judiciary lack traffic police bureaucrats government servants everyone indias problem absolutely small miniscule government workers number judges working time year way less especially hc honorable sc add lawyers wanting extend hearings keep getting paid complete mess take weve become comfortable material lives become afraid pissing wrong people wanting go cops legal route fear losing precious lives people power havent felt consequences actions long led massive power imbalance wed kept toes along wouldnt case exactly shouldnt talked barely see even topic discussion india completely agree running judiciary one third judges actually need judge overburdened cant properly decide case ever hope clear case load government interested recruitment know would get serious trouble judiciary even running half strength lot corruption country enabled fact people power know even sued take immense amount time anything happen theres also corruption judiciary dont make much money judge often youll posted far area middle nowhere significant minority judges take bribes however judges try job without getting trouble judges try get aggressive often get taken care especially lower courts answer would currently one wants judiciary improve lawyers court support staff registry able earn living courts slow im saying applies theyre working completely honestly lawyers country basically facilitate things court theyve never argued case government doesnt want functional judiciary judiciary check power wants also advantage organisation recruit judges dont additionally police also dont want effective judiciary cause problems illegal shit dont work properly often see one really wants things get better half people idiots saying judges go vacations dont work reality judges overworked often dont see children awake also easy targets compared confronting despair knowing one wants really improve judiciary even properly staffed judiciary would catastrophic problem people power also read dude thats much trash judges handling multiple benches time hence stay bench long please educate shit happening country including kejrival case neet one cji hasnt review petition pmla heard yet money bill case court closes two weeks period even matters heard vacation benches cji actually see made mandatory every court broadcast hearings online go attend court one single day say working please read article really wish educate citizens completely powerless anything cool read courts power called power charge contempt judiciary organ country checks balances tyranny unelected true true felt making post might help try start conversation high time complex problem single citizen thing try become judge help many people become judges intention job burns even best us problem needs addressed root stem country need elect leaders basis real issues instead religious caste lines consider issue pivotal affects one entire pillar democracy never brought single party try remember last time party said work recruitment judges important enough even care solving problem like work decades multiple generations vote parties talk real issues force parties stop talking religion caste start talking get start working issues instead talking see going solving problem probably entails live see final result probably come something dont dude give high court calender months vacation comment something could written resonates much request please bring issue light front many people real life social media maybe enough people talked could trigger change trying youll see comment history ive wasting time recently trying convince shift people even little bit towards reasonable beliefs failing spectacularly fine line push hard people fight back protect beliefs changing beliefs hurts find sweet spot educate people without patronising pushy thing use movies slowly make see theyre wrong long process took years change beliefs three friends people would abandon friendships rather genuinely work changing beliefs hard workbut try things like treble effect never know change beliefs one pivotal person brings thought revolution real problem low number judges per unit population pithy compared countries stronger judiciaries absolutely completely agree try citizen thank conversations youre trying bring table others still youre alone yet shocks time unemployment raging issue politics govt lakhs open positions doesnt want fill existing posts new ones needed cover population needs exactly government political something employment issue wouldnt big issue today money pay salaries",
    "light_cleaned_title": "I've been wondering about this issue for the longest time but haven't been able to find an answer.",
    "light_cleaned_selftext": "India is second globally in most number of pending court cases, with more than 5 crore pending court cases. Lastly why is no one talking about this?",
    "light_cleaned_comments": "Indian judges have 7 months of vacation - they work 8 hours on regular days and then have 7 months of vacation Are you serious!? Why thought? Are you serious!? Why though? How does it name sense to give ANYONE more than half a year as vacation?? Maybe the population is too much. Let me answer this being a first-hand victim of this nonsense. So, my dad was arrested for some crap some ppl filed against him and his brother. Well, the brother went 'missing', and they got my dad. My 69yro dad had to go spend almost 2 yrs in local jail. It took 2 years and about 20lakhs in bribe to even get his file on top of the bundle for the allahbad high court Judge to even glance at. Whatever the fkn case is idc but the fact that it takes all that long and $ to even be heard is the part why everyone languishes. The kicker is if any senior citizens have special spot in the judiciary to be heard first given their age. It's like little relaxation the govtprovides . At first it took months to even get a date in the lower (local) court because we had to grease the palms of the guard who got us to a lawyer who got us to the tehsildaar who then got us to DM who took us to mulayam singh. That's how far and up we had to go. All this for a classic land grab case. Dad owned it and local mla's buddies wanted 2ecres to open a 'resort' . None of it happened because we took everyone to court. First of all the judges in lower sessions and high court, incl delhi, won't show up to work. Even the senior judges work from 10am-12noon, and then they literally leave. Add to that the corruption which starts the minute you actually want justice. Fuk this. I'm glad we're not in India anymore. We all migrated. Would we dot it again? No. We have less judges per capita and the limited judges we have are on holidays most of the time. No they don't, don't spread misinformation. The majority of judges are at the lower level where they don't get anything more than two weeks and work for 6 days a week throughout the year, you arsehole. Exactly! It breaks my heart to hear your story. I'm sure there are many thousands of people with the same story out there. My problem is no one here talks about this. And that's the real tragedy. I do know about the low strength of judges per unit population compared to better countries in terms of judiciary. My question is why is something not being done about it!? A district court judge in Kerala once told - we are lucky to get a good stenographer, only a few courts have them.They are used to record court proceedings for the benefit of everyone. We lack everything - from judges, to police, to forensic examiners - both techological and medical, to court employees etc. And its not just judiciary. We lack traffic police, bureaucrats, government servants everyone. India's problem is its absolutely small and miniscule government workers. Number of judges and their working time in the year are way too less Especially HC and honorable SC Add to that lawyers wanting to extend hearings so that they keep getting paid It is a complete mess. My take, we've become too comfortable with our material lives. And become afraid of pissing off the wrong people or not wanting to go to the cops or the legal route in fear of losing our precious lives. Because the people in power haven't felt the consequences of their actions for so long, it's led to this massive power imbalance. If we'd kept them on their toes all along, wouldn't have been the case. 🤔 Exactly! Then shouldn't this be talked about this more! I barely see this as even a topic of discussion in India. Completely agree! We are running the judiciary on one third of the judges that we actually need. Each judge is so overburdened that they can't properly decide the case if they ever hope to clear their case load. The government is not interested in recruitment because they know that they would get in serious trouble if the judiciary was even running half strength. A lot of the corruption in our country is enabled by the fact that the people in power know that even if they are sued, it will take an immense amount of time for anything to happen. There's also the corruption in the judiciary itself. You don't make much money as a judge, and often you'll be posted to some far off area in the middle of nowhere. A significant minority of judges take bribes. However, most judges just try and do their job without getting into trouble. Judges who try and get too aggressive often get taken care of, especially in the lower courts. The answer would be that currently, no one wants the judiciary to improve. Lawyers and court support staff (registry and all) are able to earn their living only because the courts are slow. And I'm saying that applies when they're working completely honestly. 70% of lawyers in our country basically facilitate things in court, they've never argued a case. The government doesn't want a functional judiciary because the judiciary is a check on their power, and who wants that? They also have the advantage of being the organisation that has to recruit the judges, so they just don't. Additionally, the police also don't want an effective judiciary because that will cause problems for them when they do illegal shit or don't work properly... Which they do very often. Do you see, how no one really wants things to get better? Half the people on here are idiots saying judges go on vacations and don't work, when the reality is that most judges are so overworked they often don't see their children awake. But they are also easy targets, as compared to confronting the despair which is knowing that no one wants to really improve the judiciary, because even a properly staffed judiciary would be a catastrophic problem for the people in power. You can also read this: Dude that's so much trash. Most judges are handling multiple benches at a time, and hence cannot stay at the same bench for too long. Please educate yourself. So while all the shit is happening in the country including kejrival case and neet one where is cji? Why hasn't the review petition of pmla heard yet? What about the money bill case? The court closes for two weeks during this period. Even then matters are being heard by vacation benches. As for what the CJI is doing, you can actually see that because he made it mandatory for every court to broadcast their hearings online. Go and attend court for one single day, and then say that they are not working. Please read this article, if you really wish to educate yourself: What can we as citizens do? Are we completely powerless to do anything about this?! Cool will read it! It should be... But courts have a power called... Power to charge for contempt And judiciary is the only organ in the country that has no checks and balances... Tyranny of the unelected... True true. This is why I felt making a post about this might help try to start a conversation that is high time we all had It's a very complex problem. As a single citizen, the only thing you can do is try to become a judge and help out those you can. Many people become judges with that intention,, but the job burns out even the best of us. The problem needs to be addressed root and stem. As a country we need to elect leaders on the basis of real issues instead of religious and caste lines. Consider this. An issue this pivotal, which affects one entire pillar of our democracy, has never been brought up by a single party. Try and remember the last time a party said they will work on recruitment of judges. It is just not important enough for them to even care. Solving a problem like this is the work of decades and multiple generations. We will have to vote for the parties that talk about real issues. Once we force all parties to stop talking about religion and caste and start talking about we get them to start working on the issues instead of just talking. You see where this is going? Solving this problem probably entails that you will not live to see the final result, which will probably come in 2090 or something. No they don't dude. Give me any high court calender which has 7 months of vacation. Your comment is something I myself could have written it resonates so much with me. I request you to please bring this issue to light in front of as many people as you can in real life or on social media. Maybe if enough people talked about it, we could trigger a change. 🙏🏻 I am trying. If you'll see my comment history, I've been wasting my time recently trying to convince and shift people even a little bit towards reasonable beliefs, and failing spectacularly. It's a fine line. If you push too hard, people will fight back to protect their beliefs, because changing your beliefs hurts. So you have to find that sweet spot where you educate people without being too patronising or pushy. A thing I do is I use movies to slowly make them see where they're wrong and what they can do. It is a long process. It took me about 4 years to change the beliefs of three of my friends. Most people on here would abandon those friendships rather than genuinely work on changing their beliefs. It's hard work..but try it. Things like this can have a treble effect, and you never know if you change the beliefs of one pivotal person who brings about a thought revolution. The real problem is low number of judges per unit population which is pithy compared to countries with stronger judiciaries. Absolutely! I completely agree with you. I try to do the same! As a citizen, I thank you for these conversations you're trying to bring to the table, as few others will do the same. Still, you're not alone And yet it shocks me that at the same time, unemployment is the raging issue in politics. Govt has lakhs of open positions. Doesn't want to fill them. These are just existing posts and not new ones needed to cover population needs. Exactly! If the government had the political will to do something about it, the employment issue wouldn't have been as big an issue as it is today It does not have the money to pay the salaries."
}