{
    "id": "t6y9xo",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/t6y9xo/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 14,
    "created_utc": 1646443809,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "took me over a month but I finally finished s01 of The Deuce last night, loved it. haven't seen a better period drama since Mad Men.",
        "Anyone watched Batman? How is it?\n\nEDIT: Watched it yesterday. It's okay is what I'll say.",
        "Literally waiting for the film to start. Will let you know",
        "Absolutely loved it.",
        "It was good",
        "The Boys: Diabolical (Animated, Prime Video)\n\nWatching it in Indian languages and a few lines are funny af.",
        "Very epic",
        "Saw The Batman. Unbelievably immersive experience in the theatre. Highly recommend watching on the largest and loudest screen you can find.",
        "The new batman movie was amazing!! One of the best superhero movies ever made imo !!",
        "Why did it take a month?",
        "Anybody watched 'All of us are dead'? I'm not able to finish the first episode.",
        "Let us know!",
        "It was a great time. Absolutely loved it.",
        "because i don't get time to watch much these days :("
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "took month finally finished deuce last night loved havent seen better period drama since mad men anyone watched batman edit watched yesterday okay ill say literally waiting film start let know absolutely loved good boys diabolical animated prime video watching indian languages lines funny af epic saw batman unbelievably immersive experience theatre highly recommend watching largest loudest screen find new batman movie amazing one best superhero movies ever made imo take month anybody watched us dead im able finish first episode let us know great time absolutely loved dont get time watch much days",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "took me over a month but I finally finished s01 of The Deuce last night, loved it. haven't seen a better period drama since Mad Men. Anyone watched Batman? How is it? EDIT: Watched it yesterday. It's okay is what I'll say. Literally waiting for the film to start. Will let you know Absolutely loved it. It was good The Boys: Diabolical (Animated, Prime Video) Watching it in Indian languages and a few lines are funny af. Very epic Saw The Batman. Unbelievably immersive experience in the theatre. Highly recommend watching on the largest and loudest screen you can find. The new batman movie was amazing!! One of the best superhero movies ever made imo !! Why did it take a month? Anybody watched 'All of us are dead'? I'm not able to finish the first episode. Let us know! It was a great time. Absolutely loved it. because i don't get time to watch much these days :("
}