{
    "id": "k0r2ks",
    "title": "UP Draft Bill on Freedom of Religion",
    "url": "https://www.reddit.com/r/india/comments/k0r2ks/up_draft_bill_on_freedom_of_religion/",
    "selftext": "I'm from UP, I read the Bill, and here are some concerns:\n\n1. &amp;#x200B;\n\n[Section 3](https://preview.redd.it/tdgmdbtydd161.png?width=811&amp;format=png&amp;auto=webp&amp;s=c091561c4e4f1f9ef03867f7282a25bf902f727a)\n\nMain issue is with the term \"allurement\". Definition of Allurement in section 2(a)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zk936aqfed161.png?width=795&amp;format=png&amp;auto=webp&amp;s=31bc211b50dcb6a4d4450a440215ec29157fb837\n\nPrimary concern is that this will be misused to target dalits and bahujans who adopt Budhism to escape structural caste based discrimination, marginalisation and violence from Hindus. This phrase is just vague enough for sanghi vigilantes to file FIRs. \n\n2**. Exception for reconversion to \"previous religion\"**. This is found in other state's similar legislations (for ex. Jharkhand permits return to \"ancestor's religion\"). This is a sneaky little way to allow for all the ghar wapasi/shuddhi. Sanghis love to argue that everyone in this country was once \"hindu\".\n\n**3. Who can file a complaint? Literally ANYBODY.** \n\nhttps://preview.redd.it/6gq73lffgd161.png?width=763&amp;format=png&amp;auto=webp&amp;s=7f3a78b485796a78eb73948b34f7c75ba3949019\n\nFreedom of Religion (Article 25, Constitution of India) is a personal right. How is a lay person allowed to lodge complaint? What does \"aggrieved\" mean? Why is the locus standi so wide?\n\n4. Declaration to DM one month before conversion from the person trying to convert and the religious priest undertaking the ceremony:\n\nhttps://preview.redd.it/x69q4l4lid161.png?width=774&amp;format=png&amp;auto=webp&amp;s=bc5cbbdc5dced7a4ee8c947521dd0f036f783539\n\nConcern: Information can be leaked and publicized. Minority community and Budhist orgs converting dalits will be particularly at risk. One month is a long and sufficient time to intimidate and harass. Even after submitting the Declaration, the DM will conduct a police verification. \n\nhttps://preview.redd.it/s3wt3xo7jd161.png?width=764&amp;format=png&amp;auto=webp&amp;s=f9633867e187f991300d7c4c9b466504403e0b9d\n\nAs long as there is a BJP sarkaar in UP, this is an additional tool for intimidation. \n\nIn case anyone had any misconceptions here are more tools for intimidation:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kpbrk3w3kd161.png?width=795&amp;format=png&amp;auto=webp&amp;s=0b83524bb649cbff9939716dd1d1df0e95f4d270\n\n5. Who all can be punished under this Act:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/03nf2bdpkd161.png?width=775&amp;format=png&amp;auto=webp&amp;s=2fc4a1479377a65d4257195ef47c6719f0326b81\n\nAgain, frighteningly broad ambit of who all can be booked under this Act. FRIGHTENINGLY BROAD. What does \"counsel\" and \"convince\" mean? If my friend wants to convert, talks to me about it, and I tell her to follow her heart, have I \"counselled\" or \"convinced\" her? I am a criminal now?\n\n6. **Burden of Proof on the accused:** Normally (there can be exceptions if statues provide for them) in criminal law, whoever lays a claim must present evidence or proof. So if a random person alleges that A converted in contravention of this law, burden of proof has to be on this random person. But instead, A now has to prove his innocence. In other words, MORE HARASSMENT.\n\nhttps://preview.redd.it/qsehkii2md161.png?width=789&amp;format=png&amp;auto=webp&amp;s=e632931c528ae0809a9df10ccb3a55d4cbbbfaed",
    "flair": "Policy/Economy",
    "score": 62,
    "num_comments": 8,
    "created_utc": 1606306240,
    "convurl": "https://b.thumbs.redditmedia.com/kqXrdkPvGfDMlM4UdQOg0jqV47I1PbqVPhcslb0jNEI.jpg",
    "comments": [
        "LINK FOR THE BILL: [https://www.scribd.com/document/485376344/UP-Draft-Bill-on-Freedom-of-Religion](https://www.scribd.com/document/485376344/UP-Draft-Bill-on-Freedom-of-Religion)",
        "Indian Government is alluring Muslims to change their religion to get the benefits of Hindu Undivided family tax cut.\n\nA temptation for easy money in cash.",
        "This is bad",
        "This is where the Hindu Taliban is different from the Islamic one: the Islamic ones don't give a shit about what the world thinks of them, proudly declare \"yeah we are bigots, fuck you\" and go and do their thing (destroy girls schools, blow up Budhha statues, whatever). The Hindu Taliban on the other hand are too cowardly to do that, and hide their bigotry behind this seemingly lawful &amp; legal process, while all they had to do was to say \"we won't allow hindus and muslims to inter-marry, _kar le jo karna hai_\"",
        "Well, we are on the path to become a Hindu Pakistan afterall.",
        "Well you really need to google out the attrocities carried out by Talibans. As so easily and carelessly you attach this heinous adjective to a peaceful religion. Well whatever happening may be wrong or right is no where close to the things Taliban has done and is doing.",
        "Taliban was given the gift of instability and chaos provided by both the soviets and the US to sprout unhinged leaders who can do whatever crazy shit they want. In our case, the beast leaders don’t have the same level of freedom, as they will always have resistances in various civil forms whether it is the media, the law, foreign diplomacy or even the constitution. At least until each of them loses their purpose.",
        "Of course, someone changing their religion is the most important problem people of this country are facing. We are too privileged to have the best employment rate, lowest levels of pollution, highest GDP per capita and highest currency value."
    ],
    "cleaned_text": "draft bill freedom religion im read bill concerns ampxb section httpspreviewreddittdgmdbtyddpngwidthampformatpngampautowebpampscceffeffabffa main issue term allurement definition allurement section ampxb primary concern misused target dalits bahujans adopt budhism escape structural caste based discrimination marginalisation violence hindus phrase vague enough sanghi vigilantes file firs exception reconversion previous religion found states similar legislations ex jharkhand permits return ancestors religion sneaky little way allow ghar wapasishuddhi sanghis love argue everyone country hindu file complaint literally anybody freedom religion article constitution india personal right lay person allowed lodge complaint aggrieved mean locus standi wide declaration dm one month conversion person trying convert religious priest undertaking ceremony concern information leaked publicized minority community budhist orgs converting dalits particularly risk one month long sufficient time intimidate harass even submitting declaration dm conduct police verification long bjp sarkaar additional tool intimidation case anyone misconceptions tools intimidation ampxb punished act ampxb frighteningly broad ambit booked act frighteningly broad counsel convince mean friend wants convert talks tell follow heart counselled convinced criminal burden proof accused normally exceptions statues provide criminal law whoever lays claim must present evidence proof random person alleges converted contravention law burden proof random person instead prove innocence words harassment ",
    "cleaned_title": "draft bill freedom religion",
    "cleaned_selftext": "im read bill concerns ampxb section httpspreviewreddittdgmdbtyddpngwidthampformatpngampautowebpampscceffeffabffa main issue term allurement definition allurement section ampxb primary concern misused target dalits bahujans adopt budhism escape structural caste based discrimination marginalisation violence hindus phrase vague enough sanghi vigilantes file firs exception reconversion previous religion found states similar legislations ex jharkhand permits return ancestors religion sneaky little way allow ghar wapasishuddhi sanghis love argue everyone country hindu file complaint literally anybody freedom religion article constitution india personal right lay person allowed lodge complaint aggrieved mean locus standi wide declaration dm one month conversion person trying convert religious priest undertaking ceremony concern information leaked publicized minority community budhist orgs converting dalits particularly risk one month long sufficient time intimidate harass even submitting declaration dm conduct police verification long bjp sarkaar additional tool intimidation case anyone misconceptions tools intimidation ampxb punished act ampxb frighteningly broad ambit booked act frighteningly broad counsel convince mean friend wants convert talks tell follow heart counselled convinced criminal burden proof accused normally exceptions statues provide criminal law whoever lays claim must present evidence proof random person alleges converted contravention law burden proof random person instead prove innocence words harassment",
    "cleaned_comments": "link bill httpswwwscribdcomdocumentupdraftbillonfreedomofreligionhttpswwwscribdcomdocumentupdraftbillonfreedomofreligion indian government alluring muslims change religion get benefits hindu undivided family tax cut temptation easy money cash bad hindu taliban different islamic one islamic ones dont give shit world thinks proudly declare yeah bigots fuck go thing destroy girls schools blow budhha statues whatever hindu taliban hand cowardly hide bigotry behind seemingly lawful amp legal process say wont allow hindus muslims intermarry kar le jo karna hai well path become hindu pakistan afterall well really need google attrocities carried talibans easily carelessly attach heinous adjective peaceful religion well whatever happening may wrong right close things taliban done taliban given gift instability chaos provided soviets us sprout unhinged leaders whatever crazy shit want case beast leaders dont level freedom always resistances various civil forms whether media law foreign diplomacy even constitution least loses purpose course someone changing religion important problem people country facing privileged best employment rate lowest levels pollution highest gdp per capita highest currency value",
    "light_cleaned_title": "UP Draft Bill on Freedom of Religion",
    "light_cleaned_selftext": "I'm from UP, I read the Bill, and here are some concerns: 1.  [Section 3](https://preview.redd.it/tdgmdbtydd161.png?width=811&amp;format=png&amp;auto=webp&amp;s=c091561c4e4f1f9ef03867f7282a25bf902f727a) Main issue is with the term \"allurement\". Definition of Allurement in section 2(a)  Primary concern is that this will be misused to target dalits and bahujans who adopt Budhism to escape structural caste based discrimination, marginalisation and violence from Hindus. This phrase is just vague enough for sanghi vigilantes to file FIRs. 2**. Exception for reconversion to \"previous religion\"**. This is found in other state's similar legislations (for ex. Jharkhand permits return to \"ancestor's religion\"). This is a sneaky little way to allow for all the ghar wapasi/shuddhi. Sanghis love to argue that everyone in this country was once \"hindu\". **3. Who can file a complaint? Literally ANYBODY.** Freedom of Religion (Article 25, Constitution of India) is a personal right. How is a lay person allowed to lodge complaint? What does \"aggrieved\" mean? Why is the locus standi so wide? 4. Declaration to DM one month before conversion from the person trying to convert and the religious priest undertaking the ceremony: Concern: Information can be leaked and publicized. Minority community and Budhist orgs converting dalits will be particularly at risk. One month is a long and sufficient time to intimidate and harass. Even after submitting the Declaration, the DM will conduct a police verification. As long as there is a BJP sarkaar in UP, this is an additional tool for intimidation. In case anyone had any misconceptions here are more tools for intimidation:  5. Who all can be punished under this Act:  Again, frighteningly broad ambit of who all can be booked under this Act. FRIGHTENINGLY BROAD. What does \"counsel\" and \"convince\" mean? If my friend wants to convert, talks to me about it, and I tell her to follow her heart, have I \"counselled\" or \"convinced\" her? I am a criminal now? 6. **Burden of Proof on the accused:** Normally (there can be exceptions if statues provide for them) in criminal law, whoever lays a claim must present evidence or proof. So if a random person alleges that A converted in contravention of this law, burden of proof has to be on this random person. But instead, A now has to prove his innocence. In other words, MORE HARASSMENT.",
    "light_cleaned_comments": "LINK FOR THE BILL: [https://www.scribd.com/document/485376344/UP-Draft-Bill-on-Freedom-of-Religion](https://www.scribd.com/document/485376344/UP-Draft-Bill-on-Freedom-of-Religion) Indian Government is alluring Muslims to change their religion to get the benefits of Hindu Undivided family tax cut. A temptation for easy money in cash. This is bad This is where the Hindu Taliban is different from the Islamic one: the Islamic ones don't give a shit about what the world thinks of them, proudly declare \"yeah we are bigots, fuck you\" and go and do their thing (destroy girls schools, blow up Budhha statues, whatever). The Hindu Taliban on the other hand are too cowardly to do that, and hide their bigotry behind this seemingly lawful &amp; legal process, while all they had to do was to say \"we won't allow hindus and muslims to inter-marry, _kar le jo karna hai_\" Well, we are on the path to become a Hindu Pakistan afterall. Well you really need to google out the attrocities carried out by Talibans. As so easily and carelessly you attach this heinous adjective to a peaceful religion. Well whatever happening may be wrong or right is no where close to the things Taliban has done and is doing. Taliban was given the gift of instability and chaos provided by both the soviets and the US to sprout unhinged leaders who can do whatever crazy shit they want. In our case, the beast leaders don’t have the same level of freedom, as they will always have resistances in various civil forms whether it is the media, the law, foreign diplomacy or even the constitution. At least until each of them loses their purpose. Of course, someone changing their religion is the most important problem people of this country are facing. We are too privileged to have the best employment rate, lowest levels of pollution, highest GDP per capita and highest currency value."
}