{
    "id": "1da7xgk",
    "title": "Manager in Indian corporate scene",
    "url": "https://www.reddit.com/gallery/1da7xgk",
    "selftext": "One of my friend's colleague took screenshots of his manager who posted pics of his dog and one of female team member, comparing the hair style on company's official teams chat group. One of the other teammate deliberately asked him what he meant to point out his stupidity and deleted when he realised what he did. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1717758223.0,
    "convurl": "https://i.redd.it/1by5ivw3t45d1.jpg",
    "comments": [
        "How do they think it’s ok to do this. Thu",
        "That's sufficient for a POSH case.",
        "Are you sure you know what POSH means.. It's harassment nevertheless.."
    ],
    "cleaned_text": "manager indian corporate scene one friends colleague took screenshots manager posted pics dog one female team member comparing hair style companys official teams chat group one teammate deliberately asked meant point stupidity deleted realised ",
    "cleaned_title": "manager indian corporate scene",
    "cleaned_selftext": "one friends colleague took screenshots manager posted pics dog one female team member comparing hair style companys official teams chat group one teammate deliberately asked meant point stupidity deleted realised",
    "cleaned_comments": "think ok thu thats sufficient posh case sure know posh means harassment nevertheless",
    "light_cleaned_title": "Manager in Indian corporate scene",
    "light_cleaned_selftext": "One of my friend's colleague took screenshots of his manager who posted pics of his dog and one of female team member, comparing the hair style on company's official teams chat group. One of the other teammate deliberately asked him what he meant to point out his stupidity and deleted when he realised what he did.",
    "light_cleaned_comments": "How do they think it’s ok to do this. Thu That's sufficient for a POSH case. Are you sure you know what POSH means.. It's harassment nevertheless.."
}