{
    "id": "n5aipl",
    "title": "Digital Transparency: A Right to Information Report for April, 2021",
    "url": "https://www.reddit.com/r/india/comments/n5aipl/digital_transparency_a_right_to_information/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/wz0nabs4c9x61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=24d1085277b283a5dd127e28ec781387e72bb71b\n\n### tl;dr\n\nSince our last report for the month of March, IFF has filed 7 RTI requests. Here, we give you an overview of the requests filed and why demanding transparency and accountability from Government authorities is one of the key elements in our fight to protect digital rights. We also highlight how our demands for transparency have been affected by the lockdown due to the COVID-19 pandemic.\n\n### Why is transparency important?\n\nThe Right to Information Act, 2005 was enacted to promote transparency and accountability in the working of every public authority by ensuring that citizens are able secure access to information under the control of public authorities. Facilitating such access is necessary to ensure that democratic processes are not subverted by public authorities acting under private interests. Where transparency is not upheld as a value of public decision-making, citizens are at a disadvantage when it comes to keeping a check on abuse of power by the public authorities.\n\nThe Right to Information (RTI) Act is thus one of the most important tools at the disposal of the public to engage with, and demand transparency and accountability from, the Government. We use the Act to routinely extract information about various ongoing policies and projects that the Government launches. In the month of April, we have up till now filed 7 RTI requests electronically with authorities at the Central level, concerning the various issues on which we engage with the Government.\n\n**Note**: Number of RTIs are calculated from the date of the previous report. While we try to make this a monthly report, some RTI requests from the previous month that were filed after that month's report may be included in the present report.\n\n### Data Protection and Privacy\n\nOne of our key areas of work is ensuring that public authorities respect data privacy and engage in practices which will ensure that the right to privacy is protected. We filed 6 RTI requests with various authorities this month to ask for information pertaining to newly introduced projects which affect the data privacy of Indian citizens.\n\nUnder IFF’s [**Project Panoptic**](https://panoptic.in/), we routinely file RTI requests with various public authorities after we come across news reports that they are developing or using facial recognition technology. This month, we filed requests with:\n\n1. The [**Unique Identification Authority of India**](https://drive.google.com/file/d/1siteoWYtQ9taOAMQYHoB_mvkz6R3qvzn/view?usp=sharing) on their plans for a ‘touchless’ vaccination process, with Aadhaar-based facial recognition.\n2. The [**National Health Authority**](https://drive.google.com/file/d/1WLU4Ax-6Do7BfhbJ4fgKP1989hcYKDQt/view?usp=sharing) on their plans for a ‘touchless’ vaccination process, with Aadhaar-based facial recognition.\n3. The [**Airports Authority of India**](https://drive.google.com/file/d/19EgGYq_8ZMUR8DPxSWLjweD4b6aRHlRF/view?usp=sharing) on their use of facial recognition technology at the Varanasi Airport.\n4. The [**Airports Authority of India**](https://drive.google.com/file/d/1dKg1bbsK1--zllkUVUfd2AEIGSgTYQRF/view?usp=sharing) on their use of facial recognition technology at the Vijayawada Airport.\n5. The [**Airports Authority of India**](https://drive.google.com/file/d/1hnB0nJ5d6Zm4GlrKHXkHM5bz5tmQinQZ/view?usp=sharing) on their use of facial recognition technology at the Pune Airport.\n\nAdditionally we also filed requests with:\n\n1. The [**Department of Agriculture, Cooperation &amp; Farmers Welfare**](https://drive.google.com/file/d/15103pU9a30YVAzIfck0fsOP0uM02atiD/view?usp=sharing) on the MoU with Microsoft for a pilot project in 100 villages of 6 states.\n\n### Free Speech and Censorship\n\nOur other main focus is to ensure that freedom of speech and expression on the internet is protected and that unnecessary censorship does not lead to a chilling effect on people’s fundamental rights. For this, we routinely file RTI requests to demand accountability for instances which may hamper free speech on the internet such as website blocking or internet shutdowns.\n\nIn the last month, we have filed 1 RTI request to demand accountability for violations of free speech on the internet with:\n\n1. The [**Department of Electronics &amp; Information Technology**](https://drive.google.com/file/d/1tCY3biZDaqSQ1mTunthYx88X1RxhKo6R/view?usp=sharing) on a news report titled, “[**Twitter removes over 50 posts on govt. orders; majority related to COVID-19**](https://www.thehindu.com/news/national/twitter-removes-over-50-posts-on-govt-orders-majority-related-to-covid-19/article34404805.ece),\" published in The Hindu dated April 25, 2021.\n\n### Transparency has taken a hit during the lockdown\n\nOver the last month, our efforts at demanding transparency have de-accelerated considerably. This is due to our inability to safely file RTI requests physically. Only the Central Government and certain State Governments have a dedicated online portal for filing RTI requests. For most other State authorities across the country, RTI requests still have to be filed physically. The lack of an online RTI portal creates considerable hurdles to demanding transparency in situations like the current one wherein physical filing has become impossible due to the ongoing pandemic.\n\n### Important Documents\n\n1. Digital Transparency: A Right to Information Report for March, 2021 dated April 6, 2021 ([**link**](https://internetfreedom.in/digital-transparency-a-right-to-information-report-for-march-2021/))\n2. Response received from MeitY’s CPIO pursuant to the CIC hearing on March 25, 2021 dated April 13, 2021 ([**link**](https://twitter.com/internetfreedom/status/1385574459797434371))\n3. Without prejudice: The least the government can do is proactively publish judicial orders for website blocking dated April 21, 2021 ([**link**](https://internetfreedom.in/website-blocking-orders-2021/))",
    "flair": "Policy/Economy",
    "score": 33,
    "num_comments": 2,
    "created_utc": 1620201110,
    "convurl": "https://b.thumbs.redditmedia.com/X-1OEQhH-4NqE_PJl56oqX6pCtcZ8V_BKOsNYaaGXMY.jpg",
    "comments": [
        "Thank you for the work you guys are doing. And take care",
        "Thank you, prayers and wishes of health and safety to you, take care :)"
    ],
    "cleaned_text": "digital transparency right information report april ampxb tldr since last report month march iff filed rti requests give overview requests filed demanding transparency accountability government authorities one key elements fight protect digital rights also highlight demands transparency affected lockdown due covid pandemic transparency important right information act enacted promote transparency accountability working every public authority ensuring citizens able secure access information control public authorities facilitating access necessary ensure democratic processes subverted public authorities acting private interests transparency upheld value public decisionmaking citizens disadvantage comes keeping check abuse power public authorities right information rti act thus one important tools disposal public engage demand transparency accountability government use act routinely extract information various ongoing policies projects government launches month april till filed rti requests electronically authorities central level concerning various issues engage government note number rtis calculated date previous report try make monthly report rti requests previous month filed months report may included present report data protection privacy one key areas work ensuring public authorities respect data privacy engage practices ensure right privacy protected filed rti requests various authorities month ask information pertaining newly introduced projects affect data privacy indian citizens iffs project panoptichttpspanopticin routinely file rti requests various public authorities come across news reports developing using facial recognition technology month filed requests unique identification authority indiahttpsdrivegooglecomfiledsiteowytqtaoamqyhobmvkzrqvznviewuspsharing plans touchless vaccination process aadhaarbased facial recognition national health authorityhttpsdrivegooglecomfiledwluaxdobfhbjfgkphcykdqtviewuspsharing plans touchless vaccination process aadhaarbased facial recognition airports authority indiahttpsdrivegooglecomfiledeggyqzmurdpxswljwedbarhlrfviewuspsharing use facial recognition technology varanasi airport airports authority indiahttpsdrivegooglecomfileddkgbbskzllkuvufdaeigsgtyqrfviewuspsharing use facial recognition technology vijayawada airport airports authority indiahttpsdrivegooglecomfiledhnbnjdzmglrkhxkhmbztmqinqzviewuspsharing use facial recognition technology pune airport additionally also filed requests department agriculture cooperation amp farmers welfarehttpsdrivegooglecomfiledpuayvazifckfsopumatidviewuspsharing mou microsoft pilot project villages states free speech censorship main focus ensure freedom speech expression internet protected unnecessary censorship lead chilling effect peoples fundamental rights routinely file rti requests demand accountability instances may hamper free speech internet website blocking internet shutdowns last month filed rti request demand accountability violations free speech internet department electronics amp information technologyhttpsdrivegooglecomfiledtcybizdaqsqmtunthyxxrxhkorviewuspsharing news report titled twitter removes posts govt orders majority related covidhttpswwwthehinducomnewsnationaltwitterremovesoverpostsongovtordersmajorityrelatedtocovidarticleece published hindu dated april transparency taken hit lockdown last month efforts demanding transparency deaccelerated considerably due inability safely file rti requests physically central government certain state governments dedicated online portal filing rti requests state authorities across country rti requests still filed physically lack online rti portal creates considerable hurdles demanding transparency situations like current one wherein physical filing become impossible due ongoing pandemic important documents digital transparency right information report march dated april linkhttpsinternetfreedomindigitaltransparencyarighttoinformationreportformarch response received meitys cpio pursuant cic hearing march dated april linkhttpstwittercominternetfreedomstatus without prejudice least government proactively publish judicial orders website blocking dated april linkhttpsinternetfreedominwebsiteblockingorders ",
    "cleaned_title": "digital transparency right information report april",
    "cleaned_selftext": "ampxb tldr since last report month march iff filed rti requests give overview requests filed demanding transparency accountability government authorities one key elements fight protect digital rights also highlight demands transparency affected lockdown due covid pandemic transparency important right information act enacted promote transparency accountability working every public authority ensuring citizens able secure access information control public authorities facilitating access necessary ensure democratic processes subverted public authorities acting private interests transparency upheld value public decisionmaking citizens disadvantage comes keeping check abuse power public authorities right information rti act thus one important tools disposal public engage demand transparency accountability government use act routinely extract information various ongoing policies projects government launches month april till filed rti requests electronically authorities central level concerning various issues engage government note number rtis calculated date previous report try make monthly report rti requests previous month filed months report may included present report data protection privacy one key areas work ensuring public authorities respect data privacy engage practices ensure right privacy protected filed rti requests various authorities month ask information pertaining newly introduced projects affect data privacy indian citizens iffs project panoptichttpspanopticin routinely file rti requests various public authorities come across news reports developing using facial recognition technology month filed requests unique identification authority indiahttpsdrivegooglecomfiledsiteowytqtaoamqyhobmvkzrqvznviewuspsharing plans touchless vaccination process aadhaarbased facial recognition national health authorityhttpsdrivegooglecomfiledwluaxdobfhbjfgkphcykdqtviewuspsharing plans touchless vaccination process aadhaarbased facial recognition airports authority indiahttpsdrivegooglecomfiledeggyqzmurdpxswljwedbarhlrfviewuspsharing use facial recognition technology varanasi airport airports authority indiahttpsdrivegooglecomfileddkgbbskzllkuvufdaeigsgtyqrfviewuspsharing use facial recognition technology vijayawada airport airports authority indiahttpsdrivegooglecomfiledhnbnjdzmglrkhxkhmbztmqinqzviewuspsharing use facial recognition technology pune airport additionally also filed requests department agriculture cooperation amp farmers welfarehttpsdrivegooglecomfiledpuayvazifckfsopumatidviewuspsharing mou microsoft pilot project villages states free speech censorship main focus ensure freedom speech expression internet protected unnecessary censorship lead chilling effect peoples fundamental rights routinely file rti requests demand accountability instances may hamper free speech internet website blocking internet shutdowns last month filed rti request demand accountability violations free speech internet department electronics amp information technologyhttpsdrivegooglecomfiledtcybizdaqsqmtunthyxxrxhkorviewuspsharing news report titled twitter removes posts govt orders majority related covidhttpswwwthehinducomnewsnationaltwitterremovesoverpostsongovtordersmajorityrelatedtocovidarticleece published hindu dated april transparency taken hit lockdown last month efforts demanding transparency deaccelerated considerably due inability safely file rti requests physically central government certain state governments dedicated online portal filing rti requests state authorities across country rti requests still filed physically lack online rti portal creates considerable hurdles demanding transparency situations like current one wherein physical filing become impossible due ongoing pandemic important documents digital transparency right information report march dated april linkhttpsinternetfreedomindigitaltransparencyarighttoinformationreportformarch response received meitys cpio pursuant cic hearing march dated april linkhttpstwittercominternetfreedomstatus without prejudice least government proactively publish judicial orders website blocking dated april linkhttpsinternetfreedominwebsiteblockingorders",
    "cleaned_comments": "thank work guys take care thank prayers wishes health safety take care",
    "light_cleaned_title": "Digital Transparency: A Right to Information Report for April, 2021",
    "light_cleaned_selftext": "### tl;dr Since our last report for the month of March, IFF has filed 7 RTI requests. Here, we give you an overview of the requests filed and why demanding transparency and accountability from Government authorities is one of the key elements in our fight to protect digital rights. We also highlight how our demands for transparency have been affected by the lockdown due to the COVID-19 pandemic. ### Why is transparency important? The Right to Information Act, 2005 was enacted to promote transparency and accountability in the working of every public authority by ensuring that citizens are able secure access to information under the control of public authorities. Facilitating such access is necessary to ensure that democratic processes are not subverted by public authorities acting under private interests. Where transparency is not upheld as a value of public decision-making, citizens are at a disadvantage when it comes to keeping a check on abuse of power by the public authorities. The Right to Information (RTI) Act is thus one of the most important tools at the disposal of the public to engage with, and demand transparency and accountability from, the Government. We use the Act to routinely extract information about various ongoing policies and projects that the Government launches. In the month of April, we have up till now filed 7 RTI requests electronically with authorities at the Central level, concerning the various issues on which we engage with the Government. **Note**: Number of RTIs are calculated from the date of the previous report. While we try to make this a monthly report, some RTI requests from the previous month that were filed after that month's report may be included in the present report. ### Data Protection and Privacy One of our key areas of work is ensuring that public authorities respect data privacy and engage in practices which will ensure that the right to privacy is protected. We filed 6 RTI requests with various authorities this month to ask for information pertaining to newly introduced projects which affect the data privacy of Indian citizens. Under IFF’s [**Project Panoptic**](https://panoptic.in/), we routinely file RTI requests with various public authorities after we come across news reports that they are developing or using facial recognition technology. This month, we filed requests with: 1. The [**Unique Identification Authority of India**](https://drive.google.com/file/d/1siteoWYtQ9taOAMQYHoB_mvkz6R3qvzn/view?usp=sharing) on their plans for a ‘touchless’ vaccination process, with Aadhaar-based facial recognition. 2. The [**National Health Authority**](https://drive.google.com/file/d/1WLU4Ax-6Do7BfhbJ4fgKP1989hcYKDQt/view?usp=sharing) on their plans for a ‘touchless’ vaccination process, with Aadhaar-based facial recognition. 3. The [**Airports Authority of India**](https://drive.google.com/file/d/19EgGYq_8ZMUR8DPxSWLjweD4b6aRHlRF/view?usp=sharing) on their use of facial recognition technology at the Varanasi Airport. 4. The [**Airports Authority of India**](https://drive.google.com/file/d/1dKg1bbsK1--zllkUVUfd2AEIGSgTYQRF/view?usp=sharing) on their use of facial recognition technology at the Vijayawada Airport. 5. The [**Airports Authority of India**](https://drive.google.com/file/d/1hnB0nJ5d6Zm4GlrKHXkHM5bz5tmQinQZ/view?usp=sharing) on their use of facial recognition technology at the Pune Airport. Additionally we also filed requests with: 1. The [**Department of Agriculture, Cooperation &amp; Farmers Welfare**](https://drive.google.com/file/d/15103pU9a30YVAzIfck0fsOP0uM02atiD/view?usp=sharing) on the MoU with Microsoft for a pilot project in 100 villages of 6 states. ### Free Speech and Censorship Our other main focus is to ensure that freedom of speech and expression on the internet is protected and that unnecessary censorship does not lead to a chilling effect on people’s fundamental rights. For this, we routinely file RTI requests to demand accountability for instances which may hamper free speech on the internet such as website blocking or internet shutdowns. In the last month, we have filed 1 RTI request to demand accountability for violations of free speech on the internet with: 1. The [**Department of Electronics &amp; Information Technology**](https://drive.google.com/file/d/1tCY3biZDaqSQ1mTunthYx88X1RxhKo6R/view?usp=sharing) on a news report titled, “[**Twitter removes over 50 posts on govt. orders; majority related to COVID-19**](https://www.thehindu.com/news/national/twitter-removes-over-50-posts-on-govt-orders-majority-related-to-covid-19/article34404805.ece),\" published in The Hindu dated April 25, 2021. ### Transparency has taken a hit during the lockdown Over the last month, our efforts at demanding transparency have de-accelerated considerably. This is due to our inability to safely file RTI requests physically. Only the Central Government and certain State Governments have a dedicated online portal for filing RTI requests. For most other State authorities across the country, RTI requests still have to be filed physically. The lack of an online RTI portal creates considerable hurdles to demanding transparency in situations like the current one wherein physical filing has become impossible due to the ongoing pandemic. ### Important Documents 1. Digital Transparency: A Right to Information Report for March, 2021 dated April 6, 2021 ([**link**](https://internetfreedom.in/digital-transparency-a-right-to-information-report-for-march-2021/)) 2. Response received from MeitY’s CPIO pursuant to the CIC hearing on March 25, 2021 dated April 13, 2021 ([**link**](https://twitter.com/internetfreedom/status/1385574459797434371)) 3. Without prejudice: The least the government can do is proactively publish judicial orders for website blocking dated April 21, 2021 ([**link**](https://internetfreedom.in/website-blocking-orders-2021/))",
    "light_cleaned_comments": "Thank you for the work you guys are doing. And take care Thank you, prayers and wishes of health and safety to you, take care :)"
}