{
    "id": "pgv85v",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/pgv85v/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 7,
    "num_comments": 5,
    "created_utc": 1630632618,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "I'm planning to the one chip challenge with my siblings. \n\nhttps://www.amazon.in/dp/B095YMGF94/ref=cm_sw_r_cp_awdb_imm_DNGMNSPKMMPXQVDGFS06\n\nAny ideas about this? Is it worth the experience?",
        "That seems interesting. But hell I am not going to pay 200 bucks for a single chip .",
        "Yeah it's kinda costly but me and my siblings are doing it with a couple of drinks to have fun",
        "Will you upload a vid on ytbe?",
        "I don't have a YouTube channel lol"
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "im planning one chip challenge siblings ideas worth experience seems interesting hell going pay bucks single chip yeah kinda costly siblings couple drinks fun upload vid ytbe dont youtube channel lol",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I'm planning to the one chip challenge with my siblings. Any ideas about this? Is it worth the experience? That seems interesting. But hell I am not going to pay 200 bucks for a single chip . Yeah it's kinda costly but me and my siblings are doing it with a couple of drinks to have fun Will you upload a vid on ytbe? I don't have a YouTube channel lol"
}