{
    "id": "14mtse9",
    "title": "Which indian public figure's death would genuinely make you sad?",
    "url": "https://i.redd.it/ofgff79n049b1.jpg",
    "selftext": "For me it's Sir Ratan Tata. Kills me seeing him age:(",
    "flair": "AskIndia",
    "score": 553,
    "num_comments": 282,
    "created_utc": 1688110979.0,
    "convurl": "https://i.redd.it/ofgff79n049b1.jpg",
    "comments": [
        "https://www.ndtv.com/offbeat/ratan-tatas-shout-out-to-the-people-who-fight-for-our-planet-on-earth-day-2419301/amp/1",
        "That would be grim day",
        "Dr Manmohan Singh",
        "The owner of r/india",
        "puneet superstar",
        "None",
        "It's a trap. Don't jinx it bitches",
        "amitabh bachan",
        "None",
        "Never knew Irrfan khan death will make me sad but it did",
        "Oye, what's all this ashubh ashubh talk?  \n\nIf someone's passing away would genuinely make you sad, it's bad enough to contemplate it leave alone write it down here.",
        "He had so much more to offer:(",
        "Indian kaha hai, NRI nahi",
        "It was irrfan khan and lata mangeshkar for me",
        "None",
        "Manmohan Singh, I had to check if he is infact still alive. He is",
        "johnny sins",
        "Literally no one.",
        "Why are people downvoting?",
        "ModiJi 😔",
        "Ratan Tata modi ji",
        "Mr. Ambatukam",
        "Modi ji",
        "Any death thats not natural",
        "I never ever put status/story for any occasion happy or sad. Irrfan made me do that, and I am still ont over the fact that he has died",
        "I do wish that you hadn't posted Ratan Tata's picture on the thread.",
        "r/india moment",
        "Heh check again",
        "*lord puneet",
        "And Sushant Singh too .",
        "Keep checking every hour.",
        "Emraan Hashmi",
        "MS Dhoni.",
        "Sachin tendulkar",
        "Salman khan",
        "Me too!!",
        "Us bro",
        "Same",
        "I was saddened by the deaths of a few:\n\nA.K. Hangal\n\nKader Khan\n\nRaju Srivastava",
        "panama bhai",
        "70% of comments on this thread alone are people saying 'don't care' & 'no one' and they suddenly care after someone mentions their favourite celebrities. \nIf you really don't care then don't.",
        "Coz he destroyed Kader Khan's career\nEdit :  just because he refused to call him Sir",
        "Arvind Kejriwal.",
        "Lol. That escalated !😆😆",
        "KK’s death got me crying",
        "If there's genuinely proof that rich industrialists have a soul, it's Ratan Tata",
        "Lord bol 😡😡😡\n\nedit:bina /s samjh ny aata logo ki ye sarcastic reply tha",
        "A Telugu actor named Brahmanandam. He made me laugh without fail for over 26 years. Seeing him age makes me very sad.",
        "??",
        " remove the image and just keep the text smh",
        "Sir Abdul Kalam",
        "Emraan Hashmi….uparwala lambi umar de unhe…still",
        "Dr Manmohan singh,\nSonia gandhi,\nPinarayi vijayan,\nSiddaramiah,\nKamal haasan,\nNaseeruddin shah",
        "Ratan tata didn't give a single condolence message when mistry died and he aligned with modi unlike Rahul bajaj - hence my respect for him is dimmed.",
        "No corporate ultra rich for sure.",
        "Only great ratan tata sir",
        "While he does have a strong legacy, i think people don't relate with him on a personal level",
        "None",
        "Sure but why?",
        "Everyone is flawed. You should see the other side too.\n\nAlso we don't know the details of the relations between mistry and tata.",
        "MSD",
        "Viswanathan Anand",
        "Why?",
        "Whoever came up with UPI. Changed the country.",
        "RaGa. He is my only hope for a beautiful India.",
        "Modi ji",
        "Lord*",
        "2. Rahul Dravid",
        "I know the question is for someone from now but I felt sad about Irfan and sushant . Irfan khan literally had  a different legacy which left with him as a void in the industry . even if he was not acting and by chance if I saw a post about him I used to feel genuinely good about him idk he had some real positive vibes.",
        "Outside of the movies he is not that good of a person",
        "+1 his songs were my soul saviour for idk how many years...and all of sudden I felt I would never hear this voice in a new song again",
        "Brij Bhushan /s",
        "Ummmm….sorry to have to break it to you……",
        "why?? dude are you seriously asking why <facepalm>",
        "Death is inevitable. Don't make it a taboo",
        "i heard he recorded his last for tiger 3",
        "Is that sarcasm or do you actually simp for a billionaire?",
        "Mukesh Ambani, my village got decent internet because of Jio, cant thank him enough for this",
        "I seriously don't know bro. Don't mind removing it",
        "Idk it's a really nice picture of him - but acts as a gateway to imaginary sad feels after reading your question.",
        "Me too i am just used to seeing his face",
        "He is already dead",
        "Every death is natural.",
        "None.",
        "well it's just a personal question now . Gonna just mention a few of my favorites Gulzar ,Arijit singh , ARR ,Sonu Nigam , SRK , Aamir khan , Pankaj Tripathi , Nasserudin Shah , Shreya Goshal , Pritam , Sayeed Qadri , Amitabh Bhattacharya , Rajkumar Rao among others",
        "I can share my perspective. It is generally not a great feeling to see an opinion poll for the people who might die and then express the grief of their death even before they are gone. And when you put up a picture of it, it becomes too real too fast.",
        "How do u know?",
        "Amitabh Bachhan",
        "Bruh what an ominous post",
        "I'm still not over August ames death",
        "You should all people stay away from this post 😂",
        "Sachin Tendulkar. Hopefully it won’t happen for a long time. In fact it’s possible I may die before him.",
        "Nandan nilakani ??",
        "Puneet superstar",
        "Did he do it willingly? If so, then he is egotistical. But if Bollywood or the public decided not to work with him or watch his movies, then it's not entirely his fault. In either case, it's perfectly fine for someone to feel upset about the death of their favorite celebrity, especially if they enjoyed their work. No one should be expected to know everything about someone whose films they enjoyed.",
        "i was so sad. never knew that i'd be so affected.",
        "Which was difficult to see/hear in the Radia tapes. Must concede they have great PR though",
        "PM modi jis",
        "Sharam aayi yeh bolte hue ?",
        "Shatavadhani Ganesh, Sudha Murthy, Dr Veerendra Heggade and many more.",
        "My favourite singers:\n\nMahesh Kale, Rahul Deshpande, Devaki Pandit, Asha Khadilkar",
        "Would be Mt vasudevan Nair. Grew up reading his novels. And I don't think No one would dare to even think of making a movie like nirmalyam.",
        "Odisha train accident was not natural ,neither those who are dying in Manipur.\n\nYou don't even know what natural even means",
        "Jethalal",
        "I'm curious.. why do you say so?",
        "I agree that Sir Ratan Tata's death would make me very sad but also of shri Narendra Madi's who is the best prime minister that India has ever had.",
        "Ik people who met him IRL and they gave him bad reviews",
        "Rajinikanth ..",
        "I think he got confused with Puneet Rajkumar.",
        "Hey....Hey Leave the Kid alone.",
        "Forbidden answer. A… ….",
        "Ms Dhoni has 7 letters.",
        "Nora fatehi",
        "True af",
        "Sarcasm ?",
        "Best prime minister in India is always up for debate.",
        "Bad reviews? He acts in movies, he is not a movie.",
        "PM Modi. He emerges at my time and I have observed him change the outlook of my country. From is Desh ka kuch nhi ho sakta to proud of my country and culture, not just words like we always say, but truly feeling proud. But i like him more because of his spiritual side , his past of travelling across the country, his connection with nature etc inspires me a lot to live a minimalist life, be mindful of our nature, helping and being good to others.",
        "Kk",
        "AJIT DOBHAL STILL ALIVE \nWE ARE BLESSED",
        "Your answer, by definition, is wrong as the post mentions public figure",
        "Thala for a reason",
        "Very fee people recognise his efforts towards the country,he literally saved the country from becoming present day sri lanka in 1991",
        "But you know what i mean the people ik didn't excatly have a positive experience meeting him and then got treated like shit by him for no apparent reason and one of them was a doctor that he came to",
        "none,",
        "Modi ji, I will miss 2ab",
        "Idk how I would react to this ..",
        "And you are really dumb if you don't know Nandan Nilekani",
        "NRI? more like NRP",
        "Could be",
        "Same here . It really hit me hard",
        "It would make me sad as well if he dies 🥲",
        "Ruskin Bond, even though his stories would live on forever",
        "Nope. He is a very compassionate leader. I like that quality more than anything else in a leader.",
        "1) M S Swaminathan. He is the father of the green revolution in India.\n\n2) Kapil Dev, Amarnath & Gavaskar. I read Sunny Days and Straight Drive when I was a teen. \n\n3) I M Vijayan. I really enjoyed his skills.\n\n4) Naseeruddin Shah, Raghubir Yadav, Pankaj Kapur",
        "amitabh bachchan  yaar",
        "😂😂😂",
        "Dr. APJ Abdul Kalam  and Atal Bihari Vajpayee ji's death genuinely made me sad. I was in school back then.",
        "Ah one of my fav authors from childhood. Simple and captivating stories.",
        "There's an influx of people asking questions similar to quora here.",
        "Username checks out",
        "If anyone listed here dies soon, I'm gonna blame you all for it.",
        "Would it change your mind if I told you that tatas donate in the BJP campaign electoral bonds.",
        "Can you please elaborate how",
        "He made acting look so easy and beautiful, isn't it mate?!",
        "😂 Arey bhai",
        "I don’t know about soul. But he definitely has better PR team.",
        "Google \"LPG 1991\"",
        "Never took any position in a state or centre govt so we don't know what to expect only presidency of a political party (lost the home seat of amethi)",
        "Shut up man! Why would you even say such cursed things!",
        "Comedians generally are not so friendly in real life same as Kapil Sharma",
        "Do you not understand anything besides Entertainment?",
        "I hope you get sad very soon!",
        "Mr Ratan Tata..",
        "hum sab ka 2ab, Modiji.",
        "Read it many years ago about villagers being killed or displaced and left for dead by many industrialists. Tata was among those, all these charity work maybe just his guilt consuming him or something. I could be wrong but I am sure I read it in reputed news.",
        "Already happened. KK.\n\nAnother would be Rajinikanth. I like Kamal Haasan more than him. But his death would absolutely tear me apart and I know it.",
        "Beti bech...",
        "Wtf why?",
        "A r rahman",
        "Probably, MSD",
        "Bro, I will cry if something happens to him. Working for him is every engineer's dream.",
        "He was the architect of economic reforms of 1992",
        "Death is sad enough . But , Sachin Tendulkar I guess.",
        "Sending gold to imf to get foreign exchange and 1991 liberalisation \n(Nowadays liberal word is considered anti national anti hindu liberandu etc) lol",
        "Ruskin Bond\nGulzar Saab\n(Talking in terms of age)",
        "This is my answer, not a Congress supporter but I really respect Dr. Singh",
        "I can name, but political environment is not good",
        "aye vediya",
        "I thought he died long ago",
        "Narendra Modi",
        "None. Definitely not any arabpati.",
        "True, people eventually die by suicide, \"naturally\"",
        "Ah yes. For Sure 😒",
        "Chhota Fanta",
        "Ilayaraja.",
        "SLB or Rajamouli",
        "Reading this makes me sad .",
        "Prof Amartya Sen, Economist \n\nProf Romila Thapar, Historian\n\nDr MS Swaminathan, Father of Green Revolution\n\nDr GG Parikh Freedom, Fighter and Socialist leader\n\nSacchidanand Sinha, Freedom Fighter and Socialist writer\n\nFali Nariman, Senior Advocate\n\nto name a few",
        "Mota bhai",
        "**A. P. J. Abdul Kalam**\n\nIt's still sad that he is not here anymore",
        "1991",
        "Msd",
        "Very few people reliaze that those reforms we're literally forced down our throat.\nIMF forced us to open up our markets in exchange of loans. He didn't do anything extraordinary, just what was needed.\n\nI'm always surprised, why no one asks why was it needed in the first for an economy as big as India. India started as the 6th largest economy in 1947 and became almost bankrupt in 1991, why and how?",
        "Yes, it's Ratan Tatas. Every time I see his picture on social media I fear the worst.",
        "James corden",
        "Indian Economy ko modifive karane waale Babaji👳🏻‍♂️",
        "The most underrated politician of india😬",
        "Because it was a closed economy dumbo",
        "Why do you think that's gonna change my mind?",
        "Modiji",
        "Again no source but he did stop a lot of comedians from coming up.",
        "Why was it closed? Who asked to close dumbass?",
        "None just my family members who actually care about me.most most celebraties don't even know I exist so I don't really think there is any point in being sad since they won't even know when I die",
        "Thalapotty?",
        "My mind read it Mt. Vesuvius Nair for some reasons.",
        "Shah Rukh Khan",
        "Neha tomar, bless that pretty girl",
        "Ratan Tata is no saint.",
        "Why tho?",
        "Modi",
        "Amartya Sen",
        "We were eating dirt while every damn country  below us was developing. Our policies until 1991 were shambolic. Lack of LPG as they teach in schools.",
        "Pooja bhatt death would make me really sad",
        "The new India.",
        "He died for our sins. ✝️",
        "Ironically MS is a disease.",
        "Not better, may be the best among this nation's industrialists. It has fascinated me for over a decade now.",
        "I know that. I'm questioning the person praising MMS.",
        "Samantha, she's already dying  💀😭",
        "Recent passing of Gordon Lightfoot made me sad...",
        "What about conan?",
        "AR Rahman fosho :(",
        "After the post the clock started ticking at double speed",
        "Lmao, what's the source, is it like those aajtak news telling about that micro chip in notes? 😭💀",
        "Jada YouTube mat dekha kar..tata ke bata.",
        "Wasn't straight drive written by Dilip Vengsarkar? The ones I read growing up in the Hindu were written by Dilip.",
        "You actually think indian news channel would talk about this? Plus I said reputed.",
        "And Rahul Modi",
        "Sachin",
        "\"India started as the 6th largest economy in 1947\"! Source? WhatsApp?",
        "Modiji 😢\n\nBecause he needs to face justice in this life",
        "Bro don't idolise anyone. He is after all a business man. There are many allegations on him and has reportedly done malpractices. You must not fall for his pr team show on Facebook and linkedin",
        "Woh tax evading, spineless sarkari ghada wala tendulkar?",
        "Oh shit! Linkedin lunatics reached reddit",
        "Same here buddy!",
        "What a shit post is this",
        "Bro has Asperger's, literally asking the same question to everyone.",
        "John Abraham, A R Rahman, Sonu Nigam, Johnny Lever",
        "Idk when ratan tata will do something for me that makes me feel like he's my papa figure like so many people do, but I am ready and waiting.",
        "/r/hailcorporate",
        "That's brutal, thank god that no political it cell uses reddit otherwise you'll probably get arrested",
        "Advani … Because I can’t see him insulted by Modi anymore",
        "a lot of reasons, most prominent being us sidelining with soviet. Even though we always tried to maintain neutral stance, there was not much choice but to sideline with them. That meant rejecting capitalism.",
        "Do look up raadia tapes. No billionaire becomes a billionaire or grows their wealth by being a nice person.",
        "Ashwini Vaishnaw, he's the only educated union minister we have, and sensible too.",
        "Lord puneet💔",
        "That was not the reason. Nehru was just stupid choosing socialism over capitalism.",
        "Are people not part of nature? Humans are not something different, separate from nature, we ARE nature. Everything we do is natural. We are a focal point where nature becomes conscious of itself.",
        "Do you?",
        "Beti",
        "Dr Manmohan Singh, he is the reason I am so privileged.",
        "Rotten has gotten away with a lot of stufff on his plate. Naxal ties, the bad stuff in Radia tapes, support to Modi in 2007 which was key in making Modi a national figure. Adani to aise hi badnaam hai",
        "Dont tell this on linkedin.",
        "Wait till they add transaction charges on all UPI transactions. It's a scam.\n\nNever let go of cash.",
        "They definitely do. The anonymity saves us all",
        "So true, vishy’s the goat",
        "Jay khujli tay Ganna Khujare\n\n&#x200B;\n\nnext IAC will be launched from jail by handsome and Sattu bhai",
        "Probably",
        "Man that's rough. Btw I totally agree.",
        "It's not so black and white. Mysore State for example sponsored and built a lot of state run factories/enterprises/research centers in the early through mid 20th century. That early investment is why karnakata is today a national leader in IT, biotech, aerospace, etc. Because even by the 70s we had the experience and skillset to have HAL, BEL, Texas instruments etc.\n\nGovt backed industry has its place in helping an early stage country develop. The eceonomy actually grew quite fast under nehru.\n\nWhere we really failed was the 70s onwards. Protectionist policies became beauracratic hell. Govt ballooned and so did inefficiency. And ultimately India, especially south India was ready to open up to the world. But also remember the global economic condition was garbage at that point. Stagflation had wrecked the western economies. Nobody would've come to invest in India because no investment was happening anywhere.\n\nThus India really should've pivoted in the 80s to an open economy. But Indian govt is slow af and not innovative so they had to wait till 90s and bankruptcy to be forced to change.",
        "Mammootty",
        "is that a pretentious reference",
        "Oh for fucks sake. His PR has reached here too",
        "Ajit Doval",
        "Absolutely correct. His death will also open a huge issue with succession of Tata group",
        "India and many countries have been to IMF many times. IMF is not some genius organisation. They have also ruined many economies.",
        "Yes I feel u",
        "Yikes. 😂 He's a legendary writer in malayalam.",
        "Because we didn't want another british-like invasion. British came as traders and conquered the nation. We didn't want that happening again, so we closed the economy.",
        "That's like saying Shebaz Sharif (or whatever that clown's name is) saved Pakistan for opening up the economy in 2023. Dr MMS is being wrongly credited for something he had no control OVER.",
        "Bebakoof ho?",
        "Op works in his PR team",
        "It's weird how much we love him, his acting and his overall presence on screen and yet after his passing away it's so damn hard watching him onscreen..",
        "Why.",
        "SRK all the way! And era of legends will be gone when he dies!",
        "Nobody is saint",
        "Manmohan Singh",
        "phir big boss main giyan kon batega 😂",
        "Even KK's death made me so sad",
        "Dude, I said I’ll be sad. Didn’t say I’ll be happy",
        "Paresh Rawal sir and Amitabh sir",
        "Apj kalam sir's death and second was sidhutai sapkal.\n\nAmongst the ones alive i think ratan tata or mukesh ambani are close ones.",
        "Real statistics. \n\nIndians were still poor, but we were the 6th largest in 1947 due to the sheer workforce. Had we tried to leverage that position from then or at the very least focused on primary education, we wouldn't have been where we were in 1991."
    ],
    "cleaned_text": "indian public figures death would genuinely make sad sir ratan tata kills seeing age ",
    "cleaned_title": "indian public figures death would genuinely make sad",
    "cleaned_selftext": "sir ratan tata kills seeing age",
    "cleaned_comments": "would grim day dr manmohan singh owner rindia puneet superstar none trap dont jinx bitches amitabh bachan none never knew irrfan khan death make sad oye whats ashubh ashubh talk someones passing away would genuinely make sad bad enough contemplate leave alone write much offer indian kaha hai nri nahi irrfan khan lata mangeshkar none manmohan singh check infact still alive johnny sins literally one people downvoting modiji ratan tata modi ji mr ambatukam modi ji death thats natural never ever put statusstory occasion happy sad irrfan made still ont fact died wish hadnt posted ratan tatas picture thread rindia moment heh check lord puneet sushant singh keep checking every hour emraan hashmi ms dhoni sachin tendulkar salman khan us bro saddened deaths ak hangal kader khan raju srivastava panama bhai comments thread alone people saying dont care one suddenly care someone mentions favourite celebrities really dont care dont coz destroyed kader khans career edit refused call sir arvind kejriwal lol escalated kks death got crying theres genuinely proof rich industrialists soul ratan tata lord bol editbina samjh ny aata logo ki ye sarcastic reply tha telugu actor named brahmanandam made laugh without fail years seeing age makes sad remove image keep text smh sir abdul kalam emraan hashmiuparwala lambi umar de unhestill dr manmohan singh sonia gandhi pinarayi vijayan siddaramiah kamal haasan naseeruddin shah ratan tata didnt give single condolence message mistry died aligned modi unlike rahul bajaj hence respect dimmed corporate ultra rich sure great ratan tata sir strong legacy think people dont relate personal level none sure everyone flawed see side also dont know details relations mistry tata msd viswanathan anand whoever came upi changed country raga hope beautiful india modi ji lord rahul dravid know question someone felt sad irfan sushant irfan khan literally different legacy left void industry even acting chance saw post used feel genuinely good idk real positive vibes outside movies good person songs soul saviour idk many yearsand sudden felt would never hear voice new song brij bhushan ummmmsorry break dude seriously asking facepalm death inevitable dont make taboo heard recorded last tiger sarcasm actually simp billionaire mukesh ambani village got decent internet jio cant thank enough seriously dont know bro dont mind removing idk really nice picture acts gateway imaginary sad feels reading question used seeing face already dead every death natural none well personal question gon na mention favorites gulzar arijit singh arr sonu nigam srk aamir khan pankaj tripathi nasserudin shah shreya goshal pritam sayeed qadri amitabh bhattacharya rajkumar rao among others share perspective generally great feeling see opinion poll people might die express grief death even gone put picture becomes real fast u know amitabh bachhan bruh ominous post im still august ames death people stay away post sachin tendulkar hopefully wont happen long time fact possible may die nandan nilakani puneet superstar willingly egotistical bollywood public decided work watch movies entirely fault either case perfectly fine someone feel upset death favorite celebrity especially enjoyed work one expected know everything someone whose films enjoyed sad never knew id affected difficult seehear radia tapes must concede great pr though pm modi jis sharam aayi yeh bolte hue shatavadhani ganesh sudha murthy dr veerendra heggade many favourite singers mahesh kale rahul deshpande devaki pandit asha khadilkar would mt vasudevan nair grew reading novels dont think one would dare even think making movie like nirmalyam odisha train accident natural neither dying manipur dont even know natural even means jethalal im curious say agree sir ratan tatas death would make sad also shri narendra madis best prime minister india ever ik people met irl gave bad reviews rajinikanth think got confused puneet rajkumar heyhey leave kid alone forbidden answer ms dhoni letters nora fatehi true af sarcasm best prime minister india always debate bad reviews acts movies movie pm modi emerges time observed change outlook country desh ka kuch nhi ho sakta proud country culture words like always say truly feeling proud like spiritual side past travelling across country connection nature etc inspires lot live minimalist life mindful nature helping good others kk ajit dobhal still alive blessed answer definition wrong post mentions public figure thala reason fee people recognise efforts towards countryhe literally saved country becoming present day sri lanka know mean people ik didnt excatly positive experience meeting got treated like shit apparent reason one doctor came none modi ji miss ab idk would react really dumb dont know nandan nilekani nri like nrp could really hit hard would make sad well dies ruskin bond even though stories would live forever nope compassionate leader like quality anything else leader swaminathan father green revolution india kapil dev amarnath gavaskar read sunny days straight drive teen vijayan really enjoyed skills naseeruddin shah raghubir yadav pankaj kapur amitabh bachchan yaar dr apj abdul kalam atal bihari vajpayee jis death genuinely made sad school back ah one fav authors childhood simple captivating stories theres influx people asking questions similar quora username checks anyone listed dies soon im gon na blame would change mind told tatas donate bjp campaign electoral bonds please elaborate made acting look easy beautiful isnt mate arey bhai dont know soul definitely better pr team google lpg never took position state centre govt dont know expect presidency political party lost home seat amethi shut man would even say cursed things comedians generally friendly real life kapil sharma understand anything besides entertainment hope get sad soon mr ratan tata hum sab ka ab modiji read many years ago villagers killed displaced left dead many industrialists tata among charity work maybe guilt consuming something could wrong sure read reputed news already happened kk another would rajinikanth like kamal haasan death would absolutely tear apart know beti bech wtf r rahman probably msd bro cry something happens working every engineers dream architect economic reforms death sad enough sachin tendulkar guess sending gold imf get foreign exchange liberalisation nowadays liberal word considered anti national anti hindu liberandu etc lol ruskin bond gulzar saab talking terms age answer congress supporter really respect dr singh name political environment good aye vediya thought died long ago narendra modi none definitely arabpati true people eventually die suicide naturally ah yes sure chhota fanta ilayaraja slb rajamouli reading makes sad prof amartya sen economist prof romila thapar historian dr ms swaminathan father green revolution dr gg parikh freedom fighter socialist leader sacchidanand sinha freedom fighter socialist writer fali nariman senior advocate name mota bhai p j abdul kalam still sad anymore msd people reliaze reforms literally forced throat imf forced us open markets exchange loans didnt anything extraordinary needed im always surprised one asks needed first economy big india india started th largest economy became almost bankrupt yes ratan tatas every time see picture social media fear worst james corden indian economy ko modifive karane waale babaji underrated politician india closed economy dumbo think thats gon na change mind modiji source stop lot comedians coming closed asked close dumbass none family members actually care memost celebraties dont even know exist dont really think point sad since wont even know die thalapotty mind read mt vesuvius nair reasons shah rukh khan neha tomar bless pretty girl ratan tata saint tho modi amartya sen eating dirt every damn country us developing policies shambolic lack lpg teach schools pooja bhatt death would make really sad new india died sins ironically ms disease better may best among nations industrialists fascinated decade know im questioning person praising mms samantha shes already dying recent passing gordon lightfoot made sad conan ar rahman fosho post clock started ticking double speed lmao whats source like aajtak news telling micro chip notes jada youtube mat dekha kartata ke bata wasnt straight drive written dilip vengsarkar ones read growing hindu written dilip actually think indian news channel would talk plus said reputed rahul modi sachin india started th largest economy source whatsapp modiji needs face justice life bro dont idolise anyone business man many allegations reportedly done malpractices must fall pr team show facebook linkedin woh tax evading spineless sarkari ghada wala tendulkar oh shit linkedin lunatics reached reddit buddy shit post bro aspergers literally asking question everyone john abraham r rahman sonu nigam johnny lever idk ratan tata something makes feel like hes papa figure like many people ready waiting rhailcorporate thats brutal thank god political cell uses reddit otherwise youll probably get arrested advani cant see insulted modi anymore lot reasons prominent us sidelining soviet even though always tried maintain neutral stance much choice sideline meant rejecting capitalism look raadia tapes billionaire becomes billionaire grows wealth nice person ashwini vaishnaw hes educated union minister sensible lord puneet reason nehru stupid choosing socialism capitalism people part nature humans something different separate nature nature everything natural focal point nature becomes conscious beti dr manmohan singh reason privileged rotten gotten away lot stufff plate naxal ties bad stuff radia tapes support modi key making modi national figure adani aise hi badnaam hai dont tell linkedin wait till add transaction charges upi transactions scam never let go cash definitely anonymity saves us true vishys goat jay khujli tay ganna khujare xb next iac launched jail handsome sattu bhai probably man thats rough btw totally agree black white mysore state example sponsored built lot state run factoriesenterprisesresearch centers early mid th century early investment karnakata today national leader biotech aerospace etc even experience skillset hal bel texas instruments etc govt backed industry place helping early stage country develop eceonomy actually grew quite fast nehru really failed onwards protectionist policies became beauracratic hell govt ballooned inefficiency ultimately india especially south india ready open world also remember global economic condition garbage point stagflation wrecked western economies nobody wouldve come invest india investment happening anywhere thus india really shouldve pivoted open economy indian govt slow af innovative wait till bankruptcy forced change mammootty pretentious reference oh fucks sake pr reached ajit doval absolutely correct death also open huge issue succession tata group india many countries imf many times imf genius organisation also ruined many economies yes feel u yikes hes legendary writer malayalam didnt want another britishlike invasion british came traders conquered nation didnt want happening closed economy thats like saying shebaz sharif whatever clowns name saved pakistan opening economy dr mms wrongly credited something control bebakoof ho op works pr team weird much love acting overall presence screen yet passing away damn hard watching onscreen srk way era legends gone dies nobody saint manmohan singh phir big boss main giyan kon batega even kks death made sad dude said ill sad didnt say ill happy paresh rawal sir amitabh sir apj kalam sirs death second sidhutai sapkal amongst ones alive think ratan tata mukesh ambani close ones real statistics indians still poor th largest due sheer workforce tried leverage position least focused primary education wouldnt",
    "light_cleaned_title": "Which indian public figure's death would genuinely make you sad?",
    "light_cleaned_selftext": "For me it's Sir Ratan Tata. Kills me seeing him age:(",
    "light_cleaned_comments": "That would be grim day Dr Manmohan Singh The owner of r/india puneet superstar None It's a trap. Don't jinx it bitches amitabh bachan None Never knew Irrfan khan death will make me sad but it did Oye, what's all this ashubh ashubh talk? If someone's passing away would genuinely make you sad, it's bad enough to contemplate it leave alone write it down here. He had so much more to offer:( Indian kaha hai, NRI nahi It was irrfan khan and lata mangeshkar for me None Manmohan Singh, I had to check if he is infact still alive. He is johnny sins Literally no one. Why are people downvoting? ModiJi 😔 Ratan Tata modi ji Mr. Ambatukam Modi ji Any death thats not natural I never ever put status/story for any occasion happy or sad. Irrfan made me do that, and I am still ont over the fact that he has died I do wish that you hadn't posted Ratan Tata's picture on the thread. r/india moment Heh check again *lord puneet And Sushant Singh too . Keep checking every hour. Emraan Hashmi MS Dhoni. Sachin tendulkar Salman khan Me too!! Us bro Same I was saddened by the deaths of a few: A.K. Hangal Kader Khan Raju Srivastava panama bhai 70% of comments on this thread alone are people saying 'don't care' & 'no one' and they suddenly care after someone mentions their favourite celebrities. If you really don't care then don't. Coz he destroyed Kader Khan's career Edit : just because he refused to call him Sir Arvind Kejriwal. Lol. That escalated !😆😆 KK’s death got me crying If there's genuinely proof that rich industrialists have a soul, it's Ratan Tata Lord bol 😡😡😡 edit:bina /s samjh ny aata logo ki ye sarcastic reply tha A Telugu actor named Brahmanandam. He made me laugh without fail for over 26 years. Seeing him age makes me very sad. ?? remove the image and just keep the text smh Sir Abdul Kalam Emraan Hashmi….uparwala lambi umar de unhe…still Dr Manmohan singh, Sonia gandhi, Pinarayi vijayan, Siddaramiah, Kamal haasan, Naseeruddin shah Ratan tata didn't give a single condolence message when mistry died and he aligned with modi unlike Rahul bajaj - hence my respect for him is dimmed. No corporate ultra rich for sure. Only great ratan tata sir While he does have a strong legacy, i think people don't relate with him on a personal level None Sure but why? Everyone is flawed. You should see the other side too. Also we don't know the details of the relations between mistry and tata. MSD Viswanathan Anand Why? Whoever came up with UPI. Changed the country. RaGa. He is my only hope for a beautiful India. Modi ji Lord* 2. Rahul Dravid I know the question is for someone from now but I felt sad about Irfan and sushant . Irfan khan literally had a different legacy which left with him as a void in the industry . even if he was not acting and by chance if I saw a post about him I used to feel genuinely good about him idk he had some real positive vibes. Outside of the movies he is not that good of a person +1 his songs were my soul saviour for idk how many years...and all of sudden I felt I would never hear this voice in a new song again Brij Bhushan /s Ummmm….sorry to have to break it to you…… why?? dude are you seriously asking why <facepalm> Death is inevitable. Don't make it a taboo i heard he recorded his last for tiger 3 Is that sarcasm or do you actually simp for a billionaire? Mukesh Ambani, my village got decent internet because of Jio, cant thank him enough for this I seriously don't know bro. Don't mind removing it Idk it's a really nice picture of him - but acts as a gateway to imaginary sad feels after reading your question. Me too i am just used to seeing his face He is already dead Every death is natural. None. well it's just a personal question now . Gonna just mention a few of my favorites Gulzar ,Arijit singh , ARR ,Sonu Nigam , SRK , Aamir khan , Pankaj Tripathi , Nasserudin Shah , Shreya Goshal , Pritam , Sayeed Qadri , Amitabh Bhattacharya , Rajkumar Rao among others I can share my perspective. It is generally not a great feeling to see an opinion poll for the people who might die and then express the grief of their death even before they are gone. And when you put up a picture of it, it becomes too real too fast. How do u know? Amitabh Bachhan Bruh what an ominous post I'm still not over August ames death You should all people stay away from this post 😂 Sachin Tendulkar. Hopefully it won’t happen for a long time. In fact it’s possible I may die before him. Nandan nilakani ?? Puneet superstar Did he do it willingly? If so, then he is egotistical. But if Bollywood or the public decided not to work with him or watch his movies, then it's not entirely his fault. In either case, it's perfectly fine for someone to feel upset about the death of their favorite celebrity, especially if they enjoyed their work. No one should be expected to know everything about someone whose films they enjoyed. i was so sad. never knew that i'd be so affected. Which was difficult to see/hear in the Radia tapes. Must concede they have great PR though PM modi jis Sharam aayi yeh bolte hue ? Shatavadhani Ganesh, Sudha Murthy, Dr Veerendra Heggade and many more. My favourite singers: Mahesh Kale, Rahul Deshpande, Devaki Pandit, Asha Khadilkar Would be Mt vasudevan Nair. Grew up reading his novels. And I don't think No one would dare to even think of making a movie like nirmalyam. Odisha train accident was not natural ,neither those who are dying in Manipur. You don't even know what natural even means Jethalal I'm curious.. why do you say so? I agree that Sir Ratan Tata's death would make me very sad but also of shri Narendra Madi's who is the best prime minister that India has ever had. Ik people who met him IRL and they gave him bad reviews Rajinikanth .. I think he got confused with Puneet Rajkumar. Hey....Hey Leave the Kid alone. Forbidden answer. A… …. Ms Dhoni has 7 letters. Nora fatehi True af Sarcasm ? Best prime minister in India is always up for debate. Bad reviews? He acts in movies, he is not a movie. PM Modi. He emerges at my time and I have observed him change the outlook of my country. From is Desh ka kuch nhi ho sakta to proud of my country and culture, not just words like we always say, but truly feeling proud. But i like him more because of his spiritual side , his past of travelling across the country, his connection with nature etc inspires me a lot to live a minimalist life, be mindful of our nature, helping and being good to others. Kk AJIT DOBHAL STILL ALIVE WE ARE BLESSED Your answer, by definition, is wrong as the post mentions public figure Thala for a reason Very fee people recognise his efforts towards the country,he literally saved the country from becoming present day sri lanka in 1991 But you know what i mean the people ik didn't excatly have a positive experience meeting him and then got treated like shit by him for no apparent reason and one of them was a doctor that he came to none, Modi ji, I will miss 2ab Idk how I would react to this .. And you are really dumb if you don't know Nandan Nilekani NRI? more like NRP Could be Same here . It really hit me hard It would make me sad as well if he dies 🥲 Ruskin Bond, even though his stories would live on forever Nope. He is a very compassionate leader. I like that quality more than anything else in a leader. 1) M S Swaminathan. He is the father of the green revolution in India. 2) Kapil Dev, Amarnath & Gavaskar. I read Sunny Days and Straight Drive when I was a teen. 3) I M Vijayan. I really enjoyed his skills. 4) Naseeruddin Shah, Raghubir Yadav, Pankaj Kapur amitabh bachchan yaar 😂😂😂 Dr. APJ Abdul Kalam and Atal Bihari Vajpayee ji's death genuinely made me sad. I was in school back then. Ah one of my fav authors from childhood. Simple and captivating stories. There's an influx of people asking questions similar to quora here. Username checks out If anyone listed here dies soon, I'm gonna blame you all for it. Would it change your mind if I told you that tatas donate in the BJP campaign electoral bonds. Can you please elaborate how He made acting look so easy and beautiful, isn't it mate?! 😂 Arey bhai I don’t know about soul. But he definitely has better PR team. Google \"LPG 1991\" Never took any position in a state or centre govt so we don't know what to expect only presidency of a political party (lost the home seat of amethi) Shut up man! Why would you even say such cursed things! Comedians generally are not so friendly in real life same as Kapil Sharma Do you not understand anything besides Entertainment? I hope you get sad very soon! Mr Ratan Tata.. hum sab ka 2ab, Modiji. Read it many years ago about villagers being killed or displaced and left for dead by many industrialists. Tata was among those, all these charity work maybe just his guilt consuming him or something. I could be wrong but I am sure I read it in reputed news. Already happened. KK. Another would be Rajinikanth. I like Kamal Haasan more than him. But his death would absolutely tear me apart and I know it. Beti bech... Wtf why? A r rahman Probably, MSD Bro, I will cry if something happens to him. Working for him is every engineer's dream. He was the architect of economic reforms of 1992 Death is sad enough . But , Sachin Tendulkar I guess. Sending gold to imf to get foreign exchange and 1991 liberalisation (Nowadays liberal word is considered anti national anti hindu liberandu etc) lol Ruskin Bond Gulzar Saab (Talking in terms of age) This is my answer, not a Congress supporter but I really respect Dr. Singh I can name, but political environment is not good aye vediya I thought he died long ago Narendra Modi None. Definitely not any arabpati. True, people eventually die by suicide, \"naturally\" Ah yes. For Sure 😒 Chhota Fanta Ilayaraja. SLB or Rajamouli Reading this makes me sad . Prof Amartya Sen, Economist Prof Romila Thapar, Historian Dr MS Swaminathan, Father of Green Revolution Dr GG Parikh Freedom, Fighter and Socialist leader Sacchidanand Sinha, Freedom Fighter and Socialist writer Fali Nariman, Senior Advocate to name a few Mota bhai **A. P. J. Abdul Kalam** It's still sad that he is not here anymore 1991 Msd Very few people reliaze that those reforms we're literally forced down our throat. IMF forced us to open up our markets in exchange of loans. He didn't do anything extraordinary, just what was needed. I'm always surprised, why no one asks why was it needed in the first for an economy as big as India. India started as the 6th largest economy in 1947 and became almost bankrupt in 1991, why and how? Yes, it's Ratan Tatas. Every time I see his picture on social media I fear the worst. James corden Indian Economy ko modifive karane waale Babaji👳🏻‍♂️ The most underrated politician of india😬 Because it was a closed economy dumbo Why do you think that's gonna change my mind? Modiji Again no source but he did stop a lot of comedians from coming up. Why was it closed? Who asked to close dumbass? None just my family members who actually care about me.most most celebraties don't even know I exist so I don't really think there is any point in being sad since they won't even know when I die Thalapotty? My mind read it Mt. Vesuvius Nair for some reasons. Shah Rukh Khan Neha tomar, bless that pretty girl Ratan Tata is no saint. Why tho? Modi Amartya Sen We were eating dirt while every damn country below us was developing. Our policies until 1991 were shambolic. Lack of LPG as they teach in schools. Pooja bhatt death would make me really sad The new India. He died for our sins. ✝️ Ironically MS is a disease. Not better, may be the best among this nation's industrialists. It has fascinated me for over a decade now. I know that. I'm questioning the person praising MMS. Samantha, she's already dying 💀😭 Recent passing of Gordon Lightfoot made me sad... What about conan? AR Rahman fosho :( After the post the clock started ticking at double speed Lmao, what's the source, is it like those aajtak news telling about that micro chip in notes? 😭💀 Jada YouTube mat dekha kar..tata ke bata. Wasn't straight drive written by Dilip Vengsarkar? The ones I read growing up in the Hindu were written by Dilip. You actually think indian news channel would talk about this? Plus I said reputed. And Rahul Modi Sachin \"India started as the 6th largest economy in 1947\"! Source? WhatsApp? Modiji 😢 Because he needs to face justice in this life Bro don't idolise anyone. He is after all a business man. There are many allegations on him and has reportedly done malpractices. You must not fall for his pr team show on Facebook and linkedin Woh tax evading, spineless sarkari ghada wala tendulkar? Oh shit! Linkedin lunatics reached reddit Same here buddy! What a shit post is this Bro has Asperger's, literally asking the same question to everyone. John Abraham, A R Rahman, Sonu Nigam, Johnny Lever Idk when ratan tata will do something for me that makes me feel like he's my papa figure like so many people do, but I am ready and waiting. /r/hailcorporate That's brutal, thank god that no political it cell uses reddit otherwise you'll probably get arrested Advani … Because I can’t see him insulted by Modi anymore a lot of reasons, most prominent being us sidelining with soviet. Even though we always tried to maintain neutral stance, there was not much choice but to sideline with them. That meant rejecting capitalism. Do look up raadia tapes. No billionaire becomes a billionaire or grows their wealth by being a nice person. Ashwini Vaishnaw, he's the only educated union minister we have, and sensible too. Lord puneet💔 That was not the reason. Nehru was just stupid choosing socialism over capitalism. Are people not part of nature? Humans are not something different, separate from nature, we ARE nature. Everything we do is natural. We are a focal point where nature becomes conscious of itself. Do you? Beti Dr Manmohan Singh, he is the reason I am so privileged. Rotten has gotten away with a lot of stufff on his plate. Naxal ties, the bad stuff in Radia tapes, support to Modi in 2007 which was key in making Modi a national figure. Adani to aise hi badnaam hai Dont tell this on linkedin. Wait till they add transaction charges on all UPI transactions. It's a scam. Never let go of cash. They definitely do. The anonymity saves us all So true, vishy’s the goat Jay khujli tay Ganna Khujare &#x200B; next IAC will be launched from jail by handsome and Sattu bhai Probably Man that's rough. Btw I totally agree. It's not so black and white. Mysore State for example sponsored and built a lot of state run factories/enterprises/research centers in the early through mid 20th century. That early investment is why karnakata is today a national leader in IT, biotech, aerospace, etc. Because even by the 70s we had the experience and skillset to have HAL, BEL, Texas instruments etc. Govt backed industry has its place in helping an early stage country develop. The eceonomy actually grew quite fast under nehru. Where we really failed was the 70s onwards. Protectionist policies became beauracratic hell. Govt ballooned and so did inefficiency. And ultimately India, especially south India was ready to open up to the world. But also remember the global economic condition was garbage at that point. Stagflation had wrecked the western economies. Nobody would've come to invest in India because no investment was happening anywhere. Thus India really should've pivoted in the 80s to an open economy. But Indian govt is slow af and not innovative so they had to wait till 90s and bankruptcy to be forced to change. Mammootty is that a pretentious reference Oh for fucks sake. His PR has reached here too Ajit Doval Absolutely correct. His death will also open a huge issue with succession of Tata group India and many countries have been to IMF many times. IMF is not some genius organisation. They have also ruined many economies. Yes I feel u Yikes. 😂 He's a legendary writer in malayalam. Because we didn't want another british-like invasion. British came as traders and conquered the nation. We didn't want that happening again, so we closed the economy. That's like saying Shebaz Sharif (or whatever that clown's name is) saved Pakistan for opening up the economy in 2023. Dr MMS is being wrongly credited for something he had no control OVER. Bebakoof ho? Op works in his PR team It's weird how much we love him, his acting and his overall presence on screen and yet after his passing away it's so damn hard watching him onscreen.. Why. SRK all the way! And era of legends will be gone when he dies! Nobody is saint Manmohan Singh phir big boss main giyan kon batega 😂 Even KK's death made me so sad Dude, I said I’ll be sad. Didn’t say I’ll be happy Paresh Rawal sir and Amitabh sir Apj kalam sir's death and second was sidhutai sapkal. Amongst the ones alive i think ratan tata or mukesh ambani are close ones. Real statistics. Indians were still poor, but we were the 6th largest in 1947 due to the sheer workforce. Had we tried to leverage that position from then or at the very least focused on primary education, we wouldn't have been where we were in 1991."
}