{
    "id": "15td83k",
    "title": "Men Will Be Men Ad - Thoughts?",
    "url": "https://open.substack.com/pub/womanifesto/p/men-will-be-men?utm_source=share&utm_medium=android&r=jlp91",
    "selftext": "https://open.substack.com/pub/womanifesto/p/men-will-be-men\n\nMy take on this iconic yet problematic ad series. Supporting or opposing POVs welcome.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1692247881.0,
    "convurl": "https://external-preview.redd.it/8lKUl9WubrurtgjqqgDtJlOIhEFina70n2KVww0kA6s.jpg?auto=webp&s=0c437dabf5fa37d17d84ac664a4930292bb1efb4",
    "comments": [
        "This kind of adds are a weapon to fake feminists who go on ranting men are trash and this will be useful for them to tarnish us ,as we want nothing but peace.\n\ndear fake feminists please leave us, we want peace, due to you people my dead ass is feared to give a compliment to ladies who look gorgeous in saree.",
        "https://preview.redd.it/cf27oxxpsnib1.jpeg?width=850&format=pjpg&auto=webp&s=fc7c501bbd137aa4ba4744120783da9015424f42",
        "This is wrong on so many levels but I won't deny that it did make me laugh.",
        "There is nothing in those ads thats objectionable. They are in good taste and grounded to reality."
    ],
    "cleaned_text": "men men ad thoughts take iconic yet problematic ad series supporting opposing povs welcome ",
    "cleaned_title": "men men ad thoughts",
    "cleaned_selftext": "take iconic yet problematic ad series supporting opposing povs welcome",
    "cleaned_comments": "kind adds weapon fake feminists go ranting men trash useful tarnish us want nothing peace dear fake feminists please leave us want peace due people dead ass feared give compliment ladies look gorgeous saree wrong many levels wont deny make laugh nothing ads thats objectionable good taste grounded reality",
    "light_cleaned_title": "Men Will Be Men Ad - Thoughts?",
    "light_cleaned_selftext": "My take on this iconic yet problematic ad series. Supporting or opposing POVs welcome.",
    "light_cleaned_comments": "This kind of adds are a weapon to fake feminists who go on ranting men are trash and this will be useful for them to tarnish us ,as we want nothing but peace. dear fake feminists please leave us, we want peace, due to you people my dead ass is feared to give a compliment to ladies who look gorgeous in saree. This is wrong on so many levels but I won't deny that it did make me laugh. There is nothing in those ads thats objectionable. They are in good taste and grounded to reality."
}