{
    "id": "1cjwueh",
    "title": "Canada police charge three with murder of Sikh leader Nijjar, probe India link",
    "url": "https://www.reuters.com/world/americas/canadian-police-have-made-arrests-case-killing-sikh-leader-nijjar-says-cbc-2024-05-03/",
    "selftext": "> The Royal Canadian Mounted Police named the three men as Karanpreet Singh, 28, Kamalpreet Singh, 22 and Karan Brar, 22.",
    "flair": "Crime",
    "score": 10,
    "num_comments": 6,
    "created_utc": 1714816974,
    "convurl": "https://external-preview.redd.it/MSnHtAoc09_U2qj4SIARrETRwpL9ewj-Zear737n4wQ.jpg?auto=webp&s=fe46b40271aad19034fcf394cef8475f2cd435c8",
    "comments": [
        "RAW's North American operations have been shut down.",
        "[this article has some more detail.](https://www.cbc.ca/news/politics/nijjar-killing-arrests-made-1.7192807?s=08) Not sure what to make of the situation tbh. They were on student visas living in Canada for the past five years. They’re also suspected of being involved in another murder case.\n\nCould be that Indian intelligence services paid them to kill him, or could be that they had issues of their own with him.",
        "Canadian press needs to makeup their minds, was nijjar an activist? was he a leader? Was a khalistani for sure. And there is no doubt he was a terrorist.",
        "ant bhala to sab bhala.",
        "Operation was successful."
    ],
    "cleaned_text": "canada police charge three murder sikh leader nijjar probe india link royal canadian mounted police named three men karanpreet singh kamalpreet singh karan brar ",
    "cleaned_title": "canada police charge three murder sikh leader nijjar probe india link",
    "cleaned_selftext": "royal canadian mounted police named three men karanpreet singh kamalpreet singh karan brar",
    "cleaned_comments": "raws north american operations shut article detailhttpswwwcbccanewspoliticsnijjarkillingarrestsmades sure make situation tbh student visas living canada past five years theyre also suspected involved another murder case could indian intelligence services paid kill could issues canadian press needs makeup minds nijjar activist leader khalistani sure doubt terrorist ant bhala sab bhala operation successful",
    "light_cleaned_title": "Canada police charge three with murder of Sikh leader Nijjar, probe India link",
    "light_cleaned_selftext": "> The Royal Canadian Mounted Police named the three men as Karanpreet Singh, 28, Kamalpreet Singh, 22 and Karan Brar, 22.",
    "light_cleaned_comments": "RAW's North American operations have been shut down. [this article has some more detail.](https://www.cbc.ca/news/politics/nijjar-killing-arrests-made-1.7192807?s=08) Not sure what to make of the situation tbh. They were on student visas living in Canada for the past five years. They’re also suspected of being involved in another murder case. Could be that Indian intelligence services paid them to kill him, or could be that they had issues of their own with him. Canadian press needs to makeup their minds, was nijjar an activist? was he a leader? Was a khalistani for sure. And there is no doubt he was a terrorist. ant bhala to sab bhala. Operation was successful."
}