{
    "id": "1fwoi6x",
    "title": "India has a unique opportunity to lead in AI",
    "url": "https://www.economist.com/asia/2024/10/03/india-has-a-unique-opportunity-to-lead-in-ai",
    "selftext": "I've heard a lot of hype about \"AI\" lately, and this makes me curious. \n\nFor people working in the govt/industry, how much can it help in solving governance issues? We've heard plenty about India's digital stack , can it be applied to other areas of governance as well? How realistic of a change will we see in this regard, if any?",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 13,
    "created_utc": 1728128666.0,
    "convurl": "https://external-preview.redd.it/XdClJduFk7BDJwaRmJQWIgGvWIXR3a4qp8ukFSs4Mq0.jpg?auto=webp&s=19942ede5f0622d495178ef65f5731b16afa2008",
    "comments": [
        "Dekh liya na vishwa guru banke, ab ye bhi kar lete hai..",
        "They say same thing every time, during 5g , electric vehicles, telecom, biotech, but India never ever succeeded in grabbing the opportunity. We are simply not in a position. ",
        "Leading the AI, we are not even in the race.",
        "We will be the first country that will build an AI that can be bribed.",
        "This and what has digital hype done to improve daily lives? Ya for sure private companies are harvesting data and spamming people with SMS n WhatsApp messages. \nI suppose with AI you mean llm. I can’t think how govt can do much with it. We can’t even manage sewage in India and footpaths are distant dream. \nBtw other aspects of statistics, regression, machine learning, et al has been there for over a decade. I don’t know of many meaningful leverage. Heck I guess even metro rails don’t support card swipe.",
        "We say this and then end up in the support & service part of it.\n\nAnd then just boast how we lead in tech.",
        ">We can’t even manage sewage in India and footpaths are distant dream\n\nI don't want to add anything more on it !",
        "Pfft. Leading in AI....? Nice Joke.\n\nI do believe India can benefit the most from AI because of its diversity in language and culture. But, where are actual useful Indian AI models?\n\nPeople have no idea about current state of AI in the World and China. China is churning out new AI models like every month which rivals Meta's Llama models. Most of these model are open weight and open source models.\n\nIndia is not even in the race at this point.",
        "AI is capital intensive, who has the kind of money that magnificent 7 have in India?",
        "> AI could also help in areas such as education and health. One study in 2022 found that less than half of Indian students in year five could read at the level of year two. The health-care system, too, is in dire shape. Cheap, mass-scale personalised tutors could start tackling the crisis in learning. Systems that help in interpreting lab results, assist in diagnoses, or take on administrative work could free up doctors to see more patients. The sclerotic justice system could be sped up by automating some of the procedural tasks that take up as much as half of judges’ time. \n\nAll these are outcomes of poor cultural values -- lack of ethics, lack of professionalism, fatalism, casteism, elitism. Many other countries addressed them long before AI or even tech were available, either because they had better cultural values to begin with or managed to evolve themselves.\n\nThese ivory tower solutions to bypass culture are very familiar to me as a long-time sw guy and were equally attractive too once. But after getting into humanitarian subjects, I understood that technology can't bypass bad culture but instead bad culture hijacks technology to embed itself even wider and deeper. This is especially true if the implementors of such technology are technocratic defenders of bad culture like Nilekani and Raghavan who don't have any good understanding of the interplay between culture and technology.",
        "> AI could also help in areas such as education and health. One study in 2022 found that less than half of Indian students in year five could read at the level of year two. The health-care system, too, is in dire shape. Cheap, mass-scale personalised tutors could start tackling the crisis in learning. Systems that help in interpreting lab results, assist in diagnoses, or take on administrative work could free up doctors to see more patients. The sclerotic justice system could be sped up by automating some of the procedural tasks that take up as much as half of judges’ time. \n\nAll these are outcomes of poor cultural values -- lack of ethics, lack of professionalism, fatalism, casteism, elitism. Many other countries addressed them long before AI or even tech were available, either because they had better cultural values to begin with or managed to evolve themselves.\n\nThese ivory tower solutions to bypass culture are very familiar to me as a long-time sw guy and were equally attractive too once. But after getting into humanitarian subjects, I understood that technology can't bypass bad culture but instead bad culture hijacks technology to embed itself even wider and deeper. This is especially true if the implementors of such technology are technocratic defenders of bad culture like Nilekani and Raghavan who don't have any good understanding of the interplay between culture and technology.",
        "Software was an exception. All other industries and opportunities need good government.  Frankly bjp is wasting time",
        "As much as the government wants to solve it.",
        "Pakistan has a better chance of leading the world in the number of openly gay army generals.",
        "Some indian consultant on linkedin came up with a brand new equation called E = mc^2 + AI, so I think we are making a ton of new advances in AI!",
        "What about 2AB race? /s"
    ],
    "cleaned_text": "india unique opportunity lead ai ive heard lot hype ai lately makes curious people working govtindustry much help solving governance issues weve heard plenty indias digital stack applied areas governance well realistic change see regard ",
    "cleaned_title": "india unique opportunity lead ai",
    "cleaned_selftext": "ive heard lot hype ai lately makes curious people working govtindustry much help solving governance issues weve heard plenty indias digital stack applied areas governance well realistic change see regard",
    "cleaned_comments": "dekh liya na vishwa guru banke ab ye bhi kar lete hai say thing every time g electric vehicles telecom biotech india never ever succeeded grabbing opportunity simply position leading ai even race first country build ai bribed digital hype done improve daily lives ya sure private companies harvesting data spamming people sms n whatsapp messages suppose ai mean llm cant think govt much cant even manage sewage india footpaths distant dream btw aspects statistics regression machine learning et al decade dont know many meaningful leverage heck guess even metro rails dont support card swipe say end support service part boast lead tech cant even manage sewage india footpaths distant dream dont want add anything pfft leading ai nice joke believe india benefit ai diversity language culture actual useful indian ai models people idea current state ai world china china churning new ai models like every month rivals metas llama models model open weight open source models india even race point ai capital intensive kind money magnificent india ai could also help areas education health one study found less half indian students year five could read level year two healthcare system dire shape cheap massscale personalised tutors could start tackling crisis learning systems help interpreting lab results assist diagnoses take administrative work could free doctors see patients sclerotic justice system could sped automating procedural tasks take much half judges time outcomes poor cultural values lack ethics lack professionalism fatalism casteism elitism many countries addressed long ai even tech available either better cultural values begin managed evolve ivory tower solutions bypass culture familiar longtime sw guy equally attractive getting humanitarian subjects understood technology cant bypass bad culture instead bad culture hijacks technology embed even wider deeper especially true implementors technology technocratic defenders bad culture like nilekani raghavan dont good understanding interplay culture technology ai could also help areas education health one study found less half indian students year five could read level year two healthcare system dire shape cheap massscale personalised tutors could start tackling crisis learning systems help interpreting lab results assist diagnoses take administrative work could free doctors see patients sclerotic justice system could sped automating procedural tasks take much half judges time outcomes poor cultural values lack ethics lack professionalism fatalism casteism elitism many countries addressed long ai even tech available either better cultural values begin managed evolve ivory tower solutions bypass culture familiar longtime sw guy equally attractive getting humanitarian subjects understood technology cant bypass bad culture instead bad culture hijacks technology embed even wider deeper especially true implementors technology technocratic defenders bad culture like nilekani raghavan dont good understanding interplay culture technology software exception industries opportunities need good government frankly bjp wasting time much government wants solve pakistan better chance leading world number openly gay army generals indian consultant linkedin came brand new equation called e mc ai think making ton new advances ai ab race",
    "light_cleaned_title": "India has a unique opportunity to lead in AI",
    "light_cleaned_selftext": "I've heard a lot of hype about \"AI\" lately, and this makes me curious. For people working in the govt/industry, how much can it help in solving governance issues? We've heard plenty about India's digital stack , can it be applied to other areas of governance as well? How realistic of a change will we see in this regard, if any?",
    "light_cleaned_comments": "Dekh liya na vishwa guru banke, ab ye bhi kar lete hai.. They say same thing every time, during 5g , electric vehicles, telecom, biotech, but India never ever succeeded in grabbing the opportunity. We are simply not in a position. Leading the AI, we are not even in the race. We will be the first country that will build an AI that can be bribed. This and what has digital hype done to improve daily lives? Ya for sure private companies are harvesting data and spamming people with SMS n WhatsApp messages. I suppose with AI you mean llm. I can’t think how govt can do much with it. We can’t even manage sewage in India and footpaths are distant dream. Btw other aspects of statistics, regression, machine learning, et al has been there for over a decade. I don’t know of many meaningful leverage. Heck I guess even metro rails don’t support card swipe. We say this and then end up in the support & service part of it. And then just boast how we lead in tech. >We can’t even manage sewage in India and footpaths are distant dream I don't want to add anything more on it ! Pfft. Leading in AI....? Nice Joke. I do believe India can benefit the most from AI because of its diversity in language and culture. But, where are actual useful Indian AI models? People have no idea about current state of AI in the World and China. China is churning out new AI models like every month which rivals Meta's Llama models. Most of these model are open weight and open source models. India is not even in the race at this point. AI is capital intensive, who has the kind of money that magnificent 7 have in India? > AI could also help in areas such as education and health. One study in 2022 found that less than half of Indian students in year five could read at the level of year two. The health-care system, too, is in dire shape. Cheap, mass-scale personalised tutors could start tackling the crisis in learning. Systems that help in interpreting lab results, assist in diagnoses, or take on administrative work could free up doctors to see more patients. The sclerotic justice system could be sped up by automating some of the procedural tasks that take up as much as half of judges’ time. All these are outcomes of poor cultural values -- lack of ethics, lack of professionalism, fatalism, casteism, elitism. Many other countries addressed them long before AI or even tech were available, either because they had better cultural values to begin with or managed to evolve themselves. These ivory tower solutions to bypass culture are very familiar to me as a long-time sw guy and were equally attractive too once. But after getting into humanitarian subjects, I understood that technology can't bypass bad culture but instead bad culture hijacks technology to embed itself even wider and deeper. This is especially true if the implementors of such technology are technocratic defenders of bad culture like Nilekani and Raghavan who don't have any good understanding of the interplay between culture and technology. > AI could also help in areas such as education and health. One study in 2022 found that less than half of Indian students in year five could read at the level of year two. The health-care system, too, is in dire shape. Cheap, mass-scale personalised tutors could start tackling the crisis in learning. Systems that help in interpreting lab results, assist in diagnoses, or take on administrative work could free up doctors to see more patients. The sclerotic justice system could be sped up by automating some of the procedural tasks that take up as much as half of judges’ time. All these are outcomes of poor cultural values -- lack of ethics, lack of professionalism, fatalism, casteism, elitism. Many other countries addressed them long before AI or even tech were available, either because they had better cultural values to begin with or managed to evolve themselves. These ivory tower solutions to bypass culture are very familiar to me as a long-time sw guy and were equally attractive too once. But after getting into humanitarian subjects, I understood that technology can't bypass bad culture but instead bad culture hijacks technology to embed itself even wider and deeper. This is especially true if the implementors of such technology are technocratic defenders of bad culture like Nilekani and Raghavan who don't have any good understanding of the interplay between culture and technology. Software was an exception. All other industries and opportunities need good government. Frankly bjp is wasting time As much as the government wants to solve it. Pakistan has a better chance of leading the world in the number of openly gay army generals. Some indian consultant on linkedin came up with a brand new equation called E = mc^2 + AI, so I think we are making a ton of new advances in AI! What about 2AB race? /s"
}