{
    "id": "157bm2s",
    "title": "Cases pending in courts cross 5-crore mark: Govt in Rajya Sabha",
    "url": "https://m.economictimes.com/news/india/cases-pending-in-courts-cross-5-crore-mark-govt-in-rajya-sabha/articleshow/101993830.cms",
    "selftext": "70,000 cases in Supreme Court. Justice delayed is justice denied.\n\nGo to any court and a huge majority just keeps getting date after date. People with money use the courts and probably bribes from top to bottom to delay their cases for the most trivial reasons. There is huge corruption in courts.\n\nAnd then talk about the quality of hearings and how the judges deliver justice. Unless one can afford a Rs. 1 Crore per hearing lawyer in Supreme Court, one cannot even claim to have faith in the justice system.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690109036.0,
    "convurl": "https://external-preview.redd.it/fucrSl4evPxFplJmpD-MV8mbG9Q81wmRpB6D1iTlPCk.jpg?auto=webp&s=14196d439c18e111cca3ac32e7f719ae7307fc44",
    "comments": [
        "On average, each Supreme Court Judge has 2000 cases pending (max 34 Supreme Court judges and 70,000 pending cases).\n\nAssuming no new cases, each Judge will take 5 years and 6 months to clear their plate.\n\nNow most cases there are more than one judge involved in hearings. So assume 2 judges per case, we get 11 years to just clear the current load.\n\nThis is a never ending cycle"
    ],
    "cleaned_text": "cases pending courts cross crore mark govt rajya sabha cases supreme court justice delayed justice denied go court huge majority keeps getting date date people money use courts probably bribes top bottom delay cases trivial reasons huge corruption courts talk quality hearings judges deliver justice unless one afford rs crore per hearing lawyer supreme court one even claim faith justice system ",
    "cleaned_title": "cases pending courts cross crore mark govt rajya sabha",
    "cleaned_selftext": "cases supreme court justice delayed justice denied go court huge majority keeps getting date date people money use courts probably bribes top bottom delay cases trivial reasons huge corruption courts talk quality hearings judges deliver justice unless one afford rs crore per hearing lawyer supreme court one even claim faith justice system",
    "cleaned_comments": "average supreme court judge cases pending max supreme court judges pending cases assuming new cases judge take years months clear plate cases one judge involved hearings assume judges per case get years clear current load never ending cycle",
    "light_cleaned_title": "Cases pending in courts cross 5-crore mark: Govt in Rajya Sabha",
    "light_cleaned_selftext": "70,000 cases in Supreme Court. Justice delayed is justice denied. Go to any court and a huge majority just keeps getting date after date. People with money use the courts and probably bribes from top to bottom to delay their cases for the most trivial reasons. There is huge corruption in courts. And then talk about the quality of hearings and how the judges deliver justice. Unless one can afford a Rs. 1 Crore per hearing lawyer in Supreme Court, one cannot even claim to have faith in the justice system.",
    "light_cleaned_comments": "On average, each Supreme Court Judge has 2000 cases pending (max 34 Supreme Court judges and 70,000 pending cases). Assuming no new cases, each Judge will take 5 years and 6 months to clear their plate. Now most cases there are more than one judge involved in hearings. So assume 2 judges per case, we get 11 years to just clear the current load. This is a never ending cycle"
}