{
    "id": "1c23afe",
    "title": "Growth rate of most Indian states in the last 10 years almost reduced to half",
    "url": "https://www.reddit.com/gallery/1c23afe",
    "selftext": "Thriving under Congress, now most Indian states are suffering under BJP\n\nVote accordingly",
    "flair": "Policy/Economy",
    "score": 164,
    "num_comments": 84,
    "created_utc": 1712907718,
    "convurl": "https://i.redd.it/qjuca2i260uc1.png",
    "comments": [
        "Not it is clear that Manmohan >>  Modi",
        "Wtf was Sikkim smoking back then? ",
        "Poor  access to birth control +child marriage, maybe.",
        "Yes!!!\nLet's blame it on the people. Again.",
        "How does that explain the highest per capita growth rate?",
        "Sorry, my bad. I read population growth.",
        "Ache din 🤡",
        "bruh people should not believe any stats on reddit close to election. comparing growth rate to a covid year will always seem smaller smh.",
        "The thing with numbers is you can always manipulated it if you dont provide context. Two important points you are missing here:\n1) 2 years of COVID with almost zero growth skews the numbers\n2) The growth curve is almost always concave in nature! Meaning if your GDP is say 100, its easier to grow at a faster rate (say 10%) and jump to 110. Whereas if the GDP is already high (say 200), its difficult to grow at 10% and jump to 220",
        "Yes,but cant vote congress again because manmohan will not comeback",
        "Are you 24*7 active on reddit.",
        "Bring manmohan or equivalent, will vote",
        "A party is a party. Just like Apple is Apple with out without Steve Jobs.",
        "can we compare 2008 reccession with covid????",
        "Without him,it is only remember for its A-Z scams and corruption",
        "Fake stat",
        "Many of the scams were totally fake—a creation of ex-CAG head Vinod Rai.\n\nCAG oversteps it's boundaries. Even in the so called 2G scam and so called colgate it's reports were defective and indirectly alleged a scam when there was none.\n\n**Colgate:** There was a huge quantum leap of exaggeration by Vinod Rai of CAG during UPA. For example, he ignored that the coal mines allocated had coal buried deep and using the extraction value of Coal India (which has legacy coal mines with coal on the surface and of better quality) to estimate a notional benefit was outright stupid. No money trail was every found.\n\n**2G:** The Supreme Court ruled that the 2G case was baseless. As per the judgement, \"**Some people created a scam by artfully arranging a few selected facts and exaggerating things beyond recognition to astronomical levels**.\"\n\n**Vinod Rai:** Why Vinod Rai did this is anybody's guess. Was he a right-wing empathiser, or was he incentivised? Interestingly, the BJP gave Vinod Rai a post-retirement position and also gave him a Padma Vibhushan.",
        "Well it's clearly manipulated data.\n\nRBI is a bank.\n\nAll banks are controlled by Jews.\n\nGeorge Soros is a Jew.\n\nGeorge Soros is behind this data.\n\nCheckmate, libtards /s",
        "Source has been given. You can check the sources and confirm yourself. \n\nAlso, 2008 recession happened (not as much physical or deadly damage as COVID but financial hit was there).\n\nAlso should we factor in the fact that oil prices were down in 2014 onwards for some time. So helped Modi, no? Lower costs of living and production, etc.\n\nThe point is, there are many internal and external factors that affect all the governments. It's on the government to be pro active or react properly.\n\nPlus, Modi had a better team, no?",
        "I don't think recession is as comparable as to the entire country shutting down for a year",
        "Vo Congress IT cell se hai... He ought to be 24*7 to counter BJP IT cell",
        "These data will always be skewed considering the time difference and baseline absolute numbers, this is the same as india having a growth rate of 6% is better than china having a growth rate of 4",
        "That main point is\n\n\"Modi ji ne 28 28 ghante kaam kiye hai every day for last 10 saal, 0 leaves in the last 10 years\" \n\nDon't focus on the end results",
        "Yes, he has worked tirelessly, going from country to country, so that he can bring pegasus and monitor each and every individual he deems as danger to his authoritarian power.",
        "Disagree with your growth curve argument. We are at the bottom of the curve. Our growth rate shouldn’t be this slow. China was growing at double digits when they were this poor.",
        "Bjp bhakths are so unemployed that party simping is the only source of income for them",
        "Ya 0 leaves while getting muft vacation and seeing the best places in the world in a private jet on txpayers money and extortion money",
        "Now explain why things were terrible for years before covid. ",
        "Is there any base rate fallacy here?",
        "This weren’t terrible at all. 2019 was the only year where the gdp dropped low. Besides that and covid year we’ve had above 6.5% pretty much every year and crossed 7% since the pandemic year. We’re mostly likely going to cross 7% again next year as well.",
        "Japan, SK and Taiwan too...",
        "Quite the opposite. 2008 recession was good for lower income countries since it hastened the shift for manufacturing. Look at China's growth which shot up between 2008-2012.  \n\n\nYou can see growth slowdown mildly in 08 and then shoot up in 2009-12.  The biggest loser were countries with large credit dependence and financial institutions. India's banks had not loaded up on bad debt and bonds like those in the developed world. \n\n\nIn The COVID19 pandemic, countries with high import or export dependence, such as china or countries with large informal sectors or with bad debt were the hardest hit. This includes India. One of the main reasons why India's growth has accelerated is that COVID in itself was a form of austerity for large businesses with bloated balance sheets. If you couldn't clean up, you would die.",
        "Half of the Congress has the left for greener pastures or the BJP. ",
        "Am I missing something or is this data not even saying anything about WHAT is growing? First I thought it was about population, but it just says \"growth rate of state (per capita)\", nothing about population, GDP or anything. Thinking about data manipualtion it could just be anything.",
        "Lmfao. Every single year after notebandi was a disaster. You may choose to forget, but it's clearly seen in the data. ",
        "What? Do you just expect the people to believe everything my guy?",
        "do you remember something known as COVID 19 or are you too lost in your congress bhakti",
        "Golgappa queen",
        "Please inform me of the gdp data then? Let me know what the gdp growth percentages in 2021,22,and 23 are and the projected growth rates for 24.",
        "Why do you not want to talk about 17-20 period?",
        "Let's go thru all the years. 14-15 was 7.41, next year 8, 8.26, 6.8, 6.45, 3.87, -5.83, 9.05, 7.24, 7.32. \n\nSo yeah sorry but there were only 2 years that classify as terrible. With one of them being a disastrous covid year. Let's not cherry pick literally 2 years when we have a decades worth of data and pretend like we're geniuses alright?",
        "Fucking shit, so you’re telling me that people of Uttarakhand had a 9% per capita growth in the congress regime. Wow.",
        "Mfw \"10 years ago\" and there's Telangana in the map",
        "You are missing something.\n\n\nIt's written 'Per Capita NSDP(Constant Prices) at right bottom of the description.",
        "Me when im in a misinformation spreading competition and my opponent is IndiaInPixels",
        "RBI data is also fake now?",
        "Do you remember 2008-09 global market crash or are just another andh bhakt?",
        "Have you even visited the industrial hubs in Uttarakhand, built during that time?",
        "RBI is misinformation that's why people don't trust their inflation numbers nowadays",
        "Wah wah wah. 2008 recession was good? I mean wtf and 2009-12 recovery must have also happened because of Modiji?",
        "Only if your last name is Adani or Ambani",
        "Logic left India in 2014. Surprised to see r/India overpowered by Andh Bhakts.",
        ">6.8, 6.45, 3.87\n\n\nThese three years were before covid, and this was a massive decline after a robust economy inherited from upa started booming when the crude oil prices went down. In this period, the world economy was booming, and the crude oil prices were low. Yet,  self goals of notebandi and terrible gst implementation brought the growth down. And the numbers are overestimates, since informal economy is assumed to be as big as formal economy and the formal economy numbers are extrapolated to entire economy, but we know notebandi affected informal economy way more than it affected formal economy.",
        "Nope, recently moved here. My grandparents lived here.",
        "do you remember the fact that India is an economy which is very internally dependent specially during 2008 and was not as affected by the global market crash as it was when everything was shutdown in the country due to the pandemic or are you not able to remove your eyes from Rahul Baba",
        "Buddy the “robust” economy that bjp adopted in the 3 years prior to bjp coming into power there were growth rates of 5.24, 5.47, and 6.39. If anything the gdp growth bursted up initially in the bjp years before going down to the mid 6’s and then had 2 bad years before recovering back to the low 7’s.",
        "Where's 2 years of covid ? Only 1 year"
    ],
    "cleaned_text": "growth rate indian states last years almost reduced half thriving congress indian states suffering bjp vote accordingly ",
    "cleaned_title": "growth rate indian states last years almost reduced half",
    "cleaned_selftext": "thriving congress indian states suffering bjp vote accordingly",
    "cleaned_comments": "clear manmohan modi wtf sikkim smoking back poor access birth control child marriage maybe yes lets blame people explain highest per capita growth rate sorry bad read population growth ache din bruh people believe stats reddit close election comparing growth rate covid year always seem smaller smh thing numbers always manipulated dont provide context two important points missing years covid almost zero growth skews numbers growth curve almost always concave nature meaning gdp say easier grow faster rate say jump whereas gdp already high say difficult grow jump yesbut cant vote congress manmohan comeback active reddit bring manmohan equivalent vote party party like apple apple without steve jobs compare reccession covid without himit remember az scams corruption fake stat many scams totally fakea creation excag head vinod rai cag oversteps boundaries even called g scam called colgate reports defective indirectly alleged scam none colgate huge quantum leap exaggeration vinod rai cag upa example ignored coal mines allocated coal buried deep using extraction value coal india legacy coal mines coal surface better quality estimate notional benefit outright stupid money trail every found g supreme court ruled g case baseless per judgement people created scam artfully arranging selected facts exaggerating things beyond recognition astronomical levels vinod rai vinod rai anybodys guess rightwing empathiser incentivised interestingly bjp gave vinod rai postretirement position also gave padma vibhushan well clearly manipulated data rbi bank banks controlled jews george soros jew george soros behind data checkmate libtards source given check sources confirm also recession happened much physical deadly damage covid financial hit also factor fact oil prices onwards time helped modi lower costs living production etc point many internal external factors affect governments government pro active react properly plus modi better team dont think recession comparable entire country shutting year vo congress cell se hai ought counter bjp cell data always skewed considering time difference baseline absolute numbers india growth rate better china growth rate main point modi ji ne ghante kaam kiye hai every day last saal leaves last years dont focus end results yes worked tirelessly going country country bring pegasus monitor every individual deems danger authoritarian power disagree growth curve argument bottom curve growth rate shouldnt slow china growing double digits poor bjp bhakths unemployed party simping source income ya leaves getting muft vacation seeing best places world private jet txpayers money extortion money explain things terrible years covid base rate fallacy werent terrible year gdp dropped low besides covid year weve pretty much every year crossed since pandemic year mostly likely going cross next year well japan sk taiwan quite opposite recession good lower income countries since hastened shift manufacturing look chinas growth shot see growth slowdown mildly shoot biggest loser countries large credit dependence financial institutions indias banks loaded bad debt bonds like developed world covid pandemic countries high import export dependence china countries large informal sectors bad debt hardest hit includes india one main reasons indias growth accelerated covid form austerity large businesses bloated balance sheets couldnt clean would die half congress left greener pastures bjp missing something data even saying anything growing first thought population says growth rate state per capita nothing population gdp anything thinking data manipualtion could anything lmfao every single year notebandi disaster may choose forget clearly seen data expect people believe everything guy remember something known covid lost congress bhakti golgappa queen please inform gdp data let know gdp growth percentages projected growth rates want talk period lets go thru years next year yeah sorry years classify terrible one disastrous covid year lets cherry pick literally years decades worth data pretend like geniuses alright fucking shit youre telling people uttarakhand per capita growth congress regime wow mfw years ago theres telangana map missing something written per capita nsdpconstant prices right bottom description im misinformation spreading competition opponent indiainpixels rbi data also fake remember global market crash another andh bhakt even visited industrial hubs uttarakhand built time rbi misinformation thats people dont trust inflation numbers nowadays wah wah wah recession good mean wtf recovery must also happened modiji last name adani ambani logic left india surprised see rindia overpowered andh bhakts three years covid massive decline robust economy inherited upa started booming crude oil prices went period world economy booming crude oil prices low yet self goals notebandi terrible gst implementation brought growth numbers overestimates since informal economy assumed big formal economy formal economy numbers extrapolated entire economy know notebandi affected informal economy way affected formal economy nope recently moved grandparents lived remember fact india economy internally dependent specially affected global market crash everything shutdown country due pandemic able remove eyes rahul baba buddy robust economy bjp adopted years prior bjp coming power growth rates anything gdp growth bursted initially bjp years going mid bad years recovering back low wheres years covid year",
    "light_cleaned_title": "Growth rate of most Indian states in the last 10 years almost reduced to half",
    "light_cleaned_selftext": "Thriving under Congress, now most Indian states are suffering under BJP Vote accordingly",
    "light_cleaned_comments": "Not it is clear that Manmohan >> Modi Wtf was Sikkim smoking back then? Poor access to birth control +child marriage, maybe. Yes!!! Let's blame it on the people. Again. How does that explain the highest per capita growth rate? Sorry, my bad. I read population growth. Ache din 🤡 bruh people should not believe any stats on reddit close to election. comparing growth rate to a covid year will always seem smaller smh. The thing with numbers is you can always manipulated it if you dont provide context. Two important points you are missing here: 1) 2 years of COVID with almost zero growth skews the numbers 2) The growth curve is almost always concave in nature! Meaning if your GDP is say 100, its easier to grow at a faster rate (say 10%) and jump to 110. Whereas if the GDP is already high (say 200), its difficult to grow at 10% and jump to 220 Yes,but cant vote congress again because manmohan will not comeback Are you 24*7 active on reddit. Bring manmohan or equivalent, will vote A party is a party. Just like Apple is Apple with out without Steve Jobs. can we compare 2008 reccession with covid???? Without him,it is only remember for its A-Z scams and corruption Fake stat Many of the scams were totally fake—a creation of ex-CAG head Vinod Rai. CAG oversteps it's boundaries. Even in the so called 2G scam and so called colgate it's reports were defective and indirectly alleged a scam when there was none. **Colgate:** There was a huge quantum leap of exaggeration by Vinod Rai of CAG during UPA. For example, he ignored that the coal mines allocated had coal buried deep and using the extraction value of Coal India (which has legacy coal mines with coal on the surface and of better quality) to estimate a notional benefit was outright stupid. No money trail was every found. **2G:** The Supreme Court ruled that the 2G case was baseless. As per the judgement, \"**Some people created a scam by artfully arranging a few selected facts and exaggerating things beyond recognition to astronomical levels**.\" **Vinod Rai:** Why Vinod Rai did this is anybody's guess. Was he a right-wing empathiser, or was he incentivised? Interestingly, the BJP gave Vinod Rai a post-retirement position and also gave him a Padma Vibhushan. Well it's clearly manipulated data. RBI is a bank. All banks are controlled by Jews. George Soros is a Jew. George Soros is behind this data. Checkmate, libtards /s Source has been given. You can check the sources and confirm yourself. Also, 2008 recession happened (not as much physical or deadly damage as COVID but financial hit was there). Also should we factor in the fact that oil prices were down in 2014 onwards for some time. So helped Modi, no? Lower costs of living and production, etc. The point is, there are many internal and external factors that affect all the governments. It's on the government to be pro active or react properly. Plus, Modi had a better team, no? I don't think recession is as comparable as to the entire country shutting down for a year Vo Congress IT cell se hai... He ought to be 24*7 to counter BJP IT cell These data will always be skewed considering the time difference and baseline absolute numbers, this is the same as india having a growth rate of 6% is better than china having a growth rate of 4 That main point is \"Modi ji ne 28 28 ghante kaam kiye hai every day for last 10 saal, 0 leaves in the last 10 years\" Don't focus on the end results Yes, he has worked tirelessly, going from country to country, so that he can bring pegasus and monitor each and every individual he deems as danger to his authoritarian power. Disagree with your growth curve argument. We are at the bottom of the curve. Our growth rate shouldn’t be this slow. China was growing at double digits when they were this poor. Bjp bhakths are so unemployed that party simping is the only source of income for them Ya 0 leaves while getting muft vacation and seeing the best places in the world in a private jet on txpayers money and extortion money Now explain why things were terrible for years before covid. Is there any base rate fallacy here? This weren’t terrible at all. 2019 was the only year where the gdp dropped low. Besides that and covid year we’ve had above 6.5% pretty much every year and crossed 7% since the pandemic year. We’re mostly likely going to cross 7% again next year as well. Japan, SK and Taiwan too... Quite the opposite. 2008 recession was good for lower income countries since it hastened the shift for manufacturing. Look at China's growth which shot up between 2008-2012. You can see growth slowdown mildly in 08 and then shoot up in 2009-12. The biggest loser were countries with large credit dependence and financial institutions. India's banks had not loaded up on bad debt and bonds like those in the developed world. In The COVID19 pandemic, countries with high import or export dependence, such as china or countries with large informal sectors or with bad debt were the hardest hit. This includes India. One of the main reasons why India's growth has accelerated is that COVID in itself was a form of austerity for large businesses with bloated balance sheets. If you couldn't clean up, you would die. Half of the Congress has the left for greener pastures or the BJP. Am I missing something or is this data not even saying anything about WHAT is growing? First I thought it was about population, but it just says \"growth rate of state (per capita)\", nothing about population, GDP or anything. Thinking about data manipualtion it could just be anything. Lmfao. Every single year after notebandi was a disaster. You may choose to forget, but it's clearly seen in the data. What? Do you just expect the people to believe everything my guy? do you remember something known as COVID 19 or are you too lost in your congress bhakti Golgappa queen Please inform me of the gdp data then? Let me know what the gdp growth percentages in 2021,22,and 23 are and the projected growth rates for 24. Why do you not want to talk about 17-20 period? Let's go thru all the years. 14-15 was 7.41, next year 8, 8.26, 6.8, 6.45, 3.87, -5.83, 9.05, 7.24, 7.32. So yeah sorry but there were only 2 years that classify as terrible. With one of them being a disastrous covid year. Let's not cherry pick literally 2 years when we have a decades worth of data and pretend like we're geniuses alright? Fucking shit, so you’re telling me that people of Uttarakhand had a 9% per capita growth in the congress regime. Wow. Mfw \"10 years ago\" and there's Telangana in the map You are missing something. It's written 'Per Capita NSDP(Constant Prices) at right bottom of the description. Me when im in a misinformation spreading competition and my opponent is IndiaInPixels RBI data is also fake now? Do you remember 2008-09 global market crash or are just another andh bhakt? Have you even visited the industrial hubs in Uttarakhand, built during that time? RBI is misinformation that's why people don't trust their inflation numbers nowadays Wah wah wah. 2008 recession was good? I mean wtf and 2009-12 recovery must have also happened because of Modiji? Only if your last name is Adani or Ambani Logic left India in 2014. Surprised to see r/India overpowered by Andh Bhakts. >6.8, 6.45, 3.87 These three years were before covid, and this was a massive decline after a robust economy inherited from upa started booming when the crude oil prices went down. In this period, the world economy was booming, and the crude oil prices were low. Yet, self goals of notebandi and terrible gst implementation brought the growth down. And the numbers are overestimates, since informal economy is assumed to be as big as formal economy and the formal economy numbers are extrapolated to entire economy, but we know notebandi affected informal economy way more than it affected formal economy. Nope, recently moved here. My grandparents lived here. do you remember the fact that India is an economy which is very internally dependent specially during 2008 and was not as affected by the global market crash as it was when everything was shutdown in the country due to the pandemic or are you not able to remove your eyes from Rahul Baba Buddy the “robust” economy that bjp adopted in the 3 years prior to bjp coming into power there were growth rates of 5.24, 5.47, and 6.39. If anything the gdp growth bursted up initially in the bjp years before going down to the mid 6’s and then had 2 bad years before recovering back to the low 7’s. Where's 2 years of covid ? Only 1 year"
}