{
    "id": "15bpbjg",
    "title": "Moneycontrol: West Bengal couple sells 8-month-old son to buy iPhone 14 for making Instagram Reels",
    "url": "https://www.moneycontrol.com/news/trends/west-bengal-couple-sells-8-month-old-son-to-buy-iphone-14-for-making-instagram-reels-11046561.html",
    "selftext": "This best them all. The \"Reeladdicts\". Yes, that's what I call them. Stupid ppl.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1690525393.0,
    "convurl": "https://external-preview.redd.it/aNBeyjyz-hp3wAnL6qzUx2OlZKOWJI_w34N2AY4vgxI.jpg?auto=webp&s=998d12b9ad9b6600ce1d29d7c307e51acdbf0b9c",
    "comments": [
        "The dark side of trying to be influencer(s)...",
        "I can't believe such lack of awareness and sense of responsibility. Clearly Samsung S23 Ultra has a better camera!!",
        "不不不",
        "People are becoming more & more materialistic.",
        "INFLUENZAA!!",
        "Height of stupidity, cannot belive such people are reproducing..\n\nSeriously, if they waited for 2 more months, they could get iPhone 15",
        "You had me in the first half, not gonna lie"
    ],
    "cleaned_text": "moneycontrol west bengal couple sells monthold son buy iphone making instagram reels best reeladdicts yes thats call stupid ppl ",
    "cleaned_title": "moneycontrol west bengal couple sells monthold son buy iphone making instagram reels",
    "cleaned_selftext": "best reeladdicts yes thats call stupid ppl",
    "cleaned_comments": "dark side trying influencers cant believe lack awareness sense responsibility clearly samsung ultra better camera people becoming materialistic influenzaa height stupidity belive people reproducing seriously waited months could get iphone first half gon na lie",
    "light_cleaned_title": "Moneycontrol: West Bengal couple sells 8-month-old son to buy iPhone 14 for making Instagram Reels",
    "light_cleaned_selftext": "This best them all. The \"Reeladdicts\". Yes, that's what I call them. Stupid ppl.",
    "light_cleaned_comments": "The dark side of trying to be influencer(s)... I can't believe such lack of awareness and sense of responsibility. Clearly Samsung S23 Ultra has a better camera!! 不不不 People are becoming more & more materialistic. INFLUENZAA!! Height of stupidity, cannot belive such people are reproducing.. Seriously, if they waited for 2 more months, they could get iPhone 15 You had me in the first half, not gonna lie"
}