{
    "id": "17xuikj",
    "title": "Property",
    "url": "https://www.reddit.com/gallery/17xuikj",
    "selftext": "Hi guys, my mom has recently been telling me to buy a plot, and shared the details below. Please let me know if it's legitimate. I don't know why but, I get a feeling that this is fake or a scam.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1700269696.0,
    "convurl": "https://i.redd.it/e0iojnlqa01c1.jpg",
    "comments": [
        "It’s very cheap, imo don’t know what are the surroundings like",
        "\nScam",
        "r/bangalore",
        "Buy RBI bonds or something instead of putting money on shitty investments.",
        "It's real but in the metaverse lol",
        "What they are going to build in 48 months?",
        "They will develop the project and other amenities. The builder said that when they hand over the plot it will be fit for construction"
    ],
    "cleaned_text": "property hi guys mom recently telling buy plot shared details please let know legitimate dont know get feeling fake scam ",
    "cleaned_title": "property",
    "cleaned_selftext": "hi guys mom recently telling buy plot shared details please let know legitimate dont know get feeling fake scam",
    "cleaned_comments": "cheap imo dont know surroundings like scam rbangalore buy rbi bonds something instead putting money shitty investments real metaverse lol going build months develop project amenities builder said hand plot fit construction",
    "light_cleaned_title": "Property",
    "light_cleaned_selftext": "Hi guys, my mom has recently been telling me to buy a plot, and shared the details below. Please let me know if it's legitimate. I don't know why but, I get a feeling that this is fake or a scam.",
    "light_cleaned_comments": "It’s very cheap, imo don’t know what are the surroundings like Scam r/bangalore Buy RBI bonds or something instead of putting money on shitty investments. It's real but in the metaverse lol What they are going to build in 48 months? They will develop the project and other amenities. The builder said that when they hand over the plot it will be fit for construction"
}