{
    "id": "17mvmv8",
    "title": "Law aiding Monsanto is reason for Delhi’s annual smoke season (Dec 2017)",
    "url": "https://sundayguardianlive.com/news/12191-law-aiding-monsanto-reason-delhi-s-annual-smoke-season",
    "selftext": "For now, a step that should be taken immediately in order to prevent Delhi from becoming a gas chamber for several days every November, is to revoke what should rightfully be called the Monsanto Profit Act of 2009 and permit farmers to sow their rice crop whenever they deem it fit to do so.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1699019682.0,
    "convurl": "https://external-preview.redd.it/nBFRSFfQGGIiSZOZQagYmJnnI3F0_IsBDofUD2W9g2g.jpg?auto=webp&s=c3659d85f77c0b830ef030464ba2adb5bfe273d4",
    "comments": [
        "Too much of hyperbole and unscientific blamegame to pass the buck to others. \n\n1) US support started the Green Revolution in the first place and saved India back then. Science has progressed now, and thus limitations of that approach are also now known. Any course correction need not be always viewed in terms of vested interests. Especially when the evidence is clear.\n\n2) The claim that paddy farming 'recharges' water table is laughable. Most of the cultivation in Punjab is based on pumped out groundwater. Sure, the evapotranspiration losses won't be 100%, and some of it would surely go back to the water table, but that recharge cannot be >=100% of the pumped out water either (keeping rainwater aside). That paddy takes lot of groundwater is well documented in a large body of research.\n\n3) GM crops have mostly helped wherever they have been used. So much so that Indian farmers are actively lobbying for it (and at times breaking law and planting non approved crops in India). Fear mongering against GM crops or nuclear energy is largely unscientific. Especially when 1/3rd of all living Nobel Laureates in science have argued against such fear mongering.\n\n4) Haryana also has the same law, but is stricter in enforcing ban on stubble burning with the results visible now. Also, if a specific law is a problem then repeal it. The effects of overpumping water will also be far more localized making the offenders more likely to suffer for their own actions. \n\nhttps://www.theguardian.com/environment/2016/jun/30/nobel-winners-slam-greenpeace-for-anti-gm-campaign\n\nhttps://www.indiatoday.in/india-today-insight/story/gm-crops-boon-or-bio-hazard-1552379-2019-06-20\n\nShould we also blame Reddit for trying to 'break India' by fanning unscientific views (apart from Monsanto)? Did this American corporation Reddit pay you too for peddling this?",
        "Sunday Guardian is a right wing rag. I’ll delete this post."
    ],
    "cleaned_text": "law aiding monsanto reason delhis annual smoke season dec step taken immediately order prevent delhi becoming gas chamber several days every november revoke rightfully called monsanto profit act permit farmers sow rice crop whenever deem fit ",
    "cleaned_title": "law aiding monsanto reason delhis annual smoke season dec",
    "cleaned_selftext": "step taken immediately order prevent delhi becoming gas chamber several days every november revoke rightfully called monsanto profit act permit farmers sow rice crop whenever deem fit",
    "cleaned_comments": "much hyperbole unscientific blamegame pass buck others us support started green revolution first place saved india back science progressed thus limitations approach also known course correction need always viewed terms vested interests especially evidence clear claim paddy farming recharges water table laughable cultivation punjab based pumped groundwater sure evapotranspiration losses wont would surely go back water table recharge pumped water either keeping rainwater aside paddy takes lot groundwater well documented large body research gm crops mostly helped wherever used much indian farmers actively lobbying times breaking law planting non approved crops india fear mongering gm crops nuclear energy largely unscientific especially rd living nobel laureates science argued fear mongering haryana also law stricter enforcing ban stubble burning results visible also specific law problem repeal effects overpumping water also far localized making offenders likely suffer actions also blame reddit trying break india fanning unscientific views apart monsanto american corporation reddit pay peddling sunday guardian right wing rag ill delete post",
    "light_cleaned_title": "Law aiding Monsanto is reason for Delhi’s annual smoke season (Dec 2017)",
    "light_cleaned_selftext": "For now, a step that should be taken immediately in order to prevent Delhi from becoming a gas chamber for several days every November, is to revoke what should rightfully be called the Monsanto Profit Act of 2009 and permit farmers to sow their rice crop whenever they deem it fit to do so.",
    "light_cleaned_comments": "Too much of hyperbole and unscientific blamegame to pass the buck to others. 1) US support started the Green Revolution in the first place and saved India back then. Science has progressed now, and thus limitations of that approach are also now known. Any course correction need not be always viewed in terms of vested interests. Especially when the evidence is clear. 2) The claim that paddy farming 'recharges' water table is laughable. Most of the cultivation in Punjab is based on pumped out groundwater. Sure, the evapotranspiration losses won't be 100%, and some of it would surely go back to the water table, but that recharge cannot be >=100% of the pumped out water either (keeping rainwater aside). That paddy takes lot of groundwater is well documented in a large body of research. 3) GM crops have mostly helped wherever they have been used. So much so that Indian farmers are actively lobbying for it (and at times breaking law and planting non approved crops in India). Fear mongering against GM crops or nuclear energy is largely unscientific. Especially when 1/3rd of all living Nobel Laureates in science have argued against such fear mongering. 4) Haryana also has the same law, but is stricter in enforcing ban on stubble burning with the results visible now. Also, if a specific law is a problem then repeal it. The effects of overpumping water will also be far more localized making the offenders more likely to suffer for their own actions. Should we also blame Reddit for trying to 'break India' by fanning unscientific views (apart from Monsanto)? Did this American corporation Reddit pay you too for peddling this? Sunday Guardian is a right wing rag. I’ll delete this post."
}