{
    "id": "134patc",
    "title": "What is the best way to access the internet on Etihad airways for Jio subscribers?",
    "url": "https://www.reddit.com/r/india/comments/134patc/what_is_the_best_way_to_access_the_internet_on/",
    "selftext": "So in a few days time we are planning to go to Europe from Bangalore using Etihad via Abu Dhabi. I see 2 possible options:\n\n1. [https://www.jio.com/selfcare/plans/mobility/prepaid-plans-list/?category=In-Flight%20Packs&categoryId=SW4tRmxpZ2h0IFBhY2tz](https://www.jio.com/selfcare/plans/mobility/prepaid-plans-list/?category=In-Flight%20Packs&categoryId=SW4tRmxpZ2h0IFBhY2tz)\n2. [https://www.etihad.com/en/fly-etihad/in-flight-entertainment](https://www.etihad.com/en/fly-etihad/in-flight-entertainment)\n\nThe former claims to use Mobile data using \"AeroMobile\" network- costs 500 rupees for 250 MB data plus 100 mins and 100 SMS. The latter uses WiFi and is $20 for long haul for \"unlimited\" usage. \n\nAnd in the Jio T&C it says the former cannot be used in Indian airspace according to the law. No info for the latter.\n\n1. So did anyone here use either service? Or both? \n2. Which is faster and more reliable? Would it be fast enough for youtube etc.\n3. And would it work over the ocean for instance? \n4. Are there any usage restrictions- like on Vande Bharat I've heard the internet is restricted to provided services, so would reddit and browsing work in either of these options? Any blocked websites etc?",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1682954216.0,
    "convurl": "https://external-preview.redd.it/LEmoDfZAQjOsrPL2oZXv5fP1v6T6TRMO3zXDOv9b2hg.jpg",
    "comments": [
        "How's the bottling going?"
    ],
    "cleaned_text": "best way access internet etihad airways jio subscribers days time planning go europe bangalore using etihad via abu dhabi see possible options httpswwwjiocomselfcareplansmobilityprepaidplanslistcategoryinflightpackscategoryidswtrmxpzhifbhytzhttpswwwjiocomselfcareplansmobilityprepaidplanslistcategoryinflightpackscategoryidswtrmxpzhifbhytz httpswwwetihadcomenflyetihadinflightentertainmenthttpswwwetihadcomenflyetihadinflightentertainment former claims use mobile data using aeromobile network costs rupees mb data plus mins sms latter uses wifi long haul unlimited usage jio tc says former used indian airspace according law info latter anyone use either service faster reliable would fast enough youtube etc would work ocean instance usage restrictions like vande bharat ive heard internet restricted provided services would reddit browsing work either options blocked websites etc ",
    "cleaned_title": "best way access internet etihad airways jio subscribers",
    "cleaned_selftext": "days time planning go europe bangalore using etihad via abu dhabi see possible options httpswwwjiocomselfcareplansmobilityprepaidplanslistcategoryinflightpackscategoryidswtrmxpzhifbhytzhttpswwwjiocomselfcareplansmobilityprepaidplanslistcategoryinflightpackscategoryidswtrmxpzhifbhytz httpswwwetihadcomenflyetihadinflightentertainmenthttpswwwetihadcomenflyetihadinflightentertainment former claims use mobile data using aeromobile network costs rupees mb data plus mins sms latter uses wifi long haul unlimited usage jio tc says former used indian airspace according law info latter anyone use either service faster reliable would fast enough youtube etc would work ocean instance usage restrictions like vande bharat ive heard internet restricted provided services would reddit browsing work either options blocked websites etc",
    "cleaned_comments": "hows bottling going",
    "light_cleaned_title": "What is the best way to access the internet on Etihad airways for Jio subscribers?",
    "light_cleaned_selftext": "So in a few days time we are planning to go to Europe from Bangalore using Etihad via Abu Dhabi. I see 2 possible options: 1. [https://www.jio.com/selfcare/plans/mobility/prepaid-plans-list/?category=In-Flight%20Packs&categoryId=SW4tRmxpZ2h0IFBhY2tz](https://www.jio.com/selfcare/plans/mobility/prepaid-plans-list/?category=In-Flight%20Packs&categoryId=SW4tRmxpZ2h0IFBhY2tz) 2. [https://www.etihad.com/en/fly-etihad/in-flight-entertainment](https://www.etihad.com/en/fly-etihad/in-flight-entertainment) The former claims to use Mobile data using \"AeroMobile\" network- costs 500 rupees for 250 MB data plus 100 mins and 100 SMS. The latter uses WiFi and is $20 for long haul for \"unlimited\" usage. And in the Jio T&C it says the former cannot be used in Indian airspace according to the law. No info for the latter. 1. So did anyone here use either service? Or both? 2. Which is faster and more reliable? Would it be fast enough for youtube etc. 3. And would it work over the ocean for instance? 4. Are there any usage restrictions- like on Vande Bharat I've heard the internet is restricted to provided services, so would reddit and browsing work in either of these options? Any blocked websites etc?",
    "light_cleaned_comments": "How's the bottling going?"
}