{
    "id": "1elmajs",
    "title": "'Scared' Indian nurse will leave Northern Ireland",
    "url": "https://www.bbc.co.uk/news/articles/cp8nn63n52jo",
    "selftext": "Can India handle a reverse migration if situation worsens in Europe?",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1722961806.0,
    "convurl": "https://external-preview.redd.it/M9wO-Vrc9mYHg7bQ8JYy4oYiMyAJ3WTWncCpJmmIwq0.jpg?auto=webp&s=ffa85cb408937f4910c65c0fa7731adf3c018e73",
    "comments": [
        "Europe doesn’t have many Indian people. US, Aus, Canada. As long as wages, infrastructure and quality of life doesn’t improve in India people won’t come back. \n\nThe quality of life in India is still terrible. We can’t even keep our roads and cities clean.",
        "Europe (which includes UK) has more Indians than Aus and Can put together. If a Idi Amin type situation crops us, Indians be moving back to India in large numbers because there no country can risk taking them like the UK did back in the 70s. Survival will trump all other considerations like infra and qol.",
        "Indian origin but not actually Indian though. What connection do the 2nd, 3rd generation indian origin people have to India. Of course people who are lndian, this country has a responsibility to them. \n\nFinally better quality of live, employment and opportunities people will always be looking to be back home",
        "Do you have a source for your stats? MEA seem to have a different view:\n\nhttps://www.mea.gov.in/images/attach/NRIs-and-PIOs_1.pdf"
    ],
    "cleaned_text": "scared indian nurse leave northern ireland india handle reverse migration situation worsens europe ",
    "cleaned_title": "scared indian nurse leave northern ireland",
    "cleaned_selftext": "india handle reverse migration situation worsens europe",
    "cleaned_comments": "europe doesnt many indian people us aus canada long wages infrastructure quality life doesnt improve india people wont come back quality life india still terrible cant even keep roads cities clean europe includes uk indians aus put together idi amin type situation crops us indians moving back india large numbers country risk taking like uk back survival trump considerations like infra qol indian origin actually indian though connection nd rd generation indian origin people india course people lndian country responsibility finally better quality live employment opportunities people always looking back home source stats mea seem different view",
    "light_cleaned_title": "'Scared' Indian nurse will leave Northern Ireland",
    "light_cleaned_selftext": "Can India handle a reverse migration if situation worsens in Europe?",
    "light_cleaned_comments": "Europe doesn’t have many Indian people. US, Aus, Canada. As long as wages, infrastructure and quality of life doesn’t improve in India people won’t come back. The quality of life in India is still terrible. We can’t even keep our roads and cities clean. Europe (which includes UK) has more Indians than Aus and Can put together. If a Idi Amin type situation crops us, Indians be moving back to India in large numbers because there no country can risk taking them like the UK did back in the 70s. Survival will trump all other considerations like infra and qol. Indian origin but not actually Indian though. What connection do the 2nd, 3rd generation indian origin people have to India. Of course people who are lndian, this country has a responsibility to them. Finally better quality of live, employment and opportunities people will always be looking to be back home Do you have a source for your stats? MEA seem to have a different view:"
}