{
    "id": "18jfagi",
    "title": "Why do Indians have massive trucks with no safety bars or sheets to prevent cars from going under?",
    "url": "https://www.reddit.com/gallery/18jfagi",
    "selftext": "If my home country is poorer than eastern foreign countries and they don't spend money on making trucks safer then that shows no care towards safety of the people.",
    "flair": "Rant / Vent",
    "score": 48,
    "num_comments": 68,
    "created_utc": 1702688330.0,
    "convurl": "https://i.redd.it/d136zjbl2k6c1.jpg",
    "comments": [
        "Most of these trucks don't even have working tail lights or reflectors to be visible on highway during night \n\nIndians dont care about saferty, they care only about mileage",
        "they ccan take care that it wont happen \non top of that their are even more serious traffic issues than this one 😶",
        "Indians care but the goverment doest not, at the end its the government that can make things happen and at this moment they dont care",
        "Wait, cars go under trucks otherwise?",
        "Because people do not value their or anyone else's life. Money is supreme. People drive on the wrong side of the road in not only their cycle rickshaws, bikes but even cars and pickups, just to save that ₹10 worth of fuel or 5 minutes. That's how much they think their own life is worth. \n\nIt's an open question on why people don't value life. Maybe it is because there are 1.4 bn of us (cheap labor to replace the dead, boss breathing down your neck to work quick or be fired), or maybe just low self esteem due to myriad of factors.",
        "Is this a serious question? 😂. This is what you find important? \n\nAnd what does this have to do with 'Indians'? One govt rule and all manufactured trailers will be built with all kinds of bars you like whether 'indians' want it or not.",
        "Don't you know? Because Incredible India. Isn't it?",
        "True. It’s not like these truck owners have visited other countries, noticed that there is a bar there but decided not to put it in India. \n\nIt’s always government rules.",
        "I mean won't cars coming at a high speed go under a truck irrespective of whether there's a metal bar hanging from the truck's ass or not? Plus in my experience, almost all Indian trucks do have the metal bar. OP needs to get on a highway more often.",
        "Wake up babe. New \"why do Indians have no.....\" Just dropped on r/india\n\n1. Trucks in India do have the roll bar (as seen in the first picture). Just not trucks that are Tata ACEs. Heavy duty ones have them!!!\n\n2. What you see in the second picture isn't a protection against cars going under. It's too improve the drag coefficient of the truck and keep it more streamlined to improve fuel efficiency. Often seen only in Long Haul trucks in the US!!",
        "80% of Indians are Hindus, so we have reincarnation on our side. Who needs safety when you are going to be reborn again and again. \n\nYOLO is for pussies, real men get reincarnated. \n\n/s",
        "Govt apathy has its fingers in All pies except when it comes to women",
        "Life’s cheap in India",
        "Yes, in the USA, 1998 was when rear guards were \"fully\" required by law. Even now though, there have not been any new federal laws requiring side underride guards.",
        "People having apathy leads to government not giving a shit, so no incentive for the \"One govt rule\".",
        "Because indian trucks already have \"Buri najar wale Tera muh kala\" written on the backside. So don't need this one.",
        "Driving in India is like driving on Give me God difficulty",
        "'Trailers need bars' isn't even in the top 10000 things India needs. I'm sure some trailers have it already.",
        "r/showerthoughts material!",
        "Govt: \"Marne do saalo ko.\"",
        "India is not for noobs",
        ">safety\n\nHahahahahahahahahahahahahahahahahahahahahahaha",
        "Truckers only lease or buy the tractor part of the truck. The trailer is up to company discretion.",
        "Yaa offcourse blame everything on government and do nothing - Cadbury 5 star and throw that rapper in the roadside",
        "So this is what the subreddit has become lately i have seen more non indians doing hate comments or posts on indian subreddit",
        "We don’t care about people we have lots of them",
        "This picture is from Canada, right?",
        "Its mandatory to have one I guess now",
        "Indian trucks do come with rear and side guards. It's mandatory by law and without it a new vehicle will not be registered.",
        "On the contrary GOI mandated air conditioned truck cabins, starting from October, 2025.\n\nEconomic policy Vs. Life Policy",
        "I think preventing  people from dying of bad design is worth it.",
        "Sahi main yaar, kaun hai yeh log.",
        "This Looks like Bramalea Rd Gas station.",
        "I believe seatbelt in car's backseat and lane driving is way more important than this. We don't even follow basic traffic rules most of the times, our driving is chaos to begin with.",
        "1. I think they are called Under-ride protection bars. Trucks manufactured in India after a certain year do have them.(I am not sure about when)\n But older trucks don't. There is a huge number of big trucks which don't have these.",
        "Yes people have enough brains and time to realise that oh it is so important issue(although there is a good possibility that I haven't seen this scenario happening so I might not be able to see it)",
        "Bramalea & Queens intersection to be specific.",
        "Do we have cases of car going under trucks?",
        "because everyone is only concerned about mandir kahan banayenge!",
        "Lol you're right. I'm not even sure how or why I typed \"roll bar\". \n\nAnd yes, older trucks didn't have it. But all the long haul and large trucks I've seen in the last few years have it! Have seen those old Eicher trucks with retrofitted bars too, so I'm pretty sure it's even a rule now!",
        "Kya hi blame karo inhe. Ye go phir bhi curiosity se a gaya. What makes it frustrating for me is how we always almost have a negative reply ready blaming people, government even if sach itna simple na ho",
        "The NRI season in India has started lmao",
        "Why will you follow laws if no one follows it. If you try to follow law then people just be like chal na kon dekh raha hai, kya fark padta hai. \nWe need stronger implementation . People are people they will ignore laws until there are consequences or it becomes so normal that they can't just go with thought of not following them",
        "A lot of highway fatalities may be prevented if these under ride bars were present in all trucks. Without these bars, the car is stuck under the truck and the front seat passengers are usually affected because the height of the trucks are at almost the same level as the hatchnack front seat. If they are not hit directly by the truck bed, the car gets stuck underneath which impedes rescue operation",
        ">OP needs to get on a highway more often.\n\nI mean he is not Indian so I can't expect that from him as he can't go to Indian highway more often lol",
        "A good, but long documentary on this: \n\nhttps://youtu.be/1LyaWzOesXk",
        "Yup!",
        "https://preview.redd.it/ifs5bzpbtk6c1.png?width=1080&format=pjpg&auto=webp&s=b1c188885a8d911d2006b81609bb04b0fe90178f\n\nThen what is this?",
        "Driving on Indian roads needs good ground clearance.",
        "Because its India",
        "Because its fun",
        "So that I can drive my car in that gap. NFSMW",
        "The day I’ll become PM.. itne zyada fine laga dunga na ki log dar jaye kuch bhi galat karne se..",
        "Or 2nd biggest religion under oppression",
        "It's a step taken by government years ago to control population. /s",
        "https://preview.redd.it/wmblckrr6l6c1.jpeg?width=594&format=pjpg&auto=webp&s=481d34f147d3c394d730f6762980fd9d19d69065",
        "https://preview.redd.it/2717log77l6c1.jpeg?width=414&format=pjpg&auto=webp&s=c6ff527bd4c0f0a21cfc16de90682a95e3c5eb03",
        "https://preview.redd.it/53506ydc7l6c1.jpeg?width=640&format=pjpg&auto=webp&s=674b07f7a0bda9b32bfcb0c695cd2e00a3693d6a",
        "https://preview.redd.it/jprsd9gd9l6c1.jpeg?width=400&format=pjpg&auto=webp&s=d2446fdb390f650a4ce7079cdf8bda8efa50702f",
        "Here's an amazing concept:\n\n#Two things being true at once!",
        "https://preview.redd.it/kp1facu9al6c1.jpeg?width=380&format=pjpg&auto=webp&s=0817f4a72d06e0dc25b4359a844cf5f0be200326",
        "https://preview.redd.it/z9gno8t3jl6c1.png?width=1080&format=pjpg&auto=webp&s=5cbabfca1a5c9fd3225a2aa1f303de6d0b7a9880\n\nThis is a safety rod if you didn't know.",
        "If you can see I've shared you the Side pictures... don't get stuck on the back please",
        "Is a safety rod is required on the side of the truck too. Never seen it anywhere",
        "Don't you know what OP posted??? 🤦🤦🤦",
        "Under run protection is compulsory for every trailer, truck, bus since at least 2010. And I have not seen any new large truck without under run protection in recent years, so this has been strictly followed.",
        "Under run protection is compulsory for every trailer, truck, bus since at least 2010. And I have not seen any new large truck without under run protection in recent years, so this has been strictly followed.\n\nWhoever is saying that Indian trucks don't have under run protection has either never been to India in recent times or is very ignorant of his/her surroundings."
    ],
    "cleaned_text": "indians massive trucks safety bars sheets prevent cars going home country poorer eastern foreign countries dont spend money making trucks safer shows care towards safety people ",
    "cleaned_title": "indians massive trucks safety bars sheets prevent cars going",
    "cleaned_selftext": "home country poorer eastern foreign countries dont spend money making trucks safer shows care towards safety people",
    "cleaned_comments": "trucks dont even working tail lights reflectors visible highway night indians dont care saferty care mileage ccan take care wont happen top even serious traffic issues one indians care goverment doest end government make things happen moment dont care wait cars go trucks otherwise people value anyone elses life money supreme people drive wrong side road cycle rickshaws bikes even cars pickups save worth fuel minutes thats much think life worth open question people dont value life maybe bn us cheap labor replace dead boss breathing neck work quick fired maybe low self esteem due myriad factors serious question find important indians one govt rule manufactured trailers built kinds bars like whether indians want dont know incredible india isnt true like truck owners visited countries noticed bar decided put india always government rules mean wont cars coming high speed go truck irrespective whether theres metal bar hanging trucks ass plus experience almost indian trucks metal bar op needs get highway often wake babe new indians dropped rindia trucks india roll bar seen first picture trucks tata aces heavy duty ones see second picture isnt protection cars going improve drag coefficient truck keep streamlined improve fuel efficiency often seen long haul trucks us indians hindus reincarnation side needs safety going reborn yolo pussies real men get reincarnated govt apathy fingers pies except comes women lifes cheap india yes usa rear guards fully required law even though new federal laws requiring side underride guards people apathy leads government giving shit incentive one govt rule indian trucks already buri najar wale tera muh kala written backside dont need one driving india like driving give god difficulty trailers need bars isnt even top things india needs im sure trailers already rshowerthoughts material govt marne saalo ko india noobs safety hahahahahahahahahahahahahahahahahahahahahahaha truckers lease buy tractor part truck trailer company discretion yaa offcourse blame everything government nothing cadbury star throw rapper roadside subreddit become lately seen non indians hate comments posts indian subreddit dont care people lots picture canada right mandatory one guess indian trucks come rear side guards mandatory law without new vehicle registered contrary goi mandated air conditioned truck cabins starting october economic policy vs life policy think preventing people dying bad design worth sahi main yaar kaun hai yeh log looks like bramalea rd gas station believe seatbelt cars backseat lane driving way important dont even follow basic traffic rules times driving chaos begin think called underride protection bars trucks manufactured india certain year themi sure older trucks dont huge number big trucks dont yes people enough brains time realise oh important issuealthough good possibility havent seen scenario happening might able see bramalea queens intersection specific cases car going trucks everyone concerned mandir kahan banayenge lol youre right im even sure typed roll bar yes older trucks didnt long haul large trucks ive seen last years seen old eicher trucks retrofitted bars im pretty sure even rule kya hi blame karo inhe ye go phir bhi curiosity se gaya makes frustrating always almost negative reply ready blaming people government even sach itna simple na ho nri season india started lmao follow laws one follows try follow law people like chal na kon dekh raha hai kya fark padta hai need stronger implementation people people ignore laws consequences becomes normal cant go thought following lot highway fatalities may prevented ride bars present trucks without bars car stuck truck front seat passengers usually affected height trucks almost level hatchnack front seat hit directly truck bed car gets stuck underneath impedes rescue operation op needs get highway often mean indian cant expect cant go indian highway often lol good long documentary yup driving indian roads needs good ground clearance india fun drive car gap nfsmw day ill become pm itne zyada fine laga dunga na ki log dar jaye kuch bhi galat karne se nd biggest religion oppression step taken government years ago control population heres amazing concept two things true safety rod didnt know see ive shared side pictures dont get stuck back please safety rod required side truck never seen anywhere dont know op posted run protection compulsory every trailer truck bus since least seen new large truck without run protection recent years strictly followed run protection compulsory every trailer truck bus since least seen new large truck without run protection recent years strictly followed whoever saying indian trucks dont run protection either never india recent times ignorant hisher surroundings",
    "light_cleaned_title": "Why do Indians have massive trucks with no safety bars or sheets to prevent cars from going under?",
    "light_cleaned_selftext": "If my home country is poorer than eastern foreign countries and they don't spend money on making trucks safer then that shows no care towards safety of the people.",
    "light_cleaned_comments": "Most of these trucks don't even have working tail lights or reflectors to be visible on highway during night Indians dont care about saferty, they care only about mileage they ccan take care that it wont happen on top of that their are even more serious traffic issues than this one 😶 Indians care but the goverment doest not, at the end its the government that can make things happen and at this moment they dont care Wait, cars go under trucks otherwise? Because people do not value their or anyone else's life. Money is supreme. People drive on the wrong side of the road in not only their cycle rickshaws, bikes but even cars and pickups, just to save that ₹10 worth of fuel or 5 minutes. That's how much they think their own life is worth. It's an open question on why people don't value life. Maybe it is because there are 1.4 bn of us (cheap labor to replace the dead, boss breathing down your neck to work quick or be fired), or maybe just low self esteem due to myriad of factors. Is this a serious question? 😂. This is what you find important? And what does this have to do with 'Indians'? One govt rule and all manufactured trailers will be built with all kinds of bars you like whether 'indians' want it or not. Don't you know? Because Incredible India. Isn't it? True. It’s not like these truck owners have visited other countries, noticed that there is a bar there but decided not to put it in India. It’s always government rules. I mean won't cars coming at a high speed go under a truck irrespective of whether there's a metal bar hanging from the truck's ass or not? Plus in my experience, almost all Indian trucks do have the metal bar. OP needs to get on a highway more often. Wake up babe. New \"why do Indians have no.....\" Just dropped on r/india 1. Trucks in India do have the roll bar (as seen in the first picture). Just not trucks that are Tata ACEs. Heavy duty ones have them!!! 2. What you see in the second picture isn't a protection against cars going under. It's too improve the drag coefficient of the truck and keep it more streamlined to improve fuel efficiency. Often seen only in Long Haul trucks in the US!! 80% of Indians are Hindus, so we have reincarnation on our side. Who needs safety when you are going to be reborn again and again. YOLO is for pussies, real men get reincarnated. /s Govt apathy has its fingers in All pies except when it comes to women Life’s cheap in India Yes, in the USA, 1998 was when rear guards were \"fully\" required by law. Even now though, there have not been any new federal laws requiring side underride guards. People having apathy leads to government not giving a shit, so no incentive for the \"One govt rule\". Because indian trucks already have \"Buri najar wale Tera muh kala\" written on the backside. So don't need this one. Driving in India is like driving on Give me God difficulty 'Trailers need bars' isn't even in the top 10000 things India needs. I'm sure some trailers have it already. r/showerthoughts material! Govt: \"Marne do saalo ko.\" India is not for noobs >safety Hahahahahahahahahahahahahahahahahahahahahahaha Truckers only lease or buy the tractor part of the truck. The trailer is up to company discretion. Yaa offcourse blame everything on government and do nothing - Cadbury 5 star and throw that rapper in the roadside So this is what the subreddit has become lately i have seen more non indians doing hate comments or posts on indian subreddit We don’t care about people we have lots of them This picture is from Canada, right? Its mandatory to have one I guess now Indian trucks do come with rear and side guards. It's mandatory by law and without it a new vehicle will not be registered. On the contrary GOI mandated air conditioned truck cabins, starting from October, 2025. Economic policy Vs. Life Policy I think preventing people from dying of bad design is worth it. Sahi main yaar, kaun hai yeh log. This Looks like Bramalea Rd Gas station. I believe seatbelt in car's backseat and lane driving is way more important than this. We don't even follow basic traffic rules most of the times, our driving is chaos to begin with. 1. I think they are called Under-ride protection bars. Trucks manufactured in India after a certain year do have them.(I am not sure about when) But older trucks don't. There is a huge number of big trucks which don't have these. Yes people have enough brains and time to realise that oh it is so important issue(although there is a good possibility that I haven't seen this scenario happening so I might not be able to see it) Bramalea & Queens intersection to be specific. Do we have cases of car going under trucks? because everyone is only concerned about mandir kahan banayenge! Lol you're right. I'm not even sure how or why I typed \"roll bar\". And yes, older trucks didn't have it. But all the long haul and large trucks I've seen in the last few years have it! Have seen those old Eicher trucks with retrofitted bars too, so I'm pretty sure it's even a rule now! Kya hi blame karo inhe. Ye go phir bhi curiosity se a gaya. What makes it frustrating for me is how we always almost have a negative reply ready blaming people, government even if sach itna simple na ho The NRI season in India has started lmao Why will you follow laws if no one follows it. If you try to follow law then people just be like chal na kon dekh raha hai, kya fark padta hai. We need stronger implementation . People are people they will ignore laws until there are consequences or it becomes so normal that they can't just go with thought of not following them A lot of highway fatalities may be prevented if these under ride bars were present in all trucks. Without these bars, the car is stuck under the truck and the front seat passengers are usually affected because the height of the trucks are at almost the same level as the hatchnack front seat. If they are not hit directly by the truck bed, the car gets stuck underneath which impedes rescue operation >OP needs to get on a highway more often. I mean he is not Indian so I can't expect that from him as he can't go to Indian highway more often lol A good, but long documentary on this: Yup! Then what is this? Driving on Indian roads needs good ground clearance. Because its India Because its fun So that I can drive my car in that gap. NFSMW The day I’ll become PM.. itne zyada fine laga dunga na ki log dar jaye kuch bhi galat karne se.. Or 2nd biggest religion under oppression It's a step taken by government years ago to control population. /s Here's an amazing concept: #Two things being true at once! This is a safety rod if you didn't know. If you can see I've shared you the Side pictures... don't get stuck on the back please Is a safety rod is required on the side of the truck too. Never seen it anywhere Don't you know what OP posted??? 🤦🤦🤦 Under run protection is compulsory for every trailer, truck, bus since at least 2010. And I have not seen any new large truck without under run protection in recent years, so this has been strictly followed. Under run protection is compulsory for every trailer, truck, bus since at least 2010. And I have not seen any new large truck without under run protection in recent years, so this has been strictly followed. Whoever is saying that Indian trucks don't have under run protection has either never been to India in recent times or is very ignorant of his/her surroundings."
}