{
    "id": "1e0mmws",
    "title": "This wedding is a social event guys lmao",
    "url": "https://i.redd.it/ldtqmi5hkvbd1.jpeg",
    "selftext": "Lol atleast they stopped calling it a public event after the outrage ",
    "flair": "Rant / Vent",
    "score": 12,
    "num_comments": 4,
    "created_utc": 1720697290.0,
    "convurl": "https://i.redd.it/ldtqmi5hkvbd1.jpeg",
    "comments": [
        "Ambanis are royalty of modern India",
        "**VIPs peoples are attending** - Not my problem bitchbag. 3 days of unbearable traffic right near where I live. \n\nI'm leaving this year, and so should you!! To a place where personal rights are respected.",
        "Apna PM ka malik aa raha hai, jam toh hoega hi",
        "This should be a national holiday so people can celebrate at home.",
        "Is this fake? What happened to the grammar of the notice? Peoples are coming???"
    ],
    "cleaned_text": "wedding social event guys lmao lol atleast stopped calling public event outrage ",
    "cleaned_title": "wedding social event guys lmao",
    "cleaned_selftext": "lol atleast stopped calling public event outrage",
    "cleaned_comments": "ambanis royalty modern india vips peoples attending problem bitchbag days unbearable traffic right near live im leaving year place personal rights respected apna pm ka malik aa raha hai jam toh hoega hi national holiday people celebrate home fake happened grammar notice peoples coming",
    "light_cleaned_title": "This wedding is a social event guys lmao",
    "light_cleaned_selftext": "Lol atleast they stopped calling it a public event after the outrage",
    "light_cleaned_comments": "Ambanis are royalty of modern India **VIPs peoples are attending** - Not my problem bitchbag. 3 days of unbearable traffic right near where I live. I'm leaving this year, and so should you!! To a place where personal rights are respected. Apna PM ka malik aa raha hai, jam toh hoega hi This should be a national holiday so people can celebrate at home. Is this fake? What happened to the grammar of the notice? Peoples are coming???"
}