{
    "id": "166x47v",
    "title": "This is what happens if you refuse to pay a HUGE bribe in India! #mystory",
    "url": "https://www.reddit.com/r/india/comments/166x47v/this_is_what_happens_if_you_refuse_to_pay_a_huge/",
    "selftext": "I have been pursuing the update our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka).\n\nLast year, an agent working with the revenue department officials approached me and asked for a HUGE fee - amount ranging from ₹10-15 lakhs! ([my story in Times of India](https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-5-years-after-court-direction-to-deputy-commissioner-man-still-awaits-khata/articleshow/92713420.cms)) \n\nAs the officials dragged their feet, I took the matter to Karnataka High Court. The honorable court passed an order in my favour on 28 March 2023\n\nWhen officials still refused to act per the order on time, my lawyer filed a contempt of court against the Bangalore Urban Deputy Commissioner (DC). The Karnataka High Court has issued a \n\n# Contempt of Court [Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023 (link)](https://twitter.com/PetitionIssue/status/1697096822261727434)\n\nSome might argue that I could/should simply have paid the damn bribe and moved on. \n\nBut why?!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693542234.0,
    "convurl": "https://external-preview.redd.it/NhXebUw5gwSsq25iVbqNn_USzIZzoONTHEnV4IlTlQk.jpg",
    "comments": [
        "Hmm I think that’s because the judicial system cannot handle the population where as the bureaucracy can. This allows the bureaucracy to try and run amok and the judiciary system tries to play catch.\n\nBut I am no policy expert here just my opinion.",
        "Thank you for doing this. It's not easy for the common man to go to court for these things. It's hard to find the time in between jobs and put all the effort into it. And that's the reason these officials take advantage of us. \n\nI hope your problem is solved and the people who made it in the first place are hald accountable. We need more people like you who can fight the system until it gets better.",
        "> But I am no policy expert here just my opinion.\n\nWe are all at the receiving end here",
        "great work OP..I hope this gets traction in media and story gets more famous. maybe more people will try to follow on this.",
        "You do realize everyone in that office is same. Hopefully you get the records soon.",
        "I am amazed at how the Officials can dare to refuse the Court order. There must be some higher power in act here who the official fears more than the Court.",
        "Thanks. It is either a large illegal 'fee' and chance to get duped OR fight it out legally. The latter is slow but steady!",
        "> There must be some higher power in act here who the official fears more than the Court.\n\nThis! \n\n...or a 'protection' from that higher power?!",
        "> You do realize everyone in that office is same. \n\nFrom what I have heard and read, it is the same across the country... millions simply pay up and move on.",
        "I am currently in the Nordics and what I find amazing is the ratio of bureaucracy, judiciary to its population is actually quite high. What is funny is the system is now in shambles in some parts due to massive influx of refugees from various parts of the world. Many of them less educated or just greedy for social benefits. \n\nJudiciary, police force all need to be re calibrated for our population. Man I am dying to come back though. Really miss india."
    ],
    "cleaned_text": "happens refuse pay huge bribe india mystory pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka last year agent working revenue department officials approached asked huge fee amount ranging lakhs story times indiahttpstimesofindiaindiatimescomcitybengalurubengaluruyearsaftercourtdirectiontodeputycommissionermanstillawaitskhataarticleshowcms officials dragged feet took matter karnataka high court honorable court passed order favour march officials still refused act per order time lawyer filed contempt court bangalore urban deputy commissioner dc karnataka high court issued contempt court notice bengaluru urban deputy commissioner revenue department aug linkhttpstwittercompetitionissuestatus might argue couldshould simply paid damn bribe moved ",
    "cleaned_title": "happens refuse pay huge bribe india mystory",
    "cleaned_selftext": "pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka last year agent working revenue department officials approached asked huge fee amount ranging lakhs story times indiahttpstimesofindiaindiatimescomcitybengalurubengaluruyearsaftercourtdirectiontodeputycommissionermanstillawaitskhataarticleshowcms officials dragged feet took matter karnataka high court honorable court passed order favour march officials still refused act per order time lawyer filed contempt court bangalore urban deputy commissioner dc karnataka high court issued contempt court notice bengaluru urban deputy commissioner revenue department aug linkhttpstwittercompetitionissuestatus might argue couldshould simply paid damn bribe moved",
    "cleaned_comments": "hmm think thats judicial system handle population bureaucracy allows bureaucracy try run amok judiciary system tries play catch policy expert opinion thank easy common man go court things hard find time jobs put effort thats reason officials take advantage us hope problem solved people made first place hald accountable need people like fight system gets better policy expert opinion receiving end great work opi hope gets traction media story gets famous maybe people try follow realize everyone office hopefully get records soon amazed officials dare refuse court order must higher power act official fears court thanks either large illegal fee chance get duped fight legally latter slow steady must higher power act official fears court protection higher power realize everyone office heard read across country millions simply pay move currently nordics find amazing ratio bureaucracy judiciary population actually quite high funny system shambles parts due massive influx refugees various parts world many less educated greedy social benefits judiciary police force need calibrated population man dying come back though really miss india",
    "light_cleaned_title": "This is what happens if you refuse to pay a HUGE bribe in India! #mystory",
    "light_cleaned_selftext": "I have been pursuing the update our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka). Last year, an agent working with the revenue department officials approached me and asked for a HUGE fee - amount ranging from ₹10-15 lakhs! ([my story in Times of India](https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-5-years-after-court-direction-to-deputy-commissioner-man-still-awaits-khata/articleshow/92713420.cms)) As the officials dragged their feet, I took the matter to Karnataka High Court. The honorable court passed an order in my favour on 28 March 2023 When officials still refused to act per the order on time, my lawyer filed a contempt of court against the Bangalore Urban Deputy Commissioner (DC). The Karnataka High Court has issued a # Contempt of Court [Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023 (link)](https://twitter.com/PetitionIssue/status/1697096822261727434) Some might argue that I could/should simply have paid the damn bribe and moved on. But why?!",
    "light_cleaned_comments": "Hmm I think that’s because the judicial system cannot handle the population where as the bureaucracy can. This allows the bureaucracy to try and run amok and the judiciary system tries to play catch. But I am no policy expert here just my opinion. Thank you for doing this. It's not easy for the common man to go to court for these things. It's hard to find the time in between jobs and put all the effort into it. And that's the reason these officials take advantage of us. I hope your problem is solved and the people who made it in the first place are hald accountable. We need more people like you who can fight the system until it gets better. > But I am no policy expert here just my opinion. We are all at the receiving end here great work OP..I hope this gets traction in media and story gets more famous. maybe more people will try to follow on this. You do realize everyone in that office is same. Hopefully you get the records soon. I am amazed at how the Officials can dare to refuse the Court order. There must be some higher power in act here who the official fears more than the Court. Thanks. It is either a large illegal 'fee' and chance to get duped OR fight it out legally. The latter is slow but steady! > There must be some higher power in act here who the official fears more than the Court. This! ...or a 'protection' from that higher power?! > You do realize everyone in that office is same. From what I have heard and read, it is the same across the country... millions simply pay up and move on. I am currently in the Nordics and what I find amazing is the ratio of bureaucracy, judiciary to its population is actually quite high. What is funny is the system is now in shambles in some parts due to massive influx of refugees from various parts of the world. Many of them less educated or just greedy for social benefits. Judiciary, police force all need to be re calibrated for our population. Man I am dying to come back though. Really miss india."
}