{
    "id": "14urbek",
    "title": "Bomb, barricade, lock Opp out: TMC’s tactics in Bengal Panchayat polls, blow by blow",
    "url": "https://indianexpress.com/article/political-pulse/bombs-barricading-voters-locking-in-oppn-candidate-wave-of-fear-on-voting-day-8818286/",
    "selftext": "Non paywalled link: https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fpolitical-pulse%2Fbombs-barricading-voters-locking-in-oppn-candidate-wave-of-fear-on-voting-day-8818286%2F+++",
    "flair": "Politics",
    "score": 407,
    "num_comments": 32,
    "created_utc": 1688885026.0,
    "convurl": "https://external-preview.redd.it/2aoty0S-xojnT9oSZD9JNITRsNPzXDfutSBW7ZG_HIw.jpg?auto=webp&s=c101858d3514609efaa183b7a358b447924ee0e9",
    "comments": [
        "We are always critical to the BJP and we should because they are holding the central power in India. But why we don't talk enough about the atrocities committed by the regional parties.",
        "Exactly. Being critical to BJP and Hindutva ideology doesn't mean that we allow authoritarian behaviour of other parties scot free",
        "Absolutely disgraceful.",
        "Because people are not unhappy about violence itself. They are unhappy about violence being committed for a cause they are not in favour of.\n\nHere, violence is being committed to further a cause they believe in so, they are quite not unhappy  with what is happening.",
        "Didi o Didi, you are worse than Modi. West Bengal seems to come across as some authoritarian state ruled by a violent junta whose leader is all facade and no substance. Please stay away from central government",
        "That's terribly bad. With such events, Bengal is on its way to dethroning UP and Bihar in political violence.",
        "In India and Bangladesh, while economics have been improving, democracy has been taking a step back which is very disheartening. (Bringing up Bangladesh because they’re in the same region as West Bengal)",
        "Right, what's wrong is wrong.",
        "On its way? Lol. When has Bihar or UP ever been worse at political violence than Wesr Bengal?",
        "Instances of booth capturing are more common in jungleraaj. We didn't hear much because of the lack of local news coverage.",
        "I wonder when WB will see a better alternative to the f**king violent and corrupt options of the TMC, BJP or whatever is left of the Communists! AAP has no chance as they too will be targeted by TMC's goons.",
        "Mamata's mamata is leaking to media what a failed state..",
        "Bengal has been like this since 1969",
        "This comment lacks historical context. Political violence has been a staple in Bengal since pre-partition.",
        "Just an FYI for all the people in this thread.\n\nPolitical violence has been an issue in WB since before independence. \n\nThe problem WB has is all the violent political elements jump to the ruling party when there is a switch. The thugs from the CPI-M days went to TMC and when TMC loses, they will be with the ruling party. \n\nThis is a problem that will linger and definitely wont go away when the opposition comes to power in WB.",
        "I should have written election related violence. Thanks for spotting.",
        "This is 100% on Mamta. Will the President call the CM to ask about the situation or just wait for Shah to manage it via the governor. Where’s the governor?"
    ],
    "cleaned_text": "bomb barricade lock opp tmcs tactics bengal panchayat polls blow blow non paywalled link ",
    "cleaned_title": "bomb barricade lock opp tmcs tactics bengal panchayat polls blow blow",
    "cleaned_selftext": "non paywalled link",
    "cleaned_comments": "always critical bjp holding central power india dont talk enough atrocities committed regional parties exactly critical bjp hindutva ideology doesnt mean allow authoritarian behaviour parties scot free absolutely disgraceful people unhappy violence unhappy violence committed cause favour violence committed cause believe quite unhappy happening didi didi worse modi west bengal seems come across authoritarian state ruled violent junta whose leader facade substance please stay away central government thats terribly bad events bengal way dethroning bihar political violence india bangladesh economics improving democracy taking step back disheartening bringing bangladesh theyre region west bengal right whats wrong wrong way lol bihar ever worse political violence wesr bengal instances booth capturing common jungleraaj didnt hear much lack local news coverage wonder wb see better alternative fking violent corrupt options tmc bjp whatever left communists aap chance targeted tmcs goons mamatas mamata leaking media failed state bengal like since comment lacks historical context political violence staple bengal since prepartition fyi people thread political violence issue wb since independence problem wb violent political elements jump ruling party switch thugs cpim days went tmc tmc loses ruling party problem linger definitely wont go away opposition comes power wb written election related violence thanks spotting mamta president call cm ask situation wait shah manage via governor wheres governor",
    "light_cleaned_title": "Bomb, barricade, lock Opp out: TMC’s tactics in Bengal Panchayat polls, blow by blow",
    "light_cleaned_selftext": "Non paywalled link:",
    "light_cleaned_comments": "We are always critical to the BJP and we should because they are holding the central power in India. But why we don't talk enough about the atrocities committed by the regional parties. Exactly. Being critical to BJP and Hindutva ideology doesn't mean that we allow authoritarian behaviour of other parties scot free Absolutely disgraceful. Because people are not unhappy about violence itself. They are unhappy about violence being committed for a cause they are not in favour of. Here, violence is being committed to further a cause they believe in so, they are quite not unhappy with what is happening. Didi o Didi, you are worse than Modi. West Bengal seems to come across as some authoritarian state ruled by a violent junta whose leader is all facade and no substance. Please stay away from central government That's terribly bad. With such events, Bengal is on its way to dethroning UP and Bihar in political violence. In India and Bangladesh, while economics have been improving, democracy has been taking a step back which is very disheartening. (Bringing up Bangladesh because they’re in the same region as West Bengal) Right, what's wrong is wrong. On its way? Lol. When has Bihar or UP ever been worse at political violence than Wesr Bengal? Instances of booth capturing are more common in jungleraaj. We didn't hear much because of the lack of local news coverage. I wonder when WB will see a better alternative to the f**king violent and corrupt options of the TMC, BJP or whatever is left of the Communists! AAP has no chance as they too will be targeted by TMC's goons. Mamata's mamata is leaking to media what a failed state.. Bengal has been like this since 1969 This comment lacks historical context. Political violence has been a staple in Bengal since pre-partition. Just an FYI for all the people in this thread. Political violence has been an issue in WB since before independence. The problem WB has is all the violent political elements jump to the ruling party when there is a switch. The thugs from the CPI-M days went to TMC and when TMC loses, they will be with the ruling party. This is a problem that will linger and definitely wont go away when the opposition comes to power in WB. I should have written election related violence. Thanks for spotting. This is 100% on Mamta. Will the President call the CM to ask about the situation or just wait for Shah to manage it via the governor. Where’s the governor?"
}