{
    "id": "15ucp1q",
    "title": "Escaping mobs, uncertain futures, no way home: Manipur students who fled to Delhi | Manipur Violence",
    "url": "https://www.reddit.com/r/india/comments/15ucp1q/escaping_mobs_uncertain_futures_no_way_home/",
    "selftext": "This is painful to hear, being a student it is even more distressing. Hearing their experience reminded me of Jamia incident in 2020 during CAA protests. \n\nEvery parent, or soon to be married or new parent should watch this. This is what hate will do to your child, it will either turn them into a mob attacking a girl hostel at night or your child will be the victim of this mob. Either way your children's future is grim. We might google which region of the country is safest for my child to do higher study but worry not your beloved prime time hate mongers will come to each and every part of this country. \n\nIgnore the rant, please watch the video.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692340886.0,
    "convurl": "https://external-preview.redd.it/iKLL3OEs856-DPfQ1QBDWsWg98YPnRrnbEWIbChH-8s.jpg?auto=webp&s=81c71a880bf3ec37cd4555ef4d8341046a7fbc53",
    "comments": [],
    "cleaned_text": "escaping mobs uncertain futures way home manipur students fled delhi manipur violence painful hear student even distressing hearing experience reminded jamia incident caa protests every parent soon married new parent watch hate child either turn mob attacking girl hostel night child victim mob either way childrens future grim might google region country safest child higher study worry beloved prime time hate mongers come every part country ignore rant please watch video ",
    "cleaned_title": "escaping mobs uncertain futures way home manipur students fled delhi manipur violence",
    "cleaned_selftext": "painful hear student even distressing hearing experience reminded jamia incident caa protests every parent soon married new parent watch hate child either turn mob attacking girl hostel night child victim mob either way childrens future grim might google region country safest child higher study worry beloved prime time hate mongers come every part country ignore rant please watch video",
    "cleaned_comments": "",
    "light_cleaned_title": "Escaping mobs, uncertain futures, no way home: Manipur students who fled to Delhi | Manipur Violence",
    "light_cleaned_selftext": "This is painful to hear, being a student it is even more distressing. Hearing their experience reminded me of Jamia incident in 2020 during CAA protests. Every parent, or soon to be married or new parent should watch this. This is what hate will do to your child, it will either turn them into a mob attacking a girl hostel at night or your child will be the victim of this mob. Either way your children's future is grim. We might google which region of the country is safest for my child to do higher study but worry not your beloved prime time hate mongers will come to each and every part of this country. Ignore the rant, please watch the video.",
    "light_cleaned_comments": ""
}