{
    "id": "1df1w8f",
    "title": "Ambani: “Money can buy anything.” Italian restaurant owner : “ not my sandwiches.” ",
    "url": "https://i.redd.it/ysf4c2u0zc6d1.jpeg",
    "selftext": "I’m in Europe and some of my Italian friends are venting about this wedding to me. When will these people stop celebrating ",
    "flair": "Rant / Vent",
    "score": 70,
    "num_comments": 14,
    "created_utc": 1718292911.0,
    "convurl": "https://i.redd.it/ysf4c2u0zc6d1.jpeg",
    "comments": [
        "Money can buy anything \\***in India**",
        "I hope the PM’s visit will calm the situation down /s",
        "Danda parega Viswaguru ko",
        "Maybd he is joining",
        "What especially struck me was that this cruise with 800 people is expected to cost over $150 million. That's just horrifically obscene. ",
        "Another jealous white person.",
        "Who ? Me?",
        "Yea and when I made a post few months ago about the obscene amount of money these guys spend, I got told I was jealous 😂. It’s not jealousy, it’s about how someone shouldn’t be allowed to acquire so much wealth. It’s not wealth made by correct means. There’s corruption involved.",
        "1.5-2 crores per person lmao",
        "It’s all relative. He’s worth over 100 billion. This cruise wasn’t even 0.5% of his net worth. An average upper middle class family’s net worth is around 2 cr. By that logic, if they spend more than 1 lakh for their wedding, it would be an obscene display of wealth. A random wedding in a tier 3 city costs more than that. People love to hate on the rich but don’t look at what they spend relative to their wealth.",
        "This is just an Italian negotiation tactic. Clearly feigning offense to increase the bribe money. Hedging his bets so that if the offer is not up to his mark then he wins his \"dignity\" but if the price is right he makes a lot of money and sweeps his \"integrity\" under one of his expensive rugs. Either way he wins.",
        "Money can buy private zoo, international airport, air force jet, prime minister etc etc. in a developed country like India. Italy is not developed enough.",
        "Andrea milori . Don't want to serve Indians. Making excuses."
    ],
    "cleaned_text": "ambani money buy anything italian restaurant owner sandwiches im europe italian friends venting wedding people stop celebrating ",
    "cleaned_title": "ambani money buy anything italian restaurant owner sandwiches",
    "cleaned_selftext": "im europe italian friends venting wedding people stop celebrating",
    "cleaned_comments": "money buy anything india hope pms visit calm situation danda parega viswaguru ko maybd joining especially struck cruise people expected cost million thats horrifically obscene another jealous white person yea made post months ago obscene amount money guys spend got told jealous jealousy someone shouldnt allowed acquire much wealth wealth made correct means theres corruption involved crores per person lmao relative hes worth billion cruise wasnt even net worth average upper middle class familys net worth around cr logic spend lakh wedding would obscene display wealth random wedding tier city costs people love hate rich dont look spend relative wealth italian negotiation tactic clearly feigning offense increase bribe money hedging bets offer mark wins dignity price right makes lot money sweeps integrity one expensive rugs either way wins money buy private zoo international airport air force jet prime minister etc etc developed country like india italy developed enough andrea milori dont want serve indians making excuses",
    "light_cleaned_title": "Ambani: “Money can buy anything.” Italian restaurant owner : “ not my sandwiches.”",
    "light_cleaned_selftext": "I’m in Europe and some of my Italian friends are venting about this wedding to me. When will these people stop celebrating",
    "light_cleaned_comments": "Money can buy anything \\***in India** I hope the PM’s visit will calm the situation down /s Danda parega Viswaguru ko Maybd he is joining What especially struck me was that this cruise with 800 people is expected to cost over $150 million. That's just horrifically obscene. Another jealous white person. Who ? Me? Yea and when I made a post few months ago about the obscene amount of money these guys spend, I got told I was jealous 😂. It’s not jealousy, it’s about how someone shouldn’t be allowed to acquire so much wealth. It’s not wealth made by correct means. There’s corruption involved. 1.5-2 crores per person lmao It’s all relative. He’s worth over 100 billion. This cruise wasn’t even 0.5% of his net worth. An average upper middle class family’s net worth is around 2 cr. By that logic, if they spend more than 1 lakh for their wedding, it would be an obscene display of wealth. A random wedding in a tier 3 city costs more than that. People love to hate on the rich but don’t look at what they spend relative to their wealth. This is just an Italian negotiation tactic. Clearly feigning offense to increase the bribe money. Hedging his bets so that if the offer is not up to his mark then he wins his \"dignity\" but if the price is right he makes a lot of money and sweeps his \"integrity\" under one of his expensive rugs. Either way he wins. Money can buy private zoo, international airport, air force jet, prime minister etc etc. in a developed country like India. Italy is not developed enough. Andrea milori . Don't want to serve Indians. Making excuses."
}