{
    "id": "161bv5k",
    "title": "What are your views on this video.",
    "url": "https://twitter.com/farooque_real77/status/1695145739536732620?t=lvhZkmQJt_HxNoeeG0jOuQ&s=19",
    "selftext": "I don't like sharing such stuff, but I cried watching this. Want to see if there are still humans left who would still defend this.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 17,
    "created_utc": 1692999078.0,
    "convurl": "https://external-preview.redd.it/9JdWUiKzMf0OMpRrxkV2-NSbN0UunT46UE3UZsCgLms.jpg?auto=webp&s=ee5485e2f7aa7dc1b649b97d54a79620e1eaadf0",
    "comments": [
        "The comment. The insufferable comments saying there is no communal angle. And one even blame Muslim for terrorist attacks??",
        "i have lost hope tbh",
        "All the venom that these prime time anchors have spread over the years, when they get old and I full heartedly pray for their long life. But when they get old they will have sleepless nights and nightmares of such videos. All the pain and suffering of this hatred will haunt them in their old age. No drug, no alcohol will be able to save them from the trauma. Their long life will be their punishment. \n\nThe same goes for the higher authority whose order these media puppets are following. I wish them all a loooooong life.",
        "Can someone clear what she says here? I can’t seem to understand much with my less hindi skill",
        "Must be punished as an individual. Kicked out of her job and maybe jailed, depending on legal procedure.",
        "I doubt snakes like them will be capable of feeling guilty and Shame. That's the minimum qualification for being one these days.",
        "Why isnt any body on children's welfare or education taking cognisance of incident and barring her from teaching for rest of the life? That's the bare minimum to be done in incidents like this,esp with video evidence.",
        "India is becoming weird day by day man... one teacher loses a job for saying vote to the educated ... other teacher goes unsuspended after unleashing wrath on poor child... ruined my day.",
        "Reason why you should not open news channel\nRemember my school days where in election period there wear lot of flag so one guy bring a flag of a party to school to be used to clean bench and our teacher got angry and said no political flag in school campus\nReligion and politics should be completely Removed from education ground",
        "Cherry picking to rile up people",
        "What do you suggest should be the right thing to do?",
        "People forget people exist. Take action and punish instead of using it as a scapegoat. Stop living in a bubble",
        "So you feel generalization is wrong?",
        "Yes",
        "If i find that woman in front of me I will tear her to bits. Put me in jail, hang me. I dont care. If that was my child I there would be a nuclear explosion. \nSeriously fuck this nonsense. I hope you are all proud of what you have done to this country.",
        "Sickening.\n\nI strongly urge everyone here to go vote next year and make an actual difference to the situation instead of just lamenting. Nothing will change if we just cry about such issues instead of actually doing something about it."
    ],
    "cleaned_text": "views video dont like sharing stuff cried watching want see still humans left would still defend ",
    "cleaned_title": "views video",
    "cleaned_selftext": "dont like sharing stuff cried watching want see still humans left would still defend",
    "cleaned_comments": "comment insufferable comments saying communal angle one even blame muslim terrorist attacks lost hope tbh venom prime time anchors spread years get old full heartedly pray long life get old sleepless nights nightmares videos pain suffering hatred haunt old age drug alcohol able save trauma long life punishment goes higher authority whose order media puppets following wish loooooong life someone clear says cant seem understand much less hindi skill must punished individual kicked job maybe jailed depending legal procedure doubt snakes like capable feeling guilty shame thats minimum qualification one days isnt body childrens welfare education taking cognisance incident barring teaching rest life thats bare minimum done incidents like thisesp video evidence india becoming weird day day man one teacher loses job saying vote educated teacher goes unsuspended unleashing wrath poor child ruined day reason open news channel remember school days election period wear lot flag one guy bring flag party school used clean bench teacher got angry said political flag school campus religion politics completely removed education ground cherry picking rile people suggest right thing people forget people exist take action punish instead using scapegoat stop living bubble feel generalization wrong yes find woman front tear bits put jail hang dont care child would nuclear explosion seriously fuck nonsense hope proud done country sickening strongly urge everyone go vote next year make actual difference situation instead lamenting nothing change cry issues instead actually something",
    "light_cleaned_title": "What are your views on this video.",
    "light_cleaned_selftext": "I don't like sharing such stuff, but I cried watching this. Want to see if there are still humans left who would still defend this.",
    "light_cleaned_comments": "The comment. The insufferable comments saying there is no communal angle. And one even blame Muslim for terrorist attacks?? i have lost hope tbh All the venom that these prime time anchors have spread over the years, when they get old and I full heartedly pray for their long life. But when they get old they will have sleepless nights and nightmares of such videos. All the pain and suffering of this hatred will haunt them in their old age. No drug, no alcohol will be able to save them from the trauma. Their long life will be their punishment. The same goes for the higher authority whose order these media puppets are following. I wish them all a loooooong life. Can someone clear what she says here? I can’t seem to understand much with my less hindi skill Must be punished as an individual. Kicked out of her job and maybe jailed, depending on legal procedure. I doubt snakes like them will be capable of feeling guilty and Shame. That's the minimum qualification for being one these days. Why isnt any body on children's welfare or education taking cognisance of incident and barring her from teaching for rest of the life? That's the bare minimum to be done in incidents like this,esp with video evidence. India is becoming weird day by day man... one teacher loses a job for saying vote to the educated ... other teacher goes unsuspended after unleashing wrath on poor child... ruined my day. Reason why you should not open news channel Remember my school days where in election period there wear lot of flag so one guy bring a flag of a party to school to be used to clean bench and our teacher got angry and said no political flag in school campus Religion and politics should be completely Removed from education ground Cherry picking to rile up people What do you suggest should be the right thing to do? People forget people exist. Take action and punish instead of using it as a scapegoat. Stop living in a bubble So you feel generalization is wrong? Yes If i find that woman in front of me I will tear her to bits. Put me in jail, hang me. I dont care. If that was my child I there would be a nuclear explosion. Seriously fuck this nonsense. I hope you are all proud of what you have done to this country. Sickening. I strongly urge everyone here to go vote next year and make an actual difference to the situation instead of just lamenting. Nothing will change if we just cry about such issues instead of actually doing something about it."
}