{
    "id": "1e3160i",
    "title": "3 workers asphyxiated in Gujarat coal mine; 2 BJP leaders among 4 booked",
    "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-workers-asphyxiated-coal-mine-bjp-leaders-booked-9452884/",
    "selftext": "The coal mine in Gujarat’s Surendranagar district allegedly operated illegally after the revenue and mining department's crackdown.",
    "flair": "Crime",
    "score": 136,
    "num_comments": 2,
    "created_utc": 1720960280.0,
    "convurl": "https://external-preview.redd.it/LAsAlpiJ1iJHxaPECvjwn_31l3oNylMTt6roFxN1d-Y.jpg?auto=webp&s=ce8cd5cc39b9f63f198d7343b28e04d3d2b6a2a1",
    "comments": [
        ">Speaking to The Indian Express, Sub Inspector (Muli) D D Solanki said on Sunday, “The revenue and mining department had cracked down on illegal mining and had filled up an illegal coal mine which was dug on government wasteland in the Bhet village. However, the accused got that mine opened again. The three labourers were cleaning the mine, around 60 feet below the surface, when they hit a cloud of poisonous gas trapped inside the mine and were asphyxiated.”\nThe SI said the three labourers were affected by gas one after another. “One labourer fell unconscious while working the mine. Therefore, another went in that direction to rescue him, but he, too, was asphyxiated. The third one also went into that section of the mine to rescue his two coworkers. He was also affected,” Chudasama further said.",
        "So bjp guys themselves are not following orders of the government now? What is happening in Gujarat? Do we need a president’s rule there?"
    ],
    "cleaned_text": "workers asphyxiated gujarat coal mine bjp leaders among booked coal mine gujarats surendranagar district allegedly operated illegally revenue mining departments crackdown ",
    "cleaned_title": "workers asphyxiated gujarat coal mine bjp leaders among booked",
    "cleaned_selftext": "coal mine gujarats surendranagar district allegedly operated illegally revenue mining departments crackdown",
    "cleaned_comments": "speaking indian express sub inspector muli solanki said sunday revenue mining department cracked illegal mining filled illegal coal mine dug government wasteland bhet village however accused got mine opened three labourers cleaning mine around feet surface hit cloud poisonous gas trapped inside mine asphyxiated si said three labourers affected gas one another one labourer fell unconscious working mine therefore another went direction rescue asphyxiated third one also went section mine rescue two coworkers also affected chudasama said bjp guys following orders government happening gujarat need presidents rule",
    "light_cleaned_title": "3 workers asphyxiated in Gujarat coal mine; 2 BJP leaders among 4 booked",
    "light_cleaned_selftext": "The coal mine in Gujarat’s Surendranagar district allegedly operated illegally after the revenue and mining department's crackdown.",
    "light_cleaned_comments": ">Speaking to The Indian Express, Sub Inspector (Muli) D D Solanki said on Sunday, “The revenue and mining department had cracked down on illegal mining and had filled up an illegal coal mine which was dug on government wasteland in the Bhet village. However, the accused got that mine opened again. The three labourers were cleaning the mine, around 60 feet below the surface, when they hit a cloud of poisonous gas trapped inside the mine and were asphyxiated.” The SI said the three labourers were affected by gas one after another. “One labourer fell unconscious while working the mine. Therefore, another went in that direction to rescue him, but he, too, was asphyxiated. The third one also went into that section of the mine to rescue his two coworkers. He was also affected,” Chudasama further said. So bjp guys themselves are not following orders of the government now? What is happening in Gujarat? Do we need a president’s rule there?"
}