{
    "id": "1fp8r61",
    "title": "Govt extends import regime for IT hardware products till December 31",
    "url": "https://www.business-standard.com/economy/news/govt-extends-import-regime-for-it-hardware-products-till-december-31-124092401065_1.html",
    "selftext": "The import management system kicked in on November 1, 2023, to promote domestic manufacturing of these goods, reduce dependence, especially on China, and ensure a trusted supply chain for electronics in the country.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1727281859.0,
    "convurl": "https://external-preview.redd.it/k4jZWE4U8Hpt0uhEnspw06YZ4VzjxSz36W9MAww3C8Y.jpg?auto=webp&s=11a1f7dc62435b3a5517c43f7182ca008d337e96",
    "comments": [
        "The system covers laptops, tablets, all-in-one personal computers, ultra-small form factor computers, and servers.\n\nIn August last year, the government announced that it planned to issue licences for the import of IT hardware products. However, amid massive reservations from companies, industry lobby groups, and key trade partners, India stepped back from its earlier plan and a new ‘contactless’ import management system was introduced in November. Under this system, the import permit is issued in an end-to-end online format."
    ],
    "cleaned_text": "govt extends import regime hardware products till december import management system kicked november promote domestic manufacturing goods reduce dependence especially china ensure trusted supply chain electronics country ",
    "cleaned_title": "govt extends import regime hardware products till december",
    "cleaned_selftext": "import management system kicked november promote domestic manufacturing goods reduce dependence especially china ensure trusted supply chain electronics country",
    "cleaned_comments": "system covers laptops tablets allinone personal computers ultrasmall form factor computers servers august last year government announced planned issue licences import hardware products however amid massive reservations companies industry lobby groups key trade partners india stepped back earlier plan new contactless import management system introduced november system import permit issued endtoend online format",
    "light_cleaned_title": "Govt extends import regime for IT hardware products till December 31",
    "light_cleaned_selftext": "The import management system kicked in on November 1, 2023, to promote domestic manufacturing of these goods, reduce dependence, especially on China, and ensure a trusted supply chain for electronics in the country.",
    "light_cleaned_comments": "The system covers laptops, tablets, all-in-one personal computers, ultra-small form factor computers, and servers. In August last year, the government announced that it planned to issue licences for the import of IT hardware products. However, amid massive reservations from companies, industry lobby groups, and key trade partners, India stepped back from its earlier plan and a new ‘contactless’ import management system was introduced in November. Under this system, the import permit is issued in an end-to-end online format."
}