{
    "id": "159trfs",
    "title": "Parliament proceedings | Names of 5 crore MGNREGS workers deleted in 2022-23, Minister informs Lok Sabha",
    "url": "https://www.thehindu.com/news/national/parliament-proceedings-names-of-over-five-crore-mgnregs-workers-deleted-in-2022-23-minister-tells-lok-sabha/article67120001.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fparliament-proceedings-names-of-over-five-crore-mgnregs-workers-deleted-in-2022-23-minister-tells-lok-sabha%2Farticle67120001.ece",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 2,
    "created_utc": 1690340737.0,
    "convurl": "https://external-preview.redd.it/oiAIoSIS6GX1dQ-MWfBa6-5iJQhPHYWw7j4H93HSyAA.jpg?auto=webp&s=d113eba1f53656ea1dfce08fc48da1566d9b8f3e",
    "comments": [
        ">Linking with Aadhaar cards\n\n>The Hindu had reported that the deletions are spiralling because of the government’s emphasis on linking MGNREGS job cards with Aadhaar cards and making wage payments through the Aadhaar-Based Payments System (ABPS). This year alone, till June 23, 61 lakh registered workers have been deleted. In an indirect admission of the problem at hand, the Ministry, for the fourth time, extended the deadline for mandatory wage payments to August 31.\n\n>Among the 34 States and union territories, between the financial years 2021-22 and 2022-23, West Bengal has reported the largest hike in deletion, a whopping 5,199%. The Centre has stopped all payments to the State under the MGNREGS for reportedly not following the programme’s guidelines. It is followed by Telangana (2727%) and Andhra Pradesh (1147%). Uttar Pradesh has reported a deletion of 466% and Uttarakhand 427%.",
        "What are the chances they haven’t been taken into account in the poverty census?",
        "Possible. World bank and UN will applaud this masterstroke poverty reduction initiative and reward the bureaucrats and leaders."
    ],
    "cleaned_text": "parliament proceedings names crore mgnregs workers deleted minister informs lok sabha  ",
    "cleaned_title": "parliament proceedings names crore mgnregs workers deleted minister informs lok sabha",
    "cleaned_selftext": "",
    "cleaned_comments": "linking aadhaar cards hindu reported deletions spiralling governments emphasis linking mgnregs job cards aadhaar cards making wage payments aadhaarbased payments system abps year alone till june lakh registered workers deleted indirect admission problem hand ministry fourth time extended deadline mandatory wage payments august among states union territories financial years west bengal reported largest hike deletion whopping centre stopped payments state mgnregs reportedly following programmes guidelines followed telangana andhra pradesh uttar pradesh reported deletion uttarakhand chances havent taken account poverty census possible world bank un applaud masterstroke poverty reduction initiative reward bureaucrats leaders",
    "light_cleaned_title": "Parliament proceedings | Names of 5 crore MGNREGS workers deleted in 2022-23, Minister informs Lok Sabha",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">Linking with Aadhaar cards >The Hindu had reported that the deletions are spiralling because of the government’s emphasis on linking MGNREGS job cards with Aadhaar cards and making wage payments through the Aadhaar-Based Payments System (ABPS). This year alone, till June 23, 61 lakh registered workers have been deleted. In an indirect admission of the problem at hand, the Ministry, for the fourth time, extended the deadline for mandatory wage payments to August 31. >Among the 34 States and union territories, between the financial years 2021-22 and 2022-23, West Bengal has reported the largest hike in deletion, a whopping 5,199%. The Centre has stopped all payments to the State under the MGNREGS for reportedly not following the programme’s guidelines. It is followed by Telangana (2727%) and Andhra Pradesh (1147%). Uttar Pradesh has reported a deletion of 466% and Uttarakhand 427%. What are the chances they haven’t been taken into account in the poverty census? Possible. World bank and UN will applaud this masterstroke poverty reduction initiative and reward the bureaucrats and leaders."
}