{
    "id": "14471k5",
    "title": "For LGBTQ+ people.",
    "url": "https://www.reddit.com/r/india/comments/14471k5/for_lgbtq_people/",
    "selftext": "Hello all,\n\nA friend of mine is conducting a research project to better understand the unique experiences and challenges faced by LGBTQ+ individuals when relocating to a new city / travelling to a new place / in their current city. Your insights can help shape the development of tools and resources designed to support the community during such transitions for the research.\n\nHere is the link to the survey, and it take approximately 2-5mins. \n\nLink: https://forms.gle/zHMsGWduQwMNaxe26\n\nThe participation is completely voluntary, and all your responses will remain confidential. Please feel free to share this survey with other LGBTQ+ individuals who might be interested in participating.\n\nThank you in advance for your time and for helping to contribute to a more supportive and understanding world for the LGBTQ+ community research.",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 2,
    "created_utc": 1686224835.0,
    "convurl": "https://external-preview.redd.it/zUgBtVS1jxhnXXaUOIoBReCOkTiAMg8Y2DinICo-eeE.jpg?auto=webp&v=enabled&s=5436a0ee46c12ffd37d0fda6eb9fa1b359be4bb9",
    "comments": [],
    "cleaned_text": "lgbtq people hello friend mine conducting research project better understand unique experiences challenges faced lgbtq individuals relocating new city travelling new place current city insights help shape development tools resources designed support community transitions research link survey take approximately mins link participation completely voluntary responses remain confidential please feel free share survey lgbtq individuals might interested participating thank advance time helping contribute supportive understanding world lgbtq community research ",
    "cleaned_title": "lgbtq people",
    "cleaned_selftext": "hello friend mine conducting research project better understand unique experiences challenges faced lgbtq individuals relocating new city travelling new place current city insights help shape development tools resources designed support community transitions research link survey take approximately mins link participation completely voluntary responses remain confidential please feel free share survey lgbtq individuals might interested participating thank advance time helping contribute supportive understanding world lgbtq community research",
    "cleaned_comments": "",
    "light_cleaned_title": "For LGBTQ+ people.",
    "light_cleaned_selftext": "Hello all, A friend of mine is conducting a research project to better understand the unique experiences and challenges faced by LGBTQ+ individuals when relocating to a new city / travelling to a new place / in their current city. Your insights can help shape the development of tools and resources designed to support the community during such transitions for the research. Here is the link to the survey, and it take approximately 2-5mins. Link: The participation is completely voluntary, and all your responses will remain confidential. Please feel free to share this survey with other LGBTQ+ individuals who might be interested in participating. Thank you in advance for your time and for helping to contribute to a more supportive and understanding world for the LGBTQ+ community research.",
    "light_cleaned_comments": ""
}