{
    "id": "157cgk9",
    "title": "Air India is still plagued with delays. My flight was delayed by 3 hours. While Air India is much better than Indigo when you consider the number of facilities provided including Food but if they can fix their timings it’ll easily become a major player and can defeat Indigo",
    "url": "https://www.reddit.com/r/india/comments/157cgk9/air_india_is_still_plagued_with_delays_my_flight/",
    "selftext": "Indigo has been given a free reign in India and they have hiked up their prices and provide minimal amenities. \n\nAir India model is great. They have great and modern planes like Boeing 787 and they have ordered the Boeing 777-9x (longest, most modern and the largest plane in production), Boeing 737 Max, A321 Neo and also A350.\n\nThey provide food on short haul and long haul flights. Their food in long haul flights is just amazing and is an example of what each airline can provide. \n\nDue to the usual laziness and callous nature of Indian Government employees the advanced and amazing technological marvels from Boeing and Airbus were not maintained properly and were harassed and abused beyond what’s recommended \n\nThey need to sell off their abused and old A320 and B737 and get the new Boeing 737 Max and A321 Neo for better reliability and this will reduce their delays. \n\nTata has always been pro government no matter if it’s left wing or right wing. This has allowed them to win numerous government contracts and win multiple kickbacks. \n\nJust like every other corporate Tata has its pros and cons but in general they’re seen in a  somewhat positive view by the Indians because of Honorable Mr. Ratan Tata. \n\nI wish they turn over a new leaf and revamp Air India into a mighty carrier like Emirates or Qatar airlines. \n\nGulf countries use their oil to increase their wealth whereas India and  America use their intellectual wealth to gain riches and its much harder than just drilling a hole and selling oil and down selling it to keep profits up \n\nhttps://www.deshabhimani.com/english/news/national/pilot-arrives-late-air-india-flight-delayed-by-8-hours/8594\n\nhttps://boeing.mediaroom.com/2023-06-20-Air-India-Finalizes-Order-for-Up-to-290-Boeing-Single-Aisle-and-Widebody-Jets#:~:text=The%20order%2C%20which%20includes%20190,year%20partnership%20with%20Air%20India.\n\nhttps://www.reuters.com/business/aerospace-defense/air-india-firms-up-order-with-airbus-boeing-470-planes-2023-06-20/",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690111784.0,
    "convurl": "https://external-preview.redd.it/WTMJTvhXQcgEICJq_mjcceWmvL6QCeKorTivycyp6vs.jpg?auto=webp&s=53fee25bb2c5d44deac52886d6ee74cb40287e10",
    "comments": [
        "On domestic airlines, full service does not make any sense. For a maximum of 3 hour flight, passengers prefers punctuality and price are topmost factor. \n\nGreat meals are available at airports and inflight entertainment is your phone.",
        "Yeah. My major fear is they will turn Vistara into Air india rather than the other way around!"
    ],
    "cleaned_text": "air india still plagued delays flight delayed hours air india much better indigo consider number facilities provided including food fix timings itll easily become major player defeat indigo indigo given free reign india hiked prices provide minimal amenities air india model great great modern planes like boeing ordered boeing x longest modern largest plane production boeing max neo also provide food short haul long haul flights food long haul flights amazing example airline provide due usual laziness callous nature indian government employees advanced amazing technological marvels boeing airbus maintained properly harassed abused beyond whats recommended need sell abused old b get new boeing max neo better reliability reduce delays tata always pro government matter left wing right wing allowed win numerous government contracts win multiple kickbacks like every corporate tata pros cons general theyre seen somewhat positive view indians honorable mr ratan tata wish turn new leaf revamp air india mighty carrier like emirates qatar airlines gulf countries use oil increase wealth whereas india america use intellectual wealth gain riches much harder drilling hole selling oil selling keep profits ",
    "cleaned_title": "air india still plagued delays flight delayed hours air india much better indigo consider number facilities provided including food fix timings itll easily become major player defeat indigo",
    "cleaned_selftext": "indigo given free reign india hiked prices provide minimal amenities air india model great great modern planes like boeing ordered boeing x longest modern largest plane production boeing max neo also provide food short haul long haul flights food long haul flights amazing example airline provide due usual laziness callous nature indian government employees advanced amazing technological marvels boeing airbus maintained properly harassed abused beyond whats recommended need sell abused old b get new boeing max neo better reliability reduce delays tata always pro government matter left wing right wing allowed win numerous government contracts win multiple kickbacks like every corporate tata pros cons general theyre seen somewhat positive view indians honorable mr ratan tata wish turn new leaf revamp air india mighty carrier like emirates qatar airlines gulf countries use oil increase wealth whereas india america use intellectual wealth gain riches much harder drilling hole selling oil selling keep profits",
    "cleaned_comments": "domestic airlines full service make sense maximum hour flight passengers prefers punctuality price topmost factor great meals available airports inflight entertainment phone yeah major fear turn vistara air india rather way around",
    "light_cleaned_title": "Air India is still plagued with delays. My flight was delayed by 3 hours. While Air India is much better than Indigo when you consider the number of facilities provided including Food but if they can fix their timings it’ll easily become a major player and can defeat Indigo",
    "light_cleaned_selftext": "Indigo has been given a free reign in India and they have hiked up their prices and provide minimal amenities. Air India model is great. They have great and modern planes like Boeing 787 and they have ordered the Boeing 777-9x (longest, most modern and the largest plane in production), Boeing 737 Max, A321 Neo and also A350. They provide food on short haul and long haul flights. Their food in long haul flights is just amazing and is an example of what each airline can provide. Due to the usual laziness and callous nature of Indian Government employees the advanced and amazing technological marvels from Boeing and Airbus were not maintained properly and were harassed and abused beyond what’s recommended They need to sell off their abused and old A320 and B737 and get the new Boeing 737 Max and A321 Neo for better reliability and this will reduce their delays. Tata has always been pro government no matter if it’s left wing or right wing. This has allowed them to win numerous government contracts and win multiple kickbacks. Just like every other corporate Tata has its pros and cons but in general they’re seen in a somewhat positive view by the Indians because of Honorable Mr. Ratan Tata. I wish they turn over a new leaf and revamp Air India into a mighty carrier like Emirates or Qatar airlines. Gulf countries use their oil to increase their wealth whereas India and America use their intellectual wealth to gain riches and its much harder than just drilling a hole and selling oil and down selling it to keep profits up",
    "light_cleaned_comments": "On domestic airlines, full service does not make any sense. For a maximum of 3 hour flight, passengers prefers punctuality and price are topmost factor. Great meals are available at airports and inflight entertainment is your phone. Yeah. My major fear is they will turn Vistara into Air india rather than the other way around!"
}