{
    "id": "n62z9r",
    "title": "#StandWithFarmers: Hold the Agriculture Ministry and Microsoft India accountable",
    "url": "https://www.reddit.com/r/india/comments/n62z9r/standwithfarmers_hold_the_agriculture_ministry/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/blpbuomusgx61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=cc6fde42280f3cb0f106073c6a474743f9708348\n\n### Tl;dr\n\nThe Government recently announced that Microsoft would be conducting a pilot programme to implement the Agristack across 100 villages of India. Along with several other organisations, we wrote a letter to the Union Minister for Agriculture, in which we asked for further consultations with all stakeholders, highlighted the need for statutory backing, and demanded greater transparency with regards to the financial details of the project.\n\n### Background\n\nOn the 14th of April, 2021, the Press Information Bureau put a press release stating the Ministry of Agriculture had [**signed a Memorandum of Understanding (MoU) with Microsoft for a pilot project in 100 villages**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877). Under this MoU, Microsoft has been roped in to\n\n&gt;\"to develop farmer interface for smart and well-organized agriculture, including post-harvest management and distribution\".\n\nThe press release also stated that the government is preparing a farmer database by linking the land records of farmers across the country that would integrate data from PM Kisan, Soil Health Cards, and the Pradhan Mantri Crop Insurance Scheme as well as other data. Geo-tagging of agricultural assets shall also take place.\n\nSubsequent [**media reports**](https://economictimes.indiatimes.com/news/economy/agriculture/govt-inks-mou-with-microsoft-to-provide-post-harvest-solutions-to-farmers/articleshow/82076622.cms) have thrown further light upon on the project: the Union Minister for Agriculture, Narendra Singh Tomar, said that Microsoft would be helping farmers with\n\n&gt;\"post harvest management solutions through building a collaborative platform and capturing agriculture datasets such as crop yields, weather data, market demand and prices\".\n\nThe media reports have quoted senior officials in the Agriculture ministry as saying that Microsoft and its local partner CropData will be \"leveraging\" (using) a master database of farmers that will be shared with them by the government. This database would contain the data of 50 million farmers along with their land records.\n\n## The Agristack\n\nThis pilot sounds very similar to the \"[**Agristack**](https://internetfreedom.in/the-agristack-a-primer/)\", which is the collection of technologies and digital databases, proposed by the Central Government focusing on India’s farmers and the agricultural sector. The Government confirmed the existence of the Agristack in [**an answer to a Lok Sabha question**](http://164.100.24.220/loksabhaquestions/annex/175/AU2504.pdf) on 9th March, 2021. In the answer, the Ministry stated that a task force has been constituted to develop the IndEA (India Enterprise Architecture) Digital Ecosystem of Agriculture, on the basis of which a Unified Farmers Service Platform will be prepared. In other words, the Agristack is coming.\n\nWe have [**written about the Agristack before**](https://internetfreedom.in/the-agristack-a-primer/): last year in December, we worked with several volunteers and created a brief for analysis to serve as a primer on the Agristack. In the primer, we explained how the Agristack would function, provided some historical and legislative context, and looked at some of the issues with the project. These issues include:\n\n1. A lack of consultation with farmer organisations\n2. Increased algorithmic decision-making without accountability\n3. Concerns about the privacy of farmers' data\n\nGiven the existence of such significant concerns, the Agristack would have an extremely deleterious impact on farmers as:\n\n* Their data may be exploited by private companies for purposes such as predatory lending or land grabs.\n* Aadhaar and mandatory authentication-based exclusion from welfare measures and agricultures services\n* Reduced agency on the part of the farmers with potential impacts on legal rights through databasing and surveillance\n\nThus we had recommended that comprehensive consultations with farmers groups be carried to generate feedback for the implementation of such technologies. We had spoken about the need for academics, technologists, civil society, and digital rights organisations to engage with, and study the Agristack programme, so as to understand the genuine problems faced by farmers. Lastly, we had called for an examination of the relationship between personal data and digital policies such as the Data Empowerment and Protection Architecture and highlighted the need for a rights-centered data protection regime to undergird such policies.\n\n### Joint Letter to the Agriculture Minister\n\nAlong with organisations such as the Alliance for Sustainable and Holistic Agriculture (ASHA) - Kisan Swaraj, we have collaborated and co-signed onto a joint letter that has been sent to the Union Minister for Agriculture. We have also [**filed an RTI**](https://drive.google.com/file/d/15103pU9a30YVAzIfck0fsOP0uM02atiD/view) regarding various aspects of the pilot project and the MoU.\n\nThe joint letter co-signed by close to 55 organisations, collectives, and groups is reproduced below; the original can be found [**here**](http://www.kisanswaraj.in/2021/05/05/asha-letter-to-goi-on-direction-partnerships-of-its-digital-push-by-ministry-of-agriculture/).\n\n&gt;To,  \n&gt;  \n&gt;Shri Narendra Singh Tomar,  \nHon’ble Minister of Agriculture &amp; Farmers’ Welfare,  \nGovernment of India.  \n&gt;  \n&gt;Cc: Shri Ravi Shankar Prasad, Union Minister of Law and Justice, Electronics and Information Technology, Dr. Rajiv Kumar, Vice Chairperson, NITI Aayog, Shri Sanjay Agarwal, Secretary, Ministry of Agriculture &amp; Farmers Welfare, Shri Ajay Prakash Sawhney, Secretary, Ministry of Electronics &amp; Information Technology, Shri Anant Maheshwari, President of Microsoft India, Shri Sachin Suri, Managing Director of CropData Technology Pvt. Ltd.  \n&gt;  \n&gt;Subject: Direction and Partnerships of the digital push by the Ministry of Agriculture  \n&gt;  \n&gt;Dear Sir,  \n&gt;  \n&gt;The Union Ministry of Agriculture and Microsoft India have signed a Memorandum of Understanding (MoU) on 13th April, 2021. As per [**news reports**](https://economictimes.indiatimes.com/news/economy/agriculture/govt-inks-mou-with-microsoft-to-provide-post-harvest-solutions-to-farmers/articleshow/82076622.cms), “Microsoft through its local partner CropData will leverage master database of farmers to address challenges of individual or group of farmers. “The government has a verified database of more than 50 million farmers along with their land records,” a senior agriculture ministry official said.” Another [**report**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877) states, “the creation of Agri-Funds based on the National Farmers Database. The government is preparing a farmer database by linking the land records of farmers across the country. The data related to PM Kisan, Soil Health Card and Pradhan Mantri Crop Insurance Scheme, available with the government, have been integrated and the process of inclusion of other data is going on.”  \n&gt;  \n&gt;These developments seem to allude to the [**AgriStack**](https://drive.google.com/file/d/1XC7EyKRQy6VzvvYJ2cswBu0irW8gWGvE/view) and seem to be taking place in a policy vacuum with respect to the data privacy of farmers and other related issues. At a time when “[**data has become the new oil**](https://m.economictimes.com/tech/internet/data-has-become-the-new-oil-says-nandan-nilekani/articleshow/59703373.cms)” and the [**industry is looking at it as the next source of profits**](https://www.financialexpress.com/industry/technology/what-is-digital-green-revolution-mukesh-ambani-lists-5-ways-data-is-the-new-soil/956549/), there is a need to ensure the interest of farmers. It will not be surprising that corporations will approach this as one more profit-making possibility, as a market for so-called ‘solutions’ which lead to sale of unsustainable agri-inputs combined with greater loans and indebtedness of farmers for this through fintech, as well as [**the increased threat of dispossession by private corporations**](https://grain.org/e/6653). All this is apart from the widely documented [**exclusion and other issues**](https://fert.nic.in/sites/default/files/2019-07/Final%20Report_Assessment_of_AeFDS_Aadhaar_enabled_Fertilizer_Distribution_System_Pilot_0.pdf) related to the central role that Aadhaar plays in this ecosystem.  \n  \n&gt;  \n&gt;Ultimately, any proposal which seeks to tackle the issues that plague Indian agriculture must address the fundamental causes of these issues - something the existing implementation of the Agristack fails to do. Indeed, the [**current model relies on ‘tech-solutionism’**](https://drive.google.com/uc?export=view&amp;id=1fd_mFM-vT9TU1UheaYVzfNyCEMXc_B_G#page=32), in which it emphasises using technology to solve structural issues. Such an approach may fail to solve structural issues and instead gives rise to new problems, as has been witnessed in Indian agriculture in the past. In this case, these problems would include:  \n&gt;  \n&gt;1. Usurious lending practices.  \n&gt;  \n&gt;2. Further exploitation of farmers by procurers, including because of reduced local traders and competitors reducing the chances of getting a better price.  \n&gt;  \n&gt;3. Reduced agency on the part of farmers.  \n&gt;  \n&gt;4. Reduced transparency on the part of the government through algorithm-based decision-making. This includes the strong possibility of the database leveraging process using AI techniques that has the danger, either inadvertently or intentionally, of control systems becoming autonomous and even misaligned intelligence directing goals that are not set to our purpose. Lack of an AI policy and a legal security net in India, enhances such a danger.  \n&gt;  \n&gt;5. In India, we find that real cultivators and farmers are still not part of data systems and they are not recognised as Farmers. Digitisation of land records created new problems which have not been addressed so far.  \n&gt;  \n&gt;The government’s official [**press release states**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877) that “\\[t\\]ransparency at the central government level is benefiting the farmers”. In keeping with this government’s espousal of the idea of transparency, and in order to truly benefit farmers without compromising on their autonomy and agency and clear the air on the government’s vision for greater digitisation in agriculture we request the following immediately:  \n&gt;  \n&gt;1. The Ministry should hold consultations with all stakeholders, especially farmers’ organisations, on the direction of its digital push as well as the basis of partnerships, and put out a policy document in this regard after giving due consideration to feedback from farmers and farmer organisations. As agriculture is a state subject, the central government should consult the state governments also.  \n&gt;  \n&gt;2. All initiatives that the government has begun with private entities to integrate and / or share multiple databases with private/personal information about individual farmers or their farms be put on hold till (i) the policy framework mentioned in the earlier point is finalised by the ministry and (ii) a data protection law is passed by the Parliament. This agreement and any other such agreements with any IT organisations must be backed by adequate legal systems in India. Existing laws must be reviewed considering the advancements in the field of artificial intelligence, machine learning and big data and new laws need to be enacted accordingly.  \n&gt;  \n&gt;3. The MoU signed between the Ministry of Agriculture and Microsoft India on 13th April, 2021 should be put in the public domain on the website of the ministry, apart from being put on hold as per Point 2 above. Further, any financial commitments or implications must also be put on hold and be disclosed.\n\nSigned: Alliance for Sustainable and Holistic Agriculture (ASHA) - Kisan Swaraj, Amrita Bhoomi, Article 21 Trust, Association For Democratic Rights (Punjab), Bhoomi Ka, Breakthrough Science Society, Howrah Chapter, Cashless Consumer, Citizens Forum for Mangalore Development, Darbar Sahitya Sansada, Desi Seed Producers Company Ltd, Durgapur Biogarden Pvt. Ltd, Federation of Tamil Nadu Rice Mill Owners Association, Gramya Resource Centre for Women, Growthwatch, Gurgaon Organic Farmers Market, Inclusive Media for Change Project at Common Cause, Indian Social Action Forum (INSAF), Internet Freedom Foundation, IT for Change, Jai Kisan Andolan, Jan Chetna Sansthan, Kalanjium Women Farmers Association, Karavali Karnataka Janabhivriddhi Vedike, Karnataka Rajya Raitha Sangha, Krishi Patasala, Lipok Social Foundation, Mazdoor Kisan Shakti Sangathan (MKSS), Nalla Keerai, Nalla Sandhai, National Adivasi Alliance, National Alliance of People's Movements (NAPM), Organic Farmers Market, Paatasala, Poovulagin Nanbargal, Punarchith, reStore, Restore Gardens, Rethink Aadhaar, Rythu Swarajya Vedika, Safe Food Alliance, Samajwadi Samagam, Samanvaya Consulting, Save Our Rice Campaign Network, South Indian Coordination Committee of Farmers Movements, South Indian Organic Producers and Retailers Association, Sunray Harvesters, Tamilnadu Organic Farmers Federation, Telangana Rythu JAC, Thaalanmai Uzhavar Iyakam, Tharchaarbu Iyakkam, Thirunelly Agri Producer Company Limited, Thiruvallur Organic Farmers Group, Thondaimandalam Foundation, Women's Collective, Yugma Network.",
    "flair": "Policy/Economy",
    "score": 87,
    "num_comments": 2,
    "created_utc": 1620291722,
    "convurl": "https://b.thumbs.redditmedia.com/qs0BbMezmTq0VgLM66iMyedxJFHalo3dw92RjqojPVs.jpg",
    "comments": [],
    "cleaned_text": "standwithfarmers hold agriculture ministry microsoft india accountable ampxb tldr government recently announced microsoft would conducting pilot programme implement agristack across villages india along several organisations wrote letter union minister agriculture asked consultations stakeholders highlighted need statutory backing demanded greater transparency regards financial details project background th april press information bureau put press release stating ministry agriculture signed memorandum understanding mou microsoft pilot project villageshttpspibgovinpressreleasepageaspxprid mou microsoft roped gtto develop farmer interface smart wellorganized agriculture including postharvest management distribution press release also stated government preparing farmer database linking land records farmers across country would integrate data pm kisan soil health cards pradhan mantri crop insurance scheme well data geotagging agricultural assets shall also take place subsequent media reportshttpseconomictimesindiatimescomnewseconomyagriculturegovtinksmouwithmicrosofttoprovidepostharvestsolutionstofarmersarticleshowcms thrown light upon project union minister agriculture narendra singh tomar said microsoft would helping farmers gtpost harvest management solutions building collaborative platform capturing agriculture datasets crop yields weather data market demand prices media reports quoted senior officials agriculture ministry saying microsoft local partner cropdata leveraging using master database farmers shared government database would contain data million farmers along land records agristack pilot sounds similar agristackhttpsinternetfreedomintheagristackaprimer collection technologies digital databases proposed central government focusing indias farmers agricultural sector government confirmed existence agristack answer lok sabha questionhttploksabhaquestionsannexaupdf th march answer ministry stated task force constituted develop indea india enterprise architecture digital ecosystem agriculture basis unified farmers service platform prepared words agristack coming written agristack beforehttpsinternetfreedomintheagristackaprimer last year december worked several volunteers created brief analysis serve primer agristack primer explained agristack would function provided historical legislative context looked issues project issues include lack consultation farmer organisations increased algorithmic decisionmaking without accountability concerns privacy farmers data given existence significant concerns agristack would extremely deleterious impact farmers data may exploited private companies purposes predatory lending land grabs aadhaar mandatory authenticationbased exclusion welfare measures agricultures services reduced agency part farmers potential impacts legal rights databasing surveillance thus recommended comprehensive consultations farmers groups carried generate feedback implementation technologies spoken need academics technologists civil society digital rights organisations engage study agristack programme understand genuine problems faced farmers lastly called examination relationship personal data digital policies data empowerment protection architecture highlighted need rightscentered data protection regime undergird policies joint letter agriculture minister along organisations alliance sustainable holistic agriculture asha kisan swaraj collaborated cosigned onto joint letter sent union minister agriculture also filed rtihttpsdrivegooglecomfiledpuayvazifckfsopumatidview regarding various aspects pilot project mou joint letter cosigned close organisations collectives groups reproduced original found herehttpwwwkisanswarajinashalettertogoiondirectionpartnershipsofitsdigitalpushbyministryofagriculture gtto gt gtshri narendra singh tomar honble minister agriculture amp farmers welfare government india gt gtcc shri ravi shankar prasad union minister law justice electronics information technology dr rajiv kumar vice chairperson niti aayog shri sanjay agarwal secretary ministry agriculture amp farmers welfare shri ajay prakash sawhney secretary ministry electronics amp information technology shri anant maheshwari president microsoft india shri sachin suri managing director cropdata technology pvt ltd gt gtsubject direction partnerships digital push ministry agriculture gt gtdear sir gt gtthe union ministry agriculture microsoft india signed memorandum understanding mou th april per news reportshttpseconomictimesindiatimescomnewseconomyagriculturegovtinksmouwithmicrosofttoprovidepostharvestsolutionstofarmersarticleshowcms microsoft local partner cropdata leverage master database farmers address challenges individual group farmers government verified database million farmers along land records senior agriculture ministry official said another reporthttpspibgovinpressreleasepageaspxprid states creation agrifunds based national farmers database government preparing farmer database linking land records farmers across country data related pm kisan soil health card pradhan mantri crop insurance scheme available government integrated process inclusion data going gt gtthese developments seem allude agristackhttpsdrivegooglecomfiledxceykrqyvzvvyjcswbuirwgwgveview seem taking place policy vacuum respect data privacy farmers related issues time data become new oilhttpsmeconomictimescomtechinternetdatahasbecomethenewoilsaysnandannilekaniarticleshowcms industry looking next source profitshttpswwwfinancialexpresscomindustrytechnologywhatisdigitalgreenrevolutionmukeshambanilistswaysdataisthenewsoil need ensure interest farmers surprising corporations approach one profitmaking possibility market socalled solutions lead sale unsustainable agriinputs combined greater loans indebtedness farmers fintech well increased threat dispossession private corporationshttpsgrainorge apart widely documented exclusion issueshttpsfertnicinsitesdefaultfilesfinalreportassessmentofaefdsaadhaarenabledfertilizerdistributionsystempilotpdf related central role aadhaar plays ecosystem gt gtultimately proposal seeks tackle issues plague indian agriculture must address fundamental causes issues something existing implementation agristack fails indeed current model relies techsolutionismhttpsdrivegooglecomucexportviewampidfdmfmvttuuheayvzfnycemxcbgpage emphasises using technology solve structural issues approach may fail solve structural issues instead gives rise new problems witnessed indian agriculture past case problems would include gt gt usurious lending practices gt gt exploitation farmers procurers including reduced local traders competitors reducing chances getting better price gt gt reduced agency part farmers gt gt reduced transparency part government algorithmbased decisionmaking includes strong possibility database leveraging process using ai techniques danger either inadvertently intentionally control systems becoming autonomous even misaligned intelligence directing goals set purpose lack ai policy legal security net india enhances danger gt gt india find real cultivators farmers still part data systems recognised farmers digitisation land records created new problems addressed far gt gtthe governments official press release stateshttpspibgovinpressreleasepageaspxprid transparency central government level benefiting farmers keeping governments espousal idea transparency order truly benefit farmers without compromising autonomy agency clear air governments vision greater digitisation agriculture request following immediately gt gt ministry hold consultations stakeholders especially farmers organisations direction digital push well basis partnerships put policy document regard giving due consideration feedback farmers farmer organisations agriculture state subject central government consult state governments also gt gt initiatives government begun private entities integrate share multiple databases privatepersonal information individual farmers farms put hold till policy framework mentioned earlier point finalised ministry ii data protection law passed parliament agreement agreements organisations must backed adequate legal systems india existing laws must reviewed considering advancements field artificial intelligence machine learning big data new laws need enacted accordingly gt gt mou signed ministry agriculture microsoft india th april put public domain website ministry apart put hold per point financial commitments implications must also put hold disclosed signed alliance sustainable holistic agriculture asha kisan swaraj amrita bhoomi article trust association democratic rights punjab bhoomi ka breakthrough science society howrah chapter cashless consumer citizens forum mangalore development darbar sahitya sansada desi seed producers company ltd durgapur biogarden pvt ltd federation tamil nadu rice mill owners association gramya resource centre women growthwatch gurgaon organic farmers market inclusive media change project common cause indian social action forum insaf internet freedom foundation change jai kisan andolan jan chetna sansthan kalanjium women farmers association karavali karnataka janabhivriddhi vedike karnataka rajya raitha sangha krishi patasala lipok social foundation mazdoor kisan shakti sangathan mkss nalla keerai nalla sandhai national adivasi alliance national alliance peoples movements napm organic farmers market paatasala poovulagin nanbargal punarchith restore restore gardens rethink aadhaar rythu swarajya vedika safe food alliance samajwadi samagam samanvaya consulting save rice campaign network south indian coordination committee farmers movements south indian organic producers retailers association sunray harvesters tamilnadu organic farmers federation telangana rythu jac thaalanmai uzhavar iyakam tharchaarbu iyakkam thirunelly agri producer company limited thiruvallur organic farmers group thondaimandalam foundation womens collective yugma network ",
    "cleaned_title": "standwithfarmers hold agriculture ministry microsoft india accountable",
    "cleaned_selftext": "ampxb tldr government recently announced microsoft would conducting pilot programme implement agristack across villages india along several organisations wrote letter union minister agriculture asked consultations stakeholders highlighted need statutory backing demanded greater transparency regards financial details project background th april press information bureau put press release stating ministry agriculture signed memorandum understanding mou microsoft pilot project villageshttpspibgovinpressreleasepageaspxprid mou microsoft roped gtto develop farmer interface smart wellorganized agriculture including postharvest management distribution press release also stated government preparing farmer database linking land records farmers across country would integrate data pm kisan soil health cards pradhan mantri crop insurance scheme well data geotagging agricultural assets shall also take place subsequent media reportshttpseconomictimesindiatimescomnewseconomyagriculturegovtinksmouwithmicrosofttoprovidepostharvestsolutionstofarmersarticleshowcms thrown light upon project union minister agriculture narendra singh tomar said microsoft would helping farmers gtpost harvest management solutions building collaborative platform capturing agriculture datasets crop yields weather data market demand prices media reports quoted senior officials agriculture ministry saying microsoft local partner cropdata leveraging using master database farmers shared government database would contain data million farmers along land records agristack pilot sounds similar agristackhttpsinternetfreedomintheagristackaprimer collection technologies digital databases proposed central government focusing indias farmers agricultural sector government confirmed existence agristack answer lok sabha questionhttploksabhaquestionsannexaupdf th march answer ministry stated task force constituted develop indea india enterprise architecture digital ecosystem agriculture basis unified farmers service platform prepared words agristack coming written agristack beforehttpsinternetfreedomintheagristackaprimer last year december worked several volunteers created brief analysis serve primer agristack primer explained agristack would function provided historical legislative context looked issues project issues include lack consultation farmer organisations increased algorithmic decisionmaking without accountability concerns privacy farmers data given existence significant concerns agristack would extremely deleterious impact farmers data may exploited private companies purposes predatory lending land grabs aadhaar mandatory authenticationbased exclusion welfare measures agricultures services reduced agency part farmers potential impacts legal rights databasing surveillance thus recommended comprehensive consultations farmers groups carried generate feedback implementation technologies spoken need academics technologists civil society digital rights organisations engage study agristack programme understand genuine problems faced farmers lastly called examination relationship personal data digital policies data empowerment protection architecture highlighted need rightscentered data protection regime undergird policies joint letter agriculture minister along organisations alliance sustainable holistic agriculture asha kisan swaraj collaborated cosigned onto joint letter sent union minister agriculture also filed rtihttpsdrivegooglecomfiledpuayvazifckfsopumatidview regarding various aspects pilot project mou joint letter cosigned close organisations collectives groups reproduced original found herehttpwwwkisanswarajinashalettertogoiondirectionpartnershipsofitsdigitalpushbyministryofagriculture gtto gt gtshri narendra singh tomar honble minister agriculture amp farmers welfare government india gt gtcc shri ravi shankar prasad union minister law justice electronics information technology dr rajiv kumar vice chairperson niti aayog shri sanjay agarwal secretary ministry agriculture amp farmers welfare shri ajay prakash sawhney secretary ministry electronics amp information technology shri anant maheshwari president microsoft india shri sachin suri managing director cropdata technology pvt ltd gt gtsubject direction partnerships digital push ministry agriculture gt gtdear sir gt gtthe union ministry agriculture microsoft india signed memorandum understanding mou th april per news reportshttpseconomictimesindiatimescomnewseconomyagriculturegovtinksmouwithmicrosofttoprovidepostharvestsolutionstofarmersarticleshowcms microsoft local partner cropdata leverage master database farmers address challenges individual group farmers government verified database million farmers along land records senior agriculture ministry official said another reporthttpspibgovinpressreleasepageaspxprid states creation agrifunds based national farmers database government preparing farmer database linking land records farmers across country data related pm kisan soil health card pradhan mantri crop insurance scheme available government integrated process inclusion data going gt gtthese developments seem allude agristackhttpsdrivegooglecomfiledxceykrqyvzvvyjcswbuirwgwgveview seem taking place policy vacuum respect data privacy farmers related issues time data become new oilhttpsmeconomictimescomtechinternetdatahasbecomethenewoilsaysnandannilekaniarticleshowcms industry looking next source profitshttpswwwfinancialexpresscomindustrytechnologywhatisdigitalgreenrevolutionmukeshambanilistswaysdataisthenewsoil need ensure interest farmers surprising corporations approach one profitmaking possibility market socalled solutions lead sale unsustainable agriinputs combined greater loans indebtedness farmers fintech well increased threat dispossession private corporationshttpsgrainorge apart widely documented exclusion issueshttpsfertnicinsitesdefaultfilesfinalreportassessmentofaefdsaadhaarenabledfertilizerdistributionsystempilotpdf related central role aadhaar plays ecosystem gt gtultimately proposal seeks tackle issues plague indian agriculture must address fundamental causes issues something existing implementation agristack fails indeed current model relies techsolutionismhttpsdrivegooglecomucexportviewampidfdmfmvttuuheayvzfnycemxcbgpage emphasises using technology solve structural issues approach may fail solve structural issues instead gives rise new problems witnessed indian agriculture past case problems would include gt gt usurious lending practices gt gt exploitation farmers procurers including reduced local traders competitors reducing chances getting better price gt gt reduced agency part farmers gt gt reduced transparency part government algorithmbased decisionmaking includes strong possibility database leveraging process using ai techniques danger either inadvertently intentionally control systems becoming autonomous even misaligned intelligence directing goals set purpose lack ai policy legal security net india enhances danger gt gt india find real cultivators farmers still part data systems recognised farmers digitisation land records created new problems addressed far gt gtthe governments official press release stateshttpspibgovinpressreleasepageaspxprid transparency central government level benefiting farmers keeping governments espousal idea transparency order truly benefit farmers without compromising autonomy agency clear air governments vision greater digitisation agriculture request following immediately gt gt ministry hold consultations stakeholders especially farmers organisations direction digital push well basis partnerships put policy document regard giving due consideration feedback farmers farmer organisations agriculture state subject central government consult state governments also gt gt initiatives government begun private entities integrate share multiple databases privatepersonal information individual farmers farms put hold till policy framework mentioned earlier point finalised ministry ii data protection law passed parliament agreement agreements organisations must backed adequate legal systems india existing laws must reviewed considering advancements field artificial intelligence machine learning big data new laws need enacted accordingly gt gt mou signed ministry agriculture microsoft india th april put public domain website ministry apart put hold per point financial commitments implications must also put hold disclosed signed alliance sustainable holistic agriculture asha kisan swaraj amrita bhoomi article trust association democratic rights punjab bhoomi ka breakthrough science society howrah chapter cashless consumer citizens forum mangalore development darbar sahitya sansada desi seed producers company ltd durgapur biogarden pvt ltd federation tamil nadu rice mill owners association gramya resource centre women growthwatch gurgaon organic farmers market inclusive media change project common cause indian social action forum insaf internet freedom foundation change jai kisan andolan jan chetna sansthan kalanjium women farmers association karavali karnataka janabhivriddhi vedike karnataka rajya raitha sangha krishi patasala lipok social foundation mazdoor kisan shakti sangathan mkss nalla keerai nalla sandhai national adivasi alliance national alliance peoples movements napm organic farmers market paatasala poovulagin nanbargal punarchith restore restore gardens rethink aadhaar rythu swarajya vedika safe food alliance samajwadi samagam samanvaya consulting save rice campaign network south indian coordination committee farmers movements south indian organic producers retailers association sunray harvesters tamilnadu organic farmers federation telangana rythu jac thaalanmai uzhavar iyakam tharchaarbu iyakkam thirunelly agri producer company limited thiruvallur organic farmers group thondaimandalam foundation womens collective yugma network",
    "cleaned_comments": "",
    "light_cleaned_title": "#StandWithFarmers: Hold the Agriculture Ministry and Microsoft India accountable",
    "light_cleaned_selftext": "### Tl;dr The Government recently announced that Microsoft would be conducting a pilot programme to implement the Agristack across 100 villages of India. Along with several other organisations, we wrote a letter to the Union Minister for Agriculture, in which we asked for further consultations with all stakeholders, highlighted the need for statutory backing, and demanded greater transparency with regards to the financial details of the project. ### Background On the 14th of April, 2021, the Press Information Bureau put a press release stating the Ministry of Agriculture had [**signed a Memorandum of Understanding (MoU) with Microsoft for a pilot project in 100 villages**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877). Under this MoU, Microsoft has been roped in to &gt;\"to develop farmer interface for smart and well-organized agriculture, including post-harvest management and distribution\". The press release also stated that the government is preparing a farmer database by linking the land records of farmers across the country that would integrate data from PM Kisan, Soil Health Cards, and the Pradhan Mantri Crop Insurance Scheme as well as other data. Geo-tagging of agricultural assets shall also take place. Subsequent [**media reports**](https://economictimes.indiatimes.com/news/economy/agriculture/govt-inks-mou-with-microsoft-to-provide-post-harvest-solutions-to-farmers/articleshow/82076622.cms) have thrown further light upon on the project: the Union Minister for Agriculture, Narendra Singh Tomar, said that Microsoft would be helping farmers with &gt;\"post harvest management solutions through building a collaborative platform and capturing agriculture datasets such as crop yields, weather data, market demand and prices\". The media reports have quoted senior officials in the Agriculture ministry as saying that Microsoft and its local partner CropData will be \"leveraging\" (using) a master database of farmers that will be shared with them by the government. This database would contain the data of 50 million farmers along with their land records. ## The Agristack This pilot sounds very similar to the \"[**Agristack**](https://internetfreedom.in/the-agristack-a-primer/)\", which is the collection of technologies and digital databases, proposed by the Central Government focusing on India’s farmers and the agricultural sector. The Government confirmed the existence of the Agristack in [**an answer to a Lok Sabha question**](http://164.100.24.220/loksabhaquestions/annex/175/AU2504.pdf) on 9th March, 2021. In the answer, the Ministry stated that a task force has been constituted to develop the IndEA (India Enterprise Architecture) Digital Ecosystem of Agriculture, on the basis of which a Unified Farmers Service Platform will be prepared. In other words, the Agristack is coming. We have [**written about the Agristack before**](https://internetfreedom.in/the-agristack-a-primer/): last year in December, we worked with several volunteers and created a brief for analysis to serve as a primer on the Agristack. In the primer, we explained how the Agristack would function, provided some historical and legislative context, and looked at some of the issues with the project. These issues include: 1. A lack of consultation with farmer organisations 2. Increased algorithmic decision-making without accountability 3. Concerns about the privacy of farmers' data Given the existence of such significant concerns, the Agristack would have an extremely deleterious impact on farmers as: * Their data may be exploited by private companies for purposes such as predatory lending or land grabs. * Aadhaar and mandatory authentication-based exclusion from welfare measures and agricultures services * Reduced agency on the part of the farmers with potential impacts on legal rights through databasing and surveillance Thus we had recommended that comprehensive consultations with farmers groups be carried to generate feedback for the implementation of such technologies. We had spoken about the need for academics, technologists, civil society, and digital rights organisations to engage with, and study the Agristack programme, so as to understand the genuine problems faced by farmers. Lastly, we had called for an examination of the relationship between personal data and digital policies such as the Data Empowerment and Protection Architecture and highlighted the need for a rights-centered data protection regime to undergird such policies. ### Joint Letter to the Agriculture Minister Along with organisations such as the Alliance for Sustainable and Holistic Agriculture (ASHA) - Kisan Swaraj, we have collaborated and co-signed onto a joint letter that has been sent to the Union Minister for Agriculture. We have also [**filed an RTI**](https://drive.google.com/file/d/15103pU9a30YVAzIfck0fsOP0uM02atiD/view) regarding various aspects of the pilot project and the MoU. The joint letter co-signed by close to 55 organisations, collectives, and groups is reproduced below; the original can be found [**here**](http://www.kisanswaraj.in/2021/05/05/asha-letter-to-goi-on-direction-partnerships-of-its-digital-push-by-ministry-of-agriculture/). &gt;To, &gt; &gt;Shri Narendra Singh Tomar, Hon’ble Minister of Agriculture &amp; Farmers’ Welfare, Government of India. &gt; &gt;Cc: Shri Ravi Shankar Prasad, Union Minister of Law and Justice, Electronics and Information Technology, Dr. Rajiv Kumar, Vice Chairperson, NITI Aayog, Shri Sanjay Agarwal, Secretary, Ministry of Agriculture &amp; Farmers Welfare, Shri Ajay Prakash Sawhney, Secretary, Ministry of Electronics &amp; Information Technology, Shri Anant Maheshwari, President of Microsoft India, Shri Sachin Suri, Managing Director of CropData Technology Pvt. Ltd. &gt; &gt;Subject: Direction and Partnerships of the digital push by the Ministry of Agriculture &gt; &gt;Dear Sir, &gt; &gt;The Union Ministry of Agriculture and Microsoft India have signed a Memorandum of Understanding (MoU) on 13th April, 2021. As per [**news reports**](https://economictimes.indiatimes.com/news/economy/agriculture/govt-inks-mou-with-microsoft-to-provide-post-harvest-solutions-to-farmers/articleshow/82076622.cms), “Microsoft through its local partner CropData will leverage master database of farmers to address challenges of individual or group of farmers. “The government has a verified database of more than 50 million farmers along with their land records,” a senior agriculture ministry official said.” Another [**report**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877) states, “the creation of Agri-Funds based on the National Farmers Database. The government is preparing a farmer database by linking the land records of farmers across the country. The data related to PM Kisan, Soil Health Card and Pradhan Mantri Crop Insurance Scheme, available with the government, have been integrated and the process of inclusion of other data is going on.” &gt; &gt;These developments seem to allude to the [**AgriStack**](https://drive.google.com/file/d/1XC7EyKRQy6VzvvYJ2cswBu0irW8gWGvE/view) and seem to be taking place in a policy vacuum with respect to the data privacy of farmers and other related issues. At a time when “[**data has become the new oil**](https://m.economictimes.com/tech/internet/data-has-become-the-new-oil-says-nandan-nilekani/articleshow/59703373.cms)” and the [**industry is looking at it as the next source of profits**](https://www.financialexpress.com/industry/technology/what-is-digital-green-revolution-mukesh-ambani-lists-5-ways-data-is-the-new-soil/956549/), there is a need to ensure the interest of farmers. It will not be surprising that corporations will approach this as one more profit-making possibility, as a market for so-called ‘solutions’ which lead to sale of unsustainable agri-inputs combined with greater loans and indebtedness of farmers for this through fintech, as well as [**the increased threat of dispossession by private corporations**](https://grain.org/e/6653). All this is apart from the widely documented [**exclusion and other issues**](https://fert.nic.in/sites/default/files/2019-07/Final%20Report_Assessment_of_AeFDS_Aadhaar_enabled_Fertilizer_Distribution_System_Pilot_0.pdf) related to the central role that Aadhaar plays in this ecosystem. &gt; &gt;Ultimately, any proposal which seeks to tackle the issues that plague Indian agriculture must address the fundamental causes of these issues - something the existing implementation of the Agristack fails to do. Indeed, the [**current model relies on ‘tech-solutionism’**](https://drive.google.com/uc?export=view&amp;id=1fd_mFM-vT9TU1UheaYVzfNyCEMXc_B_G#page=32), in which it emphasises using technology to solve structural issues. Such an approach may fail to solve structural issues and instead gives rise to new problems, as has been witnessed in Indian agriculture in the past. In this case, these problems would include: &gt; &gt;1. Usurious lending practices. &gt; &gt;2. Further exploitation of farmers by procurers, including because of reduced local traders and competitors reducing the chances of getting a better price. &gt; &gt;3. Reduced agency on the part of farmers. &gt; &gt;4. Reduced transparency on the part of the government through algorithm-based decision-making. This includes the strong possibility of the database leveraging process using AI techniques that has the danger, either inadvertently or intentionally, of control systems becoming autonomous and even misaligned intelligence directing goals that are not set to our purpose. Lack of an AI policy and a legal security net in India, enhances such a danger. &gt; &gt;5. In India, we find that real cultivators and farmers are still not part of data systems and they are not recognised as Farmers. Digitisation of land records created new problems which have not been addressed so far. &gt; &gt;The government’s official [**press release states**](https://pib.gov.in/PressReleasePage.aspx?PRID=1711877) that “\\[t\\]ransparency at the central government level is benefiting the farmers”. In keeping with this government’s espousal of the idea of transparency, and in order to truly benefit farmers without compromising on their autonomy and agency and clear the air on the government’s vision for greater digitisation in agriculture we request the following immediately: &gt; &gt;1. The Ministry should hold consultations with all stakeholders, especially farmers’ organisations, on the direction of its digital push as well as the basis of partnerships, and put out a policy document in this regard after giving due consideration to feedback from farmers and farmer organisations. As agriculture is a state subject, the central government should consult the state governments also. &gt; &gt;2. All initiatives that the government has begun with private entities to integrate and / or share multiple databases with private/personal information about individual farmers or their farms be put on hold till (i) the policy framework mentioned in the earlier point is finalised by the ministry and (ii) a data protection law is passed by the Parliament. This agreement and any other such agreements with any IT organisations must be backed by adequate legal systems in India. Existing laws must be reviewed considering the advancements in the field of artificial intelligence, machine learning and big data and new laws need to be enacted accordingly. &gt; &gt;3. The MoU signed between the Ministry of Agriculture and Microsoft India on 13th April, 2021 should be put in the public domain on the website of the ministry, apart from being put on hold as per Point 2 above. Further, any financial commitments or implications must also be put on hold and be disclosed. Signed: Alliance for Sustainable and Holistic Agriculture (ASHA) - Kisan Swaraj, Amrita Bhoomi, Article 21 Trust, Association For Democratic Rights (Punjab), Bhoomi Ka, Breakthrough Science Society, Howrah Chapter, Cashless Consumer, Citizens Forum for Mangalore Development, Darbar Sahitya Sansada, Desi Seed Producers Company Ltd, Durgapur Biogarden Pvt. Ltd, Federation of Tamil Nadu Rice Mill Owners Association, Gramya Resource Centre for Women, Growthwatch, Gurgaon Organic Farmers Market, Inclusive Media for Change Project at Common Cause, Indian Social Action Forum (INSAF), Internet Freedom Foundation, IT for Change, Jai Kisan Andolan, Jan Chetna Sansthan, Kalanjium Women Farmers Association, Karavali Karnataka Janabhivriddhi Vedike, Karnataka Rajya Raitha Sangha, Krishi Patasala, Lipok Social Foundation, Mazdoor Kisan Shakti Sangathan (MKSS), Nalla Keerai, Nalla Sandhai, National Adivasi Alliance, National Alliance of People's Movements (NAPM), Organic Farmers Market, Paatasala, Poovulagin Nanbargal, Punarchith, reStore, Restore Gardens, Rethink Aadhaar, Rythu Swarajya Vedika, Safe Food Alliance, Samajwadi Samagam, Samanvaya Consulting, Save Our Rice Campaign Network, South Indian Coordination Committee of Farmers Movements, South Indian Organic Producers and Retailers Association, Sunray Harvesters, Tamilnadu Organic Farmers Federation, Telangana Rythu JAC, Thaalanmai Uzhavar Iyakam, Tharchaarbu Iyakkam, Thirunelly Agri Producer Company Limited, Thiruvallur Organic Farmers Group, Thondaimandalam Foundation, Women's Collective, Yugma Network.",
    "light_cleaned_comments": ""
}