{
    "id": "16tgmny",
    "title": "Dealing with customer support is almost always a bad experience and a headache!",
    "url": "https://www.reddit.com/r/india/comments/16tgmny/dealing_with_customer_support_is_almost_always_a/",
    "selftext": "[rant]\n\nI got an Acer monitor from Amazon for my dad's PC as he was having trouble reading the previous one (smaller size, also Acer). Everything looked good when I first set it up, but when I checked it a few days back there were a lot of dead pixels. Checked again the next day and there were *more* dead pixels. As the return window with Amazon had passed, I immediately raised a request with the company. They asked me to send pics of the BIOS screen over email. Shared the photos and also a [video which clearly shows the dead pixels](https://imgur.com/a/beHqy9O) (the images aren't very clear as the BIOS has a bright white background).\n\nWell what would you know, these people have been driving me up a wall these couple of days with the same canned response of \"we cannot open or see your files pls send pdf or jpg format saarrr\". [When I send the pdf and jpg, I get the same response](https://i.imgur.com/AJBbBLH.png).\n\nI know I have to escalate this issue and talk to a manager, or spend half my day taking the monitor to a service center even if it's under \"onsite service warranty\". If they still don't cooperate, I have to approach the consumer forum. Eventually this will be resolved, but at what cost?\n\nEvery time I have to contact customer support I lose a few months of my life to stress and anger. The state of affairs in this sector is beyond pathetic. I have personally worked in support for many years (though b2b, not b2c) and was so \"dedicated\" at my work that I burned myself out. Yet the support sector is mostly filled with goddamn idiots who can neither write nor understand basic language or have any interest in doing their job.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695809565.0,
    "convurl": "https://external-preview.redd.it/_6_asg_doqXiWGSRiQa2gdm527C5UiHy6k_OAkmNdfs.jpg?auto=webp&s=f49daaac08bc4077c509567382d5bb846ec0759a",
    "comments": [],
    "cleaned_text": "dealing customer support almost always bad experience headache rant got acer monitor amazon dads pc trouble reading previous one smaller size also acer everything looked good first set checked days back lot dead pixels checked next day dead pixels return window amazon passed immediately raised request company asked send pics bios screen email shared photos also video clearly shows dead pixelshttpsimgurcomabehqyo images arent clear bios bright white background well would know people driving wall couple days canned response open see files pls send pdf jpg format saarrr send pdf jpg get responsehttpsiimgurcomajbbblhpng know escalate issue talk manager spend half day taking monitor service center even onsite service warranty still dont cooperate approach consumer forum eventually resolved cost every time contact customer support lose months life stress anger state affairs sector beyond pathetic personally worked support many years though bb bc dedicated work burned yet support sector mostly filled goddamn idiots neither write understand basic language interest job ",
    "cleaned_title": "dealing customer support almost always bad experience headache",
    "cleaned_selftext": "rant got acer monitor amazon dads pc trouble reading previous one smaller size also acer everything looked good first set checked days back lot dead pixels checked next day dead pixels return window amazon passed immediately raised request company asked send pics bios screen email shared photos also video clearly shows dead pixelshttpsimgurcomabehqyo images arent clear bios bright white background well would know people driving wall couple days canned response open see files pls send pdf jpg format saarrr send pdf jpg get responsehttpsiimgurcomajbbblhpng know escalate issue talk manager spend half day taking monitor service center even onsite service warranty still dont cooperate approach consumer forum eventually resolved cost every time contact customer support lose months life stress anger state affairs sector beyond pathetic personally worked support many years though bb bc dedicated work burned yet support sector mostly filled goddamn idiots neither write understand basic language interest job",
    "cleaned_comments": "",
    "light_cleaned_title": "Dealing with customer support is almost always a bad experience and a headache!",
    "light_cleaned_selftext": "[rant] I got an Acer monitor from Amazon for my dad's PC as he was having trouble reading the previous one (smaller size, also Acer). Everything looked good when I first set it up, but when I checked it a few days back there were a lot of dead pixels. Checked again the next day and there were *more* dead pixels. As the return window with Amazon had passed, I immediately raised a request with the company. They asked me to send pics of the BIOS screen over email. Shared the photos and also a [video which clearly shows the dead pixels](https://imgur.com/a/beHqy9O) (the images aren't very clear as the BIOS has a bright white background). Well what would you know, these people have been driving me up a wall these couple of days with the same canned response of \"we cannot open or see your files pls send pdf or jpg format saarrr\". [When I send the pdf and jpg, I get the same response](https://i.imgur.com/AJBbBLH.png). I know I have to escalate this issue and talk to a manager, or spend half my day taking the monitor to a service center even if it's under \"onsite service warranty\". If they still don't cooperate, I have to approach the consumer forum. Eventually this will be resolved, but at what cost? Every time I have to contact customer support I lose a few months of my life to stress and anger. The state of affairs in this sector is beyond pathetic. I have personally worked in support for many years (though b2b, not b2c) and was so \"dedicated\" at my work that I burned myself out. Yet the support sector is mostly filled with goddamn idiots who can neither write nor understand basic language or have any interest in doing their job.",
    "light_cleaned_comments": ""
}