{
    "id": "1chlhv4",
    "title": "EPF is not a safe investment. There is no guarantee of your funds being returned.",
    "url": "https://www.reddit.com/r/india/comments/1chlhv4/epf_is_not_a_safe_investment_there_is_no/",
    "selftext": "I am so tired of dealing with EPF and their bureaucracy. I am convinced that there is a system wide initiative in EPF to block as many claims as possible and keep money locked into the system. Apparently they are [denying 1 out of 3 claims](https://indianexpress.com/article/business/rejection-of-final-epf-claims-sees-surge-in-5-yrs-up-from-13-to-34-9177874/).\n\nAccording to EPF's rules posted on their website [here](https://www.epfindia.gov.in/site_docs/PDFs/Downloads_PDFs/TypesOfAdvances_Form31.pdf), an employee can withdraw their full employee contribution along with interest if they did not receive wages for more than 2 months. Non-receipt of wages can be for any reason other than strike. There are no other conditions listed in the document. All of this is described pretty clearly under Para 68H Section A. Many websites and blogs also describe this withdrawal clause with similar terms.\n\nI have not received wages for more than 2 months and it is not due to strike. So I satisfy the conditions listed in the section. I filed a withdrawal claim online requesting a withdrawal under non-receipt of wages of section. (Don't get me started on how bad the website is and how hard it is file a claim.. :|). \n\nI get a response **15 days later** saying my claim was denied. Reason was given as \"1) NOT ELIGIBLE FOR ADVANCE UNDER SUCH PARA 2) NOT ELIGIBLE-INSUFFICIENT SERVICE\". This makes no sense since there is no requirement for minimum service under this section.\n\nI filed a grievance on their portal and the response I got was that \"This is only when your company declared lockout and not paid wages for more than 2 months\". They are reading their own rules wrong and denying claims based on their incorrect understanding! The reason they gave in the claim denial does not even match the reason they gave in response to the grievance. The final nail in the coffin is that the grievance was closed as complete and there is now no way to escalate this case except to send emails to random officers listed on the EPF website and hope that they respond.\n\nThis is completely unacceptable in 2024. Why does an officer get to deny a valid withdrawal claim and then provide no way to get the claim reviewed? Why does the officer even need to review a simple claim which can be checked automatically by the system and approved?\n\nSome of the other withdrawal clauses have more requirements. If they can't approve a simple case with almost no requirements, how can I expect that they will carefully review complicated claims and respond properly? What if I have a medical emergency and need these funds? These funds are simply locked away in a black box with no hope of easy access.",
    "flair": "Rant / Vent",
    "score": 32,
    "num_comments": 26,
    "created_utc": 1714568183.0,
    "convurl": "https://external-preview.redd.it/TFGq-KtPmZ_nsK-wu_5SpffiRNHjYwRp6Rda5GOCPUg.jpg?auto=webp&s=3b0edb6acb23f71e6f449671d612db4a1cbabac5",
    "comments": [
        "Epf is a huge scam just waiting to get discovered. The difficulties in withdrawing money is precisely because government doesn't want people to take its easy money pot away. Are you still employed with your current company? If not you can mark the last date in epf portal and try your luck again.",
        "Yeah it's insane how bad they are. My exit date is marked correctly. They are just blatantly ignoring their own rules and denying claims. They are even putting it in writing!",
        "I read an article that said EPF money is not available for withdrawal in most cases because it simply doesn't have the money in the account. It's just on paper. That money has already been used up for other purposes. ",
        "Yes that seems very likely",
        "I don't think it's a scam and those are the pretty bold statement that they don't have money, etc... \n\nIt's sad but our government organisations aren't efficient at all. \n\n- Govt employees have zero interest in their jobs, they don't have any incentive to pass your claim.\n- Rules are also complicated. \n- There is no powerful governing body (e.g. RBI, SEBI, IRDAI) where they have to answer why your claim didn't pass within X days.",
        "EPF is a garbage scheme for a garbage organisation, it should never have been made mandatory given just how ridiculouslly inefficient the entire process is handled.\n\nThe whole transition to online was just a facade  , if anything it's even worse now. Every fucking time I tried toale a withdrawal or transfer /link a PF to my current account I got shit rejections like father's name not matching , bank account not matching\n Raise a grievance and they ask you to go to the physical office, where the fuckers ask for bribes to process things.\n\nSo I pay the salaries of these scums with my income tax and then pay for bribes all to take my own money.\n\nI have colleagues who mock me for not increasing my voluntary contributions for tax benefits plus added returns. They haven't raised any request yet, so they don't know just how hard it's to get your own money back from these scums. I would rather pay extra tax in an investment like MFs where I get the money in my account processed within 3 days than save tax and deal with them.\n\nI regularly try to arrange the basic and discretionary components of my salary in such a way so as to minimize my pf contributions. But sadly there's a limit , and I try to treat that money as sunk cost which I will probably never get back. \n\nOne of the worst govt insitititutions in the country",
        "There is an estimated $154 billion US dollars in the EPF account. Do we have any idea where this money is invested currently?",
        "> They haven't raised any request yet\n\nEverybody should try to raise a request with PF before deciding to increase their contributions. No point in saving tax if the core amount is locked up and inaccessible.\n\nYou made the right choice to reduce your contribution.",
        "It's a different question. But what others (and maybe you also) in this thread are talking about pretty much bold statement. I hope you understand the depth. It's not about one random fund company l.\n\nAnyway, EPF invests in Index ETF and govt securities.",
        "Idk I recently raised a claim for 1 lakh it was processed within 14 days and deposit to my account",
        "Yup its utter crap. The website is down most of the time. Chances of get money back are just like a dice roll....",
        "I haven’t got my interest credited for this year and saw some articles on the same as well. Unfortunately Umang app and site are not even working now. Has anyone got interest or any updates?",
        "HR in my last company never bothered to complete bank account kyc, now I can't even file a claim. Garbage organization.",
        "I had interest credited to my account. It took many many tries before I was able to access my passbook.",
        "That should be known to any amateur right. Government is actively trying to use the money. You think they keep all the money in a big building like Scrooge McDuck and give it to you when you want",
        "I have been struggling with EPFO for the past two years. Transfer claims get held up for ages. And finally they get rejected without a real reason. \n\nRaising grievence has zero impact. Nothing seems to work and I just desperately need to pull out my money. \n\nThis sucks big time and I wish the same pain on the EPFO as they have inflicted on me.",
        "My money has been stuck with EPFO. There is no clarity, no accountability and no transparency. I have friends who believe EPFO is great, the website UI / UX is exceptional and withdrawing money is a piece of cake. \n\nOh, the shock and surprise they are in for.",
        "> the website UI / UX is exceptional\n\nIgnoring everything else, how can anyone believe this? The EPF website is terrible! \n\nWhy do they have two separate websites to track your EPF account and balance? Why do both the websites have completely different UI/UX. Why does the UAN website need an OTP to login but the EPF passbook does not need one. If you want to know the reason for a claim rejection, you have to login to the passbook website instead of the main UAN website. They use such outdated number verification systems instead of modern Captcha systems. They have atrocious downtimes (weeks at time) during which no claims can be filed. \n\nI can go on and on!",
        ">Ignoring everything else, how can anyone believe this? The EPF website is terrible!  \n  \nI am not joking but this is because they feel accepting the UI / UX sucks == criticizing the current government.",
        "I'm curious: was it for home loan or some medical emergency?",
        "Bank account can be attached (with kyc) on pf portal it self.",
        "for me it says pending with employer for verification",
        "Usually that's only got transfers. Kyc is through aadhar. May be when selecting it you have opted for employer attestation. Either way better reach out to the company or raise the kyc again.",
        "https://preview.redd.it/1225w7kzruxc1.png?width=1871&format=png&auto=webp&s=4cbd40459da66174166ed8c67d74214c1bc1bcd2",
        "So it's failed and not waiting on your employer. Here dsc sign is aadhar. Go to your kyc/profile and check if it provides you option to verify again. For this to work your bank account must be linked to aadhar.",
        "I'm sure it is linked to aadhar but I'll try again  \nThanks a lot for listening so far, it's atleast a bit relieving to see and empathize with this problem. All grievances logged with the EPFO office just asked me to try with my employer.",
        "Interest I believe takes a long time to be credited. I dont remember but maybe it was June/July when it was credited last year?",
        "Medical but not emergency",
        "EPF is a public organisation. use RTI.",
        "OP, were you finally able to withdraw the money? u/350HP",
        "I took the advice from people in this thread and filed a small medical claim. It was approved 15 days later and I was able to withdraw part of my PF balance. I’ll keep filing these claims and eventually withdraw all the PF balance.",
        "Now that you're able to withdraw the money, would you recommend one to opt out of PF op? It does have an interest rate of 8+% and 12% contribution by employer right. Is it even worth it? Is it mandatory for employees earning 15+k? \nu/350HP",
        "If you are ok with having your money locked up in a non-accessible fund and have the patience to deal with the corrupt officials to get access money to your own money, then yes definitely."
    ],
    "cleaned_text": "epf safe investment guarantee funds returned tired dealing epf bureaucracy convinced system wide initiative epf block many claims possible keep money locked system apparently denying claimshttpsindianexpresscomarticlebusinessrejectionoffinalepfclaimsseessurgeinyrsupfromto according epfs rules posted website herehttpswwwepfindiagovinsitedocspdfsdownloadspdfstypesofadvancesformpdf employee withdraw full employee contribution along interest receive wages months nonreceipt wages reason strike conditions listed document described pretty clearly para h section many websites blogs also describe withdrawal clause similar terms received wages months due strike satisfy conditions listed section filed withdrawal claim online requesting withdrawal nonreceipt wages section dont get started bad website hard file claim get response days later saying claim denied reason given eligible advance para eligibleinsufficient service makes sense since requirement minimum service section filed grievance portal response got company declared lockout paid wages months reading rules wrong denying claims based incorrect understanding reason gave claim denial even match reason gave response grievance final nail coffin grievance closed complete way escalate case except send emails random officers listed epf website hope respond completely unacceptable officer get deny valid withdrawal claim provide way get claim reviewed officer even need review simple claim checked automatically system approved withdrawal clauses requirements cant approve simple case almost requirements expect carefully review complicated claims respond properly medical emergency need funds funds simply locked away black box hope easy access ",
    "cleaned_title": "epf safe investment guarantee funds returned",
    "cleaned_selftext": "tired dealing epf bureaucracy convinced system wide initiative epf block many claims possible keep money locked system apparently denying claimshttpsindianexpresscomarticlebusinessrejectionoffinalepfclaimsseessurgeinyrsupfromto according epfs rules posted website herehttpswwwepfindiagovinsitedocspdfsdownloadspdfstypesofadvancesformpdf employee withdraw full employee contribution along interest receive wages months nonreceipt wages reason strike conditions listed document described pretty clearly para h section many websites blogs also describe withdrawal clause similar terms received wages months due strike satisfy conditions listed section filed withdrawal claim online requesting withdrawal nonreceipt wages section dont get started bad website hard file claim get response days later saying claim denied reason given eligible advance para eligibleinsufficient service makes sense since requirement minimum service section filed grievance portal response got company declared lockout paid wages months reading rules wrong denying claims based incorrect understanding reason gave claim denial even match reason gave response grievance final nail coffin grievance closed complete way escalate case except send emails random officers listed epf website hope respond completely unacceptable officer get deny valid withdrawal claim provide way get claim reviewed officer even need review simple claim checked automatically system approved withdrawal clauses requirements cant approve simple case almost requirements expect carefully review complicated claims respond properly medical emergency need funds funds simply locked away black box hope easy access",
    "cleaned_comments": "epf huge scam waiting get discovered difficulties withdrawing money precisely government doesnt want people take easy money pot away still employed current company mark last date epf portal try luck yeah insane bad exit date marked correctly blatantly ignoring rules denying claims even putting writing read article said epf money available withdrawal cases simply doesnt money account paper money already used purposes yes seems likely dont think scam pretty bold statement dont money etc sad government organisations arent efficient govt employees zero interest jobs dont incentive pass claim rules also complicated powerful governing body eg rbi sebi irdai answer claim didnt pass within x days epf garbage scheme garbage organisation never made mandatory given ridiculouslly inefficient entire process handled whole transition online facade anything even worse every fucking time tried toale withdrawal transfer link pf current account got shit rejections like fathers name matching bank account matching raise grievance ask go physical office fuckers ask bribes process things pay salaries scums income tax pay bribes take money colleagues mock increasing voluntary contributions tax benefits plus added returns havent raised request yet dont know hard get money back scums would rather pay extra tax investment like mfs get money account processed within days save tax deal regularly try arrange basic discretionary components salary way minimize pf contributions sadly theres limit try treat money sunk cost probably never get back one worst govt insitititutions country estimated billion us dollars epf account idea money invested currently havent raised request yet everybody try raise request pf deciding increase contributions point saving tax core amount locked inaccessible made right choice reduce contribution different question others maybe also thread talking pretty much bold statement hope understand depth one random fund company l anyway epf invests index etf govt securities idk recently raised claim lakh processed within days deposit account yup utter crap website time chances get money back like dice roll havent got interest credited year saw articles well unfortunately umang app site even working anyone got interest updates hr last company never bothered complete bank account kyc cant even file claim garbage organization interest credited account took many many tries able access passbook known amateur right government actively trying use money think keep money big building like scrooge mcduck give want struggling epfo past two years transfer claims get held ages finally get rejected without real reason raising grievence zero impact nothing seems work desperately need pull money sucks big time wish pain epfo inflicted money stuck epfo clarity accountability transparency friends believe epfo great website ui ux exceptional withdrawing money piece cake oh shock surprise website ui ux exceptional ignoring everything else anyone believe epf website terrible two separate websites track epf account balance websites completely different uiux uan website need otp login epf passbook need one want know reason claim rejection login passbook website instead main uan website use outdated number verification systems instead modern captcha systems atrocious downtimes weeks time claims filed go ignoring everything else anyone believe epf website terrible joking feel accepting ui ux sucks criticizing current government im curious home loan medical emergency bank account attached kyc pf portal self says pending employer verification usually thats got transfers kyc aadhar may selecting opted employer attestation either way better reach company raise kyc failed waiting employer dsc sign aadhar go kycprofile check provides option verify work bank account must linked aadhar im sure linked aadhar ill try thanks lot listening far atleast bit relieving see empathize problem grievances logged epfo office asked try employer interest believe takes long time credited dont remember maybe junejuly credited last year medical emergency epf public organisation use rti op finally able withdraw money uhp took advice people thread filed small medical claim approved days later able withdraw part pf balance ill keep filing claims eventually withdraw pf balance youre able withdraw money would recommend one opt pf op interest rate contribution employer right even worth mandatory employees earning k uhp ok money locked nonaccessible fund patience deal corrupt officials get access money money yes definitely",
    "light_cleaned_title": "EPF is not a safe investment. There is no guarantee of your funds being returned.",
    "light_cleaned_selftext": "I am so tired of dealing with EPF and their bureaucracy. I am convinced that there is a system wide initiative in EPF to block as many claims as possible and keep money locked into the system. Apparently they are [denying 1 out of 3 claims](https://indianexpress.com/article/business/rejection-of-final-epf-claims-sees-surge-in-5-yrs-up-from-13-to-34-9177874/). According to EPF's rules posted on their website [here](https://www.epfindia.gov.in/site_docs/PDFs/Downloads_PDFs/TypesOfAdvances_Form31.pdf), an employee can withdraw their full employee contribution along with interest if they did not receive wages for more than 2 months. Non-receipt of wages can be for any reason other than strike. There are no other conditions listed in the document. All of this is described pretty clearly under Para 68H Section A. Many websites and blogs also describe this withdrawal clause with similar terms. I have not received wages for more than 2 months and it is not due to strike. So I satisfy the conditions listed in the section. I filed a withdrawal claim online requesting a withdrawal under non-receipt of wages of section. (Don't get me started on how bad the website is and how hard it is file a claim.. :|). I get a response **15 days later** saying my claim was denied. Reason was given as \"1) NOT ELIGIBLE FOR ADVANCE UNDER SUCH PARA 2) NOT ELIGIBLE-INSUFFICIENT SERVICE\". This makes no sense since there is no requirement for minimum service under this section. I filed a grievance on their portal and the response I got was that \"This is only when your company declared lockout and not paid wages for more than 2 months\". They are reading their own rules wrong and denying claims based on their incorrect understanding! The reason they gave in the claim denial does not even match the reason they gave in response to the grievance. The final nail in the coffin is that the grievance was closed as complete and there is now no way to escalate this case except to send emails to random officers listed on the EPF website and hope that they respond. This is completely unacceptable in 2024. Why does an officer get to deny a valid withdrawal claim and then provide no way to get the claim reviewed? Why does the officer even need to review a simple claim which can be checked automatically by the system and approved? Some of the other withdrawal clauses have more requirements. If they can't approve a simple case with almost no requirements, how can I expect that they will carefully review complicated claims and respond properly? What if I have a medical emergency and need these funds? These funds are simply locked away in a black box with no hope of easy access.",
    "light_cleaned_comments": "Epf is a huge scam just waiting to get discovered. The difficulties in withdrawing money is precisely because government doesn't want people to take its easy money pot away. Are you still employed with your current company? If not you can mark the last date in epf portal and try your luck again. Yeah it's insane how bad they are. My exit date is marked correctly. They are just blatantly ignoring their own rules and denying claims. They are even putting it in writing! I read an article that said EPF money is not available for withdrawal in most cases because it simply doesn't have the money in the account. It's just on paper. That money has already been used up for other purposes. Yes that seems very likely I don't think it's a scam and those are the pretty bold statement that they don't have money, etc... It's sad but our government organisations aren't efficient at all. - Govt employees have zero interest in their jobs, they don't have any incentive to pass your claim. - Rules are also complicated. - There is no powerful governing body (e.g. RBI, SEBI, IRDAI) where they have to answer why your claim didn't pass within X days. EPF is a garbage scheme for a garbage organisation, it should never have been made mandatory given just how ridiculouslly inefficient the entire process is handled. The whole transition to online was just a facade , if anything it's even worse now. Every fucking time I tried toale a withdrawal or transfer /link a PF to my current account I got shit rejections like father's name not matching , bank account not matching Raise a grievance and they ask you to go to the physical office, where the fuckers ask for bribes to process things. So I pay the salaries of these scums with my income tax and then pay for bribes all to take my own money. I have colleagues who mock me for not increasing my voluntary contributions for tax benefits plus added returns. They haven't raised any request yet, so they don't know just how hard it's to get your own money back from these scums. I would rather pay extra tax in an investment like MFs where I get the money in my account processed within 3 days than save tax and deal with them. I regularly try to arrange the basic and discretionary components of my salary in such a way so as to minimize my pf contributions. But sadly there's a limit , and I try to treat that money as sunk cost which I will probably never get back. One of the worst govt insitititutions in the country There is an estimated $154 billion US dollars in the EPF account. Do we have any idea where this money is invested currently? > They haven't raised any request yet Everybody should try to raise a request with PF before deciding to increase their contributions. No point in saving tax if the core amount is locked up and inaccessible. You made the right choice to reduce your contribution. It's a different question. But what others (and maybe you also) in this thread are talking about pretty much bold statement. I hope you understand the depth. It's not about one random fund company l. Anyway, EPF invests in Index ETF and govt securities. Idk I recently raised a claim for 1 lakh it was processed within 14 days and deposit to my account Yup its utter crap. The website is down most of the time. Chances of get money back are just like a dice roll.... I haven’t got my interest credited for this year and saw some articles on the same as well. Unfortunately Umang app and site are not even working now. Has anyone got interest or any updates? HR in my last company never bothered to complete bank account kyc, now I can't even file a claim. Garbage organization. I had interest credited to my account. It took many many tries before I was able to access my passbook. That should be known to any amateur right. Government is actively trying to use the money. You think they keep all the money in a big building like Scrooge McDuck and give it to you when you want I have been struggling with EPFO for the past two years. Transfer claims get held up for ages. And finally they get rejected without a real reason. Raising grievence has zero impact. Nothing seems to work and I just desperately need to pull out my money. This sucks big time and I wish the same pain on the EPFO as they have inflicted on me. My money has been stuck with EPFO. There is no clarity, no accountability and no transparency. I have friends who believe EPFO is great, the website UI / UX is exceptional and withdrawing money is a piece of cake. Oh, the shock and surprise they are in for. > the website UI / UX is exceptional Ignoring everything else, how can anyone believe this? The EPF website is terrible! Why do they have two separate websites to track your EPF account and balance? Why do both the websites have completely different UI/UX. Why does the UAN website need an OTP to login but the EPF passbook does not need one. If you want to know the reason for a claim rejection, you have to login to the passbook website instead of the main UAN website. They use such outdated number verification systems instead of modern Captcha systems. They have atrocious downtimes (weeks at time) during which no claims can be filed. I can go on and on! >Ignoring everything else, how can anyone believe this? The EPF website is terrible! I am not joking but this is because they feel accepting the UI / UX sucks == criticizing the current government. I'm curious: was it for home loan or some medical emergency? Bank account can be attached (with kyc) on pf portal it self. for me it says pending with employer for verification Usually that's only got transfers. Kyc is through aadhar. May be when selecting it you have opted for employer attestation. Either way better reach out to the company or raise the kyc again. So it's failed and not waiting on your employer. Here dsc sign is aadhar. Go to your kyc/profile and check if it provides you option to verify again. For this to work your bank account must be linked to aadhar. I'm sure it is linked to aadhar but I'll try again Thanks a lot for listening so far, it's atleast a bit relieving to see and empathize with this problem. All grievances logged with the EPFO office just asked me to try with my employer. Interest I believe takes a long time to be credited. I dont remember but maybe it was June/July when it was credited last year? Medical but not emergency EPF is a public organisation. use RTI. OP, were you finally able to withdraw the money? u/350HP I took the advice from people in this thread and filed a small medical claim. It was approved 15 days later and I was able to withdraw part of my PF balance. I’ll keep filing these claims and eventually withdraw all the PF balance. Now that you're able to withdraw the money, would you recommend one to opt out of PF op? It does have an interest rate of 8+% and 12% contribution by employer right. Is it even worth it? Is it mandatory for employees earning 15+k? u/350HP If you are ok with having your money locked up in a non-accessible fund and have the patience to deal with the corrupt officials to get access money to your own money, then yes definitely."
}