{
    "id": "152ubhr",
    "title": "Ridiculous packing charges!",
    "url": "https://www.reddit.com/gallery/152ubhr",
    "selftext": "35 Rupees for what? I just ordered two brownies.\n\nHonestly, this is just a greedy, money-making provision given to sellers or whatever it is to make up for the commission.\n\nDoesn't even make sense when it stays the same for 10 units.\n\nUgh.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689675005.0,
    "convurl": "https://i.redd.it/73g9tola7pcb1.jpg",
    "comments": [
        "Thts the trick food delivery  platforms employ to allure customers by adverttising huge discounts of upto 60% then recovering 40-50% by levying this extra exorbitant charges. Its just scam to increase kt reach which can inflate its valuation.",
        "Also restaurants keep their prices high comparing restaurant menusdelivery charges and what not charges  \n\n\nAlso restuarents keep their prices higher due to commisions so it is very costly. started going to eat in restaurents or pick up. many of them have 2-3 people for delievry and they charge very minimal charge",
        "wohi toh scam hai ji. I see 5Rs roti with 20rs packing charge each in one of my nearby restaurants. And then Swiggy/Zomato claims they have no hand in packing charges while they can display nominal fake prices on the initial menu.",
        "This is a money grab by the likes of Zomato and swiggy.",
        "This is an unfortunate distortion in pricing that Swiggy and Zomato are both aware of. They show you a very small delivery charge and push restaurants to recover the rest of it through other means.\n\nWhat they should be doing, is showing you the correct charges for delivery. Try ordering the same two brownies using Swiggy Genie or Dunzo. There will be no packaging charges but the real cost of delivery will reflect on your bill."
    ],
    "cleaned_text": "ridiculous packing charges rupees ordered two brownies honestly greedy moneymaking provision given sellers whatever make commission doesnt even make sense stays units ugh ",
    "cleaned_title": "ridiculous packing charges",
    "cleaned_selftext": "rupees ordered two brownies honestly greedy moneymaking provision given sellers whatever make commission doesnt even make sense stays units ugh",
    "cleaned_comments": "thts trick food delivery platforms employ allure customers adverttising huge discounts upto recovering levying extra exorbitant charges scam increase kt reach inflate valuation also restaurants keep prices high comparing restaurant menusdelivery charges charges also restuarents keep prices higher due commisions costly started going eat restaurents pick many people delievry charge minimal charge wohi toh scam hai ji see rs roti rs packing charge one nearby restaurants swiggyzomato claims hand packing charges display nominal fake prices initial menu money grab likes zomato swiggy unfortunate distortion pricing swiggy zomato aware show small delivery charge push restaurants recover rest means showing correct charges delivery try ordering two brownies using swiggy genie dunzo packaging charges real cost delivery reflect bill",
    "light_cleaned_title": "Ridiculous packing charges!",
    "light_cleaned_selftext": "35 Rupees for what? I just ordered two brownies. Honestly, this is just a greedy, money-making provision given to sellers or whatever it is to make up for the commission. Doesn't even make sense when it stays the same for 10 units. Ugh.",
    "light_cleaned_comments": "Thts the trick food delivery platforms employ to allure customers by adverttising huge discounts of upto 60% then recovering 40-50% by levying this extra exorbitant charges. Its just scam to increase kt reach which can inflate its valuation. Also restaurants keep their prices high comparing restaurant menusdelivery charges and what not charges Also restuarents keep their prices higher due to commisions so it is very costly. started going to eat in restaurents or pick up. many of them have 2-3 people for delievry and they charge very minimal charge wohi toh scam hai ji. I see 5Rs roti with 20rs packing charge each in one of my nearby restaurants. And then Swiggy/Zomato claims they have no hand in packing charges while they can display nominal fake prices on the initial menu. This is a money grab by the likes of Zomato and swiggy. This is an unfortunate distortion in pricing that Swiggy and Zomato are both aware of. They show you a very small delivery charge and push restaurants to recover the rest of it through other means. What they should be doing, is showing you the correct charges for delivery. Try ordering the same two brownies using Swiggy Genie or Dunzo. There will be no packaging charges but the real cost of delivery will reflect on your bill."
}