{
    "id": "179ufuf",
    "title": "Indian court frees men jailed for serial killings - BBC News",
    "url": "https://www.bbc.com/news/world-asia-india-67119737.amp",
    "selftext": "Another achievement of Indian judicial system",
    "flair": "Crime",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1697535294.0,
    "convurl": "https://external-preview.redd.it/L8iUCL2hKbKYObJP0dFBvifHF6tBIHfJ6lS2yAz7YK0.jpg?auto=webp&s=b20c14f098af706fe6327ba712d728d1c55840f5",
    "comments": [
        "what exactly should the Indian judicial system do exactly OP? keep someone in prison even when the guilt can't be proven beyond doubt?\n\nOur legal system doesn't investigate a case themselves, they judge on the basis of evidence at hand, just like every other legal system across the globe.",
        "Exactly my point, keeping innocent people in jail for  almost 20 years",
        "You dumbass...\n\nThere is a difference in being found innocent & being acquitted for lack of evidence. And how to you suggest criminal trial takes place, everyone accused of murder of 20 people should be allowed to roam on the streets till a court finds him guilty?",
        "You smartass…\n\nyou suggest accused should be kept in prison for 20 years, which in many cases is the complete sentence",
        "...Well first of all the case was registered in 2007, so it hasn't even been 20 years till date. \n\nSecondly, he was not accused for 20 years, he was found guilty by the sessions court, after that he was a convicted person who had appealed to the High Court. \n\nThirdly, the minimum punishment for even 1 murder is life imprisonment not 20 years. \n\nFourthly, yes I and the LAW suggests that in cases such as this where accusation is of around 20 murders, accused should be kept in jail unless there are very strong reasons for believing that he did not commit the offence.",
        "Tu abhi bhi samajh nahin paaya 🤣",
        "ok",
        "How dumb can u be",
        "All other courts had enough evidence, but not for SC. Clearly SC loves 💰",
        "why are you deleting comments and then making comments that are diametrically opposite to your previous comments?"
    ],
    "cleaned_text": "indian court frees men jailed serial killings bbc news another achievement indian judicial system ",
    "cleaned_title": "indian court frees men jailed serial killings bbc news",
    "cleaned_selftext": "another achievement indian judicial system",
    "cleaned_comments": "exactly indian judicial system exactly op keep someone prison even guilt cant proven beyond doubt legal system doesnt investigate case judge basis evidence hand like every legal system across globe exactly point keeping innocent people jail almost years dumbass difference found innocent acquitted lack evidence suggest criminal trial takes place everyone accused murder people allowed roam streets till court finds guilty smartass suggest accused kept prison years many cases complete sentence well first case registered hasnt even years till date secondly accused years found guilty sessions court convicted person appealed high court thirdly minimum punishment even murder life imprisonment years fourthly yes law suggests cases accusation around murders accused kept jail unless strong reasons believing commit offence tu abhi bhi samajh nahin paaya ok dumb u courts enough evidence sc clearly sc loves deleting comments making comments diametrically opposite previous comments",
    "light_cleaned_title": "Indian court frees men jailed for serial killings - BBC News",
    "light_cleaned_selftext": "Another achievement of Indian judicial system",
    "light_cleaned_comments": "what exactly should the Indian judicial system do exactly OP? keep someone in prison even when the guilt can't be proven beyond doubt? Our legal system doesn't investigate a case themselves, they judge on the basis of evidence at hand, just like every other legal system across the globe. Exactly my point, keeping innocent people in jail for almost 20 years You dumbass... There is a difference in being found innocent & being acquitted for lack of evidence. And how to you suggest criminal trial takes place, everyone accused of murder of 20 people should be allowed to roam on the streets till a court finds him guilty? You smartass… you suggest accused should be kept in prison for 20 years, which in many cases is the complete sentence ...Well first of all the case was registered in 2007, so it hasn't even been 20 years till date. Secondly, he was not accused for 20 years, he was found guilty by the sessions court, after that he was a convicted person who had appealed to the High Court. Thirdly, the minimum punishment for even 1 murder is life imprisonment not 20 years. Fourthly, yes I and the LAW suggests that in cases such as this where accusation is of around 20 murders, accused should be kept in jail unless there are very strong reasons for believing that he did not commit the offence. Tu abhi bhi samajh nahin paaya 🤣 ok How dumb can u be All other courts had enough evidence, but not for SC. Clearly SC loves 💰 why are you deleting comments and then making comments that are diametrically opposite to your previous comments?"
}