{
    "id": "17qgfrg",
    "title": "Shady Practices and unfair treatment of ex employee by L&T",
    "url": "https://www.reddit.com/r/india/comments/17qgfrg/shady_practices_and_unfair_treatment_of_ex/",
    "selftext": " \n\nI quit L&T 3 months back and i have not received my final month's salary. After multiple emails to HR, i was told in early october to obtain certain clearances and i did exactly i was told and i was informed my salary would be credited within 15 days, which would be on november 1. You can read up more on my previous post here: [https://www.reddit.com/r/LegalAdviceIndia/comments/176qzq7/larsen\\_and\\_toubro\\_withholding\\_fnf\\_salary/](https://www.reddit.com/r/LegalAdviceIndia/comments/176qzq7/larsen_and_toubro_withholding_fnf_salary/)\n\nNovember 1 came and went and the amount did not get credited. I sent several emails and finally i got a response. they updated the payslip and are now demanding money from me.\n\nPrevious payslip (amount payable Rs. 12177)  \n\n\n![img](6cvr13c5t2zb1 \"\n \")\n\nNew Payslip (amount payable Rs. -5952)\n\n&#x200B;\n\nhttps://preview.redd.it/n0i8a0m7t2zb1.png?width=824&format=png&auto=webp&s=928951f44fbbdd0608be5b8c735055e1261aeafd\n\nthey are now demanding Rs. 6k from me by simply editing the notice pay recovery field. At the time of quitting i was told the recovery would be made on my basic salary for the notice period month which is one month on the number of days i am not serving. I served for 16 days for that month and opted to buy out the remaining 14 days. First they kept me waiting around for 3 months and now they are trying to fk me over and asking for money from me. My basic salary was 15.5k.\n\nI hate Larsen and toubro so damn much!  \nI took the right decision when I quit L&T. Its just so toxic! [https://www.reddit.com/r/india/comments/15ct0ah/rant\\_should\\_i\\_quit\\_larsen\\_and\\_toubro\\_the\\_company/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/15ct0ah/rant_should_i_quit_larsen_and_toubro_the_company/?utm_source=share&utm_medium=web2x&context=3)\n\nAnyone have any idea how do i deal with this? Still unemployed after leaving L&T since no one seems to be interested in hiring 2023 grads and barely struggling by to make ends meet and then they hit me with this. I feel like the universe hates me.",
    "flair": "Rant / Vent",
    "score": 47,
    "num_comments": 13,
    "created_utc": 1699428464.0,
    "convurl": "https://b.thumbs.redditmedia.com/f90kMUfVvlNUfHHMgWbrZXP9mV8zE7YrxkXX2tAG__g.jpg",
    "comments": [
        "L&T are snakes",
        "Story of indian corporates even the global ones. One thing i learnt early on in my career was to only work with global mncs. The difference is night and day",
        "i am dealing with something similar from my reputed ex-company. the sheer pettiness and spite with which they dealt with my exit last year (still some formalities and drama going on), it's so incredibly immature. they've scammed me of a lot of money, and in their cheap attempts to try and get me, i have a huge itr pending. \n\nfuck corporates in india, they're run by the idiots who thrive in toxic garbage environments. every time i feel like i can't possibly see them go lower, they do.",
        "Speak to a lawyer",
        "Sadly I agree, even though the companies treat their Indian branches as Sweatshops for  outsourcing cheap labour, they treat their employees more humanely than most Indian MNCs. Especially in IT, the WITCH companies treat their employees like slaves. Most global MNCs are very progressive and flexible.",
        "Ok \nSo now they're not paying you your salary, and final settlement is pending right ? \nHave you received your experience letter in hand yet ? That's the most important thing , as a new job might not ask for a salary slip, but surely an experience letter .\n\nDo you have some omsbud person who can be complained to ? \nIm sure this HR maybe wants some brownie points , or an ego massaging .",
        "No, they are holding my experience letter and pf hostage and are saying it cannot be cleared unless fnf is completed.\n\nI'm not sure who to complain to.\n\nMy situation was they were not paying me my due fnf (12k+). After regularly asking them to pay up for 3 months, they suddenly revert back with a new fnf which is different from the one which was presented when I left and now they are saying they will proceed if I accept this new fnf in which they increased the notice period pay recovery amount and are now demanding I pay them 6k.",
        "Yeah, they know they can screw over people with little to no money. Plus even if you have money, lawyers are more than happy to fool clients or screw them over.\n\nHonestly thinking I should become a lawyer myself so ai can fight my own legal cases.",
        "Get a lawyer to send them a legal notice. See if you can get a government office to do the needful, which can be cheaper. I don't know which one to complain to here.",
        "Try contacting state labour welfare board, lawyer etc.\n\nYou might have to pay the 6K to get a speedy resolution.\n\nBut at least make sure that's the final amount that you owe them...best of luck."
    ],
    "cleaned_text": "shady practices unfair treatment ex employee lt quit lt months back received final months salary multiple emails hr told early october obtain certain clearances exactly told informed salary would credited within days would november read previous post httpswwwredditcomrlegaladviceindiacommentsqzqlarsenandtoubrowithholdingfnfsalaryhttpswwwredditcomrlegaladviceindiacommentsqzqlarsenandtoubrowithholdingfnfsalary november came went amount get credited sent several emails finally got response updated payslip demanding money previous payslip amount payable rs imgcvrctzb new payslip amount payable rs xb demanding rs k simply editing notice pay recovery field time quitting told recovery would made basic salary notice period month one month number days serving served days month opted buy remaining days first kept waiting around months trying fk asking money basic salary k hate larsen toubro damn much took right decision quit lt toxic httpswwwredditcomrindiacommentsctahrantshouldiquitlarsenandtoubrothecompanyutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsctahrantshouldiquitlarsenandtoubrothecompanyutmsourceshareutmmediumwebxcontext anyone idea deal still unemployed leaving lt since one seems interested hiring grads barely struggling make ends meet hit feel like universe hates ",
    "cleaned_title": "shady practices unfair treatment ex employee lt",
    "cleaned_selftext": "quit lt months back received final months salary multiple emails hr told early october obtain certain clearances exactly told informed salary would credited within days would november read previous post httpswwwredditcomrlegaladviceindiacommentsqzqlarsenandtoubrowithholdingfnfsalaryhttpswwwredditcomrlegaladviceindiacommentsqzqlarsenandtoubrowithholdingfnfsalary november came went amount get credited sent several emails finally got response updated payslip demanding money previous payslip amount payable rs imgcvrctzb new payslip amount payable rs xb demanding rs k simply editing notice pay recovery field time quitting told recovery would made basic salary notice period month one month number days serving served days month opted buy remaining days first kept waiting around months trying fk asking money basic salary k hate larsen toubro damn much took right decision quit lt toxic httpswwwredditcomrindiacommentsctahrantshouldiquitlarsenandtoubrothecompanyutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsctahrantshouldiquitlarsenandtoubrothecompanyutmsourceshareutmmediumwebxcontext anyone idea deal still unemployed leaving lt since one seems interested hiring grads barely struggling make ends meet hit feel like universe hates",
    "cleaned_comments": "lt snakes story indian corporates even global ones one thing learnt early career work global mncs difference night day dealing something similar reputed excompany sheer pettiness spite dealt exit last year still formalities drama going incredibly immature theyve scammed lot money cheap attempts try get huge itr pending fuck corporates india theyre run idiots thrive toxic garbage environments every time feel like cant possibly see go lower speak lawyer sadly agree even though companies treat indian branches sweatshops outsourcing cheap labour treat employees humanely indian mncs especially witch companies treat employees like slaves global mncs progressive flexible ok theyre paying salary final settlement pending right received experience letter hand yet thats important thing new job might ask salary slip surely experience letter omsbud person complained im sure hr maybe wants brownie points ego massaging holding experience letter pf hostage saying cleared unless fnf completed im sure complain situation paying due fnf k regularly asking pay months suddenly revert back new fnf different one presented left saying proceed accept new fnf increased notice period pay recovery amount demanding pay k yeah know screw people little money plus even money lawyers happy fool clients screw honestly thinking become lawyer ai fight legal cases get lawyer send legal notice see get government office needful cheaper dont know one complain try contacting state labour welfare board lawyer etc might pay k get speedy resolution least make sure thats final amount owe thembest luck",
    "light_cleaned_title": "Shady Practices and unfair treatment of ex employee by L&T",
    "light_cleaned_selftext": "I quit L&T 3 months back and i have not received my final month's salary. After multiple emails to HR, i was told in early october to obtain certain clearances and i did exactly i was told and i was informed my salary would be credited within 15 days, which would be on november 1. You can read up more on my previous post here: [https://www.reddit.com/r/LegalAdviceIndia/comments/176qzq7/larsen\\_and\\_toubro\\_withholding\\_fnf\\_salary/](https://www.reddit.com/r/LegalAdviceIndia/comments/176qzq7/larsen_and_toubro_withholding_fnf_salary/) November 1 came and went and the amount did not get credited. I sent several emails and finally i got a response. they updated the payslip and are now demanding money from me. Previous payslip (amount payable Rs. 12177) ![img](6cvr13c5t2zb1 \" \") New Payslip (amount payable Rs. -5952) &#x200B; they are now demanding Rs. 6k from me by simply editing the notice pay recovery field. At the time of quitting i was told the recovery would be made on my basic salary for the notice period month which is one month on the number of days i am not serving. I served for 16 days for that month and opted to buy out the remaining 14 days. First they kept me waiting around for 3 months and now they are trying to fk me over and asking for money from me. My basic salary was 15.5k. I hate Larsen and toubro so damn much! I took the right decision when I quit L&T. Its just so toxic! [https://www.reddit.com/r/india/comments/15ct0ah/rant\\_should\\_i\\_quit\\_larsen\\_and\\_toubro\\_the\\_company/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/15ct0ah/rant_should_i_quit_larsen_and_toubro_the_company/?utm_source=share&utm_medium=web2x&context=3) Anyone have any idea how do i deal with this? Still unemployed after leaving L&T since no one seems to be interested in hiring 2023 grads and barely struggling by to make ends meet and then they hit me with this. I feel like the universe hates me.",
    "light_cleaned_comments": "L&T are snakes Story of indian corporates even the global ones. One thing i learnt early on in my career was to only work with global mncs. The difference is night and day i am dealing with something similar from my reputed ex-company. the sheer pettiness and spite with which they dealt with my exit last year (still some formalities and drama going on), it's so incredibly immature. they've scammed me of a lot of money, and in their cheap attempts to try and get me, i have a huge itr pending. fuck corporates in india, they're run by the idiots who thrive in toxic garbage environments. every time i feel like i can't possibly see them go lower, they do. Speak to a lawyer Sadly I agree, even though the companies treat their Indian branches as Sweatshops for outsourcing cheap labour, they treat their employees more humanely than most Indian MNCs. Especially in IT, the WITCH companies treat their employees like slaves. Most global MNCs are very progressive and flexible. Ok So now they're not paying you your salary, and final settlement is pending right ? Have you received your experience letter in hand yet ? That's the most important thing , as a new job might not ask for a salary slip, but surely an experience letter . Do you have some omsbud person who can be complained to ? Im sure this HR maybe wants some brownie points , or an ego massaging . No, they are holding my experience letter and pf hostage and are saying it cannot be cleared unless fnf is completed. I'm not sure who to complain to. My situation was they were not paying me my due fnf (12k+). After regularly asking them to pay up for 3 months, they suddenly revert back with a new fnf which is different from the one which was presented when I left and now they are saying they will proceed if I accept this new fnf in which they increased the notice period pay recovery amount and are now demanding I pay them 6k. Yeah, they know they can screw over people with little to no money. Plus even if you have money, lawyers are more than happy to fool clients or screw them over. Honestly thinking I should become a lawyer myself so ai can fight my own legal cases. Get a lawyer to send them a legal notice. See if you can get a government office to do the needful, which can be cheaper. I don't know which one to complain to here. Try contacting state labour welfare board, lawyer etc. You might have to pay the 6K to get a speedy resolution. But at least make sure that's the final amount that you owe them...best of luck."
}