{
    "id": "17k5lpk",
    "title": "The specific problem with Mr. Narayana Murthy's 70 hours work comment...",
    "url": "https://www.reddit.com/r/india/comments/17k5lpk/the_specific_problem_with_mr_narayana_murthys_70/",
    "selftext": "Mr. Narayana Murthy made the comment demanding 70 hours per week of work from our generation in India to increase the **labour productivity rate**.\n\nHowever, labour productivity rate = (GDP output) / (number of man-hours) ([https://www.investopedia.com/terms/l/labor-productivity.asp](https://www.investopedia.com/terms/l/labor-productivity.asp))\n\nKeeping all else same, working longer hours in a week does not lead to an increase in the labour productivity unless the increase in work hours is not accounted for in the denominator.\n\nMeaning, without explicitly stating it Mr. Narayana Murthy recommended that our generation work for 70 hours while getting paid for 40 hours. Getting paid fairly for work done seems to be a harmful Western Idea in his imagination. ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698704857.0,
    "convurl": "https://external-preview.redd.it/2UzwakTUOH4TTu_91zWqcZ_toPrMaqhUjuMXKExzvcs.jpg?auto=webp&s=32c4fdc8edf0bbded7af40d9bc8483caf193a290",
    "comments": [
        "Mr. Murthy needs to get off his high horse. At his age, the risk of a tumble is far too great.",
        "\"You Either Die a Hero or Live Long Enough to See Yourself Become the Villain\"",
        "Murthy and his wife, both are abominable fucks, pretending to be simple while profiting off of cheap labor. For all his sins, at least Ambani knows how to live a tone deaf lavish lifestyle. Murthy is like \"ek chappal ko 35 saal chalaya maine\" (I wore a single slipper for 35 years). I don't want to wear the same slipper for half my life man, just like I don't want to work more than 8 hours 5 days a week.",
        "He was working for himself, wasn't he ?\n\nWas he working 70 hours a week while he was an employee of that company in Pune ?",
        "While his wife later comments that he himself works 80 hours a week. Ofcourse he wouldn't have a problem working 80 hours since he is not a normal person who has to travel by metro everyday for two hours, he can work from home if he choose to , he can work in his car if he chooses to, hell he can build a bunglow next to his office if he chooses to. He's not a normal person who has to spend two hours everyday to cook a healthy meal for himself and his family, he can hire a chef everyday to cook meals for himself. He can get fruits of his labour for working 80 hours a week, he himself wouldn't pay more to his employees for working more than required.",
        "Bhai, which slipper has a life of 35 years. Even toilet ki chappal loses its life by 10 years.",
        "Nothing great to be expected from the husband of the writer of cheap romantic novels, who thinks her novels are deep. There are all about \"high value\" women, whatever that is.",
        "More working hours for the same wage is the wet dream of capitalists. Now we know Mr. Murthy isn't an exception.",
        "You have money to buys toilet chappal alag se?😕",
        "For now.",
        "Yes. Thats the joke here."
    ],
    "cleaned_text": "specific problem mr narayana murthys hours work comment mr narayana murthy made comment demanding hours per week work generation india increase labour productivity rate however labour productivity rate gdp output number manhours httpswwwinvestopediacomtermsllaborproductivityasphttpswwwinvestopediacomtermsllaborproductivityasp keeping else working longer hours week lead increase labour productivity unless increase work hours accounted denominator meaning without explicitly stating mr narayana murthy recommended generation work hours getting paid hours getting paid fairly work done seems harmful western idea imagination ",
    "cleaned_title": "specific problem mr narayana murthys hours work comment",
    "cleaned_selftext": "mr narayana murthy made comment demanding hours per week work generation india increase labour productivity rate however labour productivity rate gdp output number manhours httpswwwinvestopediacomtermsllaborproductivityasphttpswwwinvestopediacomtermsllaborproductivityasp keeping else working longer hours week lead increase labour productivity unless increase work hours accounted denominator meaning without explicitly stating mr narayana murthy recommended generation work hours getting paid hours getting paid fairly work done seems harmful western idea imagination",
    "cleaned_comments": "mr murthy needs get high horse age risk tumble far great either die hero live long enough see become villain murthy wife abominable fucks pretending simple profiting cheap labor sins least ambani knows live tone deaf lavish lifestyle murthy like ek chappal ko saal chalaya maine wore single slipper years dont want wear slipper half life man like dont want work hours days week working wasnt working hours week employee company pune wife later comments works hours week ofcourse wouldnt problem working hours since normal person travel metro everyday two hours work home choose work car chooses hell build bunglow next office chooses hes normal person spend two hours everyday cook healthy meal family hire chef everyday cook meals get fruits labour working hours week wouldnt pay employees working required bhai slipper life years even toilet ki chappal loses life years nothing great expected husband writer cheap romantic novels thinks novels deep high value women whatever working hours wage wet dream capitalists know mr murthy isnt exception money buys toilet chappal alag se yes thats joke",
    "light_cleaned_title": "The specific problem with Mr. Narayana Murthy's 70 hours work comment...",
    "light_cleaned_selftext": "Mr. Narayana Murthy made the comment demanding 70 hours per week of work from our generation in India to increase the **labour productivity rate**. However, labour productivity rate = (GDP output) / (number of man-hours) ([https://www.investopedia.com/terms/l/labor-productivity.asp](https://www.investopedia.com/terms/l/labor-productivity.asp)) Keeping all else same, working longer hours in a week does not lead to an increase in the labour productivity unless the increase in work hours is not accounted for in the denominator. Meaning, without explicitly stating it Mr. Narayana Murthy recommended that our generation work for 70 hours while getting paid for 40 hours. Getting paid fairly for work done seems to be a harmful Western Idea in his imagination.",
    "light_cleaned_comments": "Mr. Murthy needs to get off his high horse. At his age, the risk of a tumble is far too great. \"You Either Die a Hero or Live Long Enough to See Yourself Become the Villain\" Murthy and his wife, both are abominable fucks, pretending to be simple while profiting off of cheap labor. For all his sins, at least Ambani knows how to live a tone deaf lavish lifestyle. Murthy is like \"ek chappal ko 35 saal chalaya maine\" (I wore a single slipper for 35 years). I don't want to wear the same slipper for half my life man, just like I don't want to work more than 8 hours 5 days a week. He was working for himself, wasn't he ? Was he working 70 hours a week while he was an employee of that company in Pune ? While his wife later comments that he himself works 80 hours a week. Ofcourse he wouldn't have a problem working 80 hours since he is not a normal person who has to travel by metro everyday for two hours, he can work from home if he choose to , he can work in his car if he chooses to, hell he can build a bunglow next to his office if he chooses to. He's not a normal person who has to spend two hours everyday to cook a healthy meal for himself and his family, he can hire a chef everyday to cook meals for himself. He can get fruits of his labour for working 80 hours a week, he himself wouldn't pay more to his employees for working more than required. Bhai, which slipper has a life of 35 years. Even toilet ki chappal loses its life by 10 years. Nothing great to be expected from the husband of the writer of cheap romantic novels, who thinks her novels are deep. There are all about \"high value\" women, whatever that is. More working hours for the same wage is the wet dream of capitalists. Now we know Mr. Murthy isn't an exception. You have money to buys toilet chappal alag se?😕 For now. Yes. Thats the joke here."
}