{
    "id": "17hmf1t",
    "title": "Cidco Mum On Navi Mumbai Metro’s Opening As Govt Tries To Get PM’s Dates",
    "url": "https://timesofindia.indiatimes.com/city/navi-mumbai/cidco-mum-on-navi-mumbai-metros-opening-as-govt-tries-to-get-pms-dates/articleshow/104712653.cms",
    "selftext": "Although the project is complete in all respects, Cidco is unsure of its inauguration, thanks to the state government which is trying to get Prime Minister Narendra Modi to inaugurate it. Sources claimed that Modi is likely to inaugurate Navi Mumbai Metro on October 30, but Cidco is tightlipped even as it has appointed an event management agency company, after floating a tender, to manage the inauguration show involving the PM.\n\nInterestingly enough the PM was in Mumbai yesterday to visit the shirdi sai temple.\n\nMeanwhile, Cidco has floated a Rs 3.2 crore tender for the ground preparation work for the proposed PM’s visit. It has been more than four months since Cidco has received the Commissioner for Metro Rail Safety (CMRS) certificate for the commercial operation of line 1 from Belapur to Pendhar. Anil Diggikar, vice-chairman and MD of Cidco, had even taken a ride on the Metro and assured to start operations soon.\n\n(This is a repost since last one was automatically removed)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1698409630.0,
    "convurl": "https://external-preview.redd.it/xCKwRgNeItg2vi53JLkYDNpN6ZKvnvH7vc0w2kBRqIQ.jpg?auto=webp&s=b6b9b0d97a3a046dedebd3bdf6374cf8033d65e9",
    "comments": [
        "As Aakar Patel put it very succinctly on Twitter, \n\nAkbar the Great, Modi the Inaugurate.",
        "Benefits of the Double Engine Sarkaar \n\nCompare this to Blr where they did a virtual inauguration",
        "This project has been delayed indefinitely. I think there is a lot of problems associated with the project and machinery failures will keep on happening hence cidco is still unsure about the success of this metro",
        "Maharashtra has upgraded to triple schezwan fried rice sarkaar, please keep up with the times.",
        "If construction complete, open the damn thing and move on.\nFuck getting a vip for inauguration etc.. such a bad habit"
    ],
    "cleaned_text": "cidco mum navi mumbai metros opening govt tries get pms dates although project complete respects cidco unsure inauguration thanks state government trying get prime minister narendra modi inaugurate sources claimed modi likely inaugurate navi mumbai metro october cidco tightlipped even appointed event management agency company floating tender manage inauguration show involving pm interestingly enough pm mumbai yesterday visit shirdi sai temple meanwhile cidco floated rs crore tender ground preparation work proposed pms visit four months since cidco received commissioner metro rail safety cmrs certificate commercial operation line belapur pendhar anil diggikar vicechairman md cidco even taken ride metro assured start operations soon repost since last one automatically removed ",
    "cleaned_title": "cidco mum navi mumbai metros opening govt tries get pms dates",
    "cleaned_selftext": "although project complete respects cidco unsure inauguration thanks state government trying get prime minister narendra modi inaugurate sources claimed modi likely inaugurate navi mumbai metro october cidco tightlipped even appointed event management agency company floating tender manage inauguration show involving pm interestingly enough pm mumbai yesterday visit shirdi sai temple meanwhile cidco floated rs crore tender ground preparation work proposed pms visit four months since cidco received commissioner metro rail safety cmrs certificate commercial operation line belapur pendhar anil diggikar vicechairman md cidco even taken ride metro assured start operations soon repost since last one automatically removed",
    "cleaned_comments": "aakar patel put succinctly twitter akbar great modi inaugurate benefits double engine sarkaar compare blr virtual inauguration project delayed indefinitely think lot problems associated project machinery failures keep happening hence cidco still unsure success metro maharashtra upgraded triple schezwan fried rice sarkaar please keep times construction complete open damn thing move fuck getting vip inauguration etc bad habit",
    "light_cleaned_title": "Cidco Mum On Navi Mumbai Metro’s Opening As Govt Tries To Get PM’s Dates",
    "light_cleaned_selftext": "Although the project is complete in all respects, Cidco is unsure of its inauguration, thanks to the state government which is trying to get Prime Minister Narendra Modi to inaugurate it. Sources claimed that Modi is likely to inaugurate Navi Mumbai Metro on October 30, but Cidco is tightlipped even as it has appointed an event management agency company, after floating a tender, to manage the inauguration show involving the PM. Interestingly enough the PM was in Mumbai yesterday to visit the shirdi sai temple. Meanwhile, Cidco has floated a Rs 3.2 crore tender for the ground preparation work for the proposed PM’s visit. It has been more than four months since Cidco has received the Commissioner for Metro Rail Safety (CMRS) certificate for the commercial operation of line 1 from Belapur to Pendhar. Anil Diggikar, vice-chairman and MD of Cidco, had even taken a ride on the Metro and assured to start operations soon. (This is a repost since last one was automatically removed)",
    "light_cleaned_comments": "As Aakar Patel put it very succinctly on Twitter, Akbar the Great, Modi the Inaugurate. Benefits of the Double Engine Sarkaar Compare this to Blr where they did a virtual inauguration This project has been delayed indefinitely. I think there is a lot of problems associated with the project and machinery failures will keep on happening hence cidco is still unsure about the success of this metro Maharashtra has upgraded to triple schezwan fried rice sarkaar, please keep up with the times. If construction complete, open the damn thing and move on. Fuck getting a vip for inauguration etc.. such a bad habit"
}