{
    "id": "1dyx24a",
    "title": "IFF’s cybersecurity report for the second quarter of 2024\n",
    "url": "https://www.reddit.com/r/india/comments/1dyx24a/iffs_cybersecurity_report_for_the_second_quarter/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/l8wzlbegbgbd1.png?width=1600&format=png&auto=webp&s=4e32681d91defdc1aada2ea6d72161eddd017b25)\n\n# tl;dr \n\nRecent data breaches and leaks have underscored the widespread impact on the data security of millions of users. Grave cybersecurity incidents, like the Tamil Nadu Police Facial Recognition Portal breach and the Telangana Police Network data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. This series will list the various cybersecurity incidents that occurred during a quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience in an interconnected digital world.\n\n# Important documents \n\n1. Letter to CERT-In on ICICI Bank 'iMobile' app data breach dated May 8, 2024 ([~Link~](https://drive.google.com/file/d/1e_ZYsB20GNl5UYemavG7oknt66Zgt4k8/view?usp=sharing&ref=static.internetfreedom.in))\n2. Letter to CERT-In on Tamil Nadu Police Facial Recognition Portal data leak dated May 15, 2024 ([~Link~](https://drive.google.com/file/d/1t7xhw8BCzu2KKYWg9WYoTeSzJjMAK4rN/view?usp=sharing&ref=static.internetfreedom.in))\n3. Letter to CERT-In on the Telangana Police Network data breach dated June 21, 2024 ([~Link~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in))\n4. Letter to the Telangana government regarding the Telangana Police Network data breach dated June 21, 2024 ([~Link~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in))\n5. Letter to CERT-In on Dropbox data leak dated May 23, 2024 ([~Link~](https://drive.google.com/file/d/1aycucx5om8L9lzpkLWbXyzTCraRQTF7M/view?usp=sharing&ref=static.internetfreedom.in))\n6. PlugTheBreach [~(Link)~](https://plugthebreach.in/?ref=static.internetfreedom.in)\n\n# The grim state of cybersecurity in India\n\nThe urgent need to operationalise the [~Digital Personal Data Protection Act (“DPDPA”), 2023~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) is underscored by the increasingly pervasive threats to individuals’ digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting data protection legislation is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The [~exemption~](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/?ref=static.internetfreedom.in) of the Indian Computer Emergency Response Team (“CERT-In”) in 2023 from the Right to Information (“RTI”) Act, 2005 raises serious concerns about the accountability of an organisation whose actions or inaction is consequential for the status of cyber security and individual privacy in the country. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them.\n\n# Data breaches and vulnerabilities in 2024 Q2\n\n1. **Data breach of ICICI Bank 'iMobile' app:** ICICI Bank [~reportedly~](https://www.medianama.com/2024/04/223-17000-icici-bank-customers-credit-card-details-leaked/?ref=static.internetfreedom.in) blocked 17,000 credit cards after a technical glitch in its mobile banking application, ‘iMobile Pay’, following user complaints about customer card details being visible to other users. The breach was initially [~flagged~](https://www.business-standard.com/finance/personal-finance/17-000-icici-bank-credit-cards-mapped-to-wrong-users-what-this-means-124042600115_1.html?ref=static.internetfreedom.in) on a financial forum called Technofino, where details of users including Card Verification Values, full card numbers, and card expiry dates were shared. Following this, an ICICI Bank spokesperson acknowledged the breach to [~Mint~](https://www.livemint.com/companies/news/icici-bank-imobile-glitch-online-portal-raises-alert-netizen-says-sensitive-card-information-visible-11714022513098.html?ref=static.internetfreedom.in) and stated that “*the glitch was due to “erroneously mapped” data of 17,000 new credit cards in their digital channels*.” We wrote a [~letter~](https://drive.google.com/file/d/1e_ZYsB20GNl5UYemavG7oknt66Zgt4k8/view?usp=sharing&ref=static.internetfreedom.in) to CERT-In, the nodal authority assigned to overlook data breaches, bringing this breach to their notice and highlighting that such a glitch in the mobile banking app puts the customer at risk of financial loss as well as data theft. \n\n\n\n1. **Data Breach of the Tamil Nadu Police Facial Recognition Portal:** A significant data breach [~reportedly~](https://timesofindia.indiatimes.com/city/chennai/tamil-nadu-police-data-hacked-for-sale-on-dark-web/articleshow/109854032.cms?ref=static.internetfreedom.in) affected the Tamil Nadu Police Facial Recognition Portal (“TNP-FRP”) which contained a large volume of facial biometric data collected through facial recognition software used by the state police to track criminals and missing persons. The breach of the FRP was [~reported~](https://www.medianama.com/2024/05/223-tamil-nadu-police-facial-recognition-portal-data-breach-exposes-over-50000-users-details/?ref=static.internetfreedom.in) on the social media platform X (formerly Twitter) by [Falconfeeds.io](http://Falconfeeds.io), which said data samples from the TNP-FRP have been put on sale for $2 to $3 on the dark web. A group named ‘Valerie’ claimed responsibility for the breach. As per [~reports~](https://www.newindianexpress.com/states/tamil-nadu/2024/May/05/tamil-nadu-polices-face-recognition-portal-hacked-fir-personal-information-up-for-sale?ref=static.internetfreedom.in), a file comprising 55,000 lines of data regarding details of police officials, including IPS officers, a second file with 8.9 lakh lines of FIR data and another with 2,700 lines of data on police stations were compromised. The breach was communicated to the Electronics Corporation of Tamil Nadu, Tamil Nadu E-Governance Agency, and CDAC-Kolkata for necessary action and a complaint was also filed with the cyber-crime wing. Read our letter to CERT-In [~here~](https://drive.google.com/file/d/1t7xhw8BCzu2KKYWg9WYoTeSzJjMAK4rN/view?usp=sharing&ref=static.internetfreedom.in). Read our [~post~](https://internetfreedom.in/leak-in-tamil-nadu-polices-frt-database/?ref=static.internetfreedom.in#:~:text=On%20May%204%2C%202024%2C%20threat,System%20(%E2%80%9CFRS%E2%80%9D).) explaining the data breach and how facial recognition systems need to be banned due to lack of adequate safeguards under Indian law.\n2. **Data Breach(es) of the Telangana Police Network:** From May 29 to June 7, 2024, three significant data breaches were suffered by the Telangana Police Network. On May 29, the citizen-facing ‘community policing’ mobile application ‘HawkEye’ [~reportedly~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-book-case-after-hawkeye-data-breach-on-hackers-forum/articleshow/110683120.cms?ref=static.internetfreedom.in) suffered a data breach where thousands of emails and phone numbers, 1.30 lakh SOS records, 70,000 incident reports, 20,000 travel detail records (and as per some [~reports~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-book-case-after-hawkeye-data-breach-on-hackers-forum/articleshow/110683120.cms?ref=static.internetfreedom.in), location coordinates) were allegedly exposed and posted on data leak site BreachForums.\n\nOn June 7, the network was hit by a [~second breach~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-hit-by-second-major-data-breach-in-week-as-tscop-app-compromised/articleshow/110789926.cms?ref=static.internetfreedom.in), this time on Telangana police’s TSCOP App—which uses an integrated facial-recognition system to help police officers access crime and criminal databases and match images of people taken during patrols. Exposed information reportedly includes offender records, police gun licences, police officer names, designations, and pictures, and police station affiliations. The same day, the Telangana police SMS service, which is a gateway for police officers to send SMS updates and awareness messages to Telangana residents, was [~reportedly~](https://www.deccanchronicle.com/news/hacker-breaches-state-police-sms-service-to-target-delhi-police-next-897889?ref=static.internetfreedom.in) breached. This exposed police alerts and important notices, which included police personnel’s personal data and contact information. All three breaches were reportedly carried out by the same threat actor ‘Adm1nFr1end’. \n\nPolice officials [~stated~](https://www.newindianexpress.com/states/telangana/2024/Jun/09/tech-lapse-possible-in-tscop-data-leak-police?ref=static.internetfreedom.in) there “*could be a tech lapse*” in the TSCOP App resulting in the data leak, but no additional details have been furnished. Additionally, as of 12 PM on June 21, 2024, the TSCOP website [~displayed~](https://thesouthfirst.com/telangana/telangana-police-take-down-tscop-after-breach-but-questions-galore-on-data-cops-keep/?ref=static.internetfreedom.in) a temporary shutdown of service. The Android TSCOP App was also [~down~](https://web.archive.org/web/20240611064823/https://tscops.telangana.gov.in/). Such a temporary shutdown would have been warranted to initiate an investigation and curb the damage of the multiple data breaches. A month after the data breach, the TSCOP website was [~live~](https://www.newindianexpress.com/states/telangana/2024/Jul/01/a-month-after-data-breach-telangana-police-website-live-again?ref=static.internetfreedom.in) again and open for public use. We wrote a [~letter~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in) to CERT-In and the [~Telangana government~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in) highlighting the inadequate cybersecurity measures being taken by the Telangana police and raising our concerns about the police’s data collection, storage, and sharing practices, prompting investigations and calls for transparency. Read our [~post~](https://internetfreedom.in/three-telangana-police-data-breaches/?ref=static.internetfreedom.in) decoding the three data breaches and what it means for individual privacy, as well as the state police force’s inadequate response to the data breaches.\n\n1. **Dropbox data leak:** A significant data breach was reportedly suffered by Dropbox, a file hosting service, that exposed customer details. The unidentified threat actor accessed customer information such as emails, usernames, phone numbers, and hashed passwords as well as general account settings and certain authentication information such as API keys, OAuth tokens, and multi-factor authentication. The breach also affected users who never created an account but received or signed a document through Dropbox Sign, specifically exposing their names and email addresses. In response to the breach, the Dropbox security team “reset users’ passwords, logged users out of any devices they had connected to Dropbox Sign, and is coordinating the rotation of all API keys and OAuth tokens”. Read our letter to CERT-In [~here~](https://drive.google.com/file/d/1aycucx5om8L9lzpkLWbXyzTCraRQTF7M/view?usp=sharing&ref=static.internetfreedom.in). \n\n# PlugTheBreach: IFF’s data breach tracker\n\nYou can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [~PlugTheBreach~](https://plugthebreach.in/?ref=static.internetfreedom.in), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. \n\n# Conclusion \n\nThe multitude of [~recent data breaches and leaks~](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE) underscores the critical importance of robust cybersecurity measures in today's digital landscape. From breaches compromising sensitive defence personnel information to vulnerabilities in major databases and platforms, these incidents highlight the pervasive risks individuals and organisations face. \n\nIn these challenges, organisations must prioritise proactive cybersecurity measures, including regular audits, robust encryption protocols, and swift incident response procedures. Moreover, there's an urgent need for greater transparency and accountability in handling data breaches, as seen in cases where affected companies failed to acknowledge or adequately address the breaches promptly. \n\nPublic awareness and education on cybersecurity best practices also play a vital role in mitigating risks and fostering a culture of cyber resilience. Thus, as we navigate an increasingly interconnected digital world, we must remain vigilant and proactive in safeguarding our digital assets and protecting user privacy.\n\n\n\n*Help us keep watching the watchmen. Become an* [*~IFF member~*](https://internetfreedom.in/donate/) *~today!~* ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1720512788.0,
    "convurl": "https://b.thumbs.redditmedia.com/UAx5Ci4d1axzmAc1204uFaHqLRH64BTzwKtfeqxJn6I.jpg",
    "comments": [],
    "cleaned_text": "iffs cybersecurity report second quarter iff needs support ever details end posthttpspreviewredditlwzlbegbgbdpngwidthformatpngautowebpseddefdcaadaeadedddb tldr recent data breaches leaks underscored widespread impact data security millions users grave cybersecurity incidents like tamil nadu police facial recognition portal breach telangana police network data leak raised concerns detection response capabilities indias cybersecurity authorities series list various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world important documents letter certin icici bank imobile app data breach dated may linkhttpsdrivegooglecomfiledezysbgnluyemavgokntzgtkviewuspsharingrefstaticinternetfreedomin letter certin tamil nadu police facial recognition portal data leak dated may linkhttpsdrivegooglecomfiledtxhwbczukkywgwyoteszjjmakrnviewuspsharingrefstaticinternetfreedomin letter certin telangana police network data breach dated june linkhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin letter telangana government regarding telangana police network data breach dated june linkhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin letter certin dropbox data leak dated may linkhttpsdrivegooglecomfiledaycucxomllzpklwbxyztcrarqtfmviewuspsharingrefstaticinternetfreedomin plugthebreach linkhttpsplugthebreachinrefstaticinternetfreedomin grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiactrefstaticinternetfreedomin indian computer emergency response team certin right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q data breach icici bank imobile app icici bank reportedlyhttpswwwmedianamacomicicibankcustomerscreditcarddetailsleakedrefstaticinternetfreedomin blocked credit cards technical glitch mobile banking application imobile pay following user complaints customer card details visible users breach initially flaggedhttpswwwbusinessstandardcomfinancepersonalfinanceicicibankcreditcardsmappedtowronguserswhatthismeanshtmlrefstaticinternetfreedomin financial forum called technofino details users including card verification values full card numbers card expiry dates shared following icici bank spokesperson acknowledged breach minthttpswwwlivemintcomcompaniesnewsicicibankimobileglitchonlineportalraisesalertnetizensayssensitivecardinformationvisiblehtmlrefstaticinternetfreedomin stated glitch due erroneously mapped data new credit cards digital channels wrote letterhttpsdrivegooglecomfiledezysbgnluyemavgokntzgtkviewuspsharingrefstaticinternetfreedomin certin nodal authority assigned overlook data breaches bringing breach notice highlighting glitch mobile banking app puts customer risk financial loss well data theft data breach tamil nadu police facial recognition portal significant data breach reportedlyhttpstimesofindiaindiatimescomcitychennaitamilnadupolicedatahackedforsaleondarkwebarticleshowcmsrefstaticinternetfreedomin affected tamil nadu police facial recognition portal tnpfrp contained large volume facial biometric data collected facial recognition software used state police track criminals missing persons breach frp reportedhttpswwwmedianamacomtamilnadupolicefacialrecognitionportaldatabreachexposesoverusersdetailsrefstaticinternetfreedomin social media platform x formerly twitter falconfeedsiohttpfalconfeedsio said data samples tnpfrp put sale dark web group named valerie claimed responsibility breach per reportshttpswwwnewindianexpresscomstatestamilnadumaytamilnadupolicesfacerecognitionportalhackedfirpersonalinformationupforsalerefstaticinternetfreedomin file comprising lines data regarding details police officials including ips officers second file lakh lines fir data another lines data police stations compromised breach communicated electronics corporation tamil nadu tamil nadu egovernance agency cdackolkata necessary action complaint also filed cybercrime wing read letter certin herehttpsdrivegooglecomfiledtxhwbczukkywgwyoteszjjmakrnviewuspsharingrefstaticinternetfreedomin read posthttpsinternetfreedominleakintamilnadupolicesfrtdatabaserefstaticinternetfreedomintextonmayccthreatsystemecfrsed explaining data breach facial recognition systems need banned due lack adequate safeguards indian law data breaches telangana police network may june three significant data breaches suffered telangana police network may citizenfacing community policing mobile application hawkeye reportedlyhttpstimesofindiaindiatimescomcityhyderabadtelanganapolicebookcaseafterhawkeyedatabreachonhackersforumarticleshowcmsrefstaticinternetfreedomin suffered data breach thousands emails phone numbers lakh sos records incident reports travel detail records per reportshttpstimesofindiaindiatimescomcityhyderabadtelanganapolicebookcaseafterhawkeyedatabreachonhackersforumarticleshowcmsrefstaticinternetfreedomin location coordinates allegedly exposed posted data leak site breachforums june network hit second breachhttpstimesofindiaindiatimescomcityhyderabadtelanganapolicehitbysecondmajordatabreachinweekastscopappcompromisedarticleshowcmsrefstaticinternetfreedomin time telangana polices tscop appwhich uses integrated facialrecognition system help police officers access crime criminal databases match images people taken patrols exposed information reportedly includes offender records police gun licences police officer names designations pictures police station affiliations day telangana police sms service gateway police officers send sms updates awareness messages telangana residents reportedlyhttpswwwdeccanchroniclecomnewshackerbreachesstatepolicesmsservicetotargetdelhipolicenextrefstaticinternetfreedomin breached exposed police alerts important notices included police personnels personal data contact information three breaches reportedly carried threat actor admnfrend police officials statedhttpswwwnewindianexpresscomstatestelanganajuntechlapsepossibleintscopdataleakpolicerefstaticinternetfreedomin could tech lapse tscop app resulting data leak additional details furnished additionally pm june tscop website displayedhttpsthesouthfirstcomtelanganatelanganapolicetakedowntscopafterbreachbutquestionsgaloreondatacopskeeprefstaticinternetfreedomin temporary shutdown service android tscop app also downhttpswebarchiveorgwebhttpstscopstelanganagovin temporary shutdown would warranted initiate investigation curb damage multiple data breaches month data breach tscop website livehttpswwwnewindianexpresscomstatestelanganajulamonthafterdatabreachtelanganapolicewebsiteliveagainrefstaticinternetfreedomin open public use wrote letterhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin certin telangana governmenthttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin highlighting inadequate cybersecurity measures taken telangana police raising concerns polices data collection storage sharing practices prompting investigations calls transparency read posthttpsinternetfreedominthreetelanganapolicedatabreachesrefstaticinternetfreedomin decoding three data breaches means individual privacy well state police forces inadequate response data breaches dropbox data leak significant data breach reportedly suffered dropbox file hosting service exposed customer details unidentified threat actor accessed customer information emails usernames phone numbers hashed passwords well general account settings certain authentication information api keys oauth tokens multifactor authentication breach also affected users never created account received signed document dropbox sign specifically exposing names email addresses response breach dropbox security team reset users passwords logged users devices connected dropbox sign coordinating rotation api keys oauth tokens read letter certin herehttpsdrivegooglecomfiledaycucxomllzpklwbxyztcrarqtfmviewuspsharingrefstaticinternetfreedomin plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive defence personnel information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy help us keep watching watchmen become iff memberhttpsinternetfreedomindonate today ",
    "cleaned_title": "iffs cybersecurity report second quarter",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditlwzlbegbgbdpngwidthformatpngautowebpseddefdcaadaeadedddb tldr recent data breaches leaks underscored widespread impact data security millions users grave cybersecurity incidents like tamil nadu police facial recognition portal breach telangana police network data leak raised concerns detection response capabilities indias cybersecurity authorities series list various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world important documents letter certin icici bank imobile app data breach dated may linkhttpsdrivegooglecomfiledezysbgnluyemavgokntzgtkviewuspsharingrefstaticinternetfreedomin letter certin tamil nadu police facial recognition portal data leak dated may linkhttpsdrivegooglecomfiledtxhwbczukkywgwyoteszjjmakrnviewuspsharingrefstaticinternetfreedomin letter certin telangana police network data breach dated june linkhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin letter telangana government regarding telangana police network data breach dated june linkhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin letter certin dropbox data leak dated may linkhttpsdrivegooglecomfiledaycucxomllzpklwbxyztcrarqtfmviewuspsharingrefstaticinternetfreedomin plugthebreach linkhttpsplugthebreachinrefstaticinternetfreedomin grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiactrefstaticinternetfreedomin indian computer emergency response team certin right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q data breach icici bank imobile app icici bank reportedlyhttpswwwmedianamacomicicibankcustomerscreditcarddetailsleakedrefstaticinternetfreedomin blocked credit cards technical glitch mobile banking application imobile pay following user complaints customer card details visible users breach initially flaggedhttpswwwbusinessstandardcomfinancepersonalfinanceicicibankcreditcardsmappedtowronguserswhatthismeanshtmlrefstaticinternetfreedomin financial forum called technofino details users including card verification values full card numbers card expiry dates shared following icici bank spokesperson acknowledged breach minthttpswwwlivemintcomcompaniesnewsicicibankimobileglitchonlineportalraisesalertnetizensayssensitivecardinformationvisiblehtmlrefstaticinternetfreedomin stated glitch due erroneously mapped data new credit cards digital channels wrote letterhttpsdrivegooglecomfiledezysbgnluyemavgokntzgtkviewuspsharingrefstaticinternetfreedomin certin nodal authority assigned overlook data breaches bringing breach notice highlighting glitch mobile banking app puts customer risk financial loss well data theft data breach tamil nadu police facial recognition portal significant data breach reportedlyhttpstimesofindiaindiatimescomcitychennaitamilnadupolicedatahackedforsaleondarkwebarticleshowcmsrefstaticinternetfreedomin affected tamil nadu police facial recognition portal tnpfrp contained large volume facial biometric data collected facial recognition software used state police track criminals missing persons breach frp reportedhttpswwwmedianamacomtamilnadupolicefacialrecognitionportaldatabreachexposesoverusersdetailsrefstaticinternetfreedomin social media platform x formerly twitter falconfeedsiohttpfalconfeedsio said data samples tnpfrp put sale dark web group named valerie claimed responsibility breach per reportshttpswwwnewindianexpresscomstatestamilnadumaytamilnadupolicesfacerecognitionportalhackedfirpersonalinformationupforsalerefstaticinternetfreedomin file comprising lines data regarding details police officials including ips officers second file lakh lines fir data another lines data police stations compromised breach communicated electronics corporation tamil nadu tamil nadu egovernance agency cdackolkata necessary action complaint also filed cybercrime wing read letter certin herehttpsdrivegooglecomfiledtxhwbczukkywgwyoteszjjmakrnviewuspsharingrefstaticinternetfreedomin read posthttpsinternetfreedominleakintamilnadupolicesfrtdatabaserefstaticinternetfreedomintextonmayccthreatsystemecfrsed explaining data breach facial recognition systems need banned due lack adequate safeguards indian law data breaches telangana police network may june three significant data breaches suffered telangana police network may citizenfacing community policing mobile application hawkeye reportedlyhttpstimesofindiaindiatimescomcityhyderabadtelanganapolicebookcaseafterhawkeyedatabreachonhackersforumarticleshowcmsrefstaticinternetfreedomin suffered data breach thousands emails phone numbers lakh sos records incident reports travel detail records per reportshttpstimesofindiaindiatimescomcityhyderabadtelanganapolicebookcaseafterhawkeyedatabreachonhackersforumarticleshowcmsrefstaticinternetfreedomin location coordinates allegedly exposed posted data leak site breachforums june network hit second breachhttpstimesofindiaindiatimescomcityhyderabadtelanganapolicehitbysecondmajordatabreachinweekastscopappcompromisedarticleshowcmsrefstaticinternetfreedomin time telangana polices tscop appwhich uses integrated facialrecognition system help police officers access crime criminal databases match images people taken patrols exposed information reportedly includes offender records police gun licences police officer names designations pictures police station affiliations day telangana police sms service gateway police officers send sms updates awareness messages telangana residents reportedlyhttpswwwdeccanchroniclecomnewshackerbreachesstatepolicesmsservicetotargetdelhipolicenextrefstaticinternetfreedomin breached exposed police alerts important notices included police personnels personal data contact information three breaches reportedly carried threat actor admnfrend police officials statedhttpswwwnewindianexpresscomstatestelanganajuntechlapsepossibleintscopdataleakpolicerefstaticinternetfreedomin could tech lapse tscop app resulting data leak additional details furnished additionally pm june tscop website displayedhttpsthesouthfirstcomtelanganatelanganapolicetakedowntscopafterbreachbutquestionsgaloreondatacopskeeprefstaticinternetfreedomin temporary shutdown service android tscop app also downhttpswebarchiveorgwebhttpstscopstelanganagovin temporary shutdown would warranted initiate investigation curb damage multiple data breaches month data breach tscop website livehttpswwwnewindianexpresscomstatestelanganajulamonthafterdatabreachtelanganapolicewebsiteliveagainrefstaticinternetfreedomin open public use wrote letterhttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin certin telangana governmenthttpsdrivegooglecomfiledghmjebqvkmgmfsdueoiwyysurqylviewuspsharingrefstaticinternetfreedomin highlighting inadequate cybersecurity measures taken telangana police raising concerns polices data collection storage sharing practices prompting investigations calls transparency read posthttpsinternetfreedominthreetelanganapolicedatabreachesrefstaticinternetfreedomin decoding three data breaches means individual privacy well state police forces inadequate response data breaches dropbox data leak significant data breach reportedly suffered dropbox file hosting service exposed customer details unidentified threat actor accessed customer information emails usernames phone numbers hashed passwords well general account settings certain authentication information api keys oauth tokens multifactor authentication breach also affected users never created account received signed document dropbox sign specifically exposing names email addresses response breach dropbox security team reset users passwords logged users devices connected dropbox sign coordinating rotation api keys oauth tokens read letter certin herehttpsdrivegooglecomfiledaycucxomllzpklwbxyztcrarqtfmviewuspsharingrefstaticinternetfreedomin plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive defence personnel information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy help us keep watching watchmen become iff memberhttpsinternetfreedomindonate today",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF’s cybersecurity report for the second quarter of 2024",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/l8wzlbegbgbd1.png?width=1600&format=png&auto=webp&s=4e32681d91defdc1aada2ea6d72161eddd017b25) # tl;dr Recent data breaches and leaks have underscored the widespread impact on the data security of millions of users. Grave cybersecurity incidents, like the Tamil Nadu Police Facial Recognition Portal breach and the Telangana Police Network data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. This series will list the various cybersecurity incidents that occurred during a quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience in an interconnected digital world. # Important documents 1. Letter to CERT-In on ICICI Bank 'iMobile' app data breach dated May 8, 2024 ([~Link~](https://drive.google.com/file/d/1e_ZYsB20GNl5UYemavG7oknt66Zgt4k8/view?usp=sharing&ref=static.internetfreedom.in)) 2. Letter to CERT-In on Tamil Nadu Police Facial Recognition Portal data leak dated May 15, 2024 ([~Link~](https://drive.google.com/file/d/1t7xhw8BCzu2KKYWg9WYoTeSzJjMAK4rN/view?usp=sharing&ref=static.internetfreedom.in)) 3. Letter to CERT-In on the Telangana Police Network data breach dated June 21, 2024 ([~Link~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in)) 4. Letter to the Telangana government regarding the Telangana Police Network data breach dated June 21, 2024 ([~Link~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in)) 5. Letter to CERT-In on Dropbox data leak dated May 23, 2024 ([~Link~](https://drive.google.com/file/d/1aycucx5om8L9lzpkLWbXyzTCraRQTF7M/view?usp=sharing&ref=static.internetfreedom.in)) 6. PlugTheBreach [~(Link)~](https://plugthebreach.in/?ref=static.internetfreedom.in) # The grim state of cybersecurity in India The urgent need to operationalise the [~Digital Personal Data Protection Act (“DPDPA”), 2023~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) is underscored by the increasingly pervasive threats to individuals’ digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting data protection legislation is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The [~exemption~](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/?ref=static.internetfreedom.in) of the Indian Computer Emergency Response Team (“CERT-In”) in 2023 from the Right to Information (“RTI”) Act, 2005 raises serious concerns about the accountability of an organisation whose actions or inaction is consequential for the status of cyber security and individual privacy in the country. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them. # Data breaches and vulnerabilities in 2024 Q2 1. **Data breach of ICICI Bank 'iMobile' app:** ICICI Bank [~reportedly~](https://www.medianama.com/2024/04/223-17000-icici-bank-customers-credit-card-details-leaked/?ref=static.internetfreedom.in) blocked 17,000 credit cards after a technical glitch in its mobile banking application, ‘iMobile Pay’, following user complaints about customer card details being visible to other users. The breach was initially [~flagged~](https://www.business-standard.com/finance/personal-finance/17-000-icici-bank-credit-cards-mapped-to-wrong-users-what-this-means-124042600115_1.html?ref=static.internetfreedom.in) on a financial forum called Technofino, where details of users including Card Verification Values, full card numbers, and card expiry dates were shared. Following this, an ICICI Bank spokesperson acknowledged the breach to [~Mint~](https://www.livemint.com/companies/news/icici-bank-imobile-glitch-online-portal-raises-alert-netizen-says-sensitive-card-information-visible-11714022513098.html?ref=static.internetfreedom.in) and stated that “*the glitch was due to “erroneously mapped” data of 17,000 new credit cards in their digital channels*.” We wrote a [~letter~](https://drive.google.com/file/d/1e_ZYsB20GNl5UYemavG7oknt66Zgt4k8/view?usp=sharing&ref=static.internetfreedom.in) to CERT-In, the nodal authority assigned to overlook data breaches, bringing this breach to their notice and highlighting that such a glitch in the mobile banking app puts the customer at risk of financial loss as well as data theft. 1. **Data Breach of the Tamil Nadu Police Facial Recognition Portal:** A significant data breach [~reportedly~](https://timesofindia.indiatimes.com/city/chennai/tamil-nadu-police-data-hacked-for-sale-on-dark-web/articleshow/109854032.cms?ref=static.internetfreedom.in) affected the Tamil Nadu Police Facial Recognition Portal (“TNP-FRP”) which contained a large volume of facial biometric data collected through facial recognition software used by the state police to track criminals and missing persons. The breach of the FRP was [~reported~](https://www.medianama.com/2024/05/223-tamil-nadu-police-facial-recognition-portal-data-breach-exposes-over-50000-users-details/?ref=static.internetfreedom.in) on the social media platform X (formerly Twitter) by [Falconfeeds.io](http://Falconfeeds.io), which said data samples from the TNP-FRP have been put on sale for $2 to $3 on the dark web. A group named ‘Valerie’ claimed responsibility for the breach. As per [~reports~](https://www.newindianexpress.com/states/tamil-nadu/2024/May/05/tamil-nadu-polices-face-recognition-portal-hacked-fir-personal-information-up-for-sale?ref=static.internetfreedom.in), a file comprising 55,000 lines of data regarding details of police officials, including IPS officers, a second file with 8.9 lakh lines of FIR data and another with 2,700 lines of data on police stations were compromised. The breach was communicated to the Electronics Corporation of Tamil Nadu, Tamil Nadu E-Governance Agency, and CDAC-Kolkata for necessary action and a complaint was also filed with the cyber-crime wing. Read our letter to CERT-In [~here~](https://drive.google.com/file/d/1t7xhw8BCzu2KKYWg9WYoTeSzJjMAK4rN/view?usp=sharing&ref=static.internetfreedom.in). Read our [~post~](https://internetfreedom.in/leak-in-tamil-nadu-polices-frt-database/?ref=static.internetfreedom.in#:~:text=On%20May%204%2C%202024%2C%20threat,System%20(%E2%80%9CFRS%E2%80%9D).) explaining the data breach and how facial recognition systems need to be banned due to lack of adequate safeguards under Indian law. 2. **Data Breach(es) of the Telangana Police Network:** From May 29 to June 7, 2024, three significant data breaches were suffered by the Telangana Police Network. On May 29, the citizen-facing ‘community policing’ mobile application ‘HawkEye’ [~reportedly~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-book-case-after-hawkeye-data-breach-on-hackers-forum/articleshow/110683120.cms?ref=static.internetfreedom.in) suffered a data breach where thousands of emails and phone numbers, 1.30 lakh SOS records, 70,000 incident reports, 20,000 travel detail records (and as per some [~reports~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-book-case-after-hawkeye-data-breach-on-hackers-forum/articleshow/110683120.cms?ref=static.internetfreedom.in), location coordinates) were allegedly exposed and posted on data leak site BreachForums. On June 7, the network was hit by a [~second breach~](https://timesofindia.indiatimes.com/city/hyderabad/telangana-police-hit-by-second-major-data-breach-in-week-as-tscop-app-compromised/articleshow/110789926.cms?ref=static.internetfreedom.in), this time on Telangana police’s TSCOP App—which uses an integrated facial-recognition system to help police officers access crime and criminal databases and match images of people taken during patrols. Exposed information reportedly includes offender records, police gun licences, police officer names, designations, and pictures, and police station affiliations. The same day, the Telangana police SMS service, which is a gateway for police officers to send SMS updates and awareness messages to Telangana residents, was [~reportedly~](https://www.deccanchronicle.com/news/hacker-breaches-state-police-sms-service-to-target-delhi-police-next-897889?ref=static.internetfreedom.in) breached. This exposed police alerts and important notices, which included police personnel’s personal data and contact information. All three breaches were reportedly carried out by the same threat actor ‘Adm1nFr1end’. Police officials [~stated~](https://www.newindianexpress.com/states/telangana/2024/Jun/09/tech-lapse-possible-in-tscop-data-leak-police?ref=static.internetfreedom.in) there “*could be a tech lapse*” in the TSCOP App resulting in the data leak, but no additional details have been furnished. Additionally, as of 12 PM on June 21, 2024, the TSCOP website [~displayed~](https://thesouthfirst.com/telangana/telangana-police-take-down-tscop-after-breach-but-questions-galore-on-data-cops-keep/?ref=static.internetfreedom.in) a temporary shutdown of service. The Android TSCOP App was also [~down~](https://web.archive.org/web/20240611064823/https://tscops.telangana.gov.in/). Such a temporary shutdown would have been warranted to initiate an investigation and curb the damage of the multiple data breaches. A month after the data breach, the TSCOP website was [~live~](https://www.newindianexpress.com/states/telangana/2024/Jul/01/a-month-after-data-breach-telangana-police-website-live-again?ref=static.internetfreedom.in) again and open for public use. We wrote a [~letter~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in) to CERT-In and the [~Telangana government~](https://drive.google.com/file/d/1ghMJEBq4V9KmgmfS33dUEOIwyYsURqyL/view?usp=sharing&ref=static.internetfreedom.in) highlighting the inadequate cybersecurity measures being taken by the Telangana police and raising our concerns about the police’s data collection, storage, and sharing practices, prompting investigations and calls for transparency. Read our [~post~](https://internetfreedom.in/three-telangana-police-data-breaches/?ref=static.internetfreedom.in) decoding the three data breaches and what it means for individual privacy, as well as the state police force’s inadequate response to the data breaches. 1. **Dropbox data leak:** A significant data breach was reportedly suffered by Dropbox, a file hosting service, that exposed customer details. The unidentified threat actor accessed customer information such as emails, usernames, phone numbers, and hashed passwords as well as general account settings and certain authentication information such as API keys, OAuth tokens, and multi-factor authentication. The breach also affected users who never created an account but received or signed a document through Dropbox Sign, specifically exposing their names and email addresses. In response to the breach, the Dropbox security team “reset users’ passwords, logged users out of any devices they had connected to Dropbox Sign, and is coordinating the rotation of all API keys and OAuth tokens”. Read our letter to CERT-In [~here~](https://drive.google.com/file/d/1aycucx5om8L9lzpkLWbXyzTCraRQTF7M/view?usp=sharing&ref=static.internetfreedom.in). # PlugTheBreach: IFF’s data breach tracker You can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [~PlugTheBreach~](https://plugthebreach.in/?ref=static.internetfreedom.in), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. # Conclusion The multitude of [~recent data breaches and leaks~](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE) underscores the critical importance of robust cybersecurity measures in today's digital landscape. From breaches compromising sensitive defence personnel information to vulnerabilities in major databases and platforms, these incidents highlight the pervasive risks individuals and organisations face. In these challenges, organisations must prioritise proactive cybersecurity measures, including regular audits, robust encryption protocols, and swift incident response procedures. Moreover, there's an urgent need for greater transparency and accountability in handling data breaches, as seen in cases where affected companies failed to acknowledge or adequately address the breaches promptly. Public awareness and education on cybersecurity best practices also play a vital role in mitigating risks and fostering a culture of cyber resilience. Thus, as we navigate an increasingly interconnected digital world, we must remain vigilant and proactive in safeguarding our digital assets and protecting user privacy. *Help us keep watching the watchmen. Become an* [*~IFF member~*](https://internetfreedom.in/donate/) *~today!~*",
    "light_cleaned_comments": ""
}