{
    "id": "1gzevq1",
    "title": "Adani Group ₹2,200 Crore Bribery Case: Just the Tip of the Corruption Iceberg",
    "url": "https://www.reddit.com/r/india/comments/1gzevq1/adani_group_2200_crore_bribery_case_just_the_tip/",
    "selftext": "The allegations of a [₹2,200 crore ($265 million) bribe by the Adani Group to secure solar energy contracts (link)](https://www.hindustantimes.com/india-news/gautam-adani-nephew-sagar-adani-summoned-by-us-sec-in-adani-group-bribery-case-if-you-fail-to-respond-101732429783009.html) have sparked widespread outrage. Social media is abuzz with indignation at the audacity and scale of this alleged corruption. However, the broader issue of institutionalized bribery, which affects every layer of society, remains largely unexamined.\n\nAt the grassroots level, corruption begins with small but significant instances. A few common example:\n\n* **RTO Offices**: Youngsters often find themselves paying bribes to secure their first driver’s licenses or during passport verification by local police. The urgency of individual needs makes refusal impractical.\n* **Traffic Violations**: A pervasive “chalta hai” attitude leads many to bribe traffic officers rather than paying the prescribed fines.\n* **Real Estate Transactions**: Anyone involved in buying or selling property knows the endemic corruption in sub-registrar offices and land-record departments.\n\nIn business, bribery becomes a normalized “cost of doing business,” encompassing everything from:\n\n* Greasing palms for trade permits and licenses,\n* Paying off inspectors during routine checks,\n* Securing GST approvals,\n* Facilitating smooth transportation of goods.\n\nAfter the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact.\n\n**Personal Reflections: A Case Study for Thought**\n\nOn a personal note, [I’ve spent years battling corruption in local government offices, from the Tahsildar to the Deputy Commissioner, armed with court orders and contempt notices. (link)](https://chng.it/VpXVwtKNyH) The fight? To avoid succumbing to the “huge” bribes demanded. MBA students might analyze as a case study in **\"Cost of Doing Business vs. Time Value of Money\"** in modern India (Repost with links)",
    "flair": "Rant / Vent",
    "score": 257,
    "num_comments": 32,
    "created_utc": 1732526126.0,
    "convurl": "https://external-preview.redd.it/g547foyD9hKigPXXgub569WRjv1EurZujcOYiNbs3YM.jpg?auto=webp&s=ec9b65a18a15253f564de43451a10ce1b5777aa7",
    "comments": [
        "Corruption is highly ingrained in Indian society. This can't be fixed. The same guy cribbing about corruption will gladly do it if he was in a position to do it. There are exceptions but a drop in the ocean of 1.4 billion folks.\n\nI think it has a lot to do with uncertainty and absolute lack of social security..I have friends earning upwards of 50LPA, who aren't sure how they will retire or whether they can work till 60. And after you complete your career, the government will throw you a big bag of jackass as a gift for your contribution to Indian society. So if no one's out there to take care of you, if no one's going to help you in your old age, the drive will be to take maximum you can before your income stops. Most of our problems come from there.\n\nGive the people a dignified retirement plan, and corruption might decrease over the long run. In all low corruption societies like Scandinavian countries, there's a golden retirement plan waiting for you, your kids get top class education and career support. They get social security no matter how big you fail in life.\n\nTill then, everyone loot after yourselves.",
        "Itna bhi sach nahi bolna tha",
        "> Give the people a dignified retirement plan, and corruption might decrease over the long run.\n\nGovernment employees have the most decent retirement plan.. Yet!",
        "Most pensions are stopped if I'm not mistaken. Also keep in mind that government employees are low paid and the pension is even less. An IT engineer can very easily match the salary of a grade A officer's max income in 10 years. If earning legally, a govt officer will make much less compared to corporate if both could complete their careers.",
        "While your point is valid, let’s not engage in absurdism. \n\n50LPA? Dude can earn in one year what many can’t manage over multiple generations. If someone earning 50LPA is unsure about their retirement, it’s because they have financial bad habits.",
        "True democratization of bribery is our contribution.",
        "Yeah the poor babus and their difficult retirement plans.. seriously?",
        ">After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact.   \n\n\nAnd this is why we shouldn't let these capitalists control our politics. When the pears Pawars meet shah in adani's House, he's not talking politics, he's securing his profits. When Gautamdas flies in adani airplane to become the prime minister, Gautam is counting his coins.    \n\n\nAnd those 2,200cr are only a tip of the adani bribery iceberg itself. The total profits he's made from the country in various power, infrastructure and other projects is much much higher. This is the evidence the Americans happened to catch in a specific investigation about specific investments he'd raised in the USA.  \n\n\n The only solution is political finance reforms. Political parties should be funded by taxes on corporate revenue, and the money distributed according to the vote share at the national, state, and local levels. BJ head office alone costs thousands of crores, and every election sees much more than that spent in reality. We need to start with admitting the actual costs of elections, and ensure that political parties can get the financing required to contest the elections without guaranteeing undue favours to billionaires. ",
        "Political reform should come along with a clean sweep of bureaucracy at all levels!",
        "A country where 99% people aspire to become IAS/IPS only to become rich and powerful through illegal means. I'm surprised that this case is even getting any attention. 2200cr is chump change compared to what Govt babus and politicians of the past did and got caught only to go scot free.",
        "It's not about bad financial habits. It is about having an acceptable standard of living. Even if somebody makes 50LPA, what gets left behind after the income taxes? What gets left behind 20 years in future after the humongous inflation eats it away in purchasing power?",
        "From 50LPA, GOI takes 20. Consider the PF amount as also lost because there's no guarantee we'll see our pf at the end of our careers. Government can just say take a measly 10k pension and be done with it. Now you are left with 30.\n\nWhile I agree that it's a good amount but consider this - rent in a good 3BHK - 7LPA. Good school for two kids - 6LPA easy. Annual savings - 15LPA. That's 28LPA. Also, try buying an apartment in a good community - 2CR min.\n\nNow before you come swinging why the person can't stay in a slum and pay 10k rent, or why his kids can't go to government schools - why is he earning 50LPA then?\n\nThe situation in India is like this - want a secure future? Live in austerity. Enjoying life? Get ready for a life of difficulty later unless your children bails you out.\n\nYou might think that you can reduce your expenses but unless your life improves, then that 50LPA is useless.",
        "36 LPA remains(assuming surcharge). Taxes apply to everyone who isn’t a farmer. Inflation is exactly why you need to have good financial habits and save AND invest in appreciating assets. Acceptable standard of living is different from splurging. If you’re trying to live like the super rich at 50LPA, obviously there won’t be anything left.",
        "In the US if you report tax evasion you can get a percentage as a reward. If you could just send recordings of officials accepting your bribes and the government had to pay you 10x your bribe, that might make officials reluctant to take bribes from anyone but trusted friends.",
        "Bro u are talking nothing short of revolution. We are quite far from that happening, maybe 20-25 yrs away",
        "I think this is just a case of a fundamental difference in beliefs. \n\nI just assumed the austerity part. Personally I don’t think austerity is that big of a sacrifice for being able to buy your own place and assure a secure retirement. You don’t have to take it as far as Slum + government school, but I’m a firm believer in living below my means. \n\nBut maybe that’s just me and I’m alone in this belief. \n\nAgree about the taxes not doing as much as we’d like. \n\nBut here’s a possible caveat about the social security you’re advocating for. Many Americans constantly whine about how their social security payments go towards feeding and housing other people. Essentially a ‘pay in and get nothing back’(because they don’t need it unless they fuck up). It sounds similar to what we say about taxes. That WE don’t get benefits commensurate to the taxes WE pay.",
        "Entire running of Indian society from top to bottom is now based on corruption. Its the fuel that makes the system work.Successive Govts instead of reducing it have enhanced it in their own ways, It will require a revolution to change the way people think , which is never going to happen.",
        "Exact catch.",
        "exact truth. power and corruption goes hand in hand in india. there is no doubt in it.",
        "Your 80% of babus are at best middle class, and not rich. The ones you see amassing great wealth are the too layers.",
        "Yep. Pensions are gone for most government employees except Armed forces, Bureaucrats and politicians",
        "Living in the better parts of Bombay costs 18L-20L a year for a family of 4. Much more if the children go to good private schools. One or two vacation(s) a year is another 3L-6L. If somebody is making 50L a year, this is bare minimum the person's family should have in his life. 2L invested each year for children's college. So he saves maximum 6L-8L a year for retirement?\n\nConsidering today's heathcare inflation and life expectancy, that is abysmal.",
        "Not possible to prevent in India. \n\nIt's more about the thought process of people. Wherever you can't even wait in a queue, trying to gain advantage at every instance, you will resort to bribery, scam, etc.",
        "Poor bastards.",
        "The same sons of whores who defend Adani now, used to cry about corruption in 2014",
        "Okay we get it. \n\nTaxes are bad. Government should function without money. Landowners should rent for lower, teachers and doctors should work for free and how dare vacations cost so much?!\n\nBut you are entitled to a supermodel wife, 2 kids, a 5bhk flat beside Antilla and your 50LPA salary is beyond reproach. \n\nAs I replied to the other guy, this is just a fundamental difference in thought process. Dialogue isn’t possible when one person thinks they are entitled to something and another doesn’t.",
        ">Taxes are bad. Government should function without money. Landowners should rent for lower, teachers and doctors should work for free and how dare vacations cost so much?!\n\nNobody should work for free and landowners are not wrong. It is the high inflation that is the major culprit here. Again, even vacations cost so high because the inflation in INR erodes its value by a large number every year.\n\nI am also saying that the high taxes are bad for people living in India because the net sum of a life in India isn't that good. The high taxes are just another misery that make life worse here. The same person living somewhere else paying the same % of income in taxes would have a far better standard of living. India is wrong to tax these people so high especially when the bigger picture doesn't justify it.\n\nIf a person is making 50L a year in India, they are most probably capable of moving abroad either via job or education. Everybody who makes that much money realizes this, and many today have the courage to get up and leave. It's no surprise that a huge number are doing just that.\n\n>But you are entitled to a supermodel wife, 2 kids, a 5bhk flat beside Antilla and your 50LPA salary is beyond reproach. After all, you’re the only one on the planet who works hard.\n\nBy default, if somebody makes 50L here, they are exceptionally skilled and in the top 1% of the country. Yes, I work hard and I am entitled to whatever I earn. You know who is not entitled to what I earned? The population in this country who the Government distributes lakhs of crores of taxpayer money to, like it is candy, after stealing it from people like me.",
        "Then leave. As long as your 50LPA isn’t earned in India and subject to tax in India. \n\nFood prices are a major source of inflation and those aren’t because farmers don’t know how to farm. Climate and Macro factors apply. Farmers across the world always get assistance from the governments. Because food shortages are bad. Even rugged capitalist Trump did it during his first term. And he’s likely to do it again in January. \n\nAs far as giving money out goes, I agree. It’s election gimmicks taken too far. Mind you I’m not advocating for whatever brand of rugged capitalism you are. In that case whatever tax money is saved on social schemes will have to be pumped to the police to curb what happened the last time someone told starving people to ‘just eat cake if there’s no bread’. \n\nMy original reply was that someone earning 50LPA can relatively easily get their future on track (by living frugally). This is based on the assumption that there are things you can control and things you can’t. You want to save and get your desired standard of living, it’s unlikely to happen in India. As you said, you are the 1%. The 99% will always outnumber (and outvote) you. So you should leave.",
        "Dude do u believe government salary= top class ... No it isn't, no one wants to live minimal . everyone wants to create their cushion as big as they can.",
        ">Then leave. As long as your 50LPA isn’t earned in India and subject to tax in India.\n\nAnybody who can, is leaving or has already left.\n\n>Food prices are a major source of inflation and those aren’t because farmers don’t know how to farm. Climate and Macro factors apply.\n\nFarmers don't know how to farm because the incentives in place favor inefficiency. There is no incentive to pay back loans because it will probably get waived off. There is no incentive to conserve power because it's subsidised.\n\n>As far as giving money out goes, I agree. It’s election gimmicks taken too far. Mind you I’m not advocating for whatever brand of rugged capitalism you are. In that case whatever tax money is saved on social schemes will have to be pumped to the police to curb what happened the last time someone told starving people to ‘just eat cake if there’s no bread’.\n\nNo, what needs to happen is taxes lowered, pollution dealt with, and infrastructure be upgraded. Although, yes we need more police to deal with the rampant lawlessness across the country.\n\n>My original reply was that someone earning 50LPA can relatively easily get their future on track (by living frugally). This is based on the assumption that there are things you can control and things you can’t. You want to save and get your desired standard of living, it’s unlikely to happen in India.\n\nA person earning the PPP equivalent of 50 lakh in some other country would be in a much better condition in some other country. India could be better than it currently is, but it still will never be as good as the other countries. The reasons are simple - just look around you at the bad roads, trash strewn everywhere, excessive traffic.\n\nAnd no, even 50LPA won't be okay to plan a retirement in a major city in India with the real estate prices and inflation we are seeing today. Petrol has been at 100 plus for so much time, and nobody even cares. If a person wanted to just survive, they could do that at 8L /year in some tier-3 town. But a person who makes 50LPA and is in the top 1% shouldn't have to live in a tier-3 town.",
        "If even 50LPA isn’t enough for you, I don’t know what to say that I haven’t already said. Earn more. But even if you earn 200LPA, then you’ll want a lifestyle that you think is commensurate to that income. “Why is Dhirubhai Ambani International so expensive?” “Why does my penthouse rent keep increasing every year?”",
        "Eh no. Major expenses like house, food utilities stay the same. So do the vacation and children's education."
    ],
    "cleaned_text": "adani group crore bribery case tip corruption iceberg allegations crore million bribe adani group secure solar energy contracts linkhttpswwwhindustantimescomindianewsgautamadaninephewsagaradanisummonedbyussecinadanigroupbriberycaseifyoufailtorespondhtml sparked widespread outrage social media abuzz indignation audacity scale alleged corruption however broader issue institutionalized bribery affects every layer society remains largely unexamined grassroots level corruption begins small significant instances common example rto offices youngsters often find paying bribes secure first drivers licenses passport verification local police urgency individual needs makes refusal impractical traffic violations pervasive chalta hai attitude leads many bribe traffic officers rather paying prescribed fines real estate transactions anyone involved buying selling property knows endemic corruption subregistrar offices landrecord departments business bribery becomes normalized cost business encompassing everything greasing palms trade permits licenses paying inspectors routine checks securing gst approvals facilitating smooth transportation goods media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact personal reflections case study thought personal note ive spent years battling corruption local government offices tahsildar deputy commissioner armed court orders contempt notices linkhttpschngitvpxvwtknyh fight avoid succumbing huge bribes demanded mba students might analyze case study cost business vs time value money modern india repost links ",
    "cleaned_title": "adani group crore bribery case tip corruption iceberg",
    "cleaned_selftext": "allegations crore million bribe adani group secure solar energy contracts linkhttpswwwhindustantimescomindianewsgautamadaninephewsagaradanisummonedbyussecinadanigroupbriberycaseifyoufailtorespondhtml sparked widespread outrage social media abuzz indignation audacity scale alleged corruption however broader issue institutionalized bribery affects every layer society remains largely unexamined grassroots level corruption begins small significant instances common example rto offices youngsters often find paying bribes secure first drivers licenses passport verification local police urgency individual needs makes refusal impractical traffic violations pervasive chalta hai attitude leads many bribe traffic officers rather paying prescribed fines real estate transactions anyone involved buying selling property knows endemic corruption subregistrar offices landrecord departments business bribery becomes normalized cost business encompassing everything greasing palms trade permits licenses paying inspectors routine checks securing gst approvals facilitating smooth transportation goods media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact personal reflections case study thought personal note ive spent years battling corruption local government offices tahsildar deputy commissioner armed court orders contempt notices linkhttpschngitvpxvwtknyh fight avoid succumbing huge bribes demanded mba students might analyze case study cost business vs time value money modern india repost links",
    "cleaned_comments": "corruption highly ingrained indian society cant fixed guy cribbing corruption gladly position exceptions drop ocean billion folks think lot uncertainty absolute lack social securityi friends earning upwards lpa arent sure retire whether work till complete career government throw big bag jackass gift contribution indian society ones take care ones going help old age drive take maximum income stops problems come give people dignified retirement plan corruption might decrease long run low corruption societies like scandinavian countries theres golden retirement plan waiting kids get top class education career support get social security matter big fail life till everyone loot itna bhi sach nahi bolna tha give people dignified retirement plan corruption might decrease long run government employees decent retirement plan yet pensions stopped im mistaken also keep mind government employees low paid pension even less engineer easily match salary grade officers max income years earning legally govt officer make much less compared corporate could complete careers point valid lets engage absurdism lpa dude earn one year many cant manage multiple generations someone earning lpa unsure retirement financial bad habits true democratization bribery contribution yeah poor babus difficult retirement plans seriously media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact shouldnt let capitalists control politics pears pawars meet shah adanis house hes talking politics hes securing profits gautamdas flies adani airplane become prime minister gautam counting coins cr tip adani bribery iceberg total profits hes made country various power infrastructure projects much much higher evidence americans happened catch specific investigation specific investments hed raised usa solution political finance reforms political parties funded taxes corporate revenue money distributed according vote share national state local levels bj head office alone costs thousands crores every election sees much spent reality need start admitting actual costs elections ensure political parties get financing required contest elections without guaranteeing undue favours billionaires political reform come along clean sweep bureaucracy levels country people aspire become iasips become rich powerful illegal means im surprised case even getting attention cr chump change compared govt babus politicians past got caught go scot free bad financial habits acceptable standard living even somebody makes lpa gets left behind income taxes gets left behind years future humongous inflation eats away purchasing power lpa goi takes consider pf amount also lost theres guarantee well see pf end careers government say take measly k pension done left agree good amount consider rent good bhk lpa good school two kids lpa easy annual savings lpa thats lpa also try buying apartment good community cr min come swinging person cant stay slum pay k rent kids cant go government schools earning lpa situation india like want secure future live austerity enjoying life get ready life difficulty later unless children bails might think reduce expenses unless life improves lpa useless lpa remainsassuming surcharge taxes apply everyone isnt farmer inflation exactly need good financial habits save invest appreciating assets acceptable standard living different splurging youre trying live like super rich lpa obviously wont anything left us report tax evasion get percentage reward could send recordings officials accepting bribes government pay x bribe might make officials reluctant take bribes anyone trusted friends bro u talking nothing short revolution quite far happening maybe yrs away think case fundamental difference beliefs assumed austerity part personally dont think austerity big sacrifice able buy place assure secure retirement dont take far slum government school im firm believer living means maybe thats im alone belief agree taxes much wed like heres possible caveat social security youre advocating many americans constantly whine social security payments go towards feeding housing people essentially pay get nothing backbecause dont need unless fuck sounds similar say taxes dont get benefits commensurate taxes pay entire running indian society top bottom based corruption fuel makes system worksuccessive govts instead reducing enhanced ways require revolution change way people think never going happen exact catch exact truth power corruption goes hand hand india doubt babus best middle class rich ones see amassing great wealth layers yep pensions gone government employees except armed forces bureaucrats politicians living better parts bombay costs year family much children go good private schools one two vacations year another somebody making l year bare minimum persons family life l invested year childrens college saves maximum year retirement considering todays heathcare inflation life expectancy abysmal possible prevent india thought process people wherever cant even wait queue trying gain advantage every instance resort bribery scam etc poor bastards sons whores defend adani used cry corruption okay get taxes bad government function without money landowners rent lower teachers doctors work free dare vacations cost much entitled supermodel wife kids bhk flat beside antilla lpa salary beyond reproach replied guy fundamental difference thought process dialogue isnt possible one person thinks entitled something another doesnt taxes bad government function without money landowners rent lower teachers doctors work free dare vacations cost much nobody work free landowners wrong high inflation major culprit even vacations cost high inflation inr erodes value large number every year also saying high taxes bad people living india net sum life india isnt good high taxes another misery make life worse person living somewhere else paying income taxes would far better standard living india wrong tax people high especially bigger picture doesnt justify person making l year india probably capable moving abroad either via job education everybody makes much money realizes many today courage get leave surprise huge number entitled supermodel wife kids bhk flat beside antilla lpa salary beyond reproach youre one planet works hard default somebody makes l exceptionally skilled top country yes work hard entitled whatever earn know entitled earned population country government distributes lakhs crores taxpayer money like candy stealing people like leave long lpa isnt earned india subject tax india food prices major source inflation arent farmers dont know farm climate macro factors apply farmers across world always get assistance governments food shortages bad even rugged capitalist trump first term hes likely january far giving money goes agree election gimmicks taken far mind im advocating whatever brand rugged capitalism case whatever tax money saved social schemes pumped police curb happened last time someone told starving people eat cake theres bread original reply someone earning lpa relatively easily get future track living frugally based assumption things control things cant want save get desired standard living unlikely happen india said always outnumber outvote leave dude u believe government salary top class isnt one wants live minimal everyone wants create cushion big leave long lpa isnt earned india subject tax india anybody leaving already left food prices major source inflation arent farmers dont know farm climate macro factors apply farmers dont know farm incentives place favor inefficiency incentive pay back loans probably get waived incentive conserve power subsidised far giving money goes agree election gimmicks taken far mind im advocating whatever brand rugged capitalism case whatever tax money saved social schemes pumped police curb happened last time someone told starving people eat cake theres bread needs happen taxes lowered pollution dealt infrastructure upgraded although yes need police deal rampant lawlessness across country original reply someone earning lpa relatively easily get future track living frugally based assumption things control things cant want save get desired standard living unlikely happen india person earning ppp equivalent lakh country would much better condition country india could better currently still never good countries reasons simple look around bad roads trash strewn everywhere excessive traffic even lpa wont okay plan retirement major city india real estate prices inflation seeing today petrol plus much time nobody even cares person wanted survive could l year tier town person makes lpa top shouldnt live tier town even lpa isnt enough dont know say havent already said earn even earn lpa youll want lifestyle think commensurate income dhirubhai ambani international expensive penthouse rent keep increasing every year eh major expenses like house food utilities stay vacation childrens education",
    "light_cleaned_title": "Adani Group ₹2,200 Crore Bribery Case: Just the Tip of the Corruption Iceberg",
    "light_cleaned_selftext": "The allegations of a [₹2,200 crore ($265 million) bribe by the Adani Group to secure solar energy contracts (link)](https://www.hindustantimes.com/india-news/gautam-adani-nephew-sagar-adani-summoned-by-us-sec-in-adani-group-bribery-case-if-you-fail-to-respond-101732429783009.html) have sparked widespread outrage. Social media is abuzz with indignation at the audacity and scale of this alleged corruption. However, the broader issue of institutionalized bribery, which affects every layer of society, remains largely unexamined. At the grassroots level, corruption begins with small but significant instances. A few common example: * **RTO Offices**: Youngsters often find themselves paying bribes to secure their first driver’s licenses or during passport verification by local police. The urgency of individual needs makes refusal impractical. * **Traffic Violations**: A pervasive “chalta hai” attitude leads many to bribe traffic officers rather than paying the prescribed fines. * **Real Estate Transactions**: Anyone involved in buying or selling property knows the endemic corruption in sub-registrar offices and land-record departments. In business, bribery becomes a normalized “cost of doing business,” encompassing everything from: * Greasing palms for trade permits and licenses, * Paying off inspectors during routine checks, * Securing GST approvals, * Facilitating smooth transportation of goods. After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact. **Personal Reflections: A Case Study for Thought** On a personal note, [I’ve spent years battling corruption in local government offices, from the Tahsildar to the Deputy Commissioner, armed with court orders and contempt notices. (link)](https://chng.it/VpXVwtKNyH) The fight? To avoid succumbing to the “huge” bribes demanded. MBA students might analyze as a case study in **\"Cost of Doing Business vs. Time Value of Money\"** in modern India (Repost with links)",
    "light_cleaned_comments": "Corruption is highly ingrained in Indian society. This can't be fixed. The same guy cribbing about corruption will gladly do it if he was in a position to do it. There are exceptions but a drop in the ocean of 1.4 billion folks. I think it has a lot to do with uncertainty and absolute lack of social security..I have friends earning upwards of 50LPA, who aren't sure how they will retire or whether they can work till 60. And after you complete your career, the government will throw you a big bag of jackass as a gift for your contribution to Indian society. So if no one's out there to take care of you, if no one's going to help you in your old age, the drive will be to take maximum you can before your income stops. Most of our problems come from there. Give the people a dignified retirement plan, and corruption might decrease over the long run. In all low corruption societies like Scandinavian countries, there's a golden retirement plan waiting for you, your kids get top class education and career support. They get social security no matter how big you fail in life. Till then, everyone loot after yourselves. Itna bhi sach nahi bolna tha > Give the people a dignified retirement plan, and corruption might decrease over the long run. Government employees have the most decent retirement plan.. Yet! Most pensions are stopped if I'm not mistaken. Also keep in mind that government employees are low paid and the pension is even less. An IT engineer can very easily match the salary of a grade A officer's max income in 10 years. If earning legally, a govt officer will make much less compared to corporate if both could complete their careers. While your point is valid, let’s not engage in absurdism. 50LPA? Dude can earn in one year what many can’t manage over multiple generations. If someone earning 50LPA is unsure about their retirement, it’s because they have financial bad habits. True democratization of bribery is our contribution. Yeah the poor babus and their difficult retirement plans.. seriously? >After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact. And this is why we shouldn't let these capitalists control our politics. When the pears Pawars meet shah in adani's House, he's not talking politics, he's securing his profits. When Gautamdas flies in adani airplane to become the prime minister, Gautam is counting his coins. And those 2,200cr are only a tip of the adani bribery iceberg itself. The total profits he's made from the country in various power, infrastructure and other projects is much much higher. This is the evidence the Americans happened to catch in a specific investigation about specific investments he'd raised in the USA. The only solution is political finance reforms. Political parties should be funded by taxes on corporate revenue, and the money distributed according to the vote share at the national, state, and local levels. BJ head office alone costs thousands of crores, and every election sees much more than that spent in reality. We need to start with admitting the actual costs of elections, and ensure that political parties can get the financing required to contest the elections without guaranteeing undue favours to billionaires. Political reform should come along with a clean sweep of bureaucracy at all levels! A country where 99% people aspire to become IAS/IPS only to become rich and powerful through illegal means. I'm surprised that this case is even getting any attention. 2200cr is chump change compared to what Govt babus and politicians of the past did and got caught only to go scot free. It's not about bad financial habits. It is about having an acceptable standard of living. Even if somebody makes 50LPA, what gets left behind after the income taxes? What gets left behind 20 years in future after the humongous inflation eats it away in purchasing power? From 50LPA, GOI takes 20. Consider the PF amount as also lost because there's no guarantee we'll see our pf at the end of our careers. Government can just say take a measly 10k pension and be done with it. Now you are left with 30. While I agree that it's a good amount but consider this - rent in a good 3BHK - 7LPA. Good school for two kids - 6LPA easy. Annual savings - 15LPA. That's 28LPA. Also, try buying an apartment in a good community - 2CR min. Now before you come swinging why the person can't stay in a slum and pay 10k rent, or why his kids can't go to government schools - why is he earning 50LPA then? The situation in India is like this - want a secure future? Live in austerity. Enjoying life? Get ready for a life of difficulty later unless your children bails you out. You might think that you can reduce your expenses but unless your life improves, then that 50LPA is useless. 36 LPA remains(assuming surcharge). Taxes apply to everyone who isn’t a farmer. Inflation is exactly why you need to have good financial habits and save AND invest in appreciating assets. Acceptable standard of living is different from splurging. If you’re trying to live like the super rich at 50LPA, obviously there won’t be anything left. In the US if you report tax evasion you can get a percentage as a reward. If you could just send recordings of officials accepting your bribes and the government had to pay you 10x your bribe, that might make officials reluctant to take bribes from anyone but trusted friends. Bro u are talking nothing short of revolution. We are quite far from that happening, maybe 20-25 yrs away I think this is just a case of a fundamental difference in beliefs. I just assumed the austerity part. Personally I don’t think austerity is that big of a sacrifice for being able to buy your own place and assure a secure retirement. You don’t have to take it as far as Slum + government school, but I’m a firm believer in living below my means. But maybe that’s just me and I’m alone in this belief. Agree about the taxes not doing as much as we’d like. But here’s a possible caveat about the social security you’re advocating for. Many Americans constantly whine about how their social security payments go towards feeding and housing other people. Essentially a ‘pay in and get nothing back’(because they don’t need it unless they fuck up). It sounds similar to what we say about taxes. That WE don’t get benefits commensurate to the taxes WE pay. Entire running of Indian society from top to bottom is now based on corruption. Its the fuel that makes the system work.Successive Govts instead of reducing it have enhanced it in their own ways, It will require a revolution to change the way people think , which is never going to happen. Exact catch. exact truth. power and corruption goes hand in hand in india. there is no doubt in it. Your 80% of babus are at best middle class, and not rich. The ones you see amassing great wealth are the too layers. Yep. Pensions are gone for most government employees except Armed forces, Bureaucrats and politicians Living in the better parts of Bombay costs 18L-20L a year for a family of 4. Much more if the children go to good private schools. One or two vacation(s) a year is another 3L-6L. If somebody is making 50L a year, this is bare minimum the person's family should have in his life. 2L invested each year for children's college. So he saves maximum 6L-8L a year for retirement? Considering today's heathcare inflation and life expectancy, that is abysmal. Not possible to prevent in India. It's more about the thought process of people. Wherever you can't even wait in a queue, trying to gain advantage at every instance, you will resort to bribery, scam, etc. Poor bastards. The same sons of whores who defend Adani now, used to cry about corruption in 2014 Okay we get it. Taxes are bad. Government should function without money. Landowners should rent for lower, teachers and doctors should work for free and how dare vacations cost so much?! But you are entitled to a supermodel wife, 2 kids, a 5bhk flat beside Antilla and your 50LPA salary is beyond reproach. As I replied to the other guy, this is just a fundamental difference in thought process. Dialogue isn’t possible when one person thinks they are entitled to something and another doesn’t. >Taxes are bad. Government should function without money. Landowners should rent for lower, teachers and doctors should work for free and how dare vacations cost so much?! Nobody should work for free and landowners are not wrong. It is the high inflation that is the major culprit here. Again, even vacations cost so high because the inflation in INR erodes its value by a large number every year. I am also saying that the high taxes are bad for people living in India because the net sum of a life in India isn't that good. The high taxes are just another misery that make life worse here. The same person living somewhere else paying the same % of income in taxes would have a far better standard of living. India is wrong to tax these people so high especially when the bigger picture doesn't justify it. If a person is making 50L a year in India, they are most probably capable of moving abroad either via job or education. Everybody who makes that much money realizes this, and many today have the courage to get up and leave. It's no surprise that a huge number are doing just that. >But you are entitled to a supermodel wife, 2 kids, a 5bhk flat beside Antilla and your 50LPA salary is beyond reproach. After all, you’re the only one on the planet who works hard. By default, if somebody makes 50L here, they are exceptionally skilled and in the top 1% of the country. Yes, I work hard and I am entitled to whatever I earn. You know who is not entitled to what I earned? The population in this country who the Government distributes lakhs of crores of taxpayer money to, like it is candy, after stealing it from people like me. Then leave. As long as your 50LPA isn’t earned in India and subject to tax in India. Food prices are a major source of inflation and those aren’t because farmers don’t know how to farm. Climate and Macro factors apply. Farmers across the world always get assistance from the governments. Because food shortages are bad. Even rugged capitalist Trump did it during his first term. And he’s likely to do it again in January. As far as giving money out goes, I agree. It’s election gimmicks taken too far. Mind you I’m not advocating for whatever brand of rugged capitalism you are. In that case whatever tax money is saved on social schemes will have to be pumped to the police to curb what happened the last time someone told starving people to ‘just eat cake if there’s no bread’. My original reply was that someone earning 50LPA can relatively easily get their future on track (by living frugally). This is based on the assumption that there are things you can control and things you can’t. You want to save and get your desired standard of living, it’s unlikely to happen in India. As you said, you are the 1%. The 99% will always outnumber (and outvote) you. So you should leave. Dude do u believe government salary= top class ... No it isn't, no one wants to live minimal . everyone wants to create their cushion as big as they can. >Then leave. As long as your 50LPA isn’t earned in India and subject to tax in India. Anybody who can, is leaving or has already left. >Food prices are a major source of inflation and those aren’t because farmers don’t know how to farm. Climate and Macro factors apply. Farmers don't know how to farm because the incentives in place favor inefficiency. There is no incentive to pay back loans because it will probably get waived off. There is no incentive to conserve power because it's subsidised. >As far as giving money out goes, I agree. It’s election gimmicks taken too far. Mind you I’m not advocating for whatever brand of rugged capitalism you are. In that case whatever tax money is saved on social schemes will have to be pumped to the police to curb what happened the last time someone told starving people to ‘just eat cake if there’s no bread’. No, what needs to happen is taxes lowered, pollution dealt with, and infrastructure be upgraded. Although, yes we need more police to deal with the rampant lawlessness across the country. >My original reply was that someone earning 50LPA can relatively easily get their future on track (by living frugally). This is based on the assumption that there are things you can control and things you can’t. You want to save and get your desired standard of living, it’s unlikely to happen in India. A person earning the PPP equivalent of 50 lakh in some other country would be in a much better condition in some other country. India could be better than it currently is, but it still will never be as good as the other countries. The reasons are simple - just look around you at the bad roads, trash strewn everywhere, excessive traffic. And no, even 50LPA won't be okay to plan a retirement in a major city in India with the real estate prices and inflation we are seeing today. Petrol has been at 100 plus for so much time, and nobody even cares. If a person wanted to just survive, they could do that at 8L /year in some tier-3 town. But a person who makes 50LPA and is in the top 1% shouldn't have to live in a tier-3 town. If even 50LPA isn’t enough for you, I don’t know what to say that I haven’t already said. Earn more. But even if you earn 200LPA, then you’ll want a lifestyle that you think is commensurate to that income. “Why is Dhirubhai Ambani International so expensive?” “Why does my penthouse rent keep increasing every year?” Eh no. Major expenses like house, food utilities stay the same. So do the vacation and children's education."
}