{
    "id": "18oxz4a",
    "title": "If Election Commissioners are appointed according to the recent bill passed by the Parliament, free and fair elections will become a chimera : Justice RF Nariman.",
    "url": "https://v.redd.it/z67q69oa6z7c1",
    "selftext": "Source: https://twitter.com/LiveLawIndia/status/1738094518166229080?t=kdsu2q0-xp41h-_ee6uqfw&s=19",
    "flair": "Law & Courts",
    "score": 231,
    "num_comments": 30,
    "created_utc": 1703307032.0,
    "convurl": "https://external-preview.redd.it/cjBkcmV5ZGE2ejdjMTZf4m6tjNSzgFhV9llgmCdGQtqQ-RRMtKiHGFS8fMGy.png?format=pjpg&auto=webp&s=c1b390c35b664d2e955bb6456770eeb0395ac3c7",
    "comments": [
        "umm, a source link to youtube or news site?",
        "https://twitter.com/LiveLawIndia/status/1738094518166229080?t=kdsu2q0-xp41h-_ee6uqfw&s=19\n\nMentioned in the post itself",
        "Like the Chimera that is free and fair SC judge appointments ??\n\nRich coming from a judge himself",
        "I am  packing my bags to move to other countries",
        "EC has always been appointed by the party in power since independence, SC changed that law only this year. This Bill has just nullified that judgment. So he is saying that the Election has always been a \"chimera\" in this country? From Nehru till now?\n\nBecause I think that's what he meant. Everyone needs reform except the judiciary.",
        "and you think we were/are having fair elections and EC was impartial for last 5 to 7 years .\n there was wonderful report done by a Indian on 2019 elections , you cannot find a trace of it online now and i think the persons  who did study are under various cases .\nIndia stopped being a democracy in 2016.",
        "Haha well said",
        "They are already overpopulated by Indian migrants...",
        "There are many precedents that hold well until there comes someone who is willing to exploit them. Even when EC was appointed by the ruling party, we had CEC like TN Seshan and JM Lyngdoh. \n\nWhile this Government has begun to openly subvert all the institutions. Ashok Lavasa and his family were punished for refusing to give clean chit to Modi for the violation of Model Code of Conduct. Sunil Arora was rewarded with a post-retirement job. Now, EC has become a tool of the Government. They will book Rahul Gandhi for using the term Panauti, while refusing to book BJP leaders for hate speech and communalism.",
        "I just wanna ask a question please don't downvote me just asking out of curiosity\n\nIf Judiciary, Legislature and Executive are suppose to be separate to keep check and balance, wouldn't adding SC Judge to appoint EC violate the separation of power principal?",
        "Why doesn't this guy become the prime minister",
        ">JM Lyngdoh.\n\nThere's one common thing between TN Seshan and JM Lyngdoh, that they were CEC during the weak govt. Institutions are only stronger when the central govt are weak. See all the landmark judgment of the SC, they all were delivered during the period of a weak govt, and when govt was strong, the SC never dared to go against the govt like during the emergency(a period of a strong govt), even SC closed its door for common people. During 2nd term of UPA(a weak govt), SC, CAG, and EC all went against the govt.\n\nYou can draw an analogy here, weak govt= strong institution, strong govt= weak institution. That's how things are done in India and the world. Wake Up!",
        "So, I believe you agree that this government needs to be ousted like Indira Gandhi.",
        "But then they will come back like Indira Gandhi. So, what's the point?",
        "The point would be to preserve the democracy by not allowing them to accumulate more power. Otherwise, the democratic institutions and the democracy itself would be lost.",
        "I just said that he would come back like Indira, the ouster of Indira from power lasted less than 2 years despite the emergency he imposed. We Indians worship the man, be it actors(SRK, Rajnikant, etc), sportsmen, or Politicians. Even after 10 years of ruling, his opinion poll still lands at 78%, do you think that anybody can remove him from power right now? If you are thinking so then you have been smoking something.",
        "Why don’t you open up collegium cabal then? I mean in lok sabha still there is representatives. If anyone is interested just look up how many sc/st supreme court judges we have.",
        "This is a bit misunderstood concept in India actually, we just hear our social sciences teacher in school say that these are three separate organs however if you look at the constitution, this couldn’t be further from the truth, all three creatures of the constitution are, to put it aptly, interdependently independent, hence the idea that a judge can be removed by the parliament, the president having a pocket veto, the constitutional courts having the ability to review laws and so forth. And the idea that the CJI should be on the panel which decides who is to he appointed as a EC or CEC, stems from the idea that democracy is part of the basic structure of our country, and since a partisan appointment would violate free and fair elections, there needs to be a non political person in that decision making process, at least that is my interpretation of as things stand.",
        "A Law which is already doomed and will soon be held unconstitutional as soon as it gets enacted.",
        ">there needs to be a non political person in that decision making process, at least that is my interpretation of as things stand.\n\nThere is a problem here, which is that there's no constitutional basis for this position. The constitution doesn't say that the CJI is \"non-partisan\" as against the PM or the Leader of Opposition. And the authority to decide questions of appointment is delegated by the constitution to Parliament, not the courts. The court overstepped its legal mandate by deciding who would sit on such a panel. \n\nThey were using a loophole to do this, claiming that they had authority because Parliament hadn't formally created a law. Its specious, but it is what the court did. Parliament has now closed that loophole.",
        "I disagree a bit here, this view is a bit myopic and rather a common mistake people make while interpreting the constitution, but you may chalk it up to my realism, in all senses, as the interpreter of laws, that is, the arbiter of laws, law is what the Court says it is, because at the end decision lies with the court as to how it interprets the law, after the legislature has legislated, its functus officio, same with the constituent assembly, its functus officio hence the sole authority to interpret the constitution and what it really means lies with the constitutional court and not with the parliament however much people like to say it does, welcome to common law systems where precedents matter!\n\nNow it becomes important to understand the hierarchy of laws, it’s always constitution above statutes, statutes above rules and guidelines and so forth, now interestingly there’s also a hierarchy within the constitution which people don’t really have a grasp of, people think all in the constitution is same which couldn’t be farther from the truth, good rule of thumb, basic structure trumps all, it is THE Grund Norm and there’s no escaping it vide the famous and infamous Keshvananda judgement, so yes, the court could site the above stated reason AND put the CJI there to preserve the basic structure, welcome to institutional shenanigans through jurisprudence",
        "I have two critiques to offer here. You are correct that the Court is vested with interpretation of law. This applies to both the constitution and lesser statutory law that parliament and the state legislatures pass. What the court is not entitled to do however is to *create* law. Nor does it have the authority to compel its coequal branches to do so if they have exercised their discretion and chosen not to. Anymore than Parliament or the President can *order* the court to hear a specific case.\n\nIn this instance the Constitution had authorized Parliament to create a law on how the EC would be selected. It was within Parliament's prerogative to not create a specific law if they had so wanted. As they had infact done so for several decades since independence. Parliament choosing to not act does not give the Supreme Court the authority to decide it can. And the constitution does not empower the Supreme Court to make law. In creating their panel for the EC's selection, the court invented a law. It did not interpret the constitution, it made up something new. This was outside its mandate.\n\nThe analogue here is if the Supreme Court refused to hear a case or petition, say for instance someone demanding that a mosque be seized and given over to a temple board. And upon dismissing the case, the President were to summon the parties and declare she would hear the case. Or for Parliament to do so. Both of these would be egregious violations of the constitutional order.\n\nThe other issue here is the basic structure claim. That too is somewhat tautological. There is no constitutional basis for the basic structure doctrine. The SC invented that out of whole cloth in the Kesvanada Bharti case. The constitution is very clear that it is a living document, and that Parliament has the authority to amend it as needed. The court has no authority to invent some unmentioned higher constitutional standard by which to hold amendments to. That they do it anyway is a classic example of judicial overreach and the court trampling over the constitution. It is no different than when the cops arrest you without charge, or when the government makes a mockery of parliamentary procedure by suspending opposition MPs and then ramming through laws via voice vote.\n\nThe court uses the basic structure doctrine like a magic wand. It dreams up whatever quality it wants, claims it is part of the basic structure of the constitution and implements it. The constitution does not empower the court to appoint itself. The court goes ahead and does that anyway, and in the process has become an organization with a level of nepotism that puts even Parliament to shame. I mean the person OP has linked is a classic example of this. Rohinton Nariman is after all the famous Fali Narmian's son.\n\nIt did so here as well. Apropos nothing at all someone moved a petition demanding that the ECI's selection procedure be changed. The court, apropos nothing, proceeded to cite vague constitutional principles and its basic structure and gave itself the authority to legislate a new procedure of appointment.\n\nParliament had to step in and fix the court's egregious overstep here. But it doesn't change the fact that the court did overstep to begin with.",
        "I think your critiques are not based on actual foundations of Indian legal system and much more on what a layman’s utopian idea of the should bes.\n\nThe Judgement given by a higher court ARE laws, hence I said welcome to common law system, the doctrines of Precedent, stare decisis are not some made up ideas cooked up in a fever dream of some legal scholar, these are very much in use and have been used for centuries in many countries across the world, and so as in India, and this “overreach” you talk about, re art. 142 and debate with me on this honestly, reading news paper clippings on decisions panning decades does not do justice to the decision, the court does make laws, can make laws but it does in the form of guidelines, re Vishakha judgement and it is completely constitutional re: realist school of jurisprudence.\n\nAnd free and fair elections are important to the spirit of democracy? Are they not? Does it not form part of the basic structure of the constitution? Is democracy as well as the republic not an essential an essential part of the constitution? And does it not become prevalent to now, more than ever, to preserve the democratic nature of this country in the face of elected authoritarianism? Think about this new law, it replaces the CJI with a government minister, essentially giving a veto to the government, what minister is to disagree with his supreme leader! Lmao, be that as it may, it is not an interpretation of statute class or a legal methods class, people are actually getting paid well to teach it and I shall not do it for free here, as to what seems to be a very tedious parlance for me",
        ">I think your critiques are not based on actual foundations of Indian legal system and much more on what a layman’s utopian idea of the “should bes.”\n\nNo. They are based on how the constitutional system works in a common law system. Which is what this is.\n\n>The Judgement given by a higher court ARE laws, hence I said welcome to common law system, the doctrines of Precedent, stare decisis are not some made up ideas cooked up in a fever dream of some legal scholar, these are very much in use and have been used for centuries in many countries across the world, and so as in India, and this “overreach” you talk about, re art. 142 and debate with me on this honestly, reading news paper clippings on decisions panning decades does not do justice to the decision, the court does make laws, can make laws but it does in the form of guidelines, re Vishakha judgement and it is completely constitutional re: realist school of jurisprudence.\n\nFirst off all, periods mate. That was a ridiculous run on sentence.\n\nSecond I don't think you understand how stare decisis even works. Yes it is binding. Yes the orders of a higher court, especially an apex court, are also law. Stare Decisis means that a lower court is bound to follow existing precedent. And superior courts are expected to respect their own precedents. That does not mean they get to make things up out of whole cloth however. Article 142 is not a mandate to the Supreme Court to trample over the constitutional prerogatives of the other organs of the government, any more than the ability to pass legislation authorizes Parliament to trample the judicial authority of the Court.\n\nA \"realist\" school of jurisprudence cannot be a license to ignore the explicit and written text of the constitution. But that is exactly what the Supreme Court does. What verdicts such as the Kesvanada Bharti judgment, the Second Judges Case judgment, the NEET judgment have done.\n\nParliament makes laws. The Court does not. This is constitutional law 101 as far as the Indian Constitution is concerned. That the court ignores it isn't \"realism.\" Its constitutional overreach.\n\n>And free and fair elections are important to the spirit of democracy? Are they not? \n\nCertainly they are. What is the basis for your claim that until 2023 no election in India was free and fair? What authorized the court to ignore the precedent of a system that was working (so much for Stare Decisis and realism in jurisprudence I might add) and invent a new system altogether? What was the precipitating factor that required the court to step in and alter a constitutional framework without any legal authorization?\n\n>Does it not form part of the basic structure of the constitution? \n\nNo it does not actually. There is no such thing as the basic structure of the constitution. Elections are mandated by the *text* of the constitution. Parliament would be free to amend that text if it wanted. The purpose of the court is to interpret what the constitution requires. Not to decide for itself what is morally just. An individual election can be challenged. It is part of the court's mandate to ensure that violations of the rule of law are punished.\n\nBut the constitution explicitly empowers Parliament and the Executive to decide how the ECI is selected. The court flagrantly *ignored* the black letter text of the constitution to impose its will. There is no jurisprudential argument under constitutional law that justifies that. It was unconstitutional.\n\n>Is democracy as well as the republic not an essential an essential part of the constitution? \n\nWas India not a republic and a democracy prior to 2023 when the ECI was selected by the government? Has it overnight stopped being a democracy and a republic because Parliament has seen fit to essentially revert to that system?\n\n>And does it not become prevalent to now, more than ever, to preserve the democratic nature of this country in the face of elected authoritarianism?\n\nIndia has had emergency declared twice before. Both during it and in the decades after, nobody believed it necessary to challenge the way the Election Commission functioned.\n\nThe Election Commission is a constitutional body. Do you believe it is legitimate for the President or Parliament to interfere with how the court hears cases? I assume not. The same principle binds the Supreme Court too. They don't get to interfere with how other constitutional bodies function.\n\n>Think about this new law, it replaces the CJI with a government minister, essentially giving a veto to the government, what minister is to disagree with his supreme leader! \n\nfrom 1949 to 2023 the government appointed the Election Commissioner. This was how Parliament willed it by choosing to not interfere with the process of selection. Is it your contention that under this scheme our elections have never been valid?\n\nThe constitution requires that Parliament regulate how the ECI is selected. The constitution does not say that Parliament must choose a process that is acceptable to the Supreme Court. If parliament wanted they could order that the ECI be chosen by lottery or on the basis of bird flight. That is Parliament's constitutional prerogative. If we don't follow the constitution, then we are a lawless society. A society where authority and might makes right. Do you really want Parliament and the Prime Minister to start ignoring the constitution as the Supreme Court does?\n\n>Lmao, be that as it may, it is not an interpretation of statute class or a legal methods class, people are actually getting paid well to teach it and I shall not do it for free here, as to what seems to be a very tedious parlance for me\n\nYeah. I get paid very well to study law and legal systems. I know what I'm talking about. You aren't obligated to teach me anything at all.",
        "Apparently I am? It would appear so because have it your way and we would have to replace the constitution with the Leviathan! It is binding upon lower courts you say, and the courts are supposed to honour their own precedents, def you are not wrong, but to agree with you would be to agree that courts exist in a vacuum and that they do not have any role in the administration of justice itself! I still stand by my statement, law is what the court says it the law is, and it so happens that neither are you getting paid to teach me constitutional, rather use this time to brush up on it, because someone who conveniently ignores decades of precedents and judicial reasoning on these matters should brush up on his stuff, and might I suggest you refer to MP Jain this time around? I never said anything about pre 2023 or post 2023 with respect to ECs independence, what I should say is that throughout the ages it has always been a risk however the governments have been weak and opposition strong for an elected autocracy (or theocracy, you never know these days) to occur, it is to me a constitutional oversight in many ways and it should be that the EC remains independent or we are in for disastrous consequences, what I mean to say is, excluding quips, you cannot just ignore the decades of precedents and declare all of them overreach, to discuss the merits of minerva mills or keshvananda are beyond the scope of this parlance, you know that IF you know your constitution, that is, Indian constitution, the demarcations as to functions of organs have never been clear ever, anywhere, there always has been an overlap and there always will be one fortunately or unfortunately.\n\nOne more thing which I must say, you say that it is the job of the legislature to legislate, I agree, however, it is the job of the court to interpret this very legislation, I hardly think you would disagree with this. Now, moving on, constitution is also a work of a now extinct legislature, however it is not a common legislation in any sense, it creates three creatures, the Judiciary, the Executive, and the Legislature with an interdependently dependent system but it DOES give the constitutional courts the power to actually interpret the constitution and the power of judicial review, having said that, as the sole interpreter of constitution, the court may settle a substantial question of law, through the virtue of it being the sole arbitrator of law in this country, it has a binding effect due to the principles we discussed above, so as the constitution evolves THROUGH judicial experience, the Courts have, rightfully so in my opinion, solidified Part III along with certain other provisions as the basic structure as THE Grund Norm, and everything, and I do mean everything, must be compared against it to decide its constitutionality or be amended in such a fashion. On the lack of legislation, where there is a right, there is a remedy, people do have a right to have free and fair elections, to me it is the essence and spirit of democracy, that is to say, the nation’s democratic spirit would be be essentially murdered otherwise, hence to preserve it, I don’t believe it is far fetched for the court to do what it did and then the legislature came with a legislation which the provision asked for it to do, fair enough, now you will actually see the real life implications of this, as these hindutva hooligans rampage the country if the court does not interfere. Also also, this also gave us Vishakha, again, tracing its legitimacy from Part III, the court recognised a right under Part III and, since there was a right there would have to be a remedy and thus you have vishakha guidelines, and this is the exact reason why Supriyo failed because the court did not recognise a right to begin with for it to provide a remedy.\n\nBut as things stand we just have fundamentally different ways of looking at law, might I suggest getting a job at the SGs office? He would love you there! And idc if my grammar is satisfactory to you or not, I don’t respect this language 🤡",
        "I have no interest in working for the solicitor general thank. I'm perfectly happy with my job of training future legal thinkers how to respect judicial and constitutional norms. If only our Supreme Court justices had received a similar grounding in basic constitutional norms. Or you.\n\nAs to the rest. I'm not going to further respond to that incoherent mess. As a general piece of advice however. You make the same mistake many Indian judges and lawyers do, which is to assume basic comprehensibility is irrelevant. Writing a dense, incomprehensible morass of text without even adequate paragraphing betrays poor reasoning and rhetorical skills. It is why India is plagued with barely literate judgements authored by judges who perhaps would be better spent learning how to write instead of dreaming up new ways to illegally expand the court's authority.",
        "Jesus, what university is that at?",
        "How can SC put a SC judge in the panel. Do we expect the SC to give verdict against themselves if any dispute arises in the future?\nIndependence of judiciary also means that judiciary should stay at arms length from such appointments. So the law only seems reasonable.\n\nJudiciary is the only branch which lives like British aristocrats still in 2023.\nAny move to fix that and we see special benches in no time to maintain status quo.\n\nJudiciary needs to look within and reform itself first before getting into political space and ruin the spirit of democracy.\n\nLaws are made by the party in power.\nLaws can be repealed later also by the party then in power. But these activist judges need to do their job well first and foremost.",
        "Tumhe informational video daalna hai to 1.5x ya 2x par daalo. Logo ko local pakadni hoti hai."
    ],
    "cleaned_text": "election commissioners appointed according recent bill passed parliament free fair elections become chimera justice rf nariman source ",
    "cleaned_title": "election commissioners appointed according recent bill passed parliament free fair elections become chimera justice rf nariman",
    "cleaned_selftext": "source",
    "cleaned_comments": "umm source link youtube news site mentioned post like chimera free fair sc judge appointments rich coming judge packing bags move countries ec always appointed party power since independence sc changed law year bill nullified judgment saying election always chimera country nehru till think thats meant everyone needs reform except judiciary think wereare fair elections ec impartial last years wonderful report done indian elections find trace online think persons study various cases india stopped democracy haha well said already overpopulated indian migrants many precedents hold well comes someone willing exploit even ec appointed ruling party cec like tn seshan jm lyngdoh government begun openly subvert institutions ashok lavasa family punished refusing give clean chit modi violation model code conduct sunil arora rewarded postretirement job ec become tool government book rahul gandhi using term panauti refusing book bjp leaders hate speech communalism wan na ask question please dont downvote asking curiosity judiciary legislature executive suppose separate keep check balance wouldnt adding sc judge appoint ec violate separation power principal doesnt guy become prime minister jm lyngdoh theres one common thing tn seshan jm lyngdoh cec weak govt institutions stronger central govt weak see landmark judgment sc delivered period weak govt govt strong sc never dared go govt like emergencya period strong govt even sc closed door common people nd term upaa weak govt sc cag ec went govt draw analogy weak govt strong institution strong govt weak institution thats things done india world wake believe agree government needs ousted like indira gandhi come back like indira gandhi whats point point would preserve democracy allowing accumulate power otherwise democratic institutions democracy would lost said would come back like indira ouster indira power lasted less years despite emergency imposed indians worship man actorssrk rajnikant etc sportsmen politicians even years ruling opinion poll still lands think anybody remove power right thinking smoking something dont open collegium cabal mean lok sabha still representatives anyone interested look many scst supreme court judges bit misunderstood concept india actually hear social sciences teacher school say three separate organs however look constitution couldnt truth three creatures constitution put aptly interdependently independent hence idea judge removed parliament president pocket veto constitutional courts ability review laws forth idea cji panel decides appointed ec cec stems idea democracy part basic structure country since partisan appointment would violate free fair elections needs non political person decision making process least interpretation things stand law already doomed soon held unconstitutional soon gets enacted needs non political person decision making process least interpretation things stand problem theres constitutional basis position constitution doesnt say cji nonpartisan pm leader opposition authority decide questions appointment delegated constitution parliament courts court overstepped legal mandate deciding would sit panel using loophole claiming authority parliament hadnt formally created law specious court parliament closed loophole disagree bit view bit myopic rather common mistake people make interpreting constitution may chalk realism senses interpreter laws arbiter laws law court says end decision lies court interprets law legislature legislated functus officio constituent assembly functus officio hence sole authority interpret constitution really means lies constitutional court parliament however much people like say welcome common law systems precedents matter becomes important understand hierarchy laws always constitution statutes statutes rules guidelines forth interestingly theres also hierarchy within constitution people dont really grasp people think constitution couldnt farther truth good rule thumb basic structure trumps grund norm theres escaping vide famous infamous keshvananda judgement yes court could site stated reason put cji preserve basic structure welcome institutional shenanigans jurisprudence two critiques offer correct court vested interpretation law applies constitution lesser statutory law parliament state legislatures pass court entitled however create law authority compel coequal branches exercised discretion chosen anymore parliament president order court hear specific case instance constitution authorized parliament create law ec would selected within parliaments prerogative create specific law wanted infact done several decades since independence parliament choosing act give supreme court authority decide constitution empower supreme court make law creating panel ecs selection court invented law interpret constitution made something new outside mandate analogue supreme court refused hear case petition say instance someone demanding mosque seized given temple board upon dismissing case president summon parties declare would hear case parliament would egregious violations constitutional order issue basic structure claim somewhat tautological constitutional basis basic structure doctrine sc invented whole cloth kesvanada bharti case constitution clear living document parliament authority amend needed court authority invent unmentioned higher constitutional standard hold amendments anyway classic example judicial overreach court trampling constitution different cops arrest without charge government makes mockery parliamentary procedure suspending opposition mps ramming laws via voice vote court uses basic structure doctrine like magic wand dreams whatever quality wants claims part basic structure constitution implements constitution empower court appoint court goes ahead anyway process become organization level nepotism puts even parliament shame mean person op linked classic example rohinton nariman famous fali narmians son well apropos nothing someone moved petition demanding ecis selection procedure changed court apropos nothing proceeded cite vague constitutional principles basic structure gave authority legislate new procedure appointment parliament step fix courts egregious overstep doesnt change fact court overstep begin think critiques based actual foundations indian legal system much laymans utopian idea bes judgement given higher court laws hence said welcome common law system doctrines precedent stare decisis made ideas cooked fever dream legal scholar much use used centuries many countries across world india overreach talk art debate honestly reading news paper clippings decisions panning decades justice decision court make laws make laws form guidelines vishakha judgement completely constitutional realist school jurisprudence free fair elections important spirit democracy form part basic structure constitution democracy well republic essential essential part constitution become prevalent ever preserve democratic nature country face elected authoritarianism think new law replaces cji government minister essentially giving veto government minister disagree supreme leader lmao may interpretation statute class legal methods class people actually getting paid well teach shall free seems tedious parlance think critiques based actual foundations indian legal system much laymans utopian idea bes based constitutional system works common law system judgement given higher court laws hence said welcome common law system doctrines precedent stare decisis made ideas cooked fever dream legal scholar much use used centuries many countries across world india overreach talk art debate honestly reading news paper clippings decisions panning decades justice decision court make laws make laws form guidelines vishakha judgement completely constitutional realist school jurisprudence first periods mate ridiculous run sentence second dont think understand stare decisis even works yes binding yes orders higher court especially apex court also law stare decisis means lower court bound follow existing precedent superior courts expected respect precedents mean get make things whole cloth however article mandate supreme court trample constitutional prerogatives organs government ability pass legislation authorizes parliament trample judicial authority court realist school jurisprudence license ignore explicit written text constitution exactly supreme court verdicts kesvanada bharti judgment second judges case judgment neet judgment done parliament makes laws court constitutional law far indian constitution concerned court ignores isnt realism constitutional overreach free fair elections important spirit democracy certainly basis claim election india free fair authorized court ignore precedent system working much stare decisis realism jurisprudence might add invent new system altogether precipitating factor required court step alter constitutional framework without legal authorization form part basic structure constitution actually thing basic structure constitution elections mandated text constitution parliament would free amend text wanted purpose court interpret constitution requires decide morally individual election challenged part courts mandate ensure violations rule law punished constitution explicitly empowers parliament executive decide eci selected court flagrantly ignored black letter text constitution impose jurisprudential argument constitutional law justifies unconstitutional democracy well republic essential essential part constitution india republic democracy prior eci selected government overnight stopped democracy republic parliament seen fit essentially revert system become prevalent ever preserve democratic nature country face elected authoritarianism india emergency declared twice decades nobody believed necessary challenge way election commission functioned election commission constitutional body believe legitimate president parliament interfere court hears cases assume principle binds supreme court dont get interfere constitutional bodies function think new law replaces cji government minister essentially giving veto government minister disagree supreme leader government appointed election commissioner parliament willed choosing interfere process selection contention scheme elections never valid constitution requires parliament regulate eci selected constitution say parliament must choose process acceptable supreme court parliament wanted could order eci chosen lottery basis bird flight parliaments constitutional prerogative dont follow constitution lawless society society authority might makes right really want parliament prime minister start ignoring constitution supreme court lmao may interpretation statute class legal methods class people actually getting paid well teach shall free seems tedious parlance yeah get paid well study law legal systems know im talking arent obligated teach anything apparently would appear way would replace constitution leviathan binding upon lower courts say courts supposed honour precedents def wrong agree would agree courts exist vacuum role administration justice still stand statement law court says law happens neither getting paid teach constitutional rather use time brush someone conveniently ignores decades precedents judicial reasoning matters brush stuff might suggest refer mp jain time around never said anything pre post respect ecs independence say throughout ages always risk however governments weak opposition strong elected autocracy theocracy never know days occur constitutional oversight many ways ec remains independent disastrous consequences mean say excluding quips ignore decades precedents declare overreach discuss merits minerva mills keshvananda beyond scope parlance know know constitution indian constitution demarcations functions organs never clear ever anywhere always overlap always one fortunately unfortunately one thing must say say job legislature legislate agree however job court interpret legislation hardly think would disagree moving constitution also work extinct legislature however common legislation sense creates three creatures judiciary executive legislature interdependently dependent system give constitutional courts power actually interpret constitution power judicial review said sole interpreter constitution court may settle substantial question law virtue sole arbitrator law country binding effect due principles discussed constitution evolves judicial experience courts rightfully opinion solidified part iii along certain provisions basic structure grund norm everything mean everything must compared decide constitutionality amended fashion lack legislation right remedy people right free fair elections essence spirit democracy say nations democratic spirit would essentially murdered otherwise hence preserve dont believe far fetched court legislature came legislation provision asked fair enough actually see real life implications hindutva hooligans rampage country court interfere also also also gave us vishakha tracing legitimacy part iii court recognised right part iii since right would remedy thus vishakha guidelines exact reason supriyo failed court recognise right begin provide remedy things stand fundamentally different ways looking law might suggest getting job sgs office would love idc grammar satisfactory dont respect language interest working solicitor general thank im perfectly happy job training future legal thinkers respect judicial constitutional norms supreme court justices received similar grounding basic constitutional norms rest im going respond incoherent mess general piece advice however make mistake many indian judges lawyers assume basic comprehensibility irrelevant writing dense incomprehensible morass text without even adequate paragraphing betrays poor reasoning rhetorical skills india plagued barely literate judgements authored judges perhaps would better spent learning write instead dreaming new ways illegally expand courts authority jesus university sc put sc judge panel expect sc give verdict dispute arises future independence judiciary also means judiciary stay arms length appointments law seems reasonable judiciary branch lives like british aristocrats still move fix see special benches time maintain status quo judiciary needs look within reform first getting political space ruin spirit democracy laws made party power laws repealed later also party power activist judges need job well first foremost tumhe informational video daalna hai x ya x par daalo logo ko local pakadni hoti hai",
    "light_cleaned_title": "If Election Commissioners are appointed according to the recent bill passed by the Parliament, free and fair elections will become a chimera : Justice RF Nariman.",
    "light_cleaned_selftext": "Source:",
    "light_cleaned_comments": "umm, a source link to youtube or news site? Mentioned in the post itself Like the Chimera that is free and fair SC judge appointments ?? Rich coming from a judge himself I am packing my bags to move to other countries EC has always been appointed by the party in power since independence, SC changed that law only this year. This Bill has just nullified that judgment. So he is saying that the Election has always been a \"chimera\" in this country? From Nehru till now? Because I think that's what he meant. Everyone needs reform except the judiciary. and you think we were/are having fair elections and EC was impartial for last 5 to 7 years . there was wonderful report done by a Indian on 2019 elections , you cannot find a trace of it online now and i think the persons who did study are under various cases . India stopped being a democracy in 2016. Haha well said They are already overpopulated by Indian migrants... There are many precedents that hold well until there comes someone who is willing to exploit them. Even when EC was appointed by the ruling party, we had CEC like TN Seshan and JM Lyngdoh. While this Government has begun to openly subvert all the institutions. Ashok Lavasa and his family were punished for refusing to give clean chit to Modi for the violation of Model Code of Conduct. Sunil Arora was rewarded with a post-retirement job. Now, EC has become a tool of the Government. They will book Rahul Gandhi for using the term Panauti, while refusing to book BJP leaders for hate speech and communalism. I just wanna ask a question please don't downvote me just asking out of curiosity If Judiciary, Legislature and Executive are suppose to be separate to keep check and balance, wouldn't adding SC Judge to appoint EC violate the separation of power principal? Why doesn't this guy become the prime minister >JM Lyngdoh. There's one common thing between TN Seshan and JM Lyngdoh, that they were CEC during the weak govt. Institutions are only stronger when the central govt are weak. See all the landmark judgment of the SC, they all were delivered during the period of a weak govt, and when govt was strong, the SC never dared to go against the govt like during the emergency(a period of a strong govt), even SC closed its door for common people. During 2nd term of UPA(a weak govt), SC, CAG, and EC all went against the govt. You can draw an analogy here, weak govt= strong institution, strong govt= weak institution. That's how things are done in India and the world. Wake Up! So, I believe you agree that this government needs to be ousted like Indira Gandhi. But then they will come back like Indira Gandhi. So, what's the point? The point would be to preserve the democracy by not allowing them to accumulate more power. Otherwise, the democratic institutions and the democracy itself would be lost. I just said that he would come back like Indira, the ouster of Indira from power lasted less than 2 years despite the emergency he imposed. We Indians worship the man, be it actors(SRK, Rajnikant, etc), sportsmen, or Politicians. Even after 10 years of ruling, his opinion poll still lands at 78%, do you think that anybody can remove him from power right now? If you are thinking so then you have been smoking something. Why don’t you open up collegium cabal then? I mean in lok sabha still there is representatives. If anyone is interested just look up how many sc/st supreme court judges we have. This is a bit misunderstood concept in India actually, we just hear our social sciences teacher in school say that these are three separate organs however if you look at the constitution, this couldn’t be further from the truth, all three creatures of the constitution are, to put it aptly, interdependently independent, hence the idea that a judge can be removed by the parliament, the president having a pocket veto, the constitutional courts having the ability to review laws and so forth. And the idea that the CJI should be on the panel which decides who is to he appointed as a EC or CEC, stems from the idea that democracy is part of the basic structure of our country, and since a partisan appointment would violate free and fair elections, there needs to be a non political person in that decision making process, at least that is my interpretation of as things stand. A Law which is already doomed and will soon be held unconstitutional as soon as it gets enacted. >there needs to be a non political person in that decision making process, at least that is my interpretation of as things stand. There is a problem here, which is that there's no constitutional basis for this position. The constitution doesn't say that the CJI is \"non-partisan\" as against the PM or the Leader of Opposition. And the authority to decide questions of appointment is delegated by the constitution to Parliament, not the courts. The court overstepped its legal mandate by deciding who would sit on such a panel. They were using a loophole to do this, claiming that they had authority because Parliament hadn't formally created a law. Its specious, but it is what the court did. Parliament has now closed that loophole. I disagree a bit here, this view is a bit myopic and rather a common mistake people make while interpreting the constitution, but you may chalk it up to my realism, in all senses, as the interpreter of laws, that is, the arbiter of laws, law is what the Court says it is, because at the end decision lies with the court as to how it interprets the law, after the legislature has legislated, its functus officio, same with the constituent assembly, its functus officio hence the sole authority to interpret the constitution and what it really means lies with the constitutional court and not with the parliament however much people like to say it does, welcome to common law systems where precedents matter! Now it becomes important to understand the hierarchy of laws, it’s always constitution above statutes, statutes above rules and guidelines and so forth, now interestingly there’s also a hierarchy within the constitution which people don’t really have a grasp of, people think all in the constitution is same which couldn’t be farther from the truth, good rule of thumb, basic structure trumps all, it is THE Grund Norm and there’s no escaping it vide the famous and infamous Keshvananda judgement, so yes, the court could site the above stated reason AND put the CJI there to preserve the basic structure, welcome to institutional shenanigans through jurisprudence I have two critiques to offer here. You are correct that the Court is vested with interpretation of law. This applies to both the constitution and lesser statutory law that parliament and the state legislatures pass. What the court is not entitled to do however is to *create* law. Nor does it have the authority to compel its coequal branches to do so if they have exercised their discretion and chosen not to. Anymore than Parliament or the President can *order* the court to hear a specific case. In this instance the Constitution had authorized Parliament to create a law on how the EC would be selected. It was within Parliament's prerogative to not create a specific law if they had so wanted. As they had infact done so for several decades since independence. Parliament choosing to not act does not give the Supreme Court the authority to decide it can. And the constitution does not empower the Supreme Court to make law. In creating their panel for the EC's selection, the court invented a law. It did not interpret the constitution, it made up something new. This was outside its mandate. The analogue here is if the Supreme Court refused to hear a case or petition, say for instance someone demanding that a mosque be seized and given over to a temple board. And upon dismissing the case, the President were to summon the parties and declare she would hear the case. Or for Parliament to do so. Both of these would be egregious violations of the constitutional order. The other issue here is the basic structure claim. That too is somewhat tautological. There is no constitutional basis for the basic structure doctrine. The SC invented that out of whole cloth in the Kesvanada Bharti case. The constitution is very clear that it is a living document, and that Parliament has the authority to amend it as needed. The court has no authority to invent some unmentioned higher constitutional standard by which to hold amendments to. That they do it anyway is a classic example of judicial overreach and the court trampling over the constitution. It is no different than when the cops arrest you without charge, or when the government makes a mockery of parliamentary procedure by suspending opposition MPs and then ramming through laws via voice vote. The court uses the basic structure doctrine like a magic wand. It dreams up whatever quality it wants, claims it is part of the basic structure of the constitution and implements it. The constitution does not empower the court to appoint itself. The court goes ahead and does that anyway, and in the process has become an organization with a level of nepotism that puts even Parliament to shame. I mean the person OP has linked is a classic example of this. Rohinton Nariman is after all the famous Fali Narmian's son. It did so here as well. Apropos nothing at all someone moved a petition demanding that the ECI's selection procedure be changed. The court, apropos nothing, proceeded to cite vague constitutional principles and its basic structure and gave itself the authority to legislate a new procedure of appointment. Parliament had to step in and fix the court's egregious overstep here. But it doesn't change the fact that the court did overstep to begin with. I think your critiques are not based on actual foundations of Indian legal system and much more on what a layman’s utopian idea of the should bes. The Judgement given by a higher court ARE laws, hence I said welcome to common law system, the doctrines of Precedent, stare decisis are not some made up ideas cooked up in a fever dream of some legal scholar, these are very much in use and have been used for centuries in many countries across the world, and so as in India, and this “overreach” you talk about, re art. 142 and debate with me on this honestly, reading news paper clippings on decisions panning decades does not do justice to the decision, the court does make laws, can make laws but it does in the form of guidelines, re Vishakha judgement and it is completely constitutional re: realist school of jurisprudence. And free and fair elections are important to the spirit of democracy? Are they not? Does it not form part of the basic structure of the constitution? Is democracy as well as the republic not an essential an essential part of the constitution? And does it not become prevalent to now, more than ever, to preserve the democratic nature of this country in the face of elected authoritarianism? Think about this new law, it replaces the CJI with a government minister, essentially giving a veto to the government, what minister is to disagree with his supreme leader! Lmao, be that as it may, it is not an interpretation of statute class or a legal methods class, people are actually getting paid well to teach it and I shall not do it for free here, as to what seems to be a very tedious parlance for me >I think your critiques are not based on actual foundations of Indian legal system and much more on what a layman’s utopian idea of the “should bes.” No. They are based on how the constitutional system works in a common law system. Which is what this is. >The Judgement given by a higher court ARE laws, hence I said welcome to common law system, the doctrines of Precedent, stare decisis are not some made up ideas cooked up in a fever dream of some legal scholar, these are very much in use and have been used for centuries in many countries across the world, and so as in India, and this “overreach” you talk about, re art. 142 and debate with me on this honestly, reading news paper clippings on decisions panning decades does not do justice to the decision, the court does make laws, can make laws but it does in the form of guidelines, re Vishakha judgement and it is completely constitutional re: realist school of jurisprudence. First off all, periods mate. That was a ridiculous run on sentence. Second I don't think you understand how stare decisis even works. Yes it is binding. Yes the orders of a higher court, especially an apex court, are also law. Stare Decisis means that a lower court is bound to follow existing precedent. And superior courts are expected to respect their own precedents. That does not mean they get to make things up out of whole cloth however. Article 142 is not a mandate to the Supreme Court to trample over the constitutional prerogatives of the other organs of the government, any more than the ability to pass legislation authorizes Parliament to trample the judicial authority of the Court. A \"realist\" school of jurisprudence cannot be a license to ignore the explicit and written text of the constitution. But that is exactly what the Supreme Court does. What verdicts such as the Kesvanada Bharti judgment, the Second Judges Case judgment, the NEET judgment have done. Parliament makes laws. The Court does not. This is constitutional law 101 as far as the Indian Constitution is concerned. That the court ignores it isn't \"realism.\" Its constitutional overreach. >And free and fair elections are important to the spirit of democracy? Are they not? Certainly they are. What is the basis for your claim that until 2023 no election in India was free and fair? What authorized the court to ignore the precedent of a system that was working (so much for Stare Decisis and realism in jurisprudence I might add) and invent a new system altogether? What was the precipitating factor that required the court to step in and alter a constitutional framework without any legal authorization? >Does it not form part of the basic structure of the constitution? No it does not actually. There is no such thing as the basic structure of the constitution. Elections are mandated by the *text* of the constitution. Parliament would be free to amend that text if it wanted. The purpose of the court is to interpret what the constitution requires. Not to decide for itself what is morally just. An individual election can be challenged. It is part of the court's mandate to ensure that violations of the rule of law are punished. But the constitution explicitly empowers Parliament and the Executive to decide how the ECI is selected. The court flagrantly *ignored* the black letter text of the constitution to impose its will. There is no jurisprudential argument under constitutional law that justifies that. It was unconstitutional. >Is democracy as well as the republic not an essential an essential part of the constitution? Was India not a republic and a democracy prior to 2023 when the ECI was selected by the government? Has it overnight stopped being a democracy and a republic because Parliament has seen fit to essentially revert to that system? >And does it not become prevalent to now, more than ever, to preserve the democratic nature of this country in the face of elected authoritarianism? India has had emergency declared twice before. Both during it and in the decades after, nobody believed it necessary to challenge the way the Election Commission functioned. The Election Commission is a constitutional body. Do you believe it is legitimate for the President or Parliament to interfere with how the court hears cases? I assume not. The same principle binds the Supreme Court too. They don't get to interfere with how other constitutional bodies function. >Think about this new law, it replaces the CJI with a government minister, essentially giving a veto to the government, what minister is to disagree with his supreme leader! from 1949 to 2023 the government appointed the Election Commissioner. This was how Parliament willed it by choosing to not interfere with the process of selection. Is it your contention that under this scheme our elections have never been valid? The constitution requires that Parliament regulate how the ECI is selected. The constitution does not say that Parliament must choose a process that is acceptable to the Supreme Court. If parliament wanted they could order that the ECI be chosen by lottery or on the basis of bird flight. That is Parliament's constitutional prerogative. If we don't follow the constitution, then we are a lawless society. A society where authority and might makes right. Do you really want Parliament and the Prime Minister to start ignoring the constitution as the Supreme Court does? >Lmao, be that as it may, it is not an interpretation of statute class or a legal methods class, people are actually getting paid well to teach it and I shall not do it for free here, as to what seems to be a very tedious parlance for me Yeah. I get paid very well to study law and legal systems. I know what I'm talking about. You aren't obligated to teach me anything at all. Apparently I am? It would appear so because have it your way and we would have to replace the constitution with the Leviathan! It is binding upon lower courts you say, and the courts are supposed to honour their own precedents, def you are not wrong, but to agree with you would be to agree that courts exist in a vacuum and that they do not have any role in the administration of justice itself! I still stand by my statement, law is what the court says it the law is, and it so happens that neither are you getting paid to teach me constitutional, rather use this time to brush up on it, because someone who conveniently ignores decades of precedents and judicial reasoning on these matters should brush up on his stuff, and might I suggest you refer to MP Jain this time around? I never said anything about pre 2023 or post 2023 with respect to ECs independence, what I should say is that throughout the ages it has always been a risk however the governments have been weak and opposition strong for an elected autocracy (or theocracy, you never know these days) to occur, it is to me a constitutional oversight in many ways and it should be that the EC remains independent or we are in for disastrous consequences, what I mean to say is, excluding quips, you cannot just ignore the decades of precedents and declare all of them overreach, to discuss the merits of minerva mills or keshvananda are beyond the scope of this parlance, you know that IF you know your constitution, that is, Indian constitution, the demarcations as to functions of organs have never been clear ever, anywhere, there always has been an overlap and there always will be one fortunately or unfortunately. One more thing which I must say, you say that it is the job of the legislature to legislate, I agree, however, it is the job of the court to interpret this very legislation, I hardly think you would disagree with this. Now, moving on, constitution is also a work of a now extinct legislature, however it is not a common legislation in any sense, it creates three creatures, the Judiciary, the Executive, and the Legislature with an interdependently dependent system but it DOES give the constitutional courts the power to actually interpret the constitution and the power of judicial review, having said that, as the sole interpreter of constitution, the court may settle a substantial question of law, through the virtue of it being the sole arbitrator of law in this country, it has a binding effect due to the principles we discussed above, so as the constitution evolves THROUGH judicial experience, the Courts have, rightfully so in my opinion, solidified Part III along with certain other provisions as the basic structure as THE Grund Norm, and everything, and I do mean everything, must be compared against it to decide its constitutionality or be amended in such a fashion. On the lack of legislation, where there is a right, there is a remedy, people do have a right to have free and fair elections, to me it is the essence and spirit of democracy, that is to say, the nation’s democratic spirit would be be essentially murdered otherwise, hence to preserve it, I don’t believe it is far fetched for the court to do what it did and then the legislature came with a legislation which the provision asked for it to do, fair enough, now you will actually see the real life implications of this, as these hindutva hooligans rampage the country if the court does not interfere. Also also, this also gave us Vishakha, again, tracing its legitimacy from Part III, the court recognised a right under Part III and, since there was a right there would have to be a remedy and thus you have vishakha guidelines, and this is the exact reason why Supriyo failed because the court did not recognise a right to begin with for it to provide a remedy. But as things stand we just have fundamentally different ways of looking at law, might I suggest getting a job at the SGs office? He would love you there! And idc if my grammar is satisfactory to you or not, I don’t respect this language 🤡 I have no interest in working for the solicitor general thank. I'm perfectly happy with my job of training future legal thinkers how to respect judicial and constitutional norms. If only our Supreme Court justices had received a similar grounding in basic constitutional norms. Or you. As to the rest. I'm not going to further respond to that incoherent mess. As a general piece of advice however. You make the same mistake many Indian judges and lawyers do, which is to assume basic comprehensibility is irrelevant. Writing a dense, incomprehensible morass of text without even adequate paragraphing betrays poor reasoning and rhetorical skills. It is why India is plagued with barely literate judgements authored by judges who perhaps would be better spent learning how to write instead of dreaming up new ways to illegally expand the court's authority. Jesus, what university is that at? How can SC put a SC judge in the panel. Do we expect the SC to give verdict against themselves if any dispute arises in the future? Independence of judiciary also means that judiciary should stay at arms length from such appointments. So the law only seems reasonable. Judiciary is the only branch which lives like British aristocrats still in 2023. Any move to fix that and we see special benches in no time to maintain status quo. Judiciary needs to look within and reform itself first before getting into political space and ruin the spirit of democracy. Laws are made by the party in power. Laws can be repealed later also by the party then in power. But these activist judges need to do their job well first and foremost. Tumhe informational video daalna hai to 1.5x ya 2x par daalo. Logo ko local pakadni hoti hai."
}