{
    "id": "139lsiy",
    "title": "Karnataka: Congress Releases Clip, Claims BJP Leader Wants to 'Assassinate' Kharge",
    "url": "https://thewire.in/politics/karnataka-congress-clip-bjp-leader-assassinate-kharge",
    "selftext": "The Congress claimed that Manikanta Rathod, the BJP candidate who will face off against Priyank Kharge, said told a saffron party worker that he would “wipe off” the wife and children of its president.",
    "flair": "Politics",
    "score": 79,
    "num_comments": 5,
    "created_utc": 1683376669.0,
    "convurl": "https://external-preview.redd.it/ctNSVatOVPwOWAqZorVMcY4SERx89vnGW2D-V4avw5k.jpg?auto=webp&v=enabled&s=ea1fd99d1ff8ea1c9f8df90f6b92e5a8a024ea6d",
    "comments": [
        "full on terror.",
        "Drama and nothing else, same as mamata's fractured leg in bengal elections. Practically no one from BJP will attack the national leader of congress.",
        "https://www.thenewsminute.com/article/karnataka-cm-says-will-probe-audio-alleged-plot-kill-mallikarjun-kharge-176838\n\nHe will take 40% cut in the probe also, may be shive it up his arse.",
        "Anyone have the clip? I'm not on Twitter"
    ],
    "cleaned_text": "karnataka congress releases clip claims bjp leader wants assassinate kharge congress claimed manikanta rathod bjp candidate face priyank kharge said told saffron party worker would wipe wife children president ",
    "cleaned_title": "karnataka congress releases clip claims bjp leader wants assassinate kharge",
    "cleaned_selftext": "congress claimed manikanta rathod bjp candidate face priyank kharge said told saffron party worker would wipe wife children president",
    "cleaned_comments": "full terror drama nothing else mamatas fractured leg bengal elections practically one bjp attack national leader congress take cut probe also may shive arse anyone clip im twitter",
    "light_cleaned_title": "Karnataka: Congress Releases Clip, Claims BJP Leader Wants to 'Assassinate' Kharge",
    "light_cleaned_selftext": "The Congress claimed that Manikanta Rathod, the BJP candidate who will face off against Priyank Kharge, said told a saffron party worker that he would “wipe off” the wife and children of its president.",
    "light_cleaned_comments": "full on terror. Drama and nothing else, same as mamata's fractured leg in bengal elections. Practically no one from BJP will attack the national leader of congress. He will take 40% cut in the probe also, may be shive it up his arse. Anyone have the clip? I'm not on Twitter"
}