{
    "id": "11tt65j",
    "title": "Does anyone know how to turn on the ringer on this?",
    "url": "https://www.reddit.com/gallery/11tt65j",
    "selftext": "I have this landline phone, the only problem is that it does not ring.",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 26,
    "created_utc": 1679064411,
    "convurl": "https://i.redd.it/as6wnns0bboa1.jpg",
    "comments": [
        "Is it connected to phone line and does it have dial tone ?",
        "Yes It is connected to my router which has landline support, and by dial tone you mean the sound you get when you pick the phone up and there is ringing sound?",
        "I've a landline and it doens't ring too.\nRest everything's fine, do tell me if you find a fix.",
        "Sure thing",
        "Stupid question...Did you find a battery slot underneath the phone and put in the batteries?",
        "Nope there are no battery slots",
        "Are you able to dial out from it?",
        "Yes I am",
        "Is there any battery compartment? You may have to unscrew the base to check as well.\nIf not or if the battery is fine, then perhaps the ringer is broken.",
        "I'll update you soon",
        "The “*” button says tone… try pressing tat n see",
        "Already did",
        "There are buttons at the back...",
        "Nope",
        "On the sides?",
        "Yeah it's a slider thing, i don't know what it's for",
        "There you are... Its for the ring volume",
        "I don't think so, i had it set on the far ends of each side but it still Didn't ring.\n\nI wonder what P and T represent",
        "Pulse and Tone, it is for when you dial a number.",
        "So I need to set it to Tone pe Pulse?",
        "Tone is faster when you dial a number, this will not help you with your ringer.",
        "To turn off silent mode, press and hold the star key for two seconds.",
        "I tried that, didn't work",
        "Sorry, that's about the only method known for the models with no physical volume knob.",
        "Can you explain how to do it? Do i just press it or do hold the receiver in my hand while pressing it?"
    ],
    "cleaned_text": "anyone know turn ringer landline phone problem ring ",
    "cleaned_title": "anyone know turn ringer",
    "cleaned_selftext": "landline phone problem ring",
    "cleaned_comments": "connected phone line dial tone yes connected router landline support dial tone mean sound get pick phone ringing sound ive landline doenst ring rest everythings fine tell find fix sure thing stupid questiondid find battery slot underneath phone put batteries nope battery slots able dial yes battery compartment may unscrew base check well battery fine perhaps ringer broken ill update soon button says tone try pressing tat n see already buttons back nope sides yeah slider thing dont know ring volume dont think set far ends side still didnt ring wonder p represent pulse tone dial number need set tone pe pulse tone faster dial number help ringer turn silent mode press hold star key two seconds tried didnt work sorry thats method known models physical volume knob explain press hold receiver hand pressing",
    "light_cleaned_title": "Does anyone know how to turn on the ringer on this?",
    "light_cleaned_selftext": "I have this landline phone, the only problem is that it does not ring.",
    "light_cleaned_comments": "Is it connected to phone line and does it have dial tone ? Yes It is connected to my router which has landline support, and by dial tone you mean the sound you get when you pick the phone up and there is ringing sound? I've a landline and it doens't ring too. Rest everything's fine, do tell me if you find a fix. Sure thing Stupid question...Did you find a battery slot underneath the phone and put in the batteries? Nope there are no battery slots Are you able to dial out from it? Yes I am Is there any battery compartment? You may have to unscrew the base to check as well. If not or if the battery is fine, then perhaps the ringer is broken. I'll update you soon The “*” button says tone… try pressing tat n see Already did There are buttons at the back... Nope On the sides? Yeah it's a slider thing, i don't know what it's for There you are... Its for the ring volume I don't think so, i had it set on the far ends of each side but it still Didn't ring. I wonder what P and T represent Pulse and Tone, it is for when you dial a number. So I need to set it to Tone pe Pulse? Tone is faster when you dial a number, this will not help you with your ringer. To turn off silent mode, press and hold the star key for two seconds. I tried that, didn't work Sorry, that's about the only method known for the models with no physical volume knob. Can you explain how to do it? Do i just press it or do hold the receiver in my hand while pressing it?"
}