{
    "id": "16bds1b",
    "title": "How is your city's Library? Does anybody use it for studies?",
    "url": "https://i.redd.it/0db0fgoa9lmb1.png",
    "selftext": "\n(This is government Library with A/C. Price ₹200/month. Open 24 hours, 7 days. Small city)\n\nLibrary is seriously a lifesaver for me preparing for Gate 2024. I cannot study in my house. Library forces me to study. Recently I took a break from library due to the eye infection spreading in India, and I wasted all the time in my home reading novels and other things.\n\nDo any of you use library for normal studies or for competetive exam preparation?  How much does it cost? And what facilities does it have. Also big city or small city?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693985735.0,
    "convurl": "https://i.redd.it/0db0fgoa9lmb1.png",
    "comments": [
        "Camera photo\nLocation- Lala Jagdalpuri library, Jagdalpur, Chhattisgarh, India 494001\nDevice- Samsung galaxy tab s8 5g \nDimensions 1.68 MB, 2896×2176, ISO 50, 13 mm, F2.2, 1/50s",
        "This looks more like an expensive college's library",
        "I have used VIT's library and this one feels better.",
        "It doesn't have one",
        "Which city is this? Do bbsr have one?",
        "Jagdalpur, Chhattisgarh",
        "what's the name of this library?",
        "Ah this brings back memories",
        "\nLocation- Lala Jagdalpuri library, Jagdalpur, Chhattisgarh, India 494001",
        "I study at home. Raipur got good libraries too but even the nearest one is at least 4 km away and it takes 20 minutes to get there. So I've a good study setup at home in my room and no one disturbs me when I'm studying so it's good also I got AC so it's always cold and relaxing here.",
        "https://preview.redd.it/oi27hab0ammb1.png?width=1080&format=pjpg&auto=webp&s=92bc623d5b584d3cd14461caf1b42122dda1800e\n\nTry this medicine",
        "gec?",
        "What. .",
        "Thanks.\n\n&#x200B;\n\nI didn't get eye infection. I didn't go to lib because I was afraid of getting infection.  .",
        "National Library, Kolkata - central AC and can accomodate a few thousand. I got a lifetime membership for a few hundred rupees back in school",
        "Don't be afraid, be vigilant.",
        "Good deal. .",
        "What eye infection? There is nothing about that in the news.",
        "Google Earth Coordinates, I suppose..",
        "Can we see like cats are nights?",
        "my boyfriend used to study there for neet prep. such a nice place",
        "Hopefully 🤞😊",
        "Wow my city library is old seems like the whole place is rusty . Even if my city  is known for many famouthings and some tier 2 clgs are also here . But still never ever imagined the city library to be as good as this.",
        "Wareen Hastings ghost pays a visit to thank if you stay the night",
        "https://www.financialexpress.com/healthcare/news-healthcare/conjunctivitis-cases-continue-to-surge-in-india-heres-what-you-need-to-know/3199009/ . \n\n&#x200B;\n\nIt was in August.  ."
    ],
    "cleaned_text": "citys library anybody use studies government library ac price month open hours days small city library seriously lifesaver preparing gate study house library forces study recently took break library due eye infection spreading india wasted time home reading novels things use library normal studies competetive exam preparation much cost facilities also big city small city ",
    "cleaned_title": "citys library anybody use studies",
    "cleaned_selftext": "government library ac price month open hours days small city library seriously lifesaver preparing gate study house library forces study recently took break library due eye infection spreading india wasted time home reading novels things use library normal studies competetive exam preparation much cost facilities also big city small city",
    "cleaned_comments": "camera photo location lala jagdalpuri library jagdalpur chhattisgarh india device samsung galaxy tab g dimensions mb iso mm f looks like expensive colleges library used vits library one feels better doesnt one city bbsr one jagdalpur chhattisgarh whats name library ah brings back memories location lala jagdalpuri library jagdalpur chhattisgarh india study home raipur got good libraries even nearest one least km away takes minutes get ive good study setup home room one disturbs im studying good also got ac always cold relaxing try medicine gec thanks xb didnt get eye infection didnt go lib afraid getting infection national library kolkata central ac accomodate thousand got lifetime membership hundred rupees back school dont afraid vigilant good deal eye infection nothing news google earth coordinates suppose see like cats nights boyfriend used study neet prep nice place hopefully wow city library old seems like whole place rusty even city known many famouthings tier clgs also still never ever imagined city library good wareen hastings ghost pays visit thank stay night xb august",
    "light_cleaned_title": "How is your city's Library? Does anybody use it for studies?",
    "light_cleaned_selftext": "(This is government Library with A/C. Price ₹200/month. Open 24 hours, 7 days. Small city) Library is seriously a lifesaver for me preparing for Gate 2024. I cannot study in my house. Library forces me to study. Recently I took a break from library due to the eye infection spreading in India, and I wasted all the time in my home reading novels and other things. Do any of you use library for normal studies or for competetive exam preparation? How much does it cost? And what facilities does it have. Also big city or small city?",
    "light_cleaned_comments": "Camera photo Location- Lala Jagdalpuri library, Jagdalpur, Chhattisgarh, India 494001 Device- Samsung galaxy tab s8 5g Dimensions 1.68 MB, 2896×2176, ISO 50, 13 mm, F2.2, 1/50s This looks more like an expensive college's library I have used VIT's library and this one feels better. It doesn't have one Which city is this? Do bbsr have one? Jagdalpur, Chhattisgarh what's the name of this library? Ah this brings back memories Location- Lala Jagdalpuri library, Jagdalpur, Chhattisgarh, India 494001 I study at home. Raipur got good libraries too but even the nearest one is at least 4 km away and it takes 20 minutes to get there. So I've a good study setup at home in my room and no one disturbs me when I'm studying so it's good also I got AC so it's always cold and relaxing here. Try this medicine gec? What. . Thanks. &#x200B; I didn't get eye infection. I didn't go to lib because I was afraid of getting infection. . National Library, Kolkata - central AC and can accomodate a few thousand. I got a lifetime membership for a few hundred rupees back in school Don't be afraid, be vigilant. Good deal. . What eye infection? There is nothing about that in the news. Google Earth Coordinates, I suppose.. Can we see like cats are nights? my boyfriend used to study there for neet prep. such a nice place Hopefully 🤞😊 Wow my city library is old seems like the whole place is rusty . Even if my city is known for many famouthings and some tier 2 clgs are also here . But still never ever imagined the city library to be as good as this. Wareen Hastings ghost pays a visit to thank if you stay the night . &#x200B; It was in August. ."
}