{
    "id": "15sij1n",
    "title": "Why do you like iphone over Android?",
    "url": "https://www.reddit.com/r/india/comments/15sij1n/why_do_you_like_iphone_over_android/",
    "selftext": "We paid to Apple Rs.80 000 for LCD display before 12, 13, 14 OLED . We are paying Rs.1 lac for 14 + . why?  \n\niphone  vs  Android comparison pros.... cons .... \n\niphone pros :  I do not know what are the pros. if anyone can share pros being hold iphone  but cons ... let me write ... \n\n1. Bad battery and 4- hour talk time in a day. \n2. Carry your charging cable in your wallet. \n3. Pay  Rs. 70 0000 and pay attention next to trouser private part packet ./ rob / stolen . \n4. expensive repair. \n5. Insurance cost. \n6. Use Original brick and Original Cable . \n7. Apps mostly Not available , Apps Not Free . \n8. Firefox browser app issues \n9. itunes , backup , icloud , Apple ID  etc..... Not easy for uneducated and Non techy old granny. \n\n&#x200B;\n\nAndroid  \n\nPros : - \n\n1.  Android developers updates and apps Available Free . \n2.  Faster chipset ex. snapdragon ..... \n3.  Mah battery more 6000 for 1 day and play games. \n4.  Easy to connect PC and forward data . \n5.  Secure apps via Google Play store . \n6. Secure your phone blocking ads ,  [dns.adguard.com](https://dns.adguard.com)in private DNS . \n7. Google Pixel , etc. phones without bloatware . regular security updates . \n\nCons ::-  \n\n1.   Please share someone Cons . \n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692170122.0,
    "convurl": "https://external-preview.redd.it/7KjKaNu8ztu1tmm8OBIfuH4mlGczAv4IXH-S0G8cQgE.jpg?auto=webp&s=dd4d0b2ad383472dc3880258e9e34277a618ee45",
    "comments": [
        "I used an iPhone 3G for 2 years. Then shifted to android for 4 years and then shifted back to iPhone and I’ve been using iPhone ever since. \n\nDuring the 3G days, iPhone was super restricted. Yes. I agree android had far more features than iPhone then (and even today, but those features are mostly the freedom that the restrictive Apple ecosystem doesn’t provide). Being able to share, being able to use third party accessories , it was not possible with Apple during the 3G days. \n\nThen I shifted to android and I was very happy with the freedom. Used to tell people that android is much better than iPhone. \n\n\nThen I again shifted back to iPhone. This time I saw that Apple was opening up their ecosystem to accommodate things that were only available on android. This was after Steve Jobs was gone. Tim Cook saw the need to change according to market trend (like bigger screens). Bigger screens also allowed bigger batteries. The iPhone 7,8,X had bigger batteries but still didn’t provide enough battery backup. That changed with iPhone 11. Apple started doing optimisation on software to reduce battery usage and from iPhone 11 iPhone started giving better battery backup. \n\nI agree the Apple ecosystem is still restrictive in terms of backup, iTunes, apps restrictions. But that also has pros for “layman” as no malware or stupid adware, bloatware will automatically install in the background so it makes it a little secure. That doesn’t secure us from SMS,OTP,UPI scams but it’s still better than android. My mom uses iPhone and I am rest assured that her phone will not slow down or get hacked because of Adware,Malware. \n\nI’ve heard a lot of stories on the internet and from friends about iPhone breaking, getting damaged and the repair cost is way too expensive but my iPhone has been abused to the core and I still have never had to get it repaired. Touchwood. Maybe it’s just luck. \n\nThe iPhone is smooth. That is unmatched. I haven’t used the Android flagships so I am guessing the Android flagships are also super smooth. The thing with Apple is that the hardware and software both are designed by one company so they know what works for the hardware. That’s why even a 4GB iPhone will be smooth for years. Talking about chipset, iPhones own chipset is super powerful , as I said before , the same company producing software and hardware will make the best optimisation of resources. In Android, the software is Google and there are so many Hardware companies so it becomes difficult to optimise for each and every hardware out there. \n\nI will still say that Android gives you way more freedom than iPhone and iPhone being too restrictive is a pain but the restrictive nature of Apple makes it a little secure for Non techy people. \n\nApple follows the trend of restricting their features to Apple devices so that people will buy more Apple products. If you have an iPhone, a Mac then you’ll see that Apple products work like magic. That’s the greedy and capitalist approach of Apple but then it has that power (and money) to afford being restrictive. It also has the power to keep their prices high (thanks to people WANTING to pay so much just fir the Apple name, it was a Status symbol back in the days and Apple minting a LOT, ALOT of money because of this. It still is.)\n\nWith the EU passing the law for iPhones to shift to USB C, and forcing Apple to allow installing apps from unknown sources things are going to change hugely for iPhones but it will also make iPhones more prone to Adware, Malware. \n\n\n\nTLDR - Apple makes its own Software and Hardware that’s why it provides smooth performance. Apple takes advantage of the mindset of people of Apple being a status symbol so it mints a lot of money and keeps its products highly priced.",
        "Build quality. No software issues at all. UX is smooth as fuck. No worry about adware or shitty apps. Will last longer than most Android phones.",
        "I am using s21 ultra, It's very smooth, no bloatware ever, never had any problem with chip as im not playing very high end games and may be they will play well. So I feel it's more about customers comfort zone with one system. Flagship androids are as good as apple and even A series of Samsung is very nice.",
        "Security..android phones lack that. And i think this one reason is enough",
        "Updates, both OS and security. That is only thing come to my mind, and I’m an iPhone user.\nApart from that it has a pretty awesome continuity between my MacBook and iPhone. Which includes apps and headphones. But again I don’t know if it worth the premium I paid for it. \nOne can also argue about the longevity but it’s my first so I cannot comment on it.",
        "I got an iPhone in 2019, it still works well. My friend used to tell me the same thing. She used to give me so much shit for owning an iPhone. Her boyfriend at the time got her an iPhone and she wouldn’t stop bragging about it. But there are really good android phones like the Pixel 7a. Each to their own It is considered a status symbol and if you’re buying it to brag about it, you’re lame.",
        "Yeah the price you pay for iPhone, in that range no andoird will have bloat ware or hardware issues or ui issue.",
        "Buying iPhone is just waste. Ipad is atleast a good investment but iPhone is not. An android of 60k+ will not have bloat ware, software issues or hardware issues.\n\nBut I guess not many feel this way. You will get more attention if you use iphone",
        "iPHONE Pros  \n1. Software Stability -> My 5 year old iphone is still smooth but 2 year samsung lags occassionally\n\n2. Hardware Quality -> iPhone was dropped multiple times yet solid but samsung has curved display and I have use a stupid case that covers the corners\n\n3. Software Quality -> Samsung store even after loading the landing page, makes me wait till they load a stupid ad. Apple doesnt do this shit to make some bucks!\n\n4.  Lifetime -> iPhones last way longer than typical androids, and OS updates are provided\n\n5. Seamless -> airpods auto connect to mac / phone, copy on phone and paste on mac and vice versa, apple pay is ultra amazing!",
        "If you like either Android/iPhone, then use it. You come across a little insecure in your choice and seems like you want validation. Pros and cons are very subjective. Different people want different things from their phones.\n\nNowadays I prefer the simplicity/restrictive nature of the iOS. I know exactly what I will be getting and will be getting latest S/W updates for the forseeable future.\n\nDuring my college I preferred Android because I had enough energy and time to play around with my phone. People change and so do their choices.\n\nThe only loser is you if you pigeonhole yourself to either platform. You might be missing out on a better product, which again is very subjective.",
        "There are both pros and cons for android and iphone as well. But the high premium that apple charges is defiitely  not worth the device. FoMo is the biggest reason for iPhone popularity nothig else, I can say that having switched to iphone for couple of years and back.",
        "> You will get more attention if you use iphone\n\nYes, can confirm. When I put my iPhone into the tray at airport security, they let me go first compared to my cousin who had to wait in the line for a few minutes just because he had an Android. I even got a lot of compliments saying how good my iPhone looked, and everyone clapped as my iPhone passed through the scanner. The attention was very, very real. /s",
        "I mean from the post it just seems bro's biased af so like cool ig",
        "Yeah you get no attention with iPhone. People don't look at iPhone start treating you different. This is why people who use iPhone cover the design because nobody cares about iPhone. This why people who buy iPhone never talk about iPhone all the time or keep trying to bring that that they own an iPhone at all. /s",
        "I think you need to grow up and mature beyond this Android vs Apple nonsense. Both have their own individual merits, and taking a side is stupid.\n\nI personally prefer the range of products available, lower price, UI and OS, and features available on Android phones and thus use them. I also bought my sister an iPhone and it's been going pretty well for her too. To each their own.",
        "Using my first iphone since last 6 months. Bought an iphone 11 for 34K during last big billion day. \n\nI will get OS and security updates till 2026. No other android ohone at the time could offer that at the price point.\n\nGreat camera, Facetime is in another league. \n\nEven old, the phone feels snappy and iPhones usually dont get slow like android does i couple of years.\n\nStill like android too though, may try a Pixel next time.. I dont get why some are \"absolutists\" .. both platforms has its pros and cons, let us choose what works for us..",
        "Buy premium phones from Apple and Samsung, the UI is smooth and there's hardware issues on android phones as well. And the UI is addictive on both the devices."
    ],
    "cleaned_text": "like iphone android paid apple rs lcd display oled paying rs lac iphone vs android comparison pros cons iphone pros know pros anyone share pros hold iphone cons let write bad battery hour talk time day carry charging cable wallet pay rs pay attention next trouser private part packet rob stolen expensive repair insurance cost use original brick original cable apps mostly available apps free firefox browser app issues itunes backup icloud apple id etc easy uneducated non techy old granny xb android pros android developers updates apps available free faster chipset ex snapdragon mah battery day play games easy connect pc forward data secure apps via google play store secure phone blocking ads dnsadguardcomhttpsdnsadguardcomin private dns google pixel etc phones without bloatware regular security updates cons please share someone cons xb ",
    "cleaned_title": "like iphone android",
    "cleaned_selftext": "paid apple rs lcd display oled paying rs lac iphone vs android comparison pros cons iphone pros know pros anyone share pros hold iphone cons let write bad battery hour talk time day carry charging cable wallet pay rs pay attention next trouser private part packet rob stolen expensive repair insurance cost use original brick original cable apps mostly available apps free firefox browser app issues itunes backup icloud apple id etc easy uneducated non techy old granny xb android pros android developers updates apps available free faster chipset ex snapdragon mah battery day play games easy connect pc forward data secure apps via google play store secure phone blocking ads dnsadguardcomhttpsdnsadguardcomin private dns google pixel etc phones without bloatware regular security updates cons please share someone cons xb",
    "cleaned_comments": "used iphone g years shifted android years shifted back iphone ive using iphone ever since g days iphone super restricted yes agree android far features iphone even today features mostly freedom restrictive apple ecosystem doesnt provide able share able use third party accessories possible apple g days shifted android happy freedom used tell people android much better iphone shifted back iphone time saw apple opening ecosystem accommodate things available android steve jobs gone tim cook saw need change according market trend like bigger screens bigger screens also allowed bigger batteries iphone x bigger batteries still didnt provide enough battery backup changed iphone apple started optimisation software reduce battery usage iphone iphone started giving better battery backup agree apple ecosystem still restrictive terms backup itunes apps restrictions also pros layman malware stupid adware bloatware automatically install background makes little secure doesnt secure us smsotpupi scams still better android mom uses iphone rest assured phone slow get hacked adwaremalware ive heard lot stories internet friends iphone breaking getting damaged repair cost way expensive iphone abused core still never get repaired touchwood maybe luck iphone smooth unmatched havent used android flagships guessing android flagships also super smooth thing apple hardware software designed one company know works hardware thats even gb iphone smooth years talking chipset iphones chipset super powerful said company producing software hardware make best optimisation resources android software google many hardware companies becomes difficult optimise every hardware still say android gives way freedom iphone iphone restrictive pain restrictive nature apple makes little secure non techy people apple follows trend restricting features apple devices people buy apple products iphone mac youll see apple products work like magic thats greedy capitalist approach apple power money afford restrictive also power keep prices high thanks people wanting pay much fir apple name status symbol back days apple minting lot alot money still eu passing law iphones shift usb c forcing apple allow installing apps unknown sources things going change hugely iphones also make iphones prone adware malware tldr apple makes software hardware thats provides smooth performance apple takes advantage mindset people apple status symbol mints lot money keeps products highly priced build quality software issues ux smooth fuck worry adware shitty apps last longer android phones using ultra smooth bloatware ever never problem chip im playing high end games may play well feel customers comfort zone one system flagship androids good apple even series samsung nice securityandroid phones lack think one reason enough updates os security thing come mind im iphone user apart pretty awesome continuity macbook iphone includes apps headphones dont know worth premium paid one also argue longevity first comment got iphone still works well friend used tell thing used give much shit owning iphone boyfriend time got iphone wouldnt stop bragging really good android phones like pixel considered status symbol youre buying brag youre lame yeah price pay iphone range andoird bloat ware hardware issues ui issue buying iphone waste ipad atleast good investment iphone android k bloat ware software issues hardware issues guess many feel way get attention use iphone iphone pros software stability year old iphone still smooth year samsung lags occassionally hardware quality iphone dropped multiple times yet solid samsung curved display use stupid case covers corners software quality samsung store even loading landing page makes wait till load stupid ad apple doesnt shit make bucks lifetime iphones last way longer typical androids os updates provided seamless airpods auto connect mac phone copy phone paste mac vice versa apple pay ultra amazing like either androidiphone use come across little insecure choice seems like want validation pros cons subjective different people want different things phones nowadays prefer simplicityrestrictive nature ios know exactly getting getting latest sw updates forseeable future college preferred android enough energy time play around phone people change choices loser pigeonhole either platform might missing better product subjective pros cons android iphone well high premium apple charges defiitely worth device fomo biggest reason iphone popularity nothig else say switched iphone couple years back get attention use iphone yes confirm put iphone tray airport security let go first compared cousin wait line minutes android even got lot compliments saying good iphone looked everyone clapped iphone passed scanner attention real mean post seems bros biased af like cool ig yeah get attention iphone people dont look iphone start treating different people use iphone cover design nobody cares iphone people buy iphone never talk iphone time keep trying bring iphone think need grow mature beyond android vs apple nonsense individual merits taking side stupid personally prefer range products available lower price ui os features available android phones thus use also bought sister iphone going pretty well using first iphone since last months bought iphone k last big billion day get os security updates till android ohone time could offer price point great camera facetime another league even old phone feels snappy iphones usually dont get slow like android couple years still like android though may try pixel next time dont get absolutists platforms pros cons let us choose works us buy premium phones apple samsung ui smooth theres hardware issues android phones well ui addictive devices",
    "light_cleaned_title": "Why do you like iphone over Android?",
    "light_cleaned_selftext": "We paid to Apple Rs.80 000 for LCD display before 12, 13, 14 OLED . We are paying Rs.1 lac for 14 + . why? iphone vs Android comparison pros.... cons .... iphone pros : I do not know what are the pros. if anyone can share pros being hold iphone but cons ... let me write ... 1. Bad battery and 4- hour talk time in a day. 2. Carry your charging cable in your wallet. 3. Pay Rs. 70 0000 and pay attention next to trouser private part packet ./ rob / stolen . 4. expensive repair. 5. Insurance cost. 6. Use Original brick and Original Cable . 7. Apps mostly Not available , Apps Not Free . 8. Firefox browser app issues 9. itunes , backup , icloud , Apple ID etc..... Not easy for uneducated and Non techy old granny. &#x200B; Android Pros : - 1. Android developers updates and apps Available Free . 2. Faster chipset ex. snapdragon ..... 3. Mah battery more 6000 for 1 day and play games. 4. Easy to connect PC and forward data . 5. Secure apps via Google Play store . 6. Secure your phone blocking ads , [dns.adguard.com](https://dns.adguard.com)in private DNS . 7. Google Pixel , etc. phones without bloatware . regular security updates . Cons ::- 1. Please share someone Cons . &#x200B;",
    "light_cleaned_comments": "I used an iPhone 3G for 2 years. Then shifted to android for 4 years and then shifted back to iPhone and I’ve been using iPhone ever since. During the 3G days, iPhone was super restricted. Yes. I agree android had far more features than iPhone then (and even today, but those features are mostly the freedom that the restrictive Apple ecosystem doesn’t provide). Being able to share, being able to use third party accessories , it was not possible with Apple during the 3G days. Then I shifted to android and I was very happy with the freedom. Used to tell people that android is much better than iPhone. Then I again shifted back to iPhone. This time I saw that Apple was opening up their ecosystem to accommodate things that were only available on android. This was after Steve Jobs was gone. Tim Cook saw the need to change according to market trend (like bigger screens). Bigger screens also allowed bigger batteries. The iPhone 7,8,X had bigger batteries but still didn’t provide enough battery backup. That changed with iPhone 11. Apple started doing optimisation on software to reduce battery usage and from iPhone 11 iPhone started giving better battery backup. I agree the Apple ecosystem is still restrictive in terms of backup, iTunes, apps restrictions. But that also has pros for “layman” as no malware or stupid adware, bloatware will automatically install in the background so it makes it a little secure. That doesn’t secure us from SMS,OTP,UPI scams but it’s still better than android. My mom uses iPhone and I am rest assured that her phone will not slow down or get hacked because of Adware,Malware. I’ve heard a lot of stories on the internet and from friends about iPhone breaking, getting damaged and the repair cost is way too expensive but my iPhone has been abused to the core and I still have never had to get it repaired. Touchwood. Maybe it’s just luck. The iPhone is smooth. That is unmatched. I haven’t used the Android flagships so I am guessing the Android flagships are also super smooth. The thing with Apple is that the hardware and software both are designed by one company so they know what works for the hardware. That’s why even a 4GB iPhone will be smooth for years. Talking about chipset, iPhones own chipset is super powerful , as I said before , the same company producing software and hardware will make the best optimisation of resources. In Android, the software is Google and there are so many Hardware companies so it becomes difficult to optimise for each and every hardware out there. I will still say that Android gives you way more freedom than iPhone and iPhone being too restrictive is a pain but the restrictive nature of Apple makes it a little secure for Non techy people. Apple follows the trend of restricting their features to Apple devices so that people will buy more Apple products. If you have an iPhone, a Mac then you’ll see that Apple products work like magic. That’s the greedy and capitalist approach of Apple but then it has that power (and money) to afford being restrictive. It also has the power to keep their prices high (thanks to people WANTING to pay so much just fir the Apple name, it was a Status symbol back in the days and Apple minting a LOT, ALOT of money because of this. It still is.) With the EU passing the law for iPhones to shift to USB C, and forcing Apple to allow installing apps from unknown sources things are going to change hugely for iPhones but it will also make iPhones more prone to Adware, Malware. TLDR - Apple makes its own Software and Hardware that’s why it provides smooth performance. Apple takes advantage of the mindset of people of Apple being a status symbol so it mints a lot of money and keeps its products highly priced. Build quality. No software issues at all. UX is smooth as fuck. No worry about adware or shitty apps. Will last longer than most Android phones. I am using s21 ultra, It's very smooth, no bloatware ever, never had any problem with chip as im not playing very high end games and may be they will play well. So I feel it's more about customers comfort zone with one system. Flagship androids are as good as apple and even A series of Samsung is very nice. Security..android phones lack that. And i think this one reason is enough Updates, both OS and security. That is only thing come to my mind, and I’m an iPhone user. Apart from that it has a pretty awesome continuity between my MacBook and iPhone. Which includes apps and headphones. But again I don’t know if it worth the premium I paid for it. One can also argue about the longevity but it’s my first so I cannot comment on it. I got an iPhone in 2019, it still works well. My friend used to tell me the same thing. She used to give me so much shit for owning an iPhone. Her boyfriend at the time got her an iPhone and she wouldn’t stop bragging about it. But there are really good android phones like the Pixel 7a. Each to their own It is considered a status symbol and if you’re buying it to brag about it, you’re lame. Yeah the price you pay for iPhone, in that range no andoird will have bloat ware or hardware issues or ui issue. Buying iPhone is just waste. Ipad is atleast a good investment but iPhone is not. An android of 60k+ will not have bloat ware, software issues or hardware issues. But I guess not many feel this way. You will get more attention if you use iphone iPHONE Pros 1. Software Stability -> My 5 year old iphone is still smooth but 2 year samsung lags occassionally 2. Hardware Quality -> iPhone was dropped multiple times yet solid but samsung has curved display and I have use a stupid case that covers the corners 3. Software Quality -> Samsung store even after loading the landing page, makes me wait till they load a stupid ad. Apple doesnt do this shit to make some bucks! 4. Lifetime -> iPhones last way longer than typical androids, and OS updates are provided 5. Seamless -> airpods auto connect to mac / phone, copy on phone and paste on mac and vice versa, apple pay is ultra amazing! If you like either Android/iPhone, then use it. You come across a little insecure in your choice and seems like you want validation. Pros and cons are very subjective. Different people want different things from their phones. Nowadays I prefer the simplicity/restrictive nature of the iOS. I know exactly what I will be getting and will be getting latest S/W updates for the forseeable future. During my college I preferred Android because I had enough energy and time to play around with my phone. People change and so do their choices. The only loser is you if you pigeonhole yourself to either platform. You might be missing out on a better product, which again is very subjective. There are both pros and cons for android and iphone as well. But the high premium that apple charges is defiitely not worth the device. FoMo is the biggest reason for iPhone popularity nothig else, I can say that having switched to iphone for couple of years and back. > You will get more attention if you use iphone Yes, can confirm. When I put my iPhone into the tray at airport security, they let me go first compared to my cousin who had to wait in the line for a few minutes just because he had an Android. I even got a lot of compliments saying how good my iPhone looked, and everyone clapped as my iPhone passed through the scanner. The attention was very, very real. /s I mean from the post it just seems bro's biased af so like cool ig Yeah you get no attention with iPhone. People don't look at iPhone start treating you different. This is why people who use iPhone cover the design because nobody cares about iPhone. This why people who buy iPhone never talk about iPhone all the time or keep trying to bring that that they own an iPhone at all. /s I think you need to grow up and mature beyond this Android vs Apple nonsense. Both have their own individual merits, and taking a side is stupid. I personally prefer the range of products available, lower price, UI and OS, and features available on Android phones and thus use them. I also bought my sister an iPhone and it's been going pretty well for her too. To each their own. Using my first iphone since last 6 months. Bought an iphone 11 for 34K during last big billion day. I will get OS and security updates till 2026. No other android ohone at the time could offer that at the price point. Great camera, Facetime is in another league. Even old, the phone feels snappy and iPhones usually dont get slow like android does i couple of years. Still like android too though, may try a Pixel next time.. I dont get why some are \"absolutists\" .. both platforms has its pros and cons, let us choose what works for us.. Buy premium phones from Apple and Samsung, the UI is smooth and there's hardware issues on android phones as well. And the UI is addictive on both the devices."
}