{
    "id": "162i57n",
    "title": "Minor boy’s body found in Assam BJP MP’s house Silchar",
    "url": "https://indianexpress.com/article/north-east-india/assam/minor-boys-body-found-in-assam-bjp-mps-house-silchar-8911427/",
    "selftext": "The victim's mother was working in the house of the BJP leader as a domestic help for two-and-a-half years and was originally from Dholai area, he said.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1693115745.0,
    "convurl": "https://external-preview.redd.it/1qg02TVCBIQzuM8dyammR4dKQTa8_EuLkmXrMHrS5FM.jpg?auto=webp&s=2a3b57886380732c8967357da9ef2ce526b35a77",
    "comments": [
        "Shady AF. I can't understand how a 10-year-old can commit suicide and why...?.",
        "How long before this news disappears? And media focuses on seema",
        "Poor BJP MLA. He must be so traumatized . . . . .",
        "[Flashback May 2009](https://www.google.com/amp/s/www.hindustantimes.com/india/girl-found-dead-in-bjp-leader-s-car-family-cries-rape/story-k5JyOBVNSp4bi0rl1iVkLN_amp.html)",
        "That's likely to be news to most, including me. Demons these politicians are",
        "Mujhe b just abhi pata chala iss baare mein through a comment on a similar post on another sub."
    ],
    "cleaned_text": "minor boys body found assam bjp mps house silchar victims mother working house bjp leader domestic help twoandahalf years originally dholai area said ",
    "cleaned_title": "minor boys body found assam bjp mps house silchar",
    "cleaned_selftext": "victims mother working house bjp leader domestic help twoandahalf years originally dholai area said",
    "cleaned_comments": "shady af cant understand yearold commit suicide long news disappears media focuses seema poor bjp mla must traumatized flashback may httpswwwgooglecomampswwwhindustantimescomindiagirlfounddeadinbjpleaderscarfamilycriesrapestorykjyobvnspbirlivklnamphtml thats likely news including demons politicians mujhe b abhi pata chala iss baare mein comment similar post another sub",
    "light_cleaned_title": "Minor boy’s body found in Assam BJP MP’s house Silchar",
    "light_cleaned_selftext": "The victim's mother was working in the house of the BJP leader as a domestic help for two-and-a-half years and was originally from Dholai area, he said.",
    "light_cleaned_comments": "Shady AF. I can't understand how a 10-year-old can commit suicide and why...?. How long before this news disappears? And media focuses on seema Poor BJP MLA. He must be so traumatized . . . . . [Flashback May 2009](https://www.google.com/amp/s/www.hindustantimes.com/india/girl-found-dead-in-bjp-leader-s-car-family-cries-rape/story-k5JyOBVNSp4bi0rl1iVkLN_amp.html) That's likely to be news to most, including me. Demons these politicians are Mujhe b just abhi pata chala iss baare mein through a comment on a similar post on another sub."
}