{
    "id": "1amtmpz",
    "title": "Cyber crime",
    "url": "https://www.reddit.com/gallery/1amtmpz",
    "selftext": "At 11 today I got scammed on UPI , I didn't even entered pin or anything else but acc showed 3 debit transactions Totaling 40k one was a direct UPI transfer of 34k others were transaction on Myntra and olamoney. \nIs there any way to get that back , I complained in bank and cyber police also.\n\nAnd one more thing is that now I am receiving bank messages and OTP from one private no and banks also, how is this possible, please help me with some solutions.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1707499912.0,
    "convurl": "https://i.redd.it/lbwejzqvhlhc1.jpg",
    "comments": [],
    "cleaned_text": "cyber crime today got scammed upi didnt even entered pin anything else acc showed debit transactions totaling k one direct upi transfer k others transaction myntra olamoney way get back complained bank cyber police also one thing receiving bank messages otp one private banks also possible please help solutions ",
    "cleaned_title": "cyber crime",
    "cleaned_selftext": "today got scammed upi didnt even entered pin anything else acc showed debit transactions totaling k one direct upi transfer k others transaction myntra olamoney way get back complained bank cyber police also one thing receiving bank messages otp one private banks also possible please help solutions",
    "cleaned_comments": "",
    "light_cleaned_title": "Cyber crime",
    "light_cleaned_selftext": "At 11 today I got scammed on UPI , I didn't even entered pin or anything else but acc showed 3 debit transactions Totaling 40k one was a direct UPI transfer of 34k others were transaction on Myntra and olamoney. Is there any way to get that back , I complained in bank and cyber police also. And one more thing is that now I am receiving bank messages and OTP from one private no and banks also, how is this possible, please help me with some solutions.",
    "light_cleaned_comments": ""
}