{
    "id": "11uaohf",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/11uaohf/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 9,
    "num_comments": 20,
    "created_utc": 1679103012,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Currently watching Succession. Loving Tom Greg duo.",
        "Dude i am also watching succession bingwatched \n2 seasons at 3rd season now",
        "Season 2 of Rocket Boys is out. Inspiring stuff, but not sure how much is true and how much is deliberately fiction.",
        "Is it on Netflix?",
        "Well it's on Hotstar for now but will be removed after March 31st.",
        "Shrinking on Apple TV+ is an amazing sitcom and it’s about a line of a therapist.",
        "Would highly recommend the last of us",
        "discovered arjun rampal film \" daddy\" on amazon prime .. its a must watch.. its not a typical bollywood gangster film.. very dark and non commercial.. do check this out",
        "Did anybody see family man , it's friggin fantastic",
        "new season ?",
        "Post show , Was thinking of how can Congress be so stupid to give away the nationalistic tag",
        "Great stuff",
        "Rocket Boys 2 . great watch",
        "Yup season deux",
        "Watched Rockstar by imtiaz ali for first time and i lovedd it",
        "The last episode was kinda meh but overall liked it",
        "Rocket boyz 2! :)",
        "Just completed Wednesday. Great show with Harry Potter vibes.\n\nAnd You season 4. Good season with that Rhys Montrose twist. Miss Love Quinn from season 3.",
        "Finished watching Upright. Great series. Highly recommended"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "currently watching succession loving tom greg duo dude also watching succession bingwatched seasons rd season season rocket boys inspiring stuff sure much true much deliberately fiction netflix well hotstar removed march st shrinking apple tv amazing sitcom line therapist would highly recommend last us discovered arjun rampal film daddy amazon prime must watch typical bollywood gangster film dark non commercial check anybody see family man friggin fantastic new season post show thinking congress stupid give away nationalistic tag great stuff rocket boys great watch yup season deux watched rockstar imtiaz ali first time lovedd last episode kinda meh overall liked rocket boyz completed wednesday great show harry potter vibes season good season rhys montrose twist miss love quinn season finished watching upright great series highly recommended",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Currently watching Succession. Loving Tom Greg duo. Dude i am also watching succession bingwatched 2 seasons at 3rd season now Season 2 of Rocket Boys is out. Inspiring stuff, but not sure how much is true and how much is deliberately fiction. Is it on Netflix? Well it's on Hotstar for now but will be removed after March 31st. Shrinking on Apple TV+ is an amazing sitcom and it’s about a line of a therapist. Would highly recommend the last of us discovered arjun rampal film \" daddy\" on amazon prime .. its a must watch.. its not a typical bollywood gangster film.. very dark and non commercial.. do check this out Did anybody see family man , it's friggin fantastic new season ? Post show , Was thinking of how can Congress be so stupid to give away the nationalistic tag Great stuff Rocket Boys 2 . great watch Yup season deux Watched Rockstar by imtiaz ali for first time and i lovedd it The last episode was kinda meh but overall liked it Rocket boyz 2! :) Just completed Wednesday. Great show with Harry Potter vibes. And You season 4. Good season with that Rhys Montrose twist. Miss Love Quinn from season 3. Finished watching Upright. Great series. Highly recommended"
}