{
    "id": "13vvhvu",
    "title": "Unpopular Opinion: Elevated metro bridges throughout the city look ugly and ruin the skyline of the city",
    "url": "https://www.reddit.com/r/india/comments/13vvhvu/unpopular_opinion_elevated_metro_bridges/",
    "selftext": "The elevated metro bridges look visually unappealing and also block the sunlight if it is running right above the divider of the road.  These structures tend to overpower the surrounding landscape and can be visually overwhelming, especially in areas with low-rise buildings or open spaces. For instance, in our national capital we have metro which looks like this:\n\n[Metro in Delhi](https://preview.redd.it/1ybddr0nxz2b1.png?width=800&format=png&auto=webp&v=enabled&s=fe69c950382429d70326ab6b202f6bd9d4d4a418)\n\nIt seems like that the focus is to just make it as cheap as possible and not care about design and aesthetics of elevated metro bridges, which may not harmonize with the surrounding environment.  One of the solution is to make the metro underground like they did in london. Not only does this preserve the skyline but the ugly bridges do not stick out like a sore thumb in the middle of the road.\n\n&#x200B;\n\n[a normal road in london](https://preview.redd.it/tkftja5gzz2b1.png?width=1200&format=png&auto=webp&v=enabled&s=f3093c0b63ae49c919e2bbdeb83d98b19eeaabb4)",
    "flair": "Rant / Vent",
    "score": 12,
    "num_comments": 18,
    "created_utc": 1685465517.0,
    "convurl": "https://b.thumbs.redditmedia.com/sBHR_2EJakBr56dHcZxudP5K5hRnztKCxjVlfIEWvnc.jpg",
    "comments": [
        ">One of the solution is to make the metro underground like they did in london\n\nWhen Pune Metro's construction began, I talked to a local corporator's 'side guy' about why not an underground metro, since the metro construction looks ugly, obstructs traffic and creates more problems than it solves. His plain answer was this:\n\n\"*Elevated metros look like development work. Dikhta hai, dikha sakte hai. Underground metro dikhta nahi to development kaise dikhaayenge?*\"",
        "Aur Jo dikhta hai, wohi bikta hai. \n\nPearls of wisdom from the 'side guy'.",
        "Flooding",
        "I too don’t like them but sometimes utility > aesthetics",
        "I think they compliment the skyline of the city. They add more animation to the existing skyline. It makes the city come alive. You've just added one picture that kinda looks ugly there are many other pictures that look quite beautiful as well.",
        "I think most people would consider it a good thing if they block the sunlight.",
        "Only if government architects had an eye for aesthetics. \n\nWe will continue building these structures untill human psyche becomes integral part of a city's development plan. In Marathi, there's a word \"सौंदर्यदृष्टी\" which means a sense of beauty. It is sadly absent in a lot of people responsible for city planning.",
        "How do these metro pillars having little to no aesthetic make a city come alive?",
        "Bhai side worker ka baat sun ke apna opinion mat bana.",
        "I prefer the over head metro. The underground feel more claustrophobic, and stations gets more claustrophobic if more people get in.\n\nDigging holes inside the city and reinforcement of it is much complicated and can't be done everywhere.",
        "Form vs Function my dude. I don't care if the metro looks ugly from outside or not, as long as it gets me to the destination comfortably.\n\nApparently underground is much much costlier",
        "Kinky !!!",
        "if it works it works",
        "Underground costs more and takes more time, but its definitely far better.",
        "Something is srsly wrong with Indian metros.I’ve lived in Dubai and Singapore and there elevated metro bridges merge very well with the city skyline and both are older than Chennai (which I believe is the worst) and Singapore’s older than Delhi.The main thing is elevated station design and well there’s nothing to say judge with your own eyes 1.Singapore(1985/86)\n\nhttps://preview.redd.it/q7owaqqa573b1.jpeg?width=678&format=pjpg&auto=webp&v=enabled&s=76d24bcc6c4263646f6e6a8f9371a28c7fdc35dc\n\nThis was built in the 80’s… Also the main problem for whole of India poor maintenance",
        "On the plus side people travelling in the metro can experience nice views of the city instead of staring at a dark wall in front."
    ],
    "cleaned_text": "unpopular opinion elevated metro bridges throughout city look ugly ruin skyline city elevated metro bridges look visually unappealing also block sunlight running right divider road structures tend overpower surrounding landscape visually overwhelming especially areas lowrise buildings open spaces instance national capital metro looks like metro delhihttpspreviewredditybddrnxzbpngwidthformatpngautowebpvenabledsfecdabbfbddda seems like focus make cheap possible care design aesthetics elevated metro bridges may harmonize surrounding environment one solution make metro underground like london preserve skyline ugly bridges stick like sore thumb middle road xb normal road londonhttpspreviewreddittkftjagzzbpngwidthformatpngautowebpvenabledsfcbaecebbdebdbeeaabb ",
    "cleaned_title": "unpopular opinion elevated metro bridges throughout city look ugly ruin skyline city",
    "cleaned_selftext": "elevated metro bridges look visually unappealing also block sunlight running right divider road structures tend overpower surrounding landscape visually overwhelming especially areas lowrise buildings open spaces instance national capital metro looks like metro delhihttpspreviewredditybddrnxzbpngwidthformatpngautowebpvenabledsfecdabbfbddda seems like focus make cheap possible care design aesthetics elevated metro bridges may harmonize surrounding environment one solution make metro underground like london preserve skyline ugly bridges stick like sore thumb middle road xb normal road londonhttpspreviewreddittkftjagzzbpngwidthformatpngautowebpvenabledsfcbaecebbdebdbeeaabb",
    "cleaned_comments": "one solution make metro underground like london pune metros construction began talked local corporators side guy underground metro since metro construction looks ugly obstructs traffic creates problems solves plain answer elevated metros look like development work dikhta hai dikha sakte hai underground metro dikhta nahi development kaise dikhaayenge aur jo dikhta hai wohi bikta hai pearls wisdom side guy flooding dont like sometimes utility aesthetics think compliment skyline city add animation existing skyline makes city come alive youve added one picture kinda looks ugly many pictures look quite beautiful well think people would consider good thing block sunlight government architects eye aesthetics continue building structures untill human psyche becomes integral part citys development plan marathi theres word means sense beauty sadly absent lot people responsible city planning metro pillars little aesthetic make city come alive bhai side worker ka baat sun ke apna opinion mat bana prefer head metro underground feel claustrophobic stations gets claustrophobic people get digging holes inside city reinforcement much complicated cant done everywhere form vs function dude dont care metro looks ugly outside long gets destination comfortably apparently underground much much costlier kinky works works underground costs takes time definitely far better something srsly wrong indian metrosive lived dubai singapore elevated metro bridges merge well city skyline older chennai believe worst singapores older delhithe main thing elevated station design well theres nothing say judge eyes singapore built also main problem whole india poor maintenance plus side people travelling metro experience nice views city instead staring dark wall front",
    "light_cleaned_title": "Unpopular Opinion: Elevated metro bridges throughout the city look ugly and ruin the skyline of the city",
    "light_cleaned_selftext": "The elevated metro bridges look visually unappealing and also block the sunlight if it is running right above the divider of the road. These structures tend to overpower the surrounding landscape and can be visually overwhelming, especially in areas with low-rise buildings or open spaces. For instance, in our national capital we have metro which looks like this: [Metro in Delhi](https://preview.redd.it/1ybddr0nxz2b1.png?width=800&format=png&auto=webp&v=enabled&s=fe69c950382429d70326ab6b202f6bd9d4d4a418) It seems like that the focus is to just make it as cheap as possible and not care about design and aesthetics of elevated metro bridges, which may not harmonize with the surrounding environment. One of the solution is to make the metro underground like they did in london. Not only does this preserve the skyline but the ugly bridges do not stick out like a sore thumb in the middle of the road. &#x200B; [a normal road in london](https://preview.redd.it/tkftja5gzz2b1.png?width=1200&format=png&auto=webp&v=enabled&s=f3093c0b63ae49c919e2bbdeb83d98b19eeaabb4)",
    "light_cleaned_comments": ">One of the solution is to make the metro underground like they did in london When Pune Metro's construction began, I talked to a local corporator's 'side guy' about why not an underground metro, since the metro construction looks ugly, obstructs traffic and creates more problems than it solves. His plain answer was this: \"*Elevated metros look like development work. Dikhta hai, dikha sakte hai. Underground metro dikhta nahi to development kaise dikhaayenge?*\" Aur Jo dikhta hai, wohi bikta hai. Pearls of wisdom from the 'side guy'. Flooding I too don’t like them but sometimes utility > aesthetics I think they compliment the skyline of the city. They add more animation to the existing skyline. It makes the city come alive. You've just added one picture that kinda looks ugly there are many other pictures that look quite beautiful as well. I think most people would consider it a good thing if they block the sunlight. Only if government architects had an eye for aesthetics. We will continue building these structures untill human psyche becomes integral part of a city's development plan. In Marathi, there's a word \"सौंदर्यदृष्टी\" which means a sense of beauty. It is sadly absent in a lot of people responsible for city planning. How do these metro pillars having little to no aesthetic make a city come alive? Bhai side worker ka baat sun ke apna opinion mat bana. I prefer the over head metro. The underground feel more claustrophobic, and stations gets more claustrophobic if more people get in. Digging holes inside the city and reinforcement of it is much complicated and can't be done everywhere. Form vs Function my dude. I don't care if the metro looks ugly from outside or not, as long as it gets me to the destination comfortably. Apparently underground is much much costlier Kinky !!! if it works it works Underground costs more and takes more time, but its definitely far better. Something is srsly wrong with Indian metros.I’ve lived in Dubai and Singapore and there elevated metro bridges merge very well with the city skyline and both are older than Chennai (which I believe is the worst) and Singapore’s older than Delhi.The main thing is elevated station design and well there’s nothing to say judge with your own eyes 1.Singapore(1985/86) This was built in the 80’s… Also the main problem for whole of India poor maintenance On the plus side people travelling in the metro can experience nice views of the city instead of staring at a dark wall in front."
}