{
    "id": "133gpdm",
    "title": "Why judiciary in gujarat so compromised",
    "url": "https://www.reddit.com/r/india/comments/133gpdm/why_judiciary_in_gujarat_so_compromised/",
    "selftext": " \n\nThe sesssion court judge in rahul gandhi defamation case was amit shah lawyer in sohrabuddin encounter case\n\n[https://thewire.in/law/surat-judge-hearing-rahul-gandhis-appeal-was-amit-shahs-lawyer-in-2006-fake-encounter-case](https://thewire.in/law/surat-judge-hearing-rahul-gandhis-appeal-was-amit-shahs-lawyer-in-2006-fake-encounter-case) (session court judge)\n\nThe high court judge, who will give the judgement , was maya kodnani lawyer. The same maya kodnani who led mob in 2002 riots\n\n[https://thewire.in/law/gujarat-high-court-judge-hemant-prachak-rahul-gandhi-maya-kodnani](https://thewire.in/law/gujarat-high-court-judge-hemant-prachak-rahul-gandhi-maya-kodnani) (high court judge)\n\nAlso many judges are recusing themselves from hearing rahul gandhi defamation case. I mean it is not even some murder case. But they are scared to hear his case because if they rule in his favour, their life will be destroyed like judge muralidhar.\n\n[https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-hc-judge-recuses-herself-from-hearing-rahul-gandhis-case/articleshow/99791219.cms](https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-hc-judge-recuses-herself-from-hearing-rahul-gandhis-case/articleshow/99791219.cms)\n\nI am damn sure , the high court judge , who was lawyer of maya kodnani will rule in favour of bjp. So for relief , they will have to go supreme court. But the hypocrisy is , khusbu sundar made exact same tweet and she is now in bjp. Bjp itself doesnt find anything wrong in it.\n\nMost people dont know but the judge who gave life sentence to maya kodnani , suffered a lot. Her name was jytosana yagnik. She received death threats and her family was threatened.\n\n[https://thewire.in/law/judge-who-convicted-modis-minister-in-riots-case-now-fears-for-her-family](https://thewire.in/law/judge-who-convicted-modis-minister-in-riots-case-now-fears-for-her-family)\n\nIf this is condition of opposition leader, then how can common man fight against govt. I am not supporter of any party, but this is clear misuses of institutions. According to defamation laws, only person who has been defamed can file it. So , lalit modi, nirav modi and narendra modi can only file it. And our PM has said even worse things in past. Now only supreme court will be able to give relief.\n\n[https://economictimes.indiatimes.com/news/politics-and-nation/narendra-modi-says-manmohan-singh-just-a-night-watchman/articleshow/18783607.cms?from=mdr](https://economictimes.indiatimes.com/news/politics-and-nation/narendra-modi-says-manmohan-singh-just-a-night-watchman/articleshow/18783607.cms?from=mdr)",
    "flair": "AskIndia",
    "score": 141,
    "num_comments": 25,
    "created_utc": 1682832438.0,
    "convurl": "https://external-preview.redd.it/TA-lHIp3wbaMTy3wM5cc3GhIgfeAbpMpMQxfRvUA3W4.jpg?auto=webp&v=enabled&s=56c41e9095b9ba94a653860aa8f62fb084132e9f",
    "comments": [
        "Cause it's Gujarat  from where hail thee PM and HM 🤷",
        "#The Patels",
        "It has now become common to blame the judiciary when the decisions are not the way one likes....\n\nBoth RW and LW are same in this matter. No difference.",
        "there is clear hyprocrisy of judiciary in this case. According to defamation law, only the person who has been defamed can file it. It means only those 3 people could have filed it.\n\nAlso on one hand they act as custodians of liberty, but on other hand they are recusing themseleves from hearing this defamation case. It is not some murder case.\n\nFor bjp MP and MLAs , the high courts act differently. Just 2 days back , Allahabad high court gave bail to riots convicted bjp MP kamlesh paswan, who was given 18 month sentence by trial court and u will be shocked to hear the reason.\n\n[https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-](https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427)[bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427](https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427)\n\n\"***considering the facts that...Kamlesh Paswan is a sitting MP and the judgments and orders (of the trial court)...will cast a stigma upon his political career, as such they have serious consequences\"***\n\nSo high court is worried about political career of riots convicted bjp Mp and this is why he got bail",
        "getting justice is really difficult it seems. look at those poor wrestlers for example. imagine fate of a common man if they need justice.",
        "Everyone knows why",
        "https://preview.redd.it/pzfuq1b5e0xa1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=19a5a276c961fd4ffd15203d3d3b61537e5d7642",
        "You think the government is not involved in selecting which lawyers get to be judges ? Lmao. Collegium works in tandem with the government, not against it.",
        "The judges have to go on morning walks.",
        "Same situation in all states if you challenge the ruling party. It’s just the kind of corrupted system everywhere, faces keep changing.",
        "IMO, it will be better for RaGa to remain disqualified. There won't be anymore Modi v. RaGa BS for the BJP to peddle. It's likely that the opposition coalition would select a non-INC PM candidate, and RaGa would campaign for everyone. It's a win-win, especially if what RaGa has been saying about not wanting political power is true.",
        "If you hate him so much, just say it. Don't beat around the bush.",
        "Hmm. What do you plan to do about it?",
        "It's just unnecessary lawfare that BJP is starting. Their ego is weaker than a soap bubble.\n\n[Here's a beautifully written article titled \"A disturbing example of the normalisation of lawfare.\"](https://epaper.thehindu.com/ccidist-ws/th/th_kochi/issues/30420/OPS/GGOB200CI.1+GKAB204CJ.1.html) It's written by Gautam Bhatia. You should read it if you wish to understand the nuances of this much misused judicial system in this case of Rahul Gandhi's disqualification.",
        "Who, Rahul? I neither hate him nor love him. But I want the BJP out.",
        "Read this Twitter thread too know how compromised the judiciary is, on judge in this bench is Honourable Justice MR Shah, who was the advocate of Honourable Amit Shah Ji.\n\nhttps://twitter.com/Kum_Sambhav/status/1183302261092405248?t=QknwBPtehbIp7PmE-UvjxA&s=19",
        "When I was in India I met one of the ex-mla. I asked him why I see students and other protesting in other states but not in Gujarat. Basically bjp is in power since 90s. They have make sure to appoint their people everywhere it's possible. Even for the small post, they try to appoint BJP supporters. \r\n\r\nNow, whenever someone try to protest or voice against the BJP, they get arrested on various charges and it's very hard for them to get released. He said that Gujarat congress asked them not to protest when other farmers are protesting against the farm bill. \r\n\r\nGujarat lawyer association openly declared that Gujarat lawyer s won't defend the individuals - security guard and the ticket seller - that got arrested for morbi bridge incident.",
        "There are protests in Gujarat. There was a protest for giving OBC status to Patels in Gujarat some years ago. So what you are saying is incorrect.",
        "There is nothing wrong with hating him. This is how he treated MMS. The guy is a snake. https://www.thehindu.com/news/national/manmohan-singh-asked-me-if-he-should-quit-post-rahul-gandhi-ordinance-row-montek-singh-ahluwalia/article30836587.ece/amp/",
        "He should have thought before making casteist rants if he didn’t want to be disqualified.",
        "Just gujju things.",
        "Don’t worry gujrat model is being implemented across India and all institutions. I feel post 2024, India will complete the final phase of transformation and this question will disappear forever",
        "This govt is the most absolute, autocratic & corrupt govt in the history of India",
        "Gujarat is India’s cancer.",
        "Bro  atleast I know that supreme court does not work under modi it is free can you explain why r u saying that"
    ],
    "cleaned_text": "judiciary gujarat compromised sesssion court judge rahul gandhi defamation case amit shah lawyer sohrabuddin encounter case httpsthewireinlawsuratjudgehearingrahulgandhisappealwasamitshahslawyerinfakeencountercasehttpsthewireinlawsuratjudgehearingrahulgandhisappealwasamitshahslawyerinfakeencountercase session court judge high court judge give judgement maya kodnani lawyer maya kodnani led mob riots httpsthewireinlawgujarathighcourtjudgehemantprachakrahulgandhimayakodnanihttpsthewireinlawgujarathighcourtjudgehemantprachakrahulgandhimayakodnani high court judge also many judges recusing hearing rahul gandhi defamation case mean even murder case scared hear case rule favour life destroyed like judge muralidhar httpstimesofindiaindiatimescomcityahmedabadgujarathcjudgerecusesherselffromhearingrahulgandhiscasearticleshowcmshttpstimesofindiaindiatimescomcityahmedabadgujarathcjudgerecusesherselffromhearingrahulgandhiscasearticleshowcms damn sure high court judge lawyer maya kodnani rule favour bjp relief go supreme court hypocrisy khusbu sundar made exact tweet bjp bjp doesnt find anything wrong people dont know judge gave life sentence maya kodnani suffered lot name jytosana yagnik received death threats family threatened httpsthewireinlawjudgewhoconvictedmodisministerinriotscasenowfearsforherfamilyhttpsthewireinlawjudgewhoconvictedmodisministerinriotscasenowfearsforherfamily condition opposition leader common man fight govt supporter party clear misuses institutions according defamation laws person defamed file lalit modi nirav modi narendra modi file pm said even worse things past supreme court able give relief httpseconomictimesindiatimescomnewspoliticsandnationnarendramodisaysmanmohansinghjustanightwatchmanarticleshowcmsfrommdrhttpseconomictimesindiatimescomnewspoliticsandnationnarendramodisaysmanmohansinghjustanightwatchmanarticleshowcmsfrommdr ",
    "cleaned_title": "judiciary gujarat compromised",
    "cleaned_selftext": "sesssion court judge rahul gandhi defamation case amit shah lawyer sohrabuddin encounter case httpsthewireinlawsuratjudgehearingrahulgandhisappealwasamitshahslawyerinfakeencountercasehttpsthewireinlawsuratjudgehearingrahulgandhisappealwasamitshahslawyerinfakeencountercase session court judge high court judge give judgement maya kodnani lawyer maya kodnani led mob riots httpsthewireinlawgujarathighcourtjudgehemantprachakrahulgandhimayakodnanihttpsthewireinlawgujarathighcourtjudgehemantprachakrahulgandhimayakodnani high court judge also many judges recusing hearing rahul gandhi defamation case mean even murder case scared hear case rule favour life destroyed like judge muralidhar httpstimesofindiaindiatimescomcityahmedabadgujarathcjudgerecusesherselffromhearingrahulgandhiscasearticleshowcmshttpstimesofindiaindiatimescomcityahmedabadgujarathcjudgerecusesherselffromhearingrahulgandhiscasearticleshowcms damn sure high court judge lawyer maya kodnani rule favour bjp relief go supreme court hypocrisy khusbu sundar made exact tweet bjp bjp doesnt find anything wrong people dont know judge gave life sentence maya kodnani suffered lot name jytosana yagnik received death threats family threatened httpsthewireinlawjudgewhoconvictedmodisministerinriotscasenowfearsforherfamilyhttpsthewireinlawjudgewhoconvictedmodisministerinriotscasenowfearsforherfamily condition opposition leader common man fight govt supporter party clear misuses institutions according defamation laws person defamed file lalit modi nirav modi narendra modi file pm said even worse things past supreme court able give relief httpseconomictimesindiatimescomnewspoliticsandnationnarendramodisaysmanmohansinghjustanightwatchmanarticleshowcmsfrommdrhttpseconomictimesindiatimescomnewspoliticsandnationnarendramodisaysmanmohansinghjustanightwatchmanarticleshowcmsfrommdr",
    "cleaned_comments": "cause gujarat hail thee pm hm patels become common blame judiciary decisions way one likes rw lw matter difference clear hyprocrisy judiciary case according defamation law person defamed file means people could filed also one hand act custodians liberty hand recusing themseleves hearing defamation case murder case bjp mp mlas high courts act differently days back allahabad high court gave bail riots convicted bjp mp kamlesh paswan given month sentence trial court u shocked hear reason httpswwwlivelawinhighcourtallahabadhighcourtallahabadhighcourtgrantshttpswwwlivelawinhighcourtallahabadhighcourtallahabadhighcourtgrantsbailbjpmpkamleshpaswanstaysmonthssentencetrialcourtriotscasebailbjpmpkamleshpaswanstaysmonthssentencetrialcourtriotscasehttpswwwlivelawinhighcourtallahabadhighcourtallahabadhighcourtgrantsbailbjpmpkamleshpaswanstaysmonthssentencetrialcourtriotscase considering facts thatkamlesh paswan sitting mp judgments orders trial courtwill cast stigma upon political career serious consequences high court worried political career riots convicted bjp mp got bail getting justice really difficult seems look poor wrestlers example imagine fate common man need justice everyone knows think government involved selecting lawyers get judges lmao collegium works tandem government judges go morning walks situation states challenge ruling party kind corrupted system everywhere faces keep changing imo better raga remain disqualified wont anymore modi v raga bs bjp peddle likely opposition coalition would select noninc pm candidate raga would campaign everyone winwin especially raga saying wanting political power true hate much say dont beat around bush hmm plan unnecessary lawfare bjp starting ego weaker soap bubble heres beautifully written article titled disturbing example normalisation lawfarehttpsepaperthehinducomccidistwsththkochiissuesopsggobcigkabcjhtml written gautam bhatia read wish understand nuances much misused judicial system case rahul gandhis disqualification rahul neither hate love want bjp read twitter thread know compromised judiciary judge bench honourable justice mr shah advocate honourable amit shah ji india met one exmla asked see students protesting states gujarat basically bjp power since make sure appoint people everywhere possible even small post try appoint bjp supporters whenever someone try protest voice bjp get arrested various charges hard get released said gujarat congress asked protest farmers protesting farm bill gujarat lawyer association openly declared gujarat lawyer wont defend individuals security guard ticket seller got arrested morbi bridge incident protests gujarat protest giving obc status patels gujarat years ago saying incorrect nothing wrong hating treated mms guy snake thought making casteist rants didnt want disqualified gujju things dont worry gujrat model implemented across india institutions feel post india complete final phase transformation question disappear forever govt absolute autocratic corrupt govt history india gujarat indias cancer bro atleast know supreme court work modi free explain r u saying",
    "light_cleaned_title": "Why judiciary in gujarat so compromised",
    "light_cleaned_selftext": "The sesssion court judge in rahul gandhi defamation case was amit shah lawyer in sohrabuddin encounter case [https://thewire.in/law/surat-judge-hearing-rahul-gandhis-appeal-was-amit-shahs-lawyer-in-2006-fake-encounter-case](https://thewire.in/law/surat-judge-hearing-rahul-gandhis-appeal-was-amit-shahs-lawyer-in-2006-fake-encounter-case) (session court judge) The high court judge, who will give the judgement , was maya kodnani lawyer. The same maya kodnani who led mob in 2002 riots [https://thewire.in/law/gujarat-high-court-judge-hemant-prachak-rahul-gandhi-maya-kodnani](https://thewire.in/law/gujarat-high-court-judge-hemant-prachak-rahul-gandhi-maya-kodnani) (high court judge) Also many judges are recusing themselves from hearing rahul gandhi defamation case. I mean it is not even some murder case. But they are scared to hear his case because if they rule in his favour, their life will be destroyed like judge muralidhar. [https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-hc-judge-recuses-herself-from-hearing-rahul-gandhis-case/articleshow/99791219.cms](https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-hc-judge-recuses-herself-from-hearing-rahul-gandhis-case/articleshow/99791219.cms) I am damn sure , the high court judge , who was lawyer of maya kodnani will rule in favour of bjp. So for relief , they will have to go supreme court. But the hypocrisy is , khusbu sundar made exact same tweet and she is now in bjp. Bjp itself doesnt find anything wrong in it. Most people dont know but the judge who gave life sentence to maya kodnani , suffered a lot. Her name was jytosana yagnik. She received death threats and her family was threatened. [https://thewire.in/law/judge-who-convicted-modis-minister-in-riots-case-now-fears-for-her-family](https://thewire.in/law/judge-who-convicted-modis-minister-in-riots-case-now-fears-for-her-family) If this is condition of opposition leader, then how can common man fight against govt. I am not supporter of any party, but this is clear misuses of institutions. According to defamation laws, only person who has been defamed can file it. So , lalit modi, nirav modi and narendra modi can only file it. And our PM has said even worse things in past. Now only supreme court will be able to give relief. [https://economictimes.indiatimes.com/news/politics-and-nation/narendra-modi-says-manmohan-singh-just-a-night-watchman/articleshow/18783607.cms?from=mdr](https://economictimes.indiatimes.com/news/politics-and-nation/narendra-modi-says-manmohan-singh-just-a-night-watchman/articleshow/18783607.cms?from=mdr)",
    "light_cleaned_comments": "Cause it's Gujarat from where hail thee PM and HM 🤷 #The Patels It has now become common to blame the judiciary when the decisions are not the way one likes.... Both RW and LW are same in this matter. No difference. there is clear hyprocrisy of judiciary in this case. According to defamation law, only the person who has been defamed can file it. It means only those 3 people could have filed it. Also on one hand they act as custodians of liberty, but on other hand they are recusing themseleves from hearing this defamation case. It is not some murder case. For bjp MP and MLAs , the high courts act differently. Just 2 days back , Allahabad high court gave bail to riots convicted bjp MP kamlesh paswan, who was given 18 month sentence by trial court and u will be shocked to hear the reason. [https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-](https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427)[bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427](https://www.livelaw.in/high-court/allahabad-high-court/allahabad-high-court-grants-bail-bjp-mp-kamlesh-paswan-stays-18-months-sentence-trial-court-riots-case-227427) \"***considering the facts that...Kamlesh Paswan is a sitting MP and the judgments and orders (of the trial court)...will cast a stigma upon his political career, as such they have serious consequences\"*** So high court is worried about political career of riots convicted bjp Mp and this is why he got bail getting justice is really difficult it seems. look at those poor wrestlers for example. imagine fate of a common man if they need justice. Everyone knows why You think the government is not involved in selecting which lawyers get to be judges ? Lmao. Collegium works in tandem with the government, not against it. The judges have to go on morning walks. Same situation in all states if you challenge the ruling party. It’s just the kind of corrupted system everywhere, faces keep changing. IMO, it will be better for RaGa to remain disqualified. There won't be anymore Modi v. RaGa BS for the BJP to peddle. It's likely that the opposition coalition would select a non-INC PM candidate, and RaGa would campaign for everyone. It's a win-win, especially if what RaGa has been saying about not wanting political power is true. If you hate him so much, just say it. Don't beat around the bush. Hmm. What do you plan to do about it? It's just unnecessary lawfare that BJP is starting. Their ego is weaker than a soap bubble. [Here's a beautifully written article titled \"A disturbing example of the normalisation of lawfare.\"](https://epaper.thehindu.com/ccidist-ws/th/th_kochi/issues/30420/OPS/GGOB200CI.1+GKAB204CJ.1.html) It's written by Gautam Bhatia. You should read it if you wish to understand the nuances of this much misused judicial system in this case of Rahul Gandhi's disqualification. Who, Rahul? I neither hate him nor love him. But I want the BJP out. Read this Twitter thread too know how compromised the judiciary is, on judge in this bench is Honourable Justice MR Shah, who was the advocate of Honourable Amit Shah Ji. When I was in India I met one of the ex-mla. I asked him why I see students and other protesting in other states but not in Gujarat. Basically bjp is in power since 90s. They have make sure to appoint their people everywhere it's possible. Even for the small post, they try to appoint BJP supporters. Now, whenever someone try to protest or voice against the BJP, they get arrested on various charges and it's very hard for them to get released. He said that Gujarat congress asked them not to protest when other farmers are protesting against the farm bill. Gujarat lawyer association openly declared that Gujarat lawyer s won't defend the individuals - security guard and the ticket seller - that got arrested for morbi bridge incident. There are protests in Gujarat. There was a protest for giving OBC status to Patels in Gujarat some years ago. So what you are saying is incorrect. There is nothing wrong with hating him. This is how he treated MMS. The guy is a snake. He should have thought before making casteist rants if he didn’t want to be disqualified. Just gujju things. Don’t worry gujrat model is being implemented across India and all institutions. I feel post 2024, India will complete the final phase of transformation and this question will disappear forever This govt is the most absolute, autocratic & corrupt govt in the history of India Gujarat is India’s cancer. Bro atleast I know that supreme court does not work under modi it is free can you explain why r u saying that"
}