{
    "id": "155fjko",
    "title": "r/place needs your help !!!",
    "url": "https://i.redd.it/41xszjxwh9db1.jpg",
    "selftext": "We need your help !!!! \nLet's go !!!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689920714.0,
    "convurl": "https://i.redd.it/41xszjxwh9db1.jpg",
    "comments": [
        "We need thicker borders ...\n2-3 pixel borders...",
        "why do people waste time on all this",
        "There are so many cool things to draw.\n\nAnd redditors decide to draw the country flags in r/place.",
        "How about NO, there are far frickin more important matters relating to the country. Putting our flag there is pointless when women are paraded naked and civil rights are squashed and rapists get to celebrate their birthdays on parole.",
        "lets draw a monkey beside the lizard please",
        "okay grandpa, go to sleep",
        "This is cool. Is there any place people are co-ordinating and discussing this??",
        "Any thoughts on building something else other than flag alone??",
        "Khud free ki dhaniya mirchi mangte ho aur dusro ko grandpa bolte ho 😪",
        "I'm sure there's a discord. Visit r/placeindia or r/indiaplace whatever",
        "ha lekin iska isse kya connection",
        "He's different, He's cool.",
        "Can we do an awareness on manipur",
        "Not gonna install their shitty app to partake in this shitty thing",
        "i just think hes just really sad and let it out",
        "Yesss please",
        "Let’s first build a massive flag and then use the space for ISRO and Manipur awareness",
        "I dunno honestly !\nI'm WFM and need multiple screens so can't get on discord server and actually see what's happening !\n\nI'm doing the lil that I can and raising awareness (I guess!)\n\nI do understand we have bigger issues in India but keeping all things aside, though I'm not hardcore patriotic, I don't want ppl messing with our flag after all the efforts our countrymen out into this. Finding a space as big as that is an achievement by itself.\n\nYou don't have to participate, I truly understand.\n\nBut who can help, pls do on your phones :)\n\nPixel by pixel, we shall prevail !!! 🇮🇳\n\nStill my country ❤️",
        "+ 1"
    ],
    "cleaned_text": "rplace needs help need help lets go ",
    "cleaned_title": "rplace needs help",
    "cleaned_selftext": "need help lets go",
    "cleaned_comments": "need thicker borders pixel borders people waste time many cool things draw redditors decide draw country flags rplace far frickin important matters relating country putting flag pointless women paraded naked civil rights squashed rapists get celebrate birthdays parole lets draw monkey beside lizard please okay grandpa go sleep cool place people coordinating discussing thoughts building something else flag alone khud free ki dhaniya mirchi mangte ho aur dusro ko grandpa bolte ho im sure theres discord visit rplaceindia rindiaplace whatever ha lekin iska isse kya connection hes different hes cool awareness manipur gon na install shitty app partake shitty thing think hes really sad let yesss please lets first build massive flag use space isro manipur awareness dunno honestly im wfm need multiple screens cant get discord server actually see whats happening im lil raising awareness guess understand bigger issues india keeping things aside though im hardcore patriotic dont want ppl messing flag efforts countrymen finding space big achievement dont participate truly understand help pls phones pixel pixel shall prevail still country",
    "light_cleaned_title": "r/place needs your help !!!",
    "light_cleaned_selftext": "We need your help !!!! Let's go !!!",
    "light_cleaned_comments": "We need thicker borders ... 2-3 pixel borders... why do people waste time on all this There are so many cool things to draw. And redditors decide to draw the country flags in r/place. How about NO, there are far frickin more important matters relating to the country. Putting our flag there is pointless when women are paraded naked and civil rights are squashed and rapists get to celebrate their birthdays on parole. lets draw a monkey beside the lizard please okay grandpa, go to sleep This is cool. Is there any place people are co-ordinating and discussing this?? Any thoughts on building something else other than flag alone?? Khud free ki dhaniya mirchi mangte ho aur dusro ko grandpa bolte ho 😪 I'm sure there's a discord. Visit r/placeindia or r/indiaplace whatever ha lekin iska isse kya connection He's different, He's cool. Can we do an awareness on manipur Not gonna install their shitty app to partake in this shitty thing i just think hes just really sad and let it out Yesss please Let’s first build a massive flag and then use the space for ISRO and Manipur awareness I dunno honestly ! I'm WFM and need multiple screens so can't get on discord server and actually see what's happening ! I'm doing the lil that I can and raising awareness (I guess!) I do understand we have bigger issues in India but keeping all things aside, though I'm not hardcore patriotic, I don't want ppl messing with our flag after all the efforts our countrymen out into this. Finding a space as big as that is an achievement by itself. You don't have to participate, I truly understand. But who can help, pls do on your phones :) Pixel by pixel, we shall prevail !!! 🇮🇳 Still my country ❤️ + 1"
}