{
    "id": "1dfi1lq",
    "title": "URGENT dad arrested in fake rape case update",
    "url": "https://www.reddit.com/r/india/comments/1dfi1lq/urgent_dad_arrested_in_fake_rape_case_update/",
    "selftext": "NOT A LAWYER\n\nFor non Hindi speakers: mama/mamu is my maternal uncle, my mother's brother.\n\nMami is my maternal aunt, my mom's brother's wife or my mom's sister in law.\n\nNani is my maternal grandmother, my mom's mother.\n\nNana is my maternal grandfather, my mom's father.\n\nMy dad has spent a total of 11 days now in jail for a crime he never did, I'm from Pune Maharashtra, we are receiving threats from them saying that they will not free my dad. They have a very good lawyer. The chances of him getting out are very blur. I'm so helpless right now. I have become suicidal and no I'm not doing this for attention. I might as well kill myself tomorrow itself if we don't win in tomorrow's court hearing. The opposing party knows very well how a woman can misuse the rape laws enforced in our country. Our country being our country will obviously contnue to favour women. He never messaged, called or even looked at that woman in the 4 years she was in our house. My family is broken, people are mistreating us, I'm getting bullied in class everyone calls my dad a rapist. Soon we won't have any money and my dad will be in jail for nothing, as it is he'll soon lose his job due to this. All i want from you people is help, help me on how can I make this case go viral? What can I do to gain maximum media popularity? I made a tweet on it but I'm new to Twitter i don't know anything. I don't know what to do. How to do. My dad is being mistreated like anything for something he didn't do. My family is suffering. My hopes for life are fading. I need help people 🙏\n\nPost on twitter : https://x.com/arsheenmaniyar/status/1801161083883078093?t=KEw5VjSXB5qlSXrTWZJZNA&s=19\n\nPrevious post: \nI need URGENT help. I am from Pune, Maharashtra. My mami (mom's brother's wife; mom's sister in law; maternal aunt) left my mamas house in December because he watched porn and then came back after some mutual agreement. She then left home again due to some internal issues with her husband and before leaving she got a group of 11 guys to beat my mama (mom's brother; maternal uncle) up. It's been 6 months and my mama filed for 2nd divorce this month (Muslim law). Throughout these 6 months mamis father threatened us to take mami back but mama doesn't want her anymore and made it very clear. They have been threatening to kill us and threatening to file a fake rape case against my dad so my mom's life is ruined. Today Nani (maternal grandma; mom's mother) and mama were taken to the police said and my mother was called too, they lied saying we want a statement and put my dad in jail along with my mama. My dad is booked under section 376 and we are all hopeless because he's the only source of money and my education depends on him. The case was systematically filed of a year before so theres no evidence.l need URGENT help and solutions on this because he'll lose his job. I beg you to give me your quickest most practical best solutions.\n",
    "flair": "Law & Courts",
    "score": 375,
    "num_comments": 63,
    "created_utc": 1718337863.0,
    "convurl": "https://external-preview.redd.it/ZOKU71XK8xrqpj_3nzTxVz_fMGgIB3EUSq4Z6JzE730.jpg?auto=webp&s=51301cc054dbdfebd1929edf82ca0208dffaf155",
    "comments": [
        "I don't think this is the right place to ask. Please ask r/legaladviceIndia.\nIt's a sad fact in India but it's obvious that the police are looking for bribes.",
        "I'm sorry, given the laws regarding the matter the onus is on accused to prove his innocence. \nMy advice would be to inspect the FIR and try to come up with evidences that will contradict their story. \nAlso post this in r/Legaladviceindia, they are better equipped to help you.",
        "Sad to hear this and helpless to see Indian laws being unfairly misused. What people are nowadays doing is that they are putting reverse charges (tit for tat) on the people who put these charges on them, i.e., putting charges that the other party came to their house and tried to force themselves on a female member of your house. And then using that FIR to force the other party to withdraw their charge",
        "Our lawyer has adviced us to not for the time being.",
        "Why did you guys not record the video or voice when they were threatening to file fake rape case? If you kissed the first time why not record every interaction from there onwards? Also its probable that she will take the case back if your mama takes her back, so maybe tty to convince your mama for now and make other plans afterwards.",
        "You are just falling for wrong information. He can't be convicted if there's no proof. If it's a false case, he'll surely be free",
        "They have posted it their but i guess since the situation is so dire they are just trying to get max reach and get help from somewhere.",
        "Ping me can help",
        "it now lies on the man to prove that he is not guilty, not the other way round. So if there is a lack of evidence to prove otherwise, chances are the man will be held guilty. NAL",
        "Not a lawyer but read the FIR and try to find contradictions on the facts reports such as event happened on tuesday but he was not home on tuesday so it's impossible and the claims are wrong look inyo filing for perjury and defamation along with it",
        "For a case to be filed you need basic proof. Although I sympathize, something is missing from your narrative or you don't know. So clear that out.\n\nIf there was no proof your lawyer could prove no proof against your dad, you dad cannot be in jail for 48hrs . Ask for both of their bails, especially your dad's.If it was systematically filed then a systematic proof was collected,so try to disprove each proof.\n\nIf you family members didn't commit any crime, it will be fairly impossible to convict them don't lose hope and support your family. Think logically about case, google each part of the case,think about helping the case instead of emotionally investing in it.",
        "I'm sorry, OP. Please connect with Sahodar. https://x.com/sahodarindia?lang=en\nJoin their whatsapp group to get help from the community.",
        "This is really terrible. Really hate our country for its biased laws. I wish I could help. I’ll share with an influencer with good following and see what they say.",
        "In a rape case, medical reports play an important role. One can't just go around saying xyz has raped them with no evidence",
        "No he won't be held guilty but he has to suffer for years unless he's able to prove his innocence. I've seen multiple such cases and accused got bail after 3-4 years. Depends on money too if you have money you can get out within few months too.",
        "Did your lawyer applied for bail ? When is the next hearing ?\n\n\nIn your content I couldn't find what your father did to get ipc 376 filling against him. \n\n\nYou are too young to understand how system works. Keep trust justice will be delivered. First focus on bail.",
        "that's the thing, the time and date of rape is not specified. the fir is very weak. the said rape is of Jan 2023, one yr 6 months ago. it's a weak case. thank u for helping tho",
        "The case in hand is a year old, there is def no medical evidence to play here. It all lies on the defense now to prove that the narrative is false and to show facts to claim it.",
        "Its equivalent of being guilty. He wont have a defined jail term, but usually the jail term already exceeds the actual sentence because the case is never closed. You get bail and the social justice takes you over.\n\nAny man who has ever been a victim of false rape case has never been acquitted in the true sense",
        "Contact Deepika Bharadwaj. She is an activist, lawyer and has experience with such cases. You can connect with her through twitter. Her id is @DeepikaBhardwaj",
        "I meant something else, edited my comment check it\n\n>It all lies on the defense now to prove that the narrative is false and to show facts to claim it.\n\nThere is no medical evidence, audio/video claiming that something off has happened between them. I don't think the case is strong.",
        "Nope you still arent aware of the reality. A rape case doesn’t require arrest warrant, so police CAN and WILL have to arrest the accused. \n\nThey also require to get the accused in presence of court the very next day. And then begins the dance of our law lady.",
        "Lawyer here. Don’t lose hope. It will take some time. Rape is a serious offence and it is not easy to get bail. If bail is denied in the Trail court go to the High Court. Just understand that merely because he’s been accused of an offence doesn’t make him guilty. I can understand the situation you are in and it is unfortunate. But you will have to be strong enough to deal with this.",
        "Please campaign heavily in social media. This is a huge issue which everyone is vexed up with. So I am sure you will get a lot of help. Just keep campaigning and hope for some help. Usually investigating officer has right to give bail in such cases, if they believe it's a fake case.",
        "She surely seems like someone who can genuinely make a difference in such cases.",
        "I'm sorry this happened to you and your family. Law and order is a joke in this country.",
        "Hmm I agree with that.",
        "Write about your entire case on your Facebook and share it widely \n\n post pictures of the tormentors also \n\nTag different Indian coats and lawyers (if you know any)\n\nDon't lock your Facebook profile",
        "What if it negatively impacts our case since I'm revealing their identity?",
        "Then you consult a lawyer \n\nBut you can write about your case without revealing the other parties names and pictures \n\nThen make your post viral.\n\nAs I already said,tag the different Indian courts and lawyers (if you know any)\n\nSome lawyer or media will surely contact you",
        "I still don’t know which woman filed the rape case against your dad. Is it your Mami?",
        "Yes.",
        "The problem here is your mama. He should be able to handle his own shit, why is he letting your dad suffer?",
        "File a SC/ST case against her, they might fear and take it back.",
        "He cannot do anything anymore. It's not in his control anymore. Even we know the blame should be on him because it's about his wife. But it is what it is rn.",
        "He can still offer to take her back, if they drop all changes against your father.",
        "Who would want to welcome a woman who puts her own husband in jail? Who puts your brother in law in jail? \n\nWe requested him too, but if we try to do that we have a risk of our case getting impacted as they might use this against us saying that they want to hide rape by welcoming our daughter back",
        "How much is this going to cost for OP if they move to high court?",
        ">  I might as well kill myself tomorrow itself if we don't win in tomorrow's court hearing.\n\nDude, how will something like that help anyone? Try to calm yourself and if possible become a rock for those around you because they may need it even more than you currently.\n\nIt's not easy but try to mentally approach this as \"*I'll show them attitude*\", when the world is against you and you decide, No Fuck You World I'll defy you and Win. It's a mental trick even if it's not objectively real, but that doesn't matter, what matters is that it helps one calm down & focus, for the time being.\n\nBe calm, tough it out and you'll come out of this stronger. Easier said (esp. online from us here) than done I know but do try.",
        "I get all that you're trying to say but what do you expect from a 16 yr old. Again today they bribed someone in court to hide our case papers.. where is justice",
        "ßaaa⁰0i",
        "Sorry to inform you but in real life things are different.I have heard about cases were 4 to 15 months were spent in false rape cases.",
        "Actually it will weaken their case.\nI’m only suggesting ways you can quickly get your father back.",
        "Looks like a low/medium-low effort scam since OP is blasting UPI QR code everywhere. I'd advise everyone to hold on until OP shares more evidence.",
        "Dmed you the FIR copy.",
        "But hey ,don't kill urself ,become a serial killer who kills such people(I'm saying this half jokingly)\n\nOnly use this option if nothing else works out. Imo killing a bad person better than killing oneself",
        "It is a weak case, they have no evidence. It's is their folly that they have back dated the case. In which case there will be no medical evidence to prove the rape. Don't worry, it will take time but the case will get resolved. No need to listen to anyone who says otherwise. Your dad is innocent in your eyes and that's all that matters. \n\nA strong lawyer is not going to be a plus point. Speaking from experience you can have kapil sibbal on your team and chidambaram (god rest his soul) and still not have the matter work in your favor. (Yes, we literally had these two on our case and yet nothing). Don't lose hope, don't harm yourself. This too shall pass!!",
        "+1, Deepika Narayan Bharadwaj deals with such kind of cases. you may contact her. \nAlso in rape cases the statement of victim coupled with forensic evidences are the most important ones . you can file a bail before the court.",
        "Doesn't India have an alarmingly high false rape accusation rate?",
        "All these comes after case is filed... Rape allegations are taken strictly and arrest is made if you are a normal citizen",
        "u/St_Broseph",
        "Hey OP, don't lose hope. Remember legal matters take time to settle. It's time to show perseverance.Try to connect with some local social worker.\n\nu/St_Broseph Could you please help OP if you have any contacts in Pune.",
        "Please contact Vinita Deshmukh or Asim Sarode",
        "It isn't preventing any more fake cases from being registered",
        "Thank you. Keep us in your prayers."
    ],
    "cleaned_text": "urgent dad arrested fake rape case update lawyer non hindi speakers mamamamu maternal uncle mothers brother mami maternal aunt moms brothers wife moms sister law nani maternal grandmother moms mother nana maternal grandfather moms father dad spent total days jail crime never im pune maharashtra receiving threats saying free dad good lawyer chances getting blur im helpless right become suicidal im attention might well kill tomorrow dont win tomorrows court hearing opposing party knows well woman misuse rape laws enforced country country country obviously contnue favour women never messaged called even looked woman years house family broken people mistreating us im getting bullied class everyone calls dad rapist soon wont money dad jail nothing hell soon lose job due want people help help make case go viral gain maximum media popularity made tweet im new twitter dont know anything dont know dad mistreated like anything something didnt family suffering hopes life fading need help people post twitter previous post need urgent help pune maharashtra mami moms brothers wife moms sister law maternal aunt left mamas house december watched porn came back mutual agreement left home due internal issues husband leaving got group guys beat mama moms brother maternal uncle months mama filed nd divorce month muslim law throughout months mamis father threatened us take mami back mama doesnt want anymore made clear threatening kill us threatening file fake rape case dad moms life ruined today nani maternal grandma moms mother mama taken police said mother called lied saying want statement put dad jail along mama dad booked section hopeless hes source money education depends case systematically filed year theres evidencel need urgent help solutions hell lose job beg give quickest practical best solutions ",
    "cleaned_title": "urgent dad arrested fake rape case update",
    "cleaned_selftext": "lawyer non hindi speakers mamamamu maternal uncle mothers brother mami maternal aunt moms brothers wife moms sister law nani maternal grandmother moms mother nana maternal grandfather moms father dad spent total days jail crime never im pune maharashtra receiving threats saying free dad good lawyer chances getting blur im helpless right become suicidal im attention might well kill tomorrow dont win tomorrows court hearing opposing party knows well woman misuse rape laws enforced country country country obviously contnue favour women never messaged called even looked woman years house family broken people mistreating us im getting bullied class everyone calls dad rapist soon wont money dad jail nothing hell soon lose job due want people help help make case go viral gain maximum media popularity made tweet im new twitter dont know anything dont know dad mistreated like anything something didnt family suffering hopes life fading need help people post twitter previous post need urgent help pune maharashtra mami moms brothers wife moms sister law maternal aunt left mamas house december watched porn came back mutual agreement left home due internal issues husband leaving got group guys beat mama moms brother maternal uncle months mama filed nd divorce month muslim law throughout months mamis father threatened us take mami back mama doesnt want anymore made clear threatening kill us threatening file fake rape case dad moms life ruined today nani maternal grandma moms mother mama taken police said mother called lied saying want statement put dad jail along mama dad booked section hopeless hes source money education depends case systematically filed year theres evidencel need urgent help solutions hell lose job beg give quickest practical best solutions",
    "cleaned_comments": "dont think right place ask please ask rlegaladviceindia sad fact india obvious police looking bribes im sorry given laws regarding matter onus accused prove innocence advice would inspect fir try come evidences contradict story also post rlegaladviceindia better equipped help sad hear helpless see indian laws unfairly misused people nowadays putting reverse charges tit tat people put charges ie putting charges party came house tried force female member house using fir force party withdraw charge lawyer adviced us time guys record video voice threatening file fake rape case kissed first time record every interaction onwards also probable take case back mama takes back maybe tty convince mama make plans afterwards falling wrong information cant convicted theres proof false case hell surely free posted guess since situation dire trying get max reach get help somewhere ping help lies man prove guilty way round lack evidence prove otherwise chances man held guilty nal lawyer read fir try find contradictions facts reports event happened tuesday home tuesday impossible claims wrong look inyo filing perjury defamation along case filed need basic proof although sympathize something missing narrative dont know clear proof lawyer could prove proof dad dad jail hrs ask bails especially dadsif systematically filed systematic proof collectedso try disprove proof family members didnt commit crime fairly impossible convict dont lose hope support family think logically case google part casethink helping case instead emotionally investing im sorry op please connect sahodar join whatsapp group get help community really terrible really hate country biased laws wish could help ill share influencer good following see say rape case medical reports play important role one cant go around saying xyz raped evidence wont held guilty suffer years unless hes able prove innocence ive seen multiple cases accused got bail years depends money money get within months lawyer applied bail next hearing content couldnt find father get ipc filling young understand system works keep trust justice delivered first focus bail thats thing time date rape specified fir weak said rape jan one yr months ago weak case thank u helping tho case hand year old def medical evidence play lies defense prove narrative false show facts claim equivalent guilty wont defined jail term usually jail term already exceeds actual sentence case never closed get bail social justice takes man ever victim false rape case never acquitted true sense contact deepika bharadwaj activist lawyer experience cases connect twitter id deepikabhardwaj meant something else edited comment check lies defense prove narrative false show facts claim medical evidence audiovideo claiming something happened dont think case strong nope still arent aware reality rape case doesnt require arrest warrant police arrest accused also require get accused presence court next day begins dance law lady lawyer dont lose hope take time rape serious offence easy get bail bail denied trail court go high court understand merely hes accused offence doesnt make guilty understand situation unfortunate strong enough deal please campaign heavily social media huge issue everyone vexed sure get lot help keep campaigning hope help usually investigating officer right give bail cases believe fake case surely seems like someone genuinely make difference cases im sorry happened family law order joke country hmm agree write entire case facebook share widely post pictures tormentors also tag different indian coats lawyers know dont lock facebook profile negatively impacts case since im revealing identity consult lawyer write case without revealing parties names pictures make post viral already saidtag different indian courts lawyers know lawyer media surely contact still dont know woman filed rape case dad mami yes problem mama able handle shit letting dad suffer file scst case might fear take back anything anymore control anymore even know blame wife rn still offer take back drop changes father would want welcome woman puts husband jail puts brother law jail requested try risk case getting impacted might use us saying want hide rape welcoming daughter back much going cost op move high court might well kill tomorrow dont win tomorrows court hearing dude something like help anyone try calm possible become rock around may need even currently easy try mentally approach ill show attitude world decide fuck world ill defy win mental trick even objectively real doesnt matter matters helps one calm focus time calm tough youll come stronger easier said esp online us done know try get youre trying say expect yr old today bribed someone court hide case papers justice aaai sorry inform real life things differenti heard cases months spent false rape cases actually weaken case im suggesting ways quickly get father back looks like lowmediumlow effort scam since op blasting upi qr code everywhere id advise everyone hold op shares evidence dmed fir copy hey dont kill urself become serial killer kills peopleim saying half jokingly use option nothing else works imo killing bad person better killing oneself weak case evidence folly back dated case case medical evidence prove rape dont worry take time case get resolved need listen anyone says otherwise dad innocent eyes thats matters strong lawyer going plus point speaking experience kapil sibbal team chidambaram god rest soul still matter work favor yes literally two case yet nothing dont lose hope dont harm shall pass deepika narayan bharadwaj deals kind cases may contact also rape cases statement victim coupled forensic evidences important ones file bail court doesnt india alarmingly high false rape accusation rate comes case filed rape allegations taken strictly arrest made normal citizen ustbroseph hey op dont lose hope remember legal matters take time settle time show perseverancetry connect local social worker ustbroseph could please help op contacts pune please contact vinita deshmukh asim sarode isnt preventing fake cases registered thank keep us prayers",
    "light_cleaned_title": "URGENT dad arrested in fake rape case update",
    "light_cleaned_selftext": "NOT A LAWYER For non Hindi speakers: mama/mamu is my maternal uncle, my mother's brother. Mami is my maternal aunt, my mom's brother's wife or my mom's sister in law. Nani is my maternal grandmother, my mom's mother. Nana is my maternal grandfather, my mom's father. My dad has spent a total of 11 days now in jail for a crime he never did, I'm from Pune Maharashtra, we are receiving threats from them saying that they will not free my dad. They have a very good lawyer. The chances of him getting out are very blur. I'm so helpless right now. I have become suicidal and no I'm not doing this for attention. I might as well kill myself tomorrow itself if we don't win in tomorrow's court hearing. The opposing party knows very well how a woman can misuse the rape laws enforced in our country. Our country being our country will obviously contnue to favour women. He never messaged, called or even looked at that woman in the 4 years she was in our house. My family is broken, people are mistreating us, I'm getting bullied in class everyone calls my dad a rapist. Soon we won't have any money and my dad will be in jail for nothing, as it is he'll soon lose his job due to this. All i want from you people is help, help me on how can I make this case go viral? What can I do to gain maximum media popularity? I made a tweet on it but I'm new to Twitter i don't know anything. I don't know what to do. How to do. My dad is being mistreated like anything for something he didn't do. My family is suffering. My hopes for life are fading. I need help people 🙏 Post on twitter : Previous post: I need URGENT help. I am from Pune, Maharashtra. My mami (mom's brother's wife; mom's sister in law; maternal aunt) left my mamas house in December because he watched porn and then came back after some mutual agreement. She then left home again due to some internal issues with her husband and before leaving she got a group of 11 guys to beat my mama (mom's brother; maternal uncle) up. It's been 6 months and my mama filed for 2nd divorce this month (Muslim law). Throughout these 6 months mamis father threatened us to take mami back but mama doesn't want her anymore and made it very clear. They have been threatening to kill us and threatening to file a fake rape case against my dad so my mom's life is ruined. Today Nani (maternal grandma; mom's mother) and mama were taken to the police said and my mother was called too, they lied saying we want a statement and put my dad in jail along with my mama. My dad is booked under section 376 and we are all hopeless because he's the only source of money and my education depends on him. The case was systematically filed of a year before so theres no evidence.l need URGENT help and solutions on this because he'll lose his job. I beg you to give me your quickest most practical best solutions.",
    "light_cleaned_comments": "I don't think this is the right place to ask. Please ask r/legaladviceIndia. It's a sad fact in India but it's obvious that the police are looking for bribes. I'm sorry, given the laws regarding the matter the onus is on accused to prove his innocence. My advice would be to inspect the FIR and try to come up with evidences that will contradict their story. Also post this in r/Legaladviceindia, they are better equipped to help you. Sad to hear this and helpless to see Indian laws being unfairly misused. What people are nowadays doing is that they are putting reverse charges (tit for tat) on the people who put these charges on them, i.e., putting charges that the other party came to their house and tried to force themselves on a female member of your house. And then using that FIR to force the other party to withdraw their charge Our lawyer has adviced us to not for the time being. Why did you guys not record the video or voice when they were threatening to file fake rape case? If you kissed the first time why not record every interaction from there onwards? Also its probable that she will take the case back if your mama takes her back, so maybe tty to convince your mama for now and make other plans afterwards. You are just falling for wrong information. He can't be convicted if there's no proof. If it's a false case, he'll surely be free They have posted it their but i guess since the situation is so dire they are just trying to get max reach and get help from somewhere. Ping me can help it now lies on the man to prove that he is not guilty, not the other way round. So if there is a lack of evidence to prove otherwise, chances are the man will be held guilty. NAL Not a lawyer but read the FIR and try to find contradictions on the facts reports such as event happened on tuesday but he was not home on tuesday so it's impossible and the claims are wrong look inyo filing for perjury and defamation along with it For a case to be filed you need basic proof. Although I sympathize, something is missing from your narrative or you don't know. So clear that out. If there was no proof your lawyer could prove no proof against your dad, you dad cannot be in jail for 48hrs . Ask for both of their bails, especially your dad's.If it was systematically filed then a systematic proof was collected,so try to disprove each proof. If you family members didn't commit any crime, it will be fairly impossible to convict them don't lose hope and support your family. Think logically about case, google each part of the case,think about helping the case instead of emotionally investing in it. I'm sorry, OP. Please connect with Sahodar. Join their whatsapp group to get help from the community. This is really terrible. Really hate our country for its biased laws. I wish I could help. I’ll share with an influencer with good following and see what they say. In a rape case, medical reports play an important role. One can't just go around saying xyz has raped them with no evidence No he won't be held guilty but he has to suffer for years unless he's able to prove his innocence. I've seen multiple such cases and accused got bail after 3-4 years. Depends on money too if you have money you can get out within few months too. Did your lawyer applied for bail ? When is the next hearing ? In your content I couldn't find what your father did to get ipc 376 filling against him. You are too young to understand how system works. Keep trust justice will be delivered. First focus on bail. that's the thing, the time and date of rape is not specified. the fir is very weak. the said rape is of Jan 2023, one yr 6 months ago. it's a weak case. thank u for helping tho The case in hand is a year old, there is def no medical evidence to play here. It all lies on the defense now to prove that the narrative is false and to show facts to claim it. Its equivalent of being guilty. He wont have a defined jail term, but usually the jail term already exceeds the actual sentence because the case is never closed. You get bail and the social justice takes you over. Any man who has ever been a victim of false rape case has never been acquitted in the true sense Contact Deepika Bharadwaj. She is an activist, lawyer and has experience with such cases. You can connect with her through twitter. Her id is @DeepikaBhardwaj I meant something else, edited my comment check it >It all lies on the defense now to prove that the narrative is false and to show facts to claim it. There is no medical evidence, audio/video claiming that something off has happened between them. I don't think the case is strong. Nope you still arent aware of the reality. A rape case doesn’t require arrest warrant, so police CAN and WILL have to arrest the accused. They also require to get the accused in presence of court the very next day. And then begins the dance of our law lady. Lawyer here. Don’t lose hope. It will take some time. Rape is a serious offence and it is not easy to get bail. If bail is denied in the Trail court go to the High Court. Just understand that merely because he’s been accused of an offence doesn’t make him guilty. I can understand the situation you are in and it is unfortunate. But you will have to be strong enough to deal with this. Please campaign heavily in social media. This is a huge issue which everyone is vexed up with. So I am sure you will get a lot of help. Just keep campaigning and hope for some help. Usually investigating officer has right to give bail in such cases, if they believe it's a fake case. She surely seems like someone who can genuinely make a difference in such cases. I'm sorry this happened to you and your family. Law and order is a joke in this country. Hmm I agree with that. Write about your entire case on your Facebook and share it widely post pictures of the tormentors also Tag different Indian coats and lawyers (if you know any) Don't lock your Facebook profile What if it negatively impacts our case since I'm revealing their identity? Then you consult a lawyer But you can write about your case without revealing the other parties names and pictures Then make your post viral. As I already said,tag the different Indian courts and lawyers (if you know any) Some lawyer or media will surely contact you I still don’t know which woman filed the rape case against your dad. Is it your Mami? Yes. The problem here is your mama. He should be able to handle his own shit, why is he letting your dad suffer? File a SC/ST case against her, they might fear and take it back. He cannot do anything anymore. It's not in his control anymore. Even we know the blame should be on him because it's about his wife. But it is what it is rn. He can still offer to take her back, if they drop all changes against your father. Who would want to welcome a woman who puts her own husband in jail? Who puts your brother in law in jail? We requested him too, but if we try to do that we have a risk of our case getting impacted as they might use this against us saying that they want to hide rape by welcoming our daughter back How much is this going to cost for OP if they move to high court? > I might as well kill myself tomorrow itself if we don't win in tomorrow's court hearing. Dude, how will something like that help anyone? Try to calm yourself and if possible become a rock for those around you because they may need it even more than you currently. It's not easy but try to mentally approach this as \"*I'll show them attitude*\", when the world is against you and you decide, No Fuck You World I'll defy you and Win. It's a mental trick even if it's not objectively real, but that doesn't matter, what matters is that it helps one calm down & focus, for the time being. Be calm, tough it out and you'll come out of this stronger. Easier said (esp. online from us here) than done I know but do try. I get all that you're trying to say but what do you expect from a 16 yr old. Again today they bribed someone in court to hide our case papers.. where is justice ßaaa⁰0i Sorry to inform you but in real life things are different.I have heard about cases were 4 to 15 months were spent in false rape cases. Actually it will weaken their case. I’m only suggesting ways you can quickly get your father back. Looks like a low/medium-low effort scam since OP is blasting UPI QR code everywhere. I'd advise everyone to hold on until OP shares more evidence. Dmed you the FIR copy. But hey ,don't kill urself ,become a serial killer who kills such people(I'm saying this half jokingly) Only use this option if nothing else works out. Imo killing a bad person better than killing oneself It is a weak case, they have no evidence. It's is their folly that they have back dated the case. In which case there will be no medical evidence to prove the rape. Don't worry, it will take time but the case will get resolved. No need to listen to anyone who says otherwise. Your dad is innocent in your eyes and that's all that matters. A strong lawyer is not going to be a plus point. Speaking from experience you can have kapil sibbal on your team and chidambaram (god rest his soul) and still not have the matter work in your favor. (Yes, we literally had these two on our case and yet nothing). Don't lose hope, don't harm yourself. This too shall pass!! +1, Deepika Narayan Bharadwaj deals with such kind of cases. you may contact her. Also in rape cases the statement of victim coupled with forensic evidences are the most important ones . you can file a bail before the court. Doesn't India have an alarmingly high false rape accusation rate? All these comes after case is filed... Rape allegations are taken strictly and arrest is made if you are a normal citizen u/St_Broseph Hey OP, don't lose hope. Remember legal matters take time to settle. It's time to show perseverance.Try to connect with some local social worker. u/St_Broseph Could you please help OP if you have any contacts in Pune. Please contact Vinita Deshmukh or Asim Sarode It isn't preventing any more fake cases from being registered Thank you. Keep us in your prayers."
}