{
    "id": "1fe2nf2",
    "title": "PSA: Many fake reviews in Amazon.in - Carbamide Forte's products",
    "url": "https://www.reddit.com/r/india/comments/1fe2nf2/psa_many_fake_reviews_in_amazonin_carbamide/",
    "selftext": "I know there are many fake reviews in amazon already, but this needs to be known because this concerns health directly.  \n  \nHas anyone used Carbamide Forte's products?\n\nI've observed two product (Vit D3 + B2 gummys and their multivitamin product) to have so many AI-generated/fake reviews, please check the attached screenshots for examples:\n\n[GPT Zero's opinion](https://preview.redd.it/hwelhmrr64od1.png?width=1737&format=png&auto=webp&s=51ebec268c42e044ece0aa9d5791115fb1ef7539)\n\n[GPT Zero's opinion](https://preview.redd.it/t2uynuor64od1.png?width=1788&format=png&auto=webp&s=31e7503f053d5c28cc85a44732f6a3f6c81b4979)\n\n[These reviews look fake af. Some of them even have images. Look at how they bland and repetitive they are.](https://preview.redd.it/cvoblyor64od1.png?width=1452&format=png&auto=webp&s=44b9654bc805c245ffe3cbca43d125fc071a03cf)\n\nhttps://preview.redd.it/twi2uvor64od1.png?width=1482&format=png&auto=webp&s=dd882412e0dfba503b0cd3581c552cbd71f9186a\n\nI could attached more pictures but it'll get too lengthy.  \n  \nI personally have tried their multivitamin, I didn't get any major (positive or negative) effect from it. But that is fine by me, at most that is just money wasted. I'm just worried (if they are behind this) if they follow poor manufacturing practices (and wouldn't care about fixing it if their business practices are this scummy). Did anyone had any negative effects from using their products?\n\n>! I hope I don't get assassinated xD!<",
    "flair": "Rant / Vent",
    "score": 19,
    "num_comments": 11,
    "created_utc": 1726032255.0,
    "convurl": "https://b.thumbs.redditmedia.com/WgvzQXjjc4-s-kY2j05U6wvSW_Qwx49LSnmhun-60Dw.jpg",
    "comments": [
        "Had used their whey  isolate  protein shake nd L arginine sometime back  ..tasted terrible but could see the results  ..",
        "Most reviews are now bought out and generated via AI. Look for spectrum of reviews varying over all ratings",
        "It's common knowledge at this point reviews are just ad spaces, every company has to do it to stay competitive. True test is to search if someone has gotten lab test results (look out for fake influencers) of the product you're gonna buy (or at least one other product of that company), or get one done yourself (₹5-30k) at least once (test for %age of the main ingredient, and presence lead etc contaminants). \n\n[Carbide, it seem, is not standing up to the test.](https://youtu.be/QS9bTPXcj0Q?t=236)",
        "This test would be difficult/too expensive for multivitamins as you have many main ingredients. Thanks for the info, tho",
        "You can check trustified on youtube if you want any scientific reviews of nutraceutical products. They get all the products lab tested and share the reports. \n\nFunnily enough, Carbamide Forte sued them because in its lab report they found out it literally does not have most of the vitamins it mentioned.",
        "If a review is more than a few lines and has perfect spelling, it is ai generated.",
        "I was using carbamide forte multivitamins . Are they not good ?",
        "not for me. I am yet to check the other 3rd party testers like trustified on YT, as suggested by the other comments. One of the comments linked to a video of their fish oil product which is substandard according to said youtuber",
        "Ok . Let us know if find any good product",
        "I used one of their supplements, ended up with headaches from day 1. Threw it away and swear to never buying anything from them.\nSwisse is what I'm sticking to these days for supplements.",
        "Nhi kiya iska review",
        "carbamide forte omega 3 fish oil failed trustified lab tests.\n\n[https://www.trustified.in/passandfail/carbamide-forte](https://www.trustified.in/passandfail/carbamide-forte)\n\n  \nthis leaves a bitter taste for me for the brand",
        "Hi there!\nI used their fish oil! No negative / positive! I have not been consistent with it! \n\nI got their collagen powder & pills ( 2 different products)\n\nI am highly disappointed and shocked!\n\n1. Collagen powder!!\nHorrible taste & felt like I was drinking a sweet shampoo! Unimaginable amount of artificial sweetener! Immediately I got throat infection.. bad throat and cough for 3 days! I took a break from it! And tried again! Same thing happened\n\n\n2. Pills\nI thought may be the sweetener in powder was reacting with my throat and had hope with these pills!\n\nWith in ten min of taking the pill, I got skin irritation within 10 min!Whole body started itching! And very bad head aches and nausea and joint pains &  fatigue!!! Urine smelling like sweetener! And alll these last for 6 hours! \n\nI took this pill for 3 times and same symptoms all the time!\n \nI am not usually sensitive person at all!! I never get head aches, allergies, throat infections! Usually happens once in many years!! \n\nWtfffff I never expect these supplements to work! What on the earth they are mixing which makes an immediate reaction in 10 min!!?!!!!!!\n\nOmg this scared the Ffff out of me! \nRight now I took this pill 30 min back !my face & body itching very badly!  Horrible head aches!\n\nDid anyone else felt the same??",
        "Jesus Christ. Have you seen a doctor? This sounds like a severe allergic reaction to me. In any case discontinue using those specific products.",
        "Hai luckily all the three times I took it at 8pm so I was normal by the time I woke next morning! But  honestly I still wonder why is it so difficult for the companies to just mix some basic ingredients instead of mixing horrible things🤯🤯",
        "I'm not saying that they are genuine, but it seems like now they have a \"GMP certified\" label on their product, which should mean that their supplement is third party tested. Did this certification happen after Trustified published their video on Carbamide Forte?",
        "This .... This company is scam ",
        "Yes, I believe so",
        "Thanks all for saving my 3k worth of cart items that I just discarded now!",
        "How about Nutrabay?",
        "Has he really done the review? If yes then what's the conclusion of the review?",
        "Hello There,   \nI had same concern, i am looking for fish oil capsules, and find Cardamide Forte fish oil and usually we go with reviews, but i really felt many of those reviews are not feel genuine, so started doing some research which lead me to your post.   \nThanks for this post.",
        "DON'T BUY A SINGLE PRODUCT OF THIS BRAND SLOW POISON HAIN. THEY DO ALL SORT OF UNETHICAL PRACTICES.",
        "Check out https://www.trustified.in for lab tests",
        "Yes, someone mentioned it. Still a bit sceptical about them because muscleblaze advertises it now \"Tested with Trustified\".",
        "Does anyone know any better alternatives?\nAlso thanks OP for bringing this thread 🧵",
        "Imported thorne multivitamins from the US. Was recommended all over on reddit. Tried it, gave me migraines, possibly because of the high B12 (12,500% RDA). Never had migraines before.\n\nYou could try it because it was the only well rated multivitamin I've come across.",
        "Fish oil is omega 3 fatty acids tho and they can eat up thermocol , i don't see any use of the thermocol test , if you witness what your stomach acid can do to a thermocol you will be shocked"
    ],
    "cleaned_text": "psa many fake reviews amazonin carbamide fortes products know many fake reviews amazon already needs known concerns health directly anyone used carbamide fortes products ive observed two product vit b gummys multivitamin product many aigeneratedfake reviews please check attached screenshots examples gpt zeros opinionhttpspreviewreddithwelhmrrodpngwidthformatpngautowebpsebecceeceaadfbef gpt zeros opinionhttpspreviewreddittuynuorodpngwidthformatpngautowebpsefdcccafafcb reviews look fake af even images look bland repetitive arehttpspreviewredditcvoblyorodpngwidthformatpngautowebpsbbccffecbcadfcacf could attached pictures itll get lengthy personally tried multivitamin didnt get major positive negative effect fine money wasted im worried behind follow poor manufacturing practices wouldnt care fixing business practices scummy anyone negative effects using products hope dont get assassinated xd ",
    "cleaned_title": "psa many fake reviews amazonin carbamide fortes products",
    "cleaned_selftext": "know many fake reviews amazon already needs known concerns health directly anyone used carbamide fortes products ive observed two product vit b gummys multivitamin product many aigeneratedfake reviews please check attached screenshots examples gpt zeros opinionhttpspreviewreddithwelhmrrodpngwidthformatpngautowebpsebecceeceaadfbef gpt zeros opinionhttpspreviewreddittuynuorodpngwidthformatpngautowebpsefdcccafafcb reviews look fake af even images look bland repetitive arehttpspreviewredditcvoblyorodpngwidthformatpngautowebpsbbccffecbcadfcacf could attached pictures itll get lengthy personally tried multivitamin didnt get major positive negative effect fine money wasted im worried behind follow poor manufacturing practices wouldnt care fixing business practices scummy anyone negative effects using products hope dont get assassinated xd",
    "cleaned_comments": "used whey isolate protein shake nd l arginine sometime back tasted terrible could see results reviews bought generated via ai look spectrum reviews varying ratings common knowledge point reviews ad spaces every company stay competitive true test search someone gotten lab test results look fake influencers product youre gon na buy least one product company get one done k least test age main ingredient presence lead etc contaminants carbide seem standing testhttpsyoutubeqsbtpxcjqt test would difficulttoo expensive multivitamins many main ingredients thanks info tho check trustified youtube want scientific reviews nutraceutical products get products lab tested share reports funnily enough carbamide forte sued lab report found literally vitamins mentioned review lines perfect spelling ai generated using carbamide forte multivitamins good yet check rd party testers like trustified yt suggested comments one comments linked video fish oil product substandard according said youtuber ok let us know find good product used one supplements ended headaches day threw away swear never buying anything swisse im sticking days supplements nhi kiya iska review carbamide forte omega fish oil failed trustified lab tests httpswwwtrustifiedinpassandfailcarbamidefortehttpswwwtrustifiedinpassandfailcarbamideforte leaves bitter taste brand hi used fish oil negative positive consistent got collagen powder pills different products highly disappointed shocked collagen powder horrible taste felt like drinking sweet shampoo unimaginable amount artificial sweetener immediately got throat infection bad throat cough days took break tried thing happened pills thought may sweetener powder reacting throat hope pills ten min taking pill got skin irritation within minwhole body started itching bad head aches nausea joint pains fatigue urine smelling like sweetener alll last hours took pill times symptoms time usually sensitive person never get head aches allergies throat infections usually happens many years wtfffff never expect supplements work earth mixing makes immediate reaction min omg scared ffff right took pill min back face body itching badly horrible head aches anyone else felt jesus christ seen doctor sounds like severe allergic reaction case discontinue using specific products hai luckily three times took pm normal time woke next morning honestly still wonder difficult companies mix basic ingredients instead mixing horrible things im saying genuine seems like gmp certified label product mean supplement third party tested certification happen trustified published video carbamide forte company scam yes believe thanks saving k worth cart items discarded nutrabay really done review yes whats conclusion review hello concern looking fish oil capsules find cardamide forte fish oil usually go reviews really felt many reviews feel genuine started research lead post thanks post dont buy single product brand slow poison hain sort unethical practices check lab tests yes someone mentioned still bit sceptical muscleblaze advertises tested trustified anyone know better alternatives also thanks op bringing thread imported thorne multivitamins us recommended reddit tried gave migraines possibly high b rda never migraines could try well rated multivitamin ive come across fish oil omega fatty acids tho eat thermocol dont see use thermocol test witness stomach acid thermocol shocked",
    "light_cleaned_title": "PSA: Many fake reviews in Amazon.in - Carbamide Forte's products",
    "light_cleaned_selftext": "I know there are many fake reviews in amazon already, but this needs to be known because this concerns health directly. Has anyone used Carbamide Forte's products? I've observed two product (Vit D3 + B2 gummys and their multivitamin product) to have so many AI-generated/fake reviews, please check the attached screenshots for examples: [GPT Zero's opinion](https://preview.redd.it/hwelhmrr64od1.png?width=1737&format=png&auto=webp&s=51ebec268c42e044ece0aa9d5791115fb1ef7539) [GPT Zero's opinion](https://preview.redd.it/t2uynuor64od1.png?width=1788&format=png&auto=webp&s=31e7503f053d5c28cc85a44732f6a3f6c81b4979) [These reviews look fake af. Some of them even have images. Look at how they bland and repetitive they are.](https://preview.redd.it/cvoblyor64od1.png?width=1452&format=png&auto=webp&s=44b9654bc805c245ffe3cbca43d125fc071a03cf) I could attached more pictures but it'll get too lengthy. I personally have tried their multivitamin, I didn't get any major (positive or negative) effect from it. But that is fine by me, at most that is just money wasted. I'm just worried (if they are behind this) if they follow poor manufacturing practices (and wouldn't care about fixing it if their business practices are this scummy). Did anyone had any negative effects from using their products? >! I hope I don't get assassinated xD!<",
    "light_cleaned_comments": "Had used their whey isolate protein shake nd L arginine sometime back ..tasted terrible but could see the results .. Most reviews are now bought out and generated via AI. Look for spectrum of reviews varying over all ratings It's common knowledge at this point reviews are just ad spaces, every company has to do it to stay competitive. True test is to search if someone has gotten lab test results (look out for fake influencers) of the product you're gonna buy (or at least one other product of that company), or get one done yourself (₹5-30k) at least once (test for %age of the main ingredient, and presence lead etc contaminants). [Carbide, it seem, is not standing up to the test.](https://youtu.be/QS9bTPXcj0Q?t=236) This test would be difficult/too expensive for multivitamins as you have many main ingredients. Thanks for the info, tho You can check trustified on youtube if you want any scientific reviews of nutraceutical products. They get all the products lab tested and share the reports. Funnily enough, Carbamide Forte sued them because in its lab report they found out it literally does not have most of the vitamins it mentioned. If a review is more than a few lines and has perfect spelling, it is ai generated. I was using carbamide forte multivitamins . Are they not good ? not for me. I am yet to check the other 3rd party testers like trustified on YT, as suggested by the other comments. One of the comments linked to a video of their fish oil product which is substandard according to said youtuber Ok . Let us know if find any good product I used one of their supplements, ended up with headaches from day 1. Threw it away and swear to never buying anything from them. Swisse is what I'm sticking to these days for supplements. Nhi kiya iska review carbamide forte omega 3 fish oil failed trustified lab tests. [https://www.trustified.in/passandfail/carbamide-forte](https://www.trustified.in/passandfail/carbamide-forte) this leaves a bitter taste for me for the brand Hi there! I used their fish oil! No negative / positive! I have not been consistent with it! I got their collagen powder & pills ( 2 different products) I am highly disappointed and shocked! 1. Collagen powder!! Horrible taste & felt like I was drinking a sweet shampoo! Unimaginable amount of artificial sweetener! Immediately I got throat infection.. bad throat and cough for 3 days! I took a break from it! And tried again! Same thing happened 2. Pills I thought may be the sweetener in powder was reacting with my throat and had hope with these pills! With in ten min of taking the pill, I got skin irritation within 10 min!Whole body started itching! And very bad head aches and nausea and joint pains & fatigue!!! Urine smelling like sweetener! And alll these last for 6 hours! I took this pill for 3 times and same symptoms all the time! I am not usually sensitive person at all!! I never get head aches, allergies, throat infections! Usually happens once in many years!! Wtfffff I never expect these supplements to work! What on the earth they are mixing which makes an immediate reaction in 10 min!!?!!!!!! Omg this scared the Ffff out of me! Right now I took this pill 30 min back !my face & body itching very badly! Horrible head aches! Did anyone else felt the same?? Jesus Christ. Have you seen a doctor? This sounds like a severe allergic reaction to me. In any case discontinue using those specific products. Hai luckily all the three times I took it at 8pm so I was normal by the time I woke next morning! But honestly I still wonder why is it so difficult for the companies to just mix some basic ingredients instead of mixing horrible things🤯🤯 I'm not saying that they are genuine, but it seems like now they have a \"GMP certified\" label on their product, which should mean that their supplement is third party tested. Did this certification happen after Trustified published their video on Carbamide Forte? This .... This company is scam Yes, I believe so Thanks all for saving my 3k worth of cart items that I just discarded now! How about Nutrabay? Has he really done the review? If yes then what's the conclusion of the review? Hello There, I had same concern, i am looking for fish oil capsules, and find Cardamide Forte fish oil and usually we go with reviews, but i really felt many of those reviews are not feel genuine, so started doing some research which lead me to your post. Thanks for this post. DON'T BUY A SINGLE PRODUCT OF THIS BRAND SLOW POISON HAIN. THEY DO ALL SORT OF UNETHICAL PRACTICES. Check out for lab tests Yes, someone mentioned it. Still a bit sceptical about them because muscleblaze advertises it now \"Tested with Trustified\". Does anyone know any better alternatives? Also thanks OP for bringing this thread 🧵 Imported thorne multivitamins from the US. Was recommended all over on reddit. Tried it, gave me migraines, possibly because of the high B12 (12,500% RDA). Never had migraines before. You could try it because it was the only well rated multivitamin I've come across. Fish oil is omega 3 fatty acids tho and they can eat up thermocol , i don't see any use of the thermocol test , if you witness what your stomach acid can do to a thermocol you will be shocked"
}