{
    "id": "16661au",
    "title": "Looking Beyond GDP - A Deeper Dive into India's Economic Reality",
    "url": "https://www.reddit.com/r/india/comments/16661au/looking_beyond_gdp_a_deeper_dive_into_indias/",
    "selftext": "Hey I have recently written this article. Can you please get some feedback if possible. Thanks.  \n[Looking Beyond GDP - A Deeper Dive into India's Economic Reality](https://sanskarb.blogspot.com/2023/08/looking-beyond-gdp-deeper-dive-into.html)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693473256.0,
    "convurl": "https://external-preview.redd.it/dN910Un6EFwufpKldvBA3K8Xwzf3-q3uWVEF4Y_6VCY.jpg?auto=webp&s=8ecbec256891753da66e7c44585aaaacceabc64d",
    "comments": [
        "It's good that you have used PPP GDP figures for comparison since exchange rates can skew comparisons.\n\nHowever, I am not sure if it is the best idea to compare a developing country like India with developed countries like Germany or the UK. A better idea would be to compare India with its peers - Indonesia, Brazil, Mexico etc.\n\nAlso, one important indicator of a country's potential is the Economic Complexity Indicator (ECI) rankings. Surprisingly, India fares well on many indicators. It isn't an outlier like China but does better than many other countries. The relatively high ECI ranking denotes higher economic reslisience and shows that India has better growth prospects than Bangladesh, despite having similar PPP GDP per capita.\n\nhttps://en.m.wikipedia.org/wiki/Economic_Complexity_Index#:~:text=The%20Economic%20Complexity%20Index%20(ECI,cities%2C%20regions%2C%20or%20countries.\n\nAnother indicator that I would consider is the HDI rankings. India doesn't do as badly as it is assumed but can surely move up the rankings.\n\nhttps://en.m.wikipedia.org/wiki/Human_Development_Index\n\nThe PPP GDP along with the ECI and HDI rankings are a good indicator of a country's present position and growth potential."
    ],
    "cleaned_text": "looking beyond gdp deeper dive indias economic reality hey recently written article please get feedback possible thanks looking beyond gdp deeper dive indias economic realityhttpssanskarbblogspotcomlookingbeyondgdpdeeperdiveintohtml ",
    "cleaned_title": "looking beyond gdp deeper dive indias economic reality",
    "cleaned_selftext": "hey recently written article please get feedback possible thanks looking beyond gdp deeper dive indias economic realityhttpssanskarbblogspotcomlookingbeyondgdpdeeperdiveintohtml",
    "cleaned_comments": "good used ppp gdp figures comparison since exchange rates skew comparisons however sure best idea compare developing country like india developed countries like germany uk better idea would compare india peers indonesia brazil mexico etc also one important indicator countrys potential economic complexity indicator eci rankings surprisingly india fares well many indicators isnt outlier like china better many countries relatively high eci ranking denotes higher economic reslisience shows india better growth prospects bangladesh despite similar ppp gdp per capita another indicator would consider hdi rankings india doesnt badly assumed surely move rankings ppp gdp along eci hdi rankings good indicator countrys present position growth potential",
    "light_cleaned_title": "Looking Beyond GDP - A Deeper Dive into India's Economic Reality",
    "light_cleaned_selftext": "Hey I have recently written this article. Can you please get some feedback if possible. Thanks. [Looking Beyond GDP - A Deeper Dive into India's Economic Reality](https://sanskarb.blogspot.com/2023/08/looking-beyond-gdp-deeper-dive-into.html)",
    "light_cleaned_comments": "It's good that you have used PPP GDP figures for comparison since exchange rates can skew comparisons. However, I am not sure if it is the best idea to compare a developing country like India with developed countries like Germany or the UK. A better idea would be to compare India with its peers - Indonesia, Brazil, Mexico etc. Also, one important indicator of a country's potential is the Economic Complexity Indicator (ECI) rankings. Surprisingly, India fares well on many indicators. It isn't an outlier like China but does better than many other countries. The relatively high ECI ranking denotes higher economic reslisience and shows that India has better growth prospects than Bangladesh, despite having similar PPP GDP per capita. Another indicator that I would consider is the HDI rankings. India doesn't do as badly as it is assumed but can surely move up the rankings. The PPP GDP along with the ECI and HDI rankings are a good indicator of a country's present position and growth potential."
}