{
    "id": "176dyv4",
    "title": "Jews and Brahmins — West would like you to see them as oppressors alone. They are victims",
    "url": "https://indianexpress.com/article/opinion/columns/jews-brahmins-west-oppressors-8979952/",
    "selftext": "Note: I do not endorse the opinion piece.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 12,
    "created_utc": 1697135550.0,
    "convurl": "https://external-preview.redd.it/vTcH5R-iqxlJQ5RR1eP2AcgTDyAt0BEWET4QCwQjhA4.jpg?auto=webp&s=9cf8b5ab170aa82d1eb7075dd706fc61d38fcd81",
    "comments": [
        "Gavin Newsom is such a spineless coward, literally epitome of a centrist corporate shill. Like do u really think those Brahmins in silicone valley would even vote for him, yet he vetoed the caste discrimination bill.",
        "Lol. Wtf. Did someone just compare Brahmins to Jews? :facepalm:",
        "Victim card but now latching on to the plight of Jews. These andolan jeevis keep searching for real world tragadies to latch on to: [‘Many Holocaust films, none on India’s Islamic invasion’: Why Tejasvi Surya’s words sparked row](https://theprint.in/india/many-holocaust-films-none-on-indias-islamic-invasion-why-tejasvi-suryas-words-sparked-row/985585/)\n\nThis Vivek Ramaswamy stan writes these kind of articles:\n\n* Vamsee Juluri writes: Vivek Ramaswamy’s view of America is rooted in Hindu philosophy\n\n* Vamsee Juluri writes: Liberal America’s refusal to recognise racism against Hindus is pushing them away from Democrats\n\n* Hindu Americans have no voice. PM Modi’s meetings with US ‘thought leaders’ cannot change this fact\n\n\n\n* Message to NRIs: Rahul Gandhi demonises past, Modi needs more for future\n\n* **From The Kashmir Files to RRR: Indian cinema must cross boundaries, but for that we need to speak to audiences, instead of labelling them**\n\n* Vamsee Juluri writes: By denying Hinduphobia, western academia and media enable it\n\n* **This is what’s wrong with the concept of ‘Jim Crow Hindutva’** !!!!!!!!!!!!!!!!!!!!\n\nhttps://indianexpress.com/profile/author/vamsee-juluri/",
        "Lmao give me a break, trying to make Brahmins seem like the victims is laughable.",
        "Where were you when Hitler gassed the brahmin?",
        "LOL. WTF is this guy smoking? Napalm?",
        "Wtf? Israel is able to do all the things it does because of financial, military and technological support of US, UK and Europe. The West has been strongly behind Jews and Israel for over 7 decades.",
        "So the thing is after world war 2, the world collectively decided to give Israel a free reign to do whatever they want and that too without consequence, and if someone retaliates then they are antisemite and Israel is the forever victim here and can kill how many they want, also they will have the full sympathy of entire world.",
        "Silicon valley but yes!",
        "Jee I wonder who is racist against Indians, is it the people who labels every brown person as either arab or Muslim, or the so called liberal.\n\nHe should live in Arkansas to find out what racism is really like.",
        "Lol Brahmins trying to compare their plight to Jews.",
        "Wow. I do see a parallel between Ashkenazi jews though. They believe their privilege in their societies (see [racism in Israel](https://en.wikipedia.org/wiki/Racism_in_Jewish_communities)). Not surprising it is HAF's resident in hack scholar Vamsee Juluri spewing this nonsense. I am glad they are taking these caste cartels to task in California. You would think they would leave their caste baggage at the door when they come to the US.",
        "The elite in the newly formed british colonies in the US were called [Boston Brahmins] (https://en.wikipedia.org/wiki/Boston_Brahmin). So oppressed lmfao."
    ],
    "cleaned_text": "jews brahmins west would like see oppressors alone victims note endorse opinion piece ",
    "cleaned_title": "jews brahmins west would like see oppressors alone victims",
    "cleaned_selftext": "note endorse opinion piece",
    "cleaned_comments": "gavin newsom spineless coward literally epitome centrist corporate shill like u really think brahmins silicone valley would even vote yet vetoed caste discrimination bill lol wtf someone compare brahmins jews facepalm victim card latching plight jews andolan jeevis keep searching real world tragadies latch many holocaust films none indias islamic invasion tejasvi suryas words sparked rowhttpstheprintinindiamanyholocaustfilmsnoneonindiasislamicinvasionwhytejasvisuryaswordssparkedrow vivek ramaswamy stan writes kind articles vamsee juluri writes vivek ramaswamys view america rooted hindu philosophy vamsee juluri writes liberal americas refusal recognise racism hindus pushing away democrats hindu americans voice pm modis meetings us thought leaders change fact message nris rahul gandhi demonises past modi needs future kashmir files rrr indian cinema must cross boundaries need speak audiences instead labelling vamsee juluri writes denying hinduphobia western academia media enable whats wrong concept jim crow hindutva lmao give break trying make brahmins seem like victims laughable hitler gassed brahmin lol wtf guy smoking napalm wtf israel able things financial military technological support us uk europe west strongly behind jews israel decades thing world war world collectively decided give israel free reign whatever want without consequence someone retaliates antisemite israel forever victim kill many want also full sympathy entire world silicon valley yes jee wonder racist indians people labels every brown person either arab muslim called liberal live arkansas find racism really like lol brahmins trying compare plight jews wow see parallel ashkenazi jews though believe privilege societies see racism israelhttpsenwikipediaorgwikiracisminjewishcommunities surprising hafs resident hack scholar vamsee juluri spewing nonsense glad taking caste cartels task california would think would leave caste baggage door come us elite newly formed british colonies us called boston brahmins httpsenwikipediaorgwikibostonbrahmin oppressed lmfao",
    "light_cleaned_title": "Jews and Brahmins — West would like you to see them as oppressors alone. They are victims",
    "light_cleaned_selftext": "Note: I do not endorse the opinion piece.",
    "light_cleaned_comments": "Gavin Newsom is such a spineless coward, literally epitome of a centrist corporate shill. Like do u really think those Brahmins in silicone valley would even vote for him, yet he vetoed the caste discrimination bill. Lol. Wtf. Did someone just compare Brahmins to Jews? :facepalm: Victim card but now latching on to the plight of Jews. These andolan jeevis keep searching for real world tragadies to latch on to: [‘Many Holocaust films, none on India’s Islamic invasion’: Why Tejasvi Surya’s words sparked row](https://theprint.in/india/many-holocaust-films-none-on-indias-islamic-invasion-why-tejasvi-suryas-words-sparked-row/985585/) This Vivek Ramaswamy stan writes these kind of articles: * Vamsee Juluri writes: Vivek Ramaswamy’s view of America is rooted in Hindu philosophy * Vamsee Juluri writes: Liberal America’s refusal to recognise racism against Hindus is pushing them away from Democrats * Hindu Americans have no voice. PM Modi’s meetings with US ‘thought leaders’ cannot change this fact * Message to NRIs: Rahul Gandhi demonises past, Modi needs more for future * **From The Kashmir Files to RRR: Indian cinema must cross boundaries, but for that we need to speak to audiences, instead of labelling them** * Vamsee Juluri writes: By denying Hinduphobia, western academia and media enable it * **This is what’s wrong with the concept of ‘Jim Crow Hindutva’** !!!!!!!!!!!!!!!!!!!! Lmao give me a break, trying to make Brahmins seem like the victims is laughable. Where were you when Hitler gassed the brahmin? LOL. WTF is this guy smoking? Napalm? Wtf? Israel is able to do all the things it does because of financial, military and technological support of US, UK and Europe. The West has been strongly behind Jews and Israel for over 7 decades. So the thing is after world war 2, the world collectively decided to give Israel a free reign to do whatever they want and that too without consequence, and if someone retaliates then they are antisemite and Israel is the forever victim here and can kill how many they want, also they will have the full sympathy of entire world. Silicon valley but yes! Jee I wonder who is racist against Indians, is it the people who labels every brown person as either arab or Muslim, or the so called liberal. He should live in Arkansas to find out what racism is really like. Lol Brahmins trying to compare their plight to Jews. Wow. I do see a parallel between Ashkenazi jews though. They believe their privilege in their societies (see [racism in Israel](https://en.wikipedia.org/wiki/Racism_in_Jewish_communities)). Not surprising it is HAF's resident in hack scholar Vamsee Juluri spewing this nonsense. I am glad they are taking these caste cartels to task in California. You would think they would leave their caste baggage at the door when they come to the US. The elite in the newly formed british colonies in the US were called [Boston Brahmins] (https://en.wikipedia.org/wiki/Boston_Brahmin). So oppressed lmfao."
}