{
    "id": "15sdkic",
    "title": "Fellow cute gift enthusiasts, how much would you pay for paintings like these? (For self or gifting)",
    "url": "https://www.reddit.com/gallery/15sdkic",
    "selftext": "I'm having a hard time coming up with a price that is reasonable for me and buyer as well. Painting comes with an easel/stand.\n\n**Note- these are not my paintings, all credits to original artists. I'm just using them as a reference.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692154718.0,
    "convurl": "https://i.redd.it/rouk07zq0eib1.png",
    "comments": [
        "100 for 3",
        "Approx 33 a piece? That's the cost of plain canvas alone without an easel. \n\nNot reasonable for me at all, definitely for the buyer haha \nThanks anyway :)",
        "100 per painting i guess",
        "About tree fiddy",
        "At least 250 for the smallest one."
    ],
    "cleaned_text": "fellow cute gift enthusiasts much would pay paintings like self gifting im hard time coming price reasonable buyer well painting comes easelstand note paintings credits original artists im using reference ",
    "cleaned_title": "fellow cute gift enthusiasts much would pay paintings like self gifting",
    "cleaned_selftext": "im hard time coming price reasonable buyer well painting comes easelstand note paintings credits original artists im using reference",
    "cleaned_comments": "approx piece thats cost plain canvas alone without easel reasonable definitely buyer haha thanks anyway per painting guess tree fiddy least smallest one",
    "light_cleaned_title": "Fellow cute gift enthusiasts, how much would you pay for paintings like these? (For self or gifting)",
    "light_cleaned_selftext": "I'm having a hard time coming up with a price that is reasonable for me and buyer as well. Painting comes with an easel/stand. **Note- these are not my paintings, all credits to original artists. I'm just using them as a reference.",
    "light_cleaned_comments": "100 for 3 Approx 33 a piece? That's the cost of plain canvas alone without an easel. Not reasonable for me at all, definitely for the buyer haha Thanks anyway :) 100 per painting i guess About tree fiddy At least 250 for the smallest one."
}