{
    "id": "14kbkhl",
    "title": "At the time of independence, we were the world's sixth-largest economy. What all we could have done differently so that it wouldn't have took us 75 years just to become the fifth-largest economy in the world?",
    "url": "https://www.reddit.com/r/india/comments/14kbkhl/at_the_time_of_independence_we_were_the_worlds/",
    "selftext": "We were the world's 6th largest economy during the independence. Then the Hindu Rate of Growth 'cause of our experiments with socialism which included nationalization of industries and strict government regulation, severely limited foreign investment, hindered private sector growth and innovation dragged us to being world's 12th largest economy by 1990.\n\nDo you think if Indian governments had if India had pursued economic liberalization policies earlier, such as reducing government intervention and encouraging foreign investment, it may have experienced faster economic growth. And we could have easily been top 3 or 2 largest economy by now?\n\nhttps://www.ft.com/content/dec674c5-9009-4da1-a857-c2e68473c9ae",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687866647.0,
    "convurl": "https://external-preview.redd.it/yw8orbpOoFeXIxjkrdSnILhpMeWwFsiU0YaetdyZbgw.jpg?auto=webp&amp;s=21215c5063d48399af3d59615af08d575956c711",
    "comments": [],
    "cleaned_text": "time independence worlds sixthlargest economy could done differently wouldnt took us years become fifthlargest economy world worlds th largest economy independence hindu rate growth cause experiments socialism included nationalization industries strict government regulation severely limited foreign investment hindered private sector growth innovation dragged us worlds th largest economy think indian governments india pursued economic liberalization policies earlier reducing government intervention encouraging foreign investment may experienced faster economic growth could easily top largest economy ",
    "cleaned_title": "time independence worlds sixthlargest economy could done differently wouldnt took us years become fifthlargest economy world",
    "cleaned_selftext": "worlds th largest economy independence hindu rate growth cause experiments socialism included nationalization industries strict government regulation severely limited foreign investment hindered private sector growth innovation dragged us worlds th largest economy think indian governments india pursued economic liberalization policies earlier reducing government intervention encouraging foreign investment may experienced faster economic growth could easily top largest economy",
    "cleaned_comments": "",
    "light_cleaned_title": "At the time of independence, we were the world's sixth-largest economy. What all we could have done differently so that it wouldn't have took us 75 years just to become the fifth-largest economy in the world?",
    "light_cleaned_selftext": "We were the world's 6th largest economy during the independence. Then the Hindu Rate of Growth 'cause of our experiments with socialism which included nationalization of industries and strict government regulation, severely limited foreign investment, hindered private sector growth and innovation dragged us to being world's 12th largest economy by 1990. Do you think if Indian governments had if India had pursued economic liberalization policies earlier, such as reducing government intervention and encouraging foreign investment, it may have experienced faster economic growth. And we could have easily been top 3 or 2 largest economy by now?",
    "light_cleaned_comments": ""
}