{
    "id": "1bplfcv",
    "title": "[OC] We live in a 3-dimensional world but are only allowed to have two opinions, left-wing or right-wing",
    "url": "https://www.reddit.com/r/india/comments/1bplfcv/oc_we_live_in_a_3dimensional_world_but_are_only/",
    "selftext": "I \"was\" a Modi blind supporter or the \"Andh B\" (IDK, if we can say it publicly here or not), I fell into the trap of their marketing gimmick, I wasn't even into politics before 2013, they were quite good at this (now better). Just like any other young chap these days, I started trolling other politicians to the extent that I was blocked by a few of them and their official handles.\n\nIn 2016, Demonetisation happened, I could sense the pain people were going through and I started asking a series of questions such as \"Why isn't he acknowledging the death of people?\", \"Did he make such stupid decisions in past which I'm not aware of because I'm blinded by blind faith in this guy?\" \"Why isn't he accepting his mistakes under his period as a PM? and asking to the extent \"Is he even a good guy?\"\n\nThe year is 2019, I used to talk to this friend of mine a lot, we used to troll other politicians together because we were both blind supporters of Modiji (until I wasn't). I texted her a couple of weeks before the election, Here's how it went:\n\n>Me: \"Sup? Who are you gonna vote?\".  \n>  \n>She: Of course, Modiji. How about you?  \n>  \n>Me: Maybe \\_\\_\\_\\_\\_ this time.  \n>  \n>She: WTF? Are you stupid or what?  \n>  \n>Me: He's done good work, *yada yada yada* (some more logical points I thought were relevant in 2019)  \n>  \n>She: You're stupid, just dumbfuck. You should vote for Modi.\n\nHer behaviour completely changed during that conversation after this point, we weren't friends anymore was the vibe I was getting from here so it's been 5 years since we last talked. At some point, this would have happened with a lot of you or will happen at once.\n\nWhen I mentioned previously that they're better at this now, I can recall vividly people talking politics in my hometown or nearby in general, one would be supporting BJP, one would support Congress and someone would support others.\n\nI never heard them yelling during discussions, I never saw any of them angry in a discussion, and I never saw any of them bailing a discussion because someone was asking stronger and valid questions. (Yeah, it all started with Modi's interview, when he bailed out of the discussion).\n\nIt's 2024 now, we are in the narrative of Modi vs Who? Either you're supporting BJP or you're a Congressi or some other party. This is the reason I stopped having discussions with any Tom, Narendra or Harry around me. What's the point of having a discussion when you can't even discuss it?\n\nIf I say Yes Rahul has no experience, and I'm a Modi supporter, if I say this action from Modi is wrong, I am leftist, if I abuse both of them I'm a liberal. When I disagree with something a liberal or a communist says, then I'm something else, a new category. If people can't think of a tag or category to label you, you're being abused. Now we've reached a stage where people have only 2 tags \"with BJP or AGAINST BJP\"\n\nAs a wise man once said:**\"Merciless criticism and independent thinking are two traits of revolutionary thinking. Lovers, lunatics and poets are made of the same stuff\" - BHAGAT SINGH**\n\nSo, I would say F\\*CK BJP and F\\*CK everyone else, you are entitled to have your own opinion. Let go of people rather than killing your thoughts.\n\n&#x200B;\n\nhttps://preview.redd.it/l553hgekszqc1.jpg?width=327&format=pjpg&auto=webp&s=842e55d141469b1413b605aaac0b8903e904532b",
    "flair": "Rant / Vent",
    "score": 61,
    "num_comments": 27,
    "created_utc": 1711595697,
    "convurl": "https://a.thumbs.redditmedia.com/a54aDsvRialUfdhWY_8gdCAmUyHcJFxWeEgGhg2pqu0.jpg",
    "comments": [
        "I used to be an apolitical person my whole life, I was raised in a middle-class and never faced any direct consequences of politics.\n\nBut now seeing the state of the media and how the BJP just gets away with any wrongdoing makes me really nervous about the state of the nation, we can't afford to be apolitical anymore. He's ruining the checks and balances in our democracy and amassing more and more power. \n\nIf we let them go unchecked, I seriously believe we won't have a democracy to defend anymore.",
        "It’s like Steve jobs on stage promoting boat products",
        "i was political all my life . followed politics from when i was in grade 3. was a supporter of bjp for 20 yrs till demonitization happened. people see demonitization as oh modiji did a mistake , it was a good step. that is because they dont know modi uncle. he is far ruthless than the most ruthless person you have ever known. there are so many layers to demonitization that i got tired peeling them. Manmohan Singh the ex PM summarized it well in the parliament - organized loot, legalized plunder. they took all the cash in peoples pockets and put them in the pockets of corporate and thats one layer. bank interest rates fell due to high deposits, the loan books of corporates got written off as NPAs, the black money which corporates and bjp was holding got converted to white. it was a scheme to convert black to white and not for catching black money. this was just one of the goals. imagine he made the whole country suffer for this.",
        "You are right, we need a tail-wing.",
        "We also do the third one, posting on social media.",
        "You dont have to be a complete leftist or rightist. You can stay neutral and can look into matters and have enough knowledge to come to conclusions and form your own opinions into issues that you think are fair. You dont have to agree with either the leftist or rightist point of views all the time. Extreme ones on both sides are equally horrible.",
        "Why do you care what people call you? You stand for beliefs and ideology and not some tag or political party. If people are not willing to discuss things civilly then feel free to not discuss these things with them or anyone for that matter. Don't try to change their thinking. Let them take their time.",
        "We live in a 3-dimensional world with 150B people but are only allowed to have two major mobile network(others are practically unavailable) providers. \n\nPS: Imagine how strictly we are controlled, even China had 3 major players. FYI Indian system is duopoly.",
        "Same boat. My question is, do we even have a good opposition that can reinstate these checks? The problem is, one side is the bad guy, the other side is the ignorant. So, who do we vote for?",
        "True I am making a Democratic Redditia Party to fix dis, wanna join?",
        "TejuuuuuuuuOPPPPPPPPPP!!!",
        "center. well what do you know, we are 3d in fact",
        "areee tejuuu tu yaha. big fan bhai 💋",
        "Vote out the bad guy first than deal with the ignorant one layer.\n\n\nIf the ignorant one comes in power we'd still have a fully functional democracy. Plus that govt atleast listened.\n\n\nIf this bad guy comes in power, he'll just strongarm us into agreeing to whatever he wants and wedbe helpless.\n\n\nSo vote Congress in 2024 so that you can be free to have choices in future, or just vote BJP and make sure BJP are pretty much the only big party in 2029.",
        "By controlling the whole nation's media, it is extremely easy to brainwash people into supporting you regardless of your actions.",
        ">do we even have a good opposition that can reinstate these checks?\n\nOh come on ffs! Who was in power before this gobar stained genocidal idiots came to power? Who was in power when people used to enjoy live mockery of politicians on stage, on prime time on news channels, difficult questions being asked to the govt and the govt and their ministers fielding the questions as they should in a democracy, live in an q/a news conference? \n\nI can give you so many more examples but that would be too much for you to handle because you have been drinking the BJP kool aid and their propoganda network for so long that you have forgot the ability to think clearly and make decisions on your own. \n\n***Repeat a lie thousand times and the lie becomes truth for people.*** \n\nThis is what happened. RaGa is not pappu, Opposition is not ignorant. **You and countless others like you are the ignorant ones**. Maybe you are too young that you have grown up watching Godi media that you have no idea what an independent media actually looks like. What hard hitting questions are! And what is a press conference? Go watch some old interview of MMS and their cabinet ministers, you will see what I am talking about. All these anchors who are currently licking Modi's ass were actual journalists, look at their shows pre-BJP. These people became popular because of their journalism.\n\n***The Opposition looks ignorant because the media doesn't raise their voice when they are talking about issues.***\n\n***Stop drinking the kool-aid and think for yourself for once.***",
        "You can be in-between i.e., neither left wing nor right wing.\n\nYou should have opinions on issues not parties or politicians. What has changed in the last ten years is that people now support a party or a politician, not their view on a particular matter. Eg: I think revocation of article 370 was a good move, personally. I think the BJP did a good thing there. But I don't support them centralising the power through various policies.\n\nPeople need to understand that it is perfectly ok to support/criticize different politicians and parties over different issues. Unfortunately, the country is so polarized now that you either support one person on every issue or you are against him in every issue. I am amazed that people don't grasp this simple concept. Smh",
        "demonitization was done to win the up election\r\n\r\nAnd now since they have majority in the both houses, they can get away with all kinds of scams and election manipulation. Can arrest aap leader and close Congress bank accounts.",
        "you got that right man. UP election was one of the layer. they made the opposition not be able to spend any of their cash while bjp was ready with their 100 notes.",
        "Voting for the BJP means you don't give a fuck about anyone but yourself and You're content to see others suffer as long as you have your pie. Its not even about ideology anymore.\n\nWe need to ban the RSS again and it's Islamic equivalents.",
        "Bruh you’re not looking cool. Nhi degi wo. Come out of politics"
    ],
    "cleaned_text": "oc live dimensional world allowed two opinions leftwing rightwing modi blind supporter andh b idk say publicly fell trap marketing gimmick wasnt even politics quite good better like young chap days started trolling politicians extent blocked official handles demonetisation happened could sense pain people going started asking series questions isnt acknowledging death people make stupid decisions past im aware im blinded blind faith guy isnt accepting mistakes period pm asking extent even good guy year used talk friend mine lot used troll politicians together blind supporters modiji wasnt texted couple weeks election heres went sup gon na vote course modiji maybe time wtf stupid hes done good work yada yada yada logical points thought relevant youre stupid dumbfuck vote modi behaviour completely changed conversation point werent friends anymore vibe getting years since last talked point would happened lot happen mentioned previously theyre better recall vividly people talking politics hometown nearby general one would supporting bjp one would support congress someone would support others never heard yelling discussions never saw angry discussion never saw bailing discussion someone asking stronger valid questions yeah started modis interview bailed discussion narrative modi vs either youre supporting bjp youre congressi party reason stopped discussions tom narendra harry around whats point discussion cant even discuss say yes rahul experience im modi supporter say action modi wrong leftist abuse im liberal disagree something liberal communist says im something else new category people cant think tag category label youre abused weve reached stage people tags bjp bjp wise man saidmerciless criticism independent thinking two traits revolutionary thinking lovers lunatics poets made stuff bhagat singh would say fck bjp fck everyone else entitled opinion let go people rather killing thoughts xb ",
    "cleaned_title": "oc live dimensional world allowed two opinions leftwing rightwing",
    "cleaned_selftext": "modi blind supporter andh b idk say publicly fell trap marketing gimmick wasnt even politics quite good better like young chap days started trolling politicians extent blocked official handles demonetisation happened could sense pain people going started asking series questions isnt acknowledging death people make stupid decisions past im aware im blinded blind faith guy isnt accepting mistakes period pm asking extent even good guy year used talk friend mine lot used troll politicians together blind supporters modiji wasnt texted couple weeks election heres went sup gon na vote course modiji maybe time wtf stupid hes done good work yada yada yada logical points thought relevant youre stupid dumbfuck vote modi behaviour completely changed conversation point werent friends anymore vibe getting years since last talked point would happened lot happen mentioned previously theyre better recall vividly people talking politics hometown nearby general one would supporting bjp one would support congress someone would support others never heard yelling discussions never saw angry discussion never saw bailing discussion someone asking stronger valid questions yeah started modis interview bailed discussion narrative modi vs either youre supporting bjp youre congressi party reason stopped discussions tom narendra harry around whats point discussion cant even discuss say yes rahul experience im modi supporter say action modi wrong leftist abuse im liberal disagree something liberal communist says im something else new category people cant think tag category label youre abused weve reached stage people tags bjp bjp wise man saidmerciless criticism independent thinking two traits revolutionary thinking lovers lunatics poets made stuff bhagat singh would say fck bjp fck everyone else entitled opinion let go people rather killing thoughts xb",
    "cleaned_comments": "used apolitical person whole life raised middleclass never faced direct consequences politics seeing state media bjp gets away wrongdoing makes really nervous state nation cant afford apolitical anymore hes ruining checks balances democracy amassing power let go unchecked seriously believe wont democracy defend anymore like steve jobs stage promoting boat products political life followed politics grade supporter bjp yrs till demonitization happened people see demonitization oh modiji mistake good step dont know modi uncle far ruthless ruthless person ever known many layers demonitization got tired peeling manmohan singh ex pm summarized well parliament organized loot legalized plunder took cash peoples pockets put pockets corporate thats one layer bank interest rates fell due high deposits loan books corporates got written npas black money corporates bjp holding got converted white scheme convert black white catching black money one goals imagine made whole country suffer right need tailwing also third one posting social media dont complete leftist rightist stay neutral look matters enough knowledge come conclusions form opinions issues think fair dont agree either leftist rightist point views time extreme ones sides equally horrible care people call stand beliefs ideology tag political party people willing discuss things civilly feel free discuss things anyone matter dont try change thinking let take time live dimensional world b people allowed two major mobile networkothers practically unavailable providers ps imagine strictly controlled even china major players fyi indian system duopoly boat question even good opposition reinstate checks problem one side bad guy side ignorant vote true making democratic redditia party fix dis wan na join tejuuuuuuuuopppppppppp center well know fact areee tejuuu tu yaha big fan bhai vote bad guy first deal ignorant one layer ignorant one comes power wed still fully functional democracy plus govt atleast listened bad guy comes power hell strongarm us agreeing whatever wants wedbe helpless vote congress free choices future vote bjp make sure bjp pretty much big party controlling whole nations media extremely easy brainwash people supporting regardless actions even good opposition reinstate checks oh come ffs power gobar stained genocidal idiots came power power people used enjoy live mockery politicians stage prime time news channels difficult questions asked govt govt ministers fielding questions democracy live qa news conference give many examples would much handle drinking bjp kool aid propoganda network long forgot ability think clearly make decisions repeat lie thousand times lie becomes truth people happened raga pappu opposition ignorant countless others like ignorant ones maybe young grown watching godi media idea independent media actually looks like hard hitting questions press conference go watch old interview mms cabinet ministers see talking anchors currently licking modis ass actual journalists look shows prebjp people became popular journalism opposition looks ignorant media doesnt raise voice talking issues stop drinking koolaid think inbetween ie neither left wing right wing opinions issues parties politicians changed last ten years people support party politician view particular matter eg think revocation article good move personally think bjp good thing dont support centralising power various policies people need understand perfectly ok supportcriticize different politicians parties different issues unfortunately country polarized either support one person every issue every issue amazed people dont grasp simple concept smh demonitization done win election since majority houses get away kinds scams election manipulation arrest aap leader close congress bank accounts got right man election one layer made opposition able spend cash bjp ready notes voting bjp means dont give fuck anyone youre content see others suffer long pie even ideology anymore need ban rss islamic equivalents bruh youre looking cool nhi degi wo come politics",
    "light_cleaned_title": "[OC] We live in a 3-dimensional world but are only allowed to have two opinions, left-wing or right-wing",
    "light_cleaned_selftext": "I \"was\" a Modi blind supporter or the \"Andh B\" (IDK, if we can say it publicly here or not), I fell into the trap of their marketing gimmick, I wasn't even into politics before 2013, they were quite good at this (now better). Just like any other young chap these days, I started trolling other politicians to the extent that I was blocked by a few of them and their official handles. In 2016, Demonetisation happened, I could sense the pain people were going through and I started asking a series of questions such as \"Why isn't he acknowledging the death of people?\", \"Did he make such stupid decisions in past which I'm not aware of because I'm blinded by blind faith in this guy?\" \"Why isn't he accepting his mistakes under his period as a PM? and asking to the extent \"Is he even a good guy?\" The year is 2019, I used to talk to this friend of mine a lot, we used to troll other politicians together because we were both blind supporters of Modiji (until I wasn't). I texted her a couple of weeks before the election, Here's how it went: >Me: \"Sup? Who are you gonna vote?\". > >She: Of course, Modiji. How about you? > >Me: Maybe \\_\\_\\_\\_\\_ this time. > >She: WTF? Are you stupid or what? > >Me: He's done good work, *yada yada yada* (some more logical points I thought were relevant in 2019) > >She: You're stupid, just dumbfuck. You should vote for Modi. Her behaviour completely changed during that conversation after this point, we weren't friends anymore was the vibe I was getting from here so it's been 5 years since we last talked. At some point, this would have happened with a lot of you or will happen at once. When I mentioned previously that they're better at this now, I can recall vividly people talking politics in my hometown or nearby in general, one would be supporting BJP, one would support Congress and someone would support others. I never heard them yelling during discussions, I never saw any of them angry in a discussion, and I never saw any of them bailing a discussion because someone was asking stronger and valid questions. (Yeah, it all started with Modi's interview, when he bailed out of the discussion). It's 2024 now, we are in the narrative of Modi vs Who? Either you're supporting BJP or you're a Congressi or some other party. This is the reason I stopped having discussions with any Tom, Narendra or Harry around me. What's the point of having a discussion when you can't even discuss it? If I say Yes Rahul has no experience, and I'm a Modi supporter, if I say this action from Modi is wrong, I am leftist, if I abuse both of them I'm a liberal. When I disagree with something a liberal or a communist says, then I'm something else, a new category. If people can't think of a tag or category to label you, you're being abused. Now we've reached a stage where people have only 2 tags \"with BJP or AGAINST BJP\" As a wise man once said:**\"Merciless criticism and independent thinking are two traits of revolutionary thinking. Lovers, lunatics and poets are made of the same stuff\" - BHAGAT SINGH** So, I would say F\\*CK BJP and F\\*CK everyone else, you are entitled to have your own opinion. Let go of people rather than killing your thoughts. &#x200B;",
    "light_cleaned_comments": "I used to be an apolitical person my whole life, I was raised in a middle-class and never faced any direct consequences of politics. But now seeing the state of the media and how the BJP just gets away with any wrongdoing makes me really nervous about the state of the nation, we can't afford to be apolitical anymore. He's ruining the checks and balances in our democracy and amassing more and more power. If we let them go unchecked, I seriously believe we won't have a democracy to defend anymore. It’s like Steve jobs on stage promoting boat products i was political all my life . followed politics from when i was in grade 3. was a supporter of bjp for 20 yrs till demonitization happened. people see demonitization as oh modiji did a mistake , it was a good step. that is because they dont know modi uncle. he is far ruthless than the most ruthless person you have ever known. there are so many layers to demonitization that i got tired peeling them. Manmohan Singh the ex PM summarized it well in the parliament - organized loot, legalized plunder. they took all the cash in peoples pockets and put them in the pockets of corporate and thats one layer. bank interest rates fell due to high deposits, the loan books of corporates got written off as NPAs, the black money which corporates and bjp was holding got converted to white. it was a scheme to convert black to white and not for catching black money. this was just one of the goals. imagine he made the whole country suffer for this. You are right, we need a tail-wing. We also do the third one, posting on social media. You dont have to be a complete leftist or rightist. You can stay neutral and can look into matters and have enough knowledge to come to conclusions and form your own opinions into issues that you think are fair. You dont have to agree with either the leftist or rightist point of views all the time. Extreme ones on both sides are equally horrible. Why do you care what people call you? You stand for beliefs and ideology and not some tag or political party. If people are not willing to discuss things civilly then feel free to not discuss these things with them or anyone for that matter. Don't try to change their thinking. Let them take their time. We live in a 3-dimensional world with 150B people but are only allowed to have two major mobile network(others are practically unavailable) providers. PS: Imagine how strictly we are controlled, even China had 3 major players. FYI Indian system is duopoly. Same boat. My question is, do we even have a good opposition that can reinstate these checks? The problem is, one side is the bad guy, the other side is the ignorant. So, who do we vote for? True I am making a Democratic Redditia Party to fix dis, wanna join? TejuuuuuuuuOPPPPPPPPPP!!! center. well what do you know, we are 3d in fact areee tejuuu tu yaha. big fan bhai 💋 Vote out the bad guy first than deal with the ignorant one layer. If the ignorant one comes in power we'd still have a fully functional democracy. Plus that govt atleast listened. If this bad guy comes in power, he'll just strongarm us into agreeing to whatever he wants and wedbe helpless. So vote Congress in 2024 so that you can be free to have choices in future, or just vote BJP and make sure BJP are pretty much the only big party in 2029. By controlling the whole nation's media, it is extremely easy to brainwash people into supporting you regardless of your actions. >do we even have a good opposition that can reinstate these checks? Oh come on ffs! Who was in power before this gobar stained genocidal idiots came to power? Who was in power when people used to enjoy live mockery of politicians on stage, on prime time on news channels, difficult questions being asked to the govt and the govt and their ministers fielding the questions as they should in a democracy, live in an q/a news conference? I can give you so many more examples but that would be too much for you to handle because you have been drinking the BJP kool aid and their propoganda network for so long that you have forgot the ability to think clearly and make decisions on your own. ***Repeat a lie thousand times and the lie becomes truth for people.*** This is what happened. RaGa is not pappu, Opposition is not ignorant. **You and countless others like you are the ignorant ones**. Maybe you are too young that you have grown up watching Godi media that you have no idea what an independent media actually looks like. What hard hitting questions are! And what is a press conference? Go watch some old interview of MMS and their cabinet ministers, you will see what I am talking about. All these anchors who are currently licking Modi's ass were actual journalists, look at their shows pre-BJP. These people became popular because of their journalism. ***The Opposition looks ignorant because the media doesn't raise their voice when they are talking about issues.*** ***Stop drinking the kool-aid and think for yourself for once.*** You can be in-between i.e., neither left wing nor right wing. You should have opinions on issues not parties or politicians. What has changed in the last ten years is that people now support a party or a politician, not their view on a particular matter. Eg: I think revocation of article 370 was a good move, personally. I think the BJP did a good thing there. But I don't support them centralising the power through various policies. People need to understand that it is perfectly ok to support/criticize different politicians and parties over different issues. Unfortunately, the country is so polarized now that you either support one person on every issue or you are against him in every issue. I am amazed that people don't grasp this simple concept. Smh demonitization was done to win the up election And now since they have majority in the both houses, they can get away with all kinds of scams and election manipulation. Can arrest aap leader and close Congress bank accounts. you got that right man. UP election was one of the layer. they made the opposition not be able to spend any of their cash while bjp was ready with their 100 notes. Voting for the BJP means you don't give a fuck about anyone but yourself and You're content to see others suffer as long as you have your pie. Its not even about ideology anymore. We need to ban the RSS again and it's Islamic equivalents. Bruh you’re not looking cool. Nhi degi wo. Come out of politics"
}