{
    "id": "1b89pct",
    "title": "Politician's son getting a fake PWD certificate and admission in IITM Aerospace engineering",
    "url": "https://www.reddit.com/gallery/1b89pct",
    "selftext": "Originally posted on r/JEENEETards\nCredits to u/Shiven-NoCum-5082\n  u/brown-pussy-hunter",
    "flair": "Crime",
    "score": 426,
    "num_comments": 41,
    "created_utc": 1709755530.0,
    "convurl": "https://i.redd.it/u8fz3g8xsrmc1.png",
    "comments": [
        "News channel ko bhejo kisi. Iski Pol khol do.",
        "Bold of you to assume news channels will cover this.",
        "Send them the stories. Small timers might just jeopardize their career to cover something big.",
        "There was also a 'sharma' guy during my time, he was under the PWD category, but I couldn't figure out his disability in the four years I was there. Makes me wonder how many such cases happen every year.",
        "You iitian ?",
        "iitm ke mail pe spam krke iski info dedi iss incident ki",
        "What is PWD?",
        "person with disability",
        "Persons with Disabilities",
        "Shitface desi scammers are literally EVERYWHERE now.",
        "I'm escalating this to the IITBAA community. A number of us are in a position to make some pain if needed. \n\nWe can always open offices in Vietnam...",
        "Bold of you to think faking education qualifications is not legal. Laughs in Entire Political science",
        "I mean, yeah, lekin kisi ki seat toh nahi khaai, yaha toh kisi deserving ki seat khaa gya",
        "Obviously not the same as this, but I know 2 juniors who paid someone else to write their jee paper. It was well known on campus that these guys didn't write their papers, even the professors joked about it in their class.   \n  \nDon't really suspect this one bit, because guys like these end up bragging about their 'accomplishments' to someone, and if you actually know the person in question, then it's the first thing people bring up in convo about them. Shit like this is an open secret on campuses.",
        "who is his political parent? cant find it from google search",
        "Nice work u/brown-pussy-hunter",
        "You should not judge someone's disability and not expose it either. It's personal and private information.",
        "Looks like you know how to read but not how to interpret ,understand and critique.",
        "Also every batch on most NIT/IIT campuses I know prepare a JEE rank list. In my college every batch did it because of a minor alumni scholarship given out to opening ranks of every branch. A lot of the times colleges ro it themselves. Nobody cares about your rank, but a rank list exists.   \n  \nThis guy does not come across as mentally or physically disabled in his videos. This should be very easy to disprove if it were false because all it would take is for this guy to show his actual jee marksheet. Because no shit this guy isn't disabled.",
        "Ramrao nikam",
        "He got literally 1%ile that means out 11lakh his rank was 11lakh\n\nAnd there are videos of him playing basket ball and cricket \n\nAnd he was fake mentoring students on unacdemy and showing them fake credentials",
        "He has deleted his YouTube channel and IG and the video where he appeared in Josh talks has been taken down",
        "We should get that fraud kicked out from IIT",
        "Must be disabled /s",
        "I don't know what's more scary, the existence of such people or the fact that a pwd candidate can get in an IIT at 1 percentile , why even conduct an exam? Just take them in for existing lol",
        "Thats good that he took efforts to make a youtube channel to flaunt his tag. Youtube channel na banata toh na pakra jata🤣. Unacademy ki credibility aaj pata lg gai",
        "https://preview.redd.it/bvfbjuumrtmc1.jpeg?width=1080&format=pjpg&auto=webp&s=8fadc5775d013ba94737da19911bdb9e99d2674a\n\nIs Wale video ko bhi private krwa diya 🤮🤮🤮",
        "Nhi bhai he's frok iti",
        "My roommate in IIT Kanpur was in PWD category with a fake certificate. His older brother was in the same institute and was handicapped.",
        "My roommate in a IIT was in PWD category with a fake certificate. His older brother was in the same institute and was handicapped.",
        "Similar story.. Got into my batch as pwd . the person's dad was a rich guy with lots of political connections..prolly bribed his way to get fake certificates. The batchmate faked anxieties during classes and every exams. There was court cases between IIT and the person but the person won coz again i guess the judges are part of the shitshow.",
        "I'm from PWD also but you can never guess unless I specifically mention what is wrong with me.",
        "Chalo viral kare",
        "I guess he is mentally retarded",
        "Public Works Department",
        "He got a 40% PWD Certificate. Which should pretty much be identifiable at a glance",
        "I also have 42% PWD certificate. But you couldn't even tell at all when I have my all clothes on. You can never in your life predict mine unless I specifically mention to you. It isn't visible clothed but it does have its effect tho.",
        "The thing is, he surely is not a person with a disability.",
        "Kuch toh acha effect hona chahiye ese frauds ka.",
        "Nice one. Lots of free time ah?",
        "Very nice of you to make jokes disabilities.",
        "[https://www.youtube.com/watch?v=DFJoC46DYFs&ab\\_channel=GOINGmerry](https://www.youtube.com/watch?v=DFJoC46DYFs&ab_channel=GOINGmerry)\n\nplease take a look at this and keep it in mind he have 41% pwd certificate",
        "here is proof   \n[https://www.youtube.com/watch?v=DFJoC46DYFs&ab\\_channel=GOINGmerry](https://www.youtube.com/watch?v=DFJoC46DYFs&ab_channel=GOINGmerry)"
    ],
    "cleaned_text": "politicians son getting fake pwd certificate admission iitm aerospace engineering originally posted rjeeneetards credits ushivennocum ubrownpussyhunter ",
    "cleaned_title": "politicians son getting fake pwd certificate admission iitm aerospace engineering",
    "cleaned_selftext": "originally posted rjeeneetards credits ushivennocum ubrownpussyhunter",
    "cleaned_comments": "news channel ko bhejo kisi iski pol khol bold assume news channels cover send stories small timers might jeopardize career cover something big also sharma guy time pwd category couldnt figure disability four years makes wonder many cases happen every year iitian iitm ke mail pe spam krke iski info dedi iss incident ki pwd person disability persons disabilities shitface desi scammers literally everywhere im escalating iitbaa community number us position make pain needed always open offices vietnam bold think faking education qualifications legal laughs entire political science mean yeah lekin kisi ki seat toh nahi khaai yaha toh kisi deserving ki seat khaa gya obviously know juniors paid someone else write jee paper well known campus guys didnt write papers even professors joked class dont really suspect one bit guys like end bragging accomplishments someone actually know person question first thing people bring convo shit like open secret campuses political parent cant find google search nice work ubrownpussyhunter judge someones disability expose either personal private information looks like know read interpret understand critique also every batch nitiit campuses know prepare jee rank list college every batch minor alumni scholarship given opening ranks every branch lot times colleges ro nobody cares rank rank list exists guy come across mentally physically disabled videos easy disprove false would take guy show actual jee marksheet shit guy isnt disabled ramrao nikam got literally ile means lakh rank lakh videos playing basket ball cricket fake mentoring students unacdemy showing fake credentials deleted youtube channel ig video appeared josh talks taken get fraud kicked iit must disabled dont know whats scary existence people fact pwd candidate get iit percentile even conduct exam take existing lol thats good took efforts make youtube channel flaunt tag youtube channel na banata toh na pakra jata unacademy ki credibility aaj pata lg gai wale video ko bhi private krwa diya nhi bhai hes frok iti roommate iit kanpur pwd category fake certificate older brother institute handicapped roommate iit pwd category fake certificate older brother institute handicapped similar story got batch pwd persons dad rich guy lots political connectionsprolly bribed way get fake certificates batchmate faked anxieties classes every exams court cases iit person person coz guess judges part shitshow im pwd also never guess unless specifically mention wrong chalo viral kare guess mentally retarded public works department got pwd certificate pretty much identifiable glance also pwd certificate couldnt even tell clothes never life predict mine unless specifically mention isnt visible clothed effect tho thing surely person disability kuch toh acha effect hona chahiye ese frauds ka nice one lots free time ah nice make jokes disabilities httpswwwyoutubecomwatchvdfjocdyfsabchannelgoingmerryhttpswwwyoutubecomwatchvdfjocdyfsabchannelgoingmerry please take look keep mind pwd certificate proof httpswwwyoutubecomwatchvdfjocdyfsabchannelgoingmerryhttpswwwyoutubecomwatchvdfjocdyfsabchannelgoingmerry",
    "light_cleaned_title": "Politician's son getting a fake PWD certificate and admission in IITM Aerospace engineering",
    "light_cleaned_selftext": "Originally posted on r/JEENEETards Credits to u/Shiven-NoCum-5082 u/brown-pussy-hunter",
    "light_cleaned_comments": "News channel ko bhejo kisi. Iski Pol khol do. Bold of you to assume news channels will cover this. Send them the stories. Small timers might just jeopardize their career to cover something big. There was also a 'sharma' guy during my time, he was under the PWD category, but I couldn't figure out his disability in the four years I was there. Makes me wonder how many such cases happen every year. You iitian ? iitm ke mail pe spam krke iski info dedi iss incident ki What is PWD? person with disability Persons with Disabilities Shitface desi scammers are literally EVERYWHERE now. I'm escalating this to the IITBAA community. A number of us are in a position to make some pain if needed. We can always open offices in Vietnam... Bold of you to think faking education qualifications is not legal. Laughs in Entire Political science I mean, yeah, lekin kisi ki seat toh nahi khaai, yaha toh kisi deserving ki seat khaa gya Obviously not the same as this, but I know 2 juniors who paid someone else to write their jee paper. It was well known on campus that these guys didn't write their papers, even the professors joked about it in their class. Don't really suspect this one bit, because guys like these end up bragging about their 'accomplishments' to someone, and if you actually know the person in question, then it's the first thing people bring up in convo about them. Shit like this is an open secret on campuses. who is his political parent? cant find it from google search Nice work u/brown-pussy-hunter You should not judge someone's disability and not expose it either. It's personal and private information. Looks like you know how to read but not how to interpret ,understand and critique. Also every batch on most NIT/IIT campuses I know prepare a JEE rank list. In my college every batch did it because of a minor alumni scholarship given out to opening ranks of every branch. A lot of the times colleges ro it themselves. Nobody cares about your rank, but a rank list exists. This guy does not come across as mentally or physically disabled in his videos. This should be very easy to disprove if it were false because all it would take is for this guy to show his actual jee marksheet. Because no shit this guy isn't disabled. Ramrao nikam He got literally 1%ile that means out 11lakh his rank was 11lakh And there are videos of him playing basket ball and cricket And he was fake mentoring students on unacdemy and showing them fake credentials He has deleted his YouTube channel and IG and the video where he appeared in Josh talks has been taken down We should get that fraud kicked out from IIT Must be disabled /s I don't know what's more scary, the existence of such people or the fact that a pwd candidate can get in an IIT at 1 percentile , why even conduct an exam? Just take them in for existing lol Thats good that he took efforts to make a youtube channel to flaunt his tag. Youtube channel na banata toh na pakra jata🤣. Unacademy ki credibility aaj pata lg gai Is Wale video ko bhi private krwa diya 🤮🤮🤮 Nhi bhai he's frok iti My roommate in IIT Kanpur was in PWD category with a fake certificate. His older brother was in the same institute and was handicapped. My roommate in a IIT was in PWD category with a fake certificate. His older brother was in the same institute and was handicapped. Similar story.. Got into my batch as pwd . the person's dad was a rich guy with lots of political connections..prolly bribed his way to get fake certificates. The batchmate faked anxieties during classes and every exams. There was court cases between IIT and the person but the person won coz again i guess the judges are part of the shitshow. I'm from PWD also but you can never guess unless I specifically mention what is wrong with me. Chalo viral kare I guess he is mentally retarded Public Works Department He got a 40% PWD Certificate. Which should pretty much be identifiable at a glance I also have 42% PWD certificate. But you couldn't even tell at all when I have my all clothes on. You can never in your life predict mine unless I specifically mention to you. It isn't visible clothed but it does have its effect tho. The thing is, he surely is not a person with a disability. Kuch toh acha effect hona chahiye ese frauds ka. Nice one. Lots of free time ah? Very nice of you to make jokes disabilities. [https://www.youtube.com/watch?v=DFJoC46DYFs&ab\\_channel=GOINGmerry](https://www.youtube.com/watch?v=DFJoC46DYFs&ab_channel=GOINGmerry) please take a look at this and keep it in mind he have 41% pwd certificate here is proof [https://www.youtube.com/watch?v=DFJoC46DYFs&ab\\_channel=GOINGmerry](https://www.youtube.com/watch?v=DFJoC46DYFs&ab_channel=GOINGmerry)"
}