{
    "id": "14qcg73",
    "title": "India Will Pay 70% Of Cost But Micron Will Own 100% Of The Plant—A Curious Business Model| Countercurrents",
    "url": "https://countercurrents.org/2023/07/india-will-pay-70-of-cost-but-micron-will-own-100-of-the-plant-a-curious-business-model/",
    "selftext": "This is Gujarat model of development. Also what Micron will do ain’t that great! Test!\n\nUS and EU don’t want India to rise in high tech stuff. They only want Indian labour for manufacturing their consumer goods. Vietnam and Malaysia are leading on semiconductor front. India is nowhere in the picture. All these puny investments in semiconductors is a Modiwashing of the semiconductor failure of India",
    "flair": "Rant / Vent",
    "score": 1035,
    "num_comments": 221,
    "created_utc": 1688469388.0,
    "convurl": "https://external-preview.redd.it/_xmZwQsll3ndhnGE1oNIvAgt8pq31Gh_lMThbvCm7B0.jpg?auto=webp&s=d0c98e1f0abfec2fc0552e38d72d0e4dbaa45bcb",
    "comments": [
        "This is like an Adani deal",
        "Wait, we are footing the entire bill ? Is that normal ? \n\nI know US has been a spending for new TSMC foundries, I’m not sure how much of the bill they’re paying though.\n\nMy gripe with these things is that while we get the manufacturing here, we still don’t do much to bring the IP to india. At the end of the day, if we don’t generate new IP, it’s a step forward but I think there’s more to be done.",
        "You're looking it at wrong way, the reason we're paying 70% is simply because we need a decent semiconductor fab. \n\nYeah it's not the cutting edge stuff but it's still way better than having nothing in case of war and this factory will bring experience for local workers and Indian engineers that can be used later for higher tech factory. \n\nThis isn't a wrong step.",
        "We need semiconductor industry asap, much more then they need us.",
        "same shit in foxconn (apple assembly thingy) as well .",
        "But better",
        "But will my Crucial SSD be cheaper? Anyway arse decision",
        "Excerpt that it’s not a fabrication plant, it’s just an assembly and packaging plant.",
        "We need technology transfer as well if you want cheap manufacturing costs and labor in India .... Kapish !",
        "Yeah! If India could do both Hardware and Software then we will be in a unique position where we can build and export entire products internationally. Exports will explode.",
        "These semiconductor products will be more expensive to make in India than getting from currently established channels. Also, the defense manufacturing deal has the same issue. Manufacturing part of those jets in India is pricier than having it locally sourced by the Americans.\n\nIt's the price India is paying to set up high technolog R&D and manufacturing. It's a long way ahead.",
        "Socialize the losses, privatize the profits",
        "India should get 40% ownership and get profits in proportion to it. These could be channeled into other development projects in the same space.",
        "What is important is after Indira Gandhi we haven’t had any leader who had the forethought her government had in many issues. They thought of this in 1976 before the fire gutted the factory in 1989. I am amazed as well as saddened by what India lost with her assassination. The whole of South Asia would be different if she had lived her life out.",
        "This is happening all over the world. After covid 19 and the semiconductor shortage all major countries are offering huge incentives for making semiconductors in their countries.",
        "Claiming that the woman who enacted emergency had forethought is peak stupidity",
        "Everyone has their pluses and negatives, what is totally stupid is not to recognize her strategic acumen. From nuclear weapons, to thinking about pharmaceutical industry to semi conductors way ahead of others, and the stupid parade of PM’s we’ve had since her, including her son makes her a giant indeed.",
        "India already has semi-conductor fabs. Owned by GoI. The manufactured silicon(40nm I think) is used by ISRO and DRDO. The fact is despite having a program in place for 2 decades, there has been zero innovation. The government needs to look hard at why Indian engineers can produce chips after moving to US, but can't here in India. And that'd be a lot of looking.",
        "To get our future smart people to make new cars, they at least should have access to old car manufacturing plants. You can't produce ferrarri without even having the capacity to produce maruti 800.\n\nUsing this analogy, once we have a firm footing in the basic semiconductoring, we have a great ally in japan who has the best semiconductor ecosystem and an ageing population that will need the indian labor and added bonus of reduced costs.\n\nThey have invested a lot in India and has given us some crucial techs when needed.",
        "Socialism does not work",
        "You have to start somewhere you cant expect to start manufacturing sub 5nm chips directly when the country has no semiconductor supply chain and has no pre-existing fabs , first only basic low end stuff will be setup , hopefully this is just the start and we can climb up the value chain in the years to come , we need fabs in india , the likes of TSMC and others will not be interested in manufacturing here unless they get massive subsidies to do so as there are places in the world much more suited for this kind of work than India , every govt is spending money hand over fist to get fabs setup in their country, the US is giving subsidies worth $280 Billion to rebuild their semi-conductor ecosystem for context thats more than our entire budget for the year if we exclude military spending. \nSo I don't mind govt giving subsidies till we manage to climb up the value chain in the years to come , if that doesn't happen lets take out the pitchforks.",
        "Guys this is an assembly plant, not a fab.\n\nThis is completely useless",
        "It’s made in india, not owned by Indians.",
        "One big contributor is having a mature and affordable supply chain network. China is working on this since the 1980s.",
        "I am okay with this. Becoming a semiconductor hub is a chicken and egg problem, and companies won't set it up unless they are incentivized heavily for this. \n\nAnd taking care of the cost is a one-time investment. In return, Micron will set up their center here. This will help bring dozens of upstream and downstream businesses that will all contribute towards building the well-needed 'ecosystem' for other players to move in and set up their own shop.",
        "What's the point of arguing? We are not going to get a right wing government to stop giving money to corporations. It is what it is.",
        "Most govt deals have % of revenue as a component. IDK if this is the case here. Its still going to be a net positive for India.",
        "India is footing 70% of the bill. The money will be used for construction of the facility so it will actually go into pockets of local contractors and Laborers so it’s not that bad. The great thing about local manufacturing is that locals benefit indirectly.",
        "The Adani model",
        "This kind of arm twisting is not unheard of in the US, but it is unheard of in India.\n\nhttps://www.theatlantic.com/magazine/archive/2013/10/how-the-nfl-fleeces-taxpayers/309448/\n\nhttps://www.forbes.com/sites/instituteforjustice/2014/03/28/thirty-years-ago-baltimore-tried-to-use-eminent-domain-to-seize-an-nfl-team/\n\nhttps://www.forbes.com/sites/instituteforjustice/2014/03/28/thirty-years-ago-baltimore-tried-to-use-eminent-domain-to-seize-an-nfl-team/",
        "Nope. Answer is simple af - R&D budget",
        "They are being given PLI (production linked incentives) which are tax breaks for a specific time period that is required for the operation to become viable in India. The government is not actually giving them money.",
        "See it is not that difficult to understand this part. We Indians have a lot of brain (processing power), what these companies give or teach when Indians move abroad and work for them is the knowledge and techniques (algorithm). Almost no one makes tech on their own, you need an army of people with decades of experience to build cutting edge tech. So just because Indians can do good work abroad doesn't mean the same here. GE and Mercedes have had their centers in India for decades now, but they are highly restrictive in the work they give here. Also you need good leadership for this stuff, so unless entire teams along with the right attitudes move out of these companies into some indigenous organisation nothing drastic will happen.\n\n\n\nTLDR; Tech is complex, just smart Indians won't work, we need a lot more, it's not the government, it's our inexperience that is setting us back.",
        "Can you share how you came up with these conclusions?",
        "Cutting edge research does not happen in India \n\nIndians do good research in the USA because such an ecosystem exists there.",
        "Can you ELI5 why is it expensive to manufacture in India?",
        "Even if micron pay 100 percent of the bill for construction , it will go to locals right?",
        "If Micron has to pay 100% then they will not build here at all and locals get 0. It’s not about maximizing profit in this case, more about minimizing loss while still starting up a new industry.",
        ">we have a great ally in japan who has the best semiconductor ecosystem and an ageing population\n\nThey have had an ageing population for 3 decades now.\n\nIs our masterstroke to wait for them just die since we have achieved nothing of note when it comes technology transfers so far.\n\nChina on the other hand is investing billions into their own semiconductor industry and will probably achieve parity like they generally do. We are nowhere in the supply chain here and probably won't be anytime soon.",
        "Why not take a stake in the company then? Maybe put this as a 0.1% interest rate. Why give the money for free?\n\nThis is the real freebie.",
        "Because without it being a feeebie the companies have no incentive to move to India. If profit was the primary motivator in every case then the world as we know it wouldn’t exist.",
        "You should see the incredible tax breaks and subsisdies being offered to Apple to move assembly to India. Probably the costliest jobs India has ever purchased but I hope it translates into votes for BJP later so they spend a little less on marketing through PM Cares.",
        "The US and China are thinking the same thing.\n\nThe idea is to achieve it before any of them do which is just not possible with our resources or our speed.",
        ">You have to start somewhere\n\nBy spending like the US on getting a minuscule share of the supply chain in the future?\n\nWe have to keep in mind that we are a desperately poor nation and such massive expenditures in an unplanned manner just for votes is how countries go bankrupt. With this trend we all will have to end up learning Bengali for jobs like the west is learning Chinese.",
        "How will this get the Govt votes?\n\nAnnouncing factories and so-called investments does.",
        ">India should get 40% ownership and get profits in proportion to it.\n\nIndia does not have the local market or the infrastructure to make such demands. We just have taxpayer money to drown the companies in and outspend other more reasonable-minded nations.",
        "While what you’re saying “sounds” correct, I don’t really think that is the case. Let’s walk through the semiconductor manufacturing stack:\n\nDesign / Verification / IP creation - Happens in India but majority owned outside of India.\n\nCAD tool development - Very few players primarily US based companies (Cadence, Synopsos, can’t recollect)\n\nLithography Equipment - ASML (another American company whose name escapes me own the entire market share)\n\nLithography Wafer Fab - TSMC, Global Foundries, SIMC (I’m not sure how big they are) and Samsung are the biggest players in the space. But the rest of major foundries are scattered around Vietnam and across Southeast Asia.\n\nPackaging - I’m not familiar beyond some European ones (my knowledge is extremely limited)\n\nAssembly and manufacturing - Im guessing this is more distributed (my knowledge is limited). \n\nFrom the above article, the micron plant is basically the bottom end of the stack. So we are not developing the critical semiconductor fabrication workforce (the US recognizes this as a crisis) nor are we directly investing into developing semiconductor infrastructure.\n\nNow your statement that this investment would help in developing the semiconductor ecosystem is correct but your logic and analogy is completely wrong. Having more industry will encourage investments in the associated sectors.\n\nComing to your analogy:\n1. The challenge in making a Ferrari is in designing, optimizing the engine and fine tuning the assembly for reaching the performance standards. The challenge with making a Maruti 800 is being able to cost effectively manufacture the volume with good quality control.\n\nNote: They make around 15000 Ferraris every year. Maruti Suzuki makes around 1100000 cars a year. They don’t actually make as many Maruti 800 anymore (it’s an old model now) so I switched it with total volume of Maruti Suzuki.\n\n2. Similarly if we invest in assembly and packaging, we will be the destination as long as we are the cheapest option. If Vietnam government says they will make it tax free and cover cost of labour for the first 5 years, they will move all the manufacturing without any questions asked.\n\n3. If Indian companies developed the IP, they would be able to dictate what happens for the entire lifecycle.  \n\nIf you don’t invest in developing IP, you don’t end up with IP. The scale of investment needs to be atleast 100x of what we do now, if we ever want to catch up. If we invest in IP development now (startups, academic research, core foundries), in 20 years we will reap the benefits. This short term “leap frogging” thinking has actually has been particularly inhibitive for atleast one other technology sector that I have worked in. \n\nI hope this gives you some perspective, I’m not saying it’s bad but let’s not inflate the benefits for 100% funding a foreign companies investment into setting up shop in india.\n\nEdit : formatting",
        "As the Prime Minister, she did not make that one decision alone.\n\nJust like I find it lame to blame Modi for the current woes, I find it difficult to blame Indira Gandhi alone for such decisions. We don't live in an autocratic setup and one person is never ever to blame for a decision.",
        "The Govt foregoing revenue from their tax payer funded investment is a cost.\n\nThis tax payer revenue is being invested here by taking it away from other sectors. There is a cost!\n\nMaking US-style spending decisions with a third-world level taxpayer base hoping to keep pace with the manufacturing miracle of China has and will have a cost!",
        "If there is no plant there then there is no tax revenue from it to fund anything.",
        "Im not familiar with how the expenses will go I’m not gonna comment on it. But I have a longer response to why the investment (while a good first step) is insufficient alone to bring about a long term shift.",
        "You start small , and the desperately poor nation argument has been used endlessly by political parties to oppose everything new , once it was said why do we need computers , now our whole economy is running and thriving because of them . talking about unplanned spending and then saying  learn chinese please look at their debt bubble, and the demographics shit show they are up for  and as far as Bangladesh goes they are stuck at textiles for now and their forex situation is pretty dismal alos the US is actively acting against them till that situation isnt resolved they aren't going far",
        "Well that’s at the state/city level. A more appropriate comparison would be to the TSMC deal they did recently.",
        "Votes ?\nAin't talking about votes here mate.\nSetting up a company will create jobs anyway and bring income to the city/district anyway. So thats that about votes/vote bank politics. \n\nThe main point is, Focus on GDP and Semi-Conductor manufacturing in India.\n\nApart from the obvious foreign investment, India focuses on 'Made In India' and subsequent technology transfer. Be it aviation/fighter jet technology or EV like Tesla.\n\nThis Gujurat government either wants investment or wants this semi-conductor manufacturing company to set shop asap. They paying 70% that too... First time pretty much I believe. I see desperation.",
        "you start somewhere. if we wait for full fledged plant, we will get nothing. we can start from here and build upon it.",
        "vishvaguru",
        "ASML is a Dutch company",
        "This argument was used by Kapil Sibal used to claim there was no 2G scam.\n\nI understand the incentives but for what? Assembling and testing - not designing and manufacturing? On the other hand Intel plans to invest $25B in Israel. Semi race has been lost unfortunately. At the most India will only get the likes of Micron",
        "And complete lack of a supply chain.",
        "“Locals” of Gujarat 😁",
        "There are some industries which would come up in India regardless. For example if this was a soap factory then PLI would be wasteful as the plant would be built there even without incentives and you are just giving tax rebates for no reason.\n\nThere are other industries which would never come up unless incentives were given because we are not competitive in these industries. An example of this is Electronics industry. In these cases, PLIs are helpful. Here if you don’t give tax rebates then you aren’t going to get that factory and as a result aren’t going to get that tax anyway.\n\n>I understand the incentives but for what? Assembling and testing - not designing and manufacturing? On the other hand Intel plans to invest $25B in Israel. Semi race has been lost unfortunately. At the most India will only get the likes of Micron\n\nCorrect. What is happening now should have happened in 80s and 90s. It didn’t. So now we have to play catch-up.",
        "With only two companies standing beyond 5nm and both are investing in Israel, Vietnam, Malaysia, and of course Taiwan. India will not get any major share of semis. This is the global supply chain diversification game US is playing. India has been chosen as the next manufacturing hub to rival China. But India will not manufacture semis. India is so so far behind that unless TSMC or Intel directly invest, which they will not, there’s no chance.\n\nIndia needs to find other creative ways… for example take over ASML! Massive brain drain from ASML, TSMC, Intel and Apple.",
        "I wonder if there is a better way of doing things.",
        "We need to go aggressively after TSMC, Intel, ASML, Apple. Maybe hostile takeover of ASML. Recruit massively from these companies and give them free hand and let the money flow",
        "What’s upstream of assembling that does not exist already? What is downstream? Trucking parts to be assembled?",
        "Yup, I can’t seem to remember the American company’s name though",
        "This deal was a Modi photo op moment to claim that he got a semi plant in India. If India is serious about getting to the top, this is not even a half hearted measure. Fact is, India has lost this battle already. US will not let India have the semiconductor industry",
        "There’s a difference. Incentives for what kind of value add? If India’s value add is $1 of the $1000 chip due to assembling and testing, maybe that incentive is better spent elsewhere",
        "You don’t start half downstream and then upwards integrate, that very very rarely happens. \n\nYou can’t start a bagging and sealing plant with the end goal of a cement plant, that’s just not the way stuff works. \n\nYour reasoning does hold merit if they were doing a core process here and then may have expanded with upstream and downstream integration.\n\nLike you can start with limestone mining and move to cement or start with a cement plant and then get a limestone mine. You don’t start with a bagging plant first.",
        "Acche din aa gaye, I think so. Modi zindabaad.",
        "\n>The idea is to achieve it before any of them do which is just not possible with our resources or our speed\n\nYou're wrong, idea is not compete at the bleeding edge, but make the less complex systems in mass for cheap.  \nLike SoCs for cars, fridge, or packing chips or motherboard assembly or LCDs.  \nWhich India can achieve due to cheaper labour",
        "There is already a huge incentive to come to india. The geo political land has changed in last 10 years, and the west has realized they cannot rely on china. India is to gain tremendously through this. Thats the incentive.",
        "i hate to say this.. but  making semiconductors,  top  AAA quality Video Games, disney/pixar like 3D animated movies, complicated TV or monitor panels and other innovate technologies sometimes or often JUST DOESNT HAPPEN IN INDIA NO MATTER WHAT...\n\nour country is still a \"developing\" country with most people in middle class, lower mid\n\nand as long as there is corruption and politicians going by their way.. it just wont happen.\n\nwe need to fix our fundamentals first like making farmers earn decent(not losses), improve standard of living and improve salary of lower jobs , etc\n\nthen we shall think of semiconductors, mars missions, luxury trains etc",
        "It's 25-30 percent of chip's value. You don't establish a manufacturing base overnight. Uptil 2016-17 we barely had any mobile production in India or defence exports but both have grown tremendously. Obviously we are still nowhere close to China and Vietnam in mobile manufacturing and us in defence exports but it's still something. \n\nTaiwan leads the world in chip manufacturing. The biggest fish in the pond is tsmc. Micron is a decent start incentives given right now for semiconductor manufacturing are huge. Germany and usa are promising 10s of billions of dollars",
        "UK was blocking the purchase of ARM by Nvidia as they were fearful of a US monopoly on mobile chips. And here you are talking about India, a non-Western nation doing a takeover of the only company that makes cutting edge chip manufacturing equipment like it's a walk in the park.",
        "Just geopolitics is not enough. If it was, they would have moved to US itself for semiconductors but it is not financially viable. To make it viable, US government will be providing subsidies to them. We have to offer a better deal than that.",
        "Rome wasnt built in a day, we need to start somewhere",
        "No dear. Upstream of semiconductor assembling is not truck assembling. Please read up a bit more before seething. \n\nUpstream of semiconductor assembling is making the more complex products that use semiconductors. We already have some of them, and as the shortage during the pandemic showed, the global supply chain desperately needs semiconductors, and India could be a cog in the wheel if we get the industry ecosystem here. \n\nDownstream of semiconductor assembly is establishing the local supply chain for procuring the raw materials to make these different, and making these parts ourselves.",
        "How does the US' approval matter? India was able to set up Bangalore as a local alternative to Silicon Valley during the cold war years. It's only easier now",
        "Breaking news: local chemcha learns how semiconductor fabs work.",
        "That is a common issue with all industries. It is why vietnam is growing in manufacturing",
        "> ASML (another American company whose name escapes me own the entire market share)\n\nApplied Materials",
        "Except, the talent that work at Micron will gain work experience at skills that are far more valuable to India's future than any knowledge gained working for that Gujarati fraudster's conglomerate. Micron's value will last even beyond Modi's departure. Adani will lose most of its value once BJP is kicked out of office and they don't get everything they want.",
        "At this point this feels like a worse option than opening up this generation's HAL or BEL etc. \n\nSay what you will about India's socialist period, but some of these early state run enterprises really helped set the ground for private players to later come in. HAL is the primary reason Bangalore is an aerospace hub today.",
        "I wish Modi went to Himalaya and did dhyaan and i would convert too Modism for sure.",
        "I am not complaining. If it wasn't semi conductor, I'd be pissed. \nBut I really wish it was a foundary. Testing is crucial but again, they can simply choose not to do anything cutting edge in India.",
        "*cries in electoral bonds*",
        "Do you think the Dutch would just let one of their most important companies, just taken over like that by a foreign government.",
        "This . Its the lowest end job in semiconductor manufacturing. No real value add or cutting edge technology involved. A country like Malaysia has been doing this for decades but could never move up the value chain to semiconductor fabrication.\n\nA good idea would been to setup a fabrication unit for older nodes for IC's used in non IT industries like automobile etc , and then move up to latest nodes while mastering the technology.",
        "You did right the article right. It is a testing and packaging plant.",
        "DRDO has had a pretty good R&D budget and look at them",
        "True . Its the lowest end job in semiconductor manufacturing. No real value add or cutting edge technology involved. A country like Malaysia has been doing this for decades but could never move up the value chain to semiconductor fabrication.\n\nA good idea would been to setup a fabrication unit for older nodes for IC's used in non IT industries like automobile etc , and then move up to latest modes while mastering the technology.",
        "But who has taller statues?",
        "Almost all of the ip necessary to build cutting edge chips is owned by US companies, who can be told by the US government where they can manufacture and sell. ASML isn't not selling their machines to China because they agree with the US, but because they license necessary IP from US companies to make those machines.",
        "On a more serious note, I think it's more important for india to have labor intensive parts of the chain rather than the technological top end which is probably more automated. The people need jobs or there will be riots soon.",
        "That's so nonsensical.\n\nChina is the second, and was the first on that too for a long time.",
        "No country will do a charity for us. Without solid incentives, companies will never move to India. Beside, no one's stopping an Indian company to build a plant of its own.",
        "And there's no reason for the West to create a dependency on India. I would be careful into believing all the smoke around geopolitics. Trade between the West and China is still strong.",
        "Micron is far better than whatever Adani has to offer. Being an american company, I expect the workers to have some decent work conditions and will learn skills which you prove handy in future.",
        "Anything I dont like is socialism.",
        "They would nationalise ASML  before letting anyone buy it , sub 5nm is only in taiwan and south korea these are crown jewel tech which no one will give , you have to develop them yourself. Taiwan will not let TSMC setup their 3nm fabs in the US at any cost as they need the edge , so that they remain valuable to the world. Until they manage something even smaller",
        "From the article:\n\n> And for those who know technology would realize that the Micron deal is only for packaging of the chips, their assembly and testing, a relatively low end of the electronics industry. It does not touch the core technologies of designing and fabrication of chips, let alone the holy grail of chip-making technology: the lithographic machines that are central to chip fabrication.",
        "He was being satirical",
        "India does have socialism problem, but this aint it",
        "Isn’t this like US using indirect influence to gain on chip making behemoth that is China?\n\nI mean TSMC has been single point of failure as seen in recent past",
        "Only journalists and commentators in r/india are of the foolish opinion that packaging is low end, [while 3D IC packaging technology remains key to extend Moore’s Law](https://www.digitimes.com/news/a20221205VL202/3d-intel.html)",
        "In 1970s a Nun wrote about why was money wasted on exploring space instead of being spent on poor people. NASA wrote back to her in a famous letter titled 'Why explore space ?'\n\nThis is a excerpt from that letter \n\n\"Before trying to describe in more detail how our space program is contributing to the solution of our Earthly problems, I would like to relate briefly a supposedly true story, which may help support the argument. About 400 years ago, there lived a count in a small town in Germany. He was one of the benign counts, and he gave a large part of his income to the poor in his town. This was much appreciated, because poverty was abundant during medieval times, and there were epidemics of the plague which ravaged the country frequently. One day, the count met a strange man. He had a workbench and little laboratory in his house, and he labored hard during the daytime so that he could afford a few hours every evening to work in his laboratory. He ground small lenses from pieces of glass; he mounted the lenses in tubes, and he used these gadgets to look at very small objects. The count was particularly fascinated by the tiny creatures that could be observed with the strong magnification, and which he had never seen before. He invited the man to move with his laboratory to the castle, to become a member of the count's household, and to devote henceforth all his time to the development and perfection of his optical gadgets as a special employee of the count.\n\nThe townspeople, however, became angry when they realized that the count was wasting his money, as they thought, on a stunt without purpose. \"We are suffering from this plague,\" they said, \"while he is paying that man for a useless hobby!\" But the count remained firm. \"I give you as much as I can afford,\" he said, \"but I will also support this man and his work, because I know that someday something will come out of it!\"\n\nIndeed, something very good came out of this work, and also out of similar work done by others at other places: the microscope. It is well known that the microscope has contributed more than any other invention to the progress of medicine, and that the elimination of the plague and many other contagious diseases from most parts of the world is largely a result of studies which the microscope made possible.\n\nThe count, by retaining some of his spending money for research and discovery, contributed far more to the relief of human suffering than he could have contributed by giving all he could possibly spare to his plague-ridden community.\"\n\n\nSpending any money on science always gives us benefits.",
        "*Modiji ne Kiya hai toh kuch soch k hi Kiya hoga*",
        "I think you mean to say that they have done well with a tiny budget. And they have. \n\nBut, truth is that Government does not invest much in R&D. Private sector does very little, too.",
        "No man. India is assembling mobile phones for couple of decades now. Do you see any chances of full fledged mobile manufacturing in India in another decade? I think not.",
        "It just is. India is the most expensive emerging market to manufacture in. The regulatory overhead is quite high and infrastructure has always been a concern.",
        "Lol.. And Gujjus dont pay any tax either to begin with, but we have to pay for this like how the old refineries were setup, god wish I was born in China instead, instead of this failing country.",
        "No company will agree to do so. It is a 10 billion dollar investment minimum for outdated technology. They will set up this plant to test the waters and then maybe commit fully to creating a semiconductor fab.",
        "Rich countries can subsidize, India can't and why should this stupid subsidy be given by the govt, they should ask Ambani Adani to invest.",
        "Why should this plant be subsidized, govt can build hundreds of new hospitals, then also money will go to labourers.",
        "TSMC will not invest in India because we lack the support infrastructure to support semiconductor manufacturing. Which is why they're investing in Japan, US and Germany (also those governments are pouring billions more in subsidies). Because those nations have companies that are not just the end use customers for TSMC, but also several companies in the semiconductor supply chain. Plenty of chip making talent available as well. India has a lot to catch up on. Micron's plant is just the start and it's most a push by Modi. Why else do you think the plant is coming up in Gujarat? Modi just uses the nation's coffers to cement BJP's control and support in Gujarat.",
        "You need to think big. Instant gratification is the enemy of overall progress. There is a reason why governments make plan 10-20 years into the future and not just next 2 yrs. If what they are trying to do works out then it will give 1000x returns over long term. It will uplift a lot of people out of poverty due to the ripple effects.",
        "lol.. this country of idiots and crooks will go nowhere, states dont even cooperate to share river water and u think they govt is capable of planning, lol no progress will happen this country is too broke to go anywhere but down, we were lucky to get some benefits out of globalization, that's ending soon...",
        "Source: trust me bro",
        "It's not that simple. Semiconductor works in a way that those at the cutting edge somehow are able to sell for cheap and make profits. But there are a lot of failures even after huge investments. Micron isn't going to make iPhone chips. They're probably going to make chips for low end use cases or for indigenous missiles etc. If they don't sell at scale at cutting edge, it may not be worth the effort. See the channel Asianometry on YouTube.",
        "Ah thank you ! I kept thinking advanced materials research but I knew I was off (didn’t find anything when I googled it).",
        "Sure, that is kind of exactly my point. My purpose is not to criticize but rather give constructive criticism and pointing out that the goals need to be shifted. \n\nNow in an ideal world, the government unrolls a 20 year roadmap for semiconductor industry development, talking about the entire stack and strategic investments, etc. But since that isn’t the case I find myself pointing out to the community that they need to keep prodding the government to do more. If they don’t prod or ask, they’ll take only the deals to get jobs but not change the status quo.",
        "Basically what isro does as compared to NASA or spacex",
        "Kinda, but not really, ISRO isn't THAT far behind Nasa or SpaceX, they are working on projects of similar scale too, NASA really is underfunded after the space race ended.     \n\n\n\nMeanwhile no one expects India to have sub 1nm fabs in the next 2-3 decades and TSMC, Samsung, Intel all have fabs planned like that in the near future.",
        "This is in fact incorrect. There can be more ways to measure this but at a high level the total semiconductor market last year was $600B and assembly and testing was about $30B.",
        "https://podcasts.apple.com/us/podcast/crafting-a-semiconductor-policy-for-india-with-g/id1476357131?i=1000575740150",
        "The US is funding Samsung's new plant at Taylor, Texas. The Government investing in infrastructure is a good thing.",
        "When you hate Modi blindly so much that you talk against development 🤡",
        "Bangladesh is a sorry example of globalization. MBAs are taught how globalization is good for all as Bangladesh will be an expert in textiles and they can get it done cheaply and corner the market and will be the place for textiles and this will lead to riches which will enable more of Bangladeshis to buy Dell laptops and iPhones. This is what is fed to students in all macro economic classes. This is blatantly wrong.\n\nIn the short run Bangladesh may have benefited a little. But what about textile machinery manufacturing? The chips required for these machines? Those who control the brains of the machines will reap the largest benefits. Not the users of these machines.\n\nThere are property owners who are and get rich and then there are those who pay rent. Bangladesh has been paying rent and has not really owned anything",
        "Post sources or don't say anything. You're embarrassing yourself",
        ">India needs to find other creative ways… for example take over ASML! Massive brain drain from ASML, TSMC, Intel and Apple.\n\nHow old are you? Are you a child or something? Only a child would say something stupid like this in public",
        "thats a good story, and thank you for letting me know it.\n\nbut my point was ... we need to be able to move forward at what we best do.\n\nIndia has one of the best in Agriculture, doctors, software Engineers in the world.. rather than trying to do 10 different things little... we must do 1 thing GREAT.\n\nSpending $30B on semiconductor  and taking 10+ years at this time is just too much to take for india.",
        "OP is some kid making noise without making any research.",
        ">Maybe hostile takeover of ASML\n\nRight, because the US and everyone will let that happen 🤡",
        ">we need to fix our fundamentals first like making farmers earn decent(not losses), improve standard of living and improve salary of lower jobs , etc\n\nTypical socialist mindset.",
        "Applied Materials doesn't make lithography equipment but it makes quite a few of the other equipment (CVD, PVD, etch, CMP, Metrology, etc)",
        "Here you go. 👋 \n\nhttps://www.statista.com/statistics/266973/global-semiconductor-sales-since-1988/\n\nhttps://www.fortunebusinessinsights.com/semiconductor-assembly-and-test-services-sats-market-106429",
        "😆 I like the aggression 😘",
        "What kinda high 🐎 you ride in? Have anything of substance to say?",
        "And the bhakts have arrived…",
        "This is seriously such a dumb post from op..there are valid criticisms of modi and bjp but not shit like this…us is providing $52 billion in subsidies to semiconductor companies, there is no incentive for micron or qualcomm  or other semiconductor companies to do manufacturing in india without subsidies when literally every other developed nation is doling out billions in subsidies for semiconductor production..the economic benefit(especially white collar jobs) of these subsidies will far outweigh the short term cost.",
        "This is for DRAM and NAND. ( That is: RAM, SSD, flash drives, etc). Not processors.",
        "I disagree partly. Labour intensive sections are needed but from  a strategic viewpoint, India depends on foreign imports for most of its silicone needs. Indian manufactured cars, mobiles and especially defence equipment is using foreign made chips. Any sanctions, embargo, war, disruption in supply chain will bring manufacturing to its knees in India.\n\nHence top end products like semiconductors should be manufactured in India to strengthen its manufacturing to outside influences.",
        "But that is what the automotive industry did to start with. Suzuki, Toyota etc started off with assembling plants in India. After liberalization these companies started manufacturing plants instead of just assembling. \n\nSemiconductors are doing the same.",
        "Teenagers on Google, rather that experts who’ve spent 40-50 years in the field, feel confident enough to judge an intricate policy matter. Have we absolutely no faith in committees that make these decisions?\n\nThere are literally two or three companies of the calibre of Micron in the world. No one, repeat no one including the Chinese can replicate this specific tech. Getting micron to set up a Fab unit India is HUGE! Imagine the possibilities once a supply ecosystem starts building around such a large operation.\n\nWe simply don’t have the R & D setup or technical skills for manufacturing high quality hardware that Apple and Samsung will buy. Not sure what exactly they will fabricate but at least we get some tech transfer and internal skills. May be all the desis from Boise move back and help their motherland.",
        "I am not an expert in any way but this what comes to mind,\n\nSetting up a new industry is always expensive. Semiconductors in this case requires skilled labour. To start with, manufactures will hand pick people to lead these factories. Low Supply but high demand states that these people will demand a huge salary, and justifiably so. \n\nSourcing of raw materials is also an issue. Procuring silicone in an area where there was little to no demand previously will be costly. \n\nLastly, government bureaucracy will slow things down. Indian gov is notorious for charging exorbitant taxes on stuff like automobiles.",
        "wow this thread is dumb. people who dont know shit about how the semiconductor ecosystem works are commenting here",
        "This! Owning IP is everything. Indian model is to wait for IP to expire( Generic pharma) or just do it anyway. \n\nDon’t think people realise how big and important Micron is to the semi-conductor industry. \n\nBiggest barrier to entry in this market is the skill/knowledge/investment needed to be able to create IP that improves an existing product and helps sell. Try doing that for fabricating state of the art chips at scale. \n\nMicron FAB is the easiest way to build an internal ecosystem of suppliers and build some fab skill. \n\nHuge that they’ve decided to set this up in India.",
        "We don’t really do software either. We do IT. But we have the skill to at least.",
        "OP, you don’t think development within China wasn’t subsidized by the government? \n\nYears of Easy to attain loans, streamlining processes, infrastructure development, cheap labour and now China is the manufacturing hub of the world. The entire world depends on China, and it would have continued if not for Covid-19. \n\nNow it’s a China +1 model, where most procurement teams considers an alternate supplier and India fits right into the equation. \n\nWe’ve got the labour, the land, the resources. We need the infrastructure (that’s being developed) and the investments to ensure our indigenous players can set up plants of this scale slowly or industries around each factory can grow.",
        "Because babus are still a thing. \n\nBut seriously, regulation and labour laws. If a company actually follows all the regulation it needs to in India, the overheads are big.",
        "\"Anyone I don't like or disagrees with me is a Bhakht\" - Guide to arguing like a 12-year old on the Internet.",
        "Not to your suggestions, because only someone with 0 self awareness would make a comment so asinine and out of touch with reality. \n\nHoney, you need to think before making comments like these.",
        "Correct. However there’s a lot of overlap of these technologies at the packaging level. Gaining an understanding of packaging is crucial for developing the semiconductor industry",
        "Gujrat Model.",
        "It isn’t the same here, automotive assembly in itself is a core process unlike semiconductor assembly and packaging. \n\nLike galvanising or cold rolling essentially isn’t a very hard job but it is a core job. \n\nHell Malaysia has been assembling and packaging for decades at this point and hasn’t upward integrated to fabrication and lithography",
        "I am an electronics engineer and right now India is living in Stone age AFA semiconductor technology is concerned.\n\nThis is just the start and India will have to invest close to $100 billion in next decade to just sustain the semiconductor manufacturing in India.",
        "Back in 80s Suzuki was given a similar deal to setup a plant in India. That triggered automotive industry in India, however at that time Tata and Birla already had   manufacturing of trucks and cars respectively and the cars setup and had a framework of technology, man power and educational institutions.\n\nIndia today neither has technology nor IP or any experience in manufacturing and labour cost is lower in the Philippines. Basically there is no incentive for Micron to setup a plant in India.\nTo offset all these factors subsidies have been given. China has become factory of the world because no one can compete with them on cost. If made in India products have to compete with China, then subsidy ia the only way.\n\n\nForget Gujrat model tell me which CM has been able to get a semiconductor company in India? USA has monopoly in this sector and the technology is coming only when approvals are done at the highest level.",
        "That is a significant step forward from manufacturing resistors and capacitors. Also this is not as low end as it is made out to be.",
        "India is way behind in agricultural tech compared to Israel and Europe, we are net importer of food despite 50% population engaged in agriculture. Doctors are not the top notch, but yes we are close enough. 80% of our software development is just filling excel sheets. Also this do 1 nothing great philosophy applies to an individual or an institute, it cannot be applied to a nation. You cannot force entire nation to focus on that one thing. \n\nAny nation which cannot design and manufacture semiconductors today, tomorrow will be a colony of the one who manufactures it. USA is not idiot to give these technologies to India without getting anything in return. They see clear eminent threat of digital war coming from China.",
        "And you added here what semi guru ji? Contempt!",
        "Bhakts are all Modi Modi when an agreement is signed and when there’s criticism of the details of the agreement Bhakts be like… yeah it has to be this way only ji… Modi will not melt due to some Reddit criticism, you did",
        "Nah I'm always up for some good old constructive debate and I can be wrong plenty of times (everyone are), but your suggestion that India should take over ASML and this is somehow bad/not enough for India is bad faith. \n\nLemme guess: you're going to keep dragging this comment chain because you think not backing down will make you appear like you're right",
        "I know taking over ASML is out there but I also followed that with a more practical one, but bhakts look for items to show their Bhakti.\n\nChina stole a whole lot of IP, and they have recruited insiders from all over the US industry and academia. Modi does not have a semi strategy and these Micron deals are just photo ops.\n\nUS has a strategy, that they will not let India have the tech, they will let Malaysia, Vietnam be the semi hubs. If India really wants it, need to think outta the box and hence ASML target.\n\nCare to contribute anything, anything at all of substance or will you just stand in judgement of the tone of other comments",
        "Hey y’all, here’s a little perspective in relation to international trade and the advantage presented by localizing semiconductor manufacturing in geopolitical strategy.\n\nThe TL;DR is technology and computing acts as a catalyst for other industries, and small technological advancements can lead to significant economic advantage in other sectors. A country is not guaranteed access to outside development, and semiconductors are extremely important.\n\nAfter the Cold War, the United States maintained one critical advantage: its computers. More advanced than Russia’s or China’s, the US was able to grow its computing sector faster using compounding gains and protectionist policies.\n\nToday’s semiconductors are overwhelmingly produced by a few companies– the largest of which is Taiwan Semiconductor Manufacturing Co (TSMC). Like the rest of Taiwan, it’s been embroiled in the hazy miasma of China’s self-determinist expansionism. As the world’s leading producer of semiconductors its fate has drawn global attention; particularly from the United States. It’s begun to expand global production but has been forced into developing failsafes in the case it loses control over its manufacturing and IP to China in case China chooses to act with the same protectionism that led to US technological superiority in the late 20th century.\n\nThis of course ignores the importance of the semiconductor in manufacturing; having a foundry means access to a key industrial resource domestically. \nThe semiconductor is not just a product; it is foundational to modern life. The reason countries are so keen to have semiconductor firms expand into them is their value as a strategic resource. \n\nIt’s unlikely for India to compete on the technological front. But having access to quality semiconductors means having access to the same technologies as its contemporaries and counterparts. In a world that’s slowly polarizing, there’s sense in guaranteeing yourself access to a key resource.",
        "How are you so sure that they're photo ops? Have you gone to the site and did you ever do any investigating? Just like that throw some comments and cry when people call you out. \n\n>Care to contribute anything, anything at all of substance or will you just stand in judgement of the tone of other comments\n\nI mean, I have thoughts but yeah I'm just mocking you because of how whacky you are. \n\n>If India really wants it, need to think outta the box and hence ASML target.\n\nAgain.....reeks of peak 🤡 behavior.",
        "Each of these company's valuation is close to India's GDP. Forget about the legal complexities and their significance to the USA in world dominance, please enlighten me from where would the money come from?",
        "Tell me 1 Indian company that can match up to companies like Apple, Google, HP. \nBanglore is a silicon valley only for Indians not to the world.",
        "> Banglore is a silicon valley only for Indians\n\nNo shit Sherlock. Bangalore is indeed Silicon Valley for Indians and that's important because it has provided these highly qualified Indians a means to do cutting-edge work right from within India without having to look abroad for opportunities. And also, it is not my problem if you think Bangalore is only TCS, Wipro, and Infosys.\n\nIn the context of my earlier point, it was that companies like TCS and Infosys were built on the backbone of an established clientele from the US. A lot of early work happened when US did not favor India.",
        "> who can be told by the US government where they can manufacture and sell.\n\nThe US courts India today as a viable alternative to China. So, this is the easier part. The harder part is to convince companies that India can indeed not disappoint as a semiconductor hub, and no company is going to dip it's toes in an uncertain ecosystem. Setting it up first is necessary before you can court manufacturers. And that won't be possible without doling out incentives in the initial stages.",
        "Dude in terms of innovation we are zilch. It is just that we are doing backend maintenance work.\nWhatever IP creation is done is for the US based companies only.",
        "Ok, I tried but bhakts be bhakt with hidden thoughts \n\nYou win 🥇 🏆",
        "Dude if you think innovation happens only in the US because all the world's best companies are headquartered there, then it is you who has to do more reading. \n\nYou think Walmart Labs in Bangalore is doing maintenance work for Walmart? The Intel office close by can be a suburb in itself. You think they do customer support for disgruntled chip customers? Do yourself a favor and read up JDs posted by these companies from time to time. \n\nA lot of cutting-edge work for US companies happen outside their country.\n\nAnyway, convincing you is not my job, and your post is not even relevant to the topic of this article. So I am going to leave it at that.",
        "True, but there has to be a system in India that is \"normal\" in so far as the rules are known and things are regular.  No courts that swing off politics.  No governments that want one to win and another to lose.  Regulations that don't change cause someone got mad.  India as I see as both too many and too few rules.  Too many rules such that any one thing can screw up a project if one wants, and two few on those who would wish to screw up a project.",
        ">So now we have to play catch-up.\n\nWhat academics, researchers, and Govt's have understood is that there are development cycles and if those are missed, you have to be prepped for the next one. A nation cannot participate in a race when they feel like it.\n\nEg the manufacturing boom in electronics that moved out of China was taken advantage of by Vietnam and to a much smaller extent Indonesia. There is no catchup here.\n\nThe manufacturing boom in textiles that moved out of China was taken over by Bangladesh and a much smaller extent by Pakistan. There is again no catchup here.\n\nThe next cycle will happen with a new set off opportunities and when it happens and if India misses that too, there is no catch-up to be played and even if we force it through, it is extremely expensive and needs to be backed by a coordinated effort from the private and public sector plus Ministry of External Affairs.\n\nIndia can only manage to achieve any sort of parity when batting for a few chosen industrialists with the whole diplomatic might of the Indian establishment but for an Industry generally, we have not fared well.\n\nThe lack of this understanding is a huge knowledge gap among the voters of today and there is a reason why we keep giving our power and agency to corrupt and incompetent people.",
        "I have clearly mentioned that whatever little innovation is happening is for US based companies, they are the owners of IP.",
        "Is there any actual mobile production in India, or is that all imports of kits and a bunch of assembly like work?",
        "Volumes. Manufacturing is cheap when you can amortise the fixed cost of something over millions of units, or hundreds. If you need to build the entire plant for 1 unit, that's a lot more expensive, in relative terms.",
        "The only companies who can think of making sub 1 nm chips in the near future are TSMC, Samsung and Intel. \nTSMC will be making its first 3nm chips for iPhone 15 series late this year.\nSo noone expects india or any other country for that matter to fab sub 1nm chips in the near future.",
        "Intel and Samsung both have plans for Sub 1nm in next 10 years mate, Samsung is barely 2 years behind TSMC rn and Intel is catching up rapidly",
        "Thats what i said\n\nAdvanced chip fabrication is monopolised by few players.\n\nMany countries are nowhere near these giants let alone india.\nIndia should start making baby steps first",
        "I totally agree with you, unlike Taiwan, Germany, US, South Korea, US, Netherlands, China, and maybe Japan.     \nAs I said, India would not be competing in the bleeding edge, nor has any plans to do so\nIndia will be competiting in cheap mass manufacturing of less complex systems",
        "You keep saying 'Bhakt' like that's somehow going to insult me.",
        "Babes 😘",
        "lol.. We are country of idiots, lol These companies are not going transfer anything, those with technical skills wont live in India, it's a mediocre standard of living, instead of investing in improving standard of living, we have investment in subsidies for billionaires.",
        "Testing and packaging is not trivial. It still involves cutting edge technologies. Setting up a test/packaging facility means many things will follow\n- many test/packaging equipment vendors will set up shop in India, some of which also provide equipment for logic chip fabrication. Getting them to set up offices in India is a very important step. This also sets up the supply chain partially as many items are common between test/packaging and a logic fab.\n- test/packaging fabs are also clean rooms and can have the same infrastructure as a logic manufacturing clean room (depending on the product). India doesn't have such big clean room fabs yet. Setting up these big packaging fabs is a pre-cursor to eventually setting up logic fabs (in terms of infrastructure development experience).\n- the talent required for a manufacturing technician/engineer in a test/packaging fab is the same as that required in a logic fab. So these facilities will also create a talent pool.\n- demonstrating a successful operation of a test/packaging facility will build trust in india and encourage more companies to set up fabs in India.",
        ">  Fab unit in India\n\n\nNah, it's a \"processing, packaging and testing\" unit, which is definitely not a Fab. But it's still a  win nonetheless.\n\n\nFinancial Times reports that the revised DLI 2.0 Scheme has attracted 2 companies (out of 14 that applied) are in \"Good talks\" with the government to set up Fabs, so fingers crossed.\n\n\n> We simply don't have R&D\n\n\nWe definitely do. Many if not the most designs of semiconductors are designed in India, then sent to countries with Fabs (Taiwan, Korea, USA and China). Many of the Fab companies have a sizable presence and workforce in India. The problem is that we lack the manufacturing capability.",
        "Testing and packaging is not trivial. It still involves cutting edge technologies. Setting up a test/packaging facility means many things will follow\n- many test/packaging equipment vendors will set up shop in India, some of which also provide equipment for logic chip fabrication. Getting them to set up offices in India is a very important step. This also sets up the supply chain partially as many items are common between test/packaging and a logic fab.\n- test/packaging fabs are also clean rooms and can have the same infrastructure as a logic manufacturing clean room (depending on the product). India doesn't have such big clean room fabs yet. Setting up these big packaging fabs is a pre-cursor to eventually setting up logic fabs (in terms of infrastructure development experience).\n- the talent required for a manufacturing technician/engineer in a test/packaging fab is the same as that required in a logic fab. So these facilities will also create a talent pool.\n- demonstrating a successful operation of a test/packaging facility will build trust in india and encourage more companies to set up fabs in India.",
        "> take over ASML\n\n\nDo you for a second of rational and critical thinking think that the Dutch (who own MORE than 80% of the market share in lithography)would just sit back from a hostile takeover by a government??\n\n\nThis isn't Wolf of Wall Street",
        "Large scale manufacturing is what I was referring to. Of course, all the star electrical engineers do is design semi conductors in what is mostly an academic exercise. Where is the made in India chip that goes into any phone?",
        "If you don't know how to read news, you can trust me bro.",
        "Private companies are far ahead. HAL and BEL cannot compete with them."
    ],
    "cleaned_text": "india pay cost micron planta curious business model countercurrents gujarat model development also micron aint great test us eu dont want india rise high tech stuff want indian labour manufacturing consumer goods vietnam malaysia leading semiconductor front india nowhere picture puny investments semiconductors modiwashing semiconductor failure india ",
    "cleaned_title": "india pay cost micron planta curious business model countercurrents",
    "cleaned_selftext": "gujarat model development also micron aint great test us eu dont want india rise high tech stuff want indian labour manufacturing consumer goods vietnam malaysia leading semiconductor front india nowhere picture puny investments semiconductors modiwashing semiconductor failure india",
    "cleaned_comments": "like adani deal wait footing entire bill normal know us spending new tsmc foundries im sure much bill theyre paying though gripe things get manufacturing still dont much bring ip india end day dont generate new ip step forward think theres done youre looking wrong way reason paying simply need decent semiconductor fab yeah cutting edge stuff still way better nothing case war factory bring experience local workers indian engineers used later higher tech factory isnt wrong step need semiconductor industry asap much need us shit foxconn apple assembly thingy well better crucial ssd cheaper anyway arse decision excerpt fabrication plant assembly packaging plant need technology transfer well want cheap manufacturing costs labor india kapish yeah india could hardware software unique position build export entire products internationally exports explode semiconductor products expensive make india getting currently established channels also defense manufacturing deal issue manufacturing part jets india pricier locally sourced americans price india paying set high technolog rd manufacturing long way ahead socialize losses privatize profits india get ownership get profits proportion could channeled development projects space important indira gandhi havent leader forethought government many issues thought fire gutted factory amazed well saddened india lost assassination whole south asia would different lived life happening world covid semiconductor shortage major countries offering huge incentives making semiconductors countries claiming woman enacted emergency forethought peak stupidity everyone pluses negatives totally stupid recognize strategic acumen nuclear weapons thinking pharmaceutical industry semi conductors way ahead others stupid parade pms weve since including son makes giant indeed india already semiconductor fabs owned goi manufactured siliconnm think used isro drdo fact despite program place decades zero innovation government needs look hard indian engineers produce chips moving us cant india thatd lot looking get future smart people make new cars least access old car manufacturing plants cant produce ferrarri without even capacity produce maruti using analogy firm footing basic semiconductoring great ally japan best semiconductor ecosystem ageing population need indian labor added bonus reduced costs invested lot india given us crucial techs needed socialism work start somewhere cant expect start manufacturing sub nm chips directly country semiconductor supply chain preexisting fabs first basic low end stuff setup hopefully start climb value chain years come need fabs india likes tsmc others interested manufacturing unless get massive subsidies places world much suited kind work india every govt spending money hand fist get fabs setup country us giving subsidies worth billion rebuild semiconductor ecosystem context thats entire budget year exclude military spending dont mind govt giving subsidies till manage climb value chain years come doesnt happen lets take pitchforks guys assembly plant fab completely useless made india owned indians one big contributor mature affordable supply chain network china working since okay becoming semiconductor hub chicken egg problem companies wont set unless incentivized heavily taking care cost onetime investment return micron set center help bring dozens upstream downstream businesses contribute towards building wellneeded ecosystem players move set shop whats point arguing going get right wing government stop giving money corporations govt deals revenue component idk case still going net positive india india footing bill money used construction facility actually go pockets local contractors laborers bad great thing local manufacturing locals benefit indirectly adani model kind arm twisting unheard us unheard india nope answer simple af rd budget given pli production linked incentives tax breaks specific time period required operation become viable india government actually giving money see difficult understand part indians lot brain processing power companies give teach indians move abroad work knowledge techniques algorithm almost one makes tech need army people decades experience build cutting edge tech indians good work abroad doesnt mean ge mercedes centers india decades highly restrictive work give also need good leadership stuff unless entire teams along right attitudes move companies indigenous organisation nothing drastic happen tldr tech complex smart indians wont work need lot government inexperience setting us back share came conclusions cutting edge research happen india indians good research usa ecosystem exists eli expensive manufacture india even micron pay percent bill construction go locals right micron pay build locals get maximizing profit case minimizing loss still starting new industry great ally japan best semiconductor ecosystem ageing population ageing population decades masterstroke wait die since achieved nothing note comes technology transfers far china hand investing billions semiconductor industry probably achieve parity like generally nowhere supply chain probably wont anytime soon take stake company maybe put interest rate give money free real freebie without feeebie companies incentive move india profit primary motivator every case world know wouldnt exist see incredible tax breaks subsisdies offered apple move assembly india probably costliest jobs india ever purchased hope translates votes bjp later spend little less marketing pm cares us china thinking thing idea achieve possible resources speed start somewhere spending like us getting minuscule share supply chain future keep mind desperately poor nation massive expenditures unplanned manner votes countries go bankrupt trend end learning bengali jobs like west learning chinese get govt votes announcing factories socalled investments india get ownership get profits proportion india local market infrastructure make demands taxpayer money drown companies outspend reasonableminded nations youre saying sounds correct dont really think case lets walk semiconductor manufacturing stack design verification ip creation happens india majority owned outside india cad tool development players primarily us based companies cadence synopsos cant recollect lithography equipment asml another american company whose name escapes entire market share lithography wafer fab tsmc global foundries simc im sure big samsung biggest players space rest major foundries scattered around vietnam across southeast asia packaging im familiar beyond european ones knowledge extremely limited assembly manufacturing im guessing distributed knowledge limited article micron plant basically bottom end stack developing critical semiconductor fabrication workforce us recognizes crisis directly investing developing semiconductor infrastructure statement investment would help developing semiconductor ecosystem correct logic analogy completely wrong industry encourage investments associated sectors coming analogy challenge making ferrari designing optimizing engine fine tuning assembly reaching performance standards challenge making maruti able cost effectively manufacture volume good quality control note make around ferraris every year maruti suzuki makes around cars year dont actually make many maruti anymore old model switched total volume maruti suzuki similarly invest assembly packaging destination long cheapest option vietnam government says make tax free cover cost labour first years move manufacturing without questions asked indian companies developed ip would able dictate happens entire lifecycle dont invest developing ip dont end ip scale investment needs atleast x ever want catch invest ip development startups academic research core foundries years reap benefits short term leap frogging thinking actually particularly inhibitive atleast one technology sector worked hope gives perspective im saying bad lets inflate benefits funding foreign companies investment setting shop india edit formatting prime minister make one decision alone like find lame blame modi current woes find difficult blame indira gandhi alone decisions dont live autocratic setup one person never ever blame decision govt foregoing revenue tax payer funded investment cost tax payer revenue invested taking away sectors cost making usstyle spending decisions thirdworld level taxpayer base hoping keep pace manufacturing miracle china cost plant tax revenue fund anything im familiar expenses go im gon na comment longer response investment good first step insufficient alone bring long term shift start small desperately poor nation argument used endlessly political parties oppose everything new said need computers whole economy running thriving talking unplanned spending saying learn chinese please look debt bubble demographics shit show far bangladesh goes stuck textiles forex situation pretty dismal alos us actively acting till situation isnt resolved arent going far well thats statecity level appropriate comparison would tsmc deal recently votes aint talking votes mate setting company create jobs anyway bring income citydistrict anyway thats votesvote bank politics main point focus gdp semiconductor manufacturing india apart obvious foreign investment india focuses made india subsequent technology transfer aviationfighter jet technology ev like tesla gujurat government either wants investment wants semiconductor manufacturing company set shop asap paying first time pretty much believe see desperation start somewhere wait full fledged plant get nothing start build upon vishvaguru asml dutch company argument used kapil sibal used claim g scam understand incentives assembling testing designing manufacturing hand intel plans invest b israel semi race lost unfortunately india get likes micron complete lack supply chain locals gujarat industries would come india regardless example soap factory pli would wasteful plant would built even without incentives giving tax rebates reason industries would never come unless incentives given competitive industries example electronics industry cases plis helpful dont give tax rebates arent going get factory result arent going get tax anyway understand incentives assembling testing designing manufacturing hand intel plans invest b israel semi race lost unfortunately india get likes micron correct happening happened didnt play catchup two companies standing beyond nm investing israel vietnam malaysia course taiwan india get major share semis global supply chain diversification game us playing india chosen next manufacturing hub rival china india manufacture semis india far behind unless tsmc intel directly invest theres chance india needs find creative ways example take asml massive brain drain asml tsmc intel apple wonder better way things need go aggressively tsmc intel asml apple maybe hostile takeover asml recruit massively companies give free hand let money flow whats upstream assembling exist already downstream trucking parts assembled yup cant seem remember american companys name though deal modi photo op moment claim got semi plant india india serious getting top even half hearted measure fact india lost battle already us let india semiconductor industry theres difference incentives kind value add indias value add chip due assembling testing maybe incentive better spent elsewhere dont start half downstream upwards integrate rarely happens cant start bagging sealing plant end goal cement plant thats way stuff works reasoning hold merit core process may expanded upstream downstream integration like start limestone mining move cement start cement plant get limestone mine dont start bagging plant first acche din aa gaye think modi zindabaad idea achieve possible resources speed youre wrong idea compete bleeding edge make less complex systems mass cheap like socs cars fridge packing chips motherboard assembly lcds india achieve due cheaper labour already huge incentive come india geo political land changed last years west realized rely china india gain tremendously thats incentive hate say making semiconductors top aaa quality video games disneypixar like animated movies complicated tv monitor panels innovate technologies sometimes often doesnt happen india matter country still developing country people middle class lower mid long corruption politicians going way wont happen need fix fundamentals first like making farmers earn decentnot losses improve standard living improve salary lower jobs etc shall think semiconductors mars missions luxury trains etc percent chips value dont establish manufacturing base overnight uptil barely mobile production india defence exports grown tremendously obviously still nowhere close china vietnam mobile manufacturing us defence exports still something taiwan leads world chip manufacturing biggest fish pond tsmc micron decent start incentives given right semiconductor manufacturing huge germany usa promising billions dollars uk blocking purchase arm nvidia fearful us monopoly mobile chips talking india nonwestern nation takeover company makes cutting edge chip manufacturing equipment like walk park geopolitics enough would moved us semiconductors financially viable make viable us government providing subsidies offer better deal rome wasnt built day need start somewhere dear upstream semiconductor assembling truck assembling please read bit seething upstream semiconductor assembling making complex products use semiconductors already shortage pandemic showed global supply chain desperately needs semiconductors india could cog wheel get industry ecosystem downstream semiconductor assembly establishing local supply chain procuring raw materials make different making parts us approval matter india able set bangalore local alternative silicon valley cold war years easier breaking news local chemcha learns semiconductor fabs work common issue industries vietnam growing manufacturing asml another american company whose name escapes entire market share applied materials except talent work micron gain work experience skills far valuable indias future knowledge gained working gujarati fraudsters conglomerate microns value last even beyond modis departure adani lose value bjp kicked office dont get everything want point feels like worse option opening generations hal bel etc say indias socialist period early state run enterprises really helped set ground private players later come hal primary reason bangalore aerospace hub today wish modi went himalaya dhyaan would convert modism sure complaining wasnt semi conductor id pissed really wish foundary testing crucial simply choose anything cutting edge india cries electoral bonds think dutch would let one important companies taken like foreign government lowest end job semiconductor manufacturing real value add cutting edge technology involved country like malaysia decades could never move value chain semiconductor fabrication good idea would setup fabrication unit older nodes ics used non industries like automobile etc move latest nodes mastering technology right article right testing packaging plant drdo pretty good rd budget look true lowest end job semiconductor manufacturing real value add cutting edge technology involved country like malaysia decades could never move value chain semiconductor fabrication good idea would setup fabrication unit older nodes ics used non industries like automobile etc move latest modes mastering technology taller statues almost ip necessary build cutting edge chips owned us companies told us government manufacture sell asml isnt selling machines china agree us license necessary ip us companies make machines serious note think important india labor intensive parts chain rather technological top end probably automated people need jobs riots soon thats nonsensical china second first long time country charity us without solid incentives companies never move india beside ones stopping indian company build plant theres reason west create dependency india would careful believing smoke around geopolitics trade west china still strong micron far better whatever adani offer american company expect workers decent work conditions learn skills prove handy future anything dont like socialism would nationalise asml letting anyone buy sub nm taiwan south korea crown jewel tech one give develop taiwan let tsmc setup nm fabs us cost need edge remain valuable world manage something even smaller article know technology would realize micron deal packaging chips assembly testing relatively low end electronics industry touch core technologies designing fabrication chips let alone holy grail chipmaking technology lithographic machines central chip fabrication satirical india socialism problem aint isnt like us using indirect influence gain chip making behemoth china mean tsmc single point failure seen recent past journalists commentators rindia foolish opinion packaging low end ic packaging technology remains key extend moores lawhttpswwwdigitimescomnewsavldintelhtml nun wrote money wasted exploring space instead spent poor people nasa wrote back famous letter titled explore space excerpt letter trying describe detail space program contributing solution earthly problems would like relate briefly supposedly true story may help support argument years ago lived count small town germany one benign counts gave large part income poor town much appreciated poverty abundant medieval times epidemics plague ravaged country frequently one day count met strange man workbench little laboratory house labored hard daytime could afford hours every evening work laboratory ground small lenses pieces glass mounted lenses tubes used gadgets look small objects count particularly fascinated tiny creatures could observed strong magnification never seen invited man move laboratory castle become member counts household devote henceforth time development perfection optical gadgets special employee count townspeople however became angry realized count wasting money thought stunt without purpose suffering plague said paying man useless hobby count remained firm give much afford said also support man work know someday something come indeed something good came work also similar work done others places microscope well known microscope contributed invention progress medicine elimination plague many contagious diseases parts world largely result studies microscope made possible count retaining spending money research discovery contributed far relief human suffering could contributed giving could possibly spare plagueridden community spending money science always gives us benefits modiji ne kiya hai toh kuch soch k hi kiya hoga think mean say done well tiny budget truth government invest much rd private sector little man india assembling mobile phones couple decades see chances full fledged mobile manufacturing india another decade think india expensive emerging market manufacture regulatory overhead quite high infrastructure always concern lol gujjus dont pay tax either begin pay like old refineries setup god wish born china instead instead failing country company agree billion dollar investment minimum outdated technology set plant test waters maybe commit fully creating semiconductor fab rich countries subsidize india cant stupid subsidy given govt ask ambani adani invest plant subsidized govt build hundreds new hospitals also money go labourers tsmc invest india lack support infrastructure support semiconductor manufacturing theyre investing japan us germany also governments pouring billions subsidies nations companies end use customers tsmc also several companies semiconductor supply chain plenty chip making talent available well india lot catch microns plant start push modi else think plant coming gujarat modi uses nations coffers cement bjps control support gujarat need think big instant gratification enemy overall progress reason governments make plan years future next yrs trying works give x returns long term uplift lot people poverty due ripple effects lol country idiots crooks go nowhere states dont even cooperate share river water u think govt capable planning lol progress happen country broke go anywhere lucky get benefits globalization thats ending soon source trust bro simple semiconductor works way cutting edge somehow able sell cheap make profits lot failures even huge investments micron isnt going make iphone chips theyre probably going make chips low end use cases indigenous missiles etc dont sell scale cutting edge may worth effort see channel asianometry youtube ah thank kept thinking advanced materials research knew didnt find anything googled sure kind exactly point purpose criticize rather give constructive criticism pointing goals need shifted ideal world government unrolls year roadmap semiconductor industry development talking entire stack strategic investments etc since isnt case find pointing community need keep prodding government dont prod ask theyll take deals get jobs change status quo basically isro compared nasa spacex kinda really isro isnt far behind nasa spacex working projects similar scale nasa really underfunded space race ended meanwhile one expects india sub nm fabs next decades tsmc samsung intel fabs planned like near future fact incorrect ways measure high level total semiconductor market last year b assembly testing b us funding samsungs new plant taylor texas government investing infrastructure good thing hate modi blindly much talk development bangladesh sorry example globalization mbas taught globalization good bangladesh expert textiles get done cheaply corner market place textiles lead riches enable bangladeshis buy dell laptops iphones fed students macro economic classes blatantly wrong short run bangladesh may benefited little textile machinery manufacturing chips required machines control brains machines reap largest benefits users machines property owners get rich pay rent bangladesh paying rent really owned anything post sources dont say anything youre embarrassing india needs find creative ways example take asml massive brain drain asml tsmc intel apple old child something child would say something stupid like public thats good story thank letting know point need able move forward best india one best agriculture doctors software engineers world rather trying different things little must thing great spending b semiconductor taking years time much take india op kid making noise without making research maybe hostile takeover asml right us everyone let happen need fix fundamentals first like making farmers earn decentnot losses improve standard living improve salary lower jobs etc typical socialist mindset applied materials doesnt make lithography equipment makes quite equipment cvd pvd etch cmp metrology etc go like aggression kinda high ride anything substance say bhakts arrived seriously dumb post opthere valid criticisms modi bjp shit like thisus providing billion subsidies semiconductor companies incentive micron qualcomm semiconductor companies manufacturing india without subsidies literally every developed nation doling billions subsidies semiconductor productionthe economic benefitespecially white collar jobs subsidies far outweigh short term cost dram nand ram ssd flash drives etc processors disagree partly labour intensive sections needed strategic viewpoint india depends foreign imports silicone needs indian manufactured cars mobiles especially defence equipment using foreign made chips sanctions embargo war disruption supply chain bring manufacturing knees india hence top end products like semiconductors manufactured india strengthen manufacturing outside influences automotive industry start suzuki toyota etc started assembling plants india liberalization companies started manufacturing plants instead assembling semiconductors teenagers google rather experts whove spent years field feel confident enough judge intricate policy matter absolutely faith committees make decisions literally two three companies calibre micron world one repeat one including chinese replicate specific tech getting micron set fab unit india huge imagine possibilities supply ecosystem starts building around large operation simply dont r setup technical skills manufacturing high quality hardware apple samsung buy sure exactly fabricate least get tech transfer internal skills may desis boise move back help motherland expert way comes mind setting new industry always expensive semiconductors case requires skilled labour start manufactures hand pick people lead factories low supply high demand states people demand huge salary justifiably sourcing raw materials also issue procuring silicone area little demand previously costly lastly government bureaucracy slow things indian gov notorious charging exorbitant taxes stuff like automobiles wow thread dumb people dont know shit semiconductor ecosystem works commenting owning ip everything indian model wait ip expire generic pharma anyway dont think people realise big important micron semiconductor industry biggest barrier entry market skillknowledgeinvestment needed able create ip improves existing product helps sell try fabricating state art chips scale micron fab easiest way build internal ecosystem suppliers build fab skill huge theyve decided set india dont really software either skill least op dont think development within china wasnt subsidized government years easy attain loans streamlining processes infrastructure development cheap labour china manufacturing hub world entire world depends china would continued covid china model procurement teams considers alternate supplier india fits right equation weve got labour land resources need infrastructure thats developed investments ensure indigenous players set plants scale slowly industries around factory grow babus still thing seriously regulation labour laws company actually follows regulation needs india overheads big anyone dont like disagrees bhakht guide arguing like year old internet suggestions someone self awareness would make comment asinine touch reality honey need think making comments like correct however theres lot overlap technologies packaging level gaining understanding packaging crucial developing semiconductor industry gujrat model isnt automotive assembly core process unlike semiconductor assembly packaging like galvanising cold rolling essentially isnt hard job core job hell malaysia assembling packaging decades point hasnt upward integrated fabrication lithography electronics engineer right india living stone age afa semiconductor technology concerned start india invest close billion next decade sustain semiconductor manufacturing india back suzuki given similar deal setup plant india triggered automotive industry india however time tata birla already manufacturing trucks cars respectively cars setup framework technology man power educational institutions india today neither technology ip experience manufacturing labour cost lower philippines basically incentive micron setup plant india offset factors subsidies given china become factory world one compete cost made india products compete china subsidy ia way forget gujrat model tell cm able get semiconductor company india usa monopoly sector technology coming approvals done highest level significant step forward manufacturing resistors capacitors also low end made india way behind agricultural tech compared israel europe net importer food despite population engaged agriculture doctors top notch yes close enough software development filling excel sheets also nothing great philosophy applies individual institute applied nation force entire nation focus one thing nation design manufacture semiconductors today tomorrow colony one manufactures usa idiot give technologies india without getting anything return see clear eminent threat digital war coming china added semi guru ji contempt bhakts modi modi agreement signed theres criticism details agreement bhakts like yeah way ji modi melt due reddit criticism nah im always good old constructive debate wrong plenty times everyone suggestion india take asml somehow badnot enough india bad faith lem guess youre going keep dragging comment chain think backing make appear like youre right know taking asml also followed practical one bhakts look items show bhakti china stole whole lot ip recruited insiders us industry academia modi semi strategy micron deals photo ops us strategy let india tech let malaysia vietnam semi hubs india really wants need think outta box hence asml target care contribute anything anything substance stand judgement tone comments hey yall heres little perspective relation international trade advantage presented localizing semiconductor manufacturing geopolitical strategy tldr technology computing acts catalyst industries small technological advancements lead significant economic advantage sectors country guaranteed access outside development semiconductors extremely important cold war united states maintained one critical advantage computers advanced russias chinas us able grow computing sector faster using compounding gains protectionist policies todays semiconductors overwhelmingly produced companies largest taiwan semiconductor manufacturing co tsmc like rest taiwan embroiled hazy miasma chinas selfdeterminist expansionism worlds leading producer semiconductors fate drawn global attention particularly united states begun expand global production forced developing failsafes case loses control manufacturing ip china case china chooses act protectionism led us technological superiority late th century course ignores importance semiconductor manufacturing foundry means access key industrial resource domestically semiconductor product foundational modern life reason countries keen semiconductor firms expand value strategic resource unlikely india compete technological front access quality semiconductors means access technologies contemporaries counterparts world thats slowly polarizing theres sense guaranteeing access key resource sure theyre photo ops gone site ever investigating like throw comments cry people call care contribute anything anything substance stand judgement tone comments mean thoughts yeah im mocking whacky india really wants need think outta box hence asml target againreeks peak behavior companys valuation close indias gdp forget legal complexities significance usa world dominance please enlighten would money come tell indian company match companies like apple google hp banglore silicon valley indians world banglore silicon valley indians shit sherlock bangalore indeed silicon valley indians thats important provided highly qualified indians means cuttingedge work right within india without look abroad opportunities also problem think bangalore tcs wipro infosys context earlier point companies like tcs infosys built backbone established clientele us lot early work happened us favor india told us government manufacture sell us courts india today viable alternative china easier part harder part convince companies india indeed disappoint semiconductor hub company going dip toes uncertain ecosystem setting first necessary court manufacturers wont possible without doling incentives initial stages dude terms innovation zilch backend maintenance work whatever ip creation done us based companies ok tried bhakts bhakt hidden thoughts win dude think innovation happens us worlds best companies headquartered reading think walmart labs bangalore maintenance work walmart intel office close suburb think customer support disgruntled chip customers favor read jds posted companies time time lot cuttingedge work us companies happen outside country anyway convincing job post even relevant topic article going leave true system india normal far rules known things regular courts swing politics governments want one win another lose regulations dont change cause someone got mad india see many rules many rules one thing screw project one wants two would wish screw project play catchup academics researchers govts understood development cycles missed prepped next one nation participate race feel like eg manufacturing boom electronics moved china taken advantage vietnam much smaller extent indonesia catchup manufacturing boom textiles moved china taken bangladesh much smaller extent pakistan catchup next cycle happen new set opportunities happens india misses catchup played even force extremely expensive needs backed coordinated effort private public sector plus ministry external affairs india manage achieve sort parity batting chosen industrialists whole diplomatic might indian establishment industry generally fared well lack understanding huge knowledge gap among voters today reason keep giving power agency corrupt incompetent people clearly mentioned whatever little innovation happening us based companies owners ip actual mobile production india imports kits bunch assembly like work volumes manufacturing cheap amortise fixed cost something millions units hundreds need build entire plant unit thats lot expensive relative terms companies think making sub nm chips near future tsmc samsung intel tsmc making first nm chips iphone series late year noone expects india country matter fab sub nm chips near future intel samsung plans sub nm next years mate samsung barely years behind tsmc rn intel catching rapidly thats said advanced chip fabrication monopolised players many countries nowhere near giants let alone india india start making baby steps first totally agree unlike taiwan germany us south korea us netherlands china maybe japan said india would competing bleeding edge plans india competiting cheap mass manufacturing less complex systems keep saying bhakt like thats somehow going insult babes lol country idiots lol companies going transfer anything technical skills wont live india mediocre standard living instead investing improving standard living investment subsidies billionaires testing packaging trivial still involves cutting edge technologies setting testpackaging facility means many things follow many testpackaging equipment vendors set shop india also provide equipment logic chip fabrication getting set offices india important step also sets supply chain partially many items common testpackaging logic fab testpackaging fabs also clean rooms infrastructure logic manufacturing clean room depending product india doesnt big clean room fabs yet setting big packaging fabs precursor eventually setting logic fabs terms infrastructure development experience talent required manufacturing technicianengineer testpackaging fab required logic fab facilities also create talent pool demonstrating successful operation testpackaging facility build trust india encourage companies set fabs india fab unit india nah processing packaging testing unit definitely fab still win nonetheless financial times reports revised dli scheme attracted companies applied good talks government set fabs fingers crossed simply dont rd definitely many designs semiconductors designed india sent countries fabs taiwan korea usa china many fab companies sizable presence workforce india problem lack manufacturing capability testing packaging trivial still involves cutting edge technologies setting testpackaging facility means many things follow many testpackaging equipment vendors set shop india also provide equipment logic chip fabrication getting set offices india important step also sets supply chain partially many items common testpackaging logic fab testpackaging fabs also clean rooms infrastructure logic manufacturing clean room depending product india doesnt big clean room fabs yet setting big packaging fabs precursor eventually setting logic fabs terms infrastructure development experience talent required manufacturing technicianengineer testpackaging fab required logic fab facilities also create talent pool demonstrating successful operation testpackaging facility build trust india encourage companies set fabs india take asml second rational critical thinking think dutch market share lithographywould sit back hostile takeover government isnt wolf wall street large scale manufacturing referring course star electrical engineers design semi conductors mostly academic exercise made india chip goes phone dont know read news trust bro private companies far ahead hal bel compete",
    "light_cleaned_title": "India Will Pay 70% Of Cost But Micron Will Own 100% Of The Plant—A Curious Business Model| Countercurrents",
    "light_cleaned_selftext": "This is Gujarat model of development. Also what Micron will do ain’t that great! Test! US and EU don’t want India to rise in high tech stuff. They only want Indian labour for manufacturing their consumer goods. Vietnam and Malaysia are leading on semiconductor front. India is nowhere in the picture. All these puny investments in semiconductors is a Modiwashing of the semiconductor failure of India",
    "light_cleaned_comments": "This is like an Adani deal Wait, we are footing the entire bill ? Is that normal ? I know US has been a spending for new TSMC foundries, I’m not sure how much of the bill they’re paying though. My gripe with these things is that while we get the manufacturing here, we still don’t do much to bring the IP to india. At the end of the day, if we don’t generate new IP, it’s a step forward but I think there’s more to be done. You're looking it at wrong way, the reason we're paying 70% is simply because we need a decent semiconductor fab. Yeah it's not the cutting edge stuff but it's still way better than having nothing in case of war and this factory will bring experience for local workers and Indian engineers that can be used later for higher tech factory. This isn't a wrong step. We need semiconductor industry asap, much more then they need us. same shit in foxconn (apple assembly thingy) as well . But better But will my Crucial SSD be cheaper? Anyway arse decision Excerpt that it’s not a fabrication plant, it’s just an assembly and packaging plant. We need technology transfer as well if you want cheap manufacturing costs and labor in India .... Kapish ! Yeah! If India could do both Hardware and Software then we will be in a unique position where we can build and export entire products internationally. Exports will explode. These semiconductor products will be more expensive to make in India than getting from currently established channels. Also, the defense manufacturing deal has the same issue. Manufacturing part of those jets in India is pricier than having it locally sourced by the Americans. It's the price India is paying to set up high technolog R&D and manufacturing. It's a long way ahead. Socialize the losses, privatize the profits India should get 40% ownership and get profits in proportion to it. These could be channeled into other development projects in the same space. What is important is after Indira Gandhi we haven’t had any leader who had the forethought her government had in many issues. They thought of this in 1976 before the fire gutted the factory in 1989. I am amazed as well as saddened by what India lost with her assassination. The whole of South Asia would be different if she had lived her life out. This is happening all over the world. After covid 19 and the semiconductor shortage all major countries are offering huge incentives for making semiconductors in their countries. Claiming that the woman who enacted emergency had forethought is peak stupidity Everyone has their pluses and negatives, what is totally stupid is not to recognize her strategic acumen. From nuclear weapons, to thinking about pharmaceutical industry to semi conductors way ahead of others, and the stupid parade of PM’s we’ve had since her, including her son makes her a giant indeed. India already has semi-conductor fabs. Owned by GoI. The manufactured silicon(40nm I think) is used by ISRO and DRDO. The fact is despite having a program in place for 2 decades, there has been zero innovation. The government needs to look hard at why Indian engineers can produce chips after moving to US, but can't here in India. And that'd be a lot of looking. To get our future smart people to make new cars, they at least should have access to old car manufacturing plants. You can't produce ferrarri without even having the capacity to produce maruti 800. Using this analogy, once we have a firm footing in the basic semiconductoring, we have a great ally in japan who has the best semiconductor ecosystem and an ageing population that will need the indian labor and added bonus of reduced costs. They have invested a lot in India and has given us some crucial techs when needed. Socialism does not work You have to start somewhere you cant expect to start manufacturing sub 5nm chips directly when the country has no semiconductor supply chain and has no pre-existing fabs , first only basic low end stuff will be setup , hopefully this is just the start and we can climb up the value chain in the years to come , we need fabs in india , the likes of TSMC and others will not be interested in manufacturing here unless they get massive subsidies to do so as there are places in the world much more suited for this kind of work than India , every govt is spending money hand over fist to get fabs setup in their country, the US is giving subsidies worth $280 Billion to rebuild their semi-conductor ecosystem for context thats more than our entire budget for the year if we exclude military spending. So I don't mind govt giving subsidies till we manage to climb up the value chain in the years to come , if that doesn't happen lets take out the pitchforks. Guys this is an assembly plant, not a fab. This is completely useless It’s made in india, not owned by Indians. One big contributor is having a mature and affordable supply chain network. China is working on this since the 1980s. I am okay with this. Becoming a semiconductor hub is a chicken and egg problem, and companies won't set it up unless they are incentivized heavily for this. And taking care of the cost is a one-time investment. In return, Micron will set up their center here. This will help bring dozens of upstream and downstream businesses that will all contribute towards building the well-needed 'ecosystem' for other players to move in and set up their own shop. What's the point of arguing? We are not going to get a right wing government to stop giving money to corporations. It is what it is. Most govt deals have % of revenue as a component. IDK if this is the case here. Its still going to be a net positive for India. India is footing 70% of the bill. The money will be used for construction of the facility so it will actually go into pockets of local contractors and Laborers so it’s not that bad. The great thing about local manufacturing is that locals benefit indirectly. The Adani model This kind of arm twisting is not unheard of in the US, but it is unheard of in India. Nope. Answer is simple af - R&D budget They are being given PLI (production linked incentives) which are tax breaks for a specific time period that is required for the operation to become viable in India. The government is not actually giving them money. See it is not that difficult to understand this part. We Indians have a lot of brain (processing power), what these companies give or teach when Indians move abroad and work for them is the knowledge and techniques (algorithm). Almost no one makes tech on their own, you need an army of people with decades of experience to build cutting edge tech. So just because Indians can do good work abroad doesn't mean the same here. GE and Mercedes have had their centers in India for decades now, but they are highly restrictive in the work they give here. Also you need good leadership for this stuff, so unless entire teams along with the right attitudes move out of these companies into some indigenous organisation nothing drastic will happen. TLDR; Tech is complex, just smart Indians won't work, we need a lot more, it's not the government, it's our inexperience that is setting us back. Can you share how you came up with these conclusions? Cutting edge research does not happen in India Indians do good research in the USA because such an ecosystem exists there. Can you ELI5 why is it expensive to manufacture in India? Even if micron pay 100 percent of the bill for construction , it will go to locals right? If Micron has to pay 100% then they will not build here at all and locals get 0. It’s not about maximizing profit in this case, more about minimizing loss while still starting up a new industry. >we have a great ally in japan who has the best semiconductor ecosystem and an ageing population They have had an ageing population for 3 decades now. Is our masterstroke to wait for them just die since we have achieved nothing of note when it comes technology transfers so far. China on the other hand is investing billions into their own semiconductor industry and will probably achieve parity like they generally do. We are nowhere in the supply chain here and probably won't be anytime soon. Why not take a stake in the company then? Maybe put this as a 0.1% interest rate. Why give the money for free? This is the real freebie. Because without it being a feeebie the companies have no incentive to move to India. If profit was the primary motivator in every case then the world as we know it wouldn’t exist. You should see the incredible tax breaks and subsisdies being offered to Apple to move assembly to India. Probably the costliest jobs India has ever purchased but I hope it translates into votes for BJP later so they spend a little less on marketing through PM Cares. The US and China are thinking the same thing. The idea is to achieve it before any of them do which is just not possible with our resources or our speed. >You have to start somewhere By spending like the US on getting a minuscule share of the supply chain in the future? We have to keep in mind that we are a desperately poor nation and such massive expenditures in an unplanned manner just for votes is how countries go bankrupt. With this trend we all will have to end up learning Bengali for jobs like the west is learning Chinese. How will this get the Govt votes? Announcing factories and so-called investments does. >India should get 40% ownership and get profits in proportion to it. India does not have the local market or the infrastructure to make such demands. We just have taxpayer money to drown the companies in and outspend other more reasonable-minded nations. While what you’re saying “sounds” correct, I don’t really think that is the case. Let’s walk through the semiconductor manufacturing stack: Design / Verification / IP creation - Happens in India but majority owned outside of India. CAD tool development - Very few players primarily US based companies (Cadence, Synopsos, can’t recollect) Lithography Equipment - ASML (another American company whose name escapes me own the entire market share) Lithography Wafer Fab - TSMC, Global Foundries, SIMC (I’m not sure how big they are) and Samsung are the biggest players in the space. But the rest of major foundries are scattered around Vietnam and across Southeast Asia. Packaging - I’m not familiar beyond some European ones (my knowledge is extremely limited) Assembly and manufacturing - Im guessing this is more distributed (my knowledge is limited). From the above article, the micron plant is basically the bottom end of the stack. So we are not developing the critical semiconductor fabrication workforce (the US recognizes this as a crisis) nor are we directly investing into developing semiconductor infrastructure. Now your statement that this investment would help in developing the semiconductor ecosystem is correct but your logic and analogy is completely wrong. Having more industry will encourage investments in the associated sectors. Coming to your analogy: 1. The challenge in making a Ferrari is in designing, optimizing the engine and fine tuning the assembly for reaching the performance standards. The challenge with making a Maruti 800 is being able to cost effectively manufacture the volume with good quality control. Note: They make around 15000 Ferraris every year. Maruti Suzuki makes around 1100000 cars a year. They don’t actually make as many Maruti 800 anymore (it’s an old model now) so I switched it with total volume of Maruti Suzuki. 2. Similarly if we invest in assembly and packaging, we will be the destination as long as we are the cheapest option. If Vietnam government says they will make it tax free and cover cost of labour for the first 5 years, they will move all the manufacturing without any questions asked. 3. If Indian companies developed the IP, they would be able to dictate what happens for the entire lifecycle. If you don’t invest in developing IP, you don’t end up with IP. The scale of investment needs to be atleast 100x of what we do now, if we ever want to catch up. If we invest in IP development now (startups, academic research, core foundries), in 20 years we will reap the benefits. This short term “leap frogging” thinking has actually has been particularly inhibitive for atleast one other technology sector that I have worked in. I hope this gives you some perspective, I’m not saying it’s bad but let’s not inflate the benefits for 100% funding a foreign companies investment into setting up shop in india. Edit : formatting As the Prime Minister, she did not make that one decision alone. Just like I find it lame to blame Modi for the current woes, I find it difficult to blame Indira Gandhi alone for such decisions. We don't live in an autocratic setup and one person is never ever to blame for a decision. The Govt foregoing revenue from their tax payer funded investment is a cost. This tax payer revenue is being invested here by taking it away from other sectors. There is a cost! Making US-style spending decisions with a third-world level taxpayer base hoping to keep pace with the manufacturing miracle of China has and will have a cost! If there is no plant there then there is no tax revenue from it to fund anything. Im not familiar with how the expenses will go I’m not gonna comment on it. But I have a longer response to why the investment (while a good first step) is insufficient alone to bring about a long term shift. You start small , and the desperately poor nation argument has been used endlessly by political parties to oppose everything new , once it was said why do we need computers , now our whole economy is running and thriving because of them . talking about unplanned spending and then saying learn chinese please look at their debt bubble, and the demographics shit show they are up for and as far as Bangladesh goes they are stuck at textiles for now and their forex situation is pretty dismal alos the US is actively acting against them till that situation isnt resolved they aren't going far Well that’s at the state/city level. A more appropriate comparison would be to the TSMC deal they did recently. Votes ? Ain't talking about votes here mate. Setting up a company will create jobs anyway and bring income to the city/district anyway. So thats that about votes/vote bank politics. The main point is, Focus on GDP and Semi-Conductor manufacturing in India. Apart from the obvious foreign investment, India focuses on 'Made In India' and subsequent technology transfer. Be it aviation/fighter jet technology or EV like Tesla. This Gujurat government either wants investment or wants this semi-conductor manufacturing company to set shop asap. They paying 70% that too... First time pretty much I believe. I see desperation. you start somewhere. if we wait for full fledged plant, we will get nothing. we can start from here and build upon it. vishvaguru ASML is a Dutch company This argument was used by Kapil Sibal used to claim there was no 2G scam. I understand the incentives but for what? Assembling and testing - not designing and manufacturing? On the other hand Intel plans to invest $25B in Israel. Semi race has been lost unfortunately. At the most India will only get the likes of Micron And complete lack of a supply chain. “Locals” of Gujarat 😁 There are some industries which would come up in India regardless. For example if this was a soap factory then PLI would be wasteful as the plant would be built there even without incentives and you are just giving tax rebates for no reason. There are other industries which would never come up unless incentives were given because we are not competitive in these industries. An example of this is Electronics industry. In these cases, PLIs are helpful. Here if you don’t give tax rebates then you aren’t going to get that factory and as a result aren’t going to get that tax anyway. >I understand the incentives but for what? Assembling and testing - not designing and manufacturing? On the other hand Intel plans to invest $25B in Israel. Semi race has been lost unfortunately. At the most India will only get the likes of Micron Correct. What is happening now should have happened in 80s and 90s. It didn’t. So now we have to play catch-up. With only two companies standing beyond 5nm and both are investing in Israel, Vietnam, Malaysia, and of course Taiwan. India will not get any major share of semis. This is the global supply chain diversification game US is playing. India has been chosen as the next manufacturing hub to rival China. But India will not manufacture semis. India is so so far behind that unless TSMC or Intel directly invest, which they will not, there’s no chance. India needs to find other creative ways… for example take over ASML! Massive brain drain from ASML, TSMC, Intel and Apple. I wonder if there is a better way of doing things. We need to go aggressively after TSMC, Intel, ASML, Apple. Maybe hostile takeover of ASML. Recruit massively from these companies and give them free hand and let the money flow What’s upstream of assembling that does not exist already? What is downstream? Trucking parts to be assembled? Yup, I can’t seem to remember the American company’s name though This deal was a Modi photo op moment to claim that he got a semi plant in India. If India is serious about getting to the top, this is not even a half hearted measure. Fact is, India has lost this battle already. US will not let India have the semiconductor industry There’s a difference. Incentives for what kind of value add? If India’s value add is $1 of the $1000 chip due to assembling and testing, maybe that incentive is better spent elsewhere You don’t start half downstream and then upwards integrate, that very very rarely happens. You can’t start a bagging and sealing plant with the end goal of a cement plant, that’s just not the way stuff works. Your reasoning does hold merit if they were doing a core process here and then may have expanded with upstream and downstream integration. Like you can start with limestone mining and move to cement or start with a cement plant and then get a limestone mine. You don’t start with a bagging plant first. Acche din aa gaye, I think so. Modi zindabaad. >The idea is to achieve it before any of them do which is just not possible with our resources or our speed You're wrong, idea is not compete at the bleeding edge, but make the less complex systems in mass for cheap. Like SoCs for cars, fridge, or packing chips or motherboard assembly or LCDs. Which India can achieve due to cheaper labour There is already a huge incentive to come to india. The geo political land has changed in last 10 years, and the west has realized they cannot rely on china. India is to gain tremendously through this. Thats the incentive. i hate to say this.. but making semiconductors, top AAA quality Video Games, disney/pixar like 3D animated movies, complicated TV or monitor panels and other innovate technologies sometimes or often JUST DOESNT HAPPEN IN INDIA NO MATTER WHAT... our country is still a \"developing\" country with most people in middle class, lower mid and as long as there is corruption and politicians going by their way.. it just wont happen. we need to fix our fundamentals first like making farmers earn decent(not losses), improve standard of living and improve salary of lower jobs , etc then we shall think of semiconductors, mars missions, luxury trains etc It's 25-30 percent of chip's value. You don't establish a manufacturing base overnight. Uptil 2016-17 we barely had any mobile production in India or defence exports but both have grown tremendously. Obviously we are still nowhere close to China and Vietnam in mobile manufacturing and us in defence exports but it's still something. Taiwan leads the world in chip manufacturing. The biggest fish in the pond is tsmc. Micron is a decent start incentives given right now for semiconductor manufacturing are huge. Germany and usa are promising 10s of billions of dollars UK was blocking the purchase of ARM by Nvidia as they were fearful of a US monopoly on mobile chips. And here you are talking about India, a non-Western nation doing a takeover of the only company that makes cutting edge chip manufacturing equipment like it's a walk in the park. Just geopolitics is not enough. If it was, they would have moved to US itself for semiconductors but it is not financially viable. To make it viable, US government will be providing subsidies to them. We have to offer a better deal than that. Rome wasnt built in a day, we need to start somewhere No dear. Upstream of semiconductor assembling is not truck assembling. Please read up a bit more before seething. Upstream of semiconductor assembling is making the more complex products that use semiconductors. We already have some of them, and as the shortage during the pandemic showed, the global supply chain desperately needs semiconductors, and India could be a cog in the wheel if we get the industry ecosystem here. Downstream of semiconductor assembly is establishing the local supply chain for procuring the raw materials to make these different, and making these parts ourselves. How does the US' approval matter? India was able to set up Bangalore as a local alternative to Silicon Valley during the cold war years. It's only easier now Breaking news: local chemcha learns how semiconductor fabs work. That is a common issue with all industries. It is why vietnam is growing in manufacturing > ASML (another American company whose name escapes me own the entire market share) Applied Materials Except, the talent that work at Micron will gain work experience at skills that are far more valuable to India's future than any knowledge gained working for that Gujarati fraudster's conglomerate. Micron's value will last even beyond Modi's departure. Adani will lose most of its value once BJP is kicked out of office and they don't get everything they want. At this point this feels like a worse option than opening up this generation's HAL or BEL etc. Say what you will about India's socialist period, but some of these early state run enterprises really helped set the ground for private players to later come in. HAL is the primary reason Bangalore is an aerospace hub today. I wish Modi went to Himalaya and did dhyaan and i would convert too Modism for sure. I am not complaining. If it wasn't semi conductor, I'd be pissed. But I really wish it was a foundary. Testing is crucial but again, they can simply choose not to do anything cutting edge in India. *cries in electoral bonds* Do you think the Dutch would just let one of their most important companies, just taken over like that by a foreign government. This . Its the lowest end job in semiconductor manufacturing. No real value add or cutting edge technology involved. A country like Malaysia has been doing this for decades but could never move up the value chain to semiconductor fabrication. A good idea would been to setup a fabrication unit for older nodes for IC's used in non IT industries like automobile etc , and then move up to latest nodes while mastering the technology. You did right the article right. It is a testing and packaging plant. DRDO has had a pretty good R&D budget and look at them True . Its the lowest end job in semiconductor manufacturing. No real value add or cutting edge technology involved. A country like Malaysia has been doing this for decades but could never move up the value chain to semiconductor fabrication. A good idea would been to setup a fabrication unit for older nodes for IC's used in non IT industries like automobile etc , and then move up to latest modes while mastering the technology. But who has taller statues? Almost all of the ip necessary to build cutting edge chips is owned by US companies, who can be told by the US government where they can manufacture and sell. ASML isn't not selling their machines to China because they agree with the US, but because they license necessary IP from US companies to make those machines. On a more serious note, I think it's more important for india to have labor intensive parts of the chain rather than the technological top end which is probably more automated. The people need jobs or there will be riots soon. That's so nonsensical. China is the second, and was the first on that too for a long time. No country will do a charity for us. Without solid incentives, companies will never move to India. Beside, no one's stopping an Indian company to build a plant of its own. And there's no reason for the West to create a dependency on India. I would be careful into believing all the smoke around geopolitics. Trade between the West and China is still strong. Micron is far better than whatever Adani has to offer. Being an american company, I expect the workers to have some decent work conditions and will learn skills which you prove handy in future. Anything I dont like is socialism. They would nationalise ASML before letting anyone buy it , sub 5nm is only in taiwan and south korea these are crown jewel tech which no one will give , you have to develop them yourself. Taiwan will not let TSMC setup their 3nm fabs in the US at any cost as they need the edge , so that they remain valuable to the world. Until they manage something even smaller From the article: > And for those who know technology would realize that the Micron deal is only for packaging of the chips, their assembly and testing, a relatively low end of the electronics industry. It does not touch the core technologies of designing and fabrication of chips, let alone the holy grail of chip-making technology: the lithographic machines that are central to chip fabrication. He was being satirical India does have socialism problem, but this aint it Isn’t this like US using indirect influence to gain on chip making behemoth that is China? I mean TSMC has been single point of failure as seen in recent past Only journalists and commentators in r/india are of the foolish opinion that packaging is low end, [while 3D IC packaging technology remains key to extend Moore’s Law](https://www.digitimes.com/news/a20221205VL202/3d-intel.html) In 1970s a Nun wrote about why was money wasted on exploring space instead of being spent on poor people. NASA wrote back to her in a famous letter titled 'Why explore space ?' This is a excerpt from that letter \"Before trying to describe in more detail how our space program is contributing to the solution of our Earthly problems, I would like to relate briefly a supposedly true story, which may help support the argument. About 400 years ago, there lived a count in a small town in Germany. He was one of the benign counts, and he gave a large part of his income to the poor in his town. This was much appreciated, because poverty was abundant during medieval times, and there were epidemics of the plague which ravaged the country frequently. One day, the count met a strange man. He had a workbench and little laboratory in his house, and he labored hard during the daytime so that he could afford a few hours every evening to work in his laboratory. He ground small lenses from pieces of glass; he mounted the lenses in tubes, and he used these gadgets to look at very small objects. The count was particularly fascinated by the tiny creatures that could be observed with the strong magnification, and which he had never seen before. He invited the man to move with his laboratory to the castle, to become a member of the count's household, and to devote henceforth all his time to the development and perfection of his optical gadgets as a special employee of the count. The townspeople, however, became angry when they realized that the count was wasting his money, as they thought, on a stunt without purpose. \"We are suffering from this plague,\" they said, \"while he is paying that man for a useless hobby!\" But the count remained firm. \"I give you as much as I can afford,\" he said, \"but I will also support this man and his work, because I know that someday something will come out of it!\" Indeed, something very good came out of this work, and also out of similar work done by others at other places: the microscope. It is well known that the microscope has contributed more than any other invention to the progress of medicine, and that the elimination of the plague and many other contagious diseases from most parts of the world is largely a result of studies which the microscope made possible. The count, by retaining some of his spending money for research and discovery, contributed far more to the relief of human suffering than he could have contributed by giving all he could possibly spare to his plague-ridden community.\" Spending any money on science always gives us benefits. *Modiji ne Kiya hai toh kuch soch k hi Kiya hoga* I think you mean to say that they have done well with a tiny budget. And they have. But, truth is that Government does not invest much in R&D. Private sector does very little, too. No man. India is assembling mobile phones for couple of decades now. Do you see any chances of full fledged mobile manufacturing in India in another decade? I think not. It just is. India is the most expensive emerging market to manufacture in. The regulatory overhead is quite high and infrastructure has always been a concern. Lol.. And Gujjus dont pay any tax either to begin with, but we have to pay for this like how the old refineries were setup, god wish I was born in China instead, instead of this failing country. No company will agree to do so. It is a 10 billion dollar investment minimum for outdated technology. They will set up this plant to test the waters and then maybe commit fully to creating a semiconductor fab. Rich countries can subsidize, India can't and why should this stupid subsidy be given by the govt, they should ask Ambani Adani to invest. Why should this plant be subsidized, govt can build hundreds of new hospitals, then also money will go to labourers. TSMC will not invest in India because we lack the support infrastructure to support semiconductor manufacturing. Which is why they're investing in Japan, US and Germany (also those governments are pouring billions more in subsidies). Because those nations have companies that are not just the end use customers for TSMC, but also several companies in the semiconductor supply chain. Plenty of chip making talent available as well. India has a lot to catch up on. Micron's plant is just the start and it's most a push by Modi. Why else do you think the plant is coming up in Gujarat? Modi just uses the nation's coffers to cement BJP's control and support in Gujarat. You need to think big. Instant gratification is the enemy of overall progress. There is a reason why governments make plan 10-20 years into the future and not just next 2 yrs. If what they are trying to do works out then it will give 1000x returns over long term. It will uplift a lot of people out of poverty due to the ripple effects. lol.. this country of idiots and crooks will go nowhere, states dont even cooperate to share river water and u think they govt is capable of planning, lol no progress will happen this country is too broke to go anywhere but down, we were lucky to get some benefits out of globalization, that's ending soon... Source: trust me bro It's not that simple. Semiconductor works in a way that those at the cutting edge somehow are able to sell for cheap and make profits. But there are a lot of failures even after huge investments. Micron isn't going to make iPhone chips. They're probably going to make chips for low end use cases or for indigenous missiles etc. If they don't sell at scale at cutting edge, it may not be worth the effort. See the channel Asianometry on YouTube. Ah thank you ! I kept thinking advanced materials research but I knew I was off (didn’t find anything when I googled it). Sure, that is kind of exactly my point. My purpose is not to criticize but rather give constructive criticism and pointing out that the goals need to be shifted. Now in an ideal world, the government unrolls a 20 year roadmap for semiconductor industry development, talking about the entire stack and strategic investments, etc. But since that isn’t the case I find myself pointing out to the community that they need to keep prodding the government to do more. If they don’t prod or ask, they’ll take only the deals to get jobs but not change the status quo. Basically what isro does as compared to NASA or spacex Kinda, but not really, ISRO isn't THAT far behind Nasa or SpaceX, they are working on projects of similar scale too, NASA really is underfunded after the space race ended. Meanwhile no one expects India to have sub 1nm fabs in the next 2-3 decades and TSMC, Samsung, Intel all have fabs planned like that in the near future. This is in fact incorrect. There can be more ways to measure this but at a high level the total semiconductor market last year was $600B and assembly and testing was about $30B. The US is funding Samsung's new plant at Taylor, Texas. The Government investing in infrastructure is a good thing. When you hate Modi blindly so much that you talk against development 🤡 Bangladesh is a sorry example of globalization. MBAs are taught how globalization is good for all as Bangladesh will be an expert in textiles and they can get it done cheaply and corner the market and will be the place for textiles and this will lead to riches which will enable more of Bangladeshis to buy Dell laptops and iPhones. This is what is fed to students in all macro economic classes. This is blatantly wrong. In the short run Bangladesh may have benefited a little. But what about textile machinery manufacturing? The chips required for these machines? Those who control the brains of the machines will reap the largest benefits. Not the users of these machines. There are property owners who are and get rich and then there are those who pay rent. Bangladesh has been paying rent and has not really owned anything Post sources or don't say anything. You're embarrassing yourself >India needs to find other creative ways… for example take over ASML! Massive brain drain from ASML, TSMC, Intel and Apple. How old are you? Are you a child or something? Only a child would say something stupid like this in public thats a good story, and thank you for letting me know it. but my point was ... we need to be able to move forward at what we best do. India has one of the best in Agriculture, doctors, software Engineers in the world.. rather than trying to do 10 different things little... we must do 1 thing GREAT. Spending $30B on semiconductor and taking 10+ years at this time is just too much to take for india. OP is some kid making noise without making any research. >Maybe hostile takeover of ASML Right, because the US and everyone will let that happen 🤡 >we need to fix our fundamentals first like making farmers earn decent(not losses), improve standard of living and improve salary of lower jobs , etc Typical socialist mindset. Applied Materials doesn't make lithography equipment but it makes quite a few of the other equipment (CVD, PVD, etch, CMP, Metrology, etc) Here you go. 👋 😆 I like the aggression 😘 What kinda high 🐎 you ride in? Have anything of substance to say? And the bhakts have arrived… This is seriously such a dumb post from op..there are valid criticisms of modi and bjp but not shit like this…us is providing $52 billion in subsidies to semiconductor companies, there is no incentive for micron or qualcomm or other semiconductor companies to do manufacturing in india without subsidies when literally every other developed nation is doling out billions in subsidies for semiconductor production..the economic benefit(especially white collar jobs) of these subsidies will far outweigh the short term cost. This is for DRAM and NAND. ( That is: RAM, SSD, flash drives, etc). Not processors. I disagree partly. Labour intensive sections are needed but from a strategic viewpoint, India depends on foreign imports for most of its silicone needs. Indian manufactured cars, mobiles and especially defence equipment is using foreign made chips. Any sanctions, embargo, war, disruption in supply chain will bring manufacturing to its knees in India. Hence top end products like semiconductors should be manufactured in India to strengthen its manufacturing to outside influences. But that is what the automotive industry did to start with. Suzuki, Toyota etc started off with assembling plants in India. After liberalization these companies started manufacturing plants instead of just assembling. Semiconductors are doing the same. Teenagers on Google, rather that experts who’ve spent 40-50 years in the field, feel confident enough to judge an intricate policy matter. Have we absolutely no faith in committees that make these decisions? There are literally two or three companies of the calibre of Micron in the world. No one, repeat no one including the Chinese can replicate this specific tech. Getting micron to set up a Fab unit India is HUGE! Imagine the possibilities once a supply ecosystem starts building around such a large operation. We simply don’t have the R & D setup or technical skills for manufacturing high quality hardware that Apple and Samsung will buy. Not sure what exactly they will fabricate but at least we get some tech transfer and internal skills. May be all the desis from Boise move back and help their motherland. I am not an expert in any way but this what comes to mind, Setting up a new industry is always expensive. Semiconductors in this case requires skilled labour. To start with, manufactures will hand pick people to lead these factories. Low Supply but high demand states that these people will demand a huge salary, and justifiably so. Sourcing of raw materials is also an issue. Procuring silicone in an area where there was little to no demand previously will be costly. Lastly, government bureaucracy will slow things down. Indian gov is notorious for charging exorbitant taxes on stuff like automobiles. wow this thread is dumb. people who dont know shit about how the semiconductor ecosystem works are commenting here This! Owning IP is everything. Indian model is to wait for IP to expire( Generic pharma) or just do it anyway. Don’t think people realise how big and important Micron is to the semi-conductor industry. Biggest barrier to entry in this market is the skill/knowledge/investment needed to be able to create IP that improves an existing product and helps sell. Try doing that for fabricating state of the art chips at scale. Micron FAB is the easiest way to build an internal ecosystem of suppliers and build some fab skill. Huge that they’ve decided to set this up in India. We don’t really do software either. We do IT. But we have the skill to at least. OP, you don’t think development within China wasn’t subsidized by the government? Years of Easy to attain loans, streamlining processes, infrastructure development, cheap labour and now China is the manufacturing hub of the world. The entire world depends on China, and it would have continued if not for Covid-19. Now it’s a China +1 model, where most procurement teams considers an alternate supplier and India fits right into the equation. We’ve got the labour, the land, the resources. We need the infrastructure (that’s being developed) and the investments to ensure our indigenous players can set up plants of this scale slowly or industries around each factory can grow. Because babus are still a thing. But seriously, regulation and labour laws. If a company actually follows all the regulation it needs to in India, the overheads are big. \"Anyone I don't like or disagrees with me is a Bhakht\" - Guide to arguing like a 12-year old on the Internet. Not to your suggestions, because only someone with 0 self awareness would make a comment so asinine and out of touch with reality. Honey, you need to think before making comments like these. Correct. However there’s a lot of overlap of these technologies at the packaging level. Gaining an understanding of packaging is crucial for developing the semiconductor industry Gujrat Model. It isn’t the same here, automotive assembly in itself is a core process unlike semiconductor assembly and packaging. Like galvanising or cold rolling essentially isn’t a very hard job but it is a core job. Hell Malaysia has been assembling and packaging for decades at this point and hasn’t upward integrated to fabrication and lithography I am an electronics engineer and right now India is living in Stone age AFA semiconductor technology is concerned. This is just the start and India will have to invest close to $100 billion in next decade to just sustain the semiconductor manufacturing in India. Back in 80s Suzuki was given a similar deal to setup a plant in India. That triggered automotive industry in India, however at that time Tata and Birla already had manufacturing of trucks and cars respectively and the cars setup and had a framework of technology, man power and educational institutions. India today neither has technology nor IP or any experience in manufacturing and labour cost is lower in the Philippines. Basically there is no incentive for Micron to setup a plant in India. To offset all these factors subsidies have been given. China has become factory of the world because no one can compete with them on cost. If made in India products have to compete with China, then subsidy ia the only way. Forget Gujrat model tell me which CM has been able to get a semiconductor company in India? USA has monopoly in this sector and the technology is coming only when approvals are done at the highest level. That is a significant step forward from manufacturing resistors and capacitors. Also this is not as low end as it is made out to be. India is way behind in agricultural tech compared to Israel and Europe, we are net importer of food despite 50% population engaged in agriculture. Doctors are not the top notch, but yes we are close enough. 80% of our software development is just filling excel sheets. Also this do 1 nothing great philosophy applies to an individual or an institute, it cannot be applied to a nation. You cannot force entire nation to focus on that one thing. Any nation which cannot design and manufacture semiconductors today, tomorrow will be a colony of the one who manufactures it. USA is not idiot to give these technologies to India without getting anything in return. They see clear eminent threat of digital war coming from China. And you added here what semi guru ji? Contempt! Bhakts are all Modi Modi when an agreement is signed and when there’s criticism of the details of the agreement Bhakts be like… yeah it has to be this way only ji… Modi will not melt due to some Reddit criticism, you did Nah I'm always up for some good old constructive debate and I can be wrong plenty of times (everyone are), but your suggestion that India should take over ASML and this is somehow bad/not enough for India is bad faith. Lemme guess: you're going to keep dragging this comment chain because you think not backing down will make you appear like you're right I know taking over ASML is out there but I also followed that with a more practical one, but bhakts look for items to show their Bhakti. China stole a whole lot of IP, and they have recruited insiders from all over the US industry and academia. Modi does not have a semi strategy and these Micron deals are just photo ops. US has a strategy, that they will not let India have the tech, they will let Malaysia, Vietnam be the semi hubs. If India really wants it, need to think outta the box and hence ASML target. Care to contribute anything, anything at all of substance or will you just stand in judgement of the tone of other comments Hey y’all, here’s a little perspective in relation to international trade and the advantage presented by localizing semiconductor manufacturing in geopolitical strategy. The TL;DR is technology and computing acts as a catalyst for other industries, and small technological advancements can lead to significant economic advantage in other sectors. A country is not guaranteed access to outside development, and semiconductors are extremely important. After the Cold War, the United States maintained one critical advantage: its computers. More advanced than Russia’s or China’s, the US was able to grow its computing sector faster using compounding gains and protectionist policies. Today’s semiconductors are overwhelmingly produced by a few companies– the largest of which is Taiwan Semiconductor Manufacturing Co (TSMC). Like the rest of Taiwan, it’s been embroiled in the hazy miasma of China’s self-determinist expansionism. As the world’s leading producer of semiconductors its fate has drawn global attention; particularly from the United States. It’s begun to expand global production but has been forced into developing failsafes in the case it loses control over its manufacturing and IP to China in case China chooses to act with the same protectionism that led to US technological superiority in the late 20th century. This of course ignores the importance of the semiconductor in manufacturing; having a foundry means access to a key industrial resource domestically. The semiconductor is not just a product; it is foundational to modern life. The reason countries are so keen to have semiconductor firms expand into them is their value as a strategic resource. It’s unlikely for India to compete on the technological front. But having access to quality semiconductors means having access to the same technologies as its contemporaries and counterparts. In a world that’s slowly polarizing, there’s sense in guaranteeing yourself access to a key resource. How are you so sure that they're photo ops? Have you gone to the site and did you ever do any investigating? Just like that throw some comments and cry when people call you out. >Care to contribute anything, anything at all of substance or will you just stand in judgement of the tone of other comments I mean, I have thoughts but yeah I'm just mocking you because of how whacky you are. >If India really wants it, need to think outta the box and hence ASML target. Again.....reeks of peak 🤡 behavior. Each of these company's valuation is close to India's GDP. Forget about the legal complexities and their significance to the USA in world dominance, please enlighten me from where would the money come from? Tell me 1 Indian company that can match up to companies like Apple, Google, HP. Banglore is a silicon valley only for Indians not to the world. > Banglore is a silicon valley only for Indians No shit Sherlock. Bangalore is indeed Silicon Valley for Indians and that's important because it has provided these highly qualified Indians a means to do cutting-edge work right from within India without having to look abroad for opportunities. And also, it is not my problem if you think Bangalore is only TCS, Wipro, and Infosys. In the context of my earlier point, it was that companies like TCS and Infosys were built on the backbone of an established clientele from the US. A lot of early work happened when US did not favor India. > who can be told by the US government where they can manufacture and sell. The US courts India today as a viable alternative to China. So, this is the easier part. The harder part is to convince companies that India can indeed not disappoint as a semiconductor hub, and no company is going to dip it's toes in an uncertain ecosystem. Setting it up first is necessary before you can court manufacturers. And that won't be possible without doling out incentives in the initial stages. Dude in terms of innovation we are zilch. It is just that we are doing backend maintenance work. Whatever IP creation is done is for the US based companies only. Ok, I tried but bhakts be bhakt with hidden thoughts You win 🥇 🏆 Dude if you think innovation happens only in the US because all the world's best companies are headquartered there, then it is you who has to do more reading. You think Walmart Labs in Bangalore is doing maintenance work for Walmart? The Intel office close by can be a suburb in itself. You think they do customer support for disgruntled chip customers? Do yourself a favor and read up JDs posted by these companies from time to time. A lot of cutting-edge work for US companies happen outside their country. Anyway, convincing you is not my job, and your post is not even relevant to the topic of this article. So I am going to leave it at that. True, but there has to be a system in India that is \"normal\" in so far as the rules are known and things are regular. No courts that swing off politics. No governments that want one to win and another to lose. Regulations that don't change cause someone got mad. India as I see as both too many and too few rules. Too many rules such that any one thing can screw up a project if one wants, and two few on those who would wish to screw up a project. >So now we have to play catch-up. What academics, researchers, and Govt's have understood is that there are development cycles and if those are missed, you have to be prepped for the next one. A nation cannot participate in a race when they feel like it. Eg the manufacturing boom in electronics that moved out of China was taken advantage of by Vietnam and to a much smaller extent Indonesia. There is no catchup here. The manufacturing boom in textiles that moved out of China was taken over by Bangladesh and a much smaller extent by Pakistan. There is again no catchup here. The next cycle will happen with a new set off opportunities and when it happens and if India misses that too, there is no catch-up to be played and even if we force it through, it is extremely expensive and needs to be backed by a coordinated effort from the private and public sector plus Ministry of External Affairs. India can only manage to achieve any sort of parity when batting for a few chosen industrialists with the whole diplomatic might of the Indian establishment but for an Industry generally, we have not fared well. The lack of this understanding is a huge knowledge gap among the voters of today and there is a reason why we keep giving our power and agency to corrupt and incompetent people. I have clearly mentioned that whatever little innovation is happening is for US based companies, they are the owners of IP. Is there any actual mobile production in India, or is that all imports of kits and a bunch of assembly like work? Volumes. Manufacturing is cheap when you can amortise the fixed cost of something over millions of units, or hundreds. If you need to build the entire plant for 1 unit, that's a lot more expensive, in relative terms. The only companies who can think of making sub 1 nm chips in the near future are TSMC, Samsung and Intel. TSMC will be making its first 3nm chips for iPhone 15 series late this year. So noone expects india or any other country for that matter to fab sub 1nm chips in the near future. Intel and Samsung both have plans for Sub 1nm in next 10 years mate, Samsung is barely 2 years behind TSMC rn and Intel is catching up rapidly Thats what i said Advanced chip fabrication is monopolised by few players. Many countries are nowhere near these giants let alone india. India should start making baby steps first I totally agree with you, unlike Taiwan, Germany, US, South Korea, US, Netherlands, China, and maybe Japan. As I said, India would not be competing in the bleeding edge, nor has any plans to do so India will be competiting in cheap mass manufacturing of less complex systems You keep saying 'Bhakt' like that's somehow going to insult me. Babes 😘 lol.. We are country of idiots, lol These companies are not going transfer anything, those with technical skills wont live in India, it's a mediocre standard of living, instead of investing in improving standard of living, we have investment in subsidies for billionaires. Testing and packaging is not trivial. It still involves cutting edge technologies. Setting up a test/packaging facility means many things will follow - many test/packaging equipment vendors will set up shop in India, some of which also provide equipment for logic chip fabrication. Getting them to set up offices in India is a very important step. This also sets up the supply chain partially as many items are common between test/packaging and a logic fab. - test/packaging fabs are also clean rooms and can have the same infrastructure as a logic manufacturing clean room (depending on the product). India doesn't have such big clean room fabs yet. Setting up these big packaging fabs is a pre-cursor to eventually setting up logic fabs (in terms of infrastructure development experience). - the talent required for a manufacturing technician/engineer in a test/packaging fab is the same as that required in a logic fab. So these facilities will also create a talent pool. - demonstrating a successful operation of a test/packaging facility will build trust in india and encourage more companies to set up fabs in India. > Fab unit in India Nah, it's a \"processing, packaging and testing\" unit, which is definitely not a Fab. But it's still a win nonetheless. Financial Times reports that the revised DLI 2.0 Scheme has attracted 2 companies (out of 14 that applied) are in \"Good talks\" with the government to set up Fabs, so fingers crossed. > We simply don't have R&D We definitely do. Many if not the most designs of semiconductors are designed in India, then sent to countries with Fabs (Taiwan, Korea, USA and China). Many of the Fab companies have a sizable presence and workforce in India. The problem is that we lack the manufacturing capability. Testing and packaging is not trivial. It still involves cutting edge technologies. Setting up a test/packaging facility means many things will follow - many test/packaging equipment vendors will set up shop in India, some of which also provide equipment for logic chip fabrication. Getting them to set up offices in India is a very important step. This also sets up the supply chain partially as many items are common between test/packaging and a logic fab. - test/packaging fabs are also clean rooms and can have the same infrastructure as a logic manufacturing clean room (depending on the product). India doesn't have such big clean room fabs yet. Setting up these big packaging fabs is a pre-cursor to eventually setting up logic fabs (in terms of infrastructure development experience). - the talent required for a manufacturing technician/engineer in a test/packaging fab is the same as that required in a logic fab. So these facilities will also create a talent pool. - demonstrating a successful operation of a test/packaging facility will build trust in india and encourage more companies to set up fabs in India. > take over ASML Do you for a second of rational and critical thinking think that the Dutch (who own MORE than 80% of the market share in lithography)would just sit back from a hostile takeover by a government?? This isn't Wolf of Wall Street Large scale manufacturing is what I was referring to. Of course, all the star electrical engineers do is design semi conductors in what is mostly an academic exercise. Where is the made in India chip that goes into any phone? If you don't know how to read news, you can trust me bro. Private companies are far ahead. HAL and BEL cannot compete with them."
}