{
    "id": "17aemv0",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/17aemv0/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&s=a1c77fa439c6564d49fe03ebbbb17f7912ce8d58",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697592610.0,
    "convurl": "https://b.thumbs.redditmedia.com/m_ShovQiTlZxA9OoTUUQhOcU8YUleyjqaX1Ezeq7SyI.jpg",
    "comments": [
        "**Breathing**\n\nBreathe deep, and do it any time you think about your breath.\n\nFrom the Mayo Clinic\n\nhttps://www.mayoclinic.org/healthy-lifestyle/stress-management/in-depth/stress/art-20046037\n\n>>But when stressors are always present and you constantly feel under attack, that fight-or-flight reaction stays turned on.\n\n>>The long-term activation of the stress response system and the overexposure to cortisol [The Primary Stress Hormone] and other stress hormones that follow **can disrupt almost all your body's processes.** This puts you at increased risk of many health problems, including:\n\n>>Anxiety, Depression, Digestive problems, Headaches, Muscle tension and pain, Heart disease, heart attack, high blood pressure and stroke, Sleep problems, Weight gain, Memory and concentration impairment\n\nKnow:\n\nYour breath is the Earth's atmosphere.\n\nIt is an invisible bodypart that is also part of my body.\n\nIt is also whale breath and microbe breath.\n\nIt is the breath of the plants and fungi.\n\nIt is an invisible part of our bodies that we all share.\n\nMy mind is not your mind.\n\nThe structure of my body is not the structure of your body.\n\nOur breath, however, is the Earth's atmosphere, an invisible bodypart, bigger than the surface of the planet.\n\nThere is no private air.\n\nPeer reviewed article from *Nature*:\n\nhttps://www.nature.com/articles/npp2013327\n\n>>Prolonged, elevated cortisol [The Primary Stress Hormone] levels in animals are also shown to cause atrophy [Weakening] in the hippocampus [The Brain's Memory Center]and hypertrophy [Growth] in the amygdala [The Brain's Fear Center], largely through changes in dendritic remodeling[Parts Of Brain Cells That Catch Messages From Other Brain Cells]. These structural changes may contribute to deficits in appropriate feedback onto the HPA axis. [The Part Of Your Brain That Keeps You Calm]\n\nResults from Berkely Study:\n\nhttps://greatergood.berkeley.edu/article/item/what_focusing_on_the_breath_does_to_your_brain\n\n>>Activity in the amygdala [The Brain's Fear Center],  suggests that quick breathing rates may trigger feelings like anxiety, anger, or fear. Other studies have shown that we tend to be more attuned to fear when we're breathing quickly. Conversely, it may be possible to reduce fear and anxiety by slowing down our breath.\n\nResults from MSU study:\n\nhttps://www.canr.msu.edu/news/understanding_cortisol_the_stress_hormone\n\n>>Deep breathing causes the vagus nerve [Immune System And Heart Rate Control] to signal your nervous system to lower your heart rate, blood pressure and cortisol [The Primary Stress Hormone]. Taking just ten deep breaths can assist with relaxation and provide a sense of calm.",
        " \n\nNot say but i am Gujrati and a 21y old boy, that i can't deny, but this is connected with the problem, The masturbation, this is soo sooo bad addiction that i got in my school time due the size problem, and don't have any friends that time and now also, I am not good at making friend\n\ndon't know what's wrong with me, I'm 21 and i did not even find it, i feel alone, it's been 4-6 years of addition of masturbation, i trying no fap but i didn't even get success on it, I'm loser in my life\n\nwell this is not finish yet, even after having a better education, i cant able to get, i haveing to much mentally eill, My mom is begging me to get job, cuse over house run though my moms money, i cant see this... this is soo pain full to that i am not that age where i have to start making a money even if its little amount, but can't, i have lake of confidence, to fear to do somting, alone, self talking, idk what i have to do, this is soo embarrassing. \n\nneed advice as friend, as guider, as teacher, as something IMP form life  \nif anyone out there with the same problem as i have plz let me know we can talk each other\n\nany others PROs plz help me to be MEN\n\nthank for reding this far.",
        "I have a problem of trusting people. Because of few incidents especially in relationships like breakup, cheated and rejected, I don’t feel like to express or to tell people who am I. I don’t talk much now, I don’t interact with people (neither offline or online). Whenever in office if people wants to say or ask something, I simply forget how to react and this happens because I get scared that if people won’t like my respond. So I’m getting scared to people as well. I have a good personality and have 2 masters degree from DU, and well knowledgeable person but still this things is killing me inside. I want to talk to someone but without being judgemental towards me. But how could I know if he/she is not judging me? I feel so lonely and rarely I smile.",
        "TBH, I don't think this is isolated. This exists through various societies. \n\nIt was brave of you to even post anonmyously here. You're doing well.\n\nIMO, Adult interactions are quite different to childhood ones. Some of us don't realise this - and we get caught in the confusion of it. \n\nI don't think we can know if someone is judging us. They may say they are not, but proably are - as it is human nature to assess situation. \n\nperhaps take a few steps back....read books and just listen and observe more? Until you're ready...",
        "Personally, I don't think Masturbation is bad. Even married people have to do it, when their partners don't share the same mood or timing as you. \n\nWhat needs to be addressed is addiction. Addiction to anything can be a problem. \n\nI would say, break it up to smaller things, identify triggers and causes. \n\nPlot the times you Jerked off...and what you did before or around that time?\n\nWas it something you were watching? was it bordem? etc?\n\nonce you identify a list of triggers, you can start changing those habits.\n\nRemember, all you need to do is reduce frequency....and it would be less of an addiction.",
        "I am a white guy who told a truck driver dhanyavad and he became very angry!!  He said to NEVER say that!!  Can you tell me why this would anger him??",
        "some past negative experience or prejudice against whites.",
        "Thank you kindly!",
        "Excuse me, may be i don't understand, but isn't the community icon (cartoon) seems insulting the honor of Gandhijee?\n\nAnd why the name of the country in the title doesn't start from capital letter?",
        "Also, there is a possibility that he was not a Hindi speaker and could've been offended. \n\nI apologise for his behaviour.",
        "I think this is what happened, maybe I shouldn't be assuming what nationality people are.  My fault, thank you!"
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "breathing breathe deep time think breath mayo clinic stressors always present constantly feel attack fightorflight reaction stays turned longterm activation stress response system overexposure cortisol primary stress hormone stress hormones follow disrupt almost bodys processes puts increased risk many health problems including anxiety depression digestive problems headaches muscle tension pain heart disease heart attack high blood pressure stroke sleep problems weight gain memory concentration impairment know breath earths atmosphere invisible bodypart also part body also whale breath microbe breath breath plants fungi invisible part bodies share mind mind structure body structure body breath however earths atmosphere invisible bodypart bigger surface planet private air peer reviewed article nature prolonged elevated cortisol primary stress hormone levels animals also shown cause atrophy weakening hippocampus brains memory centerand hypertrophy growth amygdala brains fear center largely changes dendritic remodelingparts brain cells catch messages brain cells structural changes may contribute deficits appropriate feedback onto hpa axis part brain keeps calm results berkely study activity amygdala brains fear center suggests quick breathing rates may trigger feelings like anxiety anger fear studies shown tend attuned fear breathing quickly conversely may possible reduce fear anxiety slowing breath results msu study deep breathing causes vagus nerve immune system heart rate control signal nervous system lower heart rate blood pressure cortisol primary stress hormone taking ten deep breaths assist relaxation provide sense calm say gujrati old boy cant deny connected problem masturbation soo sooo bad addiction got school time due size problem dont friends time also good making friend dont know whats wrong im even find feel alone years addition masturbation trying fap didnt even get success im loser life well finish yet even better education cant able get haveing much mentally eill mom begging get job cuse house run though moms money cant see soo pain full age start making money even little amount cant lake confidence fear somting alone self talking idk soo embarrassing need advice friend guider teacher something imp form life anyone problem plz let know talk others pros plz help men thank reding far problem trusting people incidents especially relationships like breakup cheated rejected dont feel like express tell people dont talk much dont interact people neither offline online whenever office people wants say ask something simply forget react happens get scared people wont like respond im getting scared people well good personality masters degree du well knowledgeable person still things killing inside want talk someone without judgemental towards could know heshe judging feel lonely rarely smile tbh dont think isolated exists various societies brave even post anonmyously youre well imo adult interactions quite different childhood ones us dont realise get caught confusion dont think know someone judging us may say proably human nature assess situation perhaps take steps backread books listen observe youre ready personally dont think masturbation bad even married people partners dont share mood timing needs addressed addiction addiction anything problem would say break smaller things identify triggers causes plot times jerked offand around time something watching bordem etc identify list triggers start changing habits remember need reduce frequencyand would less addiction white guy told truck driver dhanyavad became angry said never say tell would anger past negative experience prejudice whites thank kindly excuse may dont understand isnt community icon cartoon seems insulting honor gandhijee name country title doesnt start capital letter also possibility hindi speaker couldve offended apologise behaviour think happened maybe shouldnt assuming nationality people fault thank",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "**Breathing** Breathe deep, and do it any time you think about your breath. From the Mayo Clinic >>But when stressors are always present and you constantly feel under attack, that fight-or-flight reaction stays turned on. >>The long-term activation of the stress response system and the overexposure to cortisol [The Primary Stress Hormone] and other stress hormones that follow **can disrupt almost all your body's processes.** This puts you at increased risk of many health problems, including: >>Anxiety, Depression, Digestive problems, Headaches, Muscle tension and pain, Heart disease, heart attack, high blood pressure and stroke, Sleep problems, Weight gain, Memory and concentration impairment Know: Your breath is the Earth's atmosphere. It is an invisible bodypart that is also part of my body. It is also whale breath and microbe breath. It is the breath of the plants and fungi. It is an invisible part of our bodies that we all share. My mind is not your mind. The structure of my body is not the structure of your body. Our breath, however, is the Earth's atmosphere, an invisible bodypart, bigger than the surface of the planet. There is no private air. Peer reviewed article from *Nature*: >>Prolonged, elevated cortisol [The Primary Stress Hormone] levels in animals are also shown to cause atrophy [Weakening] in the hippocampus [The Brain's Memory Center]and hypertrophy [Growth] in the amygdala [The Brain's Fear Center], largely through changes in dendritic remodeling[Parts Of Brain Cells That Catch Messages From Other Brain Cells]. These structural changes may contribute to deficits in appropriate feedback onto the HPA axis. [The Part Of Your Brain That Keeps You Calm] Results from Berkely Study: >>Activity in the amygdala [The Brain's Fear Center], suggests that quick breathing rates may trigger feelings like anxiety, anger, or fear. Other studies have shown that we tend to be more attuned to fear when we're breathing quickly. Conversely, it may be possible to reduce fear and anxiety by slowing down our breath. Results from MSU study: >>Deep breathing causes the vagus nerve [Immune System And Heart Rate Control] to signal your nervous system to lower your heart rate, blood pressure and cortisol [The Primary Stress Hormone]. Taking just ten deep breaths can assist with relaxation and provide a sense of calm. Not say but i am Gujrati and a 21y old boy, that i can't deny, but this is connected with the problem, The masturbation, this is soo sooo bad addiction that i got in my school time due the size problem, and don't have any friends that time and now also, I am not good at making friend don't know what's wrong with me, I'm 21 and i did not even find it, i feel alone, it's been 4-6 years of addition of masturbation, i trying no fap but i didn't even get success on it, I'm loser in my life well this is not finish yet, even after having a better education, i cant able to get, i haveing to much mentally eill, My mom is begging me to get job, cuse over house run though my moms money, i cant see this... this is soo pain full to that i am not that age where i have to start making a money even if its little amount, but can't, i have lake of confidence, to fear to do somting, alone, self talking, idk what i have to do, this is soo embarrassing. need advice as friend, as guider, as teacher, as something IMP form life if anyone out there with the same problem as i have plz let me know we can talk each other any others PROs plz help me to be MEN thank for reding this far. I have a problem of trusting people. Because of few incidents especially in relationships like breakup, cheated and rejected, I don’t feel like to express or to tell people who am I. I don’t talk much now, I don’t interact with people (neither offline or online). Whenever in office if people wants to say or ask something, I simply forget how to react and this happens because I get scared that if people won’t like my respond. So I’m getting scared to people as well. I have a good personality and have 2 masters degree from DU, and well knowledgeable person but still this things is killing me inside. I want to talk to someone but without being judgemental towards me. But how could I know if he/she is not judging me? I feel so lonely and rarely I smile. TBH, I don't think this is isolated. This exists through various societies. It was brave of you to even post anonmyously here. You're doing well. IMO, Adult interactions are quite different to childhood ones. Some of us don't realise this - and we get caught in the confusion of it. I don't think we can know if someone is judging us. They may say they are not, but proably are - as it is human nature to assess situation. perhaps take a few steps back....read books and just listen and observe more? Until you're ready... Personally, I don't think Masturbation is bad. Even married people have to do it, when their partners don't share the same mood or timing as you. What needs to be addressed is addiction. Addiction to anything can be a problem. I would say, break it up to smaller things, identify triggers and causes. Plot the times you Jerked off...and what you did before or around that time? Was it something you were watching? was it bordem? etc? once you identify a list of triggers, you can start changing those habits. Remember, all you need to do is reduce frequency....and it would be less of an addiction. I am a white guy who told a truck driver dhanyavad and he became very angry!! He said to NEVER say that!! Can you tell me why this would anger him?? some past negative experience or prejudice against whites. Thank you kindly! Excuse me, may be i don't understand, but isn't the community icon (cartoon) seems insulting the honor of Gandhijee? And why the name of the country in the title doesn't start from capital letter? Also, there is a possibility that he was not a Hindi speaker and could've been offended. I apologise for his behaviour. I think this is what happened, maybe I shouldn't be assuming what nationality people are. My fault, thank you!"
}