{
    "id": "ihg5gt",
    "title": "Let's bring academics, experts and civil society to the table! #SaveOurPrivacy",
    "url": "https://www.reddit.com/r/india/comments/ihg5gt/lets_bring_academics_experts_and_civil_society_to/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/j7dgoq1dphj51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=6e2e6dbc595e4e33121bcc39b2739edabcc789a1\n\n## tl;dr\n\nThe Personal Data Protection Bill (PDP) 2019, which is critical for the data privacy, is being considered by a special Joint Parliamentary Committee (JPC). While the JPC has picked up pace in the last few weeks, the initial depositions have primarily focussed on engagement with government bodies and industry experts. We believe this needs to change and have urged the committee to invite a diverse range of stakeholders for depositions. Without it, conscious drafting choices against the interests of citizens contained in the PDP Bill run the risk of avoiding proper scrutiny. Today we wrote the JPC to consider widening participation and bringing a diverse range of independent voices to depose before it.\n\n## Prioritisation over privacy\n\nA large portion of issues inherent to the Personal Data Protection Bill 2019, which currently lies for debate and deliberation with the specialist JPC originates from the priorities set by an Expert Committee on Data Protection. Broadly these can be placed in two buckets:\n\n1. **Viewing personal data primarily as an economic resource:** While many view data as an economic resource, personal data at its core -- as per the articulation of the *Justice (Retd.) K.S. Puttaswamy Judgement* of the Hon’ble Supreme Court of India -- is a component of the fundamental right to privacy from the perspective of legal regulation. This constitutional understanding has been de-prioritized by the Draft Data Protection Bill. There is clear language within the preamble and key legislative provisions that prefer economic exploitation over data protection. In its present form the draft law will undermine the rights of citizens in favour of data collectors and processors.\n2. **Absence of surveillance reform, institutional autonomy of the Data Protection Authority (DPA), and large public sector exceptions:** The expectations from data protection today are that protections under it should be enforced with strength and independence against public sector bodies and government functionaries since they collect large amounts of data. However, shared analysis by many groups and experts has shown that there has been a complete absence in engaging with the issue of surveillance reforms that can provide oversight and safeguards over mass surveillance projects. Further, the institutional design of the DPA lacks autonomy and there are large exemptions available to public authorities. This would lead to an overwhelming circumvention of data protection in favour of mass surveillance.\n\nThis is not rhetoric. We have detailed these concerns in a clause by clause analysis available on a citizen centric advocacy campaign titled #SaveOurPrivacy. [**It is available here**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf). To supplement this, we had also come out with primers explaining the effect of the PDP Bill on [**National Population Register (NPR)**](https://drive.google.com/file/d/104V9yn1ygjHjIdK92ZWz7P-oNvbjSrzY/view)  and [**Workplace Surveillance**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view). These public analysis documents were also part of a separate detailed submission to the JPC as part of their [**request**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/) for suggestions on the PDP Bill 2019.\n\n## A little diversity never hurt nobody!\n\nThese core deficiencies have existrd in the draft from the time it was suggested by the Expert Committee headed by Justice (Retd.) B.N. Srikrishna.This draft was forwarded by the Ministry of Electronics and Information Technology (MeitY) for introduction in the Parliament before eventually being referred to the JPC.\n\nThroughout the entire process diverse, independent and transparent feedback has been lacking (For eg. [**concerns raised by citizens to the Srikrishna Committee**](https://indianexpress.com/article/india/citizens-group-questions-data-privacy-panel-composition-aadhaar-4924220/)). We believe that a positive path can be charted with open stakeholder depositions that promote equal representation of independent academics, technologists and global experts on specific areas of data protection -- beside government bodies, law firms &amp; those representing industry voices. A listing for this is given below.\n\n|**S.No.**|**Date**|**Deposing Entity**|\n|:-|:-|:-|\n|1|16.01.2020|Government: MeitY,                Non-government: None|\n|2|18.02.2020|Government: MeitY,               Non-government: None|\n|3|3.03.2020|Government: MeitY and Ministry of Law and Justice (MoL&amp;J),                                    Non-government: None|\n|4|17.03.2020|Government: MeitY, UIDAI, and National Crime Records Bureau (Home Affairs),           Non-government: None|\n|5|27.07.2020|Government: MeitY, UIDAI, and Home Affairs,                        Non-government: L&amp;L Partners|\n|6|10.08.2020|Government: MeitY, MoL&amp;J, Non-government: Foundation of Data Protection Professionals in India (FDPPI), and L&amp;L Partners|\n|7|11.08.2020|Government: MeitY and MoL&amp;J,                                    Non-government: ASSOCHAM and Dr. APJ Abdul Kalam Centre|\n|8|20.08.2020|Government: None,             Non-government: NASSCOM and Dr. APJ Abdul Kalam Centre|\n|9|26.08.2020|Government: None,                Non-government: NASSCOM|\n\n***So what can be done about this?*** Given the process is one that is ongoing and depositions are proceedings we believe, the JPC must expand future depositions. We have urged them to do this through a letter we wrote to it's Chairperson Ms. Meenakshi Lekhi today. This can be by depositions by organisations and independent experts, who have proven expertise and experience in domains like privacy, civil liberties, and digital rights.\n\n## Important Links:\n\n1. Our representation to the JPC on the PDP Bill urging for a wider civil society and citizen engagement dated. \\[[**link**](https://drive.google.com/file/d/17v6oAoN5gMi6EHciWumvbWJg5kuqm6UZ/view?usp=sharing)\\]\n2. IFF’s explainer on PDP Bill’s impact on NPR dated 25 February 2020. \\[[**link**](https://drive.google.com/file/d/104V9yn1ygjHjIdK92ZWz7P-oNvbjSrzY/view?usp=sharing)\\]\n3. IFF’s explainer on PDP Bill’s impact on workplace surveillance dated 11 February 2020. \\[[**link**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view?usp=sharing)\\]\n4. Key considerations on the PDP Bill 2019 dated 28 February 2020. \\[[**link**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/)\\]",
    "flair": "Policy/Economy",
    "score": 33,
    "num_comments": 2,
    "created_utc": 1598510519,
    "convurl": "https://b.thumbs.redditmedia.com/rqzn3ZB0fNrnVe9FlBNUMHcUIz-Il5b2kp5SmibNsAQ.jpg",
    "comments": [
        "How do I donate to you guys?",
        "https://internetfreedom.in/donate/"
    ],
    "cleaned_text": "lets bring academics experts civil society table saveourprivacy ampxb tldr personal data protection bill pdp critical data privacy considered special joint parliamentary committee jpc jpc picked pace last weeks initial depositions primarily focussed engagement government bodies industry experts believe needs change urged committee invite diverse range stakeholders depositions without conscious drafting choices interests citizens contained pdp bill run risk avoiding proper scrutiny today wrote jpc consider widening participation bringing diverse range independent voices depose prioritisation privacy large portion issues inherent personal data protection bill currently lies debate deliberation specialist jpc originates priorities set expert committee data protection broadly placed two buckets viewing personal data primarily economic resource many view data economic resource personal data core per articulation justice retd ks puttaswamy judgement honble supreme court india component fundamental right privacy perspective legal regulation constitutional understanding deprioritized draft data protection bill clear language within preamble key legislative provisions prefer economic exploitation data protection present form draft law undermine rights citizens favour data collectors processors absence surveillance reform institutional autonomy data protection authority dpa large public sector exceptions expectations data protection today protections enforced strength independence public sector bodies government functionaries since collect large amounts data however shared analysis many groups experts shown complete absence engaging issue surveillance reforms provide oversight safeguards mass surveillance projects institutional design dpa lacks autonomy large exemptions available public authorities would lead overwhelming circumvention data protection favour mass surveillance rhetoric detailed concerns clause clause analysis available citizen centric advocacy campaign titled saveourprivacy available herehttpssaveourprivacyinmediaallbriefpdpbillpdf supplement also come primers explaining effect pdp bill national population register nprhttpsdrivegooglecomfiledvynygjhjidkzwzponvbjsrzyview workplace surveillancehttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfview public analysis documents also part separate detailed submission jpc part requesthttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw suggestions pdp bill little diversity never hurt nobody core deficiencies existrd draft time suggested expert committee headed justice retd bn srikrishnathis draft forwarded ministry electronics information technology meity introduction parliament eventually referred jpc throughout entire process diverse independent transparent feedback lacking eg concerns raised citizens srikrishna committeehttpsindianexpresscomarticleindiacitizensgroupquestionsdataprivacypanelcompositionaadhaar believe positive path charted open stakeholder depositions promote equal representation independent academics technologists global experts specific areas data protection beside government bodies law firms amp representing industry voices listing given snodatedeposing entity government meity nongovernment none government meity nongovernment none government meity ministry law justice molampj nongovernment none government meity uidai national crime records bureau home affairs nongovernment none government meity uidai home affairs nongovernment lampl partners government meity molampj nongovernment foundation data protection professionals india fdppi lampl partners government meity molampj nongovernment assocham dr apj abdul kalam centre government none nongovernment nasscom dr apj abdul kalam centre government none nongovernment nasscom done given process one ongoing depositions proceedings believe jpc must expand future depositions urged letter wrote chairperson ms meenakshi lekhi today depositions organisations independent experts proven expertise experience domains like privacy civil liberties digital rights important links representation jpc pdp bill urging wider civil society citizen engagement dated linkhttpsdrivegooglecomfiledvoaongmiehciwumvbwjgkuqmuzviewuspsharing iffs explainer pdp bills impact npr dated february linkhttpsdrivegooglecomfiledvynygjhjidkzwzponvbjsrzyviewuspsharing iffs explainer pdp bills impact workplace surveillance dated february linkhttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfviewuspsharing key considerations pdp bill dated february linkhttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw ",
    "cleaned_title": "lets bring academics experts civil society table saveourprivacy",
    "cleaned_selftext": "ampxb tldr personal data protection bill pdp critical data privacy considered special joint parliamentary committee jpc jpc picked pace last weeks initial depositions primarily focussed engagement government bodies industry experts believe needs change urged committee invite diverse range stakeholders depositions without conscious drafting choices interests citizens contained pdp bill run risk avoiding proper scrutiny today wrote jpc consider widening participation bringing diverse range independent voices depose prioritisation privacy large portion issues inherent personal data protection bill currently lies debate deliberation specialist jpc originates priorities set expert committee data protection broadly placed two buckets viewing personal data primarily economic resource many view data economic resource personal data core per articulation justice retd ks puttaswamy judgement honble supreme court india component fundamental right privacy perspective legal regulation constitutional understanding deprioritized draft data protection bill clear language within preamble key legislative provisions prefer economic exploitation data protection present form draft law undermine rights citizens favour data collectors processors absence surveillance reform institutional autonomy data protection authority dpa large public sector exceptions expectations data protection today protections enforced strength independence public sector bodies government functionaries since collect large amounts data however shared analysis many groups experts shown complete absence engaging issue surveillance reforms provide oversight safeguards mass surveillance projects institutional design dpa lacks autonomy large exemptions available public authorities would lead overwhelming circumvention data protection favour mass surveillance rhetoric detailed concerns clause clause analysis available citizen centric advocacy campaign titled saveourprivacy available herehttpssaveourprivacyinmediaallbriefpdpbillpdf supplement also come primers explaining effect pdp bill national population register nprhttpsdrivegooglecomfiledvynygjhjidkzwzponvbjsrzyview workplace surveillancehttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfview public analysis documents also part separate detailed submission jpc part requesthttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw suggestions pdp bill little diversity never hurt nobody core deficiencies existrd draft time suggested expert committee headed justice retd bn srikrishnathis draft forwarded ministry electronics information technology meity introduction parliament eventually referred jpc throughout entire process diverse independent transparent feedback lacking eg concerns raised citizens srikrishna committeehttpsindianexpresscomarticleindiacitizensgroupquestionsdataprivacypanelcompositionaadhaar believe positive path charted open stakeholder depositions promote equal representation independent academics technologists global experts specific areas data protection beside government bodies law firms amp representing industry voices listing given snodatedeposing entity government meity nongovernment none government meity nongovernment none government meity ministry law justice molampj nongovernment none government meity uidai national crime records bureau home affairs nongovernment none government meity uidai home affairs nongovernment lampl partners government meity molampj nongovernment foundation data protection professionals india fdppi lampl partners government meity molampj nongovernment assocham dr apj abdul kalam centre government none nongovernment nasscom dr apj abdul kalam centre government none nongovernment nasscom done given process one ongoing depositions proceedings believe jpc must expand future depositions urged letter wrote chairperson ms meenakshi lekhi today depositions organisations independent experts proven expertise experience domains like privacy civil liberties digital rights important links representation jpc pdp bill urging wider civil society citizen engagement dated linkhttpsdrivegooglecomfiledvoaongmiehciwumvbwjgkuqmuzviewuspsharing iffs explainer pdp bills impact npr dated february linkhttpsdrivegooglecomfiledvynygjhjidkzwzponvbjsrzyviewuspsharing iffs explainer pdp bills impact workplace surveillance dated february linkhttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfviewuspsharing key considerations pdp bill dated february linkhttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw",
    "cleaned_comments": "donate guys",
    "light_cleaned_title": "Let's bring academics, experts and civil society to the table! #SaveOurPrivacy",
    "light_cleaned_selftext": "## tl;dr The Personal Data Protection Bill (PDP) 2019, which is critical for the data privacy, is being considered by a special Joint Parliamentary Committee (JPC). While the JPC has picked up pace in the last few weeks, the initial depositions have primarily focussed on engagement with government bodies and industry experts. We believe this needs to change and have urged the committee to invite a diverse range of stakeholders for depositions. Without it, conscious drafting choices against the interests of citizens contained in the PDP Bill run the risk of avoiding proper scrutiny. Today we wrote the JPC to consider widening participation and bringing a diverse range of independent voices to depose before it. ## Prioritisation over privacy A large portion of issues inherent to the Personal Data Protection Bill 2019, which currently lies for debate and deliberation with the specialist JPC originates from the priorities set by an Expert Committee on Data Protection. Broadly these can be placed in two buckets: 1. **Viewing personal data primarily as an economic resource:** While many view data as an economic resource, personal data at its core -- as per the articulation of the *Justice (Retd.) K.S. Puttaswamy Judgement* of the Hon’ble Supreme Court of India -- is a component of the fundamental right to privacy from the perspective of legal regulation. This constitutional understanding has been de-prioritized by the Draft Data Protection Bill. There is clear language within the preamble and key legislative provisions that prefer economic exploitation over data protection. In its present form the draft law will undermine the rights of citizens in favour of data collectors and processors. 2. **Absence of surveillance reform, institutional autonomy of the Data Protection Authority (DPA), and large public sector exceptions:** The expectations from data protection today are that protections under it should be enforced with strength and independence against public sector bodies and government functionaries since they collect large amounts of data. However, shared analysis by many groups and experts has shown that there has been a complete absence in engaging with the issue of surveillance reforms that can provide oversight and safeguards over mass surveillance projects. Further, the institutional design of the DPA lacks autonomy and there are large exemptions available to public authorities. This would lead to an overwhelming circumvention of data protection in favour of mass surveillance. This is not rhetoric. We have detailed these concerns in a clause by clause analysis available on a citizen centric advocacy campaign titled #SaveOurPrivacy. [**It is available here**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf). To supplement this, we had also come out with primers explaining the effect of the PDP Bill on [**National Population Register (NPR)**](https://drive.google.com/file/d/104V9yn1ygjHjIdK92ZWz7P-oNvbjSrzY/view) and [**Workplace Surveillance**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view). These public analysis documents were also part of a separate detailed submission to the JPC as part of their [**request**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/) for suggestions on the PDP Bill 2019. ## A little diversity never hurt nobody! These core deficiencies have existrd in the draft from the time it was suggested by the Expert Committee headed by Justice (Retd.) B.N. Srikrishna.This draft was forwarded by the Ministry of Electronics and Information Technology (MeitY) for introduction in the Parliament before eventually being referred to the JPC. Throughout the entire process diverse, independent and transparent feedback has been lacking (For eg. [**concerns raised by citizens to the Srikrishna Committee**](https://indianexpress.com/article/india/citizens-group-questions-data-privacy-panel-composition-aadhaar-4924220/)). We believe that a positive path can be charted with open stakeholder depositions that promote equal representation of independent academics, technologists and global experts on specific areas of data protection -- beside government bodies, law firms &amp; those representing industry voices. A listing for this is given below. |**S.No.**|**Date**|**Deposing Entity**| |:-|:-|:-| |1|16.01.2020|Government: MeitY, Non-government: None| |2|18.02.2020|Government: MeitY, Non-government: None| |3|3.03.2020|Government: MeitY and Ministry of Law and Justice (MoL&amp;J), Non-government: None| |4|17.03.2020|Government: MeitY, UIDAI, and National Crime Records Bureau (Home Affairs), Non-government: None| |5|27.07.2020|Government: MeitY, UIDAI, and Home Affairs, Non-government: L&amp;L Partners| |6|10.08.2020|Government: MeitY, MoL&amp;J, Non-government: Foundation of Data Protection Professionals in India (FDPPI), and L&amp;L Partners| |7|11.08.2020|Government: MeitY and MoL&amp;J, Non-government: ASSOCHAM and Dr. APJ Abdul Kalam Centre| |8|20.08.2020|Government: None, Non-government: NASSCOM and Dr. APJ Abdul Kalam Centre| |9|26.08.2020|Government: None, Non-government: NASSCOM| ***So what can be done about this?*** Given the process is one that is ongoing and depositions are proceedings we believe, the JPC must expand future depositions. We have urged them to do this through a letter we wrote to it's Chairperson Ms. Meenakshi Lekhi today. This can be by depositions by organisations and independent experts, who have proven expertise and experience in domains like privacy, civil liberties, and digital rights. ## Important Links: 1. Our representation to the JPC on the PDP Bill urging for a wider civil society and citizen engagement dated. \\[[**link**](https://drive.google.com/file/d/17v6oAoN5gMi6EHciWumvbWJg5kuqm6UZ/view?usp=sharing)\\] 2. IFF’s explainer on PDP Bill’s impact on NPR dated 25 February 2020. \\[[**link**](https://drive.google.com/file/d/104V9yn1ygjHjIdK92ZWz7P-oNvbjSrzY/view?usp=sharing)\\] 3. IFF’s explainer on PDP Bill’s impact on workplace surveillance dated 11 February 2020. \\[[**link**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view?usp=sharing)\\] 4. Key considerations on the PDP Bill 2019 dated 28 February 2020. \\[[**link**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/)\\]",
    "light_cleaned_comments": "How do I donate to you guys?"
}