{
    "id": "179v9ke",
    "title": "Duality of man",
    "url": "https://www.reddit.com/gallery/179v9ke",
    "selftext": "People are suddenly experts on \"truth\" and \"facts\" when it affects them.\n\nBut resort to the same level as the ones they oppose on a some other topics.\n🙂🫠",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697538675.0,
    "convurl": "https://i.redd.it/e5duo1g0qqub1.png",
    "comments": [
        "This looks pretty bad. And a person can look for information but he/she has to know what they are looking for. Same happened to me a couple of days ago, I found out about us retaking Goa from Portugese a couple of days ago, no one really talked about it, so I never knew that this happened in 1961 I thought this happened right after independence. \n\nAlso does someone have a list of changes made prior to bjp government, I want to compare that with this, just to find out how out of the norm this is.",
        "Yes I'm with you on this\n\nBut that's not the point of this post bruhhh\n\nPlease see the other screenshots",
        "What there are other screenshots. Apologies."
    ],
    "cleaned_text": "duality man people suddenly experts truth facts affects resort level ones oppose topics ",
    "cleaned_title": "duality man",
    "cleaned_selftext": "people suddenly experts truth facts affects resort level ones oppose topics",
    "cleaned_comments": "looks pretty bad person look information heshe know looking happened couple days ago found us retaking goa portugese couple days ago one really talked never knew happened thought happened right independence also someone list changes made prior bjp government want compare find norm yes im thats point post bruhhh please see screenshots screenshots apologies",
    "light_cleaned_title": "Duality of man",
    "light_cleaned_selftext": "People are suddenly experts on \"truth\" and \"facts\" when it affects them. But resort to the same level as the ones they oppose on a some other topics. 🙂🫠",
    "light_cleaned_comments": "This looks pretty bad. And a person can look for information but he/she has to know what they are looking for. Same happened to me a couple of days ago, I found out about us retaking Goa from Portugese a couple of days ago, no one really talked about it, so I never knew that this happened in 1961 I thought this happened right after independence. Also does someone have a list of changes made prior to bjp government, I want to compare that with this, just to find out how out of the norm this is. Yes I'm with you on this But that's not the point of this post bruhhh Please see the other screenshots What there are other screenshots. Apologies."
}