{
    "id": "172znlw",
    "title": "Two teachers were arrested in Chaitanya school Coimbatore for sexually assaulting multiple girls of class 10, 11, 12.",
    "url": "https://www.reddit.com/r/india/comments/172znlw/two_teachers_were_arrested_in_chaitanya_school/",
    "selftext": "What is happening with #ChaitanyaSchool? Two teachers were arrested for assaulting girls of class 10, 11, 12. The students themselves informed the police because the principal took NO action. According to the students, school paid money to suppress the media. The school is now trying to pay the parents of those affected students to not affect the school's name. The students wondering where this shithole of a school is heading.\n\nThe Principal: Popuri Anjibabu\n\nThe arrested teachers: Vijayakumar, Muralidharan\n\nSchool: Sri Chaitanya Techno School (CBE1), Chinnavedampatti, Coimbatore\n\nhttps://www.youtube.com/watch?v=tQoWlOmKheI&ab_channel=ThanthiTV\n\nhttps://www.vikatan.com/crime/coimbatore-two-arrested-in-pocso-act BoycottChaitanya #Coimbatore #Chinnavedampatti #CBE1 #SexualAssault #POCSO\n\nPlease take this issue to twitter with the hashtags above. Please spread the word wherever possible. 🙏🙏THE STUDENTS NEED ALL THE SUPPORT POSSIBLE FROM YOU GUYS AS THE STUDENTS OF THAT SCHOOL CAN'T REALLY DO MUCH. Thanks :)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696773068.0,
    "convurl": "https://external-preview.redd.it/hwkt0V0oA7BftOVv1fl6xdPpO0r0US2yOZ_lpX5dFDw.jpg?auto=webp&s=618dc6548fc9ef1d79ccaac73a3fecd454778b6e",
    "comments": [
        "TN is a different place to be woman/girl from the north India",
        "Cfbr. Let’s blow this up and shine a light on these corrupt fuckers",
        "These type of sexual abuse incidents in schools are getting too frequent in TN",
        "Burn Sri Chaitanya, KKR, Narayana etc to the ground. I still have nightmares of those times.",
        "A good solution for these degenerate shit stains would be: cleaver to the ball sack",
        "Cfbr",
        "Cfbr. Let's make some noise.",
        "No it always happened, now it's getting broadcast a lot",
        "What's KKR? \n\nDon't bring your hatred on SRK here. /s",
        "What's techno school? They trains students to become a DJ? Techno school sounds scammy tbh.",
        "Because india is the rape capital of the world. They dont have harsh enough punishments. Do they not respect woman? Like they have mothers and sisters?",
        "CFBR",
        "Kolkata Knight Riders",
        "Less than 17% rape cases come from a country with 17% world population",
        "Idk if it’s only happening in TN I think they just broadcast everything. I remember a school in Bangalore had a paedophile as a principal and the teacher is now a principal at a school in the Middle East. I think cases like these are underreported in general because it’s hard to get gets to report it and on top of that the school administrators do go out of their way to cover it up.",
        "Does it say where the girls are from? I don’t know how to read Tamil.",
        "In incidents like these why are the school's name always hidden? If you search the school's name in YouTube, You wont know that such an incident has occurred. Every news channel uses the term 'Private School'.  The school should be named and shamed in cases where they didnt take any action even after the students complained. \nGovt should maintain a public list of schools where there are teachers accused of SA work and How many percentage of teachers are accused of SA, Then the parents can then make an informed decision about the school.",
        "KKR is more on the school level. They provide jee coaching form 6th grade",
        "We need to maintain sex offenders list and pedo list, these guys deserve to be outcasts",
        "Correction 17% cases are reported, most of the victims do not report it.",
        "Jab me 6th me tha mujhe streams me baare me bhi nhi pta tha.",
        "us bro us",
        "Why is this not on national media ?? Create a post in Twitter",
        "Wdym?",
        "India is nowhere near the level of oppression in the middlesast countries. Women would get stoned if they ever report or resist.",
        "Do you not clean your house if your neighihouse is dirty. Let's get our house in order first. Why do we care or should care about middle east, we have a lot of things to take care of.",
        "Well my house is dirty but it isn't the dirtiest capital of filth.I do believe rapist should face the harshest of punishment. But I just dislike if someone calls india a terrorist country and act surprised that it has crime proportion to the population",
        "I agree. But i didn't call India anything, it's my country too.",
        "See the parent coment claiming india to be a rapist capital."
    ],
    "cleaned_text": "two teachers arrested chaitanya school coimbatore sexually assaulting multiple girls class happening chaitanyaschool two teachers arrested assaulting girls class students informed police principal took action according students school paid money suppress media school trying pay parents affected students affect schools name students wondering shithole school heading principal popuri anjibabu arrested teachers vijayakumar muralidharan school sri chaitanya techno school cbe chinnavedampatti coimbatore boycottchaitanya coimbatore chinnavedampatti cbe sexualassault pocso please take issue twitter hashtags please spread word wherever possible students need support possible guys students school cant really much thanks ",
    "cleaned_title": "two teachers arrested chaitanya school coimbatore sexually assaulting multiple girls class",
    "cleaned_selftext": "happening chaitanyaschool two teachers arrested assaulting girls class students informed police principal took action according students school paid money suppress media school trying pay parents affected students affect schools name students wondering shithole school heading principal popuri anjibabu arrested teachers vijayakumar muralidharan school sri chaitanya techno school cbe chinnavedampatti coimbatore boycottchaitanya coimbatore chinnavedampatti cbe sexualassault pocso please take issue twitter hashtags please spread word wherever possible students need support possible guys students school cant really much thanks",
    "cleaned_comments": "tn different place womangirl north india cfbr lets blow shine light corrupt fuckers type sexual abuse incidents schools getting frequent tn burn sri chaitanya kkr narayana etc ground still nightmares times good solution degenerate shit stains would cleaver ball sack cfbr cfbr lets make noise always happened getting broadcast lot whats kkr dont bring hatred srk whats techno school trains students become dj techno school sounds scammy tbh india rape capital world dont harsh enough punishments respect woman like mothers sisters cfbr kolkata knight riders less rape cases come country world population idk happening tn think broadcast everything remember school bangalore paedophile principal teacher principal school middle east think cases like underreported general hard get gets report top school administrators go way cover say girls dont know read tamil incidents like schools name always hidden search schools name youtube wont know incident occurred every news channel uses term private school school named shamed cases didnt take action even students complained govt maintain public list schools teachers accused sa work many percentage teachers accused sa parents make informed decision school kkr school level provide jee coaching form th grade need maintain sex offenders list pedo list guys deserve outcasts correction cases reported victims report jab th tha mujhe streams baare bhi nhi pta tha us bro us national media create post twitter wdym india nowhere near level oppression middlesast countries women would get stoned ever report resist clean house neighihouse dirty lets get house order first care care middle east lot things take care well house dirty isnt dirtiest capital filthi believe rapist face harshest punishment dislike someone calls india terrorist country act surprised crime proportion population agree didnt call india anything country see parent coment claiming india rapist capital",
    "light_cleaned_title": "Two teachers were arrested in Chaitanya school Coimbatore for sexually assaulting multiple girls of class 10, 11, 12.",
    "light_cleaned_selftext": "What is happening with #ChaitanyaSchool? Two teachers were arrested for assaulting girls of class 10, 11, 12. The students themselves informed the police because the principal took NO action. According to the students, school paid money to suppress the media. The school is now trying to pay the parents of those affected students to not affect the school's name. The students wondering where this shithole of a school is heading. The Principal: Popuri Anjibabu The arrested teachers: Vijayakumar, Muralidharan School: Sri Chaitanya Techno School (CBE1), Chinnavedampatti, Coimbatore BoycottChaitanya #Coimbatore #Chinnavedampatti #CBE1 #SexualAssault #POCSO Please take this issue to twitter with the hashtags above. Please spread the word wherever possible. 🙏🙏THE STUDENTS NEED ALL THE SUPPORT POSSIBLE FROM YOU GUYS AS THE STUDENTS OF THAT SCHOOL CAN'T REALLY DO MUCH. Thanks :)",
    "light_cleaned_comments": "TN is a different place to be woman/girl from the north India Cfbr. Let’s blow this up and shine a light on these corrupt fuckers These type of sexual abuse incidents in schools are getting too frequent in TN Burn Sri Chaitanya, KKR, Narayana etc to the ground. I still have nightmares of those times. A good solution for these degenerate shit stains would be: cleaver to the ball sack Cfbr Cfbr. Let's make some noise. No it always happened, now it's getting broadcast a lot What's KKR? Don't bring your hatred on SRK here. /s What's techno school? They trains students to become a DJ? Techno school sounds scammy tbh. Because india is the rape capital of the world. They dont have harsh enough punishments. Do they not respect woman? Like they have mothers and sisters? CFBR Kolkata Knight Riders Less than 17% rape cases come from a country with 17% world population Idk if it’s only happening in TN I think they just broadcast everything. I remember a school in Bangalore had a paedophile as a principal and the teacher is now a principal at a school in the Middle East. I think cases like these are underreported in general because it’s hard to get gets to report it and on top of that the school administrators do go out of their way to cover it up. Does it say where the girls are from? I don’t know how to read Tamil. In incidents like these why are the school's name always hidden? If you search the school's name in YouTube, You wont know that such an incident has occurred. Every news channel uses the term 'Private School'. The school should be named and shamed in cases where they didnt take any action even after the students complained. Govt should maintain a public list of schools where there are teachers accused of SA work and How many percentage of teachers are accused of SA, Then the parents can then make an informed decision about the school. KKR is more on the school level. They provide jee coaching form 6th grade We need to maintain sex offenders list and pedo list, these guys deserve to be outcasts Correction 17% cases are reported, most of the victims do not report it. Jab me 6th me tha mujhe streams me baare me bhi nhi pta tha. us bro us Why is this not on national media ?? Create a post in Twitter Wdym? India is nowhere near the level of oppression in the middlesast countries. Women would get stoned if they ever report or resist. Do you not clean your house if your neighihouse is dirty. Let's get our house in order first. Why do we care or should care about middle east, we have a lot of things to take care of. Well my house is dirty but it isn't the dirtiest capital of filth.I do believe rapist should face the harshest of punishment. But I just dislike if someone calls india a terrorist country and act surprised that it has crime proportion to the population I agree. But i didn't call India anything, it's my country too. See the parent coment claiming india to be a rapist capital."
}