{
    "id": "15f41mx",
    "title": "What am I missing here?",
    "url": "https://www.reddit.com/gallery/15f41mx",
    "selftext": "Is this the same product ?  Is 39000 booking amount?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690870511.0,
    "convurl": "https://i.redd.it/ihiyt0t4yffb1.jpg",
    "comments": [
        "That’s likely a starting price for the range. Try booking at lower storage. That’s definitely not a billing amount. Also, that amount must be after all discounts have been taken account of.",
        "Na. 73000 one is the base one 128 storage, 8GB RAM .And also there won't be discounts worth 34000 no way",
        "I am saying it must be a starting price for the range - so it must be cheaper for lower storage?",
        "On other note, you should ideally get an ipad if you're going to spend that much money. Android's app ecosystem for tablets is shite.",
        "Ya I was gonna compare these two along with OnePlus tab. I'm gonna use them for art purpose so thought a newer tab would be better. 73k is way out of my budget."
    ],
    "cleaned_text": "missing product booking amount ",
    "cleaned_title": "missing",
    "cleaned_selftext": "product booking amount",
    "cleaned_comments": "thats likely starting price range try booking lower storage thats definitely billing amount also amount must discounts taken account na one base one storage gb ram also wont discounts worth way saying must starting price range must cheaper lower storage note ideally get ipad youre going spend much money androids app ecosystem tablets shite ya gon na compare two along oneplus tab im gon na use art purpose thought newer tab would better k way budget",
    "light_cleaned_title": "What am I missing here?",
    "light_cleaned_selftext": "Is this the same product ? Is 39000 booking amount?",
    "light_cleaned_comments": "That’s likely a starting price for the range. Try booking at lower storage. That’s definitely not a billing amount. Also, that amount must be after all discounts have been taken account of. Na. 73000 one is the base one 128 storage, 8GB RAM .And also there won't be discounts worth 34000 no way I am saying it must be a starting price for the range - so it must be cheaper for lower storage? On other note, you should ideally get an ipad if you're going to spend that much money. Android's app ecosystem for tablets is shite. Ya I was gonna compare these two along with OnePlus tab. I'm gonna use them for art purpose so thought a newer tab would be better. 73k is way out of my budget."
}