{
    "id": "1etzew7",
    "title": "God....is this what we have come to? Pretending to be murdered rape victims? ",
    "url": "https://i.redd.it/3n08wmr983jd1.jpeg",
    "selftext": "I really can't stand this circus anymore. Do anything but this. Stop being so creative yet so disrespectful. There's no need to dramatize something this serious.\nThe same people who have shared this template have rejected women's complaints about SA. Just stop this. ",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 5,
    "created_utc": 1723840977.0,
    "convurl": "https://i.redd.it/3n08wmr983jd1.jpeg",
    "comments": [
        " OP is high atleast read it properly before posting it",
        "I think the creator didn't have any bad intentions. After reading it, even I felt guilty even though I am a woman. Believe it or not, the post is impactful. However I agree that it is a little disrespectful to Nirbhaya's memory and her family members.",
        "Now rapists will use this to claim nirbhaya put false case on innocent men and ruined their lives.",
        "What kind of people are these? \nI get it that you want people to be aware about it and want people to change but please do not use the name of the long gone person for increasing the growth of the post to reach out to the people. If your post is good and impactful then it will surely reach to people, you don’t need to do this but.",
        "Don’t believe it was bad intentioned. It’s meant to get a point across and it does - we only remember a few rape victims.",
        "Men rape monitor lizards too.",
        "There is so much shit happening on SM. You need to ignore all of that and move on. No need to waste your time and energy on every single damn thing. Not your problem. Keep yourself sane in the midst of chaos."
    ],
    "cleaned_text": "godis come pretending murdered rape victims really cant stand circus anymore anything stop creative yet disrespectful theres need dramatize something serious people shared template rejected womens complaints sa stop ",
    "cleaned_title": "godis come pretending murdered rape victims",
    "cleaned_selftext": "really cant stand circus anymore anything stop creative yet disrespectful theres need dramatize something serious people shared template rejected womens complaints sa stop",
    "cleaned_comments": "op high atleast read properly posting think creator didnt bad intentions reading even felt guilty even though woman believe post impactful however agree little disrespectful nirbhayas memory family members rapists use claim nirbhaya put false case innocent men ruined lives kind people get want people aware want people change please use name long gone person increasing growth post reach people post good impactful surely reach people dont need dont believe bad intentioned meant get point across remember rape victims men rape monitor lizards much shit happening sm need ignore move need waste time energy every single damn thing problem keep sane midst chaos",
    "light_cleaned_title": "God....is this what we have come to? Pretending to be murdered rape victims?",
    "light_cleaned_selftext": "I really can't stand this circus anymore. Do anything but this. Stop being so creative yet so disrespectful. There's no need to dramatize something this serious. The same people who have shared this template have rejected women's complaints about SA. Just stop this.",
    "light_cleaned_comments": "OP is high atleast read it properly before posting it I think the creator didn't have any bad intentions. After reading it, even I felt guilty even though I am a woman. Believe it or not, the post is impactful. However I agree that it is a little disrespectful to Nirbhaya's memory and her family members. Now rapists will use this to claim nirbhaya put false case on innocent men and ruined their lives. What kind of people are these? I get it that you want people to be aware about it and want people to change but please do not use the name of the long gone person for increasing the growth of the post to reach out to the people. If your post is good and impactful then it will surely reach to people, you don’t need to do this but. Don’t believe it was bad intentioned. It’s meant to get a point across and it does - we only remember a few rape victims. Men rape monitor lizards too. There is so much shit happening on SM. You need to ignore all of that and move on. No need to waste your time and energy on every single damn thing. Not your problem. Keep yourself sane in the midst of chaos."
}