{
    "id": "17ckp0j",
    "title": "There are too many people complaining against Supreme Court slowness and inefficiency who are also de facto stubbornly against any modernising reform.",
    "url": "https://www.reddit.com/r/india/comments/17ckp0j/there_are_too_many_people_complaining_against/",
    "selftext": "The Supreme Court receives a lot of criticism [such as here](https://www.bqprime.com/opinion/whats-choking-the-indian-judiciary). Much of it is fair, constructive criticism.\n\n&#x200B;\n\nHowever, many people are against the Supreme Court's inefficiency, but ridiculously stubbornly against any modernising reform to the legal system. The most obvious recent example being the proposal for a uniform civil code, even in general. (I think there should be separate codes for marriage, adoption, inheritance, and miscellaneous social stuff.) \n\n&#x200B;\n\nEven people who would cry evil 😈 if those very India's marriage laws they de facto want on the books were proposed today.\n\n&#x200B;\n\nHowever, some people just complain about literally any modernising reform that is not servile to their ideology. Simply helping their ideology is not enough. Such as with this [really very politically neutral criminal law reform](https://www.bbc.co.uk/news/world-asia-india-66495428). These people are just complaining for the sake of complaining. If they wanted more, they could easily just say they want more reform and be happy they are getting some progress.\n\n&#x200B;\n\nMost tellingly, these people have no idea where they want major modernising reform to happen in the legal system, where their ideology is not concerned. It is as if they believe laws made centuries ago are sacred and have no superior alternative.  \n\n\nOutdated laws are the very thing grinding down judicial progress, as they make lawyers and then everyone else dig through outdated laws and trying to twist them into modern sensibilities. Plus, it means the courts 🧑‍⚖️⚖️ are over reliant on precedent, so you have to dig through old cases to prove something everyone thinks is obviously supposed to be in the law.\n\n&#x200B;\n\nThese modernising regressives just want to have their cake and eat it. A completely efficient judiciary without any effort done to modernise it. And especially not a single shred of focus on anything except their ideology. \n\n&#x200B;\n\nPlus, they always want more money on their pet projects rather than effort and institutions. More and more frivolously spent money.",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 4,
    "created_utc": 1697833858,
    "convurl": "https://external-preview.redd.it/xHNxKW3t3sol7VdyeosFvlm4O8fHI2GDafwolLgygsI.jpg?auto=webp&s=7fbfafeabef91bc18b66d14fc9ad9ee2c97fabc8",
    "comments": [
        "The new criminal bills are not being opposed because of politics. They are being being opposed for being a massive waste of ours and judicial time.",
        "You think making the judicial system efficient  and modern is a waste of time?\n\n&#x200B;\n\nDo you never organise your documents at home, because it is a \"waste of time,\" then spend hours or days trying to find something?",
        "Efficient?? Lmafao what"
    ],
    "cleaned_text": "many people complaining supreme court slowness inefficiency also de facto stubbornly modernising reform supreme court receives lot criticism herehttpswwwbqprimecomopinionwhatschokingtheindianjudiciary much fair constructive criticism xb however many people supreme courts inefficiency ridiculously stubbornly modernising reform legal system obvious recent example proposal uniform civil code even general think separate codes marriage adoption inheritance miscellaneous social stuff xb even people would cry evil indias marriage laws de facto want books proposed today xb however people complain literally modernising reform servile ideology simply helping ideology enough really politically neutral criminal law reformhttpswwwbbccouknewsworldasiaindia people complaining sake complaining wanted could easily say want reform happy getting progress xb tellingly people idea want major modernising reform happen legal system ideology concerned believe laws made centuries ago sacred superior alternative outdated laws thing grinding judicial progress make lawyers everyone else dig outdated laws trying twist modern sensibilities plus means courts reliant precedent dig old cases prove something everyone thinks obviously supposed law xb modernising regressives want cake eat completely efficient judiciary without effort done modernise especially single shred focus anything except ideology xb plus always want money pet projects rather effort institutions frivolously spent money ",
    "cleaned_title": "many people complaining supreme court slowness inefficiency also de facto stubbornly modernising reform",
    "cleaned_selftext": "supreme court receives lot criticism herehttpswwwbqprimecomopinionwhatschokingtheindianjudiciary much fair constructive criticism xb however many people supreme courts inefficiency ridiculously stubbornly modernising reform legal system obvious recent example proposal uniform civil code even general think separate codes marriage adoption inheritance miscellaneous social stuff xb even people would cry evil indias marriage laws de facto want books proposed today xb however people complain literally modernising reform servile ideology simply helping ideology enough really politically neutral criminal law reformhttpswwwbbccouknewsworldasiaindia people complaining sake complaining wanted could easily say want reform happy getting progress xb tellingly people idea want major modernising reform happen legal system ideology concerned believe laws made centuries ago sacred superior alternative outdated laws thing grinding judicial progress make lawyers everyone else dig outdated laws trying twist modern sensibilities plus means courts reliant precedent dig old cases prove something everyone thinks obviously supposed law xb modernising regressives want cake eat completely efficient judiciary without effort done modernise especially single shred focus anything except ideology xb plus always want money pet projects rather effort institutions frivolously spent money",
    "cleaned_comments": "new criminal bills opposed politics opposed massive waste judicial time think making judicial system efficient modern waste time xb never organise documents home waste time spend hours days trying find something efficient lmafao",
    "light_cleaned_title": "There are too many people complaining against Supreme Court slowness and inefficiency who are also de facto stubbornly against any modernising reform.",
    "light_cleaned_selftext": "The Supreme Court receives a lot of criticism [such as here](https://www.bqprime.com/opinion/whats-choking-the-indian-judiciary). Much of it is fair, constructive criticism. &#x200B; However, many people are against the Supreme Court's inefficiency, but ridiculously stubbornly against any modernising reform to the legal system. The most obvious recent example being the proposal for a uniform civil code, even in general. (I think there should be separate codes for marriage, adoption, inheritance, and miscellaneous social stuff.) &#x200B; Even people who would cry evil 😈 if those very India's marriage laws they de facto want on the books were proposed today. &#x200B; However, some people just complain about literally any modernising reform that is not servile to their ideology. Simply helping their ideology is not enough. Such as with this [really very politically neutral criminal law reform](https://www.bbc.co.uk/news/world-asia-india-66495428). These people are just complaining for the sake of complaining. If they wanted more, they could easily just say they want more reform and be happy they are getting some progress. &#x200B; Most tellingly, these people have no idea where they want major modernising reform to happen in the legal system, where their ideology is not concerned. It is as if they believe laws made centuries ago are sacred and have no superior alternative. Outdated laws are the very thing grinding down judicial progress, as they make lawyers and then everyone else dig through outdated laws and trying to twist them into modern sensibilities. Plus, it means the courts 🧑‍⚖️⚖️ are over reliant on precedent, so you have to dig through old cases to prove something everyone thinks is obviously supposed to be in the law. &#x200B; These modernising regressives just want to have their cake and eat it. A completely efficient judiciary without any effort done to modernise it. And especially not a single shred of focus on anything except their ideology. &#x200B; Plus, they always want more money on their pet projects rather than effort and institutions. More and more frivolously spent money.",
    "light_cleaned_comments": "The new criminal bills are not being opposed because of politics. They are being being opposed for being a massive waste of ours and judicial time. You think making the judicial system efficient and modern is a waste of time? &#x200B; Do you never organise your documents at home, because it is a \"waste of time,\" then spend hours or days trying to find something? Efficient?? Lmafao what"
}