{
    "id": "1djbewa",
    "title": "#FreeAndFair: Late to the Party(s): How ECI dragged its feet in the 2024 General Election | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1djbewa/freeandfair_late_to_the_partys_how_eci_dragged/",
    "selftext": "[https:\\/\\/internetfreedom.in\\/eci-actions-in-the-2024-general-election\\/](https://preview.redd.it/fkcgijgvqg7d1.jpg?width=1600&format=pjpg&auto=webp&s=06f146fb71f9d5699b86ae1a7bb5951c068a7c56)\n\n# tl;dr\n\nThis election season was marked by widespread use of technology to create deceptive or misleading synthetic content like ‘cheapfakes’ and ‘deepfakes’. Action against political actors violating the Model Code of Conduct (“MCC”) and other legal instruments was delayed and inadequate. As we trace the Election Commission of India’s (“ECI”) response during this election period we notice that it faltered in upholding the sanctity and legitimacy of the Lok Sabha elections. \n\n# Important documents: \n\n1. ECI’s Notice to all national/state recognised political parties on the responsible and ethical use of social media platforms and strict avoidance of any wrongful use by political parties and their representatives. ([~link~](https://drive.google.com/file/d/1883JzsDeKPptlVwPdRbP2rmAG1DqXexy/view?usp=sharing&ref=static.internetfreedom.in))\n2. IFF’s Letter to ECI voicing concerns around inadequate and incomprehensive action taken by them regarding MCC violations by political parties. ([~link~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in))\n3. Civil Society Organisation’s Joint Open Letter to Electoral Candidates & Parliamentary Representatives on the Impact of Deepfakes on Electoral Outcomes dated 20.02.2024. ([~link~](https://docs.google.com/document/d/1_LrDoi940ARGOM7GrXxywpzhyH1gGUMbYtwVOoAQN-c/edit?ref=static.internetfreedom.in))\n4. ECI’s second suo motu report on two months’ enforcement of MCC during General Elections 2024. ([~link~](https://drive.google.com/file/d/1gEEWelngFB0d9sIw0GhAxwJRgyZSFlb3/view?usp=sharing&ref=static.internetfreedom.in))\n5. IFF’s thread on X (formerly Twitter) highlighting concerns with the ECI’s report on the enforcement of MCC. ([~link~](https://x.com/internetfreedom/status/1790609681154453772?ref=static.internetfreedom.in))\n\n# Why should you care? \n\nFree and fair elections are an integral pillar of democracy. But this Lok Sabha election has seen [~several instances~](https://www.boomlive.in/fact-check/factcheck-misinformation-roundup-phase-2-evm-reservation-cropped-video-amit-shah-communal-claims-fake-news-25182?ref=static.internetfreedom.in) of circulation of disinformation and falsely contextualised content, including content with misleading communal narratives. Here, it becomes important to consider voters’ potential inability to distinguish between real and [~synthetic content~](https://promiseinstitute.law.ucla.edu/podcast/misinformation-and-synthetic-media/?ref=static.internetfreedom.in) and their vulnerability to deception. AI-powered disinformation [~campaigns~](https://www.theatlantic.com/ideas/archive/2021/10/disinformation-propaganda-amplification-ampliganda/620334/?ref=static.internetfreedom.in) can influence voter behaviour by spreading false narratives or amplifying divisive content. This fundamentally affects the ability of citizens to exercise their democratic right to cast a free and informed vote. \n\n# The letter we awaited and were disappointed by \n\nOn May 06, 2024, ECI sent a [~letter~](https://drive.google.com/file/d/1883JzsDeKPptlVwPdRbP2rmAG1DqXexy/view?usp=sharing&ref=static.internetfreedom.in) to all national/state recognised political parties, cautioning them against the “*use of deep fakes, AI-generated distorted content which spread fake information/misinformation/disinformation and distortions of facts*”. ECI directed political parties to follow the provisions of the MCC and other existing legislations. This response came after two of the seven phases for the Lok Sabha seats had ended and there had been widespread dissemination of AI-generated misleading content. \n\nIt also followed the [~decision~](https://dhcappl.nic.in/dhcorderportal/GetOrder.do?ID=mmh%2F2024%2F1714640768016_2024.pdf&ref=static.internetfreedom.in) of the Hon’ble Delhi High Court in a Writ Petition filed by a lawyers’ organisation requesting action from ECI on the circulation of deepfakes. The Court chose to let ECI examine the matter and “*decide this as expeditiously as possible on or before May 6, keeping in view the urgency of the matter involved, in accordance with law*”. \n\nIn February 2024, we [~urged~](https://internetfreedom.in/open-letter-on-deepfakes/?ref=static.internetfreedom.in) political representatives to publicly commit not to use manipulative technology to create deceptive or misleading synthetic content in the run-up to and during the 2024 general elections. Eleven civil society organisations including IFF had [~written~](https://internetfreedom.in/civil-society-writes-to-eci-on-2024-elections/?ref=static.internetfreedom.in) an open letter to ECI and state Chief Electoral Officers, flagging concerns about generative AI technology (particularly deepfakes) used by political actors for influencing voter perception and impacting electoral outcomes.\n\nECI’s letter dated May 06 used terms such as “*misinformation”, “patently false”, “untrue”, and “misleading”* which is reflective of the vague and arbitrary language used in the amended Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“IT Amendment Rules, 2023”). Reliance on such undefined terms allows for its misuse through subjective application and selective enforcement. Further, the [~recent instances~](https://www.boomlive.in/news/deepfakes-or-real-edited-videos-amit-shah-bjp-congress-rahul-gandhi-lok-sabha-elections-2024-ai-25107?ref=static.internetfreedom.in) of mislabelling doctored/ edited media (i.e. cheapfakes) as deepfakes, or even [~authentic media~](https://www.thequint.com/news/webqoof/bjp-mp-dinesh-lal-yadav-viral-video-on-unemployment-yogi-modi-children-is-not-a-deepfake-fact-check?ref=static.internetfreedom.in#read-more) as deepfakes raises concerns about disproportionate censorship in the wake of the direction issued by the ECI in the notice. Here, the awareness and ability of political parties to identify/detect AI-generated media must be realistically assessed. \n\nVarious instances of use and dissemination of [~manipulated~](https://www.reuters.com/world/india/deepfakes-bollywood-stars-spark-worries-ai-meddling-india-election-2024-04-22/?ref=static.internetfreedom.in)/[~misleading~](https://www.boomlive.in/fact-check/viral-video-allu-arjun-campaigning-support-congress-claim-social-media-24981?ref=static.internetfreedom.in) media of high-profile public figures expressing support for a political party were also reported. We wrote to the Bharatiya Janata Party (“BJP”) and Indian National Congress (“INC”) ([~here~](https://drive.google.com/file/d/1ZlNIyIU1wi1-47EIwRPG5IrISUtn4xez/view?usp=sharing&ref=static.internetfreedom.in) and [~here~](https://drive.google.com/file/d/1sDzMC-miIjBWRwiAaYXsM8LCLfv01Fjx/view?usp=sharing&ref=static.internetfreedom.in)), highlighting their responsibility of not endorsing any deceptive or misleading synthetic content, even if it disproportionately favours them, as that may deliberately misinform citizens and affect their ability to exercise their democratic right to cast a free and informed vote. In our [~letter~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in) to ECI on May 9, 2024, we noted that they had failed to highlight this aspect and must consider directing the political parties and representatives to advocate against manipulated media, even ones that lead to a favourable outcome for them.\n\nAdditionally, despite several widely circulated pieces of content having misleading communal claims and allegations, both doctored/ manipulated and otherwise, the directions issued by ECI did not explicitly mention the party representative’s duty towards not spreading content that “*aggravate existing differences or create mutual hatred or cause tension between different castes and communities, religious or linguistic*” \\[Paragraph 1(1) of the [~Model Code of Conduct~](https://www.eci.gov.in/mcc/?ref=static.internetfreedom.in) (MCC)\\]. In the notice, the ECI only lists “criticism of other political parties” \\[Paragraph 1(2)\\] from the MCC\\] which should be followed by the political parties given the “subject matter”.\n\nWe [~wrote~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in) to the ECI on May 13, 2024 citing the above stated and other similar concerns.  \n\n# ECI’s report on the enforcement of MCC\n\nOn May 14, 2024, ECI [~reported~](https://drive.google.com/file/d/1gEEWelngFB0d9sIw0GhAxwJRgyZSFlb3/view?usp=sharing&ref=static.internetfreedom.in) on its two months of enforcement under MCC during Elections 2024 (“MCC enforcement report”). While we appreciated the intent of transparency, critical gaps were observed in their response. Firstly, ECI acknowledged its pending decision on divisive statements made by the candidates “*on communal, caste, regional language divide, or on the sanctity of the Constitution of India.*” An example of this was a [~post~](https://indianexpress.com/elections/ec-bjp-karnataka-x-post-muslims-9314058/?ref=static.internetfreedom.in) by BJP’s Karnataka unit on X (formerly Twitter) which triggered nationwide outrage due to its communal attack on the INC. ECI did not directly warn or take action against the BJP, and only directed the Karnataka Police to take down the controversial post after it had [~garnered~](https://www.thehindu.com/elections/lok-sabha/ec-tells-x-to-immediately-take-down-karnataka-bjp-post-on-muslim-quota/article68149599.ece?ref=static.internetfreedom.in) 9.2 million views and 13,000 reshares. \n\nDespite wide [~coverage~](https://m.thewire.in/article/communalism/animated-videos-latest-in-bjps-arsenal-spread-anti-muslim-hate-and-disinformation/amp?ref=static.internetfreedom.in) of communal content being posted online by political actors during the election period for voter appeasement, ECI failed to take notice of hate speeches being spread on the lines of caste, community, or religion at the right time. This is in spite of at least one national party filing a [~complaint~](https://www.indiatoday.in/elections/lok-sabha/story/karnataka-congress-chief-electoral-officer-complaint-bjp-communal-hatred-ill-intention-twitter-video-muslim-reservation-2535423-2024-05-05?ref=static.internetfreedom.in) against the BJP to ECI for the aforementioned post and other content posted by the party that too violates the MCC, Representation of the People Act, 1951, and the Indian Penal Code, 1860.\n\nTwo weeks after this incident on X and a week after the release of the MCC enforcement report, ECI finally issued a [~warning~](https://drive.google.com/file/d/1IOZU9eVdPNCqLaJlcS8mlF5px0-sztOs/view?usp=sharing&ref=static.internetfreedom.in) on May 22, 2024 to the BJP and INC, asking the two political parties to desist from campaigning along caste, community, language, and communal lines. It asked BJP President JP Nadda and INC Chief Mallikarjun Kharge to issue formal notes to their star campaigners asking them to “*not make speeches and statements, which may divide the society*”, “*refrain from any campaigning methods/utterances along religious/communal lines*”,  and “ *maintain decorum in their utterances*”.\n\nThis deterrent action should have been taken as soon as such incidents were reported at the beginning of the elections, and not when five out of the seven phases of elections were done. ECI’s delayed, inadequate and selective action in addressing crucial issues like this puts a serious dent on the electoral integrity and accountability of ECI as an institution. \n\nAdditionally, the MCC enforcement report did not mention the terms ‘deepfakes’, ‘cheapfakes’, ‘false’, ‘misleading’, or ‘misinformation’ even once, and only once mentioned the term ‘morphed images’. This omission is surprising given the dominance of such manipulated/edited media in the general elections. Regarding ECI’s instruction to take down deepfake content within [~3 hours~](https://www.hindustantimes.com/india-news/remove-deepfakes-within-3-hours-of-being-notified-election-commission-to-political-parties-101715023235465.html?ref=static.internetfreedom.in), it was unclear whether the parties were expected to [~identify~](https://www.thequint.com/news/webqoof/bjp-mp-dinesh-lal-yadav-viral-video-on-unemployment-yogi-modi-children-is-not-a-deepfake-fact-check?ref=static.internetfreedom.in#read-more) the content themselves or whether this responsibility falls on some other entity. Throughout the election process, the parties had a responsibility under the premise of good faith to inform the voters that a particular manipulated/misleading media is being circulated and that the party does not officially associate with it, even if it benefits them disproportionately. This accountability was completely absent from the side of the political parties and their members. \n\nECI’s sparing response to the use of deepfakes and other forms of edited/distorted content which spreads disinformation has been delayed, dispiriting, and limited in scope. This impacted electoral integrity and the level of political discourse in the country amid a crucial democratic moment. \n\nThe MCC enforcement report also highlighted the C-Vigil App's robustness in reporting MCC violations during elections. However, shortly before the release of this report, citizens [~shared~](https://scroll.in/article/1067615/ordinary-voters-flagged-modi-speech-to-election-commission-and-came-up-against-a-broken-system?ref=static.internetfreedom.in) their experience of being unable to [~upload~](https://www.boomlive.in/decode/lok-sabha-elections-2024-election-commission-app-cvigil-25204?ref=static.internetfreedom.in) pre-recorded videos or link to social media content. For some users, the app did not work on either Android or iOS phones, preventing them from reporting violations occurring in the digital space.\n\nThe other mechanism through which voters tried to complain to ECI was over emails because the official channels did not work. But even this avenue failed. There was no way to ensure action or a follow-up when it came to email complaints. This highlights the ECI’s inadequate grievance redressal system and the lack of a transparent mechanism to hold accountability over poll code violations.\n\n# Free and Fair \n\nSeven phases. Two months. 543 seats. Over 96 crore voters.\n\nIndian voters participated in the largest-ever election in the world to elect Members of Parliament to the 18th Lok Sabha. Concurrently, elections have taken place for the Legislative Assemblies of Andhra Pradesh, Arunachal Pradesh, Odisha, and Sikkim and by-elections for 35 seats in 16 states.\n\nThe stakes for our democracy have been higher than ever and we have been keeping our eyes on the ways in which technology is shaping the electoral process. We were also tracking all the absurd developments in the digital rights space during these elections. Follow ‘[~Digital Rights Are Going Great – Elections Edition~](https://freeandfair.in/digital-rights-election-edition?ref=static.internetfreedom.in)’[ ](https://twitter.com/hashtag/FreeAndFair?src=hashtag_click&ref=static.internetfreedom.in)to stay updated on digital rights violations and visit our website [~freeandfair.in~](http://freeandfair.in/?ref=static.internetfreedom.in) to read about how IFF responded to these violations.\n\n[Help us sustain the work we do](https://static.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1718774550.0,
    "convurl": "https://b.thumbs.redditmedia.com/rcLYM_-ct8utJrGowZPM0SY3NOJdfDpc5H7HfCDdHUI.jpg",
    "comments": [],
    "cleaned_text": "freeandfair late partys eci dragged feet general election internet freedom foundation httpsinternetfreedomineciactionsinthegeneralelectionhttpspreviewredditfkcgijgvqgdjpgwidthformatpjpgautowebpsffbfdbaeabbcac tldr election season marked widespread use technology create deceptive misleading synthetic content like cheapfakes deepfakes action political actors violating model code conduct mcc legal instruments delayed inadequate trace election commission indias eci response election period notice faltered upholding sanctity legitimacy lok sabha elections important documents ecis notice nationalstate recognised political parties responsible ethical use social media platforms strict avoidance wrongful use political parties representatives linkhttpsdrivegooglecomfiledjzsdekpptlvwpdrbprmagdqxexyviewuspsharingrefstaticinternetfreedomin iffs letter eci voicing concerns around inadequate incomprehensive action taken regarding mcc violations political parties linkhttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin civil society organisations joint open letter electoral candidates parliamentary representatives impact deepfakes electoral outcomes dated linkhttpsdocsgooglecomdocumentdlrdoiargomgrxxywpzhyhggumbytwvooaqnceditrefstaticinternetfreedomin ecis second suo motu report two months enforcement mcc general elections linkhttpsdrivegooglecomfiledgeewelngfbdsiwghaxwjrgyzsflbviewuspsharingrefstaticinternetfreedomin iffs thread x formerly twitter highlighting concerns ecis report enforcement mcc linkhttpsxcominternetfreedomstatusrefstaticinternetfreedomin care free fair elections integral pillar democracy lok sabha election seen several instanceshttpswwwboomliveinfactcheckfactcheckmisinformationroundupphaseevmreservationcroppedvideoamitshahcommunalclaimsfakenewsrefstaticinternetfreedomin circulation disinformation falsely contextualised content including content misleading communal narratives becomes important consider voters potential inability distinguish real synthetic contenthttpspromiseinstitutelawuclaedupodcastmisinformationandsyntheticmediarefstaticinternetfreedomin vulnerability deception aipowered disinformation campaignshttpswwwtheatlanticcomideasarchivedisinformationpropagandaamplificationampligandarefstaticinternetfreedomin influence voter behaviour spreading false narratives amplifying divisive content fundamentally affects ability citizens exercise democratic right cast free informed vote letter awaited disappointed may eci sent letterhttpsdrivegooglecomfiledjzsdekpptlvwpdrbprmagdqxexyviewuspsharingrefstaticinternetfreedomin nationalstate recognised political parties cautioning use deep fakes aigenerated distorted content spread fake informationmisinformationdisinformation distortions facts eci directed political parties follow provisions mcc existing legislations response came two seven phases lok sabha seats ended widespread dissemination aigenerated misleading content also followed decisionhttpsdhcapplnicindhcorderportalgetorderdoidmmhffpdfrefstaticinternetfreedomin honble delhi high court writ petition filed lawyers organisation requesting action eci circulation deepfakes court chose let eci examine matter decide expeditiously possible may keeping view urgency matter involved accordance law february urgedhttpsinternetfreedominopenletterondeepfakesrefstaticinternetfreedomin political representatives publicly commit use manipulative technology create deceptive misleading synthetic content runup general elections eleven civil society organisations including iff writtenhttpsinternetfreedomincivilsocietywritestoecionelectionsrefstaticinternetfreedomin open letter eci state chief electoral officers flagging concerns generative ai technology particularly deepfakes used political actors influencing voter perception impacting electoral outcomes ecis letter dated may used terms misinformation patently false untrue misleading reflective vague arbitrary language used amended information technology intermediary guidelines digital media ethics code rules amendment rules reliance undefined terms allows misuse subjective application selective enforcement recent instanceshttpswwwboomliveinnewsdeepfakesorrealeditedvideosamitshahbjpcongressrahulgandhiloksabhaelectionsairefstaticinternetfreedomin mislabelling doctored edited media ie cheapfakes deepfakes even authentic mediahttpswwwthequintcomnewswebqoofbjpmpdineshlalyadavviralvideoonunemploymentyogimodichildrenisnotadeepfakefactcheckrefstaticinternetfreedominreadmore deepfakes raises concerns disproportionate censorship wake direction issued eci notice awareness ability political parties identifydetect aigenerated media must realistically assessed various instances use dissemination manipulatedhttpswwwreuterscomworldindiadeepfakesbollywoodstarssparkworriesaimeddlingindiaelectionrefstaticinternetfreedominmisleadinghttpswwwboomliveinfactcheckviralvideoalluarjuncampaigningsupportcongressclaimsocialmediarefstaticinternetfreedomin media highprofile public figures expressing support political party also reported wrote bharatiya janata party bjp indian national congress inc herehttpsdrivegooglecomfiledzlniyiuwieiwrpgirisutnxezviewuspsharingrefstaticinternetfreedomin herehttpsdrivegooglecomfiledsdzmcmiijbwrwiaayxsmlclfvfjxviewuspsharingrefstaticinternetfreedomin highlighting responsibility endorsing deceptive misleading synthetic content even disproportionately favours may deliberately misinform citizens affect ability exercise democratic right cast free informed vote letterhttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin eci may noted failed highlight aspect must consider directing political parties representatives advocate manipulated media even ones lead favourable outcome additionally despite several widely circulated pieces content misleading communal claims allegations doctored manipulated otherwise directions issued eci explicitly mention party representatives duty towards spreading content aggravate existing differences create mutual hatred cause tension different castes communities religious linguistic paragraph model code conducthttpswwwecigovinmccrefstaticinternetfreedomin mcc notice eci lists criticism political parties paragraph mcc followed political parties given subject matter wrotehttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin eci may citing stated similar concerns ecis report enforcement mcc may eci reportedhttpsdrivegooglecomfiledgeewelngfbdsiwghaxwjrgyzsflbviewuspsharingrefstaticinternetfreedomin two months enforcement mcc elections mcc enforcement report appreciated intent transparency critical gaps observed response firstly eci acknowledged pending decision divisive statements made candidates communal caste regional language divide sanctity constitution india example posthttpsindianexpresscomelectionsecbjpkarnatakaxpostmuslimsrefstaticinternetfreedomin bjps karnataka unit x formerly twitter triggered nationwide outrage due communal attack inc eci directly warn take action bjp directed karnataka police take controversial post garneredhttpswwwthehinducomelectionsloksabhaectellsxtoimmediatelytakedownkarnatakabjppostonmuslimquotaarticleecerefstaticinternetfreedomin million views reshares despite wide coveragehttpsmthewireinarticlecommunalismanimatedvideoslatestinbjpsarsenalspreadantimuslimhateanddisinformationamprefstaticinternetfreedomin communal content posted online political actors election period voter appeasement eci failed take notice hate speeches spread lines caste community religion right time spite least one national party filing complainthttpswwwindiatodayinelectionsloksabhastorykarnatakacongresschiefelectoralofficercomplaintbjpcommunalhatredillintentiontwittervideomuslimreservationrefstaticinternetfreedomin bjp eci aforementioned post content posted party violates mcc representation people act indian penal code two weeks incident x week release mcc enforcement report eci finally issued warninghttpsdrivegooglecomfilediozuevdpncqlajlcsmlfpxsztosviewuspsharingrefstaticinternetfreedomin may bjp inc asking two political parties desist campaigning along caste community language communal lines asked bjp president jp nadda inc chief mallikarjun kharge issue formal notes star campaigners asking make speeches statements may divide society refrain campaigning methodsutterances along religiouscommunal lines maintain decorum utterances deterrent action taken soon incidents reported beginning elections five seven phases elections done ecis delayed inadequate selective action addressing crucial issues like puts serious dent electoral integrity accountability eci institution additionally mcc enforcement report mention terms deepfakes cheapfakes false misleading misinformation even mentioned term morphed images omission surprising given dominance manipulatededited media general elections regarding ecis instruction take deepfake content within hourshttpswwwhindustantimescomindianewsremovedeepfakeswithinhoursofbeingnotifiedelectioncommissiontopoliticalpartieshtmlrefstaticinternetfreedomin unclear whether parties expected identifyhttpswwwthequintcomnewswebqoofbjpmpdineshlalyadavviralvideoonunemploymentyogimodichildrenisnotadeepfakefactcheckrefstaticinternetfreedominreadmore content whether responsibility falls entity throughout election process parties responsibility premise good faith inform voters particular manipulatedmisleading media circulated party officially associate even benefits disproportionately accountability completely absent side political parties members ecis sparing response use deepfakes forms editeddistorted content spreads disinformation delayed dispiriting limited scope impacted electoral integrity level political discourse country amid crucial democratic moment mcc enforcement report also highlighted cvigil apps robustness reporting mcc violations elections however shortly release report citizens sharedhttpsscrollinarticleordinaryvotersflaggedmodispeechtoelectioncommissionandcameupagainstabrokensystemrefstaticinternetfreedomin experience unable uploadhttpswwwboomliveindecodeloksabhaelectionselectioncommissionappcvigilrefstaticinternetfreedomin prerecorded videos link social media content users app work either android ios phones preventing reporting violations occurring digital space mechanism voters tried complain eci emails official channels work even avenue failed way ensure action followup came email complaints highlights ecis inadequate grievance redressal system lack transparent mechanism hold accountability poll code violations free fair seven phases two months seats crore voters indian voters participated largestever election world elect members parliament th lok sabha concurrently elections taken place legislative assemblies andhra pradesh arunachal pradesh odisha sikkim byelections seats states stakes democracy higher ever keeping eyes ways technology shaping electoral process also tracking absurd developments digital rights space elections follow digital rights going great elections editionhttpsfreeandfairindigitalrightselectioneditionrefstaticinternetfreedomin httpstwittercomhashtagfreeandfairsrchashtagclickrefstaticinternetfreedominto stay updated digital rights violations visit website freeandfairinhttpfreeandfairinrefstaticinternetfreedomin read iff responded violations help us sustain work dohttpsstaticinternetfreedomindonate ",
    "cleaned_title": "freeandfair late partys eci dragged feet general election internet freedom foundation",
    "cleaned_selftext": "httpsinternetfreedomineciactionsinthegeneralelectionhttpspreviewredditfkcgijgvqgdjpgwidthformatpjpgautowebpsffbfdbaeabbcac tldr election season marked widespread use technology create deceptive misleading synthetic content like cheapfakes deepfakes action political actors violating model code conduct mcc legal instruments delayed inadequate trace election commission indias eci response election period notice faltered upholding sanctity legitimacy lok sabha elections important documents ecis notice nationalstate recognised political parties responsible ethical use social media platforms strict avoidance wrongful use political parties representatives linkhttpsdrivegooglecomfiledjzsdekpptlvwpdrbprmagdqxexyviewuspsharingrefstaticinternetfreedomin iffs letter eci voicing concerns around inadequate incomprehensive action taken regarding mcc violations political parties linkhttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin civil society organisations joint open letter electoral candidates parliamentary representatives impact deepfakes electoral outcomes dated linkhttpsdocsgooglecomdocumentdlrdoiargomgrxxywpzhyhggumbytwvooaqnceditrefstaticinternetfreedomin ecis second suo motu report two months enforcement mcc general elections linkhttpsdrivegooglecomfiledgeewelngfbdsiwghaxwjrgyzsflbviewuspsharingrefstaticinternetfreedomin iffs thread x formerly twitter highlighting concerns ecis report enforcement mcc linkhttpsxcominternetfreedomstatusrefstaticinternetfreedomin care free fair elections integral pillar democracy lok sabha election seen several instanceshttpswwwboomliveinfactcheckfactcheckmisinformationroundupphaseevmreservationcroppedvideoamitshahcommunalclaimsfakenewsrefstaticinternetfreedomin circulation disinformation falsely contextualised content including content misleading communal narratives becomes important consider voters potential inability distinguish real synthetic contenthttpspromiseinstitutelawuclaedupodcastmisinformationandsyntheticmediarefstaticinternetfreedomin vulnerability deception aipowered disinformation campaignshttpswwwtheatlanticcomideasarchivedisinformationpropagandaamplificationampligandarefstaticinternetfreedomin influence voter behaviour spreading false narratives amplifying divisive content fundamentally affects ability citizens exercise democratic right cast free informed vote letter awaited disappointed may eci sent letterhttpsdrivegooglecomfiledjzsdekpptlvwpdrbprmagdqxexyviewuspsharingrefstaticinternetfreedomin nationalstate recognised political parties cautioning use deep fakes aigenerated distorted content spread fake informationmisinformationdisinformation distortions facts eci directed political parties follow provisions mcc existing legislations response came two seven phases lok sabha seats ended widespread dissemination aigenerated misleading content also followed decisionhttpsdhcapplnicindhcorderportalgetorderdoidmmhffpdfrefstaticinternetfreedomin honble delhi high court writ petition filed lawyers organisation requesting action eci circulation deepfakes court chose let eci examine matter decide expeditiously possible may keeping view urgency matter involved accordance law february urgedhttpsinternetfreedominopenletterondeepfakesrefstaticinternetfreedomin political representatives publicly commit use manipulative technology create deceptive misleading synthetic content runup general elections eleven civil society organisations including iff writtenhttpsinternetfreedomincivilsocietywritestoecionelectionsrefstaticinternetfreedomin open letter eci state chief electoral officers flagging concerns generative ai technology particularly deepfakes used political actors influencing voter perception impacting electoral outcomes ecis letter dated may used terms misinformation patently false untrue misleading reflective vague arbitrary language used amended information technology intermediary guidelines digital media ethics code rules amendment rules reliance undefined terms allows misuse subjective application selective enforcement recent instanceshttpswwwboomliveinnewsdeepfakesorrealeditedvideosamitshahbjpcongressrahulgandhiloksabhaelectionsairefstaticinternetfreedomin mislabelling doctored edited media ie cheapfakes deepfakes even authentic mediahttpswwwthequintcomnewswebqoofbjpmpdineshlalyadavviralvideoonunemploymentyogimodichildrenisnotadeepfakefactcheckrefstaticinternetfreedominreadmore deepfakes raises concerns disproportionate censorship wake direction issued eci notice awareness ability political parties identifydetect aigenerated media must realistically assessed various instances use dissemination manipulatedhttpswwwreuterscomworldindiadeepfakesbollywoodstarssparkworriesaimeddlingindiaelectionrefstaticinternetfreedominmisleadinghttpswwwboomliveinfactcheckviralvideoalluarjuncampaigningsupportcongressclaimsocialmediarefstaticinternetfreedomin media highprofile public figures expressing support political party also reported wrote bharatiya janata party bjp indian national congress inc herehttpsdrivegooglecomfiledzlniyiuwieiwrpgirisutnxezviewuspsharingrefstaticinternetfreedomin herehttpsdrivegooglecomfiledsdzmcmiijbwrwiaayxsmlclfvfjxviewuspsharingrefstaticinternetfreedomin highlighting responsibility endorsing deceptive misleading synthetic content even disproportionately favours may deliberately misinform citizens affect ability exercise democratic right cast free informed vote letterhttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin eci may noted failed highlight aspect must consider directing political parties representatives advocate manipulated media even ones lead favourable outcome additionally despite several widely circulated pieces content misleading communal claims allegations doctored manipulated otherwise directions issued eci explicitly mention party representatives duty towards spreading content aggravate existing differences create mutual hatred cause tension different castes communities religious linguistic paragraph model code conducthttpswwwecigovinmccrefstaticinternetfreedomin mcc notice eci lists criticism political parties paragraph mcc followed political parties given subject matter wrotehttpsdrivegooglecomfiledfxozplhffcjirurejmcidpnlviewuspsharingrefstaticinternetfreedomin eci may citing stated similar concerns ecis report enforcement mcc may eci reportedhttpsdrivegooglecomfiledgeewelngfbdsiwghaxwjrgyzsflbviewuspsharingrefstaticinternetfreedomin two months enforcement mcc elections mcc enforcement report appreciated intent transparency critical gaps observed response firstly eci acknowledged pending decision divisive statements made candidates communal caste regional language divide sanctity constitution india example posthttpsindianexpresscomelectionsecbjpkarnatakaxpostmuslimsrefstaticinternetfreedomin bjps karnataka unit x formerly twitter triggered nationwide outrage due communal attack inc eci directly warn take action bjp directed karnataka police take controversial post garneredhttpswwwthehinducomelectionsloksabhaectellsxtoimmediatelytakedownkarnatakabjppostonmuslimquotaarticleecerefstaticinternetfreedomin million views reshares despite wide coveragehttpsmthewireinarticlecommunalismanimatedvideoslatestinbjpsarsenalspreadantimuslimhateanddisinformationamprefstaticinternetfreedomin communal content posted online political actors election period voter appeasement eci failed take notice hate speeches spread lines caste community religion right time spite least one national party filing complainthttpswwwindiatodayinelectionsloksabhastorykarnatakacongresschiefelectoralofficercomplaintbjpcommunalhatredillintentiontwittervideomuslimreservationrefstaticinternetfreedomin bjp eci aforementioned post content posted party violates mcc representation people act indian penal code two weeks incident x week release mcc enforcement report eci finally issued warninghttpsdrivegooglecomfilediozuevdpncqlajlcsmlfpxsztosviewuspsharingrefstaticinternetfreedomin may bjp inc asking two political parties desist campaigning along caste community language communal lines asked bjp president jp nadda inc chief mallikarjun kharge issue formal notes star campaigners asking make speeches statements may divide society refrain campaigning methodsutterances along religiouscommunal lines maintain decorum utterances deterrent action taken soon incidents reported beginning elections five seven phases elections done ecis delayed inadequate selective action addressing crucial issues like puts serious dent electoral integrity accountability eci institution additionally mcc enforcement report mention terms deepfakes cheapfakes false misleading misinformation even mentioned term morphed images omission surprising given dominance manipulatededited media general elections regarding ecis instruction take deepfake content within hourshttpswwwhindustantimescomindianewsremovedeepfakeswithinhoursofbeingnotifiedelectioncommissiontopoliticalpartieshtmlrefstaticinternetfreedomin unclear whether parties expected identifyhttpswwwthequintcomnewswebqoofbjpmpdineshlalyadavviralvideoonunemploymentyogimodichildrenisnotadeepfakefactcheckrefstaticinternetfreedominreadmore content whether responsibility falls entity throughout election process parties responsibility premise good faith inform voters particular manipulatedmisleading media circulated party officially associate even benefits disproportionately accountability completely absent side political parties members ecis sparing response use deepfakes forms editeddistorted content spreads disinformation delayed dispiriting limited scope impacted electoral integrity level political discourse country amid crucial democratic moment mcc enforcement report also highlighted cvigil apps robustness reporting mcc violations elections however shortly release report citizens sharedhttpsscrollinarticleordinaryvotersflaggedmodispeechtoelectioncommissionandcameupagainstabrokensystemrefstaticinternetfreedomin experience unable uploadhttpswwwboomliveindecodeloksabhaelectionselectioncommissionappcvigilrefstaticinternetfreedomin prerecorded videos link social media content users app work either android ios phones preventing reporting violations occurring digital space mechanism voters tried complain eci emails official channels work even avenue failed way ensure action followup came email complaints highlights ecis inadequate grievance redressal system lack transparent mechanism hold accountability poll code violations free fair seven phases two months seats crore voters indian voters participated largestever election world elect members parliament th lok sabha concurrently elections taken place legislative assemblies andhra pradesh arunachal pradesh odisha sikkim byelections seats states stakes democracy higher ever keeping eyes ways technology shaping electoral process also tracking absurd developments digital rights space elections follow digital rights going great elections editionhttpsfreeandfairindigitalrightselectioneditionrefstaticinternetfreedomin httpstwittercomhashtagfreeandfairsrchashtagclickrefstaticinternetfreedominto stay updated digital rights violations visit website freeandfairinhttpfreeandfairinrefstaticinternetfreedomin read iff responded violations help us sustain work dohttpsstaticinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "#FreeAndFair: Late to the Party(s): How ECI dragged its feet in the 2024 General Election | Internet Freedom Foundation",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/eci-actions-in-the-2024-general-election\\/](https://preview.redd.it/fkcgijgvqg7d1.jpg?width=1600&format=pjpg&auto=webp&s=06f146fb71f9d5699b86ae1a7bb5951c068a7c56) # tl;dr This election season was marked by widespread use of technology to create deceptive or misleading synthetic content like ‘cheapfakes’ and ‘deepfakes’. Action against political actors violating the Model Code of Conduct (“MCC”) and other legal instruments was delayed and inadequate. As we trace the Election Commission of India’s (“ECI”) response during this election period we notice that it faltered in upholding the sanctity and legitimacy of the Lok Sabha elections. # Important documents: 1. ECI’s Notice to all national/state recognised political parties on the responsible and ethical use of social media platforms and strict avoidance of any wrongful use by political parties and their representatives. ([~link~](https://drive.google.com/file/d/1883JzsDeKPptlVwPdRbP2rmAG1DqXexy/view?usp=sharing&ref=static.internetfreedom.in)) 2. IFF’s Letter to ECI voicing concerns around inadequate and incomprehensive action taken by them regarding MCC violations by political parties. ([~link~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in)) 3. Civil Society Organisation’s Joint Open Letter to Electoral Candidates & Parliamentary Representatives on the Impact of Deepfakes on Electoral Outcomes dated 20.02.2024. ([~link~](https://docs.google.com/document/d/1_LrDoi940ARGOM7GrXxywpzhyH1gGUMbYtwVOoAQN-c/edit?ref=static.internetfreedom.in)) 4. ECI’s second suo motu report on two months’ enforcement of MCC during General Elections 2024. ([~link~](https://drive.google.com/file/d/1gEEWelngFB0d9sIw0GhAxwJRgyZSFlb3/view?usp=sharing&ref=static.internetfreedom.in)) 5. IFF’s thread on X (formerly Twitter) highlighting concerns with the ECI’s report on the enforcement of MCC. ([~link~](https://x.com/internetfreedom/status/1790609681154453772?ref=static.internetfreedom.in)) # Why should you care? Free and fair elections are an integral pillar of democracy. But this Lok Sabha election has seen [~several instances~](https://www.boomlive.in/fact-check/factcheck-misinformation-roundup-phase-2-evm-reservation-cropped-video-amit-shah-communal-claims-fake-news-25182?ref=static.internetfreedom.in) of circulation of disinformation and falsely contextualised content, including content with misleading communal narratives. Here, it becomes important to consider voters’ potential inability to distinguish between real and [~synthetic content~](https://promiseinstitute.law.ucla.edu/podcast/misinformation-and-synthetic-media/?ref=static.internetfreedom.in) and their vulnerability to deception. AI-powered disinformation [~campaigns~](https://www.theatlantic.com/ideas/archive/2021/10/disinformation-propaganda-amplification-ampliganda/620334/?ref=static.internetfreedom.in) can influence voter behaviour by spreading false narratives or amplifying divisive content. This fundamentally affects the ability of citizens to exercise their democratic right to cast a free and informed vote. # The letter we awaited and were disappointed by On May 06, 2024, ECI sent a [~letter~](https://drive.google.com/file/d/1883JzsDeKPptlVwPdRbP2rmAG1DqXexy/view?usp=sharing&ref=static.internetfreedom.in) to all national/state recognised political parties, cautioning them against the “*use of deep fakes, AI-generated distorted content which spread fake information/misinformation/disinformation and distortions of facts*”. ECI directed political parties to follow the provisions of the MCC and other existing legislations. This response came after two of the seven phases for the Lok Sabha seats had ended and there had been widespread dissemination of AI-generated misleading content. It also followed the [~decision~](https://dhcappl.nic.in/dhcorderportal/GetOrder.do?ID=mmh%2F2024%2F1714640768016_2024.pdf&ref=static.internetfreedom.in) of the Hon’ble Delhi High Court in a Writ Petition filed by a lawyers’ organisation requesting action from ECI on the circulation of deepfakes. The Court chose to let ECI examine the matter and “*decide this as expeditiously as possible on or before May 6, keeping in view the urgency of the matter involved, in accordance with law*”. In February 2024, we [~urged~](https://internetfreedom.in/open-letter-on-deepfakes/?ref=static.internetfreedom.in) political representatives to publicly commit not to use manipulative technology to create deceptive or misleading synthetic content in the run-up to and during the 2024 general elections. Eleven civil society organisations including IFF had [~written~](https://internetfreedom.in/civil-society-writes-to-eci-on-2024-elections/?ref=static.internetfreedom.in) an open letter to ECI and state Chief Electoral Officers, flagging concerns about generative AI technology (particularly deepfakes) used by political actors for influencing voter perception and impacting electoral outcomes. ECI’s letter dated May 06 used terms such as “*misinformation”, “patently false”, “untrue”, and “misleading”* which is reflective of the vague and arbitrary language used in the amended Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“IT Amendment Rules, 2023”). Reliance on such undefined terms allows for its misuse through subjective application and selective enforcement. Further, the [~recent instances~](https://www.boomlive.in/news/deepfakes-or-real-edited-videos-amit-shah-bjp-congress-rahul-gandhi-lok-sabha-elections-2024-ai-25107?ref=static.internetfreedom.in) of mislabelling doctored/ edited media (i.e. cheapfakes) as deepfakes, or even [~authentic media~](https://www.thequint.com/news/webqoof/bjp-mp-dinesh-lal-yadav-viral-video-on-unemployment-yogi-modi-children-is-not-a-deepfake-fact-check?ref=static.internetfreedom.in#read-more) as deepfakes raises concerns about disproportionate censorship in the wake of the direction issued by the ECI in the notice. Here, the awareness and ability of political parties to identify/detect AI-generated media must be realistically assessed. Various instances of use and dissemination of [~manipulated~](https://www.reuters.com/world/india/deepfakes-bollywood-stars-spark-worries-ai-meddling-india-election-2024-04-22/?ref=static.internetfreedom.in)/[~misleading~](https://www.boomlive.in/fact-check/viral-video-allu-arjun-campaigning-support-congress-claim-social-media-24981?ref=static.internetfreedom.in) media of high-profile public figures expressing support for a political party were also reported. We wrote to the Bharatiya Janata Party (“BJP”) and Indian National Congress (“INC”) ([~here~](https://drive.google.com/file/d/1ZlNIyIU1wi1-47EIwRPG5IrISUtn4xez/view?usp=sharing&ref=static.internetfreedom.in) and [~here~](https://drive.google.com/file/d/1sDzMC-miIjBWRwiAaYXsM8LCLfv01Fjx/view?usp=sharing&ref=static.internetfreedom.in)), highlighting their responsibility of not endorsing any deceptive or misleading synthetic content, even if it disproportionately favours them, as that may deliberately misinform citizens and affect their ability to exercise their democratic right to cast a free and informed vote. In our [~letter~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in) to ECI on May 9, 2024, we noted that they had failed to highlight this aspect and must consider directing the political parties and representatives to advocate against manipulated media, even ones that lead to a favourable outcome for them. Additionally, despite several widely circulated pieces of content having misleading communal claims and allegations, both doctored/ manipulated and otherwise, the directions issued by ECI did not explicitly mention the party representative’s duty towards not spreading content that “*aggravate existing differences or create mutual hatred or cause tension between different castes and communities, religious or linguistic*” \\[Paragraph 1(1) of the [~Model Code of Conduct~](https://www.eci.gov.in/mcc/?ref=static.internetfreedom.in) (MCC)\\]. In the notice, the ECI only lists “criticism of other political parties” \\[Paragraph 1(2)\\] from the MCC\\] which should be followed by the political parties given the “subject matter”. We [~wrote~](https://drive.google.com/file/d/1FxoZPLh8ffCjI3r7Ur74eJmCIDP87n2L/view?usp=sharing&ref=static.internetfreedom.in) to the ECI on May 13, 2024 citing the above stated and other similar concerns. # ECI’s report on the enforcement of MCC On May 14, 2024, ECI [~reported~](https://drive.google.com/file/d/1gEEWelngFB0d9sIw0GhAxwJRgyZSFlb3/view?usp=sharing&ref=static.internetfreedom.in) on its two months of enforcement under MCC during Elections 2024 (“MCC enforcement report”). While we appreciated the intent of transparency, critical gaps were observed in their response. Firstly, ECI acknowledged its pending decision on divisive statements made by the candidates “*on communal, caste, regional language divide, or on the sanctity of the Constitution of India.*” An example of this was a [~post~](https://indianexpress.com/elections/ec-bjp-karnataka-x-post-muslims-9314058/?ref=static.internetfreedom.in) by BJP’s Karnataka unit on X (formerly Twitter) which triggered nationwide outrage due to its communal attack on the INC. ECI did not directly warn or take action against the BJP, and only directed the Karnataka Police to take down the controversial post after it had [~garnered~](https://www.thehindu.com/elections/lok-sabha/ec-tells-x-to-immediately-take-down-karnataka-bjp-post-on-muslim-quota/article68149599.ece?ref=static.internetfreedom.in) 9.2 million views and 13,000 reshares. Despite wide [~coverage~](https://m.thewire.in/article/communalism/animated-videos-latest-in-bjps-arsenal-spread-anti-muslim-hate-and-disinformation/amp?ref=static.internetfreedom.in) of communal content being posted online by political actors during the election period for voter appeasement, ECI failed to take notice of hate speeches being spread on the lines of caste, community, or religion at the right time. This is in spite of at least one national party filing a [~complaint~](https://www.indiatoday.in/elections/lok-sabha/story/karnataka-congress-chief-electoral-officer-complaint-bjp-communal-hatred-ill-intention-twitter-video-muslim-reservation-2535423-2024-05-05?ref=static.internetfreedom.in) against the BJP to ECI for the aforementioned post and other content posted by the party that too violates the MCC, Representation of the People Act, 1951, and the Indian Penal Code, 1860. Two weeks after this incident on X and a week after the release of the MCC enforcement report, ECI finally issued a [~warning~](https://drive.google.com/file/d/1IOZU9eVdPNCqLaJlcS8mlF5px0-sztOs/view?usp=sharing&ref=static.internetfreedom.in) on May 22, 2024 to the BJP and INC, asking the two political parties to desist from campaigning along caste, community, language, and communal lines. It asked BJP President JP Nadda and INC Chief Mallikarjun Kharge to issue formal notes to their star campaigners asking them to “*not make speeches and statements, which may divide the society*”, “*refrain from any campaigning methods/utterances along religious/communal lines*”, and “ *maintain decorum in their utterances*”. This deterrent action should have been taken as soon as such incidents were reported at the beginning of the elections, and not when five out of the seven phases of elections were done. ECI’s delayed, inadequate and selective action in addressing crucial issues like this puts a serious dent on the electoral integrity and accountability of ECI as an institution. Additionally, the MCC enforcement report did not mention the terms ‘deepfakes’, ‘cheapfakes’, ‘false’, ‘misleading’, or ‘misinformation’ even once, and only once mentioned the term ‘morphed images’. This omission is surprising given the dominance of such manipulated/edited media in the general elections. Regarding ECI’s instruction to take down deepfake content within [~3 hours~](https://www.hindustantimes.com/india-news/remove-deepfakes-within-3-hours-of-being-notified-election-commission-to-political-parties-101715023235465.html?ref=static.internetfreedom.in), it was unclear whether the parties were expected to [~identify~](https://www.thequint.com/news/webqoof/bjp-mp-dinesh-lal-yadav-viral-video-on-unemployment-yogi-modi-children-is-not-a-deepfake-fact-check?ref=static.internetfreedom.in#read-more) the content themselves or whether this responsibility falls on some other entity. Throughout the election process, the parties had a responsibility under the premise of good faith to inform the voters that a particular manipulated/misleading media is being circulated and that the party does not officially associate with it, even if it benefits them disproportionately. This accountability was completely absent from the side of the political parties and their members. ECI’s sparing response to the use of deepfakes and other forms of edited/distorted content which spreads disinformation has been delayed, dispiriting, and limited in scope. This impacted electoral integrity and the level of political discourse in the country amid a crucial democratic moment. The MCC enforcement report also highlighted the C-Vigil App's robustness in reporting MCC violations during elections. However, shortly before the release of this report, citizens [~shared~](https://scroll.in/article/1067615/ordinary-voters-flagged-modi-speech-to-election-commission-and-came-up-against-a-broken-system?ref=static.internetfreedom.in) their experience of being unable to [~upload~](https://www.boomlive.in/decode/lok-sabha-elections-2024-election-commission-app-cvigil-25204?ref=static.internetfreedom.in) pre-recorded videos or link to social media content. For some users, the app did not work on either Android or iOS phones, preventing them from reporting violations occurring in the digital space. The other mechanism through which voters tried to complain to ECI was over emails because the official channels did not work. But even this avenue failed. There was no way to ensure action or a follow-up when it came to email complaints. This highlights the ECI’s inadequate grievance redressal system and the lack of a transparent mechanism to hold accountability over poll code violations. # Free and Fair Seven phases. Two months. 543 seats. Over 96 crore voters. Indian voters participated in the largest-ever election in the world to elect Members of Parliament to the 18th Lok Sabha. Concurrently, elections have taken place for the Legislative Assemblies of Andhra Pradesh, Arunachal Pradesh, Odisha, and Sikkim and by-elections for 35 seats in 16 states. The stakes for our democracy have been higher than ever and we have been keeping our eyes on the ways in which technology is shaping the electoral process. We were also tracking all the absurd developments in the digital rights space during these elections. Follow ‘[~Digital Rights Are Going Great – Elections Edition~](https://freeandfair.in/digital-rights-election-edition?ref=static.internetfreedom.in)’[ ](https://twitter.com/hashtag/FreeAndFair?src=hashtag_click&ref=static.internetfreedom.in)to stay updated on digital rights violations and visit our website [~freeandfair.in~](http://freeandfair.in/?ref=static.internetfreedom.in) to read about how IFF responded to these violations. [Help us sustain the work we do](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}