{
    "id": "14ltvcn",
    "title": "4 years after Tabrez Ansari lynched by Hindu mob, 10 accused convicted; sentencing July 5",
    "url": "https://maktoobmedia.com/latest-news/4-years-after-tabrez-ansari-lynched-by-hindu-mob-10-accused-convicted-sentencing-july-5/",
    "selftext": "A Jharkhand court on Tuesday convicted 10 out of the 13 Hindu men arrested in connection with the mob lynching of Tabrez Ansari in 2019.\n\nThe quantum of punishment will be announced on July 5 by Additional Session Judge Amit Shekhar.\n\nThe [22-year-old Muslim youth](https://maktoobmedia.com/tag/tabrez-ansari/) died in Jharkhand’s Sarikela-Kharsawan district in 2019, days after he was tied to an electricity pole, assaulted, and forced to chant Jai Shri Ram on suspicion of theft. Ansari was subsequently taken into custody and produced before a court, which sent him to jail. Three days after the assault, he fell ill and was taken to a hospital, where he died.He worked as a labourer and welder in Pune and had come home to celebrate Eid.\n\nThe convicted persons — Bhim Singh Munda, Kamal Mahato, Madan Nayak, Atul Mahali, Sunamo Pradhan, Vikram Mandal, Chamu Nayak, Prem Chand Mahali, Mahesh Mahali — were taken into custody soon after they were convicted by the court, PTI reported. Prime accused Prakash Mandal, alias Pappu Mandal, is already in judicial custody.\n\nThe accused were held guilty under Section 304 (culpable homicide not amounting to murder) of the Indian Penal Code.\n\nInitially, the Jharkhand Police had dropped the murder charge in the first chargesheet, saying that Ansari had died of a cardiac arrest due to stress and not of injuries. However, after facing criticisms, the Jharkhand Police reinstated murder charges against the 13 accused persons.",
    "flair": "Law & Courts",
    "score": 144,
    "num_comments": 14,
    "created_utc": 1688009409.0,
    "convurl": "https://external-preview.redd.it/W5RHTL2EYVxttVZ0bQ7-BJOgEIkNTMAeTQtJyMY2ea8.jpg?auto=webp&v=enabled&s=146cde636cbb4f649ec8ea14255fc2aeb3df3582",
    "comments": [
        "Call them RSS Men or Chaddi Men or BJP Men.. Not Hindu Men.",
        "All these people were members of the RSS or BJP?",
        "Oh fuck off. Accept they were Hindus and this was a religiously motivated hate crime against a Muslim man. I know it is difficult since Hindus have been mollycoddled to believe that they are the most tolerant species in all of humanity.",
        "Also, aren't police/jail authorities culpable here. Why did they wait for 3 days?",
        "Just like Muslims are responsible for the actions of their vile and trash Wahabism brethren. We Hindus are responsible for the actions of lower than life Sanghis.",
        "Awwww",
        "Why was he arrested? What were the charges on him?",
        "Muslim and Poor.",
        "Yeah, those are both serious charges.",
        "a drop in the ocean of hate",
        "In that case why are the Hindu religious leaders not uniting to resist RSS and BJP hijacking the religion ?",
        "Hi would like to send you a greeting card. Need your mailing address of the \n\n\n\n#rock you live under.",
        ">rock you live under.\n\nPatriotic Democratic Alliance"
    ],
    "cleaned_text": "years tabrez ansari lynched hindu mob accused convicted sentencing july jharkhand court tuesday convicted hindu men arrested connection mob lynching tabrez ansari quantum punishment announced july additional session judge amit shekhar yearold muslim youthhttpsmaktoobmediacomtagtabrezansari died jharkhands sarikelakharsawan district days tied electricity pole assaulted forced chant jai shri ram suspicion theft ansari subsequently taken custody produced court sent jail three days assault fell ill taken hospital diedhe worked labourer welder pune come home celebrate eid convicted persons bhim singh munda kamal mahato madan nayak atul mahali sunamo pradhan vikram mandal chamu nayak prem chand mahali mahesh mahali taken custody soon convicted court pti reported prime accused prakash mandal alias pappu mandal already judicial custody accused held guilty section culpable homicide amounting murder indian penal code initially jharkhand police dropped murder charge first chargesheet saying ansari died cardiac arrest due stress injuries however facing criticisms jharkhand police reinstated murder charges accused persons ",
    "cleaned_title": "years tabrez ansari lynched hindu mob accused convicted sentencing july",
    "cleaned_selftext": "jharkhand court tuesday convicted hindu men arrested connection mob lynching tabrez ansari quantum punishment announced july additional session judge amit shekhar yearold muslim youthhttpsmaktoobmediacomtagtabrezansari died jharkhands sarikelakharsawan district days tied electricity pole assaulted forced chant jai shri ram suspicion theft ansari subsequently taken custody produced court sent jail three days assault fell ill taken hospital diedhe worked labourer welder pune come home celebrate eid convicted persons bhim singh munda kamal mahato madan nayak atul mahali sunamo pradhan vikram mandal chamu nayak prem chand mahali mahesh mahali taken custody soon convicted court pti reported prime accused prakash mandal alias pappu mandal already judicial custody accused held guilty section culpable homicide amounting murder indian penal code initially jharkhand police dropped murder charge first chargesheet saying ansari died cardiac arrest due stress injuries however facing criticisms jharkhand police reinstated murder charges accused persons",
    "cleaned_comments": "call rss men chaddi men bjp men hindu men people members rss bjp oh fuck accept hindus religiously motivated hate crime muslim man know difficult since hindus mollycoddled believe tolerant species humanity also arent policejail authorities culpable wait days like muslims responsible actions vile trash wahabism brethren hindus responsible actions lower life sanghis awwww arrested charges muslim poor yeah serious charges drop ocean hate case hindu religious leaders uniting resist rss bjp hijacking religion hi would like send greeting card need mailing address rock live rock live patriotic democratic alliance",
    "light_cleaned_title": "4 years after Tabrez Ansari lynched by Hindu mob, 10 accused convicted; sentencing July 5",
    "light_cleaned_selftext": "A Jharkhand court on Tuesday convicted 10 out of the 13 Hindu men arrested in connection with the mob lynching of Tabrez Ansari in 2019. The quantum of punishment will be announced on July 5 by Additional Session Judge Amit Shekhar. The [22-year-old Muslim youth](https://maktoobmedia.com/tag/tabrez-ansari/) died in Jharkhand’s Sarikela-Kharsawan district in 2019, days after he was tied to an electricity pole, assaulted, and forced to chant Jai Shri Ram on suspicion of theft. Ansari was subsequently taken into custody and produced before a court, which sent him to jail. Three days after the assault, he fell ill and was taken to a hospital, where he died.He worked as a labourer and welder in Pune and had come home to celebrate Eid. The convicted persons — Bhim Singh Munda, Kamal Mahato, Madan Nayak, Atul Mahali, Sunamo Pradhan, Vikram Mandal, Chamu Nayak, Prem Chand Mahali, Mahesh Mahali — were taken into custody soon after they were convicted by the court, PTI reported. Prime accused Prakash Mandal, alias Pappu Mandal, is already in judicial custody. The accused were held guilty under Section 304 (culpable homicide not amounting to murder) of the Indian Penal Code. Initially, the Jharkhand Police had dropped the murder charge in the first chargesheet, saying that Ansari had died of a cardiac arrest due to stress and not of injuries. However, after facing criticisms, the Jharkhand Police reinstated murder charges against the 13 accused persons.",
    "light_cleaned_comments": "Call them RSS Men or Chaddi Men or BJP Men.. Not Hindu Men. All these people were members of the RSS or BJP? Oh fuck off. Accept they were Hindus and this was a religiously motivated hate crime against a Muslim man. I know it is difficult since Hindus have been mollycoddled to believe that they are the most tolerant species in all of humanity. Also, aren't police/jail authorities culpable here. Why did they wait for 3 days? Just like Muslims are responsible for the actions of their vile and trash Wahabism brethren. We Hindus are responsible for the actions of lower than life Sanghis. Awwww Why was he arrested? What were the charges on him? Muslim and Poor. Yeah, those are both serious charges. a drop in the ocean of hate In that case why are the Hindu religious leaders not uniting to resist RSS and BJP hijacking the religion ? Hi would like to send you a greeting card. Need your mailing address of the #rock you live under. >rock you live under. Patriotic Democratic Alliance"
}