{
    "id": "1c9z1m3",
    "title": "Meat eating states have less stunting. Time to kick out Modi, or else whole India becomes stunted. ",
    "url": "https://i.redd.it/pgvaefa3uxvc1.jpeg",
    "selftext": "Source: CNNS 2019 https://www.unicef.org/india/media/2646/file/CNNS-report.pdf\n\n\nWe have already lost the race of height with China and other Asian countries. Militant Vegetarianism promoted by BJP will worsen it. Look at how poorly vegetarian states like Gujarat perform, even though they are wealthy. ",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 9,
    "created_utc": 1713751168.0,
    "convurl": "https://i.redd.it/pgvaefa3uxvc1.jpeg",
    "comments": [
        "The problem is even if you say kick Modi out the states with in-grained militant vegetarianism are not going to change their dietary habits, until and unless say you get an other end of extreme I.e. a progressive dictator who mandates eggs and meat for every child..!!",
        "It's atleast a start :) \nAnd hopefully a dictator is not required. TN, KL, Odisha and TG level is still an improvement.",
        "TN, KL, and Odisha are the states were traditionally meat has been consumed by majority and also the non-meat eating communities aren't actually the dominant ones in terms of wealth or land holding. However, in states like Gujarat and Rajasthan it's the non-meat eating mercantile communities that hold too much of prominence due to their wealth.",
        "Yup :( unfortunately, they control a lot of wealth and power in the center too, affecting states that don't have a problem with meat. Taking back that would be a start. As for Guj and Rajasthan, health awareness and center policies should help in a couple of generations hopefully. At least on eating eggs and fish.",
        "We get rid of Modi, what's next hold guns to their heads and ask them to eat meat? What has Modi got to do with what people eat. This post is dumb let the vegetarians die of naturally ",
        "Govt (Modi) controls policy, like giving eggs and meat to children in mid day meal programs. I understand respecting the choice of people who don't want to consume meat. They should be provided alternatives. But the vast majority of Indian children eat eggs and meat. And they are suffering from stunting due to the current govt's aversion of meat (due to their RSS/Isckon and jain influences). We should kick out Modi before they continue (and maybe worsen) this vegetarianism imposition on kids. \n\nI still remember the days when govt used to promote eating eggs everyday, and fish for pregnant women. All I see in govt nutritional advertisements are millets nowadays. Millets are not an answer to the nutritional deficiencies in India. \n\nThese children become the future citizens of our country FFS. We should take back our nutrition before radical vegetarians completely take over our plates."
    ],
    "cleaned_text": "meat eating states less stunting time kick modi else whole india becomes stunted source cnns already lost race height china asian countries militant vegetarianism promoted bjp worsen look poorly vegetarian states like gujarat perform even though wealthy ",
    "cleaned_title": "meat eating states less stunting time kick modi else whole india becomes stunted",
    "cleaned_selftext": "source cnns already lost race height china asian countries militant vegetarianism promoted bjp worsen look poorly vegetarian states like gujarat perform even though wealthy",
    "cleaned_comments": "problem even say kick modi states ingrained militant vegetarianism going change dietary habits unless say get end extreme ie progressive dictator mandates eggs meat every child atleast start hopefully dictator required tn kl odisha tg level still improvement tn kl odisha states traditionally meat consumed majority also nonmeat eating communities arent actually dominant ones terms wealth land holding however states like gujarat rajasthan nonmeat eating mercantile communities hold much prominence due wealth yup unfortunately control lot wealth power center affecting states dont problem meat taking back would start guj rajasthan health awareness center policies help couple generations hopefully least eating eggs fish get rid modi whats next hold guns heads ask eat meat modi got people eat post dumb let vegetarians die naturally govt modi controls policy like giving eggs meat children mid day meal programs understand respecting choice people dont want consume meat provided alternatives vast majority indian children eat eggs meat suffering stunting due current govts aversion meat due rssisckon jain influences kick modi continue maybe worsen vegetarianism imposition kids still remember days govt used promote eating eggs everyday fish pregnant women see govt nutritional advertisements millets nowadays millets answer nutritional deficiencies india children become future citizens country ffs take back nutrition radical vegetarians completely take plates",
    "light_cleaned_title": "Meat eating states have less stunting. Time to kick out Modi, or else whole India becomes stunted.",
    "light_cleaned_selftext": "Source: CNNS 2019 We have already lost the race of height with China and other Asian countries. Militant Vegetarianism promoted by BJP will worsen it. Look at how poorly vegetarian states like Gujarat perform, even though they are wealthy.",
    "light_cleaned_comments": "The problem is even if you say kick Modi out the states with in-grained militant vegetarianism are not going to change their dietary habits, until and unless say you get an other end of extreme I.e. a progressive dictator who mandates eggs and meat for every child..!! It's atleast a start :) And hopefully a dictator is not required. TN, KL, Odisha and TG level is still an improvement. TN, KL, and Odisha are the states were traditionally meat has been consumed by majority and also the non-meat eating communities aren't actually the dominant ones in terms of wealth or land holding. However, in states like Gujarat and Rajasthan it's the non-meat eating mercantile communities that hold too much of prominence due to their wealth. Yup :( unfortunately, they control a lot of wealth and power in the center too, affecting states that don't have a problem with meat. Taking back that would be a start. As for Guj and Rajasthan, health awareness and center policies should help in a couple of generations hopefully. At least on eating eggs and fish. We get rid of Modi, what's next hold guns to their heads and ask them to eat meat? What has Modi got to do with what people eat. This post is dumb let the vegetarians die of naturally Govt (Modi) controls policy, like giving eggs and meat to children in mid day meal programs. I understand respecting the choice of people who don't want to consume meat. They should be provided alternatives. But the vast majority of Indian children eat eggs and meat. And they are suffering from stunting due to the current govt's aversion of meat (due to their RSS/Isckon and jain influences). We should kick out Modi before they continue (and maybe worsen) this vegetarianism imposition on kids. I still remember the days when govt used to promote eating eggs everyday, and fish for pregnant women. All I see in govt nutritional advertisements are millets nowadays. Millets are not an answer to the nutritional deficiencies in India. These children become the future citizens of our country FFS. We should take back our nutrition before radical vegetarians completely take over our plates."
}