{
    "id": "1atvcgg",
    "title": "Deoghar ropeway accident was a disaster waiting to happen: Here's why",
    "url": "https://www.indiatoday.in/amp/india/story/deoghar-ropeway-accident-expired-licence-maintenance-safety-rules-flouted-jharkhand-tourism-1936793-2022-04-13",
    "selftext": "Out of the three dead, two people were killed during the rescue operation. While one man fell from one of the Indian Airforce choppers, another woman died after the rope which was being used to rescue her broke. \nTypical finger pointing and blame game started after the accident.",
    "flair": "Crime",
    "score": 18,
    "num_comments": 2,
    "created_utc": 1708266652.0,
    "convurl": "https://external-preview.redd.it/ygN188u4L1fJiq33ati4tOnFXQASQM1rtbzRmuh7uBo.jpg?auto=webp&s=ba5ba828cf4122d24c22ce5b46474c44f5c6e3fe",
    "comments": [
        "Please dont do anything that is remotely dangerous in india - sky diving, paragliding, ropeway. Shit qc standards and max corruption",
        "That's fine but this list should at least not include the Air Force and Rescue Operators."
    ],
    "cleaned_text": "deoghar ropeway accident disaster waiting happen heres three dead two people killed rescue operation one man fell one indian airforce choppers another woman died rope used rescue broke typical finger pointing blame game started accident ",
    "cleaned_title": "deoghar ropeway accident disaster waiting happen heres",
    "cleaned_selftext": "three dead two people killed rescue operation one man fell one indian airforce choppers another woman died rope used rescue broke typical finger pointing blame game started accident",
    "cleaned_comments": "please dont anything remotely dangerous india sky diving paragliding ropeway shit qc standards max corruption thats fine list least include air force rescue operators",
    "light_cleaned_title": "Deoghar ropeway accident was a disaster waiting to happen: Here's why",
    "light_cleaned_selftext": "Out of the three dead, two people were killed during the rescue operation. While one man fell from one of the Indian Airforce choppers, another woman died after the rope which was being used to rescue her broke. Typical finger pointing and blame game started after the accident.",
    "light_cleaned_comments": "Please dont do anything that is remotely dangerous in india - sky diving, paragliding, ropeway. Shit qc standards and max corruption That's fine but this list should at least not include the Air Force and Rescue Operators."
}