{
    "id": "ib9yb7",
    "title": "Don't swipe next! We write to the Parliamentary Standing Committee for sustained hearings and an international human rights audit of Facebook India",
    "url": "https://www.reddit.com/r/india/comments/ib9yb7/dont_swipe_next_we_write_to_the_parliamentary/",
    "selftext": "https://preview.redd.it/0dgx72ixqih51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=7d49f3e0351e7867e8107940f781b855f033403c\n\n## tl;dr\n\nThere has been an alarming press report published in the Wall Street Journal on August 14, 2020 titled, “Facebook’s Hate-Speech Rules Collide with Indian Politics” authored by Newley Purnell and Jeff Horwitz \\[“WSJ Story”\\]. It presents a journalistic investigation into the role of specific officials at Facebook India who have applied content moderation policies in a partisan manner enabling hate speech. We worry this is a larger pattern that has implications for the safety of citizens and the health of Indian democracy. Today, we wrote to the Parliamentary Committee on Information Technology for urgent steps including summons to it's top global executives, extensive hearings and an international human rights audit leading to reparations for victims. \n\n## Partisan enforcement on hate speech\n\nOver years accusations have often emerged from persons across the political spectrum but their impact is most often greater on persons which lack power. It is estimated that Facebook has close to 300 million users in India and is its largest global market. It has massive reach, economic and social power to cause impact. While such social networks facilitate and further the ability for users to avail their rights to free expression which is a goal to be protected, we are often confronted with harms caused by them. This requires systemic fixes and actual accountability to be fixed in a manner which is transparent, proportional and certain. \n\nTo us, there are two issues to be considered as per the WSJ Story. The *first* is the core claim made in which a specific instance of hate speech made by a politician is reported and a content review decision on it is influenced by senior staff in Facebook India. This points to worrying issues of trust not only in the content review and moderation practices but the role of individual assessments and the role played by the staff at Facebook India. We acknowledge that assessments are often contextual and subjective. Further, there may be space for genuine errors or omissions however urgent steps which must be taken to ensure trust, credibility in processes of content review. For a more detailed analysis of this, we would specifically like to draw reference to the Equality Labs : Facebook India Report 2019 ([**link**](https://static1.squarespace.com/static/58347d04bebafbb1e66df84c/t/5d0074f67458550001c56af1/1560311033798/Facebook_India_Report_Equality_Labs.pdf)) which has stated that, “*\\[t\\]he authors warn that without urgent intervention, such hate speech is likely to be weaponized as a trigger for large-scale communal violence in India.*”\n\n## Threats to democracy\n\nThe *second* core claim in the WSJ Story is with regard to Facebook India’s press releases on content takedowns during the 2019 general elections which display a partisan slant. We are concerned whether such practices extended to it’s content review itself. The specific event averted are content takedowns Facebook’s newsroom reported on April 1, 2019 that it undertook the removal of two separate and unrelated networks of pages, groups and accounts that engaged in “*coordinated unauthentic behaviour on Facebook and Instagram*” ([**link**](https://about.fb.com/news/2019/04/cib-and-spam-from-india-pakistan/)). As noted in the WSJ Report, there was the mention of one political party only despite a clear inference as to the source of the second network being another political party. Here, the lack of accountability and transparency by Facebook is glaring. There are no sources to corroborate the facts put out as to whether the reasons behind these takedowns are legitimate.\n\nAt present the response from Facebook Inc. and Facebook India has been disappointing. They have in press statements indicated that they are working on, “regular audits”, and seeking to improve their “internal processes”. These are vague, non-commitments for redressal and will lead to continuing harms to the close to 300 million users of Facebook in India. These are similar to vague responses similar to when the Cambridge Analytica case first came to light on which there has been little or no outcome. We had referred to specific interventions which need to be considered in this regard *inter alia* by [**correspondence dated February 25, 2019**](https://internetfreedom.in/too-many-cooks/).\n\n### Steps to be taken\n\nWe believe that content moderation and platform governance are complex issues. They consider values of free expression and the limits to them. While awaiting the creation of institutional change and processes that advance these values as per the Constitution of India, urgent steps are required in the interim to fix accountability and prevent further harm. To take this demand forward today we wrote to the Standing Committee on Information Technology recommending that they hold a hearing within the topic of, \"*‘Safeguarding citizens’ data on social/online news media platforms’\".*\n\nWe suggest the following actions that may be considered by it in its  engagement with Facebook Inc. and Facebook India: \n\n1. **Open a hearing with Facebook Global :** Summons must be issued to senior management of Facebook Inc. which oversee the operations of Facebook India to participate in the proceedings of this Ld. Committee.\n2. **Suggest a international human rights audit :** Facebook Inc. must take urgent and immediate action as necessary to conduct a full human rights audit of its India operations as conducted as per the report released on July 8, 2020 ([**link**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf)). This process is distinct from regular audits must be established by Facebook Inc. through its global offices that are outside the influence of Facebook India to maintain the safety and trust in this process and its outcomes. Further, there must be a focus on independence, impartiality and transparency with regular updates on progress. To clarify, this full report must be made publicly available as per a similar model adopted for the report released on July 8, 2020. \n3. **Reparations for victims :** Facebook Inc. must consider financial reparations for victims of hate speech in India for any specific instances identified by the global audit. This must encompass physical and mental suffering. Further, since this damage is not economically quantifiable, the assessment must be made in equity. Here we would like to make reference to the practitioners guide on, “The Right to a Remedy and Reparation for Gross Human Rights Violations” published by the International Commission of Jurists in 2018 ([**link**](https://www.icj.org/wp-content/uploads/2018/11/Universal-Right-to-a-Remedy-Publications-Reports-Practitioners-Guides-2018-ENG.pdf)).\n\n## Important Documents\n\n1. Representation to Parliamentary Standing Committee on IT regarding the WSJ Story on Facebook India dated August 17, 2020 ([**link**](https://drive.google.com/file/d/1xb10VWRZVKnEcUaQ90E11VbFmSJeR1qw/view?usp=sharing))\n2. Link to the WSJ Story dated August 14, 2020 ([**link**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346))\n3. Study by Equality Labs on Hatespeech and Facebook India in 2019 ([**link**](https://static1.squarespace.com/static/58347d04bebafbb1e66df84c/t/5d0074f67458550001c56af1/1560311033798/Facebook_India_Report_Equality_Labs.pdf))\n4. Facebook Inc. Civil Rights Audit Report dated July 8, 2020 ([**link**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf))\n\nA matching donation is being hosted by [Rahul Gonsalves](https://twitter.com/gonsalves_r) for the Internet Freedom Foundation. For all the donations you make to IFF today, Rahul will match the amount. [Double your impact today! Donate to IFF!](https://www.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 149,
    "num_comments": 11,
    "created_utc": 1597651184,
    "convurl": "https://a.thumbs.redditmedia.com/oHJdhHsu8y4LCHqYqtfebnhuD9P1jGQaJgX8I1DkMX4.jpg",
    "comments": [
        "This sounds like overreach.           \nIf you want to audit every social media outlet you would be stifling free speech and bring any deviation from “group think” an auditable event. Does it mean reddit posts and policies need to have an audit and expose posters behind them?             \nThis is opposite of Internet freedom",
        "No! The power that FB has today is unparallel in the history of open media. They are not ‘every’ social media outlet. If they aren’t questioned then get ready for the Govts that would do exactly what you are trying to save. So despite of being an advocate of free speech, I strongly believe FB that could change the stance of any democracy needs to be brought into heavy regulations. \n\nWhat’s most that could happen as a result? It would leave India? Well, good riddance then.",
        "It is a slippery slope. Today there is this group of activist(I think?) want to bring some kind of inquisition to FB. Tomorrow another group of activists want to do the same to reddit/twitter. Any self motivated group of people bringing down one social media or another doesn't contribute to free speech. Internetfreedom may not be the only group in the fray \"fighting\" social media.                   \nMoreover do you want outside people questioning how you go about your business? Any busybody would want to audit another company in the garb of activism. This can get easily out of hand. FB is a private company. If you don't want to use FB, stop using it. Or you advocate people to not use it. This meddling into a private company's business decisions can get too much too quick.                   \nEDIT: Also reparations from FB?! That's when this petition jumped the shark.",
        "&gt;  If you don't want to use FB, stop using it. Or you advocate people to not use it. \n\nOh man! If this was ever that simple. I stopped using it altogether about 3-4 years ago (or I think may be more), as it never appealed to me.\n\nYour other points are very well valid; and I tend to agree with you. But if there's something about Facebook's algos that suppresses the very free speech that seem to suggest they are in cahoot of the Govt. of the day (regardless of the kind of Govt. , left, right, centre, etc.). Don't you think it needs to be looked into one way or the other? There is a reason why they are/were summoned by the US, Canada, EU, etc. courts for one reason or another. \n\nIt's not quite as simple as 'let them do business however they want'. There is more going on behind the doors politically.",
        "Thanks for agreeing with atleast some of them.        \nWhat to do with FB? Hive off the personal FB part from the news publishing part. The news publishing part should be treated as a media company. The rest can be a social media division. Of course you might have better ideas.",
        "While US FB enjoying too much of liberty we are fighting for it ... Wah re Duniya"
    ],
    "cleaned_text": "dont swipe next write parliamentary standing committee sustained hearings international human rights audit facebook india tldr alarming press report published wall street journal august titled facebooks hatespeech rules collide indian politics authored newley purnell jeff horwitz wsj story presents journalistic investigation role specific officials facebook india applied content moderation policies partisan manner enabling hate speech worry larger pattern implications safety citizens health indian democracy today wrote parliamentary committee information technology urgent steps including summons top global executives extensive hearings international human rights audit leading reparations victims partisan enforcement hate speech years accusations often emerged persons across political spectrum impact often greater persons lack power estimated facebook close million users india largest global market massive reach economic social power cause impact social networks facilitate ability users avail rights free expression goal protected often confronted harms caused requires systemic fixes actual accountability fixed manner transparent proportional certain us two issues considered per wsj story first core claim made specific instance hate speech made politician reported content review decision influenced senior staff facebook india points worrying issues trust content review moderation practices role individual assessments role played staff facebook india acknowledge assessments often contextual subjective may space genuine errors omissions however urgent steps must taken ensure trust credibility processes content review detailed analysis would specifically like draw reference equality labs facebook india report linkhttpsstaticsquarespacecomstaticdbebafbbedfctdfcaffacebookindiareportequalitylabspdf stated authors warn without urgent intervention hate speech likely weaponized trigger largescale communal violence india threats democracy second core claim wsj story regard facebook indias press releases content takedowns general elections display partisan slant concerned whether practices extended content review specific event averted content takedowns facebooks newsroom reported april undertook removal two separate unrelated networks pages groups accounts engaged coordinated unauthentic behaviour facebook instagram linkhttpsaboutfbcomnewscibandspamfromindiapakistan noted wsj report mention one political party despite clear inference source second network another political party lack accountability transparency facebook glaring sources corroborate facts put whether reasons behind takedowns legitimate present response facebook inc facebook india disappointing press statements indicated working regular audits seeking improve internal processes vague noncommitments redressal lead continuing harms close million users facebook india similar vague responses similar cambridge analytica case first came light little outcome referred specific interventions need considered regard inter alia correspondence dated february httpsinternetfreedomintoomanycooks steps taken believe content moderation platform governance complex issues consider values free expression limits awaiting creation institutional change processes advance values per constitution india urgent steps required interim fix accountability prevent harm take demand forward today wrote standing committee information technology recommending hold hearing within topic safeguarding citizens data socialonline news media platforms suggest following actions may considered engagement facebook inc facebook india open hearing facebook global summons must issued senior management facebook inc oversee operations facebook india participate proceedings ld committee suggest international human rights audit facebook inc must take urgent immediate action necessary conduct full human rights audit india operations conducted per report released july linkhttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf process distinct regular audits must established facebook inc global offices outside influence facebook india maintain safety trust process outcomes must focus independence impartiality transparency regular updates progress clarify full report must made publicly available per similar model adopted report released july reparations victims facebook inc must consider financial reparations victims hate speech india specific instances identified global audit must encompass physical mental suffering since damage economically quantifiable assessment must made equity would like make reference practitioners guide right remedy reparation gross human rights violations published international commission jurists linkhttpswwwicjorgwpcontentuploadsuniversalrighttoaremedypublicationsreportspractitionersguidesengpdf important documents representation parliamentary standing committee regarding wsj story facebook india dated august linkhttpsdrivegooglecomfiledxbvwrzvknecuaqevbfmsjerqwviewuspsharing link wsj story dated august linkhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerberg study equality labs hatespeech facebook india linkhttpsstaticsquarespacecomstaticdbebafbbedfctdfcaffacebookindiareportequalitylabspdf facebook inc civil rights audit report dated july linkhttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf matching donation hosted rahul gonsalveshttpstwittercomgonsalvesr internet freedom foundation donations make iff today rahul match amount double impact today donate iffhttpswwwinternetfreedomindonate ",
    "cleaned_title": "dont swipe next write parliamentary standing committee sustained hearings international human rights audit facebook india",
    "cleaned_selftext": "tldr alarming press report published wall street journal august titled facebooks hatespeech rules collide indian politics authored newley purnell jeff horwitz wsj story presents journalistic investigation role specific officials facebook india applied content moderation policies partisan manner enabling hate speech worry larger pattern implications safety citizens health indian democracy today wrote parliamentary committee information technology urgent steps including summons top global executives extensive hearings international human rights audit leading reparations victims partisan enforcement hate speech years accusations often emerged persons across political spectrum impact often greater persons lack power estimated facebook close million users india largest global market massive reach economic social power cause impact social networks facilitate ability users avail rights free expression goal protected often confronted harms caused requires systemic fixes actual accountability fixed manner transparent proportional certain us two issues considered per wsj story first core claim made specific instance hate speech made politician reported content review decision influenced senior staff facebook india points worrying issues trust content review moderation practices role individual assessments role played staff facebook india acknowledge assessments often contextual subjective may space genuine errors omissions however urgent steps must taken ensure trust credibility processes content review detailed analysis would specifically like draw reference equality labs facebook india report linkhttpsstaticsquarespacecomstaticdbebafbbedfctdfcaffacebookindiareportequalitylabspdf stated authors warn without urgent intervention hate speech likely weaponized trigger largescale communal violence india threats democracy second core claim wsj story regard facebook indias press releases content takedowns general elections display partisan slant concerned whether practices extended content review specific event averted content takedowns facebooks newsroom reported april undertook removal two separate unrelated networks pages groups accounts engaged coordinated unauthentic behaviour facebook instagram linkhttpsaboutfbcomnewscibandspamfromindiapakistan noted wsj report mention one political party despite clear inference source second network another political party lack accountability transparency facebook glaring sources corroborate facts put whether reasons behind takedowns legitimate present response facebook inc facebook india disappointing press statements indicated working regular audits seeking improve internal processes vague noncommitments redressal lead continuing harms close million users facebook india similar vague responses similar cambridge analytica case first came light little outcome referred specific interventions need considered regard inter alia correspondence dated february httpsinternetfreedomintoomanycooks steps taken believe content moderation platform governance complex issues consider values free expression limits awaiting creation institutional change processes advance values per constitution india urgent steps required interim fix accountability prevent harm take demand forward today wrote standing committee information technology recommending hold hearing within topic safeguarding citizens data socialonline news media platforms suggest following actions may considered engagement facebook inc facebook india open hearing facebook global summons must issued senior management facebook inc oversee operations facebook india participate proceedings ld committee suggest international human rights audit facebook inc must take urgent immediate action necessary conduct full human rights audit india operations conducted per report released july linkhttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf process distinct regular audits must established facebook inc global offices outside influence facebook india maintain safety trust process outcomes must focus independence impartiality transparency regular updates progress clarify full report must made publicly available per similar model adopted report released july reparations victims facebook inc must consider financial reparations victims hate speech india specific instances identified global audit must encompass physical mental suffering since damage economically quantifiable assessment must made equity would like make reference practitioners guide right remedy reparation gross human rights violations published international commission jurists linkhttpswwwicjorgwpcontentuploadsuniversalrighttoaremedypublicationsreportspractitionersguidesengpdf important documents representation parliamentary standing committee regarding wsj story facebook india dated august linkhttpsdrivegooglecomfiledxbvwrzvknecuaqevbfmsjerqwviewuspsharing link wsj story dated august linkhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerberg study equality labs hatespeech facebook india linkhttpsstaticsquarespacecomstaticdbebafbbedfctdfcaffacebookindiareportequalitylabspdf facebook inc civil rights audit report dated july linkhttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf matching donation hosted rahul gonsalveshttpstwittercomgonsalvesr internet freedom foundation donations make iff today rahul match amount double impact today donate iffhttpswwwinternetfreedomindonate",
    "cleaned_comments": "sounds like overreach want audit every social media outlet would stifling free speech bring deviation group think auditable event mean reddit posts policies need audit expose posters behind opposite internet freedom power fb today unparallel history open media every social media outlet arent questioned get ready govts would exactly trying save despite advocate free speech strongly believe fb could change stance democracy needs brought heavy regulations whats could happen result would leave india well good riddance slippery slope today group activisti think want bring kind inquisition fb tomorrow another group activists want reddittwitter self motivated group people bringing one social media another doesnt contribute free speech internetfreedom may group fray fighting social media moreover want outside people questioning go business busybody would want audit another company garb activism get easily hand fb private company dont want use fb stop using advocate people use meddling private companys business decisions get much quick edit also reparations fb thats petition jumped shark gt dont want use fb stop using advocate people use oh man ever simple stopped using altogether years ago think may never appealed points well valid tend agree theres something facebooks algos suppresses free speech seem suggest cahoot govt day regardless kind govt left right centre etc dont think needs looked one way reason arewere summoned us canada eu etc courts one reason another quite simple let business however want going behind doors politically thanks agreeing atleast fb hive personal fb part news publishing part news publishing part treated media company rest social media division course might better ideas us fb enjoying much liberty fighting wah duniya",
    "light_cleaned_title": "Don't swipe next! We write to the Parliamentary Standing Committee for sustained hearings and an international human rights audit of Facebook India",
    "light_cleaned_selftext": "## tl;dr There has been an alarming press report published in the Wall Street Journal on August 14, 2020 titled, “Facebook’s Hate-Speech Rules Collide with Indian Politics” authored by Newley Purnell and Jeff Horwitz \\[“WSJ Story”\\]. It presents a journalistic investigation into the role of specific officials at Facebook India who have applied content moderation policies in a partisan manner enabling hate speech. We worry this is a larger pattern that has implications for the safety of citizens and the health of Indian democracy. Today, we wrote to the Parliamentary Committee on Information Technology for urgent steps including summons to it's top global executives, extensive hearings and an international human rights audit leading to reparations for victims. ## Partisan enforcement on hate speech Over years accusations have often emerged from persons across the political spectrum but their impact is most often greater on persons which lack power. It is estimated that Facebook has close to 300 million users in India and is its largest global market. It has massive reach, economic and social power to cause impact. While such social networks facilitate and further the ability for users to avail their rights to free expression which is a goal to be protected, we are often confronted with harms caused by them. This requires systemic fixes and actual accountability to be fixed in a manner which is transparent, proportional and certain. To us, there are two issues to be considered as per the WSJ Story. The *first* is the core claim made in which a specific instance of hate speech made by a politician is reported and a content review decision on it is influenced by senior staff in Facebook India. This points to worrying issues of trust not only in the content review and moderation practices but the role of individual assessments and the role played by the staff at Facebook India. We acknowledge that assessments are often contextual and subjective. Further, there may be space for genuine errors or omissions however urgent steps which must be taken to ensure trust, credibility in processes of content review. For a more detailed analysis of this, we would specifically like to draw reference to the Equality Labs : Facebook India Report 2019 ([**link**](https://static1.squarespace.com/static/58347d04bebafbb1e66df84c/t/5d0074f67458550001c56af1/1560311033798/Facebook_India_Report_Equality_Labs.pdf)) which has stated that, “*\\[t\\]he authors warn that without urgent intervention, such hate speech is likely to be weaponized as a trigger for large-scale communal violence in India.*” ## Threats to democracy The *second* core claim in the WSJ Story is with regard to Facebook India’s press releases on content takedowns during the 2019 general elections which display a partisan slant. We are concerned whether such practices extended to it’s content review itself. The specific event averted are content takedowns Facebook’s newsroom reported on April 1, 2019 that it undertook the removal of two separate and unrelated networks of pages, groups and accounts that engaged in “*coordinated unauthentic behaviour on Facebook and Instagram*” ([**link**](https://about.fb.com/news/2019/04/cib-and-spam-from-india-pakistan/)). As noted in the WSJ Report, there was the mention of one political party only despite a clear inference as to the source of the second network being another political party. Here, the lack of accountability and transparency by Facebook is glaring. There are no sources to corroborate the facts put out as to whether the reasons behind these takedowns are legitimate. At present the response from Facebook Inc. and Facebook India has been disappointing. They have in press statements indicated that they are working on, “regular audits”, and seeking to improve their “internal processes”. These are vague, non-commitments for redressal and will lead to continuing harms to the close to 300 million users of Facebook in India. These are similar to vague responses similar to when the Cambridge Analytica case first came to light on which there has been little or no outcome. We had referred to specific interventions which need to be considered in this regard *inter alia* by [**correspondence dated February 25, 2019**](https://internetfreedom.in/too-many-cooks/). ### Steps to be taken We believe that content moderation and platform governance are complex issues. They consider values of free expression and the limits to them. While awaiting the creation of institutional change and processes that advance these values as per the Constitution of India, urgent steps are required in the interim to fix accountability and prevent further harm. To take this demand forward today we wrote to the Standing Committee on Information Technology recommending that they hold a hearing within the topic of, \"*‘Safeguarding citizens’ data on social/online news media platforms’\".* We suggest the following actions that may be considered by it in its engagement with Facebook Inc. and Facebook India: 1. **Open a hearing with Facebook Global :** Summons must be issued to senior management of Facebook Inc. which oversee the operations of Facebook India to participate in the proceedings of this Ld. Committee. 2. **Suggest a international human rights audit :** Facebook Inc. must take urgent and immediate action as necessary to conduct a full human rights audit of its India operations as conducted as per the report released on July 8, 2020 ([**link**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf)). This process is distinct from regular audits must be established by Facebook Inc. through its global offices that are outside the influence of Facebook India to maintain the safety and trust in this process and its outcomes. Further, there must be a focus on independence, impartiality and transparency with regular updates on progress. To clarify, this full report must be made publicly available as per a similar model adopted for the report released on July 8, 2020. 3. **Reparations for victims :** Facebook Inc. must consider financial reparations for victims of hate speech in India for any specific instances identified by the global audit. This must encompass physical and mental suffering. Further, since this damage is not economically quantifiable, the assessment must be made in equity. Here we would like to make reference to the practitioners guide on, “The Right to a Remedy and Reparation for Gross Human Rights Violations” published by the International Commission of Jurists in 2018 ([**link**](https://www.icj.org/wp-content/uploads/2018/11/Universal-Right-to-a-Remedy-Publications-Reports-Practitioners-Guides-2018-ENG.pdf)). ## Important Documents 1. Representation to Parliamentary Standing Committee on IT regarding the WSJ Story on Facebook India dated August 17, 2020 ([**link**](https://drive.google.com/file/d/1xb10VWRZVKnEcUaQ90E11VbFmSJeR1qw/view?usp=sharing)) 2. Link to the WSJ Story dated August 14, 2020 ([**link**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346)) 3. Study by Equality Labs on Hatespeech and Facebook India in 2019 ([**link**](https://static1.squarespace.com/static/58347d04bebafbb1e66df84c/t/5d0074f67458550001c56af1/1560311033798/Facebook_India_Report_Equality_Labs.pdf)) 4. Facebook Inc. Civil Rights Audit Report dated July 8, 2020 ([**link**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf)) A matching donation is being hosted by [Rahul Gonsalves](https://twitter.com/gonsalves_r) for the Internet Freedom Foundation. For all the donations you make to IFF today, Rahul will match the amount. [Double your impact today! Donate to IFF!](https://www.internetfreedom.in/donate)",
    "light_cleaned_comments": "This sounds like overreach. If you want to audit every social media outlet you would be stifling free speech and bring any deviation from “group think” an auditable event. Does it mean reddit posts and policies need to have an audit and expose posters behind them? This is opposite of Internet freedom No! The power that FB has today is unparallel in the history of open media. They are not ‘every’ social media outlet. If they aren’t questioned then get ready for the Govts that would do exactly what you are trying to save. So despite of being an advocate of free speech, I strongly believe FB that could change the stance of any democracy needs to be brought into heavy regulations. What’s most that could happen as a result? It would leave India? Well, good riddance then. It is a slippery slope. Today there is this group of activist(I think?) want to bring some kind of inquisition to FB. Tomorrow another group of activists want to do the same to reddit/twitter. Any self motivated group of people bringing down one social media or another doesn't contribute to free speech. Internetfreedom may not be the only group in the fray \"fighting\" social media. Moreover do you want outside people questioning how you go about your business? Any busybody would want to audit another company in the garb of activism. This can get easily out of hand. FB is a private company. If you don't want to use FB, stop using it. Or you advocate people to not use it. This meddling into a private company's business decisions can get too much too quick. EDIT: Also reparations from FB?! That's when this petition jumped the shark. &gt; If you don't want to use FB, stop using it. Or you advocate people to not use it. Oh man! If this was ever that simple. I stopped using it altogether about 3-4 years ago (or I think may be more), as it never appealed to me. Your other points are very well valid; and I tend to agree with you. But if there's something about Facebook's algos that suppresses the very free speech that seem to suggest they are in cahoot of the Govt. of the day (regardless of the kind of Govt. , left, right, centre, etc.). Don't you think it needs to be looked into one way or the other? There is a reason why they are/were summoned by the US, Canada, EU, etc. courts for one reason or another. It's not quite as simple as 'let them do business however they want'. There is more going on behind the doors politically. Thanks for agreeing with atleast some of them. What to do with FB? Hive off the personal FB part from the news publishing part. The news publishing part should be treated as a media company. The rest can be a social media division. Of course you might have better ideas. While US FB enjoying too much of liberty we are fighting for it ... Wah re Duniya"
}