{
    "id": "13j53an",
    "title": "Hiring | IFF is looking for a Digital Literacy Intern",
    "url": "https://www.reddit.com/r/india/comments/13j53an/hiring_iff_is_looking_for_a_digital_literacy/",
    "selftext": "https://preview.redd.it/sg44tbhc270b1.png?width=1600&format=png&auto=webp&v=enabled&s=437212d72dee12d31ce6c83e6da53a7a05bc9e91\n\nDo you want to join India’s No.1 Producer of Memes on Digital Rights?  \nWe’re hiring! IFF is looking for a Digital Literacy intern to join our communications team! Applicants will be reviewed on a rolling basis.  \nApply here   \n[https://forms.internetfreedom.in/survey/p/749e4f89-0a7e-4385-84ea-9d85f7329e38/r/o](https://forms.internetfreedom.in/survey/p/749e4f89-0a7e-4385-84ea-9d85f7329e38/r/o) \n\nHelp shape communications for a digital rights organisation working on the cutting edge of issues like surveillance, censorship, & net neutrality. You can find the complete job description here   \n[https://drive.google.com/file/d/14-PLUXzlNaAjCVynY4dga4blD-fcJO\\_M/view?usp=sharing](https://drive.google.com/file/d/14-PLUXzlNaAjCVynY4dga4blD-fcJO_M/view?usp=sharing)\n\nThis position will be full-time, based out of IFF's office in New Delhi. Interns will receive a stipend of INR 10,000 per month.",
    "flair": "Policy/Economy",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1684243290.0,
    "convurl": "https://external-preview.redd.it/3X4vZCi3dfT7yKGB-Kpj0LcVhO0pKqD50hGF0MLA85E.jpg?auto=webp&v=enabled&s=90c52bc774ea7a1ce8c9aff4b2b96d4b36c39d85",
    "comments": [],
    "cleaned_text": "hiring iff looking digital literacy intern want join indias producer memes digital rights hiring iff looking digital literacy intern join communications team applicants reviewed rolling basis apply httpsformsinternetfreedominsurveypefaeeadferohttpsformsinternetfreedominsurveypefaeeadfero help shape communications digital rights organisation working cutting edge issues like surveillance censorship net neutrality find complete job description httpsdrivegooglecomfiledpluxzlnaajcvynydgabldfcjomviewuspsharinghttpsdrivegooglecomfiledpluxzlnaajcvynydgabldfcjomviewuspsharing position fulltime based iffs office new delhi interns receive stipend inr per month ",
    "cleaned_title": "hiring iff looking digital literacy intern",
    "cleaned_selftext": "want join indias producer memes digital rights hiring iff looking digital literacy intern join communications team applicants reviewed rolling basis apply httpsformsinternetfreedominsurveypefaeeadferohttpsformsinternetfreedominsurveypefaeeadfero help shape communications digital rights organisation working cutting edge issues like surveillance censorship net neutrality find complete job description httpsdrivegooglecomfiledpluxzlnaajcvynydgabldfcjomviewuspsharinghttpsdrivegooglecomfiledpluxzlnaajcvynydgabldfcjomviewuspsharing position fulltime based iffs office new delhi interns receive stipend inr per month",
    "cleaned_comments": "",
    "light_cleaned_title": "Hiring | IFF is looking for a Digital Literacy Intern",
    "light_cleaned_selftext": "Do you want to join India’s No.1 Producer of Memes on Digital Rights? We’re hiring! IFF is looking for a Digital Literacy intern to join our communications team! Applicants will be reviewed on a rolling basis. Apply here [https://forms.internetfreedom.in/survey/p/749e4f89-0a7e-4385-84ea-9d85f7329e38/r/o](https://forms.internetfreedom.in/survey/p/749e4f89-0a7e-4385-84ea-9d85f7329e38/r/o) Help shape communications for a digital rights organisation working on the cutting edge of issues like surveillance, censorship, & net neutrality. You can find the complete job description here [https://drive.google.com/file/d/14-PLUXzlNaAjCVynY4dga4blD-fcJO\\_M/view?usp=sharing](https://drive.google.com/file/d/14-PLUXzlNaAjCVynY4dga4blD-fcJO_M/view?usp=sharing) This position will be full-time, based out of IFF's office in New Delhi. Interns will receive a stipend of INR 10,000 per month.",
    "light_cleaned_comments": ""
}