{
    "id": "16hfvwe",
    "title": "Alien Sightings in India: Do We Have Any Stories to Share?",
    "url": "https://www.reddit.com/r/india/comments/16hfvwe/alien_sightings_in_india_do_we_have_any_stories/",
    "selftext": "With all the recent buzz about aliens in Mexico, I couldn't help but wonder if we have any similar stories right here in India.\n\nRef : https://www.marca.com/en/lifestyle/world-news/2023/09/13/65011a37ca4741e5678b4580.html",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694587965.0,
    "convurl": "https://external-preview.redd.it/6s0P6p06E15902dFQGIlNkQE8xIThlFUsm8NTowGriw.jpg?auto=webp&s=ed607f080dffac6af5285ce3265fb020e1829601",
    "comments": [
        "The chances of it being a \"God Avatar\" sighting even when an actual alien shows up in India are very high.",
        "True 😂.",
        "this is an extremely dubious report, imo, more specifically, the line \" DNA evidence using radioactive dating\" Is damn sus",
        "Proof that aliens doesn’t exist is that this region, South Asia, has about 30% of world population yet their sightings here is almost nonexistent.",
        "Okay I actually read a couple of articles about this event instead of merely the headline like most people and what's worth noting is that the corpses have been examined  by merely one institution, namely National Autonomous University of Mexico, so obviously more thorough and widespread scientific investigation of the corpses is warranted before taking this news seriously.",
        "Ya there is some fishy stuff about that."
    ],
    "cleaned_text": "alien sightings india stories share recent buzz aliens mexico couldnt help wonder similar stories right india ref ",
    "cleaned_title": "alien sightings india stories share",
    "cleaned_selftext": "recent buzz aliens mexico couldnt help wonder similar stories right india ref",
    "cleaned_comments": "chances god avatar sighting even actual alien shows india high true extremely dubious report imo specifically line dna evidence using radioactive dating damn sus proof aliens doesnt exist region south asia world population yet sightings almost nonexistent okay actually read couple articles event instead merely headline like people whats worth noting corpses examined merely one institution namely national autonomous university mexico obviously thorough widespread scientific investigation corpses warranted taking news seriously ya fishy stuff",
    "light_cleaned_title": "Alien Sightings in India: Do We Have Any Stories to Share?",
    "light_cleaned_selftext": "With all the recent buzz about aliens in Mexico, I couldn't help but wonder if we have any similar stories right here in India. Ref :",
    "light_cleaned_comments": "The chances of it being a \"God Avatar\" sighting even when an actual alien shows up in India are very high. True 😂. this is an extremely dubious report, imo, more specifically, the line \" DNA evidence using radioactive dating\" Is damn sus Proof that aliens doesn’t exist is that this region, South Asia, has about 30% of world population yet their sightings here is almost nonexistent. Okay I actually read a couple of articles about this event instead of merely the headline like most people and what's worth noting is that the corpses have been examined by merely one institution, namely National Autonomous University of Mexico, so obviously more thorough and widespread scientific investigation of the corpses is warranted before taking this news seriously. Ya there is some fishy stuff about that."
}