{
    "id": "lfalbo",
    "title": "A timeline of the undemocratic takedown of Twitter accounts + legal concerns",
    "url": "https://www.reddit.com/r/india/comments/lfalbo/a_timeline_of_the_undemocratic_takedown_of/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/0y1a2vnvw8g61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=5d69798177395296c69cdc65e8d9d967233367d8\n\n## Tl;dr\n\nRecent events regarding the blocking of pro farmer protests Twitter accounts reek of government censorship. Furthermore, the process by which the Ministry of Electronics and Information Technology initiated the blocks is excessively opaque. We wrote to the Ministry asking them to make the orders publicly available so as to increase transparency.\n\n## A Timeline of the Events\n\nLate in the afternoon on 1st February, [**several**](https://www.thehindu.com/news/national/twitter-blocks-several-accounts-posting-messages-in-support-of-farmers-stir-restores-most-of-them-later/article33717312.ece) [**news reports**](https://www.reuters.com/article/us-india-farms-protests-twitter-idUSKBN2A12J9) emerged of multiple Twitter accounts being blocked in response to a legal request from the Ministry of Electronics and Information Technology. Based on the reports,  it seemed as if [**close to 250 accounts**](https://scroll.in/latest/985648/twitter-withholds-accounts-of-caravan-kisan-ekta-morcha-and-others-in-response-to-legal-request.), belonging to a diverse group of entities such as news media organisations, politicians, activists, and farmers groups, were reported to have been blocked.\n\nThe rationale purportedly as per press reports was that these accounts had been making [**provocative tweets about the farmer protests**](https://thewire.in/rights/twitter-withheld-caravan-kisan-ekta-morcha) and had been using a specific hashtag. However, this was not substantiated, as such direction issued purportedly under Section 69A has not yet been made public.\n\nSubsequent media reports claim that [**Twitter contested the order**](https://www.thehindu.com/news/national/twitter-blocks-several-accounts-posting-messages-in-support-of-farmers-stir-restores-most-of-them-later/article33717312.ece) as per observable inferences. While Twitter subsequently restored the blocked accounts [**by the evening of 1st February**](https://www.thehindu.com/news/national/twitter-restores-several-accounts-it-had-withheld-over-farmer-protest-tweets/article33735013.ece) after significant public outrage, concerns about [**secrecy, proportionality and arbitrariness**](https://www.thehindubusinessline.com/info-tech/social-media/concerns-raised-over-blocking-of-twitter-accounts-in-india/article33734279.ece) have been raised. Furthermore, on February 3rd, the Ministry is reported to have sent an order to Twitter warning it about this decision.\n\nThe Ministry, pointing to Twitter’s obligations as an intermediary bound by Centre’s guidelines under section 69A of the Information Technology Act, 2000, [**asked Twitter to comply**](https://www.indiatoday.in/india/story/government-issues-notice-twitter-remove-contents-related-narendra-modi-farmer-genocide-1765493-2021-02-03) with the earlier order or face criminal proceedings with penal consequences of imprisonment for up to 7 years. A [**press note**](https://indianexpress.com/article/india/twitter-withholds-multiple-accounts-following-direction-from-it-ministry-7170134/) also seems to have been privately circulated amongst various media outlets that provided further details about the same and outlined both the rationale behind the initial order as well as the Centre’s stance on Twitter’s response.\n\nOn 8th February, [**fresh reports emerged**](https://economictimes.indiatimes.com/tech/technology/farmer-protests-govt-sends-fresh-notice-to-twitter-on-accounts-flagged/articleshow/80738857.cms) of a new order having been sent by the Ministry on 4th February, sharing a list of 1,178 more accounts that it wanted removed.\n\n## A lack of accountability and transparency\n\nSuch actions are harmful not only for operational transparency but also for India’s democratic ethos. The accounts in question have pointed out criticisms of the government in the past, and so blocking such accounts, especially those that belong to media organisations such as Caravan, is tantamount to censorship (especially when the government has failed to substantiate the grounds on which the order for blocking was based).\n\nThe secrecy and lack of a clear process with respect to the blocking of the accounts is especially concerning if directions have indeed been made under Section 69A of the Information Technology Act, 2000. From news reports no show cause notice or opportunity to present a defence has been provided to the users of these accounts. Indeed, Twitter did not even notify most of these accounts about their access being withheld.\n\nAdditionally, the directions themselves, which would contain the reasons for why the accounts have been directed to be suspended, have not been made public. This directly impacts the users of the accounts with respect to their fundamental rights to freedom of speech and expression and access to judicial remedies. Furthermore, it is in breach of the directions of the Supreme Court in the [**Shreya Singhal**](https://internetfreedom.in/we-urge-meity-to-press-reboot-on-the-intermediary-rules-saveourprivacy-righttomeme/) (paras 117, 118, &amp; 119) and [**Anuradha Bhasin**](https://cis-india.org/internet-governance/blog/content-takedown-and-users-rights-1) Judgements (paras 15, 16, 17, &amp; 18) that recognise the public’s right to receive public information and any censorship for it being as per principles of transparency and proactive disclosures.\n\n## Recommendations\n\nIn light of the above, we urge the Ministry to recall these directions for blocking of the Twitter accounts and in future commence any proceedings by providing a fair and clear opportunity to the users of accounts to participate and present their defence. Further, any eventual orders under Section 69A must be made publicly available.\n\n### Important Documents\n\n1. IFF's letter to MEITY regarding 'Secretive and disproportionate directions issued to Twitter under Section 69A of the Information Technology Act, 2000' ([**link**](https://drive.google.com/file/d/1TgaTYUu2yFZeENH6iV7_2AKdhBoFwEJk/view?usp=sharing))\n2. A previous post containing an analysis of the The Information Technology \\[Intermediaries Guidelines (Amendment) Rules\\], 2018 ([**link**](https://internetfreedom.in/india-must-resist-the-lure-of-the-chinese-model-of-surveillance-and-censorship-intermediaryrules-righttomeme-saveourprivacy/))\n3. Our comments and counter comments on the proposed changes to the Intermediaries Guidelines (Amendment) Rules ([**link**](https://internetfreedom.in/a16022019/))",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 3,
    "created_utc": 1612786569,
    "convurl": "https://b.thumbs.redditmedia.com/z_SMI2DXKMwZKGwOyihLtU-RfMLg_P7-W16jIkXDsLo.jpg",
    "comments": [
        "This should be taken seriously. Or else we becm china and north korea soon.",
        "North Korea has religion banned, we'd be closer to China or in the worst case- Nazi Germany(except this time with nukes- yay!)",
        "Everything sounds worse :-("
    ],
    "cleaned_text": "timeline undemocratic takedown twitter accounts legal concerns ampxb tldr recent events regarding blocking pro farmer protests twitter accounts reek government censorship furthermore process ministry electronics information technology initiated blocks excessively opaque wrote ministry asking make orders publicly available increase transparency timeline events late afternoon st february severalhttpswwwthehinducomnewsnationaltwitterblocksseveralaccountspostingmessagesinsupportoffarmersstirrestoresmostofthemlaterarticleece news reportshttpswwwreuterscomarticleusindiafarmsproteststwitteriduskbnaj emerged multiple twitter accounts blocked response legal request ministry electronics information technology based reports seemed close accountshttpsscrollinlatesttwitterwithholdsaccountsofcaravankisanektamorchaandothersinresponsetolegalrequest belonging diverse group entities news media organisations politicians activists farmers groups reported blocked rationale purportedly per press reports accounts making provocative tweets farmer protestshttpsthewireinrightstwitterwithheldcaravankisanektamorcha using specific hashtag however substantiated direction issued purportedly section yet made public subsequent media reports claim twitter contested orderhttpswwwthehinducomnewsnationaltwitterblocksseveralaccountspostingmessagesinsupportoffarmersstirrestoresmostofthemlaterarticleece per observable inferences twitter subsequently restored blocked accounts evening st februaryhttpswwwthehinducomnewsnationaltwitterrestoresseveralaccountsithadwithheldoverfarmerprotesttweetsarticleece significant public outrage concerns secrecy proportionality arbitrarinesshttpswwwthehindubusinesslinecominfotechsocialmediaconcernsraisedoverblockingoftwitteraccountsinindiaarticleece raised furthermore february rd ministry reported sent order twitter warning decision ministry pointing twitters obligations intermediary bound centres guidelines section information technology act asked twitter complyhttpswwwindiatodayinindiastorygovernmentissuesnoticetwitterremovecontentsrelatednarendramodifarmergenocide earlier order face criminal proceedings penal consequences imprisonment years press notehttpsindianexpresscomarticleindiatwitterwithholdsmultipleaccountsfollowingdirectionfromitministry also seems privately circulated amongst various media outlets provided details outlined rationale behind initial order well centres stance twitters response th february fresh reports emergedhttpseconomictimesindiatimescomtechtechnologyfarmerprotestsgovtsendsfreshnoticetotwitteronaccountsflaggedarticleshowcms new order sent ministry th february sharing list accounts wanted removed lack accountability transparency actions harmful operational transparency also indias democratic ethos accounts question pointed criticisms government past blocking accounts especially belong media organisations caravan tantamount censorship especially government failed substantiate grounds order blocking based secrecy lack clear process respect blocking accounts especially concerning directions indeed made section information technology act news reports show cause notice opportunity present defence provided users accounts indeed twitter even notify accounts access withheld additionally directions would contain reasons accounts directed suspended made public directly impacts users accounts respect fundamental rights freedom speech expression access judicial remedies furthermore breach directions supreme court shreya singhalhttpsinternetfreedominweurgemeitytopressrebootontheintermediaryrulessaveourprivacyrighttomeme paras amp anuradha bhasinhttpscisindiaorginternetgovernanceblogcontenttakedownandusersrights judgements paras amp recognise publics right receive public information censorship per principles transparency proactive disclosures recommendations light urge ministry recall directions blocking twitter accounts future commence proceedings providing fair clear opportunity users accounts participate present defence eventual orders section must made publicly available important documents iffs letter meity regarding secretive disproportionate directions issued twitter section information technology act linkhttpsdrivegooglecomfiledtgatyuuyfzeenhivakdhbofwejkviewuspsharing previous post containing analysis information technology intermediaries guidelines amendment rules linkhttpsinternetfreedominindiamustresistthelureofthechinesemodelofsurveillanceandcensorshipintermediaryrulesrighttomemesaveourprivacy comments counter comments proposed changes intermediaries guidelines amendment rules linkhttpsinternetfreedomina ",
    "cleaned_title": "timeline undemocratic takedown twitter accounts legal concerns",
    "cleaned_selftext": "ampxb tldr recent events regarding blocking pro farmer protests twitter accounts reek government censorship furthermore process ministry electronics information technology initiated blocks excessively opaque wrote ministry asking make orders publicly available increase transparency timeline events late afternoon st february severalhttpswwwthehinducomnewsnationaltwitterblocksseveralaccountspostingmessagesinsupportoffarmersstirrestoresmostofthemlaterarticleece news reportshttpswwwreuterscomarticleusindiafarmsproteststwitteriduskbnaj emerged multiple twitter accounts blocked response legal request ministry electronics information technology based reports seemed close accountshttpsscrollinlatesttwitterwithholdsaccountsofcaravankisanektamorchaandothersinresponsetolegalrequest belonging diverse group entities news media organisations politicians activists farmers groups reported blocked rationale purportedly per press reports accounts making provocative tweets farmer protestshttpsthewireinrightstwitterwithheldcaravankisanektamorcha using specific hashtag however substantiated direction issued purportedly section yet made public subsequent media reports claim twitter contested orderhttpswwwthehinducomnewsnationaltwitterblocksseveralaccountspostingmessagesinsupportoffarmersstirrestoresmostofthemlaterarticleece per observable inferences twitter subsequently restored blocked accounts evening st februaryhttpswwwthehinducomnewsnationaltwitterrestoresseveralaccountsithadwithheldoverfarmerprotesttweetsarticleece significant public outrage concerns secrecy proportionality arbitrarinesshttpswwwthehindubusinesslinecominfotechsocialmediaconcernsraisedoverblockingoftwitteraccountsinindiaarticleece raised furthermore february rd ministry reported sent order twitter warning decision ministry pointing twitters obligations intermediary bound centres guidelines section information technology act asked twitter complyhttpswwwindiatodayinindiastorygovernmentissuesnoticetwitterremovecontentsrelatednarendramodifarmergenocide earlier order face criminal proceedings penal consequences imprisonment years press notehttpsindianexpresscomarticleindiatwitterwithholdsmultipleaccountsfollowingdirectionfromitministry also seems privately circulated amongst various media outlets provided details outlined rationale behind initial order well centres stance twitters response th february fresh reports emergedhttpseconomictimesindiatimescomtechtechnologyfarmerprotestsgovtsendsfreshnoticetotwitteronaccountsflaggedarticleshowcms new order sent ministry th february sharing list accounts wanted removed lack accountability transparency actions harmful operational transparency also indias democratic ethos accounts question pointed criticisms government past blocking accounts especially belong media organisations caravan tantamount censorship especially government failed substantiate grounds order blocking based secrecy lack clear process respect blocking accounts especially concerning directions indeed made section information technology act news reports show cause notice opportunity present defence provided users accounts indeed twitter even notify accounts access withheld additionally directions would contain reasons accounts directed suspended made public directly impacts users accounts respect fundamental rights freedom speech expression access judicial remedies furthermore breach directions supreme court shreya singhalhttpsinternetfreedominweurgemeitytopressrebootontheintermediaryrulessaveourprivacyrighttomeme paras amp anuradha bhasinhttpscisindiaorginternetgovernanceblogcontenttakedownandusersrights judgements paras amp recognise publics right receive public information censorship per principles transparency proactive disclosures recommendations light urge ministry recall directions blocking twitter accounts future commence proceedings providing fair clear opportunity users accounts participate present defence eventual orders section must made publicly available important documents iffs letter meity regarding secretive disproportionate directions issued twitter section information technology act linkhttpsdrivegooglecomfiledtgatyuuyfzeenhivakdhbofwejkviewuspsharing previous post containing analysis information technology intermediaries guidelines amendment rules linkhttpsinternetfreedominindiamustresistthelureofthechinesemodelofsurveillanceandcensorshipintermediaryrulesrighttomemesaveourprivacy comments counter comments proposed changes intermediaries guidelines amendment rules linkhttpsinternetfreedomina",
    "cleaned_comments": "taken seriously else becm china north korea soon north korea religion banned wed closer china worst case nazi germanyexcept time nukes yay everything sounds worse",
    "light_cleaned_title": "A timeline of the undemocratic takedown of Twitter accounts + legal concerns",
    "light_cleaned_selftext": "## Tl;dr Recent events regarding the blocking of pro farmer protests Twitter accounts reek of government censorship. Furthermore, the process by which the Ministry of Electronics and Information Technology initiated the blocks is excessively opaque. We wrote to the Ministry asking them to make the orders publicly available so as to increase transparency. ## A Timeline of the Events Late in the afternoon on 1st February, [**several**](https://www.thehindu.com/news/national/twitter-blocks-several-accounts-posting-messages-in-support-of-farmers-stir-restores-most-of-them-later/article33717312.ece) [**news reports**](https://www.reuters.com/article/us-india-farms-protests-twitter-idUSKBN2A12J9) emerged of multiple Twitter accounts being blocked in response to a legal request from the Ministry of Electronics and Information Technology. Based on the reports, it seemed as if [**close to 250 accounts**](https://scroll.in/latest/985648/twitter-withholds-accounts-of-caravan-kisan-ekta-morcha-and-others-in-response-to-legal-request.), belonging to a diverse group of entities such as news media organisations, politicians, activists, and farmers groups, were reported to have been blocked. The rationale purportedly as per press reports was that these accounts had been making [**provocative tweets about the farmer protests**](https://thewire.in/rights/twitter-withheld-caravan-kisan-ekta-morcha) and had been using a specific hashtag. However, this was not substantiated, as such direction issued purportedly under Section 69A has not yet been made public. Subsequent media reports claim that [**Twitter contested the order**](https://www.thehindu.com/news/national/twitter-blocks-several-accounts-posting-messages-in-support-of-farmers-stir-restores-most-of-them-later/article33717312.ece) as per observable inferences. While Twitter subsequently restored the blocked accounts [**by the evening of 1st February**](https://www.thehindu.com/news/national/twitter-restores-several-accounts-it-had-withheld-over-farmer-protest-tweets/article33735013.ece) after significant public outrage, concerns about [**secrecy, proportionality and arbitrariness**](https://www.thehindubusinessline.com/info-tech/social-media/concerns-raised-over-blocking-of-twitter-accounts-in-india/article33734279.ece) have been raised. Furthermore, on February 3rd, the Ministry is reported to have sent an order to Twitter warning it about this decision. The Ministry, pointing to Twitter’s obligations as an intermediary bound by Centre’s guidelines under section 69A of the Information Technology Act, 2000, [**asked Twitter to comply**](https://www.indiatoday.in/india/story/government-issues-notice-twitter-remove-contents-related-narendra-modi-farmer-genocide-1765493-2021-02-03) with the earlier order or face criminal proceedings with penal consequences of imprisonment for up to 7 years. A [**press note**](https://indianexpress.com/article/india/twitter-withholds-multiple-accounts-following-direction-from-it-ministry-7170134/) also seems to have been privately circulated amongst various media outlets that provided further details about the same and outlined both the rationale behind the initial order as well as the Centre’s stance on Twitter’s response. On 8th February, [**fresh reports emerged**](https://economictimes.indiatimes.com/tech/technology/farmer-protests-govt-sends-fresh-notice-to-twitter-on-accounts-flagged/articleshow/80738857.cms) of a new order having been sent by the Ministry on 4th February, sharing a list of 1,178 more accounts that it wanted removed. ## A lack of accountability and transparency Such actions are harmful not only for operational transparency but also for India’s democratic ethos. The accounts in question have pointed out criticisms of the government in the past, and so blocking such accounts, especially those that belong to media organisations such as Caravan, is tantamount to censorship (especially when the government has failed to substantiate the grounds on which the order for blocking was based). The secrecy and lack of a clear process with respect to the blocking of the accounts is especially concerning if directions have indeed been made under Section 69A of the Information Technology Act, 2000. From news reports no show cause notice or opportunity to present a defence has been provided to the users of these accounts. Indeed, Twitter did not even notify most of these accounts about their access being withheld. Additionally, the directions themselves, which would contain the reasons for why the accounts have been directed to be suspended, have not been made public. This directly impacts the users of the accounts with respect to their fundamental rights to freedom of speech and expression and access to judicial remedies. Furthermore, it is in breach of the directions of the Supreme Court in the [**Shreya Singhal**](https://internetfreedom.in/we-urge-meity-to-press-reboot-on-the-intermediary-rules-saveourprivacy-righttomeme/) (paras 117, 118, &amp; 119) and [**Anuradha Bhasin**](https://cis-india.org/internet-governance/blog/content-takedown-and-users-rights-1) Judgements (paras 15, 16, 17, &amp; 18) that recognise the public’s right to receive public information and any censorship for it being as per principles of transparency and proactive disclosures. ## Recommendations In light of the above, we urge the Ministry to recall these directions for blocking of the Twitter accounts and in future commence any proceedings by providing a fair and clear opportunity to the users of accounts to participate and present their defence. Further, any eventual orders under Section 69A must be made publicly available. ### Important Documents 1. IFF's letter to MEITY regarding 'Secretive and disproportionate directions issued to Twitter under Section 69A of the Information Technology Act, 2000' ([**link**](https://drive.google.com/file/d/1TgaTYUu2yFZeENH6iV7_2AKdhBoFwEJk/view?usp=sharing)) 2. A previous post containing an analysis of the The Information Technology \\[Intermediaries Guidelines (Amendment) Rules\\], 2018 ([**link**](https://internetfreedom.in/india-must-resist-the-lure-of-the-chinese-model-of-surveillance-and-censorship-intermediaryrules-righttomeme-saveourprivacy/)) 3. Our comments and counter comments on the proposed changes to the Intermediaries Guidelines (Amendment) Rules ([**link**](https://internetfreedom.in/a16022019/))",
    "light_cleaned_comments": "This should be taken seriously. Or else we becm china and north korea soon. North Korea has religion banned, we'd be closer to China or in the worst case- Nazi Germany(except this time with nukes- yay!) Everything sounds worse :-("
}