{
    "id": "15jsynf",
    "title": "Is food based communal segregation everywhere?",
    "url": "https://www.ndtv.com/india-news/vegetarians-only-posters-at-iit-bombay-canteen-walls-sparks-row-4252979",
    "selftext": "In lieu of the IITB \"vegetarian\" situation and articles coming out about how food is seen as a way to identity a persons communal background and in turn use it against them. I was wondering if it was a one off incident or a common practise. Having studied in another iit i didnt experience the same in mine.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1691337182.0,
    "convurl": "https://external-preview.redd.it/KvglFQeNlnvDO6Rh0y8bZ6DiQ2boypOm6_-R3nTmjc0.jpg?auto=webp&s=a591f5708cfa3c56997013a63163a6487f1f6c66",
    "comments": [
        "Won't be surprised if it is common.\n\nMy experience was this:\n\nWhen there was non-veg in the mess, the (for the lack of better word) Sanghis would wrinkle their noses and complain about the smell, say that there should be other mess for non-veg etc. and sit separately from their group on the days when there was non-veg. \n\nMy institute didn't have any kind of political force within and people with complains were fringe so it never went beyond that. The mess committe asking the mess to not serve meat during hindu festivals did happen but in return we never for served Mutton Biryani on Bakri Eeid.",
        "I do have \"sanghis\" in my campus as well but i never noticed any elitist noise coming regarding the food. If it is more prevalent than we think, its very concerning.",
        "It will catch up soon. 0% doubt about that.",
        "Society is moving backwards ? Sed"
    ],
    "cleaned_text": "food based communal segregation everywhere lieu iitb vegetarian situation articles coming food seen way identity persons communal background turn use wondering one incident common practise studied another iit didnt experience mine ",
    "cleaned_title": "food based communal segregation everywhere",
    "cleaned_selftext": "lieu iitb vegetarian situation articles coming food seen way identity persons communal background turn use wondering one incident common practise studied another iit didnt experience mine",
    "cleaned_comments": "wont surprised common experience nonveg mess lack better word sanghis would wrinkle noses complain smell say mess nonveg etc sit separately group days nonveg institute didnt kind political force within people complains fringe never went beyond mess committe asking mess serve meat hindu festivals happen return never served mutton biryani bakri eeid sanghis campus well never noticed elitist noise coming regarding food prevalent think concerning catch soon doubt society moving backwards sed",
    "light_cleaned_title": "Is food based communal segregation everywhere?",
    "light_cleaned_selftext": "In lieu of the IITB \"vegetarian\" situation and articles coming out about how food is seen as a way to identity a persons communal background and in turn use it against them. I was wondering if it was a one off incident or a common practise. Having studied in another iit i didnt experience the same in mine.",
    "light_cleaned_comments": "Won't be surprised if it is common. My experience was this: When there was non-veg in the mess, the (for the lack of better word) Sanghis would wrinkle their noses and complain about the smell, say that there should be other mess for non-veg etc. and sit separately from their group on the days when there was non-veg. My institute didn't have any kind of political force within and people with complains were fringe so it never went beyond that. The mess committe asking the mess to not serve meat during hindu festivals did happen but in return we never for served Mutton Biryani on Bakri Eeid. I do have \"sanghis\" in my campus as well but i never noticed any elitist noise coming regarding the food. If it is more prevalent than we think, its very concerning. It will catch up soon. 0% doubt about that. Society is moving backwards ? Sed"
}