{
    "id": "1591olw",
    "title": "Are Government jobs a BIG MISTAKE?",
    "url": "https://youtu.be/5tx8kIhr7Bo",
    "selftext": "Thoughts?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1690272077.0,
    "convurl": "https://external-preview.redd.it/2ufyH339Hl2hFemtoqBdBndbrRYOMgc4SvvciuBl2dw.jpg?auto=webp&s=f6c4ab22d689259a8943a1c983ad0ddbc2280c60",
    "comments": [
        "Yeah they are overpaid and underworked and they dont even work properly because they dont have fear of getting kicked out of their job\n\nthats why privatization is important for people and also to decentralize power",
        "Government jobs were the only jobs available back in the day, and were thus glorified as stable. But it mainly attracts people who want to indulge in corruption and have an easy life as there are no consequences.\nGood people who join are twisted by the system anyway, a system that was created by the British to rule over India not serve India. The nawab like treatment of IAS officers and the subservience of our police to politicians being the most obvious examples",
        "An average Indian already lives a hard life so I think the desire of easy job is understandable.",
        "Yeah, but then don't expect people to respect you",
        "Hahaha , people don't respect government job people?out of fear or admiration of government job many respect them. I don't know where you saw them not respected.",
        "I'm saying they don't deserve respect if they are there only for the chill stable employment"
    ],
    "cleaned_text": "government jobs big mistake thoughts ",
    "cleaned_title": "government jobs big mistake",
    "cleaned_selftext": "thoughts",
    "cleaned_comments": "yeah overpaid underworked dont even work properly dont fear getting kicked job thats privatization important people also decentralize power government jobs jobs available back day thus glorified stable mainly attracts people want indulge corruption easy life consequences good people join twisted system anyway system created british rule india serve india nawab like treatment ias officers subservience police politicians obvious examples average indian already lives hard life think desire easy job understandable yeah dont expect people respect hahaha people dont respect government job peopleout fear admiration government job many respect dont know saw respected im saying dont deserve respect chill stable employment",
    "light_cleaned_title": "Are Government jobs a BIG MISTAKE?",
    "light_cleaned_selftext": "Thoughts?",
    "light_cleaned_comments": "Yeah they are overpaid and underworked and they dont even work properly because they dont have fear of getting kicked out of their job thats why privatization is important for people and also to decentralize power Government jobs were the only jobs available back in the day, and were thus glorified as stable. But it mainly attracts people who want to indulge in corruption and have an easy life as there are no consequences. Good people who join are twisted by the system anyway, a system that was created by the British to rule over India not serve India. The nawab like treatment of IAS officers and the subservience of our police to politicians being the most obvious examples An average Indian already lives a hard life so I think the desire of easy job is understandable. Yeah, but then don't expect people to respect you Hahaha , people don't respect government job people?out of fear or admiration of government job many respect them. I don't know where you saw them not respected. I'm saying they don't deserve respect if they are there only for the chill stable employment"
}