{
    "id": "16bcgu5",
    "title": "Potential Bank Fraud being reported from Canara Bank (Nanganallur) Branch.",
    "url": "https://www.reddit.com/r/india/comments/16bcgu5/potential_bank_fraud_being_reported_from_canara/",
    "selftext": "A peer user reported about a potential bank fraud being reported from Canara Bank (Nanganallur) branch. He seems to be a Senior Citizen and this account seems to be have got opened for an educational loan of one of his children. For ages the account had remained inoperative. However as a bolt out of the blue there had been a spurt of debits from the account. \n\nThe redressal process though seemingly (but professionally) handled by a branch operations head the time taken for the same does raise the eyebrows whether they took time to wipe out any traces of potential bank fraud from being unraveled.\n\nI would like to share the narration of the incident as screen captures as an Eye Opener for others to be wary of inoperative accounts particularly when it belongs to Senior Citizens. At least once in a month ensure the accounts are being checked. Pay particular attention for transactional messages from the banks.\n\n&#x200B;\n\nhttps://preview.redd.it/9u2wrve0vkmb1.png?width=3677&format=png&auto=webp&s=563495c2be4f2736e3fc0b02b3f86f5820e760bd",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693980950.0,
    "convurl": "https://external-preview.redd.it/q8yKi7giXAlGsMVdGAdon8H7Hp9ulXOvpiCZ9YPmoe0.jpg?auto=webp&s=7debb8ed34197bf3ed3d728873aef1c64beb9450",
    "comments": [],
    "cleaned_text": "potential bank fraud reported canara bank nanganallur branch peer user reported potential bank fraud reported canara bank nanganallur branch seems senior citizen account seems got opened educational loan one children ages account remained inoperative however bolt blue spurt debits account redressal process though seemingly professionally handled branch operations head time taken raise eyebrows whether took time wipe traces potential bank fraud unraveled would like share narration incident screen captures eye opener others wary inoperative accounts particularly belongs senior citizens least month ensure accounts checked pay particular attention transactional messages banks xb ",
    "cleaned_title": "potential bank fraud reported canara bank nanganallur branch",
    "cleaned_selftext": "peer user reported potential bank fraud reported canara bank nanganallur branch seems senior citizen account seems got opened educational loan one children ages account remained inoperative however bolt blue spurt debits account redressal process though seemingly professionally handled branch operations head time taken raise eyebrows whether took time wipe traces potential bank fraud unraveled would like share narration incident screen captures eye opener others wary inoperative accounts particularly belongs senior citizens least month ensure accounts checked pay particular attention transactional messages banks xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Potential Bank Fraud being reported from Canara Bank (Nanganallur) Branch.",
    "light_cleaned_selftext": "A peer user reported about a potential bank fraud being reported from Canara Bank (Nanganallur) branch. He seems to be a Senior Citizen and this account seems to be have got opened for an educational loan of one of his children. For ages the account had remained inoperative. However as a bolt out of the blue there had been a spurt of debits from the account. The redressal process though seemingly (but professionally) handled by a branch operations head the time taken for the same does raise the eyebrows whether they took time to wipe out any traces of potential bank fraud from being unraveled. I would like to share the narration of the incident as screen captures as an Eye Opener for others to be wary of inoperative accounts particularly when it belongs to Senior Citizens. At least once in a month ensure the accounts are being checked. Pay particular attention for transactional messages from the banks. &#x200B;",
    "light_cleaned_comments": ""
}