{
    "id": "17777gu",
    "title": "Government jobs are NOT overrated. Here's why",
    "url": "https://www.reddit.com/r/india/comments/17777gu/government_jobs_are_not_overrated_heres_why/",
    "selftext": "So somebody posted that government jobs are overrated. Even I used to think somewhat like that. That is until I got myself into a private job. It opened my eyes. The experience I am having, I come to a realisation that no matter how much you are getting paid in private sector it could never come close to Government jobs. Here is the rant I made some weeks ago.\n\nhttps://youtu.be/07SejSmdec0?si=0rx_8sU8IOwb16Rx",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697227006.0,
    "convurl": "https://external-preview.redd.it/ErxzLN27q4yYaxa6nc8rnIto2h8O6zuZBQxM7mjwFcY.jpg?auto=webp&s=cb4634dbd6948c8dac2a3d0cf4b71aebe84d6b67",
    "comments": [
        "Lmaooo, private sector salaries can't match government jobs unless you're like really really UPSC passout 1% of 1% \n\n\nSecond way is to make black but that's always risky.. within private sector you could just make white good enough",
        "Bro what you said might be true for civil engineers (and some other engineering branches as well) but tech salaries are way too much ahead in the private sector when compared to the government. I graduated in 2018 and my starting in-hand salary was more than 50k. It is very common to find people making 25+ LPA after 3-4 years in tech. And we get to take leaves when we want to. WLB might be a problem, agreed with you there, but we get paid handsomely for screwing it.",
        "Recently watched Obama's Netflix show called Working. Its shows well different kinds of people, in different sectors, at different levels of the food chain.  \n\nWhat you can see is everyone's Personalities are different. Their Needs and Goals are different. Opportunities available to them are different. So the life paths are very different. \n\nFind people with similarities to you, personality wise, goals, values wise to get the best answers. \n\nIf you ask people who are very different from you for advice its easy to get lost. \n\nIf you are a mango tree and are asking a cactus, a rose bush and a banyan tree for advice its very easy to get confused, and waste lot of time rectifying the confusion.",
        "Bro. Have not heard of Engineers ?\nEngineers working in most PSUs get to live a good life. Meanwhile their private counterparts are busy in buttering their bosses and working 12 hours shift. \n\nI would take Government engineering job in a heartbeat if I could.",
        "Bro, just how many tech jobs are in government ? Just a few that can be counted on hand. That is not fair. You can't compare 10-15 job vacancy vs an entire industry.",
        "I'm not comparing tech jobs in private vs tech jobs in government, I'm comparing tech jobs in private vs any government jobs. Show me any government job that pays 25 LPA in 3-4 years.",
        "Govt jobs are not subjected to market risks. And also, in IT or tech, the percieved value of a person to a company decreases as one ages. Companies don't find it financially viable to hire a 40+ person for a huge salary package, while they can hire a new graduate who's 10x more Enthusiastic and accepts 1/20th of the salary. So, these techies in their late 20s or early 30s earning 20-30lpa might be on cloud nine now, but their nightmare starts when they're mid 40s, a recession and kids to take care for. A govt employee earning 30-50k per month might have to live frugally now, but atleast his job is secured till 60 years, with his value increasing as he/she ages, and is immune from the effects of recessions and business cycles. With AI advancing, the job prospects in tech is further looking bleak. Also, the peace a govt employee gets is unparalleled, especially if they have some kind of hobby or side business they want to pursue.",
        "IF YOU COULD",
        "As some ad says, uthana hai, to uthna padega.\n\nSome hard work is deserved bro.",
        "Money is not everything for some people, peace of mind and respect is more important.",
        "Yes. Private jobs treat you like a bitch. Government job treats you like a king.",
        "Lol govt jobs don’t pay shit, if you like authority or if you are fine with gross inefficiency then yeah govt jobs are great. \n\nIf you are capable of passing UPSC you can definitely do amazing in private sector.",
        "Pull your head out of your as$. Salary of engineer in any psu in the training phase - 50,000 per month\n\nIn private - 12000-15000 per month",
        "You are comparing PSU to sweatshop lol. I’m not an engineer but my friend who did engineering prepared for CAT instead of GATE got into IIM (not the top ones) making 30LPA+ working in Big4 consulting. \n\nAs a CA I make way more in Big4 than what my peers are making in PSUs. Only pro is that they don’t work for long hours except once or twice a year. But long hours in Big4 are rewarded with Big ass bonus and fast track promotions.",
        "In general, private jobs are shi.t.\nPeople are not crazy that they chase Government jobs.\n\nGovernment jobs\n1. Stability\n2. No one will fire you\n3. Better salary than private (most of the time)\n4. No need to butter up your boss\n5. Vacations\n6. Pension plan",
        "My mamaji earns 18 LPA in PDIL.\n\nMechanical Engineer salaries at Hindustan Petroleum can range from ₹2,57,855 - ₹12,45,977 per year.\n\nSection engineer in Indian railway - 7 LPA to 11 LPA\n\nAverage Oil And Natural Gas Corporation Executive Engineer salary in India is ₹24.0 Lakhs for experience between 4 years to 10 years\n\nMechanical Engineer salary at Steel Authority Of India India ranges between ₹2.1 Lakhs to ₹9.8 Lakhs.\n\nMining Engineer salaries at Coal India can range from ₹7,00,126 - ₹14,98,819.",
        "A lot of employees in tech pursue FIRE, they don't want to work till they're 60 years old, and their salary is more than sufficient to help them retire early. Plus you get to work on challenging projects and cutting edge technologies. Regarding recession, if you have relevant skills, even if you're laid off you can find a new job easily (speaking from personal experience). If you're looking for a govt job for a peaceful life then we need less people like you in the government.",
        "Are you trying to prove my point? All of them are below 25 LPA\n\nAlmost all of my friends in tech (tier-3 college) from my batch (currently 5 yoe) are earning more than 25 LPA. The cream crowd among them is earning more than 40 LPA just as a base component (ESOPs and bonuses aside), and this is not even the ceiling for us. For 7-8 yoe your base can go as high as 70 LPA in good companies. Do you really want to compare these salaries with govt salaries?",
        "How many are given the assurance that they will not be laid off in the next bust ?",
        "No one, I myself was laid off in 2020 but I had the relevant skills so I received multiple calls from good companies and the offer which I accepted was more than 100% hike on my base salary (again bonus and ESOPs aside).\nThere's no job security in private sector but if you have the relevant skills then you won't be unemployed for long.",
        "That is why most of the government institutions are highly inefficient or loss making. Visit your nearest taluk office and try applying for any document and validate my claim. \n\nWhat a peaceful job govt gives : \n\n9:00 AM enter the office \n10AM start the work \n10:30 AM start telling customers who are standing in line from 5AM that server is down and slowly sip your tea till 1:30 PM \n\n1:30 PM - close the counter by telling Lunch break \n2:30 PM- open the counter and finally start taking entries on your grand crt monitor computer \n4:30 PM - start telling the people in line to leave since it is closing time . \n\nClose the counter at 5PM ,sip another tea and leave at 6PM. \n\n#Kingofgoodtimes",
        "You forgot 7th point : People in private work their asses of ,pay taxes on time so that people in government can lead a lethargic life with \"job security\" and paid vacations. \n\nIf everybody in this country had only government job ,our country would be sold out 75 years ago.",
        "Do you really think that engineers in PSUs don’t butter their bosses or work 12 hour shifts. All that is a myth.\n\nA friend’s dad worked in a PSU and didn’t get promoted because he offended some senior guy during a meeting. Also got transferred to the middle of nowhere for the same.\n\nHe also got some health issues due to overworking coz the branch/dept he was working in was understaffed.",
        "The only good thing about a govt job is Jon security. \n\nThere is no pension now. It’s NPS\n\nThere are a lot of transfers involved especially if you’re in the top most Group A Central Government jobs.\n\nSalaries cannot even be compared lmao. Let’s compare the best pvt and govt jobs shall we? Compare the salary of someone like a Chief Secretary to someone in a similar post in a private job. The person in the private job will be earning crores with benefits and other bonuses or even stock options in a similar post.\n\nAnd lastly office politics are very prominent in govt jobs too. You need to butter up your bosses if you want transfers to good places etc",
        "We are not talking about customers in our topic",
        "My point was about the inefficiency of govt jobs because of the lethargic attitude people hold about those jobs . Why do you think government jobs are decreasing and contract workers from the government is increasing?",
        "True but that is only until you are 34, after that it's very hard to keep up with technology. And you are more prone to layoffs.",
        "Idk how you arrived at age 34 but closer to that age you get a choice, you can stay an IC (Individual contributor) or transition into managerial roles (EM and above). For IC, having strong tech knowledge is a necessity, for EM, not so much.\n\nRegarding layoffs, that's always the possibility. But if you're good at what you do you'll get a new job soon enough (I have been laid off in covid and received multiple >100% hike offers post that).",
        "Wait until 8th pay commission and let AI to get more advanced! Then we will see which one was better.  \nRemind me! 2 years",
        "I will be messaging you in 2 years on [**2026-02-09 06:07:54 UTC**](http://www.wolframalpha.com/input/?i=2026-02-09%2006:07:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/17777gu/government_jobs_are_not_overrated_heres_why/kpln440/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F17777gu%2Fgovernment_jobs_are_not_overrated_heres_why%2Fkpln440%2F%5D%0A%0ARemindMe%21%202026-02-09%2006%3A07%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2017777gu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "https://www.google.com/amp/s/www.indiatoday.in/amp/india/story/7th-pay-commission-7th-pay-commission-957334-2017-01-27\n\nCheck out the maximum salary and my father used to say that no one wanted to join government jobs because of the low public in comparison to the private ones till 1991 and the Indian economy was closed and FDI was allowed in private companies only and they were hankering after private jobs",
        "Better salary then private ???? Bhai tier 3 se pdha hai kya? Mere  batchmate per month 2 lakh se uper kma re hai aur jo govt sector me gye th ve 60-70k 🤣🤣aur next baat , private sector me bahut jldi growth hai.\nAur govt sector me to promotion me bahut politics hoti hai , i know examples🤣",
        "Lol really? Unless you consider the 'filthy lucre' that govt employees get their hands on through illicit means there's no way even the top govt jobs come near even mid management level in the corporates. We are talking solely in monetary terms here. \n\n\nI mean c'mon! How much does even an IAS earn? Not talking about bribe money.\n\n\nPeanuts. ",
        "If I work in tech for say 10 years and let's say I get fired (as per your skill redundancy theory), I'll still make wayy more than a govt employees career money. My money will beat his 'career money' + pension. \n\n\nEg. 35 years of let's say a top govt. job? Let's take avg 20 lpa? Total earnings - 7 cr\n\n\n10 years of even mid senior tech roles? Let's take average of 1.5-2 cr (including esops) Total earnings - 15-20 cr. \n\n\nNot even a 'comparison'. ",
        "Top govt job at 35 easily makes 40-45 lpa. Next 10 yrs he will hv say 4.5 cr. Another 15 yrs one will make even more due to inflation adjusted salary and promotions plus the added incentives of higher payscale. Next 15 yrs one will make say 10 cr. The differentiating factor will be the fixed debt holdings of the govt employee i.e pension, pf, nps. This alone would be more than 15 cr. (My personal post retirement fund after 15 yrs is 1.75cr, if it doubles every 8 yrs, in another 24 yrs or by the time I retire, it will be 14cr. This doesn't include the additional contributions which both me and my employer would be making over these 24 yrs). Plus all my medical expenses are covered and there will be some amount of pension as well.",
        "How will you have 4.5 cr in 10 years if all you make is 45 lpa? Sorry i'm not trying to condescend but let's talk math. Post tax you'd be left with 30-35 lpa. What about expenses? And you will get a salary so it's not like someone's going to give you a 30\\*10 = 3 cr lumpsum that you can invest and earn from. Your monthly post tax income would be 2.5-3 L. Let's say (the best case scenario): You are able to save 1.5 L every month (very unrealistic but just to make a point) and SIP it in a index fund: You'll get roughly 3.5 cr after 10 years. AGAIN, your 4.5 cr is a STRETCH! \n\nYou took the top govt. jobs so i'll compare it with top tech jobs at that experience level: A top MBA can easily be a principal product manager at 35 and make close to 2 cr including esops. Should I take the math further or is it just obvious from here? Also, more cash in hand = more opportunities to invest. So someone making 5 L per month post tax is not just double richer than someone making 2.5 L per month. If we take 20 years time frame, the person with more cash can take more risks and potentially create exponentially more wealth. \n\nAnd of course the corporate guy will make more and more in terms of increasing esops. \n\nThis is ofcourse the 'White' wealth calculations. Ofcourse for the Indian govt employee, the 'opportunities' (hahaha) are endless. \n\nNo comparison.",
        "Your math also looks off. I graduated from a tier 1 institute and barring a few, no one has been able to reach the figures you quoted in IT. Most of them in their late 30s are pretty sure that the salaries would be stagnant for most of them going forward. The majority also feel they wouldn't be able to continue after another 10 yrs. \n\nExpenses and taxes will apply to your calculations as well. \n\nAnd I didn't took the top job in govt. People working for RBI, Armed forces, Professors in tier. 1 College etc. make more than me.",
        "They don't. A lieutenant general in the Indian army wouldn't make 45 Lpa. Let's not even talk about the fact that he would be 60 and close to retiring. \n\n\nYour friend circle hasn't made it then. Product management in top tech companies is paying a lot. Check principal product manager roles in Atlassian, Amazon, Google, Adobe. ",
        "And ofcourse only a few get this in any sector. The govt jobs you mentioned are also only a few. ",
        "Most of them are in FAANG.\n\nOnly 7 out of a batch size of  135  have reached principal engineer/ product manager that too in US after doing their masters from a top US university.\n\nMy spouse works for a statutory body (govt) and makes more than me. Her friend is asst. prof at aiims delhi and makes more than her.\n\nMy BIL 43 is Brigadier and makes alot more than all of us.\n\nIn govt job, most of the expenses like housing, conveyance, child education, medical expenses are taken care of. So a sane person would save alot of their CTC component."
    ],
    "cleaned_text": "government jobs overrated heres somebody posted government jobs overrated even used think somewhat like got private job opened eyes experience come realisation matter much getting paid private sector could never come close government jobs rant made weeks ago ",
    "cleaned_title": "government jobs overrated heres",
    "cleaned_selftext": "somebody posted government jobs overrated even used think somewhat like got private job opened eyes experience come realisation matter much getting paid private sector could never come close government jobs rant made weeks ago",
    "cleaned_comments": "lmaooo private sector salaries cant match government jobs unless youre like really really upsc passout second way make black thats always risky within private sector could make white good enough bro said might true civil engineers engineering branches well tech salaries way much ahead private sector compared government graduated starting inhand salary k common find people making lpa years tech get take leaves want wlb might problem agreed get paid handsomely screwing recently watched obamas netflix show called working shows well different kinds people different sectors different levels food chain see everyones personalities different needs goals different opportunities available different life paths different find people similarities personality wise goals values wise get best answers ask people different advice easy get lost mango tree asking cactus rose bush banyan tree advice easy get confused waste lot time rectifying confusion bro heard engineers engineers working psus get live good life meanwhile private counterparts busy buttering bosses working hours shift would take government engineering job heartbeat could bro many tech jobs government counted hand fair cant compare job vacancy vs entire industry im comparing tech jobs private vs tech jobs government im comparing tech jobs private vs government jobs show government job pays lpa years govt jobs subjected market risks also tech percieved value person company decreases one ages companies dont find financially viable hire person huge salary package hire new graduate whos x enthusiastic accepts th salary techies late early earning lpa might cloud nine nightmare starts theyre mid recession kids take care govt employee earning k per month might live frugally atleast job secured till years value increasing heshe ages immune effects recessions business cycles ai advancing job prospects tech looking bleak also peace govt employee gets unparalleled especially kind hobby side business want pursue could ad says uthana hai uthna padega hard work deserved bro money everything people peace mind respect important yes private jobs treat like bitch government job treats like king lol govt jobs dont pay shit like authority fine gross inefficiency yeah govt jobs great capable passing upsc definitely amazing private sector pull head salary engineer psu training phase per month private per month comparing psu sweatshop lol im engineer friend engineering prepared cat instead gate got iim top ones making lpa working big consulting ca make way big peers making psus pro dont work long hours except twice year long hours big rewarded big ass bonus fast track promotions general private jobs shit people crazy chase government jobs government jobs stability one fire better salary private time need butter boss vacations pension plan mamaji earns lpa pdil mechanical engineer salaries hindustan petroleum range per year section engineer indian railway lpa lpa average oil natural gas corporation executive engineer salary india lakhs experience years years mechanical engineer salary steel authority india india ranges lakhs lakhs mining engineer salaries coal india range lot employees tech pursue fire dont want work till theyre years old salary sufficient help retire early plus get work challenging projects cutting edge technologies regarding recession relevant skills even youre laid find new job easily speaking personal experience youre looking govt job peaceful life need less people like government trying prove point lpa almost friends tech tier college batch currently yoe earning lpa cream crowd among earning lpa base component esops bonuses aside even ceiling us yoe base go high lpa good companies really want compare salaries govt salaries many given assurance laid next bust one laid relevant skills received multiple calls good companies offer accepted hike base salary bonus esops aside theres job security private sector relevant skills wont unemployed long government institutions highly inefficient loss making visit nearest taluk office try applying document validate claim peaceful job govt gives enter office start work start telling customers standing line server slowly sip tea till pm pm close counter telling lunch break pm open counter finally start taking entries grand crt monitor computer pm start telling people line leave since closing time close counter pm sip another tea leave pm kingofgoodtimes forgot th point people private work asses pay taxes time people government lead lethargic life job security paid vacations everybody country government job country would sold years ago really think engineers psus dont butter bosses work hour shifts myth friends dad worked psu didnt get promoted offended senior guy meeting also got transferred middle nowhere also got health issues due overworking coz branchdept working understaffed good thing govt job jon security pension nps lot transfers involved especially youre top group central government jobs salaries even compared lmao lets compare best pvt govt jobs shall compare salary someone like chief secretary someone similar post private job person private job earning crores benefits bonuses even stock options similar post lastly office politics prominent govt jobs need butter bosses want transfers good places etc talking customers topic point inefficiency govt jobs lethargic attitude people hold jobs think government jobs decreasing contract workers government increasing true hard keep technology prone layoffs idk arrived age closer age get choice stay ic individual contributor transition managerial roles em ic strong tech knowledge necessity em much regarding layoffs thats always possibility youre good youll get new job soon enough laid covid received multiple hike offers post wait th pay commission let ai get advanced see one better remind years messaging years utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsgugovernmentjobsarenotoverratedhereswhykplncontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfgufgovernmentjobsarenotoverratedhereswhyfkplnfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletegu infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback check maximum salary father used say one wanted join government jobs low public comparison private ones till indian economy closed fdi allowed private companies hankering private jobs better salary private bhai tier se pdha hai kya mere batchmate per month lakh se uper kma hai aur jo govt sector gye th k aur next baat private sector bahut jldi growth hai aur govt sector promotion bahut politics hoti hai know examples lol really unless consider filthy lucre govt employees get hands illicit means theres way even top govt jobs come near even mid management level corporates talking solely monetary terms mean cmon much even ias earn talking bribe money peanuts work tech say years lets say get fired per skill redundancy theory ill still make wayy govt employees career money money beat career money pension eg years lets say top govt job lets take avg lpa total earnings cr years even mid senior tech roles lets take average cr including esops total earnings cr even comparison top govt job easily makes lpa next yrs hv say cr another yrs one make even due inflation adjusted salary promotions plus added incentives higher payscale next yrs one make say cr differentiating factor fixed debt holdings govt employee ie pension pf nps alone would cr personal post retirement fund yrs cr doubles every yrs another yrs time retire cr doesnt include additional contributions employer would making yrs plus medical expenses covered amount pension well cr years make lpa sorry im trying condescend lets talk math post tax youd left lpa expenses get salary like someones going give cr lumpsum invest earn monthly post tax income would l lets say best case scenario able save l every month unrealistic make point sip index fund youll get roughly cr years cr stretch took top govt jobs ill compare top tech jobs experience level top mba easily principal product manager make close cr including esops take math obvious also cash hand opportunities invest someone making l per month post tax double richer someone making l per month take years time frame person cash take risks potentially create exponentially wealth course corporate guy make terms increasing esops ofcourse white wealth calculations ofcourse indian govt employee opportunities hahaha endless comparison math also looks graduated tier institute barring one able reach figures quoted late pretty sure salaries would stagnant going forward majority also feel wouldnt able continue another yrs expenses taxes apply calculations well didnt took top job govt people working rbi armed forces professors tier college etc make dont lieutenant general indian army wouldnt make lpa lets even talk fact would close retiring friend circle hasnt made product management top tech companies paying lot check principal product manager roles atlassian amazon google adobe ofcourse get sector govt jobs mentioned also faang batch size reached principal engineer product manager us masters top us university spouse works statutory body govt makes friend asst prof aiims delhi makes bil brigadier makes alot us govt job expenses like housing conveyance child education medical expenses taken care sane person would save alot ctc component",
    "light_cleaned_title": "Government jobs are NOT overrated. Here's why",
    "light_cleaned_selftext": "So somebody posted that government jobs are overrated. Even I used to think somewhat like that. That is until I got myself into a private job. It opened my eyes. The experience I am having, I come to a realisation that no matter how much you are getting paid in private sector it could never come close to Government jobs. Here is the rant I made some weeks ago.",
    "light_cleaned_comments": "Lmaooo, private sector salaries can't match government jobs unless you're like really really UPSC passout 1% of 1% Second way is to make black but that's always risky.. within private sector you could just make white good enough Bro what you said might be true for civil engineers (and some other engineering branches as well) but tech salaries are way too much ahead in the private sector when compared to the government. I graduated in 2018 and my starting in-hand salary was more than 50k. It is very common to find people making 25+ LPA after 3-4 years in tech. And we get to take leaves when we want to. WLB might be a problem, agreed with you there, but we get paid handsomely for screwing it. Recently watched Obama's Netflix show called Working. Its shows well different kinds of people, in different sectors, at different levels of the food chain. What you can see is everyone's Personalities are different. Their Needs and Goals are different. Opportunities available to them are different. So the life paths are very different. Find people with similarities to you, personality wise, goals, values wise to get the best answers. If you ask people who are very different from you for advice its easy to get lost. If you are a mango tree and are asking a cactus, a rose bush and a banyan tree for advice its very easy to get confused, and waste lot of time rectifying the confusion. Bro. Have not heard of Engineers ? Engineers working in most PSUs get to live a good life. Meanwhile their private counterparts are busy in buttering their bosses and working 12 hours shift. I would take Government engineering job in a heartbeat if I could. Bro, just how many tech jobs are in government ? Just a few that can be counted on hand. That is not fair. You can't compare 10-15 job vacancy vs an entire industry. I'm not comparing tech jobs in private vs tech jobs in government, I'm comparing tech jobs in private vs any government jobs. Show me any government job that pays 25 LPA in 3-4 years. Govt jobs are not subjected to market risks. And also, in IT or tech, the percieved value of a person to a company decreases as one ages. Companies don't find it financially viable to hire a 40+ person for a huge salary package, while they can hire a new graduate who's 10x more Enthusiastic and accepts 1/20th of the salary. So, these techies in their late 20s or early 30s earning 20-30lpa might be on cloud nine now, but their nightmare starts when they're mid 40s, a recession and kids to take care for. A govt employee earning 30-50k per month might have to live frugally now, but atleast his job is secured till 60 years, with his value increasing as he/she ages, and is immune from the effects of recessions and business cycles. With AI advancing, the job prospects in tech is further looking bleak. Also, the peace a govt employee gets is unparalleled, especially if they have some kind of hobby or side business they want to pursue. IF YOU COULD As some ad says, uthana hai, to uthna padega. Some hard work is deserved bro. Money is not everything for some people, peace of mind and respect is more important. Yes. Private jobs treat you like a bitch. Government job treats you like a king. Lol govt jobs don’t pay shit, if you like authority or if you are fine with gross inefficiency then yeah govt jobs are great. If you are capable of passing UPSC you can definitely do amazing in private sector. Pull your head out of your as$. Salary of engineer in any psu in the training phase - 50,000 per month In private - 12000-15000 per month You are comparing PSU to sweatshop lol. I’m not an engineer but my friend who did engineering prepared for CAT instead of GATE got into IIM (not the top ones) making 30LPA+ working in Big4 consulting. As a CA I make way more in Big4 than what my peers are making in PSUs. Only pro is that they don’t work for long hours except once or twice a year. But long hours in Big4 are rewarded with Big ass bonus and fast track promotions. In general, private jobs are shi.t. People are not crazy that they chase Government jobs. Government jobs 1. Stability 2. No one will fire you 3. Better salary than private (most of the time) 4. No need to butter up your boss 5. Vacations 6. Pension plan My mamaji earns 18 LPA in PDIL. Mechanical Engineer salaries at Hindustan Petroleum can range from ₹2,57,855 - ₹12,45,977 per year. Section engineer in Indian railway - 7 LPA to 11 LPA Average Oil And Natural Gas Corporation Executive Engineer salary in India is ₹24.0 Lakhs for experience between 4 years to 10 years Mechanical Engineer salary at Steel Authority Of India India ranges between ₹2.1 Lakhs to ₹9.8 Lakhs. Mining Engineer salaries at Coal India can range from ₹7,00,126 - ₹14,98,819. A lot of employees in tech pursue FIRE, they don't want to work till they're 60 years old, and their salary is more than sufficient to help them retire early. Plus you get to work on challenging projects and cutting edge technologies. Regarding recession, if you have relevant skills, even if you're laid off you can find a new job easily (speaking from personal experience). If you're looking for a govt job for a peaceful life then we need less people like you in the government. Are you trying to prove my point? All of them are below 25 LPA Almost all of my friends in tech (tier-3 college) from my batch (currently 5 yoe) are earning more than 25 LPA. The cream crowd among them is earning more than 40 LPA just as a base component (ESOPs and bonuses aside), and this is not even the ceiling for us. For 7-8 yoe your base can go as high as 70 LPA in good companies. Do you really want to compare these salaries with govt salaries? How many are given the assurance that they will not be laid off in the next bust ? No one, I myself was laid off in 2020 but I had the relevant skills so I received multiple calls from good companies and the offer which I accepted was more than 100% hike on my base salary (again bonus and ESOPs aside). There's no job security in private sector but if you have the relevant skills then you won't be unemployed for long. That is why most of the government institutions are highly inefficient or loss making. Visit your nearest taluk office and try applying for any document and validate my claim. What a peaceful job govt gives : 9:00 AM enter the office 10AM start the work 10:30 AM start telling customers who are standing in line from 5AM that server is down and slowly sip your tea till 1:30 PM 1:30 PM - close the counter by telling Lunch break 2:30 PM- open the counter and finally start taking entries on your grand crt monitor computer 4:30 PM - start telling the people in line to leave since it is closing time . Close the counter at 5PM ,sip another tea and leave at 6PM. #Kingofgoodtimes You forgot 7th point : People in private work their asses of ,pay taxes on time so that people in government can lead a lethargic life with \"job security\" and paid vacations. If everybody in this country had only government job ,our country would be sold out 75 years ago. Do you really think that engineers in PSUs don’t butter their bosses or work 12 hour shifts. All that is a myth. A friend’s dad worked in a PSU and didn’t get promoted because he offended some senior guy during a meeting. Also got transferred to the middle of nowhere for the same. He also got some health issues due to overworking coz the branch/dept he was working in was understaffed. The only good thing about a govt job is Jon security. There is no pension now. It’s NPS There are a lot of transfers involved especially if you’re in the top most Group A Central Government jobs. Salaries cannot even be compared lmao. Let’s compare the best pvt and govt jobs shall we? Compare the salary of someone like a Chief Secretary to someone in a similar post in a private job. The person in the private job will be earning crores with benefits and other bonuses or even stock options in a similar post. And lastly office politics are very prominent in govt jobs too. You need to butter up your bosses if you want transfers to good places etc We are not talking about customers in our topic My point was about the inefficiency of govt jobs because of the lethargic attitude people hold about those jobs . Why do you think government jobs are decreasing and contract workers from the government is increasing? True but that is only until you are 34, after that it's very hard to keep up with technology. And you are more prone to layoffs. Idk how you arrived at age 34 but closer to that age you get a choice, you can stay an IC (Individual contributor) or transition into managerial roles (EM and above). For IC, having strong tech knowledge is a necessity, for EM, not so much. Regarding layoffs, that's always the possibility. But if you're good at what you do you'll get a new job soon enough (I have been laid off in covid and received multiple >100% hike offers post that). Wait until 8th pay commission and let AI to get more advanced! Then we will see which one was better. Remind me! 2 years I will be messaging you in 2 years on [**2026-02-09 06:07:54 UTC**](http://www.wolframalpha.com/input/?i=2026-02-09%2006:07:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/17777gu/government_jobs_are_not_overrated_heres_why/kpln440/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F17777gu%2Fgovernment_jobs_are_not_overrated_heres_why%2Fkpln440%2F%5D%0A%0ARemindMe%21%202026-02-09%2006%3A07%3A54%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2017777gu) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| Check out the maximum salary and my father used to say that no one wanted to join government jobs because of the low public in comparison to the private ones till 1991 and the Indian economy was closed and FDI was allowed in private companies only and they were hankering after private jobs Better salary then private ???? Bhai tier 3 se pdha hai kya? Mere batchmate per month 2 lakh se uper kma re hai aur jo govt sector me gye th ve 60-70k 🤣🤣aur next baat , private sector me bahut jldi growth hai. Aur govt sector me to promotion me bahut politics hoti hai , i know examples🤣 Lol really? Unless you consider the 'filthy lucre' that govt employees get their hands on through illicit means there's no way even the top govt jobs come near even mid management level in the corporates. We are talking solely in monetary terms here. I mean c'mon! How much does even an IAS earn? Not talking about bribe money. Peanuts. If I work in tech for say 10 years and let's say I get fired (as per your skill redundancy theory), I'll still make wayy more than a govt employees career money. My money will beat his 'career money' + pension. Eg. 35 years of let's say a top govt. job? Let's take avg 20 lpa? Total earnings - 7 cr 10 years of even mid senior tech roles? Let's take average of 1.5-2 cr (including esops) Total earnings - 15-20 cr. Not even a 'comparison'. Top govt job at 35 easily makes 40-45 lpa. Next 10 yrs he will hv say 4.5 cr. Another 15 yrs one will make even more due to inflation adjusted salary and promotions plus the added incentives of higher payscale. Next 15 yrs one will make say 10 cr. The differentiating factor will be the fixed debt holdings of the govt employee i.e pension, pf, nps. This alone would be more than 15 cr. (My personal post retirement fund after 15 yrs is 1.75cr, if it doubles every 8 yrs, in another 24 yrs or by the time I retire, it will be 14cr. This doesn't include the additional contributions which both me and my employer would be making over these 24 yrs). Plus all my medical expenses are covered and there will be some amount of pension as well. How will you have 4.5 cr in 10 years if all you make is 45 lpa? Sorry i'm not trying to condescend but let's talk math. Post tax you'd be left with 30-35 lpa. What about expenses? And you will get a salary so it's not like someone's going to give you a 30\\*10 = 3 cr lumpsum that you can invest and earn from. Your monthly post tax income would be 2.5-3 L. Let's say (the best case scenario): You are able to save 1.5 L every month (very unrealistic but just to make a point) and SIP it in a index fund: You'll get roughly 3.5 cr after 10 years. AGAIN, your 4.5 cr is a STRETCH! You took the top govt. jobs so i'll compare it with top tech jobs at that experience level: A top MBA can easily be a principal product manager at 35 and make close to 2 cr including esops. Should I take the math further or is it just obvious from here? Also, more cash in hand = more opportunities to invest. So someone making 5 L per month post tax is not just double richer than someone making 2.5 L per month. If we take 20 years time frame, the person with more cash can take more risks and potentially create exponentially more wealth. And of course the corporate guy will make more and more in terms of increasing esops. This is ofcourse the 'White' wealth calculations. Ofcourse for the Indian govt employee, the 'opportunities' (hahaha) are endless. No comparison. Your math also looks off. I graduated from a tier 1 institute and barring a few, no one has been able to reach the figures you quoted in IT. Most of them in their late 30s are pretty sure that the salaries would be stagnant for most of them going forward. The majority also feel they wouldn't be able to continue after another 10 yrs. Expenses and taxes will apply to your calculations as well. And I didn't took the top job in govt. People working for RBI, Armed forces, Professors in tier. 1 College etc. make more than me. They don't. A lieutenant general in the Indian army wouldn't make 45 Lpa. Let's not even talk about the fact that he would be 60 and close to retiring. Your friend circle hasn't made it then. Product management in top tech companies is paying a lot. Check principal product manager roles in Atlassian, Amazon, Google, Adobe. And ofcourse only a few get this in any sector. The govt jobs you mentioned are also only a few. Most of them are in FAANG. Only 7 out of a batch size of 135 have reached principal engineer/ product manager that too in US after doing their masters from a top US university. My spouse works for a statutory body (govt) and makes more than me. Her friend is asst. prof at aiims delhi and makes more than her. My BIL 43 is Brigadier and makes alot more than all of us. In govt job, most of the expenses like housing, conveyance, child education, medical expenses are taken care of. So a sane person would save alot of their CTC component."
}