{
    "id": "1cm0ls9",
    "title": "Once again another country taking advantage over Indian workers!",
    "url": "https://i.redd.it/zivjcupdwwyc1",
    "selftext": "New Indian workers in Israel have expressed deep regret over their decision to seek employment in the country. Reports have surfaced of workers being deceived about their contracts, facing difficult living conditions, and enduring fears for their safety due to the ongoing war in Gaza.\n\nMany workers have come forward with allegations that their employers have not only lied about the terms of their contracts but are also mistreating them. Contrary to what was promised, these individuals find themselves working 12-hour days instead of the agreed-upon 8 hours.\n\nSource:\n\nhttps://twitter.com/abboratti/status/1786697557474714048",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1715047377.0,
    "convurl": "https://preview.redd.it/zivjcupdwwyc1.jpeg?auto=webp&s=2434b1daa46950753dc646014737fcd8279155a4",
    "comments": [],
    "cleaned_text": "another country taking advantage indian workers new indian workers israel expressed deep regret decision seek employment country reports surfaced workers deceived contracts facing difficult living conditions enduring fears safety due ongoing war gaza many workers come forward allegations employers lied terms contracts also mistreating contrary promised individuals find working hour days instead agreedupon hours source ",
    "cleaned_title": "another country taking advantage indian workers",
    "cleaned_selftext": "new indian workers israel expressed deep regret decision seek employment country reports surfaced workers deceived contracts facing difficult living conditions enduring fears safety due ongoing war gaza many workers come forward allegations employers lied terms contracts also mistreating contrary promised individuals find working hour days instead agreedupon hours source",
    "cleaned_comments": "",
    "light_cleaned_title": "Once again another country taking advantage over Indian workers!",
    "light_cleaned_selftext": "New Indian workers in Israel have expressed deep regret over their decision to seek employment in the country. Reports have surfaced of workers being deceived about their contracts, facing difficult living conditions, and enduring fears for their safety due to the ongoing war in Gaza. Many workers have come forward with allegations that their employers have not only lied about the terms of their contracts but are also mistreating them. Contrary to what was promised, these individuals find themselves working 12-hour days instead of the agreed-upon 8 hours. Source:",
    "light_cleaned_comments": ""
}