{
    "id": "13xyxb8",
    "title": "From 'if Modiji sits next to God' to 'Guru Nanak went to Thailand': Rahul Gandhi's US trip so far",
    "url": "https://www.hindustantimes.com/india-news/rahul-gandhi-us-trip-news-rahul-gandhi-in-us-modi-guru-nanak-thailand-modi-next-to-god-101685597370780.html",
    "selftext": "Withstatements like these bjp does not need to spend a dime to build his pappu image.",
    "flair": "Politics",
    "score": 0,
    "num_comments": 9,
    "created_utc": 1685667836.0,
    "convurl": "https://external-preview.redd.it/TfezuqWlAy4RiDpsAOlsyMJMavKvEwSGYOn2Dxb3j08.jpg?auto=webp&v=enabled&s=2f44b90c239078525b97fa88dbd2fbfd1cf0e444",
    "comments": [
        ">As Rahul Gandhi was speaking about his Bharat Jodo Yatra at a gathering in the US, he referred to Guru Nanak and his teachings of being humble. \"We walked nothing compared to Guru Nanak ji. I read somewhere that Guru Nanak ji had gone all the way to Mecca, Saudi Arabia, he had gone to Thailand, he had gone to Sri Lanka. So, these giants did Bharat Jodo before we were born, right? I can say the same for my friends from Karnataka, Basavanna ji, for my friends from Kerala, Narayanaguru ji. Every state in India has had these giants...Adi Shankaracharya.. who said listen to each other, be respectful,\" Rahul Gandhi said.\n\nRG was making a point about  walks by many giants - he was being humble about his BJY. Exaggeration about Gurus- may be.",
        "At least the so called \"Pappu\" won't run away from an unscripted question.\n\nHe is not the clown who talks to children about exams while unable to present his education credentials. \n\nRahul like any other person has some flaws. However compared to supreme leader he is a saint.",
        "I would concentrate on his message of unity and an atmosphere of love and care. That is what we need more of right now along with concrete ideas on which direction should India be heading in the changing economic landscape",
        "You do understand the concept of context right?",
        "For the context Rahul is rumoured to take a trip every now and then to Thailand infamous for you know what and he is also ignorant of ethos of India culture.\n\nIn public life your mistakes are highlighted and I can understand that, but it is very important that you should be careful with religious sentiments.\nNow linking Thailand to a religious figure is stupidity of highest order.\n\nThe most intellectual politician of recent times was PV Narshima Rao and had good command on 17 languages, yet he read his speech from paper on important occasions because esp on foreign land because he did not want to commit even this slight mistake.",
        "RG specifically never took any administrative role specifically so he would never face a tough question on anything.\n\nHere Tewasvi Yadav became dep CM at the age of 26, I don't like him but one thing is he stood to every challenge and got his party from abyss into govt in his early 20s esp in a state like Bihar where you have prove your might to lead your flock.\n\nModi in his early days attended PC and interviews as well, but reporters use to give it a spin for trp. He use to call them to give his side of the story but that was in vain. Once a reporter asked him how he felt when people died in riot and he replied that even if a puppy (he used this exact term) comes under the car we feel so disappointed, imagine the pain when so many people died. Channels ran the story 24x7 Modi ne Muslamano ko kutta kaha. He understood the game and decided not to waste his political capital behind this.",
        "Oh boy, that's quite a bit of verbal garbage you have going there...",
        "What is contrary to your opinion is not garbage. Tell me if anything is factually incorrect.",
        "First off all you started off the entire thing by saying rumoured. If you have a source cite it. Else it's pretty much a castle in the air.\n\nThen you somehow make a leap of faith saying that you shouldn't hurt religious sentiment. Can you explain exactly how religious sentiment are hurt by someone visiting a place in an anecdote.\n\nThat's why context is important. Stop clutching your pearls just because you have an image of Thailand in your mind."
    ],
    "cleaned_text": "modiji sits next god guru nanak went thailand rahul gandhis us trip far withstatements like bjp need spend dime build pappu image ",
    "cleaned_title": "modiji sits next god guru nanak went thailand rahul gandhis us trip far",
    "cleaned_selftext": "withstatements like bjp need spend dime build pappu image",
    "cleaned_comments": "rahul gandhi speaking bharat jodo yatra gathering us referred guru nanak teachings humble walked nothing compared guru nanak ji read somewhere guru nanak ji gone way mecca saudi arabia gone thailand gone sri lanka giants bharat jodo born right say friends karnataka basavanna ji friends kerala narayanaguru ji every state india giantsadi shankaracharya said listen respectful rahul gandhi said rg making point walks many giants humble bjy exaggeration gurus may least called pappu wont run away unscripted question clown talks children exams unable present education credentials rahul like person flaws however compared supreme leader saint would concentrate message unity atmosphere love care need right along concrete ideas direction india heading changing economic landscape understand concept context right context rahul rumoured take trip every thailand infamous know also ignorant ethos india culture public life mistakes highlighted understand important careful religious sentiments linking thailand religious figure stupidity highest order intellectual politician recent times pv narshima rao good command languages yet read speech paper important occasions esp foreign land want commit even slight mistake rg specifically never took administrative role specifically would never face tough question anything tewasvi yadav became dep cm age dont like one thing stood every challenge got party abyss govt early esp state like bihar prove might lead flock modi early days attended pc interviews well reporters use give spin trp use call give side story vain reporter asked felt people died riot replied even puppy used exact term comes car feel disappointed imagine pain many people died channels ran story x modi ne muslamano ko kutta kaha understood game decided waste political capital behind oh boy thats quite bit verbal garbage going contrary opinion garbage tell anything factually incorrect first started entire thing saying rumoured source cite else pretty much castle air somehow make leap faith saying shouldnt hurt religious sentiment explain exactly religious sentiment hurt someone visiting place anecdote thats context important stop clutching pearls image thailand mind",
    "light_cleaned_title": "From 'if Modiji sits next to God' to 'Guru Nanak went to Thailand': Rahul Gandhi's US trip so far",
    "light_cleaned_selftext": "Withstatements like these bjp does not need to spend a dime to build his pappu image.",
    "light_cleaned_comments": ">As Rahul Gandhi was speaking about his Bharat Jodo Yatra at a gathering in the US, he referred to Guru Nanak and his teachings of being humble. \"We walked nothing compared to Guru Nanak ji. I read somewhere that Guru Nanak ji had gone all the way to Mecca, Saudi Arabia, he had gone to Thailand, he had gone to Sri Lanka. So, these giants did Bharat Jodo before we were born, right? I can say the same for my friends from Karnataka, Basavanna ji, for my friends from Kerala, Narayanaguru ji. Every state in India has had these giants...Adi Shankaracharya.. who said listen to each other, be respectful,\" Rahul Gandhi said. RG was making a point about walks by many giants - he was being humble about his BJY. Exaggeration about Gurus- may be. At least the so called \"Pappu\" won't run away from an unscripted question. He is not the clown who talks to children about exams while unable to present his education credentials. Rahul like any other person has some flaws. However compared to supreme leader he is a saint. I would concentrate on his message of unity and an atmosphere of love and care. That is what we need more of right now along with concrete ideas on which direction should India be heading in the changing economic landscape You do understand the concept of context right? For the context Rahul is rumoured to take a trip every now and then to Thailand infamous for you know what and he is also ignorant of ethos of India culture. In public life your mistakes are highlighted and I can understand that, but it is very important that you should be careful with religious sentiments. Now linking Thailand to a religious figure is stupidity of highest order. The most intellectual politician of recent times was PV Narshima Rao and had good command on 17 languages, yet he read his speech from paper on important occasions because esp on foreign land because he did not want to commit even this slight mistake. RG specifically never took any administrative role specifically so he would never face a tough question on anything. Here Tewasvi Yadav became dep CM at the age of 26, I don't like him but one thing is he stood to every challenge and got his party from abyss into govt in his early 20s esp in a state like Bihar where you have prove your might to lead your flock. Modi in his early days attended PC and interviews as well, but reporters use to give it a spin for trp. He use to call them to give his side of the story but that was in vain. Once a reporter asked him how he felt when people died in riot and he replied that even if a puppy (he used this exact term) comes under the car we feel so disappointed, imagine the pain when so many people died. Channels ran the story 24x7 Modi ne Muslamano ko kutta kaha. He understood the game and decided not to waste his political capital behind this. Oh boy, that's quite a bit of verbal garbage you have going there... What is contrary to your opinion is not garbage. Tell me if anything is factually incorrect. First off all you started off the entire thing by saying rumoured. If you have a source cite it. Else it's pretty much a castle in the air. Then you somehow make a leap of faith saying that you shouldn't hurt religious sentiment. Can you explain exactly how religious sentiment are hurt by someone visiting a place in an anecdote. That's why context is important. Stop clutching your pearls just because you have an image of Thailand in your mind."
}