{
    "id": "16d09fw",
    "title": "Day before G-20, Manmohan Singh’s praise and caution: ‘India has done the right thing (post Russia-Ukraine)… optimism about India based on it being harmonious’",
    "url": "https://indianexpress.com/article/political-pulse/manmohan-singh-exclusive-interview-g20-summit-india-8929632/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fpolitical-pulse%2Fmanmohan-singh-exclusive-interview-g20-summit-india-8929632%2F",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1694146189.0,
    "convurl": "https://external-preview.redd.it/wLgSejH9mMDIK5KvbObCiuZ03txxPSFwU_T4QBd3680.jpg?auto=webp&s=2ee686c1a94c4192881c3b950aeb193c9719c540",
    "comments": [
        ">As India celebrates 75 years of Independence, how do you see the challenges ahead?\n\n>Manmohan Singh: On the whole, I am more optimistic about India’s future than worried. However, my optimism is contingent on India being a harmonious society, which is the bedrock for all progress and development. India’s innate instinct is to welcome and celebrate diversity which must be preserved",
        "parvakta - ayie bbjjpp join kijye /s"
    ],
    "cleaned_text": "day g manmohan singhs praise caution india done right thing post russiaukraine optimism india based harmonious  ",
    "cleaned_title": "day g manmohan singhs praise caution india done right thing post russiaukraine optimism india based harmonious",
    "cleaned_selftext": "",
    "cleaned_comments": "india celebrates years independence see challenges ahead manmohan singh whole optimistic indias future worried however optimism contingent india harmonious society bedrock progress development indias innate instinct welcome celebrate diversity must preserved parvakta ayie bbjjpp join kijye",
    "light_cleaned_title": "Day before G-20, Manmohan Singh’s praise and caution: ‘India has done the right thing (post Russia-Ukraine)… optimism about India based on it being harmonious’",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">As India celebrates 75 years of Independence, how do you see the challenges ahead? >Manmohan Singh: On the whole, I am more optimistic about India’s future than worried. However, my optimism is contingent on India being a harmonious society, which is the bedrock for all progress and development. India’s innate instinct is to welcome and celebrate diversity which must be preserved parvakta - ayie bbjjpp join kijye /s"
}