{
    "id": "1d3ym0r",
    "title": "Vishwaguru Vibes ",
    "url": "https://v.redd.it/yqyl19u3ri3d1",
    "selftext": "Residents of Delhi struggle to obtain drinking water as heat wave surges amid Government apathy ",
    "flair": "Rant / Vent",
    "score": 368,
    "num_comments": 57,
    "created_utc": 1717055347.0,
    "convurl": "https://external-preview.redd.it/em1ncTZ0ZzNyaTNkMfhHak9ztNf0z3_dvCzSFVih6u3_j8jdHBPWpmFH2h_-.png?format=pjpg&auto=webp&s=f0efbaa640cb092c5d98ad98de0a405ab40a1180",
    "comments": [
        "As scary as it sounds, I don't rule out this happening in other major parts of the cities. I mean Bangalore and Hyderabad are next (probably within 2-5 years).\n\nIt's shocking yet no one seems to be concerned.",
        "The amount of money currently spent on advertisements and election campaigns by various political parties if spent in establishing water connections would significantly benefit for India.",
        "... and this is for water... not even something relatively advanced like electricity",
        "Thank God I live in tier 2 city",
        "What place is this?\n\nIt looks like mumbai to me.",
        "we are living thru the greatest of times. and this is just the beginning. earlier generation would proudly boast that their generation was the 83 world cup generation or that they were able to experience moon landing or that they fought for independence. these are all going to be nothing compared to what we will be able to boast. covid, climate change, AI and haarseebe not able to win even one ipl trophy.",
        "I just want people making politician’s home their shelter when things go really shit to the point where pathetic living conditions endangering survivability will be the common ground to unite all atleast",
        "Not just water connections, there are thousands of other things that’s lacking in this country.",
        "It’s Delhi.",
        "This is what happens when the government is only focused on M issues and not environment, sustainability and access to resources.",
        "Hyderabad will be fine (i hope). They're pumping water all the way from Krishna and godvari. Although the water table is under a lot of stress recently. Lots of lakes have been transformed into apartment complexes",
        "Welcome to the City of God",
        "Mostly jhuggis and unauthorised colonies get water by tanker.\n\nRest of Delhi get 2 times one in morning and one in evening via pipeline.\n\n24x7 water supply via pipeline will never be accomplished due to water shortage.",
        "we are coming for your tier 2 city too /s",
        "Damn... Like a zombie apocalypse😥",
        "Dw I own a well in my village 😏",
        "The next Supar Pawar.\n\nAbsolutely awful situation.",
        "Looks like a scene from a dystopian movie",
        "This is India where majority lack basic amenities to live",
        "Gaza jaisa Environment hai",
        "What is even more disturbing than lack of water is any sense of self-organization to fairly distribute it. What would an old person living alone do? Why isn't there any attempt to form a queue or a waiting list. This is a failure on every level of civility.",
        "Aap say fu free karunga but fir denga koi free hone ke baad",
        "I see a Salaar coming out of here",
        "India numbah 1.",
        "Clean water is basic human right except in India n Africa",
        "Bhai Delhi don't get abandoned of rainfall,  temperature is rinsing like hell. Population is on top. Pollution is exploding.  Delhi have garbage hills . Yamuna is dead. It's liking a 4th world in itself. And GOD modi with his army sitting there doing nothing.",
        "Dayumm - only a Telugu mass movie to add fuel to the fire!",
        "Sad reality, jo dikhta hai wahi bikta hai, pencil baanti ₹100 ki, uska prachar kiya ₹10,000 ka",
        "I kid you not - I really expected someone to jump on the water tank from a nearby terrace holding one of those pipes....while commoners look on in destitute admiration from streets (Bahubali style)",
        "AAP thoda state politics ka knowledge badhayiye",
        "No cause for concern here. These people are merely testing their athletic abilities and quick reflexes, which shows how the Vishwaguru's policies have made his disciples healthy, fit and agile.\n\n/s (Just in case this needed to be made clear)",
        "That’s exactly what happened in Bangalore lol. They had dozens of lakes that were drained and encroached to build apartments and office buildings. They pumped water from the Kaveri river.\n\nNow they are facing water shortages.\n\nGive it a few years Hyderabad will be the same.",
        "That just means you are gonna be a target /s",
        "Jesus.",
        "I'm talking about ground water. The way it gets abused here, I don't think there's hope.",
        "This is disheartening. I feel sad for our people and our country, the ones who are educated are pushed to the corner with capitalistic systems, while the poor are left to fend for themselves. The circus from the celebrities continues with the drama from news channels and their shows. Any heavy disagreements are trolled or people jailed. \nThe influencers are a different breed altogether!",
        "We are not a civilized society. Due to the lack of basic amenities and mismanagement, it's chaos and anarchy all around. People shouldn't have to climb atop a moving water tanker.",
        "People still having 4 children and you believe BJP and Congress is going to fix this. Lol. Since I consider myself liberal, I think we should not ask people to reproduce less. It is up to them how many they want to have. Just clarifying my stance.",
        "Exactly",
        "Because he's living in probably the most expensive and posh areas of India. These politicians have no iota of what the ground reality is. There's no water shortage, no electricity cuts and no bad roads in the Lutyens Delhi.",
        "AAP  pary ka editer 🥸",
        "Reminds me of that food truck scene from Black Hawk Down.",
        "Kejriwal is CM of Delhi not Modi. You need a CM like Nitin Gadkari or Yogi .  Otherwise Keep rebuilding 10 government schools out of 100 and few mohala clinics and free electricity and free water. \n\nWhen I visited Delhi I felt this should never be called capital of India. I am from dehradun and I love that I live in Dehradun. Doesn't matter electricity bill or water bill going high atleast I have these things here. Infact power cuts have gone low in past 5-6 years in dehradun so that's a good result of choosing right government. Only good thing Delhi has is metro that's it.",
        "Yep. We'll eventually go back to the stone age while the people responsible for this shitshow move to Mars.",
        "DUmb question...but how do they plan to extract water using those pipes? Are these tanks pressurised or do they siphon it through the pipes?",
        "Not dystopian enough, it needs a sepia filter.",
        "This is what happen when you convert lakes in to commercial properties \n\nBuild housing projects on Mangroves",
        "Pff, why be concerned over such trivial matters when you can talk about Hindu Muslim? ^/s",
        "Remember BJP got 6000+ crore. That we know of.",
        "It is so sad. We have failed as a country if people don't have access to water.",
        "pop was the king of new york, now I'm the n* in charge",
        "Bold of you to assume there's civic sense in India.",
        "This is why I support One Nation One Election. Not only would the campaigning money be saved, but the quid pro quo system everytime an assembly election pops up would also happen only once in 5 years. I never expect this country to be corruption free, so the lesser the better.",
        "Arey sir, dhaara 370 hata di, vande bharat chalwa di ram mandir banwa Diya kya aap paani ki baat jar rahe hai technology dekhiye technology",
        "Civic sense follows adequate resources. When there are inadequate resources as is the case now, first come first serve fucks everything up.",
        "Bhai Delhi mein paani ka itna issue kaise hua.",
        "केजरुद्दीन Vibes"
    ],
    "cleaned_text": "vishwaguru vibes residents delhi struggle obtain drinking water heat wave surges amid government apathy ",
    "cleaned_title": "vishwaguru vibes",
    "cleaned_selftext": "residents delhi struggle obtain drinking water heat wave surges amid government apathy",
    "cleaned_comments": "scary sounds dont rule happening major parts cities mean bangalore hyderabad next probably within years shocking yet one seems concerned amount money currently spent advertisements election campaigns various political parties spent establishing water connections would significantly benefit india water even something relatively advanced like electricity thank god live tier city place looks like mumbai living thru greatest times beginning earlier generation would proudly boast generation world cup generation able experience moon landing fought independence going nothing compared able boast covid climate change ai haarseebe able win even one ipl trophy want people making politicians home shelter things go really shit point pathetic living conditions endangering survivability common ground unite atleast water connections thousands things thats lacking country delhi happens government focused issues environment sustainability access resources hyderabad fine hope theyre pumping water way krishna godvari although water table lot stress recently lots lakes transformed apartment complexes welcome city god mostly jhuggis unauthorised colonies get water tanker rest delhi get times one morning one evening via pipeline x water supply via pipeline never accomplished due water shortage coming tier city damn like zombie apocalypse dw well village next supar pawar absolutely awful situation looks like scene dystopian movie india majority lack basic amenities live gaza jaisa environment hai even disturbing lack water sense selforganization fairly distribute would old person living alone isnt attempt form queue waiting list failure every level civility aap say fu free karunga fir denga koi free hone ke baad see salaar coming india numbah clean water basic human right except india n africa bhai delhi dont get abandoned rainfall temperature rinsing like hell population top pollution exploding delhi garbage hills yamuna dead liking th world god modi army sitting nothing dayumm telugu mass movie add fuel fire sad reality jo dikhta hai wahi bikta hai pencil baanti ki uska prachar kiya ka kid really expected someone jump water tank nearby terrace holding one pipeswhile commoners look destitute admiration streets bahubali style aap thoda state politics ka knowledge badhayiye cause concern people merely testing athletic abilities quick reflexes shows vishwagurus policies made disciples healthy fit agile case needed made clear thats exactly happened bangalore lol dozens lakes drained encroached build apartments office buildings pumped water kaveri river facing water shortages give years hyderabad means gon na target jesus im talking ground water way gets abused dont think theres hope disheartening feel sad people country ones educated pushed corner capitalistic systems poor left fend circus celebrities continues drama news channels shows heavy disagreements trolled people jailed influencers different breed altogether civilized society due lack basic amenities mismanagement chaos anarchy around people shouldnt climb atop moving water tanker people still children believe bjp congress going fix lol since consider liberal think ask people reproduce less many want clarifying stance exactly hes living probably expensive posh areas india politicians iota ground reality theres water shortage electricity cuts bad roads lutyens delhi aap pary ka editer reminds food truck scene black hawk kejriwal cm delhi modi need cm like nitin gadkari yogi otherwise keep rebuilding government schools mohala clinics free electricity free water visited delhi felt never called capital india dehradun love live dehradun doesnt matter electricity bill water bill going high atleast things infact power cuts gone low past years dehradun thats good result choosing right government good thing delhi metro thats yep well eventually go back stone age people responsible shitshow move mars dumb questionbut plan extract water using pipes tanks pressurised siphon pipes dystopian enough needs sepia filter happen convert lakes commercial properties build housing projects mangroves pff concerned trivial matters talk hindu muslim remember bjp got crore know sad failed country people dont access water pop king new york im n charge bold assume theres civic sense india support one nation one election would campaigning money saved quid pro quo system everytime assembly election pops would also happen years never expect country corruption free lesser better arey sir dhaara hata di vande bharat chalwa di ram mandir banwa diya kya aap paani ki baat jar rahe hai technology dekhiye technology civic sense follows adequate resources inadequate resources case first come first serve fucks everything bhai delhi mein paani ka itna issue kaise hua vibes",
    "light_cleaned_title": "Vishwaguru Vibes",
    "light_cleaned_selftext": "Residents of Delhi struggle to obtain drinking water as heat wave surges amid Government apathy",
    "light_cleaned_comments": "As scary as it sounds, I don't rule out this happening in other major parts of the cities. I mean Bangalore and Hyderabad are next (probably within 2-5 years). It's shocking yet no one seems to be concerned. The amount of money currently spent on advertisements and election campaigns by various political parties if spent in establishing water connections would significantly benefit for India. ... and this is for water... not even something relatively advanced like electricity Thank God I live in tier 2 city What place is this? It looks like mumbai to me. we are living thru the greatest of times. and this is just the beginning. earlier generation would proudly boast that their generation was the 83 world cup generation or that they were able to experience moon landing or that they fought for independence. these are all going to be nothing compared to what we will be able to boast. covid, climate change, AI and haarseebe not able to win even one ipl trophy. I just want people making politician’s home their shelter when things go really shit to the point where pathetic living conditions endangering survivability will be the common ground to unite all atleast Not just water connections, there are thousands of other things that’s lacking in this country. It’s Delhi. This is what happens when the government is only focused on M issues and not environment, sustainability and access to resources. Hyderabad will be fine (i hope). They're pumping water all the way from Krishna and godvari. Although the water table is under a lot of stress recently. Lots of lakes have been transformed into apartment complexes Welcome to the City of God Mostly jhuggis and unauthorised colonies get water by tanker. Rest of Delhi get 2 times one in morning and one in evening via pipeline. 24x7 water supply via pipeline will never be accomplished due to water shortage. we are coming for your tier 2 city too /s Damn... Like a zombie apocalypse😥 Dw I own a well in my village 😏 The next Supar Pawar. Absolutely awful situation. Looks like a scene from a dystopian movie This is India where majority lack basic amenities to live Gaza jaisa Environment hai What is even more disturbing than lack of water is any sense of self-organization to fairly distribute it. What would an old person living alone do? Why isn't there any attempt to form a queue or a waiting list. This is a failure on every level of civility. Aap say fu free karunga but fir denga koi free hone ke baad I see a Salaar coming out of here India numbah 1. Clean water is basic human right except in India n Africa Bhai Delhi don't get abandoned of rainfall, temperature is rinsing like hell. Population is on top. Pollution is exploding. Delhi have garbage hills . Yamuna is dead. It's liking a 4th world in itself. And GOD modi with his army sitting there doing nothing. Dayumm - only a Telugu mass movie to add fuel to the fire! Sad reality, jo dikhta hai wahi bikta hai, pencil baanti ₹100 ki, uska prachar kiya ₹10,000 ka I kid you not - I really expected someone to jump on the water tank from a nearby terrace holding one of those pipes....while commoners look on in destitute admiration from streets (Bahubali style) AAP thoda state politics ka knowledge badhayiye No cause for concern here. These people are merely testing their athletic abilities and quick reflexes, which shows how the Vishwaguru's policies have made his disciples healthy, fit and agile. /s (Just in case this needed to be made clear) That’s exactly what happened in Bangalore lol. They had dozens of lakes that were drained and encroached to build apartments and office buildings. They pumped water from the Kaveri river. Now they are facing water shortages. Give it a few years Hyderabad will be the same. That just means you are gonna be a target /s Jesus. I'm talking about ground water. The way it gets abused here, I don't think there's hope. This is disheartening. I feel sad for our people and our country, the ones who are educated are pushed to the corner with capitalistic systems, while the poor are left to fend for themselves. The circus from the celebrities continues with the drama from news channels and their shows. Any heavy disagreements are trolled or people jailed. The influencers are a different breed altogether! We are not a civilized society. Due to the lack of basic amenities and mismanagement, it's chaos and anarchy all around. People shouldn't have to climb atop a moving water tanker. People still having 4 children and you believe BJP and Congress is going to fix this. Lol. Since I consider myself liberal, I think we should not ask people to reproduce less. It is up to them how many they want to have. Just clarifying my stance. Exactly Because he's living in probably the most expensive and posh areas of India. These politicians have no iota of what the ground reality is. There's no water shortage, no electricity cuts and no bad roads in the Lutyens Delhi. AAP pary ka editer 🥸 Reminds me of that food truck scene from Black Hawk Down. Kejriwal is CM of Delhi not Modi. You need a CM like Nitin Gadkari or Yogi . Otherwise Keep rebuilding 10 government schools out of 100 and few mohala clinics and free electricity and free water. When I visited Delhi I felt this should never be called capital of India. I am from dehradun and I love that I live in Dehradun. Doesn't matter electricity bill or water bill going high atleast I have these things here. Infact power cuts have gone low in past 5-6 years in dehradun so that's a good result of choosing right government. Only good thing Delhi has is metro that's it. Yep. We'll eventually go back to the stone age while the people responsible for this shitshow move to Mars. DUmb question...but how do they plan to extract water using those pipes? Are these tanks pressurised or do they siphon it through the pipes? Not dystopian enough, it needs a sepia filter. This is what happen when you convert lakes in to commercial properties Build housing projects on Mangroves Pff, why be concerned over such trivial matters when you can talk about Hindu Muslim? ^/s Remember BJP got 6000+ crore. That we know of. It is so sad. We have failed as a country if people don't have access to water. pop was the king of new york, now I'm the n* in charge Bold of you to assume there's civic sense in India. This is why I support One Nation One Election. Not only would the campaigning money be saved, but the quid pro quo system everytime an assembly election pops up would also happen only once in 5 years. I never expect this country to be corruption free, so the lesser the better. Arey sir, dhaara 370 hata di, vande bharat chalwa di ram mandir banwa Diya kya aap paani ki baat jar rahe hai technology dekhiye technology Civic sense follows adequate resources. When there are inadequate resources as is the case now, first come first serve fucks everything up. Bhai Delhi mein paani ka itna issue kaise hua. केजरुद्दीन Vibes"
}