{
    "id": "16kaqko",
    "title": "Non Indian women marrying Indian guy and making her whole social media life about his culture is a legit genre in youtube and it is absolutely weird, what do yall think?",
    "url": "https://www.reddit.com/r/india/comments/16kaqko/non_indian_women_marrying_indian_guy_and_making/",
    "selftext": "I thought it was just a few interested in Indian culture, so i checked on youtube. It is a literal genre in there. Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture. Literally nothing else. Its not like these channels have just a few subscribers. Its millions of subscribers, millions of views ,millions of likes. Its so damn weird. I thought maybe it is because of white skin obsession among indians. But there hundreds of channels of women from other non white ethnicities like middle eastern, black, chinese, korean,japanese, thai etc. Its really weird. What do yall think?\n\nEDIT: If you dont believe me i am gonna link a few here from r/imxf_youtube\n\n \n\n1.[https://youtube.com/@SuketuPatel](https://youtube.com/@SuketuPatel) 2.[https://youtube.com/@kan-chan-chan-channel](https://youtube.com/@kan-chan-chan-channel) 3.[https://youtube.com/@MarikaGeorgievna](https://youtube.com/@MarikaGeorgievna) 4.[https://youtube.com/@AjayPratapSharma](https://youtube.com/@AjayPratapSharma) 5.[https://youtube.com/@majapearldream8769](https://youtube.com/@majapearldream8769) 6.[https://youtube.com/@abhi\\_and\\_yvanka](https://youtube.com/@abhi_and_yvanka) 7.[https://youtube.com/@EuropeanDiarybySiyadRawther](https://youtube.com/@EuropeanDiarybySiyadRawther)\n\n8.[https://youtube.com/@AviSandy](https://youtube.com/@AviSandy) 9.[https://youtube.com/@RajinFrance](https://youtube.com/@RajinFrance) 10.[https://youtube.com/@thedaniansfamily4536](https://youtube.com/@thedaniansfamily4536) 11.[https://youtube.com/@janeandjain](https://youtube.com/@janeandjain) 12.[https://youtube.com/@DiscoverGenix](https://youtube.com/@DiscoverGenix) 13.[https://youtube.com/@carmencarmcarm](https://youtube.com/@carmencarmcarm) 14.[https://youtube.com/@togetherfurever2574](https://youtube.com/@togetherfurever2574) 15.[https://youtube.com/@Two\\_Gypsys](https://youtube.com/@Two_Gypsys) 16.[https://youtube.com/@berdine\\_chang8572](https://youtube.com/@berdine_chang8572) 17.[https://youtube.com/@desidutchcouple](https://youtube.com/@desidutchcouple) 18.[https://youtube.com/@JohannaNorth](https://youtube.com/@JohannaNorth) 19.[https://youtube.com/@YudiJ](https://youtube.com/@YudiJ) 20,[https://youtube.com/@sahilmaria](https://youtube.com/@sahilmaria) 21.[https://youtube.com/@stanmathew123](https://youtube.com/@stanmathew123) 22.[https://youtube.com/@KumaarFamily](https://youtube.com/@KumaarFamily) 23.[https://youtube.com/@vernekarsinamerica](https://youtube.com/@vernekarsinamerica) 24.[https://youtube.com/@sugaryspice6361](https://youtube.com/@sugaryspice6361) 25.[https://youtube.com/@TheModernSinghs](https://youtube.com/@TheModernSinghs) 26.[https://youtube.com/@uniquepunjabi761](https://youtube.com/@uniquepunjabi761) 27.[https://youtube.com/@mastersinghs2245](https://youtube.com/@mastersinghs2245) 28.[https://youtube.com/@MukkuOksii](https://youtube.com/@MukkuOksii) 29.[https://youtube.com/@namasterussia](https://youtube.com/@namasterussia) 30.[https://youtube.com/@vaishy\\_maddy7897](https://youtube.com/@vaishy_maddy7897) 31.[https://youtube.com/@indianamericancouple2131](https://youtube.com/@indianamericancouple2131)\n\n32.[https://youtube.com/@anshmandy8088](https://youtube.com/@anshmandy8088) 33.[https://youtube.com/@soellie1539](https://youtube.com/@soellie1539) 34.[https://youtube.com/@1turkish1indian43](https://youtube.com/@1turkish1indian43) 35.[https://youtube.com/@RomiesVlogs](https://youtube.com/@RomiesVlogs) 36.[https://youtube.com/@KayWay\\_LivingLifeSachdeva](https://youtube.com/@KayWay_LivingLifeSachdeva)\n\n37.[https://youtube.com/@traveldreamz1893](https://youtube.com/@traveldreamz1893) 38.[https://www.youtube.com/@Nomadikker](https://www.youtube.com/@Nomadikker) 39.[https://youtube.com/@yunglancivlogs](https://youtube.com/@yunglancivlogs) 40.[https://youtube.com/@AmanSara](https://youtube.com/@AmanSara) 41.[https://youtube.com/@jarrydthabang9199](https://youtube.com/@jarrydthabang9199) 42.[https://youtube.com/@Thekarnes](https://youtube.com/@Thekarnes) 43.[https://youtube.com/@ahzmiandazhar6719](https://youtube.com/@ahzmiandazhar6719) 44.[https://youtube.com/@-KorindianDiaries](https://youtube.com/@-KorindianDiaries) 45.[https://youtube.com/@NamastefromUSA](https://youtube.com/@NamastefromUSA) 46.[https://youtube.com/@IndiaInDetails](https://youtube.com/@IndiaInDetails) 47.[https://youtube.com/@SnYdays](https://youtube.com/@SnYdays) 48.[https://youtube.com/@TimeOutSquad](https://youtube.com/@TimeOutSquad) 49.[https://youtube.com/@colleensohan3717](https://youtube.com/@colleensohan3717) 50.[https://youtube.com/@myneighbortumul-indianlife5029](https://youtube.com/@myneighbortumul-indianlife5029)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694879263.0,
    "convurl": "https://external-preview.redd.it/_kxsDvodl5UrDrUhKCe1C3B9AlQduU89d8lAJqP6DOI.jpg?auto=webp&s=07cc12dec04646653298febdbf6403e42a5baa76",
    "comments": [
        "Wow 50! Fifty!",
        "It pays because Indians flock when they read \"Indian\" in the title and they will never get bored of seeing a non-Indian trying to follow Indian traditions or even speak Indian languages. IMO, is it weird? Yes. Should anyone care about it? No",
        "Who care? And why you're so obsessed with them? \n\n\nThere a literally similar name post this year.",
        "Here I was thinking you would post some nice interracial porn",
        "And they wear Indian saree and make YouTube shorts...stating ‘Indian ethinic wear is the best’",
        "It's honestly cool. I follow a German girl on YouTube and she speaks such accurate Kannada. It's almost like you are transported back to Bangalore. Like it's one thing to speak the language another to get the accent right. I think this genre is harmless though a novelty",
        "True, it's harmless and interesting. It's only weird because I feel Indians are a little too obsessed seeing others follow their culture, as if they are getting ratified by a superior being. You can see thing because \"American trying dosa\" will get way more views than \"Indian trying hamburger\".",
        "I know we shouldn’t care but seeing indians marry non indians and them trying indian culture is always weird to me",
        "I have seen this post here before. Why are you copying this post for, karma farming?",
        "India as a market is very attractive for anyonep",
        "Supply demand",
        "How to take advantage of Indian men fantasies with gori",
        "If they're happy and not hurting anybody I don't care.",
        "Lots of Indians, means lots of clicks. Just a way to make money.",
        "I looked through a handful of the youtube channels and it seems like they are mostly just travel channels, they don't seem to be making their whole channel about India or Indian culture.  On a number of there is content about India but also other countries.  It's always fun to see other people do things from your culture and see their reactions."
    ],
    "cleaned_text": "non indian women marrying indian guy making whole social media life culture legit genre youtube absolutely weird yall think thought interested indian culture checked youtube literal genre thousands thousands channels non indian woman married indian guy channelinsta culture literally nothing else like channels subscribers millions subscribers millions views millions likes damn weird thought maybe white skin obsession among indians hundreds channels women non white ethnicities like middle eastern black chinese koreanjapanese thai etc really weird yall think edit dont believe gon na link rimxfyoutube httpsyoutubecomsuketupatelhttpsyoutubecomsuketupatel httpsyoutubecomkanchanchanchannelhttpsyoutubecomkanchanchanchannel httpsyoutubecommarikageorgievnahttpsyoutubecommarikageorgievna httpsyoutubecomajaypratapsharmahttpsyoutubecomajaypratapsharma httpsyoutubecommajapearldreamhttpsyoutubecommajapearldream httpsyoutubecomabhiandyvankahttpsyoutubecomabhiandyvanka httpsyoutubecomeuropeandiarybysiyadrawtherhttpsyoutubecomeuropeandiarybysiyadrawther httpsyoutubecomavisandyhttpsyoutubecomavisandy httpsyoutubecomrajinfrancehttpsyoutubecomrajinfrance httpsyoutubecomthedaniansfamilyhttpsyoutubecomthedaniansfamily httpsyoutubecomjaneandjainhttpsyoutubecomjaneandjain httpsyoutubecomdiscovergenixhttpsyoutubecomdiscovergenix httpsyoutubecomcarmencarmcarmhttpsyoutubecomcarmencarmcarm httpsyoutubecomtogetherfureverhttpsyoutubecomtogetherfurever httpsyoutubecomtwogypsyshttpsyoutubecomtwogypsys httpsyoutubecomberdinechanghttpsyoutubecomberdinechang httpsyoutubecomdesidutchcouplehttpsyoutubecomdesidutchcouple httpsyoutubecomjohannanorthhttpsyoutubecomjohannanorth httpsyoutubecomyudijhttpsyoutubecomyudij httpsyoutubecomsahilmariahttpsyoutubecomsahilmaria httpsyoutubecomstanmathewhttpsyoutubecomstanmathew httpsyoutubecomkumaarfamilyhttpsyoutubecomkumaarfamily httpsyoutubecomvernekarsinamericahttpsyoutubecomvernekarsinamerica httpsyoutubecomsugaryspicehttpsyoutubecomsugaryspice httpsyoutubecomthemodernsinghshttpsyoutubecomthemodernsinghs httpsyoutubecomuniquepunjabihttpsyoutubecomuniquepunjabi httpsyoutubecommastersinghshttpsyoutubecommastersinghs httpsyoutubecommukkuoksiihttpsyoutubecommukkuoksii httpsyoutubecomnamasterussiahttpsyoutubecomnamasterussia httpsyoutubecomvaishymaddyhttpsyoutubecomvaishymaddy httpsyoutubecomindianamericancouplehttpsyoutubecomindianamericancouple httpsyoutubecomanshmandyhttpsyoutubecomanshmandy httpsyoutubecomsoelliehttpsyoutubecomsoellie httpsyoutubecomturkishindianhttpsyoutubecomturkishindian httpsyoutubecomromiesvlogshttpsyoutubecomromiesvlogs httpsyoutubecomkaywaylivinglifesachdevahttpsyoutubecomkaywaylivinglifesachdeva httpsyoutubecomtraveldreamzhttpsyoutubecomtraveldreamz httpswwwyoutubecomnomadikkerhttpswwwyoutubecomnomadikker httpsyoutubecomyunglancivlogshttpsyoutubecomyunglancivlogs httpsyoutubecomamansarahttpsyoutubecomamansara httpsyoutubecomjarrydthabanghttpsyoutubecomjarrydthabang httpsyoutubecomthekarneshttpsyoutubecomthekarnes httpsyoutubecomahzmiandazharhttpsyoutubecomahzmiandazhar httpsyoutubecomkorindiandiarieshttpsyoutubecomkorindiandiaries httpsyoutubecomnamastefromusahttpsyoutubecomnamastefromusa httpsyoutubecomindiaindetailshttpsyoutubecomindiaindetails httpsyoutubecomsnydayshttpsyoutubecomsnydays httpsyoutubecomtimeoutsquadhttpsyoutubecomtimeoutsquad httpsyoutubecomcolleensohanhttpsyoutubecomcolleensohan httpsyoutubecommyneighbortumulindianlifehttpsyoutubecommyneighbortumulindianlife ",
    "cleaned_title": "non indian women marrying indian guy making whole social media life culture legit genre youtube absolutely weird yall think",
    "cleaned_selftext": "thought interested indian culture checked youtube literal genre thousands thousands channels non indian woman married indian guy channelinsta culture literally nothing else like channels subscribers millions subscribers millions views millions likes damn weird thought maybe white skin obsession among indians hundreds channels women non white ethnicities like middle eastern black chinese koreanjapanese thai etc really weird yall think edit dont believe gon na link rimxfyoutube httpsyoutubecomsuketupatelhttpsyoutubecomsuketupatel httpsyoutubecomkanchanchanchannelhttpsyoutubecomkanchanchanchannel httpsyoutubecommarikageorgievnahttpsyoutubecommarikageorgievna httpsyoutubecomajaypratapsharmahttpsyoutubecomajaypratapsharma httpsyoutubecommajapearldreamhttpsyoutubecommajapearldream httpsyoutubecomabhiandyvankahttpsyoutubecomabhiandyvanka httpsyoutubecomeuropeandiarybysiyadrawtherhttpsyoutubecomeuropeandiarybysiyadrawther httpsyoutubecomavisandyhttpsyoutubecomavisandy httpsyoutubecomrajinfrancehttpsyoutubecomrajinfrance httpsyoutubecomthedaniansfamilyhttpsyoutubecomthedaniansfamily httpsyoutubecomjaneandjainhttpsyoutubecomjaneandjain httpsyoutubecomdiscovergenixhttpsyoutubecomdiscovergenix httpsyoutubecomcarmencarmcarmhttpsyoutubecomcarmencarmcarm httpsyoutubecomtogetherfureverhttpsyoutubecomtogetherfurever httpsyoutubecomtwogypsyshttpsyoutubecomtwogypsys httpsyoutubecomberdinechanghttpsyoutubecomberdinechang httpsyoutubecomdesidutchcouplehttpsyoutubecomdesidutchcouple httpsyoutubecomjohannanorthhttpsyoutubecomjohannanorth httpsyoutubecomyudijhttpsyoutubecomyudij httpsyoutubecomsahilmariahttpsyoutubecomsahilmaria httpsyoutubecomstanmathewhttpsyoutubecomstanmathew httpsyoutubecomkumaarfamilyhttpsyoutubecomkumaarfamily httpsyoutubecomvernekarsinamericahttpsyoutubecomvernekarsinamerica httpsyoutubecomsugaryspicehttpsyoutubecomsugaryspice httpsyoutubecomthemodernsinghshttpsyoutubecomthemodernsinghs httpsyoutubecomuniquepunjabihttpsyoutubecomuniquepunjabi httpsyoutubecommastersinghshttpsyoutubecommastersinghs httpsyoutubecommukkuoksiihttpsyoutubecommukkuoksii httpsyoutubecomnamasterussiahttpsyoutubecomnamasterussia httpsyoutubecomvaishymaddyhttpsyoutubecomvaishymaddy httpsyoutubecomindianamericancouplehttpsyoutubecomindianamericancouple httpsyoutubecomanshmandyhttpsyoutubecomanshmandy httpsyoutubecomsoelliehttpsyoutubecomsoellie httpsyoutubecomturkishindianhttpsyoutubecomturkishindian httpsyoutubecomromiesvlogshttpsyoutubecomromiesvlogs httpsyoutubecomkaywaylivinglifesachdevahttpsyoutubecomkaywaylivinglifesachdeva httpsyoutubecomtraveldreamzhttpsyoutubecomtraveldreamz httpswwwyoutubecomnomadikkerhttpswwwyoutubecomnomadikker httpsyoutubecomyunglancivlogshttpsyoutubecomyunglancivlogs httpsyoutubecomamansarahttpsyoutubecomamansara httpsyoutubecomjarrydthabanghttpsyoutubecomjarrydthabang httpsyoutubecomthekarneshttpsyoutubecomthekarnes httpsyoutubecomahzmiandazharhttpsyoutubecomahzmiandazhar httpsyoutubecomkorindiandiarieshttpsyoutubecomkorindiandiaries httpsyoutubecomnamastefromusahttpsyoutubecomnamastefromusa httpsyoutubecomindiaindetailshttpsyoutubecomindiaindetails httpsyoutubecomsnydayshttpsyoutubecomsnydays httpsyoutubecomtimeoutsquadhttpsyoutubecomtimeoutsquad httpsyoutubecomcolleensohanhttpsyoutubecomcolleensohan httpsyoutubecommyneighbortumulindianlifehttpsyoutubecommyneighbortumulindianlife",
    "cleaned_comments": "wow fifty pays indians flock read indian title never get bored seeing nonindian trying follow indian traditions even speak indian languages imo weird yes anyone care care youre obsessed literally similar name post year thinking would post nice interracial porn wear indian saree make youtube shortsstating indian ethinic wear best honestly cool follow german girl youtube speaks accurate kannada almost like transported back bangalore like one thing speak language another get accent right think genre harmless though novelty true harmless interesting weird feel indians little obsessed seeing others follow culture getting ratified superior see thing american trying dosa get way views indian trying hamburger know shouldnt care seeing indians marry non indians trying indian culture always weird seen post copying post karma farming india market attractive anyonep supply demand take advantage indian men fantasies gori theyre happy hurting anybody dont care lots indians means lots clicks way make money looked handful youtube channels seems like mostly travel channels dont seem making whole channel india indian culture number content india also countries always fun see people things culture see reactions",
    "light_cleaned_title": "Non Indian women marrying Indian guy and making her whole social media life about his culture is a legit genre in youtube and it is absolutely weird, what do yall think?",
    "light_cleaned_selftext": "I thought it was just a few interested in Indian culture, so i checked on youtube. It is a literal genre in there. Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture. Literally nothing else. Its not like these channels have just a few subscribers. Its millions of subscribers, millions of views ,millions of likes. Its so damn weird. I thought maybe it is because of white skin obsession among indians. But there hundreds of channels of women from other non white ethnicities like middle eastern, black, chinese, korean,japanese, thai etc. Its really weird. What do yall think? EDIT: If you dont believe me i am gonna link a few here from r/imxf_youtube 1.[https://youtube.com/@SuketuPatel](https://youtube.com/@SuketuPatel) 2.[https://youtube.com/@kan-chan-chan-channel](https://youtube.com/@kan-chan-chan-channel) 3.[https://youtube.com/@MarikaGeorgievna](https://youtube.com/@MarikaGeorgievna) 4.[https://youtube.com/@AjayPratapSharma](https://youtube.com/@AjayPratapSharma) 5.[https://youtube.com/@majapearldream8769](https://youtube.com/@majapearldream8769) 6.[https://youtube.com/@abhi\\_and\\_yvanka](https://youtube.com/@abhi_and_yvanka) 7.[https://youtube.com/@EuropeanDiarybySiyadRawther](https://youtube.com/@EuropeanDiarybySiyadRawther) 8.[https://youtube.com/@AviSandy](https://youtube.com/@AviSandy) 9.[https://youtube.com/@RajinFrance](https://youtube.com/@RajinFrance) 10.[https://youtube.com/@thedaniansfamily4536](https://youtube.com/@thedaniansfamily4536) 11.[https://youtube.com/@janeandjain](https://youtube.com/@janeandjain) 12.[https://youtube.com/@DiscoverGenix](https://youtube.com/@DiscoverGenix) 13.[https://youtube.com/@carmencarmcarm](https://youtube.com/@carmencarmcarm) 14.[https://youtube.com/@togetherfurever2574](https://youtube.com/@togetherfurever2574) 15.[https://youtube.com/@Two\\_Gypsys](https://youtube.com/@Two_Gypsys) 16.[https://youtube.com/@berdine\\_chang8572](https://youtube.com/@berdine_chang8572) 17.[https://youtube.com/@desidutchcouple](https://youtube.com/@desidutchcouple) 18.[https://youtube.com/@JohannaNorth](https://youtube.com/@JohannaNorth) 19.[https://youtube.com/@YudiJ](https://youtube.com/@YudiJ) 20,[https://youtube.com/@sahilmaria](https://youtube.com/@sahilmaria) 21.[https://youtube.com/@stanmathew123](https://youtube.com/@stanmathew123) 22.[https://youtube.com/@KumaarFamily](https://youtube.com/@KumaarFamily) 23.[https://youtube.com/@vernekarsinamerica](https://youtube.com/@vernekarsinamerica) 24.[https://youtube.com/@sugaryspice6361](https://youtube.com/@sugaryspice6361) 25.[https://youtube.com/@TheModernSinghs](https://youtube.com/@TheModernSinghs) 26.[https://youtube.com/@uniquepunjabi761](https://youtube.com/@uniquepunjabi761) 27.[https://youtube.com/@mastersinghs2245](https://youtube.com/@mastersinghs2245) 28.[https://youtube.com/@MukkuOksii](https://youtube.com/@MukkuOksii) 29.[https://youtube.com/@namasterussia](https://youtube.com/@namasterussia) 30.[https://youtube.com/@vaishy\\_maddy7897](https://youtube.com/@vaishy_maddy7897) 31.[https://youtube.com/@indianamericancouple2131](https://youtube.com/@indianamericancouple2131) 32.[https://youtube.com/@anshmandy8088](https://youtube.com/@anshmandy8088) 33.[https://youtube.com/@soellie1539](https://youtube.com/@soellie1539) 34.[https://youtube.com/@1turkish1indian43](https://youtube.com/@1turkish1indian43) 35.[https://youtube.com/@RomiesVlogs](https://youtube.com/@RomiesVlogs) 36.[https://youtube.com/@KayWay\\_LivingLifeSachdeva](https://youtube.com/@KayWay_LivingLifeSachdeva) 37.[https://youtube.com/@traveldreamz1893](https://youtube.com/@traveldreamz1893) 38.[https://www.youtube.com/@Nomadikker](https://www.youtube.com/@Nomadikker) 39.[https://youtube.com/@yunglancivlogs](https://youtube.com/@yunglancivlogs) 40.[https://youtube.com/@AmanSara](https://youtube.com/@AmanSara) 41.[https://youtube.com/@jarrydthabang9199](https://youtube.com/@jarrydthabang9199) 42.[https://youtube.com/@Thekarnes](https://youtube.com/@Thekarnes) 43.[https://youtube.com/@ahzmiandazhar6719](https://youtube.com/@ahzmiandazhar6719) 44.[https://youtube.com/@-KorindianDiaries](https://youtube.com/@-KorindianDiaries) 45.[https://youtube.com/@NamastefromUSA](https://youtube.com/@NamastefromUSA) 46.[https://youtube.com/@IndiaInDetails](https://youtube.com/@IndiaInDetails) 47.[https://youtube.com/@SnYdays](https://youtube.com/@SnYdays) 48.[https://youtube.com/@TimeOutSquad](https://youtube.com/@TimeOutSquad) 49.[https://youtube.com/@colleensohan3717](https://youtube.com/@colleensohan3717) 50.[https://youtube.com/@myneighbortumul-indianlife5029](https://youtube.com/@myneighbortumul-indianlife5029)",
    "light_cleaned_comments": "Wow 50! Fifty! It pays because Indians flock when they read \"Indian\" in the title and they will never get bored of seeing a non-Indian trying to follow Indian traditions or even speak Indian languages. IMO, is it weird? Yes. Should anyone care about it? No Who care? And why you're so obsessed with them? There a literally similar name post this year. Here I was thinking you would post some nice interracial porn And they wear Indian saree and make YouTube shorts...stating ‘Indian ethinic wear is the best’ It's honestly cool. I follow a German girl on YouTube and she speaks such accurate Kannada. It's almost like you are transported back to Bangalore. Like it's one thing to speak the language another to get the accent right. I think this genre is harmless though a novelty True, it's harmless and interesting. It's only weird because I feel Indians are a little too obsessed seeing others follow their culture, as if they are getting ratified by a superior being. You can see thing because \"American trying dosa\" will get way more views than \"Indian trying hamburger\". I know we shouldn’t care but seeing indians marry non indians and them trying indian culture is always weird to me I have seen this post here before. Why are you copying this post for, karma farming? India as a market is very attractive for anyonep Supply demand How to take advantage of Indian men fantasies with gori If they're happy and not hurting anybody I don't care. Lots of Indians, means lots of clicks. Just a way to make money. I looked through a handful of the youtube channels and it seems like they are mostly just travel channels, they don't seem to be making their whole channel about India or Indian culture. On a number of there is content about India but also other countries. It's always fun to see other people do things from your culture and see their reactions."
}