{
    "id": "1cju8l0",
    "title": "Section 498A IPC has been copied verbatim in new criminal law; make changes: Supreme Court to Centre",
    "url": "https://www.reddit.com/gallery/1cju8l0",
    "selftext": "Link to full article https://www.barandbench.com/news/section-498a-ipc-copied-verbatim-new-criminal-law-make-changes-supreme-court-centre",
    "flair": "Law & Courts",
    "score": 23,
    "num_comments": 5,
    "created_utc": 1714805743.0,
    "convurl": "https://i.redd.it/0ws7ddhvxcyc1.jpg",
    "comments": [
        "From another [source:](https://www.verdictum.in/court-updates/supreme-court/achin-gupta-v-state-of-haryana-2024-insc-369-section-498a-ipc-husband-wife-dispute-1533679)\n\n>The Court said that the Police machinery cannot be utilised for the purpose of holding the husband at ransom so that he could be squeezed by the wife at the instigation of her parents or relatives or friends and in all cases, where wife complains of harassment or ill-treatment, Section 498A of the IPC cannot be applied mechanically.",
        "Lawyers will lose all their business. \n\nJust make the section compounded do that high courts don't have to do 200 -300 cases quashing per day.\n\nPolice and magistrate courts are manufacturing work for high courts as the law is poorly conceived.",
        "Humare desh k padhe like politicians",
        "isn't that a W?"
    ],
    "cleaned_text": "section ipc copied verbatim new criminal law make changes supreme court centre link full article ",
    "cleaned_title": "section ipc copied verbatim new criminal law make changes supreme court centre",
    "cleaned_selftext": "link full article",
    "cleaned_comments": "another sourcehttpswwwverdictumincourtupdatessupremecourtachinguptavstateofharyanainscsectionaipchusbandwifedispute court said police machinery utilised purpose holding husband ransom could squeezed wife instigation parents relatives friends cases wife complains harassment illtreatment section ipc applied mechanically lawyers lose business make section compounded high courts dont cases quashing per day police magistrate courts manufacturing work high courts law poorly conceived humare desh k padhe like politicians isnt w",
    "light_cleaned_title": "Section 498A IPC has been copied verbatim in new criminal law; make changes: Supreme Court to Centre",
    "light_cleaned_selftext": "Link to full article",
    "light_cleaned_comments": "From another [source:](https://www.verdictum.in/court-updates/supreme-court/achin-gupta-v-state-of-haryana-2024-insc-369-section-498a-ipc-husband-wife-dispute-1533679) >The Court said that the Police machinery cannot be utilised for the purpose of holding the husband at ransom so that he could be squeezed by the wife at the instigation of her parents or relatives or friends and in all cases, where wife complains of harassment or ill-treatment, Section 498A of the IPC cannot be applied mechanically. Lawyers will lose all their business. Just make the section compounded do that high courts don't have to do 200 -300 cases quashing per day. Police and magistrate courts are manufacturing work for high courts as the law is poorly conceived. Humare desh k padhe like politicians isn't that a W?"
}