{
    "id": "hylqf6",
    "title": "The fight for fast and affordable internet in Andaman &amp; Nicobar Islands continues...",
    "url": "https://www.reddit.com/r/india/comments/hylqf6/the_fight_for_fast_and_affordable_internet_in/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/hy8skmtuwbd51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=9e18c82e7a50b1ac37f83153f036101e3e0cb26c\n\n**tl;dr**\n\nThe Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project was slated to be completed by June, 2020. However, it has still not been completed with no official statement of a new timeline. We wrote to Shri Kuldeep Rai Sharma, the Honourable Member of Parliament for the Andaman and Nicobar Islands stating our concerns and urging him to escalate the matter with PMO and MeitY.  \n\n\n**The Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project**\n\nOn [**January 9, 2020**](https://pib.gov.in/PressReleasePage.aspx?PRID=1598968), Shri R.S. Prasad, Hon’ble Minister of Communications. Electronics &amp; IT and Law &amp; Justice inaugurated the cable-laying work of the CANI Project. The cables are of four-fibre pairs, with the capacity to transfer 6.4 tera-bytes of data per second by each fibre-pair. At the initial stage of commissioning of the project itself, the islands are supposed to get a data speed of 400-gigabytes per second which is nearly 100 times of the existing capacity. The project, which was scheduled to be completed by June, 2020, has still not been completed.  \n\n\nOn June 5, 2020, we filed a Right to Information request with BSNL (Andaman &amp; Nicobar Islands) requesting them to provide us with information about the CANI Project. In their reply dated June 29, 2020, they refused to answer most of our queries and failed to provide us with a timeline of when the project will be completed and operationalized. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/0wvkg4lxwbd51.jpg?width=1102&amp;format=pjpg&amp;auto=webp&amp;s=510a99c3f641918a4253c4a8fc29c13ed5958eb4\n\nAs pointed out in our previous blogposts (read [**here**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/) and [**here**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/)), access to fast and affordable internet has been a persistent issue in the A&amp;N Islands. This issue has only worsened due to the ongoing pandemic where people have become increasingly dependent on the internet.\n\n**Next step?**\n\nPreviously, we [**wrote**](https://drive.google.com/file/d/1YB3BEiFNiCQdnf7tptQcnQW_slEkcWjA/view?usp=sharing) to the Prime Minister’s Office and the Department of Telecommunications highlighting the prevalent issues and providing certain recommendations on June 26, 2020. However, after failing to receive any response from them and in light of the RTI response received we decided to write to Shri Kuldeep Rai Sharma, the Hon’ble Member of Parliament for the Andaman and Nicobar Islands. In our letter, we have voiced the same concerns and raised similar demands as in our previous letter. Further, we have requested him to escalate the matter with the PMO and DoT so that the people of A&amp;N Islands can be made aware of the current timeline of the CANI Project.   \n\n\n**Want help?**\n\nIf you are a digital rights researcher, or are interested in achieving higher amounts of public disclosure on any issue that impacts fundamental rights and technology then reach out to us. We offer advice on drafting, or even filing ourselves and pursue all such claims to their logical conclusion. For help just ping us at legal@internetfreedom.in\n\nIf you want us to file an RTI for you, [fill out the form here.](https://blocksurvey.io/survey/1PfQfn62JSDjjyK4nuHoY5t21wKeuocLLm/dee5fc5b-9276-48cf-b832-e72124945d91)\n\n**Important Documents:**\n\n1. Letter to Shri Kuldeep Rai Sharma on the CANI Project dated July 25, 2020 ([**link**](https://drive.google.com/file/d/1N0L4inmL8he6VzZl6NtNYBiM9pCUCBtE/view?usp=sharing))\n2. For the people of Andaman &amp; Nicobar Islands, 4G internet at reasonable tariffs is still a dream... dated June 10, 2020 ([**link**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/))\n3. We wrote to the PMO &amp; DoT on the Access to Internet issue which is persisting in the Andaman &amp; Nicobar Islands dated June 26, 2020 ([**link**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/))\n\n[**If we’ve learned anything from the pandemic as a society, it’s that technology and internet access is essential to our everyday life and that there’s a need to extend and re-purpose our technology. Help us by donating to our ongoing fundraiser now!**](https://internetfreedom.in/iff-device-drive/)",
    "flair": "Policy/Economy",
    "score": 167,
    "num_comments": 7,
    "created_utc": 1595824980,
    "convurl": "https://b.thumbs.redditmedia.com/Vs370Y28XUdGDTZUOWWhjj2aQ_0qaNa4aP-vZ9hdPPo.jpg",
    "comments": [
        "Jio won't capitalise there coz population density is not enough to make enormous amounts of money.",
        "they put one in ladakh with popluation of  2.74lac  and wont in A&amp;N with population of 3.81lac. there must be a different reason",
        "source   [https://www.leh-ladakh-taxi-booking.com/practical-info/mobile-network-and-internet-connectivity-in-leh-ladakh#:\\~:text=Jio%20network,up%20to%20Diskit%20and%20Hunder.](https://www.leh-ladakh-taxi-booking.com/practical-info/mobile-network-and-internet-connectivity-in-leh-ladakh#:~:text=Jio%20network,up%20to%20Diskit%20and%20Hunder.) \n\nnot most reliable but i did attend the reliance AGm and one of their investors was praising the director about it this year.",
        "A&amp;N is rather spread out... the main connectivity will come to the main island.. then they have to build cables thru land that's off limits i.e protected reserve for the jarawas.. just to connect the north and south of the same island..\n\nThen comes havelock Neil young etc.. \n\n\nAnd nicobar is really far away and just two islands could use it coz most of the rest is protected reserve for the nicobar tribes..\n\nSo just may not be worth it..",
        "Neil and long.. sorry typo..",
        "This should be addressed earliest.",
        "You should have asked penalty clause in case of delay, in agreement with contractor (cable lying company ) , if that info is being asked in RTI , it will surely put pressure to complete work at earliest."
    ],
    "cleaned_text": "fight fast affordable internet andaman amp nicobar islands continues ampxb tldr chennai andaman amp nicobar islands cani submarine cable systems project slated completed june however still completed official statement new timeline wrote shri kuldeep rai sharma honourable member parliament andaman nicobar islands stating concerns urging escalate matter pmo meity chennai andaman amp nicobar islands cani submarine cable systems project january httpspibgovinpressreleasepageaspxprid shri rs prasad honble minister communications electronics amp law amp justice inaugurated cablelaying work cani project cables fourfibre pairs capacity transfer terabytes data per second fibrepair initial stage commissioning project islands supposed get data speed gigabytes per second nearly times existing capacity project scheduled completed june still completed june filed right information request bsnl andaman amp nicobar islands requesting provide us information cani project reply dated june refused answer queries failed provide us timeline project completed operationalized ampxb pointed previous blogposts read herehttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream herehttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands access fast affordable internet persistent issue aampn islands issue worsened due ongoing pandemic people become increasingly dependent internet next step previously wrotehttpsdrivegooglecomfiledybbeifnicqdnftptqcnqwslekcwjaviewuspsharing prime ministers office department telecommunications highlighting prevalent issues providing certain recommendations june however failing receive response light rti response received decided write shri kuldeep rai sharma honble member parliament andaman nicobar islands letter voiced concerns raised similar demands previous letter requested escalate matter pmo dot people aampn islands made aware current timeline cani project want help digital rights researcher interested achieving higher amounts public disclosure issue impacts fundamental rights technology reach us offer advice drafting even filing pursue claims logical conclusion help ping us legalinternetfreedomin want us file rti fill form herehttpsblocksurveyiosurveypfqfnjsdjjyknuhoytwkeuocllmdeefcbcfbed important documents letter shri kuldeep rai sharma cani project dated july linkhttpsdrivegooglecomfilednlinmlhevzzlntnybimpcucbteviewuspsharing people andaman amp nicobar islands g internet reasonable tariffs still dream dated june linkhttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream wrote pmo amp dot access internet issue persisting andaman amp nicobar islands dated june linkhttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands weve learned anything pandemic society technology internet access essential everyday life theres need extend repurpose technology help us donating ongoing fundraiser nowhttpsinternetfreedominiffdevicedrive ",
    "cleaned_title": "fight fast affordable internet andaman amp nicobar islands continues",
    "cleaned_selftext": "ampxb tldr chennai andaman amp nicobar islands cani submarine cable systems project slated completed june however still completed official statement new timeline wrote shri kuldeep rai sharma honourable member parliament andaman nicobar islands stating concerns urging escalate matter pmo meity chennai andaman amp nicobar islands cani submarine cable systems project january httpspibgovinpressreleasepageaspxprid shri rs prasad honble minister communications electronics amp law amp justice inaugurated cablelaying work cani project cables fourfibre pairs capacity transfer terabytes data per second fibrepair initial stage commissioning project islands supposed get data speed gigabytes per second nearly times existing capacity project scheduled completed june still completed june filed right information request bsnl andaman amp nicobar islands requesting provide us information cani project reply dated june refused answer queries failed provide us timeline project completed operationalized ampxb pointed previous blogposts read herehttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream herehttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands access fast affordable internet persistent issue aampn islands issue worsened due ongoing pandemic people become increasingly dependent internet next step previously wrotehttpsdrivegooglecomfiledybbeifnicqdnftptqcnqwslekcwjaviewuspsharing prime ministers office department telecommunications highlighting prevalent issues providing certain recommendations june however failing receive response light rti response received decided write shri kuldeep rai sharma honble member parliament andaman nicobar islands letter voiced concerns raised similar demands previous letter requested escalate matter pmo dot people aampn islands made aware current timeline cani project want help digital rights researcher interested achieving higher amounts public disclosure issue impacts fundamental rights technology reach us offer advice drafting even filing pursue claims logical conclusion help ping us legalinternetfreedomin want us file rti fill form herehttpsblocksurveyiosurveypfqfnjsdjjyknuhoytwkeuocllmdeefcbcfbed important documents letter shri kuldeep rai sharma cani project dated july linkhttpsdrivegooglecomfilednlinmlhevzzlntnybimpcucbteviewuspsharing people andaman amp nicobar islands g internet reasonable tariffs still dream dated june linkhttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream wrote pmo amp dot access internet issue persisting andaman amp nicobar islands dated june linkhttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands weve learned anything pandemic society technology internet access essential everyday life theres need extend repurpose technology help us donating ongoing fundraiser nowhttpsinternetfreedominiffdevicedrive",
    "cleaned_comments": "jio wont capitalise coz population density enough make enormous amounts money put one ladakh popluation lac wont aampn population lac must different reason source httpswwwlehladakhtaxibookingcompracticalinfomobilenetworkandinternetconnectivityinlehladakhtextjionetworkuptodiskitandhunderhttpswwwlehladakhtaxibookingcompracticalinfomobilenetworkandinternetconnectivityinlehladakhtextjionetworkuptodiskitandhunder reliable attend reliance agm one investors praising director year aampn rather spread main connectivity come main island build cables thru land thats limits ie protected reserve jarawas connect north south island comes havelock neil young etc nicobar really far away two islands could use coz rest protected reserve nicobar tribes may worth neil long sorry typo addressed earliest asked penalty clause case delay agreement contractor cable lying company info asked rti surely put pressure complete work earliest",
    "light_cleaned_title": "The fight for fast and affordable internet in Andaman &amp; Nicobar Islands continues...",
    "light_cleaned_selftext": "**tl;dr** The Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project was slated to be completed by June, 2020. However, it has still not been completed with no official statement of a new timeline. We wrote to Shri Kuldeep Rai Sharma, the Honourable Member of Parliament for the Andaman and Nicobar Islands stating our concerns and urging him to escalate the matter with PMO and MeitY. **The Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project** On [**January 9, 2020**](https://pib.gov.in/PressReleasePage.aspx?PRID=1598968), Shri R.S. Prasad, Hon’ble Minister of Communications. Electronics &amp; IT and Law &amp; Justice inaugurated the cable-laying work of the CANI Project. The cables are of four-fibre pairs, with the capacity to transfer 6.4 tera-bytes of data per second by each fibre-pair. At the initial stage of commissioning of the project itself, the islands are supposed to get a data speed of 400-gigabytes per second which is nearly 100 times of the existing capacity. The project, which was scheduled to be completed by June, 2020, has still not been completed. On June 5, 2020, we filed a Right to Information request with BSNL (Andaman &amp; Nicobar Islands) requesting them to provide us with information about the CANI Project. In their reply dated June 29, 2020, they refused to answer most of our queries and failed to provide us with a timeline of when the project will be completed and operationalized.  As pointed out in our previous blogposts (read [**here**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/) and [**here**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/)), access to fast and affordable internet has been a persistent issue in the A&amp;N Islands. This issue has only worsened due to the ongoing pandemic where people have become increasingly dependent on the internet. **Next step?** Previously, we [**wrote**](https://drive.google.com/file/d/1YB3BEiFNiCQdnf7tptQcnQW_slEkcWjA/view?usp=sharing) to the Prime Minister’s Office and the Department of Telecommunications highlighting the prevalent issues and providing certain recommendations on June 26, 2020. However, after failing to receive any response from them and in light of the RTI response received we decided to write to Shri Kuldeep Rai Sharma, the Hon’ble Member of Parliament for the Andaman and Nicobar Islands. In our letter, we have voiced the same concerns and raised similar demands as in our previous letter. Further, we have requested him to escalate the matter with the PMO and DoT so that the people of A&amp;N Islands can be made aware of the current timeline of the CANI Project. **Want help?** If you are a digital rights researcher, or are interested in achieving higher amounts of public disclosure on any issue that impacts fundamental rights and technology then reach out to us. We offer advice on drafting, or even filing ourselves and pursue all such claims to their logical conclusion. For help just ping us at legal@internetfreedom.in If you want us to file an RTI for you, [fill out the form here.](https://blocksurvey.io/survey/1PfQfn62JSDjjyK4nuHoY5t21wKeuocLLm/dee5fc5b-9276-48cf-b832-e72124945d91) **Important Documents:** 1. Letter to Shri Kuldeep Rai Sharma on the CANI Project dated July 25, 2020 ([**link**](https://drive.google.com/file/d/1N0L4inmL8he6VzZl6NtNYBiM9pCUCBtE/view?usp=sharing)) 2. For the people of Andaman &amp; Nicobar Islands, 4G internet at reasonable tariffs is still a dream... dated June 10, 2020 ([**link**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/)) 3. We wrote to the PMO &amp; DoT on the Access to Internet issue which is persisting in the Andaman &amp; Nicobar Islands dated June 26, 2020 ([**link**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/)) [**If we’ve learned anything from the pandemic as a society, it’s that technology and internet access is essential to our everyday life and that there’s a need to extend and re-purpose our technology. Help us by donating to our ongoing fundraiser now!**](https://internetfreedom.in/iff-device-drive/)",
    "light_cleaned_comments": "Jio won't capitalise there coz population density is not enough to make enormous amounts of money. they put one in ladakh with popluation of 2.74lac and wont in A&amp;N with population of 3.81lac. there must be a different reason source [https://www.leh-ladakh-taxi-booking.com/practical-info/mobile-network-and-internet-connectivity-in-leh-ladakh#:\\~:text=Jio%20network,up%20to%20Diskit%20and%20Hunder.](https://www.leh-ladakh-taxi-booking.com/practical-info/mobile-network-and-internet-connectivity-in-leh-ladakh#:~:text=Jio%20network,up%20to%20Diskit%20and%20Hunder.) not most reliable but i did attend the reliance AGm and one of their investors was praising the director about it this year. A&amp;N is rather spread out... the main connectivity will come to the main island.. then they have to build cables thru land that's off limits i.e protected reserve for the jarawas.. just to connect the north and south of the same island.. Then comes havelock Neil young etc.. And nicobar is really far away and just two islands could use it coz most of the rest is protected reserve for the nicobar tribes.. So just may not be worth it.. Neil and long.. sorry typo.. This should be addressed earliest. You should have asked penalty clause in case of delay, in agreement with contractor (cable lying company ) , if that info is being asked in RTI , it will surely put pressure to complete work at earliest."
}