{
    "id": "150744c",
    "title": "Question about Indian bathroom floor",
    "url": "https://www.reddit.com/r/india/comments/150744c/question_about_indian_bathroom_floor/",
    "selftext": "I am constructing a home and and we have 3 bathrooms and I am using white designed walls for all bathrooms and the question has come which is the suitable floor for bathroom. We have a dark grey  matt floor and the construction guy said we can use same dark grey for all bathroom and he said it will suite. \n\nI am thinking dark grey will expose the dirt or stain clearly, make it look unclean and i am considering  if I can use light white or light grey and he said dark grey will cover any stains, dirt or anything and make it look clean and white or any lighter shade will expose any small stain or dust and look dirty. Who is correct ? Any suggestions ? This is floor - [https://imgur.com/a/GJDNSyC](https://imgur.com/a/GJDNSyC)\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689412368.0,
    "convurl": "https://external-preview.redd.it/pchUSZ09sIZz-fuCp7VQ6hZa4SAdm5fRm04mHOj66oU.jpg?auto=webp&s=2f7cb80aaa7fff240ea6bc9b09b0c8d72a443e05",
    "comments": [
        "Grey color on the floor would look unappealing no matter how clean it is maintained. I have it in one of my bathrooms.\n\nBetter would be white tiles on the floor with some squares of natural unpolished rough stone in the centre (where you would stand and take a bath and clean your feet)",
        "Both of you are right, you speak from a form and visual appeal point of view, your contractor speaks from a practical maintenance pov. Who cleans the bathroom is your house? That person’s opinion has to have the highest weightage. The biggest issue with lighter bathroom floorings is that it will show grime and soap scum easily and will need a weekly scrubbing, the issue with dark grey is it will make your bathroom look smaller. Why not meet halfway and have that honeycomb mosaic design that comes in a combo of grey, white and a sandy shade? Are you not open to say sandy shades, that way you have another complimentary option.\n\nhttps://www.goodhousekeeping.com/home/decorating-ideas/g34897917/bathroom-tile-ideas/\n\nhttps://evolveindia.co/design/50-modern-bathroom-designs/\n\nhttps://www.magicbricks.com/blog/bathroom-floor-tile-ideas/122714.html",
        "I personally prefer lighter neutral colors. They require regular maintenance but makes the bathroom feel lighter & airer."
    ],
    "cleaned_text": "question indian bathroom floor constructing home bathrooms using white designed walls bathrooms question come suitable floor bathroom dark grey matt floor construction guy said use dark grey bathroom said suite thinking dark grey expose dirt stain clearly make look unclean considering use light white light grey said dark grey cover stains dirt anything make look clean white lighter shade expose small stain dust look dirty correct suggestions floor httpsimgurcomagjdnsychttpsimgurcomagjdnsyc xb ",
    "cleaned_title": "question indian bathroom floor",
    "cleaned_selftext": "constructing home bathrooms using white designed walls bathrooms question come suitable floor bathroom dark grey matt floor construction guy said use dark grey bathroom said suite thinking dark grey expose dirt stain clearly make look unclean considering use light white light grey said dark grey cover stains dirt anything make look clean white lighter shade expose small stain dust look dirty correct suggestions floor httpsimgurcomagjdnsychttpsimgurcomagjdnsyc xb",
    "cleaned_comments": "grey color floor would look unappealing matter clean maintained one bathrooms better would white tiles floor squares natural unpolished rough stone centre would stand take bath clean feet right speak form visual appeal point view contractor speaks practical maintenance pov cleans bathroom house persons opinion highest weightage biggest issue lighter bathroom floorings show grime soap scum easily need weekly scrubbing issue dark grey make bathroom look smaller meet halfway honeycomb mosaic design comes combo grey white sandy shade open say sandy shades way another complimentary option personally prefer lighter neutral colors require regular maintenance makes bathroom feel lighter airer",
    "light_cleaned_title": "Question about Indian bathroom floor",
    "light_cleaned_selftext": "I am constructing a home and and we have 3 bathrooms and I am using white designed walls for all bathrooms and the question has come which is the suitable floor for bathroom. We have a dark grey matt floor and the construction guy said we can use same dark grey for all bathroom and he said it will suite. I am thinking dark grey will expose the dirt or stain clearly, make it look unclean and i am considering if I can use light white or light grey and he said dark grey will cover any stains, dirt or anything and make it look clean and white or any lighter shade will expose any small stain or dust and look dirty. Who is correct ? Any suggestions ? This is floor - [https://imgur.com/a/GJDNSyC](https://imgur.com/a/GJDNSyC) &#x200B;",
    "light_cleaned_comments": "Grey color on the floor would look unappealing no matter how clean it is maintained. I have it in one of my bathrooms. Better would be white tiles on the floor with some squares of natural unpolished rough stone in the centre (where you would stand and take a bath and clean your feet) Both of you are right, you speak from a form and visual appeal point of view, your contractor speaks from a practical maintenance pov. Who cleans the bathroom is your house? That person’s opinion has to have the highest weightage. The biggest issue with lighter bathroom floorings is that it will show grime and soap scum easily and will need a weekly scrubbing, the issue with dark grey is it will make your bathroom look smaller. Why not meet halfway and have that honeycomb mosaic design that comes in a combo of grey, white and a sandy shade? Are you not open to say sandy shades, that way you have another complimentary option. I personally prefer lighter neutral colors. They require regular maintenance but makes the bathroom feel lighter & airer."
}