{
    "id": "1hgzkka",
    "title": "H-1B visa revamped from Jan 17: Key changes employers, applicants must know",
    "url": "https://www.business-standard.com/finance/personal-finance/h-1b-visa-revamped-from-jan-17-key-changes-employers-applicants-must-know-124121800808_1.html",
    "selftext": "Key changes introduced in H-1B programme\n \n1. *Modernised definitions for cap-exempt organisations*\nNonprofit and governmental research organisations now qualify as cap-exempt if their \"fundamental activity\" is research. The updated definition replaces the previously unclear criteria of being “primarily engaged” in research.\n \n2. *Improved transition for F-1 visa holders*\nStudents on F-1 visas shifting to H-1B status will experience fewer disruptions in legal status and employment authorisation.\n \n3. *Faster processing for visa extensions*\nUSCIS will speed up the processing of applications for those who have previously been approved for H-1B visas.\n \n4. *New flexibility for employers*\nEmployers can hire H-1B workers based on specific business needs\n \n5. *Eligibility for individuals with controlling interest*\nH-1B holders with a controlling interest in their petitioning organisation can qualify, provided certain conditions are met.\n \n6. *Stronger oversight to prevent misuse*\nUSCIS will now conduct inspections, impose penalties for non-compliance, and verify that job roles meet all requirements.\n \n7. *Revised Form I-129*\nFrom 17 January 2025, a new version of the petition form will be required for all applications.\n \n8. *Cap exemptions and year-round petitions*\nCap-exempt organisations can submit petitions year-round without facing numerical limits.\n \n9. *Lottery system abuse prevention*\nMeasures have been introduced to reduce abuse by organisations flooding the system with bulk applications, improving fairness for legitimate applicants.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1734521201.0,
    "convurl": "https://external-preview.redd.it/bs6__FPsxcpIZPLqPbDHo8umSIYFxw_PUxDoD1pQyUU.jpg?auto=webp&s=47b5afbde327c09f570b2fcf3b312721ed6b972e",
    "comments": [
        "Stay in India",
        "I see most of them as good measures! "
    ],
    "cleaned_text": "hb visa revamped jan key changes employers applicants must know key changes introduced hb programme modernised definitions capexempt organisations nonprofit governmental research organisations qualify capexempt fundamental activity research updated definition replaces previously unclear criteria primarily engaged research improved transition f visa holders students f visas shifting hb status experience fewer disruptions legal status employment authorisation faster processing visa extensions uscis speed processing applications previously approved hb visas new flexibility employers employers hire hb workers based specific business needs eligibility individuals controlling interest hb holders controlling interest petitioning organisation qualify provided certain conditions met stronger oversight prevent misuse uscis conduct inspections impose penalties noncompliance verify job roles meet requirements revised form january new version petition form required applications cap exemptions yearround petitions capexempt organisations submit petitions yearround without facing numerical limits lottery system abuse prevention measures introduced reduce abuse organisations flooding system bulk applications improving fairness legitimate applicants ",
    "cleaned_title": "hb visa revamped jan key changes employers applicants must know",
    "cleaned_selftext": "key changes introduced hb programme modernised definitions capexempt organisations nonprofit governmental research organisations qualify capexempt fundamental activity research updated definition replaces previously unclear criteria primarily engaged research improved transition f visa holders students f visas shifting hb status experience fewer disruptions legal status employment authorisation faster processing visa extensions uscis speed processing applications previously approved hb visas new flexibility employers employers hire hb workers based specific business needs eligibility individuals controlling interest hb holders controlling interest petitioning organisation qualify provided certain conditions met stronger oversight prevent misuse uscis conduct inspections impose penalties noncompliance verify job roles meet requirements revised form january new version petition form required applications cap exemptions yearround petitions capexempt organisations submit petitions yearround without facing numerical limits lottery system abuse prevention measures introduced reduce abuse organisations flooding system bulk applications improving fairness legitimate applicants",
    "cleaned_comments": "stay india see good measures",
    "light_cleaned_title": "H-1B visa revamped from Jan 17: Key changes employers, applicants must know",
    "light_cleaned_selftext": "Key changes introduced in H-1B programme 1. *Modernised definitions for cap-exempt organisations* Nonprofit and governmental research organisations now qualify as cap-exempt if their \"fundamental activity\" is research. The updated definition replaces the previously unclear criteria of being “primarily engaged” in research. 2. *Improved transition for F-1 visa holders* Students on F-1 visas shifting to H-1B status will experience fewer disruptions in legal status and employment authorisation. 3. *Faster processing for visa extensions* USCIS will speed up the processing of applications for those who have previously been approved for H-1B visas. 4. *New flexibility for employers* Employers can hire H-1B workers based on specific business needs 5. *Eligibility for individuals with controlling interest* H-1B holders with a controlling interest in their petitioning organisation can qualify, provided certain conditions are met. 6. *Stronger oversight to prevent misuse* USCIS will now conduct inspections, impose penalties for non-compliance, and verify that job roles meet all requirements. 7. *Revised Form I-129* From 17 January 2025, a new version of the petition form will be required for all applications. 8. *Cap exemptions and year-round petitions* Cap-exempt organisations can submit petitions year-round without facing numerical limits. 9. *Lottery system abuse prevention* Measures have been introduced to reduce abuse by organisations flooding the system with bulk applications, improving fairness for legitimate applicants.",
    "light_cleaned_comments": "Stay in India I see most of them as good measures!"
}