{
    "id": "1grbftl",
    "title": "Uber India Introduces Instant Payments To Tackle Drivers' Cash Request Challenge",
    "url": "https://www.ndtvprofit.com/business/uber-india-instant-payments-drivers-cash-request",
    "selftext": "I didn't know that online payments could be withdrawn only 4 times a week. No wonder cab drivers wouldn't accept rides with online payment.\n",
    "flair": "Policy/Economy",
    "score": 253,
    "num_comments": 14,
    "created_utc": 1731608546.0,
    "convurl": "https://external-preview.redd.it/gaipEnT_31l-kjhYuQqDqCFJ8BJ6lIPk5vizz8XANME.jpg?auto=webp&s=f862f2745d270a56e3c7cdd098c424901b98eb98",
    "comments": [
        "Namma yatri raising the bar with instant zero commission payments.",
        "Yep, ride sharing apps allow cash outs after a few days, usually to combat bad actors.\n\nIdk how they will do that now though.",
        "I mean Uber didn't think of it twice. Where Gpay is ubiquitous, you ask the drivers to use your shitty deposit which you can only withdraw few times a week.",
        "Yup! I was surprised too! I came to know about this few weeks after moving to Hyderabad. Never again booked a UPI based ride.",
        "E-Shram sounds like such a great idea for gig workers. I’m impressed that they came up with this. ",
        "I switched to cash only payments long back when drivers consistently complained that payments were credited at fixed times instead of immediately or by end of day. \n\nMaking taxi drivers run on credit is unacceptable, while the company can hold the money. \n\nMade no difference in my payment experience as I anyways use UPI, so money leaves my account immediately if I pay through uber app. \n\nHave not faced cancellation ever since.",
        "I mean, salaried employees wait a whole ass month to get paid, drivers can't wait a few days?? You're wasting your empathy on them.",
        "Different use case. Many drivers have to pay their owner daily.",
        "Salaried employees do not have to pay for the cubicle they use, or the cost of stationary and other utilities. Some companies even provide transportation to their employees.   \n\n\nUber drivers have to pay from their own pocket for the fuel, and maintenance of their cars. If you make 10 trips per day on an average, that will easily add up to 4-5k per week.    \n\n\nUsually, in business, where you are investing upfront, your payment is recieved at the selling point. Once you complete a sale, you get paid. Employees aren't expected to make upfront investment, they only get compensated for their labour. So, end of the month paycheck is a fair deal.",
        "Why aren't drivers switching over to this en masse?",
        "Uber still has customer trust. Especially people who travel to other cities regularly (like me), find it safer to get an uber (safer in financial terms, other factors are equally risky whether it is uber or non-uber).",
        "Yep same. I only use wallet payments for BluSmart after confirming with drivers that they get the money without any hassle. All other drivers are paid through GPay. Small step to help those who make our lives a bit easier.",
        "That’s dumb",
        "I didn't get you. Do you choose cash or UPI in app? How do you do payments to the driver?",
        "Do they cancel a lot of UPI based rides?",
        "Chose cash in app and pay to driver using UPI",
        "In Uttarakhand I had 4 Ubers in a row cancel an accepted ride and tried to ask for more than twice the amount that was on uber."
    ],
    "cleaned_text": "uber india introduces instant payments tackle drivers cash request challenge didnt know online payments could withdrawn times week wonder cab drivers wouldnt accept rides online payment ",
    "cleaned_title": "uber india introduces instant payments tackle drivers cash request challenge",
    "cleaned_selftext": "didnt know online payments could withdrawn times week wonder cab drivers wouldnt accept rides online payment",
    "cleaned_comments": "namma yatri raising bar instant zero commission payments yep ride sharing apps allow cash outs days usually combat bad actors idk though mean uber didnt think twice gpay ubiquitous ask drivers use shitty deposit withdraw times week yup surprised came know weeks moving hyderabad never booked upi based ride eshram sounds like great idea gig workers im impressed came switched cash payments long back drivers consistently complained payments credited fixed times instead immediately end day making taxi drivers run credit unacceptable company hold money made difference payment experience anyways use upi money leaves account immediately pay uber app faced cancellation ever since mean salaried employees wait whole ass month get paid drivers cant wait days youre wasting empathy different use case many drivers pay owner daily salaried employees pay cubicle use cost stationary utilities companies even provide transportation employees uber drivers pay pocket fuel maintenance cars make trips per day average easily add k per week usually business investing upfront payment recieved selling point complete sale get paid employees arent expected make upfront investment get compensated labour end month paycheck fair deal arent drivers switching en masse uber still customer trust especially people travel cities regularly like find safer get uber safer financial terms factors equally risky whether uber nonuber yep use wallet payments blusmart confirming drivers get money without hassle drivers paid gpay small step help make lives bit easier thats dumb didnt get choose cash upi app payments driver cancel lot upi based rides chose cash app pay driver using upi uttarakhand ubers row cancel accepted ride tried ask twice amount uber",
    "light_cleaned_title": "Uber India Introduces Instant Payments To Tackle Drivers' Cash Request Challenge",
    "light_cleaned_selftext": "I didn't know that online payments could be withdrawn only 4 times a week. No wonder cab drivers wouldn't accept rides with online payment.",
    "light_cleaned_comments": "Namma yatri raising the bar with instant zero commission payments. Yep, ride sharing apps allow cash outs after a few days, usually to combat bad actors. Idk how they will do that now though. I mean Uber didn't think of it twice. Where Gpay is ubiquitous, you ask the drivers to use your shitty deposit which you can only withdraw few times a week. Yup! I was surprised too! I came to know about this few weeks after moving to Hyderabad. Never again booked a UPI based ride. E-Shram sounds like such a great idea for gig workers. I’m impressed that they came up with this. I switched to cash only payments long back when drivers consistently complained that payments were credited at fixed times instead of immediately or by end of day. Making taxi drivers run on credit is unacceptable, while the company can hold the money. Made no difference in my payment experience as I anyways use UPI, so money leaves my account immediately if I pay through uber app. Have not faced cancellation ever since. I mean, salaried employees wait a whole ass month to get paid, drivers can't wait a few days?? You're wasting your empathy on them. Different use case. Many drivers have to pay their owner daily. Salaried employees do not have to pay for the cubicle they use, or the cost of stationary and other utilities. Some companies even provide transportation to their employees. Uber drivers have to pay from their own pocket for the fuel, and maintenance of their cars. If you make 10 trips per day on an average, that will easily add up to 4-5k per week. Usually, in business, where you are investing upfront, your payment is recieved at the selling point. Once you complete a sale, you get paid. Employees aren't expected to make upfront investment, they only get compensated for their labour. So, end of the month paycheck is a fair deal. Why aren't drivers switching over to this en masse? Uber still has customer trust. Especially people who travel to other cities regularly (like me), find it safer to get an uber (safer in financial terms, other factors are equally risky whether it is uber or non-uber). Yep same. I only use wallet payments for BluSmart after confirming with drivers that they get the money without any hassle. All other drivers are paid through GPay. Small step to help those who make our lives a bit easier. That’s dumb I didn't get you. Do you choose cash or UPI in app? How do you do payments to the driver? Do they cancel a lot of UPI based rides? Chose cash in app and pay to driver using UPI In Uttarakhand I had 4 Ubers in a row cancel an accepted ride and tried to ask for more than twice the amount that was on uber."
}