{
    "id": "12dhiuz",
    "title": "Suggest best sneakers/shoes around 3k for office and casual wear",
    "url": "https://www.reddit.com/r/india/comments/12dhiuz/suggest_best_sneakersshoes_around_3k_for_office/",
    "selftext": "Have to start going to office after around 3 years of WFH and shoes are mandatory for office. I am looking for casual sneakers which I can wear casually anywhere. I know the budget is bit low but I will stretch further if it is really worth it. I dont have much knowledge on shoes. Just want a good pair of sneakers that looks good in any occasion and last long. So need your suggestions. \n\nThinking to go for white sneakers. What do you say ?\n\nConsidering this : [https://www.flipkart.com/puma-up-sneakers-men/p/itm48743ab258254?pid=SHOFNU2WTYXQH4UE&lid=LSTSHOFNU2WTYXQH4UEFSHE76&marketplace=FLIPKART&sattr\\[\\]=color&sattr\\[\\]=size&st=color](https://www.flipkart.com/puma-up-sneakers-men/p/itm48743ab258254?pid=SHOFNU2WTYXQH4UE&lid=LSTSHOFNU2WTYXQH4UEFSHE76&marketplace=FLIPKART&sattr[]=color&sattr[]=size&st=color)",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 8,
    "created_utc": 1680781263.0,
    "convurl": "https://external-preview.redd.it/urKVWZDpHEavsfj4GfbVdWjurk7Dk5TZmgNFK54W8Zo.jpg?auto=webp&v=enabled&s=3a8a09a4150d3d18b4a297840cf9fd417adc1454",
    "comments": [
        "Look online for hush puppies leather sneakers.",
        "You can try Neeman's Solemax range.",
        "No they are not good i have one of those",
        "I've had [these](https://www.myntra.com/casual-shoes/hush-puppies/hush-puppies-men-textured-leather-slip-on-sneakers/20854440/buy) for a while now and are quite good.",
        "Neemans, Decathlon and even Addidas, you might even find some Skechers and Puma for cheap at places like ajio if you search well. \n\nAlso you had asked another question about the Minimalist PHA Toner on ISCA (went thru ur profile sry) I've been using it for 1 year or so and it's really good, you should defo try it out atleast.",
        "My manager wears the exact same thing but in brown"
    ],
    "cleaned_text": "suggest best sneakersshoes around k office casual wear start going office around years wfh shoes mandatory office looking casual sneakers wear casually anywhere know budget bit low stretch really worth dont much knowledge shoes want good pair sneakers looks good occasion last long need suggestions thinking go white sneakers say considering httpswwwflipkartcompumaupsneakersmenpitmabpidshofnuwtyxqhuelidlstshofnuwtyxqhuefshemarketplaceflipkartsattrcolorsattrsizestcolorhttpswwwflipkartcompumaupsneakersmenpitmabpidshofnuwtyxqhuelidlstshofnuwtyxqhuefshemarketplaceflipkartsattrcolorsattrsizestcolor ",
    "cleaned_title": "suggest best sneakersshoes around k office casual wear",
    "cleaned_selftext": "start going office around years wfh shoes mandatory office looking casual sneakers wear casually anywhere know budget bit low stretch really worth dont much knowledge shoes want good pair sneakers looks good occasion last long need suggestions thinking go white sneakers say considering httpswwwflipkartcompumaupsneakersmenpitmabpidshofnuwtyxqhuelidlstshofnuwtyxqhuefshemarketplaceflipkartsattrcolorsattrsizestcolorhttpswwwflipkartcompumaupsneakersmenpitmabpidshofnuwtyxqhuelidlstshofnuwtyxqhuefshemarketplaceflipkartsattrcolorsattrsizestcolor",
    "cleaned_comments": "look online hush puppies leather sneakers try neemans solemax range good one ive thesehttpswwwmyntracomcasualshoeshushpuppieshushpuppiesmentexturedleathersliponsneakersbuy quite good neemans decathlon even addidas might even find skechers puma cheap places like ajio search well also asked another question minimalist pha toner isca went thru ur profile sry ive using year really good defo try atleast manager wears exact thing brown",
    "light_cleaned_title": "Suggest best sneakers/shoes around 3k for office and casual wear",
    "light_cleaned_selftext": "Have to start going to office after around 3 years of WFH and shoes are mandatory for office. I am looking for casual sneakers which I can wear casually anywhere. I know the budget is bit low but I will stretch further if it is really worth it. I dont have much knowledge on shoes. Just want a good pair of sneakers that looks good in any occasion and last long. So need your suggestions. Thinking to go for white sneakers. What do you say ? Considering this : [https://www.flipkart.com/puma-up-sneakers-men/p/itm48743ab258254?pid=SHOFNU2WTYXQH4UE&lid=LSTSHOFNU2WTYXQH4UEFSHE76&marketplace=FLIPKART&sattr\\[\\]=color&sattr\\[\\]=size&st=color](https://www.flipkart.com/puma-up-sneakers-men/p/itm48743ab258254?pid=SHOFNU2WTYXQH4UE&lid=LSTSHOFNU2WTYXQH4UEFSHE76&marketplace=FLIPKART&sattr[]=color&sattr[]=size&st=color)",
    "light_cleaned_comments": "Look online for hush puppies leather sneakers. You can try Neeman's Solemax range. No they are not good i have one of those I've had [these](https://www.myntra.com/casual-shoes/hush-puppies/hush-puppies-men-textured-leather-slip-on-sneakers/20854440/buy) for a while now and are quite good. Neemans, Decathlon and even Addidas, you might even find some Skechers and Puma for cheap at places like ajio if you search well. Also you had asked another question about the Minimalist PHA Toner on ISCA (went thru ur profile sry) I've been using it for 1 year or so and it's really good, you should defo try it out atleast. My manager wears the exact same thing but in brown"
}