{
    "id": "12vbmzu",
    "title": "India Kukri Blade",
    "url": "https://www.reddit.com/gallery/12vbmzu",
    "selftext": "Can someone please tell me possibly how old this blade is and who possibly made it? How much it is worth?",
    "flair": "AskIndia",
    "score": 50,
    "num_comments": 15,
    "created_utc": 1682181792.0,
    "convurl": "https://i.redd.it/sq62d3flsgva1.jpg",
    "comments": [
        "This just reminded me of the Arushi Talwar murder.",
        "Great for killing Spies",
        "With a side of Jarate",
        "This isn't really a good place to ask for such nice advice OP. Why not try an antiques shop or something?",
        "Damnnn i was about to comment this.",
        "What is Jarate? And is there anything special about this one possibly a s of the markings significant enough to identify who made it?",
        "Khukri is quite easy to procure with multiple small scale manufacturers. \n\nThe markings might just be a design. \n\nThe age is similarly hard to determine, unless you take it to a metallurgist",
        "The Khukri and Jarate are the melee and secondary weapons that can be wielded by the playable character Sniper in the first person shooter Team Fortress(abbreviated as TF2) developed by VALVe software.\n\nThe Jarate is a mason jar filled with piss, which you can throw at yourself or others.\n\n[https://wiki.teamfortress.com/wiki/Jarate#:\\~:text=Jarate%20is%20frequently%20implied%20to,the%20April%20Fools%20sneak%20preview](https://wiki.teamfortress.com/wiki/Jarate#:~:text=Jarate%20is%20frequently%20implied%20to,the%20April%20Fools%20sneak%20preview).\n\nThis is useful for extinguishing you or your teammates if they are on fire. And it is used in conjunction with the Sniper's melee weapons with varying degrees of effectiveness. It can be thrown at your enemies to give you a damage boost in the form of mini crits or at invisible enemy Spies to expose them and reveal them.",
        "Khukri is a Lethal weapon used by Gorkha Rifles. \nThis reminds me the story of Maj Gen Ian Cardoza where he cut his injured leg with this khukri.",
        "its nepal kukri blade",
        "Nothing, even the khur is wrong here😅",
        "It's a crysknife, bless the maker!",
        "and his coming and going!"
    ],
    "cleaned_text": "india kukri blade someone please tell possibly old blade possibly made much worth ",
    "cleaned_title": "india kukri blade",
    "cleaned_selftext": "someone please tell possibly old blade possibly made much worth",
    "cleaned_comments": "reminded arushi talwar murder great killing spies side jarate isnt really good place ask nice advice op try antiques shop something damnnn comment jarate anything special one possibly markings significant enough identify made khukri quite easy procure multiple small scale manufacturers markings might design age similarly hard determine unless take metallurgist khukri jarate melee secondary weapons wielded playable character sniper first person shooter team fortressabbreviated tf developed valve software jarate mason jar filled piss throw others httpswikiteamfortresscomwikijaratetextjarateisfrequentlyimpliedtotheaprilfoolssneakpreviewhttpswikiteamfortresscomwikijaratetextjarateisfrequentlyimpliedtotheaprilfoolssneakpreview useful extinguishing teammates fire used conjunction snipers melee weapons varying degrees effectiveness thrown enemies give damage boost form mini crits invisible enemy spies expose reveal khukri lethal weapon used gorkha rifles reminds story maj gen ian cardoza cut injured leg khukri nepal kukri blade nothing even khur wrong crysknife bless maker coming going",
    "light_cleaned_title": "India Kukri Blade",
    "light_cleaned_selftext": "Can someone please tell me possibly how old this blade is and who possibly made it? How much it is worth?",
    "light_cleaned_comments": "This just reminded me of the Arushi Talwar murder. Great for killing Spies With a side of Jarate This isn't really a good place to ask for such nice advice OP. Why not try an antiques shop or something? Damnnn i was about to comment this. What is Jarate? And is there anything special about this one possibly a s of the markings significant enough to identify who made it? Khukri is quite easy to procure with multiple small scale manufacturers. The markings might just be a design. The age is similarly hard to determine, unless you take it to a metallurgist The Khukri and Jarate are the melee and secondary weapons that can be wielded by the playable character Sniper in the first person shooter Team Fortress(abbreviated as TF2) developed by VALVe software. The Jarate is a mason jar filled with piss, which you can throw at yourself or others. [https://wiki.teamfortress.com/wiki/Jarate#:\\~:text=Jarate%20is%20frequently%20implied%20to,the%20April%20Fools%20sneak%20preview](https://wiki.teamfortress.com/wiki/Jarate#:~:text=Jarate%20is%20frequently%20implied%20to,the%20April%20Fools%20sneak%20preview). This is useful for extinguishing you or your teammates if they are on fire. And it is used in conjunction with the Sniper's melee weapons with varying degrees of effectiveness. It can be thrown at your enemies to give you a damage boost in the form of mini crits or at invisible enemy Spies to expose them and reveal them. Khukri is a Lethal weapon used by Gorkha Rifles. This reminds me the story of Maj Gen Ian Cardoza where he cut his injured leg with this khukri. its nepal kukri blade Nothing, even the khur is wrong here😅 It's a crysknife, bless the maker! and his coming and going!"
}