{
    "id": "17jojuq",
    "title": "The Three Criminal Law Bills: Using Criminal Law to Establish Permanent Extra-Constitutional Emergency Powers",
    "url": "https://www.reddit.com/r/india/comments/17jojuq/the_three_criminal_law_bills_using_criminal_law/",
    "selftext": "An excellent summary of the changes to the law. This should worry everyone, regardless of political affiliation.\n\n  \nThe author clearly states that if implemented, future governments will have no desire to reverse these changes - so even if you feel like gloating about potential targets today, remember this is definitely going to come back to haunt everyone if the changes are passed.   \n",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698654025.0,
    "convurl": "https://external-preview.redd.it/QkNS8rTjSpRdgNdAi9gKJyN30Ax33smheAlu2aJFKlM.jpg?auto=webp&s=8939efd1b1df94822e8a56519d78f6fa6e4eeac2",
    "comments": [
        "Did you forget to post a link?",
        "Yup! Thanks :) not used to posting from my phone, so forgot to check!",
        "We're in a losing battle against the downfall of democracy right now.",
        "> BNS widens the net of terrorism and makes all acts that “intimidate the general public or a segment thereof” to be considered terrorist acts.  \n\nBy its own definition, the BNS is itself an act of terror.",
        "Made me laugh - but this is absolutely true!!",
        "Holy shit.......this will essentially make this a de facto authoritarian nation. Some of these changes are akin to what the Nazis and Soviets had.",
        "Guess this is one time our lesders learn from history, like the South Africans studied Jim Crow laws for apartheid planning :-/",
        "Shit this is pretty bad. I’m hoping most of these won’t pass through but when people ask me why am I okay voting for incompetent politicians, it’s because I’m terrified of the competent ones now.",
        "Don't forget the alternative that you think is \"incompetent\" has actually been painted that way using 100's of crores worth of sustained propaganda effort. It might be a good idea to step outside the Godi media ecosystem to get your news every once in a while.",
        "You’re 100% correct. However much we needed the change up, this the slippery future I was afraid of when this party was coming into power. Fuck man, they’re even messing with the country’s identity.\n\nIf this trend continues, any advances / development they’ve brought about is not going to be worth destroying the moral fabric of this entire country.",
        "so basically we can get arrested on the basis of reddit, the few real \"news\" channels will be detained under an act of terrorism... and any revolutionary activity (like protest for neet) would effectively make us \"desh-drohi\"?",
        "Seems like it!\n\n\nYour last sentence makes a lot of sense btw! It may explain why the government is not so a\nworried about paper leaks or infrastructure collapses. Since they called the original protests 'motivated protests', perhaps they're just waiting for  1st July to effectively act against anyone protesting for NEET transparency/scrapping or demanding probes into infrastructure failure!"
    ],
    "cleaned_text": "three criminal law bills using criminal law establish permanent extraconstitutional emergency powers excellent summary changes law worry everyone regardless political affiliation author clearly states implemented future governments desire reverse changes even feel like gloating potential targets today remember definitely going come back haunt everyone changes passed ",
    "cleaned_title": "three criminal law bills using criminal law establish permanent extraconstitutional emergency powers",
    "cleaned_selftext": "excellent summary changes law worry everyone regardless political affiliation author clearly states implemented future governments desire reverse changes even feel like gloating potential targets today remember definitely going come back haunt everyone changes passed",
    "cleaned_comments": "forget post link yup thanks used posting phone forgot check losing battle downfall democracy right bns widens net terrorism makes acts intimidate general public segment thereof considered terrorist acts definition bns act terror made laugh absolutely true holy shitthis essentially make de facto authoritarian nation changes akin nazis soviets guess one time lesders learn history like south africans studied jim crow laws apartheid planning shit pretty bad im hoping wont pass people ask okay voting incompetent politicians im terrified competent ones dont forget alternative think incompetent actually painted way using crores worth sustained propaganda effort might good idea step outside godi media ecosystem get news every youre correct however much needed change slippery future afraid party coming power fuck man theyre even messing countrys identity trend continues advances development theyve brought going worth destroying moral fabric entire country basically get arrested basis reddit real news channels detained act terrorism revolutionary activity like protest neet would effectively make us deshdrohi seems like last sentence makes lot sense btw may explain government worried paper leaks infrastructure collapses since called original protests motivated protests perhaps theyre waiting st july effectively act anyone protesting neet transparencyscrapping demanding probes infrastructure failure",
    "light_cleaned_title": "The Three Criminal Law Bills: Using Criminal Law to Establish Permanent Extra-Constitutional Emergency Powers",
    "light_cleaned_selftext": "An excellent summary of the changes to the law. This should worry everyone, regardless of political affiliation. The author clearly states that if implemented, future governments will have no desire to reverse these changes - so even if you feel like gloating about potential targets today, remember this is definitely going to come back to haunt everyone if the changes are passed.",
    "light_cleaned_comments": "Did you forget to post a link? Yup! Thanks :) not used to posting from my phone, so forgot to check! We're in a losing battle against the downfall of democracy right now. > BNS widens the net of terrorism and makes all acts that “intimidate the general public or a segment thereof” to be considered terrorist acts. By its own definition, the BNS is itself an act of terror. Made me laugh - but this is absolutely true!! Holy shit.......this will essentially make this a de facto authoritarian nation. Some of these changes are akin to what the Nazis and Soviets had. Guess this is one time our lesders learn from history, like the South Africans studied Jim Crow laws for apartheid planning :-/ Shit this is pretty bad. I’m hoping most of these won’t pass through but when people ask me why am I okay voting for incompetent politicians, it’s because I’m terrified of the competent ones now. Don't forget the alternative that you think is \"incompetent\" has actually been painted that way using 100's of crores worth of sustained propaganda effort. It might be a good idea to step outside the Godi media ecosystem to get your news every once in a while. You’re 100% correct. However much we needed the change up, this the slippery future I was afraid of when this party was coming into power. Fuck man, they’re even messing with the country’s identity. If this trend continues, any advances / development they’ve brought about is not going to be worth destroying the moral fabric of this entire country. so basically we can get arrested on the basis of reddit, the few real \"news\" channels will be detained under an act of terrorism... and any revolutionary activity (like protest for neet) would effectively make us \"desh-drohi\"? Seems like it! Your last sentence makes a lot of sense btw! It may explain why the government is not so a worried about paper leaks or infrastructure collapses. Since they called the original protests 'motivated protests', perhaps they're just waiting for 1st July to effectively act against anyone protesting for NEET transparency/scrapping or demanding probes into infrastructure failure!"
}