{
    "id": "xlq8ny",
    "title": "Avoid MSI Gaming Laptops",
    "url": "https://www.reddit.com/r/india/comments/xlq8ny/avoid_msi_gaming_laptops/",
    "selftext": "My GL63 laptop lasted only about 3 years of gentle use before the body (not the screen frame) cracked near one of the hinges. It was used with great care, never putting even any weight on it. I never even carried it out of the house yet.\n\nWhat sold me was the apparent high count of heat pipes, as I wanted maximum cores for music production. I spent considerable time researching and tuning my setup for low latency audio.\n\nSeeing how tight the hinges were from the first day, I used to open and close it very slowly each time. I guess I never thought that the frame could not handle those tight hinges.\n\nYet one day, I heard a sound when closing the laptop lid. When I checked I saw that the body frame near the hinge has split a little, and a part of the body had cracked(pics at the end of this post)\n\nThe MSI forum has a few posts about this specific issue, yet I haven't seen this in the Amazon reviews. I know now to be more thorough in checking forums prior to purchase.\n\nThere was no concern from their support about the build quality of a supposed performance product. Their response has been generic, to just go to their service center and that it will be charged as out of warranty. Can a cracked body frame even be repaired properly?\n\nI personally found their support ridiculous, and I would even go to consumer court but I don't know what an individual complaint can do in this regard.\n\nI will do my part though in posting forums everywhere and letting people know the risk of buying MSI. It is just such a poor design, yet they have not rectified it. Either the hinges need to be loosened or the frame needs to be a lot stronger.\n\nI'll do better research before buying my next laptop. Maybe a metal body laptop would not crack on its own like this?\n\nAt the moment I am wondering whether I am better off going to a non-MSI shop for repair perhaps using plastic weld. Even if MSI can replace the broken part (or all of the frame), the replacement may be just as bad or worse than the original.\n\n&amp;#x200B;\n\nPS - I wanted to mark the post as a \"Suggestion/Alert\" flair, but there isn't one\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6x60rkdd3kp91.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=63fb5ced81007bd4c6f1e132d02c6e56baed75f3\n\nhttps://preview.redd.it/u50uendd3kp91.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=5b17f9ed81636e025d9f366ec13ecb98cd8094c7",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1663916483,
    "convurl": "https://a.thumbs.redditmedia.com/STkbsi6gMEx9fJM4dscgA7mX4qlUl_E5enKyxiBopu0.jpg",
    "comments": [
        "Post this in r/gaming and see if you get a better response.",
        "Gaming laptops are scam.",
        "Overall build quality of many products have fallen.\n\nThings have become more affordable, but they don't last as long as they used to.",
        "thanks for the suggestion",
        "https://en.m.wikipedia.org/wiki/Planned_obsolescence",
        "Desktop version of /u/precioustimer's link: &lt;https://en.wikipedia.org/wiki/Planned_obsolescence&gt;\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&amp;message=OptOut&amp;subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)",
        "In the past I used to think about selling off my older devices and musical instruments, but now I'm hanging onto them very dearly."
    ],
    "cleaned_text": "avoid msi gaming laptops gl laptop lasted years gentle use body screen frame cracked near one hinges used great care never putting even weight never even carried house yet sold apparent high count heat pipes wanted maximum cores music production spent considerable time researching tuning setup low latency audio seeing tight hinges first day used open close slowly time guess never thought frame could handle tight hinges yet one day heard sound closing laptop lid checked saw body frame near hinge split little part body crackedpics end post msi forum posts specific issue yet havent seen amazon reviews know thorough checking forums prior purchase concern support build quality supposed performance product response generic go service center charged warranty cracked body frame even repaired properly personally found support ridiculous would even go consumer court dont know individual complaint regard part though posting forums everywhere letting people know risk buying msi poor design yet rectified either hinges need loosened frame needs lot stronger ill better research buying next laptop maybe metal body laptop would crack like moment wondering whether better going nonmsi shop repair perhaps using plastic weld even msi replace broken part frame replacement may bad worse original ampxb ps wanted mark post suggestionalert flair isnt one ampxb ",
    "cleaned_title": "avoid msi gaming laptops",
    "cleaned_selftext": "gl laptop lasted years gentle use body screen frame cracked near one hinges used great care never putting even weight never even carried house yet sold apparent high count heat pipes wanted maximum cores music production spent considerable time researching tuning setup low latency audio seeing tight hinges first day used open close slowly time guess never thought frame could handle tight hinges yet one day heard sound closing laptop lid checked saw body frame near hinge split little part body crackedpics end post msi forum posts specific issue yet havent seen amazon reviews know thorough checking forums prior purchase concern support build quality supposed performance product response generic go service center charged warranty cracked body frame even repaired properly personally found support ridiculous would even go consumer court dont know individual complaint regard part though posting forums everywhere letting people know risk buying msi poor design yet rectified either hinges need loosened frame needs lot stronger ill better research buying next laptop maybe metal body laptop would crack like moment wondering whether better going nonmsi shop repair perhaps using plastic weld even msi replace broken part frame replacement may bad worse original ampxb ps wanted mark post suggestionalert flair isnt one ampxb",
    "cleaned_comments": "post rgaming see get better response gaming laptops scam overall build quality many products fallen things become affordable dont last long used thanks suggestion desktop version uprecioustimers link lthttpsenwikipediaorgwikiplannedobsolescencegt opt outhttpsredditcommessagecomposetowikimobilelinkbotampmessageoptoutampsubjectoptout beep boop downvote delete past used think selling older devices musical instruments im hanging onto dearly",
    "light_cleaned_title": "Avoid MSI Gaming Laptops",
    "light_cleaned_selftext": "My GL63 laptop lasted only about 3 years of gentle use before the body (not the screen frame) cracked near one of the hinges. It was used with great care, never putting even any weight on it. I never even carried it out of the house yet. What sold me was the apparent high count of heat pipes, as I wanted maximum cores for music production. I spent considerable time researching and tuning my setup for low latency audio. Seeing how tight the hinges were from the first day, I used to open and close it very slowly each time. I guess I never thought that the frame could not handle those tight hinges. Yet one day, I heard a sound when closing the laptop lid. When I checked I saw that the body frame near the hinge has split a little, and a part of the body had cracked(pics at the end of this post) The MSI forum has a few posts about this specific issue, yet I haven't seen this in the Amazon reviews. I know now to be more thorough in checking forums prior to purchase. There was no concern from their support about the build quality of a supposed performance product. Their response has been generic, to just go to their service center and that it will be charged as out of warranty. Can a cracked body frame even be repaired properly? I personally found their support ridiculous, and I would even go to consumer court but I don't know what an individual complaint can do in this regard. I will do my part though in posting forums everywhere and letting people know the risk of buying MSI. It is just such a poor design, yet they have not rectified it. Either the hinges need to be loosened or the frame needs to be a lot stronger. I'll do better research before buying my next laptop. Maybe a metal body laptop would not crack on its own like this? At the moment I am wondering whether I am better off going to a non-MSI shop for repair perhaps using plastic weld. Even if MSI can replace the broken part (or all of the frame), the replacement may be just as bad or worse than the original.  PS - I wanted to mark the post as a \"Suggestion/Alert\" flair, but there isn't one",
    "light_cleaned_comments": "Post this in r/gaming and see if you get a better response. Gaming laptops are scam. Overall build quality of many products have fallen. Things have become more affordable, but they don't last as long as they used to. thanks for the suggestion Desktop version of /u/precioustimer's link: &lt;https://en.wikipedia.org/wiki/Planned_obsolescence&gt; --- ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&amp;message=OptOut&amp;subject=OptOut)^(]) ^(Beep Boop. Downvote to delete) In the past I used to think about selling off my older devices and musical instruments, but now I'm hanging onto them very dearly."
}