{
    "id": "1dzsdmc",
    "title": "Worst treadmill company 2021 awards winner \"Lifelong\"",
    "url": "https://www.reddit.com/r/india/comments/1dzsdmc/worst_treadmill_company_2021_awards_winner/",
    "selftext": "I bought Lifelong LLTM 162 treadmill from flipkart on 17/02/2023 through flipkart worth Rs 13,000 and was working fine for about one and a half year and then stopped working.So i called lifelong support and they arranged technician visit to look at the same treadmill with visit charges of about 620 Rs which i agreed to pay.\n\nAfter visiting the technician declared that the motor is dead which in simple words can we say is the \"heart\" of the treadmill after the technician left i saw the motor and to my horror the motor is of 0.75 HP instead of claimed 2 HP in specifications on flipkart and the motor replacement charges is a freaking 10,000 Rs while the treadmill itself is of 13,000.\n\nSo i went a little bit deeper and came to know that there exists a similar company in china(which is orginal) which makes the treadmill and lifelong is just a cheap knockoff.\n\nSo always buy a reputed treadmill even though it is slightly expensive.\n\nI am leaving the link here just in case :\n\nhttps://www.flipkart.com/lifelong-lltm162-fit-pro-2-hp-peak-dc-motorized-treadmill/p/itm443778144f93f?q=lltm+162&qH=f1512d10e91042ba\n\nhttps://www.lifelongindiaonline.com/",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1720607240.0,
    "convurl": "https://external-preview.redd.it/dvR_ELsRqGugx-OKJsqF8vOMmXtMTRng7mCicg0DXOQ.jpg?auto=webp&s=406918ee08815f53aa1bfa98f4a1e5965d1691cb",
    "comments": [
        "Dushyant from Sarabhai vs Sarabhai is this you?",
        "Goto consumer court bro"
    ],
    "cleaned_text": "worst treadmill company awards winner lifelong bought lifelong lltm treadmill flipkart flipkart worth rs working fine one half year stopped workingso called lifelong support arranged technician visit look treadmill visit charges rs agreed pay visiting technician declared motor dead simple words say heart treadmill technician left saw motor horror motor hp instead claimed hp specifications flipkart motor replacement charges freaking rs treadmill went little bit deeper came know exists similar company chinawhich orginal makes treadmill lifelong cheap knockoff always buy reputed treadmill even though slightly expensive leaving link case ",
    "cleaned_title": "worst treadmill company awards winner lifelong",
    "cleaned_selftext": "bought lifelong lltm treadmill flipkart flipkart worth rs working fine one half year stopped workingso called lifelong support arranged technician visit look treadmill visit charges rs agreed pay visiting technician declared motor dead simple words say heart treadmill technician left saw motor horror motor hp instead claimed hp specifications flipkart motor replacement charges freaking rs treadmill went little bit deeper came know exists similar company chinawhich orginal makes treadmill lifelong cheap knockoff always buy reputed treadmill even though slightly expensive leaving link case",
    "cleaned_comments": "dushyant sarabhai vs sarabhai goto consumer court bro",
    "light_cleaned_title": "Worst treadmill company 2021 awards winner \"Lifelong\"",
    "light_cleaned_selftext": "I bought Lifelong LLTM 162 treadmill from flipkart on 17/02/2023 through flipkart worth Rs 13,000 and was working fine for about one and a half year and then stopped working.So i called lifelong support and they arranged technician visit to look at the same treadmill with visit charges of about 620 Rs which i agreed to pay. After visiting the technician declared that the motor is dead which in simple words can we say is the \"heart\" of the treadmill after the technician left i saw the motor and to my horror the motor is of 0.75 HP instead of claimed 2 HP in specifications on flipkart and the motor replacement charges is a freaking 10,000 Rs while the treadmill itself is of 13,000. So i went a little bit deeper and came to know that there exists a similar company in china(which is orginal) which makes the treadmill and lifelong is just a cheap knockoff. So always buy a reputed treadmill even though it is slightly expensive. I am leaving the link here just in case :",
    "light_cleaned_comments": "Dushyant from Sarabhai vs Sarabhai is this you? Goto consumer court bro"
}