{
    "id": "13oshp6",
    "title": "Hi r/India, This is Anuv Jain here, I'm a singer songwriter who tries to tell stories through his music! I'm here to answer your questions so.. SHOOT.. Ask me anything!",
    "url": "https://www.reddit.com/r/india/comments/13oshp6/hi_rindia_this_is_anuv_jain_here_im_a_singer/",
    "selftext": "EDIT : Hey guys! This has been so much fun! I'll keep answering questions whenever I can. Just gonna have dinner now heh x\n\nhttps://preview.redd.it/kith1scv7e1b1.jpg?width=1200&format=pjpg&auto=webp&v=enabled&s=473da91b0d56e5a84aea6ee569dee76e870d5e3d",
    "flair": "AskIndia",
    "score": 1817,
    "num_comments": 987,
    "created_utc": 1684765722.0,
    "convurl": "https://a.thumbs.redditmedia.com/JcmgxK5dZ_u5_IGLru-qp6lRWn9sm1GuxsDxme-C9j4.jpg",
    "comments": [
        "how did you get the inspiration for your song lyrics? was it based off your past relationships or something? your lyrics are absolutely beautiful and keep doing what you do we love it ❤️",
        "Is your music in SoundCloud",
        "When will u perform in Delhi next?",
        "Do you listen to rap music??\nWho are your favourite rap artist,indian(not allowed to say yashraj) and international",
        "will you make a part 2 for Gul, really want the broken house to be fixed",
        "Have you really been through so many relationship issues in life or are these stories just a culmination of various situations you have come across as a third party? \n\nAlso do you think you would've been able to write such deep songs if not for these experiences/situations?",
        "I came to Mumbai last September at AAM, met Aayushman, unfortunately didn't send my demos to him back then although he asked me to (would be solid if you told him another kid like you wants to send him music). Learnt a lot about the music industry at the conference. Went home, made some music. Been documenting my journey on videos since then. Came back this Jan, enrolled in a music institute, I'm currently recording my music. I don't know how to get shows and my songs are going to release by the end of this year, what steps should I be taking next as an independent artist to make sure I get the outreach for my music?",
        "How does negative feedback make you feel about your music?",
        "How do you go about choosing an artwork for your song covers?",
        "Hey anuv , loved your new song . \nWhat are some challenges you faced while navigating in the music industry?",
        "where do you get your inspirations for the songs ?",
        "Will you ever consider doing a meet and greet with your fans?",
        "Your favourite subreddits?",
        "If you could collaborate with one artist only who would it be?",
        "i am sorry that jindal was not the perfect audience but trust me you had an impact on people who genuinely loved your music. I would love to hear your side. How was jindal for you",
        "Hey, there Anuv! Appreciate the beautiful songs you make ❤\n\nIt intrigues me how well your songs are written, it'd be great if you share the thought process you go through while having it as an idea till you put it in words in the end.",
        "When you first started, what was your main driving force?",
        "How different is Anuv Jain in real life from his music?",
        "Hey anuv, love the new single!! <3\nAntriksh is quite different to your previous songs, what made you want to switch it up this time and are we gonna see more songs like antriksh in the future?",
        "What does it feel like to be the spokesperson of the indie artists community of India lol?",
        "Top 3 animes?",
        "Shadi karlo merese pwease",
        "Do you listen to any sort of rappers such as Juice WRLD or XXXTentacion? if yes, what do you think about thier music and potential if they had not gone too soon",
        "Hi Anuv!\n\nWho/What serves the main inspiration for the composition of the melodies for your songs?",
        "Hahah I would love to! But maybe an acoustic version first?",
        "Hello Anuv, wanted to aks what are your favourite songs? Both your personal songs and any other Bollywood song. Also love your music!!  P.S:- My favourite songs are Baarishein and Mishri",
        "I had kept that Antariksh of feelings in me for 2 years for someone very very special to me but when I confessed I was heartbroken, how did you handle your heartbreak? (I suppose you experienced one too)",
        "Any artists or bands which inspired you into making indie music?",
        "Hey just wanna say one thing\n\n toote makan tutne k baad or ache se banaye jaaskte hain phirse",
        "would love to hear it🙌",
        "You mentioned that your songs contain Easter eggs and personal stories. Could you share another example of a hidden story or personal experience behind one of your songs?",
        "When are you collabing with zaeden??",
        "Howd you start with singing? And when did you feel you wanted to be a singer?",
        "Yo, great to get a chance to interact with you man. I’m an indie singer-songwriter from Hyderabad and recently came across your music - which I really loved! (Especially Alag Asmaan)\n\nI’ve been releasing music for a bit and I’m shooting my shot here but would absolutely love your opinion and general insight on an upcoming song. Would it be possible to get in touch w you about this?\n\nWould definitely understand if that wouldn’t be possible too. Hope you have a lovely AMA either way. Cheers :)",
        "When are you coming to canada? I really wanna see you perform live",
        "Any plans on Baarishein 2.0?",
        "Were you socially anxious and introvert in college? How did you deal with it? (Going through it rn)",
        "  How do you mentally prepare yourself for live gigs, considering your background as a shy person? Are there any rituals or routines you follow?",
        "What was your inspiration for GUL",
        "Bhai love your songs kasoor, cold/mess, tum jab pass. Kaise likh lete ho itna accha?",
        "Your performances are known for their stripped-down, intimate style. Do you think you might explore adding more elements or instruments in the future, or do you prefer to keep it simple and focus on the lyrics?",
        "It gets a bit heavy sometimes. Doubts do creep in but I try to all the constructive criticism positively and ignore the unnecessary feedback. Its tough but we're getting there hah",
        "Will there be a part 2 of Antariksh?",
        "Are you single?👀❤️",
        "Hey, attended your concert in December and the experience was honestly what \"sukoon\" feels like.\nI absolutely love how you explain the meaning behind every song before performing it.\n\nMy question for you is- Are you open to releasing a full album someday? Is it something in the works rn?",
        "What’s your dream outcome in 5 years? More music releases, more collabs, new genres of songs, Bollywood, Hollywood?",
        "You always say that all of your songs are based on your real life experiences from the past. What is ANTARIKSH based on? What's the back story? Spill the Tea Anuv. 😂",
        "what car do you own? + do you watch any sport?",
        "Hey not much I just want you to know that you are really great at what you do. And I just have a request for you to please sing Guzara in your next love session! Hope you come to Kolkata soon! And yeah antariksh is a fast flowing song with literally one of the most simple and beautiful lyrics!! 🪞",
        "How did your parents (and family) react to your career choice?",
        "It always has to tell a story! That's always the number 1 thing. Then me and the team, we pick the best art style that goes w the concept",
        "How did you first get into writing music? What inspired you?\nThank you for sharing your music with us, you bring your listeners so much peace!💗🌸",
        "How would you describe your music?",
        "u/anuvjain cold/mess part-2 when",
        "Are you writing more songs? Also when will next release?",
        "Can you explain in brief what your writing process is like? Your lyrics are phenomenal ❤️",
        "What is your basic itinerary for writing a song?",
        "Are you a secret redditor? 👀",
        "Inspiration while writing the songs!?",
        "bhai collab with yoyo honey singh",
        "Hey, thank you for making such songs <3\nThe only thing which i held onto when everything was going downhill in the life .\n\nI wanna ask , been waiting for so long for a delhi concert, i still regret that i missed the one \nWith the 17000+ delhi crowd singing along with you .\nThen you were gonna perform at our college fest (VIPS) , and i was so much happy on that news , but unfortunately as you already know , you couldn't.\n\nWhen are you gonna come to delhi ? (TT)",
        "When are you gonna come to UAE for concert?",
        "Can I have your black hoodie? :⁠^⁠)",
        "You can really be your biggest enemy! Us creatives always over think! But as you spend more time in the industry you start to trust yourself and take quicker decisions",
        "Hey anuv, how would you describe yourself in 6 words or less?",
        "When is the extended version of Riha releasing?",
        "What do you think about the shift towards electronic music over orchestrated music. Have you heard of c418? How do you find his music",
        "Heyyy anuv!\nWhen are you planning to perform in Delhi again ?",
        "Hey anuv , I'm a little Sitara in your universe\nJust wanna ask one thing  har gana itna zyada relatable kaise likh lete ho. I'm your dead heart fan . Love you so much keep making this kind of music . Tata.",
        "I always meet \"people who listen to my music\" after shows. It's physically impossible for me to meet everyone! I really wish I could but I try to see as many people as possible <3",
        "i wanted to ask about mishri since its my fav.. you said it was made out of a word bank that you made for riha but did mishri have like a back story just like all of your other songs do.. i couldn't really find you sharing any back story about it..💭",
        "Do you have any rituals or routines that you follow to get into the creative mindset when working on new music?",
        "I'd love to hear you sing in different languages. Do you have plans for it?",
        "Who was ur inspiration to get into singing - songwriting ?? And ...\n\nwhat kind of MUSIC do u like to listen to ( except ur own genre ) ??\n\nu/anuvjain",
        "is there plans for an album anytime soon?",
        "Gul has a very Jack Johnson / Joseph Arthur type vibe to it but maybe that's just me. Which international artists have most influenced your music?",
        "We know the new song is based how one couldn't gather their courage to actually confess to their crush, so that happened with you ? , Do you still regret that or look back and think it's actually good that you couldn't confess then .",
        "Hello there Anuv! Fan of your songs ♥️\nQ- If you had the chance to collaborate with a fellow singer, who would it be and why? Also what's your take on Prateek Kuhad?",
        "Everywhere honestly! Especially from all the humans around me haha! My stories w them, their stories, all of it",
        "How do you maintain a balance between artistic integrity and catering to the expectations of your audience?",
        "Probably asked already - what was your inspiration for alag aasman?",
        "Just wanted the say I love alag asmaan and the song's the reason I started playing ukulele.  \n\n I've watched you playing the song many times but couldn't figure what you exactly do between f c and c7 to create that beautiful melody. Can you explain what do you exactly do...?",
        "Jindal was amazing! I had the best time. I don't regret any of the shows that I've done. Have always made the most amazing memories and meet the nicest people :DDDD",
        "Is there anytime gonna be a meetup (TT) , where we all could just talk with you.",
        "Hello anuv i have been following you on youtube since 7 or 8 years i just wanted to say your music has healed me alot its like my lowkey therapy whenever i m down your music cheers me up like nothing else i just wanted to say never stop making it 🥺❤️",
        "i wanted to ask about mishri since its my fav.. you said it was made out of a word bank that you made for riha but did mishri have like a back story just like all of your other songs do.. i couldn't really find you sharing any back story about it..💭\n\npls answerrr, I've had this in my mind for the longest time now ahahahaha,🤞",
        "Just wanted to ask how are you doing? Also are you overwhelmed by the response on ANTARIKSH. It's so different yet so beautiful 🥹🤌",
        "Will you ever work for any bollywood films / series as playback singer?",
        "When are you coming to Chennai! Eagerly waiting for you",
        "What made you to go about designing this song in a rap style?",
        "Hello Anuv . I'm a huge fan of Mazaak. I just love the wonderful lyrics you've put for the song and the video.\n\nI saw you performance live at Zomaland recently and was mesmerized.  My friend Pranay who's a HUGE HUGE HUGE HUGE fan OF YOURS missed the chance of saying hi to you (your car speeded up). Can you please say Hi to him here (he'll probably die on seeing  this)",
        "Have you ever been heartbroken ,?",
        "hey anuv, I’m a big fan! During my first heartbreak I listened to baarishein on loop 15 times lol.\n\nI’d love to see you live, when will you be performing in Mumbai next? Also when can we expect an album?\n\nLoved the gq cover btw",
        "i love your music and it’s so close to my heart. thank you for that <3\n\ni’m an artist and it’s been a dream to make your album cover art someday. is there a way?",
        "Nahi dega",
        "u/anuvjain",
        "How was the experience at dpsk concert?",
        "Bro you hear to divine's music?",
        "what time of the day do you write your music the most in?",
        "Thank you for baarishien. That's all",
        "Which was the best City to perform in India?\nAnd which countries do you want to travel to perform?",
        "This is such a bitchy thing to say 🥱",
        "Could we expect some Collabs happening in the near future?",
        "Yeah sounds fair... I've manifested that I'm gonna meet you one day!🤞🏻😬❤️",
        "When would Anuv hold another concert in Mumbai?? Eagerly waiting for it and loved your Antariksh 🤍💌💗✨",
        "Did u see a spike in your sex life last year",
        "where do you find the inspiration to write such immensely beautiful love songs, does love like that even exist? are you writing songs on a whim?",
        "What's your biggest influencer that clicks you to produce smth new?",
        "When are you coming to hyd again. 🥹",
        "How are you so clear with what word would make the perfect song title.? say ANTARIKSH as it comes only one time in the song. Btw, I loved the music video and the concept behind the song. Wasn't expecting this from Anuv jain. It totally blew my mind !!",
        "When will \"Jo tum mere ho\" will be releasing??... Please telll.",
        "That's very true! I totally believe that but that line is not a stand alone lyric. It's a part of the larger body and that's the entire song. It'll make sense in that context. But I work w optimism and I know things can be fixed until they just aren't possible to be fixed further :,)",
        "Independent vs signed who earns more According to you",
        "Would u ever release your own merch?",
        "That ARIA reference from MAZAAK mv was crazyyyyyyy so thoughtful🫡🪄",
        "Collab with Arman malik?",
        "Hey Anuv, First of all, A HUGE fan of your music and really love your songs.\n\nI have 2 Questions:\n\n1. Who were your main sources of inspiration when you just had started songwriting and what are some things in your mind while you write any of your songs?\n2. At what age did you start your music journey?",
        "Would love to work w ZAEDEN! He's like a brother and I honestly feel that we can make something brilliant! x",
        "How is Anuv jain , in reality ? \nHow will you define yourself , \nExpect from how we assume you through songs and the socials ,",
        "What new instruments do you hope to incorporate in your music?",
        "How do you feel about your songs potentially being featured in films?",
        "Hello Anuv, I am a big fan of your works, Especially Riha man, I am super proud of you, I just want to know, that\nplease please please can we have an album? 💗\nWe would love to listen to your album already\nC'mon everyone loves you x",
        "Antariksh is different from that of your normal genre and style.. was it just an experiment? What was the thought process? I mean it's a goood song, but, the style in your earlier songs is much prettier.. lots of love Anuv",
        "the new music had a very unique vibe! Do have any thought on keeping the same tone ? and have you any thoughts of putting out an EP or Mixtape soon ?",
        "what do u think about the masterpiece that is PPAP by pikotaro",
        "You love cookies right?",
        "Have you ever faced challenges or have been forced to make music for Bollywood? \n\nHeard that it's not kind to indie artists and hoping that you keep proving them wrong every damn time!!!",
        "it always based on part relationships and experiences! All of it. Some sad, some happy. Also, thank you. That really means the world :D",
        "Some of it is :)",
        "my beloved my baby boy my everything you tear me apart & yet i love u anuv 😭❤",
        "Anuv jain \nKarle tu gain\nKhana khale dabhake \nAur hoja bechain\n\nNangi si aatma ko mat de itna dosh\nBas kar mere bhai aayushman ko karna roast\nKarta hu Dil se Dil Tak ki bat\nJab tak represent hai mere sath\n🫣",
        "Who you? I honestly have no clue.",
        "I love mishri, gul, barishen, riha, all your songs tbh. thank you for being you.",
        "Hey man, I really appreciate ur music, u r doing great job, when are y dropping ur  next songs ?",
        "How many relationships you had in your past and are you in one rn?",
        "I wanna know too if he watch animes !!",
        "Hopefully soon! Delhi crowd is amazing and I always feel at home there",
        "time to take over reddit now😈🫶🏻",
        "Antariksh is “out of the world (antariksh)”. Looping on it!!\n\nGul remains closest to my heart. \nI feel it expresses how my ex-girlfriend grew over our breakup and liberated from the toxicity that the relationship gave her. \n\nI like it for her! :)",
        "Hello Anuv , So In your latest release Antariksh, Did you tried rapping coz it sounded very good on that beat. Will you make more rap type/fast paced songs like these often in future? Do you like it being called a Rap Song?",
        "You don't like Antariksh being called a rap right??",
        "What keeps you grounded?",
        "May I ask what is your inspiration behind those lyrics??  Because it looks like something you have experienced deeply in the past. How can this guy get his heart broken. He literally dedicated the whole space to that one person. Aarghh ! I am jealous.",
        "The new song and the lines 😭 it’s too beautiful",
        "Are you an AI",
        "When are you cominggg toooo jaipurrrrrrrrrrrr",
        "The song antariksh is love",
        "Do you use ASMR in your music?",
        "Have you heard JoJo’s Bizarre adventure theme?",
        "If you could collab with an international artist, who would you pick?",
        "Hi Anuv, Mishri holds a very special place in my heart, and always will. I imagine it's akin to asking a parent about their favourite child, but which of your own songs do you hold closest?",
        "Bruh that's mad! 7 years is a very long time. Thank you so much for sticking around. I really hope that you've enjoyed the journey so far",
        "Hey anuv, aspiring singer/songwriter here....could you please give me some tips for how do you chose a chord progression for particular song and how do you decide the scale?  \n   \nmuch love to you<3",
        "सालों से सड़कों पे सँभल के चल रहा था यूँ\nगालों के गड्ढों में तेरे\nना जाने क्यूँ मैं लड़खड़ा के गिर गया हूँ\n\nमुस्कुराओ, और ऐसे हँसो मेरी बातों पे\nगिरता रहूँ तेरी राहों में, और इनमें ही खो जाऊँगा\n\nए चाँद, अब चाँदनी बनके गिरो ज़रा\nगिरते रहो मेरे आस-पास, तो तेरा ही हो जाऊँगा\n\nThese are easily some of the most heartwarming and loving lyrics I've heard in any song. How do you write your songs? Do you have any sort of help in formation of your lyrics and is it just a literal translation of your source feelings into words? \n\nu/anuvjain",
        "How did youuuu writeee it i mean i know the lyrics meaning but the song whole what was the idea behind it sorryyyy missed the live",
        "Would you pls make an album of your songs acoustic versions... Especially antariksh. I love it.",
        "Do all the lyrics of the songs come from your personal experience?",
        "what inspired you to write antariksh?",
        "Just come to Jaipur plsssss!!",
        "When you were really young, was there a moment that made you realize you could be a musician growing up?",
        "how and when did you decide that you wanted to be a musician",
        "When can we expect Guzara and jo tum mere ho? :)",
        "This ones a bit personal. I wrote both Mishri and Riha for my mom and dad. I lost my father a few years ago and wanted to write something from my mom to him. That's where the songs come from. Mishri is the \"WIP\" song and Riha is the final song",
        "Your songwriting process please.\nAlso come to Goa!!!",
        "Do you compose on your instrument directly or first on paper. Do you use any software for the same and how do you see composition made digitally?",
        "Omgggggggggg how are youuuuuuu",
        "Anuvvvvvv please replyyyyyy just hi or anything it means the world to me trust me",
        "Hey, You are like the only celebrity (yes sir i will call you a celeb) jiske peeche i have fan girl-ed the most. YOU are a GEM, love your songs ans I hope to meet yo someday, till then I will keep sending you cute messages on insta",
        "OH MY GOD YOUR VOICE, YOUR SONGS, YOUR GIGGLES, YOUR LOVE SESH. oh. Ohhhh eyes widen hand on mouth giggling etc etc",
        "We've all heard that Spotify takes more than a fair share of royalties. Is that true or are you happy it exists so that more people can discover your music?",
        "Please please make delhi happen soon 🥺!!",
        "when are you doing a tour again?",
        "ye bhi mazaak hi toh hai \n\n>!saalo se sadko pe sambhal kar chal rha tha !<",
        "apologies",
        "What is the new song about? I missed the live :(((((",
        "your songs are embodiment of a home like fr",
        "when did you decide that you want to be a singer? Did you experience oppose from your parents or people around?",
        "What inspired you to pursue a career in singing?\n\nHow do you prepare yourself mentally and physically before a performance?",
        "Your New song Antariksh has been such a jam loving it, your music have evolved a lot man. \n\nStay strong brother.",
        "Is it true that \"tootey makaan\" is a 9/11 reference",
        "I really am! I think I'm perpetually overwhelmed. This life seems unreal. The support seems unreal. Feels like a movie tbh! Antariksh is a very important song for me. Like you said its so different! I wanted to see how people take it. I think it's been great so far",
        "Just want to say you're music is amazing \n\nAlso, your voice is beautiful",
        "When was the last time you were heartbroken and how did you come out of it ?",
        "Would love to if the right opportunity presents itself!",
        "I found ki Antariksh ka BG got similar vibes as Riha. Was it some coincidence, or is it just me having a delusion?\n\nAlso, as an indie artist, what are some of the best things you can experience which maybe other artists don't?",
        "Heyy anuv!! Me and my gf really want to know when's your next concert in Bangalore? 🥺",
        "About your latest single 'Antariksh' It's literally my current situation... i want to dedicate that song to her and also wanna sing it to her but I'm afraid about how she will react afterward... will she accept my feelings or will she decline..",
        "Hi Anuv, i absolutely love your music! Thank you for writing songs. MAZAAK and ANTARIKSH are on loop on my playlist. Love you so much <33. Do you plan on having a show in Delhi anytime soon?",
        "Areeee youuu even there anymore",
        "I've actually had the melody in my head for about 4 years now haha! I just felt that I had the guts to execute it now. Simple hah",
        "Sir ji gaane famous hone ke baad kaisa feel hota hai?",
        "HIIIIIIIII PRANAYYYYYYYYYYYYYY",
        "Boobs or ass💀",
        "Autograph ke liye kya karna padega? SO ko gift karna hai.",
        "I have a friend who's a big fan of you has literally helped her through dark times. She just wanted you to know that.",
        "My friends call you Anuv Pain",
        "💀💀💀",
        "Dear nuv, Thank you for writing gul and antariksh. They are the best songs and have helped me through my hardest times. Are you coming to Chandigarh soon?\n\nhttps://preview.redd.it/yf6xcdvztf1b1.jpeg?width=1440&format=pjpg&auto=webp&v=enabled&s=38453c789ec2b1f76b7f1ca841a9e4e0ff5a47a9\n\nbtw you remember this?",
        "That GQ cover has made my entire family so proud! Its such a big honour and I don't take it lightly. Also, soon hopefully. Mumbai is my second home and its always amazing to perform here. I'm just waiting to finish a few more songs and I'll go on tour hopefully",
        "What do u think about bharat chauhan's music? Love ya both",
        "ahh, I'm sorry about it.. but thank you so much for answering.. I'm glad we have someone like you who's words help us speak feelings and emotions which we could never otherwise <3",
        "Who is your favourite independent artist writing wise? In India and also all over the globe?",
        "Okay I have actually know you and your music for almost 2.5 years now and honestly for a lot of people  baarishein is the song that got them hooked to you but I just want you to know that for me Alag Aasmaan is like THE SONG! You literally have no idea how you reassure and support so many people out here man!! Like I feel so blessed that I know an artist like you and that I found your music because deep down that's the thing that makes me actually live!! Thank you so much for doing what you do and for existing dude!! I hope to meet you someday and tell you how I feel about you in a hug!!<3 \nUntil then I am having conversations with you in the Antariksh of my mindಥ⁠‿⁠ಥ",
        "I heard so much abt you but never heard any song of yours so where should freshers should start ?",
        "Bro pls just make part 2 for gul🥹",
        "Afternoons. I love it when the sun hits. I feel a lot more inspired in daylight for some reason.",
        "I really love your magazine cover era",
        "When are you coming back to Goa?",
        "Hey first of all just wanna say that your songs have helped through so so much and I'm just so grateful for your music, I love you :)\n\nAnd seeing how much you love Dubai, why not do a show here or some small fan meetup pleaseee?",
        "How does it feel to be to be an influence in so many people's life when they say that they've healed because of your art? And how do you deal with so muchh of attention and expectations?\n\n\nAnd Much Love To You<3 You are An Amazing Human Being your songs have been my therapy for the last 2 years now and My Girlfriend as well she's a HUGE fan of yours<3",
        "Thank you for listening to it. That's all ❤️",
        "What is your go to process for writing a song? Like chords structure first or lyrics or tune first?",
        "What’s your opinion on western rappers? Do you listen to any of them",
        "Which has been your favorite experience in this industry?",
        "Hey man, I just want to say you're good. I didn't like you that much and trolling made the fire brighter but nah. You're good. You're amazing keep shining! Hopefully I get to see you live! Stay blessed! :)",
        "Just realised this must sound creepy.. not my intention I swear lmao",
        "Can you please make more English music? I loved Ocean and it was part of an important time in my life\n\n Unfortunately, I don't speak Hindi so I miss out on your other stuff.",
        "i dont think im getting a reply but i j want you to know that i love you so much. your songs heal me ❤ take care!!!",
        "heya anuv, nothing to ask for now but to just thank you for existing.. I'm glad we have someone like you who's words help us speak feelings and emotions which we could never otherwise <3\n. \nall the love amd success for you in future. 🍀",
        "did you always know you'd be a singer?",
        "Hey Anuv. Antriksh is giving different vibes. Just loving it. Will wait to listen to you in this kind of song. 🤍\n\nNothing to ask just need a tip about how will I express to her about my feelings? Hoping for a reply to make my day happy. Need blessings and hugs. ❤️🙈",
        "I swear all cities offer something different. I'm not even being diplomatic. It's hard picking a few. Talking about countries, I'm really looking forward to go to Bangladesh (I have a show there). Also, UK will be amaze too!",
        "Honestly I always felt that this actually might be a thing. Happy to know I was right :)\nHope and hugs to you Anuv❤️",
        "How to treat people",
        "HI ANUV JAIN!!!!!!!  BIG FAN OF YOURS!!!! just wanna ask how are you and who is your role model???",
        "Will you come back to Northeast again? If yes, then when😭?",
        "That's actually such an interesting question hah. I'm not sure ya. It happens very naturally. I just sit with my guitar and words just come to me sometimes",
        "Are you planning on releasing an album anytime soon? Although I do believe that a stunning album can be made out of your existing songs too hehe!",
        "Hey Anuv, your favorite artists who inspires you?",
        "Soon hopefully otherwise my mom will murder me! She loves that song haha",
        "I think signed artists right now but we'll hopefully get there someday",
        "What the poet wanted to refer is that once a relationship is broken it can’t be rebuild like before.",
        "Sir in love with ur songs wanna ask the inspiration behind the magical melody alag aasman especially fr that ending prose\n\n\"Khali ghar tera yeh chabiyon ki gunj aise tujhe dara rhi tu darna nhi main hu yahi par\"",
        "HAINA?????????????????",
        "Are you planning to drop some more songs on the ukulele like Alag Aasmaan and OCEAN? Also congratulations on 1 million subs on YouTube",
        "Hi Anuv! Big Fan! Congratulations on the success of Antariksh. \n\n(Check your Insta DMs)🥹",
        "Hey Anuv! \n\nDo you plan to expand into genres which you haven't yet breached into? Like, something more rock oriented, or maybe a bit funky tunes?",
        "How did you end up doing this AMA? 🤣",
        "I guess it's the title Antariksh that is actually making the views and plays go with the speed of a rocket man!🚀\nI am too good at bad jokes :,)",
        "A collaboration between you and armaan malik is needed",
        "ANUVVVVVV MY MOST FAV SONG OF YOURS IS ALAG AASMAN!!!!!!! TELL ME WHATS UR FAV SONG ?????",
        "If Google is right, you're from Ludhiana.\nSo are you planning on singing in punjabi?",
        "HELLLOOOO ANUVVVV",
        "Do you smoke? (Just a random ques)",
        "Mahn my friend uploaded a remix of Gul on Instagram, do check it out tho it got 67k views\nIG: @sidhvora",
        "I have made a bunch of songs but not getting much of views should i invest on ads or music video which is a better option according to u \n\nLink - https://youtu.be/Mkqg_ezAvcY\nGive ur valueable review if u have tym to do \nThanku so much for the reply.",
        "HAA YAARR!!!!!!!",
        "I'm a pretty chill guy man. I am very passionate about a few things like football and tennis and I follow both sports religiously. I get lazy sometimes. I have the same set friends that I had in school. I like to think that I'm the funny guy of my group but friends will refute that claim. I'm a little spoilt coz my sister and mom both treat me like a kid. I love people fully. I try to be a good person. I eat a lot of Nutella and watch a lot anime!",
        "😭❤️you replied",
        "Hey is your favourite football team Manchester United??",
        "I'll cry. That'll be so huge for me and my family",
        "Please come to Bengaluru and perform!",
        "When are we getting aur tum mere ho song",
        "Did you found yet ke ... Toote maka ek baar girte to waise bante kaha hai ?",
        "As artists we all want to move out of our comfort zone and try new things. I guess we just want to prove ourselves that we can pull off the abnormal. I will get to my usual style of music. But I'll also experiment once a while. You know have a good balance.",
        "Hey.......did you have a good voice since childhood?....if not how did you improve your voice to be so soft...can you recommend anything for sm1 who likes to sing but people close their ears when they sing :(",
        "Are you planning on coming to Ahmedabad this year? Or Mumbai?",
        "More than musician you are a story teller and you are damn good in it, keep on sharing stick to ground because thats where the stories come from.\n\nDid any of your ex came back after listening to you before you got fame.\n\nThanks for good stuff man, there is a time when i just listen to you and its therapeutic.",
        "You’ve impacted my life immensely. I followed you from your first songs, introduced all my friends to you!!! Your songs have supported me through the worst of times the times I had no one by my side. So just wanted to thank you. Is there any way I can get in touch with you more personally? Also can we get Anuv jain merch anytime soon?",
        "hiiiii I'm listening to since 2020 and honestly I love your songs soo sooo sooo muchhhh waiting for your concert in gorakhpur and release of \"Jo tum mere ho\" i don't even know if you're going to read this or not but you've helped me so much during my exams so much as stress buster 😭😭😭😭😭🌙",
        "Since you've performed in a lot of concerts till now, are there any favourites for you? \nAnd how different is the experience for you when you perform in colleges or unis compared to a normal concert?",
        "Ofcs ik the context and I hv said above abt the same context of relationship",
        "Do you have any training in classical music?",
        "I have loved and loved each and every song of yours and will always love whatever you make in the future❤️❤️❤️",
        "\nYou know whats on the menu? Me \"n\" u (menu rizz)\nAre u hello kitty? cus i want u to say hello to my kitty (hello kitty girl rizz) can i take u a picture because i want to show santa what i want for x-mas (x-mas rizz)\nAre u a guitar be when I grab your neck I listen to the noises u make when I play w u (musician rizz)\nAre u a bus cus I wanna fill u with annoying kids (school rizz)\nAre u curry cos without you i would js cry (currymucher rizz)\nAre you an alien cause you outta this world (alienoligist rizz)\nI must be a baker and you must be dough bc I knead you (baker rizz)\nare you Hennessy? cuz ur the only Hen i see (uno reverse rizz)\nI can't have kids, so will you be my baby?\n(Adoption rizz)\nAre u the toy aisles cuz no matter my age id still go look at u (toy rizz)\nAre you my head? Course i would smash you against a wall (I need therapy rizz)\nAre you a football player ?cs I want you too touchdown on me (football rizz)\nAre you my bed?Cuz I can't stop thinking about you (Sleepy rizz)",
        "sir big fan",
        "I really don't feel like that. I just try to do my own thing and learn more",
        "How do you feel about your songs being used in memes or stuff like that? Do you think it's good as the song and you are getting more reach?",
        "HUNTER X HUNTER\n\nJJK\n\nVINLAND SAGA",
        "Why always a story?",
        "What would you name a pet turtle?",
        "What is that key thing you realized that made you a better lyricist and songwriter overall?",
        "Bro just quit music",
        "Alright sir/ma’am.",
        "Do you 🍃🚬 before writing/composing your songs?",
        "First off love you songs. \n\nJust curious as an artist myself, how does your creative process go? Like integrating storytelling with music is cool and was curious how you started out with it and what your process currently looks like. \n\nAnd any tips for beginners are also welcome.",
        "Bhai aapke makaan tute hi kyu the?",
        "I can't thank you enough for writing songs. I really appreciate what you do, lockdown would have been so miserable if Spotify hadn't recommended your songs. Truly therapeutic they are. Thank you so much !! Lot's of love and success to you. \n\nWill you be my friend???? (Lol)",
        "What are your future plans? Will we get any another song like Alag Aasmaan?",
        "Did you go to uni? If you did, then what did you study there?",
        "That's great. It's bound to happen.. (Also please release Riha extended with \"Jo tum mere Ho\".. with the OG \"..kya chahta hai\" set of lyrics as wel.. Riha is just something else.. )",
        "I've always been socially anxious. I've never felt too comfortable around people and I always think too much. Conversations often feel unnatural but I'm getting better. I've experienced so much over the last couple of years. Gives me a lot of cool things to talk about hah",
        "When you shoot the video for Antariksh for example, are you actually signing while filming or is the audio added after? Whats the process like to come up with the music video?",
        "Hey! Anuv firstly loves your new song. There is a question from my side about how things were when you shifted from your family business to music(as you said) and you even completed your collage so your love of music didn't become a conflict with you and everything and secondly you write amazing lyrics like a poetry has lot of meanings which is great so what make you write in that context only (inspiration?)?\nThankyou 😊",
        "Can you tell us about any interesting or unexpected experiences you've had while performing or touring? also im a big fan of yours",
        "I discovered your music in late December and have kept listening to them on repeat ever since. Your voice is magical! I wonder what you think before writing such deep and complicated lyrics. Is just one of your ways of expressing your own feelings and emotions in a lyrical manner or do you base the lyrics upon insipirations from daily life?",
        "Heartbreak is very tricky! I wish I could answer it but I was never able to take it to gracefully. We're all human and these things do affect us. I think I just wrote songs about it and felt better",
        "Hey, I'm a big fan of yours! Heartiest congratulations on Antariksh, it is just amazing💕. I really can't stop playing it on loop. \n\nWhat has been the best performance of your career so far?\n\nI hope to meet you someday, lots of love to you!",
        "TLT! 100%",
        "Your favourite football club and your favourite player?",
        "When are you coming to the US? Any plans? Please give me as many details as you can haha!",
        "Biggest biggest fan. You and your songs are a big part of my life. It started many things, i survived many things because of it and your songs are my therapy. Thankyou so much for putting out talent because for some of us you are a safe space and home.❤️❤️❤️",
        "Bro itna dard kaha se Latey ho....🙃",
        "Do you feel the pressure of being relevant!?",
        "What are your views on memes (both wholesome and offensive) being made on your songs ?",
        "I love your music so much it helps me relax my mind whenever I'm stressed and just makes me feel like home. I have been following you since 2019 and i am so happy to see where you have reached now ☺️ more love to you !!! 🤍🤍",
        "I love your music so much it helps me relax my mind whenever I'm stressed and just makes me feel like home. I have been following you since 2019 and i am so happy to see where you have reached now ☺️ more love to you !!! 🤍🤍",
        "What are your views on memes (both wholesome and offensive) being made on your songs ?",
        "ipl mein kisko support karte ho?",
        "How did you build up in your career? Any tips? Im a music producer",
        "Anuv, big fan of yours! Attended your 2 concerts, mugged up your every songs by heart, Gul, Baarishein, Riha, Mishri, MBMT, Maula, Alag Aasmaan. Just need your Hi!",
        "An acoustic version, yes! I'll try doing it at 200 million streams + views across al platforms. We are close! I better get to work hahah",
        "Have you seen \"Toote Makan\" memes? And what's your opinion about it?",
        "My mom was the happiest! She is the most supportive parent. She believes in her kids and always backs us",
        "What inspired you to be a singer?",
        "Favourite anime? And what are u currently watching\n\nEdit: saw u already answered this. In that case, please share some tips for becoming a better songwriter",
        "Are you ever going to release RIHA's extended version??????😭😭",
        "Hey! When can we expect your next concert in Bangalore?",
        "Kyu aaye nhi, Jinke the vaade??😭😭",
        "will you ever try other genre music ?",
        "My music is filled w Easter eggs! It's full of real memories. In my song 'ocean' I talk about a \"tree\". I actually did sit upon a tree on my first date with the person I wrote that song for. My song Mazaak is literally a walking Easter egg. the word Andaaz is me geotagging a location. Let's see if you can figure it out? haha",
        "Hi,What/Who is your inspiration to make music?",
        "Wohoooo!!! I hope it reaches 1 billion too soon some day! Can’t waitttt!🥹✨🤍",
        "Anuv bhai ganne ke lyrics ki inspiration kaha se lete ho",
        "Sir huge respect for you.\n\nHow to be consistent, Get over artist block?\n\nStay motivated to goal when things aren't working??",
        "Yes I do remember this hahah! Also, that photo isn't the most flattering but chalega I seem happy",
        "Are you planning to do any tours here in the EU?",
        "When is your next song coming!?? I really love your voice and my god \"GUL \" And \" Barrishein \" And \" Alag asaman\" Are my favourite, is your next song like them??",
        "Please don't tell me friends? They'll use this for the rest of my life",
        "Are you going to perform Jo Tum Mere Ho and Guzara in Dhaka, Bangladesh?",
        "My latest flatmate, Armaan Gohil, swears by your songs. He misses his home and cannot help but gravitate towards your lyrics and your melody. The day your song Antariksh was released, he had knocked on my door to listen to it together. I hope your muse blesses you to make people cry (very good for health) and soothe their spirits with even more beautiful songs.",
        "Can you make a song about a girl woh make you happy i know its hard but please mhuu",
        "I'm here I'm here. My fingers are hurting from the excessive typing. But I'm trying to respond to everyone before the time runs up",
        "You said in an interview that you were a very camera-shy person. After filming the Antariksh mv, how did you overcome, or deal with camera-shyness?",
        "I'm very happy! Who wouldn't want their music to be heard by everyone. It does come with it's problems and stresses tho. I'm trying to learn how deal w it.",
        "Hear Alag Aasmaan first",
        "For some reason your voice calms me especially RIHA😩  I really do listen your songs when Im low like even once when I got a anxiety attack! Lmao I always wanted to tell you this I DMed on instagram😂\n\nTell me something special you feel about RIHA",
        "Hey anuv, im a huge fan of yours but have never been able to attend a concert because i live in dubai.\nWhen can we expect a concert in dubai?",
        "What's your favourite Pokemon?",
        "Hi Anuv\n\nHeard you singing live at Vh1 supersonic. You were amazing as always❤️\n\nWhen GUL came out, I could relate to it so much. It is and will always remain one of my favorites. \n\n\nOnly love and love for you🤗",
        "Damn so you're not a sad boy generally? Why make us go through this Pain bhai...",
        "What's your favourite set of headphones",
        "This line reminds more of a meme rather than the original song 😂",
        "My cousin played your song on the radio the other day. I tried to change the song to a song I liked but he went bonkers. xD",
        "If I'm not wrong, you're a united fan, right? Has being a red devil over the kast decade impacted your music? I mean, it's pretty tough being optimistic. Love your songs. \n\n-a fellow red devil(hopefully I'm not wrong else it's embarrassing xD)",
        "when and how you found out that music is your calling , actually asking for myself only been stuck in the same position",
        "Hey Anuv , any chance of you collaborating with foreign artists?",
        "My gf introduced me to your music… and now your music is all that left 😔",
        "What else do you do apart from music?? Like education and stuff. Kya banna chahte singer banne ke alawa??",
        "Penis size?",
        "For the love of God pls pls pls 🙏🙏🙏 make Mishri Part 2",
        "I love your song alag aasmaan acoustic version. I associate it with my first intense crush. Idk if intense crush is a thing lol\n\n<3",
        "Based.",
        "your songs are overrated af, not sure why! please don't feel bad about it.",
        "Bhai big fan here. Bhai tujhe dekh ke regret hota hai ki singer kyu nahi bana. Sahi sahi bataio ek hafte mei kitni bandia propose karti hai ? :P",
        "How is everything going?",
        "Hey! Big fan here. Since most of my questions already seems to be answered in the comments. I had one question from my side. Heard that you are a software engineer? How's your corporate life and how do you handle it?",
        "Bro please suggest a song to impress my gf !!!!\nShe remains mad at me",
        "Hi Anuv, when are you next performing and will there be any concerts in gurgaon/delhi ?",
        "Will you release any new songs this year?  Alag Aasmaan and baarishein two songs are my most favorite (specially Alag Aasmaan).  I want another song like Alag Aasmaan that has ukulele in it.",
        "You might not even find my message in this 'ocean' of messages , but all i gotta say is that i love you and your songs so damn much!! Every song has a special place in my heart ❤️😭 I have been a fan since 2019 and oh my god, i am so glad to having found your music, you are a gem Anuv, i so look frwd to hearing you live this year as I turn 18!!!",
        "just wanted to say that I've been following your music for 6y now and the journey has been INSANE!! I also remember being a part of the online concert(unfortunately the only concert I got to experience) you had during lockdown and you explaining the lyrics and playing the music was amazing. Your songs genuinely heal and it's always been so therapeutic listening to you and I'm so glad I came across your music aha!! Would love to see you play irl sometime! <3 (Which brings me to, would you be coming to Vadodara again? I found out you'd performed in a med school there and I'd like see you if you come again aaa!!) \nSending you so much love!! And insanely proud of all of the growth! 💗",
        "Bruhhhh very generic comments that i love ur music\n\n\nBut could you plzzzzzzzzzzzzzzzzzzzz read some of my poetry????",
        "Ache se muh khol kr pronounce kyu nhi krte",
        "kya apne aliens dekhe hai ?? song likhte time aliens ke bare me socha hai ?? kya makaan ko aliens ne todha tha ?? unke wade kab ayenge ?? toote maakan waise kyu nahi bante hai ??",
        "Hey anuv. Hope you are fine and doing well. A fan of yours since barishen some 7-8 years back. \nWhat is your fav instrument apart from guitar",
        "bro choose to speak faxx",
        "When will you have a proper show in ahmedabad?",
        "how did you learn to play the guitar",
        "Do u have specific music preferences? like a specific key or smth?",
        "Please hold a concert in Pune again.",
        "How did your musical journey start?",
        "Anuv bhai Mumbai mai 'Baarishen' kavao yaar..",
        "Who is your favorite footballer",
        "When Hyderabad tour next?",
        "Sir reply kardo, ladiz log ko flex karna hai ❤",
        "What's your creative process like? Do you have any tips for aspiring artists?",
        "are your songs from real life experiences?",
        "Toote Makan song Yogi Ji se inspired hoke likha tha kya?",
        "What do you do to clear your head when going through a creative slump?",
        "Do you love me?",
        "Kya aap thande thande paani se nahate ho",
        "Hey, Anuv! Been listening to your music ever since I first heard 'Ocean' about 3-4 years back.\n\nMy question to you is: Is there any difference in your creative process when you write a song with English lyrics?",
        "Kitna kma lete ho?",
        "Those are rookie numbers. You gotta pump those numbers.",
        "We need you in your MUSIC VIDEOS pleaseeeeee !!!!",
        "Lmfao",
        "Hey Anuv,\n\nI am extremely grateful for your music. Gul has been a journey for me. It beautifully captured my emotions and touched the strings of my heart ever since I heard it last year. It's the only song that makes me cry whenever I listen to it (so much so that i only listen to it when I'm alone and cry like a baby :P). Thank you for creating this magic ✨️",
        "Who are your favourite artists?",
        "I heard one of your songs last year (Mazaak) and it was the day I met this beautiful woman, and she is now my girlfriend.. every time I see her, it is always magical and I end up recalling the lyric: \n\nGirta rahoon teri rahon mein\nAur in mein hee kho jaunga\n\n\nJust on the end note, thank you for giving us such amazing songs and hope you win more in life ✨",
        "Damn bro respect",
        "How would you advise someone who wants to sing like you do? \n\nLike my register goes pretty high but it doesn't have the weight in it. On the other hand when you sing in head voice you manage to make it sound breathy and not nasally. You have such a unique voice. \n\nPls give some tips to us plebs",
        "hii anuv, just wanted to say that i never really liked your music until i fell in love with my boyfriend, \n\nalso, i gotta ask, would you date a person that's not politically and culturally compatible with you?",
        "Aww man you're actually taking the time to respond to as many people as you can...you're awesome :')",
        "I've always related to your songs and surprisingly me and my  bf relate to your song Alag Asmaan ( mostly because we are in long distance relationship) what was your inspiration or what motivated you to write that song and if you would suggest one thing to couples in ldr what would you suggest?",
        "HEY ANUV!! just wanted to tell u that your music was there with me throughout my breakup phase. I bet it doesn't mean much to you, but it helped me aloot! I made a private playlist , they was on repeat for so so long! Now I've completely healed, and the fact that you're doing this now, is just giving me an opportunity to express how proud I am of you! hope you can get through all the hate and hardships of this world with ease, because as a budding artist u deserve all the love one can offer you :)) loads of love! my name is shreya and thank you for everythinggg. also love your hairstyle and skin, it's perfect, do u have a skincare routine? or just use an 8-1 shampoo😭",
        "Noooooo way this is the real ANUV Jain I ll cryyyy istg",
        "Dude, I have heard Alag Aasma on loop so many times, that I have lost count. Thanks for a song that gives me a new hope everytime.",
        "So you are a weeb? No wonder itna rr krte ho gaano me /s",
        "Don't mind me, I'm just here to fangirl",
        "hey anuv. no questions, just wanted to convey that ur songs are amazing and whenever i feel down, i just listen to baarishein, the song gives me feels like no other! hope u keep composing amazing songs. lots of love. alsoo please please please organize a concert in bangalore i would love to attend it!!!!!",
        "Hii Anuv, I never really got a chance to see you live. It would really mean the world to me if you say hi.",
        "Dont need to ask anything as your music does that quite well already. Big fan, thanks for your music!",
        "I don't think you're here anymore and there are way too many comments xD. But your music is frickin amazing. I belong to the covid batch of school so our 11,12th were online. Met my best friend through your songs tbh. Other than that we hosted meets for questions solving and we played \"alag aasman\" on repeat. After that she went off to kota, and again your songs helped me to deal with the absence haha. It always reminds me of her and the good times we've had. You had a plan in my city, sadly we had preboards and shit. I wish I had attended though. Any plans of coming back to lko? Also, tons of love and appreciation dude. I frickin love your music.",
        "What is the procedure to date you... 🤔 so that I can have a live streaming of you🤩 your songs I mean😋",
        "I just wanted to say your song 'Alag Aasman' is one of my all time favourites. It's also one of the first songs that I learnt to play on my Uke. Thank you so much for creating it and thank you for spreading positivity through your talent!",
        "hey anuv mene randomly barishein suna tha and i was like kesa h sun leta hu and after that i was hooked and it had some 59k views on it and now t its crossing millions haha also bhai “ jo tum mere ho” kab release karre ho antariksh kardiya pehle😭😭😭💔💔💔",
        "You are the best I’ve found over the last few months. Thanks for existing 🫶🏻🥺",
        "Hey anuv! first of all i love you and your music so so much . My question is there's this pattern like you leave clues in your song for the next album/song like in mazaak that \"aria\" part and which is used in this album and there like hints we see and i find it so brilliant . how do you get such ideas?",
        "I'm trying to write some songs and it is good also but after some days my mood got changed and I think it's good but not that (but it is) can you give me some tips to concentrate on your own experience.",
        "Hi Anuv. I've listened to few of your songs and they're really soothing to listen. I'm kinda interested in singing but I feel that my voice is really deep and I don't seem to make the most out of it. How can I improve the way I sing if you have any sort of suggestions which are applicable. Would really appreciate your suggestions. Thanks! ☺️",
        "Big fan of yours listening your music about 2 hours it help me in my bad times and story's in your comment are different vibe keep making music love you man big fan",
        "Which is your favourite song? ( not by you)",
        "omg i just wanna say ANTARIKSH IS AWESOME",
        "Just wanna ask two things\nFirst: what's your opinion on the rap scene in india, your favourite one and would u like a Collab?\n\nSecond: what gives you the inspiration/story to write lyrics and how do you find it? Is it an unexpected procedure or deep analysis?",
        "Hey Anuv, first of all, your work is amazing, man! All your songs can be listened to on a loop. I want to ask, which indie artist work has impressed you the most in the recent years?",
        "Hey Anuv, Just want to tell you I love your work and all the best for the future. Keep growing :)",
        "Hostel me loop me gaane chalata tha aapke \nEspecially alag aasman \nRoom me log gana poonchne aate the",
        "How do you feel about the parodies being made on your songs ?",
        "Hey Anuv, I happened to discover you on YouTube Music. Your first song I heard was Gul, and it's a song very dear to my heart as I relate to it very intimately. Often I take my car out for late night drive and this is the only song that plays on a loop. I want to say thank you to you for being part of my life and wish you all the success in the world. You are an extremely talented musician with a soulful voice. I hope you also make your songs available on Amazon prime.",
        "What's your favourite football club?",
        "Will you make more songs like alag aasman? Its my favourite.",
        "Anuv love yr songs alag aasman and mishri i hear them every night with my gf\n\nI wanna know what u think b4 u make those songs",
        "Ocean was the first song I had heard by you when you had uploaded it on youtube. Have been listening to you since then. It has been like maybe 6 years or something. There are certain lines that I absolutely love in your songs. Like that wooden beamed, south facing house painted pink, green and tangerine lives rent free in my mind.",
        "What is your opinion of deceasing quality of mainstream music lyrics?",
        "favourite football club? country? top 5 players? Top 3 managers?",
        "Who are your musical inspirations?(And inspirations in general)",
        "Bhai toote makaan jud Gaye kya? \nIf yes then mere kab judenge ?",
        "HI! Anuv bhaiya.... I've been following you for a few years....the best part about your songs is that they are inspired from your real life experiences....my favourite songs are Maula and Mishri.....My question to you is\"what is the story behind Antriksh?\"........love your work....you music is absolutely beautiful....you inspired me to get in the field of music....now I am a small artist myself...Lots of love ❤️😌",
        "How do you feel about expressing or bringing to life your own personal experiences through your songs? Each of your songs describes a different mood of yours and how you communicate with your audience, do you feel your songs turn out as you want to and your songs are the only way of making the audience understand a deeper part of you that wants to tell something?",
        "Anuv please watch demon slayer😩❤️",
        "toote makaan op",
        "If I compose a song for you will you sing it?as all your songs are connected to each other some way or the other",
        "Love your music dear ! Keep it coming ! 👏👏👍",
        "I got to know u like anime is it true ? 😭\n\nAnd thx for making songs like GUL .. listening to ur songs really make me feel releifed ..it's just so good man 😭.",
        "Now that your latest single is out, would you organize and perform concerts soon?\n\nPLSSSSS COME TO KOLKATA, IM DYING TO SEE YOU PERFORM <3",
        "I have a lot of respect for you and I really love your work. \n\nIs Gul based on your life experience?",
        "Have you seen that “how to make anuv Jain song in 2 mins?” Pretty hillar",
        "Hiii anuv .  Thanks for your beautiful songs. .  And Love you.",
        "Bhayy Do u Eat Kanda?",
        "\"Tut te makaan\" ye line sun rakhi hai bass aaj tak aapke koi gaane ni sune aur isi baat ka mujhe ghamand hai:)",
        "Hey so basically long story short. when alag aasman was released I was head over heels for someone. It became our song. Turned out to be my first heartbreak too. But honestly according to my Spotify stats, the day me and her had our first date, I listened to that song 68 TIMES!!!!! \n\nGod heavenly.",
        "lol choosing reddit was his first mistake",
        "Hey anuv, all of your singles are super soothing and the recent one is a very unique style which you delivered in a very unique way, I personally liked it a lot. No questions from my end, just a request that Can we get a cute music Video for your all time best song \"Baarishien\" ?",
        "Do you like the  trend of slowed and reverb songs?",
        "you are the most demanding among grils",
        "Hello Bhai. When are u coming to Bhopal?",
        "It really is very tricky. Hopefully I find something to make me feel better. ;)",
        "ME and YOU have the same birthday, i went insane this year when i found out my most fav indian artist was born on the same day as i was ToT",
        "“Riha” by you was how I came to know about you. Loved the song and your voice. This was in 2019. The song still hits me in the feels whenever I listen to it.",
        "Kaun hai Bhai Tu? Never heard of you?",
        "No question... Just want to send you love.. and best wishes for your next music.\n\n I love your rendition in 'alag aasman' and 'ocean'. I used to sing them a lot to my ex...  \nI also love \"Baarishein\".\n\nReally love that you give chords of your songs.. very helpful..",
        "Do you watch anime?? If yes then which is your favourite one?",
        "What would you prefer: acoustic or electric. Also how many guitars do you own?",
        "Hi bro, love your songs !",
        "wdyt pehle murgi aayi ya anda?",
        "Hi, I recently discovered you via your song Gul, and have been completely bowled over by its music and lyrics. It made me listen to your other songs and also other indie singer songs. \nI am in my 30's and it almost brought the nostalgic memories of my teens and 20's of finding fresh music and falling in love with it. Thank you.",
        "Are you a fuckboi?? Sry 🤣",
        "Bhai ek do you ticket dedo next show ki (in Hyderabad ) ladki pat jayegi bhai jaan. Be a good-wingman pls😭🤞",
        "Fellow JJK fan respect",
        "any advice for an aspiring musician in india?",
        "Have you listened to Japanese artist because some artist have alot of similar vibes as you it's in the genre of city pop, i would suggest from city pop anri, miki mitsuba, but as modern artist from there eve, ado, kenshi yonezu are amazing",
        "Bas ek gaana accha laga",
        "Man what a coincidence! listening mishri rn.",
        "omg a tennis fan, i hope you're gearing up for Roland Garros!! who's your fav ?",
        "Hi Anuv, I just wanted you to know that your music is therapy. There have been so many days when I just didn't feel good, and I've put Mishri and just listened to every word you sang. Your words are magic. Please come to Kerala soon, there's a lot of Anuv Jain fans there who are waiting for you. I've always wanted to attend one of your concerts but everytime something goes wrong and I'm unable to attend. Someday, hopefully. Thank you for your words and your music, which heal so many people.",
        "I have been following you for 5+ years now. \nI attended your concert with my boyfriend, but we are separated now. \nSince then, whenever I listen to your songs, it gives me a bittersweet feeling which is hard to put in words :\")",
        "not a big fan but one of your fans.. love ur song.. feels soothing in a way",
        "Your favourite song ?",
        "Who is your favourite lyricist? Also loved alag asman. Changed my life.",
        "What inspires you to write songs that tell stories?",
        "How do you write such deep lyrics",
        "If you happen to visit Lucknow, I'll bring you a Nutella cake!! \nSo please save this comment and contact me when you do! \nI own a cloud bakery",
        "do you ever feel low cuz of the memes on insta and everywhere else?\n\nbtw love your music",
        "Of all the places for this, you chose this post? \n\nWhy? Is it nice to be a twat?",
        "I did heard some of your song before they got popular\nI really love the way you sing \n\nLots of love ✨",
        "Your voice is great and songs are good, but hard to remember.. \nYou gotta make few songs with simple lyrics and easy to sing along chorus..\nYou'll get a larger audience then",
        "bro doesn't know what dahej is",
        "just give the link in comments if you are lucky he will listen",
        "How was your experience as a student at NMIMS? Did it influence your music in any way?",
        "Konse demolition company ke PR ho ?",
        "Ass or tits?!, idk just and AMA paramparaa😂",
        "Hi Anuv, just wanted to let you know that I loved Antariksh very much. You are amazing.",
        "How many songs of yours are never released compared to the ones which are\n\nLike what would be a rough ratio ?",
        "Hey Anuv,\nBig fan. I really regret getting introduced to your songs really late. \nYour songs have the feels man. Especially in the situation I am in, it feels it’s written just for me. \nBtw, are these songs written for someone? I mean what’s inspiration or motivation behind the songs?",
        "Apart from your voice/music, the storytelling in the song is something I really like, poetry, basic but so effective. I keep your songs in my happy place playlist due to this.   \n\n\nWill you keep your releases like this in future too with guitar/acoustic vibe or experiment with some snappy beats in between like say, how dhruv does in moonlight ?",
        "Woooooahhhhhhh 💀❤️",
        "Weirdly specific question but I’m surprised he had an answer for that. Is fav time of the day to write a thing among artists 😳",
        "Bhai toote makan kaise jode? Mai Abdullah bol rha hu uttar pradesh se.",
        "Hey anuv, just wanna say I really love your music",
        "I attended your concert here in Jaipur in JK Lakshmipati....and dude you were amazing....your voice , your stories , your smile , everything was beautiful.",
        "I love your songs!!~~ also do you listen to old songs? I want to hear you sing \n\n“Jab koi baat bigad jaye, jab koi mushkil pad jaye” jk lol\nbut i too want to sing, for like myself but my voice is pathetic whenever I do so.. is it something I can work upon or i just need to cope w it?",
        "Hey Anuv, just letting you know, your music is GODLY. Your voice is SO SOOTHING I LOVE IT. I have listened to all of your music. It just so good. Some make me tear up . Keep doing what you doing. You are AMAZING. Loads of LOVE.",
        "Anuv, maybe try to diversify? Sometimes your music sounds like CAS, all the same. Hope you can keep your core but maybe elevate the experience a bit why integrating different aspects, like how Agam does.",
        "Hi Anuv, I am a big fan of yours. I am going through a little hard time in life right now ur music has helped me alot. I just wanted to ask that what inspired you to write the song GUL? P.S. LOVE YOU♥️♥️",
        "Anuvvv, mazaak mazaak mein, Mazaak ke wajhe se, I found the loml <3 :”)",
        "If u going to reply to this than bro you songs are good and i want to know that how do u come up with your lyrics?? ... I have listened to Gul and that is one amazing song  and i hope you will make more mesmerizing songs in future..",
        "What’s your favourite football team",
        "Where you from",
        "I see that you  joined reddit in 2021 . Which subs u r really like and spend time on .",
        "Lmfao bruh 💀",
        "I feel the criticism that people have had with your music is how they don't believe it comes from the place of reality even though it sounds very good. How much do you disagree with them. What is your writing process? Do you focus on making songs or do you write usually what you're feeling?",
        "Hey Anuv, my most recent ex is a big fan of yours! We use to listen to your songs when we were together. Can you give Mansi a shoutout in reply? Much appreciated if you do! Once again your art is magnificent.",
        "your voice is just too 🤌🤌 brought spotify premium just too download your songs to listen on loop while travelling",
        "Are all your songs based on personal experience? \nAlso I loveeee your songs. Thank you for the songs that keep me at peace!",
        "'Ship of Theseus' - an object which has had all of its original components replaced remains the same object?",
        "Which countries would you like to do a concert in?",
        "Hey Anuv,\n\nMe and my girlfriend (now ex) had started falling in love around the time you released Riha. I associated that song with our relationship, but boy did I not understand the meaning. Only now when we have parted ways does the song make sense.\n\nAlthough for me the song ends like this; Jab tak miloon nhi, taron mein mil kahin.\n\nNow for the question, How you doing today?",
        "Sir toote makan ghir ke kyon nhi bante?",
        "hey anuv even though i messaged you on insta but i will again  send you my rock version of your new  song antriksh :-) would like your review\n\n[https://drive.google.com/drive/folders/14QezABP6qz8PnUOVoHnMP9KfXqpPYA1C?usp=sharing](https://drive.google.com/drive/folders/14QezABP6qz8PnUOVoHnMP9KfXqpPYA1C?usp=sharing)\n\nfeedbacks welcomed from all...",
        "Baarishein 🩵",
        "My girlfriend asks how do you write such beautiful lyrics? Do you have a girlfriend",
        "YES PLEASE",
        "The first song I ever heard was \"Alag Asmaan.\" It's crazy how that song brought some amazing people into my life. I just wanted to say that I absolutely love your music! The way you express yourself through your songs is simply mind-blowing. Keep doing what you do because it's awesome!",
        "Can we get you for a concert for free, just the travel and hotel. We wish for a college fest with no admin support, only student funded ..",
        "Inter or Man. City in ucl final?",
        "Barishein is always and forever in my heart",
        "Do you play any games??",
        "Hope you enjoyed the wedding in mussoorie. Was a fun time. How did you find St. Georges?",
        "hi anuv❤️! in what way would you say that your heart is a wave?",
        "Hey anuv, your favourite books?",
        "We had invited you to our college fest.. at December in Mumbai.. why'd you/your team reject it.. :(",
        "Thoughts about Dehradun Dale Jamboree music festival? How was your experience performing in Dehradun?",
        "Where did you goooo",
        "Lmao",
        "How can one start on the path of songwriting? I have always been interested in music, but childhood me never got to fulfill his wish of learning an instrument. Where to begin? Is there a process to it? \nAlso, huge fan of Ocean ❤️",
        "Anuv! Tumhe nahi pata hai ki Mazaak Mazaak mein kya kya ho gaya. Ek ladka tha jo mere jaise hi gaane sunta tha. Ek din maine usko bola ki, \"pata hai, Anuv ka naya gaana aaya hai\". Us din, hum dono ne, parking garage ke rooftop pe, pehli baar Mazaak suna, aur us din se vo humara gaana ban gaya aur hum, \"hum\" ban gaye:\") all thanks to Mazaak.",
        "Hello Anuv, I've come across Indie-Pop like a year back and I'm loving the scene in India. And of course, my initial few songs included 'Gul' and I very much adore it till date! <3\n\nNow to my question, what other genres do you listen to?",
        "What instruments can you play? Which ones your favorite? Huge fan btw. Been following you since baarishein was posted by the last cigarette.",
        "How do you  come  up with concepts which is unique and makes you stand you out from the other artists?",
        "Hey Anuv! Hope you’re well. As a fellow musician, I genuinely admire your songwriting skills. Any advice on how can I find my ‘voice’ and be authentic with my writing as well?",
        "When are you coming to Nepal again?",
        "hello, anuv jain. I don't have any question to ask you, just keep working hard.",
        "Tell us about your upcoming song",
        "Messi or ronaldo?? (or someone else you'd like to mention)",
        "Does any of your songs relate to your personal life. If one or many please mention one. We just want to know the depth is in the art or in the artist himself:] love ya Anuv ❤️\n  ^ You baarishien is all time relief : even in this hot summer^",
        "Bro, i can't just express what your songs means to me. Through every cheerful moments to the lowest point of my life, your songs felt warm and healing. \n\n\"Aye nahi, jinke the waadein\n\nWaqt uljha hua hai tere yahan pe\n\nKya woh kal the yahan?\n\nYaan hafton pehlay ki yeh hai dastaan?\"\n\nThe person on whom you counted on, but they just ghosted at the most difficult times. But you used to consider them as your \"closest one\"\n\nThis song, acts like a therapy... As if someone just came and sat beside you, while you are in a dark room trying to figure out where did you go wrong. He gives you hope, strength, hugs you and makes you believe in yourself again. You don't know him, but you know you can count on him and he can heal you. \n\n\"Aayega ik din\n\nJab unki raatein yoon na mehfooz hongi\n\nTere, tere bin aise\n\nTu dekh lena\n\nTeri kami tab unko mehsoos hogi\n\nMujhe Mujhe hai pata yeh\"\n\n\n\"Ha ja rahe ho duur tum to kya?\n\nMain hi to dil ka musafir \n\nTo ek baar phir tu hanske zara\n\nDekh le meri in aankhon mein\n\nMain kaid kar loon har wo pal tera\n\nTeri ye baatein jo hain\"\n\nRepresenting a sweet love story between a long distance couple. Seems like he just made every phase of my life a song, but in an amazingly expressed way. My life's quite messy lmfao unlike his songs.\n\nHe adds the perfect thing to say when she is mad at you for some reason. I am not good at expressing and he just penned my exact thoughts and feelings towards my long distance partner, in the most creative way. How do you do this Bro!!?\n\n\"Ab Tere Bina Yahan Meri Saansein\n\nJaise Bina Nindiya Ki Raatein Hai Toh\n\nAur Tu Hi Mere Dil Ki Raza Hai\n\nTere Bina Dil Bhi Khafa Hai Toh\"\n\nWhen you are madly in love with someone and you have planned everything with them in your mind, you achieved such a level of emotional bonding with them, you just feel incomplete without them. Again, the exact feeling you would have at that moment penned in a beautiful manner.\n\nI talked abt lyrics so long. What about the music? \nAH! do I even have to tell abt that?? There is no artist, that made me love each and every song of them, trust me, no one, EXCEPT ANUV JAIN! His songs are the only ones which i can listen on repeat for unlimited time period, and still cherish the extraordinary lyrics and music. Trust me, I have to say, i am compelled to say, he is the one and only artist to hold such a talent.\n\nI never met you in reality, but tbh you still feel like one of my family people",
        "Yes please, the acoustic version",
        "I too want to become a big artist/songwriter in America.\nDo you think it’s possible being I’m from India \nLower middle class ? \nWhat are the problems I may face ?",
        "Do celebs and artists have a Resume like we normies do? Or just the portfolio of their past work and stuff?",
        "You suck bro, that's all i gotta say",
        "Hi Anuv, I don't have a question, I just want to tell you that I'm a big fan of your music, so much so that for some time I had started thinking that I had lost the ability to appreciate new music and could only find comfort and solace in the songs that I had been listening to since childhood. But, your songs made me believe that I can still appreciate new music. While playing FIFA, I just open your profile on spotify and listen to all your songs randomly, they're so soothing.",
        "Hey Anuv, I don't listen to Indie music or Bollywood, I'm totally into Hip-hop and rap. Which songs would you recommend me to\n\n1. To listen to Anuv Jain.\n\n2. Indie music.",
        "whats your personal fav song of yours and others \n\nboth indian and foreigner",
        "Who are ur musical influences or go to artists that u listen too..Plus any song recommendations ?",
        "Just wanna drop by to thank you for your music man. There is a kind of art that makes you feel relief. And yours is that. Thank you for pursuing music.",
        "How has life been to you recently?",
        "Hi I really love your songs. I love the Fact that you use your Real True authentic voice in your songs than most of the people who use Autotune. I would like to mention The live version of GUL you recorded in the Forest. It sounds so real and beautiful. I think other artists should learn this from you. Some expressions can be communicated much better when its Real",
        "Hi I really love your songs. I love the Fact that you use your Real True authentic voice in your songs than most of the people who use Autotune. I would like to mention The live version of GUL you recorded in the Forest. It sounds so real and beautiful. I think other artists should learn this from you. Some expressions can be communicated much better when its Real",
        "https://preview.redd.it/e44tamnhmg1b1.jpeg?width=720&format=pjpg&auto=webp&v=enabled&s=cdc91cc3563f894232c4e1e11691cadb1e7881d8\n\nLol! See, i was listening to you actually XD\n\nMishri and then riha",
        "Just wanna drop by to thank you for your music man. There is a kind of art that makes you feel relief. And yours is that. Thank you for pursuing music.",
        "I can't believe this is the real Anuv Jain",
        "Just heard your song for the first time and now u are on my timeline hahah nice song wish you a great future",
        "Aria? Can u tell what is it pls",
        "your songs are just great, love them",
        "How to be consistent with our art?...with everything we need to do irl, how to make out the time, motivation and be consistent with it. I am going to point out that I am still a student and do not have a job, and I feel like there are so many things I need to do which leave me with no energy or motivation afterwards...\n\nWould love some advice from a professional.",
        "Hello Anuv Jain, \nI just wanted to tell you something,\n\n\n\n\nLeave some girls for the rest of us. Thank you",
        "Tere muh ke shabad itne controversial section me kyu hai?",
        "I think it’s more like at some point the cloth has more patches than it’s base layer and you can’t keep going like that. It’s  deteriorating.",
        "A big Anuv Jain and anime fan here!!!! I can’t believe you watch anime too!!!!! I’m so glad to know that. I hope you’re still there and can share some of your favourite anime series/movies UwU",
        "Just wanted to ask what's the most unpredictable thing that has ever happened to you apart from ur career.? And would it be possible for me to meet you some day 😭?",
        "Since I can't get an autograph here,\n\nCould you do a dear u/error1105 and just write your name? 🗿\n\nBut fan tho!",
        "Hi Anuv, Love your music.. been a fan for years now.\nPerforming live anytime soon in Delhi?",
        "Heyy Anuv, got a question here......Will we ever get a mix of genre music from you?? Like one which contains your type of verse with rap or something?? Mann I'm bad at explaining but I think you got it :)",
        "Hey nuv, im a really big fan of yours. I even want to attend your concerts so badly but since im just a teenager, i can't. And then i feel so bad for not being able to meet you yet. It has been a year since i have been listening to your songs and you have helped me get out of so many situations. Im here ,alive, and you are one of the biggest reasons for it. Thankyou nuv. Im forever grateful and i love you.🥺",
        "Why so desperate mam?? (Contented to see you alive tho)",
        "I love listening to your songs!!! My friends are tired of hearing me sing \"tootay makan\" everyday. 😂 Mishri got me through some of my worst times and I absolutely love Baarishein!\n Waiting for the day you will come and perform in Pakistan or in the US!!! Will travel to whichever city just to hear you live ❤️",
        "ayooooo hxh fansss",
        "Hey Anuv how do you come up with the acoustics of your songs like the finger picking pattern and the chords…..? Also it took me 3 months to properly play and sing GUL lol.\n\nAnd how do you take care of your throat so that it dosent get sore and you can sing high notes with ease...?\n\nPS: I love the amount of intensity you put in your songs , absolutely amazing ❤️‍🔥",
        "Hey Anuv Jain! I absolutely love you and your music. Please marry me.",
        "What's your outlook on the censorship in India, do you yearn to have impact on the culture like Sidhu Moosewala (RIP)?",
        "Hahah he's my favourite artist that's all, the comment was meant as a joke didn't write it seriously",
        "Please tell us the detailed strumming pattern for Alag Aasmaan Ukulele. \nPS. I started learning ukulele because of your song Ocean.",
        "Anuv! Tumhe nahi pata hai ki Mazaak Mazaak mein kya kya ho gaya. Ek ladka tha jo mere jaise hi gaane sunta tha. Ek din maine usko bola ki, \"pata hai, Anuv ka naya gaana aaya hai\". Us din, hum dono ne, parking garage ke rooftop pe, pehli baar Mazaak suna, aur us din se vo humara gaana ban gaya aur hum, \"hum\" ban gaye:\") all thanks to Mazaak.",
        "we need a mumbai concert soon🥹",
        "Hi Anuv, I'm an aspiring songwriter and I've been very inspired by you, I've been looking up to you for a very long time. \n\n• I wanna know how you practice your vocals, dod you learn it from anywhere or is it natural? \n\n• Also one more thing is it really necessary to know how to play an instrument to compose a song or we can compose it in our head as well and then get it produced later on? Seeing all these other artists who are not playing any instrument while performing.",
        "i read here on reddit that you cheat on your girlfriends \ndo you actually cheat on your girlfriends?",
        "how would u feel when i demolish your house? (Tootay makaan Ik baar gir kar waise bante kahan hai?)",
        "I recently started listening to your songs (mostly because my friends won't shut up about it, lol), and have come to really enjoy the quiet and peaceful feeling I get from some of the songs. \n\nSo what I wanted to ask was, what's next? \nI mean, what do you plan you doing in the future? new songs, new genres maybe (..??)",
        "Damnnn never thought anuv Jain watches anime xD",
        "Thank you so much! That really means so much 🤍",
        "Are you working on any new music? Also who mixes and masters and your music? I’m an upcoming musician and I’d love to get some tips",
        "Hahah guess we’ll never know",
        "I love you anuvv",
        "It’s something that I’ve been doing for a bit now so I can’t really say! But it was about 3 years ago when I got into music “professionally”. It had started doing to well enough for me to get into it and I’m so happy that I did",
        "whenever i listen to your music i just end up putting alag aasman on repeat so never discovered you much as an artist hahah 😭",
        "I’m okayish…. Have been a bit stressed tbh. Haven’t been sleeping properly but hanging in there",
        "I’m barely a celebrity! I really don’t like that word tbh. Consider me a friend",
        "Comments in my lives really make me chuckle man. Even when I’m singing the saddest one. People say funny shit haha",
        "you didn't reply☹️☹️",
        "Hey Anuv, actually I met you at the Delhi concert at JNS in the month of august... With the handmade posters of your amazing music backstage. Well idk if you do remember but wanted to say that to date your music is amazing and I'm always a huge fan of yours!! <33",
        "I thought it’ll be cool. I don’t really have much of a presence here on Reddit. Maybe this’ll help a bit?",
        "HAVE NEVER SMOKED AND NEVER WILL",
        "Yes :( I really hope we win the FA Cup :(",
        "I have a split in my head regarding this. Everyone around me tells me that it’s great and it definitely drives the numbers but I feel sad coz some of these are very sad stories/memories from my life. Looking at it getting reduced to a meme isn’t the best thing. But I’m learning to accept that all songs have their own path. Maybe these songs had this one",
        "Hai although that 8s rebuild but the vibe and energy will not be the same",
        "Shell-don",
        "Hey! What headphones do you use while editing or listening to music?. Also any thoughts about what a frequency chart should look like in your opinion?.",
        "Do you think the quality of indian music has degraded and the poetry hidden in the lyrics of the songs has disappeared and they have become no more than words with a superficial meaning",
        "I hope my music stays relevant. I’ll probably disappear on my own after a few years and never be seen again.",
        "Coz.. aye na Teri yaad unko",
        "Who hurt you man 🥺",
        "I’m slowly becoming more confident. It’s so funny coz I can’t explain it to the world. It’s like I literally freeze in front of the camera. I don’t know what to do with my hands. I get so awkward ahah but I’m getting better",
        "When will the fansign be held in jaipur? 🥺",
        "Jigglypuff is pretty cute and she sings too ahah",
        "same same, it looks difficult rn but winning the FA Cup and stoping city from winning the treble would be the path for restoring the glory",
        "Which song of yours you like the most? Or any specific order of your liking?",
        "Which is your dream place that you want to visit once in life?",
        "I swear I tried but hot water for the win 🥇",
        "Well I hope somebody didn't just do identity fraud here lol",
        "Who do you think this is??? Ahah I handle all my social media myself. It’s always me heh",
        "So you decided to act like a dick to someone who's taking time to speak to people on this sub, when they easily could have chosen not to? \n\nIf you don't have something nice to say, why not keep it to yourself? What value did your comment have, beyond potentially making someone feel bad about their creativity and music for no reason at all?",
        "I’ve seen it! I’ll watch the latest season soon ^_^",
        "Alag aasmaan repeat pe tha bhai, jab usne reject kiya. Shukriya",
        "Bhai Ganon se bhi rulate ho aur abh reply karke bhi love you Man 😩❤️, thode khushal gaane bhi banao plssssssssssssss",
        "I’ve actually never heard that one. I’ve been pretty vocal about the fact that all my music comes from own stories. Maybe I might’ve missed it but it’s all “real”. Sometimes I feel it’ll be difficult for me to write something without using my own experiences",
        "For folks unfamiliar with your music, which tracks would you suggest they start with?",
        "Love to hear that. Your music is soothing.",
        "St. George’s is soooo pretty! Loved the football pitch. Played a little there too. Had the best time. Might send my kids there 10 years later or something ahah",
        "fav anime?",
        "HxH stans assemble aaaaaa!",
        "Antariksh is SO GOOD. the artwork, the music video, the outfit and the lyrics- I absolutely love everything about it, it’s been on loop since 18th, hehe🫶🏻💌🌌",
        "Don’t we all? ✨ Existential ✨",
        "I’ve seen you grow from 10k yt subscribers to 1 million. Your transformation and growth makes me so so happy. I’m so grateful that I discovered your music. You’re literally my comfort singer songwriter, love you max :”)",
        "Do you like Delhi/ Mumbai?",
        "toote makan",
        "I just want to take care of my family and provide for them. Do good work and hopefully be remembered as someone who gave it his all! Everything else is consequence of the effort I put in. Also, I loved Sidhu’s music man. What an artist :,(",
        "It's a long ass story but i'll make it short.. During lockdown while i was battling skin cancer, I met a girl online who made me feel a lot better. We fell in love eventually..And was determined to follow through.. But due to some turbulence in both of our lives it stopped We didn't talk for 6 months and she was facing some mental health issues.During that time the only thing i had that made me feel connected to her and the world was your song Ocean. Because ironically when we were together she once chose a shirt and jeans for me that matches exactly to yours in the song cover.. It was not just a coincidence but a manifestation for me.. And your lyrics and melody of the song made me want to fight the physical and mental pain i was going through.. So on her birthday during durga puja.. I took the first bus and reached out to her in that same pink shirt and those same jeans and we met for the first time.. And to update.. Three years later.. I've beaten every disease I had at that time and She is still with me ❤..THAAANK YOUUU ANUV!",
        "You being on reddit makes us feel like we're closer to you than other artists.. how do you write such meaningful lyrics? Can you give us some pointers on how to actually execute storytelling through a song ?",
        "What’s your biggest regret in life?",
        "Oh is that so? Who is this???",
        "Ahah no no this was done w the Reddit India team!",
        "I have a few but I’ll keep them to myself",
        "tour anytime soon?",
        "Ik that you love cats, why don’t you get one?",
        "Why so obsessed w puns?",
        "If you weren't pursuing music as profession would you still be doing your business or something else ?",
        "do you work for NASA? because you’re out of this antariksh🚀😮‍💨",
        "Been loving your songs since the last 5 years or so. Great to know you love anime as well.",
        "What makes you happy? Not asking for a friend.",
        "I’m really trying to figure that out tbh. I haven’t really been the happiest. I thought I will be after everything but it isn’t how people think it is. But I’m sure I’ll figure it out one day",
        "Not a fan but once heard your song called \"Baarishein\" That too on loop was a amazing experience thanks for that and \"Gul\" Song lyrics \"tootay makan ik baar gir kar waise bante kaha hai\" Is still stuck in my mind goated lyrics you have",
        "Did you ever confess your love to that\n“Antariksh” girl?",
        "https://preview.redd.it/9w6zqxdgzg1b1.jpeg?width=1170&format=pjpg&auto=webp&v=enabled&s=792c8e4147d39f729bdd59cd9c80ec9dc937989e\n\ndo you remember me, heh?",
        "What are your thoughts on Chooche Chusa?",
        "https://preview.redd.it/6qfcgwclzg1b1.jpeg?width=1920&format=pjpg&auto=webp&v=enabled&s=5dad895281d2beab20ccf3a96b0f55d4da18101e\n\ndo you remember meee?",
        "KOLKATA TOUR WHEN ANUVV? CANT WAIT TO LISTEN TO YOU LIVE 😭😭❤️",
        "your growth and transformation thru the years, makes me so happy. so grateful that I discovered your music. you deserve the whole “antariksh”😤🫶🏻🚀✨",
        "please do this again soon? I missed it :”(",
        "OMG ANUV I LOVE YOU SO MUCH YOUR MUSIC IS LITERALLY SO AMAZING IT'S SUCH A SHAME THAT NOT ENOUGH PEOPLE KNOW YOU\n\nIM ABSOLUTELY IN LOVE WITH ANTARISKH I LOVE THAT YOU WENT OUT OF YOUR COMFORT ZONE AND MADE SOMETHING ABSOLUTELY INCREDIBLE\n\nALSO PLEASE PLEASE PLEASE COME TO DUBAI YOU HAVE A LOT OF FANS HERE",
        "hi anuv...\n\nI am a big fan of you. I am from Ludhiana and jain too..!! WHEN WILL YOU DO A CONCERT IN LUDHIANA!!??? My girlfriend attended your Chandigarh concert since then I really wish I could attend your concert. Anyways I love all your songs and for me you are the only singer with no bad songs!! you are one of my favourite singer right now! Antariksh was awesome! Please don't ever stop making music...",
        "man, i hope you’re having a good time. um i remember one of your lives, where you went like : “kya nahi hai ye din?…..raat din, teri yaadon mein aur mai…” like these aren’t the exact lyrics but i tried my best to decode & explain, tell us about this one? is this one your original? i will provide the link of this livestream of yours as well, if you ask me to. :)\ntho i love your music, appreciate you my man anuv. i love you. <3",
        "if you could go by a stage name, what would it be?",
        "me and my bsf literally adore you sm 👍🏼👍🏼👍🏼 we listened to mazaak together for the time first and loved it sm that we kept listening to it again, it's v close to our heart, now we are gonna listen to antariksh <3 thanks for your music, take care and i really really wish you all the best for your career and i hope you blow up more fr fr",
        "How do you singers come up with these lyrics, like when in a similar mood, it's like lyrics describe what one is feeling",
        "Bro love your songs. I don’t know hindi I translated your lyrics and your voice gives calm vibes. Thank you, keep rocking 🔥🔥🔥",
        "tu yedzhava aahes",
        "Hey Anuv! It's great to see you here at last. I try to decipher your songs and believe I've been able to do so somehow. Would you please go through what I have written? It would mean a lot to me",
        "Saw the entire concert loved it , thanks for coming",
        "Which football team do you support?",
        "Please watch Monster",
        "Makan tutta ki nehi",
        "Hey there, though I don’t know you or have ever heard your songs, because apparently I am living under a rock, but I wish you a great career in music. \n\nWhat do you reflect on the current music scene in India and what advice you have for aspiring singers in this age of auto tune?",
        "Appreciate the response & your thoughts 🙏",
        "Yoooo! Love your music! I know that you’re a fan of Pewdiepie aka. Felix Kjellberg. Can you share some good memories of watching him & what made you follow him? Any changes in you because of his influence? Bro-fist 🤭🤭🤭",
        "Kisne Dil toda bro?",
        "I just wanted to say that the Gul is your best work in my eyes and \"toote makaan,ik baar gir kar waise bante kahaan hain?\" is something that hits pretty hard for a lot of people but the whole song is a thing of absolute beauty. 🛐",
        "Bazinga!",
        "Hey Anuv I LOVE YOUR MUSIC!!!❤️❤️ To me music starts and ends with you!! I have a tattoo of your song Gul!! Your songs make my days brighter and the nights calmer!! Will always be a fan of you and your music✨✨\n\nTU HAI NOOR SA, NOOR HI HAI ALAG!!",
        "Andaz Hotel ? 👀",
        "Anuv please come to Delhi University sometimeeeee !!! In our college ipcw specially next fest season mannn it would be such a treattt !!!! 🤌",
        "Since you said you watch a lot of anime, what’s your favourite anime?",
        "Do you even realise that this sentence is breaking the heart of so many people? :(",
        "are you excited about your concert in Bangladesh? how did you find out you had a fanbase there? are you familiar with Bengali music or do you want song suggestions?",
        "next song when?",
        "Anuv bhai ,kya haar aur Jeet ke beech bas 1 Darr ka dariya hai ? Kya mai Jeet ke abaad ho sakta hun ,aur kya mai haar ke baad chain se reh sakta hun ? Kya mai beech Mai nahi reh sakta ,kya mujhe 1 pala chun na jaruri hai ?Kya koi is duniya mai Aisa hai , jo kisi pakde mai na ho , jo na idhar ho na udhar  aur na hi beech mai ,bas wo Jo door se dekhta hai?",
        "Anuv i dont know if you will reply to this but i want to tell you that your music is awesome and i want you to keep going and make more and more hits in the upcoming future , cheeerrss",
        "Hey anuv, love your music, just one request, please try to release more songs. And if possible do release \"JO TUM MERE HO\"",
        "Bhai ache Gane Kab banayega??",
        "No questions just a big fan!! Baarishen is my therapy.. Just regret I heard you quite late being listening to you since a year or so...",
        "Hi Anuv,\nFollowing you since ZS days. I remember how you went ahead and put across your YouTube channel details in our onboarding session. Sadly I don't have a picture with me but can proudly say we were part of the same team for a while. Magical journey from there to where you are now.\nWish you all the best, keep shining!",
        "How did you learn to sing?",
        "Hey Anuv, big fan. Your songs give pretty much of a GenZ vibe which I enjoy a lot. Kinda relatable lyrics and a cult music. Perfect for a day out or a night out with neon city lights. \nI'd love if you have a concert at Raipur someday.",
        "How did you start with Songwriting? Since when have you been writing songs?",
        "hey anuv please check out suzonn and try making a collab with him please\n\nalso I LOVE your music man\nalag aasman is what made me pick up my guitar after years and i love you for that thank you so much your music is so healing\n\nALSO PLEASE PREFORM IN HYD",
        "Baarishein and Alag aasmaan resonated with me on a profound level, and when I shared them with my boyfriend, he revealed they were among his favorites too. From that point on, these songs became forever linked with him. I am grateful to you for creating such beautiful music. What inspired you to make alag aasmaan? \nI wish I was a part of your baarishein hobknob. When will you have another one of such gatherings? The way you sang and the enthusiastic participation of the crowd was just captivating.",
        "I have total confidence that you are not going to answer. Having said that, I don’t know you or have not heard of you. \n\nBut since some platform have given you an opportunity I’d say: spread love, spread love, spread love. We all need it. The world needs it. \n\nBaki, you will find your way, when life gets you. \n\nTake care. People need You.",
        "Okay no jokes. Seriously. How does it feel being the new chocolate boy everyone swoons over?? Cuz at this point its like Amir in the 90s.",
        "this was so cute! i wasnt too into Anuv Jain before, just heard the few songs (loved them) recommended by my frens who are fans but this AMA was so cool, Anuv Jain is definitely someone i would love to be friends with, and as someone who cannot separate the art from the artist i will be joining this fan train heh.",
        "Would you ever collaborate with prateek kuhaad?",
        "Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us. <3\n\nIs it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times.",
        "Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us. <3\n\nIs it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times.",
        "Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us <3\n\nIs it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times",
        "hi, your songs are so beautiful, can you please come to Bangalore soon also also how do you dead with artists block(it’s like a writer’s block)",
        "hi, your songs are so beautiful, when will you come to Bangalore  also also how do you deal with artists block(it’s like a writer’s block)",
        "Hi Anuv! Not sure if anyone has asked this yet XD. Do you have any singers/ songwriters who inspired you to enter this field?",
        "Can you give me a rough process of how you write songs. My vocabulary is decent but i still have trouble writing songs.",
        "Can you please make one song which is not sad  ,not about breakup/ love , not about feeling low or disappointment, but a happy song",
        "we have no enemies.",
        "Broo am I late? Love your voice...Gul and Baarishein are one of my favourites! In this era of auto tuning your voice is the real deal. Thank you for those masterpieces.",
        "I missed it 😭",
        "Manifesting you no more regrets + more and more happiness 🤧",
        "Bro Istanbul mein show kab karoge",
        "Can I try writing music? How should I start?",
        "How do you begin your songs?  What is the first line that comes out and what inspires it?\n\nI am a new songwriter and will have 4 songs on Spotify by the end of June. RS",
        "How you got into music were you God gifted or trained , bathroom singer or family function star has heartbreak made you make deep songs just need to know your story that resembalates your music !!",
        "Hey man, love your music, I read on this thread that you like watching anime. I have a friend who I think is your biggest fan ever and I'm tryna take her to watch the movie \"your name\" this week. She's a bit skeptical about the whole thing tho. It would be great if you can comment back to give her that last push because she would kill a person if you said so. \n\nThanks a tonne and all the best for all your future projects",
        "Agar toote makan gir kar waise bante nhi hai toh bante waqt hi Ambuja cement use kariye Jain sahab taki makan ke tootne ki naubat hi na aaye",
        "Why did this post get recommended to me if I live in america",
        "I had 2 of your songs in my favorites list and my favorite genre is pure Hindi lyrics because that is a missing genre. Your lyrics with EDM or electronic music will give me literal orgasm. Any plans? BTW Anuv which school you from in Ludhiana?",
        "Hope you write a song on finding your own Vinland in the future",
        "I wonder you still here?!! Just a quick reminder. Stay happy and keep smiling like you always do. And know that you are so much loved! I'll be happy if you read this.",
        "Bruh your music is awesome. Spotify told me I was one of your top 0.5% listener. Dunno why it was so damn specific with the 0.5. 😂\n\nKeep on doing what you do brother.",
        "Mate,  baarishein .. thank you, this one gets to me , it hits that zone where I easily and effortlessly drift away humming, teary eyed, melancholic, mournful. the song starts and i end all over again. Everytime.\nPS: it also helps. How could I forget alag aasmaan.",
        "I came across Barishein when I was going through something difficult, and it helped me heal. Still on a bad day, I turn to Gul, Alag aasman, Mishri. Your music, your voice is soothing to so many and the way you talk about love is comforting. I came across so many negative comments in this thread, so I just want to tell you are connecting to so many people through your songs around me, and anybody who doesn't feel like that shouldn't bother you either. \nThank you for existing. ♥️",
        "When do you plan to learn more than 5 chords?",
        "How is the journey? Did you enjoyed it ? A big fan here , following you for 5 yrs..🤝🤝",
        "Sach Sach bol, you did all off this, the music the career all of it just to mine karma haina haina",
        "I love playing your songs. Heartbreak yes, but there is no much hope in your voice and words that I am left with optimism after listening to those. Great job you do.",
        "When will you come to Ayodhya(Uttar Pradesh)? And will you give free tickets to students (or not keep it too expensive for students) ||\nMaybe I am your youngest fan ever (that's why I am asking for a favor)~~\nHave you ever fall in love with an virtual character ~",
        "Hey Anuv, will you please come to Chennai(asks with puppy eyes)",
        "Please make songs more like Maula :) it is so beautiful:)",
        "What gave you the inspiration to write your first song?",
        "Getting a comment from you feels absolutely unreal! Okay so the question is what helped you get over your darkest phases in your life? Also, what's your favourite indie song from a different artist?",
        "Great to know you're a tennis fan. Alcaraz, Sinner, Rune, who's your favorite of the *possible* next Big 3?",
        "Hi Anuv, I am away from Indian Indie scene, but discovered you on Spotify, and your song Mazak is just brilliant. From what age have you been playing and writing music and who are your influences?",
        "Anuv how do you create and publish music as an independent artists?",
        "How do you sing so melodious song with not so ryming words",
        "I want to be a songwriter in Bollywood. What would be the procedure to make it big and how much time would it take?",
        "I really love your song Ocean🙌❣️",
        "Hey Anuv! I just wanna say thank you so much because your songs have been there for me when no one else was. Your songs have healed me more than anyone else has. I wish you all the best in your life and I hope you reach many manyy more heights cus you deserve it. <3",
        "Hey Anuv ! I want you to know that i'm in love with alag aasmaan and i listen to it almost everyday before i sleep.",
        "hey anuv.....i jst wanna know how you got into songs......and what was story behind writing antariksh",
        "Hello Anuv, your songs are really awesome and I have introduced many people to your songs. How have you started your music journey and when did you decide to become a songwriter full-time?",
        "hey   \nWhat inspires you to make such good songs i mean sometimes when I'm down and that the thought of just giving up then suddenly that- \"KHALI GHAR TERA YE CHABIYON KI GOONJ AISE TUJHE DARA RAHI TU DARNA NHI MAI HU YAHI PAR\" strikes hard when things get worse and they come back and again go then that-\"TERI KAMI TAB UNKO MEHSOOS HOGI\" makes me give a sigh of relieve. When the will to go any further dies then you make it all worth it. Thankyou for doing so-",
        "No he's the one who produces the singles on YouTube and Spotify",
        "What’s your fav Netflix show?",
        "How did you got into singing?",
        "What was this biggest struggle you had to face while getting into singing",
        "This questmay weird you out but why love songs? There are other types of songs aswell?",
        "Did you parents ever forced you for pcm/pcb?",
        "Weird question but why guitar?",
        "Hey Anuv, do you Like thriller/horror because from what you write some would assume you’re rom-com person but I personally feel like you LOVE HORROR movies. Do u?",
        "Sounds like a Pokemon name.",
        "Apne makan ambooja cement se q nhi banaye?....toot te hi nhi.",
        "I love your voice so much that I named my new born Anuv🥰",
        "I don't speak or understand Hindi but loved and still love listening to Gul and Baarishein - feelings connected beyond languages",
        "do a concert in Kolkata please i beg 😭😭",
        "Your song Mishri brings back memories of my Mom.Thank you for that!",
        "If your bestfriend was ugly, and it was his special day (wedding or birthday), would you randomly mention that to him, even if that's the truth? You'd be a dick. I hope you get it",
        "Haha, owned him. I missed the AMA, but you're good, man.",
        "What's ur favorite anime?",
        "In a parallel universe if u weren't singer, then whom do u think u would be?",
        "Hey I've still been a big fan of yours till now, and your song baarishein and gul has hit me a lot to reality those lyrics are relatable. Is there something else you would like to release like the same in the future?",
        "ANUVVVVV I LOVE YOU PLEASEEE!!!!! THANKYOUUUU FOR MAKINGGGGG MYYYY DAYYYYYY",
        "What's your favourite song that you ever wrote? Or your favourite lyric that you wrote? \n\nAlso, love your work!",
        "It's not that deep and he's not wrong",
        "Could you please try to collaborate with them?  \nIt would be out of this world honestly :')",
        "What inspires you to write your songs?",
        "Was Gul driven by your past relationship?",
        "Music > lyrics change my mind",
        "Hi Anuv, the way your lyrics make me feel, I feel that if a guy ever felt for me as deep as your lyrics are I’d marry him and never lemme go. Whenever I hear your music, I feel like packing you in a bag and taking you everywhere w me. Why is your music so amazing, plis sing more😩",
        "Thank you for doing this AMA. This is what got me into your music. I have been listening to your music non-stop. I am kind of depressed and most feel-good songs bring tears into my eyes, but not your songs, your songs make me smile. I love the feeling of feeling lighter after each iteration of listening to your song. Thank you from the bottom of my heart.",
        "nai re, andaaz which he threw on from sitting on that \"tree\"",
        "being an indie artist yourself, what are your thoughts on the emergence of new indie artists in india?",
        "Can you please share the story / inspiration for your songs. Particularly for alag aasman and mishri. I love your music and more than that your writing. It feels like you are telling a story you don't want others to know about. Which eventually leaves room for interpretation by the listener and adds mystery to it. <3  \nPlease do a live concert in delhi. I so wish to attend yours.",
        "You're such an inspiration anuv💌 the day you replied to me on your live , it just made my day(18.5.23) . Thank you for existing 😭 . You deserve it all❤",
        "as someone who was in that jindal crowd, the entire concert was an AMAZING experience! surely it was way too crowded, but since i got to see you perform live for the first time, i became a whole air conditioner after this!!! i heard your songs on spotify and i liked them a lot, but i never expected seeing you live one day! too bad we couldn't meet in person but i still enjoyed it. you indeed made an impact to the audience whoever was there, at least on me!\nthanks so much for coming! hope to see you live once again (and maybe meet?)",
        "Have you heard the remix of your song snap x baarishen and how do you feel about it?",
        "Love your music. Used to listen to Ocean on repeat at one point 💙",
        "I have been analyzing your songs composition wise, rythm wise, and lyrics wise. Can u share some technical tips how do u compose. What are the conscious decisions other than the inspiration for the song itself.",
        "Bhai, ye makaan toote tumhare, wo firse bane kyu nahi?, skill issue hai kya?",
        "What are some of your favorite songs right now??",
        "Public mein jaana kitta hard ho gya hoga nhi, neeche wali dukan se dahi nhi mangva skte honge.🥹",
        "Oda aap?",
        "I loved Mazaak man honestly, waiting for more like that!",
        "yeah man, we're not democracy for nothing!",
        "Nothing to ask you ... Just wanted to you to know \"Alag Aasman\" has a special place in my heart",
        "Could be Haagen Dazs?",
        "Ohh Nicee, it's quite understandable why he has such a big gurl fanbase.",
        "Haha yes, his lyricism is too good i love gul sm",
        "Hello sir, hope you are doing well.\nI would like to ask what your biggest regret in life is? A moment you wish you would have taken the other path.",
        "Your songs are so amazing..they touch hearts 💕",
        "I came across this while listening to Alag Asmaan :)",
        "Ayoooo, what are you doing here, how have you been?",
        "Dear Anuv jain,\n\nI hope this message finds you well. First and foremost, I want to express my admiration for your incredible talent and the positive impact you've made on the lives of countless fans, including myself.\n\nI am writing to you today with a heartfelt request. It would mean the world to my dear friend Darshan Jain, if he could receive a special birthday wish from you. Darshan is an avid fan of your work and has always looked up to you as an inspiration. His birthday is coming up on this 25th May, and I believe a personalized message from you would be the ultimate surprise and make his day truly unforgettable.\n\nI understand that you receive numerous messages and requests daily, and I truly appreciate any time and effort you can spare for this request. Even a simple birthday greeting or a few words of encouragement from you would bring immense joy and happiness to Darshan. Your genuine connection with fans is what sets you apart, and I believe your kind gesture would leave a lasting impact on their life.\n\nIf it is within your reach, could you kindly consider sending a personalized birthday wish to Darshan? Your message could be in the form of a short video, a social media post, or any format that you find convenient. Please let me know if there are any specific details or instructions you require to fulfill this request, and I will gladly provide them.\n\nThank you for taking the time to read this message and considering my request. Your unwavering support to your fans is truly remarkable, and it is a testament to your genuine kindness and appreciation for your supporters. Your involvement would make this birthday an extraordinary moment for Darshan that he will cherish forever.\n\nWishing you continued success and happiness, and thank you once again for your consideration.\n\nWarmest regards,\n\nAnurag💗",
        "Bruh do you sing?",
        "I know its hard to believe, but I hear your soul stirring songs while doing a heavy workout almost daily. It’s almost something like an illegal motivation and steroids. Ya, your songs are steroids for soul.. There I said it.",
        "Awesome!!",
        "TLT is almost deformed. Raman started his own thing, which is good music again. Other members are not seen for a while, but let's hope they'll too come up with a bang. \nSeeing TLT live including Raman was one of the most beautiful experiences for me, sad that it's not going to happen again.",
        "The house in your song mazaak has the same name as your house , arya",
        "His house name is arya , and in song mazaak when they both were standing outside the house .. it was also named arya",
        "toote makan... 🏡🏗💔💔",
        "When will you have a concert in mumbai?",
        "Hello Anuv",
        "What are your favourite songs and movies",
        "I have listen antariksh and baarishen Gul",
        "So  pretty",
        "Anuv sir I am your big fan",
        "Please come to Noida",
        "what inspires you as a person and your music? how was your journey soo far, like was it any easy one or it had ups and downs",
        "Bhai daaru peeka rooz tunhara gaana sunn tah hu, bhot help kiye hai merko, dheer dheer overcome ker raha hu life koh.",
        "I love \"riha\" song so much 🥲 thank you for that anuv",
        "Which is more cooler genz or millenials",
        "Hi anuv jainn!! Bigg fan of yours. I wanna ask you two questions:\nHow are you?\nWho's your role model???",
        "Bro where do you record your songs?",
        "Has music helped u through ur hard times?  \nI wanna write songs too but i don't know how to start.. \nHow was it when u wrote ur first song? Were u satisfied?",
        "yes it is!!!!",
        "Hello anuv, big fan 💕",
        "This post hasn't gotten much traction but I love when celebrities coke to Reddit. Personalizes the whole experience of interacting with them.",
        "I've loved your songs since the day I came across your works 💗. How do you write the lyrics? Is it mostly about the stuff going on in your life or imagination?",
        "Hii , yes still here..things are not that great but yeah I m good ..how have you been ?",
        "boob",
        "hey there, your thoughts on hyderabad?",
        "Oh man, I really really hope things get better for you",
        "Hi anuvvvvv\nIm a veryyyyyy huge huge fan of yours \nI really wish to meet you sometime in person and expresss how i feel for you or may be i might just sing antarikshh for you. Thats fkn how i feel for you. \nIloveeeyouuuusomuchhhhh and ommmgggggg antarikshhh is amazing affff and you deserve everything in the world and the gq shoot you look amaze balls and hugggsssssssssssssss \nYoure my moon to the darkest nightssssss \nDont let down your adhe si chand si hasi anytime \nWishing you all the sucesss and loveeeee",
        "Hey Anuv I am your very big fan..I listen your songs almost everyday on loop..keep it up for your good work ❤️🙏",
        "When will the broken houses be rebuilt?",
        "Hmm maybe",
        "NOT MAYBE, have some hope stoopid"
    ],
    "cleaned_text": "hi rindia anuv jain im singer songwriter tries tell stories music im answer questions shoot ask anything edit hey guys much fun ill keep answering questions whenever gon na dinner heh x ",
    "cleaned_title": "hi rindia anuv jain im singer songwriter tries tell stories music im answer questions shoot ask anything",
    "cleaned_selftext": "edit hey guys much fun ill keep answering questions whenever gon na dinner heh x",
    "cleaned_comments": "get inspiration song lyrics based past relationships something lyrics absolutely beautiful keep love music soundcloud u perform delhi next listen rap music favourite rap artistindiannot allowed say yashraj international make part gul really want broken house fixed really many relationship issues life stories culmination various situations come across third party also think wouldve able write deep songs experiencessituations came mumbai last september aam met aayushman unfortunately didnt send demos back although asked would solid told another kid like wants send music learnt lot music industry conference went home made music documenting journey videos since came back jan enrolled music institute im currently recording music dont know get shows songs going release end year steps taking next independent artist make sure get outreach music negative feedback make feel music go choosing artwork song covers hey anuv loved new song challenges faced navigating music industry get inspirations songs ever consider meet greet fans favourite subreddits could collaborate one artist would sorry jindal perfect audience trust impact people genuinely loved music would love hear side jindal hey anuv appreciate beautiful songs make intrigues well songs written itd great share thought process go idea till put words end first started main driving force different anuv jain real life music hey anuv love new single antriksh quite different previous songs made want switch time gon na see songs like antriksh future feel like spokesperson indie artists community india lol top animes shadi karlo merese pwease listen sort rappers juice wrld xxxtentacion yes think thier music potential gone soon hi anuv whowhat serves main inspiration composition melodies songs hahah would love maybe acoustic version first hello anuv wanted aks favourite songs personal songs bollywood song also love music ps favourite songs baarishein mishri kept antariksh feelings years someone special confessed heartbroken handle heartbreak suppose experienced one artists bands inspired making indie music hey wan na say one thing toote makan tutne k baad ache se banaye jaaskte hain phirse would love hear mentioned songs contain easter eggs personal stories could share another example hidden story personal experience behind one songs collabing zaeden howd start singing feel wanted singer yo great get chance interact man im indie singersongwriter hyderabad recently came across music really loved especially alag asmaan ive releasing music bit im shooting shot would absolutely love opinion general insight upcoming song would possible get touch w would definitely understand wouldnt possible hope lovely ama either way cheers coming canada really wan na see perform live plans baarishein socially anxious introvert college deal going rn mentally prepare live gigs considering background shy person rituals routines follow inspiration gul bhai love songs kasoor coldmess tum jab pass kaise likh lete ho itna accha performances known strippeddown intimate style think might explore adding elements instruments future prefer keep simple focus lyrics gets bit heavy sometimes doubts creep try constructive criticism positively ignore unnecessary feedback tough getting hah part antariksh single hey attended concert december experience honestly sukoon feels like absolutely love explain meaning behind every song performing question open releasing full album someday something works rn whats dream outcome years music releases collabs new genres songs bollywood hollywood always say songs based real life experiences past antariksh based whats back story spill tea anuv car watch sport hey much want know really great request please sing guzara next love session hope come kolkata soon yeah antariksh fast flowing song literally one simple beautiful lyrics parents family react career choice always tell story thats always number thing team pick best art style goes w concept first get writing music inspired thank sharing music us bring listeners much peace would describe music uanuvjain coldmess part writing songs also next release explain brief writing process like lyrics phenomenal basic itinerary writing song secret redditor inspiration writing songs bhai collab yoyo honey singh hey thank making songs thing held onto everything going downhill life wan na ask waiting long delhi concert still regret missed one delhi crowd singing along gon na perform college fest vips much happy news unfortunately already know couldnt gon na come delhi tt gon na come uae concert black hoodie really biggest enemy us creatives always think spend time industry start trust take quicker decisions hey anuv would describe words less extended version riha releasing think shift towards electronic music orchestrated music heard c find music heyyy anuv planning perform delhi hey anuv im little sitara universe wan na ask one thing har gana itna zyada relatable kaise likh lete ho im dead heart fan love much keep making kind music tata always meet people listen music shows physically impossible meet everyone really wish could try see many people possible wanted ask mishri since fav said made word bank made riha mishri like back story like songs couldnt really find sharing back story rituals routines follow get creative mindset working new music id love hear sing different languages plans ur inspiration get singing songwriting kind music u like listen except ur genre uanuvjain plans album anytime soon gul jack johnson joseph arthur type vibe maybe thats international artists influenced music know new song based one couldnt gather courage actually confess crush happened still regret look back think actually good couldnt confess hello anuv fan songs q chance collaborate fellow singer would also whats take prateek kuhad everywhere honestly especially humans around haha stories w stories maintain balance artistic integrity catering expectations audience probably asked already inspiration alag aasman wanted say love alag asmaan songs reason started playing ukulele ive watched playing song many times couldnt figure exactly f c c create beautiful melody explain exactly jindal amazing best time dont regret shows ive done always made amazing memories meet nicest people dddd anytime gon na meetup tt could talk hello anuv following youtube since years wanted say music healed alot like lowkey therapy whenever music cheers like nothing else wanted say never stop making wanted ask mishri since fav said made word bank made riha mishri like back story like songs couldnt really find sharing back story pls answerrr ive mind longest time ahahahaha wanted ask also overwhelmed response antariksh different yet beautiful ever work bollywood films series playback singer coming chennai eagerly waiting made go designing song rap style hello anuv im huge fan mazaak love wonderful lyrics youve put song video saw performance live zomaland recently mesmerized friend pranay whos huge huge huge huge fan missed chance saying hi car speeded please say hi hell probably die seeing ever heartbroken hey anuv im big fan first heartbreak listened baarishein loop times lol id love see live performing mumbai next also expect album loved gq cover btw love music close heart thank im artist dream make album cover art someday way nahi dega uanuvjain experience dpsk concert bro hear divines music time day write music thank baarishien thats best city perform india countries want travel perform bitchy thing say could expect collabs happening near future yeah sounds fair ive manifested im gon na meet one day would anuv hold another concert mumbai eagerly waiting loved antariksh u see spike sex life last year find inspiration write immensely beautiful love songs love like even exist writing songs whim whats biggest influencer clicks produce smth new coming hyd clear word would make perfect song title say antariksh comes one time song btw loved music video concept behind song wasnt expecting anuv jain totally blew mind jo tum mere ho releasing please telll thats true totally believe line stand alone lyric part larger body thats entire song itll make sense context work w optimism know things fixed arent possible fixed independent vs signed earns according would u ever release merch aria reference mazaak mv crazyyyyyyy thoughtful collab arman malik hey anuv first huge fan music really love songs questions main sources inspiration started songwriting things mind write songs age start music journey would love work w zaeden hes like brother honestly feel make something brilliant x anuv jain reality define expect assume songs socials new instruments hope incorporate music feel songs potentially featured films hello anuv big fan works especially riha man super proud want know please please please album would love listen album already cmon everyone loves x antariksh different normal genre style experiment thought process mean goood song style earlier songs much prettier lots love anuv new music unique vibe thought keeping tone thoughts putting ep mixtape soon u think masterpiece ppap pikotaro love cookies right ever faced challenges forced make music bollywood heard kind indie artists hoping keep proving wrong every damn time always based part relationships experiences sad happy also thank really means world beloved baby boy everything tear apart yet love u anuv anuv jain karle tu gain khana khale dabhake aur hoja bechain nangi si aatma ko mat de itna dosh bas kar mere bhai aayushman ko karna roast karta hu dil se dil tak ki bat jab tak represent hai mere sath honestly clue love mishri gul barishen riha songs tbh thank hey man really appreciate ur music u r great job dropping ur next songs many relationships past one rn wan na know watch animes hopefully soon delhi crowd amazing always feel home time take reddit antariksh world antariksh looping gul remains closest heart feel expresses exgirlfriend grew breakup liberated toxicity relationship gave like hello anuv latest release antariksh tried rapping coz sounded good beat make rap typefast paced songs like often future like called rap song dont like antariksh called rap right keeps grounded may ask inspiration behind lyrics looks like something experienced deeply past guy get heart broken literally dedicated whole space one person aarghh jealous new song lines beautiful ai cominggg toooo jaipurrrrrrrrrrrr song antariksh love use asmr music heard jojos bizarre adventure theme could collab international artist would pick hi anuv mishri holds special place heart always imagine akin asking parent favourite child songs hold closest bruh thats mad years long time thank much sticking around really hope youve enjoyed journey far hey anuv aspiring singersongwriter herecould please give tips chose chord progression particular song decide scale much love easily heartwarming loving lyrics ive heard song write songs sort help formation lyrics literal translation source feelings words uanuvjain youuuu writeee mean know lyrics meaning song whole idea behind sorryyyy missed live would pls make album songs acoustic versions especially antariksh love lyrics songs come personal experience inspired write antariksh come jaipur plsssss really young moment made realize could musician growing decide wanted musician expect guzara jo tum mere ho ones bit personal wrote mishri riha mom dad lost father years ago wanted write something mom thats songs come mishri wip song riha final song songwriting process please also come goa compose instrument directly first paper use software see composition made digitally omgggggggggg youuuuuuu anuvvvvvv please replyyyyyy hi anything means world trust hey like celebrity yes sir call celeb jiske peeche fan girled gem love songs ans hope meet yo someday till keep sending cute messages insta oh god voice songs giggles love sesh oh ohhhh eyes widen hand mouth giggling etc etc weve heard spotify takes fair share royalties true happy exists people discover music please please make delhi happen soon tour ye bhi mazaak hi toh hai saalo se sadko pe sambhal kar chal rha tha apologies new song missed live songs embodiment home like fr decide want singer experience oppose parents people around inspired pursue career singing prepare mentally physically performance new song antariksh jam loving music evolved lot man stay strong brother true tootey makaan reference really think im perpetually overwhelmed life seems unreal support seems unreal feels like movie tbh antariksh important song like said different wanted see people take think great far want say youre music amazing also voice beautiful last time heartbroken come would love right opportunity presents found ki antariksh ka bg got similar vibes riha coincidence delusion also indie artist best things experience maybe artists dont heyy anuv gf really want know whens next concert bangalore latest single antariksh literally current situation want dedicate song also wan na sing im afraid react afterward accept feelings decline hi anuv absolutely love music thank writing songs mazaak antariksh loop playlist love much plan show delhi anytime soon areeee youuu even anymore ive actually melody head years haha felt guts execute simple hah sir ji gaane famous hone ke baad kaisa feel hota hai hiiiiiiiii pranayyyyyyyyyyyyyy boobs ass autograph ke liye kya karna padega ko gift karna hai friend whos big fan literally helped dark times wanted know friends call anuv pain dear nuv thank writing gul antariksh best songs helped hardest times coming chandigarh soon btw remember gq cover made entire family proud big honour dont take lightly also soon hopefully mumbai second home always amazing perform im waiting finish songs ill go tour hopefully u think bharat chauhans music love ya ahh im sorry thank much answering im glad someone like whos words help us speak feelings emotions could never otherwise favourite independent artist writing wise india also globe okay actually know music almost years honestly lot people baarishein song got hooked want know alag aasmaan like song literally idea reassure support many people man like feel blessed know artist like found music deep thats thing makes actually live thank much existing dude hope meet someday tell feel hug conversations antariksh mind heard much abt never heard song freshers start bro pls make part gul afternoons love sun hits feel lot inspired daylight reason really love magazine cover era coming back goa hey first wan na say songs helped much im grateful music love seeing much love dubai show small fan meetup pleaseee feel influence many peoples life say theyve healed art deal muchh attention expectations much love amazing human songs therapy last years girlfriend well shes huge fan thank listening thats go process writing song like chords structure first lyrics tune first whats opinion western rappers listen favorite experience industry hey man want say youre good didnt like much trolling made fire brighter nah youre good youre amazing keep shining hopefully get see live stay blessed realised must sound creepy intention swear lmao please make english music loved ocean part important time life unfortunately dont speak hindi miss stuff dont think im getting reply j want know love much songs heal take care heya anuv nothing ask thank existing im glad someone like whos words help us speak feelings emotions could never otherwise love amd success future always know youd singer hey anuv antriksh giving different vibes loving wait listen kind song nothing ask need tip express feelings hoping reply make day happy need blessings hugs swear cities offer something different im even diplomatic hard picking talking countries im really looking forward go bangladesh show also uk amaze honestly always felt actually might thing happy know right hope hugs anuv treat people hi anuv jain big fan wan na ask role model come back northeast yes thats actually interesting question hah im sure ya happens naturally sit guitar words come sometimes planning releasing album anytime soon although believe stunning album made existing songs hehe hey anuv favorite artists inspires soon hopefully otherwise mom murder loves song haha think signed artists right well hopefully get someday poet wanted refer relationship broken cant rebuild like sir love ur songs wan na ask inspiration behind magical melody alag aasman especially fr ending prose khali ghar tera yeh chabiyon ki gunj aise tujhe dara rhi tu darna nhi main hu yahi par haina planning drop songs ukulele like alag aasmaan ocean also congratulations million subs youtube hi anuv big fan congratulations success antariksh check insta dms hey anuv plan expand genres havent yet breached like something rock oriented maybe bit funky tunes end ama guess title antariksh actually making views plays go speed rocket man good bad jokes collaboration armaan malik needed anuvvvvvv fav song alag aasman tell whats ur fav song google right youre ludhiana planning singing punjabi hellloooo anuvvvv smoke random ques mahn friend uploaded remix gul instagram check tho got k views ig sidhvora made bunch songs getting much views invest ads music video better option according u link give ur valueable review u tym thanku much reply haa yaarr im pretty chill guy man passionate things like football tennis follow sports religiously get lazy sometimes set friends school like think im funny guy group friends refute claim im little spoilt coz sister mom treat like kid love people fully try good person eat lot nutella watch lot anime replied hey favourite football team manchester united ill cry thatll huge family please come bengaluru perform getting aur tum mere ho song found yet ke toote maka ek baar girte waise bante kaha hai artists want move comfort zone try new things guess want prove pull abnormal get usual style music ill also experiment know good balance heydid good voice since childhoodif improve voice softcan recommend anything sm likes sing people close ears sing planning coming ahmedabad year mumbai musician story teller damn good keep sharing stick ground thats stories come ex came back listening got fame thanks good stuff man time listen therapeutic youve impacted life immensely followed first songs introduced friends songs supported worst times times one side wanted thank way get touch personally also get anuv jain merch anytime soon hiiiii im listening since honestly love songs soo sooo sooo muchhhh waiting concert gorakhpur release jo tum mere ho dont even know youre going read youve helped much exams much stress buster since youve performed lot concerts till favourites different experience perform colleges unis compared normal concert ofcs ik context hv said abt context relationship training classical music loved loved every song always love whatever make future know whats menu n u menu rizz u hello kitty cus want u say hello kitty hello kitty girl rizz take u picture want show santa want xmas xmas rizz u guitar grab neck listen noises u make play w u musician rizz u bus cus wan na fill u annoying kids school rizz u curry cos without would js cry currymucher rizz alien cause outta world alienoligist rizz must baker must dough bc knead baker rizz hennessy cuz ur hen see uno reverse rizz cant kids baby adoption rizz u toy aisles cuz matter age id still go look u toy rizz head course would smash wall need therapy rizz football player cs want touchdown football rizz bedcuz cant stop thinking sleepy rizz sir big fan really dont feel like try thing learn feel songs used memes stuff like think good song getting reach hunter x hunter jjk vinland saga always story would name pet turtle key thing realized made better lyricist songwriter overall bro quit music alright sirmaam writingcomposing songs first love songs curious artist creative process go like integrating storytelling music cool curious started process currently looks like tips beginners also welcome bhai aapke makaan tute hi kyu cant thank enough writing songs really appreciate lockdown would miserable spotify hadnt recommended songs truly therapeutic thank much lots love success friend lol future plans get another song like alag aasmaan go uni study thats great bound happen also please release riha extended jo tum mere ho og kya chahta hai set lyrics wel riha something else ive always socially anxious ive never felt comfortable around people always think much conversations often feel unnatural im getting better ive experienced much last couple years gives lot cool things talk hah shoot video antariksh example actually signing filming audio added whats process like come music video hey anuv firstly loves new song question side things shifted family business musicas said even completed collage love music didnt become conflict everything secondly write amazing lyrics like poetry lot meanings great make write context inspiration thankyou tell us interesting unexpected experiences youve performing touring also im big fan discovered music late december kept listening repeat ever since voice magical wonder think writing deep complicated lyrics one ways expressing feelings emotions lyrical manner base lyrics upon insipirations daily life heartbreak tricky wish could answer never able take gracefully human things affect us think wrote songs felt better hey im big fan heartiest congratulations antariksh amazing really cant stop playing loop best performance career far hope meet someday lots love tlt favourite football club favourite player coming us plans please give many details haha biggest biggest fan songs big part life started many things survived many things songs therapy thankyou much putting talent us safe space home bro itna dard kaha se latey ho feel pressure relevant views memes wholesome offensive made songs love music much helps relax mind whenever im stressed makes feel like home following since happy see reached love love music much helps relax mind whenever im stressed makes feel like home following since happy see reached love views memes wholesome offensive made songs ipl mein kisko support karte ho build career tips im music producer anuv big fan attended concerts mugged every songs heart gul baarishein riha mishri mbmt maula alag aasmaan need hi acoustic version yes ill try million streams views across al platforms close better get work hahah seen toote makan memes whats opinion mom happiest supportive parent believes kids always backs us inspired singer favourite anime u currently watching edit saw u already answered case please share tips becoming better songwriter ever going release rihas extended version hey expect next concert bangalore kyu aaye nhi jinke vaade ever try genre music music filled w easter eggs full real memories song ocean talk tree actually sit upon tree first date person wrote song song mazaak literally walking easter egg word andaaz geotagging location lets see figure haha hiwhatwho inspiration make music wohoooo hope reaches billion soon day cant waitttt anuv bhai ganne ke lyrics ki inspiration kaha se lete ho sir huge respect consistent get artist block stay motivated goal things arent working yes remember hahah also photo isnt flattering chalega seem happy planning tours eu next song coming really love voice god gul barrishein alag asaman favourite next song like please dont tell friends theyll use rest life going perform jo tum mere ho guzara dhaka bangladesh latest flatmate armaan gohil swears songs misses home help gravitate towards lyrics melody day song antariksh released knocked door listen together hope muse blesses make people cry good health soothe spirits even beautiful songs make song girl woh make happy know hard please mhuu im im fingers hurting excessive typing im trying respond everyone time runs said interview camerashy person filming antariksh mv overcome deal camerashyness im happy wouldnt want music heard everyone come problems stresses tho im trying learn deal w hear alag aasmaan first reason voice calms especially riha really listen songs im low like even got anxiety attack lmao always wanted tell dmed instagram tell something special feel riha hey anuv im huge fan never able attend concert live dubai expect concert dubai whats favourite pokemon hi anuv heard singing live vh supersonic amazing always gul came could relate much always remain one favorites love love damn youre sad boy generally make us go pain bhai whats favourite set headphones line reminds meme rather original song cousin played song radio day tried change song song liked went bonkers xd im wrong youre united fan right red devil kast decade impacted music mean pretty tough optimistic love songs fellow red devilhopefully im wrong else embarrassing xd found music calling actually asking stuck position hey anuv chance collaborating foreign artists gf introduced music music left else apart music like education stuff kya banna chahte singer banne ke alawa penis size love god pls pls pls make mishri part love song alag aasmaan acoustic version associate first intense crush idk intense crush thing lol based songs overrated af sure please dont feel bad bhai big fan bhai tujhe dekh ke regret hota hai ki singer kyu nahi bana sahi sahi bataio ek hafte mei kitni bandia propose karti hai p everything going hey big fan since questions already seems answered comments one question side heard software engineer hows corporate life handle bro please suggest song impress gf remains mad hi anuv next performing concerts gurgaondelhi release new songs year alag aasmaan baarishein two songs favorite specially alag aasmaan want another song like alag aasmaan ukulele might even find message ocean messages got ta say love songs damn much every song special place heart fan since oh god glad found music gem anuv look frwd hearing live year turn wanted say ive following music journey insane also remember part online concertunfortunately concert got experience lockdown explaining lyrics playing music amazing songs genuinely heal always therapeutic listening im glad came across music aha would love see play irl sometime brings would coming vadodara found youd performed med school id like see come aaa sending much love insanely proud growth bruhhhh generic comments love ur music could plzzzzzzzzzzzzzzzzzzzz read poetry ache se muh khol kr pronounce kyu nhi krte kya apne aliens dekhe hai song likhte time aliens ke bare socha hai kya makaan ko aliens ne todha tha unke wade kab ayenge toote maakan waise kyu nahi bante hai hey anuv hope fine well fan since barishen years back fav instrument apart guitar bro choose speak faxx proper show ahmedabad learn play guitar u specific music preferences like specific key smth please hold concert pune musical journey start anuv bhai mumbai mai baarishen kavao yaar favorite footballer hyderabad tour next sir reply kardo ladiz log ko flex karna hai whats creative process like tips aspiring artists songs real life experiences toote makan song yogi ji se inspired hoke likha tha kya clear head going creative slump love kya aap thande thande paani se nahate ho hey anuv listening music ever since first heard ocean years back question difference creative process write song english lyrics kitna kma lete ho rookie numbers got ta pump numbers need music videos pleaseeeeee lmfao hey anuv extremely grateful music gul journey beautifully captured emotions touched strings heart ever since heard last year song makes cry whenever listen much listen im alone cry like baby p thank creating magic favourite artists heard one songs last year mazaak day met beautiful woman girlfriend every time see always magical end recalling lyric girta rahoon teri rahon mein aur mein hee kho jaunga end note thank giving us amazing songs hope win life damn bro respect would advise someone wants sing like like register goes pretty high doesnt weight hand sing head voice manage make sound breathy nasally unique voice pls give tips us plebs hii anuv wanted say never really liked music fell love boyfriend also got ta ask would date person thats politically culturally compatible aww man youre actually taking time respond many people canyoure awesome ive always related songs surprisingly bf relate song alag asmaan mostly long distance relationship inspiration motivated write song would suggest one thing couples ldr would suggest hey anuv wanted tell u music throughout breakup phase bet doesnt mean much helped aloot made private playlist repeat long ive completely healed fact youre giving opportunity express proud hope get hate hardships world ease budding artist u deserve love one offer loads love name shreya thank everythinggg also love hairstyle skin perfect u skincare routine use shampoo noooooo way real anuv jain cryyyy istg dude heard alag aasma loop many times lost count thanks song gives new hope everytime weeb wonder itna rr krte ho gaano dont mind im fangirl hey anuv questions wanted convey ur songs amazing whenever feel listen baarishein song gives feels like hope u keep composing amazing songs lots love alsoo please please please organize concert bangalore would love attend hii anuv never really got chance see live would really mean world say hi dont need ask anything music quite well already big fan thanks music dont think youre anymore way many comments xd music frickin amazing belong covid batch school th online met best friend songs tbh hosted meets questions solving played alag aasman repeat went kota songs helped deal absence haha always reminds good times weve plan city sadly preboards shit wish attended though plans coming back lko also tons love appreciation dude frickin love music procedure date live streaming songs mean wanted say song alag aasman one time favourites also one first songs learnt play uke thank much creating thank spreading positivity talent hey anuv mene randomly barishein suna tha like kesa h sun leta hu hooked k views crossing millions haha also bhai jo tum mere ho kab release karre ho antariksh kardiya pehle best ive found last months thanks existing hey anuv first love music much question theres pattern like leave clues song next albumsong like mazaak aria part used album like hints see find brilliant get ideas im trying write songs good also days mood got changed think good give tips concentrate experience hi anuv ive listened songs theyre really soothing listen im kinda interested singing feel voice really deep dont seem make improve way sing sort suggestions applicable would really appreciate suggestions thanks big fan listening music hours help bad times storys comment different vibe keep making music love man big fan favourite song omg wan na say antariksh awesome wan na ask two things first whats opinion rap scene india favourite one would u like collab second gives inspirationstory write lyrics find unexpected procedure deep analysis hey anuv first work amazing man songs listened loop want ask indie artist work impressed recent years hey anuv want tell love work best future keep growing hostel loop gaane chalata tha aapke especially alag aasman room log gana poonchne aate feel parodies made songs hey anuv happened discover youtube music first song heard gul song dear heart relate intimately often take car late night drive song plays loop want say thank part life wish success world extremely talented musician soulful voice hope also make songs available amazon prime whats favourite football club make songs like alag aasman favourite anuv love yr songs alag aasman mishri hear every night gf wan na know u think b u make songs ocean first song heard uploaded youtube listening since like maybe years something certain lines absolutely love songs like wooden beamed south facing house painted pink green tangerine lives rent free mind opinion deceasing quality mainstream music lyrics favourite football club country top players top managers musical inspirationsand inspirations general bhai toote makaan jud gaye kya yes mere kab judenge hi anuv bhaiya ive following yearsthe best part songs inspired real life experiencesmy favourite songs maula mishrimy question iswhat story behind antrikshlove workyou music absolutely beautifulyou inspired get field musicnow small artist myselflots love feel expressing bringing life personal experiences songs songs describes different mood communicate audience feel songs turn want songs way making audience understand deeper part wants tell something anuv please watch demon slayer toote makaan op compose song sing itas songs connected way love music dear keep coming got know u like anime true thx making songs like gul listening ur songs really make feel releifed good man latest single would organize perform concerts soon plsssss come kolkata im dying see perform lot respect really love work gul based life experience seen make anuv jain song mins pretty hillar hiii anuv thanks beautiful songs love bhayy u eat kanda tut te makaan ye line sun rakhi hai bass aaj tak aapke koi gaane ni sune aur isi baat ka mujhe ghamand hai hey basically long story short alag aasman released head heels someone became song turned first heartbreak honestly according spotify stats day first date listened song times god heavenly lol choosing reddit first mistake hey anuv singles super soothing recent one unique style delivered unique way personally liked lot questions end request get cute music video time best song baarishien like trend slowed reverb songs demanding among grils hello bhai u coming bhopal really tricky hopefully find something make feel better birthday went insane year found fav indian artist born day tot riha came know loved song voice song still hits feels whenever listen kaun hai bhai tu never heard question want send love best wishes next music love rendition alag aasman ocean used sing lot ex also love baarishein really love give chords songs helpful watch anime yes favourite one would prefer acoustic electric also many guitars hi bro love songs wdyt pehle murgi aayi ya anda hi recently discovered via song gul completely bowled music lyrics made listen songs also indie singer songs almost brought nostalgic memories teens finding fresh music falling love thank fuckboi sry bhai ek ticket dedo next show ki hyderabad ladki pat jayegi bhai jaan goodwingman pls fellow jjk fan respect advice aspiring musician india listened japanese artist artist alot similar vibes genre city pop would suggest city pop anri miki mitsuba modern artist eve ado kenshi yonezu amazing bas ek gaana accha laga man coincidence listening mishri rn omg tennis fan hope youre gearing roland garros whos fav hi anuv wanted know music therapy many days didnt feel good ive put mishri listened every word sang words magic please come kerala soon theres lot anuv jain fans waiting ive always wanted attend one concerts everytime something goes wrong im unable attend someday hopefully thank words music heal many people following years attended concert boyfriend separated since whenever listen songs gives bittersweet feeling hard put words big fan one fans love ur song feels soothing way favourite song favourite lyricist also loved alag asman changed life inspires write songs tell stories write deep lyrics happen visit lucknow ill bring nutella cake please save comment contact cloud bakery ever feel low cuz memes insta everywhere else btw love music places chose post nice twat heard song got popular really love way sing lots love voice great songs good hard remember got ta make songs simple lyrics easy sing along chorus youll get larger audience bro doesnt know dahej give link comments lucky listen experience student nmims influence music way konse demolition company ke pr ho ass tits idk ama paramparaa hi anuv wanted let know loved antariksh much amazing many songs never released compared ones like would rough ratio hey anuv big fan really regret getting introduced songs really late songs feels man especially situation feels written btw songs written someone mean whats inspiration motivation behind songs apart voicemusic storytelling song something really like poetry basic effective keep songs happy place playlist due keep releases like future guitaracoustic vibe experiment snappy beats like say dhruv moonlight woooooahhhhhhh weirdly specific question im surprised answer fav time day write thing among artists bhai toote makan kaise jode mai abdullah bol rha hu uttar pradesh se hey anuv wan na say really love music attended concert jaipur jk lakshmipatiand dude amazingyour voice stories smile everything beautiful love songs also listen old songs want hear sing jab koi baat bigad jaye jab koi mushkil pad jaye jk lol want sing like voice pathetic whenever something work upon need cope w hey anuv letting know music godly voice soothing love listened music good make tear keep amazing loads love anuv maybe try diversify sometimes music sounds like cas hope keep core maybe elevate experience bit integrating different aspects like agam hi anuv big fan going little hard time life right ur music helped alot wanted ask inspired write song gul ps love anuvvv mazaak mazaak mein mazaak ke wajhe se found loml u going reply bro songs good want know u come lyrics listened gul one amazing song hope make mesmerizing songs future whats favourite football team see joined reddit subs u r really like spend time lmfao bruh feel criticism people music dont believe comes place reality even though sounds good much disagree writing process focus making songs write usually youre feeling hey anuv recent ex big fan use listen songs together give mansi shoutout reply much appreciated art magnificent voice brought spotify premium download songs listen loop travelling songs based personal experience also loveeee songs thank songs keep peace ship theseus object original components replaced remains object countries would like concert hey anuv girlfriend ex started falling love around time released riha associated song relationship boy understand meaning parted ways song make sense although song ends like jab tak miloon nhi taron mein mil kahin question today sir toote makan ghir ke kyon nhi bante hey anuv even though messaged insta send rock version new song antriksh would like review httpsdrivegooglecomdrivefoldersqezabpqzpnuovohnmpkfxqppyacuspsharinghttpsdrivegooglecomdrivefoldersqezabpqzpnuovohnmpkfxqppyacuspsharing feedbacks welcomed baarishein girlfriend asks write beautiful lyrics girlfriend yes please first song ever heard alag asmaan crazy song brought amazing people life wanted say absolutely love music way express songs simply mindblowing keep awesome get concert free travel hotel wish college fest admin support student funded inter man city ucl final barishein always forever heart play games hope enjoyed wedding mussoorie fun time find st georges hi anuv way would say heart wave hey anuv favourite books invited college fest december mumbai whyd youyour team reject thoughts dehradun dale jamboree music festival experience performing dehradun goooo lmao one start path songwriting always interested music childhood never got fulfill wish learning instrument begin process also huge fan ocean anuv tumhe nahi pata hai ki mazaak mazaak mein kya kya ho gaya ek ladka tha jo mere jaise hi gaane sunta tha ek din maine usko bola ki pata hai anuv ka naya gaana aaya hai us din hum dono ne parking garage ke rooftop pe pehli baar mazaak suna aur us din se vo humara gaana ban gaya aur hum hum ban gaye thanks mazaak hello anuv ive come across indiepop like year back im loving scene india course initial songs included gul much adore till date question genres listen instruments play ones favorite huge fan btw following since baarishein posted last cigarette come concepts unique makes stand artists hey anuv hope youre well fellow musician genuinely admire songwriting skills advice find voice authentic writing well coming nepal hello anuv jain dont question ask keep working hard tell us upcoming song messi ronaldo someone else youd like mention songs relate personal life one many please mention one want know depth art artist love ya anuv baarishien time relief even hot summer bro cant express songs means every cheerful moments lowest point life songs felt warm healing aye nahi jinke waadein waqt uljha hua hai tere yahan pe kya woh kal yahan yaan hafton pehlay ki yeh hai dastaan person counted ghosted difficult times used consider closest one song acts like therapy someone came sat beside dark room trying figure go wrong gives hope strength hugs makes believe dont know know count heal aayega ik din jab unki raatein yoon na mehfooz hongi tere tere bin aise tu dekh lena teri kami tab unko mehsoos hogi mujhe mujhe hai pata yeh ha ja rahe ho duur tum kya main hi dil ka musafir ek baar phir tu hanske zara dekh le meri aankhon mein main kaid kar loon har wo pal tera teri ye baatein jo hain representing sweet love story long distance couple seems like made every phase life song amazingly expressed way lifes quite messy lmfao unlike songs adds perfect thing say mad reason good expressing penned exact thoughts feelings towards long distance partner creative way bro ab tere bina yahan meri saansein jaise bina nindiya ki raatein hai toh aur tu hi mere dil ki raza hai tere bina dil bhi khafa hai toh madly love someone planned everything mind achieved level emotional bonding feel incomplete without exact feeling would moment penned beautiful manner talked abt lyrics long music ah even tell abt artist made love every song trust one except anuv jain songs ones listen repeat unlimited time period still cherish extraordinary lyrics music trust say compelled say one artist hold talent never met reality tbh still feel like one family people yes please acoustic version want become big artistsongwriter america think possible im india lower middle class problems may face celebs artists resume like normies portfolio past work stuff suck bro thats got ta say hi anuv dont question want tell im big fan music much time started thinking lost ability appreciate new music could find comfort solace songs listening since childhood songs made believe still appreciate new music playing fifa open profile spotify listen songs randomly theyre soothing hey anuv dont listen indie music bollywood im totally hiphop rap songs would recommend listen anuv jain indie music whats personal fav song others indian foreigner ur musical influences go artists u listen tooplus song recommendations wan na drop thank music man kind art makes feel relief thank pursuing music life recently hi really love songs love fact use real true authentic voice songs people use autotune would like mention live version gul recorded forest sounds real beautiful think artists learn expressions communicated much better real hi really love songs love fact use real true authentic voice songs people use autotune would like mention live version gul recorded forest sounds real beautiful think artists learn expressions communicated much better real lol see listening actually xd mishri riha wan na drop thank music man kind art makes feel relief thank pursuing music cant believe real anuv jain heard song first time u timeline hahah nice song wish great future aria u tell pls songs great love consistent artwith everything need irl make time motivation consistent going point still student job feel like many things need leave energy motivation afterwards would love advice professional hello anuv jain wanted tell something leave girls rest us thank tere muh ke shabad itne controversial section kyu hai think like point cloth patches base layer cant keep going like deteriorating big anuv jain anime fan cant believe watch anime im glad know hope youre still share favourite anime seriesmovies uwu wanted ask whats unpredictable thing ever happened apart ur career would possible meet day since cant get autograph could dear uerror write name fan tho hi anuv love music fan years performing live anytime soon delhi heyy anuv got question herewill ever get mix genre music like one contains type verse rap something mann im bad explaining think got hey nuv im really big fan even want attend concerts badly since im teenager cant feel bad able meet yet year since listening songs helped get many situations im alive one biggest reasons thankyou nuv im forever grateful love desperate mam contented see alive tho love listening songs friends tired hearing sing tootay makan everyday mishri got worst times absolutely love baarishein waiting day come perform pakistan us travel whichever city hear live ayooooo hxh fansss hey anuv come acoustics songs like finger picking pattern chords also took months properly play sing gul lol take care throat dosent get sore sing high notes ease ps love amount intensity put songs absolutely amazing hey anuv jain absolutely love music please marry whats outlook censorship india yearn impact culture like sidhu moosewala rip hahah hes favourite artist thats comment meant joke didnt write seriously please tell us detailed strumming pattern alag aasmaan ukulele ps started learning ukulele song ocean anuv tumhe nahi pata hai ki mazaak mazaak mein kya kya ho gaya ek ladka tha jo mere jaise hi gaane sunta tha ek din maine usko bola ki pata hai anuv ka naya gaana aaya hai us din hum dono ne parking garage ke rooftop pe pehli baar mazaak suna aur us din se vo humara gaana ban gaya aur hum hum ban gaye thanks mazaak need mumbai concert soon hi anuv im aspiring songwriter ive inspired ive looking long time wan na know practice vocals dod learn anywhere natural also one thing really necessary know play instrument compose song compose head well get produced later seeing artists playing instrument performing read reddit cheat girlfriends actually cheat girlfriends would u feel demolish house tootay makaan ik baar gir kar waise bante kahan hai recently started listening songs mostly friends wont shut lol come really enjoy quiet peaceful feeling get songs wanted ask whats next mean plan future new songs new genres maybe damnnn never thought anuv jain watches anime xd thank much really means much working new music also mixes masters music im upcoming musician id love get tips hahah guess well never know love anuvv something ive bit cant really say years ago got music professionally started well enough get im happy whenever listen music end putting alag aasman repeat never discovered much artist hahah im okayish bit stressed tbh havent sleeping properly hanging im barely celebrity really dont like word tbh consider friend comments lives really make chuckle man even im singing saddest one people say funny shit haha didnt reply hey anuv actually met delhi concert jns month august handmade posters amazing music backstage well idk remember wanted say date music amazing im always huge fan thought itll cool dont really much presence reddit maybe thisll help bit never smoked never yes really hope win fa cup split head regarding everyone around tells great definitely drives numbers feel sad coz sad storiesmemories life looking getting reduced meme isnt best thing im learning accept songs path maybe songs one hai although rebuild vibe energy shelldon hey headphones use editing listening music also thoughts frequency chart look like opinion think quality indian music degraded poetry hidden lyrics songs disappeared become words superficial meaning hope music stays relevant ill probably disappear years never seen coz aye na teri yaad unko hurt man im slowly becoming confident funny coz cant explain world like literally freeze front camera dont know hands get awkward ahah im getting better fansign held jaipur jigglypuff pretty cute sings ahah looks difficult rn winning fa cup stoping city winning treble would path restoring glory song like specific order liking dream place want visit life swear tried hot water win well hope somebody didnt identity fraud lol think ahah handle social media always heh decided act like dick someone whos taking time speak people sub easily could chosen dont something nice say keep value comment beyond potentially making someone feel bad creativity music reason ive seen ill watch latest season soon alag aasmaan repeat pe tha bhai jab usne reject kiya shukriya bhai ganon se bhi rulate ho aur abh reply karke bhi love man thode khushal gaane bhi banao plssssssssssssss ive actually never heard one ive pretty vocal fact music comes stories maybe mightve missed real sometimes feel itll difficult write something without using experiences folks unfamiliar music tracks would suggest start love hear music soothing st georges soooo pretty loved football pitch played little best time might send kids years later something ahah fav anime hxh stans assemble aaaaaa antariksh good artwork music video outfit lyrics absolutely love everything loop since th hehe dont existential ive seen grow k yt subscribers million transformation growth makes happy im grateful discovered music youre literally comfort singer songwriter love max like delhi mumbai toote makan want take care family provide good work hopefully remembered someone gave everything else consequence effort put also loved sidhus music man artist long ass story ill make short lockdown battling skin cancer met girl online made feel lot better fell love eventuallyand determined follow due turbulence lives stopped didnt talk months facing mental health issuesduring time thing made feel connected world song ocean ironically together chose shirt jeans matches exactly song cover coincidence manifestation lyrics melody song made want fight physical mental pain going birthday durga puja took first bus reached pink shirt jeans met first time update three years later ive beaten every disease time still thaaank youuu anuv reddit makes us feel like closer artists write meaningful lyrics give us pointers actually execute storytelling song whats biggest regret life oh ahah done w reddit india team ill keep tour anytime soon ik love cats dont get one obsessed w puns werent pursuing music profession would still business something else work nasa youre antariksh loving songs since last years great know love anime well makes happy asking friend im really trying figure tbh havent really happiest thought everything isnt people think im sure ill figure one day fan heard song called baarishein loop amazing experience thanks gul song lyrics tootay makan ik baar gir kar waise bante kaha hai still stuck mind goated lyrics ever confess love antariksh girl remember heh thoughts chooche chusa remember meee kolkata tour anuvv cant wait listen live growth transformation thru years makes happy grateful discovered music deserve whole antariksh please soon missed omg anuv love much music literally amazing shame enough people know im absolutely love antariskh love went comfort zone made something absolutely incredible also please please please come dubai lot fans hi anuv big fan ludhiana jain concert ludhiana girlfriend attended chandigarh concert since really wish could attend concert anyways love songs singer bad songs one favourite singer right antariksh awesome please dont ever stop making music man hope youre good time um remember one lives went like kya nahi hai ye dinraat din teri yaadon mein aur mai like arent exact lyrics tried best decode explain tell us one one original provide link livestream well ask tho love music appreciate man anuv love could go stage name would bsf literally adore sm listened mazaak together time first loved sm kept listening v close heart gon na listen antariksh thanks music take care really really wish best career hope blow fr fr singers come lyrics like similar mood like lyrics describe one feeling bro love songs dont know hindi translated lyrics voice gives calm vibes thank keep rocking tu yedzhava aahes hey anuv great see last try decipher songs believe ive able somehow would please go written would mean lot saw entire concert loved thanks coming football team support please watch monster makan tutta ki nehi hey though dont know ever heard songs apparently living rock wish great career music reflect current music scene india advice aspiring singers age auto tune appreciate response thoughts yoooo love music know youre fan pewdiepie aka felix kjellberg share good memories watching made follow changes influence brofist kisne dil toda bro wanted say gul best work eyes toote makaanik baar gir kar waise bante kahaan hain something hits pretty hard lot people whole song thing absolute beauty bazinga hey anuv love music music starts ends tattoo song gul songs make days brighter nights calmer always fan music tu hai noor sa noor hi hai alag andaz hotel anuv please come delhi university sometimeeeee college ipcw specially next fest season mannn would treattt since said watch lot anime whats favourite anime even realise sentence breaking heart many people excited concert bangladesh find fanbase familiar bengali music want song suggestions next song anuv bhai kya haar aur jeet ke beech bas darr ka dariya hai kya mai jeet ke abaad ho sakta hun aur kya mai haar ke baad chain se reh sakta hun kya mai beech mai nahi reh sakta kya mujhe pala chun na jaruri hai kya koi duniya mai aisa hai jo kisi pakde mai na ho jo na idhar ho na udhar aur na hi beech mai bas wo jo door se dekhta hai anuv dont know reply want tell music awesome want keep going make hits upcoming future cheeerrss hey anuv love music one request please try release songs possible release jo tum mere ho bhai ache gane kab banayega questions big fan baarishen therapy regret heard quite late listening since year hi anuv following since zs days remember went ahead put across youtube channel details onboarding session sadly dont picture proudly say part team magical journey wish best keep shining learn sing hey anuv big fan songs give pretty much genz vibe enjoy lot kinda relatable lyrics cult music perfect day night neon city lights id love concert raipur someday start songwriting since writing songs hey anuv please check suzonn try making collab please also love music man alag aasman made pick guitar years love thank much music healing also please preform hyd baarishein alag aasmaan resonated profound level shared boyfriend revealed among favorites point songs became forever linked grateful creating beautiful music inspired make alag aasmaan wish part baarishein hobknob another one gatherings way sang enthusiastic participation crowd captivating total confidence going answer said dont know heard since platform given opportunity id say spread love spread love spread love need world needs baki find way life gets take care people need okay jokes seriously feel new chocolate boy everyone swoons cuz point like amir cute wasnt anuv jain heard songs loved recommended frens fans ama cool anuv jain definitely someone would love friends someone separate art artist joining fan train heh would ever collaborate prateek kuhaad hey anuv attended concert last december still amazed thank sharing raw real emotions us ever difficult sharing personal songs world emotional connection seeing scrutinized others probably difficult times hey anuv attended concert last december still amazed thank sharing raw real emotions us ever difficult sharing personal songs world emotional connection seeing scrutinized others probably difficult times hey anuv attended concert last december still amazed thank sharing raw real emotions us ever difficult sharing personal songs world emotional connection seeing scrutinized others probably difficult times hi songs beautiful please come bangalore soon also also dead artists blockits like writers block hi songs beautiful come bangalore also also deal artists blockits like writers block hi anuv sure anyone asked yet xd singers songwriters inspired enter field give rough process write songs vocabulary decent still trouble writing songs please make one song sad breakup love feeling low disappointment happy song enemies broo late love voicegul baarishein one favourites era auto tuning voice real deal thank masterpieces missed manifesting regrets happiness bro istanbul mein show kab karoge try writing music start begin songs first line comes inspires new songwriter songs spotify end june rs got music god gifted trained bathroom singer family function star heartbreak made make deep songs need know story resembalates music hey man love music read thread like watching anime friend think biggest fan ever im tryna take watch movie name week shes bit skeptical whole thing tho would great comment back give last push would kill person said thanks tonne best future projects agar toote makan gir kar waise bante nhi hai toh bante waqt hi ambuja cement use kariye jain sahab taki makan ke tootne ki naubat hi na aaye post get recommended live america songs favorites list favorite genre pure hindi lyrics missing genre lyrics edm electronic music give literal orgasm plans btw anuv school ludhiana hope write song finding vinland future wonder still quick reminder stay happy keep smiling like always know much loved ill happy read bruh music awesome spotify told one top listener dunno damn specific keep brother mate baarishein thank one gets hits zone easily effortlessly drift away humming teary eyed melancholic mournful song starts end everytime ps also helps could forget alag aasmaan came across barishein going something difficult helped heal still bad day turn gul alag aasman mishri music voice soothing many way talk love comforting came across many negative comments thread want tell connecting many people songs around anybody doesnt feel like shouldnt bother either thank existing plan learn chords journey enjoyed big fan following yrs sach sach bol music career mine karma haina haina love playing songs heartbreak yes much hope voice words left optimism listening great job come ayodhyauttar pradesh give free tickets students keep expensive students maybe youngest fan ever thats asking favor ever fall love virtual character hey anuv please come chennaiasks puppy eyes please make songs like maula beautiful gave inspiration write first song getting comment feels absolutely unreal okay question helped get darkest phases life also whats favourite indie song different artist great know youre tennis fan alcaraz sinner rune whos favorite possible next big hi anuv away indian indie scene discovered spotify song mazak brilliant age playing writing music influences anuv create publish music independent artists sing melodious song ryming words want songwriter bollywood would procedure make big much time would take really love song ocean hey anuv wan na say thank much songs one else songs healed anyone else wish best life hope reach many manyy heights cus deserve hey anuv want know im love alag aasmaan listen almost everyday sleep hey anuvi jst wan na know got songsand story behind writing antariksh hello anuv songs really awesome introduced many people songs started music journey decide become songwriter fulltime hey inspires make good songs mean sometimes im thought giving suddenly khali ghar tera ye chabiyon ki goonj aise tujhe dara rahi tu darna nhi mai hu yahi par strikes hard things get worse come back go thatteri kami tab unko mehsoos hogi makes give sigh relieve go dies make worth thankyou hes one produces singles youtube spotify whats fav netflix show got singing biggest struggle face getting singing questmay weird love songs types songs aswell parents ever forced pcmpcb weird question guitar hey anuv like thrillerhorror write would assume youre romcom person personally feel like love horror movies u sounds like pokemon name apne makan ambooja cement se q nhi banayetoot te hi nhi love voice much named new born anuv dont speak understand hindi loved still love listening gul baarishein feelings connected beyond languages concert kolkata please beg song mishri brings back memories momthank bestfriend ugly special day wedding birthday would randomly mention even thats truth youd dick hope get haha owned missed ama youre good man whats ur favorite anime parallel universe u werent singer u think u would hey ive still big fan till song baarishein gul hit lot reality lyrics relatable something else would like release like future anuvvvvv love pleaseee thankyouuuu makinggggg myyyy dayyyyyy whats favourite song ever wrote favourite lyric wrote also love work deep hes wrong could please try collaborate would world honestly inspires write songs gul driven past relationship music lyrics change mind hi anuv way lyrics make feel feel guy ever felt deep lyrics id marry never lem go whenever hear music feel like packing bag taking everywhere w music amazing plis sing thank ama got music listening music nonstop kind depressed feelgood songs bring tears eyes songs songs make smile love feeling feeling lighter iteration listening song thank bottom heart nai andaaz threw sitting tree indie artist thoughts emergence new indie artists india please share story inspiration songs particularly alag aasman mishri love music writing feels like telling story dont want others know eventually leaves room interpretation listener adds mystery please live concert delhi wish attend youre inspiration anuv day replied live made day thank existing deserve someone jindal crowd entire concert amazing experience surely way crowded since got see perform live first time became whole air conditioner heard songs spotify liked lot never expected seeing live one day bad couldnt meet person still enjoyed indeed made impact audience whoever least thanks much coming hope see live maybe meet heard remix song snap x baarishen feel love music used listen ocean repeat one point analyzing songs composition wise rythm wise lyrics wise u share technical tips u compose conscious decisions inspiration song bhai ye makaan toote tumhare wo firse bane kyu nahi skill issue hai kya favorite songs right public mein jaana kitta hard ho gya hoga nhi neeche wali dukan se dahi nhi mangva skte honge oda aap loved mazaak man honestly waiting like yeah man democracy nothing nothing ask wanted know alag aasman special place heart could haagen dazs ohh nicee quite understandable big gurl fanbase haha yes lyricism good love gul sm hello sir hope well would like ask biggest regret life moment wish would taken path songs amazingthey touch hearts came across listening alag asmaan ayoooo dear anuv jain hope message finds well first foremost want express admiration incredible talent positive impact youve made lives countless fans including writing today heartfelt request would mean world dear friend darshan jain could receive special birthday wish darshan avid fan work always looked inspiration birthday coming th may believe personalized message would ultimate surprise make day truly unforgettable understand receive numerous messages requests daily truly appreciate time effort spare request even simple birthday greeting words encouragement would bring immense joy happiness darshan genuine connection fans sets apart believe kind gesture would leave lasting impact life within reach could kindly consider sending personalized birthday wish darshan message could form short video social media post format find convenient please let know specific details instructions require fulfill request gladly provide thank taking time read message considering request unwavering support fans truly remarkable testament genuine kindness appreciation supporters involvement would make birthday extraordinary moment darshan cherish forever wishing continued success happiness thank consideration warmest regards anurag bruh sing know hard believe hear soul stirring songs heavy workout almost daily almost something like illegal motivation steroids ya songs steroids soul said awesome tlt almost deformed raman started thing good music members seen lets hope theyll come bang seeing tlt live including raman one beautiful experiences sad going happen house song mazaak name house arya house name arya song mazaak standing outside house also named arya toote makan concert mumbai hello anuv favourite songs movies listen antariksh baarishen gul pretty anuv sir big fan please come noida inspires person music journey soo far like easy one ups downs bhai daaru peeka rooz tunhara gaana sunn tah hu bhot help kiye hai merko dheer dheer overcome ker raha hu life koh love riha song much thank anuv cooler genz millenials hi anuv jainn bigg fan wan na ask two questions whos role model bro record songs music helped u ur hard times wan na write songs dont know start u wrote ur first song u satisfied yes hello anuv big fan post hasnt gotten much traction love celebrities coke reddit personalizes whole experience interacting ive loved songs since day came across works write lyrics mostly stuff going life imagination hii yes still herethings great yeah good boob hey thoughts hyderabad oh man really really hope things get better hi anuvvvvv im veryyyyyy huge huge fan really wish meet sometime person expresss feel may might sing antarikshh thats fkn feel iloveeeyouuuusomuchhhhh ommmgggggg antarikshhh amazing affff deserve everything world gq shoot look amaze balls hugggsssssssssssssss youre moon darkest nightssssss dont let adhe si chand si hasi anytime wishing sucesss loveeeee hey anuv big fani listen songs almost everyday loopkeep good work broken houses rebuilt hmm maybe maybe hope stoopid",
    "light_cleaned_title": "Hi r/India, This is Anuv Jain here, I'm a singer songwriter who tries to tell stories through his music! I'm here to answer your questions so.. SHOOT.. Ask me anything!",
    "light_cleaned_selftext": "EDIT : Hey guys! This has been so much fun! I'll keep answering questions whenever I can. Just gonna have dinner now heh x",
    "light_cleaned_comments": "how did you get the inspiration for your song lyrics? was it based off your past relationships or something? your lyrics are absolutely beautiful and keep doing what you do we love it ❤️ Is your music in SoundCloud When will u perform in Delhi next? Do you listen to rap music?? Who are your favourite rap artist,indian(not allowed to say yashraj) and international will you make a part 2 for Gul, really want the broken house to be fixed Have you really been through so many relationship issues in life or are these stories just a culmination of various situations you have come across as a third party? Also do you think you would've been able to write such deep songs if not for these experiences/situations? I came to Mumbai last September at AAM, met Aayushman, unfortunately didn't send my demos to him back then although he asked me to (would be solid if you told him another kid like you wants to send him music). Learnt a lot about the music industry at the conference. Went home, made some music. Been documenting my journey on videos since then. Came back this Jan, enrolled in a music institute, I'm currently recording my music. I don't know how to get shows and my songs are going to release by the end of this year, what steps should I be taking next as an independent artist to make sure I get the outreach for my music? How does negative feedback make you feel about your music? How do you go about choosing an artwork for your song covers? Hey anuv , loved your new song . What are some challenges you faced while navigating in the music industry? where do you get your inspirations for the songs ? Will you ever consider doing a meet and greet with your fans? Your favourite subreddits? If you could collaborate with one artist only who would it be? i am sorry that jindal was not the perfect audience but trust me you had an impact on people who genuinely loved your music. I would love to hear your side. How was jindal for you Hey, there Anuv! Appreciate the beautiful songs you make ❤ It intrigues me how well your songs are written, it'd be great if you share the thought process you go through while having it as an idea till you put it in words in the end. When you first started, what was your main driving force? How different is Anuv Jain in real life from his music? Hey anuv, love the new single!! <3 Antriksh is quite different to your previous songs, what made you want to switch it up this time and are we gonna see more songs like antriksh in the future? What does it feel like to be the spokesperson of the indie artists community of India lol? Top 3 animes? Shadi karlo merese pwease Do you listen to any sort of rappers such as Juice WRLD or XXXTentacion? if yes, what do you think about thier music and potential if they had not gone too soon Hi Anuv! Who/What serves the main inspiration for the composition of the melodies for your songs? Hahah I would love to! But maybe an acoustic version first? Hello Anuv, wanted to aks what are your favourite songs? Both your personal songs and any other Bollywood song. Also love your music!! P.S:- My favourite songs are Baarishein and Mishri I had kept that Antariksh of feelings in me for 2 years for someone very very special to me but when I confessed I was heartbroken, how did you handle your heartbreak? (I suppose you experienced one too) Any artists or bands which inspired you into making indie music? Hey just wanna say one thing toote makan tutne k baad or ache se banaye jaaskte hain phirse would love to hear it🙌 You mentioned that your songs contain Easter eggs and personal stories. Could you share another example of a hidden story or personal experience behind one of your songs? When are you collabing with zaeden?? Howd you start with singing? And when did you feel you wanted to be a singer? Yo, great to get a chance to interact with you man. I’m an indie singer-songwriter from Hyderabad and recently came across your music - which I really loved! (Especially Alag Asmaan) I’ve been releasing music for a bit and I’m shooting my shot here but would absolutely love your opinion and general insight on an upcoming song. Would it be possible to get in touch w you about this? Would definitely understand if that wouldn’t be possible too. Hope you have a lovely AMA either way. Cheers :) When are you coming to canada? I really wanna see you perform live Any plans on Baarishein 2.0? Were you socially anxious and introvert in college? How did you deal with it? (Going through it rn) How do you mentally prepare yourself for live gigs, considering your background as a shy person? Are there any rituals or routines you follow? What was your inspiration for GUL Bhai love your songs kasoor, cold/mess, tum jab pass. Kaise likh lete ho itna accha? Your performances are known for their stripped-down, intimate style. Do you think you might explore adding more elements or instruments in the future, or do you prefer to keep it simple and focus on the lyrics? It gets a bit heavy sometimes. Doubts do creep in but I try to all the constructive criticism positively and ignore the unnecessary feedback. Its tough but we're getting there hah Will there be a part 2 of Antariksh? Are you single?👀❤️ Hey, attended your concert in December and the experience was honestly what \"sukoon\" feels like. I absolutely love how you explain the meaning behind every song before performing it. My question for you is- Are you open to releasing a full album someday? Is it something in the works rn? What’s your dream outcome in 5 years? More music releases, more collabs, new genres of songs, Bollywood, Hollywood? You always say that all of your songs are based on your real life experiences from the past. What is ANTARIKSH based on? What's the back story? Spill the Tea Anuv. 😂 what car do you own? + do you watch any sport? Hey not much I just want you to know that you are really great at what you do. And I just have a request for you to please sing Guzara in your next love session! Hope you come to Kolkata soon! And yeah antariksh is a fast flowing song with literally one of the most simple and beautiful lyrics!! 🪞 How did your parents (and family) react to your career choice? It always has to tell a story! That's always the number 1 thing. Then me and the team, we pick the best art style that goes w the concept How did you first get into writing music? What inspired you? Thank you for sharing your music with us, you bring your listeners so much peace!💗🌸 How would you describe your music? u/anuvjain cold/mess part-2 when Are you writing more songs? Also when will next release? Can you explain in brief what your writing process is like? Your lyrics are phenomenal ❤️ What is your basic itinerary for writing a song? Are you a secret redditor? 👀 Inspiration while writing the songs!? bhai collab with yoyo honey singh Hey, thank you for making such songs <3 The only thing which i held onto when everything was going downhill in the life . I wanna ask , been waiting for so long for a delhi concert, i still regret that i missed the one With the 17000+ delhi crowd singing along with you . Then you were gonna perform at our college fest (VIPS) , and i was so much happy on that news , but unfortunately as you already know , you couldn't. When are you gonna come to delhi ? (TT) When are you gonna come to UAE for concert? Can I have your black hoodie? :⁠^⁠) You can really be your biggest enemy! Us creatives always over think! But as you spend more time in the industry you start to trust yourself and take quicker decisions Hey anuv, how would you describe yourself in 6 words or less? When is the extended version of Riha releasing? What do you think about the shift towards electronic music over orchestrated music. Have you heard of c418? How do you find his music Heyyy anuv! When are you planning to perform in Delhi again ? Hey anuv , I'm a little Sitara in your universe Just wanna ask one thing har gana itna zyada relatable kaise likh lete ho. I'm your dead heart fan . Love you so much keep making this kind of music . Tata. I always meet \"people who listen to my music\" after shows. It's physically impossible for me to meet everyone! I really wish I could but I try to see as many people as possible <3 i wanted to ask about mishri since its my fav.. you said it was made out of a word bank that you made for riha but did mishri have like a back story just like all of your other songs do.. i couldn't really find you sharing any back story about it..💭 Do you have any rituals or routines that you follow to get into the creative mindset when working on new music? I'd love to hear you sing in different languages. Do you have plans for it? Who was ur inspiration to get into singing - songwriting ?? And ... what kind of MUSIC do u like to listen to ( except ur own genre ) ?? u/anuvjain is there plans for an album anytime soon? Gul has a very Jack Johnson / Joseph Arthur type vibe to it but maybe that's just me. Which international artists have most influenced your music? We know the new song is based how one couldn't gather their courage to actually confess to their crush, so that happened with you ? , Do you still regret that or look back and think it's actually good that you couldn't confess then . Hello there Anuv! Fan of your songs ♥️ Q- If you had the chance to collaborate with a fellow singer, who would it be and why? Also what's your take on Prateek Kuhad? Everywhere honestly! Especially from all the humans around me haha! My stories w them, their stories, all of it How do you maintain a balance between artistic integrity and catering to the expectations of your audience? Probably asked already - what was your inspiration for alag aasman? Just wanted the say I love alag asmaan and the song's the reason I started playing ukulele. I've watched you playing the song many times but couldn't figure what you exactly do between f c and c7 to create that beautiful melody. Can you explain what do you exactly do...? Jindal was amazing! I had the best time. I don't regret any of the shows that I've done. Have always made the most amazing memories and meet the nicest people :DDDD Is there anytime gonna be a meetup (TT) , where we all could just talk with you. Hello anuv i have been following you on youtube since 7 or 8 years i just wanted to say your music has healed me alot its like my lowkey therapy whenever i m down your music cheers me up like nothing else i just wanted to say never stop making it 🥺❤️ i wanted to ask about mishri since its my fav.. you said it was made out of a word bank that you made for riha but did mishri have like a back story just like all of your other songs do.. i couldn't really find you sharing any back story about it..💭 pls answerrr, I've had this in my mind for the longest time now ahahahaha,🤞 Just wanted to ask how are you doing? Also are you overwhelmed by the response on ANTARIKSH. It's so different yet so beautiful 🥹🤌 Will you ever work for any bollywood films / series as playback singer? When are you coming to Chennai! Eagerly waiting for you What made you to go about designing this song in a rap style? Hello Anuv . I'm a huge fan of Mazaak. I just love the wonderful lyrics you've put for the song and the video. I saw you performance live at Zomaland recently and was mesmerized. My friend Pranay who's a HUGE HUGE HUGE HUGE fan OF YOURS missed the chance of saying hi to you (your car speeded up). Can you please say Hi to him here (he'll probably die on seeing this) Have you ever been heartbroken ,? hey anuv, I’m a big fan! During my first heartbreak I listened to baarishein on loop 15 times lol. I’d love to see you live, when will you be performing in Mumbai next? Also when can we expect an album? Loved the gq cover btw i love your music and it’s so close to my heart. thank you for that <3 i’m an artist and it’s been a dream to make your album cover art someday. is there a way? Nahi dega u/anuvjain How was the experience at dpsk concert? Bro you hear to divine's music? what time of the day do you write your music the most in? Thank you for baarishien. That's all Which was the best City to perform in India? And which countries do you want to travel to perform? This is such a bitchy thing to say 🥱 Could we expect some Collabs happening in the near future? Yeah sounds fair... I've manifested that I'm gonna meet you one day!🤞🏻😬❤️ When would Anuv hold another concert in Mumbai?? Eagerly waiting for it and loved your Antariksh 🤍💌💗✨ Did u see a spike in your sex life last year where do you find the inspiration to write such immensely beautiful love songs, does love like that even exist? are you writing songs on a whim? What's your biggest influencer that clicks you to produce smth new? When are you coming to hyd again. 🥹 How are you so clear with what word would make the perfect song title.? say ANTARIKSH as it comes only one time in the song. Btw, I loved the music video and the concept behind the song. Wasn't expecting this from Anuv jain. It totally blew my mind !! When will \"Jo tum mere ho\" will be releasing??... Please telll. That's very true! I totally believe that but that line is not a stand alone lyric. It's a part of the larger body and that's the entire song. It'll make sense in that context. But I work w optimism and I know things can be fixed until they just aren't possible to be fixed further :,) Independent vs signed who earns more According to you Would u ever release your own merch? That ARIA reference from MAZAAK mv was crazyyyyyyy so thoughtful🫡🪄 Collab with Arman malik? Hey Anuv, First of all, A HUGE fan of your music and really love your songs. I have 2 Questions: 1. Who were your main sources of inspiration when you just had started songwriting and what are some things in your mind while you write any of your songs? 2. At what age did you start your music journey? Would love to work w ZAEDEN! He's like a brother and I honestly feel that we can make something brilliant! x How is Anuv jain , in reality ? How will you define yourself , Expect from how we assume you through songs and the socials , What new instruments do you hope to incorporate in your music? How do you feel about your songs potentially being featured in films? Hello Anuv, I am a big fan of your works, Especially Riha man, I am super proud of you, I just want to know, that please please please can we have an album? 💗 We would love to listen to your album already C'mon everyone loves you x Antariksh is different from that of your normal genre and style.. was it just an experiment? What was the thought process? I mean it's a goood song, but, the style in your earlier songs is much prettier.. lots of love Anuv the new music had a very unique vibe! Do have any thought on keeping the same tone ? and have you any thoughts of putting out an EP or Mixtape soon ? what do u think about the masterpiece that is PPAP by pikotaro You love cookies right? Have you ever faced challenges or have been forced to make music for Bollywood? Heard that it's not kind to indie artists and hoping that you keep proving them wrong every damn time!!! it always based on part relationships and experiences! All of it. Some sad, some happy. Also, thank you. That really means the world :D Some of it is :) my beloved my baby boy my everything you tear me apart & yet i love u anuv 😭❤ Anuv jain Karle tu gain Khana khale dabhake Aur hoja bechain Nangi si aatma ko mat de itna dosh Bas kar mere bhai aayushman ko karna roast Karta hu Dil se Dil Tak ki bat Jab tak represent hai mere sath 🫣 Who you? I honestly have no clue. I love mishri, gul, barishen, riha, all your songs tbh. thank you for being you. Hey man, I really appreciate ur music, u r doing great job, when are y dropping ur next songs ? How many relationships you had in your past and are you in one rn? I wanna know too if he watch animes !! Hopefully soon! Delhi crowd is amazing and I always feel at home there time to take over reddit now😈🫶🏻 Antariksh is “out of the world (antariksh)”. Looping on it!! Gul remains closest to my heart. I feel it expresses how my ex-girlfriend grew over our breakup and liberated from the toxicity that the relationship gave her. I like it for her! :) Hello Anuv , So In your latest release Antariksh, Did you tried rapping coz it sounded very good on that beat. Will you make more rap type/fast paced songs like these often in future? Do you like it being called a Rap Song? You don't like Antariksh being called a rap right?? What keeps you grounded? May I ask what is your inspiration behind those lyrics?? Because it looks like something you have experienced deeply in the past. How can this guy get his heart broken. He literally dedicated the whole space to that one person. Aarghh ! I am jealous. The new song and the lines 😭 it’s too beautiful Are you an AI When are you cominggg toooo jaipurrrrrrrrrrrr The song antariksh is love Do you use ASMR in your music? Have you heard JoJo’s Bizarre adventure theme? If you could collab with an international artist, who would you pick? Hi Anuv, Mishri holds a very special place in my heart, and always will. I imagine it's akin to asking a parent about their favourite child, but which of your own songs do you hold closest? Bruh that's mad! 7 years is a very long time. Thank you so much for sticking around. I really hope that you've enjoyed the journey so far Hey anuv, aspiring singer/songwriter here....could you please give me some tips for how do you chose a chord progression for particular song and how do you decide the scale? much love to you<3 सालों से सड़कों पे सँभल के चल रहा था यूँ गालों के गड्ढों में तेरे ना जाने क्यूँ मैं लड़खड़ा के गिर गया हूँ मुस्कुराओ, और ऐसे हँसो मेरी बातों पे गिरता रहूँ तेरी राहों में, और इनमें ही खो जाऊँगा ए चाँद, अब चाँदनी बनके गिरो ज़रा गिरते रहो मेरे आस-पास, तो तेरा ही हो जाऊँगा These are easily some of the most heartwarming and loving lyrics I've heard in any song. How do you write your songs? Do you have any sort of help in formation of your lyrics and is it just a literal translation of your source feelings into words? u/anuvjain How did youuuu writeee it i mean i know the lyrics meaning but the song whole what was the idea behind it sorryyyy missed the live Would you pls make an album of your songs acoustic versions... Especially antariksh. I love it. Do all the lyrics of the songs come from your personal experience? what inspired you to write antariksh? Just come to Jaipur plsssss!! When you were really young, was there a moment that made you realize you could be a musician growing up? how and when did you decide that you wanted to be a musician When can we expect Guzara and jo tum mere ho? :) This ones a bit personal. I wrote both Mishri and Riha for my mom and dad. I lost my father a few years ago and wanted to write something from my mom to him. That's where the songs come from. Mishri is the \"WIP\" song and Riha is the final song Your songwriting process please. Also come to Goa!!! Do you compose on your instrument directly or first on paper. Do you use any software for the same and how do you see composition made digitally? Omgggggggggg how are youuuuuuu Anuvvvvvv please replyyyyyy just hi or anything it means the world to me trust me Hey, You are like the only celebrity (yes sir i will call you a celeb) jiske peeche i have fan girl-ed the most. YOU are a GEM, love your songs ans I hope to meet yo someday, till then I will keep sending you cute messages on insta OH MY GOD YOUR VOICE, YOUR SONGS, YOUR GIGGLES, YOUR LOVE SESH. oh. Ohhhh eyes widen hand on mouth giggling etc etc We've all heard that Spotify takes more than a fair share of royalties. Is that true or are you happy it exists so that more people can discover your music? Please please make delhi happen soon 🥺!! when are you doing a tour again? ye bhi mazaak hi toh hai >!saalo se sadko pe sambhal kar chal rha tha !< apologies What is the new song about? I missed the live :((((( your songs are embodiment of a home like fr when did you decide that you want to be a singer? Did you experience oppose from your parents or people around? What inspired you to pursue a career in singing? How do you prepare yourself mentally and physically before a performance? Your New song Antariksh has been such a jam loving it, your music have evolved a lot man. Stay strong brother. Is it true that \"tootey makaan\" is a 9/11 reference I really am! I think I'm perpetually overwhelmed. This life seems unreal. The support seems unreal. Feels like a movie tbh! Antariksh is a very important song for me. Like you said its so different! I wanted to see how people take it. I think it's been great so far Just want to say you're music is amazing Also, your voice is beautiful When was the last time you were heartbroken and how did you come out of it ? Would love to if the right opportunity presents itself! I found ki Antariksh ka BG got similar vibes as Riha. Was it some coincidence, or is it just me having a delusion? Also, as an indie artist, what are some of the best things you can experience which maybe other artists don't? Heyy anuv!! Me and my gf really want to know when's your next concert in Bangalore? 🥺 About your latest single 'Antariksh' It's literally my current situation... i want to dedicate that song to her and also wanna sing it to her but I'm afraid about how she will react afterward... will she accept my feelings or will she decline.. Hi Anuv, i absolutely love your music! Thank you for writing songs. MAZAAK and ANTARIKSH are on loop on my playlist. Love you so much <33. Do you plan on having a show in Delhi anytime soon? Areeee youuu even there anymore I've actually had the melody in my head for about 4 years now haha! I just felt that I had the guts to execute it now. Simple hah Sir ji gaane famous hone ke baad kaisa feel hota hai? HIIIIIIIII PRANAYYYYYYYYYYYYYY Boobs or ass💀 Autograph ke liye kya karna padega? SO ko gift karna hai. I have a friend who's a big fan of you has literally helped her through dark times. She just wanted you to know that. My friends call you Anuv Pain 💀💀💀 Dear nuv, Thank you for writing gul and antariksh. They are the best songs and have helped me through my hardest times. Are you coming to Chandigarh soon? btw you remember this? That GQ cover has made my entire family so proud! Its such a big honour and I don't take it lightly. Also, soon hopefully. Mumbai is my second home and its always amazing to perform here. I'm just waiting to finish a few more songs and I'll go on tour hopefully What do u think about bharat chauhan's music? Love ya both ahh, I'm sorry about it.. but thank you so much for answering.. I'm glad we have someone like you who's words help us speak feelings and emotions which we could never otherwise <3 Who is your favourite independent artist writing wise? In India and also all over the globe? Okay I have actually know you and your music for almost 2.5 years now and honestly for a lot of people baarishein is the song that got them hooked to you but I just want you to know that for me Alag Aasmaan is like THE SONG! You literally have no idea how you reassure and support so many people out here man!! Like I feel so blessed that I know an artist like you and that I found your music because deep down that's the thing that makes me actually live!! Thank you so much for doing what you do and for existing dude!! I hope to meet you someday and tell you how I feel about you in a hug!!<3 Until then I am having conversations with you in the Antariksh of my mindಥ⁠‿⁠ಥ I heard so much abt you but never heard any song of yours so where should freshers should start ? Bro pls just make part 2 for gul🥹 Afternoons. I love it when the sun hits. I feel a lot more inspired in daylight for some reason. I really love your magazine cover era When are you coming back to Goa? Hey first of all just wanna say that your songs have helped through so so much and I'm just so grateful for your music, I love you :) And seeing how much you love Dubai, why not do a show here or some small fan meetup pleaseee? How does it feel to be to be an influence in so many people's life when they say that they've healed because of your art? And how do you deal with so muchh of attention and expectations? And Much Love To You<3 You are An Amazing Human Being your songs have been my therapy for the last 2 years now and My Girlfriend as well she's a HUGE fan of yours<3 Thank you for listening to it. That's all ❤️ What is your go to process for writing a song? Like chords structure first or lyrics or tune first? What’s your opinion on western rappers? Do you listen to any of them Which has been your favorite experience in this industry? Hey man, I just want to say you're good. I didn't like you that much and trolling made the fire brighter but nah. You're good. You're amazing keep shining! Hopefully I get to see you live! Stay blessed! :) Just realised this must sound creepy.. not my intention I swear lmao Can you please make more English music? I loved Ocean and it was part of an important time in my life Unfortunately, I don't speak Hindi so I miss out on your other stuff. i dont think im getting a reply but i j want you to know that i love you so much. your songs heal me ❤ take care!!! heya anuv, nothing to ask for now but to just thank you for existing.. I'm glad we have someone like you who's words help us speak feelings and emotions which we could never otherwise <3 . all the love amd success for you in future. 🍀 did you always know you'd be a singer? Hey Anuv. Antriksh is giving different vibes. Just loving it. Will wait to listen to you in this kind of song. 🤍 Nothing to ask just need a tip about how will I express to her about my feelings? Hoping for a reply to make my day happy. Need blessings and hugs. ❤️🙈 I swear all cities offer something different. I'm not even being diplomatic. It's hard picking a few. Talking about countries, I'm really looking forward to go to Bangladesh (I have a show there). Also, UK will be amaze too! Honestly I always felt that this actually might be a thing. Happy to know I was right :) Hope and hugs to you Anuv❤️ How to treat people HI ANUV JAIN!!!!!!! BIG FAN OF YOURS!!!! just wanna ask how are you and who is your role model??? Will you come back to Northeast again? If yes, then when😭? That's actually such an interesting question hah. I'm not sure ya. It happens very naturally. I just sit with my guitar and words just come to me sometimes Are you planning on releasing an album anytime soon? Although I do believe that a stunning album can be made out of your existing songs too hehe! Hey Anuv, your favorite artists who inspires you? Soon hopefully otherwise my mom will murder me! She loves that song haha I think signed artists right now but we'll hopefully get there someday What the poet wanted to refer is that once a relationship is broken it can’t be rebuild like before. Sir in love with ur songs wanna ask the inspiration behind the magical melody alag aasman especially fr that ending prose \"Khali ghar tera yeh chabiyon ki gunj aise tujhe dara rhi tu darna nhi main hu yahi par\" HAINA????????????????? Are you planning to drop some more songs on the ukulele like Alag Aasmaan and OCEAN? Also congratulations on 1 million subs on YouTube Hi Anuv! Big Fan! Congratulations on the success of Antariksh. (Check your Insta DMs)🥹 Hey Anuv! Do you plan to expand into genres which you haven't yet breached into? Like, something more rock oriented, or maybe a bit funky tunes? How did you end up doing this AMA? 🤣 I guess it's the title Antariksh that is actually making the views and plays go with the speed of a rocket man!🚀 I am too good at bad jokes :,) A collaboration between you and armaan malik is needed ANUVVVVVV MY MOST FAV SONG OF YOURS IS ALAG AASMAN!!!!!!! TELL ME WHATS UR FAV SONG ????? If Google is right, you're from Ludhiana. So are you planning on singing in punjabi? HELLLOOOO ANUVVVV Do you smoke? (Just a random ques) Mahn my friend uploaded a remix of Gul on Instagram, do check it out tho it got 67k views IG: @sidhvora I have made a bunch of songs but not getting much of views should i invest on ads or music video which is a better option according to u Link - Give ur valueable review if u have tym to do Thanku so much for the reply. HAA YAARR!!!!!!! I'm a pretty chill guy man. I am very passionate about a few things like football and tennis and I follow both sports religiously. I get lazy sometimes. I have the same set friends that I had in school. I like to think that I'm the funny guy of my group but friends will refute that claim. I'm a little spoilt coz my sister and mom both treat me like a kid. I love people fully. I try to be a good person. I eat a lot of Nutella and watch a lot anime! 😭❤️you replied Hey is your favourite football team Manchester United?? I'll cry. That'll be so huge for me and my family Please come to Bengaluru and perform! When are we getting aur tum mere ho song Did you found yet ke ... Toote maka ek baar girte to waise bante kaha hai ? As artists we all want to move out of our comfort zone and try new things. I guess we just want to prove ourselves that we can pull off the abnormal. I will get to my usual style of music. But I'll also experiment once a while. You know have a good balance. Hey.......did you have a good voice since childhood?....if not how did you improve your voice to be so soft...can you recommend anything for sm1 who likes to sing but people close their ears when they sing :( Are you planning on coming to Ahmedabad this year? Or Mumbai? More than musician you are a story teller and you are damn good in it, keep on sharing stick to ground because thats where the stories come from. Did any of your ex came back after listening to you before you got fame. Thanks for good stuff man, there is a time when i just listen to you and its therapeutic. You’ve impacted my life immensely. I followed you from your first songs, introduced all my friends to you!!! Your songs have supported me through the worst of times the times I had no one by my side. So just wanted to thank you. Is there any way I can get in touch with you more personally? Also can we get Anuv jain merch anytime soon? hiiiii I'm listening to since 2020 and honestly I love your songs soo sooo sooo muchhhh waiting for your concert in gorakhpur and release of \"Jo tum mere ho\" i don't even know if you're going to read this or not but you've helped me so much during my exams so much as stress buster 😭😭😭😭😭🌙 Since you've performed in a lot of concerts till now, are there any favourites for you? And how different is the experience for you when you perform in colleges or unis compared to a normal concert? Ofcs ik the context and I hv said above abt the same context of relationship Do you have any training in classical music? I have loved and loved each and every song of yours and will always love whatever you make in the future❤️❤️❤️ You know whats on the menu? Me \"n\" u (menu rizz) Are u hello kitty? cus i want u to say hello to my kitty (hello kitty girl rizz) can i take u a picture because i want to show santa what i want for x-mas (x-mas rizz) Are u a guitar be when I grab your neck I listen to the noises u make when I play w u (musician rizz) Are u a bus cus I wanna fill u with annoying kids (school rizz) Are u curry cos without you i would js cry (currymucher rizz) Are you an alien cause you outta this world (alienoligist rizz) I must be a baker and you must be dough bc I knead you (baker rizz) are you Hennessy? cuz ur the only Hen i see (uno reverse rizz) I can't have kids, so will you be my baby? (Adoption rizz) Are u the toy aisles cuz no matter my age id still go look at u (toy rizz) Are you my head? Course i would smash you against a wall (I need therapy rizz) Are you a football player ?cs I want you too touchdown on me (football rizz) Are you my bed?Cuz I can't stop thinking about you (Sleepy rizz) sir big fan I really don't feel like that. I just try to do my own thing and learn more How do you feel about your songs being used in memes or stuff like that? Do you think it's good as the song and you are getting more reach? HUNTER X HUNTER JJK VINLAND SAGA Why always a story? What would you name a pet turtle? What is that key thing you realized that made you a better lyricist and songwriter overall? Bro just quit music Alright sir/ma’am. Do you 🍃🚬 before writing/composing your songs? First off love you songs. Just curious as an artist myself, how does your creative process go? Like integrating storytelling with music is cool and was curious how you started out with it and what your process currently looks like. And any tips for beginners are also welcome. Bhai aapke makaan tute hi kyu the? I can't thank you enough for writing songs. I really appreciate what you do, lockdown would have been so miserable if Spotify hadn't recommended your songs. Truly therapeutic they are. Thank you so much !! Lot's of love and success to you. Will you be my friend???? (Lol) What are your future plans? Will we get any another song like Alag Aasmaan? Did you go to uni? If you did, then what did you study there? That's great. It's bound to happen.. (Also please release Riha extended with \"Jo tum mere Ho\".. with the OG \"..kya chahta hai\" set of lyrics as wel.. Riha is just something else.. ) I've always been socially anxious. I've never felt too comfortable around people and I always think too much. Conversations often feel unnatural but I'm getting better. I've experienced so much over the last couple of years. Gives me a lot of cool things to talk about hah When you shoot the video for Antariksh for example, are you actually signing while filming or is the audio added after? Whats the process like to come up with the music video? Hey! Anuv firstly loves your new song. There is a question from my side about how things were when you shifted from your family business to music(as you said) and you even completed your collage so your love of music didn't become a conflict with you and everything and secondly you write amazing lyrics like a poetry has lot of meanings which is great so what make you write in that context only (inspiration?)? Thankyou 😊 Can you tell us about any interesting or unexpected experiences you've had while performing or touring? also im a big fan of yours I discovered your music in late December and have kept listening to them on repeat ever since. Your voice is magical! I wonder what you think before writing such deep and complicated lyrics. Is just one of your ways of expressing your own feelings and emotions in a lyrical manner or do you base the lyrics upon insipirations from daily life? Heartbreak is very tricky! I wish I could answer it but I was never able to take it to gracefully. We're all human and these things do affect us. I think I just wrote songs about it and felt better Hey, I'm a big fan of yours! Heartiest congratulations on Antariksh, it is just amazing💕. I really can't stop playing it on loop. What has been the best performance of your career so far? I hope to meet you someday, lots of love to you! TLT! 100% Your favourite football club and your favourite player? When are you coming to the US? Any plans? Please give me as many details as you can haha! Biggest biggest fan. You and your songs are a big part of my life. It started many things, i survived many things because of it and your songs are my therapy. Thankyou so much for putting out talent because for some of us you are a safe space and home.❤️❤️❤️ Bro itna dard kaha se Latey ho....🙃 Do you feel the pressure of being relevant!? What are your views on memes (both wholesome and offensive) being made on your songs ? I love your music so much it helps me relax my mind whenever I'm stressed and just makes me feel like home. I have been following you since 2019 and i am so happy to see where you have reached now ☺️ more love to you !!! 🤍🤍 I love your music so much it helps me relax my mind whenever I'm stressed and just makes me feel like home. I have been following you since 2019 and i am so happy to see where you have reached now ☺️ more love to you !!! 🤍🤍 What are your views on memes (both wholesome and offensive) being made on your songs ? ipl mein kisko support karte ho? How did you build up in your career? Any tips? Im a music producer Anuv, big fan of yours! Attended your 2 concerts, mugged up your every songs by heart, Gul, Baarishein, Riha, Mishri, MBMT, Maula, Alag Aasmaan. Just need your Hi! An acoustic version, yes! I'll try doing it at 200 million streams + views across al platforms. We are close! I better get to work hahah Have you seen \"Toote Makan\" memes? And what's your opinion about it? My mom was the happiest! She is the most supportive parent. She believes in her kids and always backs us What inspired you to be a singer? Favourite anime? And what are u currently watching Edit: saw u already answered this. In that case, please share some tips for becoming a better songwriter Are you ever going to release RIHA's extended version??????😭😭 Hey! When can we expect your next concert in Bangalore? Kyu aaye nhi, Jinke the vaade??😭😭 will you ever try other genre music ? My music is filled w Easter eggs! It's full of real memories. In my song 'ocean' I talk about a \"tree\". I actually did sit upon a tree on my first date with the person I wrote that song for. My song Mazaak is literally a walking Easter egg. the word Andaaz is me geotagging a location. Let's see if you can figure it out? haha Hi,What/Who is your inspiration to make music? Wohoooo!!! I hope it reaches 1 billion too soon some day! Can’t waitttt!🥹✨🤍 Anuv bhai ganne ke lyrics ki inspiration kaha se lete ho Sir huge respect for you. How to be consistent, Get over artist block? Stay motivated to goal when things aren't working?? Yes I do remember this hahah! Also, that photo isn't the most flattering but chalega I seem happy Are you planning to do any tours here in the EU? When is your next song coming!?? I really love your voice and my god \"GUL \" And \" Barrishein \" And \" Alag asaman\" Are my favourite, is your next song like them?? Please don't tell me friends? They'll use this for the rest of my life Are you going to perform Jo Tum Mere Ho and Guzara in Dhaka, Bangladesh? My latest flatmate, Armaan Gohil, swears by your songs. He misses his home and cannot help but gravitate towards your lyrics and your melody. The day your song Antariksh was released, he had knocked on my door to listen to it together. I hope your muse blesses you to make people cry (very good for health) and soothe their spirits with even more beautiful songs. Can you make a song about a girl woh make you happy i know its hard but please mhuu I'm here I'm here. My fingers are hurting from the excessive typing. But I'm trying to respond to everyone before the time runs up You said in an interview that you were a very camera-shy person. After filming the Antariksh mv, how did you overcome, or deal with camera-shyness? I'm very happy! Who wouldn't want their music to be heard by everyone. It does come with it's problems and stresses tho. I'm trying to learn how deal w it. Hear Alag Aasmaan first For some reason your voice calms me especially RIHA😩 I really do listen your songs when Im low like even once when I got a anxiety attack! Lmao I always wanted to tell you this I DMed on instagram😂 Tell me something special you feel about RIHA Hey anuv, im a huge fan of yours but have never been able to attend a concert because i live in dubai. When can we expect a concert in dubai? What's your favourite Pokemon? Hi Anuv Heard you singing live at Vh1 supersonic. You were amazing as always❤️ When GUL came out, I could relate to it so much. It is and will always remain one of my favorites. Only love and love for you🤗 Damn so you're not a sad boy generally? Why make us go through this Pain bhai... What's your favourite set of headphones This line reminds more of a meme rather than the original song 😂 My cousin played your song on the radio the other day. I tried to change the song to a song I liked but he went bonkers. xD If I'm not wrong, you're a united fan, right? Has being a red devil over the kast decade impacted your music? I mean, it's pretty tough being optimistic. Love your songs. -a fellow red devil(hopefully I'm not wrong else it's embarrassing xD) when and how you found out that music is your calling , actually asking for myself only been stuck in the same position Hey Anuv , any chance of you collaborating with foreign artists? My gf introduced me to your music… and now your music is all that left 😔 What else do you do apart from music?? Like education and stuff. Kya banna chahte singer banne ke alawa?? Penis size? For the love of God pls pls pls 🙏🙏🙏 make Mishri Part 2 I love your song alag aasmaan acoustic version. I associate it with my first intense crush. Idk if intense crush is a thing lol <3 Based. your songs are overrated af, not sure why! please don't feel bad about it. Bhai big fan here. Bhai tujhe dekh ke regret hota hai ki singer kyu nahi bana. Sahi sahi bataio ek hafte mei kitni bandia propose karti hai ? :P How is everything going? Hey! Big fan here. Since most of my questions already seems to be answered in the comments. I had one question from my side. Heard that you are a software engineer? How's your corporate life and how do you handle it? Bro please suggest a song to impress my gf !!!! She remains mad at me Hi Anuv, when are you next performing and will there be any concerts in gurgaon/delhi ? Will you release any new songs this year? Alag Aasmaan and baarishein two songs are my most favorite (specially Alag Aasmaan). I want another song like Alag Aasmaan that has ukulele in it. You might not even find my message in this 'ocean' of messages , but all i gotta say is that i love you and your songs so damn much!! Every song has a special place in my heart ❤️😭 I have been a fan since 2019 and oh my god, i am so glad to having found your music, you are a gem Anuv, i so look frwd to hearing you live this year as I turn 18!!! just wanted to say that I've been following your music for 6y now and the journey has been INSANE!! I also remember being a part of the online concert(unfortunately the only concert I got to experience) you had during lockdown and you explaining the lyrics and playing the music was amazing. Your songs genuinely heal and it's always been so therapeutic listening to you and I'm so glad I came across your music aha!! Would love to see you play irl sometime! <3 (Which brings me to, would you be coming to Vadodara again? I found out you'd performed in a med school there and I'd like see you if you come again aaa!!) Sending you so much love!! And insanely proud of all of the growth! 💗 Bruhhhh very generic comments that i love ur music But could you plzzzzzzzzzzzzzzzzzzzz read some of my poetry???? Ache se muh khol kr pronounce kyu nhi krte kya apne aliens dekhe hai ?? song likhte time aliens ke bare me socha hai ?? kya makaan ko aliens ne todha tha ?? unke wade kab ayenge ?? toote maakan waise kyu nahi bante hai ?? Hey anuv. Hope you are fine and doing well. A fan of yours since barishen some 7-8 years back. What is your fav instrument apart from guitar bro choose to speak faxx When will you have a proper show in ahmedabad? how did you learn to play the guitar Do u have specific music preferences? like a specific key or smth? Please hold a concert in Pune again. How did your musical journey start? Anuv bhai Mumbai mai 'Baarishen' kavao yaar.. Who is your favorite footballer When Hyderabad tour next? Sir reply kardo, ladiz log ko flex karna hai ❤ What's your creative process like? Do you have any tips for aspiring artists? are your songs from real life experiences? Toote Makan song Yogi Ji se inspired hoke likha tha kya? What do you do to clear your head when going through a creative slump? Do you love me? Kya aap thande thande paani se nahate ho Hey, Anuv! Been listening to your music ever since I first heard 'Ocean' about 3-4 years back. My question to you is: Is there any difference in your creative process when you write a song with English lyrics? Kitna kma lete ho? Those are rookie numbers. You gotta pump those numbers. We need you in your MUSIC VIDEOS pleaseeeeee !!!! Lmfao Hey Anuv, I am extremely grateful for your music. Gul has been a journey for me. It beautifully captured my emotions and touched the strings of my heart ever since I heard it last year. It's the only song that makes me cry whenever I listen to it (so much so that i only listen to it when I'm alone and cry like a baby :P). Thank you for creating this magic ✨️ Who are your favourite artists? I heard one of your songs last year (Mazaak) and it was the day I met this beautiful woman, and she is now my girlfriend.. every time I see her, it is always magical and I end up recalling the lyric: Girta rahoon teri rahon mein Aur in mein hee kho jaunga Just on the end note, thank you for giving us such amazing songs and hope you win more in life ✨ Damn bro respect How would you advise someone who wants to sing like you do? Like my register goes pretty high but it doesn't have the weight in it. On the other hand when you sing in head voice you manage to make it sound breathy and not nasally. You have such a unique voice. Pls give some tips to us plebs hii anuv, just wanted to say that i never really liked your music until i fell in love with my boyfriend, also, i gotta ask, would you date a person that's not politically and culturally compatible with you? Aww man you're actually taking the time to respond to as many people as you can...you're awesome :') I've always related to your songs and surprisingly me and my bf relate to your song Alag Asmaan ( mostly because we are in long distance relationship) what was your inspiration or what motivated you to write that song and if you would suggest one thing to couples in ldr what would you suggest? HEY ANUV!! just wanted to tell u that your music was there with me throughout my breakup phase. I bet it doesn't mean much to you, but it helped me aloot! I made a private playlist , they was on repeat for so so long! Now I've completely healed, and the fact that you're doing this now, is just giving me an opportunity to express how proud I am of you! hope you can get through all the hate and hardships of this world with ease, because as a budding artist u deserve all the love one can offer you :)) loads of love! my name is shreya and thank you for everythinggg. also love your hairstyle and skin, it's perfect, do u have a skincare routine? or just use an 8-1 shampoo😭 Noooooo way this is the real ANUV Jain I ll cryyyy istg Dude, I have heard Alag Aasma on loop so many times, that I have lost count. Thanks for a song that gives me a new hope everytime. So you are a weeb? No wonder itna rr krte ho gaano me /s Don't mind me, I'm just here to fangirl hey anuv. no questions, just wanted to convey that ur songs are amazing and whenever i feel down, i just listen to baarishein, the song gives me feels like no other! hope u keep composing amazing songs. lots of love. alsoo please please please organize a concert in bangalore i would love to attend it!!!!! Hii Anuv, I never really got a chance to see you live. It would really mean the world to me if you say hi. Dont need to ask anything as your music does that quite well already. Big fan, thanks for your music! I don't think you're here anymore and there are way too many comments xD. But your music is frickin amazing. I belong to the covid batch of school so our 11,12th were online. Met my best friend through your songs tbh. Other than that we hosted meets for questions solving and we played \"alag aasman\" on repeat. After that she went off to kota, and again your songs helped me to deal with the absence haha. It always reminds me of her and the good times we've had. You had a plan in my city, sadly we had preboards and shit. I wish I had attended though. Any plans of coming back to lko? Also, tons of love and appreciation dude. I frickin love your music. What is the procedure to date you... 🤔 so that I can have a live streaming of you🤩 your songs I mean😋 I just wanted to say your song 'Alag Aasman' is one of my all time favourites. It's also one of the first songs that I learnt to play on my Uke. Thank you so much for creating it and thank you for spreading positivity through your talent! hey anuv mene randomly barishein suna tha and i was like kesa h sun leta hu and after that i was hooked and it had some 59k views on it and now t its crossing millions haha also bhai “ jo tum mere ho” kab release karre ho antariksh kardiya pehle😭😭😭💔💔💔 You are the best I’ve found over the last few months. Thanks for existing 🫶🏻🥺 Hey anuv! first of all i love you and your music so so much . My question is there's this pattern like you leave clues in your song for the next album/song like in mazaak that \"aria\" part and which is used in this album and there like hints we see and i find it so brilliant . how do you get such ideas? I'm trying to write some songs and it is good also but after some days my mood got changed and I think it's good but not that (but it is) can you give me some tips to concentrate on your own experience. Hi Anuv. I've listened to few of your songs and they're really soothing to listen. I'm kinda interested in singing but I feel that my voice is really deep and I don't seem to make the most out of it. How can I improve the way I sing if you have any sort of suggestions which are applicable. Would really appreciate your suggestions. Thanks! ☺️ Big fan of yours listening your music about 2 hours it help me in my bad times and story's in your comment are different vibe keep making music love you man big fan Which is your favourite song? ( not by you) omg i just wanna say ANTARIKSH IS AWESOME Just wanna ask two things First: what's your opinion on the rap scene in india, your favourite one and would u like a Collab? Second: what gives you the inspiration/story to write lyrics and how do you find it? Is it an unexpected procedure or deep analysis? Hey Anuv, first of all, your work is amazing, man! All your songs can be listened to on a loop. I want to ask, which indie artist work has impressed you the most in the recent years? Hey Anuv, Just want to tell you I love your work and all the best for the future. Keep growing :) Hostel me loop me gaane chalata tha aapke Especially alag aasman Room me log gana poonchne aate the How do you feel about the parodies being made on your songs ? Hey Anuv, I happened to discover you on YouTube Music. Your first song I heard was Gul, and it's a song very dear to my heart as I relate to it very intimately. Often I take my car out for late night drive and this is the only song that plays on a loop. I want to say thank you to you for being part of my life and wish you all the success in the world. You are an extremely talented musician with a soulful voice. I hope you also make your songs available on Amazon prime. What's your favourite football club? Will you make more songs like alag aasman? Its my favourite. Anuv love yr songs alag aasman and mishri i hear them every night with my gf I wanna know what u think b4 u make those songs Ocean was the first song I had heard by you when you had uploaded it on youtube. Have been listening to you since then. It has been like maybe 6 years or something. There are certain lines that I absolutely love in your songs. Like that wooden beamed, south facing house painted pink, green and tangerine lives rent free in my mind. What is your opinion of deceasing quality of mainstream music lyrics? favourite football club? country? top 5 players? Top 3 managers? Who are your musical inspirations?(And inspirations in general) Bhai toote makaan jud Gaye kya? If yes then mere kab judenge ? HI! Anuv bhaiya.... I've been following you for a few years....the best part about your songs is that they are inspired from your real life experiences....my favourite songs are Maula and Mishri.....My question to you is\"what is the story behind Antriksh?\"........love your work....you music is absolutely beautiful....you inspired me to get in the field of music....now I am a small artist myself...Lots of love ❤️😌 How do you feel about expressing or bringing to life your own personal experiences through your songs? Each of your songs describes a different mood of yours and how you communicate with your audience, do you feel your songs turn out as you want to and your songs are the only way of making the audience understand a deeper part of you that wants to tell something? Anuv please watch demon slayer😩❤️ toote makaan op If I compose a song for you will you sing it?as all your songs are connected to each other some way or the other Love your music dear ! Keep it coming ! 👏👏👍 I got to know u like anime is it true ? 😭 And thx for making songs like GUL .. listening to ur songs really make me feel releifed ..it's just so good man 😭. Now that your latest single is out, would you organize and perform concerts soon? PLSSSSS COME TO KOLKATA, IM DYING TO SEE YOU PERFORM <3 I have a lot of respect for you and I really love your work. Is Gul based on your life experience? Have you seen that “how to make anuv Jain song in 2 mins?” Pretty hillar Hiii anuv . Thanks for your beautiful songs. . And Love you. Bhayy Do u Eat Kanda? \"Tut te makaan\" ye line sun rakhi hai bass aaj tak aapke koi gaane ni sune aur isi baat ka mujhe ghamand hai:) Hey so basically long story short. when alag aasman was released I was head over heels for someone. It became our song. Turned out to be my first heartbreak too. But honestly according to my Spotify stats, the day me and her had our first date, I listened to that song 68 TIMES!!!!! God heavenly. lol choosing reddit was his first mistake Hey anuv, all of your singles are super soothing and the recent one is a very unique style which you delivered in a very unique way, I personally liked it a lot. No questions from my end, just a request that Can we get a cute music Video for your all time best song \"Baarishien\" ? Do you like the trend of slowed and reverb songs? you are the most demanding among grils Hello Bhai. When are u coming to Bhopal? It really is very tricky. Hopefully I find something to make me feel better. ;) ME and YOU have the same birthday, i went insane this year when i found out my most fav indian artist was born on the same day as i was ToT “Riha” by you was how I came to know about you. Loved the song and your voice. This was in 2019. The song still hits me in the feels whenever I listen to it. Kaun hai Bhai Tu? Never heard of you? No question... Just want to send you love.. and best wishes for your next music. I love your rendition in 'alag aasman' and 'ocean'. I used to sing them a lot to my ex... I also love \"Baarishein\". Really love that you give chords of your songs.. very helpful.. Do you watch anime?? If yes then which is your favourite one? What would you prefer: acoustic or electric. Also how many guitars do you own? Hi bro, love your songs ! wdyt pehle murgi aayi ya anda? Hi, I recently discovered you via your song Gul, and have been completely bowled over by its music and lyrics. It made me listen to your other songs and also other indie singer songs. I am in my 30's and it almost brought the nostalgic memories of my teens and 20's of finding fresh music and falling in love with it. Thank you. Are you a fuckboi?? Sry 🤣 Bhai ek do you ticket dedo next show ki (in Hyderabad ) ladki pat jayegi bhai jaan. Be a good-wingman pls😭🤞 Fellow JJK fan respect any advice for an aspiring musician in india? Have you listened to Japanese artist because some artist have alot of similar vibes as you it's in the genre of city pop, i would suggest from city pop anri, miki mitsuba, but as modern artist from there eve, ado, kenshi yonezu are amazing Bas ek gaana accha laga Man what a coincidence! listening mishri rn. omg a tennis fan, i hope you're gearing up for Roland Garros!! who's your fav ? Hi Anuv, I just wanted you to know that your music is therapy. There have been so many days when I just didn't feel good, and I've put Mishri and just listened to every word you sang. Your words are magic. Please come to Kerala soon, there's a lot of Anuv Jain fans there who are waiting for you. I've always wanted to attend one of your concerts but everytime something goes wrong and I'm unable to attend. Someday, hopefully. Thank you for your words and your music, which heal so many people. I have been following you for 5+ years now. I attended your concert with my boyfriend, but we are separated now. Since then, whenever I listen to your songs, it gives me a bittersweet feeling which is hard to put in words :\") not a big fan but one of your fans.. love ur song.. feels soothing in a way Your favourite song ? Who is your favourite lyricist? Also loved alag asman. Changed my life. What inspires you to write songs that tell stories? How do you write such deep lyrics If you happen to visit Lucknow, I'll bring you a Nutella cake!! So please save this comment and contact me when you do! I own a cloud bakery do you ever feel low cuz of the memes on insta and everywhere else? btw love your music Of all the places for this, you chose this post? Why? Is it nice to be a twat? I did heard some of your song before they got popular I really love the way you sing Lots of love ✨ Your voice is great and songs are good, but hard to remember.. You gotta make few songs with simple lyrics and easy to sing along chorus.. You'll get a larger audience then bro doesn't know what dahej is just give the link in comments if you are lucky he will listen How was your experience as a student at NMIMS? Did it influence your music in any way? Konse demolition company ke PR ho ? Ass or tits?!, idk just and AMA paramparaa😂 Hi Anuv, just wanted to let you know that I loved Antariksh very much. You are amazing. How many songs of yours are never released compared to the ones which are Like what would be a rough ratio ? Hey Anuv, Big fan. I really regret getting introduced to your songs really late. Your songs have the feels man. Especially in the situation I am in, it feels it’s written just for me. Btw, are these songs written for someone? I mean what’s inspiration or motivation behind the songs? Apart from your voice/music, the storytelling in the song is something I really like, poetry, basic but so effective. I keep your songs in my happy place playlist due to this. Will you keep your releases like this in future too with guitar/acoustic vibe or experiment with some snappy beats in between like say, how dhruv does in moonlight ? Woooooahhhhhhh 💀❤️ Weirdly specific question but I’m surprised he had an answer for that. Is fav time of the day to write a thing among artists 😳 Bhai toote makan kaise jode? Mai Abdullah bol rha hu uttar pradesh se. Hey anuv, just wanna say I really love your music I attended your concert here in Jaipur in JK Lakshmipati....and dude you were amazing....your voice , your stories , your smile , everything was beautiful. I love your songs!!~~ also do you listen to old songs? I want to hear you sing “Jab koi baat bigad jaye, jab koi mushkil pad jaye” jk lol but i too want to sing, for like myself but my voice is pathetic whenever I do so.. is it something I can work upon or i just need to cope w it? Hey Anuv, just letting you know, your music is GODLY. Your voice is SO SOOTHING I LOVE IT. I have listened to all of your music. It just so good. Some make me tear up . Keep doing what you doing. You are AMAZING. Loads of LOVE. Anuv, maybe try to diversify? Sometimes your music sounds like CAS, all the same. Hope you can keep your core but maybe elevate the experience a bit why integrating different aspects, like how Agam does. Hi Anuv, I am a big fan of yours. I am going through a little hard time in life right now ur music has helped me alot. I just wanted to ask that what inspired you to write the song GUL? P.S. LOVE YOU♥️♥️ Anuvvv, mazaak mazaak mein, Mazaak ke wajhe se, I found the loml <3 :”) If u going to reply to this than bro you songs are good and i want to know that how do u come up with your lyrics?? ... I have listened to Gul and that is one amazing song and i hope you will make more mesmerizing songs in future.. What’s your favourite football team Where you from I see that you joined reddit in 2021 . Which subs u r really like and spend time on . Lmfao bruh 💀 I feel the criticism that people have had with your music is how they don't believe it comes from the place of reality even though it sounds very good. How much do you disagree with them. What is your writing process? Do you focus on making songs or do you write usually what you're feeling? Hey Anuv, my most recent ex is a big fan of yours! We use to listen to your songs when we were together. Can you give Mansi a shoutout in reply? Much appreciated if you do! Once again your art is magnificent. your voice is just too 🤌🤌 brought spotify premium just too download your songs to listen on loop while travelling Are all your songs based on personal experience? Also I loveeee your songs. Thank you for the songs that keep me at peace! 'Ship of Theseus' - an object which has had all of its original components replaced remains the same object? Which countries would you like to do a concert in? Hey Anuv, Me and my girlfriend (now ex) had started falling in love around the time you released Riha. I associated that song with our relationship, but boy did I not understand the meaning. Only now when we have parted ways does the song make sense. Although for me the song ends like this; Jab tak miloon nhi, taron mein mil kahin. Now for the question, How you doing today? Sir toote makan ghir ke kyon nhi bante? hey anuv even though i messaged you on insta but i will again send you my rock version of your new song antriksh :-) would like your review [https://drive.google.com/drive/folders/14QezABP6qz8PnUOVoHnMP9KfXqpPYA1C?usp=sharing](https://drive.google.com/drive/folders/14QezABP6qz8PnUOVoHnMP9KfXqpPYA1C?usp=sharing) feedbacks welcomed from all... Baarishein 🩵 My girlfriend asks how do you write such beautiful lyrics? Do you have a girlfriend YES PLEASE The first song I ever heard was \"Alag Asmaan.\" It's crazy how that song brought some amazing people into my life. I just wanted to say that I absolutely love your music! The way you express yourself through your songs is simply mind-blowing. Keep doing what you do because it's awesome! Can we get you for a concert for free, just the travel and hotel. We wish for a college fest with no admin support, only student funded .. Inter or Man. City in ucl final? Barishein is always and forever in my heart Do you play any games?? Hope you enjoyed the wedding in mussoorie. Was a fun time. How did you find St. Georges? hi anuv❤️! in what way would you say that your heart is a wave? Hey anuv, your favourite books? We had invited you to our college fest.. at December in Mumbai.. why'd you/your team reject it.. :( Thoughts about Dehradun Dale Jamboree music festival? How was your experience performing in Dehradun? Where did you goooo Lmao How can one start on the path of songwriting? I have always been interested in music, but childhood me never got to fulfill his wish of learning an instrument. Where to begin? Is there a process to it? Also, huge fan of Ocean ❤️ Anuv! Tumhe nahi pata hai ki Mazaak Mazaak mein kya kya ho gaya. Ek ladka tha jo mere jaise hi gaane sunta tha. Ek din maine usko bola ki, \"pata hai, Anuv ka naya gaana aaya hai\". Us din, hum dono ne, parking garage ke rooftop pe, pehli baar Mazaak suna, aur us din se vo humara gaana ban gaya aur hum, \"hum\" ban gaye:\") all thanks to Mazaak. Hello Anuv, I've come across Indie-Pop like a year back and I'm loving the scene in India. And of course, my initial few songs included 'Gul' and I very much adore it till date! <3 Now to my question, what other genres do you listen to? What instruments can you play? Which ones your favorite? Huge fan btw. Been following you since baarishein was posted by the last cigarette. How do you come up with concepts which is unique and makes you stand you out from the other artists? Hey Anuv! Hope you’re well. As a fellow musician, I genuinely admire your songwriting skills. Any advice on how can I find my ‘voice’ and be authentic with my writing as well? When are you coming to Nepal again? hello, anuv jain. I don't have any question to ask you, just keep working hard. Tell us about your upcoming song Messi or ronaldo?? (or someone else you'd like to mention) Does any of your songs relate to your personal life. If one or many please mention one. We just want to know the depth is in the art or in the artist himself:] love ya Anuv ❤️ ^ You baarishien is all time relief : even in this hot summer^ Bro, i can't just express what your songs means to me. Through every cheerful moments to the lowest point of my life, your songs felt warm and healing. \"Aye nahi, jinke the waadein Waqt uljha hua hai tere yahan pe Kya woh kal the yahan? Yaan hafton pehlay ki yeh hai dastaan?\" The person on whom you counted on, but they just ghosted at the most difficult times. But you used to consider them as your \"closest one\" This song, acts like a therapy... As if someone just came and sat beside you, while you are in a dark room trying to figure out where did you go wrong. He gives you hope, strength, hugs you and makes you believe in yourself again. You don't know him, but you know you can count on him and he can heal you. \"Aayega ik din Jab unki raatein yoon na mehfooz hongi Tere, tere bin aise Tu dekh lena Teri kami tab unko mehsoos hogi Mujhe Mujhe hai pata yeh\" \"Ha ja rahe ho duur tum to kya? Main hi to dil ka musafir To ek baar phir tu hanske zara Dekh le meri in aankhon mein Main kaid kar loon har wo pal tera Teri ye baatein jo hain\" Representing a sweet love story between a long distance couple. Seems like he just made every phase of my life a song, but in an amazingly expressed way. My life's quite messy lmfao unlike his songs. He adds the perfect thing to say when she is mad at you for some reason. I am not good at expressing and he just penned my exact thoughts and feelings towards my long distance partner, in the most creative way. How do you do this Bro!!? \"Ab Tere Bina Yahan Meri Saansein Jaise Bina Nindiya Ki Raatein Hai Toh Aur Tu Hi Mere Dil Ki Raza Hai Tere Bina Dil Bhi Khafa Hai Toh\" When you are madly in love with someone and you have planned everything with them in your mind, you achieved such a level of emotional bonding with them, you just feel incomplete without them. Again, the exact feeling you would have at that moment penned in a beautiful manner. I talked abt lyrics so long. What about the music? AH! do I even have to tell abt that?? There is no artist, that made me love each and every song of them, trust me, no one, EXCEPT ANUV JAIN! His songs are the only ones which i can listen on repeat for unlimited time period, and still cherish the extraordinary lyrics and music. Trust me, I have to say, i am compelled to say, he is the one and only artist to hold such a talent. I never met you in reality, but tbh you still feel like one of my family people Yes please, the acoustic version I too want to become a big artist/songwriter in America. Do you think it’s possible being I’m from India Lower middle class ? What are the problems I may face ? Do celebs and artists have a Resume like we normies do? Or just the portfolio of their past work and stuff? You suck bro, that's all i gotta say Hi Anuv, I don't have a question, I just want to tell you that I'm a big fan of your music, so much so that for some time I had started thinking that I had lost the ability to appreciate new music and could only find comfort and solace in the songs that I had been listening to since childhood. But, your songs made me believe that I can still appreciate new music. While playing FIFA, I just open your profile on spotify and listen to all your songs randomly, they're so soothing. Hey Anuv, I don't listen to Indie music or Bollywood, I'm totally into Hip-hop and rap. Which songs would you recommend me to 1. To listen to Anuv Jain. 2. Indie music. whats your personal fav song of yours and others both indian and foreigner Who are ur musical influences or go to artists that u listen too..Plus any song recommendations ? Just wanna drop by to thank you for your music man. There is a kind of art that makes you feel relief. And yours is that. Thank you for pursuing music. How has life been to you recently? Hi I really love your songs. I love the Fact that you use your Real True authentic voice in your songs than most of the people who use Autotune. I would like to mention The live version of GUL you recorded in the Forest. It sounds so real and beautiful. I think other artists should learn this from you. Some expressions can be communicated much better when its Real Hi I really love your songs. I love the Fact that you use your Real True authentic voice in your songs than most of the people who use Autotune. I would like to mention The live version of GUL you recorded in the Forest. It sounds so real and beautiful. I think other artists should learn this from you. Some expressions can be communicated much better when its Real Lol! See, i was listening to you actually XD Mishri and then riha Just wanna drop by to thank you for your music man. There is a kind of art that makes you feel relief. And yours is that. Thank you for pursuing music. I can't believe this is the real Anuv Jain Just heard your song for the first time and now u are on my timeline hahah nice song wish you a great future Aria? Can u tell what is it pls your songs are just great, love them How to be consistent with our art?...with everything we need to do irl, how to make out the time, motivation and be consistent with it. I am going to point out that I am still a student and do not have a job, and I feel like there are so many things I need to do which leave me with no energy or motivation afterwards... Would love some advice from a professional. Hello Anuv Jain, I just wanted to tell you something, Leave some girls for the rest of us. Thank you Tere muh ke shabad itne controversial section me kyu hai? I think it’s more like at some point the cloth has more patches than it’s base layer and you can’t keep going like that. It’s deteriorating. A big Anuv Jain and anime fan here!!!! I can’t believe you watch anime too!!!!! I’m so glad to know that. I hope you’re still there and can share some of your favourite anime series/movies UwU Just wanted to ask what's the most unpredictable thing that has ever happened to you apart from ur career.? And would it be possible for me to meet you some day 😭? Since I can't get an autograph here, Could you do a dear u/error1105 and just write your name? 🗿 But fan tho! Hi Anuv, Love your music.. been a fan for years now. Performing live anytime soon in Delhi? Heyy Anuv, got a question here......Will we ever get a mix of genre music from you?? Like one which contains your type of verse with rap or something?? Mann I'm bad at explaining but I think you got it :) Hey nuv, im a really big fan of yours. I even want to attend your concerts so badly but since im just a teenager, i can't. And then i feel so bad for not being able to meet you yet. It has been a year since i have been listening to your songs and you have helped me get out of so many situations. Im here ,alive, and you are one of the biggest reasons for it. Thankyou nuv. Im forever grateful and i love you.🥺 Why so desperate mam?? (Contented to see you alive tho) I love listening to your songs!!! My friends are tired of hearing me sing \"tootay makan\" everyday. 😂 Mishri got me through some of my worst times and I absolutely love Baarishein! Waiting for the day you will come and perform in Pakistan or in the US!!! Will travel to whichever city just to hear you live ❤️ ayooooo hxh fansss Hey Anuv how do you come up with the acoustics of your songs like the finger picking pattern and the chords…..? Also it took me 3 months to properly play and sing GUL lol. And how do you take care of your throat so that it dosent get sore and you can sing high notes with ease...? PS: I love the amount of intensity you put in your songs , absolutely amazing ❤️‍🔥 Hey Anuv Jain! I absolutely love you and your music. Please marry me. What's your outlook on the censorship in India, do you yearn to have impact on the culture like Sidhu Moosewala (RIP)? Hahah he's my favourite artist that's all, the comment was meant as a joke didn't write it seriously Please tell us the detailed strumming pattern for Alag Aasmaan Ukulele. PS. I started learning ukulele because of your song Ocean. Anuv! Tumhe nahi pata hai ki Mazaak Mazaak mein kya kya ho gaya. Ek ladka tha jo mere jaise hi gaane sunta tha. Ek din maine usko bola ki, \"pata hai, Anuv ka naya gaana aaya hai\". Us din, hum dono ne, parking garage ke rooftop pe, pehli baar Mazaak suna, aur us din se vo humara gaana ban gaya aur hum, \"hum\" ban gaye:\") all thanks to Mazaak. we need a mumbai concert soon🥹 Hi Anuv, I'm an aspiring songwriter and I've been very inspired by you, I've been looking up to you for a very long time. • I wanna know how you practice your vocals, dod you learn it from anywhere or is it natural? • Also one more thing is it really necessary to know how to play an instrument to compose a song or we can compose it in our head as well and then get it produced later on? Seeing all these other artists who are not playing any instrument while performing. i read here on reddit that you cheat on your girlfriends do you actually cheat on your girlfriends? how would u feel when i demolish your house? (Tootay makaan Ik baar gir kar waise bante kahan hai?) I recently started listening to your songs (mostly because my friends won't shut up about it, lol), and have come to really enjoy the quiet and peaceful feeling I get from some of the songs. So what I wanted to ask was, what's next? I mean, what do you plan you doing in the future? new songs, new genres maybe (..??) Damnnn never thought anuv Jain watches anime xD Thank you so much! That really means so much 🤍 Are you working on any new music? Also who mixes and masters and your music? I’m an upcoming musician and I’d love to get some tips Hahah guess we’ll never know I love you anuvv It’s something that I’ve been doing for a bit now so I can’t really say! But it was about 3 years ago when I got into music “professionally”. It had started doing to well enough for me to get into it and I’m so happy that I did whenever i listen to your music i just end up putting alag aasman on repeat so never discovered you much as an artist hahah 😭 I’m okayish…. Have been a bit stressed tbh. Haven’t been sleeping properly but hanging in there I’m barely a celebrity! I really don’t like that word tbh. Consider me a friend Comments in my lives really make me chuckle man. Even when I’m singing the saddest one. People say funny shit haha you didn't reply☹️☹️ Hey Anuv, actually I met you at the Delhi concert at JNS in the month of august... With the handmade posters of your amazing music backstage. Well idk if you do remember but wanted to say that to date your music is amazing and I'm always a huge fan of yours!! <33 I thought it’ll be cool. I don’t really have much of a presence here on Reddit. Maybe this’ll help a bit? HAVE NEVER SMOKED AND NEVER WILL Yes :( I really hope we win the FA Cup :( I have a split in my head regarding this. Everyone around me tells me that it’s great and it definitely drives the numbers but I feel sad coz some of these are very sad stories/memories from my life. Looking at it getting reduced to a meme isn’t the best thing. But I’m learning to accept that all songs have their own path. Maybe these songs had this one Hai although that 8s rebuild but the vibe and energy will not be the same Shell-don Hey! What headphones do you use while editing or listening to music?. Also any thoughts about what a frequency chart should look like in your opinion?. Do you think the quality of indian music has degraded and the poetry hidden in the lyrics of the songs has disappeared and they have become no more than words with a superficial meaning I hope my music stays relevant. I’ll probably disappear on my own after a few years and never be seen again. Coz.. aye na Teri yaad unko Who hurt you man 🥺 I’m slowly becoming more confident. It’s so funny coz I can’t explain it to the world. It’s like I literally freeze in front of the camera. I don’t know what to do with my hands. I get so awkward ahah but I’m getting better When will the fansign be held in jaipur? 🥺 Jigglypuff is pretty cute and she sings too ahah same same, it looks difficult rn but winning the FA Cup and stoping city from winning the treble would be the path for restoring the glory Which song of yours you like the most? Or any specific order of your liking? Which is your dream place that you want to visit once in life? I swear I tried but hot water for the win 🥇 Well I hope somebody didn't just do identity fraud here lol Who do you think this is??? Ahah I handle all my social media myself. It’s always me heh So you decided to act like a dick to someone who's taking time to speak to people on this sub, when they easily could have chosen not to? If you don't have something nice to say, why not keep it to yourself? What value did your comment have, beyond potentially making someone feel bad about their creativity and music for no reason at all? I’ve seen it! I’ll watch the latest season soon ^_^ Alag aasmaan repeat pe tha bhai, jab usne reject kiya. Shukriya Bhai Ganon se bhi rulate ho aur abh reply karke bhi love you Man 😩❤️, thode khushal gaane bhi banao plssssssssssssss I’ve actually never heard that one. I’ve been pretty vocal about the fact that all my music comes from own stories. Maybe I might’ve missed it but it’s all “real”. Sometimes I feel it’ll be difficult for me to write something without using my own experiences For folks unfamiliar with your music, which tracks would you suggest they start with? Love to hear that. Your music is soothing. St. George’s is soooo pretty! Loved the football pitch. Played a little there too. Had the best time. Might send my kids there 10 years later or something ahah fav anime? HxH stans assemble aaaaaa! Antariksh is SO GOOD. the artwork, the music video, the outfit and the lyrics- I absolutely love everything about it, it’s been on loop since 18th, hehe🫶🏻💌🌌 Don’t we all? ✨ Existential ✨ I’ve seen you grow from 10k yt subscribers to 1 million. Your transformation and growth makes me so so happy. I’m so grateful that I discovered your music. You’re literally my comfort singer songwriter, love you max :”) Do you like Delhi/ Mumbai? toote makan I just want to take care of my family and provide for them. Do good work and hopefully be remembered as someone who gave it his all! Everything else is consequence of the effort I put in. Also, I loved Sidhu’s music man. What an artist :,( It's a long ass story but i'll make it short.. During lockdown while i was battling skin cancer, I met a girl online who made me feel a lot better. We fell in love eventually..And was determined to follow through.. But due to some turbulence in both of our lives it stopped We didn't talk for 6 months and she was facing some mental health issues.During that time the only thing i had that made me feel connected to her and the world was your song Ocean. Because ironically when we were together she once chose a shirt and jeans for me that matches exactly to yours in the song cover.. It was not just a coincidence but a manifestation for me.. And your lyrics and melody of the song made me want to fight the physical and mental pain i was going through.. So on her birthday during durga puja.. I took the first bus and reached out to her in that same pink shirt and those same jeans and we met for the first time.. And to update.. Three years later.. I've beaten every disease I had at that time and She is still with me ❤..THAAANK YOUUU ANUV! You being on reddit makes us feel like we're closer to you than other artists.. how do you write such meaningful lyrics? Can you give us some pointers on how to actually execute storytelling through a song ? What’s your biggest regret in life? Oh is that so? Who is this??? Ahah no no this was done w the Reddit India team! I have a few but I’ll keep them to myself tour anytime soon? Ik that you love cats, why don’t you get one? Why so obsessed w puns? If you weren't pursuing music as profession would you still be doing your business or something else ? do you work for NASA? because you’re out of this antariksh🚀😮‍💨 Been loving your songs since the last 5 years or so. Great to know you love anime as well. What makes you happy? Not asking for a friend. I’m really trying to figure that out tbh. I haven’t really been the happiest. I thought I will be after everything but it isn’t how people think it is. But I’m sure I’ll figure it out one day Not a fan but once heard your song called \"Baarishein\" That too on loop was a amazing experience thanks for that and \"Gul\" Song lyrics \"tootay makan ik baar gir kar waise bante kaha hai\" Is still stuck in my mind goated lyrics you have Did you ever confess your love to that “Antariksh” girl? do you remember me, heh? What are your thoughts on Chooche Chusa? do you remember meee? KOLKATA TOUR WHEN ANUVV? CANT WAIT TO LISTEN TO YOU LIVE 😭😭❤️ your growth and transformation thru the years, makes me so happy. so grateful that I discovered your music. you deserve the whole “antariksh”😤🫶🏻🚀✨ please do this again soon? I missed it :”( OMG ANUV I LOVE YOU SO MUCH YOUR MUSIC IS LITERALLY SO AMAZING IT'S SUCH A SHAME THAT NOT ENOUGH PEOPLE KNOW YOU IM ABSOLUTELY IN LOVE WITH ANTARISKH I LOVE THAT YOU WENT OUT OF YOUR COMFORT ZONE AND MADE SOMETHING ABSOLUTELY INCREDIBLE ALSO PLEASE PLEASE PLEASE COME TO DUBAI YOU HAVE A LOT OF FANS HERE hi anuv... I am a big fan of you. I am from Ludhiana and jain too..!! WHEN WILL YOU DO A CONCERT IN LUDHIANA!!??? My girlfriend attended your Chandigarh concert since then I really wish I could attend your concert. Anyways I love all your songs and for me you are the only singer with no bad songs!! you are one of my favourite singer right now! Antariksh was awesome! Please don't ever stop making music... man, i hope you’re having a good time. um i remember one of your lives, where you went like : “kya nahi hai ye din?…..raat din, teri yaadon mein aur mai…” like these aren’t the exact lyrics but i tried my best to decode & explain, tell us about this one? is this one your original? i will provide the link of this livestream of yours as well, if you ask me to. :) tho i love your music, appreciate you my man anuv. i love you. <3 if you could go by a stage name, what would it be? me and my bsf literally adore you sm 👍🏼👍🏼👍🏼 we listened to mazaak together for the time first and loved it sm that we kept listening to it again, it's v close to our heart, now we are gonna listen to antariksh <3 thanks for your music, take care and i really really wish you all the best for your career and i hope you blow up more fr fr How do you singers come up with these lyrics, like when in a similar mood, it's like lyrics describe what one is feeling Bro love your songs. I don’t know hindi I translated your lyrics and your voice gives calm vibes. Thank you, keep rocking 🔥🔥🔥 tu yedzhava aahes Hey Anuv! It's great to see you here at last. I try to decipher your songs and believe I've been able to do so somehow. Would you please go through what I have written? It would mean a lot to me Saw the entire concert loved it , thanks for coming Which football team do you support? Please watch Monster Makan tutta ki nehi Hey there, though I don’t know you or have ever heard your songs, because apparently I am living under a rock, but I wish you a great career in music. What do you reflect on the current music scene in India and what advice you have for aspiring singers in this age of auto tune? Appreciate the response & your thoughts 🙏 Yoooo! Love your music! I know that you’re a fan of Pewdiepie aka. Felix Kjellberg. Can you share some good memories of watching him & what made you follow him? Any changes in you because of his influence? Bro-fist 🤭🤭🤭 Kisne Dil toda bro? I just wanted to say that the Gul is your best work in my eyes and \"toote makaan,ik baar gir kar waise bante kahaan hain?\" is something that hits pretty hard for a lot of people but the whole song is a thing of absolute beauty. 🛐 Bazinga! Hey Anuv I LOVE YOUR MUSIC!!!❤️❤️ To me music starts and ends with you!! I have a tattoo of your song Gul!! Your songs make my days brighter and the nights calmer!! Will always be a fan of you and your music✨✨ TU HAI NOOR SA, NOOR HI HAI ALAG!! Andaz Hotel ? 👀 Anuv please come to Delhi University sometimeeeee !!! In our college ipcw specially next fest season mannn it would be such a treattt !!!! 🤌 Since you said you watch a lot of anime, what’s your favourite anime? Do you even realise that this sentence is breaking the heart of so many people? :( are you excited about your concert in Bangladesh? how did you find out you had a fanbase there? are you familiar with Bengali music or do you want song suggestions? next song when? Anuv bhai ,kya haar aur Jeet ke beech bas 1 Darr ka dariya hai ? Kya mai Jeet ke abaad ho sakta hun ,aur kya mai haar ke baad chain se reh sakta hun ? Kya mai beech Mai nahi reh sakta ,kya mujhe 1 pala chun na jaruri hai ?Kya koi is duniya mai Aisa hai , jo kisi pakde mai na ho , jo na idhar ho na udhar aur na hi beech mai ,bas wo Jo door se dekhta hai? Anuv i dont know if you will reply to this but i want to tell you that your music is awesome and i want you to keep going and make more and more hits in the upcoming future , cheeerrss Hey anuv, love your music, just one request, please try to release more songs. And if possible do release \"JO TUM MERE HO\" Bhai ache Gane Kab banayega?? No questions just a big fan!! Baarishen is my therapy.. Just regret I heard you quite late being listening to you since a year or so... Hi Anuv, Following you since ZS days. I remember how you went ahead and put across your YouTube channel details in our onboarding session. Sadly I don't have a picture with me but can proudly say we were part of the same team for a while. Magical journey from there to where you are now. Wish you all the best, keep shining! How did you learn to sing? Hey Anuv, big fan. Your songs give pretty much of a GenZ vibe which I enjoy a lot. Kinda relatable lyrics and a cult music. Perfect for a day out or a night out with neon city lights. I'd love if you have a concert at Raipur someday. How did you start with Songwriting? Since when have you been writing songs? hey anuv please check out suzonn and try making a collab with him please also I LOVE your music man alag aasman is what made me pick up my guitar after years and i love you for that thank you so much your music is so healing ALSO PLEASE PREFORM IN HYD Baarishein and Alag aasmaan resonated with me on a profound level, and when I shared them with my boyfriend, he revealed they were among his favorites too. From that point on, these songs became forever linked with him. I am grateful to you for creating such beautiful music. What inspired you to make alag aasmaan? I wish I was a part of your baarishein hobknob. When will you have another one of such gatherings? The way you sang and the enthusiastic participation of the crowd was just captivating. I have total confidence that you are not going to answer. Having said that, I don’t know you or have not heard of you. But since some platform have given you an opportunity I’d say: spread love, spread love, spread love. We all need it. The world needs it. Baki, you will find your way, when life gets you. Take care. People need You. Okay no jokes. Seriously. How does it feel being the new chocolate boy everyone swoons over?? Cuz at this point its like Amir in the 90s. this was so cute! i wasnt too into Anuv Jain before, just heard the few songs (loved them) recommended by my frens who are fans but this AMA was so cool, Anuv Jain is definitely someone i would love to be friends with, and as someone who cannot separate the art from the artist i will be joining this fan train heh. Would you ever collaborate with prateek kuhaad? Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us. <3 Is it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times. Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us. <3 Is it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times. Hey anuv, attended your concert last December and am still so amazed by it. Thank you for sharing your raw and real emotions with us <3 Is it ever difficult sharing such personal songs with the world? You have an emotional connection to them and seeing them being scrutinized by others is probably difficult at times hi, your songs are so beautiful, can you please come to Bangalore soon also also how do you dead with artists block(it’s like a writer’s block) hi, your songs are so beautiful, when will you come to Bangalore also also how do you deal with artists block(it’s like a writer’s block) Hi Anuv! Not sure if anyone has asked this yet XD. Do you have any singers/ songwriters who inspired you to enter this field? Can you give me a rough process of how you write songs. My vocabulary is decent but i still have trouble writing songs. Can you please make one song which is not sad ,not about breakup/ love , not about feeling low or disappointment, but a happy song we have no enemies. Broo am I late? Love your voice...Gul and Baarishein are one of my favourites! In this era of auto tuning your voice is the real deal. Thank you for those masterpieces. I missed it 😭 Manifesting you no more regrets + more and more happiness 🤧 Bro Istanbul mein show kab karoge Can I try writing music? How should I start? How do you begin your songs? What is the first line that comes out and what inspires it? I am a new songwriter and will have 4 songs on Spotify by the end of June. RS How you got into music were you God gifted or trained , bathroom singer or family function star has heartbreak made you make deep songs just need to know your story that resembalates your music !! Hey man, love your music, I read on this thread that you like watching anime. I have a friend who I think is your biggest fan ever and I'm tryna take her to watch the movie \"your name\" this week. She's a bit skeptical about the whole thing tho. It would be great if you can comment back to give her that last push because she would kill a person if you said so. Thanks a tonne and all the best for all your future projects Agar toote makan gir kar waise bante nhi hai toh bante waqt hi Ambuja cement use kariye Jain sahab taki makan ke tootne ki naubat hi na aaye Why did this post get recommended to me if I live in america I had 2 of your songs in my favorites list and my favorite genre is pure Hindi lyrics because that is a missing genre. Your lyrics with EDM or electronic music will give me literal orgasm. Any plans? BTW Anuv which school you from in Ludhiana? Hope you write a song on finding your own Vinland in the future I wonder you still here?!! Just a quick reminder. Stay happy and keep smiling like you always do. And know that you are so much loved! I'll be happy if you read this. Bruh your music is awesome. Spotify told me I was one of your top 0.5% listener. Dunno why it was so damn specific with the 0.5. 😂 Keep on doing what you do brother. Mate, baarishein .. thank you, this one gets to me , it hits that zone where I easily and effortlessly drift away humming, teary eyed, melancholic, mournful. the song starts and i end all over again. Everytime. PS: it also helps. How could I forget alag aasmaan. I came across Barishein when I was going through something difficult, and it helped me heal. Still on a bad day, I turn to Gul, Alag aasman, Mishri. Your music, your voice is soothing to so many and the way you talk about love is comforting. I came across so many negative comments in this thread, so I just want to tell you are connecting to so many people through your songs around me, and anybody who doesn't feel like that shouldn't bother you either. Thank you for existing. ♥️ When do you plan to learn more than 5 chords? How is the journey? Did you enjoyed it ? A big fan here , following you for 5 yrs..🤝🤝 Sach Sach bol, you did all off this, the music the career all of it just to mine karma haina haina I love playing your songs. Heartbreak yes, but there is no much hope in your voice and words that I am left with optimism after listening to those. Great job you do. When will you come to Ayodhya(Uttar Pradesh)? And will you give free tickets to students (or not keep it too expensive for students) || Maybe I am your youngest fan ever (that's why I am asking for a favor)~~ Have you ever fall in love with an virtual character ~ Hey Anuv, will you please come to Chennai(asks with puppy eyes) Please make songs more like Maula :) it is so beautiful:) What gave you the inspiration to write your first song? Getting a comment from you feels absolutely unreal! Okay so the question is what helped you get over your darkest phases in your life? Also, what's your favourite indie song from a different artist? Great to know you're a tennis fan. Alcaraz, Sinner, Rune, who's your favorite of the *possible* next Big 3? Hi Anuv, I am away from Indian Indie scene, but discovered you on Spotify, and your song Mazak is just brilliant. From what age have you been playing and writing music and who are your influences? Anuv how do you create and publish music as an independent artists? How do you sing so melodious song with not so ryming words I want to be a songwriter in Bollywood. What would be the procedure to make it big and how much time would it take? I really love your song Ocean🙌❣️ Hey Anuv! I just wanna say thank you so much because your songs have been there for me when no one else was. Your songs have healed me more than anyone else has. I wish you all the best in your life and I hope you reach many manyy more heights cus you deserve it. <3 Hey Anuv ! I want you to know that i'm in love with alag aasmaan and i listen to it almost everyday before i sleep. hey anuv.....i jst wanna know how you got into songs......and what was story behind writing antariksh Hello Anuv, your songs are really awesome and I have introduced many people to your songs. How have you started your music journey and when did you decide to become a songwriter full-time? hey What inspires you to make such good songs i mean sometimes when I'm down and that the thought of just giving up then suddenly that- \"KHALI GHAR TERA YE CHABIYON KI GOONJ AISE TUJHE DARA RAHI TU DARNA NHI MAI HU YAHI PAR\" strikes hard when things get worse and they come back and again go then that-\"TERI KAMI TAB UNKO MEHSOOS HOGI\" makes me give a sigh of relieve. When the will to go any further dies then you make it all worth it. Thankyou for doing so- No he's the one who produces the singles on YouTube and Spotify What’s your fav Netflix show? How did you got into singing? What was this biggest struggle you had to face while getting into singing This questmay weird you out but why love songs? There are other types of songs aswell? Did you parents ever forced you for pcm/pcb? Weird question but why guitar? Hey Anuv, do you Like thriller/horror because from what you write some would assume you’re rom-com person but I personally feel like you LOVE HORROR movies. Do u? Sounds like a Pokemon name. Apne makan ambooja cement se q nhi banaye?....toot te hi nhi. I love your voice so much that I named my new born Anuv🥰 I don't speak or understand Hindi but loved and still love listening to Gul and Baarishein - feelings connected beyond languages do a concert in Kolkata please i beg 😭😭 Your song Mishri brings back memories of my Mom.Thank you for that! If your bestfriend was ugly, and it was his special day (wedding or birthday), would you randomly mention that to him, even if that's the truth? You'd be a dick. I hope you get it Haha, owned him. I missed the AMA, but you're good, man. What's ur favorite anime? In a parallel universe if u weren't singer, then whom do u think u would be? Hey I've still been a big fan of yours till now, and your song baarishein and gul has hit me a lot to reality those lyrics are relatable. Is there something else you would like to release like the same in the future? ANUVVVVV I LOVE YOU PLEASEEE!!!!! THANKYOUUUU FOR MAKINGGGGG MYYYY DAYYYYYY What's your favourite song that you ever wrote? Or your favourite lyric that you wrote? Also, love your work! It's not that deep and he's not wrong Could you please try to collaborate with them? It would be out of this world honestly :') What inspires you to write your songs? Was Gul driven by your past relationship? Music > lyrics change my mind Hi Anuv, the way your lyrics make me feel, I feel that if a guy ever felt for me as deep as your lyrics are I’d marry him and never lemme go. Whenever I hear your music, I feel like packing you in a bag and taking you everywhere w me. Why is your music so amazing, plis sing more😩 Thank you for doing this AMA. This is what got me into your music. I have been listening to your music non-stop. I am kind of depressed and most feel-good songs bring tears into my eyes, but not your songs, your songs make me smile. I love the feeling of feeling lighter after each iteration of listening to your song. Thank you from the bottom of my heart. nai re, andaaz which he threw on from sitting on that \"tree\" being an indie artist yourself, what are your thoughts on the emergence of new indie artists in india? Can you please share the story / inspiration for your songs. Particularly for alag aasman and mishri. I love your music and more than that your writing. It feels like you are telling a story you don't want others to know about. Which eventually leaves room for interpretation by the listener and adds mystery to it. <3 Please do a live concert in delhi. I so wish to attend yours. You're such an inspiration anuv💌 the day you replied to me on your live , it just made my day(18.5.23) . Thank you for existing 😭 . You deserve it all❤ as someone who was in that jindal crowd, the entire concert was an AMAZING experience! surely it was way too crowded, but since i got to see you perform live for the first time, i became a whole air conditioner after this!!! i heard your songs on spotify and i liked them a lot, but i never expected seeing you live one day! too bad we couldn't meet in person but i still enjoyed it. you indeed made an impact to the audience whoever was there, at least on me! thanks so much for coming! hope to see you live once again (and maybe meet?) Have you heard the remix of your song snap x baarishen and how do you feel about it? Love your music. Used to listen to Ocean on repeat at one point 💙 I have been analyzing your songs composition wise, rythm wise, and lyrics wise. Can u share some technical tips how do u compose. What are the conscious decisions other than the inspiration for the song itself. Bhai, ye makaan toote tumhare, wo firse bane kyu nahi?, skill issue hai kya? What are some of your favorite songs right now?? Public mein jaana kitta hard ho gya hoga nhi, neeche wali dukan se dahi nhi mangva skte honge.🥹 Oda aap? I loved Mazaak man honestly, waiting for more like that! yeah man, we're not democracy for nothing! Nothing to ask you ... Just wanted to you to know \"Alag Aasman\" has a special place in my heart Could be Haagen Dazs? Ohh Nicee, it's quite understandable why he has such a big gurl fanbase. Haha yes, his lyricism is too good i love gul sm Hello sir, hope you are doing well. I would like to ask what your biggest regret in life is? A moment you wish you would have taken the other path. Your songs are so amazing..they touch hearts 💕 I came across this while listening to Alag Asmaan :) Ayoooo, what are you doing here, how have you been? Dear Anuv jain, I hope this message finds you well. First and foremost, I want to express my admiration for your incredible talent and the positive impact you've made on the lives of countless fans, including myself. I am writing to you today with a heartfelt request. It would mean the world to my dear friend Darshan Jain, if he could receive a special birthday wish from you. Darshan is an avid fan of your work and has always looked up to you as an inspiration. His birthday is coming up on this 25th May, and I believe a personalized message from you would be the ultimate surprise and make his day truly unforgettable. I understand that you receive numerous messages and requests daily, and I truly appreciate any time and effort you can spare for this request. Even a simple birthday greeting or a few words of encouragement from you would bring immense joy and happiness to Darshan. Your genuine connection with fans is what sets you apart, and I believe your kind gesture would leave a lasting impact on their life. If it is within your reach, could you kindly consider sending a personalized birthday wish to Darshan? Your message could be in the form of a short video, a social media post, or any format that you find convenient. Please let me know if there are any specific details or instructions you require to fulfill this request, and I will gladly provide them. Thank you for taking the time to read this message and considering my request. Your unwavering support to your fans is truly remarkable, and it is a testament to your genuine kindness and appreciation for your supporters. Your involvement would make this birthday an extraordinary moment for Darshan that he will cherish forever. Wishing you continued success and happiness, and thank you once again for your consideration. Warmest regards, Anurag💗 Bruh do you sing? I know its hard to believe, but I hear your soul stirring songs while doing a heavy workout almost daily. It’s almost something like an illegal motivation and steroids. Ya, your songs are steroids for soul.. There I said it. Awesome!! TLT is almost deformed. Raman started his own thing, which is good music again. Other members are not seen for a while, but let's hope they'll too come up with a bang. Seeing TLT live including Raman was one of the most beautiful experiences for me, sad that it's not going to happen again. The house in your song mazaak has the same name as your house , arya His house name is arya , and in song mazaak when they both were standing outside the house .. it was also named arya toote makan... 🏡🏗💔💔 When will you have a concert in mumbai? Hello Anuv What are your favourite songs and movies I have listen antariksh and baarishen Gul So pretty Anuv sir I am your big fan Please come to Noida what inspires you as a person and your music? how was your journey soo far, like was it any easy one or it had ups and downs Bhai daaru peeka rooz tunhara gaana sunn tah hu, bhot help kiye hai merko, dheer dheer overcome ker raha hu life koh. I love \"riha\" song so much 🥲 thank you for that anuv Which is more cooler genz or millenials Hi anuv jainn!! Bigg fan of yours. I wanna ask you two questions: How are you? Who's your role model??? Bro where do you record your songs? Has music helped u through ur hard times? I wanna write songs too but i don't know how to start.. How was it when u wrote ur first song? Were u satisfied? yes it is!!!! Hello anuv, big fan 💕 This post hasn't gotten much traction but I love when celebrities coke to Reddit. Personalizes the whole experience of interacting with them. I've loved your songs since the day I came across your works 💗. How do you write the lyrics? Is it mostly about the stuff going on in your life or imagination? Hii , yes still here..things are not that great but yeah I m good ..how have you been ? boob hey there, your thoughts on hyderabad? Oh man, I really really hope things get better for you Hi anuvvvvv Im a veryyyyyy huge huge fan of yours I really wish to meet you sometime in person and expresss how i feel for you or may be i might just sing antarikshh for you. Thats fkn how i feel for you. Iloveeeyouuuusomuchhhhh and ommmgggggg antarikshhh is amazing affff and you deserve everything in the world and the gq shoot you look amaze balls and hugggsssssssssssssss Youre my moon to the darkest nightssssss Dont let down your adhe si chand si hasi anytime Wishing you all the sucesss and loveeeee Hey Anuv I am your very big fan..I listen your songs almost everyday on loop..keep it up for your good work ❤️🙏 When will the broken houses be rebuilt? Hmm maybe NOT MAYBE, have some hope stoopid"
}