{
    "id": "130ansj",
    "title": "NO to Government Fact Checking! | In Kunal Kamra’s Petition in the Bombay High Court, the Government undertakes not to notify its Fact Check Unit",
    "url": "https://www.reddit.com/r/india/comments/130ansj/no_to_government_fact_checking_in_kunal_kamras/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/1xxyrrdt1dwa1.png?width=1600&format=png&auto=webp&v=enabled&s=32530278ee8430ed3ceb387faf15d46f92fca9ee\n\n# tl;dr\n\nOn April 6, 2023, the Ministry of Electronics and Information Technology (MeitY) released the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2023 (IT Amendment Rules, 2023), which included a provision allowing a \"fact check unit of the Central Government\" to deem any online content related to \"any business of the Central Government\" as false or misleading and require it to be removed from the internet. Political satirist and standup artist, Mr. Kunal Kamra, filed a writ petition in the Bombay High Court challenging the constitutionality of this provision, arguing that it violates the Information Technology Act, 2000 (IT Act, 2000), and infringes on the rights to freedom of speech and expression and the right to practice one's trade and profession. In response, the Ministry of Electronics and Information Technology has undertaken not to notify its Fact Check Unit until July 5, 2023.\n\n### Background\n\nThe IT Amendment Rules, 2023 introduced significant amendments to Rule 3(1)(b)(v) of the IT Rules of 2021, which governs the due diligence obligations of intermediaries. The updated rules mandate intermediaries to take \"reasonable efforts\" to prevent their users from posting or sharing information related to the Central Government that has been identified as “fake or false or misleading”. This determination will be solely made by a \"fact check\" unit to be established by the Central Government itself. If intermediaries do not comply with these due diligence requirements, they may lose their safe harbour status under Section 79 of the IT Act of 2000.\n\nMr. Kunal Kamra, a political satirist and standup artist, has challenged the constitutional validity of the IT Amendment Rules, 2023 before the Bombay HC on the following grounds: Firstly, the rules violate Sec. 79 of the IT Act, 2000 and *Shreya Singhal v. Union of India*, which requires any revocation of safe harbour for intermediaries to conform to subject matters laid down in Article 19(2). Secondly, they infringe on the right to freedom of speech and expression under Article 19(1)(a), as they fail to define \"fake or false or misleading\" and  \"any business of the Central Government''. Vague and overbroad laws like this create a chilling effect on free speech. Thirdly, the rules do not satisfy reasonable restrictions on freedom of speech and expression under Article 19(2) and fail to meet the proportionality test. Finally, the rules also infringe on the right to practice one's trade or profession under Article 19(1)(g) by subjecting the creations of political satirists and comedians to a biased \"fact check\" unit, which could result in the deactivation or suspension of their social media accounts.\n\n### Proceedings before the Bombay High Court\n\nOn April 11, 2023, the Bombay High Court ordered MeitY to explain why the IT Amendment Rules, 2023 should not be stayed and file its response within a week. MeitY was directed to provide the factual background behind the amendments in its affidavit.\n\nSubsequently, on April 24, 2023, the Union Government has provided an undertaking that it will not notify this fact check unit until the next date of hearing. This has been recorded in its order by the Bombay High Court, thereby operating as an effective stay on the operation of the IT Amendment Rules, 2023, in so far as they apply to the Government’s fact check unit. We will update you further when the order is made available by the Bombay High Court.\n\nThe next date of hearing is June 8, 2023, for directions for final arguments. The Union Government has been directed to file a compilation of materials relied on by June 6, 2023. We will be ready and prepared to challenge these far-reaching and over-broad fact-checking powers on that date.\n\nWe will continue to provide legal support to Mr Kunal Kamra in his efforts to protect the right to speech and privacy of Indians on the internet, when the matter moves for final hearings. We are immensely grateful to Sr. Adv. Navroz Seervai and Sr. Adv. Darius Khambata for leading us in the matter. He was assisted by Advocates Arti Raghavan, Meenaz Kakalia, and the legal team from IFF comprising Gautam Bhatia, Vrinda Bhandari, Abhinav Sekhri, Tanmay Singh and Gayatri Malhotra.\n\n### Important Documents\n\n1. Writ petition in Kunal Kamra v. Union of India ([**Link**](https://drive.google.com/file/d/1geA71gYN-V0akSF2t2j6L8Z_W7KNwbTX/view?usp=sharing&ref=internetfreedom.in))\n2. Bombay HC order dated 11.04.2023 ([**Link**](https://drive.google.com/file/d/17XPAjCH5HhH-If_mJVGMbb9xbGGVOPxA/view?usp=sharing&ref=internetfreedom.in))\n3. Affidavit in Reply by MeitY ([**Link**](https://drive.google.com/file/d/19ymy0bSiwn6ozm-0pmy_v5qWIR68f9Jl/view?usp=sharing&ref=internetfreedom.in))",
    "flair": "Law & Courts",
    "score": 75,
    "num_comments": 2,
    "created_utc": 1682572365.0,
    "convurl": "https://b.thumbs.redditmedia.com/pTK_TDBkJCAq_qzR8pyQLCkd-J75xqgAWQD2ewgV9LA.jpg",
    "comments": [
        "Silly, in India we don't have full freedom of speech, only partial. Slowly Modi will take away that partial freedom too."
    ],
    "cleaned_text": "government fact checking kunal kamras petition bombay high court government undertakes notify fact check unit xb tldr april ministry electronics information technology meity released information technology intermediary guidelines digital media ethics code amendment rules amendment rules included provision allowing fact check unit central government deem online content related business central government false misleading require removed internet political satirist standup artist mr kunal kamra filed writ petition bombay high court challenging constitutionality provision arguing violates information technology act act infringes rights freedom speech expression right practice ones trade profession response ministry electronics information technology undertaken notify fact check unit july background amendment rules introduced significant amendments rule bv rules governs due diligence obligations intermediaries updated rules mandate intermediaries take reasonable efforts prevent users posting sharing information related central government identified fake false misleading determination solely made fact check unit established central government intermediaries comply due diligence requirements may lose safe harbour status section act mr kunal kamra political satirist standup artist challenged constitutional validity amendment rules bombay hc following grounds firstly rules violate sec act shreya singhal v union india requires revocation safe harbour intermediaries conform subject matters laid article secondly infringe right freedom speech expression article fail define fake false misleading business central government vague overbroad laws like create chilling effect free speech thirdly rules satisfy reasonable restrictions freedom speech expression article fail meet proportionality test finally rules also infringe right practice ones trade profession article g subjecting creations political satirists comedians biased fact check unit could result deactivation suspension social media accounts proceedings bombay high court april bombay high court ordered meity explain amendment rules stayed file response within week meity directed provide factual background behind amendments affidavit subsequently april union government provided undertaking notify fact check unit next date hearing recorded order bombay high court thereby operating effective stay operation amendment rules far apply governments fact check unit update order made available bombay high court next date hearing june directions final arguments union government directed file compilation materials relied june ready prepared challenge farreaching overbroad factchecking powers date continue provide legal support mr kunal kamra efforts protect right speech privacy indians internet matter moves final hearings immensely grateful sr adv navroz seervai sr adv darius khambata leading us matter assisted advocates arti raghavan meenaz kakalia legal team iff comprising gautam bhatia vrinda bhandari abhinav sekhri tanmay singh gayatri malhotra important documents writ petition kunal kamra v union india linkhttpsdrivegooglecomfiledgeagynvaksftjlzwknwbtxviewuspsharingrefinternetfreedomin bombay hc order dated linkhttpsdrivegooglecomfiledxpajchhhhifmjvgmbbxbggvopxaviewuspsharingrefinternetfreedomin affidavit reply meity linkhttpsdrivegooglecomfiledymybsiwnozmpmyvqwirfjlviewuspsharingrefinternetfreedomin ",
    "cleaned_title": "government fact checking kunal kamras petition bombay high court government undertakes notify fact check unit",
    "cleaned_selftext": "xb tldr april ministry electronics information technology meity released information technology intermediary guidelines digital media ethics code amendment rules amendment rules included provision allowing fact check unit central government deem online content related business central government false misleading require removed internet political satirist standup artist mr kunal kamra filed writ petition bombay high court challenging constitutionality provision arguing violates information technology act act infringes rights freedom speech expression right practice ones trade profession response ministry electronics information technology undertaken notify fact check unit july background amendment rules introduced significant amendments rule bv rules governs due diligence obligations intermediaries updated rules mandate intermediaries take reasonable efforts prevent users posting sharing information related central government identified fake false misleading determination solely made fact check unit established central government intermediaries comply due diligence requirements may lose safe harbour status section act mr kunal kamra political satirist standup artist challenged constitutional validity amendment rules bombay hc following grounds firstly rules violate sec act shreya singhal v union india requires revocation safe harbour intermediaries conform subject matters laid article secondly infringe right freedom speech expression article fail define fake false misleading business central government vague overbroad laws like create chilling effect free speech thirdly rules satisfy reasonable restrictions freedom speech expression article fail meet proportionality test finally rules also infringe right practice ones trade profession article g subjecting creations political satirists comedians biased fact check unit could result deactivation suspension social media accounts proceedings bombay high court april bombay high court ordered meity explain amendment rules stayed file response within week meity directed provide factual background behind amendments affidavit subsequently april union government provided undertaking notify fact check unit next date hearing recorded order bombay high court thereby operating effective stay operation amendment rules far apply governments fact check unit update order made available bombay high court next date hearing june directions final arguments union government directed file compilation materials relied june ready prepared challenge farreaching overbroad factchecking powers date continue provide legal support mr kunal kamra efforts protect right speech privacy indians internet matter moves final hearings immensely grateful sr adv navroz seervai sr adv darius khambata leading us matter assisted advocates arti raghavan meenaz kakalia legal team iff comprising gautam bhatia vrinda bhandari abhinav sekhri tanmay singh gayatri malhotra important documents writ petition kunal kamra v union india linkhttpsdrivegooglecomfiledgeagynvaksftjlzwknwbtxviewuspsharingrefinternetfreedomin bombay hc order dated linkhttpsdrivegooglecomfiledxpajchhhhifmjvgmbbxbggvopxaviewuspsharingrefinternetfreedomin affidavit reply meity linkhttpsdrivegooglecomfiledymybsiwnozmpmyvqwirfjlviewuspsharingrefinternetfreedomin",
    "cleaned_comments": "silly india dont full freedom speech partial slowly modi take away partial freedom",
    "light_cleaned_title": "NO to Government Fact Checking! | In Kunal Kamra’s Petition in the Bombay High Court, the Government undertakes not to notify its Fact Check Unit",
    "light_cleaned_selftext": "&#x200B; # tl;dr On April 6, 2023, the Ministry of Electronics and Information Technology (MeitY) released the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2023 (IT Amendment Rules, 2023), which included a provision allowing a \"fact check unit of the Central Government\" to deem any online content related to \"any business of the Central Government\" as false or misleading and require it to be removed from the internet. Political satirist and standup artist, Mr. Kunal Kamra, filed a writ petition in the Bombay High Court challenging the constitutionality of this provision, arguing that it violates the Information Technology Act, 2000 (IT Act, 2000), and infringes on the rights to freedom of speech and expression and the right to practice one's trade and profession. In response, the Ministry of Electronics and Information Technology has undertaken not to notify its Fact Check Unit until July 5, 2023. ### Background The IT Amendment Rules, 2023 introduced significant amendments to Rule 3(1)(b)(v) of the IT Rules of 2021, which governs the due diligence obligations of intermediaries. The updated rules mandate intermediaries to take \"reasonable efforts\" to prevent their users from posting or sharing information related to the Central Government that has been identified as “fake or false or misleading”. This determination will be solely made by a \"fact check\" unit to be established by the Central Government itself. If intermediaries do not comply with these due diligence requirements, they may lose their safe harbour status under Section 79 of the IT Act of 2000. Mr. Kunal Kamra, a political satirist and standup artist, has challenged the constitutional validity of the IT Amendment Rules, 2023 before the Bombay HC on the following grounds: Firstly, the rules violate Sec. 79 of the IT Act, 2000 and *Shreya Singhal v. Union of India*, which requires any revocation of safe harbour for intermediaries to conform to subject matters laid down in Article 19(2). Secondly, they infringe on the right to freedom of speech and expression under Article 19(1)(a), as they fail to define \"fake or false or misleading\" and \"any business of the Central Government''. Vague and overbroad laws like this create a chilling effect on free speech. Thirdly, the rules do not satisfy reasonable restrictions on freedom of speech and expression under Article 19(2) and fail to meet the proportionality test. Finally, the rules also infringe on the right to practice one's trade or profession under Article 19(1)(g) by subjecting the creations of political satirists and comedians to a biased \"fact check\" unit, which could result in the deactivation or suspension of their social media accounts. ### Proceedings before the Bombay High Court On April 11, 2023, the Bombay High Court ordered MeitY to explain why the IT Amendment Rules, 2023 should not be stayed and file its response within a week. MeitY was directed to provide the factual background behind the amendments in its affidavit. Subsequently, on April 24, 2023, the Union Government has provided an undertaking that it will not notify this fact check unit until the next date of hearing. This has been recorded in its order by the Bombay High Court, thereby operating as an effective stay on the operation of the IT Amendment Rules, 2023, in so far as they apply to the Government’s fact check unit. We will update you further when the order is made available by the Bombay High Court. The next date of hearing is June 8, 2023, for directions for final arguments. The Union Government has been directed to file a compilation of materials relied on by June 6, 2023. We will be ready and prepared to challenge these far-reaching and over-broad fact-checking powers on that date. We will continue to provide legal support to Mr Kunal Kamra in his efforts to protect the right to speech and privacy of Indians on the internet, when the matter moves for final hearings. We are immensely grateful to Sr. Adv. Navroz Seervai and Sr. Adv. Darius Khambata for leading us in the matter. He was assisted by Advocates Arti Raghavan, Meenaz Kakalia, and the legal team from IFF comprising Gautam Bhatia, Vrinda Bhandari, Abhinav Sekhri, Tanmay Singh and Gayatri Malhotra. ### Important Documents 1. Writ petition in Kunal Kamra v. Union of India ([**Link**](https://drive.google.com/file/d/1geA71gYN-V0akSF2t2j6L8Z_W7KNwbTX/view?usp=sharing&ref=internetfreedom.in)) 2. Bombay HC order dated 11.04.2023 ([**Link**](https://drive.google.com/file/d/17XPAjCH5HhH-If_mJVGMbb9xbGGVOPxA/view?usp=sharing&ref=internetfreedom.in)) 3. Affidavit in Reply by MeitY ([**Link**](https://drive.google.com/file/d/19ymy0bSiwn6ozm-0pmy_v5qWIR68f9Jl/view?usp=sharing&ref=internetfreedom.in))",
    "light_cleaned_comments": "Silly, in India we don't have full freedom of speech, only partial. Slowly Modi will take away that partial freedom too."
}