{
    "id": "1414lfb",
    "title": "Why the obsession of Western toilets in India especially with middle class and rich people?",
    "url": "https://www.reddit.com/r/india/comments/1414lfb/why_the_obsession_of_western_toilets_in_india/",
    "selftext": "Whenever I go to any building like hotels, lodges, malls, educated people's homes, etc, all I see are Western toilets. They might as well not exist for me and people not accustomed to it. I only use it under extreme circumstances.  \n\n\nIt has been proven by science and recommended by doctors that Indian toilets are better for our health and more hygienic. This is a classic case of westernization gone too far and adopting even the shitty things of the western civilization (pun intended).  \n\n\nSources  \n[https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/five-reasons-why-indian-toilets-are-better-than-western-toilets/photostory/72492329.cms](https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/five-reasons-why-indian-toilets-are-better-than-western-toilets/photostory/72492329.cms)  \n\n\n[https://www.wellordie.com/health/indian-toilets-better-than-western-ones/](https://www.wellordie.com/health/indian-toilets-better-than-western-ones/)",
    "flair": "Rant / Vent",
    "score": 0,
    "num_comments": 43,
    "created_utc": 1685946035.0,
    "convurl": "https://external-preview.redd.it/d-LYj209GDAtfl6BqNYcLlK8inSmIcrBQ_QCdfviZj8.jpg?auto=webp&v=enabled&s=b18f6bf269df68ee876263c39e3c6b57ebf5dad7",
    "comments": [
        "For a lazy and unhealthy person, it's better. Mera pair dukh jaata hai Indian mein",
        "Sure Indian toilets are very good at preventing constipation, hemmorhoids etc. but since now I am in my pregnancy western toilets are so much easier to use than Indian ones. Best is use a western toilet but get a foot stool to create a better sitting position for evacuation.",
        "Western toilets are .. \n\n\nCleaner, easier to maintain, hygienic.\n\n\nHaving a lid is always to helpful. \n\n\nEasier to use a bidet. \n\n\nBetter for old age people.",
        "Indians are not strong anymore coz we are desktop jobs ... our legs are becoming weaker day by day...now I am unable to sit in idnian even for few minutes..",
        "OP you can go for Anglo Indian and get best of both worlds.\n\nhttps://preview.redd.it/pwnfybusa54b1.jpeg?width=1080&format=pjpg&auto=webp&v=enabled&s=12ac1bf4e8d2d10771ab2f9fa3df57a3abf078b0",
        "My father has a bad back, using the Indian toilet was painful and dangerous for him because he could not find support for while getting up. Western toilets are very convenient. With good food, balanced diet and exercise the problem of constipation can be solved. \n\nIt's not a rich people thing. It's a convenience thing.",
        "Bhai apke fellow Indians ke weight dekhe ho? Aadhe clinics iss desh mein arthritis patients se bhara hua rehta hai and you are talking about indian toilets. Hagne jayenge aur wahi jam jayenge.\n\nhttps://i.redd.it/uypaeb3eb54b1.gif",
        "Knee problems",
        "Why toilets bru? Khulle mein shauch karna chahiye. Dharti ma se vibrations seedhe gasnd ke ched se hokar mastishk mein khushi aur shanti utpann karta hai. All public spaces should have designated shitting lawns and hotels should create shitting greens.",
        "OP … it’s because of Knee Issues for elders ….\nIt’s not because we Indians love this… no… not at all… we hate it … \nHowever think from SENIOR CITIZONS perspective who has leg issues…\n\nWestern Toilets helps them … simple",
        "Kuch bhi …!!   Bullshit",
        "Hygenic? \n\nCertainly Indian toilets are more hygenic than western toilets.\n\nIn western toilets, people's ass has to touch the thing which is previously touched by other people's asses. How could western toilets be more hygenic?",
        "Come to Mumbai,   \n\n\nYour legs will be built up like an athlete's.",
        "So basically anyone who is not a healthy, lean, young person can get fucked. Fuck pregnent women and old people in particular, I guess. Good idea brother.",
        "As an aside, there’s nothing Indian about squat toilets. You can find them all over the world. They used to be common in Europe too, especially in public washrooms.\n\nhttps://en.wikipedia.org/wiki/Squat_toilet",
        "Most people have at least one Indian toilet in their homes for those who are used to it. Western toilets are convenient for elderly, obese, disabled or guests.\n\n> This is a classic case of westernization gone too far and adopting even the shitty things of the western civilization (pun intended). \n\nStop rebelling everything snowflake.",
        "Wtf! Ye toh pehli baar dekh rha",
        "In olden times, old people would just die. Check what the mortality rate was back then ‘before westernization went too far’. \n\nIs this whole rant just because you don’t know how to use one?",
        "We had one, but it is not very comfortable !",
        "It is not an obsession, but necessity for ageing people",
        "I have explained why I have made this post. We have adopted a worse version of something because it is western.",
        "The problem is each and every stall in malls/hotels etc. is western. If some stalls were squat and others were western, everybody could get what they preferred. But now, everyone is forced to use the unhealthy and unhygienic version of the toilet.",
        "Mera bhi pair dukhta hai kabhi kabhi.\n\n&#x200B;\n\nBut, no pain, no gain.",
        "For me, personally, i like my shit submerged or covered by water instead of sitting out in the open. You do your business and right there sits a pile of gross smelly poop that sometimes sticks to the toilet surface. This is mt experience with indian toilet. Whereas in western, the poop immediately gets covered by water and less smell and more easy to clean.",
        "See, most people do pooping at home. You can have whatever style of toilet and bathroom you want to have in there. Public places (especially in cities) like malls and hotels cater to the comfort of the majority, not to the small minority that always wants to use the Indian toilet. \n\nBesides, if it's \"health reasons\", how often are you doing ya business outside? It really shouldn't impact your health in a negative way if you're not doing this on a daily basis. This is such an odd thing to feel weirdly nationalistic about.",
        "Also I guarantee you, if Indian toilets were put up everywhere as even an option - barely anyone would ever willingly use it.",
        "Cause its comfortable. Thats it. I aint thinking about exercise when I wanna go for a dump",
        "Iske upar chad k baithna hai kya",
        "Did the study considered western toiled with a bidet or without it?",
        "Dude what are you talking about? Indian toilets are terrible and to quote some Bullshit like it's more safe?? Most Indians were shutting in a hole in the ground a few years ago.",
        "This. \n\nI’m biased, because I lived in America before moving to India. However, I’ve spent plenty of time in places without Western-style toilets. And, if I’m being honest, I’d never use a squat toilet if something—anything—else is available. \n\nIf you don’t grow up using squat toilets, your Achilles tendon never develops the flexibility needed to plant your feet flat on the ground. You end up on your tip-toes, or having to grab a pipe or wall for support. \n\nPutting that aside, Indian-style toilets—at least in public places—are almost always fucking filthy, with water, piss, and shit scattered all around. I only use them as an absolute last resort. \n\nAnyway, to each their fucking own. Don’t see why this needs to be a debate. Contrary to what OP thinks, many people who were born and raised in India actively avoid so-called Indian-style toilets, too.",
        "I said hygenic, not safe. And why they are hygenic is self explanatory.",
        "😂😂",
        "Bhai, Toilet is meant for shitting not doing some hard work and making impressive gains. \nYou have many other places where u can do hard work,  no need to spend your every waking hour working hard.",
        "Indians toliets are fit directly into the floor, hence risking the chance of water leakage over time.",
        "Sitting down is comfortable, have you ever gone for a poo, sat down on the toilet and read the news for 10 mins or something?",
        "I’d give you the age/disability reason, but 20 others have already done so and you have studiously avoided responding to them so...",
        "Actually, I did respond to that\n\nhttps://preview.redd.it/puselau4j84b1.jpeg?width=1070&format=pjpg&auto=webp&v=enabled&s=ce21f0f6e049d6c1020976b9ae2b40010bf08b3e",
        "Lol are we comparing hygiene w.r.t toilets",
        "Stupidest rant ever.",
        "Ok and what about that poop splash? wdyd abt it?",
        "Yeah well if someone has an health issue, I get preferring a western one, but if you are normal, I don't get why people would still prefer it\n\nFirst of all, that disgusting water splash that hits you when you poop, and secondly sooo many people have sat on western seats, their butts touched, and who knows what type of people (public) and at home too, it's pretty damn disgusting when your butt touches the seat's cold surface, so like what do you do about all these issues?",
        "and what do you do about that disgusting poop splash thing when it hits the water in western ones?",
        "> So basically anyone who is not a healthy, lean, young person can get fucked. \n\nwhy lean though? what issues would a lean person have squatting?",
        "> This is such an odd thing to feel weirdly nationalistic about. \n\nThere is nothing \"nationalistic\" about the issue we are talking about at hand.\n\n> See, most people do pooping at home.\n\nOkay and about the students who have to go somewhere to study so have to live in hostel?? OP is right, why can't they just keep some indian toilets so that no one would have a problem?\n\n> Public places (especially in cities) like malls and hotels cater to the comfort of the majority, not to the small minority that always wants to use the Indian toilet. \n\nFirst of all, how do you know majority want a western one? Secondly, for us who do, our reasons aren't childish or stupid at all, I'll tell you my problems and if you can tell me a solution for them I'll gladly accept western ones-\n\n1 THAT DISGUSTING WATER SPLASH when you poop, what do you do about this? Or do you not feel disgusted when that water hits you??\n\n2 Soooo many people have sat on it, it's fine if it's at home, you can clean it, but what about when it's an emergency and you \\*have\\* to use a toilet, so now you are forced to sit on a public western seat, where who knows who all have sat, and which type of people have sat, and how many butts have touched? soooo disgusting and unhygienic! Is it not unhealthy and unhygenic?? tell me\n\n3 Sitting toilets aren't right physiologically, our bodies natural position while doing our business is squatting, it provides for easier flow, and helps keep away constipation, it's been scientifically proven\n\n4 They are disgusting and unhygenic over and out, coz you have to touch your butt to the disgusting cold seat, where so many butts have touched, it's difficult to clean and maintain too, ideally, you have to wash it after every use. Compare this to an indian one, where washing the seat once a day is enough.",
        "Not a lean person. Bigger, fatter people have issues squatting.",
        "weird coz I live in a joint family of 12, have all types of people, skinny, lean, bigger, fatter, old, young, male and female, and yet all of them will choose indian any day",
        "And my late grandma would too choose indian\n\nBut I do get about old people who have knee problems and pregnant people",
        "That’s literally a meme, it almost never happens in reality. But if you’re worried about it, you can lay down some toilet paper to soften the landing of your poop and then there will be zero splash.",
        "I feel ya. For a young healthy person a squat toilet is definitely healthier and more hygienic. But remember that a lot of people find a Western toilet more comfortable and it’s a lot safer for old, pregnant, and less mobile people. This is a colossal part of the population who benefit from using Western toilet.",
        "Well I used a western toilet once and that literally happened which is the reason I'm asking.... but won't toilet paper clog the drains (I highly doubt indian drains are built to stand toilet paper waste too)? and having to put paper all the time you do? Isn't that a waste of paper?",
        "It’s a nonissue",
        "Actually we have a better toilet model in our house. It’s a dry toilet with access to water for washing so I can sit on it like western toilets but I get no splash back. It’s an ingenious model built by an environmentalist named Debal Deb and the whole process is sanitary, clean and odour free.",
        "I think western toilets are easier to use than Indian ones but our dry cum wet toilet is the best",
        "Ooohhh I see I had no idea that toilets like these were available in the market, was it expensive btw?",
        "You won’t find them in the market because Indian sanitation system likes to ape the western models which don’t work so well in our environment. We built our own toilet. I think you will find the blueprints online and you can get it made yourself. Tbh it is easier to use if you own a house. Complexes won’t allow you to deal with waste this way ( even though it is more sanitary).",
        "And no it cost us less to build it than to would to buy a kohler commode",
        "I understand your concerns but these issues don’t seem that gross to me. Splashback happens but not very often in my experience  if Your grossed out by butts touching the toilet seat, hover or poop at home when possible. Now my main concern with the Indian Toilet is the clean up. the hose seems fine however using a bucket of water and your fingers to clean your butt is absolutely disgusting",
        "\\+ Rubbing your butt on toilet seat used by others. I find that most disgusting. I always shit on paper when toilets are western and throw them inside. I just can't shit bcz of anxiety of getting disease bcz of sitting or splashes. The pressure automatically disappears for me.",
        "Its a health concern rather than a choice that your legs are not supporting your own weight.",
        "Point noted. Will pitch this in shark tank next season.",
        "The down votes makes me wonder which part of india these down voters live. Seems like they are Indians living outside india.",
        "On the contrary the ass rub and shit splashes of western toilets give me anxiety and jams my rectum.",
        "Shark tank worthy idea😂",
        "An interesting perspective for me as a squat shitter.",
        "Or they don't understand basic physics or biology. \n\nOr they think that even shit from west is gold and even gold from India is shit.",
        "Lamo, where do you live where western toilets are common? I have seen most private homes with indian toilets.\n\nMaybe you are from some high income family who live in big bungalows with western architecture and have never visited a middle class family or villages.\n\nEven \"Pradhan Mantri Sauchalay Yojana\" gives indian toilets.",
        "He said that he was \"lazy\". So there is a choice not to be lazy.\n\nIf the said that he was obese/old etc and couldn't do it, I would understand.",
        "help how do you wash it then??\n\nBut yes, I COMPLETELY AGREE TOUCHING THAT COLD TOILET SEAT WHEN SITTING ON IT GROSSES ME TF OUT, EVEN THE COLD FIBRE/PLASTIC (whatever it is) IS JUST SO DISGUSTING FOR ME\n\n(im not screaming, just extremely passionate)",
        "Why the faaack is this not mainstream????",
        "Because the rest of the world doesn't like using the street as a bathroom",
        "They are better than shitting in the street",
        "OMG, how negative are the comments! I agree with OP. There should be both available. To cater to a minority group of disabled, aged, pregnant, those who prefer it , etc, we are forgetting the majority or least half the population.",
        "Apologies for preferring not to shit in an open pit in a non ventilated cement box",
        "This has been around for long. At least as old as i am. 30+",
        "The only reason you are not using it, according to you, is the squatting position which youre not comfortable with.\n\nThe hygienics is equally bad in public toilets with western design. At least when i poop in a unclean toilet i don't have to touch it. \n\nOther than this, is there any other reasons?",
        "Western toilets are safer for sick, old, and disabled/differently-abled people. It's not just about me not being comfortable (which I didn't even say??). Most people are not comfortable with it, hence the mass-adoption of the western toilet. No one forced anyone to add it in their home yet most people have. It is just more comfortable and safe for everyone. It has little to do with hygiene. This is such an idiotic and inconsiderate take.",
        "You said it yourself. The position is hard for you sit.\n I agree its safe for differently abled and sick, elderly people. \n\nI dont know anything about safety for normal people though.\nHow is it safer than an Indian toilet? \n\nWhich again brings me back to personal choice and experience with it growing up. \n\nAbout hygiene , OP is making a point about water splashing and butt touching on the seat, which is shared by everyone. \nWhich you dont even mention in your hygiene argument . \n\nWhy did you call it idiotic? Bcz you didn't quite get what i said?",
        "It doesn’t happen with every toilet lmao, only the ones with a much more narrow base",
        "This!!!",
        "The splash does not happen to everyone, you just don’t use western toilets enough to know how to prevent that from happening",
        "Also, imagine stepping on what was people’s piss and poop in a public Indian toilet before they’ve washed it down with water, disgusting"
    ],
    "cleaned_text": "obsession western toilets india especially middle class rich people whenever go building like hotels lodges malls educated peoples homes etc see western toilets might well exist people accustomed use extreme circumstances proven science recommended doctors indian toilets better health hygienic classic case westernization gone far adopting even shitty things western civilization pun intended sources httpstimesofindiaindiatimescomlifestylehealthfitnesshealthnewsfivereasonswhyindiantoiletsarebetterthanwesterntoiletsphotostorycmshttpstimesofindiaindiatimescomlifestylehealthfitnesshealthnewsfivereasonswhyindiantoiletsarebetterthanwesterntoiletsphotostorycms httpswwwwellordiecomhealthindiantoiletsbetterthanwesternoneshttpswwwwellordiecomhealthindiantoiletsbetterthanwesternones ",
    "cleaned_title": "obsession western toilets india especially middle class rich people",
    "cleaned_selftext": "whenever go building like hotels lodges malls educated peoples homes etc see western toilets might well exist people accustomed use extreme circumstances proven science recommended doctors indian toilets better health hygienic classic case westernization gone far adopting even shitty things western civilization pun intended sources httpstimesofindiaindiatimescomlifestylehealthfitnesshealthnewsfivereasonswhyindiantoiletsarebetterthanwesterntoiletsphotostorycmshttpstimesofindiaindiatimescomlifestylehealthfitnesshealthnewsfivereasonswhyindiantoiletsarebetterthanwesterntoiletsphotostorycms httpswwwwellordiecomhealthindiantoiletsbetterthanwesternoneshttpswwwwellordiecomhealthindiantoiletsbetterthanwesternones",
    "cleaned_comments": "lazy unhealthy person better mera pair dukh jaata hai indian mein sure indian toilets good preventing constipation hemmorhoids etc since pregnancy western toilets much easier use indian ones best use western toilet get foot stool create better sitting position evacuation western toilets cleaner easier maintain hygienic lid always helpful easier use bidet better old age people indians strong anymore coz desktop jobs legs becoming weaker day daynow unable sit idnian even minutes op go anglo indian get best worlds father bad back using indian toilet painful dangerous could find support getting western toilets convenient good food balanced diet exercise problem constipation solved rich people thing convenience thing bhai apke fellow indians ke weight dekhe ho aadhe clinics iss desh mein arthritis patients se bhara hua rehta hai talking indian toilets hagne jayenge aur wahi jam jayenge knee problems toilets bru khulle mein shauch karna chahiye dharti se vibrations seedhe gasnd ke ched se hokar mastishk mein khushi aur shanti utpann karta hai public spaces designated shitting lawns hotels create shitting greens op knee issues elders indians love hate however think senior citizons perspective leg issues western toilets helps simple kuch bhi bullshit hygenic certainly indian toilets hygenic western toilets western toilets peoples ass touch thing previously touched peoples asses could western toilets hygenic come mumbai legs built like athletes basically anyone healthy lean young person get fucked fuck pregnent women old people particular guess good idea brother aside theres nothing indian squat toilets find world used common europe especially public washrooms people least one indian toilet homes used western toilets convenient elderly obese disabled guests classic case westernization gone far adopting even shitty things western civilization pun intended stop rebelling everything snowflake wtf ye toh pehli baar dekh rha olden times old people would die check mortality rate back westernization went far whole rant dont know use one one comfortable obsession necessity ageing people explained made post adopted worse version something western problem every stall mallshotels etc western stalls squat others western everybody could get preferred everyone forced use unhealthy unhygienic version toilet mera bhi pair dukhta hai kabhi kabhi xb pain gain personally like shit submerged covered water instead sitting open business right sits pile gross smelly poop sometimes sticks toilet surface mt experience indian toilet whereas western poop immediately gets covered water less smell easy clean see people pooping home whatever style toilet bathroom want public places especially cities like malls hotels cater comfort majority small minority always wants use indian toilet besides health reasons often ya business outside really shouldnt impact health negative way youre daily basis odd thing feel weirdly nationalistic also guarantee indian toilets put everywhere even option barely anyone would ever willingly use cause comfortable thats aint thinking exercise wan na go dump iske upar chad k baithna hai kya study considered western toiled bidet without dude talking indian toilets terrible quote bullshit like safe indians shutting hole ground years ago im biased lived america moving india however ive spent plenty time places without westernstyle toilets im honest id never use squat toilet somethinganythingelse available dont grow using squat toilets achilles tendon never develops flexibility needed plant feet flat ground end tiptoes grab pipe wall support putting aside indianstyle toiletsat least public placesare almost always fucking filthy water piss shit scattered around use absolute last resort anyway fucking dont see needs debate contrary op thinks many people born raised india actively avoid socalled indianstyle toilets said hygenic safe hygenic self explanatory bhai toilet meant shitting hard work making impressive gains many places u hard work need spend every waking hour working hard indians toliets fit directly floor hence risking chance water leakage time sitting comfortable ever gone poo sat toilet read news mins something id give agedisability reason others already done studiously avoided responding actually respond lol comparing hygiene wrt toilets stupidest rant ever ok poop splash wdyd abt yeah well someone health issue get preferring western one normal dont get people would still prefer first disgusting water splash hits poop secondly sooo many people sat western seats butts touched knows type people public home pretty damn disgusting butt touches seats cold surface like issues disgusting poop splash thing hits water western ones basically anyone healthy lean young person get fucked lean though issues would lean person squatting odd thing feel weirdly nationalistic nothing nationalistic issue talking hand see people pooping home okay students go somewhere study live hostel op right cant keep indian toilets one would problem public places especially cities like malls hotels cater comfort majority small minority always wants use indian toilet first know majority want western one secondly us reasons arent childish stupid ill tell problems tell solution ill gladly accept western ones disgusting water splash poop feel disgusted water hits soooo many people sat fine home clean emergency use toilet forced sit public western seat knows sat type people sat many butts touched soooo disgusting unhygienic unhealthy unhygenic tell sitting toilets arent right physiologically bodies natural position business squatting provides easier flow helps keep away constipation scientifically proven disgusting unhygenic coz touch butt disgusting cold seat many butts touched difficult clean maintain ideally wash every use compare indian one washing seat day enough lean person bigger fatter people issues squatting weird coz live joint family types people skinny lean bigger fatter old young male female yet choose indian day late grandma would choose indian get old people knee problems pregnant people thats literally meme almost never happens reality youre worried lay toilet paper soften landing poop zero splash feel ya young healthy person squat toilet definitely healthier hygienic remember lot people find western toilet comfortable lot safer old pregnant less mobile people colossal part population benefit using western toilet well used western toilet literally happened reason im asking wont toilet paper clog drains highly doubt indian drains built stand toilet paper waste put paper time isnt waste paper nonissue actually better toilet model house dry toilet access water washing sit like western toilets get splash back ingenious model built environmentalist named debal deb whole process sanitary clean odour free think western toilets easier use indian ones dry cum wet toilet best ooohhh see idea toilets like available market expensive btw wont find market indian sanitation system likes ape western models dont work well environment built toilet think find blueprints online get made tbh easier use house complexes wont allow deal waste way even though sanitary cost us less build would buy kohler commode understand concerns issues dont seem gross splashback happens often experience grossed butts touching toilet seat hover poop home possible main concern indian toilet clean hose seems fine however using bucket water fingers clean butt absolutely disgusting rubbing butt toilet seat used others find disgusting always shit paper toilets western throw inside cant shit bcz anxiety getting disease bcz sitting splashes pressure automatically disappears health concern rather choice legs supporting weight point noted pitch shark tank next season votes makes wonder part india voters live seems like indians living outside india contrary ass rub shit splashes western toilets give anxiety jams rectum shark tank worthy idea interesting perspective squat shitter dont understand basic physics biology think even shit west gold even gold india shit lamo live western toilets common seen private homes indian toilets maybe high income family live big bungalows western architecture never visited middle class family villages even pradhan mantri sauchalay yojana gives indian toilets said lazy choice lazy said obeseold etc couldnt would understand help wash yes completely agree touching cold toilet seat sitting grosses tf even cold fibreplastic whatever disgusting im screaming extremely passionate faaack mainstream rest world doesnt like using street bathroom better shitting street omg negative comments agree op available cater minority group disabled aged pregnant prefer etc forgetting majority least half population apologies preferring shit open pit non ventilated cement box around long least old reason using according squatting position youre comfortable hygienics equally bad public toilets western design least poop unclean toilet dont touch reasons western toilets safer sick old disableddifferentlyabled people comfortable didnt even say people comfortable hence massadoption western toilet one forced anyone add home yet people comfortable safe everyone little hygiene idiotic inconsiderate take said position hard sit agree safe differently abled sick elderly people dont know anything safety normal people though safer indian toilet brings back personal choice experience growing hygiene op making point water splashing butt touching seat shared everyone dont even mention hygiene argument call idiotic bcz didnt quite get said doesnt happen every toilet lmao ones much narrow base splash happen everyone dont use western toilets enough know prevent happening also imagine stepping peoples piss poop public indian toilet theyve washed water disgusting",
    "light_cleaned_title": "Why the obsession of Western toilets in India especially with middle class and rich people?",
    "light_cleaned_selftext": "Whenever I go to any building like hotels, lodges, malls, educated people's homes, etc, all I see are Western toilets. They might as well not exist for me and people not accustomed to it. I only use it under extreme circumstances. It has been proven by science and recommended by doctors that Indian toilets are better for our health and more hygienic. This is a classic case of westernization gone too far and adopting even the shitty things of the western civilization (pun intended). Sources [https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/five-reasons-why-indian-toilets-are-better-than-western-toilets/photostory/72492329.cms](https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/five-reasons-why-indian-toilets-are-better-than-western-toilets/photostory/72492329.cms) [https://www.wellordie.com/health/indian-toilets-better-than-western-ones/](https://www.wellordie.com/health/indian-toilets-better-than-western-ones/)",
    "light_cleaned_comments": "For a lazy and unhealthy person, it's better. Mera pair dukh jaata hai Indian mein Sure Indian toilets are very good at preventing constipation, hemmorhoids etc. but since now I am in my pregnancy western toilets are so much easier to use than Indian ones. Best is use a western toilet but get a foot stool to create a better sitting position for evacuation. Western toilets are .. Cleaner, easier to maintain, hygienic. Having a lid is always to helpful. Easier to use a bidet. Better for old age people. Indians are not strong anymore coz we are desktop jobs ... our legs are becoming weaker day by day...now I am unable to sit in idnian even for few minutes.. OP you can go for Anglo Indian and get best of both worlds. My father has a bad back, using the Indian toilet was painful and dangerous for him because he could not find support for while getting up. Western toilets are very convenient. With good food, balanced diet and exercise the problem of constipation can be solved. It's not a rich people thing. It's a convenience thing. Bhai apke fellow Indians ke weight dekhe ho? Aadhe clinics iss desh mein arthritis patients se bhara hua rehta hai and you are talking about indian toilets. Hagne jayenge aur wahi jam jayenge. Knee problems Why toilets bru? Khulle mein shauch karna chahiye. Dharti ma se vibrations seedhe gasnd ke ched se hokar mastishk mein khushi aur shanti utpann karta hai. All public spaces should have designated shitting lawns and hotels should create shitting greens. OP … it’s because of Knee Issues for elders …. It’s not because we Indians love this… no… not at all… we hate it … However think from SENIOR CITIZONS perspective who has leg issues… Western Toilets helps them … simple Kuch bhi …!! Bullshit Hygenic? Certainly Indian toilets are more hygenic than western toilets. In western toilets, people's ass has to touch the thing which is previously touched by other people's asses. How could western toilets be more hygenic? Come to Mumbai, Your legs will be built up like an athlete's. So basically anyone who is not a healthy, lean, young person can get fucked. Fuck pregnent women and old people in particular, I guess. Good idea brother. As an aside, there’s nothing Indian about squat toilets. You can find them all over the world. They used to be common in Europe too, especially in public washrooms. Most people have at least one Indian toilet in their homes for those who are used to it. Western toilets are convenient for elderly, obese, disabled or guests. > This is a classic case of westernization gone too far and adopting even the shitty things of the western civilization (pun intended). Stop rebelling everything snowflake. Wtf! Ye toh pehli baar dekh rha In olden times, old people would just die. Check what the mortality rate was back then ‘before westernization went too far’. Is this whole rant just because you don’t know how to use one? We had one, but it is not very comfortable ! It is not an obsession, but necessity for ageing people I have explained why I have made this post. We have adopted a worse version of something because it is western. The problem is each and every stall in malls/hotels etc. is western. If some stalls were squat and others were western, everybody could get what they preferred. But now, everyone is forced to use the unhealthy and unhygienic version of the toilet. Mera bhi pair dukhta hai kabhi kabhi. &#x200B; But, no pain, no gain. For me, personally, i like my shit submerged or covered by water instead of sitting out in the open. You do your business and right there sits a pile of gross smelly poop that sometimes sticks to the toilet surface. This is mt experience with indian toilet. Whereas in western, the poop immediately gets covered by water and less smell and more easy to clean. See, most people do pooping at home. You can have whatever style of toilet and bathroom you want to have in there. Public places (especially in cities) like malls and hotels cater to the comfort of the majority, not to the small minority that always wants to use the Indian toilet. Besides, if it's \"health reasons\", how often are you doing ya business outside? It really shouldn't impact your health in a negative way if you're not doing this on a daily basis. This is such an odd thing to feel weirdly nationalistic about. Also I guarantee you, if Indian toilets were put up everywhere as even an option - barely anyone would ever willingly use it. Cause its comfortable. Thats it. I aint thinking about exercise when I wanna go for a dump Iske upar chad k baithna hai kya Did the study considered western toiled with a bidet or without it? Dude what are you talking about? Indian toilets are terrible and to quote some Bullshit like it's more safe?? Most Indians were shutting in a hole in the ground a few years ago. This. I’m biased, because I lived in America before moving to India. However, I’ve spent plenty of time in places without Western-style toilets. And, if I’m being honest, I’d never use a squat toilet if something—anything—else is available. If you don’t grow up using squat toilets, your Achilles tendon never develops the flexibility needed to plant your feet flat on the ground. You end up on your tip-toes, or having to grab a pipe or wall for support. Putting that aside, Indian-style toilets—at least in public places—are almost always fucking filthy, with water, piss, and shit scattered all around. I only use them as an absolute last resort. Anyway, to each their fucking own. Don’t see why this needs to be a debate. Contrary to what OP thinks, many people who were born and raised in India actively avoid so-called Indian-style toilets, too. I said hygenic, not safe. And why they are hygenic is self explanatory. 😂😂 Bhai, Toilet is meant for shitting not doing some hard work and making impressive gains. You have many other places where u can do hard work, no need to spend your every waking hour working hard. Indians toliets are fit directly into the floor, hence risking the chance of water leakage over time. Sitting down is comfortable, have you ever gone for a poo, sat down on the toilet and read the news for 10 mins or something? I’d give you the age/disability reason, but 20 others have already done so and you have studiously avoided responding to them so... Actually, I did respond to that Lol are we comparing hygiene w.r.t toilets Stupidest rant ever. Ok and what about that poop splash? wdyd abt it? Yeah well if someone has an health issue, I get preferring a western one, but if you are normal, I don't get why people would still prefer it First of all, that disgusting water splash that hits you when you poop, and secondly sooo many people have sat on western seats, their butts touched, and who knows what type of people (public) and at home too, it's pretty damn disgusting when your butt touches the seat's cold surface, so like what do you do about all these issues? and what do you do about that disgusting poop splash thing when it hits the water in western ones? > So basically anyone who is not a healthy, lean, young person can get fucked. why lean though? what issues would a lean person have squatting? > This is such an odd thing to feel weirdly nationalistic about. There is nothing \"nationalistic\" about the issue we are talking about at hand. > See, most people do pooping at home. Okay and about the students who have to go somewhere to study so have to live in hostel?? OP is right, why can't they just keep some indian toilets so that no one would have a problem? > Public places (especially in cities) like malls and hotels cater to the comfort of the majority, not to the small minority that always wants to use the Indian toilet. First of all, how do you know majority want a western one? Secondly, for us who do, our reasons aren't childish or stupid at all, I'll tell you my problems and if you can tell me a solution for them I'll gladly accept western ones- 1 THAT DISGUSTING WATER SPLASH when you poop, what do you do about this? Or do you not feel disgusted when that water hits you?? 2 Soooo many people have sat on it, it's fine if it's at home, you can clean it, but what about when it's an emergency and you \\*have\\* to use a toilet, so now you are forced to sit on a public western seat, where who knows who all have sat, and which type of people have sat, and how many butts have touched? soooo disgusting and unhygienic! Is it not unhealthy and unhygenic?? tell me 3 Sitting toilets aren't right physiologically, our bodies natural position while doing our business is squatting, it provides for easier flow, and helps keep away constipation, it's been scientifically proven 4 They are disgusting and unhygenic over and out, coz you have to touch your butt to the disgusting cold seat, where so many butts have touched, it's difficult to clean and maintain too, ideally, you have to wash it after every use. Compare this to an indian one, where washing the seat once a day is enough. Not a lean person. Bigger, fatter people have issues squatting. weird coz I live in a joint family of 12, have all types of people, skinny, lean, bigger, fatter, old, young, male and female, and yet all of them will choose indian any day And my late grandma would too choose indian But I do get about old people who have knee problems and pregnant people That’s literally a meme, it almost never happens in reality. But if you’re worried about it, you can lay down some toilet paper to soften the landing of your poop and then there will be zero splash. I feel ya. For a young healthy person a squat toilet is definitely healthier and more hygienic. But remember that a lot of people find a Western toilet more comfortable and it’s a lot safer for old, pregnant, and less mobile people. This is a colossal part of the population who benefit from using Western toilet. Well I used a western toilet once and that literally happened which is the reason I'm asking.... but won't toilet paper clog the drains (I highly doubt indian drains are built to stand toilet paper waste too)? and having to put paper all the time you do? Isn't that a waste of paper? It’s a nonissue Actually we have a better toilet model in our house. It’s a dry toilet with access to water for washing so I can sit on it like western toilets but I get no splash back. It’s an ingenious model built by an environmentalist named Debal Deb and the whole process is sanitary, clean and odour free. I think western toilets are easier to use than Indian ones but our dry cum wet toilet is the best Ooohhh I see I had no idea that toilets like these were available in the market, was it expensive btw? You won’t find them in the market because Indian sanitation system likes to ape the western models which don’t work so well in our environment. We built our own toilet. I think you will find the blueprints online and you can get it made yourself. Tbh it is easier to use if you own a house. Complexes won’t allow you to deal with waste this way ( even though it is more sanitary). And no it cost us less to build it than to would to buy a kohler commode I understand your concerns but these issues don’t seem that gross to me. Splashback happens but not very often in my experience if Your grossed out by butts touching the toilet seat, hover or poop at home when possible. Now my main concern with the Indian Toilet is the clean up. the hose seems fine however using a bucket of water and your fingers to clean your butt is absolutely disgusting \\+ Rubbing your butt on toilet seat used by others. I find that most disgusting. I always shit on paper when toilets are western and throw them inside. I just can't shit bcz of anxiety of getting disease bcz of sitting or splashes. The pressure automatically disappears for me. Its a health concern rather than a choice that your legs are not supporting your own weight. Point noted. Will pitch this in shark tank next season. The down votes makes me wonder which part of india these down voters live. Seems like they are Indians living outside india. On the contrary the ass rub and shit splashes of western toilets give me anxiety and jams my rectum. Shark tank worthy idea😂 An interesting perspective for me as a squat shitter. Or they don't understand basic physics or biology. Or they think that even shit from west is gold and even gold from India is shit. Lamo, where do you live where western toilets are common? I have seen most private homes with indian toilets. Maybe you are from some high income family who live in big bungalows with western architecture and have never visited a middle class family or villages. Even \"Pradhan Mantri Sauchalay Yojana\" gives indian toilets. He said that he was \"lazy\". So there is a choice not to be lazy. If the said that he was obese/old etc and couldn't do it, I would understand. help how do you wash it then?? But yes, I COMPLETELY AGREE TOUCHING THAT COLD TOILET SEAT WHEN SITTING ON IT GROSSES ME TF OUT, EVEN THE COLD FIBRE/PLASTIC (whatever it is) IS JUST SO DISGUSTING FOR ME (im not screaming, just extremely passionate) Why the faaack is this not mainstream???? Because the rest of the world doesn't like using the street as a bathroom They are better than shitting in the street OMG, how negative are the comments! I agree with OP. There should be both available. To cater to a minority group of disabled, aged, pregnant, those who prefer it , etc, we are forgetting the majority or least half the population. Apologies for preferring not to shit in an open pit in a non ventilated cement box This has been around for long. At least as old as i am. 30+ The only reason you are not using it, according to you, is the squatting position which youre not comfortable with. The hygienics is equally bad in public toilets with western design. At least when i poop in a unclean toilet i don't have to touch it. Other than this, is there any other reasons? Western toilets are safer for sick, old, and disabled/differently-abled people. It's not just about me not being comfortable (which I didn't even say??). Most people are not comfortable with it, hence the mass-adoption of the western toilet. No one forced anyone to add it in their home yet most people have. It is just more comfortable and safe for everyone. It has little to do with hygiene. This is such an idiotic and inconsiderate take. You said it yourself. The position is hard for you sit. I agree its safe for differently abled and sick, elderly people. I dont know anything about safety for normal people though. How is it safer than an Indian toilet? Which again brings me back to personal choice and experience with it growing up. About hygiene , OP is making a point about water splashing and butt touching on the seat, which is shared by everyone. Which you dont even mention in your hygiene argument . Why did you call it idiotic? Bcz you didn't quite get what i said? It doesn’t happen with every toilet lmao, only the ones with a much more narrow base This!!! The splash does not happen to everyone, you just don’t use western toilets enough to know how to prevent that from happening Also, imagine stepping on what was people’s piss and poop in a public Indian toilet before they’ve washed it down with water, disgusting"
}