{
    "id": "150l1nl",
    "title": "Even a great place couldn't change her, so she had to delete my comment.",
    "url": "https://www.reddit.com/gallery/150l1nl",
    "selftext": "This post popped in my feed and she mentioned “buying a house” as the first goal in life.\n\nThese goals can be very unrealistic when they are just breaking into a career.\n\nPeople going to USA, getting a job at big tech corp still can't change a person's mindset.\n\nThey just have the same goals.\nBut what's bad is putting this influence on freshers and setting these expections for parents.\n\nJust my thoughts.\n\nShe had to delete my comment because she couldn't reply.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689450156.0,
    "convurl": "https://i.redd.it/u2ott1tom6cb1.png",
    "comments": [
        "Why isn't buying a house ok?\n\nNot /s\n\nWouldn't renting one lead to the same outcome, if you lose your job you lose your home",
        "Having burdens of home loan EMIs reduces your risk taking appetite and adds the mental pressure of losing your job and house constantly, you can sleep peacefully on a rented flat.\n\nThe amount of investment needed to be put on a down payment itself is far more than any deposit you’d put on a rented house.\nYou can also leave a rented flat at any time without trying to find a tenant who won’t destroy your flat while you’re gone.\nAt younger years especially (that post’s target) - better off investing that money elsewhere.",
        "Buy house when you have savings or emergency find to pay EMI's and manage other expenses for 1 to 2 years after paying down payment"
    ],
    "cleaned_text": "even great place couldnt change delete comment post popped feed mentioned buying house first goal life goals unrealistic breaking career people going usa getting job big tech corp still cant change persons mindset goals whats bad putting influence freshers setting expections parents thoughts delete comment couldnt reply ",
    "cleaned_title": "even great place couldnt change delete comment",
    "cleaned_selftext": "post popped feed mentioned buying house first goal life goals unrealistic breaking career people going usa getting job big tech corp still cant change persons mindset goals whats bad putting influence freshers setting expections parents thoughts delete comment couldnt reply",
    "cleaned_comments": "isnt buying house ok wouldnt renting one lead outcome lose job lose home burdens home loan emis reduces risk taking appetite adds mental pressure losing job house constantly sleep peacefully rented flat amount investment needed put payment far deposit youd put rented house also leave rented flat time without trying find tenant wont destroy flat youre gone younger years especially posts target better investing money elsewhere buy house savings emergency find pay emis manage expenses years paying payment",
    "light_cleaned_title": "Even a great place couldn't change her, so she had to delete my comment.",
    "light_cleaned_selftext": "This post popped in my feed and she mentioned “buying a house” as the first goal in life. These goals can be very unrealistic when they are just breaking into a career. People going to USA, getting a job at big tech corp still can't change a person's mindset. They just have the same goals. But what's bad is putting this influence on freshers and setting these expections for parents. Just my thoughts. She had to delete my comment because she couldn't reply.",
    "light_cleaned_comments": "Why isn't buying a house ok? Not /s Wouldn't renting one lead to the same outcome, if you lose your job you lose your home Having burdens of home loan EMIs reduces your risk taking appetite and adds the mental pressure of losing your job and house constantly, you can sleep peacefully on a rented flat. The amount of investment needed to be put on a down payment itself is far more than any deposit you’d put on a rented house. You can also leave a rented flat at any time without trying to find a tenant who won’t destroy your flat while you’re gone. At younger years especially (that post’s target) - better off investing that money elsewhere. Buy house when you have savings or emergency find to pay EMI's and manage other expenses for 1 to 2 years after paying down payment"
}