{
    "id": "14tpv5f",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/14tpv5f/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&format=png&auto=webp&s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 12,
    "created_utc": 1688779807.0,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Hijack",
        "Never Have I Ever Finale",
        "Last night started the 3rd arc of bleach! Crazy",
        "Good Night movie... go for it",
        "Son has been posting [**Book Reviews on Youtube**](https://www.youtube.com/@BRBV)**.** \n\nI've been trying organic outreach with 'family and friends' but competing with Sharma-ji-ki-beti who gyrates to latest bollywood tunes is hard. Really hard. \n\nAny suggestions on outreach for this niche gene?",
        "As you pointed, it's a niche space. Only a small percentage of people read books and even fewer read/watch reviews. But still, I have more than a few suggestions... I'm going to assume it's your channel, even if it technically isn't.\n\n\\- Think of a new channel name, it's too generic and formulaic. Just as an example, make it just \"Vijay\" + surname rather than \"Book Reviews by Vijay\". Or think of something creative and unique. Take inspiration from other popular Youtubers. No one is going to search for your channel by name in the initial phase, people are going to search for a particular book's review and they might stumble upon your channel. And also, if later on you decide to make different content on his channel, the current one won't make any sense.\n\n\\- The titling of the videos is also quite problematic. Make the subject \"the hero\" of the video and not yourself. So instead of \"Book review by Vijay - Drowned Wednesday...\" make it \"Drowned Wednesday by Garth Nix - Review\". Keep it simple. No need to add your name to every title. Or even mentioning the word \"book\". These are obvious to the viewer.\n\n\\- Learn to make more attractive thumbnails. Take inspiration from the very best (MKBHD, Johnny Harris etc.) and apply that to your channel's content and keep it consistent. It's easier these days with AI tools. Ask yourself: \"Would I click this?\".\n\n\\- Production could be better and 1080p is a must these days. Learn a bit of color grading. Again, it's very easy these days. Youtube is your friend. Also the audio quality is just unacceptable, so get a dedicated microphone. If possible, add English subtitles. And make the bookshelf your background.\n\n\\- I haven't checked the actual content of the video, but these videos are only 2-3 minutes long. Try to get deeper into books' themes and characters. Don't just narrate the story. Read other people's book reviews and their approach. Try to review more popular books so there are more chances of people discovering your channel.\n\n\\- At last, check what other successful Youtubers in the same field are doing. Keep improving.\n\nI know it seems like lot of work and maybe it is, but laziness gets only mediocre results. Good luck!",
        "Great feedback. Thanks!\n\nWill take note of some of these points and action them.",
        "Watched Guardians yesterday, imo best movie this year. If you can suggest better movies than this pls recc(this year launches), genre no bar. \n***\nAlso quite amused listening to Adam Raguesa's Pod around Chef Gordon Ramsay. Putting this here coz he was really popular during the TV era (even in India) and people really liked his show: Kitchen Nightmares, it was even dubbed in Hindi. The podcast also talked about Marco Pierre White he is a famous chef in London although not as popular in India. \n\n[Why I dislike Gordon Ramsay and prefer 'today' (Spotify)](https://open.spotify.com/episode/7vKZepdTgRshYwPuafCJq1?si=VKOxk3HoRMGHTX9l6Kmkxg)",
        "Watching The Punisher, nothing great so far",
        "Over the weekend, I indulged in a delightful holiday where I dedicated myself to immersing in the captivating world of Westworld Season 1. Although long overdue, I successfully completed the entire season within a mere two days. However, contemplating my viewing plans, I find myself inclined to skip Season 2 and instead opt for a concise 15-minute explanatory video on YouTube to grasp the key elements and developments of that particular season. My intention is to swiftly move forward and eagerly dive into the intriguing realm of Season 3 come next Saturday.",
        "Finished 9th season of curb your enthusiasm. Any Seinfeld fan should watch."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall ",
    "cleaned_title": "biweekly movies tv shows documentaries podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall",
    "cleaned_comments": "hijack never ever finale last night started rd arc bleach crazy good night movie go son posting book reviews youtubehttpswwwyoutubecombrbv ive trying organic outreach family friends competing sharmajikibeti gyrates latest bollywood tunes hard really hard suggestions outreach niche gene pointed niche space small percentage people read books even fewer readwatch reviews still suggestions im going assume channel even technically isnt think new channel name generic formulaic example make vijay surname rather book reviews vijay think something creative unique take inspiration popular youtubers one going search channel name initial phase people going search particular books review might stumble upon channel also later decide make different content channel current one wont make sense titling videos also quite problematic make subject hero video instead book review vijay drowned wednesday make drowned wednesday garth nix review keep simple need add name every title even mentioning word book obvious viewer learn make attractive thumbnails take inspiration best mkbhd johnny harris etc apply channels content keep consistent easier days ai tools ask would click production could better p must days learn bit color grading easy days youtube friend also audio quality unacceptable get dedicated microphone possible add english subtitles make bookshelf background havent checked actual content video videos minutes long try get deeper books themes characters dont narrate story read peoples book reviews approach try review popular books chances people discovering channel last check successful youtubers field keep improving know seems like lot work maybe laziness gets mediocre results good luck great feedback thanks take note points action watched guardians yesterday imo best movie year suggest better movies pls reccthis year launches genre bar also quite amused listening adam raguesas pod around chef gordon ramsay putting coz really popular tv era even india people really liked show kitchen nightmares even dubbed hindi podcast also talked marco pierre white famous chef london although popular india dislike gordon ramsay prefer today spotifyhttpsopenspotifycomepisodevkzepdtgrshywpuafcjqsivkoxkhormghtxlkmkxg watching punisher nothing great far weekend indulged delightful holiday dedicated immersing captivating world westworld season although long overdue successfully completed entire season within mere two days however contemplating viewing plans find inclined skip season instead opt concise minute explanatory video youtube grasp key elements developments particular season intention swiftly move forward eagerly dive intriguing realm season come next saturday finished th season curb enthusiasm seinfeld fan watch",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Hijack Never Have I Ever Finale Last night started the 3rd arc of bleach! Crazy Good Night movie... go for it Son has been posting [**Book Reviews on Youtube**](https://www.youtube.com/@BRBV)**.** I've been trying organic outreach with 'family and friends' but competing with Sharma-ji-ki-beti who gyrates to latest bollywood tunes is hard. Really hard. Any suggestions on outreach for this niche gene? As you pointed, it's a niche space. Only a small percentage of people read books and even fewer read/watch reviews. But still, I have more than a few suggestions... I'm going to assume it's your channel, even if it technically isn't. \\- Think of a new channel name, it's too generic and formulaic. Just as an example, make it just \"Vijay\" + surname rather than \"Book Reviews by Vijay\". Or think of something creative and unique. Take inspiration from other popular Youtubers. No one is going to search for your channel by name in the initial phase, people are going to search for a particular book's review and they might stumble upon your channel. And also, if later on you decide to make different content on his channel, the current one won't make any sense. \\- The titling of the videos is also quite problematic. Make the subject \"the hero\" of the video and not yourself. So instead of \"Book review by Vijay - Drowned Wednesday...\" make it \"Drowned Wednesday by Garth Nix - Review\". Keep it simple. No need to add your name to every title. Or even mentioning the word \"book\". These are obvious to the viewer. \\- Learn to make more attractive thumbnails. Take inspiration from the very best (MKBHD, Johnny Harris etc.) and apply that to your channel's content and keep it consistent. It's easier these days with AI tools. Ask yourself: \"Would I click this?\". \\- Production could be better and 1080p is a must these days. Learn a bit of color grading. Again, it's very easy these days. Youtube is your friend. Also the audio quality is just unacceptable, so get a dedicated microphone. If possible, add English subtitles. And make the bookshelf your background. \\- I haven't checked the actual content of the video, but these videos are only 2-3 minutes long. Try to get deeper into books' themes and characters. Don't just narrate the story. Read other people's book reviews and their approach. Try to review more popular books so there are more chances of people discovering your channel. \\- At last, check what other successful Youtubers in the same field are doing. Keep improving. I know it seems like lot of work and maybe it is, but laziness gets only mediocre results. Good luck! Great feedback. Thanks! Will take note of some of these points and action them. Watched Guardians yesterday, imo best movie this year. If you can suggest better movies than this pls recc(this year launches), genre no bar. *** Also quite amused listening to Adam Raguesa's Pod around Chef Gordon Ramsay. Putting this here coz he was really popular during the TV era (even in India) and people really liked his show: Kitchen Nightmares, it was even dubbed in Hindi. The podcast also talked about Marco Pierre White he is a famous chef in London although not as popular in India. [Why I dislike Gordon Ramsay and prefer 'today' (Spotify)](https://open.spotify.com/episode/7vKZepdTgRshYwPuafCJq1?si=VKOxk3HoRMGHTX9l6Kmkxg) Watching The Punisher, nothing great so far Over the weekend, I indulged in a delightful holiday where I dedicated myself to immersing in the captivating world of Westworld Season 1. Although long overdue, I successfully completed the entire season within a mere two days. However, contemplating my viewing plans, I find myself inclined to skip Season 2 and instead opt for a concise 15-minute explanatory video on YouTube to grasp the key elements and developments of that particular season. My intention is to swiftly move forward and eagerly dive into the intriguing realm of Season 3 come next Saturday. Finished 9th season of curb your enthusiasm. Any Seinfeld fan should watch."
}