{
    "id": "18z5qgz",
    "title": "I don't want to meet him, I myself can't make any money.",
    "url": "https://i.redd.it/u6q6abqh7mac1.jpeg",
    "selftext": "What am I supposed to do with this information? Yes, I wasn't capable to get into IIT, why do you have to rub it on my face? Let him earn 300 crore, just stop showing dumb stuff to me. Reading this just shows how useless I am.\n\nHate such news articles.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1704457589.0,
    "convurl": "https://i.redd.it/u6q6abqh7mac1.jpeg",
    "comments": [
        "IIT graduate? He went to UCB after that. Pretty sure that being from IIT has nothing to do with  him getting 300cr package. He went to UCB and UCSB later.",
        "Oh but nobody will consider that and you will be branded as someone who is bringing his birth country down. Those headlines are made for specific audience.",
        "That article is garbage [https://www.dnaindia.com/education/report-meet-iit-graduate-with-over-rs-300-crore-salary-package-he-left-yahoo-to-join-3073481](https://www.dnaindia.com/education/report-meet-iit-graduate-with-over-rs-300-crore-salary-package-he-left-yahoo-to-join-3073481)\n\nYou could take his nursery school name re-write the title. \n\nYou should only compare starting salary and attribute to IIT (if at all).  He studied some really great American colleges, did stay with many technology giants in their early stages.  His \\_salary\\_  is coming from stocks.",
        "Exactly. I get depressed hearing any news related to IIT. OK fine those people are einstein and I am a fucking failure but like every single day the news media rubs it on my face and it’s intolerable. Feel like killing myself.",
        "I can bet that no engineer gets 300 crore salary anywhere in the world. There is definitely some weird calculations and misinformation in there."
    ],
    "cleaned_text": "dont want meet cant make money supposed information yes wasnt capable get iit rub face let earn crore stop showing dumb stuff reading shows useless hate news articles ",
    "cleaned_title": "dont want meet cant make money",
    "cleaned_selftext": "supposed information yes wasnt capable get iit rub face let earn crore stop showing dumb stuff reading shows useless hate news articles",
    "cleaned_comments": "iit graduate went ucb pretty sure iit nothing getting cr package went ucb ucsb later oh nobody consider branded someone bringing birth country headlines made specific audience article garbage httpswwwdnaindiacomeducationreportmeetiitgraduatewithoverrscroresalarypackageheleftyahootojoinhttpswwwdnaindiacomeducationreportmeetiitgraduatewithoverrscroresalarypackageheleftyahootojoin could take nursery school name rewrite title compare starting salary attribute iit studied really great american colleges stay many technology giants early stages salary coming stocks exactly get depressed hearing news related iit ok fine people einstein fucking failure like every single day news media rubs face intolerable feel like killing bet engineer gets crore salary anywhere world definitely weird calculations misinformation",
    "light_cleaned_title": "I don't want to meet him, I myself can't make any money.",
    "light_cleaned_selftext": "What am I supposed to do with this information? Yes, I wasn't capable to get into IIT, why do you have to rub it on my face? Let him earn 300 crore, just stop showing dumb stuff to me. Reading this just shows how useless I am. Hate such news articles.",
    "light_cleaned_comments": "IIT graduate? He went to UCB after that. Pretty sure that being from IIT has nothing to do with him getting 300cr package. He went to UCB and UCSB later. Oh but nobody will consider that and you will be branded as someone who is bringing his birth country down. Those headlines are made for specific audience. That article is garbage [https://www.dnaindia.com/education/report-meet-iit-graduate-with-over-rs-300-crore-salary-package-he-left-yahoo-to-join-3073481](https://www.dnaindia.com/education/report-meet-iit-graduate-with-over-rs-300-crore-salary-package-he-left-yahoo-to-join-3073481) You could take his nursery school name re-write the title. You should only compare starting salary and attribute to IIT (if at all). He studied some really great American colleges, did stay with many technology giants in their early stages. His \\_salary\\_ is coming from stocks. Exactly. I get depressed hearing any news related to IIT. OK fine those people are einstein and I am a fucking failure but like every single day the news media rubs it on my face and it’s intolerable. Feel like killing myself. I can bet that no engineer gets 300 crore salary anywhere in the world. There is definitely some weird calculations and misinformation in there."
}