{
    "id": "16dzd2j",
    "title": "Is iPhone 13 for 34K legit in Bajaj Electronics sale?",
    "url": "https://www.reddit.com/r/india/comments/16dzd2j/is_iphone_13_for_34k_legit_in_bajaj_electronics/",
    "selftext": "I saw an ad in the local paper for Bajaj Electronics sale, they are selling iPhone 13 for 34k and iPhone 14 Plus for 50k, a lot less than the normal going prices... so is this legit? What's the catch? I'm an Android user but it is very tempting to buy iPhone at cheap price in EMI... please advice.\n\nAd: \n\n[\\\\\"Bajaj Electronics - Mobile Mela Sale, 2 - 17 September\\\\\"](https://preview.redd.it/g7cv10bql6nb1.png?width=722&format=png&auto=webp&s=412207d8bb496dd1e294f63de85b7c1ddaf1cf26)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694244213.0,
    "convurl": "https://b.thumbs.redditmedia.com/DzMhTsGj6z0ZHColUNocB7R0DOLXtErkVIY7rmt07zQ.jpg",
    "comments": [
        "Price mentioned maybe including Store discount, EMI discount and Old Phone Exchange bonus.",
        "\"effective price\" has a different context..they might have added your kidney price for instance.",
        "Good catch regarding old phone.",
        "🤣🤣",
        "It’s the regular and not the Pro iPhone models.\n\nThe inclusion of the wording ‘Effective’ pretty much it has to have the following mentioned bank accounts collectively in order to accumulate the total discount mentioned in the newspaper, it’s safe to ask them about it.",
        "What's difference between normal and pro? It says 11k store discount too.",
        "The non-pro version uses last year’s chip that debuted in the Pro along with last gen tech like the 60Hz display which comes in a cheaper aluminium frame that’s susceptible to dents if used without a case but otherwise has a better battery if one grabs the larger Plus variant.",
        "That price is including exchange bonus. They’ll lowball you hard for your old phone exchange and recover the difference and some.\n\nIncluding exchange cost in discount is the biggest scum tactic in the last few years.",
        "It will be offline. Why not check it out? If the deal doesn't suit you then don't get it.",
        "I am planning to go, but wanted to know other people's experience, even after post-purchase with bajaj electronics.",
        "Are you sure? It doesn't say anything about exchange cost. Only mentions the instant store discount.",
        "Exchange bonus upto 10000 is literally mentioned in the second from right box on top",
        "That must be the down payment or it will be with buy back guarantee",
        "Bruh, didn't notice that... sorry.",
        "What is buy back guarantee? Can I sell it to them later?",
        "Wait, it says additional discount.",
        "They’ll just value your phone significantly lower and make back that 10k.\n\nSay for example you’re exchanging an iPhone 11 which is worth 20k. They’ll only give you 10k for it and another 10k extra exchange bonus",
        "Yup. After 1 year. But generally those are not the best value for money. You can get way better value at local stores. On top of that iPhone are meant to be used for a long time. There's no point of selling it after 1 year specially when apple not making any improvements at all to the newer ones"
    ],
    "cleaned_text": "iphone k legit bajaj electronics sale saw ad local paper bajaj electronics sale selling iphone k iphone plus k lot less normal going prices legit whats catch im android user tempting buy iphone cheap price emi please advice ad bajaj electronics mobile mela sale septemberhttpspreviewredditgcvbqlnbpngwidthformatpngautowebpsdbbddefdebcddafcf ",
    "cleaned_title": "iphone k legit bajaj electronics sale",
    "cleaned_selftext": "saw ad local paper bajaj electronics sale selling iphone k iphone plus k lot less normal going prices legit whats catch im android user tempting buy iphone cheap price emi please advice ad bajaj electronics mobile mela sale septemberhttpspreviewredditgcvbqlnbpngwidthformatpngautowebpsdbbddefdebcddafcf",
    "cleaned_comments": "price mentioned maybe including store discount emi discount old phone exchange bonus effective price different contextthey might added kidney price instance good catch regarding old phone regular pro iphone models inclusion wording effective pretty much following mentioned bank accounts collectively order accumulate total discount mentioned newspaper safe ask whats difference normal pro says k store discount nonpro version uses last years chip debuted pro along last gen tech like hz display comes cheaper aluminium frame thats susceptible dents used without case otherwise better battery one grabs larger plus variant price including exchange bonus theyll lowball hard old phone exchange recover difference including exchange cost discount biggest scum tactic last years offline check deal doesnt suit dont get planning go wanted know peoples experience even postpurchase bajaj electronics sure doesnt say anything exchange cost mentions instant store discount exchange bonus upto literally mentioned second right box top must payment buy back guarantee bruh didnt notice sorry buy back guarantee sell later wait says additional discount theyll value phone significantly lower make back k say example youre exchanging iphone worth k theyll give k another k extra exchange bonus yup year generally best value money get way better value local stores top iphone meant used long time theres point selling year specially apple making improvements newer ones",
    "light_cleaned_title": "Is iPhone 13 for 34K legit in Bajaj Electronics sale?",
    "light_cleaned_selftext": "I saw an ad in the local paper for Bajaj Electronics sale, they are selling iPhone 13 for 34k and iPhone 14 Plus for 50k, a lot less than the normal going prices... so is this legit? What's the catch? I'm an Android user but it is very tempting to buy iPhone at cheap price in EMI... please advice. Ad: [\\\\\"Bajaj Electronics - Mobile Mela Sale, 2 - 17 September\\\\\"](https://preview.redd.it/g7cv10bql6nb1.png?width=722&format=png&auto=webp&s=412207d8bb496dd1e294f63de85b7c1ddaf1cf26)",
    "light_cleaned_comments": "Price mentioned maybe including Store discount, EMI discount and Old Phone Exchange bonus. \"effective price\" has a different context..they might have added your kidney price for instance. Good catch regarding old phone. 🤣🤣 It’s the regular and not the Pro iPhone models. The inclusion of the wording ‘Effective’ pretty much it has to have the following mentioned bank accounts collectively in order to accumulate the total discount mentioned in the newspaper, it’s safe to ask them about it. What's difference between normal and pro? It says 11k store discount too. The non-pro version uses last year’s chip that debuted in the Pro along with last gen tech like the 60Hz display which comes in a cheaper aluminium frame that’s susceptible to dents if used without a case but otherwise has a better battery if one grabs the larger Plus variant. That price is including exchange bonus. They’ll lowball you hard for your old phone exchange and recover the difference and some. Including exchange cost in discount is the biggest scum tactic in the last few years. It will be offline. Why not check it out? If the deal doesn't suit you then don't get it. I am planning to go, but wanted to know other people's experience, even after post-purchase with bajaj electronics. Are you sure? It doesn't say anything about exchange cost. Only mentions the instant store discount. Exchange bonus upto 10000 is literally mentioned in the second from right box on top That must be the down payment or it will be with buy back guarantee Bruh, didn't notice that... sorry. What is buy back guarantee? Can I sell it to them later? Wait, it says additional discount. They’ll just value your phone significantly lower and make back that 10k. Say for example you’re exchanging an iPhone 11 which is worth 20k. They’ll only give you 10k for it and another 10k extra exchange bonus Yup. After 1 year. But generally those are not the best value for money. You can get way better value at local stores. On top of that iPhone are meant to be used for a long time. There's no point of selling it after 1 year specially when apple not making any improvements at all to the newer ones"
}