{
    "id": "16scbt2",
    "title": "Center: No new medical colleges or MBBS seats in South India",
    "url": "https://i.redd.it/dvm3brziniqb1.jpg",
    "selftext": "In a bizarre policy, States that are better off in the health sector are expected to be impacted more. The World Health Organisation recommends a doctor-to-population ratio of 1:1,000, and southern states have crossed it properly. And now the Center is punishing it for doing well, by forcing it to reduce the number of medical seats.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695697593.0,
    "convurl": "https://i.redd.it/dvm3brziniqb1.jpg",
    "comments": [
        "[Image and data source.](https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/)",
        "The future role of the south is to absorb the surplus humans from the north, learn hindi etc.",
        "Q: How to reduce the imbalance b/w North/South when it comes to health metrics?\nCenter: Let’s drag south numbers down, so north doesn’t look so bad",
        "In a country that has some of the worst outcomes, it is beyond insane to impose an *upper limit* on doctors. But this is par for the course for a govt that would rather push gaumutra as a cure-all. \n\nAlso, this helps them punish the five southern states for being anti national ie vote against the sacred BJP. Expect this trend to continue and even intensify after delimitation in 2026. After that, with the southern states reduced to irrelevance, it will become much easier to extract even more in taxes (by further reducing the states share in central taxes).\n\n20 years from now, the south will be a husk of its current self. We in the south can enjoy it while it lasts, which is not going to be very long.",
        "If you can't improve the North, drag the South down. What an excellent policy. 👏",
        "And how are the numbers in the North? Something tells me they're way below the norms",
        "Instead they should be looking to fill seats in the North lmao",
        "Lots of cows!"
    ],
    "cleaned_text": "center new medical colleges mbbs seats south india bizarre policy states better health sector expected impacted world health organisation recommends doctortopopulation ratio southern states crossed properly center punishing well forcing reduce number medical seats ",
    "cleaned_title": "center new medical colleges mbbs seats south india",
    "cleaned_selftext": "bizarre policy states better health sector expected impacted world health organisation recommends doctortopopulation ratio southern states crossed properly center punishing well forcing reduce number medical seats",
    "cleaned_comments": "image data sourcehttpsthesouthfirstcomhealthnewnmcguidelineswontallownewmedicalcollegesseatsinanystatesofsouthindia future role south absorb surplus humans north learn hindi etc q reduce imbalance bw northsouth comes health metrics center lets drag south numbers north doesnt look bad country worst outcomes beyond insane impose upper limit doctors par course govt would rather push gaumutra cureall also helps punish five southern states anti national ie vote sacred bjp expect trend continue even intensify delimitation southern states reduced irrelevance become much easier extract even taxes reducing states share central taxes years south husk current self south enjoy lasts going long cant improve north drag south excellent policy numbers north something tells theyre way norms instead looking fill seats north lmao lots cows",
    "light_cleaned_title": "Center: No new medical colleges or MBBS seats in South India",
    "light_cleaned_selftext": "In a bizarre policy, States that are better off in the health sector are expected to be impacted more. The World Health Organisation recommends a doctor-to-population ratio of 1:1,000, and southern states have crossed it properly. And now the Center is punishing it for doing well, by forcing it to reduce the number of medical seats.",
    "light_cleaned_comments": "[Image and data source.](https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/) The future role of the south is to absorb the surplus humans from the north, learn hindi etc. Q: How to reduce the imbalance b/w North/South when it comes to health metrics? Center: Let’s drag south numbers down, so north doesn’t look so bad In a country that has some of the worst outcomes, it is beyond insane to impose an *upper limit* on doctors. But this is par for the course for a govt that would rather push gaumutra as a cure-all. Also, this helps them punish the five southern states for being anti national ie vote against the sacred BJP. Expect this trend to continue and even intensify after delimitation in 2026. After that, with the southern states reduced to irrelevance, it will become much easier to extract even more in taxes (by further reducing the states share in central taxes). 20 years from now, the south will be a husk of its current self. We in the south can enjoy it while it lasts, which is not going to be very long. If you can't improve the North, drag the South down. What an excellent policy. 👏 And how are the numbers in the North? Something tells me they're way below the norms Instead they should be looking to fill seats in the North lmao Lots of cows!"
}