{
    "id": "13zd2s9",
    "title": "This goverment is anti-women to the core and slogan of 'beti bachao,beti padhao' is just a big lie",
    "url": "https://www.reddit.com/r/india/comments/13zd2s9/this_goverment_is_antiwomen_to_the_core_and/",
    "selftext": "Apart from being fascist, BJP govermnent has long history of protecting sexual offenders and murderers.  It is anti-women to the core . Here are some instances which proves it. \n\n1. Wrestlers protest case : Supreme Court had to intervene just to file FIR on brij bhusan Sharan singh who is BJP MP . Despite FIR filed under POCSO act , and other serious charges, he has not been arrested yet . \nhttps://indianexpress.com/article/india/demands-for-sexual-favours-at-least-10-cases-of-molestation-detailed-in-2-firs-against-brij-bhushan-8641505\n\n2. PM modi '50 cr girlfriend ',  'Didi O Didi ' jibe during west Bengal election and comparing MP renuka chowdhury with surpankha , shows his mentality.\nhttps://www.hindustantimes.com/india-news/renuka-chowdhury-to-file-defamation-against-pm-modi-for-surpanaka-how-fast-courts-101679615668459.html\nhttps://indianexpress.com/article/india/latest-news/narendra-modi-labels-shashi-tharoors-wife-a-rs-50-crore-girlfriend/\n\n3. Unnao rape case : In this case, kuldeep singh sengar , MLA of BJP  was convicted . BJP protected  him till last moment . \nhttps://timesofindia.indiatimes.com/india/unnao-rape-court-pulls-up-cbi-for-delay-in-chargesheet-absence-of-women-officers-in-probe/articleshow/72774748.cms\n\n4. Kathua rape case : tiranga yatra was done in favour of accused , 2 BJP ministers participated \nhttps://www.indiatoday.in/india/story/kathua-rape-case-2-bjp-ministers-attend-rally-in-support-of-accused-1181788-2018-03-04\n\n5. Bilkis bano case : All rapists were released by gujarat goverment on account of 'good behavior ' . People garlanded them and convicts shared stage with BJP MLA  .\nhttps://www.hindustantimes.com/india-news/bilkis-bano-gang-rape-convict-shares-stage-with-bjp-lawmakers-provokes-outrage-101679897054020.html\n\n6. Statues of Ahilya bai holkar and savitri bai phule removed from maharashtra Sadan \nhttps://indianexpress.com/article/cities/mumbai/maharashtra-sadan-delhi-statue-savitribai-phule-holkar-controversy-8635542/\n\n7. Hathras rape case : girl body was cremated at night forcefully despite family objection . Did she deserve that treatment? What can be worst for family who were not allowed to see their daughter face last time ?  They were held captive by UP police. After all this, 4 of 3 accused were freed and none of them were charged with rape despite CBI convicting them . \nhttps://www.indiatoday.in/india/story/up-police-takes-hathras-gangrape-victim-s-body-kin-to-village-asks-them-to-cremate-it-overnight-1726773-2020-09-29\n\nIs this new india we wanted ? We should bow down our head in shame !",
    "flair": "Politics",
    "score": 478,
    "num_comments": 41,
    "created_utc": 1685799270.0,
    "convurl": "https://external-preview.redd.it/ZYexqcH4WqG6wrF3rTQgyAUx7zY0ucMrEA1jrZvNGbo.jpg?auto=webp&v=enabled&s=e5fd0795c2190ff29fa3d1e90e36874b89c78eac",
    "comments": [
        "Matter of shame and frankly terrifying that we have such a sizeable number of people who look at this party and go 'that's my first choice.'",
        "And how BJP IT Cell lynch women online for expressing their opinion. \n\nAlso, Modi followed (or follows) and recent re tweeted tweet of guy who was behind Suli Deals.",
        "People deserve the Government they elect. It's a reflection of them.",
        "It’s a studied fact that fascism is essentially anti-women.\n\nSo it’s pretty much on brand.",
        "yeah but do the rest? We will end up suffering too.",
        "Bro, gehun ke sath sath dhun bhi pisti hai, it's our misfortune. Let's pray for better luck this time.",
        "2024 ; Opening the mandir will forgive all of their sins and people will forget everything. /s",
        "lets not make it that easy for them. Speaking up helps. there wont be a next time.",
        "It doesn't absolve the govt of putting rapists in position of power. \n\nIf you get hired for a job and screw it, you will be accountable, not your interviewer.",
        "Khud chunaav lar lo fir. Be the change you want to see.",
        "Then criminals like brij bhusan will call rally and seers will support him  from that temple itself .",
        "The Biggest one according to me which mny don't talk about\n\nThe proposal of increasing legal age of women for marriage from 18 was proposed years ago and then they went completely silent. \n\nThe media spread the news like wild fire and countless girls aged 18 or even lesser were married off to men of their father's age in many villages of India, They feared ladki bhoj ban jayegi. \n\nCountless women and their lives are forever ruined because of this abrupt announcement and inaction. Even today many suffer. \n\nRemember the farmers laws were passed in both houses and became a law in record speed but something so sensitive to the vulnerable section of the society is still pending. They really don't give a fuck about women's lives and the torture they go through in this patriarchal society. \n\n* I'm not finding the articles and interviews of village leaders openly admitting to getting rid of their girls to whosoever comes forward before the law comes to force.",
        "Did I say govt is not accountable for all this ? Goverment is the main culprit as I have stated \nBut people also take part in elections, they have responsibility too . They should vote sensibly .",
        "Dude, you forgot to switch your alt accounts.",
        "Yeah man, I don't want that to happen..but all the factors say that they are gonna win again 😓",
        "Someone purposefully said it \"Beti bachao Beti Patao\"\n\nIt aligns with their mentality",
        "Practically all their slogans other than the Hindu rashtra ones are a lie.",
        "Beti Bachao is a challenge, i.e beti humse bachake dikhao- Balatkari Janwar Party.",
        "Indian culture is anti-women. Always has been, most likely always will be.",
        "Everyone was warned in 2014 that this would happen. The country deserves what it is going through. We have them the mandate to rule over us like this. \n\nThe BJP’s fascism is not even a new phenomenon. They have been a fanatical fascist party from the last time they ruled as well. They brought about destruction and disharmony among the masses before as well. They have brought genocidal terror and riots in the states they ruled as well. But the country still elected them and gave them the mandate. You do not have the option to sit on the internet and talk about this anymore. I know a lot of folks who actively did not vote these scumbags into power. But those who did, it is their responsibility to either take action and get these scumbags out of power, or shut up and suffer like the rest of us. All this ‘spreading awareness’ trope is just mental masturbation.\n\nWe all know these people are corrupt, evil, and greedy. We always knew that. We campaigned against that. Quite excessively in fact. But all you ‘give chance’ BJP voters taunted us using a synonymous version of Arnab Goswami’s infamous slogan- “if not Modi, who?”\n\nPlease spare us the reddit posts. We have spoken enough about how shit things are. It’s time to take action because I don’t think the BJP is getting voted out next year either. \n\nOr stay cynical about our options and keep living in this fascist shithole. A lot of you here are privileged enough to not have anything happen to you. 🤷‍♂️",
        "Ghun.",
        "Honorable mention must be given to the fact that according to Dear Leader, Sheikh Hasina has been good at fighting terrorism [despite being a woman](https://m.economictimes.com/news/politics-and-nation/pm-narendra-modi-draws-flak-for-despite-being-a-woman-remark-on-sheikh-hasina/articleshow/47588959.cms). \n\nThis tells us a few things about the great man:\n\n-\the thinks this is a good compliment to give to a leader of a foreign country that is strategically important for India \n-\this views on the capability of women in general\n\n\nWhen this is the direction set from the top, it is hardly surprising that such illustrious men as Brij Bhushan Singh grace the BJP",
        "Modi doesn’t get women. Him, Shah, Yogi and their friends like little boys. He fears what he does not understand. One look at Modi years ago and I got pedo vibes.",
        "beti bachao is not a lie, its a warning."
    ],
    "cleaned_text": "goverment antiwomen core slogan beti bachaobeti padhao big lie apart fascist bjp govermnent long history protecting sexual offenders murderers antiwomen core instances proves wrestlers protest case supreme court intervene file fir brij bhusan sharan singh bjp mp despite fir filed pocso act serious charges arrested yet pm modi cr girlfriend didi didi jibe west bengal election comparing mp renuka chowdhury surpankha shows mentality unnao rape case case kuldeep singh sengar mla bjp convicted bjp protected till last moment kathua rape case tiranga yatra done favour accused bjp ministers participated bilkis bano case rapists released gujarat goverment account good behavior people garlanded convicts shared stage bjp mla statues ahilya bai holkar savitri bai phule removed maharashtra sadan hathras rape case girl body cremated night forcefully despite family objection deserve treatment worst family allowed see daughter face last time held captive police accused freed none charged rape despite cbi convicting new india wanted bow head shame ",
    "cleaned_title": "goverment antiwomen core slogan beti bachaobeti padhao big lie",
    "cleaned_selftext": "apart fascist bjp govermnent long history protecting sexual offenders murderers antiwomen core instances proves wrestlers protest case supreme court intervene file fir brij bhusan sharan singh bjp mp despite fir filed pocso act serious charges arrested yet pm modi cr girlfriend didi didi jibe west bengal election comparing mp renuka chowdhury surpankha shows mentality unnao rape case case kuldeep singh sengar mla bjp convicted bjp protected till last moment kathua rape case tiranga yatra done favour accused bjp ministers participated bilkis bano case rapists released gujarat goverment account good behavior people garlanded convicts shared stage bjp mla statues ahilya bai holkar savitri bai phule removed maharashtra sadan hathras rape case girl body cremated night forcefully despite family objection deserve treatment worst family allowed see daughter face last time held captive police accused freed none charged rape despite cbi convicting new india wanted bow head shame",
    "cleaned_comments": "matter shame frankly terrifying sizeable number people look party go thats first choice bjp cell lynch women online expressing opinion also modi followed follows recent tweeted tweet guy behind suli deals people deserve government elect reflection studied fact fascism essentially antiwomen pretty much brand yeah rest end suffering bro gehun ke sath sath dhun bhi pisti hai misfortune lets pray better luck time opening mandir forgive sins people forget everything lets make easy speaking helps wont next time doesnt absolve govt putting rapists position power get hired job screw accountable interviewer khud chunaav lar lo fir change want see criminals like brij bhusan call rally seers support temple biggest one according mny dont talk proposal increasing legal age women marriage proposed years ago went completely silent media spread news like wild fire countless girls aged even lesser married men fathers age many villages india feared ladki bhoj ban jayegi countless women lives forever ruined abrupt announcement inaction even today many suffer remember farmers laws passed houses became law record speed something sensitive vulnerable section society still pending really dont give fuck womens lives torture go patriarchal society im finding articles interviews village leaders openly admitting getting rid girls whosoever comes forward law comes force say govt accountable goverment main culprit stated people also take part elections responsibility vote sensibly dude forgot switch alt accounts yeah man dont want happenbut factors say gon na win someone purposefully said beti bachao beti patao aligns mentality practically slogans hindu rashtra ones lie beti bachao challenge ie beti humse bachake dikhao balatkari janwar party indian culture antiwomen always likely always everyone warned would happen country deserves going mandate rule us like bjps fascism even new phenomenon fanatical fascist party last time ruled well brought destruction disharmony among masses well brought genocidal terror riots states ruled well country still elected gave mandate option sit internet talk anymore know lot folks actively vote scumbags power responsibility either take action get scumbags power shut suffer like rest us spreading awareness trope mental masturbation know people corrupt evil greedy always knew campaigned quite excessively fact give chance bjp voters taunted us using synonymous version arnab goswamis infamous slogan modi please spare us reddit posts spoken enough shit things time take action dont think bjp getting voted next year either stay cynical options keep living fascist shithole lot privileged enough anything happen ghun honorable mention must given fact according dear leader sheikh hasina good fighting terrorism despite womanhttpsmeconomictimescomnewspoliticsandnationpmnarendramodidrawsflakfordespitebeingawomanremarkonsheikhhasinaarticleshowcms tells us things great man thinks good compliment give leader foreign country strategically important india views capability women general direction set top hardly surprising illustrious men brij bhushan singh grace bjp modi doesnt get women shah yogi friends like little boys fears understand one look modi years ago got pedo vibes beti bachao lie warning",
    "light_cleaned_title": "This goverment is anti-women to the core and slogan of 'beti bachao,beti padhao' is just a big lie",
    "light_cleaned_selftext": "Apart from being fascist, BJP govermnent has long history of protecting sexual offenders and murderers. It is anti-women to the core . Here are some instances which proves it. 1. Wrestlers protest case : Supreme Court had to intervene just to file FIR on brij bhusan Sharan singh who is BJP MP . Despite FIR filed under POCSO act , and other serious charges, he has not been arrested yet . 2. PM modi '50 cr girlfriend ', 'Didi O Didi ' jibe during west Bengal election and comparing MP renuka chowdhury with surpankha , shows his mentality. 3. Unnao rape case : In this case, kuldeep singh sengar , MLA of BJP was convicted . BJP protected him till last moment . 4. Kathua rape case : tiranga yatra was done in favour of accused , 2 BJP ministers participated 5. Bilkis bano case : All rapists were released by gujarat goverment on account of 'good behavior ' . People garlanded them and convicts shared stage with BJP MLA . 6. Statues of Ahilya bai holkar and savitri bai phule removed from maharashtra Sadan 7. Hathras rape case : girl body was cremated at night forcefully despite family objection . Did she deserve that treatment? What can be worst for family who were not allowed to see their daughter face last time ? They were held captive by UP police. After all this, 4 of 3 accused were freed and none of them were charged with rape despite CBI convicting them . Is this new india we wanted ? We should bow down our head in shame !",
    "light_cleaned_comments": "Matter of shame and frankly terrifying that we have such a sizeable number of people who look at this party and go 'that's my first choice.' And how BJP IT Cell lynch women online for expressing their opinion. Also, Modi followed (or follows) and recent re tweeted tweet of guy who was behind Suli Deals. People deserve the Government they elect. It's a reflection of them. It’s a studied fact that fascism is essentially anti-women. So it’s pretty much on brand. yeah but do the rest? We will end up suffering too. Bro, gehun ke sath sath dhun bhi pisti hai, it's our misfortune. Let's pray for better luck this time. 2024 ; Opening the mandir will forgive all of their sins and people will forget everything. /s lets not make it that easy for them. Speaking up helps. there wont be a next time. It doesn't absolve the govt of putting rapists in position of power. If you get hired for a job and screw it, you will be accountable, not your interviewer. Khud chunaav lar lo fir. Be the change you want to see. Then criminals like brij bhusan will call rally and seers will support him from that temple itself . The Biggest one according to me which mny don't talk about The proposal of increasing legal age of women for marriage from 18 was proposed years ago and then they went completely silent. The media spread the news like wild fire and countless girls aged 18 or even lesser were married off to men of their father's age in many villages of India, They feared ladki bhoj ban jayegi. Countless women and their lives are forever ruined because of this abrupt announcement and inaction. Even today many suffer. Remember the farmers laws were passed in both houses and became a law in record speed but something so sensitive to the vulnerable section of the society is still pending. They really don't give a fuck about women's lives and the torture they go through in this patriarchal society. * I'm not finding the articles and interviews of village leaders openly admitting to getting rid of their girls to whosoever comes forward before the law comes to force. Did I say govt is not accountable for all this ? Goverment is the main culprit as I have stated But people also take part in elections, they have responsibility too . They should vote sensibly . Dude, you forgot to switch your alt accounts. Yeah man, I don't want that to happen..but all the factors say that they are gonna win again 😓 Someone purposefully said it \"Beti bachao Beti Patao\" It aligns with their mentality Practically all their slogans other than the Hindu rashtra ones are a lie. Beti Bachao is a challenge, i.e beti humse bachake dikhao- Balatkari Janwar Party. Indian culture is anti-women. Always has been, most likely always will be. Everyone was warned in 2014 that this would happen. The country deserves what it is going through. We have them the mandate to rule over us like this. The BJP’s fascism is not even a new phenomenon. They have been a fanatical fascist party from the last time they ruled as well. They brought about destruction and disharmony among the masses before as well. They have brought genocidal terror and riots in the states they ruled as well. But the country still elected them and gave them the mandate. You do not have the option to sit on the internet and talk about this anymore. I know a lot of folks who actively did not vote these scumbags into power. But those who did, it is their responsibility to either take action and get these scumbags out of power, or shut up and suffer like the rest of us. All this ‘spreading awareness’ trope is just mental masturbation. We all know these people are corrupt, evil, and greedy. We always knew that. We campaigned against that. Quite excessively in fact. But all you ‘give chance’ BJP voters taunted us using a synonymous version of Arnab Goswami’s infamous slogan- “if not Modi, who?” Please spare us the reddit posts. We have spoken enough about how shit things are. It’s time to take action because I don’t think the BJP is getting voted out next year either. Or stay cynical about our options and keep living in this fascist shithole. A lot of you here are privileged enough to not have anything happen to you. 🤷‍♂️ Ghun. Honorable mention must be given to the fact that according to Dear Leader, Sheikh Hasina has been good at fighting terrorism [despite being a woman](https://m.economictimes.com/news/politics-and-nation/pm-narendra-modi-draws-flak-for-despite-being-a-woman-remark-on-sheikh-hasina/articleshow/47588959.cms). This tells us a few things about the great man: - he thinks this is a good compliment to give to a leader of a foreign country that is strategically important for India - his views on the capability of women in general When this is the direction set from the top, it is hardly surprising that such illustrious men as Brij Bhushan Singh grace the BJP Modi doesn’t get women. Him, Shah, Yogi and their friends like little boys. He fears what he does not understand. One look at Modi years ago and I got pedo vibes. beti bachao is not a lie, its a warning."
}