{
    "id": "1b13qgg",
    "title": "Victim blaming in India",
    "url": "https://i.redd.it/7m79h7kaa2lc1.png",
    "selftext": "This bit by Abhishek Upmanyu sums up the whole victim blaming scene in India.\n\nHere's a little context- My sister got scammed a month ago. She lost 45K. It was her hard-earned money which she was saving from a very long time. This incident broke her completely.\n\nBut our parents, instead of consoling her, kept blaming her. \"Why weren't you careful?\" \"How can you be so stupid?\" \"Why didn't you ask us first?\" I had to tell them to keep quiet and not tell this to anyone because I knew that our relatives would react the same way my parents did.\n\nRecently, a user posted on r/mumbai about how his sister got scammed (in the same way my sister was scammed). The first instinct of majority of people was to spew critical and hateful comments towards his sister instead of calling out the actual criminal. Some even said that she deserved to get scammed!\n\nSame thing happened when a user recently posted about getting raped (Bastian rape case) on the same sub. People were shaming her saying that it was her fault and that she deserved it.\n\nIn India, it is so embarrassing to speak up about such crimes because when you do, people will taunt, shame and blame you and only you. No one will call out the actual criminal. They think they are teaching the victim a lesson by shaming and taunting them but all they are doing is enabling the cirminal to commit more such crimes!",
    "flair": "Rant / Vent",
    "score": 1238,
    "num_comments": 96,
    "created_utc": 1709010720.0,
    "convurl": "https://i.redd.it/7m79h7kaa2lc1.png",
    "comments": [
        "Lot of this is just passed down mindset from older generations, it won't change easily.\nThis is why many crimes do unnoticed\nWe could begin by changing from ourselves and informing others near us \n\n[ Hope your sister is doing well now :) ]",
        "Superiority complex is something that's deeply rooted in Indian society!",
        "[This](https://np.reddit.com/r/mumbai/comments/1azl8yo/my_sister_got_scammed/?rdt=61780)\nis the post about the scam that happened with OP's sister.",
        "same as khalistani as farmers",
        "I think you are blowing this out of proportion. While yes there are people who blame the victim, there were many who came in support as well. Even for the Bastian case there was a whole movement started. \n\nSo you cant pick just 5 comments and say that's all everybody else does. \n\nSecondly, when someone does fall for these scams, it is natural to ask what the heck was going through their head. People also have to be called out for the stupid shit they do. Nahi toh we are just creating a society of gullible idiots.",
        "What was the scam btw?",
        "Only proper education and awareness can change such mindset. Hopefully our future Generations would do better since our generation has realized how Fkd up our earlier generations were.",
        "I once lost railway ticket on platform (while removing handkerchief)I was panicked then I found police man and tell him my story he was talking with someone after hearing my concern he said in  laughing 'ye dekho ticket nhi sambhal sakte' bc police ka kya kam hai yehi unko nhi pta baadmein station k bahr autowale se ticket mila",
        "In my experience, around 90% of online scams can be avoided by following the basic precautions and using common sense.",
        "I'm not saying victim blaming is nice.\n\nBut, you would be stupid if you expect the Indians to be civilized enough to not commit crimes and be less careful.\n\nSuch virtue-signalling doesn't work in real life.\n\nYou can't change the mindset of a rapist or a robber. There'll always be rapists. So, what you can avoid is reducing the possibility of coming across such rapists.\n\nIndia isn't Europe where people respect personal choice and it'll never be Europe. It'll be the same with a huge uncivilized population regardless of whether they're educated or not.\n\nSo, if you try to be stupid as a woman and walk alone in the most dangerous neighbourhood at midnight or even late night, that too, alone, it's quite obvious you'll be in danger. You can't blame the society for it. The society can't change mindset of criminals. \n\nI have come across statements like, \"As a woman, I'll go wherever I want to whenever I want in India, all on my own.\"\n\nSweety, you have no idea how the world is. You think you can do anything about anything in the society. But, it's impossible. Just avoid daring yourself into such situations. Just prevent the worst thing from happening. It's in your own hands.\n\nThat's not victim blaming. That's called \"precaution\" in an uncivilized society. If you don't accept the reality, you can try experimenting your virtue-signalling in real life. I can assure you you'll be disappointed.",
        "This.",
        "I am sorry but your sister is dumb af & so are you. Now crawl back to hole that you came out from. Be realistic. Upmanyu isn’t gonna save you.",
        "Because our law enforcement and judiciary are useless. They're not gonna find the criminal and even when they do you won't get your money back. So not only is it better safe than sorry it's the only fucking way.",
        "I saw a poster on a wall saying Paisa double in 20 days. Guess I will call him and give him my money.",
        "Exactly. It's just:\n\n1. Never share OTP, I'd/pass, Credit card info\n2. Click on random links/scan unknown QR codes\n3. Buy from an unknown ecommerce website\n\nAnd never pay for a product you don't have, which is a general rule of thumb not necessarily for online stuff.",
        "Cry about it, most of the online scams can be prevented with basic common sense",
        "Just like you my sister also got scammed of 40k around 6 or 7 months ago and it broke her so badly and she was even trying to hide it. But I knew that her mental health is more important than that money she lost. So I sat with her and explained in total detail that it's the system and that the scammer's fault you don't have to feel bad for yourself and picked her up to continue. And with that incident I learnt that in India everyone will blame the victim for hiding their own incompetence. And police are basically non existent in terms of cybercrime and they blame us for being not careful and I was surprised to see their reaction after hearing 40k like it was chump change. But it was my sister's hard earned money and after that day I stopped supporting this whole government and police system as a whole. You can't depend on any of these shits. We are simply giving charity in the name of tax money. And I hated this fact most that I couldn't even console my sister by the way of telling her that we can bring her money back.",
        "Crimes of violating someone's modesty go unnoticed the most, go unreported so so often 😣😡",
        "If you are dumb, obviously people will take advantage of you.\nThat's not victim blaming, that's just common sense.\nRobbers will rob, they have been doing that thing for centuries, no one has been able to stop them, so what's the solution???\nYou need to be smart, if you want to stay safe",
        "It's not unique about India.\nIn every country, rapists and thieves are there, no level of education can change them",
        "I followed 2 and 3, clicked all random link I could find, bought lot of shit from unknown website. Still go scammed. Fake News!",
        "Yeah. But, it's also about the culture. Rape culture in India is on the next level. Nothing can change it ever.",
        "😂😂",
        "If you think rationally...\n\nDoesn't that make sense ? \n\nSuppose you know that a xyz Street in a pqr city is prone to chain snatching.... Doesn't it make sense to go there ? And does it make sense to go there wearing jewellery?\n\n\nNo doubt the people doing it are a hole \n\nBut who is at a loss ? We lost the chain \n\nPeople are saying this as a superiority complex in comments I would say it as a maturity/ common sense",
        "Sane comments on reddit! wow.",
        "I think the point isn't calling people out for their stupidity. It's first getting to the root of the problem and solving it, or at least giving basic care to a victim before yelling at them. Blaming the affected person solves nothing and you can always ask them what the fuck they were thinking at the end of the entire ordeal. The poor girl has already been scammed out of 45k, she doesn't need her OWN PARENTS yelling at her instead of at least asking if she's ok or calming her down so they can track the scammer and get the money back.\n\nAfter a person has an accident you don't yell at them right away, you at least give them first aid. Then you ask the stupid rear-ending bastard what the fuck he was doing.",
        "Anybody read \"Girl with the dragon tattoo\"? Its protagonist Lisbeth says, and I totally agree with her, that by not reporting a rape a victim enables the rapist to create further victims.",
        "So true!",
        "My dad got scammed for 35k as he thought that he'll get Smart TV, refrigerator,  Spilt AC, Washing Machine at  smart price but in the end lost the money. We put the complaint in Cyber Police and told the bank as well. Just waiting for the response from the bank. \n\nIt's just like some person's hard earned money is getting scammed yet the government/(cyber) police don't do anything. It's not like everyone is tech savvy.",
        "\"If it's too good to be true, then it's not\"\n\nThis line alone is enough for all the financial/non-financial things in life. If not outright scam, there will some caveat or hidden con you might not be aware of",
        "Natural selection",
        "Nobody's defending the criminal. But the world is not a Utopia. If you choose to be dumb and naive always and don't have a problem getting scammed again n again, then you do you. Keep getting scammed and blame the criminal.",
        "Exactly. That's why I sleep at night without locking the gates of my house. It's thr thief who should not steal from my house, why should I lock them up?",
        "Doesn't work on gullible people for whom \"Chand pe makan\" is also a valid investment \"because something something Chandrayan\"",
        "Itna gyaan pel hi rahe toh Solution b bataa dijiye mahasay",
        ">when someone does fall for these scams, it is natural to ask what the heck was going through their head.\n\nAnd what good will it do? I understand that taking precautions is important, but what's the point in bashing the victim after they've already lost their money?\n\nAnd about the bastian rape case, many people were and still are blaming her for what happened. I am not merely picking 5 comments and blowing it out of proportion. The comments to this very post prove my point.",
        "You are just lucky that you haven’t been on someone’s radar yet.\n\nThese scams don’t work on technicality but human engineering.Putting the victim in a sense of urgency, trying to manipulate with hospitality and much more.\n\nThe reason these people don’t target you is not because you are smart enough to see through but why waste their effort on someone like you when they can get someone else in less effort which is the same reason they have grammatical mistakes in their messages.\nIt’s not because they can’t fix it but because it helps them filter sensible people.\n\nThese scammers are getting smarter each day and we are just discussing preventive techniques, the day is near when their greed will be so high and their skill so good that 90% scams will become unavoidable. \n\nDon’t rate scams as avoidable and unavoidable, someone trying to scam is a criminal in making who will only get sharper with time.",
        "Solution bata doge to reaction kahan se ayega psuedo intellectual people ka 😂\n\nHamare ya sab cheezein reactionary hoti hain aur jab zara sa hungame ke beech solition pooch lo to pin drop silence aur 5 minute ke baad gaaliya on the newfound basis that it is done for derailing the protest",
        "😂 don't be so rude to her now",
        ">I'm not a proponent of victim blaming.\n\nYes you are.",
        "Go do apple farming.",
        "There is no clear way to avoid getting into trouble. That is where the line is grey. Sexual assault can happen to anyone and anywhere, including your own house or in broad daylight inside the metro. \n\nTaking some precautions is fine, but I don't understand why people are so unhinged to accept that if some crime was committed, then perpetrators were at a fault and not the victim. It always has the energy of, \"Look, I am smart because I warned you not to do that because you will fail.\" It does nothing to improve the situation and derails the effort others are trying to put. \n\nWomen face sexual abuse right from school to college to the streets. Every time the response can't be ,\"warned you not to go there.\"",
        "dude, getting scammed online in 2024 is a skill issue",
        "This is same with NRIs too, even matured and sensible individuals who are in their 40s and 50s, are guilty of this. \n\n\nThis is one of the reasons I am not very close to many Indians because I can't talk about personal problems without getting shat on one way or another. ",
        "IMO, rape culture in India is mostly due to the steep divide between rich and poor. A poor person has nothing to lose, even if he gets jailed he will get food and shelter. Though that's strictly my opinion.\nAnd it's going to increase in the future, Instagram is the proof of it.",
        "These things are not black and white as they seem.\n\nRecently, one person climbed into a lion enclosure, in a zoo, to get a selfie with the lion. The lion, obviously, mauled him to death. Should we not blame the victim here?",
        "This is the mindset from generations and is how my parents used to react any time I shared something with them. It was so ingrained in me that once when I found myself reacting similarly to my child I had to stop and wonder why I was doing it. \n\nIt’s never about how wrong the other person is but always your fault for being careless. It has taken me years to find my way out of this and sometimes I still falter.",
        "This.",
        "Most Indians specially here won’t accept this because they themselves do this.\n\nJab tak khud ke saath kuch nahi hota. Tab Tak superiority complex rehta hai inka.\n\nWe don’t know how empathy works. When someone gets cheated, we start blaming the victim first.\n\nRecently Faye Dsouza posted about a 1 year old infant killed by 3 street dogs, the comment section is filled with elite privileged people saying “where were the parents, it’s parents fault” where as they don’t even realise that millions of Indians live on the streets.\n\nThey had 0 empathy for a 1 year old infant dying.",
        "This is the reason why many people are afraid to accept or confess mistakes socially. It is always a blame game. Many people find amusement in this as if they have never been duped or made mistakes.\n\nThis will not change overnight . We have a culture of blaming victims socially. But there is hope. Our generation is comparatively more understanding.\n\nKeep telling your sister that this is not her fault. She needs to hear that.",
        "Saavdhaan rahein satark rahein. Aur baaki log thoda courage dikha ke victim ko bachaayein. Dhanyawaad",
        "Precaution happens before. \n\nThere's no point in bashing the victim after they've already been robbed/raped/scammed. You're just worsening the situation by doing that.",
        "No one's denying that the perpetrator is to be blamed.\n\nWhen the f#ck did I even say that blame is on the victim??\n\nWhose fault is it if you get scammed online despite being an educated millennial??? Had you been careful, you wouldn't have been scammed in the first place. 🤷🏽‍♂️",
        "India chutinyon se nai, chutiyo se pareshan hai : )\n\nPS: hope your sis is doing well now. Cyber crime dept is a joke. One of my friends lost 96k in credit card fraud and they did jackshit.",
        "Yeah this is our go-to modus operandi. Blame the person who is suffering.\n\nThis is what my parents did _every single time_ in my childhood. If I get hurt while playing Cricket I was _beaten_ ki bahar khelne gaya hi kyo kal se Cricket khelna band\n\nIf I got less marks once because I was suffering from Malaria I got a good 2 hr lecture on why I let a mosquito bite me (\\*facepalm*)\n\nRecently I had a sprain and when I came home my dad asked me why I didn't inform me about it.\n\nI just stared at him. Seriously? After all that has happened in my childhood you really think I would _ever_ tell my problems to you, who have NEVER given me any solution or sympathy but gaaliyan and beatings?",
        "Kudos to you! You are a great parent. \n\nEven my first instinct was to blame my sister for what had happened. It took me a while to empathize with her. When I saw my parents reacting the same way I did initially, I realised that this mentality is ingrained in each one of us since generations.",
        "When we went to the police, they said \"People have lost lakhs, why are you crying for 45K?\"\nThere were giving all sorts of bs advice insteading of helping us. The cyber crime dept. didn't do shit either.",
        "And in case of a scam if the scammer took out the money in the form of cash I learnt that there isn't any process or law to get your money back. It goes in form like this. The bank wants the police confirmation for stolen money and the police ask for bank data to trace the account and there isn't any policy to solve this stalemate so yeah we actually don't have a law to get OUR money back. I honestly thought what a good time to be a scammer like so much free money and no one to catch you.",
        "Explains why India is known as the \"Scam capital of the world\"",
        "You cannot blame someone or hold them responsible for not reporting a rapist. That's victim blaming itself. \n\nHow can women report in a society where they're not free to without consequences? Women have gone to report rapes only to be raped by cops. Only to be harassed and murdered for it. Only to be victim blamed by society and shamed. \n\nSo don't say not reporting enables a rapist. A rapist is already enabled by this society.",
        ">Whose fault is it if you get scammed online despite being an educated millennial??? Had you been careful, you wouldn't have been scammed in the first place.\n\nIt is not the victim's fault, and you can't blame the victim, period. Scammers use techniques that can baffle anybody, so it's not about being careful, which they shouldn't have to in the first place.",
        "Lol.\nIn that case, maybe, smarten yourself up.\nEducate yourself about how to protect yourself online. Cyber crimes exist and that's the reason why people must learn how to protect themselves instead of being a baby and then complain about getting scammed.\n\nWhen money is involved, don't trust anyone online. Not even with a single dime.",
        "Wow, so if someone gets scammed, your response would be to joke about it and ask them to man up.",
        "I'll never say that directly to the person since that person has already suffered.\n\nBut, the opinion I'll have in my mind is that it's very stupid of him/her. I'll just tell her to be careful from now on and make sure that such a thing never happens. \n\nBut, the reality is that it's his/her fault.\n\nDid you get my point??",
        "You are confused with two issues. \n\nVictim blaming is blaming the victim for her action or lack thereof that got him/her into that predicament. \n\nI do realize that a victim doesn't always has the circumstances to fight. \n\nBut if it was painful now, motivation is in knowing that this pain might not be passed to others. \n\nEven if victims don't win, at least other will be wary of the perp. \n\nBTW, perps are not enabled by society unless you ignore his/her starting signs. There is progression and as soon as he/she knows the results of her action, the better.",
        "Yes we must put victims lives and safety at risk for \"motivation\". That's literally putting a burden on victims for the actions of a criminal. 🙄🙄🙄\n\nAnd such a rhetoric IS problematic. It's not \"motivation\". It's societal pressure. You do realise it's impossible to have motivation to live after, let alone take on the fucked up legal process of cops? \n\nSee what happened to the lady who tried to do the same in the Bastian case. How society and men shamed blamed and treated her. \nAnd what motivation? Bilkis banos rapists were given freedom and garlanded 🙄",
        "It’s called being cautious. Nothing wrong with that. At the end of the day the onus is on you and yourself first. You can’t control crimes but you, at the very least. No victim blaming in all this.",
        "I was scammed for 1700₹, reported to cybercrime with  3 days, after a year they recovered 1500₹ 🥲",
        "*Call center scam capital of the world ",
        "Haha",
        "You call it victim blaming, I call it letting the victim know they made a mistake and to remind them to such an extent that they never ever repeat it in fear of such humiliation. That's how parenting works. A mistake can be a learning experience only if you don't repeat it and for that blaming is necessary",
        "Please don't ever become a parent if you really think this is how parenting should be done.",
        "Not really. Given the level of an average engineer in India I don't think our scammers can get any better.",
        "Lisbeth lives in Sweden, not India.\n\nIn India a person who reports rape, will be raked over the coals by society, and even the police. Ultimately the victim is put through more trauma and the rapist still walks free.\n\nWe've seen rapists getting garlanded. We've seen police cover up rape cases in full view of the media. Rapists who tortured and killed a child in a temple had politicians stand in support of them. This year has barely begun and we've already had instances of cops and judges raping a rape victim. \n\nIf we see actual consequences for rapists and actual protection for victims, maybe then more people would report it. Until then, we cannot blame them for choosing not to.",
        "The inherent irony in this statement made me lol",
        "I neat my kids all the time you gon do something bout it ?",
        "this mentality makes me not open up and bottle up.\n\npeople nowadays think it is dank to victim blame. I think people like you and i and more need to speak up more.\n\nit takes only one candle to light up a room. more candles, more light.",
        "Hey, I have seen your replies. Can you fucking stop labeling people with \"you're a good parent and you're not.\" First of all you shouldn't put a tag just cuz some shit happened to your sister, and I agree, people should be empowered to fight against the crime done to them else everyone will be a victim. Harrassing them with what should've been done and so and so doesn't actually solves anything.\n\nThe collectively society not specifically India, tolerating or engaging in victim harassment, people actually contribute to a culture that normalizes and perpetuates violence and abuse. So I totally agree with you. Sorry for her loss.",
        "I'll pray for their mental health",
        "What are you even talking about? I never implied that we want to keep repeating our mistakes. This was my sister's first and her LAST scam.",
        "Haha relax I don't beat my kids",
        "Lisbeth lives in Sweden, not India. (Not that I agree with that sentiment).\n\nIn India a person who reports rape, will be raked over the coals by society, and even the police. Ultimately the victim is put through more trauma and the rapist still walks free.\n\nWe've seen rapists getting garlanded. We've seen police cover up rape cases in full view of the media. Rapists who tortured and killed a child in a temple had politicians stand in support of them. This year has barely begun and we've already had instances of cops and judges raping a rape victim. \n\nIf we see actual consequences for rapists and actual protection for victims, maybe then more people would report it. Until then, we cannot blame them for choosing not to.",
        "The victim never deserved it of course. But your parents' reaction come from panic and helplessness in such case, because it's a huge amount your sister had to pay to learn better. Often we cannot retrieve the money so...",
        "samething happened with me i was playing pubg on my fathers phone during a wedding of my relatives then phone's battery discharged so i plugged in my daddy's phone inside my relatives house after few hours when i return to check battery percentage i found out that my fathers phone is stolen ,  i was so panicked that i was crying infront of my relatives everyone my family, relatives , parents all of them were scolding me \n\nisme meri kya galti mujhe kya pata tha ki relatives ke ghar ke andar se bhi chori hosakti hai \n\ni was in deep shock for that whole day i tried my best to find that device but i was not able to find that device \n\ni understood that day that my country is india not japan i will have to be extra precautious with my stuff",
        "My parents didn't lose money, my sister did. It was HER hard-earned money. She was the one who was feeling helpless. A parent's job is to console and support their child who's suffering, not add to the existing helplessness.",
        "I agree, and the issue with this mindset is that they think they help the victims by blaming them. \nBut in reality, they subconsciously feel superior by lecturing them. \n\nDear people who think they help victims by shaming them, you are not. Victims need support, not your condescending lectures. \n\nAnyone can become a victim. It is an unfortunate part of life. Most victims need support, not mental trauma. \n\nOn another note. Man, I am incredibly scared of scammers. They are getting smarter and smarter. They will get you when you are most vulnerable.",
        "The intention is not to blame the victim but to warn others that they should take certain precautions to avoid similar harm. It is not to deprive the victim from justice but to ensure that you don't end up in a position where you have to spend half a decade chasing courts and police begging for justice",
        "Talk to your parents then.",
        "My sympathies to anyone who has been a victim of any sort of crime / abuse.\n\nHaving said that —\n\nStop these false equilvalencies.\n\nHow is getting raped vs getting duped over telephone by scamsters even remotely comparable?\n\nOnline / digital scams can only happen if the victim not tech savvy, or just plain dumb.\n\nThe MOs of the scamsters have a lot of loopholes in them and can be easily identified by anyone with basic common sense.\n\nI'm not saying the criminals should not be punished. But these people are all over and faceless and almost impossible to track.\n\nBeing vigilant is the only way.\n\nNot all the time; but many times people get scammed due to their own foolishness.\n\nAnd of course when parents get to know they will have an adverse reaction initially, especially if it was something stupid; that led to you getting scammed.\n\nIf your parents got scammed like that, you would have a similar reaction towards them at first.",
        "They do have a superiority complex though, it's true. They think indian society and culture is superior for it's gender segregation, for it's victim blaming, for its subjugation of women. And look down on other cultures that might be different. \n\n\nEven within India you see it between different regions, people in large show negative attitudes towards Bengali and north eastern cultures that are more women friendly ",
        "I'm an ABCD and got into 2 car accidents that weren't my fault in the last 6 months (living in the bay area)\n\nboth times my family asked who's fault it was first, before even wondering if I was ok\n\nAlthough I wasn't born in India I enjoy of the culture, but I really dislike parts of it as well.",
        ">You cannot blame someone or hold them responsible for not reporting a rapist. That's victim blaming itself.\n\nBro what's your solution then who should take responsibility the criminals well we all know that wont happen, countries like us, uk, Sweden etc  with no accountability to women also have lot of cases and don't say \"well they have lot of case because women go to cops\" as study's show 2 out of every 3 rapes go unreported, i know victim blaming is bad but someone has to take responsibility saying stuff like its society's fault or criminal should not do crime is waste of time.",
        "The Victim is obviously at fault but your sister is also at fault. People don't just say 'satark rahein' for no reason. If you are dumb and lack street smartness in this corrupt world then I'm Sorry but you'll get crushed by the evil.",
        "lol! You can blame the “criminals” but it’s up to each to use their fucking brains",
        "\"Scammers use techniques that can baffle anybody\" \n\nYou're either underestimating common sense or overestimating a lowlife scammer's intelligence.",
        "Just shut up",
        "Rape doesn't work the same way. Most chain snatchers are strangers and not people they trust and mostly do organised crime.\n\nFor rape, in most cases the rapist is someone the victims knows and trusts, not random strangers, also a lot of the victims are children, what do they do? So whether you wear the chain out, hide it or not go out at all, you still lose the chain.",
        "Thefts or scams don't work the same way as rape. Most victims of scams/thefts don't know the person before and they're not someone the person trusts. They're usually strangers who work in organised crime.\n\nFor rape, in most cases the rapist was someone the victim knew and trusted, not random strangers.",
        "Very well explained!",
        "Sweeping generalisation or stereotypes don’t help anyone.",
        "After you :)",
        "True... Those are other kinds of a...holes \nDon't want to say anything about rape(relating to the topic of discussion)as anything you say is controversial",
        "Well the point being discussed is asking to stay satark \n\nSo they are asking for precautions only \n\nBashing someone after it has already happened is not good( although it is also asking to stay satark in a very twisted kind of way)",
        "That"
    ],
    "cleaned_text": "victim blaming india bit abhishek upmanyu sums whole victim blaming scene india heres little context sister got scammed month ago lost k hardearned money saving long time incident broke completely parents instead consoling kept blaming werent careful stupid didnt ask us first tell keep quiet tell anyone knew relatives would react way parents recently user posted rmumbai sister got scammed way sister scammed first instinct majority people spew critical hateful comments towards sister instead calling actual criminal even said deserved get scammed thing happened user recently posted getting raped bastian rape case sub people shaming saying fault deserved india embarrassing speak crimes people taunt shame blame one call actual criminal think teaching victim lesson shaming taunting enabling cirminal commit crimes ",
    "cleaned_title": "victim blaming india",
    "cleaned_selftext": "bit abhishek upmanyu sums whole victim blaming scene india heres little context sister got scammed month ago lost k hardearned money saving long time incident broke completely parents instead consoling kept blaming werent careful stupid didnt ask us first tell keep quiet tell anyone knew relatives would react way parents recently user posted rmumbai sister got scammed way sister scammed first instinct majority people spew critical hateful comments towards sister instead calling actual criminal even said deserved get scammed thing happened user recently posted getting raped bastian rape case sub people shaming saying fault deserved india embarrassing speak crimes people taunt shame blame one call actual criminal think teaching victim lesson shaming taunting enabling cirminal commit crimes",
    "cleaned_comments": "lot passed mindset older generations wont change easily many crimes unnoticed could begin changing informing others near us hope sister well superiority complex something thats deeply rooted indian society thishttpsnpredditcomrmumbaicommentsazlyomysistergotscammedrdt post scam happened ops sister khalistani farmers think blowing proportion yes people blame victim many came support well even bastian case whole movement started cant pick comments say thats everybody else secondly someone fall scams natural ask heck going head people also called stupid shit nahi toh creating society gullible idiots scam btw proper education awareness change mindset hopefully future generations would better since generation realized fkd earlier generations lost railway ticket platform removing handkerchiefi panicked found police man tell story talking someone hearing concern said laughing ye dekho ticket nhi sambhal sakte bc police ka kya kam hai yehi unko nhi pta baadmein station k bahr autowale se ticket mila experience around online scams avoided following basic precautions using common sense im saying victim blaming nice would stupid expect indians civilized enough commit crimes less careful virtuesignalling doesnt work real life cant change mindset rapist robber therell always rapists avoid reducing possibility coming across rapists india isnt europe people respect personal choice itll never europe itll huge uncivilized population regardless whether theyre educated try stupid woman walk alone dangerous neighbourhood midnight even late night alone quite obvious youll danger cant blame society society cant change mindset criminals come across statements like woman ill go wherever want whenever want india sweety idea world think anything anything society impossible avoid daring situations prevent worst thing happening hands thats victim blaming thats called precaution uncivilized society dont accept reality try experimenting virtuesignalling real life assure youll disappointed sorry sister dumb af crawl back hole came realistic upmanyu isnt gon na save law enforcement judiciary useless theyre gon na find criminal even wont get money back better safe sorry fucking way saw poster wall saying paisa double days guess call give money exactly never share otp idpass credit card info click random linksscan unknown qr codes buy unknown ecommerce website never pay product dont general rule thumb necessarily online stuff cry online scams prevented basic common sense like sister also got scammed k around months ago broke badly even trying hide knew mental health important money lost sat explained total detail system scammers fault dont feel bad picked continue incident learnt india everyone blame victim hiding incompetence police basically non existent terms cybercrime blame us careful surprised see reaction hearing k like chump change sisters hard earned money day stopped supporting whole government police system whole cant depend shits simply giving charity name tax money hated fact couldnt even console sister way telling bring money back crimes violating someones modesty go unnoticed go unreported often dumb obviously people take advantage thats victim blaming thats common sense robbers rob thing centuries one able stop whats solution need smart want stay safe unique india every country rapists thieves level education change followed clicked random link could find bought lot shit unknown website still go scammed fake news yeah also culture rape culture india next level nothing change ever think rationally doesnt make sense suppose know xyz street pqr city prone chain snatching doesnt make sense go make sense go wearing jewellery doubt people hole loss lost chain people saying superiority complex comments would say maturity common sense sane comments reddit wow think point isnt calling people stupidity first getting root problem solving least giving basic care victim yelling blaming affected person solves nothing always ask fuck thinking end entire ordeal poor girl already scammed k doesnt need parents yelling instead least asking shes ok calming track scammer get money back person accident dont yell right away least give first aid ask stupid rearending bastard fuck anybody read girl dragon tattoo protagonist lisbeth says totally agree reporting rape victim enables rapist create victims true dad got scammed k thought hell get smart tv refrigerator spilt ac washing machine smart price end lost money put complaint cyber police told bank well waiting response bank like persons hard earned money getting scammed yet governmentcyber police dont anything like everyone tech savvy good true line alone enough financialnonfinancial things life outright scam caveat hidden con might aware natural selection nobodys defending criminal world utopia choose dumb naive always dont problem getting scammed n keep getting scammed blame criminal exactly thats sleep night without locking gates house thr thief steal house lock doesnt work gullible people chand pe makan also valid investment something something chandrayan itna gyaan pel hi rahe toh solution b bataa dijiye mahasay someone fall scams natural ask heck going head good understand taking precautions important whats point bashing victim theyve already lost money bastian rape case many people still blaming happened merely picking comments blowing proportion comments post prove point lucky havent someones radar yet scams dont work technicality human engineeringputting victim sense urgency trying manipulate hospitality much reason people dont target smart enough see waste effort someone like get someone else less effort reason grammatical mistakes messages cant fix helps filter sensible people scammers getting smarter day discussing preventive techniques day near greed high skill good scams become unavoidable dont rate scams avoidable unavoidable someone trying scam criminal making get sharper time solution bata doge reaction kahan se ayega psuedo intellectual people ka hamare ya sab cheezein reactionary hoti hain aur jab zara sa hungame ke beech solition pooch lo pin drop silence aur minute ke baad gaaliya newfound basis done derailing protest dont rude im proponent victim blaming yes go apple farming clear way avoid getting trouble line grey sexual assault happen anyone anywhere including house broad daylight inside metro taking precautions fine dont understand people unhinged accept crime committed perpetrators fault victim always energy look smart warned fail nothing improve situation derails effort others trying put women face sexual abuse right school college streets every time response cant warned go dude getting scammed online skill issue nris even matured sensible individuals guilty one reasons close many indians cant talk personal problems without getting shat one way another imo rape culture india mostly due steep divide rich poor poor person nothing lose even gets jailed get food shelter though thats strictly opinion going increase future instagram proof things black white seem recently one person climbed lion enclosure zoo get selfie lion lion obviously mauled death blame victim mindset generations parents used react time shared something ingrained found reacting similarly child stop wonder never wrong person always fault careless taken years find way sometimes still falter indians specially wont accept jab tak khud ke saath kuch nahi hota tab tak superiority complex rehta hai inka dont know empathy works someone gets cheated start blaming victim first recently faye dsouza posted year old infant killed street dogs comment section filled elite privileged people saying parents parents fault dont even realise millions indians live streets empathy year old infant dying reason many people afraid accept confess mistakes socially always blame game many people find amusement never duped made mistakes change overnight culture blaming victims socially hope generation comparatively understanding keep telling sister fault needs hear saavdhaan rahein satark rahein aur baaki log thoda courage dikha ke victim ko bachaayein dhanyawaad precaution happens theres point bashing victim theyve already robbedrapedscammed youre worsening situation ones denying perpetrator blamed fck even say blame victim whose fault get scammed online despite educated millennial careful wouldnt scammed first place india chutinyon se nai chutiyo se pareshan hai ps hope sis well cyber crime dept joke one friends lost k credit card fraud jackshit yeah goto modus operandi blame person suffering parents every single time childhood get hurt playing cricket beaten ki bahar khelne gaya hi kyo kal se cricket khelna band got less marks suffering malaria got good hr lecture let mosquito bite facepalm recently sprain came home dad asked didnt inform stared seriously happened childhood really think would ever tell problems never given solution sympathy gaaliyan beatings kudos great parent even first instinct blame sister happened took empathize saw parents reacting way initially realised mentality ingrained one us since generations went police said people lost lakhs crying k giving sorts bs advice insteading helping us cyber crime dept didnt shit either case scam scammer took money form cash learnt isnt process law get money back goes form like bank wants police confirmation stolen money police ask bank data trace account isnt policy solve stalemate yeah actually dont law get money back honestly thought good time scammer like much free money one catch explains india known scam capital world blame someone hold responsible reporting rapist thats victim blaming women report society theyre free without consequences women gone report rapes raped cops harassed murdered victim blamed society shamed dont say reporting enables rapist rapist already enabled society whose fault get scammed online despite educated millennial careful wouldnt scammed first place victims fault cant blame victim period scammers use techniques baffle anybody careful shouldnt first place lol case maybe smarten educate protect online cyber crimes exist thats reason people must learn protect instead baby complain getting scammed money involved dont trust anyone online even single dime wow someone gets scammed response would joke ask man ill never say directly person since person already suffered opinion ill mind stupid himher ill tell careful make sure thing never happens reality hisher fault get point confused two issues victim blaming blaming victim action lack thereof got himher predicament realize victim doesnt always circumstances fight painful motivation knowing pain might passed others even victims dont win least wary perp btw perps enabled society unless ignore hisher starting signs progression soon heshe knows results action better yes must put victims lives safety risk motivation thats literally putting burden victims actions criminal rhetoric problematic motivation societal pressure realise impossible motivation live let alone take fucked legal process cops see happened lady tried bastian case society men shamed blamed treated motivation bilkis banos rapists given freedom garlanded called cautious nothing wrong end day onus first cant control crimes least victim blaming scammed reported cybercrime days year recovered call center scam capital world haha call victim blaming call letting victim know made mistake remind extent never ever repeat fear humiliation thats parenting works mistake learning experience dont repeat blaming necessary please dont ever become parent really think parenting done really given level average engineer india dont think scammers get better lisbeth lives sweden india india person reports rape raked coals society even police ultimately victim put trauma rapist still walks free weve seen rapists getting garlanded weve seen police cover rape cases full view media rapists tortured killed child temple politicians stand support year barely begun weve already instances cops judges raping rape victim see actual consequences rapists actual protection victims maybe people would report blame choosing inherent irony statement made lol neat kids time gon something bout mentality makes open bottle people nowadays think dank victim blame think people like need speak takes one candle light room candles light hey seen replies fucking stop labeling people youre good parent youre first shouldnt put tag cuz shit happened sister agree people empowered fight crime done else everyone victim harrassing shouldve done doesnt actually solves anything collectively society specifically india tolerating engaging victim harassment people actually contribute culture normalizes perpetuates violence abuse totally agree sorry loss ill pray mental health even talking never implied want keep repeating mistakes sisters first last scam haha relax dont beat kids lisbeth lives sweden india agree sentiment india person reports rape raked coals society even police ultimately victim put trauma rapist still walks free weve seen rapists getting garlanded weve seen police cover rape cases full view media rapists tortured killed child temple politicians stand support year barely begun weve already instances cops judges raping rape victim see actual consequences rapists actual protection victims maybe people would report blame choosing victim never deserved course parents reaction come panic helplessness case huge amount sister pay learn better often retrieve money samething happened playing pubg fathers phone wedding relatives phones battery discharged plugged daddys phone inside relatives house hours return check battery percentage found fathers phone stolen panicked crying infront relatives everyone family relatives parents scolding isme meri kya galti mujhe kya pata tha ki relatives ke ghar ke andar se bhi chori hosakti hai deep shock whole day tried best find device able find device understood day country india japan extra precautious stuff parents didnt lose money sister hardearned money one feeling helpless parents job console support child whos suffering add existing helplessness agree issue mindset think help victims blaming reality subconsciously feel superior lecturing dear people think help victims shaming victims need support condescending lectures anyone become victim unfortunate part life victims need support mental trauma another note man incredibly scared scammers getting smarter smarter get vulnerable intention blame victim warn others take certain precautions avoid similar harm deprive victim justice ensure dont end position spend half decade chasing courts police begging justice talk parents sympathies anyone victim sort crime abuse said stop false equilvalencies getting raped vs getting duped telephone scamsters even remotely comparable online digital scams happen victim tech savvy plain dumb mos scamsters lot loopholes easily identified anyone basic common sense im saying criminals punished people faceless almost impossible track vigilant way time many times people get scammed due foolishness course parents get know adverse reaction initially especially something stupid led getting scammed parents got scammed like would similar reaction towards first superiority complex though true think indian society culture superior gender segregation victim blaming subjugation women look cultures might different even within india see different regions people large show negative attitudes towards bengali north eastern cultures women friendly im abcd got car accidents werent fault last months living bay area times family asked whos fault first even wondering ok although wasnt born india enjoy culture really dislike parts well blame someone hold responsible reporting rapist thats victim blaming bro whats solution take responsibility criminals well know wont happen countries like us uk sweden etc accountability women also lot cases dont say well lot case women go cops studys show every rapes go unreported know victim blaming bad someone take responsibility saying stuff like societys fault criminal crime waste time victim obviously fault sister also fault people dont say satark rahein reason dumb lack street smartness corrupt world im sorry youll get crushed evil lol blame criminals use fucking brains scammers use techniques baffle anybody youre either underestimating common sense overestimating lowlife scammers intelligence shut rape doesnt work way chain snatchers strangers people trust mostly organised crime rape cases rapist someone victims knows trusts random strangers also lot victims children whether wear chain hide go still lose chain thefts scams dont work way rape victims scamsthefts dont know person theyre someone person trusts theyre usually strangers work organised crime rape cases rapist someone victim knew trusted random strangers well explained sweeping generalisation stereotypes dont help anyone true kinds aholes dont want say anything raperelating topic discussionas anything say controversial well point discussed asking stay satark asking precautions bashing someone already happened good although also asking stay satark twisted kind way",
    "light_cleaned_title": "Victim blaming in India",
    "light_cleaned_selftext": "This bit by Abhishek Upmanyu sums up the whole victim blaming scene in India. Here's a little context- My sister got scammed a month ago. She lost 45K. It was her hard-earned money which she was saving from a very long time. This incident broke her completely. But our parents, instead of consoling her, kept blaming her. \"Why weren't you careful?\" \"How can you be so stupid?\" \"Why didn't you ask us first?\" I had to tell them to keep quiet and not tell this to anyone because I knew that our relatives would react the same way my parents did. Recently, a user posted on r/mumbai about how his sister got scammed (in the same way my sister was scammed). The first instinct of majority of people was to spew critical and hateful comments towards his sister instead of calling out the actual criminal. Some even said that she deserved to get scammed! Same thing happened when a user recently posted about getting raped (Bastian rape case) on the same sub. People were shaming her saying that it was her fault and that she deserved it. In India, it is so embarrassing to speak up about such crimes because when you do, people will taunt, shame and blame you and only you. No one will call out the actual criminal. They think they are teaching the victim a lesson by shaming and taunting them but all they are doing is enabling the cirminal to commit more such crimes!",
    "light_cleaned_comments": "Lot of this is just passed down mindset from older generations, it won't change easily. This is why many crimes do unnoticed We could begin by changing from ourselves and informing others near us [ Hope your sister is doing well now :) ] Superiority complex is something that's deeply rooted in Indian society! [This](https://np.reddit.com/r/mumbai/comments/1azl8yo/my_sister_got_scammed/?rdt=61780) is the post about the scam that happened with OP's sister. same as khalistani as farmers I think you are blowing this out of proportion. While yes there are people who blame the victim, there were many who came in support as well. Even for the Bastian case there was a whole movement started. So you cant pick just 5 comments and say that's all everybody else does. Secondly, when someone does fall for these scams, it is natural to ask what the heck was going through their head. People also have to be called out for the stupid shit they do. Nahi toh we are just creating a society of gullible idiots. What was the scam btw? Only proper education and awareness can change such mindset. Hopefully our future Generations would do better since our generation has realized how Fkd up our earlier generations were. I once lost railway ticket on platform (while removing handkerchief)I was panicked then I found police man and tell him my story he was talking with someone after hearing my concern he said in laughing 'ye dekho ticket nhi sambhal sakte' bc police ka kya kam hai yehi unko nhi pta baadmein station k bahr autowale se ticket mila In my experience, around 90% of online scams can be avoided by following the basic precautions and using common sense. I'm not saying victim blaming is nice. But, you would be stupid if you expect the Indians to be civilized enough to not commit crimes and be less careful. Such virtue-signalling doesn't work in real life. You can't change the mindset of a rapist or a robber. There'll always be rapists. So, what you can avoid is reducing the possibility of coming across such rapists. India isn't Europe where people respect personal choice and it'll never be Europe. It'll be the same with a huge uncivilized population regardless of whether they're educated or not. So, if you try to be stupid as a woman and walk alone in the most dangerous neighbourhood at midnight or even late night, that too, alone, it's quite obvious you'll be in danger. You can't blame the society for it. The society can't change mindset of criminals. I have come across statements like, \"As a woman, I'll go wherever I want to whenever I want in India, all on my own.\" Sweety, you have no idea how the world is. You think you can do anything about anything in the society. But, it's impossible. Just avoid daring yourself into such situations. Just prevent the worst thing from happening. It's in your own hands. That's not victim blaming. That's called \"precaution\" in an uncivilized society. If you don't accept the reality, you can try experimenting your virtue-signalling in real life. I can assure you you'll be disappointed. This. I am sorry but your sister is dumb af & so are you. Now crawl back to hole that you came out from. Be realistic. Upmanyu isn’t gonna save you. Because our law enforcement and judiciary are useless. They're not gonna find the criminal and even when they do you won't get your money back. So not only is it better safe than sorry it's the only fucking way. I saw a poster on a wall saying Paisa double in 20 days. Guess I will call him and give him my money. Exactly. It's just: 1. Never share OTP, I'd/pass, Credit card info 2. Click on random links/scan unknown QR codes 3. Buy from an unknown ecommerce website And never pay for a product you don't have, which is a general rule of thumb not necessarily for online stuff. Cry about it, most of the online scams can be prevented with basic common sense Just like you my sister also got scammed of 40k around 6 or 7 months ago and it broke her so badly and she was even trying to hide it. But I knew that her mental health is more important than that money she lost. So I sat with her and explained in total detail that it's the system and that the scammer's fault you don't have to feel bad for yourself and picked her up to continue. And with that incident I learnt that in India everyone will blame the victim for hiding their own incompetence. And police are basically non existent in terms of cybercrime and they blame us for being not careful and I was surprised to see their reaction after hearing 40k like it was chump change. But it was my sister's hard earned money and after that day I stopped supporting this whole government and police system as a whole. You can't depend on any of these shits. We are simply giving charity in the name of tax money. And I hated this fact most that I couldn't even console my sister by the way of telling her that we can bring her money back. Crimes of violating someone's modesty go unnoticed the most, go unreported so so often 😣😡 If you are dumb, obviously people will take advantage of you. That's not victim blaming, that's just common sense. Robbers will rob, they have been doing that thing for centuries, no one has been able to stop them, so what's the solution??? You need to be smart, if you want to stay safe It's not unique about India. In every country, rapists and thieves are there, no level of education can change them I followed 2 and 3, clicked all random link I could find, bought lot of shit from unknown website. Still go scammed. Fake News! Yeah. But, it's also about the culture. Rape culture in India is on the next level. Nothing can change it ever. 😂😂 If you think rationally... Doesn't that make sense ? Suppose you know that a xyz Street in a pqr city is prone to chain snatching.... Doesn't it make sense to go there ? And does it make sense to go there wearing jewellery? No doubt the people doing it are a hole But who is at a loss ? We lost the chain People are saying this as a superiority complex in comments I would say it as a maturity/ common sense Sane comments on reddit! wow. I think the point isn't calling people out for their stupidity. It's first getting to the root of the problem and solving it, or at least giving basic care to a victim before yelling at them. Blaming the affected person solves nothing and you can always ask them what the fuck they were thinking at the end of the entire ordeal. The poor girl has already been scammed out of 45k, she doesn't need her OWN PARENTS yelling at her instead of at least asking if she's ok or calming her down so they can track the scammer and get the money back. After a person has an accident you don't yell at them right away, you at least give them first aid. Then you ask the stupid rear-ending bastard what the fuck he was doing. Anybody read \"Girl with the dragon tattoo\"? Its protagonist Lisbeth says, and I totally agree with her, that by not reporting a rape a victim enables the rapist to create further victims. So true! My dad got scammed for 35k as he thought that he'll get Smart TV, refrigerator, Spilt AC, Washing Machine at smart price but in the end lost the money. We put the complaint in Cyber Police and told the bank as well. Just waiting for the response from the bank. It's just like some person's hard earned money is getting scammed yet the government/(cyber) police don't do anything. It's not like everyone is tech savvy. \"If it's too good to be true, then it's not\" This line alone is enough for all the financial/non-financial things in life. If not outright scam, there will some caveat or hidden con you might not be aware of Natural selection Nobody's defending the criminal. But the world is not a Utopia. If you choose to be dumb and naive always and don't have a problem getting scammed again n again, then you do you. Keep getting scammed and blame the criminal. Exactly. That's why I sleep at night without locking the gates of my house. It's thr thief who should not steal from my house, why should I lock them up? Doesn't work on gullible people for whom \"Chand pe makan\" is also a valid investment \"because something something Chandrayan\" Itna gyaan pel hi rahe toh Solution b bataa dijiye mahasay >when someone does fall for these scams, it is natural to ask what the heck was going through their head. And what good will it do? I understand that taking precautions is important, but what's the point in bashing the victim after they've already lost their money? And about the bastian rape case, many people were and still are blaming her for what happened. I am not merely picking 5 comments and blowing it out of proportion. The comments to this very post prove my point. You are just lucky that you haven’t been on someone’s radar yet. These scams don’t work on technicality but human engineering.Putting the victim in a sense of urgency, trying to manipulate with hospitality and much more. The reason these people don’t target you is not because you are smart enough to see through but why waste their effort on someone like you when they can get someone else in less effort which is the same reason they have grammatical mistakes in their messages. It’s not because they can’t fix it but because it helps them filter sensible people. These scammers are getting smarter each day and we are just discussing preventive techniques, the day is near when their greed will be so high and their skill so good that 90% scams will become unavoidable. Don’t rate scams as avoidable and unavoidable, someone trying to scam is a criminal in making who will only get sharper with time. Solution bata doge to reaction kahan se ayega psuedo intellectual people ka 😂 Hamare ya sab cheezein reactionary hoti hain aur jab zara sa hungame ke beech solition pooch lo to pin drop silence aur 5 minute ke baad gaaliya on the newfound basis that it is done for derailing the protest 😂 don't be so rude to her now >I'm not a proponent of victim blaming. Yes you are. Go do apple farming. There is no clear way to avoid getting into trouble. That is where the line is grey. Sexual assault can happen to anyone and anywhere, including your own house or in broad daylight inside the metro. Taking some precautions is fine, but I don't understand why people are so unhinged to accept that if some crime was committed, then perpetrators were at a fault and not the victim. It always has the energy of, \"Look, I am smart because I warned you not to do that because you will fail.\" It does nothing to improve the situation and derails the effort others are trying to put. Women face sexual abuse right from school to college to the streets. Every time the response can't be ,\"warned you not to go there.\" dude, getting scammed online in 2024 is a skill issue This is same with NRIs too, even matured and sensible individuals who are in their 40s and 50s, are guilty of this. This is one of the reasons I am not very close to many Indians because I can't talk about personal problems without getting shat on one way or another. IMO, rape culture in India is mostly due to the steep divide between rich and poor. A poor person has nothing to lose, even if he gets jailed he will get food and shelter. Though that's strictly my opinion. And it's going to increase in the future, Instagram is the proof of it. These things are not black and white as they seem. Recently, one person climbed into a lion enclosure, in a zoo, to get a selfie with the lion. The lion, obviously, mauled him to death. Should we not blame the victim here? This is the mindset from generations and is how my parents used to react any time I shared something with them. It was so ingrained in me that once when I found myself reacting similarly to my child I had to stop and wonder why I was doing it. It’s never about how wrong the other person is but always your fault for being careless. It has taken me years to find my way out of this and sometimes I still falter. This. Most Indians specially here won’t accept this because they themselves do this. Jab tak khud ke saath kuch nahi hota. Tab Tak superiority complex rehta hai inka. We don’t know how empathy works. When someone gets cheated, we start blaming the victim first. Recently Faye Dsouza posted about a 1 year old infant killed by 3 street dogs, the comment section is filled with elite privileged people saying “where were the parents, it’s parents fault” where as they don’t even realise that millions of Indians live on the streets. They had 0 empathy for a 1 year old infant dying. This is the reason why many people are afraid to accept or confess mistakes socially. It is always a blame game. Many people find amusement in this as if they have never been duped or made mistakes. This will not change overnight . We have a culture of blaming victims socially. But there is hope. Our generation is comparatively more understanding. Keep telling your sister that this is not her fault. She needs to hear that. Saavdhaan rahein satark rahein. Aur baaki log thoda courage dikha ke victim ko bachaayein. Dhanyawaad Precaution happens before. There's no point in bashing the victim after they've already been robbed/raped/scammed. You're just worsening the situation by doing that. No one's denying that the perpetrator is to be blamed. When the f#ck did I even say that blame is on the victim?? Whose fault is it if you get scammed online despite being an educated millennial??? Had you been careful, you wouldn't have been scammed in the first place. 🤷🏽‍♂️ India chutinyon se nai, chutiyo se pareshan hai : ) PS: hope your sis is doing well now. Cyber crime dept is a joke. One of my friends lost 96k in credit card fraud and they did jackshit. Yeah this is our go-to modus operandi. Blame the person who is suffering. This is what my parents did _every single time_ in my childhood. If I get hurt while playing Cricket I was _beaten_ ki bahar khelne gaya hi kyo kal se Cricket khelna band If I got less marks once because I was suffering from Malaria I got a good 2 hr lecture on why I let a mosquito bite me (\\*facepalm*) Recently I had a sprain and when I came home my dad asked me why I didn't inform me about it. I just stared at him. Seriously? After all that has happened in my childhood you really think I would _ever_ tell my problems to you, who have NEVER given me any solution or sympathy but gaaliyan and beatings? Kudos to you! You are a great parent. Even my first instinct was to blame my sister for what had happened. It took me a while to empathize with her. When I saw my parents reacting the same way I did initially, I realised that this mentality is ingrained in each one of us since generations. When we went to the police, they said \"People have lost lakhs, why are you crying for 45K?\" There were giving all sorts of bs advice insteading of helping us. The cyber crime dept. didn't do shit either. And in case of a scam if the scammer took out the money in the form of cash I learnt that there isn't any process or law to get your money back. It goes in form like this. The bank wants the police confirmation for stolen money and the police ask for bank data to trace the account and there isn't any policy to solve this stalemate so yeah we actually don't have a law to get OUR money back. I honestly thought what a good time to be a scammer like so much free money and no one to catch you. Explains why India is known as the \"Scam capital of the world\" You cannot blame someone or hold them responsible for not reporting a rapist. That's victim blaming itself. How can women report in a society where they're not free to without consequences? Women have gone to report rapes only to be raped by cops. Only to be harassed and murdered for it. Only to be victim blamed by society and shamed. So don't say not reporting enables a rapist. A rapist is already enabled by this society. >Whose fault is it if you get scammed online despite being an educated millennial??? Had you been careful, you wouldn't have been scammed in the first place. It is not the victim's fault, and you can't blame the victim, period. Scammers use techniques that can baffle anybody, so it's not about being careful, which they shouldn't have to in the first place. Lol. In that case, maybe, smarten yourself up. Educate yourself about how to protect yourself online. Cyber crimes exist and that's the reason why people must learn how to protect themselves instead of being a baby and then complain about getting scammed. When money is involved, don't trust anyone online. Not even with a single dime. Wow, so if someone gets scammed, your response would be to joke about it and ask them to man up. I'll never say that directly to the person since that person has already suffered. But, the opinion I'll have in my mind is that it's very stupid of him/her. I'll just tell her to be careful from now on and make sure that such a thing never happens. But, the reality is that it's his/her fault. Did you get my point?? You are confused with two issues. Victim blaming is blaming the victim for her action or lack thereof that got him/her into that predicament. I do realize that a victim doesn't always has the circumstances to fight. But if it was painful now, motivation is in knowing that this pain might not be passed to others. Even if victims don't win, at least other will be wary of the perp. BTW, perps are not enabled by society unless you ignore his/her starting signs. There is progression and as soon as he/she knows the results of her action, the better. Yes we must put victims lives and safety at risk for \"motivation\". That's literally putting a burden on victims for the actions of a criminal. 🙄🙄🙄 And such a rhetoric IS problematic. It's not \"motivation\". It's societal pressure. You do realise it's impossible to have motivation to live after, let alone take on the fucked up legal process of cops? See what happened to the lady who tried to do the same in the Bastian case. How society and men shamed blamed and treated her. And what motivation? Bilkis banos rapists were given freedom and garlanded 🙄 It’s called being cautious. Nothing wrong with that. At the end of the day the onus is on you and yourself first. You can’t control crimes but you, at the very least. No victim blaming in all this. I was scammed for 1700₹, reported to cybercrime with 3 days, after a year they recovered 1500₹ 🥲 *Call center scam capital of the world Haha You call it victim blaming, I call it letting the victim know they made a mistake and to remind them to such an extent that they never ever repeat it in fear of such humiliation. That's how parenting works. A mistake can be a learning experience only if you don't repeat it and for that blaming is necessary Please don't ever become a parent if you really think this is how parenting should be done. Not really. Given the level of an average engineer in India I don't think our scammers can get any better. Lisbeth lives in Sweden, not India. In India a person who reports rape, will be raked over the coals by society, and even the police. Ultimately the victim is put through more trauma and the rapist still walks free. We've seen rapists getting garlanded. We've seen police cover up rape cases in full view of the media. Rapists who tortured and killed a child in a temple had politicians stand in support of them. This year has barely begun and we've already had instances of cops and judges raping a rape victim. If we see actual consequences for rapists and actual protection for victims, maybe then more people would report it. Until then, we cannot blame them for choosing not to. The inherent irony in this statement made me lol I neat my kids all the time you gon do something bout it ? this mentality makes me not open up and bottle up. people nowadays think it is dank to victim blame. I think people like you and i and more need to speak up more. it takes only one candle to light up a room. more candles, more light. Hey, I have seen your replies. Can you fucking stop labeling people with \"you're a good parent and you're not.\" First of all you shouldn't put a tag just cuz some shit happened to your sister, and I agree, people should be empowered to fight against the crime done to them else everyone will be a victim. Harrassing them with what should've been done and so and so doesn't actually solves anything. The collectively society not specifically India, tolerating or engaging in victim harassment, people actually contribute to a culture that normalizes and perpetuates violence and abuse. So I totally agree with you. Sorry for her loss. I'll pray for their mental health What are you even talking about? I never implied that we want to keep repeating our mistakes. This was my sister's first and her LAST scam. Haha relax I don't beat my kids Lisbeth lives in Sweden, not India. (Not that I agree with that sentiment). In India a person who reports rape, will be raked over the coals by society, and even the police. Ultimately the victim is put through more trauma and the rapist still walks free. We've seen rapists getting garlanded. We've seen police cover up rape cases in full view of the media. Rapists who tortured and killed a child in a temple had politicians stand in support of them. This year has barely begun and we've already had instances of cops and judges raping a rape victim. If we see actual consequences for rapists and actual protection for victims, maybe then more people would report it. Until then, we cannot blame them for choosing not to. The victim never deserved it of course. But your parents' reaction come from panic and helplessness in such case, because it's a huge amount your sister had to pay to learn better. Often we cannot retrieve the money so... samething happened with me i was playing pubg on my fathers phone during a wedding of my relatives then phone's battery discharged so i plugged in my daddy's phone inside my relatives house after few hours when i return to check battery percentage i found out that my fathers phone is stolen , i was so panicked that i was crying infront of my relatives everyone my family, relatives , parents all of them were scolding me isme meri kya galti mujhe kya pata tha ki relatives ke ghar ke andar se bhi chori hosakti hai i was in deep shock for that whole day i tried my best to find that device but i was not able to find that device i understood that day that my country is india not japan i will have to be extra precautious with my stuff My parents didn't lose money, my sister did. It was HER hard-earned money. She was the one who was feeling helpless. A parent's job is to console and support their child who's suffering, not add to the existing helplessness. I agree, and the issue with this mindset is that they think they help the victims by blaming them. But in reality, they subconsciously feel superior by lecturing them. Dear people who think they help victims by shaming them, you are not. Victims need support, not your condescending lectures. Anyone can become a victim. It is an unfortunate part of life. Most victims need support, not mental trauma. On another note. Man, I am incredibly scared of scammers. They are getting smarter and smarter. They will get you when you are most vulnerable. The intention is not to blame the victim but to warn others that they should take certain precautions to avoid similar harm. It is not to deprive the victim from justice but to ensure that you don't end up in a position where you have to spend half a decade chasing courts and police begging for justice Talk to your parents then. My sympathies to anyone who has been a victim of any sort of crime / abuse. Having said that — Stop these false equilvalencies. How is getting raped vs getting duped over telephone by scamsters even remotely comparable? Online / digital scams can only happen if the victim not tech savvy, or just plain dumb. The MOs of the scamsters have a lot of loopholes in them and can be easily identified by anyone with basic common sense. I'm not saying the criminals should not be punished. But these people are all over and faceless and almost impossible to track. Being vigilant is the only way. Not all the time; but many times people get scammed due to their own foolishness. And of course when parents get to know they will have an adverse reaction initially, especially if it was something stupid; that led to you getting scammed. If your parents got scammed like that, you would have a similar reaction towards them at first. They do have a superiority complex though, it's true. They think indian society and culture is superior for it's gender segregation, for it's victim blaming, for its subjugation of women. And look down on other cultures that might be different. Even within India you see it between different regions, people in large show negative attitudes towards Bengali and north eastern cultures that are more women friendly I'm an ABCD and got into 2 car accidents that weren't my fault in the last 6 months (living in the bay area) both times my family asked who's fault it was first, before even wondering if I was ok Although I wasn't born in India I enjoy of the culture, but I really dislike parts of it as well. >You cannot blame someone or hold them responsible for not reporting a rapist. That's victim blaming itself. Bro what's your solution then who should take responsibility the criminals well we all know that wont happen, countries like us, uk, Sweden etc with no accountability to women also have lot of cases and don't say \"well they have lot of case because women go to cops\" as study's show 2 out of every 3 rapes go unreported, i know victim blaming is bad but someone has to take responsibility saying stuff like its society's fault or criminal should not do crime is waste of time. The Victim is obviously at fault but your sister is also at fault. People don't just say 'satark rahein' for no reason. If you are dumb and lack street smartness in this corrupt world then I'm Sorry but you'll get crushed by the evil. lol! You can blame the “criminals” but it’s up to each to use their fucking brains \"Scammers use techniques that can baffle anybody\" You're either underestimating common sense or overestimating a lowlife scammer's intelligence. Just shut up Rape doesn't work the same way. Most chain snatchers are strangers and not people they trust and mostly do organised crime. For rape, in most cases the rapist is someone the victims knows and trusts, not random strangers, also a lot of the victims are children, what do they do? So whether you wear the chain out, hide it or not go out at all, you still lose the chain. Thefts or scams don't work the same way as rape. Most victims of scams/thefts don't know the person before and they're not someone the person trusts. They're usually strangers who work in organised crime. For rape, in most cases the rapist was someone the victim knew and trusted, not random strangers. Very well explained! Sweeping generalisation or stereotypes don’t help anyone. After you :) True... Those are other kinds of a...holes Don't want to say anything about rape(relating to the topic of discussion)as anything you say is controversial Well the point being discussed is asking to stay satark So they are asking for precautions only Bashing someone after it has already happened is not good( although it is also asking to stay satark in a very twisted kind of way) That"
}