{
    "id": "12gaeug",
    "title": "My friend is conducting a study regarding gender-neutral laws in the country.",
    "url": "https://www.reddit.com/r/india/comments/12gaeug/my_friend_is_conducting_a_study_regarding/",
    "selftext": "My friend of mine is conducting a study on gender neutral laws and the need for them to protect men more.\n\nhttps://forms.gle/Y7ewBc1vLgXNMCVv8\n\nIt would be a huge favour if you could participate in this survey that will take hardly 5 minutes of your time. Your identity and answers shall be kept confidential.\n\nThank you in advance!",
    "flair": "AskIndia",
    "score": 14,
    "num_comments": 11,
    "created_utc": 1681019507.0,
    "convurl": "https://external-preview.redd.it/2FoHnJtV8w5NJ1qC4GpE4bu7eKv9zG8XM7bXIStdiNk.jpg?auto=webp&v=enabled&s=9f166984c37544a9d2fc4523d7d0e07074b23378",
    "comments": [
        "Oh yes, because India is known for falsely accusing women and not rapist men.",
        "Hi, there's certainly a major safety issue for women around the country. However, I hope you'd agree that poor legal frameworks help nobody. Also, it takes away conventional protections from people in the LGBTQI+ folks in the country who are susceptible as the current laws strictly define men as perpetrators and women as victims.",
        "Because men are the perpetrators of the sexual assault and murder of men, women, children, LGBTQIA+ or animals 99.9999999 times. Most of the victims do not come forward because they know they will be accused of lying. What you're doing is uplifting the uplifted in India.  Anyone can lie in a testimony in any criminal case, there are already laws that punish you for lying in court. Why do want to give even more power to rapists. Why specifically go for rape victims when the number of real rape cases compared to false rape cases is infinitely more.",
        "I feel it is rather harsh to use the word \"rapists\" and \"men\" interchangeably. The case of silence in the aftermath of sexual assault is also applicable to female-on-male sexual crimes, and there's no way of us knowing the real numbers pertaining to the same cause the laws are stitched up in such a way that sexual crimes committed by women, in totality, cannot even be acknowledged from a legal purview. It helps nobody, people still get raped, nobody's better off with this \"us vs them\" mentality. Rape is about power, and power dynamics are not always dictated by gender, race etc. From one circumstance to another, people develop different hierarchies.",
        "Dude, touch some grass. Every woman in India has been harassed or assaulted by atleast one MAN. Every female foreingner has been harassed by atleast one MAN. Women outside India are afraid of Indian migrants. Pull your head out of your philosophical ass and see the reality. \n\n>It helps nobody,\n\nObviously current laws already help rapists, they hardly face any consequences. Its so hard getting a conviction if the case is not super popular in media. The rapists know they wont face any consequences thats why they are not afraid of commiting these heinous crimes. \n\n>\"us vs them\n\nYes, it IS people against sexual harassment vs rapists & people who defend rapists\n\n>rather harsh to use the word \"rapists\" and \"men\"\n\nHow many rape cases involve a group of women raping and mutilating and murdering a man ?",
        "I have filled my fake thoughts 💭on this survey to pass it off as disguised vitriol information… don’t rely on it too much",
        "Most of the people that are set free have some ties to a political party.\n\nWe vote for criminals, what do we expect?",
        "🤣🤣🤣 and i thought i was the only one.",
        "Such cases are rising now so if there can be a way to protect the innocent while punishing the guilty all such avenues should be explored.. the social context is changing also along with the older series of crimes"
    ],
    "cleaned_text": "friend conducting study regarding genderneutral laws country friend mine conducting study gender neutral laws need protect men would huge favour could participate survey take hardly minutes time identity answers shall kept confidential thank advance ",
    "cleaned_title": "friend conducting study regarding genderneutral laws country",
    "cleaned_selftext": "friend mine conducting study gender neutral laws need protect men would huge favour could participate survey take hardly minutes time identity answers shall kept confidential thank advance",
    "cleaned_comments": "oh yes india known falsely accusing women rapist men hi theres certainly major safety issue women around country however hope youd agree poor legal frameworks help nobody also takes away conventional protections people lgbtqi folks country susceptible current laws strictly define men perpetrators women victims men perpetrators sexual assault murder men women children lgbtqia animals times victims come forward know accused lying youre uplifting uplifted india anyone lie testimony criminal case already laws punish lying court want give even power rapists specifically go rape victims number real rape cases compared false rape cases infinitely feel rather harsh use word rapists men interchangeably case silence aftermath sexual assault also applicable femaleonmale sexual crimes theres way us knowing real numbers pertaining cause laws stitched way sexual crimes committed women totality even acknowledged legal purview helps nobody people still get raped nobodys better us vs mentality rape power power dynamics always dictated gender race etc one circumstance another people develop different hierarchies dude touch grass every woman india harassed assaulted atleast one man every female foreingner harassed atleast one man women outside india afraid indian migrants pull head philosophical ass see reality helps nobody obviously current laws already help rapists hardly face consequences hard getting conviction case super popular media rapists know wont face consequences thats afraid commiting heinous crimes us vs yes people sexual harassment vs rapists people defend rapists rather harsh use word rapists men many rape cases involve group women raping mutilating murdering man filled fake thoughts survey pass disguised vitriol information dont rely much people set free ties political party vote criminals expect thought one cases rising way protect innocent punishing guilty avenues explored social context changing also along older series crimes",
    "light_cleaned_title": "My friend is conducting a study regarding gender-neutral laws in the country.",
    "light_cleaned_selftext": "My friend of mine is conducting a study on gender neutral laws and the need for them to protect men more. It would be a huge favour if you could participate in this survey that will take hardly 5 minutes of your time. Your identity and answers shall be kept confidential. Thank you in advance!",
    "light_cleaned_comments": "Oh yes, because India is known for falsely accusing women and not rapist men. Hi, there's certainly a major safety issue for women around the country. However, I hope you'd agree that poor legal frameworks help nobody. Also, it takes away conventional protections from people in the LGBTQI+ folks in the country who are susceptible as the current laws strictly define men as perpetrators and women as victims. Because men are the perpetrators of the sexual assault and murder of men, women, children, LGBTQIA+ or animals 99.9999999 times. Most of the victims do not come forward because they know they will be accused of lying. What you're doing is uplifting the uplifted in India. Anyone can lie in a testimony in any criminal case, there are already laws that punish you for lying in court. Why do want to give even more power to rapists. Why specifically go for rape victims when the number of real rape cases compared to false rape cases is infinitely more. I feel it is rather harsh to use the word \"rapists\" and \"men\" interchangeably. The case of silence in the aftermath of sexual assault is also applicable to female-on-male sexual crimes, and there's no way of us knowing the real numbers pertaining to the same cause the laws are stitched up in such a way that sexual crimes committed by women, in totality, cannot even be acknowledged from a legal purview. It helps nobody, people still get raped, nobody's better off with this \"us vs them\" mentality. Rape is about power, and power dynamics are not always dictated by gender, race etc. From one circumstance to another, people develop different hierarchies. Dude, touch some grass. Every woman in India has been harassed or assaulted by atleast one MAN. Every female foreingner has been harassed by atleast one MAN. Women outside India are afraid of Indian migrants. Pull your head out of your philosophical ass and see the reality. >It helps nobody, Obviously current laws already help rapists, they hardly face any consequences. Its so hard getting a conviction if the case is not super popular in media. The rapists know they wont face any consequences thats why they are not afraid of commiting these heinous crimes. >\"us vs them Yes, it IS people against sexual harassment vs rapists & people who defend rapists >rather harsh to use the word \"rapists\" and \"men\" How many rape cases involve a group of women raping and mutilating and murdering a man ? I have filled my fake thoughts 💭on this survey to pass it off as disguised vitriol information… don’t rely on it too much Most of the people that are set free have some ties to a political party. We vote for criminals, what do we expect? 🤣🤣🤣 and i thought i was the only one. Such cases are rising now so if there can be a way to protect the innocent while punishing the guilty all such avenues should be explored.. the social context is changing also along with the older series of crimes"
}