{
    "id": "1d6xxks",
    "title": "Indians Trapped and Betrayed in Southeast Asia",
    "url": "https://www.reddit.com/r/india/comments/1d6xxks/indians_trapped_and_betrayed_in_southeast_asia/",
    "selftext": "I posted a story earlier about the [billion-dollar scam](https://np.reddit.com/r/india/comments/1aud62j/billion_dollar_scam/) happening in Southeast Asia. Subsequently, on March 29, 2024, the Indian Express [published a story revealing that over 5,000 Indians](https://indianexpress.com/article/india/5000-indians-in-cambodia-forced-into-cyber-scams-mha-takes-note-9239156/) are caught up in cyber-scam operations in Cambodia. Since then, there have been significant developments, including troubling new revelations and inadequate responses from authorities. This story focuses on Cambodia, where desperate job seekers are trafficked and forced into cyber scams, a modern form of slavery orchestrated by international criminal networks. According to the United States Institute of Peace (USIP), these organized crime networks, especially Chinese Triads are earning an [estimated $64 billion annually](https://www.usip.org/publications/2024/05/transnational-crime-southeast-asia-growing-threat-global-peace-and-security) from such operations in Southeast Asia, highlighting the immense scale and profitability of these criminal activities.\n\nFirst, let's talk about Botcha Sankhar, a former Indian Navy chef who went to Cambodia looking for a job, only to be trapped in a cyber-scam compound. From an account in a story recently published in the Economic Times, Sankhar, after struggling for years to find employment in India, paid an agent for a job in Singapore but ended up in Cambodia. There, he was forced to create fake profiles and lure victims into scams, working under brutal conditions with his passport confiscated. His story highlights the severe exploitation and lack of any sympathy or adequate help from embassy officials. It also leaves you wondering whether there are many more such cases that have simply gone unreported.\n\nEconomic Times: [The man who escaped the scam rings of Cambodia](https://economictimes.indiatimes.com/jobs/mid-career/the-man-who-escaped-the-scam-rings-of-cambodia/articleshow/110626511.cms) (1 May 2024) \\[Paywalled\\]\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\nThen, there's the story of Sanjeet Yadav from Gopalganj, who found himself in an even more precarious situation. Literally, from the frying pan into the fire. Promised a job as a safety in-charge, he paid an agent only to be sold to a Pakistani cyber-scam company in Cambodia. After pleading for help from the Indian Embassy, he was eventually rescued by Cambodian police but then spent 50 days in jail. This raises troubling questions: Why wasn't the embassy aware of his detention? Why did it take so long for his situation to come to light? The gaps in embassy support and international cooperation are glaring.\n\nAnyTV News: A young man went abroad with great aspirations, became a toy, returned to India and told such a story that everyone was stunned (29 May 2024) \\[removed link/sub filters\\]\n\n>\n\n>\n\nEven before these stories broke, there have been significant developments from Vishakhapatnam and also other locations such as Rourkela. Hundreds of unemployed youths, lured with the promise of jobs in Singapore, ended up trafficked to Cambodia. After revolting against their handlers in Sihanoukville, many reached out to Indian authorities for help. The police in Vishakhapatnam, along with other agencies, [have been working tirelessly](https://www.youtube.com/watch?v=c5X5xVSiFHQ) to rescue these individuals and dismantle the trafficking network.\n\nThe Ministry of Home Affairs and other agencies have been holding meetings to identify and plug loopholes that enable these scams. This includes addressing the misuse of Indian SIM cards and bank accounts by fraudsters. Despite these efforts, the financial impact is staggering, with Rs 1,750 crore (approximately USD 210 million) lost to scams in just four months of this year, pointing to potential billions in annual losses.\n\n**The revelation that the number of Indians trapped in these scams could far exceed the initial estimate of 5,000 is shocking**. The inadequate response from the Ministry of External Affairs' East Asian Division, the embassy and the significant financial losses underline the severity of the crisis. We need to push for better tracking mechanisms, enhanced international cooperation, and more robust measures to rescue and support victims. We need to get our people out from the clutches of these organised crime syndicates.\n\nFurther reading:\n\n* [Cambodia's Scamdemic Crisis Exposes Domestic Failings, and Geopolitical Challenges for India](https://np.reddit.com/r/GeopoliticsIndia/comments/1bihj2a/cambodias_scamdemic_crisis_exposes_domestic/)\n* [India's Geopolitical Imperative in Cambodia: Combating Southeast Asia's Scamdemic Crisis](https://np.reddit.com/r/GeopoliticsIndia/comments/1c0kdum/indias_geopolitical_imperative_in_cambodia/)\n* [300 Indians Riot at Jinbei 4 Scam Compound in Sihanoukville, Cambodia](https://np.reddit.com/r/GeopoliticsIndia/comments/1cxvjwf/300_indians_riot_at_jinbei_4_scam_compound_in/)\n* [Pakistanis Fuel Organized Crime Wave: Indians Kidnapped in Cambodia](https://np.reddit.com/r/GeopoliticsIndia/comments/1d3gbf5/pakistanis_fuel_organized_crime_wave_indians/)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1717396146.0,
    "convurl": "https://external-preview.redd.it/XLl856Lzb8K8040ds_PWLLpFqUYpqooAyQs2ncglNlg.jpg?auto=webp&s=d9ebbac7c61830a16db202410612cc66fbfd5b22",
    "comments": [
        "  \nEconomic Times: The man who escaped the scam rings of Cambodia (1 June 2024)\n\n*In a darkened room in the interiors of* [***Cambodia***](https://economictimes.indiatimes.com/topic/Cambodia)*, as blows landed on him, one after another, hour after hour, and jolts of electric shocks burnt through his body, he kept reminding himself what he had learnt in the navy: “Whatever happens to you, whatever pain you are made to go through, bardasht karo (bear it). Wait for your time.” And so he waited.*\n\n*In Bengaluru, a software engineer gets a call from a person saying there is a courier in her name, carrying contraband, from Taiwan and that she is under “digital arrest”. In Faridabad, a woman who had been dabbling in stocks for the last couple of years, receives a link on Facebook inviting her to join a WhatsApp group to increase her returns exponentially. In Hyderabad, a retired executive accepts a Facebook friend request from an attractive stranger and gets a message beginning, “Good morning.”*\n\nBotcha Sankhar was fed up. For five years, since his 15-year stint in the [**Indian Navy**](https://economictimes.indiatimes.com/news/indian-navy-news) ended in 2018, the Visakhapatnam resident had been trying for a job. He applied to numerous companies, attended job fairs for ex-servicemen and, to upskill himself, the former chef completed courses such as fire and safety. But each time, he went up against a wall. “They would ask me what experience I had in fire and safety, discounting my navy experience. Or, there would be 2,000 ex-servicemen applying for 10 jobs. Or, they would judge me on the basis of my caste,” says Sankhar, who belongs to Relli, a scheduled caste in Andhra Pradesh. Dressed in a collared t-shirt and jogger pants, with a cap pulled down to his forehead, the 41-year-old speaks deliberately.\n\nIn desperation, he paid Rs 6 lakh to an acquaintance who promised him a job in the dockyard. However, that too came to naught, as did an attempt to go to Poland. That’s when a relative approached him with an opportunity—a job in Singapore, either as a fire and safety officer or a data entry operator for a good salary. For that, he says, he coughed up Rs 3 lakh to an agent and a sub-agent.\n\nIn May 2023, a month before his son’s ninth birthday, Sankhar boarded a flight to Bangkok, hopeful that his search was finally succeeding, which would also help repair strained relations at home. It was only on landing in Thailand that he realised the ticket for his connecting flight was to Cambodia, not Singapore. He immediately called his acquaintance, N Tirumala. “He told me not to worry and to take the flight to Cambodia since he was already there,” says Sankhar.\n\nFrom the airport in Phnom Penh, the capital of Cambodia, he was taken to an office, where he was made to do a typing test. The first day, he says, he did the rounds of six companies and, on the second, about 10 companies until, finally, he was told he was selected. In the “office”, he recalls, there were people from various Indian states and other South Asian countries, all seated around terminals, with desktops and phones. After several days, Sankhar was assigned his task: to create fake profiles of women on Facebook which would be linked to fake email IDs and numbers\n\nUnknown to him, Sankhar had been sold to the company by his agent. He was now one of the thousands of workers who are illegally trafficked to [**Southeast Asia**](https://economictimes.indiatimes.com/topic/Southeast-Asia)’s “scam compounds” to perpetrate [**cyber fraud**](https://economictimes.indiatimes.com/topic/cyber-fraud) to the tune of billions of dollars. Workers’ passports would be confiscated soon after arrival. They work under duress, often on their countrymen and women back home— a new form of slavery."
    ],
    "cleaned_text": "indians trapped betrayed southeast asia posted story earlier billiondollar scamhttpsnpredditcomrindiacommentsaudjbilliondollarscam happening southeast asia subsequently march indian express published story revealing indianshttpsindianexpresscomarticleindiaindiansincambodiaforcedintocyberscamsmhatakesnote caught cyberscam operations cambodia since significant developments including troubling new revelations inadequate responses authorities story focuses cambodia desperate job seekers trafficked forced cyber scams modern form slavery orchestrated international criminal networks according united states institute peace usip organized crime networks especially chinese triads earning estimated billion annuallyhttpswwwusiporgpublicationstransnationalcrimesoutheastasiagrowingthreatglobalpeaceandsecurity operations southeast asia highlighting immense scale profitability criminal activities first lets talk botcha sankhar former indian navy chef went cambodia looking job trapped cyberscam compound account story recently published economic times sankhar struggling years find employment india paid agent job singapore ended cambodia forced create fake profiles lure victims scams working brutal conditions passport confiscated story highlights severe exploitation lack sympathy adequate help embassy officials also leaves wondering whether many cases simply gone unreported economic times man escaped scam rings cambodiahttpseconomictimesindiatimescomjobsmidcareerthemanwhoescapedthescamringsofcambodiaarticleshowcms may paywalled theres story sanjeet yadav gopalganj found even precarious situation literally frying pan fire promised job safety incharge paid agent sold pakistani cyberscam company cambodia pleading help indian embassy eventually rescued cambodian police spent days jail raises troubling questions wasnt embassy aware detention take long situation come light gaps embassy support international cooperation glaring anytv news young man went abroad great aspirations became toy returned india told story everyone stunned may removed linksub filters even stories broke significant developments vishakhapatnam also locations rourkela hundreds unemployed youths lured promise jobs singapore ended trafficked cambodia revolting handlers sihanoukville many reached indian authorities help police vishakhapatnam along agencies working tirelesslyhttpswwwyoutubecomwatchvcxxvsifhq rescue individuals dismantle trafficking network ministry home affairs agencies holding meetings identify plug loopholes enable scams includes addressing misuse indian sim cards bank accounts fraudsters despite efforts financial impact staggering rs crore approximately usd million lost scams four months year pointing potential billions annual losses revelation number indians trapped scams could far exceed initial estimate shocking inadequate response ministry external affairs east asian division embassy significant financial losses underline severity crisis need push better tracking mechanisms enhanced international cooperation robust measures rescue support victims need get people clutches organised crime syndicates reading cambodias scamdemic crisis exposes domestic failings geopolitical challenges indiahttpsnpredditcomrgeopoliticsindiacommentsbihjacambodiasscamdemiccrisisexposesdomestic indias geopolitical imperative cambodia combating southeast asias scamdemic crisishttpsnpredditcomrgeopoliticsindiacommentsckdumindiasgeopoliticalimperativeincambodia indians riot jinbei scam compound sihanoukville cambodiahttpsnpredditcomrgeopoliticsindiacommentscxvjwfindiansriotatjinbeiscamcompoundin pakistanis fuel organized crime wave indians kidnapped cambodiahttpsnpredditcomrgeopoliticsindiacommentsdgbfpakistanisfuelorganizedcrimewaveindians ",
    "cleaned_title": "indians trapped betrayed southeast asia",
    "cleaned_selftext": "posted story earlier billiondollar scamhttpsnpredditcomrindiacommentsaudjbilliondollarscam happening southeast asia subsequently march indian express published story revealing indianshttpsindianexpresscomarticleindiaindiansincambodiaforcedintocyberscamsmhatakesnote caught cyberscam operations cambodia since significant developments including troubling new revelations inadequate responses authorities story focuses cambodia desperate job seekers trafficked forced cyber scams modern form slavery orchestrated international criminal networks according united states institute peace usip organized crime networks especially chinese triads earning estimated billion annuallyhttpswwwusiporgpublicationstransnationalcrimesoutheastasiagrowingthreatglobalpeaceandsecurity operations southeast asia highlighting immense scale profitability criminal activities first lets talk botcha sankhar former indian navy chef went cambodia looking job trapped cyberscam compound account story recently published economic times sankhar struggling years find employment india paid agent job singapore ended cambodia forced create fake profiles lure victims scams working brutal conditions passport confiscated story highlights severe exploitation lack sympathy adequate help embassy officials also leaves wondering whether many cases simply gone unreported economic times man escaped scam rings cambodiahttpseconomictimesindiatimescomjobsmidcareerthemanwhoescapedthescamringsofcambodiaarticleshowcms may paywalled theres story sanjeet yadav gopalganj found even precarious situation literally frying pan fire promised job safety incharge paid agent sold pakistani cyberscam company cambodia pleading help indian embassy eventually rescued cambodian police spent days jail raises troubling questions wasnt embassy aware detention take long situation come light gaps embassy support international cooperation glaring anytv news young man went abroad great aspirations became toy returned india told story everyone stunned may removed linksub filters even stories broke significant developments vishakhapatnam also locations rourkela hundreds unemployed youths lured promise jobs singapore ended trafficked cambodia revolting handlers sihanoukville many reached indian authorities help police vishakhapatnam along agencies working tirelesslyhttpswwwyoutubecomwatchvcxxvsifhq rescue individuals dismantle trafficking network ministry home affairs agencies holding meetings identify plug loopholes enable scams includes addressing misuse indian sim cards bank accounts fraudsters despite efforts financial impact staggering rs crore approximately usd million lost scams four months year pointing potential billions annual losses revelation number indians trapped scams could far exceed initial estimate shocking inadequate response ministry external affairs east asian division embassy significant financial losses underline severity crisis need push better tracking mechanisms enhanced international cooperation robust measures rescue support victims need get people clutches organised crime syndicates reading cambodias scamdemic crisis exposes domestic failings geopolitical challenges indiahttpsnpredditcomrgeopoliticsindiacommentsbihjacambodiasscamdemiccrisisexposesdomestic indias geopolitical imperative cambodia combating southeast asias scamdemic crisishttpsnpredditcomrgeopoliticsindiacommentsckdumindiasgeopoliticalimperativeincambodia indians riot jinbei scam compound sihanoukville cambodiahttpsnpredditcomrgeopoliticsindiacommentscxvjwfindiansriotatjinbeiscamcompoundin pakistanis fuel organized crime wave indians kidnapped cambodiahttpsnpredditcomrgeopoliticsindiacommentsdgbfpakistanisfuelorganizedcrimewaveindians",
    "cleaned_comments": "economic times man escaped scam rings cambodia june darkened room interiors cambodiahttpseconomictimesindiatimescomtopiccambodia blows landed one another hour hour jolts electric shocks burnt body kept reminding learnt navy whatever happens whatever pain made go bardasht karo bear wait time waited bengaluru software engineer gets call person saying courier name carrying contraband taiwan digital arrest faridabad woman dabbling stocks last couple years receives link facebook inviting join whatsapp group increase returns exponentially hyderabad retired executive accepts facebook friend request attractive stranger gets message beginning good morning botcha sankhar fed five years since year stint indian navyhttpseconomictimesindiatimescomnewsindiannavynews ended visakhapatnam resident trying job applied numerous companies attended job fairs exservicemen upskill former chef completed courses fire safety time went wall would ask experience fire safety discounting navy experience would exservicemen applying jobs would judge basis caste says sankhar belongs relli scheduled caste andhra pradesh dressed collared tshirt jogger pants cap pulled forehead yearold speaks deliberately desperation paid rs lakh acquaintance promised job dockyard however came naught attempt go poland thats relative approached opportunitya job singapore either fire safety officer data entry operator good salary says coughed rs lakh agent subagent may month sons ninth birthday sankhar boarded flight bangkok hopeful search finally succeeding would also help repair strained relations home landing thailand realised ticket connecting flight cambodia singapore immediately called acquaintance n tirumala told worry take flight cambodia since already says sankhar airport phnom penh capital cambodia taken office made typing test first day says rounds six companies second companies finally told selected office recalls people various indian states south asian countries seated around terminals desktops phones several days sankhar assigned task create fake profiles women facebook would linked fake email ids numbers unknown sankhar sold company agent one thousands workers illegally trafficked southeast asiahttpseconomictimesindiatimescomtopicsoutheastasias scam compounds perpetrate cyber fraudhttpseconomictimesindiatimescomtopiccyberfraud tune billions dollars workers passports would confiscated soon arrival work duress often countrymen women back home new form slavery",
    "light_cleaned_title": "Indians Trapped and Betrayed in Southeast Asia",
    "light_cleaned_selftext": "I posted a story earlier about the [billion-dollar scam](https://np.reddit.com/r/india/comments/1aud62j/billion_dollar_scam/) happening in Southeast Asia. Subsequently, on March 29, 2024, the Indian Express [published a story revealing that over 5,000 Indians](https://indianexpress.com/article/india/5000-indians-in-cambodia-forced-into-cyber-scams-mha-takes-note-9239156/) are caught up in cyber-scam operations in Cambodia. Since then, there have been significant developments, including troubling new revelations and inadequate responses from authorities. This story focuses on Cambodia, where desperate job seekers are trafficked and forced into cyber scams, a modern form of slavery orchestrated by international criminal networks. According to the United States Institute of Peace (USIP), these organized crime networks, especially Chinese Triads are earning an [estimated $64 billion annually](https://www.usip.org/publications/2024/05/transnational-crime-southeast-asia-growing-threat-global-peace-and-security) from such operations in Southeast Asia, highlighting the immense scale and profitability of these criminal activities. First, let's talk about Botcha Sankhar, a former Indian Navy chef who went to Cambodia looking for a job, only to be trapped in a cyber-scam compound. From an account in a story recently published in the Economic Times, Sankhar, after struggling for years to find employment in India, paid an agent for a job in Singapore but ended up in Cambodia. There, he was forced to create fake profiles and lure victims into scams, working under brutal conditions with his passport confiscated. His story highlights the severe exploitation and lack of any sympathy or adequate help from embassy officials. It also leaves you wondering whether there are many more such cases that have simply gone unreported. Economic Times: [The man who escaped the scam rings of Cambodia](https://economictimes.indiatimes.com/jobs/mid-career/the-man-who-escaped-the-scam-rings-of-cambodia/articleshow/110626511.cms) (1 May 2024) \\[Paywalled\\] > > > > > > Then, there's the story of Sanjeet Yadav from Gopalganj, who found himself in an even more precarious situation. Literally, from the frying pan into the fire. Promised a job as a safety in-charge, he paid an agent only to be sold to a Pakistani cyber-scam company in Cambodia. After pleading for help from the Indian Embassy, he was eventually rescued by Cambodian police but then spent 50 days in jail. This raises troubling questions: Why wasn't the embassy aware of his detention? Why did it take so long for his situation to come to light? The gaps in embassy support and international cooperation are glaring. AnyTV News: A young man went abroad with great aspirations, became a toy, returned to India and told such a story that everyone was stunned (29 May 2024) \\[removed link/sub filters\\] > > Even before these stories broke, there have been significant developments from Vishakhapatnam and also other locations such as Rourkela. Hundreds of unemployed youths, lured with the promise of jobs in Singapore, ended up trafficked to Cambodia. After revolting against their handlers in Sihanoukville, many reached out to Indian authorities for help. The police in Vishakhapatnam, along with other agencies, [have been working tirelessly](https://www.youtube.com/watch?v=c5X5xVSiFHQ) to rescue these individuals and dismantle the trafficking network. The Ministry of Home Affairs and other agencies have been holding meetings to identify and plug loopholes that enable these scams. This includes addressing the misuse of Indian SIM cards and bank accounts by fraudsters. Despite these efforts, the financial impact is staggering, with Rs 1,750 crore (approximately USD 210 million) lost to scams in just four months of this year, pointing to potential billions in annual losses. **The revelation that the number of Indians trapped in these scams could far exceed the initial estimate of 5,000 is shocking**. The inadequate response from the Ministry of External Affairs' East Asian Division, the embassy and the significant financial losses underline the severity of the crisis. We need to push for better tracking mechanisms, enhanced international cooperation, and more robust measures to rescue and support victims. We need to get our people out from the clutches of these organised crime syndicates. Further reading: * [Cambodia's Scamdemic Crisis Exposes Domestic Failings, and Geopolitical Challenges for India](https://np.reddit.com/r/GeopoliticsIndia/comments/1bihj2a/cambodias_scamdemic_crisis_exposes_domestic/) * [India's Geopolitical Imperative in Cambodia: Combating Southeast Asia's Scamdemic Crisis](https://np.reddit.com/r/GeopoliticsIndia/comments/1c0kdum/indias_geopolitical_imperative_in_cambodia/) * [300 Indians Riot at Jinbei 4 Scam Compound in Sihanoukville, Cambodia](https://np.reddit.com/r/GeopoliticsIndia/comments/1cxvjwf/300_indians_riot_at_jinbei_4_scam_compound_in/) * [Pakistanis Fuel Organized Crime Wave: Indians Kidnapped in Cambodia](https://np.reddit.com/r/GeopoliticsIndia/comments/1d3gbf5/pakistanis_fuel_organized_crime_wave_indians/)",
    "light_cleaned_comments": "Economic Times: The man who escaped the scam rings of Cambodia (1 June 2024) *In a darkened room in the interiors of* [***Cambodia***](https://economictimes.indiatimes.com/topic/Cambodia)*, as blows landed on him, one after another, hour after hour, and jolts of electric shocks burnt through his body, he kept reminding himself what he had learnt in the navy: “Whatever happens to you, whatever pain you are made to go through, bardasht karo (bear it). Wait for your time.” And so he waited.* *In Bengaluru, a software engineer gets a call from a person saying there is a courier in her name, carrying contraband, from Taiwan and that she is under “digital arrest”. In Faridabad, a woman who had been dabbling in stocks for the last couple of years, receives a link on Facebook inviting her to join a WhatsApp group to increase her returns exponentially. In Hyderabad, a retired executive accepts a Facebook friend request from an attractive stranger and gets a message beginning, “Good morning.”* Botcha Sankhar was fed up. For five years, since his 15-year stint in the [**Indian Navy**](https://economictimes.indiatimes.com/news/indian-navy-news) ended in 2018, the Visakhapatnam resident had been trying for a job. He applied to numerous companies, attended job fairs for ex-servicemen and, to upskill himself, the former chef completed courses such as fire and safety. But each time, he went up against a wall. “They would ask me what experience I had in fire and safety, discounting my navy experience. Or, there would be 2,000 ex-servicemen applying for 10 jobs. Or, they would judge me on the basis of my caste,” says Sankhar, who belongs to Relli, a scheduled caste in Andhra Pradesh. Dressed in a collared t-shirt and jogger pants, with a cap pulled down to his forehead, the 41-year-old speaks deliberately. In desperation, he paid Rs 6 lakh to an acquaintance who promised him a job in the dockyard. However, that too came to naught, as did an attempt to go to Poland. That’s when a relative approached him with an opportunity—a job in Singapore, either as a fire and safety officer or a data entry operator for a good salary. For that, he says, he coughed up Rs 3 lakh to an agent and a sub-agent. In May 2023, a month before his son’s ninth birthday, Sankhar boarded a flight to Bangkok, hopeful that his search was finally succeeding, which would also help repair strained relations at home. It was only on landing in Thailand that he realised the ticket for his connecting flight was to Cambodia, not Singapore. He immediately called his acquaintance, N Tirumala. “He told me not to worry and to take the flight to Cambodia since he was already there,” says Sankhar. From the airport in Phnom Penh, the capital of Cambodia, he was taken to an office, where he was made to do a typing test. The first day, he says, he did the rounds of six companies and, on the second, about 10 companies until, finally, he was told he was selected. In the “office”, he recalls, there were people from various Indian states and other South Asian countries, all seated around terminals, with desktops and phones. After several days, Sankhar was assigned his task: to create fake profiles of women on Facebook which would be linked to fake email IDs and numbers Unknown to him, Sankhar had been sold to the company by his agent. He was now one of the thousands of workers who are illegally trafficked to [**Southeast Asia**](https://economictimes.indiatimes.com/topic/Southeast-Asia)’s “scam compounds” to perpetrate [**cyber fraud**](https://economictimes.indiatimes.com/topic/cyber-fraud) to the tune of billions of dollars. Workers’ passports would be confiscated soon after arrival. They work under duress, often on their countrymen and women back home— a new form of slavery."
}