{
    "id": "1fgff22",
    "title": "Shocking ₹16K Repair Estimate Rejected for Galaxy Watch 4 – OneAssist Blames Liquid Damage Without Proof!",
    "url": "https://www.reddit.com/gallery/1fgff22",
    "selftext": "I bought my Samsung Galaxy Watch 4 in September 2022 during Flipkart's BBD Sale for ₹8K and also purchased a OneAssist 1-year extended warranty for ₹300. One night after a workout, I put my watch on overnight charge. The next morning, when I put it on, I noticed an orange screen with a burn-in of the timestamp. I raised a repair request through the OneAssist app, and the pickup took 7 days. Two days after the pickup, I received a repair estimate of ₹16K.Yesterday, a OneAssist representative called and informed me that the damage was due to liquid inside the watch, which violates their policy, so they would not be able to repair it. They mentioned they would return the watch to me. When I asked for an official Samsung report as proof of liquid damage, I received no response from their customer care team via call, chat support, or email. All they said was that the service center found liquid damage, but they are not sharing the report. In the last six months, I have never exposed the watch to water—only sweat during workouts—and the watch is supposed to be water-resistant. Except screen all features are working as i am able to use them from samsung health app.\n\nWhat should I do?",
    "flair": "Rant / Vent",
    "score": 65,
    "num_comments": 42,
    "created_utc": 1726293241.0,
    "convurl": "https://i.redd.it/2clfk7l3spod1.jpg",
    "comments": [
        "lol The watch is IP68 water resistant meaning you can swim with it. Indian service quality is a joke",
        "I will take the watch to 2 other samsung service centres for confirmation 🧐",
        "A water proof device showing water damage is failure of water proofing which is what they should be fixing or ideally replacing with a new watch",
        "consumer court 🗣️🗣️🗣️",
        "Luckily my dad is a lawyer 🫣",
        "I smell money honey 🌚",
        "amazing \n\nmake sure they regret doing that",
        "I have seen a similar complaint on reddit that after placing the watch on charge the person got a blue screen with time stamp burn in.",
        "Water damage isn't covered under warranty for phones or smartwatches. Also IP rating doesn't mean the device is water proof,  it means water resistant under certain conditions which also deteriorate over time",
        "Same thing happened to mine, mostly sweat, took up 2 different service centres, same reply. Ditched Samsung watch and Samsung phone, bought an iPhone.",
        "I know over time water resistive degrades but only 2 year use and it's not even sweat resistant doesn't justify",
        "I had an Apple Watch 7 replaced under warranty due to water damage in shallow water (swimming pool). There’s some sort of indicator inside alongside the one for water exposure which shows if the watch was under water for a long time. This was not in India so your mileage may vary.",
        "Damn. You can just get a new Galaxy Watch 4. It's been selling at 10k on Amazon for a long time afaik",
        "Got for ₹8k 2 years back with bank discount. I am also shocked by the ₹16k estimate for screen replacement.",
        "It's not, that is a misconception. 5ATM is just good for washing hands or a shower with he watch. it'll go bust if you take it for a swim.",
        "OneAssisst is a joke. I got an exactly similar message from them for my laptop in 2018. And they 30 days to return it without repairing it. Best to not spend on insurance at all than to deal with these guys.",
        "Every time I ask for proof they assure me to send me via mail but haven't received any mail from them till now asked 4 times for proof but no response.",
        "So it means samsung repair is also expensive like apple?",
        "Why not avail samsung care plan instead. Samsung watches are fragile as hell. Indian insurance are scams",
        "I don't think samsung watches are entirely waterproof by default. There is a watch water lock mode which has to be activated when using in water. Once it's turned off a new water eject mode follows, implying water does get in when using.",
        "Expensive as hell",
        "Well its cheaper in hindsight compared to 16k. I fell into the same trap before when my galaxy 6 dropped from half a meter height and cracked in two months. Now i don't risk it.",
        "Had installed spigen case and guard hell they are worthfull than 3800 samsung accidental and liquid damage for ₹8k watch",
        "While I am sorry your watch died due to sweat, water damage not covered under warranty is a quite common disclaimer for even the IP*8 rated electronic devices on the market. \n\n>What should I do?\nYour best bet is to go to other service centers and maybe you'll luck out if a tech doesn't check the water detection sticker on opening the watch.",
        "The only damage to the watch is orange & burned-in screen, but OneAssist has not provided any proof or documentation, such as a Samsung report, showing water damage. I have seen similar issues discussed in forums, where a user's watch experienced overheating after charging, resulting in a blue screen with burn-in. Their device was replaced by Samsung abroad.\nSame issue on samsung forum [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854)\n\nOn reddit also i have seen 15-20 user reporting same",
        "what the fuck then why do they have swimming as an option in the workout menu, i have been swimming with that exact watch for a year or so",
        "Same issue on samsung forum attached only 5 [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854)\n\nOn reddit also i have seen 15-20 user reporting same",
        "\nSame issue on samsung forum attached only 5 [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854)\n\nOn reddit also i have seen 15-20 user reporting same",
        "I was kinda always sure that all this extended warranty plans are just gimmick\n\nThey will always find a way to reject claim\n\nMost common go to reason would be - liquid inside, physical damage\n\nEven if that physical damage was years back and has nothing to do with issue at hand, claim will be rejected.",
        "This time samsung is hiding something as other watch users are reporting the same issue on their own forum  [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854)",
        "Its more like a manufacturing defect. My friend also faced exactly the same issue. He posted on GalaxyWatch sub. Lot of people are facing the same.",
        "Did the workout involve swimming?",
        "Walk/running only",
        "I doubt samsung is gonna do anything about it.. there has to be some kinda case done after proper issue finding",
        "Aren’t they waterproof or ip rated something like that.\n\nAlso something similar happened to me, I ordered a phone with my nickname…. And now at the time of extended warranty claim they asking for ID or dual name affidavit….like bro you serious",
        "Apparently it's a device that they are terming as liquid damage had attached different samsung forum articles in comments with users facing the same issue.\nYou can easily get an affidavit that will cost under ₹200(₹10 stamp paper ₹50 typist ₹100 notary sign) just visit any notary in your local jurisdiction.",
        "Thanks",
        "Ah understood.  So there’s a chance it’s not water damaged. Well I hope it works out for you 👍",
        "Update: oneassist shared samsung estimate but no water damage proof in estimate samsung engineer have found case,PBA(printed board assembly), battery, screen, screw to be replaced basically whole watch except strap when i submitted watch case was fine attached proof via claiming extended warranty PBA working fine as it's was recorded every activity and was able to receive call on watch. \nHave asked them for water damage proof??",
        "It's definitely not water damage. The same thing happened with my mother's Galaxy Watch 4 (44mm) when she had put it for charging overnight. My dad noticed it, thought it was some simple issue, and put his own Galaxy Watch 4 (44mm) on charge, but the same thing happened after a while. Now, I have two dead watches. When I took them to the Samsung service center, they told me I'd have to replace the entire module for 6,000 INR each. Both watches are now sitting dead in my office. I concluded that this might have happened due to faulty charger.\n\nhttps://preview.redd.it/8tkz7ppuplpd1.jpeg?width=899&format=pjpg&auto=webp&s=baf8e2c2ce6c3ef68d27280b7e6e4d9f4e69383b",
        "It's definitely not water damage. The same thing happened with my mother's Galaxy Watch 4 (44mm) when she had put it for charging overnight. My dad noticed it, thought it was some simple issue, and put his own Galaxy Watch 4 (44mm) on charge, but the same thing happened after a while. Now, I have two dead watches. When I took them to the Samsung service center, they told me I'd have to replace the entire module for 6,000 INR each. Both watches are now sitting dead in my office. I concluded that this might have happened due to a faulty charger.\n\nhttps://preview.redd.it/q9f99qpvqlpd1.jpeg?width=899&format=pjpg&auto=webp&s=440e520234da59ec27f7512e0ffae315a71cb0fc\n\nAlso, notice the same pattern, faded orange display with a white border at the top.",
        "Eventually i bought an extended warranty from oneassist so when they sent my watch to samsung service for repair they mentioned liquid damage being the reason even liquid indicators have not changed the colour and oneassist denied to cover the charges as liquid damage is not covered i sent mail to oneassist with 63 links from samsung community forums all facing same issue stating it as product failure. I am surprised how authorised the service centre gave an estimate with parts to be replaced as screen, battery, case, PBA(printed board assembly) even though my watch can track my activity and working fine except screen\n\nhttps://preview.redd.it/znfc8zbutlpd1.png?width=1080&format=pjpg&auto=webp&s=c6ff80cc906ce9c1772700e0398db950b7ca9995",
        "I felt like the investment on the watch are complete waste. Short life span and no support afterward. Just fooling customers all along."
    ],
    "cleaned_text": "shocking k repair estimate rejected galaxy watch oneassist blames liquid damage without proof bought samsung galaxy watch september flipkarts bbd sale k also purchased oneassist year extended warranty one night workout put watch overnight charge next morning put noticed orange screen burnin timestamp raised repair request oneassist app pickup took days two days pickup received repair estimate kyesterday oneassist representative called informed damage due liquid inside watch violates policy would able repair mentioned would return watch asked official samsung report proof liquid damage received response customer care team via call chat support email said service center found liquid damage sharing report last six months never exposed watch wateronly sweat workoutsand watch supposed waterresistant except screen features working able use samsung health app ",
    "cleaned_title": "shocking k repair estimate rejected galaxy watch oneassist blames liquid damage without proof",
    "cleaned_selftext": "bought samsung galaxy watch september flipkarts bbd sale k also purchased oneassist year extended warranty one night workout put watch overnight charge next morning put noticed orange screen burnin timestamp raised repair request oneassist app pickup took days two days pickup received repair estimate kyesterday oneassist representative called informed damage due liquid inside watch violates policy would able repair mentioned would return watch asked official samsung report proof liquid damage received response customer care team via call chat support email said service center found liquid damage sharing report last six months never exposed watch wateronly sweat workoutsand watch supposed waterresistant except screen features working able use samsung health app",
    "cleaned_comments": "lol watch ip water resistant meaning swim indian service quality joke take watch samsung service centres confirmation water proof device showing water damage failure water proofing fixing ideally replacing new watch consumer court luckily dad lawyer smell money honey amazing make sure regret seen similar complaint reddit placing watch charge person got blue screen time stamp burn water damage isnt covered warranty phones smartwatches also ip rating doesnt mean device water proof means water resistant certain conditions also deteriorate time thing happened mine mostly sweat took different service centres reply ditched samsung watch samsung phone bought iphone know time water resistive degrades year use even sweat resistant doesnt justify apple watch replaced warranty due water damage shallow water swimming pool theres sort indicator inside alongside one water exposure shows watch water long time india mileage may vary damn get new galaxy watch selling k amazon long time afaik got k years back bank discount also shocked k estimate screen replacement misconception atm good washing hands shower watch itll go bust take swim oneassisst joke got exactly similar message laptop days return without repairing best spend insurance deal guys every time ask proof assure send via mail havent received mail till asked times proof response means samsung repair also expensive like apple avail samsung care plan instead samsung watches fragile hell indian insurance scams dont think samsung watches entirely waterproof default watch water lock mode activated using water turned new water eject mode follows implying water get using expensive hell well cheaper hindsight compared k fell trap galaxy dropped half meter height cracked two months dont risk installed spigen case guard hell worthfull samsung accidental liquid damage k watch sorry watch died due sweat water damage covered warranty quite common disclaimer even ip rated electronic devices market best bet go service centers maybe youll luck tech doesnt check water detection sticker opening watch damage watch orange burnedin screen oneassist provided proof documentation samsung report showing water damage seen similar issues discussed forums users watch experienced overheating charging resulting blue screen burnin device replaced samsung abroad issue samsung forum herehttpsrcommunitysamsungcomtwearablesmeugalaxywatchdonadaficoucomatelarosaebrancatdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpswwwgooglecomimgresimgurlhttpsaffrcommunitysamsungcomftfimagefserverpagefimageidfiadaacdfbdfvdvtbnidiasjkmhfiffmvetimgrefurlhttpsaffrcommunitysamsungcomftfwearablesfgalaxywatchclassicpinkdisplayftdpfdociddsuqypizzrmwhitghlensourceshfxfimfmfkgsccbshemabmectrie herehttpsrcommunitysamsungcomtwearablesorangescreenonwatchtdp reddit also seen user reporting fuck swimming option workout menu swimming exact watch year issue samsung forum attached herehttpsrcommunitysamsungcomtwearablesmeugalaxywatchdonadaficoucomatelarosaebrancatdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpswwwgooglecomimgresimgurlhttpsaffrcommunitysamsungcomftfimagefserverpagefimageidfiadaacdfbdfvdvtbnidiasjkmhfiffmvetimgrefurlhttpsaffrcommunitysamsungcomftfwearablesfgalaxywatchclassicpinkdisplayftdpfdociddsuqypizzrmwhitghlensourceshfxfimfmfkgsccbshemabmectrie herehttpsrcommunitysamsungcomtwearablesorangescreenonwatchtdp reddit also seen user reporting issue samsung forum attached herehttpsrcommunitysamsungcomtwearablesmeugalaxywatchdonadaficoucomatelarosaebrancatdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpswwwgooglecomimgresimgurlhttpsaffrcommunitysamsungcomftfimagefserverpagefimageidfiadaacdfbdfvdvtbnidiasjkmhfiffmvetimgrefurlhttpsaffrcommunitysamsungcomftfwearablesfgalaxywatchclassicpinkdisplayftdpfdociddsuqypizzrmwhitghlensourceshfxfimfmfkgsccbshemabmectrie herehttpsrcommunitysamsungcomtwearablesorangescreenonwatchtdp reddit also seen user reporting kinda always sure extended warranty plans gimmick always find way reject claim common go reason would liquid inside physical damage even physical damage years back nothing issue hand claim rejected time samsung hiding something watch users reporting issue forum herehttpsrcommunitysamsungcomtwearablesmeugalaxywatchdonadaficoucomatelarosaebrancatdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpsrcommunitysamsungcomtwearablesgalaxywatchclassicpinkdisplaytdp herehttpswwwgooglecomimgresimgurlhttpsaffrcommunitysamsungcomftfimagefserverpagefimageidfiadaacdfbdfvdvtbnidiasjkmhfiffmvetimgrefurlhttpsaffrcommunitysamsungcomftfwearablesfgalaxywatchclassicpinkdisplayftdpfdociddsuqypizzrmwhitghlensourceshfxfimfmfkgsccbshemabmectrie herehttpsrcommunitysamsungcomtwearablesorangescreenonwatchtdp like manufacturing defect friend also faced exactly issue posted galaxywatch sub lot people facing workout involve swimming walkrunning doubt samsung gon na anything kinda case done proper issue finding arent waterproof ip rated something like also something similar happened ordered phone nickname time extended warranty claim asking id dual name affidavitlike bro serious apparently device terming liquid damage attached different samsung forum articles comments users facing issue easily get affidavit cost stamp paper typist notary sign visit notary local jurisdiction thanks ah understood theres chance water damaged well hope works update oneassist shared samsung estimate water damage proof estimate samsung engineer found casepbaprinted board assembly battery screen screw replaced basically whole watch except strap submitted watch case fine attached proof via claiming extended warranty pba working fine recorded every activity able receive call watch asked water damage proof definitely water damage thing happened mothers galaxy watch mm put charging overnight dad noticed thought simple issue put galaxy watch mm charge thing happened two dead watches took samsung service center told id replace entire module inr watches sitting dead office concluded might happened due faulty charger definitely water damage thing happened mothers galaxy watch mm put charging overnight dad noticed thought simple issue put galaxy watch mm charge thing happened two dead watches took samsung service center told id replace entire module inr watches sitting dead office concluded might happened due faulty charger also notice pattern faded orange display white border top eventually bought extended warranty oneassist sent watch samsung service repair mentioned liquid damage reason even liquid indicators changed colour oneassist denied cover charges liquid damage covered sent mail oneassist links samsung community forums facing issue stating product failure surprised authorised service centre gave estimate parts replaced screen battery case pbaprinted board assembly even though watch track activity working fine except screen felt like investment watch complete waste short life span support afterward fooling customers along",
    "light_cleaned_title": "Shocking ₹16K Repair Estimate Rejected for Galaxy Watch 4 – OneAssist Blames Liquid Damage Without Proof!",
    "light_cleaned_selftext": "I bought my Samsung Galaxy Watch 4 in September 2022 during Flipkart's BBD Sale for ₹8K and also purchased a OneAssist 1-year extended warranty for ₹300. One night after a workout, I put my watch on overnight charge. The next morning, when I put it on, I noticed an orange screen with a burn-in of the timestamp. I raised a repair request through the OneAssist app, and the pickup took 7 days. Two days after the pickup, I received a repair estimate of ₹16K.Yesterday, a OneAssist representative called and informed me that the damage was due to liquid inside the watch, which violates their policy, so they would not be able to repair it. They mentioned they would return the watch to me. When I asked for an official Samsung report as proof of liquid damage, I received no response from their customer care team via call, chat support, or email. All they said was that the service center found liquid damage, but they are not sharing the report. In the last six months, I have never exposed the watch to water—only sweat during workouts—and the watch is supposed to be water-resistant. Except screen all features are working as i am able to use them from samsung health app. What should I do?",
    "light_cleaned_comments": "lol The watch is IP68 water resistant meaning you can swim with it. Indian service quality is a joke I will take the watch to 2 other samsung service centres for confirmation 🧐 A water proof device showing water damage is failure of water proofing which is what they should be fixing or ideally replacing with a new watch consumer court 🗣️🗣️🗣️ Luckily my dad is a lawyer 🫣 I smell money honey 🌚 amazing make sure they regret doing that I have seen a similar complaint on reddit that after placing the watch on charge the person got a blue screen with time stamp burn in. Water damage isn't covered under warranty for phones or smartwatches. Also IP rating doesn't mean the device is water proof, it means water resistant under certain conditions which also deteriorate over time Same thing happened to mine, mostly sweat, took up 2 different service centres, same reply. Ditched Samsung watch and Samsung phone, bought an iPhone. I know over time water resistive degrades but only 2 year use and it's not even sweat resistant doesn't justify I had an Apple Watch 7 replaced under warranty due to water damage in shallow water (swimming pool). There’s some sort of indicator inside alongside the one for water exposure which shows if the watch was under water for a long time. This was not in India so your mileage may vary. Damn. You can just get a new Galaxy Watch 4. It's been selling at 10k on Amazon for a long time afaik Got for ₹8k 2 years back with bank discount. I am also shocked by the ₹16k estimate for screen replacement. It's not, that is a misconception. 5ATM is just good for washing hands or a shower with he watch. it'll go bust if you take it for a swim. OneAssisst is a joke. I got an exactly similar message from them for my laptop in 2018. And they 30 days to return it without repairing it. Best to not spend on insurance at all than to deal with these guys. Every time I ask for proof they assure me to send me via mail but haven't received any mail from them till now asked 4 times for proof but no response. So it means samsung repair is also expensive like apple? Why not avail samsung care plan instead. Samsung watches are fragile as hell. Indian insurance are scams I don't think samsung watches are entirely waterproof by default. There is a watch water lock mode which has to be activated when using in water. Once it's turned off a new water eject mode follows, implying water does get in when using. Expensive as hell Well its cheaper in hindsight compared to 16k. I fell into the same trap before when my galaxy 6 dropped from half a meter height and cracked in two months. Now i don't risk it. Had installed spigen case and guard hell they are worthfull than 3800 samsung accidental and liquid damage for ₹8k watch While I am sorry your watch died due to sweat, water damage not covered under warranty is a quite common disclaimer for even the IP*8 rated electronic devices on the market. >What should I do? Your best bet is to go to other service centers and maybe you'll luck out if a tech doesn't check the water detection sticker on opening the watch. The only damage to the watch is orange & burned-in screen, but OneAssist has not provided any proof or documentation, such as a Samsung report, showing water damage. I have seen similar issues discussed in forums, where a user's watch experienced overheating after charging, resulting in a blue screen with burn-in. Their device was replaced by Samsung abroad. Same issue on samsung forum [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854) On reddit also i have seen 15-20 user reporting same what the fuck then why do they have swimming as an option in the workout menu, i have been swimming with that exact watch for a year or so Same issue on samsung forum attached only 5 [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854) On reddit also i have seen 15-20 user reporting same Same issue on samsung forum attached only 5 [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854) On reddit also i have seen 15-20 user reporting same I was kinda always sure that all this extended warranty plans are just gimmick They will always find a way to reject claim Most common go to reason would be - liquid inside, physical damage Even if that physical damage was years back and has nothing to do with issue at hand, claim will be rejected. This time samsung is hiding something as other watch users are reporting the same issue on their own forum [here](https://r1.community.samsung.com/t5/wearables/meu-galaxy-watch-4-do-nada-ficou-com-a-tela-rosa-e-branca/td-p/27020720) [here2](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here3](https://r2.community.samsung.com/t5/Wearables/Galaxy-watch-4-classic-Pink-Display/td-p/14546290) [here4](https://www.google.com/imgres?imgurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F3965242iAD0AA2C45D430FBD%3Fv%3Dv2&tbnid=iAsj8Km8HFIfFM&vet=1&imgrefurl=https%3A%2F%2Fr2.community.samsung.com%2Ft5%2FWearables%2FGalaxy-watch-4-classic-Pink-Display%2Ftd-p%2F14546290&docid=DsuQy6Piz07zrM&w=1126&h=2000&itg=1&hl=en&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=c4c963749970670b&shem=abme%2Ctrie) [here5](https://r2.community.samsung.com/t5/Wearables/Orange-Screen-on-Watch4/td-p/14333854) Its more like a manufacturing defect. My friend also faced exactly the same issue. He posted on GalaxyWatch sub. Lot of people are facing the same. Did the workout involve swimming? Walk/running only I doubt samsung is gonna do anything about it.. there has to be some kinda case done after proper issue finding Aren’t they waterproof or ip rated something like that. Also something similar happened to me, I ordered a phone with my nickname…. And now at the time of extended warranty claim they asking for ID or dual name affidavit….like bro you serious Apparently it's a device that they are terming as liquid damage had attached different samsung forum articles in comments with users facing the same issue. You can easily get an affidavit that will cost under ₹200(₹10 stamp paper ₹50 typist ₹100 notary sign) just visit any notary in your local jurisdiction. Thanks Ah understood. So there’s a chance it’s not water damaged. Well I hope it works out for you 👍 Update: oneassist shared samsung estimate but no water damage proof in estimate samsung engineer have found case,PBA(printed board assembly), battery, screen, screw to be replaced basically whole watch except strap when i submitted watch case was fine attached proof via claiming extended warranty PBA working fine as it's was recorded every activity and was able to receive call on watch. Have asked them for water damage proof?? It's definitely not water damage. The same thing happened with my mother's Galaxy Watch 4 (44mm) when she had put it for charging overnight. My dad noticed it, thought it was some simple issue, and put his own Galaxy Watch 4 (44mm) on charge, but the same thing happened after a while. Now, I have two dead watches. When I took them to the Samsung service center, they told me I'd have to replace the entire module for 6,000 INR each. Both watches are now sitting dead in my office. I concluded that this might have happened due to faulty charger. It's definitely not water damage. The same thing happened with my mother's Galaxy Watch 4 (44mm) when she had put it for charging overnight. My dad noticed it, thought it was some simple issue, and put his own Galaxy Watch 4 (44mm) on charge, but the same thing happened after a while. Now, I have two dead watches. When I took them to the Samsung service center, they told me I'd have to replace the entire module for 6,000 INR each. Both watches are now sitting dead in my office. I concluded that this might have happened due to a faulty charger. Also, notice the same pattern, faded orange display with a white border at the top. Eventually i bought an extended warranty from oneassist so when they sent my watch to samsung service for repair they mentioned liquid damage being the reason even liquid indicators have not changed the colour and oneassist denied to cover the charges as liquid damage is not covered i sent mail to oneassist with 63 links from samsung community forums all facing same issue stating it as product failure. I am surprised how authorised the service centre gave an estimate with parts to be replaced as screen, battery, case, PBA(printed board assembly) even though my watch can track my activity and working fine except screen I felt like the investment on the watch are complete waste. Short life span and no support afterward. Just fooling customers all along."
}