{
    "id": "1hj86sr",
    "title": "Jio's hired unofficial agents won't spamming me with calls, lowkey threatening me to recharge.",
    "url": "https://www.reddit.com/gallery/1hj86sr",
    "selftext": "These so-called Jio agents are blowing up my phone DAILY, threatening and forcing me to recharge even tho it's only been 15 days since my last recharge expired.\nI’ve blocked every damn number, but they keep calling from new numbers.\n\nThis harassment is straight up ruining my peace of mind. How tf is this even allowed?\nShouldn't it be illegal?\n\nHow do I make these a$$holes stop?????\n",
    "flair": "Rant / Vent",
    "score": 14,
    "num_comments": 14,
    "created_utc": 1734781239.0,
    "convurl": "https://i.redd.it/4tkpm68av68e1.jpg",
    "comments": [
        "I am outside India and most of the times I disable my Jio sim and enable it only when I need it for OTPs. As I was not reachable they called my father (he’s my alternate contact when I bought the sim years ago) to let me know to recharge even though I have an yearly international roaming pack already active. I just feel it’s a new low for any company.",
        "I disabled the sim. No longer using",
        "Literally the same number of calls I've got today",
        "Kareeb 1 mahina preshan krte hai, fir nhi. \n\nMne Sept se recharge hi nhi karaya, to Oct tk preshan kiya Roz, pr ab Roz Kejriwal mc phone krta hai.",
        "I haven't recharged for over a year. No calls anymore",
        "same problem i am just not picking unknown numbers anymore or declining them right away",
        "It's an automated msg correct? What seems to be the issue",
        "Bhai threatening tho zada hogaya thoda..",
        "I'm doing the same now.. Blocking them right away",
        "That's insaneee😭 \nThese clowns seriously have nothing better to do.",
        "Ikr!! At this point, I won't be surprised if they say we know where you live, recharge now. 😭",
        "It's not automated bro, just a bunch of rude AF idiots talking unprofessionally, and they’re not even legit.",
        "Ah, peace",
        "Wait jio hires call centres to call you when it's time to recharge brooo"
    ],
    "cleaned_text": "jios hired unofficial agents wont spamming calls lowkey threatening recharge socalled jio agents blowing phone daily threatening forcing recharge even tho days since last recharge expired ive blocked every damn number keep calling new numbers harassment straight ruining peace mind tf even allowed shouldnt illegal make aholes stop ",
    "cleaned_title": "jios hired unofficial agents wont spamming calls lowkey threatening recharge",
    "cleaned_selftext": "socalled jio agents blowing phone daily threatening forcing recharge even tho days since last recharge expired ive blocked every damn number keep calling new numbers harassment straight ruining peace mind tf even allowed shouldnt illegal make aholes stop",
    "cleaned_comments": "outside india times disable jio sim enable need otps reachable called father hes alternate contact bought sim years ago let know recharge even though yearly international roaming pack already active feel new low company disabled sim longer using literally number calls ive got today kareeb mahina preshan krte hai fir nhi mne sept se recharge hi nhi karaya oct tk preshan kiya roz pr ab roz kejriwal mc phone krta hai havent recharged year calls anymore problem picking unknown numbers anymore declining right away automated msg correct seems issue bhai threatening tho zada hogaya thoda im blocking right away thats insaneee clowns seriously nothing better ikr point wont surprised say know live recharge automated bro bunch rude af idiots talking unprofessionally theyre even legit ah peace wait jio hires call centres call time recharge brooo",
    "light_cleaned_title": "Jio's hired unofficial agents won't spamming me with calls, lowkey threatening me to recharge.",
    "light_cleaned_selftext": "These so-called Jio agents are blowing up my phone DAILY, threatening and forcing me to recharge even tho it's only been 15 days since my last recharge expired. I’ve blocked every damn number, but they keep calling from new numbers. This harassment is straight up ruining my peace of mind. How tf is this even allowed? Shouldn't it be illegal? How do I make these a$$holes stop?????",
    "light_cleaned_comments": "I am outside India and most of the times I disable my Jio sim and enable it only when I need it for OTPs. As I was not reachable they called my father (he’s my alternate contact when I bought the sim years ago) to let me know to recharge even though I have an yearly international roaming pack already active. I just feel it’s a new low for any company. I disabled the sim. No longer using Literally the same number of calls I've got today Kareeb 1 mahina preshan krte hai, fir nhi. Mne Sept se recharge hi nhi karaya, to Oct tk preshan kiya Roz, pr ab Roz Kejriwal mc phone krta hai. I haven't recharged for over a year. No calls anymore same problem i am just not picking unknown numbers anymore or declining them right away It's an automated msg correct? What seems to be the issue Bhai threatening tho zada hogaya thoda.. I'm doing the same now.. Blocking them right away That's insaneee😭 These clowns seriously have nothing better to do. Ikr!! At this point, I won't be surprised if they say we know where you live, recharge now. 😭 It's not automated bro, just a bunch of rude AF idiots talking unprofessionally, and they’re not even legit. Ah, peace Wait jio hires call centres to call you when it's time to recharge brooo"
}