{
    "id": "16oav3z",
    "title": "Has anyone ordered car wheel or car alloy watches from Alibaba?",
    "url": "https://www.reddit.com/gallery/16oav3z",
    "selftext": "I was recently scrolling through Instagram and came across an account selling car wheel watches, Instragram name : TOCG Watches for 8000 INR and RSChrono Watches for the same price. When I searched on Google, I found the same watches on Alibaba for 5-10 bucks, and they even showed me the watches in a live video call.\n\nI'm curious if anyone here has ordered similar watches from Alibaba. I have some doubts about the authenticity and quality. Is it possible to import these watches in bulk and sell them for a lower cost in India?\n\nAlso, does anyone know if TOCG Watches and RSChrono Watches originate from China? Any insights would be appreciated!\n\n\n#watch",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695286767.0,
    "convurl": "https://i.redd.it/qcby5doxpkpb1.jpg",
    "comments": [
        "Aren't these websites banned?",
        "You can get a decent gshock that will last you 10 years easily for this money."
    ],
    "cleaned_text": "anyone ordered car wheel car alloy watches alibaba recently scrolling instagram came across account selling car wheel watches instragram name tocg watches inr rschrono watches price searched google found watches alibaba bucks even showed watches live video call im curious anyone ordered similar watches alibaba doubts authenticity quality possible import watches bulk sell lower cost india also anyone know tocg watches rschrono watches originate china insights would appreciated watch ",
    "cleaned_title": "anyone ordered car wheel car alloy watches alibaba",
    "cleaned_selftext": "recently scrolling instagram came across account selling car wheel watches instragram name tocg watches inr rschrono watches price searched google found watches alibaba bucks even showed watches live video call im curious anyone ordered similar watches alibaba doubts authenticity quality possible import watches bulk sell lower cost india also anyone know tocg watches rschrono watches originate china insights would appreciated watch",
    "cleaned_comments": "arent websites banned get decent gshock last years easily money",
    "light_cleaned_title": "Has anyone ordered car wheel or car alloy watches from Alibaba?",
    "light_cleaned_selftext": "I was recently scrolling through Instagram and came across an account selling car wheel watches, Instragram name : TOCG Watches for 8000 INR and RSChrono Watches for the same price. When I searched on Google, I found the same watches on Alibaba for 5-10 bucks, and they even showed me the watches in a live video call. I'm curious if anyone here has ordered similar watches from Alibaba. I have some doubts about the authenticity and quality. Is it possible to import these watches in bulk and sell them for a lower cost in India? Also, does anyone know if TOCG Watches and RSChrono Watches originate from China? Any insights would be appreciated! #watch",
    "light_cleaned_comments": "Aren't these websites banned? You can get a decent gshock that will last you 10 years easily for this money."
}