{
    "id": "16iirh4",
    "title": "How did Modi manage to get so much of the media on his side?",
    "url": "https://www.reddit.com/r/india/comments/16iirh4/how_did_modi_manage_to_get_so_much_of_the_media/",
    "selftext": "Most of you know what Godi media is. But how did Modi manage to sway them to begin with? Call me stupid but I actually used to like WION but I always found their lack of coverage of domestic issues in India and complete lack of any kind of content that made the government look bad to really push me the wrong way. So anyway, did Modi manage to play his cards right, is Godi media in his pockets or is he genuinely liked by them? From what I understand, the BJP has a large media budget and spent over a quarter of a million a day in 2021 according to [TIME](https://www.deccanherald.com/india/modi-govt-spent-over-rs-700-crore-on-advertisements-in-2019-20-reveals-rti-reply-909571.html). Wikipedia doesn't tell me much from the Godi media article but from what I read Modi's rise to power coincided with the reorganization of a lot of India's news institution editorial authorities. And that the previous generation of journalists who worked during the terms of previous government were more liberal leaning over the BJP's ideology",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694698724.0,
    "convurl": "https://external-preview.redd.it/mm78FlxBTfMH_nznj5VBpl76D-OBthQre2r50sdi25E.jpg?auto=webp&s=0abfbf17472a513be529590155f2286aabbb662e",
    "comments": [
        "In Telugu we say \"nayaano, bhayaano, pani jaripinchaadu\" which translates roughly to \"by well means or ill means, he got it done\"",
        "Through TV Ads",
        "TV18 network is owned by adani. Zee media is owned by Subhash Chandra who is a BJP MP. These are two major media houses in a country which comprises more than 70% news channels",
        "He ate the carrot and kept the stick.",
        "By hook or by crook, as simple as that.",
        "Money!",
        "... and by scaring with CBI and ED etc.",
        "Crony-capitalism , you help a poor millionaire get business and he'll help you back...",
        "The same people who own the channels, fund the BJP. And the channels gets regular payments. Rest through threatening, ED CBI and IT departments.",
        "Just to correct network18 is onwed by ambani and adani own NDTV",
        "Cult of personality",
        "I will tell you the source of motivation for Modi,\n\nIn an interview (before becoming PM), he said that his biggest mistake in 2002 was that he couldn't control/handle media. (!!)\n\nI can't remember with whom the interview was, if someone remember please share.",
        "The oldest method in the world of managing human behavior: The Stick & the Carrot\n\nThe stick - fall in line with what I want or face the wrath of every government agency (ED,CBI,FERA,Police,etc) on both individual & organization level. Case eg. NDTV\n\nThe Carrot: Govt plans over 5000 crores in their advertising budget annually- this is guaranteed money to media houses & their bonuses as long as Modi's face & position is upheld without a second thought. Case e.g All of Godi media.\n\nAt election time, this spending goes two fold or more. So one can imagine the moolah available to these Media houses.",
        "Newslaundry is amazing",
        "Perks of being a prime minister, duh?",
        "How is this a mystery?\n\nExtremely efficient organization.\n\nUntil the opposition learns this, they will lag.",
        "It's not about learning, when MMS was PM, they took advantage of the free press and now when in power they have curtailed it. A free press is a pillar of a democracy. Opposition doesn't have the money neither the power to change this. \n\nAs long as the channels and the papers are bought, there is very little hope of any change. We are living under a soft emergency.",
        "Money bags.",
        "WION was always Godi media just more sophisticated",
        "This [video](https://www.youtube.com/watch?v=-0NtDdchl7s) can be helpful",
        "Historically, media has been left-wing because it was print media, and they recruited from humanities and literature graduates, who are normally leftists critical of power structures. But now media is largely visual and dramatic, and this plays to the right-wing tendencies of sensationalism.\n\nThey are also consciously following the template of Fox news, which became the first news channel to be openly partisan. Every news item was broadcast with an explanation of what is wrong and why you need to be angry about it. Right-wingers flocked to it for their daily dose of outrage. For some of them, it became their only source of news and reality, and they dug deeper into conspiracy theories to insulate their version of reality from the real world.",
        ">We are living under a soft emergency.\n\nTrue true.\n\nThough I disagree that the opposition doesnt have money. They don't have as much but whatever capital they do have is not effectively deployed because of internal differences and lack of cohesion.\n\nWhat they lack is the political will. Everyone knows this but their supporters are not willing to admit it. In any case, let's hope they find their feet lol",
        "$$",
        "I don't call it a soft emergency. They just realized they can do whatever they want under the existing constitution. Just avoid using names forbidden by the constitution, and use \"chronology\" when creating laws.",
        "It's going to end one day. I just hope I am alive for the tell all documentaries.",
        "Zee is owned by a BJP MP. Network18 is owned by Ambani.\nNDTV used to be not pro-Modi, now bought by Adani and turned pro-Modi. And that covers almost all of the TV, Hindi and English Media. \n\nGovernment Advertisement is huge chunk of revenue of Media networks. And not just publicity per se but also information about Tenders, Public Notices etc. etc. That's amounts to a huge amount.",
        "Modi: funded by Adani & Ambani. \n\nMedia: funded by Adani & Ambani. \n\n???",
        "I remember in 2014 \"Abki baar modi sarkar\" ad was being run on all channels and became a catchphrase everywhere. Meanwhile parties like Congress still run preachy ads that the masses would find boring."
    ],
    "cleaned_text": "modi manage get much media side know godi media modi manage sway begin call stupid actually used like wion always found lack coverage domestic issues india complete lack kind content made government look bad really push wrong way anyway modi manage play cards right godi media pockets genuinely liked understand bjp large media budget spent quarter million day according timehttpswwwdeccanheraldcomindiamodigovtspentoverrscroreonadvertisementsinrevealsrtireplyhtml wikipedia doesnt tell much godi media article read modis rise power coincided reorganization lot indias news institution editorial authorities previous generation journalists worked terms previous government liberal leaning bjps ideology ",
    "cleaned_title": "modi manage get much media side",
    "cleaned_selftext": "know godi media modi manage sway begin call stupid actually used like wion always found lack coverage domestic issues india complete lack kind content made government look bad really push wrong way anyway modi manage play cards right godi media pockets genuinely liked understand bjp large media budget spent quarter million day according timehttpswwwdeccanheraldcomindiamodigovtspentoverrscroreonadvertisementsinrevealsrtireplyhtml wikipedia doesnt tell much godi media article read modis rise power coincided reorganization lot indias news institution editorial authorities previous generation journalists worked terms previous government liberal leaning bjps ideology",
    "cleaned_comments": "telugu say nayaano bhayaano pani jaripinchaadu translates roughly well means ill means got done tv ads tv network owned adani zee media owned subhash chandra bjp mp two major media houses country comprises news channels ate carrot kept stick hook crook simple money scaring cbi ed etc cronycapitalism help poor millionaire get business hell help back people channels fund bjp channels gets regular payments rest threatening ed cbi departments correct network onwed ambani adani ndtv cult personality tell source motivation modi interview becoming pm said biggest mistake couldnt controlhandle media cant remember interview someone remember please share oldest method world managing human behavior stick carrot stick fall line want face wrath every government agency edcbiferapoliceetc individual organization level case eg ndtv carrot govt plans crores advertising budget annually guaranteed money media houses bonuses long modis face position upheld without second thought case eg godi media election time spending goes two fold one imagine moolah available media houses newslaundry amazing perks prime minister duh mystery extremely efficient organization opposition learns lag learning mms pm took advantage free press power curtailed free press pillar democracy opposition doesnt money neither power change long channels papers bought little hope change living soft emergency money bags wion always godi media sophisticated videohttpswwwyoutubecomwatchvntddchls helpful historically media leftwing print media recruited humanities literature graduates normally leftists critical power structures media largely visual dramatic plays rightwing tendencies sensationalism also consciously following template fox news became first news channel openly partisan every news item broadcast explanation wrong need angry rightwingers flocked daily dose outrage became source news reality dug deeper conspiracy theories insulate version reality real world living soft emergency true true though disagree opposition doesnt money dont much whatever capital effectively deployed internal differences lack cohesion lack political everyone knows supporters willing admit case lets hope find feet lol dont call soft emergency realized whatever want existing constitution avoid using names forbidden constitution use chronology creating laws going end one day hope alive tell documentaries zee owned bjp mp network owned ambani ndtv used promodi bought adani turned promodi covers almost tv hindi english media government advertisement huge chunk revenue media networks publicity per se also information tenders public notices etc etc thats amounts huge amount modi funded adani ambani media funded adani ambani remember abki baar modi sarkar ad run channels became catchphrase everywhere meanwhile parties like congress still run preachy ads masses would find boring",
    "light_cleaned_title": "How did Modi manage to get so much of the media on his side?",
    "light_cleaned_selftext": "Most of you know what Godi media is. But how did Modi manage to sway them to begin with? Call me stupid but I actually used to like WION but I always found their lack of coverage of domestic issues in India and complete lack of any kind of content that made the government look bad to really push me the wrong way. So anyway, did Modi manage to play his cards right, is Godi media in his pockets or is he genuinely liked by them? From what I understand, the BJP has a large media budget and spent over a quarter of a million a day in 2021 according to [TIME](https://www.deccanherald.com/india/modi-govt-spent-over-rs-700-crore-on-advertisements-in-2019-20-reveals-rti-reply-909571.html). Wikipedia doesn't tell me much from the Godi media article but from what I read Modi's rise to power coincided with the reorganization of a lot of India's news institution editorial authorities. And that the previous generation of journalists who worked during the terms of previous government were more liberal leaning over the BJP's ideology",
    "light_cleaned_comments": "In Telugu we say \"nayaano, bhayaano, pani jaripinchaadu\" which translates roughly to \"by well means or ill means, he got it done\" Through TV Ads TV18 network is owned by adani. Zee media is owned by Subhash Chandra who is a BJP MP. These are two major media houses in a country which comprises more than 70% news channels He ate the carrot and kept the stick. By hook or by crook, as simple as that. Money! ... and by scaring with CBI and ED etc. Crony-capitalism , you help a poor millionaire get business and he'll help you back... The same people who own the channels, fund the BJP. And the channels gets regular payments. Rest through threatening, ED CBI and IT departments. Just to correct network18 is onwed by ambani and adani own NDTV Cult of personality I will tell you the source of motivation for Modi, In an interview (before becoming PM), he said that his biggest mistake in 2002 was that he couldn't control/handle media. (!!) I can't remember with whom the interview was, if someone remember please share. The oldest method in the world of managing human behavior: The Stick & the Carrot The stick - fall in line with what I want or face the wrath of every government agency (ED,CBI,FERA,Police,etc) on both individual & organization level. Case eg. NDTV The Carrot: Govt plans over 5000 crores in their advertising budget annually- this is guaranteed money to media houses & their bonuses as long as Modi's face & position is upheld without a second thought. Case e.g All of Godi media. At election time, this spending goes two fold or more. So one can imagine the moolah available to these Media houses. Newslaundry is amazing Perks of being a prime minister, duh? How is this a mystery? Extremely efficient organization. Until the opposition learns this, they will lag. It's not about learning, when MMS was PM, they took advantage of the free press and now when in power they have curtailed it. A free press is a pillar of a democracy. Opposition doesn't have the money neither the power to change this. As long as the channels and the papers are bought, there is very little hope of any change. We are living under a soft emergency. Money bags. WION was always Godi media just more sophisticated This [video](https://www.youtube.com/watch?v=-0NtDdchl7s) can be helpful Historically, media has been left-wing because it was print media, and they recruited from humanities and literature graduates, who are normally leftists critical of power structures. But now media is largely visual and dramatic, and this plays to the right-wing tendencies of sensationalism. They are also consciously following the template of Fox news, which became the first news channel to be openly partisan. Every news item was broadcast with an explanation of what is wrong and why you need to be angry about it. Right-wingers flocked to it for their daily dose of outrage. For some of them, it became their only source of news and reality, and they dug deeper into conspiracy theories to insulate their version of reality from the real world. >We are living under a soft emergency. True true. Though I disagree that the opposition doesnt have money. They don't have as much but whatever capital they do have is not effectively deployed because of internal differences and lack of cohesion. What they lack is the political will. Everyone knows this but their supporters are not willing to admit it. In any case, let's hope they find their feet lol $$ I don't call it a soft emergency. They just realized they can do whatever they want under the existing constitution. Just avoid using names forbidden by the constitution, and use \"chronology\" when creating laws. It's going to end one day. I just hope I am alive for the tell all documentaries. Zee is owned by a BJP MP. Network18 is owned by Ambani. NDTV used to be not pro-Modi, now bought by Adani and turned pro-Modi. And that covers almost all of the TV, Hindi and English Media. Government Advertisement is huge chunk of revenue of Media networks. And not just publicity per se but also information about Tenders, Public Notices etc. etc. That's amounts to a huge amount. Modi: funded by Adani & Ambani. Media: funded by Adani & Ambani. ??? I remember in 2014 \"Abki baar modi sarkar\" ad was being run on all channels and became a catchphrase everywhere. Meanwhile parties like Congress still run preachy ads that the masses would find boring."
}