{
    "id": "15doqgw",
    "title": "Hola | Learn Why VPN Providers Are Shutting Down in India. Any suggestions for VPN?",
    "url": "https://hola.org/blog/article/id/945",
    "selftext": "As the title suggested Hola and VPN provider like Nord also removed it's servers from India. This is last year news and seriously I didn't know about it. I was not using any type of VPN for some time so I don't know this had happened. So are you guys still using any type of VPN and how's your experience with it.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1690731926.0,
    "convurl": "https://external-preview.redd.it/36lmguNXbKlAwDGSnmSpqyn3imWfiviAvDt2_lOpggU.jpg?auto=webp&s=6b4e5a9f227376fffdf4bcf3b8a5bf7a7e478066",
    "comments": [
        "Hola among the worst vpn providers should shut down for good everywhere",
        "Proton",
        "Proton",
        "Mulvad",
        "You can use TOR. It's available on Android too",
        "I use surfshark but these days they ask for pan card and local address details when you make the purchase.",
        "expressvpn",
        "Very slow",
        "Data localisation rules",
        "They are just shutting down servers in India you can still connect to singapore and others"
    ],
    "cleaned_text": "hola learn vpn providers shutting india suggestions vpn title suggested hola vpn provider like nord also removed servers india last year news seriously didnt know using type vpn time dont know happened guys still using type vpn hows experience ",
    "cleaned_title": "hola learn vpn providers shutting india suggestions vpn",
    "cleaned_selftext": "title suggested hola vpn provider like nord also removed servers india last year news seriously didnt know using type vpn time dont know happened guys still using type vpn hows experience",
    "cleaned_comments": "hola among worst vpn providers shut good everywhere proton proton mulvad use tor available android use surfshark days ask pan card local address details make purchase expressvpn slow data localisation rules shutting servers india still connect singapore others",
    "light_cleaned_title": "Hola | Learn Why VPN Providers Are Shutting Down in India. Any suggestions for VPN?",
    "light_cleaned_selftext": "As the title suggested Hola and VPN provider like Nord also removed it's servers from India. This is last year news and seriously I didn't know about it. I was not using any type of VPN for some time so I don't know this had happened. So are you guys still using any type of VPN and how's your experience with it.",
    "light_cleaned_comments": "Hola among the worst vpn providers should shut down for good everywhere Proton Proton Mulvad You can use TOR. It's available on Android too I use surfshark but these days they ask for pan card and local address details when you make the purchase. expressvpn Very slow Data localisation rules They are just shutting down servers in India you can still connect to singapore and others"
}