{
    "id": "1b9m7ur",
    "title": "JioCinema has become the data collection app of Jio Group",
    "url": "https://www.reddit.com/gallery/1b9m7ur",
    "selftext": "I was watching India - England Test match on JioCinema and was appalled by the kind of personal questions that were prompted again and again while watching the videos. Many of these questions have nothing to do with the experience app (e.g. \"Do you have a vehicle?\" Or \"What is your educational qualification?\"). All digital companies collect data about their customers, but generally the data is limited to what is directly required by the service, and never I have been asked of such personal information.\n\nFrom the corporations perspective, it is clearly for creating a profile of the user and this information will be used for customized targeting of users on other Jio businesses (e.g. JioMart). Most people don't even understand how this collected data will affect them, so let me explain.\n\nSome ways in which other Jio businesses (e.g. JioMart) can use this information is : \n\n- Differential pricing of products or discounts : Type of vehicle (4/2 wheeler) is a good indicator of the level of income of a person. So a wealtheir person can be given less discounts.\n\n- Recommendations : The landing page of JioMart can be customised to show more expensive / higher margin products first if you fall in the high income category.\n\nAnd many more. So think twice before sharing your personal information with such companies.",
    "flair": "Rant / Vent",
    "score": 181,
    "num_comments": 26,
    "created_utc": 1709899210.0,
    "convurl": "https://i.redd.it/v418pu47o3nc1.jpg",
    "comments": [
        "Just give random info and ruin their data. And for movies, series and music, buy actual blu rays and rip them to a hard drive or just pirate it. These corporations suck!",
        ">All digital companies collect data about their customers, but generally the data is limited to what is directly required by the service,\n\nI have some bad news for you mate... \n\nIf you don't like the qns, just click on the 'x' above it. They are asking this to personalise their ad recommendations. Other companies do it as well but they don't ask. They just take data from your search history, the apps you have on your phone, your app usage statistics, etc etc. These services are 'free' because you are the product. \n\n>Differential pricing of products or discounts\n\nIs that even legal? \n\n>Recommendations\n\naka personalised ads. It's what reddit does. It's what google does. When you open youtube, your recommendations are there on the front page. When something is free, you automatically become the product.\n\nI wish we had better laws to restrict companies stealing data though.",
        "They are creating audience data for re targeting campaigns. Once they have enough data, they can run campaigns across social media and search, to target you based on your interest. Also use the audience data to create look like audience which means those users who are not on the Jio platform but have similar choices are their current audience",
        "When something is free,obviously you are being traded. \n\nEvery corporation is doing this.\n\n A few years ago a woman bearing a Jio id card came to my home saying they were authorized by the government to collect data. The questions were too intrusive like vehicles owned and models of mobiles used. I had to politely ask her to leave. She argued with me instead of leaving saying that she will report to government.",
        "When something is free and closed source and requires an active internet connection, they you are the product. There a lot of open source applications and services which respect your privacy. In terms of browsers - Brave Browser, Librewolf (Fork of Firefox). For Search Engines - DuckDuckGo or Brave Search. For Email, Cloud Storage and Calendar - Proton Ecosystem. There's lot more.",
        "Ya ik. These companies are not actively looking to expand a lot and earn a lot of money. There lies the difference between Google or jio and duckduckgo. When it's free, you become the product. At this point Instagram knows you better than your family members it seems. The amount of data collected is insane.",
        "Install a PiHole on your network and you’ll limit a lot of telemetry and data collection plus block phishing websites. Combine that with uBlock Origin on a browser (preferably Librewolf on desktop and Brave on android and Safari on iOS with Adguard Extension).\n\nAlternatives to streaming services is just buying actual DVDs and ripping them or pirating them. When you stream you don’t have ownership. They can remove stuff whenever they want. Spotify recently had a lot of licensing issues and a lot of songs went off Spotify.",
        "Going to switch to Bluray. Any recommendations on where to buy apart from Amazon?",
        "PIRATE",
        "They also use the same data for Reliance Digital and other sub companies too, it makes a free database for them instead of buying.",
        "Unless the place where you live has a dvd shop, amazon, flipkart or ebay are your options.",
        "Ship has sailed the sea all thanks to corporations.",
        "Lmao. They can do nothing. In fact actual government employees of NSO do on ground surveys and they have no recourse when people refuse to answer.",
        "Glad I got a VPN. There's some good sports streaming sites out there. \n\n\nPirating static stuff is very easy. Live sports is what made paying for streaming worthwhile.",
        "The questions started normally but it got more and more intrusive. I am sure she might have scared a lot of innocent people and got whatever data they wanted.",
        "The questions started normally but it got more and more intrusive. I am sure she might have scared a lot of innocent people and got whatever data they wanted.",
        "OP thinks he is seeing match for free. 🤡",
        "Qbit torrent... Its amazing you can buy here (for free)",
        "just follow r/Piracy all my homies hate reliance",
        "Lolzz as if other companies like Amazon are not always listening to whatever you’re saying. This is quite tame of them to ask",
        "Are bhai election aa rahe farz to nibhana parega naa",
        "If you're still using Reliance products I don't know what to tell you",
        "When everything is free then you are the one who is sold 🙂.",
        "Nothing is free",
        "If something is for free, then you are the product.",
        "Not supporting Reliance here, but I am glad they are actually \"asking\". \n\nMost firms just \"steal\".",
        "Can you dm me some good torrent websites for movies? These days pirate bay and other torrents websites are not working.",
        "Use qbit inbuilt search - no need to visit sites or use vpn. You'll need install plugins for popular torrent sites. The process is quite simple, just Google how to use qbittorrent search.",
        "I don’t watch much on jio but when I do and get such questions then I give wrong answers only."
    ],
    "cleaned_text": "jiocinema become data collection app jio group watching india england test match jiocinema appalled kind personal questions prompted watching videos many questions nothing experience app eg vehicle educational qualification digital companies collect data customers generally data limited directly required service never asked personal information corporations perspective clearly creating profile user information used customized targeting users jio businesses eg jiomart people dont even understand collected data affect let explain ways jio businesses eg jiomart use information differential pricing products discounts type vehicle wheeler good indicator level income person wealtheir person given less discounts recommendations landing page jiomart customised show expensive higher margin products first fall high income category many think twice sharing personal information companies ",
    "cleaned_title": "jiocinema become data collection app jio group",
    "cleaned_selftext": "watching india england test match jiocinema appalled kind personal questions prompted watching videos many questions nothing experience app eg vehicle educational qualification digital companies collect data customers generally data limited directly required service never asked personal information corporations perspective clearly creating profile user information used customized targeting users jio businesses eg jiomart people dont even understand collected data affect let explain ways jio businesses eg jiomart use information differential pricing products discounts type vehicle wheeler good indicator level income person wealtheir person given less discounts recommendations landing page jiomart customised show expensive higher margin products first fall high income category many think twice sharing personal information companies",
    "cleaned_comments": "give random info ruin data movies series music buy actual blu rays rip hard drive pirate corporations suck digital companies collect data customers generally data limited directly required service bad news mate dont like qns click x asking personalise ad recommendations companies well dont ask take data search history apps phone app usage statistics etc etc services free product differential pricing products discounts even legal recommendations aka personalised ads reddit google open youtube recommendations front page something free automatically become product wish better laws restrict companies stealing data though creating audience data targeting campaigns enough data run campaigns across social media search target based interest also use audience data create look like audience means users jio platform similar choices current audience something freeobviously traded every corporation years ago woman bearing jio id card came home saying authorized government collect data questions intrusive like vehicles owned models mobiles used politely ask leave argued instead leaving saying report government something free closed source requires active internet connection product lot open source applications services respect privacy terms browsers brave browser librewolf fork firefox search engines duckduckgo brave search email cloud storage calendar proton ecosystem theres lot ya ik companies actively looking expand lot earn lot money lies difference google jio duckduckgo free become product point instagram knows better family members seems amount data collected insane install pihole network youll limit lot telemetry data collection plus block phishing websites combine ublock origin browser preferably librewolf desktop brave android safari ios adguard extension alternatives streaming services buying actual dvds ripping pirating stream dont ownership remove stuff whenever want spotify recently lot licensing issues lot songs went spotify going switch bluray recommendations buy apart amazon pirate also use data reliance digital sub companies makes free database instead buying unless place live dvd shop amazon flipkart ebay options ship sailed sea thanks corporations lmao nothing fact actual government employees nso ground surveys recourse people refuse answer glad got vpn theres good sports streaming sites pirating static stuff easy live sports made paying streaming worthwhile questions started normally got intrusive sure might scared lot innocent people got whatever data wanted questions started normally got intrusive sure might scared lot innocent people got whatever data wanted op thinks seeing match free qbit torrent amazing buy free follow rpiracy homies hate reliance lolzz companies like amazon always listening whatever youre saying quite tame ask bhai election aa rahe farz nibhana parega naa youre still using reliance products dont know tell everything free one sold nothing free something free product supporting reliance glad actually asking firms steal dm good torrent websites movies days pirate bay torrents websites working use qbit inbuilt search need visit sites use vpn youll need install plugins popular torrent sites process quite simple google use qbittorrent search dont watch much jio get questions give wrong answers",
    "light_cleaned_title": "JioCinema has become the data collection app of Jio Group",
    "light_cleaned_selftext": "I was watching India - England Test match on JioCinema and was appalled by the kind of personal questions that were prompted again and again while watching the videos. Many of these questions have nothing to do with the experience app (e.g. \"Do you have a vehicle?\" Or \"What is your educational qualification?\"). All digital companies collect data about their customers, but generally the data is limited to what is directly required by the service, and never I have been asked of such personal information. From the corporations perspective, it is clearly for creating a profile of the user and this information will be used for customized targeting of users on other Jio businesses (e.g. JioMart). Most people don't even understand how this collected data will affect them, so let me explain. Some ways in which other Jio businesses (e.g. JioMart) can use this information is : - Differential pricing of products or discounts : Type of vehicle (4/2 wheeler) is a good indicator of the level of income of a person. So a wealtheir person can be given less discounts. - Recommendations : The landing page of JioMart can be customised to show more expensive / higher margin products first if you fall in the high income category. And many more. So think twice before sharing your personal information with such companies.",
    "light_cleaned_comments": "Just give random info and ruin their data. And for movies, series and music, buy actual blu rays and rip them to a hard drive or just pirate it. These corporations suck! >All digital companies collect data about their customers, but generally the data is limited to what is directly required by the service, I have some bad news for you mate... If you don't like the qns, just click on the 'x' above it. They are asking this to personalise their ad recommendations. Other companies do it as well but they don't ask. They just take data from your search history, the apps you have on your phone, your app usage statistics, etc etc. These services are 'free' because you are the product. >Differential pricing of products or discounts Is that even legal? >Recommendations aka personalised ads. It's what reddit does. It's what google does. When you open youtube, your recommendations are there on the front page. When something is free, you automatically become the product. I wish we had better laws to restrict companies stealing data though. They are creating audience data for re targeting campaigns. Once they have enough data, they can run campaigns across social media and search, to target you based on your interest. Also use the audience data to create look like audience which means those users who are not on the Jio platform but have similar choices are their current audience When something is free,obviously you are being traded. Every corporation is doing this. A few years ago a woman bearing a Jio id card came to my home saying they were authorized by the government to collect data. The questions were too intrusive like vehicles owned and models of mobiles used. I had to politely ask her to leave. She argued with me instead of leaving saying that she will report to government. When something is free and closed source and requires an active internet connection, they you are the product. There a lot of open source applications and services which respect your privacy. In terms of browsers - Brave Browser, Librewolf (Fork of Firefox). For Search Engines - DuckDuckGo or Brave Search. For Email, Cloud Storage and Calendar - Proton Ecosystem. There's lot more. Ya ik. These companies are not actively looking to expand a lot and earn a lot of money. There lies the difference between Google or jio and duckduckgo. When it's free, you become the product. At this point Instagram knows you better than your family members it seems. The amount of data collected is insane. Install a PiHole on your network and you’ll limit a lot of telemetry and data collection plus block phishing websites. Combine that with uBlock Origin on a browser (preferably Librewolf on desktop and Brave on android and Safari on iOS with Adguard Extension). Alternatives to streaming services is just buying actual DVDs and ripping them or pirating them. When you stream you don’t have ownership. They can remove stuff whenever they want. Spotify recently had a lot of licensing issues and a lot of songs went off Spotify. Going to switch to Bluray. Any recommendations on where to buy apart from Amazon? PIRATE They also use the same data for Reliance Digital and other sub companies too, it makes a free database for them instead of buying. Unless the place where you live has a dvd shop, amazon, flipkart or ebay are your options. Ship has sailed the sea all thanks to corporations. Lmao. They can do nothing. In fact actual government employees of NSO do on ground surveys and they have no recourse when people refuse to answer. Glad I got a VPN. There's some good sports streaming sites out there. Pirating static stuff is very easy. Live sports is what made paying for streaming worthwhile. The questions started normally but it got more and more intrusive. I am sure she might have scared a lot of innocent people and got whatever data they wanted. The questions started normally but it got more and more intrusive. I am sure she might have scared a lot of innocent people and got whatever data they wanted. OP thinks he is seeing match for free. 🤡 Qbit torrent... Its amazing you can buy here (for free) just follow r/Piracy all my homies hate reliance Lolzz as if other companies like Amazon are not always listening to whatever you’re saying. This is quite tame of them to ask Are bhai election aa rahe farz to nibhana parega naa If you're still using Reliance products I don't know what to tell you When everything is free then you are the one who is sold 🙂. Nothing is free If something is for free, then you are the product. Not supporting Reliance here, but I am glad they are actually \"asking\". Most firms just \"steal\". Can you dm me some good torrent websites for movies? These days pirate bay and other torrents websites are not working. Use qbit inbuilt search - no need to visit sites or use vpn. You'll need install plugins for popular torrent sites. The process is quite simple, just Google how to use qbittorrent search. I don’t watch much on jio but when I do and get such questions then I give wrong answers only."
}