{
    "id": "14byibk",
    "title": "Being hateful is the new edgy *Rant*",
    "url": "https://www.reddit.com/r/india/comments/14byibk/being_hateful_is_the_new_edgy_rant/",
    "selftext": "Greeting fellow Indian homies, \n\n  \n**Disclaimer: This post will contain some parts of discussing different religion and LGBTQ community, this is to bring up a conversation and in no way trying to attack a specific community.**   \n\n\nI don't know about you all, I am tired and mentally exhausted looking at the hate being spread on social media platforms. Against women, lgbtq community, and peoples own perception of masculinity. I notice this mostly on social media, and occasionally from what my friends say. Whenever I open my youtube, the content that is pushed to me is the red pill community, with some brain dead dick riders, who claim that \"woman, have no hobbies!\", \"Being Gay or abeing ny member of the LGBTQ community is a mental illness\", \"Men don't have to be loyal because they can spread there seed (first of all, anytime I hear that, I want to puke), yet woman have to stay loyal to men because they can be pregnant by only one person and after that they are a bagage.\" Everytime I get this video, I choose, do not recommend, however they still pop-up. They claim to want traditional woman, who have to house wifes, shouldn't have male friends, shouldn't work but need to sign a prenup, like what kinda brain dead fuck face thinks like that. I thought people are smart enough to realize that this is crap, yeti  I look at the comments and they only seemed to support it, like bruh, think for yourself.   \n\n\nNot only that, I have been watching the content on instagram that are heavily targeting women for no reason, a clip of woman making a stupid mistake, and everyone in the comment section begins to generalise it with a comment \"women\". I get that people are just trying to make a joke, but it has stopped being a joke and became more of a instigation technique. God forbid you make a comment on men doing stupid shit and the replies from butt hurt men, who claim that is not a joke but an attack on male community, yet they can also comment \"women\" but women have to take it as a joke. The audacity.  \n\n\nThen there any of the LGBTQ posts, even as simple as a \"Happy Pride\" post gets so much disgust and hatred as people begin to claim \"it is not part of hinduism, it is mental illness!\", \"Western Media Influence\"  well my fellow hindu's, you're wrong, LGBTQ, maybe the acronym that we might have  taken from the western media but the acts of homosexuality and transgenderism has been in Hinduism for a very long time. Sources: [https://academic.oup.com/book/11527/chapter-abstract/160309678?redirectedFrom=fulltext](https://academic.oup.com/book/11527/chapter-abstract/160309678?redirectedFrom=fulltext), [https://www.oxfordbibliographies.com/display/document/obo-9780195399318/obo-9780195399318-0223.xml](https://www.oxfordbibliographies.com/display/document/obo-9780195399318/obo-9780195399318-0223.xml), [https://www.indiatoday.in/india/story/10-instances-of-homosexuality-among-lgbts-in-ancient-india-1281446-2018-07-10](https://www.indiatoday.in/india/story/10-instances-of-homosexuality-among-lgbts-in-ancient-india-1281446-2018-07-10). Like if you don't support and are repelled by the community, fine, whatever, but to go on to the posts that are catered for LGBTQ community and comment about how you are being forced to watch or endure, you can scroll past or even stop following them, instead you go to a place that was dedicated for safety for the people in community, for them to feel welcome, the haters go there to attack. How do you feel if atheists and agnostics comes to your church, your temple or your mosque and say you have mental illness for believing in an imaginary bearded man in the sky. Live and let live.   \n\n\nFinally the Tate meat riders, the amount of people claim Andrew Tate to be a messiah and spread his words as wisdom is just so stupid. Some people follow him for his content, I get it, he is a charismatic guy, how ever, their are people who see him as role models are the biggest sheep. Like why is he a good role model? The man offers nothing but materialistic ideology and money, that is what he just sells. People forget to see how he made money, through cam sites, taking advantage of depressed men, casino's, gambling. He then preaches that he is a man of Islam and his principles are based off of Quran, I will admit my knowledge about the Quran is limited, still I do know it condones, alcohol and gambling, to him, he is just using the religion as a cover to hide his bad influences. I don't care if people drink or not, but claiming to a man of god, yet indulging in sin, is a great indicator that they are a hypocrite. At the end of the day, he is a clout chaser, and I wish he just admits it and his fans stop treating him like Morpheus who is giving them a way out of the matrix.  \n\n\nI say this again, I get that people have freedom to watch what they please, nothing wrong with that, but all the content that we consume nowadays are just generating hate and dividing the communities for no reason, there's no need to be a battle between sexes, all of us are co dependent, we can't claim \"God, I hate people!\", \"People Suck\" without even putting an effort to even be kind to each other. We can't find kindness anywhere, if we are lucky, we bump into angels of a people, that remind us that kind people exist. Not all of us are privileged to have kind people around. So let's just be kind, and nice to each other, even if our opinions differ.",
    "flair": "Rant / Vent",
    "score": 239,
    "num_comments": 139,
    "created_utc": 1687027624.0,
    "convurl": "https://external-preview.redd.it/jnLDketU0KdPSd0L-SlyPfp2dokeRHjFqHoY_qq1OTk.jpg?auto=webp&v=enabled&s=f3dd2e055fee6d81eb9e703741d2ae7e711ba751",
    "comments": [
        "Yeah, there's a lot of garbage out there. Internet provides the power to amplify both good and bad.",
        "I agree with you, what scares me is that the amount parents have no issues giving their kids iPads, who will have access to hateful stuff, they might thinks it’s cool or whatever but I worry for the future, it’s like people treat being kind is some sort of a weakness",
        "There are kid safe websites, filters, apps etc. It's upto the parent to setup restrictions. But yes, even when you do that, they can be exposed to harmful things sometimes.\n\nAlthough IMO, the topic you're talking about is more relevant to adults.",
        "UR USERNAME FEELS LIKE HOME",
        "leaving social media bec i wanna be productive :(  \nleaving social media  to stay away from edgy people :DDD",
        "What you said is true, it is more relevant to adults, I mean who are adults anyways, just some giant sized children. To add on, it the teens that I worry about too! Adolescents can make teens feel as if being rebellious is cool and right, I mean I thought that I went through it, but I had some good guidance to help me navigate.",
        "Yes ikr, it’s so exhausting. I really don’t understand the hate towards lgbtq. It’s seen as this grave sin, or as something disgusting by most people. I just don’t get that even if your faith/cultural values doesn’t allow homosexuality, why is it your business? You follow your faith and traditions, and let others follow theirs lol. Plus, the whole “it’s unnatural, we need babies” argument is so stupid. Majority of the world is straight, hell, we’re still having overpopulation crisis atleast in some countries lol. Imagine if all straight people suddenty turned gay for some short time, I’m sure they’ll be quick to take away all their harsh views, considering the fact that it’s not a choice that people make. :/ \n\nAnd don’t get me started on those red pill bros! I’m so exhausted of them. I just block those accounts, and live peacefully knowing that there are some idiots out there who’d never achieve true enlightenment, and I shouldn’t waste my time on them :)",
        "I agree with you, I can't tell you how much it rages me, when certain religious groups acts oppressed, like they haven’t stoned, electrocuted and murdered people for just existing as part of an LGBTQ community.   \n\n\nThe red pill bros are worse for sure, but the red pill \"Pick me\" girls are even worse \"I don't think women should have the right to vote\" like bitch! Go and read a book!",
        "I’m a part of that religious group💀 so pls don’t generalize, but I get your sentiment. \n\nYes ik, it sucks to see women hating on women. Like hey, if we don’t hold onto each other, who will? :/",
        "Of course, I didn’t mean to generalise, I used it as a broad term instead of targeting any specific religion but I understand and agree with your point.",
        "And have you noticed how they bring some really uneducated girls to these podcasts and videos? I’ve seen so many people point out this hypocrisy, that they should be bringing actually learned women for discussions. But ofc they won’t because we all know what’d happen lol :)",
        "Oh god yes! It is sad to see, I don’t understand my these women go onto these podcasts only to get shit on by dudes whose whole personality is like a tuna can.",
        "Internalized misogyny - that’s the term for it. I don’t hate those women, I just feel sad for them sometimes, because they still attach their self-worth and existence to a man, instead of their ownselves. I hope they break free out of it, because in the end, we’re humans, and deserve some level of equality",
        "Very true!",
        "I hate everyone equally. I am a misanthrope.",
        "I think you also mis sed my point lol",
        "Squidward?",
        "the ‘women ☕️’ comments are so saddening man it’s insane lmao",
        "Can we get a TLDR for long rants?",
        "Don’t forget that reddit itself is a hub for such assholes. The gender ratio here is so bad (especially on indian subs) that even if you as a women say something slightly opinionated regarding men , the whole mass of incel comments would be flooded in your inbox because it’s that easy. Internet anonymity has given liberty to such people to bully and pass hateful comments with no consequences whatsoever.Someone said that every subreddit has a mass of people that are the echo chambers of a certain issue. Misogyny, making homophobic “dank” comments, passing sexual remarks on women, is THE ISSUE  of such subreddits.",
        "i mean muslims are pretty oppressed in india, but obviously no excuse for lgbtq oppression",
        "Tldr: social media platforms are filled with hateful poop people.",
        "Is being gay a case of nature or nurture? Either way it's beyond that person's control, no point in hating and discriminating folks for it.\nIf they start to become a pain in your ass, you can choose to fight them...or use a better lube",
        "Everytime I see women ☕, I literally want to throw my phone away. I'm a guy and guys do make mistakes too.",
        "You said exactly what I always think OP, thank you for putting into words. This is the only reason why I deactivated my Instagram and really don't want to get back into it anytime soon. \n\nSeeing people like this makes me sooo scared. It's sad and pathetic to see this hatred. Such intolerance, so much negativity, and the comment section is so disgusting for many posts. Someone makes a valid point and they are called names. Like people's first instinct in comments is to abuse others rather than logically talking or saying. \nIt's messed up",
        "Wow you're so cool",
        "They had a good run when they were used for harmless fun. Now they just turned into an insult that insecure incels use.",
        "It is sad, the young men are being influenced to think that there is a war between sexes, where is not a battle, we are trying to survive and we need each other. Sad to see many man completely disregard feminism as a western propaganda and it spreads hate against men, when it is not the case.",
        "Yeah, As a guy I understand, sometimes I just think people want others to this what they say is funny, only needs to be taken as funny joke, even if what said is a direct attack on a person. Humor requires thinking skills, can't attack/bully a person and them regard that as a joke.",
        "Lmao! Not gonna lie, you had me in the first half",
        "NO THIS IS PATRICK!!",
        "Thanks homie!",
        "The comment section has gone toxic, filled with people who want fake validation from other fake internet people, being different makes you unique, so hate things that people love. It's just a way of expressing their own self worth and insecurities I guess, when they try to bring people down for enjoying something. When asked why speak if they didn't like it, they say \"It's my opinion, get over it!\", that's calling a new born baby ugly for no reason and when the pissed of parents ask \"why\", 'Cuz duh! I have free speech!\". It is indeed sad",
        "Saw this comment section.  A Muslim guy did great in neet ug like scored a rank in 3 digits and topped like the entire north east. Oh my god the comments. They were all targetting his religion. I was shocked. Nobody was congratulating him. It was a war in the comments. The Muslims were acting like he won for the community and the Hindus were just... Idk man. It's sick. Everyone is retarded at this point.",
        "That is sad, everyone one are being influenced to hate, they are being taught to generalize which and false patriotic self imposed values that make them want to hate anyone that doesn't belong to a particular community. It is sad.",
        "Dark humour stopped being funny when everyone started to try it. Saying kill all gay people lol is not funny.",
        "I have been so tired of all that toxic stuff that i actively filtered my feed to only show cat videos and my other hobbies(like gaming,shows etc ) but Indian Instagram community is extremely toxic by this 12 year old wannabe chads",
        "\"Kill all Gays\" \"Bruh it's just a joke bruh\" \"what's the joke you ask?\" \"Like all gays will be killed duh!\" \"see so funny!\"",
        "That is a very healthy way of navigating social media! The wanna be chads don't understand that their whole person is built on hiding their feelings and projecting their insecurities on others. It is sad, I heard a 10 class kid, I met at a function say to me, that he and his friends think  \"Hitler is in the right! He should be idolized\" That in itself terrified me, as it left me wondering as of what are these kids latching onto these days.",
        "hijacking the top comment to provide a response for 'women ☕️'\n\nand that is 'Men 🍼'\n\nPlease use this women, whenever you get trolled. Peace.",
        "it was never harmless for women",
        "I can see that, being in the opposite sex kinda makes me forget to notice things at times.",
        "https://preview.redd.it/5hk6m1clip6b1.jpeg?width=1080&format=pjpg&auto=webp&v=enabled&s=7bc07e93c4524b9edeb8e865c0062e5c99b151dc",
        "I reallyyyyy tried to change my alogirthm for the posts and the discover feed, but the reels I never want to see always pop up. I had to ask a friend not to send me certain memes and stuff.",
        "Good Ol Pearly, believes woman shouldn’t have right, woman likes to get cheated on and they are the biggest reason for the fall of society.",
        "I just say thanks for the coffee, wash it when I'm done lmao",
        "Ikr. She's the biggest pick me I've ever seen 😂 and funny enough there was a video in which she Said: I'd rather be a pick me then a skip me . I mean ab iske baad kya he expect karsakte hai isse",
        "Omg so truuue! She is soo insufferable, She is just a clout chaser, she doesn’t care about any of her listeners, all she cares about is saying the same thing other red pill podcast say",
        "Ok.",
        "KO.",
        "I dont mind lesbians & gays living but when it comes trans converted people,i think they should be transitioned without any forced group by a 3rd party or parents.\n\nLet the child be 18+ age first to decide whether man wants to convert into woman or woman into a man.\n\nI do have to watch the documentary **Matt** provided which gives me the topic into \"Agree-Disagree' both ways.\n\nI do have to see the track record of these people what type of fruitcakery they are doing globally.Minimum 100 is required.\n\nI know i will get disagreements but hey at least i am keeping it civil here mate :)\n\nHave a good sunday!",
        "I get when you are coming from, especially when it comes to Transgender movement, not a lot of people understand it, lot of people are scared to talk about or question it, because they fear they will be labelled as a transphobe. The whole subject of Gender dus photos is not topic for sure, as the first case dates back to the 19th century: https://www.medscape.com/viewarticle/885694#:~:text=The%20diagnosis%20of%20people%20with,Psychopathia%20Sexualis%2C%20called%20it%20homosexuality.\n\nThat said, it makes sense of what you propose, lot of people are now aware of this due to social media and most of the cases that goes viral seemed to be the bad cases that are used in the echo chambers. It is still a subject that is being discussed, which is interesting because there is a lot of gender change in Thailand for example and there is a huge acceptance of them over there. \n\nI also know the documentary you are talking about, the one with Matt Walsh I’m assuming, I generally don’t like the guy, and his documentary “What is a woman” was a head ache to go through, I have no idea why the people who he chose to debate, couldn’t even answer a simple question of “what’s is a woman”, especially where there is gender science professor sitting in front him. His logic is biased from bible and can countered a lot. \n\nHe claims, woman are the ones that can get pregnant as that it what it states in the Bible, yet it can be tackled with “what about women that are infertile”. I think the answer to “what is a woman” is quite simple. The term woman is a social constructed word that society uses to deem someone when they meet certain criteria, don’t get me wrong, I’m not talking about biological “female” sex, which is defined by science, “woman” was defined by society, as they label colours, clothes, certain behaviours, so when people say they identify as a woman, it mean they identify as the image that the society created. \n\nThere are biological sexes, Male, Female and Intersex. \n\nAll though I don’t understand what you mean by minimum 100, could you elaborate on that?",
        "I bet they haven't seen anything describing the atrocities/crimes he committed during those times but those memes.\nThis is the reason I wish stuff like Hitler won't be shut down on social media but be told as to not let new Hitler's be born.\nAnd I honestly don't get the appeal in Patrick Bateman and hiding their feelings and stuff.bateman works best as a meme but not real life inspiration,he's literally full of insecurities himself and covers it up.\nShowing emotions and helping each other is the peak a human can be.",
        "Instagram is a bit hard but it's super easy for YouTube.\nJust watch/click videos regarding your topics and don't click on others ,do this for some time and it only shows what you want to see. But if you wanna see anything different-Incognito tab is the way.\nFor Instagram , I recommend following random pages about topics you like , save those videos(in insta save ) then like or share them and make sure most pages you follow are {topics you like to see} and then watch reels of those topics and skip any reel you don't wanna see , it might take some time but it works.",
        "In most countries its illegal to transition before you turn 18 and I dont really think anyone is pressuring anyone to be trans considering how much transphobic the world is.",
        "This one is quite witty lol",
        "Nice hypocrisy there.\n\nIn the thread about genocidal hate against Muslims in India, you try to blame Muslims themselves.\n\nHere it's the opposite.\n\nI mean I have seen loads of comments from edgy liberal/lgbt/atheists on religion calling it mental illness. But the other way around is hatred. Calls for banning propagating religion to under 18 while propagating gender ideology to under 18 is a right and banning it is genocide. Calls for keeping religion out of schools in context of hijab, but flying pride flags is okay. Okay telling Muslims to keep religion at home, but telling lgbt to keep sexuality at home is hatred\n\nThis subreddit was full of support for hijab ban by sanghis and atheists and liberals engaged gaslighting Muslims just like you did in the other thread.\n\nSince you like to do both sides nonsense and blame Muslim victims, can you tell me what's the difference between you and Andrew tate or the red pill bros?\n\nOne of your comments\n\n>I’ve developed a deep sense of hatred towards Muslim men because of these reasons.\n\nTake your own gyaan which you used to gaslight Muslims. Maybe you should introspect why you are hated while you spew nonsense like \"I have a deep sense of hatred towards muslim men\"",
        "Thank you!",
        "Sorry but please do research. More people are unsatisfied with their knee replacement surgery. Then transgender people are with their surgeries. \n\nAgain this is hate rhetoric on the transgender community. I live in the USA. No one is pressuring anyone to be transgender, and second of all it takes years of counseling and you can’t have surgery till your 18. Nobody wakes up and is suddenly transgender",
        ">. How do you feel if atheists and agnostics comes to your church, your temple or your mosque and say you have mental illness for believing in an imaginary bearded man in the sky. Live and let live.\n\n>Being Gay or abeing ny member of the LGBTQ community is a mental illness\n\nI would feel bad.\n\nBut loads of edgy atheists have done exactly that in this subreddit. Calling religion a mental illness, calls for banning teaching to under 18 and loads of other nonsense. Same with hijab bans. Loads of extremists in the subreddit supported it. Calls for keeping religion out of schools in context of hijab, but flying pride flags is okay. Okay telling Muslims to keep religion at home, but telling lgbt to keep sexuality at home is hatred\n\nAnd that's not just in a theological context. It's when Muslims have been dehumanized in India by sanghis.\n\nBut they were never banned and it's the mainstream opinion of atheists and liberals in this subreddit",
        "What's wrong with generalization?\n\nI mean here's one of your comment\n\n>I’ve developed a deep sense of hatred towards Muslim men because of these reasons.",
        "Bro make new account and follow better content, it will stop",
        "Best idea anyone has given me by far",
        "Absolutely, Most of the edge lord, finds a sense of power and moral superiority when they begin to stop believing in god. \n\nHow ever, irrespective of the religion, my point is to be nice to everyone, if you don’t support it, move on, you have your own life to worry about. Same goes for atheists and agnostics too!\n\nHow ever being part of an LGBTQ movement is not mental illness, that’s just a brain dead and ignorant statement to make, I say ignorant because, that case is not backed up by science, it is backed in some cases, it backed my religious biases and own and fear of own acceptance of homosexual tendencies",
        "At this point i don't even bother to put my opinions because i know their sensory receptors aren't working and they're behaving like narcissitic  . So i just mind my business and stay away from such people. But it is sad that where our society is leading. We want credit from west ,we want to go to west and want west etc but when it comes to upliftment of society it's suddenly \"western influence\".Sometimes i think west doesn't hate us , throw racism on us, it's us who are like \"Aa bail mujhe maar\".",
        "This all was ironically started as a simple satirical joke \"sigma\" and many incels have invaded and ruined it by taking it seriously. Misogyny, Homophobia is so normalized in Instagram comments these days. Thanks for making this post OP",
        "At this point i am just waiting for a nuclear apocalypse to kill us all man or God themselves show up and kill us all. Humanity is a huge mistake",
        "Thank you! I will try this",
        "Nah my friend! Although I understand where you are coming from, I disagree that humanity is a huge mistake, of course it may feel as if we are all heading into the darkness, there are still angels out there, in the form of nurses, the people who take of the elderly and some people who volunteer because they can't look away, while they are still fighting to spread love and kindness, the least we could do is stop spreading hatred and despair.",
        "there is a \" women  👑\" too",
        "I didn’t realize that this is the red pill content that’s being push in Indian social media. I thought this was the case primarily in the US. \n\nDamn, the algorithm is super screwed up.",
        "I have no issue with LGBTQ+ but I have issue when it starts involving minors, someone I knew was in grade 7, and he identifies as she/her, that was my turning point, I don't care if a grown up adult decides to be  gay/lesbian or anything he/she/they wish to be but I also don't like that minors start following the same trend. \n\nTate is BS, he just fills the user with Red pill so much that they crave more of it every now and then, presenting always one sided facts how woman cheat, how women will leave you for this and that, all nonsense based on some rare cases, his thinking is not even valid with Indian society.",
        "Nah man, the red pill gang are everywhere it is frightening, it spreads like wildfire",
        "Hmm, that is an intricate situation, I can't pretend to know more about gender dysphoria more than an average person, yet it is a rough subject because it is hard to handle, in a way, once a minor becomes a major, it makes sense for them to choose the gender they prefer to be, yet it is intricate because if the grade 7 kid said, he is gay, he is probably gay, you can't choose who you like.  \n\n\n That said, I don't think any grade 7 kid would identify as a different gender for attention or fame, specially in India and how people treat is as a taboo, if you are sure that he is not joking and actually believes it, it is best to have an open dialogue with him, as to ask why he thinks that way.   \n\n\nAgain that's what i would do.",
        "I always tell this quote by bertand russell to children nowadays: love is wise, hatred is foolish.",
        "It wasnt the case an year ago. Yeah there were guys doing weird shit but not to this extent. Ever since Tate and all this characters like Bateman became super famous, things went out of hand.",
        "I’ve got nothing to say to you, because you don’t know me, and I’ve my reasons. Even the post/comment you’re talking about, I’ve always emphasized on the word “some”. I make sure that I write “some” to ensure that people don’t take it as everybody.\n\nAs for your comment pointing out the hypocrisy, where have I shown support for banning religion or banning hijab? If you read my comments, you’d realize that all I’ve been mentioning is to keep religion private, and not let it make political decisions, which is what many people want. Here too, I’ve mentioned that being lgbt is their business, and not ours. Hope you read my comments properly, and not attack just because I decided ONCE to see the other side’s perspective.",
        "I just figured that it would be…. “Different?”. In my limited experience, I’ve never heard much conversation about LGBTQ issues.\n\nHow the hell is Andrew Tate a thing in India ? That swine would most likely call all Indians as betas or some shit like that. His entire business model is manipulating and coercing women to do work for him. He’s literally being charged for human trafficking. If that doesn’t make people question their choices in life, I think there’s something really wrong with them.\n\nOne thing I’d like to add is the casual dismissal of feminism. Not only do I see examples of brash , provocative statements being falsely attributed to feminism but also the counterculture around seeping into the mainstream. Funnily enough a good chunk of these examples, caricatures that are shown are examples of toxic masculinity being reflected in women and examples of women just being really shitty.",
        "Funny how only a specific type of hate is targeted here",
        "I’ve seen this a lot too! I know it’s rude but I don’t know how. Can someone please explain what this means?",
        "Ayyyyyyy 😅",
        "THIS !!!\n\nThe whole world is getting so screwed up 😔😔. Social media algorithms have figured out that the most rage inducing or polarising content is what is going to get the most engagement so this problem is  only going to increase in the future.\n\nI thought reddit would be different but it's also turning into a place for people to just bash others 😐.. I don't have any other social media accounts... deleted others...because I realised it's not good for my mental health because we talk about this stuff and vent our rage over polarising content and in real life are just helping whatever apps we are using make more money.\nBelieve me at the end of the day Instagram, Facebook, reddit, and other companies are the LAST people who care about any kind of social issues 🙄🙄.\n\n\nLiterally hate all social media apps now which are bringing out the worst in people. Recently another redditor mentioned how this was even aggravating their clinically diagnosed anxiety by bringing up something negative constantly and they said it might be their last post / comment ever here..\n\nI think I might leave reddit too if this keeps happening :/",
        "Just keep on keeping on, Colonel!",
        "> All though I don’t understand what you mean by minimum 100, could you elaborate on that? \n\nBasically what types of crime trans converted people doing.Mostly you will get on TW by certain accounts",
        "remember, the more you spend time on internet, the more shitty people you would see. It is bad for your mental health(srsly). Increase interaction irl, and your shitty experiences will considerably decrease.People are frustruated with their lives, thats proabably why they abuse others.I personally hit my lowest in the covid time, i did not hate any caste/gender, but i was still trolling people nonetheless. Depression did a funny on me and i still havent recovered. But atleast i've stopped trolling people and almost never rude to people on the internet.Being chronically online is a surefire way to get your mental fucked.  \nedit: as for who i trolled: Tateriders, mysogynists, feminists, people who are always online(yep, the irony), religious people, people who were happier than me, etc.",
        "Dark humour stopped being funny when it just became dark and no humour",
        "We are currently living in a tsunami of brain dead red-pilled wannabe Tates, who can't get married if their mommas and daddies can't arrange a marriage for them.\n\nCoincidentally, most of these zombies are the people who lack social skills to even connect with women at basic level. All they do is share \"waman\" memes, and hate women online because they could never have a meaningful relationship IRL.\n\nThey act as if \"females\" are only good for fucking(not like they are getting any action in first place), and they are just gold diggers and run after \"alpha\" men. Honestly, it's just sad they never met a self-respecting decent woman.\n\nAnd seriously, these aspire to become \"alpha\" men while obsessively following \"alpha\" Tate and Co?  That's the most \"beta\" thing dude.\n\nRant over.",
        "https://preview.redd.it/kiybatpuns6b1.jpeg?width=400&format=pjpg&auto=webp&v=enabled&s=c78b61aee5549ec4012db31a62f29f9f105ee205",
        "I have seen both but to my understanding the second one is more prominent than women. Men are just insecure that they take out their anger against women these days. They don't have their own family or can't make one. About LGBTQ I don't post comments but I disregard pride month.",
        "Unfortunately \"Good\" never spreads like Wildfire.",
        "Be like Bill.  \n1. He is updated  \n2. He is opinionated   \n3. Best of all, he keep it all to himself!",
        "Yeah I ain't going to hurt you but you can follow Jill also.\n\n1. She knows how to make short posts.\n2. She stops using ig if it's toxic.\n3. She know there are positive audiences out there.\n4. She knows the difference between a reply and an opinion.\n5. She tells people to face if she has a problem. \n6. Best of all, she keeps it all to herself.",
        "Very well said OP. There's simply too much hate on social media for no reason. This religion hating on this, straights hating on gays, Masculine hating on Feminine. Like why, just live bro. Why fight? And whenever any of this topic brought up IRL, these brainwashed dumb people start physical fighting because they don't have a logical point to talk about. It's irritating now. It hard to see hate spread everywhere but staying out of it is probably the best we can do.",
        "Okay you may have misunderstood me, I mentioned Bill as a compliment and when I said Bill keeps to himself, is me referring to you saying how you have an issue and that is all, which mean the what ever the reason is you’re not deliberately trying to spread hatred. I was commending you, for having an opinion and also enough maturity to keep to your self. How ever you chose to attack which is fine, but I will have to defend. \n\n1. Why would I make short posts, when I can take my time elaborating my thoughts, if it’s waste of time to you, you don’t have to read. \n\n2. I could stop using it however, it is not just about me, I was mentioned about how people are just being wrapped into this mess, as form of bringing awareness, if I were to throw the Instagram away, I would not be raising an awareness, I’ll just be a selfish dude, who only cares about himself.\n\n3. I do know there are nice folk out there, that’s my point, the nice people out is the reason why we shouldn’t give into the idea of hating each other. We need each other to survive. \n\n4. I believe I do know the difference between both of them and I might be curious why you are bringing that up. \n\n5. I mean, what she is doing sounds like a great thing! Sharing problems is a good thing instead of fighting it alone. \n\nNot every one is out there to get you friend! What I thought was a stupid/positive joke, was mistranslated into an aggressive attack. It is not.",
        "Yeah but sometimes in sea of violence and aggression you can't just help but lost hope sometimes and become apathetic i am trying to work myself on it. I swear i keep falling backwards more and more",
        "Just keep on keeping on friend! At the end of the day, it is you who will have to take care of yourself, you need to make sure you are okay, before you care for the others.",
        "Sure go ahead but this won't change a thing we will continue to spread hate liberty is not a option",
        "Money is everything that matters you want safety from thugs that run india outside of urban areas you need money materialistic is now fundamental those that don't support  it are not capable of living outside of a crammed 300 apartment building",
        "Women have tried to use this on me but most of the time they can't find points to fight the keyboard war so they end up getting called ugly fat unwanted bitches who can't walk alone at night and leave",
        "Yeah I thought that was some comeback and required time for my organization to put malware on the females online profile and leak private information to shut them up or just harass them so we switched to dishwasher ☕️",
        "There needs to be no reason I have made it my task to attack any lgbtq person even in my school days we used to beat up the gay kid daily inside the toilets",
        "Oh wow, beating someone because of who they choose to like, that’s so cool!!!!!!!!!! <3",
        "Of course",
        "Especially when their choice of life is wrong and it just feels right",
        "they end up getting called? or you call them this? \n\nand are we assuming men are not ugly or fat or unwanted or dogs? The only aspect is that they still can walk alone at night? \n\nPerhaps you never debated with a strong woman",
        "Even if it were wrong (which btw it isn’t), I’m sure you’ve not been beaten by random people lol, for your wrong life choices :D",
        "It doesn't matter if it's right or wrong anymore I have done a good job making people around me believe I'm right. Which I am we do not need lower younger population wokism has only brought stains in countries\nAnd the majority of India even the youngsters believe the same .Victory is near",
        "Strong in what? Keyboard fights? Even a relatively fat person  with low muscle could grab a fit female and take her",
        "Women aren't needed for anything but reproduction they don't serve no important job .The richest women made it from divorce. Creatures with over inflated egos that were  born for the purpose of riding dicks 🤣🤣",
        "That is a nice response since it shows how females are already practicing to take dicks in their mouth because the coffee means the men drink it when women are doing their classic shenanigans.So it's fair that women in return are practicing sucking cocks",
        "I get all I need to know about you with that propaganda mainstream view.sure his past might have been bad but without him id never have quit video games and start working more for that grind.He only promotes men to be strong not blatant hate.",
        "You are contradicting yourself. You’re making others believe that “you’re right” which probably feeds your empty soul, without even knowing if something’s wrong/right. At the same time, you’re worried about how this sort of western world wokeism will destroy our country. Don’t wanna engage in name-calling, but either choose to be an unapologetic hater instead of pretending that you actually care about the country. If you’re that concerned, I hope you speak up about all the other things going wrong in our country too, instead of simply cherry-picking the lgbt issue, which isn’t even having any adverse effect right now.",
        "I wanna know what has made you so hateful towards women and lgbtq people? Don’t you think we’re humans too, and even if I don’t state the multiple rich women, having their own businesses, we’re still involved in several workforces? In the end, trust me, it doesn’t matter what your gender is lol, you’re indisposable in the world (just like “how women aren’t needed for anything imp”) because there are many who can do your job ;) \n\nJust go actually hustle, instead of insulting people based on their genders on social media. That’s never gonna take you anywhere in life.",
        "Feel free to be rude I do not mind but lgbt is a issue that will swoop you by your legs if one country doesn't destroy it early it's like a spreading cancer and no I'm not the kind of person to just bring one problem and ignore the rest. I always speak up against a cancer that is rampant which is corruption. Every party every single one is corrupt to a large extent.i only targeted the lgbt issue because sooner or later we will have to deal with it and mainly because this post didn't mention or have anything to do with the rampant issues",
        "Homosexuality has existed since the v old times, to the point that it was actually pretty normal and acceptable to be homosexual. That didn’t really hamper the population of our today’s world, right? The simple reason is the fact that it’s not a choice. Some people just end up liking people of the same sex. \n\nEven after reading and knowing sm about homosexuality, I’ve not become a homosexual, simply because I’m straight. Just like how some xyz person won’t suddenly turn gay/bi/lesbian if they read more about it. We’re humans, and we realize what we like and what we don’t. Petty example, but a pure vegetarian person wouldn’t wanna eat non vegetarian simply because they heard about it lol. \n\nYour problem is here is that you think it’s something people consciously choose. But if you’d have ever bothered to listen to somebody from the lgbtq community, you’d realize that it’s not a choice for them. Since you already used to bully gay people, why do you think they’d “choose” to be gay? Why’d they want to make their life 10x more difficult than it already is? \n\nYou can speak up against lgbtq as much as you want, but people hiding their sexuality can become a v huge problem in itself. I’ve heard of unhappy marriages, divorced couples, and lonely people just because they couldn’t come out of the closet. Try seeing the other side, and reading more about it too.",
        "Sure it might have been decent in the past.but the time for talking is now over because almost every time lgbtq spreads it brings degeneracy and failure to renew the population. Take USA for example they have failed to meet the replacement population quota that means at something during the future there will be more retired people than young and active population. It must be stopped and looking at the choices the Indian majority has made lgbtq won't be hitting us for a long time",
        "Nice, glad you chose the path of high road and civil discussion. I don’t know what you found as propaganda from mainstream, but I have expressed, are clearly stated by him, and how is videos are output. I have seen quite a lot of his videos, his podcasts and also his war room. I came to the conclusion after doing my research on him. Yet you try to defend him with your perception of him but not facts or reasoning at the least. \n\nIf you had an addiction with gaming, it was over come by you, he didn’t cast a spell, he told you what you already know, yet take credit for your work. Which is what pisses me off about him. \n\nHomie, he doesn’t give a fuck about men. You provide him a view, which generates him money, that is why, he provides shit that appeals to you, but he’s just profiting out you. If your view meant nothing, he wouldn’t give two shits about you. That’s my take anyway, in the end, if he makes you a better person, and you genuinely believe it than I am happy for you.",
        "Even in a free country like the US, the population of lgbtq people is only around 7%. \n\nIn fact, I’m pretty sure there are more than 7% of citizens who don’t wish to ever get married. You gonna beat ‘em up too for not contributing to the population? Note that this decision is actually by choice*\n\nOh there are infertile people too, or those who’ve fertility issues. They make up about 15-16% of the population. They’re also unable to have kids. Go ahead and beat them too.\n\nYou can go check the official stats.",
        "no it just means men like you are still sucking their mommies boobies",
        "same for men",
        "then why did you mention keyboard wars... choose your battles. Stop being so dumb"
    ],
    "cleaned_text": "hateful new edgy rant greeting fellow indian homies disclaimer post contain parts discussing different religion lgbtq community bring conversation way trying attack specific community dont know tired mentally exhausted looking hate spread social media platforms women lgbtq community peoples perception masculinity notice mostly social media occasionally friends say whenever open youtube content pushed red pill community brain dead dick riders claim woman hobbies gay abeing ny member lgbtq community mental illness men dont loyal spread seed first anytime hear want puke yet woman stay loyal men pregnant one person bagage everytime get video choose recommend however still popup claim want traditional woman house wifes shouldnt male friends shouldnt work need sign prenup like kinda brain dead fuck face thinks like thought people smart enough realize crap yeti look comments seemed support like bruh think watching content instagram heavily targeting women reason clip woman making stupid mistake everyone comment section begins generalise comment women get people trying make joke stopped joke became instigation technique god forbid make comment men stupid shit replies butt hurt men claim joke attack male community yet also comment women women take joke audacity lgbtq posts even simple happy pride post gets much disgust hatred people begin claim part hinduism mental illness western media influence well fellow hindus youre wrong lgbtq maybe acronym might taken western media acts homosexuality transgenderism hinduism long time sources httpsacademicoupcombookchapterabstractredirectedfromfulltexthttpsacademicoupcombookchapterabstractredirectedfromfulltext httpswwwoxfordbibliographiescomdisplaydocumentobooboxmlhttpswwwoxfordbibliographiescomdisplaydocumentobooboxml httpswwwindiatodayinindiastoryinstancesofhomosexualityamonglgbtsinancientindiahttpswwwindiatodayinindiastoryinstancesofhomosexualityamonglgbtsinancientindia like dont support repelled community fine whatever go posts catered lgbtq community comment forced watch endure scroll past even stop following instead go place dedicated safety people community feel welcome haters go attack feel atheists agnostics comes church temple mosque say mental illness believing imaginary bearded man sky live let live finally tate meat riders amount people claim andrew tate messiah spread words wisdom stupid people follow content get charismatic guy ever people see role models biggest sheep like good role model man offers nothing materialistic ideology money sells people forget see made money cam sites taking advantage depressed men casinos gambling preaches man islam principles based quran admit knowledge quran limited still know condones alcohol gambling using religion cover hide bad influences dont care people drink claiming man god yet indulging sin great indicator hypocrite end day clout chaser wish admits fans stop treating like morpheus giving way matrix say get people freedom watch please nothing wrong content consume nowadays generating hate dividing communities reason theres need battle sexes us co dependent cant claim god hate people people suck without even putting effort even kind cant find kindness anywhere lucky bump angels people remind us kind people exist us privileged kind people around lets kind nice even opinions differ ",
    "cleaned_title": "hateful new edgy rant",
    "cleaned_selftext": "greeting fellow indian homies disclaimer post contain parts discussing different religion lgbtq community bring conversation way trying attack specific community dont know tired mentally exhausted looking hate spread social media platforms women lgbtq community peoples perception masculinity notice mostly social media occasionally friends say whenever open youtube content pushed red pill community brain dead dick riders claim woman hobbies gay abeing ny member lgbtq community mental illness men dont loyal spread seed first anytime hear want puke yet woman stay loyal men pregnant one person bagage everytime get video choose recommend however still popup claim want traditional woman house wifes shouldnt male friends shouldnt work need sign prenup like kinda brain dead fuck face thinks like thought people smart enough realize crap yeti look comments seemed support like bruh think watching content instagram heavily targeting women reason clip woman making stupid mistake everyone comment section begins generalise comment women get people trying make joke stopped joke became instigation technique god forbid make comment men stupid shit replies butt hurt men claim joke attack male community yet also comment women women take joke audacity lgbtq posts even simple happy pride post gets much disgust hatred people begin claim part hinduism mental illness western media influence well fellow hindus youre wrong lgbtq maybe acronym might taken western media acts homosexuality transgenderism hinduism long time sources httpsacademicoupcombookchapterabstractredirectedfromfulltexthttpsacademicoupcombookchapterabstractredirectedfromfulltext httpswwwoxfordbibliographiescomdisplaydocumentobooboxmlhttpswwwoxfordbibliographiescomdisplaydocumentobooboxml httpswwwindiatodayinindiastoryinstancesofhomosexualityamonglgbtsinancientindiahttpswwwindiatodayinindiastoryinstancesofhomosexualityamonglgbtsinancientindia like dont support repelled community fine whatever go posts catered lgbtq community comment forced watch endure scroll past even stop following instead go place dedicated safety people community feel welcome haters go attack feel atheists agnostics comes church temple mosque say mental illness believing imaginary bearded man sky live let live finally tate meat riders amount people claim andrew tate messiah spread words wisdom stupid people follow content get charismatic guy ever people see role models biggest sheep like good role model man offers nothing materialistic ideology money sells people forget see made money cam sites taking advantage depressed men casinos gambling preaches man islam principles based quran admit knowledge quran limited still know condones alcohol gambling using religion cover hide bad influences dont care people drink claiming man god yet indulging sin great indicator hypocrite end day clout chaser wish admits fans stop treating like morpheus giving way matrix say get people freedom watch please nothing wrong content consume nowadays generating hate dividing communities reason theres need battle sexes us co dependent cant claim god hate people people suck without even putting effort even kind cant find kindness anywhere lucky bump angels people remind us kind people exist us privileged kind people around lets kind nice even opinions differ",
    "cleaned_comments": "yeah theres lot garbage internet provides power amplify good bad agree scares amount parents issues giving kids ipads access hateful stuff might thinks cool whatever worry future like people treat kind sort weakness kid safe websites filters apps etc upto parent setup restrictions yes even exposed harmful things sometimes although imo topic youre talking relevant adults ur username feels like home leaving social media bec wan na productive leaving social media stay away edgy people ddd said true relevant adults mean adults anyways giant sized children add teens worry adolescents make teens feel rebellious cool right mean thought went good guidance help navigate yes ikr exhausting really dont understand hate towards lgbtq seen grave sin something disgusting people dont get even faithcultural values doesnt allow homosexuality business follow faith traditions let others follow lol plus whole unnatural need babies argument stupid majority world straight hell still overpopulation crisis atleast countries lol imagine straight people suddenty turned gay short time im sure theyll quick take away harsh views considering fact choice people make dont get started red pill bros im exhausted block accounts live peacefully knowing idiots whod never achieve true enlightenment shouldnt waste time agree cant tell much rages certain religious groups acts oppressed like havent stoned electrocuted murdered people existing part lgbtq community red pill bros worse sure red pill pick girls even worse dont think women right vote like bitch go read book im part religious group pls dont generalize get sentiment yes ik sucks see women hating women like hey dont hold onto course didnt mean generalise used broad term instead targeting specific religion understand agree point noticed bring really uneducated girls podcasts videos ive seen many people point hypocrisy bringing actually learned women discussions ofc wont know whatd happen lol oh god yes sad see dont understand women go onto podcasts get shit dudes whose whole personality like tuna internalized misogyny thats term dont hate women feel sad sometimes still attach selfworth existence man instead ownselves hope break free end humans deserve level equality true hate everyone equally misanthrope think also mis sed point lol squidward women comments saddening man insane lmao get tldr long rants dont forget reddit hub assholes gender ratio bad especially indian subs even women say something slightly opinionated regarding men whole mass incel comments would flooded inbox easy internet anonymity given liberty people bully pass hateful comments consequences whatsoeversomeone said every subreddit mass people echo chambers certain issue misogyny making homophobic dank comments passing sexual remarks women issue subreddits mean muslims pretty oppressed india obviously excuse lgbtq oppression tldr social media platforms filled hateful poop people gay case nature nurture either way beyond persons control point hating discriminating folks start become pain ass choose fight themor use better lube everytime see women literally want throw phone away im guy guys make mistakes said exactly always think op thank putting words reason deactivated instagram really dont want get back anytime soon seeing people like makes sooo scared sad pathetic see hatred intolerance much negativity comment section disgusting many posts someone makes valid point called names like peoples first instinct comments abuse others rather logically talking saying messed wow youre cool good run used harmless fun turned insult insecure incels use sad young men influenced think war sexes battle trying survive need sad see many man completely disregard feminism western propaganda spreads hate men case yeah guy understand sometimes think people want others say funny needs taken funny joke even said direct attack person humor requires thinking skills cant attackbully person regard joke lmao gon na lie first half patrick thanks homie comment section gone toxic filled people want fake validation fake internet people different makes unique hate things people love way expressing self worth insecurities guess try bring people enjoying something asked speak didnt like say opinion get thats calling new born baby ugly reason pissed parents ask cuz duh free speech indeed sad saw comment section muslim guy great neet ug like scored rank digits topped like entire north east oh god comments targetting religion shocked nobody congratulating war comments muslims acting like community hindus idk man sick everyone retarded point sad everyone one influenced hate taught generalize false patriotic self imposed values make want hate anyone doesnt belong particular community sad dark humour stopped funny everyone started try saying kill gay people lol funny tired toxic stuff actively filtered feed show cat videos hobbieslike gamingshows etc indian instagram community extremely toxic year old wannabe chads kill gays bruh joke bruh whats joke ask like gays killed duh see funny healthy way navigating social media wan na chads dont understand whole person built hiding feelings projecting insecurities others sad heard class kid met function say friends think hitler right idolized terrified left wondering kids latching onto days hijacking top comment provide response women men please use women whenever get trolled peace never harmless women see opposite sex kinda makes forget notice things times reallyyyyy tried change alogirthm posts discover feed reels never want see always pop ask friend send certain memes stuff good ol pearly believes woman shouldnt right woman likes get cheated biggest reason fall society say thanks coffee wash im done lmao ikr shes biggest pick ive ever seen funny enough video said id rather pick skip mean ab iske baad kya expect karsakte hai isse omg truuue soo insufferable clout chaser doesnt care listeners cares saying thing red pill podcast say ok ko dont mind lesbians gays living comes trans converted peoplei think transitioned without forced group rd party parents let child age first decide whether man wants convert woman woman man watch documentary matt provided gives topic agreedisagree ways see track record people type fruitcakery globallyminimum required know get disagreements hey least keeping civil mate good sunday get coming especially comes transgender movement lot people understand lot people scared talk question fear labelled transphobe whole subject gender dus photos topic sure first case dates back th century said makes sense propose lot people aware due social media cases goes viral seemed bad cases used echo chambers still subject discussed interesting lot gender change thailand example huge acceptance also know documentary talking one matt walsh im assuming generally dont like guy documentary woman head ache go idea people chose debate couldnt even answer simple question whats woman especially gender science professor sitting front logic biased bible countered lot claims woman ones get pregnant states bible yet tackled women infertile think answer woman quite simple term woman social constructed word society uses deem someone meet certain criteria dont get wrong im talking biological female sex defined science woman defined society label colours clothes certain behaviours people say identify woman mean identify image society created biological sexes male female intersex though dont understand mean minimum could elaborate bet havent seen anything describing atrocitiescrimes committed times memes reason wish stuff like hitler wont shut social media told let new hitlers born honestly dont get appeal patrick bateman hiding feelings stuffbateman works best meme real life inspirationhes literally full insecurities covers showing emotions helping peak human instagram bit hard super easy youtube watchclick videos regarding topics dont click others time shows want see wan na see anything differentincognito tab way instagram recommend following random pages topics like save videosin insta save like share make sure pages follow topics like see watch reels topics skip reel dont wan na see might take time works countries illegal transition turn dont really think anyone pressuring anyone trans considering much transphobic world one quite witty lol nice hypocrisy thread genocidal hate muslims india try blame muslims opposite mean seen loads comments edgy liberallgbtatheists religion calling mental illness way around hatred calls banning propagating religion propagating gender ideology right banning genocide calls keeping religion schools context hijab flying pride flags okay okay telling muslims keep religion home telling lgbt keep sexuality home hatred subreddit full support hijab ban sanghis atheists liberals engaged gaslighting muslims like thread since like sides nonsense blame muslim victims tell whats difference andrew tate red pill bros one comments ive developed deep sense hatred towards muslim men reasons take gyaan used gaslight muslims maybe introspect hated spew nonsense like deep sense hatred towards muslim men thank sorry please research people unsatisfied knee replacement surgery transgender people surgeries hate rhetoric transgender community live usa one pressuring anyone transgender second takes years counseling cant surgery till nobody wakes suddenly transgender feel atheists agnostics comes church temple mosque say mental illness believing imaginary bearded man sky live let live gay abeing ny member lgbtq community mental illness would feel bad loads edgy atheists done exactly subreddit calling religion mental illness calls banning teaching loads nonsense hijab bans loads extremists subreddit supported calls keeping religion schools context hijab flying pride flags okay okay telling muslims keep religion home telling lgbt keep sexuality home hatred thats theological context muslims dehumanized india sanghis never banned mainstream opinion atheists liberals subreddit whats wrong generalization mean heres one comment ive developed deep sense hatred towards muslim men reasons bro make new account follow better content stop best idea anyone given far absolutely edge lord finds sense power moral superiority begin stop believing god ever irrespective religion point nice everyone dont support move life worry goes atheists agnostics ever part lgbtq movement mental illness thats brain dead ignorant statement make say ignorant case backed science backed cases backed religious biases fear acceptance homosexual tendencies point dont even bother put opinions know sensory receptors arent working theyre behaving like narcissitic mind business stay away people sad society leading want credit west want go west want west etc comes upliftment society suddenly western influencesometimes think west doesnt hate us throw racism us us like aa bail mujhe maar ironically started simple satirical joke sigma many incels invaded ruined taking seriously misogyny homophobia normalized instagram comments days thanks making post op point waiting nuclear apocalypse kill us man god show kill us humanity huge mistake thank try nah friend although understand coming disagree humanity huge mistake course may feel heading darkness still angels form nurses people take elderly people volunteer cant look away still fighting spread love kindness least could stop spreading hatred despair women didnt realize red pill content thats push indian social media thought case primarily us damn algorithm super screwed issue lgbtq issue starts involving minors someone knew grade identifies sheher turning point dont care grown adult decides gaylesbian anything heshethey wish also dont like minors start following trend tate bs fills user red pill much crave every presenting always one sided facts woman cheat women leave nonsense based rare cases thinking even valid indian society nah man red pill gang everywhere frightening spreads like wildfire hmm intricate situation cant pretend know gender dysphoria average person yet rough subject hard handle way minor becomes major makes sense choose gender prefer yet intricate grade kid said gay probably gay cant choose like said dont think grade kid would identify different gender attention fame specially india people treat taboo sure joking actually believes best open dialogue ask thinks way thats would always tell quote bertand russell children nowadays love wise hatred foolish wasnt case year ago yeah guys weird shit extent ever since tate characters like bateman became super famous things went hand ive got nothing say dont know ive reasons even postcomment youre talking ive always emphasized word make sure write ensure people dont take everybody comment pointing hypocrisy shown support banning religion banning hijab read comments youd realize ive mentioning keep religion private let make political decisions many people want ive mentioned lgbt business hope read comments properly attack decided see sides perspective figured would different limited experience ive never heard much conversation lgbtq issues hell andrew tate thing india swine would likely call indians betas shit like entire business model manipulating coercing women work hes literally charged human trafficking doesnt make people question choices life think theres something really wrong one thing id like add casual dismissal feminism see examples brash provocative statements falsely attributed feminism also counterculture around seeping mainstream funnily enough good chunk examples caricatures shown examples toxic masculinity reflected women examples women really shitty funny specific type hate targeted ive seen lot know rude dont know someone please explain means ayyyyyyy whole world getting screwed social media algorithms figured rage inducing polarising content going get engagement problem going increase future thought reddit would different also turning place people bash others dont social media accounts deleted othersbecause realised good mental health talk stuff vent rage polarising content real life helping whatever apps using make money believe end day instagram facebook reddit companies last people care kind social issues literally hate social media apps bringing worst people recently another redditor mentioned even aggravating clinically diagnosed anxiety bringing something negative constantly said might last post comment ever think might leave reddit keeps happening keep keeping colonel though dont understand mean minimum could elaborate basically types crime trans converted people doingmostly get tw certain accounts remember spend time internet shitty people would see bad mental healthsrsly increase interaction irl shitty experiences considerably decreasepeople frustruated lives thats proabably abuse othersi personally hit lowest covid time hate castegender still trolling people nonetheless depression funny still havent recovered atleast ive stopped trolling people almost never rude people internetbeing chronically online surefire way get mental fucked edit trolled tateriders mysogynists feminists people always onlineyep irony religious people people happier etc dark humour stopped funny became dark humour currently living tsunami brain dead redpilled wannabe tates cant get married mommas daddies cant arrange marriage coincidentally zombies people lack social skills even connect women basic level share waman memes hate women online could never meaningful relationship irl act females good fuckingnot like getting action first place gold diggers run alpha men honestly sad never met selfrespecting decent woman seriously aspire become alpha men obsessively following alpha tate co thats beta thing dude rant seen understanding second one prominent women men insecure take anger women days dont family cant make one lgbtq dont post comments disregard pride month unfortunately good never spreads like wildfire like bill updated opinionated best keep yeah aint going hurt follow jill also knows make short posts stops using ig toxic know positive audiences knows difference reply opinion tells people face problem best keeps well said op theres simply much hate social media reason religion hating straights hating gays masculine hating feminine like live bro fight whenever topic brought irl brainwashed dumb people start physical fighting dont logical point talk irritating hard see hate spread everywhere staying probably best okay may misunderstood mentioned bill compliment said bill keeps referring saying issue mean ever reason youre deliberately trying spread hatred commending opinion also enough maturity keep self ever chose attack fine defend would make short posts take time elaborating thoughts waste time dont read could stop using however mentioned people wrapped mess form bringing awareness throw instagram away would raising awareness ill selfish dude cares know nice folk thats point nice people reason shouldnt give idea hating need survive believe know difference might curious bringing mean sounds like great thing sharing problems good thing instead fighting alone every one get friend thought stupidpositive joke mistranslated aggressive attack yeah sometimes sea violence aggression cant help lost hope sometimes become apathetic trying work swear keep falling backwards keep keeping friend end day take care need make sure okay care others sure go ahead wont change thing continue spread hate liberty option money everything matters want safety thugs run india outside urban areas need money materialistic fundamental dont support capable living outside crammed apartment building women tried use time cant find points fight keyboard war end getting called ugly fat unwanted bitches cant walk alone night leave yeah thought comeback required time organization put malware females online profile leak private information shut harass switched dishwasher needs reason made task attack lgbtq person even school days used beat gay kid daily inside toilets oh wow beating someone choose like thats cool course especially choice life wrong feels right end getting called call assuming men ugly fat unwanted dogs aspect still walk alone night perhaps never debated strong woman even wrong btw isnt im sure youve beaten random people lol wrong life choices doesnt matter right wrong anymore done good job making people around believe im right need lower younger population wokism brought stains countries majority india even youngsters believe victory near strong keyboard fights even relatively fat person low muscle could grab fit female take women arent needed anything reproduction dont serve important job richest women made divorce creatures inflated egos born purpose riding dicks nice response since shows females already practicing take dicks mouth coffee means men drink women classic shenanigansso fair women return practicing sucking cocks get need know propaganda mainstream viewsure past might bad without id never quit video games start working grindhe promotes men strong blatant hate contradicting youre making others believe youre right probably feeds empty soul without even knowing somethings wrongright time youre worried sort western world wokeism destroy country dont wan na engage namecalling either choose unapologetic hater instead pretending actually care country youre concerned hope speak things going wrong country instead simply cherrypicking lgbt issue isnt even adverse effect right wan na know made hateful towards women lgbtq people dont think humans even dont state multiple rich women businesses still involved several workforces end trust doesnt matter gender lol youre indisposable world like women arent needed anything imp many job go actually hustle instead insulting people based genders social media thats never gon na take anywhere life feel free rude mind lgbt issue swoop legs one country doesnt destroy early like spreading cancer im kind person bring one problem ignore rest always speak cancer rampant corruption every party every single one corrupt large extenti targeted lgbt issue sooner later deal mainly post didnt mention anything rampant issues homosexuality existed since v old times point actually pretty normal acceptable homosexual didnt really hamper population todays world right simple reason fact choice people end liking people sex even reading knowing sm homosexuality ive become homosexual simply im straight like xyz person wont suddenly turn gaybilesbian read humans realize like dont petty example pure vegetarian person wouldnt wan na eat non vegetarian simply heard lol problem think something people consciously choose youd ever bothered listen somebody lgbtq community youd realize choice since already used bully gay people think theyd choose gay whyd want make life x difficult already speak lgbtq much want people hiding sexuality become v huge problem ive heard unhappy marriages divorced couples lonely people couldnt come closet try seeing side reading sure might decent pastbut time talking almost every time lgbtq spreads brings degeneracy failure renew population take usa example failed meet replacement population quota means something future retired people young active population must stopped looking choices indian majority made lgbtq wont hitting us long time nice glad chose path high road civil discussion dont know found propaganda mainstream expressed clearly stated videos output seen quite lot videos podcasts also war room came conclusion research yet try defend perception facts reasoning least addiction gaming come didnt cast spell told already know yet take credit work pisses homie doesnt give fuck men provide view generates money provides shit appeals hes profiting view meant nothing wouldnt give two shits thats take anyway end makes better person genuinely believe happy even free country like us population lgbtq people around fact im pretty sure citizens dont wish ever get married gon na beat em contributing population note decision actually choice oh infertile people whove fertility issues make population theyre also unable kids go ahead beat go check official stats means men like still sucking mommies boobies men mention keyboard wars choose battles stop dumb",
    "light_cleaned_title": "Being hateful is the new edgy *Rant*",
    "light_cleaned_selftext": "Greeting fellow Indian homies, **Disclaimer: This post will contain some parts of discussing different religion and LGBTQ community, this is to bring up a conversation and in no way trying to attack a specific community.** I don't know about you all, I am tired and mentally exhausted looking at the hate being spread on social media platforms. Against women, lgbtq community, and peoples own perception of masculinity. I notice this mostly on social media, and occasionally from what my friends say. Whenever I open my youtube, the content that is pushed to me is the red pill community, with some brain dead dick riders, who claim that \"woman, have no hobbies!\", \"Being Gay or abeing ny member of the LGBTQ community is a mental illness\", \"Men don't have to be loyal because they can spread there seed (first of all, anytime I hear that, I want to puke), yet woman have to stay loyal to men because they can be pregnant by only one person and after that they are a bagage.\" Everytime I get this video, I choose, do not recommend, however they still pop-up. They claim to want traditional woman, who have to house wifes, shouldn't have male friends, shouldn't work but need to sign a prenup, like what kinda brain dead fuck face thinks like that. I thought people are smart enough to realize that this is crap, yeti I look at the comments and they only seemed to support it, like bruh, think for yourself. Not only that, I have been watching the content on instagram that are heavily targeting women for no reason, a clip of woman making a stupid mistake, and everyone in the comment section begins to generalise it with a comment \"women\". I get that people are just trying to make a joke, but it has stopped being a joke and became more of a instigation technique. God forbid you make a comment on men doing stupid shit and the replies from butt hurt men, who claim that is not a joke but an attack on male community, yet they can also comment \"women\" but women have to take it as a joke. The audacity. Then there any of the LGBTQ posts, even as simple as a \"Happy Pride\" post gets so much disgust and hatred as people begin to claim \"it is not part of hinduism, it is mental illness!\", \"Western Media Influence\" well my fellow hindu's, you're wrong, LGBTQ, maybe the acronym that we might have taken from the western media but the acts of homosexuality and transgenderism has been in Hinduism for a very long time. Sources: [https://academic.oup.com/book/11527/chapter-abstract/160309678?redirectedFrom=fulltext](https://academic.oup.com/book/11527/chapter-abstract/160309678?redirectedFrom=fulltext), [https://www.oxfordbibliographies.com/display/document/obo-9780195399318/obo-9780195399318-0223.xml](https://www.oxfordbibliographies.com/display/document/obo-9780195399318/obo-9780195399318-0223.xml), [https://www.indiatoday.in/india/story/10-instances-of-homosexuality-among-lgbts-in-ancient-india-1281446-2018-07-10](https://www.indiatoday.in/india/story/10-instances-of-homosexuality-among-lgbts-in-ancient-india-1281446-2018-07-10). Like if you don't support and are repelled by the community, fine, whatever, but to go on to the posts that are catered for LGBTQ community and comment about how you are being forced to watch or endure, you can scroll past or even stop following them, instead you go to a place that was dedicated for safety for the people in community, for them to feel welcome, the haters go there to attack. How do you feel if atheists and agnostics comes to your church, your temple or your mosque and say you have mental illness for believing in an imaginary bearded man in the sky. Live and let live. Finally the Tate meat riders, the amount of people claim Andrew Tate to be a messiah and spread his words as wisdom is just so stupid. Some people follow him for his content, I get it, he is a charismatic guy, how ever, their are people who see him as role models are the biggest sheep. Like why is he a good role model? The man offers nothing but materialistic ideology and money, that is what he just sells. People forget to see how he made money, through cam sites, taking advantage of depressed men, casino's, gambling. He then preaches that he is a man of Islam and his principles are based off of Quran, I will admit my knowledge about the Quran is limited, still I do know it condones, alcohol and gambling, to him, he is just using the religion as a cover to hide his bad influences. I don't care if people drink or not, but claiming to a man of god, yet indulging in sin, is a great indicator that they are a hypocrite. At the end of the day, he is a clout chaser, and I wish he just admits it and his fans stop treating him like Morpheus who is giving them a way out of the matrix. I say this again, I get that people have freedom to watch what they please, nothing wrong with that, but all the content that we consume nowadays are just generating hate and dividing the communities for no reason, there's no need to be a battle between sexes, all of us are co dependent, we can't claim \"God, I hate people!\", \"People Suck\" without even putting an effort to even be kind to each other. We can't find kindness anywhere, if we are lucky, we bump into angels of a people, that remind us that kind people exist. Not all of us are privileged to have kind people around. So let's just be kind, and nice to each other, even if our opinions differ.",
    "light_cleaned_comments": "Yeah, there's a lot of garbage out there. Internet provides the power to amplify both good and bad. I agree with you, what scares me is that the amount parents have no issues giving their kids iPads, who will have access to hateful stuff, they might thinks it’s cool or whatever but I worry for the future, it’s like people treat being kind is some sort of a weakness There are kid safe websites, filters, apps etc. It's upto the parent to setup restrictions. But yes, even when you do that, they can be exposed to harmful things sometimes. Although IMO, the topic you're talking about is more relevant to adults. UR USERNAME FEELS LIKE HOME leaving social media bec i wanna be productive :( leaving social media to stay away from edgy people :DDD What you said is true, it is more relevant to adults, I mean who are adults anyways, just some giant sized children. To add on, it the teens that I worry about too! Adolescents can make teens feel as if being rebellious is cool and right, I mean I thought that I went through it, but I had some good guidance to help me navigate. Yes ikr, it’s so exhausting. I really don’t understand the hate towards lgbtq. It’s seen as this grave sin, or as something disgusting by most people. I just don’t get that even if your faith/cultural values doesn’t allow homosexuality, why is it your business? You follow your faith and traditions, and let others follow theirs lol. Plus, the whole “it’s unnatural, we need babies” argument is so stupid. Majority of the world is straight, hell, we’re still having overpopulation crisis atleast in some countries lol. Imagine if all straight people suddenty turned gay for some short time, I’m sure they’ll be quick to take away all their harsh views, considering the fact that it’s not a choice that people make. :/ And don’t get me started on those red pill bros! I’m so exhausted of them. I just block those accounts, and live peacefully knowing that there are some idiots out there who’d never achieve true enlightenment, and I shouldn’t waste my time on them :) I agree with you, I can't tell you how much it rages me, when certain religious groups acts oppressed, like they haven’t stoned, electrocuted and murdered people for just existing as part of an LGBTQ community. The red pill bros are worse for sure, but the red pill \"Pick me\" girls are even worse \"I don't think women should have the right to vote\" like bitch! Go and read a book! I’m a part of that religious group💀 so pls don’t generalize, but I get your sentiment. Yes ik, it sucks to see women hating on women. Like hey, if we don’t hold onto each other, who will? :/ Of course, I didn’t mean to generalise, I used it as a broad term instead of targeting any specific religion but I understand and agree with your point. And have you noticed how they bring some really uneducated girls to these podcasts and videos? I’ve seen so many people point out this hypocrisy, that they should be bringing actually learned women for discussions. But ofc they won’t because we all know what’d happen lol :) Oh god yes! It is sad to see, I don’t understand my these women go onto these podcasts only to get shit on by dudes whose whole personality is like a tuna can. Internalized misogyny - that’s the term for it. I don’t hate those women, I just feel sad for them sometimes, because they still attach their self-worth and existence to a man, instead of their ownselves. I hope they break free out of it, because in the end, we’re humans, and deserve some level of equality Very true! I hate everyone equally. I am a misanthrope. I think you also mis sed my point lol Squidward? the ‘women ☕️’ comments are so saddening man it’s insane lmao Can we get a TLDR for long rants? Don’t forget that reddit itself is a hub for such assholes. The gender ratio here is so bad (especially on indian subs) that even if you as a women say something slightly opinionated regarding men , the whole mass of incel comments would be flooded in your inbox because it’s that easy. Internet anonymity has given liberty to such people to bully and pass hateful comments with no consequences whatsoever.Someone said that every subreddit has a mass of people that are the echo chambers of a certain issue. Misogyny, making homophobic “dank” comments, passing sexual remarks on women, is THE ISSUE of such subreddits. i mean muslims are pretty oppressed in india, but obviously no excuse for lgbtq oppression Tldr: social media platforms are filled with hateful poop people. Is being gay a case of nature or nurture? Either way it's beyond that person's control, no point in hating and discriminating folks for it. If they start to become a pain in your ass, you can choose to fight them...or use a better lube Everytime I see women ☕, I literally want to throw my phone away. I'm a guy and guys do make mistakes too. You said exactly what I always think OP, thank you for putting into words. This is the only reason why I deactivated my Instagram and really don't want to get back into it anytime soon. Seeing people like this makes me sooo scared. It's sad and pathetic to see this hatred. Such intolerance, so much negativity, and the comment section is so disgusting for many posts. Someone makes a valid point and they are called names. Like people's first instinct in comments is to abuse others rather than logically talking or saying. It's messed up Wow you're so cool They had a good run when they were used for harmless fun. Now they just turned into an insult that insecure incels use. It is sad, the young men are being influenced to think that there is a war between sexes, where is not a battle, we are trying to survive and we need each other. Sad to see many man completely disregard feminism as a western propaganda and it spreads hate against men, when it is not the case. Yeah, As a guy I understand, sometimes I just think people want others to this what they say is funny, only needs to be taken as funny joke, even if what said is a direct attack on a person. Humor requires thinking skills, can't attack/bully a person and them regard that as a joke. Lmao! Not gonna lie, you had me in the first half NO THIS IS PATRICK!! Thanks homie! The comment section has gone toxic, filled with people who want fake validation from other fake internet people, being different makes you unique, so hate things that people love. It's just a way of expressing their own self worth and insecurities I guess, when they try to bring people down for enjoying something. When asked why speak if they didn't like it, they say \"It's my opinion, get over it!\", that's calling a new born baby ugly for no reason and when the pissed of parents ask \"why\", 'Cuz duh! I have free speech!\". It is indeed sad Saw this comment section. A Muslim guy did great in neet ug like scored a rank in 3 digits and topped like the entire north east. Oh my god the comments. They were all targetting his religion. I was shocked. Nobody was congratulating him. It was a war in the comments. The Muslims were acting like he won for the community and the Hindus were just... Idk man. It's sick. Everyone is retarded at this point. That is sad, everyone one are being influenced to hate, they are being taught to generalize which and false patriotic self imposed values that make them want to hate anyone that doesn't belong to a particular community. It is sad. Dark humour stopped being funny when everyone started to try it. Saying kill all gay people lol is not funny. I have been so tired of all that toxic stuff that i actively filtered my feed to only show cat videos and my other hobbies(like gaming,shows etc ) but Indian Instagram community is extremely toxic by this 12 year old wannabe chads \"Kill all Gays\" \"Bruh it's just a joke bruh\" \"what's the joke you ask?\" \"Like all gays will be killed duh!\" \"see so funny!\" That is a very healthy way of navigating social media! The wanna be chads don't understand that their whole person is built on hiding their feelings and projecting their insecurities on others. It is sad, I heard a 10 class kid, I met at a function say to me, that he and his friends think \"Hitler is in the right! He should be idolized\" That in itself terrified me, as it left me wondering as of what are these kids latching onto these days. hijacking the top comment to provide a response for 'women ☕️' and that is 'Men 🍼' Please use this women, whenever you get trolled. Peace. it was never harmless for women I can see that, being in the opposite sex kinda makes me forget to notice things at times. I reallyyyyy tried to change my alogirthm for the posts and the discover feed, but the reels I never want to see always pop up. I had to ask a friend not to send me certain memes and stuff. Good Ol Pearly, believes woman shouldn’t have right, woman likes to get cheated on and they are the biggest reason for the fall of society. I just say thanks for the coffee, wash it when I'm done lmao Ikr. She's the biggest pick me I've ever seen 😂 and funny enough there was a video in which she Said: I'd rather be a pick me then a skip me . I mean ab iske baad kya he expect karsakte hai isse Omg so truuue! She is soo insufferable, She is just a clout chaser, she doesn’t care about any of her listeners, all she cares about is saying the same thing other red pill podcast say Ok. KO. I dont mind lesbians & gays living but when it comes trans converted people,i think they should be transitioned without any forced group by a 3rd party or parents. Let the child be 18+ age first to decide whether man wants to convert into woman or woman into a man. I do have to watch the documentary **Matt** provided which gives me the topic into \"Agree-Disagree' both ways. I do have to see the track record of these people what type of fruitcakery they are doing globally.Minimum 100 is required. I know i will get disagreements but hey at least i am keeping it civil here mate :) Have a good sunday! I get when you are coming from, especially when it comes to Transgender movement, not a lot of people understand it, lot of people are scared to talk about or question it, because they fear they will be labelled as a transphobe. The whole subject of Gender dus photos is not topic for sure, as the first case dates back to the 19th century: That said, it makes sense of what you propose, lot of people are now aware of this due to social media and most of the cases that goes viral seemed to be the bad cases that are used in the echo chambers. It is still a subject that is being discussed, which is interesting because there is a lot of gender change in Thailand for example and there is a huge acceptance of them over there. I also know the documentary you are talking about, the one with Matt Walsh I’m assuming, I generally don’t like the guy, and his documentary “What is a woman” was a head ache to go through, I have no idea why the people who he chose to debate, couldn’t even answer a simple question of “what’s is a woman”, especially where there is gender science professor sitting in front him. His logic is biased from bible and can countered a lot. He claims, woman are the ones that can get pregnant as that it what it states in the Bible, yet it can be tackled with “what about women that are infertile”. I think the answer to “what is a woman” is quite simple. The term woman is a social constructed word that society uses to deem someone when they meet certain criteria, don’t get me wrong, I’m not talking about biological “female” sex, which is defined by science, “woman” was defined by society, as they label colours, clothes, certain behaviours, so when people say they identify as a woman, it mean they identify as the image that the society created. There are biological sexes, Male, Female and Intersex. All though I don’t understand what you mean by minimum 100, could you elaborate on that? I bet they haven't seen anything describing the atrocities/crimes he committed during those times but those memes. This is the reason I wish stuff like Hitler won't be shut down on social media but be told as to not let new Hitler's be born. And I honestly don't get the appeal in Patrick Bateman and hiding their feelings and stuff.bateman works best as a meme but not real life inspiration,he's literally full of insecurities himself and covers it up. Showing emotions and helping each other is the peak a human can be. Instagram is a bit hard but it's super easy for YouTube. Just watch/click videos regarding your topics and don't click on others ,do this for some time and it only shows what you want to see. But if you wanna see anything different-Incognito tab is the way. For Instagram , I recommend following random pages about topics you like , save those videos(in insta save ) then like or share them and make sure most pages you follow are {topics you like to see} and then watch reels of those topics and skip any reel you don't wanna see , it might take some time but it works. In most countries its illegal to transition before you turn 18 and I dont really think anyone is pressuring anyone to be trans considering how much transphobic the world is. This one is quite witty lol Nice hypocrisy there. In the thread about genocidal hate against Muslims in India, you try to blame Muslims themselves. Here it's the opposite. I mean I have seen loads of comments from edgy liberal/lgbt/atheists on religion calling it mental illness. But the other way around is hatred. Calls for banning propagating religion to under 18 while propagating gender ideology to under 18 is a right and banning it is genocide. Calls for keeping religion out of schools in context of hijab, but flying pride flags is okay. Okay telling Muslims to keep religion at home, but telling lgbt to keep sexuality at home is hatred This subreddit was full of support for hijab ban by sanghis and atheists and liberals engaged gaslighting Muslims just like you did in the other thread. Since you like to do both sides nonsense and blame Muslim victims, can you tell me what's the difference between you and Andrew tate or the red pill bros? One of your comments >I’ve developed a deep sense of hatred towards Muslim men because of these reasons. Take your own gyaan which you used to gaslight Muslims. Maybe you should introspect why you are hated while you spew nonsense like \"I have a deep sense of hatred towards muslim men\" Thank you! Sorry but please do research. More people are unsatisfied with their knee replacement surgery. Then transgender people are with their surgeries. Again this is hate rhetoric on the transgender community. I live in the USA. No one is pressuring anyone to be transgender, and second of all it takes years of counseling and you can’t have surgery till your 18. Nobody wakes up and is suddenly transgender >. How do you feel if atheists and agnostics comes to your church, your temple or your mosque and say you have mental illness for believing in an imaginary bearded man in the sky. Live and let live. >Being Gay or abeing ny member of the LGBTQ community is a mental illness I would feel bad. But loads of edgy atheists have done exactly that in this subreddit. Calling religion a mental illness, calls for banning teaching to under 18 and loads of other nonsense. Same with hijab bans. Loads of extremists in the subreddit supported it. Calls for keeping religion out of schools in context of hijab, but flying pride flags is okay. Okay telling Muslims to keep religion at home, but telling lgbt to keep sexuality at home is hatred And that's not just in a theological context. It's when Muslims have been dehumanized in India by sanghis. But they were never banned and it's the mainstream opinion of atheists and liberals in this subreddit What's wrong with generalization? I mean here's one of your comment >I’ve developed a deep sense of hatred towards Muslim men because of these reasons. Bro make new account and follow better content, it will stop Best idea anyone has given me by far Absolutely, Most of the edge lord, finds a sense of power and moral superiority when they begin to stop believing in god. How ever, irrespective of the religion, my point is to be nice to everyone, if you don’t support it, move on, you have your own life to worry about. Same goes for atheists and agnostics too! How ever being part of an LGBTQ movement is not mental illness, that’s just a brain dead and ignorant statement to make, I say ignorant because, that case is not backed up by science, it is backed in some cases, it backed my religious biases and own and fear of own acceptance of homosexual tendencies At this point i don't even bother to put my opinions because i know their sensory receptors aren't working and they're behaving like narcissitic . So i just mind my business and stay away from such people. But it is sad that where our society is leading. We want credit from west ,we want to go to west and want west etc but when it comes to upliftment of society it's suddenly \"western influence\".Sometimes i think west doesn't hate us , throw racism on us, it's us who are like \"Aa bail mujhe maar\". This all was ironically started as a simple satirical joke \"sigma\" and many incels have invaded and ruined it by taking it seriously. Misogyny, Homophobia is so normalized in Instagram comments these days. Thanks for making this post OP At this point i am just waiting for a nuclear apocalypse to kill us all man or God themselves show up and kill us all. Humanity is a huge mistake Thank you! I will try this Nah my friend! Although I understand where you are coming from, I disagree that humanity is a huge mistake, of course it may feel as if we are all heading into the darkness, there are still angels out there, in the form of nurses, the people who take of the elderly and some people who volunteer because they can't look away, while they are still fighting to spread love and kindness, the least we could do is stop spreading hatred and despair. there is a \" women 👑\" too I didn’t realize that this is the red pill content that’s being push in Indian social media. I thought this was the case primarily in the US. Damn, the algorithm is super screwed up. I have no issue with LGBTQ+ but I have issue when it starts involving minors, someone I knew was in grade 7, and he identifies as she/her, that was my turning point, I don't care if a grown up adult decides to be gay/lesbian or anything he/she/they wish to be but I also don't like that minors start following the same trend. Tate is BS, he just fills the user with Red pill so much that they crave more of it every now and then, presenting always one sided facts how woman cheat, how women will leave you for this and that, all nonsense based on some rare cases, his thinking is not even valid with Indian society. Nah man, the red pill gang are everywhere it is frightening, it spreads like wildfire Hmm, that is an intricate situation, I can't pretend to know more about gender dysphoria more than an average person, yet it is a rough subject because it is hard to handle, in a way, once a minor becomes a major, it makes sense for them to choose the gender they prefer to be, yet it is intricate because if the grade 7 kid said, he is gay, he is probably gay, you can't choose who you like. That said, I don't think any grade 7 kid would identify as a different gender for attention or fame, specially in India and how people treat is as a taboo, if you are sure that he is not joking and actually believes it, it is best to have an open dialogue with him, as to ask why he thinks that way. Again that's what i would do. I always tell this quote by bertand russell to children nowadays: love is wise, hatred is foolish. It wasnt the case an year ago. Yeah there were guys doing weird shit but not to this extent. Ever since Tate and all this characters like Bateman became super famous, things went out of hand. I’ve got nothing to say to you, because you don’t know me, and I’ve my reasons. Even the post/comment you’re talking about, I’ve always emphasized on the word “some”. I make sure that I write “some” to ensure that people don’t take it as everybody. As for your comment pointing out the hypocrisy, where have I shown support for banning religion or banning hijab? If you read my comments, you’d realize that all I’ve been mentioning is to keep religion private, and not let it make political decisions, which is what many people want. Here too, I’ve mentioned that being lgbt is their business, and not ours. Hope you read my comments properly, and not attack just because I decided ONCE to see the other side’s perspective. I just figured that it would be…. “Different?”. In my limited experience, I’ve never heard much conversation about LGBTQ issues. How the hell is Andrew Tate a thing in India ? That swine would most likely call all Indians as betas or some shit like that. His entire business model is manipulating and coercing women to do work for him. He’s literally being charged for human trafficking. If that doesn’t make people question their choices in life, I think there’s something really wrong with them. One thing I’d like to add is the casual dismissal of feminism. Not only do I see examples of brash , provocative statements being falsely attributed to feminism but also the counterculture around seeping into the mainstream. Funnily enough a good chunk of these examples, caricatures that are shown are examples of toxic masculinity being reflected in women and examples of women just being really shitty. Funny how only a specific type of hate is targeted here I’ve seen this a lot too! I know it’s rude but I don’t know how. Can someone please explain what this means? Ayyyyyyy 😅 THIS !!! The whole world is getting so screwed up 😔😔. Social media algorithms have figured out that the most rage inducing or polarising content is what is going to get the most engagement so this problem is only going to increase in the future. I thought reddit would be different but it's also turning into a place for people to just bash others 😐.. I don't have any other social media accounts... deleted others...because I realised it's not good for my mental health because we talk about this stuff and vent our rage over polarising content and in real life are just helping whatever apps we are using make more money. Believe me at the end of the day Instagram, Facebook, reddit, and other companies are the LAST people who care about any kind of social issues 🙄🙄. Literally hate all social media apps now which are bringing out the worst in people. Recently another redditor mentioned how this was even aggravating their clinically diagnosed anxiety by bringing up something negative constantly and they said it might be their last post / comment ever here.. I think I might leave reddit too if this keeps happening :/ Just keep on keeping on, Colonel! > All though I don’t understand what you mean by minimum 100, could you elaborate on that? Basically what types of crime trans converted people doing.Mostly you will get on TW by certain accounts remember, the more you spend time on internet, the more shitty people you would see. It is bad for your mental health(srsly). Increase interaction irl, and your shitty experiences will considerably decrease.People are frustruated with their lives, thats proabably why they abuse others.I personally hit my lowest in the covid time, i did not hate any caste/gender, but i was still trolling people nonetheless. Depression did a funny on me and i still havent recovered. But atleast i've stopped trolling people and almost never rude to people on the internet.Being chronically online is a surefire way to get your mental fucked. edit: as for who i trolled: Tateriders, mysogynists, feminists, people who are always online(yep, the irony), religious people, people who were happier than me, etc. Dark humour stopped being funny when it just became dark and no humour We are currently living in a tsunami of brain dead red-pilled wannabe Tates, who can't get married if their mommas and daddies can't arrange a marriage for them. Coincidentally, most of these zombies are the people who lack social skills to even connect with women at basic level. All they do is share \"waman\" memes, and hate women online because they could never have a meaningful relationship IRL. They act as if \"females\" are only good for fucking(not like they are getting any action in first place), and they are just gold diggers and run after \"alpha\" men. Honestly, it's just sad they never met a self-respecting decent woman. And seriously, these aspire to become \"alpha\" men while obsessively following \"alpha\" Tate and Co? That's the most \"beta\" thing dude. Rant over. I have seen both but to my understanding the second one is more prominent than women. Men are just insecure that they take out their anger against women these days. They don't have their own family or can't make one. About LGBTQ I don't post comments but I disregard pride month. Unfortunately \"Good\" never spreads like Wildfire. Be like Bill. 1. He is updated 2. He is opinionated 3. Best of all, he keep it all to himself! Yeah I ain't going to hurt you but you can follow Jill also. 1. She knows how to make short posts. 2. She stops using ig if it's toxic. 3. She know there are positive audiences out there. 4. She knows the difference between a reply and an opinion. 5. She tells people to face if she has a problem. 6. Best of all, she keeps it all to herself. Very well said OP. There's simply too much hate on social media for no reason. This religion hating on this, straights hating on gays, Masculine hating on Feminine. Like why, just live bro. Why fight? And whenever any of this topic brought up IRL, these brainwashed dumb people start physical fighting because they don't have a logical point to talk about. It's irritating now. It hard to see hate spread everywhere but staying out of it is probably the best we can do. Okay you may have misunderstood me, I mentioned Bill as a compliment and when I said Bill keeps to himself, is me referring to you saying how you have an issue and that is all, which mean the what ever the reason is you’re not deliberately trying to spread hatred. I was commending you, for having an opinion and also enough maturity to keep to your self. How ever you chose to attack which is fine, but I will have to defend. 1. Why would I make short posts, when I can take my time elaborating my thoughts, if it’s waste of time to you, you don’t have to read. 2. I could stop using it however, it is not just about me, I was mentioned about how people are just being wrapped into this mess, as form of bringing awareness, if I were to throw the Instagram away, I would not be raising an awareness, I’ll just be a selfish dude, who only cares about himself. 3. I do know there are nice folk out there, that’s my point, the nice people out is the reason why we shouldn’t give into the idea of hating each other. We need each other to survive. 4. I believe I do know the difference between both of them and I might be curious why you are bringing that up. 5. I mean, what she is doing sounds like a great thing! Sharing problems is a good thing instead of fighting it alone. Not every one is out there to get you friend! What I thought was a stupid/positive joke, was mistranslated into an aggressive attack. It is not. Yeah but sometimes in sea of violence and aggression you can't just help but lost hope sometimes and become apathetic i am trying to work myself on it. I swear i keep falling backwards more and more Just keep on keeping on friend! At the end of the day, it is you who will have to take care of yourself, you need to make sure you are okay, before you care for the others. Sure go ahead but this won't change a thing we will continue to spread hate liberty is not a option Money is everything that matters you want safety from thugs that run india outside of urban areas you need money materialistic is now fundamental those that don't support it are not capable of living outside of a crammed 300 apartment building Women have tried to use this on me but most of the time they can't find points to fight the keyboard war so they end up getting called ugly fat unwanted bitches who can't walk alone at night and leave Yeah I thought that was some comeback and required time for my organization to put malware on the females online profile and leak private information to shut them up or just harass them so we switched to dishwasher ☕️ There needs to be no reason I have made it my task to attack any lgbtq person even in my school days we used to beat up the gay kid daily inside the toilets Oh wow, beating someone because of who they choose to like, that’s so cool!!!!!!!!!! <3 Of course Especially when their choice of life is wrong and it just feels right they end up getting called? or you call them this? and are we assuming men are not ugly or fat or unwanted or dogs? The only aspect is that they still can walk alone at night? Perhaps you never debated with a strong woman Even if it were wrong (which btw it isn’t), I’m sure you’ve not been beaten by random people lol, for your wrong life choices :D It doesn't matter if it's right or wrong anymore I have done a good job making people around me believe I'm right. Which I am we do not need lower younger population wokism has only brought stains in countries And the majority of India even the youngsters believe the same .Victory is near Strong in what? Keyboard fights? Even a relatively fat person with low muscle could grab a fit female and take her Women aren't needed for anything but reproduction they don't serve no important job .The richest women made it from divorce. Creatures with over inflated egos that were born for the purpose of riding dicks 🤣🤣 That is a nice response since it shows how females are already practicing to take dicks in their mouth because the coffee means the men drink it when women are doing their classic shenanigans.So it's fair that women in return are practicing sucking cocks I get all I need to know about you with that propaganda mainstream view.sure his past might have been bad but without him id never have quit video games and start working more for that grind.He only promotes men to be strong not blatant hate. You are contradicting yourself. You’re making others believe that “you’re right” which probably feeds your empty soul, without even knowing if something’s wrong/right. At the same time, you’re worried about how this sort of western world wokeism will destroy our country. Don’t wanna engage in name-calling, but either choose to be an unapologetic hater instead of pretending that you actually care about the country. If you’re that concerned, I hope you speak up about all the other things going wrong in our country too, instead of simply cherry-picking the lgbt issue, which isn’t even having any adverse effect right now. I wanna know what has made you so hateful towards women and lgbtq people? Don’t you think we’re humans too, and even if I don’t state the multiple rich women, having their own businesses, we’re still involved in several workforces? In the end, trust me, it doesn’t matter what your gender is lol, you’re indisposable in the world (just like “how women aren’t needed for anything imp”) because there are many who can do your job ;) Just go actually hustle, instead of insulting people based on their genders on social media. That’s never gonna take you anywhere in life. Feel free to be rude I do not mind but lgbt is a issue that will swoop you by your legs if one country doesn't destroy it early it's like a spreading cancer and no I'm not the kind of person to just bring one problem and ignore the rest. I always speak up against a cancer that is rampant which is corruption. Every party every single one is corrupt to a large extent.i only targeted the lgbt issue because sooner or later we will have to deal with it and mainly because this post didn't mention or have anything to do with the rampant issues Homosexuality has existed since the v old times, to the point that it was actually pretty normal and acceptable to be homosexual. That didn’t really hamper the population of our today’s world, right? The simple reason is the fact that it’s not a choice. Some people just end up liking people of the same sex. Even after reading and knowing sm about homosexuality, I’ve not become a homosexual, simply because I’m straight. Just like how some xyz person won’t suddenly turn gay/bi/lesbian if they read more about it. We’re humans, and we realize what we like and what we don’t. Petty example, but a pure vegetarian person wouldn’t wanna eat non vegetarian simply because they heard about it lol. Your problem is here is that you think it’s something people consciously choose. But if you’d have ever bothered to listen to somebody from the lgbtq community, you’d realize that it’s not a choice for them. Since you already used to bully gay people, why do you think they’d “choose” to be gay? Why’d they want to make their life 10x more difficult than it already is? You can speak up against lgbtq as much as you want, but people hiding their sexuality can become a v huge problem in itself. I’ve heard of unhappy marriages, divorced couples, and lonely people just because they couldn’t come out of the closet. Try seeing the other side, and reading more about it too. Sure it might have been decent in the past.but the time for talking is now over because almost every time lgbtq spreads it brings degeneracy and failure to renew the population. Take USA for example they have failed to meet the replacement population quota that means at something during the future there will be more retired people than young and active population. It must be stopped and looking at the choices the Indian majority has made lgbtq won't be hitting us for a long time Nice, glad you chose the path of high road and civil discussion. I don’t know what you found as propaganda from mainstream, but I have expressed, are clearly stated by him, and how is videos are output. I have seen quite a lot of his videos, his podcasts and also his war room. I came to the conclusion after doing my research on him. Yet you try to defend him with your perception of him but not facts or reasoning at the least. If you had an addiction with gaming, it was over come by you, he didn’t cast a spell, he told you what you already know, yet take credit for your work. Which is what pisses me off about him. Homie, he doesn’t give a fuck about men. You provide him a view, which generates him money, that is why, he provides shit that appeals to you, but he’s just profiting out you. If your view meant nothing, he wouldn’t give two shits about you. That’s my take anyway, in the end, if he makes you a better person, and you genuinely believe it than I am happy for you. Even in a free country like the US, the population of lgbtq people is only around 7%. In fact, I’m pretty sure there are more than 7% of citizens who don’t wish to ever get married. You gonna beat ‘em up too for not contributing to the population? Note that this decision is actually by choice* Oh there are infertile people too, or those who’ve fertility issues. They make up about 15-16% of the population. They’re also unable to have kids. Go ahead and beat them too. You can go check the official stats. no it just means men like you are still sucking their mommies boobies same for men then why did you mention keyboard wars... choose your battles. Stop being so dumb"
}