{
    "id": "1bmg6sg",
    "title": "if a small country can win against gangs why cant our govt. put strict laws for womens safety?",
    "url": "https://www.reddit.com/r/india/comments/1bmg6sg/if_a_small_country_can_win_against_gangs_why_cant/",
    "selftext": "[El Salvador](https://www.youtube.com/watch?v=mtLiQnXC7sQ) (documentary), a country with a population of 63 lakhs, has stopped the gang war by making tough laws. In just three years, they've arrested 70,000 gang members. These strict laws have made El Salvador safer, with fewer murders, rapes, and other crimes compared to nearby countries.\n\n&#x200B;\n\nIf they can control the gang war, why can't our government make strong rules to protect our women? It's sad to see so many news articles about rape every time we check the news. If the government can't give tough punishments like the death penalty, why can't they make the legal process faster instead of delaying it? I know sometimes people lie about rape, which ruins innocent lives. Even though there have been many cases, why hasn't our government solved this big problem? Fixing it would also help the party that makes the strict rules. It would bring more tourists and show that India is a safe place for women. Aren't these good enough reasons for the government to act?",
    "flair": "Crime",
    "score": 21,
    "num_comments": 33,
    "created_utc": 1711270067.0,
    "convurl": "https://external-preview.redd.it/_Wb1fOj_bytaQLhdHfVk_TkM3Knv0kxydetr6B-yE6s.jpg?auto=webp&s=a870ef459fc66ced6b2b224173ea579922459a92",
    "comments": [
        "Because quite some people of the government were accused of doing those atrocities. Such strict laws would need them to be jailed too and no one wants that",
        "Cuz a huge number of false cases gets reported for selfish reasons that ruins innocent lives as well, just on the basis of a she said so, with no way to prove innocence.",
        ">These strict laws have made El Salvador safer, with fewer murders, rapes, and other crimes compared to nearby countries.\n\nDid you even watch the documentary? El Salvador didn't do this because of laws\n\nBukele took over institutions one by one, declared emergency and arrested any individual who even smelled of gang stench\n\nThey specially made a prison for these people, shoved them in like sheep and they are still there locked up. No due process. No lawyers, nothing\n\nThat's the price El Salvador has paid for their freedom \n\nThey've essentially become a dictatorship with Bukele as head of state.  It just so happens that Bukele has his country's need in top of his own and that's how this whole system is working.",
        "this is good, imo.",
        "Good for el salvador, which is ravaged by gangs, easily identifiable by their tattoos and behaviour.  \nHow do you propose to do this for rapists, who blend in with society?",
        "Missing the point\n\nAuthoritarian states work when they have people's interest in mind. Do you think if an authoritarian regime is  established in India it will work for India or will it fill its own pocket?\n\nWe just saw the obscenity that was electoral bonds. Do you think in an authoritarian regime the supreme court would do what it did?\n\nDo you think we'd be able to discuss this freely?",
        "Because no govt can go up against gangs in this country. West Bengal mai rehta hu, so I know 🥺",
        "no, im saying the fact that the state was taken over by a man with the right vision for the nation is good. democracy is overrated. those same rapists who blend in with society end up voting. not everyone is fit to rule or have their voices heard. reject democracy, embrace fascism",
        "i think a system where leaders are selected not on the basis of a popularity contest (aka democracy), but rather a thorough vetting process based on meritocracy, and ethics based tests is what we need. read up on third positionism, thats where i stand",
        "1. There aren't enough jails in India to lock them all up. They would need to build a new jail city the size of the entire country of El Salvador\n\n2. Most gangsters are politicians or political party members\n\n3. Most Indian men or older women don't care about rape even if it happens to their own women, they will find a way to blame her",
        "Institutions are made up of people my guy. IPS officers are selected based on meritocracy do you not they are corrupt as well?\n\nNo man rules alone, least of all in democracy. there will always be corruption as long as there is greed",
        "Because we would rather spend money on temples and statues than on schools and law & order.\n\nPeople get what they truly care for.",
        ">democracy is overrated.\n\n100 years' worth of struggle to establish an independent Indian democracy just for people like you",
        "You're basically asking for dictatorship to fix one issue. That way we could become the most democratic, secular, poverty free, best education, etc country in the world (*using our own metrics)",
        "this was the price to pay for the safety of the people of the el salvador. ik this is very harsh but the gangs are now afraid, the people of el salvador are happy and the harshness can be solved but before putting everyone in jail he could have implemented some way to know who was innocent",
        "Replace all gangs with the biggest and most powerful gang - a dictator government with the police and military as its enforcers. No thanks",
        "the older gen are the worse in this issue and our country is running under these older gen with same mindset",
        "Hand on your heart do you trust mogliji to execute this? You're just arming his bhakts and giving them an excuse to pick up low caste and Muslims and turn them in\n\nI don't trust my country men to treat each other like humans even under normal circumstances. Giving them unchecked power I don't wanna imagine",
        "imo the stricter laws will be mostly result in increase in no. of false cases and it could also be a way to get rid of a person or just want to kill him with the help of govt just put a case of rape gather few witness and done",
        "Dictatorship hard-ons are a problem in India. Happens to be that those with bad education usually like these stupid simplistic solutions.",
        "> but before putting everyone in jail he could have implemented some way to know who was innocent\n\nGenuinely asking if you are 12 years old or something because this is such a childish question to ask. \n\nJustice systems are complex, nuanced, slow beasts at the best of time. And history has shown again and again and again and again and yet again and yet again that whenever you form a dictatorship and bypass the system, innocent people suffer as much as guilty ones. \n\nIn fact innocent people suffer more so. Who do you think will be hurt more from going to jail? A gang member used to a ruthless, violent world, or an innocent middle class person who has no idea where he's going?\n\nEmergencies, dictatorships, mass imprisonments - please read at least the tiniest bit of history. They inevitably have the same result.",
        "nahhh i dont think so any political party will go to such extent cux they have friend with power who are nose deep in these crimes and they will do all the things in their power to save them but punishing them and bringing justice ouu that shitz is out of their league",
        "Exactly",
        "Read the entire El Salvador story, past and present - It’s political will! \n\nIn India, we all know politicians are in cahoots with criminals",
        "brdr im not asking for dictatorship and im not againt the voilence against the gang member but against the inocent people and ik it is very complex to make rules and implement them i just asked if they cant serve justice atleast make the legal process faster",
        "i didnt asked for dictatorship please read the post i just asked for stricter rules or faster legal process",
        "How do you know he is a man with the right vision? If he put everyone in without questions there is no other side left to hear, those voices are unheard of",
        "Not just that, there is evidence that Bukele has carried out truce with many of the powerful gangs in secret to reduce the crime rate numbers so that he can obtain more power and pass authoritarian laws, such as the law that bans media reporting on gang members. Also, crime rate in El Salvador was declining since 2015 [https://www.statista.com/statistics/696152/homicide-rate-in-el-salvador/](https://www.statista.com/statistics/696152/homicide-rate-in-el-salvador/)",
        "Other approach is Law and order needs to be effective, police needs to be effective. \n\nWhen people lose their trust in judicial systems we have police encounters. When they lose faith in the police they turn to gangsters and goons.\n\nPolice and judiciary are made for us. Many in police, judiciary, government assume the citizens are here to serve them.\n\nFor them to be effective we may need to first invest in hiring enough people to take up the workload of our population. Also lot of investment is required in human development, education and health.\n\nThe soft approach may not be violent or drastic enough for some, but it will be a long term or permanent solution.",
        "Understood, but it isn't the best example one could think of."
    ],
    "cleaned_text": "small country win gangs cant govt put strict laws womens safety el salvadorhttpswwwyoutubecomwatchvmtliqnxcsq documentary country population lakhs stopped gang war making tough laws three years theyve arrested gang members strict laws made el salvador safer fewer murders rapes crimes compared nearby countries xb control gang war cant government make strong rules protect women sad see many news articles rape every time check news government cant give tough punishments like death penalty cant make legal process faster instead delaying know sometimes people lie rape ruins innocent lives even though many cases hasnt government solved big problem fixing would also help party makes strict rules would bring tourists show india safe place women arent good enough reasons government act ",
    "cleaned_title": "small country win gangs cant govt put strict laws womens safety",
    "cleaned_selftext": "el salvadorhttpswwwyoutubecomwatchvmtliqnxcsq documentary country population lakhs stopped gang war making tough laws three years theyve arrested gang members strict laws made el salvador safer fewer murders rapes crimes compared nearby countries xb control gang war cant government make strong rules protect women sad see many news articles rape every time check news government cant give tough punishments like death penalty cant make legal process faster instead delaying know sometimes people lie rape ruins innocent lives even though many cases hasnt government solved big problem fixing would also help party makes strict rules would bring tourists show india safe place women arent good enough reasons government act",
    "cleaned_comments": "quite people government accused atrocities strict laws would need jailed one wants cuz huge number false cases gets reported selfish reasons ruins innocent lives well basis said way prove innocence strict laws made el salvador safer fewer murders rapes crimes compared nearby countries even watch documentary el salvador didnt laws bukele took institutions one one declared emergency arrested individual even smelled gang stench specially made prison people shoved like sheep still locked due process lawyers nothing thats price el salvador paid freedom theyve essentially become dictatorship bukele head state happens bukele countrys need top thats whole system working good imo good el salvador ravaged gangs easily identifiable tattoos behaviour propose rapists blend society missing point authoritarian states work peoples interest mind think authoritarian regime established india work india fill pocket saw obscenity electoral bonds think authoritarian regime supreme court would think wed able discuss freely govt go gangs country west bengal mai rehta hu know im saying fact state taken man right vision nation good democracy overrated rapists blend society end voting everyone fit rule voices heard reject democracy embrace fascism think system leaders selected basis popularity contest aka democracy rather thorough vetting process based meritocracy ethics based tests need read third positionism thats stand arent enough jails india lock would need build new jail city size entire country el salvador gangsters politicians political party members indian men older women dont care rape even happens women find way blame institutions made people guy ips officers selected based meritocracy corrupt well man rules alone least democracy always corruption long greed would rather spend money temples statues schools law order people get truly care democracy overrated years worth struggle establish independent indian democracy people like youre basically asking dictatorship fix one issue way could become democratic secular poverty free best education etc country world using metrics price pay safety people el salvador ik harsh gangs afraid people el salvador happy harshness solved putting everyone jail could implemented way know innocent replace gangs biggest powerful gang dictator government police military enforcers thanks older gen worse issue country running older gen mindset hand heart trust mogliji execute youre arming bhakts giving excuse pick low caste muslims turn dont trust country men treat like humans even normal circumstances giving unchecked power dont wan na imagine imo stricter laws mostly result increase false cases could also way get rid person want kill help govt put case rape gather witness done dictatorship hardons problem india happens bad education usually like stupid simplistic solutions putting everyone jail could implemented way know innocent genuinely asking years old something childish question ask justice systems complex nuanced slow beasts best time history shown yet yet whenever form dictatorship bypass system innocent people suffer much guilty ones fact innocent people suffer think hurt going jail gang member used ruthless violent world innocent middle class person idea hes going emergencies dictatorships mass imprisonments please read least tiniest bit history inevitably result nahhh dont think political party go extent cux friend power nose deep crimes things power save punishing bringing justice ouu shitz league exactly read entire el salvador story past present political india know politicians cahoots criminals brdr im asking dictatorship im againt voilence gang member inocent people ik complex make rules implement asked cant serve justice atleast make legal process faster didnt asked dictatorship please read post asked stricter rules faster legal process know man right vision put everyone without questions side left hear voices unheard evidence bukele carried truce many powerful gangs secret reduce crime rate numbers obtain power pass authoritarian laws law bans media reporting gang members also crime rate el salvador declining since httpswwwstatistacomstatisticshomiciderateinelsalvadorhttpswwwstatistacomstatisticshomiciderateinelsalvador approach law order needs effective police needs effective people lose trust judicial systems police encounters lose faith police turn gangsters goons police judiciary made us many police judiciary government assume citizens serve effective may need first invest hiring enough people take workload population also lot investment required human development education health soft approach may violent drastic enough long term permanent solution understood isnt best example one could think",
    "light_cleaned_title": "if a small country can win against gangs why cant our govt. put strict laws for womens safety?",
    "light_cleaned_selftext": "[El Salvador](https://www.youtube.com/watch?v=mtLiQnXC7sQ) (documentary), a country with a population of 63 lakhs, has stopped the gang war by making tough laws. In just three years, they've arrested 70,000 gang members. These strict laws have made El Salvador safer, with fewer murders, rapes, and other crimes compared to nearby countries. &#x200B; If they can control the gang war, why can't our government make strong rules to protect our women? It's sad to see so many news articles about rape every time we check the news. If the government can't give tough punishments like the death penalty, why can't they make the legal process faster instead of delaying it? I know sometimes people lie about rape, which ruins innocent lives. Even though there have been many cases, why hasn't our government solved this big problem? Fixing it would also help the party that makes the strict rules. It would bring more tourists and show that India is a safe place for women. Aren't these good enough reasons for the government to act?",
    "light_cleaned_comments": "Because quite some people of the government were accused of doing those atrocities. Such strict laws would need them to be jailed too and no one wants that Cuz a huge number of false cases gets reported for selfish reasons that ruins innocent lives as well, just on the basis of a she said so, with no way to prove innocence. >These strict laws have made El Salvador safer, with fewer murders, rapes, and other crimes compared to nearby countries. Did you even watch the documentary? El Salvador didn't do this because of laws Bukele took over institutions one by one, declared emergency and arrested any individual who even smelled of gang stench They specially made a prison for these people, shoved them in like sheep and they are still there locked up. No due process. No lawyers, nothing That's the price El Salvador has paid for their freedom They've essentially become a dictatorship with Bukele as head of state. It just so happens that Bukele has his country's need in top of his own and that's how this whole system is working. this is good, imo. Good for el salvador, which is ravaged by gangs, easily identifiable by their tattoos and behaviour. How do you propose to do this for rapists, who blend in with society? Missing the point Authoritarian states work when they have people's interest in mind. Do you think if an authoritarian regime is established in India it will work for India or will it fill its own pocket? We just saw the obscenity that was electoral bonds. Do you think in an authoritarian regime the supreme court would do what it did? Do you think we'd be able to discuss this freely? Because no govt can go up against gangs in this country. West Bengal mai rehta hu, so I know 🥺 no, im saying the fact that the state was taken over by a man with the right vision for the nation is good. democracy is overrated. those same rapists who blend in with society end up voting. not everyone is fit to rule or have their voices heard. reject democracy, embrace fascism i think a system where leaders are selected not on the basis of a popularity contest (aka democracy), but rather a thorough vetting process based on meritocracy, and ethics based tests is what we need. read up on third positionism, thats where i stand 1. There aren't enough jails in India to lock them all up. They would need to build a new jail city the size of the entire country of El Salvador 2. Most gangsters are politicians or political party members 3. Most Indian men or older women don't care about rape even if it happens to their own women, they will find a way to blame her Institutions are made up of people my guy. IPS officers are selected based on meritocracy do you not they are corrupt as well? No man rules alone, least of all in democracy. there will always be corruption as long as there is greed Because we would rather spend money on temples and statues than on schools and law & order. People get what they truly care for. >democracy is overrated. 100 years' worth of struggle to establish an independent Indian democracy just for people like you You're basically asking for dictatorship to fix one issue. That way we could become the most democratic, secular, poverty free, best education, etc country in the world (*using our own metrics) this was the price to pay for the safety of the people of the el salvador. ik this is very harsh but the gangs are now afraid, the people of el salvador are happy and the harshness can be solved but before putting everyone in jail he could have implemented some way to know who was innocent Replace all gangs with the biggest and most powerful gang - a dictator government with the police and military as its enforcers. No thanks the older gen are the worse in this issue and our country is running under these older gen with same mindset Hand on your heart do you trust mogliji to execute this? You're just arming his bhakts and giving them an excuse to pick up low caste and Muslims and turn them in I don't trust my country men to treat each other like humans even under normal circumstances. Giving them unchecked power I don't wanna imagine imo the stricter laws will be mostly result in increase in no. of false cases and it could also be a way to get rid of a person or just want to kill him with the help of govt just put a case of rape gather few witness and done Dictatorship hard-ons are a problem in India. Happens to be that those with bad education usually like these stupid simplistic solutions. > but before putting everyone in jail he could have implemented some way to know who was innocent Genuinely asking if you are 12 years old or something because this is such a childish question to ask. Justice systems are complex, nuanced, slow beasts at the best of time. And history has shown again and again and again and again and yet again and yet again that whenever you form a dictatorship and bypass the system, innocent people suffer as much as guilty ones. In fact innocent people suffer more so. Who do you think will be hurt more from going to jail? A gang member used to a ruthless, violent world, or an innocent middle class person who has no idea where he's going? Emergencies, dictatorships, mass imprisonments - please read at least the tiniest bit of history. They inevitably have the same result. nahhh i dont think so any political party will go to such extent cux they have friend with power who are nose deep in these crimes and they will do all the things in their power to save them but punishing them and bringing justice ouu that shitz is out of their league Exactly Read the entire El Salvador story, past and present - It’s political will! In India, we all know politicians are in cahoots with criminals brdr im not asking for dictatorship and im not againt the voilence against the gang member but against the inocent people and ik it is very complex to make rules and implement them i just asked if they cant serve justice atleast make the legal process faster i didnt asked for dictatorship please read the post i just asked for stricter rules or faster legal process How do you know he is a man with the right vision? If he put everyone in without questions there is no other side left to hear, those voices are unheard of Not just that, there is evidence that Bukele has carried out truce with many of the powerful gangs in secret to reduce the crime rate numbers so that he can obtain more power and pass authoritarian laws, such as the law that bans media reporting on gang members. Also, crime rate in El Salvador was declining since 2015 [https://www.statista.com/statistics/696152/homicide-rate-in-el-salvador/](https://www.statista.com/statistics/696152/homicide-rate-in-el-salvador/) Other approach is Law and order needs to be effective, police needs to be effective. When people lose their trust in judicial systems we have police encounters. When they lose faith in the police they turn to gangsters and goons. Police and judiciary are made for us. Many in police, judiciary, government assume the citizens are here to serve them. For them to be effective we may need to first invest in hiring enough people to take up the workload of our population. Also lot of investment is required in human development, education and health. The soft approach may not be violent or drastic enough for some, but it will be a long term or permanent solution. Understood, but it isn't the best example one could think of."
}