{
    "id": "1627vre",
    "title": "Electoral Bond Stats",
    "url": "https://i.redd.it/kgq8itv80jkb1.png",
    "selftext": "Electoral Bond is a very Quiet topic, Every Political Party has Some share of it . But we all know Who gets the highest ....\nSharing what I know.\nIt was introduced in 2017 budget by Late Arun Jaitley & Finance bill 2017 passed it.\nCons of this \n1)Donar details remain Anonymous \n2) Infringes RTI\n3) Legitimizes illegal money in politics\n4) No reporting of it \n\nGovt/Banks have Full KYC details of Us (Taxpayers), but exempts such Donor's from KYC",
    "flair": "Politics",
    "score": 17,
    "num_comments": 5,
    "created_utc": 1693086779,
    "convurl": "https://i.redd.it/kgq8itv80jkb1.png",
    "comments": [
        "B.R. Ambedkar : ' Elections are the Progenitor of the Corruption '",
        "Keep this in mind when people claim laws are being made for benefit of common man",
        "Democracy and transparency out of window",
        "This is truly a Government approved & managed, legalized scam."
    ],
    "cleaned_text": "electoral bond stats electoral bond quiet topic every political party share know gets highest sharing know introduced budget late arun jaitley finance bill passed cons donar details remain anonymous infringes rti legitimizes illegal money politics reporting govtbanks full kyc details us taxpayers exempts donors kyc ",
    "cleaned_title": "electoral bond stats",
    "cleaned_selftext": "electoral bond quiet topic every political party share know gets highest sharing know introduced budget late arun jaitley finance bill passed cons donar details remain anonymous infringes rti legitimizes illegal money politics reporting govtbanks full kyc details us taxpayers exempts donors kyc",
    "cleaned_comments": "br ambedkar elections progenitor corruption keep mind people claim laws made benefit common man democracy transparency window truly government approved managed legalized scam",
    "light_cleaned_title": "Electoral Bond Stats",
    "light_cleaned_selftext": "Electoral Bond is a very Quiet topic, Every Political Party has Some share of it . But we all know Who gets the highest .... Sharing what I know. It was introduced in 2017 budget by Late Arun Jaitley & Finance bill 2017 passed it. Cons of this 1)Donar details remain Anonymous 2) Infringes RTI 3) Legitimizes illegal money in politics 4) No reporting of it Govt/Banks have Full KYC details of Us (Taxpayers), but exempts such Donor's from KYC",
    "light_cleaned_comments": "B.R. Ambedkar : ' Elections are the Progenitor of the Corruption ' Keep this in mind when people claim laws are being made for benefit of common man Democracy and transparency out of window This is truly a Government approved & managed, legalized scam."
}