{
    "id": "188hmw6",
    "title": "Privacy is a joke in this country…actually error 404 privacy not found.",
    "url": "https://i.redd.it/j1wv7bg3zp3c1.jpg",
    "selftext": "So I just got my startup registered & now I’m flooded with spam emails from web/logo designers,tax compliance services, etc \n\nCan someone please explain how this happened & how to prevent it (IF big IF, there is a way to do so)\n\nIt is so annoying. No respect to digital privacy..\n\nPrivacy is a joke in this country (ofcourse we saw what happened with aadhar data breach and covid data leak…)",
    "flair": "Rant / Vent",
    "score": 155,
    "num_comments": 60,
    "created_utc": 1701452250.0,
    "convurl": "https://i.redd.it/j1wv7bg3zp3c1.jpg",
    "comments": [
        "Well, you got your startup registered. So I assume it was submitted to a government agency. Under the Privacy Act, they have no obligation at all to protect it.",
        "Sorry but You seem to have missed the whole point..\n\nI submitted it to government but all these spam is coming from data being sold or misued.",
        "I am not sure you get what I am getting at. The government is under no legal obligation to protect your data. The Data Privacy Act passed earlier takes all responsibility away from all governments: Central and State. Anything can be 'leaked' a.k.a sold",
        "Oh we both mean the same…exactly why privacy is a joke and non existent in this country.\n\nThanks to modiji’s govt for bring transparency by making sure there is no privacy hidden 🤡",
        "Thought so...\"Desh nahi bikne dunga\" is selling everything including forests.",
        "Once entity is registered it gets updated in 3rd party sites \nLike \nFalcon ebiz\nCompany details \nStartupwala\nZauba corp etc",
        "When you are registered with mca you would have signed to public access of your information .Directors name , email id  , address and some others will be made public .May be you should read the terms and conditions and then sign it . The companies and banks who are contacting you have bots which will fetch them your address and give it to them and nearby banks will approach you for current account opening,  courier services will come to you  . All this will happen for 2 weeks . you can hang a board outside your house .This is how it is, there is no data leak or sold , you just signed to it",
        "Wait for registered posts. There is a scam where some idiots print different rules and regulations from the Ministry of Corporate Affairs and then send to your newly created startup's registered address as Cash On Delivery order. Amount can vary from 1000 rupees to 10,000 rupees. The documents will appear as if sent from the MCA but remember to reject if they ask for money.",
        "All this information is publicly available on MCA website. MCA releases statistics of all the companies registered with them monthly, so anybody can go and check it out.",
        "True. Scrapers can get anything that's available on a public website.",
        "And its annoying. These companies dont respect and care about other people’s privacy and keep spamming relentlessly (just like bajaj finance spam calling people)",
        "Yes anybody can check them out but spam? Thats helluva annoying. 😞😞",
        "Sure its made public but not made public for others to spam :)",
        "Wah wah..dint know these kinda scams exist lol …thanks!",
        "Do you know outside EU, privacy is a joke everywhere, in India there is much lesser scam calls due to Truecaller, in US there is so many more, it’s exponential",
        "this happened but next time when you register a domain name for your startup, make sure to buy the privacy protection otherwise they'll start calling you and it gets annoying real quick",
        "Businesses have no right to privacy. You should have used public-facing email address and phone number for your business. \n\nAlso, maybe you should consider hiring some compliance services. It already looks like you've mixed personal and business mail. If you have a registered business, it is a separate entity and must be treated as such.\n\nBTW... have you ever looked at the label of anything you've ever purchased? You think all the address and contact information is there for funsies?",
        "No one care about what annoys you, they care about the money they make just like you will about the company your just started",
        "Thank you! Will do!",
        "I havent used personal mail for this tho. Mobile number yeah\n\nNo no the point im making is these guys are spamming as soon as company is registered…that is the issue (using bots and scrapers)",
        "Not really. I wouldnt ever do so",
        "Data monetisation - essential reading…\n\n[ Explained: India plans to monetise public data. What is the draft data policy all about?](https://www.cnbctv18.com/technology/explained-india-plans-to-monetise-public-data-what-is-the-draft-data-policy-all-about-12594022.htm). Start-ups, enterprises, individuals, and researchers will be able to access data through licensing within the frameworks of data security and privacy, the draft states. Each department will have to define the period for which data will be retained.\n\n[ Govt earned over Rs 100 crore by selling vehicle owner data to private firms. Vahan and Sarathi databases contain details of registered vehicles and driving licenses in the country](https://www.deccanherald.com/india/govt-earned-over-rs-100-crore-by-selling-vehicle-owner-data-to-private-firms-950293.html)",
        ">May be you should read the terms and conditions and then sign it\n\nYou'r right but the terms and conditions of any site written in very complicated terminologies that only a good advocate can understand.",
        "Absolutely right. This response should be at the top.",
        "Privacy is a myth everywhere. Unless you live in the middle of literally nowhere with no internet access there is a good chance nothing about your life is private. Heck I applied to a bunch of internships and they leaked my number.",
        "See your startup is already popular",
        "Care to share a single other country this doesn't happen. You start a business you would get targeted my marketing. That's how business is done. And this happens across the globe.",
        "Best is to use masked email for such registration on Govt portals.\nUse doosra like mobile number or take a landline specially for such purposes.",
        "   \nI don't comprehend why it's considered a breach of privacy; \n\nwhat is OP expressing concern about? First and foremost, when you register a company, it becomes part of the public domain, accessible to everyone(Unless there is something fishy going on) – it's a bylaw. If it's accessible publicly, anyone proficient should be able to access it, that's the gist.\n\n My two cents to OP: please keep track of spam; there is a good amount of information coming ur way that you may not be aware of, and it could greatly benefit to your startup. \n\n&#x200B;\n\nCongratulations for your Start up.",
        "So I’m getting downvoted for making a point that my company would never spam. I’ll come back to this post if my company does well :)",
        "Wow getting downvoted for what? Data being public != spamming relentlessly by countless people",
        "Yeah EU has solid regulations",
        "Sure its made public but not made public for others to spam :)",
        "Thank you for this elaborate information!",
        "Haha good one",
        "Yes will do from now on",
        " \n\nNonsense! It's akin to constructing a house and expecting only friends and relatives to view it. The reality is, it's open for everyone to see, and a select few will undoubtedly know how to access and capitalize on it.\n\nRubbish! When something is public, it's visible to everyone, attracting both unwanted and potentially beneficial visitors. Embrace the fact that unknown visitors could form a mutually beneficial relationship with the homeowners.\n\n&#x200B;\n\nIn fact WTF is OP crying about spam here in reddit after registering a business. Lol.",
        "Yes will do from now on , also for other websites in general (apple offers hide my email service)",
        "That’s absolutely crazy and outright wrong! Govt selling data to private firms lmao..\n\nOkay so if they are “monetising our data” and our data being our asset, shouldn’t we also get a share of the revenues :P /sarcasm \n\nWe submit data to government for compliance and regulatory purposes..not for them to sell to third party private firms for our data to be exploited and profited off.\n\nAnd thats why all of this is a joke in our country…\n\nAnd thank you for the elaborate information..dint know this before",
        "Could you elaborate on what do you mean by saying “nothing about your life”? What does it encompass?",
        "Thanks for correcting me. Yes you are right, the title should rather have been clearer \n\nBy Privacy I mean giving private space and not intruding my space and spamming me relentlessly…\n\nThank you for the suggestion to keep track of spam too (hard pass for now since spammed by hundreds of emails now) \n\nAlso thank you for your wishes! :)",
        "What you’re not realising is that the email address you provided while registering your company is publicly listed by the Ministry of Corporate Affairs. Nobody sold your details, it is publicly available, and you agreed to the same. These entities are simply taking advantage of that fact.",
        "It's by design in our country. Anyone can access any private company's financial records by just paying a small fee. \n\nThat's why I like how Delaware incorporates its companies, they will never give away your details unless court ordered for some lawsuit. If you have a Delaware LLC registered, nobody will know who are the the shareholders/LPs.",
        "Bro! OP registered a PRIVATE company, it is in the name, the info is supposed to be private, but in our country, all you need to do is pay MCA a small fee and you will get all their financial records, shareholding pattern, Governance doc, Board of directors etc. It's pathetic. It shouldn't be possible to access private companies info. But, here we are, where even the govt itself encourages it. Lol. \n\nI mean we can't do anything about it except register in Delware if it is a tech company.",
        "Yes thats the sad design…\n\nYeah I read about delaware and some other EU countries for digital nomad and stuff like that..\n\nThe startup intends to develop a product for stock market to automate parts of the investing process and tracking the markets etc and bringing transparency to the forefront like what criminal cases a ceo or a promoter has or some financial irregularities red flags caught by our algorithms..\n\nSo because of the sensitiveness of the nature of the product/company i wanted to incorporate somewhere where it is absolutely confidential but my co founder wanted us to be transparent first without hiding and all or else why will others trust us? \n\nAlso we would need to fundraise so I believe that confidentiality is not possible or is it?\n\nDo you know or have any idea if you can incorporate and run fully confidentially and also do fund raise (investors like VCs PEs ) ??",
        "Ive worked in a small finance firm and we often give our phone numbers while doing start-up and MSME registration process of client’s companies and then change them later on for ease of processing. The number of spam calls i get from random consultants is too damn high.",
        "Investors usually prefer if your company is registered in Delaware or Singapore because they know that law is followed there( you can keep on harping that oh we have laws here, blah blah, we don't). Investors want protection. If founder does some shady shit/fraud they should be able to use the founders and get restitution which they will not get in India (fraud is rife in Indian startups).\n\nEspecially in fintech, it is important to incorporate in India because RBI is a bitch about regulations(good). \n\nI mean nowadays, incorporating in India is becoming easier so that's why even investors don't care if they are India incorporated or not but pre 2021, that was the case.\n\nWith Zirp and free flow of money, investors just wanted a return.",
        "Ouch, im stuck between a rock and a hard.\n\nWish I registered it in Delaware (currently im on a two month US stay at my brothers house) \n\nBut like you said financial regulators would not allow outside companies to operate in areas like say mutual fund/insurance commissions on sales through the app etc etc\n\nRight? \n\nSo what would you suggest? \n\nSliding into your DM!",
        "Some stories just don’t get enough media attention, so most people don’t get to know such things.",
        "I also started my business and my email is flooded with spams. Also personal details are available on internet. Does anyone know how to take down our info from sites like zaubacorp and others.",
        "Haha! I just started out a restaurant and all of a sudden all my feed is full of Sanjiv Kapoor restaurant courses and secrets to business and what not 😂",
        "just curious how much it costs to register a startup.\n\nand maintaining it.",
        "Lol! you're funny man.\n\nT0 begin with, You should google the difference between private and public ltd company.\n\nBy the way its crime and the company owners can be jailed for hiding their  financial records, shareholding pattern, Governance doc, Board of director.",
        "Difference in private company and public company is about the ownership of shares. Private company doesn't mean the info of ownership shouldn't be private. In most countries, basic info of all company is publicly available. You are bitching about the wrong thing.",
        "You're getting downvoted because of your attitude and demeanor. Everyone gets spam calls, messages, emails etc GLOBALLY. \n\nIndia does lack a lot when compared to first world countries, but spammers and scammers don't discriminate and treat every country alike! (sarcasm)",
        ">Difference in private company and public company is about the ownership of shares.\n\nAbsolutely true. I never said it is not. \n\n>Private company doesn't mean the info of ownership shouldn't be private.\n\nYes, it should be! What are you talking about? What do you think Bloomberg terminal is so precious if such information was already public?\n\n\n>In most countries, basic info of all company is publicly available\n\nNo, it's not and it shouldn't be. You shouldn't be able to view what is the shareholding pattern, governance docs, board of directors etc of a private company because it shouldn't be anyone's business except the shareholders of the private company to know such details. Look at companies in USA or even Europe. You register a Delaware LLC or C-corp in those jurisdiction, you will never get any info from them unless you need those for a lawsuit and subpeona those details from the registrar.\n\nBy your logic, it should be easy to know holdings of top Private Equity companies of the world, but we don't because they are all privately operated. You have a weird definition of what private and public means. Private doesn't ONLY mean that its shares are private, it's financials, everything is supposed to be private which is not the case in India. \n\nI am not bitching, I am stating facts.",
        "only in some states in USA and some countries in Europe you get that privacy for companies because that's their whole USP. Rest of states/countries make info available in public to encourage transparency in economy.",
        "Do iPhones/Macs offer better privacy in india than android/windows?",
        "Take a chill pill please. This isn’t specific to India. Even in the USA, once you form an LLC, your data gets exposed and you start receiving a lot of marketing mail. You might consider this spam and others might not.",
        "From what you talk about to what you watch. Everything is tracked.",
        "Yeah I get it but i got downvoted because i told my company wouldn’t do so….its beyond me… \n\n:/",
        "You may want to try “incogni”",
        "Privacy is a joke in the entire world.",
        "You ain't ever gonna cold email/cold call your prospects? Good luck scaling your business.",
        "And what does any of this have to do with \"this country\"?",
        "Cribs about privacy issues, goes on to post somebody else's whatsapp number on Social media without consent."
    ],
    "cleaned_text": "privacy joke countryactually error privacy found got startup registered im flooded spam emails weblogo designerstax compliance services etc someone please explain happened prevent big way annoying respect digital privacy privacy joke country ofcourse saw happened aadhar data breach covid data leak ",
    "cleaned_title": "privacy joke countryactually error privacy found",
    "cleaned_selftext": "got startup registered im flooded spam emails weblogo designerstax compliance services etc someone please explain happened prevent big way annoying respect digital privacy privacy joke country ofcourse saw happened aadhar data breach covid data leak",
    "cleaned_comments": "well got startup registered assume submitted government agency privacy act obligation protect sorry seem missed whole point submitted government spam coming data sold misued sure get getting government legal obligation protect data data privacy act passed earlier takes responsibility away governments central state anything leaked aka sold oh mean sameexactly privacy joke non existent country thanks modijis govt bring transparency making sure privacy hidden thought sodesh nahi bikne dunga selling everything including forests entity registered gets updated rd party sites like falcon ebiz company details startupwala zauba corp etc registered mca would signed public access information directors name email id address others made public may read terms conditions sign companies banks contacting bots fetch address give nearby banks approach current account opening courier services come happen weeks hang board outside house data leak sold signed wait registered posts scam idiots print different rules regulations ministry corporate affairs send newly created startups registered address cash delivery order amount vary rupees rupees documents appear sent mca remember reject ask money information publicly available mca website mca releases statistics companies registered monthly anybody go check true scrapers get anything thats available public website annoying companies dont respect care peoples privacy keep spamming relentlessly like bajaj finance spam calling people yes anybody check spam thats helluva annoying sure made public made public others spam wah wahdint know kinda scams exist lol thanks know outside eu privacy joke everywhere india much lesser scam calls due truecaller us many exponential happened next time register domain name startup make sure buy privacy protection otherwise theyll start calling gets annoying real quick businesses right privacy used publicfacing email address phone number business also maybe consider hiring compliance services already looks like youve mixed personal business mail registered business separate entity must treated btw ever looked label anything youve ever purchased think address contact information funsies one care annoys care money make like company started thank havent used personal mail tho mobile number yeah point im making guys spamming soon company registeredthat issue using bots scrapers really wouldnt ever data monetisation essential reading explained india plans monetise public data draft data policy abouthttpswwwcnbctvcomtechnologyexplainedindiaplanstomonetisepublicdatawhatisthedraftdatapolicyallabouthtm startups enterprises individuals researchers able access data licensing within frameworks data security privacy draft states department define period data retained govt earned rs crore selling vehicle owner data private firms vahan sarathi databases contain details registered vehicles driving licenses countryhttpswwwdeccanheraldcomindiagovtearnedoverrscrorebysellingvehicleownerdatatoprivatefirmshtml may read terms conditions sign right terms conditions site written complicated terminologies good advocate understand absolutely right response top privacy myth everywhere unless live middle literally nowhere internet access good chance nothing life private heck applied bunch internships leaked number see startup already popular care share single country doesnt happen start business would get targeted marketing thats business done happens across globe best use masked email registration govt portals use doosra like mobile number take landline specially purposes dont comprehend considered breach privacy op expressing concern first foremost register company becomes part public domain accessible everyoneunless something fishy going bylaw accessible publicly anyone proficient able access thats gist two cents op please keep track spam good amount information coming ur way may aware could greatly benefit startup xb congratulations start im getting downvoted making point company would never spam ill come back post company well wow getting downvoted data public spamming relentlessly countless people yeah eu solid regulations sure made public made public others spam thank elaborate information haha good one yes nonsense akin constructing house expecting friends relatives view reality open everyone see select undoubtedly know access capitalize rubbish something public visible everyone attracting unwanted potentially beneficial visitors embrace fact unknown visitors could form mutually beneficial relationship homeowners xb fact wtf op crying spam reddit registering business lol yes also websites general apple offers hide email service thats absolutely crazy outright wrong govt selling data private firms lmao okay monetising data data asset shouldnt also get share revenues p sarcasm submit data government compliance regulatory purposesnot sell third party private firms data exploited profited thats joke country thank elaborate informationdint know could elaborate mean saying nothing life encompass thanks correcting yes right title rather clearer privacy mean giving private space intruding space spamming relentlessly thank suggestion keep track spam hard pass since spammed hundreds emails also thank wishes youre realising email address provided registering company publicly listed ministry corporate affairs nobody sold details publicly available agreed entities simply taking advantage fact design country anyone access private companys financial records paying small fee thats like delaware incorporates companies never give away details unless court ordered lawsuit delaware llc registered nobody know shareholderslps bro op registered private company name info supposed private country need pay mca small fee get financial records shareholding pattern governance doc board directors etc pathetic shouldnt possible access private companies info even govt encourages lol mean cant anything except register delware tech company yes thats sad design yeah read delaware eu countries digital nomad stuff like startup intends develop product stock market automate parts investing process tracking markets etc bringing transparency forefront like criminal cases ceo promoter financial irregularities red flags caught algorithms sensitiveness nature productcompany wanted incorporate somewhere absolutely confidential co founder wanted us transparent first without hiding else others trust us also would need fundraise believe confidentiality possible know idea incorporate run fully confidentially also fund raise investors like vcs pes ive worked small finance firm often give phone numbers startup msme registration process clients companies change later ease processing number spam calls get random consultants damn high investors usually prefer company registered delaware singapore know law followed keep harping oh laws blah blah dont investors want protection founder shady shitfraud able use founders get restitution get india fraud rife indian startups especially fintech important incorporate india rbi bitch regulationsgood mean nowadays incorporating india becoming easier thats even investors dont care india incorporated pre case zirp free flow money investors wanted return ouch im stuck rock hard wish registered delaware currently im two month us stay brothers house like said financial regulators would allow outside companies operate areas like say mutual fundinsurance commissions sales app etc etc right would suggest sliding dm stories dont get enough media attention people dont get know things also started business email flooded spams also personal details available internet anyone know take info sites like zaubacorp others haha started restaurant sudden feed full sanjiv kapoor restaurant courses secrets business curious much costs register startup maintaining lol youre funny man begin google difference private public ltd company way crime company owners jailed hiding financial records shareholding pattern governance doc board director difference private company public company ownership shares private company doesnt mean info ownership shouldnt private countries basic info company publicly available bitching wrong thing youre getting downvoted attitude demeanor everyone gets spam calls messages emails etc globally india lack lot compared first world countries spammers scammers dont discriminate treat every country alike sarcasm difference private company public company ownership shares absolutely true never said private company doesnt mean info ownership shouldnt private yes talking think bloomberg terminal precious information already public countries basic info company publicly available shouldnt shouldnt able view shareholding pattern governance docs board directors etc private company shouldnt anyones business except shareholders private company know details look companies usa even europe register delaware llc ccorp jurisdiction never get info unless need lawsuit subpeona details registrar logic easy know holdings top private equity companies world dont privately operated weird definition private public means private doesnt mean shares private financials everything supposed private case india bitching stating facts states usa countries europe get privacy companies thats whole usp rest statescountries make info available public encourage transparency economy iphonesmacs offer better privacy india androidwindows take chill pill please isnt specific india even usa form llc data gets exposed start receiving lot marketing mail might consider spam others might talk watch everything tracked yeah get got downvoted told company wouldnt soits beyond may want try incogni privacy joke entire world aint ever gon na cold emailcold call prospects good luck scaling business country cribs privacy issues goes post somebody elses whatsapp number social media without consent",
    "light_cleaned_title": "Privacy is a joke in this country…actually error 404 privacy not found.",
    "light_cleaned_selftext": "So I just got my startup registered & now I’m flooded with spam emails from web/logo designers,tax compliance services, etc Can someone please explain how this happened & how to prevent it (IF big IF, there is a way to do so) It is so annoying. No respect to digital privacy.. Privacy is a joke in this country (ofcourse we saw what happened with aadhar data breach and covid data leak…)",
    "light_cleaned_comments": "Well, you got your startup registered. So I assume it was submitted to a government agency. Under the Privacy Act, they have no obligation at all to protect it. Sorry but You seem to have missed the whole point.. I submitted it to government but all these spam is coming from data being sold or misued. I am not sure you get what I am getting at. The government is under no legal obligation to protect your data. The Data Privacy Act passed earlier takes all responsibility away from all governments: Central and State. Anything can be 'leaked' a.k.a sold Oh we both mean the same…exactly why privacy is a joke and non existent in this country. Thanks to modiji’s govt for bring transparency by making sure there is no privacy hidden 🤡 Thought so...\"Desh nahi bikne dunga\" is selling everything including forests. Once entity is registered it gets updated in 3rd party sites Like Falcon ebiz Company details Startupwala Zauba corp etc When you are registered with mca you would have signed to public access of your information .Directors name , email id , address and some others will be made public .May be you should read the terms and conditions and then sign it . The companies and banks who are contacting you have bots which will fetch them your address and give it to them and nearby banks will approach you for current account opening, courier services will come to you . All this will happen for 2 weeks . you can hang a board outside your house .This is how it is, there is no data leak or sold , you just signed to it Wait for registered posts. There is a scam where some idiots print different rules and regulations from the Ministry of Corporate Affairs and then send to your newly created startup's registered address as Cash On Delivery order. Amount can vary from 1000 rupees to 10,000 rupees. The documents will appear as if sent from the MCA but remember to reject if they ask for money. All this information is publicly available on MCA website. MCA releases statistics of all the companies registered with them monthly, so anybody can go and check it out. True. Scrapers can get anything that's available on a public website. And its annoying. These companies dont respect and care about other people’s privacy and keep spamming relentlessly (just like bajaj finance spam calling people) Yes anybody can check them out but spam? Thats helluva annoying. 😞😞 Sure its made public but not made public for others to spam :) Wah wah..dint know these kinda scams exist lol …thanks! Do you know outside EU, privacy is a joke everywhere, in India there is much lesser scam calls due to Truecaller, in US there is so many more, it’s exponential this happened but next time when you register a domain name for your startup, make sure to buy the privacy protection otherwise they'll start calling you and it gets annoying real quick Businesses have no right to privacy. You should have used public-facing email address and phone number for your business. Also, maybe you should consider hiring some compliance services. It already looks like you've mixed personal and business mail. If you have a registered business, it is a separate entity and must be treated as such. BTW... have you ever looked at the label of anything you've ever purchased? You think all the address and contact information is there for funsies? No one care about what annoys you, they care about the money they make just like you will about the company your just started Thank you! Will do! I havent used personal mail for this tho. Mobile number yeah No no the point im making is these guys are spamming as soon as company is registered…that is the issue (using bots and scrapers) Not really. I wouldnt ever do so Data monetisation - essential reading… [ Explained: India plans to monetise public data. What is the draft data policy all about?](https://www.cnbctv18.com/technology/explained-india-plans-to-monetise-public-data-what-is-the-draft-data-policy-all-about-12594022.htm). Start-ups, enterprises, individuals, and researchers will be able to access data through licensing within the frameworks of data security and privacy, the draft states. Each department will have to define the period for which data will be retained. [ Govt earned over Rs 100 crore by selling vehicle owner data to private firms. Vahan and Sarathi databases contain details of registered vehicles and driving licenses in the country](https://www.deccanherald.com/india/govt-earned-over-rs-100-crore-by-selling-vehicle-owner-data-to-private-firms-950293.html) >May be you should read the terms and conditions and then sign it You'r right but the terms and conditions of any site written in very complicated terminologies that only a good advocate can understand. Absolutely right. This response should be at the top. Privacy is a myth everywhere. Unless you live in the middle of literally nowhere with no internet access there is a good chance nothing about your life is private. Heck I applied to a bunch of internships and they leaked my number. See your startup is already popular Care to share a single other country this doesn't happen. You start a business you would get targeted my marketing. That's how business is done. And this happens across the globe. Best is to use masked email for such registration on Govt portals. Use doosra like mobile number or take a landline specially for such purposes. I don't comprehend why it's considered a breach of privacy; what is OP expressing concern about? First and foremost, when you register a company, it becomes part of the public domain, accessible to everyone(Unless there is something fishy going on) – it's a bylaw. If it's accessible publicly, anyone proficient should be able to access it, that's the gist. My two cents to OP: please keep track of spam; there is a good amount of information coming ur way that you may not be aware of, and it could greatly benefit to your startup. &#x200B; Congratulations for your Start up. So I’m getting downvoted for making a point that my company would never spam. I’ll come back to this post if my company does well :) Wow getting downvoted for what? Data being public != spamming relentlessly by countless people Yeah EU has solid regulations Sure its made public but not made public for others to spam :) Thank you for this elaborate information! Haha good one Yes will do from now on Nonsense! It's akin to constructing a house and expecting only friends and relatives to view it. The reality is, it's open for everyone to see, and a select few will undoubtedly know how to access and capitalize on it. Rubbish! When something is public, it's visible to everyone, attracting both unwanted and potentially beneficial visitors. Embrace the fact that unknown visitors could form a mutually beneficial relationship with the homeowners. &#x200B; In fact WTF is OP crying about spam here in reddit after registering a business. Lol. Yes will do from now on , also for other websites in general (apple offers hide my email service) That’s absolutely crazy and outright wrong! Govt selling data to private firms lmao.. Okay so if they are “monetising our data” and our data being our asset, shouldn’t we also get a share of the revenues :P /sarcasm We submit data to government for compliance and regulatory purposes..not for them to sell to third party private firms for our data to be exploited and profited off. And thats why all of this is a joke in our country… And thank you for the elaborate information..dint know this before Could you elaborate on what do you mean by saying “nothing about your life”? What does it encompass? Thanks for correcting me. Yes you are right, the title should rather have been clearer By Privacy I mean giving private space and not intruding my space and spamming me relentlessly… Thank you for the suggestion to keep track of spam too (hard pass for now since spammed by hundreds of emails now) Also thank you for your wishes! :) What you’re not realising is that the email address you provided while registering your company is publicly listed by the Ministry of Corporate Affairs. Nobody sold your details, it is publicly available, and you agreed to the same. These entities are simply taking advantage of that fact. It's by design in our country. Anyone can access any private company's financial records by just paying a small fee. That's why I like how Delaware incorporates its companies, they will never give away your details unless court ordered for some lawsuit. If you have a Delaware LLC registered, nobody will know who are the the shareholders/LPs. Bro! OP registered a PRIVATE company, it is in the name, the info is supposed to be private, but in our country, all you need to do is pay MCA a small fee and you will get all their financial records, shareholding pattern, Governance doc, Board of directors etc. It's pathetic. It shouldn't be possible to access private companies info. But, here we are, where even the govt itself encourages it. Lol. I mean we can't do anything about it except register in Delware if it is a tech company. Yes thats the sad design… Yeah I read about delaware and some other EU countries for digital nomad and stuff like that.. The startup intends to develop a product for stock market to automate parts of the investing process and tracking the markets etc and bringing transparency to the forefront like what criminal cases a ceo or a promoter has or some financial irregularities red flags caught by our algorithms.. So because of the sensitiveness of the nature of the product/company i wanted to incorporate somewhere where it is absolutely confidential but my co founder wanted us to be transparent first without hiding and all or else why will others trust us? Also we would need to fundraise so I believe that confidentiality is not possible or is it? Do you know or have any idea if you can incorporate and run fully confidentially and also do fund raise (investors like VCs PEs ) ?? Ive worked in a small finance firm and we often give our phone numbers while doing start-up and MSME registration process of client’s companies and then change them later on for ease of processing. The number of spam calls i get from random consultants is too damn high. Investors usually prefer if your company is registered in Delaware or Singapore because they know that law is followed there( you can keep on harping that oh we have laws here, blah blah, we don't). Investors want protection. If founder does some shady shit/fraud they should be able to use the founders and get restitution which they will not get in India (fraud is rife in Indian startups). Especially in fintech, it is important to incorporate in India because RBI is a bitch about regulations(good). I mean nowadays, incorporating in India is becoming easier so that's why even investors don't care if they are India incorporated or not but pre 2021, that was the case. With Zirp and free flow of money, investors just wanted a return. Ouch, im stuck between a rock and a hard. Wish I registered it in Delaware (currently im on a two month US stay at my brothers house) But like you said financial regulators would not allow outside companies to operate in areas like say mutual fund/insurance commissions on sales through the app etc etc Right? So what would you suggest? Sliding into your DM! Some stories just don’t get enough media attention, so most people don’t get to know such things. I also started my business and my email is flooded with spams. Also personal details are available on internet. Does anyone know how to take down our info from sites like zaubacorp and others. Haha! I just started out a restaurant and all of a sudden all my feed is full of Sanjiv Kapoor restaurant courses and secrets to business and what not 😂 just curious how much it costs to register a startup. and maintaining it. Lol! you're funny man. T0 begin with, You should google the difference between private and public ltd company. By the way its crime and the company owners can be jailed for hiding their financial records, shareholding pattern, Governance doc, Board of director. Difference in private company and public company is about the ownership of shares. Private company doesn't mean the info of ownership shouldn't be private. In most countries, basic info of all company is publicly available. You are bitching about the wrong thing. You're getting downvoted because of your attitude and demeanor. Everyone gets spam calls, messages, emails etc GLOBALLY. India does lack a lot when compared to first world countries, but spammers and scammers don't discriminate and treat every country alike! (sarcasm) >Difference in private company and public company is about the ownership of shares. Absolutely true. I never said it is not. >Private company doesn't mean the info of ownership shouldn't be private. Yes, it should be! What are you talking about? What do you think Bloomberg terminal is so precious if such information was already public? >In most countries, basic info of all company is publicly available No, it's not and it shouldn't be. You shouldn't be able to view what is the shareholding pattern, governance docs, board of directors etc of a private company because it shouldn't be anyone's business except the shareholders of the private company to know such details. Look at companies in USA or even Europe. You register a Delaware LLC or C-corp in those jurisdiction, you will never get any info from them unless you need those for a lawsuit and subpeona those details from the registrar. By your logic, it should be easy to know holdings of top Private Equity companies of the world, but we don't because they are all privately operated. You have a weird definition of what private and public means. Private doesn't ONLY mean that its shares are private, it's financials, everything is supposed to be private which is not the case in India. I am not bitching, I am stating facts. only in some states in USA and some countries in Europe you get that privacy for companies because that's their whole USP. Rest of states/countries make info available in public to encourage transparency in economy. Do iPhones/Macs offer better privacy in india than android/windows? Take a chill pill please. This isn’t specific to India. Even in the USA, once you form an LLC, your data gets exposed and you start receiving a lot of marketing mail. You might consider this spam and others might not. From what you talk about to what you watch. Everything is tracked. Yeah I get it but i got downvoted because i told my company wouldn’t do so….its beyond me… :/ You may want to try “incogni” Privacy is a joke in the entire world. You ain't ever gonna cold email/cold call your prospects? Good luck scaling your business. And what does any of this have to do with \"this country\"? Cribs about privacy issues, goes on to post somebody else's whatsapp number on Social media without consent."
}