{
    "id": "16qdeoh",
    "title": "U.S. Provided Canada With Intelligence on Killing of Sikh Leader",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/canada-sikh-leader-killing-intelligence.html",
    "selftext": "It is a major fuck up.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 61,
    "created_utc": 1695498400.0,
    "convurl": "https://external-preview.redd.it/7P7T9nOT7cQGvqh9BeqJszn4Xt6TkFFHL1qGSKQZRXY.jpg?auto=webp&s=3f8ea77aa316a050540a890b86c8b2292dbafef7",
    "comments": [
        "Welp. Looks like Trudeau was following Bidens instructions as expected.\n\nTough luck for Vishwaguru.",
        "It's damning evidence and diplomats involved in murdering someone on foreign soil,a major breach of trust and total nightmare for foreign relations.",
        "1) This is no different than us killing solemani or even bin laden tbh..nijjar was not some “innocent canadian”… he was a designated terrorist by india..that being said there is no justification for covert killings and i don’t support it if india did it…2) selective media leaks are being done by western media on what the evidence is but no real evidence is being presented…would i trust their intelligence if they provided a concrete evidence? Sure but also remember that bush took his entire country to a war based on intelligence that “iraq had mass weapons of destruction”…we all know how that turned out..my point is that western intelligence at face value is not fallible and they would certainly lie if it benefitted them. 3) canada and possibly us just opened up a huge can of worms if the evidence is actually the communication between diplomats…it probably means that they were spying and spoofing on diplomats..this has implications beyond this dispute…many countries are looking at this probably wondering if their diplomats are being spyed on.",
        "What fuck up? \n\nUsa behind it again, all this probably cause we kept purchasing Russian oil and were non aligned.\n\nThey allowed our embassies to get attacked and to restrain us, show what can happen if we don't co-operate, just that this time the switch flipped and terrorist got killed.\n\n\"To be an enemy of the US is dangerous, but to be a friend is fatal\"\n\nWe need to be vigilant, Biden as a guest doesn't mean shit and the west will backstab/have controls against us constantly. No easy way throughout this.",
        "So u suggest cosy up to the Chinese, bcoz they are the only rival to America,  Plus Russia 🇷🇺 is officially a Chinese gimp.",
        "I thought nobody came to assistance of Canada because iNdiA big market and too important",
        "This NYT article has content with coefficient of BS on a different level!\n\n>\"Nevertheless, the killing, and the alleged involvement of the Indian government, has shocked officials in Washington. While democratic countries conduct targeted killings in unstable countries or regions and the spy services of more authoritarian governments — namely Russia — orchestrate assassinations anywhere they choose, it is unusual for a democratic country to conduct a lethal covert action in another democracy.\"\n\nhttps://archive.ph/fjihS\n\nThis is what happens when a country does not own a mirror or does not how to use one.\n\nHere is a list of countries that the US has bombed with a list of millions of innocent people that have been killed.\n\nhttps://davidswanson.org/warlist/\n\n>Since World War II, during a supposed golden age of peace, the United States military has killed or helped kill some 20 million people, overthrown at least 36 governments, interfered in at least 86 foreign elections, attempted to assassinate over 50 foreign leaders, and dropped bombs on people in over 30 countries. The United States is responsible for the deaths of 5 million people in Vietnam, Laos, and Cambodia, and over 1 million just since 2003 in Iraq.\n\n>Since 2001, the United States has been systematically destroying a region of the globe, bombing Afghanistan, Iraq, Pakistan, Libya, Somalia, Yemen, and Syria, not to mention the Philippines. The United States has “special forces” operating in two-thirds of the world’s countries and non-special forces in three-quarters of them.",
        "No Matter which part if the government you work for, it is guaranteed that it's run by utter morons that base their world views on shitty bollywood movies",
        "A stabber complaining about the person they stabbed calling the cops. \n\nWhy didn't he come to me in private (so i can stab him again) instead??",
        "Not to mention the 5eyes members in the past has also a long history of telling absolute lies even in the UN with satellite images/compelling images and what not. Who is to say that their \"human/signal intelligence\" isn't fake either?",
        "so are you saying that these countries should not tell when BJP does something wrong on a foreign soil of an ally just because they did it too in the past ? \n\nhalf the bhakts are denying it happened. half are going we did it because they did it too. vishwaguru trying to be putin ?",
        "so now usa is the bad guy ? and we are victims ??\n\nbjp using classical propaganda techniques , this time denying and acting victim. while finding vague reasons as to what motivation trudeau would have to put his reputation at stake against a country canada has had very good relations with. \n\nhttps://en.wikipedia.org/wiki/DARVO",
        "This explains the special session of parliament which is a total waste of time. Biden and Trudeau confronted Modi during G20. This means the Indian govt was expecting the revelation from Canada a few days after the special session. Parliament session is a distraction. In this context, yesterday's statement by their MP could be a setting to divert the topic.",
        "What's the evidence?. I can't read it because of the paywall",
        "Credible Allegations  is what you'll  get and that's  apparently  enough as per the western world. Rest of the world calls it bullshit!",
        "Vro it’s all for election. Truedue pappu something something. Sad. We could have sat down and given something in the back door and closed this. 🤷",
        "Idiotic actions by Indian govt.  this nijjar guy may have been a separatist but there is little to no support for khalistan apart from this fringe group in Canada.  Not a major threat to the union at all.  Hard to understand the risk vs reward of this covert action",
        "Rest of the world as in.. as in.. as in who exactly?",
        "Morons in government - are not the problem. People who keep re-electing them are.",
        "Narcissist's prayer v2:\n\nThat didn’t happen. \n\nAnd if it did, it wasn’t that bad. \n\nAnd if it was, that’s not a big deal. \n\nAnd if it is, it is not my fault. \n\nAnd if it was, I didn’t mean it. \n\nAnd if I did. You deserved it.\n          \nAnd even if you didn't deserve it, the US did it so it's OK.  <--- India is here",
        "BBC agrees with you : [https://www.bbc.com/news/in-pictures-66885924](https://www.bbc.com/news/in-pictures-66885924)\n\n\"Trudeau facing cold reality after lonely week on world stage\"\n\n\"**This week in New York, as he listened to questions from reporters, Canadian Prime Minister Justin Trudeau's reliable smile began to fade.** \"",
        "True",
        "India has 1.4 Billion bots that's pretty much rest of the world.",
        "But he had a big smile when he came for the G20. As if he didn't know about all this back then",
        "But he had a [big smile](https://twitter.com/PIB_India/status/1700163781299454356?t=etVRGlTZu2KBs8JwkilnDQ&s=19) when he came to India for the G20. As if he didn't know about all this back then",
        "Not 5-9-14 eyes members",
        "Right or wrong, nice perspective.",
        "I honestly dont trust the west. They literally attacked Iraq on the basis of lies and have not had to be accountable to anyone about it. \n\nMaybe they have enough proof, maybe they dont. We need allies, or neutral bodies that cant be pressured by the west. Sadly there is no such neutral body and the few two countries that are immune to western pressure are - Iran, China, Russia and the like. Russia has lost the plot. Iran isnt seen as reasonable and China might fuck us over even if we are in the right. \n\nWe're alone in this, sadly.",
        "And they invited Biden to be chief guest at Republic Day next year. Let's see if he comes.",
        "It's a blunder by Jaishankar or whoever was responsible for our response in the government. I don't support this assassination but this is a mistake even purely from geopolitical perspective. If we were indeed guilty, we should have tried to de-escalate the situation rather than antagonizing Canada and escalating it. We may not see any immediate repercussion but we have lost lots of negotiating power in future deals. Our future lies with the West.",
        "But he had a [big smile](https://twitter.com/PIB_India/status/1700163781299454356?t=etVRGlTZu2KBs8JwkilnDQ&s=19) when he came to India for the G20. As if he didn't know about all this back then, that he's doing such drama in front of the media",
        "India don't have oil. They don't have to make false accusations.",
        "Lol",
        "Lets see the proof",
        "Now sanghi warriors have become expert Detectives lol",
        "huh? are you talking about me?",
        "Are you a sanghi? I don't know.",
        "Its a strange conclusion to reach."
    ],
    "cleaned_text": "us provided canada intelligence killing sikh leader major fuck ",
    "cleaned_title": "us provided canada intelligence killing sikh leader",
    "cleaned_selftext": "major fuck",
    "cleaned_comments": "welp looks like trudeau following bidens instructions expected tough luck vishwaguru damning evidence diplomats involved murdering someone foreign soila major breach trust total nightmare foreign relations different us killing solemani even bin laden tbhnijjar innocent canadian designated terrorist indiathat said justification covert killings dont support india selective media leaks done western media evidence real evidence presentedwould trust intelligence provided concrete evidence sure also remember bush took entire country war based intelligence iraq mass weapons destructionwe know turned outmy point western intelligence face value fallible would certainly lie benefitted canada possibly us opened huge worms evidence actually communication diplomatsit probably means spying spoofing diplomatsthis implications beyond disputemany countries looking probably wondering diplomats spyed fuck usa behind probably cause kept purchasing russian oil non aligned allowed embassies get attacked restrain us show happen dont cooperate time switch flipped terrorist got killed enemy us dangerous friend fatal need vigilant biden guest doesnt mean shit west backstabhave controls us constantly easy way throughout u suggest cosy chinese bcoz rival america plus russia officially chinese gimp thought nobody came assistance canada india big market important nyt article content coefficient bs different level nevertheless killing alleged involvement indian government shocked officials washington democratic countries conduct targeted killings unstable countries regions spy services authoritarian governments namely russia orchestrate assassinations anywhere choose unusual democratic country conduct lethal covert action another democracy happens country mirror use one list countries us bombed list millions innocent people killed since world war ii supposed golden age peace united states military killed helped kill million people overthrown least governments interfered least foreign elections attempted assassinate foreign leaders dropped bombs people countries united states responsible deaths million people vietnam laos cambodia million since iraq since united states systematically destroying region globe bombing afghanistan iraq pakistan libya somalia yemen syria mention philippines united states special forces operating twothirds worlds countries nonspecial forces threequarters matter part government work guaranteed run utter morons base world views shitty bollywood movies stabber complaining person stabbed calling cops didnt come private stab instead mention eyes members past also long history telling absolute lies even un satellite imagescompelling images say humansignal intelligence isnt fake either saying countries tell bjp something wrong foreign soil ally past half bhakts denying happened half going vishwaguru trying putin usa bad guy victims bjp using classical propaganda techniques time denying acting victim finding vague reasons motivation trudeau would put reputation stake country canada good relations explains special session parliament total waste time biden trudeau confronted modi g means indian govt expecting revelation canada days special session parliament session distraction context yesterdays statement mp could setting divert topic whats evidence cant read paywall credible allegations youll get thats apparently enough per western world rest world calls bullshit vro election truedue pappu something something sad could sat given something back door closed idiotic actions indian govt nijjar guy may separatist little support khalistan apart fringe group canada major threat union hard understand risk vs reward covert action rest world exactly morons government problem people keep reelecting narcissists prayer v didnt happen wasnt bad thats big deal fault didnt mean deserved even didnt deserve us ok india bbc agrees httpswwwbbccomnewsinpictureshttpswwwbbccomnewsinpictures trudeau facing cold reality lonely week world stage week new york listened questions reporters canadian prime minister justin trudeaus reliable smile began fade true india billion bots thats pretty much rest world big smile came g didnt know back big smilehttpstwittercompibindiastatustetvrgltzukbsjwkilndqs came india g didnt know back eyes members right wrong nice perspective honestly dont trust west literally attacked iraq basis lies accountable anyone maybe enough proof maybe dont need allies neutral bodies cant pressured west sadly neutral body two countries immune western pressure iran china russia like russia lost plot iran isnt seen reasonable china might fuck us even right alone sadly invited biden chief guest republic day next year lets see comes blunder jaishankar whoever responsible response government dont support assassination mistake even purely geopolitical perspective indeed guilty tried deescalate situation rather antagonizing canada escalating may see immediate repercussion lost lots negotiating power future deals future lies west big smilehttpstwittercompibindiastatustetvrgltzukbsjwkilndqs came india g didnt know back hes drama front media india dont oil dont make false accusations lol lets see proof sanghi warriors become expert detectives lol huh talking sanghi dont know strange conclusion reach",
    "light_cleaned_title": "U.S. Provided Canada With Intelligence on Killing of Sikh Leader",
    "light_cleaned_selftext": "It is a major fuck up.",
    "light_cleaned_comments": "Welp. Looks like Trudeau was following Bidens instructions as expected. Tough luck for Vishwaguru. It's damning evidence and diplomats involved in murdering someone on foreign soil,a major breach of trust and total nightmare for foreign relations. 1) This is no different than us killing solemani or even bin laden tbh..nijjar was not some “innocent canadian”… he was a designated terrorist by india..that being said there is no justification for covert killings and i don’t support it if india did it…2) selective media leaks are being done by western media on what the evidence is but no real evidence is being presented…would i trust their intelligence if they provided a concrete evidence? Sure but also remember that bush took his entire country to a war based on intelligence that “iraq had mass weapons of destruction”…we all know how that turned out..my point is that western intelligence at face value is not fallible and they would certainly lie if it benefitted them. 3) canada and possibly us just opened up a huge can of worms if the evidence is actually the communication between diplomats…it probably means that they were spying and spoofing on diplomats..this has implications beyond this dispute…many countries are looking at this probably wondering if their diplomats are being spyed on. What fuck up? Usa behind it again, all this probably cause we kept purchasing Russian oil and were non aligned. They allowed our embassies to get attacked and to restrain us, show what can happen if we don't co-operate, just that this time the switch flipped and terrorist got killed. \"To be an enemy of the US is dangerous, but to be a friend is fatal\" We need to be vigilant, Biden as a guest doesn't mean shit and the west will backstab/have controls against us constantly. No easy way throughout this. So u suggest cosy up to the Chinese, bcoz they are the only rival to America, Plus Russia 🇷🇺 is officially a Chinese gimp. I thought nobody came to assistance of Canada because iNdiA big market and too important This NYT article has content with coefficient of BS on a different level! >\"Nevertheless, the killing, and the alleged involvement of the Indian government, has shocked officials in Washington. While democratic countries conduct targeted killings in unstable countries or regions and the spy services of more authoritarian governments — namely Russia — orchestrate assassinations anywhere they choose, it is unusual for a democratic country to conduct a lethal covert action in another democracy.\" This is what happens when a country does not own a mirror or does not how to use one. Here is a list of countries that the US has bombed with a list of millions of innocent people that have been killed. >Since World War II, during a supposed golden age of peace, the United States military has killed or helped kill some 20 million people, overthrown at least 36 governments, interfered in at least 86 foreign elections, attempted to assassinate over 50 foreign leaders, and dropped bombs on people in over 30 countries. The United States is responsible for the deaths of 5 million people in Vietnam, Laos, and Cambodia, and over 1 million just since 2003 in Iraq. >Since 2001, the United States has been systematically destroying a region of the globe, bombing Afghanistan, Iraq, Pakistan, Libya, Somalia, Yemen, and Syria, not to mention the Philippines. The United States has “special forces” operating in two-thirds of the world’s countries and non-special forces in three-quarters of them. No Matter which part if the government you work for, it is guaranteed that it's run by utter morons that base their world views on shitty bollywood movies A stabber complaining about the person they stabbed calling the cops. Why didn't he come to me in private (so i can stab him again) instead?? Not to mention the 5eyes members in the past has also a long history of telling absolute lies even in the UN with satellite images/compelling images and what not. Who is to say that their \"human/signal intelligence\" isn't fake either? so are you saying that these countries should not tell when BJP does something wrong on a foreign soil of an ally just because they did it too in the past ? half the bhakts are denying it happened. half are going we did it because they did it too. vishwaguru trying to be putin ? so now usa is the bad guy ? and we are victims ?? bjp using classical propaganda techniques , this time denying and acting victim. while finding vague reasons as to what motivation trudeau would have to put his reputation at stake against a country canada has had very good relations with. This explains the special session of parliament which is a total waste of time. Biden and Trudeau confronted Modi during G20. This means the Indian govt was expecting the revelation from Canada a few days after the special session. Parliament session is a distraction. In this context, yesterday's statement by their MP could be a setting to divert the topic. What's the evidence?. I can't read it because of the paywall Credible Allegations is what you'll get and that's apparently enough as per the western world. Rest of the world calls it bullshit! Vro it’s all for election. Truedue pappu something something. Sad. We could have sat down and given something in the back door and closed this. 🤷 Idiotic actions by Indian govt. this nijjar guy may have been a separatist but there is little to no support for khalistan apart from this fringe group in Canada. Not a major threat to the union at all. Hard to understand the risk vs reward of this covert action Rest of the world as in.. as in.. as in who exactly? Morons in government - are not the problem. People who keep re-electing them are. Narcissist's prayer v2: That didn’t happen. And if it did, it wasn’t that bad. And if it was, that’s not a big deal. And if it is, it is not my fault. And if it was, I didn’t mean it. And if I did. You deserved it. And even if you didn't deserve it, the US did it so it's OK. <--- India is here BBC agrees with you : [https://www.bbc.com/news/in-pictures-66885924](https://www.bbc.com/news/in-pictures-66885924) \"Trudeau facing cold reality after lonely week on world stage\" \"**This week in New York, as he listened to questions from reporters, Canadian Prime Minister Justin Trudeau's reliable smile began to fade.** \" True India has 1.4 Billion bots that's pretty much rest of the world. But he had a big smile when he came for the G20. As if he didn't know about all this back then But he had a [big smile](https://twitter.com/PIB_India/status/1700163781299454356?t=etVRGlTZu2KBs8JwkilnDQ&s=19) when he came to India for the G20. As if he didn't know about all this back then Not 5-9-14 eyes members Right or wrong, nice perspective. I honestly dont trust the west. They literally attacked Iraq on the basis of lies and have not had to be accountable to anyone about it. Maybe they have enough proof, maybe they dont. We need allies, or neutral bodies that cant be pressured by the west. Sadly there is no such neutral body and the few two countries that are immune to western pressure are - Iran, China, Russia and the like. Russia has lost the plot. Iran isnt seen as reasonable and China might fuck us over even if we are in the right. We're alone in this, sadly. And they invited Biden to be chief guest at Republic Day next year. Let's see if he comes. It's a blunder by Jaishankar or whoever was responsible for our response in the government. I don't support this assassination but this is a mistake even purely from geopolitical perspective. If we were indeed guilty, we should have tried to de-escalate the situation rather than antagonizing Canada and escalating it. We may not see any immediate repercussion but we have lost lots of negotiating power in future deals. Our future lies with the West. But he had a [big smile](https://twitter.com/PIB_India/status/1700163781299454356?t=etVRGlTZu2KBs8JwkilnDQ&s=19) when he came to India for the G20. As if he didn't know about all this back then, that he's doing such drama in front of the media India don't have oil. They don't have to make false accusations. Lol Lets see the proof Now sanghi warriors have become expert Detectives lol huh? are you talking about me? Are you a sanghi? I don't know. Its a strange conclusion to reach."
}