{
    "id": "1dvq4l2",
    "title": "Kerala's maritime triumph: Vizhinjam port to welcome first mothership on July 12",
    "url": "https://english.mathrubhumi.com/amp/news/kerala/adani-port-updates-from-vizhinjam-in-kerala-1.9695205",
    "selftext": "Thiruvananthapuram: The Adani Group's Vizhinjam Port, situated near the renowned Kovalam beach in Kerala, is poised to receive its inaugural mothership on July 12, following the completion of the first phase of India's inaugural exclusive trans-shipment port, confirmed a senior port official on Thursday.\n\nDivya S. Iyer, the Managing Director of the port, said, \"Things are all in place, and on July 12, the first mothership will arrive.\"\n\n\"This marks a pivotal moment for the port, symbolising the significant achievement of the initial phase of this extensive project. Union Ministers and Chief Minister Pinarayi Vijayan, among other dignitaries, are expected to grace the occasion,\" Iyer added.\n\nOn June 11, Kerala Port Minister V.N. Vasavan informed the State Assembly that full-scale commercial operations at the port are anticipated to commence before the year's end.\n\nIn addition to its status as the nation's first exclusive trans-shipment port, Vizhinjam will also gain distinction as the country's inaugural semi-automated container terminal.\n\nFurthermore, Vizhinjam aims to become a prominent bunkering hub globally, supplying eco-friendly fuels such as hydrogen and ammonia.\n\nUpon completion, the port is set to be one of the world's most environmentally friendly ports, complementing Kerala's reputation for environmental consciousness.\n\nWith a natural draft of 18 metres, Vizhinjam is slated to accommodate some of the largest container vessels globally.\n\nStrategically positioned, the port lies just 10 nautical miles from the international shipping route connecting Europe, the Persian Gulf, and the Far East ",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 0,
    "created_utc": 1720156076.0,
    "convurl": "https://external-preview.redd.it/pvDspaEpzAXPMfbcXPH4MMp8Yp4FzS5iZYRfKpYT01k.jpg?auto=webp&s=e3e91393e401ef23d7d34823aa03791bcaa732ca",
    "comments": [],
    "cleaned_text": "keralas maritime triumph vizhinjam port welcome first mothership july thiruvananthapuram adani groups vizhinjam port situated near renowned kovalam beach kerala poised receive inaugural mothership july following completion first phase indias inaugural exclusive transshipment port confirmed senior port official thursday divya iyer managing director port said things place july first mothership arrive marks pivotal moment port symbolising significant achievement initial phase extensive project union ministers chief minister pinarayi vijayan among dignitaries expected grace occasion iyer added june kerala port minister vn vasavan informed state assembly fullscale commercial operations port anticipated commence years end addition status nations first exclusive transshipment port vizhinjam also gain distinction countrys inaugural semiautomated container terminal furthermore vizhinjam aims become prominent bunkering hub globally supplying ecofriendly fuels hydrogen ammonia upon completion port set one worlds environmentally friendly ports complementing keralas reputation environmental consciousness natural draft metres vizhinjam slated accommodate largest container vessels globally strategically positioned port lies nautical miles international shipping route connecting europe persian gulf far east ",
    "cleaned_title": "keralas maritime triumph vizhinjam port welcome first mothership july",
    "cleaned_selftext": "thiruvananthapuram adani groups vizhinjam port situated near renowned kovalam beach kerala poised receive inaugural mothership july following completion first phase indias inaugural exclusive transshipment port confirmed senior port official thursday divya iyer managing director port said things place july first mothership arrive marks pivotal moment port symbolising significant achievement initial phase extensive project union ministers chief minister pinarayi vijayan among dignitaries expected grace occasion iyer added june kerala port minister vn vasavan informed state assembly fullscale commercial operations port anticipated commence years end addition status nations first exclusive transshipment port vizhinjam also gain distinction countrys inaugural semiautomated container terminal furthermore vizhinjam aims become prominent bunkering hub globally supplying ecofriendly fuels hydrogen ammonia upon completion port set one worlds environmentally friendly ports complementing keralas reputation environmental consciousness natural draft metres vizhinjam slated accommodate largest container vessels globally strategically positioned port lies nautical miles international shipping route connecting europe persian gulf far east",
    "cleaned_comments": "",
    "light_cleaned_title": "Kerala's maritime triumph: Vizhinjam port to welcome first mothership on July 12",
    "light_cleaned_selftext": "Thiruvananthapuram: The Adani Group's Vizhinjam Port, situated near the renowned Kovalam beach in Kerala, is poised to receive its inaugural mothership on July 12, following the completion of the first phase of India's inaugural exclusive trans-shipment port, confirmed a senior port official on Thursday. Divya S. Iyer, the Managing Director of the port, said, \"Things are all in place, and on July 12, the first mothership will arrive.\" \"This marks a pivotal moment for the port, symbolising the significant achievement of the initial phase of this extensive project. Union Ministers and Chief Minister Pinarayi Vijayan, among other dignitaries, are expected to grace the occasion,\" Iyer added. On June 11, Kerala Port Minister V.N. Vasavan informed the State Assembly that full-scale commercial operations at the port are anticipated to commence before the year's end. In addition to its status as the nation's first exclusive trans-shipment port, Vizhinjam will also gain distinction as the country's inaugural semi-automated container terminal. Furthermore, Vizhinjam aims to become a prominent bunkering hub globally, supplying eco-friendly fuels such as hydrogen and ammonia. Upon completion, the port is set to be one of the world's most environmentally friendly ports, complementing Kerala's reputation for environmental consciousness. With a natural draft of 18 metres, Vizhinjam is slated to accommodate some of the largest container vessels globally. Strategically positioned, the port lies just 10 nautical miles from the international shipping route connecting Europe, the Persian Gulf, and the Far East",
    "light_cleaned_comments": ""
}