{
    "id": "1drb8dn",
    "title": "I received email from cyber cell regarding child pornography ",
    "url": "https://www.reddit.com/gallery/1drb8dn",
    "selftext": "I checked my spam received an email from police.igs106@officecrime-in-vodafone.de\n saying that I need to respond in 24 hours . \nAll I'm seeing is regular porn , sometimes amateur on xHamster or xvideos or hentaiHaven . Wtf ?!\nI never even searched it just for fun.\n\nIs it a fake mail  or scam ?  If it is , I would like to sue the person/company sending this false accusation.",
    "flair": "Crime",
    "score": 7,
    "num_comments": 40,
    "created_utc": 1719667786.0,
    "convurl": "https://i.redd.it/nme4bjx7ji9d1.png",
    "comments": [
        "The email alone itself is an indication that this is a scam. Please ignore this and move on with your life.",
        "https://www.google.com/amp/s/timesofindia.indiatimes.com/city/kolkata/cops-issue-alert-against-fake-cybercrime-court-orders/amp_articleshow/109115670.cms\nYeah I just searched the name of the officer and found this. Yeah now I'm relaxed.",
        "Cybercrime cell / Computer centre lol",
        "Hacker hai bhai hacker hai",
        "Lol it’s a scam, but I too would be shitscared seeing such email lol. Hope it helps you in avoiding porn in near future 😂 Not good for us anyways",
        "Yeah I noticed a lot of irregularities in the email and the attachment but I thought that this is the best the police department can do when it comes to grammar.",
        "This is a scam. Someone else made a similar post a few days back with that exact image of yours. Just ignore it",
        "How do people stil fall for this in this day and age?",
        "Not enough stamps. Definitely legit /S",
        "Fake cant see Modi's pic here ",
        "Why hit Rabada when it was possibly his last over in powerplay",
        ".de is german. So Germans are scamming us now ??",
        "Forewarn is to forearm. I want to use this phrase in a zoom call",
        "🤣🤣 Do you think sites that distribute child pornography are simply blocked?",
        "Fake hein bhai",
        "Tell them, \"fuck you\"",
        "Scammer went overkill mode, used up all the agencies cbi, ib, etc known to him in one phishing mail lol😂",
        "😂😂",
        "Itni stamp to real hi hai",
        "https://preview.redd.it/ejooeeebej9d1.jpeg?width=700&format=pjpg&auto=webp&s=e3972f1583d8b70a178f20c1ac1c92393dccadf4",
        "It have more stamps and logos than any standard economic policy. WTF is certified, certified copy barcode, top secret stamp for and even so many police logos.",
        "Why is it top secret and getting mailed to everyone?",
        "Fbi open up got real (Indian edition)",
        "I thought it's real but then saw that top secret stamp lol no way scammer added that ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
        "Need more stamps so I can believe it.",
        "Bro used every logo he could find on the internet  🤣",
        "..",
        "My cousin also received a call from someone. They were scolding her saying, the call was from CBI and her name was involved in a child trafficking case.",
        "Standard scam email.  Very common. Ignore it and delete",
        "Can you explain in details",
        "Can you explain in details?",
        "We got an Indian getting scammed before we got gta6",
        "There was a time when CP was too common. How would they scam you for the almost non-existent genre?",
        "bhai kya chal raha hai, sab koi top secret documents kyun share kar rahe hain?\n\nsarkar ka mazak bana rakha hai /s",
        ".de is the german domain just like .in is Indian and the email address of the so called Cyber Cell has the .de domain.",
        "There is a line which says alleged court order. Court orders can never be alleged - this itself shows it isn’t an official email 😁",
        "It top secret man. Are you trying to implicate everyone??",
        "top secrate lmao",
        "Ok thanks"
    ],
    "cleaned_text": "received email cyber cell regarding child pornography checked spam received email policeigsofficecrimeinvodafonede saying need respond hours im seeing regular porn sometimes amateur xhamster xvideos hentaihaven wtf never even searched fun fake mail scam would like sue personcompany sending false accusation ",
    "cleaned_title": "received email cyber cell regarding child pornography",
    "cleaned_selftext": "checked spam received email policeigsofficecrimeinvodafonede saying need respond hours im seeing regular porn sometimes amateur xhamster xvideos hentaihaven wtf never even searched fun fake mail scam would like sue personcompany sending false accusation",
    "cleaned_comments": "email alone indication scam please ignore move life yeah searched name officer found yeah im relaxed cybercrime cell computer centre lol hacker hai bhai hacker hai lol scam would shitscared seeing email lol hope helps avoiding porn near future good us anyways yeah noticed lot irregularities email attachment thought best police department comes grammar scam someone else made similar post days back exact image ignore people stil fall day age enough stamps definitely legit fake cant see modis pic hit rabada possibly last powerplay de german germans scamming us forewarn forearm want use phrase zoom call think sites distribute child pornography simply blocked fake hein bhai tell fuck scammer went overkill mode used agencies cbi ib etc known one phishing mail lol itni stamp real hi hai stamps logos standard economic policy wtf certified certified copy barcode top secret stamp even many police logos top secret getting mailed everyone fbi open got real indian edition thought real saw top secret stamp lol way scammer added need stamps believe bro used every logo could find internet cousin also received call someone scolding saying call cbi name involved child trafficking case standard scam email common ignore delete explain details explain details got indian getting scammed got gta time cp common would scam almost nonexistent genre bhai kya chal raha hai sab koi top secret documents kyun share kar rahe hain sarkar ka mazak bana rakha hai de german domain like indian email address called cyber cell de domain line says alleged court order court orders never alleged shows isnt official email top secret man trying implicate everyone top secrate lmao ok thanks",
    "light_cleaned_title": "I received email from cyber cell regarding child pornography",
    "light_cleaned_selftext": "I checked my spam received an email from police.igs106@officecrime-in-vodafone.de saying that I need to respond in 24 hours . All I'm seeing is regular porn , sometimes amateur on xHamster or xvideos or hentaiHaven . Wtf ?! I never even searched it just for fun. Is it a fake mail or scam ? If it is , I would like to sue the person/company sending this false accusation.",
    "light_cleaned_comments": "The email alone itself is an indication that this is a scam. Please ignore this and move on with your life. Yeah I just searched the name of the officer and found this. Yeah now I'm relaxed. Cybercrime cell / Computer centre lol Hacker hai bhai hacker hai Lol it’s a scam, but I too would be shitscared seeing such email lol. Hope it helps you in avoiding porn in near future 😂 Not good for us anyways Yeah I noticed a lot of irregularities in the email and the attachment but I thought that this is the best the police department can do when it comes to grammar. This is a scam. Someone else made a similar post a few days back with that exact image of yours. Just ignore it How do people stil fall for this in this day and age? Not enough stamps. Definitely legit /S Fake cant see Modi's pic here Why hit Rabada when it was possibly his last over in powerplay .de is german. So Germans are scamming us now ?? Forewarn is to forearm. I want to use this phrase in a zoom call 🤣🤣 Do you think sites that distribute child pornography are simply blocked? Fake hein bhai Tell them, \"fuck you\" Scammer went overkill mode, used up all the agencies cbi, ib, etc known to him in one phishing mail lol😂 😂😂 Itni stamp to real hi hai It have more stamps and logos than any standard economic policy. WTF is certified, certified copy barcode, top secret stamp for and even so many police logos. Why is it top secret and getting mailed to everyone? Fbi open up got real (Indian edition) I thought it's real but then saw that top secret stamp lol no way scammer added that ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯ Need more stamps so I can believe it. Bro used every logo he could find on the internet 🤣 .. My cousin also received a call from someone. They were scolding her saying, the call was from CBI and her name was involved in a child trafficking case. Standard scam email. Very common. Ignore it and delete Can you explain in details Can you explain in details? We got an Indian getting scammed before we got gta6 There was a time when CP was too common. How would they scam you for the almost non-existent genre? bhai kya chal raha hai, sab koi top secret documents kyun share kar rahe hain? sarkar ka mazak bana rakha hai /s .de is the german domain just like .in is Indian and the email address of the so called Cyber Cell has the .de domain. There is a line which says alleged court order. Court orders can never be alleged - this itself shows it isn’t an official email 😁 It top secret man. Are you trying to implicate everyone?? top secrate lmao Ok thanks"
}