{
    "id": "1b1xdit",
    "title": "Mumbai: ’Forced to withdraw case,’ claims 29-year-old woman after filing rape case against ex-corporator",
    "url": "https://www.mid-day.com/mumbai/mumbai-news/article/mumbai-forced-to-withdraw-case-claims-29-year-old-woman-after-filing-rape-case-against-ex-corporator-23337197",
    "selftext": "Our great oligarchy. I won't pin it on a particular party, it's true for ever single group.",
    "flair": "Crime",
    "score": 108,
    "num_comments": 8,
    "created_utc": 1709095393.0,
    "convurl": "https://external-preview.redd.it/gaChV--P99A4b0IQQN0xsUDtOsaRrucZn3q5jykOVPM.jpg",
    "comments": [
        "I hope she gets justice",
        "That's the only thing we can do, to hope. We are basically incapable of offering her anything better.",
        "I wonder what will the \"both sides are bad\" or \"we don't have any other alternative\" crowd say about this?",
        "Both sides are bad",
        "Reminds me of Salman's hit n run. The rich and powerful can get away with literally anything",
        "Ah! Good for them.",
        "Police cooperated with the politicians to screw up the case. If police claims there is no evidence, then the victim cannot do anything."
    ],
    "cleaned_text": "mumbai forced withdraw case claims yearold woman filing rape case excorporator great oligarchy wont pin particular party true ever single group ",
    "cleaned_title": "mumbai forced withdraw case claims yearold woman filing rape case excorporator",
    "cleaned_selftext": "great oligarchy wont pin particular party true ever single group",
    "cleaned_comments": "hope gets justice thats thing hope basically incapable offering anything better wonder sides bad dont alternative crowd say sides bad reminds salmans hit n run rich powerful get away literally anything ah good police cooperated politicians screw case police claims evidence victim anything",
    "light_cleaned_title": "Mumbai: ’Forced to withdraw case,’ claims 29-year-old woman after filing rape case against ex-corporator",
    "light_cleaned_selftext": "Our great oligarchy. I won't pin it on a particular party, it's true for ever single group.",
    "light_cleaned_comments": "I hope she gets justice That's the only thing we can do, to hope. We are basically incapable of offering her anything better. I wonder what will the \"both sides are bad\" or \"we don't have any other alternative\" crowd say about this? Both sides are bad Reminds me of Salman's hit n run. The rich and powerful can get away with literally anything Ah! Good for them. Police cooperated with the politicians to screw up the case. If police claims there is no evidence, then the victim cannot do anything."
}