{
    "id": "1c334bh",
    "title": "Corporate - 1, Humanity - 0",
    "url": "https://www.reddit.com/gallery/1c334bh",
    "selftext": "https://restofworld.org/2024/swiggy-health-insurance-quotas/",
    "flair": "Rant / Vent",
    "score": 62,
    "num_comments": 6,
    "created_utc": 1713018183.0,
    "convurl": "https://i.redd.it/h53n8cwia9uc1.jpg",
    "comments": [
        "It's been corporate - 1200000 humanity - 0\n\nBut it's never too late to make change",
        "But then what stops me from getting the insurance for me and my family if I register as a gig worker and deliver just one order every week? This is not a govt free for all scheme.",
        "Is that what all office workers who get medical benefits do? Not work at all and just exploit the system? If Zomato doesn't want to provide medical to \"gig workers\", why do they lie and pretend to do so in the first place?",
        "Do you understand why employee and workforce insurance exist?\nIf something happens when employee is on duty then its company's duty to pay for his liabilities. These kind of insurances are legal necessity in most developed nations.",
        "Did you even read? They do offer insurance when they are on duty at all times.",
        "You are just shitting without even reading the entire article.",
        "Let's vote"
    ],
    "cleaned_text": "corporate humanity  ",
    "cleaned_title": "corporate humanity",
    "cleaned_selftext": "",
    "cleaned_comments": "corporate humanity never late make change stops getting insurance family register gig worker deliver one order every week govt free scheme office workers get medical benefits work exploit system zomato doesnt want provide medical gig workers lie pretend first place understand employee workforce insurance exist something happens employee duty companys duty pay liabilities kind insurances legal necessity developed nations even read offer insurance duty times shitting without even reading entire article lets vote",
    "light_cleaned_title": "Corporate - 1, Humanity - 0",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "It's been corporate - 1200000 humanity - 0 But it's never too late to make change But then what stops me from getting the insurance for me and my family if I register as a gig worker and deliver just one order every week? This is not a govt free for all scheme. Is that what all office workers who get medical benefits do? Not work at all and just exploit the system? If Zomato doesn't want to provide medical to \"gig workers\", why do they lie and pretend to do so in the first place? Do you understand why employee and workforce insurance exist? If something happens when employee is on duty then its company's duty to pay for his liabilities. These kind of insurances are legal necessity in most developed nations. Did you even read? They do offer insurance when they are on duty at all times. You are just shitting without even reading the entire article. Let's vote"
}