{
    "id": "14zbe8r",
    "title": "A question regarding medical testing regarding for entering the Indian military",
    "url": "https://www.reddit.com/r/india/comments/14zbe8r/a_question_regarding_medical_testing_regarding/",
    "selftext": "Medical tests are conducted for candidates entering the armed forces for both male and female candidates. Recently I saw a [comment](https://np.reddit.com/r/sunraybee/comments/14vi0ci/comment/jrfea13/?utm_source=share&utm_medium=web2x&context=3) on reddit under a [post](https://np.reddit.com/r/sunraybee/comments/14vi0ci/bhai_ye_sab_bhi_hota_hai_kya/?utm_source=share&utm_medium=web2x&context=3) claiming when the \"private parts\" of male Air Force candidates were examined by doctors there was female officer/staff present in the room as a data entry personnel. As far I know generally male candidates are examined by male doctors in some rare cases [senior female doctors do so](https://np.reddit.com/r/sunraybee/comments/14vi0ci/comment/jrdkut0/?utm_source=share&utm_medium=web2x&context=3). But why would a lady staff be posted in a room where the intimate examinations of male candidates are being carried out for the Air Force    unless she herself is a nurse or doctor ? I know being a soldier means letting go of shame in some cases but still the dignity of the male   candidates should be maintained. Since I am not a soldier or from a military background I can not say if this a common occurrence or a rare case / outlier.\n\nI do not think that non-medical male staff/officers are present in the medical room during the intimate examinations of female candidates otherwise it would  cause problems like it had in the [past](https://timesofindia.indiatimes.com/india/Army-gets-women-recruits-examined-by-male-docs/articleshow/860461.cms).\n\nWhat do you guys think ? any one from defense background or had given defense medical tests",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689325977.0,
    "convurl": "https://external-preview.redd.it/a-X78fcSAgvD2jVTFvh8cQct2TuxA8xER1FOynCzfy8.jpg?auto=webp&amp;s=62d0bf2caedfd5380f17312cbe70412e67ef65c8",
    "comments": [],
    "cleaned_text": "question regarding medical testing regarding entering indian military medical tests conducted candidates entering armed forces male female candidates recently saw commenthttpsnpredditcomrsunraybeecommentsvicicommentjrfeautmsourceshareutmmediumwebxcontext reddit posthttpsnpredditcomrsunraybeecommentsvicibhaiyesabbhihotahaikyautmsourceshareutmmediumwebxcontext claiming private parts male air force candidates examined doctors female officerstaff present room data entry personnel far know generally male candidates examined male doctors rare cases senior female doctors sohttpsnpredditcomrsunraybeecommentsvicicommentjrdkututmsourceshareutmmediumwebxcontext would lady staff posted room intimate examinations male candidates carried air force unless nurse doctor know soldier means letting go shame cases still dignity male candidates maintained since soldier military background say common occurrence rare case outlier think nonmedical male staffofficers present medical room intimate examinations female candidates otherwise would cause problems like pasthttpstimesofindiaindiatimescomindiaarmygetswomenrecruitsexaminedbymaledocsarticleshowcms guys think one defense background given defense medical tests ",
    "cleaned_title": "question regarding medical testing regarding entering indian military",
    "cleaned_selftext": "medical tests conducted candidates entering armed forces male female candidates recently saw commenthttpsnpredditcomrsunraybeecommentsvicicommentjrfeautmsourceshareutmmediumwebxcontext reddit posthttpsnpredditcomrsunraybeecommentsvicibhaiyesabbhihotahaikyautmsourceshareutmmediumwebxcontext claiming private parts male air force candidates examined doctors female officerstaff present room data entry personnel far know generally male candidates examined male doctors rare cases senior female doctors sohttpsnpredditcomrsunraybeecommentsvicicommentjrdkututmsourceshareutmmediumwebxcontext would lady staff posted room intimate examinations male candidates carried air force unless nurse doctor know soldier means letting go shame cases still dignity male candidates maintained since soldier military background say common occurrence rare case outlier think nonmedical male staffofficers present medical room intimate examinations female candidates otherwise would cause problems like pasthttpstimesofindiaindiatimescomindiaarmygetswomenrecruitsexaminedbymaledocsarticleshowcms guys think one defense background given defense medical tests",
    "cleaned_comments": "",
    "light_cleaned_title": "A question regarding medical testing regarding for entering the Indian military",
    "light_cleaned_selftext": "Medical tests are conducted for candidates entering the armed forces for both male and female candidates. Recently I saw a [comment](https://np.reddit.com/r/sunraybee/comments/14vi0ci/comment/jrfea13/?utm_source=share&utm_medium=web2x&context=3) on reddit under a [post](https://np.reddit.com/r/sunraybee/comments/14vi0ci/bhai_ye_sab_bhi_hota_hai_kya/?utm_source=share&utm_medium=web2x&context=3) claiming when the \"private parts\" of male Air Force candidates were examined by doctors there was female officer/staff present in the room as a data entry personnel. As far I know generally male candidates are examined by male doctors in some rare cases [senior female doctors do so](https://np.reddit.com/r/sunraybee/comments/14vi0ci/comment/jrdkut0/?utm_source=share&utm_medium=web2x&context=3). But why would a lady staff be posted in a room where the intimate examinations of male candidates are being carried out for the Air Force unless she herself is a nurse or doctor ? I know being a soldier means letting go of shame in some cases but still the dignity of the male candidates should be maintained. Since I am not a soldier or from a military background I can not say if this a common occurrence or a rare case / outlier. I do not think that non-medical male staff/officers are present in the medical room during the intimate examinations of female candidates otherwise it would cause problems like it had in the [past](https://timesofindia.indiatimes.com/india/Army-gets-women-recruits-examined-by-male-docs/articleshow/860461.cms). What do you guys think ? any one from defense background or had given defense medical tests",
    "light_cleaned_comments": ""
}