{
    "id": "14tehq9",
    "title": "\"BJP's Unproductive Politics\": AAP Backs Rahul Gandhi In Defamation Case",
    "url": "https://www.ndtv.com/india-news/bjps-unproductive-politics-aap-backs-rahul-gandhi-in-defamation-case-4187182/amp/1",
    "selftext": "Aap certainly seems to not take sides for or against any party, their support for UCC(well until Bhagwant Mann spoke against it) while most of the opposition is against it. Their row with the Congress over Ordinance, to supporting Rahul Gandhi here, providing help to Karnataka from Punjab(read that somewhere) and constant criticism of both parties. Are they attempting on becoming a third front and be neutral between the two opposing sides?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1688752854.0,
    "convurl": "https://external-preview.redd.it/b5fMeHuEFCdDRd6vTsTUdGUT4tEEs0EJavsIeds4DRA.jpg?auto=webp&s=97ccbacc3fec667249b3c0970d414aa732647067",
    "comments": [
        "I think it's just them appealing to bjp's base with ucc and sec 370 type matters. Considering the gloves off fight between them and the centre, there isn't much room for them to remain neutral. A third front is something they would love to become, but its never been done before."
    ],
    "cleaned_text": "bjps unproductive politics aap backs rahul gandhi defamation case aap certainly seems take sides party support uccwell bhagwant mann spoke opposition row congress ordinance supporting rahul gandhi providing help karnataka punjabread somewhere constant criticism parties attempting becoming third front neutral two opposing sides ",
    "cleaned_title": "bjps unproductive politics aap backs rahul gandhi defamation case",
    "cleaned_selftext": "aap certainly seems take sides party support uccwell bhagwant mann spoke opposition row congress ordinance supporting rahul gandhi providing help karnataka punjabread somewhere constant criticism parties attempting becoming third front neutral two opposing sides",
    "cleaned_comments": "think appealing bjps base ucc sec type matters considering gloves fight centre isnt much room remain neutral third front something would love become never done",
    "light_cleaned_title": "\"BJP's Unproductive Politics\": AAP Backs Rahul Gandhi In Defamation Case",
    "light_cleaned_selftext": "Aap certainly seems to not take sides for or against any party, their support for UCC(well until Bhagwant Mann spoke against it) while most of the opposition is against it. Their row with the Congress over Ordinance, to supporting Rahul Gandhi here, providing help to Karnataka from Punjab(read that somewhere) and constant criticism of both parties. Are they attempting on becoming a third front and be neutral between the two opposing sides?",
    "light_cleaned_comments": "I think it's just them appealing to bjp's base with ucc and sec 370 type matters. Considering the gloves off fight between them and the centre, there isn't much room for them to remain neutral. A third front is something they would love to become, but its never been done before."
}