{
    "id": "17ux3qc",
    "title": "sentence on the 110th day of completing the trial, which was also Children's Day.",
    "url": "https://indianexpress.com/article/india/aluva-rape-murder-case-kerala-court-death-9025956/",
    "selftext": "Aluva rape, murder case: Kerala court sentences convict to death",
    "flair": "Law & Courts",
    "score": 8,
    "num_comments": 2,
    "created_utc": 1699947057.0,
    "convurl": "https://external-preview.redd.it/QBsOT5DMOI8ForwcAI2vvDpoVhBXcZzj8vya_PZu8JA.jpg?auto=webp&s=d5cc2e4ee42718176a5e69a8789c227c748d8094",
    "comments": [
        "Kochi: The Ernakulam POCSO Court on Tuesday sentenced Ashfaq Alam (28), the lone accused in the abduction, rape and murder of a five-year-old girl in Aluva, to death and five life terms. The court, accepting the prosecution's argument the case was among the rarest of the rare, observed the accused did not deserve any leniency and that he was a threat to the entire society. Judge K Soman, who presided over the trial, pronounced the sentence on the 110th day of completing the trial, which was also Children's Day.\n\nAshfaq was sentenced to five years for destroying evidence, three years for drugging the minor, life imprisonment for raping the minor and the death penalty for the murder and rape of the five-year-old. The court also directed the accused to pay a fine of Rs 7,70,000.\n\nThe court upheld 13 charges levelled by the prosecution against the accused, including murder, kidnapping, torture, indignity to a human corpse, destroying evidence and three POCSO (Protection of Children from Sexual Offences) charges. The defense had argued that the death penalty be avoided citing the defendant's age and possibility of repentance.",
        "Two days before, the victims family visited her grave and celebrared Diwali with her. \n\nThe victim was from a migrant workers' family without any political connection. The ordinary of the ordinary. I hope the higher courts won't dilute the death sentence."
    ],
    "cleaned_text": "sentence th day completing trial also childrens day aluva rape murder case kerala court sentences convict death ",
    "cleaned_title": "sentence th day completing trial also childrens day",
    "cleaned_selftext": "aluva rape murder case kerala court sentences convict death",
    "cleaned_comments": "kochi ernakulam pocso court tuesday sentenced ashfaq alam lone accused abduction rape murder fiveyearold girl aluva death five life terms court accepting prosecutions argument case among rarest rare observed accused deserve leniency threat entire society judge k soman presided trial pronounced sentence th day completing trial also childrens day ashfaq sentenced five years destroying evidence three years drugging minor life imprisonment raping minor death penalty murder rape fiveyearold court also directed accused pay fine rs court upheld charges levelled prosecution accused including murder kidnapping torture indignity human corpse destroying evidence three pocso protection children sexual offences charges defense argued death penalty avoided citing defendants age possibility repentance two days victims family visited grave celebrared diwali victim migrant workers family without political connection ordinary ordinary hope higher courts wont dilute death sentence",
    "light_cleaned_title": "sentence on the 110th day of completing the trial, which was also Children's Day.",
    "light_cleaned_selftext": "Aluva rape, murder case: Kerala court sentences convict to death",
    "light_cleaned_comments": "Kochi: The Ernakulam POCSO Court on Tuesday sentenced Ashfaq Alam (28), the lone accused in the abduction, rape and murder of a five-year-old girl in Aluva, to death and five life terms. The court, accepting the prosecution's argument the case was among the rarest of the rare, observed the accused did not deserve any leniency and that he was a threat to the entire society. Judge K Soman, who presided over the trial, pronounced the sentence on the 110th day of completing the trial, which was also Children's Day. Ashfaq was sentenced to five years for destroying evidence, three years for drugging the minor, life imprisonment for raping the minor and the death penalty for the murder and rape of the five-year-old. The court also directed the accused to pay a fine of Rs 7,70,000. The court upheld 13 charges levelled by the prosecution against the accused, including murder, kidnapping, torture, indignity to a human corpse, destroying evidence and three POCSO (Protection of Children from Sexual Offences) charges. The defense had argued that the death penalty be avoided citing the defendant's age and possibility of repentance. Two days before, the victims family visited her grave and celebrared Diwali with her. The victim was from a migrant workers' family without any political connection. The ordinary of the ordinary. I hope the higher courts won't dilute the death sentence."
}