{
    "id": "13p4uze",
    "title": "I’m tired of poor law enforcement failing to protect rape victims.",
    "url": "https://www.reddit.com/r/india/comments/13p4uze/im_tired_of_poor_law_enforcement_failing_to/",
    "selftext": "So it’s no surprise that india is bad at law enforcement and women can’t step outside past 7 and don’t even mention male rapes. But I’m tired of this, I don’t want my freedom restricted. I should be able to go out whenever. But there is something we can do. It’s not much, but it is something better than nothing. If you can, please sign these petitions it only takes a few seconds: https://www.change.org/p/criminalize-marital-rape-in-india-b811e5af-83cd-44c4-bdeb-becec135f004?redirect=false.\n\nhttps://www.change.org/p/india-must-have-a-national-sex-offender-registry?redirect=false\n\nhttps://www.change.org/p/ministry-of-home-affairs-government-of-india-make-indian-rape-laws-gender-neutral-again. \n\nI know most of you are going to say this won’t work, but it atleast has a tiny chance of success. This is better than not doing anything at all.\n\nI hope you all understand",
    "flair": "Rant / Vent",
    "score": 46,
    "num_comments": 38,
    "created_utc": 1684792831.0,
    "convurl": "https://external-preview.redd.it/yAlkF9ecR0H-qKMc7GO8jaiLSeVrkk5NG-7YJaEoLKg.jpg?auto=webp&v=enabled&s=dbd5a6585d189f7928e1510031b6cf1d40891de1",
    "comments": [
        "Glad you took notice and want to do something. Unfortunately, change.org is not something our govt. officials or ministers care about. What you want to do is start a letter campaign - write letter on  a sheet of paper and mail it to them using ordinary postal mail. Maybe use postcards to avoid security delays. And then convince people you know to do the same.\n\nSo who do you write to? You can start with union home minister, whose responsibility it is to maintain law and order in the country.",
        "OP, looking at the amount of support this post got, you now know why things in India are the way it is. People here just don't give a shit about real basic issues of safety.",
        "You might as well blow your nose with that letter. Highly unlikely they’ll do anything about it",
        "The Indian population is 1.4bn so even if 1% come out to protest then there may be a change. They could all protest locally such as outside their MLA/MP's offices.",
        "So tell me how do you differentiate between consensual sex and rape in case of marriage? \nIf things go haywire between husband and wife she can easily file for rape and make your life hell, already Indian laws are in favour of women.",
        "Laws are in favour of women because society is not in favour of women. Every law can be misused and they often are misused but we need to care about the victims more than the misuse.",
        "The change needs to be brought into the mindset of people through education, merely making new laws are not going to serve any purpose. \nPunishing the convict and exonerating the innocent are equally important.",
        "I agree with that it is very hard to differentiate between consensual sex and rape and too when majority of society thinks that \n\nA women is innocent until proven guilty and men is guilty until proven innocent",
        "I mean it is pretty obvious how you differentiate. \n\nConsensual:\nHe : Honey wanna have sex tonight I am in the mood. \nShe : Yes let’s do it/Sure.\n(Proceeds to have Sex)\n\nRape:\nHe : Honey wanna have sex tonight I am in the mood. \nShe : Nah I am tired today. Let’s do it some other day. \n(Proceeds to have Sex)",
        "I agree",
        "Suppose you had consensual sex with her and tomorrow she says that you raped her, how do you prove to the court that you took her consent?",
        "Suppose you don’t have sex at all. And she says you raped. How do you fend that off?",
        "That’s what I am saying, currently you can’t be convicted for having sex with your wife. So she can’t put an allegation on you, by making this new law you are giving the woman unlimited power to trap husbands in rape cases as per their wish",
        "Right now or up until now Men had unlimited power to have sex whenever they want. Multiple women have to bear forced sex just cause men wanna have it. That is justified according to you. \n\nIf I apply this same logic to your argument why do men have all the power right now to have sex when they want however they want it?\nShould women not have some say if they wanna have it or not???\n\nThink about it.",
        "See there is a fine line between use and misuse, I personally feel the type of women who are being victims of forced sex by their husbands have no ideas of the law of land and power this constitution gives them. DV, dowry laws were brought to remove these stigmas of society, but they have not been useful. Recently Supreme Court said that nearly 80% of these cases are false and done with the intent to get revenge. \nWhat makes you feel that making such a law would not result in another misuse. \nInstead of making these laws the government should address these problems at grass root level, education and making people aware is the key.",
        "Right now Men are misusing their authority because they cannot be punished right. Why are you so hell bent on if women do the same???\n\nWhy is it okay for them to live in fear of being having raped over and over again without the rapist being even accused of the misdeeds???\n\nWhy the Men should hold the power is my question. \nAlso education is key I agree.\n\nAlso I can flip it over to you again by saying there is a thin line between misuse and proper use of laws.\n\nBut why should men hold the power and not women??? You have enjoyed fucking whenever you want in a marriage. Now let them feel powerful too. Not a bad thing IMO. \n\nAlso false cases will only arise with malice in relationships. And if there is malice there shouldn’t be a marriage. Any sensible women won’t just accuse the husband of rape for shits and giggles. While men fuck women whenever because they cannot retaliate.\n\n\nWhy do you not want to understand that it is not about giving power to the bad actors but uplifting the legitimate victims.",
        "Most of the world has marital rape laws. Marital rape can be proven in court if it is accompanied with physical abuse. But getting a divorce in India is such a hassle that both parties have to resort to dirty tactics so court grants divorce. Also most physical abuse cases aren't even registered because of police passing it off as internal matter. Re educating India's population (most of which is rural) is an absolutely necessary task but women (and men) need a way to get justice",
        "How hard is to understand consent? If someone is not 100% enthusiastically consenting, don’t rape them.",
        "Ok tell me then if they filled fake rape case against you how will you prove in court that it was with consent ?!",
        "Man it feels like she is just a 15 or 16 year old child with 0 factual knowledge don't take her seriously",
        "Don’t rape people or be rapey man. It’s not that hard to avoid fake rape allegations.",
        "Ok don't marriage or be marrigable women . It's not that hard to avoid marital rapes .\n\nAnd thanks for telling me that dumb people still exists on the plante",
        ">because society is not in favour of women.\n\nFake case exists , society - She is a women she can't tell falso he is a men it's all his fault \n\nWomen are innocent untill proven guilty and men are guilty until proven innocent",
        "fake cases exist but women get assaulted by their husbands in their marriages all. the. time. I watched a guy interview people on their thoughts on marital rape and majority thought a wife's duty is to please her husband so it doesn't exist. I think majority of Indians on reddit have a twisted worldview where they think women are treated more or less equal to men in all of India but they forget that over 65% of the population is rural and conditions of women in some of these areas is horrific. Also why do you think a court would take a fake rape case seriously when they let go and garland real rapists?",
        ">fake cases exist but women get assaulted by their husbands in their marriages all. the. time\n\nAll the time so you are talking about all marriages meant you haven't seen the happy marriages or are just ignorant or just want to show your I'll mentality \n\n\n>I watched a guy interview people on their thoughts on marital rape and majority thought a wife's duty is to please her husband so it doesn't exist.\n\nI too have seen a guy interview people on their thoughts on martial rape and majority people thought it as wrong and want laws against this what's your point anyway? I don't take any of these online interviews seriously \n\n>I think majority of Indians on reddit have a twisted worldview where they think women are treated more or less equal to men in all of India but they forget that over 65% of the population is rural and conditions of women in some of these areas is horrific\n\nLived in uttarakhand visited many villages not found a single one just happy couples or arrange marriage people if some places are horrific doesn't meant that every is \n\n>Also why do you think a court would take a fake rape case seriously when they let go and garland real rapists?\n\nAlso why do you think that if court doesn't take case seriously doesn't meant anything when a guy is accused of rape half of society goes against him , even if court releases him his life is already hell\n\nI don't see any point in arguing  so you have given your point I have given my point end of debate",
        "We are talking about marital rape and you are taking it to somewhere else you himself said if you have to avoid fake rape case then ask consent and I simply said if you have to avoid marital rape avoid marriage then \n\n\n>Let’s focus on the main issue here: consent. It’s simple - no one should engage in any sexual activity without the clear, unequivocal consent of the other person involved.\n\nYes now prove in court that  its with consent after destroying a man's life after getting fake rape case on him you are the typical mentality of women are innocent until proven guilty and men is guilty until proven innocent and women is always right",
        ">Rape and consensual sex aren’t two points on a spectrum where the lines can blur; they’re distinctly different. Rape is a crime involving a violation of a person’s autonomy, often involving violence or coercion. Consensual sex, on the other hand, is a mutual agreement between all parties involved.\nAgreed with that the lines can be bluur sometimes \n\nConsensual sex also can be violent sometimes and rape can also be without violence sometimes therefore I have said that sometimes it's hard to prove whether it is rape or consensual sex \n\n>As for the idea of women being “innocent until proven guilty” and men being “guilty until proven innocent,” our legal system is based on the principle that everyone is innocent until proven guilty, irrespective of gender. But societal bias can indeed skew perceptions, and we should actively work against such biases. That’s a societal issue that needs addressing, separate from the clear, simple concept of consent.\n\nThat's my point even if men has been given a clean chit of innocent still after fake case his life is hell \n\nSo let's end the debate here only",
        "Brij bhushan has been accused of assault and that guy is roaming around free with not a care in the world wtf do you mean half the world turns against the guy. Also marital rape law would be for both parties in the marriage, why are you framing it as if only women get abused",
        ">Brij bhushan has been accused of assault and that guy is roaming around free with not a care in the world wtf do you mean half the world turns against the guy\n\nLOL how do you know this WhatsApp , do you have any evidence for this - No , go to any country and try to accuse any of their political leader no one would take you seriously without any evidence whether you go in USA or Europe , There is enough evidence that the same people who are accusing him say thanks to him for his support earlier ,  they are saying they are harrashed for many years so they remember that on 2023 only when there are elections on his seat and there are elections on lok sabha next year , He himself has challenged them for a lie detector test openly , I have already told you that debate has ended but you won't have to debate",
        "Lie detector tests are a sham and they can be faked easily. Also Donald Trump was literally JUST convicted of sexual assault. Plus it's not about elections the wrestlers all support bjp but they don't like brij bhushan",
        ">Lie detector tests are a sham and they can be faked easily.\n\nThey can be fake I agree but easily not , plus he has challenged both sides for a lie detector test \n\n>Also Donald Trump was literally JUST convicted of sexual assault\n\nYes and he has been  been told to give 5 million as compensation to a women  So  FIR has also  been logged againe brij bhusan let police do the work then or either the wrestlers put all evidence against him on internet or they are just trying to hit arrow on dark \n\n>Plus it's not about elections the wrestlers all support bjp but they don't like brij bhushan \n\nI have already said some of the wrestlers were thanking him before this protest for helping them no one still knows the truth you are showing typical mentality of women is innocent until guilty and men is guilty until proven innocent",
        "And this mentality is exactly why our country does not progress - because everyone thinks like this. I can guarantee you if an entire city or even a colony wrote letters, someone will notice.\n\n If you don't want to write to union home minister, write to someone lower - maybe your local MP. Important thing is elected officials are aware they are being held accountable."
    ],
    "cleaned_text": "im tired poor law enforcement failing protect rape victims surprise india bad law enforcement women cant step outside past dont even mention male rapes im tired dont want freedom restricted able go whenever something much something better nothing please sign petitions takes seconds know going say wont work atleast tiny chance success better anything hope understand ",
    "cleaned_title": "im tired poor law enforcement failing protect rape victims",
    "cleaned_selftext": "surprise india bad law enforcement women cant step outside past dont even mention male rapes im tired dont want freedom restricted able go whenever something much something better nothing please sign petitions takes seconds know going say wont work atleast tiny chance success better anything hope understand",
    "cleaned_comments": "glad took notice want something unfortunately changeorg something govt officials ministers care want start letter campaign write letter sheet paper mail using ordinary postal mail maybe use postcards avoid security delays convince people know write start union home minister whose responsibility maintain law order country op looking amount support post got know things india way people dont give shit real basic issues safety might well blow nose letter highly unlikely theyll anything indian population bn even come protest may change could protest locally outside mlamps offices tell differentiate consensual sex rape case marriage things go haywire husband wife easily file rape make life hell already indian laws favour women laws favour women society favour women every law misused often misused need care victims misuse change needs brought mindset people education merely making new laws going serve purpose punishing convict exonerating innocent equally important agree hard differentiate consensual sex rape majority society thinks women innocent proven guilty men guilty proven innocent mean pretty obvious differentiate consensual honey wan na sex tonight mood yes lets itsure proceeds sex rape honey wan na sex tonight mood nah tired today lets day proceeds sex agree suppose consensual sex tomorrow says raped prove court took consent suppose dont sex says raped fend thats saying currently cant convicted sex wife cant put allegation making new law giving woman unlimited power trap husbands rape cases per wish right men unlimited power sex whenever want multiple women bear forced sex cause men wan na justified according apply logic argument men power right sex want however want women say wan na think see fine line use misuse personally feel type women victims forced sex husbands ideas law land power constitution gives dv dowry laws brought remove stigmas society useful recently supreme court said nearly cases false done intent get revenge makes feel making law would result another misuse instead making laws government address problems grass root level education making people aware key right men misusing authority punished right hell bent women okay live fear raped without rapist even accused misdeeds men hold power question also education key agree also flip saying thin line misuse proper use laws men hold power women enjoyed fucking whenever want marriage let feel powerful bad thing imo also false cases arise malice relationships malice shouldnt marriage sensible women wont accuse husband rape shits giggles men fuck women whenever retaliate want understand giving power bad actors uplifting legitimate victims world marital rape laws marital rape proven court accompanied physical abuse getting divorce india hassle parties resort dirty tactics court grants divorce also physical abuse cases arent even registered police passing internal matter educating indias population rural absolutely necessary task women men need way get justice hard understand consent someone enthusiastically consenting dont rape ok tell filled fake rape case prove court consent man feels like year old child factual knowledge dont take seriously dont rape people rapey man hard avoid fake rape allegations ok dont marriage marrigable women hard avoid marital rapes thanks telling dumb people still exists plante society favour women fake case exists society women cant tell falso men fault women innocent untill proven guilty men guilty proven innocent fake cases exist women get assaulted husbands marriages time watched guy interview people thoughts marital rape majority thought wifes duty please husband doesnt exist think majority indians reddit twisted worldview think women treated less equal men india forget population rural conditions women areas horrific also think court would take fake rape case seriously let go garland real rapists fake cases exist women get assaulted husbands marriages time time talking marriages meant havent seen happy marriages ignorant want show ill mentality watched guy interview people thoughts marital rape majority thought wifes duty please husband doesnt exist seen guy interview people thoughts martial rape majority people thought wrong want laws whats point anyway dont take online interviews seriously think majority indians reddit twisted worldview think women treated less equal men india forget population rural conditions women areas horrific lived uttarakhand visited many villages found single one happy couples arrange marriage people places horrific doesnt meant every also think court would take fake rape case seriously let go garland real rapists also think court doesnt take case seriously doesnt meant anything guy accused rape half society goes even court releases life already hell dont see point arguing given point given point end debate talking marital rape taking somewhere else said avoid fake rape case ask consent simply said avoid marital rape avoid marriage lets focus main issue consent simple one engage sexual activity without clear unequivocal consent person involved yes prove court consent destroying mans life getting fake rape case typical mentality women innocent proven guilty men guilty proven innocent women always right rape consensual sex arent two points spectrum lines blur theyre distinctly different rape crime involving violation persons autonomy often involving violence coercion consensual sex hand mutual agreement parties involved agreed lines bluur sometimes consensual sex also violent sometimes rape also without violence sometimes therefore said sometimes hard prove whether rape consensual sex idea women innocent proven guilty men guilty proven innocent legal system based principle everyone innocent proven guilty irrespective gender societal bias indeed skew perceptions actively work biases thats societal issue needs addressing separate clear simple concept consent thats point even men given clean chit innocent still fake case life hell lets end debate brij bhushan accused assault guy roaming around free care world wtf mean half world turns guy also marital rape law would parties marriage framing women get abused brij bhushan accused assault guy roaming around free care world wtf mean half world turns guy lol know whatsapp evidence go country try accuse political leader one would take seriously without evidence whether go usa europe enough evidence people accusing say thanks support earlier saying harrashed many years remember elections seat elections lok sabha next year challenged lie detector test openly already told debate ended wont debate lie detector tests sham faked easily also donald trump literally convicted sexual assault plus elections wrestlers support bjp dont like brij bhushan lie detector tests sham faked easily fake agree easily plus challenged sides lie detector test also donald trump literally convicted sexual assault yes told give million compensation women fir also logged againe brij bhusan let police work either wrestlers put evidence internet trying hit arrow dark plus elections wrestlers support bjp dont like brij bhushan already said wrestlers thanking protest helping one still knows truth showing typical mentality women innocent guilty men guilty proven innocent mentality exactly country progress everyone thinks like guarantee entire city even colony wrote letters someone notice dont want write union home minister write someone lower maybe local mp important thing elected officials aware held accountable",
    "light_cleaned_title": "I’m tired of poor law enforcement failing to protect rape victims.",
    "light_cleaned_selftext": "So it’s no surprise that india is bad at law enforcement and women can’t step outside past 7 and don’t even mention male rapes. But I’m tired of this, I don’t want my freedom restricted. I should be able to go out whenever. But there is something we can do. It’s not much, but it is something better than nothing. If you can, please sign these petitions it only takes a few seconds: I know most of you are going to say this won’t work, but it atleast has a tiny chance of success. This is better than not doing anything at all. I hope you all understand",
    "light_cleaned_comments": "Glad you took notice and want to do something. Unfortunately, change.org is not something our govt. officials or ministers care about. What you want to do is start a letter campaign - write letter on a sheet of paper and mail it to them using ordinary postal mail. Maybe use postcards to avoid security delays. And then convince people you know to do the same. So who do you write to? You can start with union home minister, whose responsibility it is to maintain law and order in the country. OP, looking at the amount of support this post got, you now know why things in India are the way it is. People here just don't give a shit about real basic issues of safety. You might as well blow your nose with that letter. Highly unlikely they’ll do anything about it The Indian population is 1.4bn so even if 1% come out to protest then there may be a change. They could all protest locally such as outside their MLA/MP's offices. So tell me how do you differentiate between consensual sex and rape in case of marriage? If things go haywire between husband and wife she can easily file for rape and make your life hell, already Indian laws are in favour of women. Laws are in favour of women because society is not in favour of women. Every law can be misused and they often are misused but we need to care about the victims more than the misuse. The change needs to be brought into the mindset of people through education, merely making new laws are not going to serve any purpose. Punishing the convict and exonerating the innocent are equally important. I agree with that it is very hard to differentiate between consensual sex and rape and too when majority of society thinks that A women is innocent until proven guilty and men is guilty until proven innocent I mean it is pretty obvious how you differentiate. Consensual: He : Honey wanna have sex tonight I am in the mood. She : Yes let’s do it/Sure. (Proceeds to have Sex) Rape: He : Honey wanna have sex tonight I am in the mood. She : Nah I am tired today. Let’s do it some other day. (Proceeds to have Sex) I agree Suppose you had consensual sex with her and tomorrow she says that you raped her, how do you prove to the court that you took her consent? Suppose you don’t have sex at all. And she says you raped. How do you fend that off? That’s what I am saying, currently you can’t be convicted for having sex with your wife. So she can’t put an allegation on you, by making this new law you are giving the woman unlimited power to trap husbands in rape cases as per their wish Right now or up until now Men had unlimited power to have sex whenever they want. Multiple women have to bear forced sex just cause men wanna have it. That is justified according to you. If I apply this same logic to your argument why do men have all the power right now to have sex when they want however they want it? Should women not have some say if they wanna have it or not??? Think about it. See there is a fine line between use and misuse, I personally feel the type of women who are being victims of forced sex by their husbands have no ideas of the law of land and power this constitution gives them. DV, dowry laws were brought to remove these stigmas of society, but they have not been useful. Recently Supreme Court said that nearly 80% of these cases are false and done with the intent to get revenge. What makes you feel that making such a law would not result in another misuse. Instead of making these laws the government should address these problems at grass root level, education and making people aware is the key. Right now Men are misusing their authority because they cannot be punished right. Why are you so hell bent on if women do the same??? Why is it okay for them to live in fear of being having raped over and over again without the rapist being even accused of the misdeeds??? Why the Men should hold the power is my question. Also education is key I agree. Also I can flip it over to you again by saying there is a thin line between misuse and proper use of laws. But why should men hold the power and not women??? You have enjoyed fucking whenever you want in a marriage. Now let them feel powerful too. Not a bad thing IMO. Also false cases will only arise with malice in relationships. And if there is malice there shouldn’t be a marriage. Any sensible women won’t just accuse the husband of rape for shits and giggles. While men fuck women whenever because they cannot retaliate. Why do you not want to understand that it is not about giving power to the bad actors but uplifting the legitimate victims. Most of the world has marital rape laws. Marital rape can be proven in court if it is accompanied with physical abuse. But getting a divorce in India is such a hassle that both parties have to resort to dirty tactics so court grants divorce. Also most physical abuse cases aren't even registered because of police passing it off as internal matter. Re educating India's population (most of which is rural) is an absolutely necessary task but women (and men) need a way to get justice How hard is to understand consent? If someone is not 100% enthusiastically consenting, don’t rape them. Ok tell me then if they filled fake rape case against you how will you prove in court that it was with consent ?! Man it feels like she is just a 15 or 16 year old child with 0 factual knowledge don't take her seriously Don’t rape people or be rapey man. It’s not that hard to avoid fake rape allegations. Ok don't marriage or be marrigable women . It's not that hard to avoid marital rapes . And thanks for telling me that dumb people still exists on the plante >because society is not in favour of women. Fake case exists , society - She is a women she can't tell falso he is a men it's all his fault Women are innocent untill proven guilty and men are guilty until proven innocent fake cases exist but women get assaulted by their husbands in their marriages all. the. time. I watched a guy interview people on their thoughts on marital rape and majority thought a wife's duty is to please her husband so it doesn't exist. I think majority of Indians on reddit have a twisted worldview where they think women are treated more or less equal to men in all of India but they forget that over 65% of the population is rural and conditions of women in some of these areas is horrific. Also why do you think a court would take a fake rape case seriously when they let go and garland real rapists? >fake cases exist but women get assaulted by their husbands in their marriages all. the. time All the time so you are talking about all marriages meant you haven't seen the happy marriages or are just ignorant or just want to show your I'll mentality >I watched a guy interview people on their thoughts on marital rape and majority thought a wife's duty is to please her husband so it doesn't exist. I too have seen a guy interview people on their thoughts on martial rape and majority people thought it as wrong and want laws against this what's your point anyway? I don't take any of these online interviews seriously >I think majority of Indians on reddit have a twisted worldview where they think women are treated more or less equal to men in all of India but they forget that over 65% of the population is rural and conditions of women in some of these areas is horrific Lived in uttarakhand visited many villages not found a single one just happy couples or arrange marriage people if some places are horrific doesn't meant that every is >Also why do you think a court would take a fake rape case seriously when they let go and garland real rapists? Also why do you think that if court doesn't take case seriously doesn't meant anything when a guy is accused of rape half of society goes against him , even if court releases him his life is already hell I don't see any point in arguing so you have given your point I have given my point end of debate We are talking about marital rape and you are taking it to somewhere else you himself said if you have to avoid fake rape case then ask consent and I simply said if you have to avoid marital rape avoid marriage then >Let’s focus on the main issue here: consent. It’s simple - no one should engage in any sexual activity without the clear, unequivocal consent of the other person involved. Yes now prove in court that its with consent after destroying a man's life after getting fake rape case on him you are the typical mentality of women are innocent until proven guilty and men is guilty until proven innocent and women is always right >Rape and consensual sex aren’t two points on a spectrum where the lines can blur; they’re distinctly different. Rape is a crime involving a violation of a person’s autonomy, often involving violence or coercion. Consensual sex, on the other hand, is a mutual agreement between all parties involved. Agreed with that the lines can be bluur sometimes Consensual sex also can be violent sometimes and rape can also be without violence sometimes therefore I have said that sometimes it's hard to prove whether it is rape or consensual sex >As for the idea of women being “innocent until proven guilty” and men being “guilty until proven innocent,” our legal system is based on the principle that everyone is innocent until proven guilty, irrespective of gender. But societal bias can indeed skew perceptions, and we should actively work against such biases. That’s a societal issue that needs addressing, separate from the clear, simple concept of consent. That's my point even if men has been given a clean chit of innocent still after fake case his life is hell So let's end the debate here only Brij bhushan has been accused of assault and that guy is roaming around free with not a care in the world wtf do you mean half the world turns against the guy. Also marital rape law would be for both parties in the marriage, why are you framing it as if only women get abused >Brij bhushan has been accused of assault and that guy is roaming around free with not a care in the world wtf do you mean half the world turns against the guy LOL how do you know this WhatsApp , do you have any evidence for this - No , go to any country and try to accuse any of their political leader no one would take you seriously without any evidence whether you go in USA or Europe , There is enough evidence that the same people who are accusing him say thanks to him for his support earlier , they are saying they are harrashed for many years so they remember that on 2023 only when there are elections on his seat and there are elections on lok sabha next year , He himself has challenged them for a lie detector test openly , I have already told you that debate has ended but you won't have to debate Lie detector tests are a sham and they can be faked easily. Also Donald Trump was literally JUST convicted of sexual assault. Plus it's not about elections the wrestlers all support bjp but they don't like brij bhushan >Lie detector tests are a sham and they can be faked easily. They can be fake I agree but easily not , plus he has challenged both sides for a lie detector test >Also Donald Trump was literally JUST convicted of sexual assault Yes and he has been been told to give 5 million as compensation to a women So FIR has also been logged againe brij bhusan let police do the work then or either the wrestlers put all evidence against him on internet or they are just trying to hit arrow on dark >Plus it's not about elections the wrestlers all support bjp but they don't like brij bhushan I have already said some of the wrestlers were thanking him before this protest for helping them no one still knows the truth you are showing typical mentality of women is innocent until guilty and men is guilty until proven innocent And this mentality is exactly why our country does not progress - because everyone thinks like this. I can guarantee you if an entire city or even a colony wrote letters, someone will notice. If you don't want to write to union home minister, write to someone lower - maybe your local MP. Important thing is elected officials are aware they are being held accountable."
}