{
    "id": "15wxhw5",
    "title": "NEET row: Tamil Nadu CM's son holds Govt responsible for NEET aspirant's death",
    "url": "https://www.livemint.com/news/india/neet-row-its-a-murder-dmk-youth-wing-holds-govt-responsible-for-neet-aspirants-death/amp-11692583906297.html",
    "selftext": "Idiots have been put in charge of Tamil Nadu. \n\nCM’s son appeals for state to get special right to be exempted from NEET exams. Because no, we don’t care about skill upliftment, or motivating students to do better in competitive exams but straight away make laws that they don’t have to appear for exams. What next? He will hand over ‘Dr’ initials to anyone and everyone who scored above 70 in Class 12 Biology?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1692593350.0,
    "convurl": "https://external-preview.redd.it/NPC2Jt5OJn1dJsNXUuVtX6L4OVY_HseGi7rYx5GQKqQ.jpg?auto=webp&s=268f21384c1826b10432d8fabc66cc5db4166467",
    "comments": [
        "Government kinda fucked TN over with NEET. TN used state funds to set up medical colleges. \nNEET has forced them to allow non locals. It is unfair. \n\nAnd it makes perfect sense for them to want to restrict the seats to locals - this is something that is done in all state universities btw. I too have benefitted from Delhi state university's limiting seats from non locals.",
        "Sometimes I really wonder how will abolishing this test will solve everything. The guy who died even if we consider his 12th mark as per old norm he won't get medical College. Damn politicians making mountain out of nothing and people are biting it",
        "There is 7.5 reservation for government school students and there is state quota.",
        "Sure. But  NEET exam is based on the CBSE syllabus. This disadvanatges state curicullum students. Not to mention the change of in-service quota.\n\nI'm from Delhi, but I dont support this at all.",
        "This is rubbish. The state entitlements are intact."
    ],
    "cleaned_text": "neet row tamil nadu cms son holds govt responsible neet aspirants death idiots put charge tamil nadu cms son appeals state get special right exempted neet exams dont care skill upliftment motivating students better competitive exams straight away make laws dont appear exams next hand dr initials anyone everyone scored class biology ",
    "cleaned_title": "neet row tamil nadu cms son holds govt responsible neet aspirants death",
    "cleaned_selftext": "idiots put charge tamil nadu cms son appeals state get special right exempted neet exams dont care skill upliftment motivating students better competitive exams straight away make laws dont appear exams next hand dr initials anyone everyone scored class biology",
    "cleaned_comments": "government kinda fucked tn neet tn used state funds set medical colleges neet forced allow non locals unfair makes perfect sense want restrict seats locals something done state universities btw benefitted delhi state universitys limiting seats non locals sometimes really wonder abolishing test solve everything guy died even consider th mark per old norm wont get medical college damn politicians making mountain nothing people biting reservation government school students state quota sure neet exam based cbse syllabus disadvanatges state curicullum students mention change inservice quota im delhi dont support rubbish state entitlements intact",
    "light_cleaned_title": "NEET row: Tamil Nadu CM's son holds Govt responsible for NEET aspirant's death",
    "light_cleaned_selftext": "Idiots have been put in charge of Tamil Nadu. CM’s son appeals for state to get special right to be exempted from NEET exams. Because no, we don’t care about skill upliftment, or motivating students to do better in competitive exams but straight away make laws that they don’t have to appear for exams. What next? He will hand over ‘Dr’ initials to anyone and everyone who scored above 70 in Class 12 Biology?",
    "light_cleaned_comments": "Government kinda fucked TN over with NEET. TN used state funds to set up medical colleges. NEET has forced them to allow non locals. It is unfair. And it makes perfect sense for them to want to restrict the seats to locals - this is something that is done in all state universities btw. I too have benefitted from Delhi state university's limiting seats from non locals. Sometimes I really wonder how will abolishing this test will solve everything. The guy who died even if we consider his 12th mark as per old norm he won't get medical College. Damn politicians making mountain out of nothing and people are biting it There is 7.5 reservation for government school students and there is state quota. Sure. But NEET exam is based on the CBSE syllabus. This disadvanatges state curicullum students. Not to mention the change of in-service quota. I'm from Delhi, but I dont support this at all. This is rubbish. The state entitlements are intact."
}