{
    "id": "mukvp6",
    "title": "Kangana Ranaut: Sun decides not to shine &amp; it does not owe you any explaination.",
    "url": "https://www.reddit.com/r/india/comments/mukvp6/kangana_ranaut_sun_decides_not_to_shine_it_does/",
    "selftext": "She's obviously referring to our Führer. He's decided to not shine for the last few days and he does not owe us an explaination.\n\nYeh bhi theek hai.\n\nhttps://preview.redd.it/5av2639c2au61.png?width=498&amp;format=png&amp;auto=webp&amp;s=d345cd7517178affa6e31f18f96cf69cf5e031dc",
    "flair": "Policy/Economy",
    "score": 138,
    "num_comments": 69,
    "created_utc": 1618902557,
    "convurl": "https://a.thumbs.redditmedia.com/TrDgPdskg2VcahQBBiLfJ5GM7xbwe7fxEOdu1ioKv20.jpg",
    "comments": [
        "Reminds me of this [scene](https://imgur.com/a/KEd43ky) from The Big Bang Theory.",
        "If the sun stopped shining then it would legit be important to ask why! In case Fusion has stopped or whatever.",
        "At least the sun is responsible and shows up every day like Hey Motherfuckers here's light to keep you all alive. Instead our sun wants to win the elections for Jupiter.",
        "Kangana is a dimension.",
        "Damn! I would like to smoke whatever she has been having!",
        "Crazy head. I wonder how she even has followers. To be frank I think \"Queen\" was mediocre.",
        "She is a psycho bitch.",
        "Somebody get the psycho bitch to STFU!",
        "tukka laga gaya bhai..",
        "I hope they introduce IQ tests for those using social media. This bitch might be the first one to be booted.",
        "In short, die in silence and don't ask for your human rights and dignity. In short, hindu khatre mein hai, lekin kuchh ukhaad nahi paayega.",
        "IQ tests? She should be booted for violating their exisiting policies against bullying / hate speech. \n\nBut the social media cunts won't act cuz of their fear of the finger-wagging, self-righteous R S Prasad.",
        "&gt;Anyone who is angry, depressed and rattled with current situation is an entitled brat,if tom Sun decides not to shine it does not owe you any explanation,this earth which nurtured and mothered you suddenly became hostile,she does not owe you an explanation.Calm down you fools....Earth does not move on it's axis for you\n\nAnyone who is angry depressed and rattled with current situation in bollywood is an entitled brat, if tom Bollywood decides not to cast you it does not owe you any explanation, the industry which has nurtured and given recognition suddenly became hostile, it does not owe you an explanation. Calm down you fools... Bollywood Industry does not work for you",
        "Zero dimension",
        "can write macrocosm but writes tomorrow as tom, what an idiot.",
        "Hey hey don't demean dogs bro. :( Just call her Kangana. 🤪",
        "We pay taxes which pays for narunder's salaries and luxurious lifestyle. I think her owes us answers.",
        "Very cool",
        "I really really don't get what she means",
        "I try to give her some benefit of doubt but she does not stop ever! Smh.",
        "We really want Kangana to vanish (socially) and I bet we wont even bat an eye.😄",
        "This is BS. He is an elected representative and answerable to every citizen of this country.  \n\nThis is something everyone must know. Govt is for you, you aren't for the govt. You control the govt, govt doesn't control the you.  \n\nIrrespective of who you voted for, irrespective of whether you pay tax or not. The PM is answerable to you (of course for the matters related to the country, but he is).  \n\nEvery govt official, every elected representative is answerable to you.",
        "If the sun does not shine. Life on earth will end. We depend on it.\n\nWhat's with explanation of non-living things.\n\nWhat's the use of thinking logically about this... \\[Give up\\]\n\nSo essentially, just go die? You first please.",
        "Is it just me or this seems like the ravings of someone at the cusp of a colossal breakdown?",
        "Macrocosm.. this is  proof that she didnt write this tweet",
        "Never stick your dick in psycho",
        "I didn't even watch queen...",
        "Your tax is paying for her security yo",
        "Einstein se jyada dimag hai isme /s",
        "Wow Hrithik really dodged a bullet right there",
        "\"Calm down fools and sit down idiots\" seems like a good advice during this covid rampage.",
        "Also, people with psychosis, they just have no idea. Don't put them in the same bracket as kangana ;(",
        "She wouldn't have posted this if one of her loved one was tested positive. \nDuniya hila jaati hai poori",
        "Some one please give her the mental health helpline number.",
        "This lady has lost her damn mind.",
        "You should .\n\nIt's quite nice.\n\n\nJust what we see at theatre is quite different from real life personalities.",
        "That's called devotion, pure loyalty - some ungrateful people should learn from her. /s",
        "Don't even try.",
        "In layman's terms, she said, Death is natural  phenomenon  and one is a fool if one angers or saddens over death of one's loved ones. Anger and sadness are not real emotions so one should not display them.\n\nIn Bully Maguire's terms: ohh look at COVID deaths.....Gonna Cry?",
        "Hey hey don't demean people named Kangana bro. :(\n\nShe is clearly RunOut.",
        "The best way to deal with Kangana is to completely ignore her, let her rant and rave her way into obscurity. She may be a darling to her sanghi brethren right now but she will go down in history as one the biggest flamboyant fool the country has ever seen.",
        "Kangana once again penetrating us with knowledge like x ray",
        "Then why oh why did you make so much noise when SSR committed suicide? Who cares if he lives or dies??",
        "Hey hey, don't demean cricket bro! \n\n\n\n\n\nShe's clearly **** *****",
        "Even when people are dying left-right, She is busy playing her dirty game.",
        "Left or right everyone wants kangana to shut up",
        "Stupid female, has no stuff upstairs. She just picks an opportunity and bash all anti BJP where possible. Earth, sun, water and air come together to support life, god has created all these four elements to support fifth  element( humans). She can remove her head from BJP a** she might think straight.",
        "I want to see her say this on the face of anyone who has lost a loved one to this pandemic.",
        "So we should not care about our lives because nobody else does! Excellent logic. It's like she has stopped using doggy position and her dog is asking her why and then she said that she does not owe an explanation to her dog.",
        "Fuck Kangana",
        "I missed the part where that's my problem.",
        "Is she on drugs? Like wtf",
        "The only entitled brat was the one I saw at Chandigarh airport being provided Z cover.\n\nOnly someone who hasnt seen first hand the desperation of the sick in hospitals or the economic hardships that people are going through can use such words.\n\nAre elected government is to serve the people, it is their sworn duty. They failed at it, rallying for elections, allowing Kumbh. Shame on them, shame on her!",
        "she has been listening to the star talk podcast",
        "Planets voted for the sun i guess",
        "Sounds like an alcoholics rant at closing time. Class act.",
        "It's [genetic](https://www.timesnownews.com/amp/entertainment-news/article/kangana-ranauts-mother-breaks-down-while-worrying-about-her-wedding-tumhari-shaadi-ke-liye-upvas-karti-hoon/644911).",
        "She’s from Himachal Pradesh, so she might have local sources.",
        "Am a bit amazed at the writing I bet she cannot write all this on her own... she doesnt have the mental capacity to do this! \n\nPta karo daya kaun hai vo bhadva jo isse yeh sab btata hai!",
        "For kangana: that's a cute outfit did your husband buy it for you ?",
        "Brainwashed bitch ... imagine what a time she will give her significant other",
        "It's not about IQ, she's a paid influencer selling a product",
        "Whatever the cause might be, we would be dead before we even realise it stopped shining.",
        "Never stick your dick in crazy",
        "Exactly! What is the point of a democracy if the leaders are not answerable to you? This literally in basic civics textbooks, a 12 year old might be able to tell you that. \nJust shows how beyond reason this lady has ventiedo.",
        "2ab dimension",
        "Nullzone"
    ],
    "cleaned_text": "kangana ranaut sun decides shine amp owe explaination shes obviously referring fhrer hes decided shine last days owe us explaination yeh bhi theek hai ",
    "cleaned_title": "kangana ranaut sun decides shine amp owe explaination",
    "cleaned_selftext": "shes obviously referring fhrer hes decided shine last days owe us explaination yeh bhi theek hai",
    "cleaned_comments": "reminds scenehttpsimgurcomakedky big bang theory sun stopped shining would legit important ask case fusion stopped whatever least sun responsible shows every day like hey motherfuckers heres light keep alive instead sun wants win elections jupiter kangana dimension damn would like smoke whatever crazy head wonder even followers frank think queen mediocre psycho bitch somebody get psycho bitch stfu tukka laga gaya bhai hope introduce iq tests using social media bitch might first one booted short die silence dont ask human rights dignity short hindu khatre mein hai lekin kuchh ukhaad nahi paayega iq tests booted violating exisiting policies bullying hate speech social media cunts wont act cuz fear fingerwagging selfrighteous r prasad gtanyone angry depressed rattled current situation entitled bratif tom sun decides shine owe explanationthis earth nurtured mothered suddenly became hostileshe owe explanationcalm foolsearth move axis anyone angry depressed rattled current situation bollywood entitled brat tom bollywood decides cast owe explanation industry nurtured given recognition suddenly became hostile owe explanation calm fools bollywood industry work zero dimension write macrocosm writes tomorrow tom idiot hey hey dont demean dogs bro call kangana pay taxes pays narunders salaries luxurious lifestyle think owes us answers cool really really dont get means try give benefit doubt stop ever smh really want kangana vanish socially bet wont even bat eye bs elected representative answerable every citizen country something everyone must know govt arent govt control govt govt doesnt control irrespective voted irrespective whether pay tax pm answerable course matters related country every govt official every elected representative answerable sun shine life earth end depend whats explanation nonliving things whats use thinking logically give essentially go die first please seems like ravings someone cusp colossal breakdown macrocosm proof didnt write tweet never stick dick psycho didnt even watch queen tax paying security yo einstein se jyada dimag hai isme wow hrithik really dodged bullet right calm fools sit idiots seems like good advice covid rampage also people psychosis idea dont put bracket kangana wouldnt posted one loved one tested positive duniya hila jaati hai poori one please give mental health helpline number lady lost damn mind quite nice see theatre quite different real life personalities thats called devotion pure loyalty ungrateful people learn dont even try laymans terms said death natural phenomenon one fool one angers saddens death ones loved ones anger sadness real emotions one display bully maguires terms ohh look covid deathsgonna cry hey hey dont demean people named kangana bro clearly runout best way deal kangana completely ignore let rant rave way obscurity may darling sanghi brethren right go history one biggest flamboyant fool country ever seen kangana penetrating us knowledge like x ray oh make much noise ssr committed suicide cares lives dies hey hey dont demean cricket bro shes clearly even people dying leftright busy playing dirty game left right everyone wants kangana shut stupid female stuff upstairs picks opportunity bash anti bjp possible earth sun water air come together support life god created four elements support fifth element humans remove head bjp might think straight want see say face anyone lost loved one pandemic care lives nobody else excellent logic like stopped using doggy position dog asking said owe explanation dog fuck kangana missed part thats problem drugs like wtf entitled brat one saw chandigarh airport provided z cover someone hasnt seen first hand desperation sick hospitals economic hardships people going use words elected government serve people sworn duty failed rallying elections allowing kumbh shame shame listening star talk podcast planets voted sun guess sounds like alcoholics rant closing time class act genetichttpswwwtimesnownewscomampentertainmentnewsarticlekanganaranautsmotherbreaksdownwhileworryingaboutherweddingtumharishaadikeliyeupvaskartihoon shes himachal pradesh might local sources bit amazed writing bet write doesnt mental capacity pta karo daya kaun hai vo bhadva jo isse yeh sab btata hai kangana thats cute outfit husband buy brainwashed bitch imagine time give significant iq shes paid influencer selling product whatever cause might would dead even realise stopped shining never stick dick crazy exactly point democracy leaders answerable literally basic civics textbooks year old might able tell shows beyond reason lady ventiedo ab dimension nullzone",
    "light_cleaned_title": "Kangana Ranaut: Sun decides not to shine &amp; it does not owe you any explaination.",
    "light_cleaned_selftext": "She's obviously referring to our Führer. He's decided to not shine for the last few days and he does not owe us an explaination. Yeh bhi theek hai.",
    "light_cleaned_comments": "Reminds me of this [scene](https://imgur.com/a/KEd43ky) from The Big Bang Theory. If the sun stopped shining then it would legit be important to ask why! In case Fusion has stopped or whatever. At least the sun is responsible and shows up every day like Hey Motherfuckers here's light to keep you all alive. Instead our sun wants to win the elections for Jupiter. Kangana is a dimension. Damn! I would like to smoke whatever she has been having! Crazy head. I wonder how she even has followers. To be frank I think \"Queen\" was mediocre. She is a psycho bitch. Somebody get the psycho bitch to STFU! tukka laga gaya bhai.. I hope they introduce IQ tests for those using social media. This bitch might be the first one to be booted. In short, die in silence and don't ask for your human rights and dignity. In short, hindu khatre mein hai, lekin kuchh ukhaad nahi paayega. IQ tests? She should be booted for violating their exisiting policies against bullying / hate speech. But the social media cunts won't act cuz of their fear of the finger-wagging, self-righteous R S Prasad. &gt;Anyone who is angry, depressed and rattled with current situation is an entitled brat,if tom Sun decides not to shine it does not owe you any explanation,this earth which nurtured and mothered you suddenly became hostile,she does not owe you an explanation.Calm down you fools....Earth does not move on it's axis for you Anyone who is angry depressed and rattled with current situation in bollywood is an entitled brat, if tom Bollywood decides not to cast you it does not owe you any explanation, the industry which has nurtured and given recognition suddenly became hostile, it does not owe you an explanation. Calm down you fools... Bollywood Industry does not work for you Zero dimension can write macrocosm but writes tomorrow as tom, what an idiot. Hey hey don't demean dogs bro. :( Just call her Kangana. 🤪 We pay taxes which pays for narunder's salaries and luxurious lifestyle. I think her owes us answers. Very cool I really really don't get what she means I try to give her some benefit of doubt but she does not stop ever! Smh. We really want Kangana to vanish (socially) and I bet we wont even bat an eye.😄 This is BS. He is an elected representative and answerable to every citizen of this country. This is something everyone must know. Govt is for you, you aren't for the govt. You control the govt, govt doesn't control the you. Irrespective of who you voted for, irrespective of whether you pay tax or not. The PM is answerable to you (of course for the matters related to the country, but he is). Every govt official, every elected representative is answerable to you. If the sun does not shine. Life on earth will end. We depend on it. What's with explanation of non-living things. What's the use of thinking logically about this... \\[Give up\\] So essentially, just go die? You first please. Is it just me or this seems like the ravings of someone at the cusp of a colossal breakdown? Macrocosm.. this is proof that she didnt write this tweet Never stick your dick in psycho I didn't even watch queen... Your tax is paying for her security yo Einstein se jyada dimag hai isme /s Wow Hrithik really dodged a bullet right there \"Calm down fools and sit down idiots\" seems like a good advice during this covid rampage. Also, people with psychosis, they just have no idea. Don't put them in the same bracket as kangana ;( She wouldn't have posted this if one of her loved one was tested positive. Duniya hila jaati hai poori Some one please give her the mental health helpline number. This lady has lost her damn mind. You should . It's quite nice. Just what we see at theatre is quite different from real life personalities. That's called devotion, pure loyalty - some ungrateful people should learn from her. /s Don't even try. In layman's terms, she said, Death is natural phenomenon and one is a fool if one angers or saddens over death of one's loved ones. Anger and sadness are not real emotions so one should not display them. In Bully Maguire's terms: ohh look at COVID deaths.....Gonna Cry? Hey hey don't demean people named Kangana bro. :( She is clearly RunOut. The best way to deal with Kangana is to completely ignore her, let her rant and rave her way into obscurity. She may be a darling to her sanghi brethren right now but she will go down in history as one the biggest flamboyant fool the country has ever seen. Kangana once again penetrating us with knowledge like x ray Then why oh why did you make so much noise when SSR committed suicide? Who cares if he lives or dies?? Hey hey, don't demean cricket bro! She's clearly **** ***** Even when people are dying left-right, She is busy playing her dirty game. Left or right everyone wants kangana to shut up Stupid female, has no stuff upstairs. She just picks an opportunity and bash all anti BJP where possible. Earth, sun, water and air come together to support life, god has created all these four elements to support fifth element( humans). She can remove her head from BJP a** she might think straight. I want to see her say this on the face of anyone who has lost a loved one to this pandemic. So we should not care about our lives because nobody else does! Excellent logic. It's like she has stopped using doggy position and her dog is asking her why and then she said that she does not owe an explanation to her dog. Fuck Kangana I missed the part where that's my problem. Is she on drugs? Like wtf The only entitled brat was the one I saw at Chandigarh airport being provided Z cover. Only someone who hasnt seen first hand the desperation of the sick in hospitals or the economic hardships that people are going through can use such words. Are elected government is to serve the people, it is their sworn duty. They failed at it, rallying for elections, allowing Kumbh. Shame on them, shame on her! she has been listening to the star talk podcast Planets voted for the sun i guess Sounds like an alcoholics rant at closing time. Class act. It's [genetic](https://www.timesnownews.com/amp/entertainment-news/article/kangana-ranauts-mother-breaks-down-while-worrying-about-her-wedding-tumhari-shaadi-ke-liye-upvas-karti-hoon/644911). She’s from Himachal Pradesh, so she might have local sources. Am a bit amazed at the writing I bet she cannot write all this on her own... she doesnt have the mental capacity to do this! Pta karo daya kaun hai vo bhadva jo isse yeh sab btata hai! For kangana: that's a cute outfit did your husband buy it for you ? Brainwashed bitch ... imagine what a time she will give her significant other It's not about IQ, she's a paid influencer selling a product Whatever the cause might be, we would be dead before we even realise it stopped shining. Never stick your dick in crazy Exactly! What is the point of a democracy if the leaders are not answerable to you? This literally in basic civics textbooks, a 12 year old might be able to tell you that. Just shows how beyond reason this lady has ventiedo. 2ab dimension Nullzone"
}