{
    "id": "o7dmc6",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/o7dmc6/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 18,
    "num_comments": 6,
    "created_utc": 1624584617,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Anybody got recipes for snacks to eat while drinking alcohol.",
        "Raw maggi",
        "unfortunately I don't like the taste of maggi when i'm drunk.",
        "Score the fish; \n\nMarinate the fish for about 30 mins in the fridge;\n**lime juice, bit of cooking oil, masala/ChilliP, salt, pepper &amp; herbs**\n\nSautee some freshly chopped ginger, garlic, green chilli and onions in a sauce pan just until the onions start to sweat;\n**not too much of these, just enough to coat the fish here and there**\n\nPlop the marinated fish in the pan and toss Em on each side of for couple of mins on a low to med flame;\n**cut into a fish and see if it’s done**\n\nSever hot and pour a cold one 🍻\n\nPS: can replace the fish with a variety of seafood",
        "I'mma go ahead and say a bacon, chilli, cheese filled sabudana vadas would be bomb.",
        "Thank you"
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "anybody got recipes snacks eat drinking alcohol raw maggi unfortunately dont like taste maggi im drunk score fish marinate fish mins fridge lime juice bit cooking oil masalachillip salt pepper amp herbs sautee freshly chopped ginger garlic green chilli onions sauce pan onions start sweat much enough coat fish plop marinated fish pan toss em side couple mins low med flame cut fish see done sever hot pour cold one ps replace fish variety seafood imma go ahead say bacon chilli cheese filled sabudana vadas would bomb thank",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "Anybody got recipes for snacks to eat while drinking alcohol. Raw maggi unfortunately I don't like the taste of maggi when i'm drunk. Score the fish; Marinate the fish for about 30 mins in the fridge; **lime juice, bit of cooking oil, masala/ChilliP, salt, pepper &amp; herbs** Sautee some freshly chopped ginger, garlic, green chilli and onions in a sauce pan just until the onions start to sweat; **not too much of these, just enough to coat the fish here and there** Plop the marinated fish in the pan and toss Em on each side of for couple of mins on a low to med flame; **cut into a fish and see if it’s done** Sever hot and pour a cold one 🍻 PS: can replace the fish with a variety of seafood I'mma go ahead and say a bacon, chilli, cheese filled sabudana vadas would be bomb. Thank you"
}