{
    "id": "13vsajz",
    "title": "Has anyone here ordered stuff from etsy?",
    "url": "https://www.reddit.com/r/india/comments/13vsajz/has_anyone_here_ordered_stuff_from_etsy/",
    "selftext": "I want to buy [this](https://www.etsy.com/in-en/listing/1436604813/f1-racing-jacket-nascar-racing-jacket?ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=racing+jacket&ref=sr_gallery-1-1&organic_search_click=1) from etsy. I chatted with the seller and they said that I have to check the customs policy in India. So, I am a bit confused and need some advice. If anyone has ordered anything from etsy, please help.",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 2,
    "created_utc": 1685458033.0,
    "convurl": "https://external-preview.redd.it/mdQCOZioZx-5OSfiIsGRzOlv3By33NnEE7gbM-cN3sU.jpg?auto=webp&v=enabled&s=6acd4aa018f6be26636bbb8b79ab88f500ae3918",
    "comments": [
        "Don't , if your shipping company is dhl, FedEx , ups or aramex, you will have to submit documents for customs kyc and you will have to pay nearly the whole price again in custom duties, GST and misc. Clearance fees(br*be). They will get your parcel out without much trouble but it's gonna charge. If you order through standard mail, premium mail, ems or usps , it's going to come through india post. You might get lucky sometimes and get the parcel easily without even paying anything, but if the customs hold your parcel, which they most likely will, then just forget about it. No helplines, no proper customer care, no standardised hub names during tracking. You might be able to go to india post office and go through hassle to get it cleared and pay customs duty. So it is upto you whether you wish to pay extra in duties and shipping or take a risk with india post. I recommend not importing items personally as it's nit worth the hassle, better to just buy the item if it has already been imported."
    ],
    "cleaned_text": "anyone ordered stuff etsy want buy thishttpswwwetsycominenlistingfracingjacketnascarracingjacketgaordermostrelevantgasearchtypeallgaviewtypegallerygasearchqueryracingjacketrefsrgalleryorganicsearchclick etsy chatted seller said check customs policy india bit confused need advice anyone ordered anything etsy please help ",
    "cleaned_title": "anyone ordered stuff etsy",
    "cleaned_selftext": "want buy thishttpswwwetsycominenlistingfracingjacketnascarracingjacketgaordermostrelevantgasearchtypeallgaviewtypegallerygasearchqueryracingjacketrefsrgalleryorganicsearchclick etsy chatted seller said check customs policy india bit confused need advice anyone ordered anything etsy please help",
    "cleaned_comments": "dont shipping company dhl fedex ups aramex submit documents customs kyc pay nearly whole price custom duties gst misc clearance feesbrbe get parcel without much trouble gon na charge order standard mail premium mail ems usps going come india post might get lucky sometimes get parcel easily without even paying anything customs hold parcel likely forget helplines proper customer care standardised hub names tracking might able go india post office go hassle get cleared pay customs duty upto whether wish pay extra duties shipping take risk india post recommend importing items personally nit worth hassle better buy item already imported",
    "light_cleaned_title": "Has anyone here ordered stuff from etsy?",
    "light_cleaned_selftext": "I want to buy [this](https://www.etsy.com/in-en/listing/1436604813/f1-racing-jacket-nascar-racing-jacket?ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=racing+jacket&ref=sr_gallery-1-1&organic_search_click=1) from etsy. I chatted with the seller and they said that I have to check the customs policy in India. So, I am a bit confused and need some advice. If anyone has ordered anything from etsy, please help.",
    "light_cleaned_comments": "Don't , if your shipping company is dhl, FedEx , ups or aramex, you will have to submit documents for customs kyc and you will have to pay nearly the whole price again in custom duties, GST and misc. Clearance fees(br*be). They will get your parcel out without much trouble but it's gonna charge. If you order through standard mail, premium mail, ems or usps , it's going to come through india post. You might get lucky sometimes and get the parcel easily without even paying anything, but if the customs hold your parcel, which they most likely will, then just forget about it. No helplines, no proper customer care, no standardised hub names during tracking. You might be able to go to india post office and go through hassle to get it cleared and pay customs duty. So it is upto you whether you wish to pay extra in duties and shipping or take a risk with india post. I recommend not importing items personally as it's nit worth the hassle, better to just buy the item if it has already been imported."
}