{
    "id": "140klqx",
    "title": "Odisha police warns against bid to create communal disharmony using train tragedy.",
    "url": "https://indianexpress.com/article/india/odisha-police-warns-against-bid-to-create-communal-disharmony-using-train-tragedy-8645324/lite/",
    "selftext": "Help me understand how does this become a communal issue?",
    "flair": "Politics",
    "score": 30,
    "num_comments": 6,
    "created_utc": 1685901109.0,
    "convurl": "https://external-preview.redd.it/vuBzv4WB0otJ-PP-7fRygBpzVl-kGqyxXC5joTWrwQg.jpg?auto=webp&v=enabled&s=5bcee6d8cf378a06af09b4453d3fea9fd28ee245",
    "comments": [
        "Because Mandirs are turning into masjid,if any mishap happening nearby.",
        "Well. Dont just warn, start arresting people?",
        "Odisha Police doesn't have any jurisdiction outside Odisha. Most of those giving it a communal colour don't actually reside in India. Chances are most of them hadn't even heard of Odisha before the incident",
        "Hmm.. Yes but Delhi Police arrest people from Bangalore. \n\nhttps://timesofindia.indiatimes.com/india/delhi-cops-pick-up-22-year-old-girl-from-bengaluru-for-sedition-in-greta-toolkit-case/articleshow/80915712.cms",
        "Delhi police come under the Central Government Home Ministry not under state administration.",
        "True"
    ],
    "cleaned_text": "odisha police warns bid create communal disharmony using train tragedy help understand become communal issue ",
    "cleaned_title": "odisha police warns bid create communal disharmony using train tragedy",
    "cleaned_selftext": "help understand become communal issue",
    "cleaned_comments": "mandirs turning masjidif mishap happening nearby well dont warn start arresting people odisha police doesnt jurisdiction outside odisha giving communal colour dont actually reside india chances hadnt even heard odisha incident hmm yes delhi police arrest people bangalore delhi police come central government home ministry state administration true",
    "light_cleaned_title": "Odisha police warns against bid to create communal disharmony using train tragedy.",
    "light_cleaned_selftext": "Help me understand how does this become a communal issue?",
    "light_cleaned_comments": "Because Mandirs are turning into masjid,if any mishap happening nearby. Well. Dont just warn, start arresting people? Odisha Police doesn't have any jurisdiction outside Odisha. Most of those giving it a communal colour don't actually reside in India. Chances are most of them hadn't even heard of Odisha before the incident Hmm.. Yes but Delhi Police arrest people from Bangalore. Delhi police come under the Central Government Home Ministry not under state administration. True"
}