{
    "id": "13tscbx",
    "title": "MK Stalin Travels In Bullet Train In Japan, Seeks \"Equivalent\" Service In India",
    "url": "https://www.ndtv.com/tamil-nadu-news/stalin-travels-in-bullet-train-in-japan-bats-for-equivalent-service-in-india-4072749",
    "selftext": "Thought this was an old post, but then this is happening right now",
    "flair": "Politics",
    "score": 65,
    "num_comments": 10,
    "created_utc": 1685251724.0,
    "convurl": "https://external-preview.redd.it/Jh-mBgbVvDW02StvZ5ONiVGpUQZzpbzPC8AlfD7MwuU.jpg?auto=webp&v=enabled&s=5eae0f6c48508dbcbee94dbbde62148eb946483b",
    "comments": [
        "Why can't they learn things like governance, honour, focussing on healthcare, and focus on cleanliness etc from politicians in Japan ?\n\nPeople forget intrinsic values and rather try to copy superficial things. If India has an environment for making bullet trains, a bullet train will come on its own.\n\nOn the other hand, if you try to build a bullet train without a proper environment, it will take 9 years... And still not even bought enough land. LOL",
        "Guy gotta use a different name when traveling abroad. Names of controversial historical figures will cause unnecessary scrutiny abroad.",
        "As a chief minister there is no problem, there is a diplomatic protocol that is followed",
        "I wish people also learnt some time-critical things like how Singapore uses tech to make the city greener and cooler because the climate change problem is at our doorstep. Eg: https://youtu.be/PM101DvvG4Q. We are rapidly urbanizing and unfortunately we are at a scenario where we need to think hard about maintaining a balance between creating concrete jungles vs decongesting urban centers.",
        "Well said, concentrate on basic needs ffs.",
        "Improve existing trains guys",
        "You will see the equivalent one if politicians stop corruption n give freebies for votes n focus on governance n infrastructure \n\n Japanese  must be like rolling on the floor n laughing looking at his Jimmy Neutron hair style which seem to be painted with the blackest hair color he could find"
    ],
    "cleaned_text": "mk stalin travels bullet train japan seeks equivalent service india thought old post happening right ",
    "cleaned_title": "mk stalin travels bullet train japan seeks equivalent service india",
    "cleaned_selftext": "thought old post happening right",
    "cleaned_comments": "cant learn things like governance honour focussing healthcare focus cleanliness etc politicians japan people forget intrinsic values rather try copy superficial things india environment making bullet trains bullet train come hand try build bullet train without proper environment take years still even bought enough land lol guy got ta use different name traveling abroad names controversial historical figures cause unnecessary scrutiny abroad chief minister problem diplomatic protocol followed wish people also learnt timecritical things like singapore uses tech make city greener cooler climate change problem doorstep eg rapidly urbanizing unfortunately scenario need think hard maintaining balance creating concrete jungles vs decongesting urban centers well said concentrate basic needs ffs improve existing trains guys see equivalent one politicians stop corruption n give freebies votes n focus governance n infrastructure japanese must like rolling floor n laughing looking jimmy neutron hair style seem painted blackest hair color could find",
    "light_cleaned_title": "MK Stalin Travels In Bullet Train In Japan, Seeks \"Equivalent\" Service In India",
    "light_cleaned_selftext": "Thought this was an old post, but then this is happening right now",
    "light_cleaned_comments": "Why can't they learn things like governance, honour, focussing on healthcare, and focus on cleanliness etc from politicians in Japan ? People forget intrinsic values and rather try to copy superficial things. If India has an environment for making bullet trains, a bullet train will come on its own. On the other hand, if you try to build a bullet train without a proper environment, it will take 9 years... And still not even bought enough land. LOL Guy gotta use a different name when traveling abroad. Names of controversial historical figures will cause unnecessary scrutiny abroad. As a chief minister there is no problem, there is a diplomatic protocol that is followed I wish people also learnt some time-critical things like how Singapore uses tech to make the city greener and cooler because the climate change problem is at our doorstep. Eg: We are rapidly urbanizing and unfortunately we are at a scenario where we need to think hard about maintaining a balance between creating concrete jungles vs decongesting urban centers. Well said, concentrate on basic needs ffs. Improve existing trains guys You will see the equivalent one if politicians stop corruption n give freebies for votes n focus on governance n infrastructure Japanese must be like rolling on the floor n laughing looking at his Jimmy Neutron hair style which seem to be painted with the blackest hair color he could find"
}