{
    "id": "1ckxlx0",
    "title": "Jee News stopped sucking mody cawk, will Snil Ainghvi & Beepanshu Dandhari also stop?",
    "url": "https://i.redd.it/1c8k75djgnyc1.jpeg",
    "selftext": "i see they aren't free to air, or they're showing jee action in their place. \n\n\n\nsupporting information https://twitter.com/absenior91/status/1787178878445695423",
    "flair": "Rant / Vent",
    "score": 11,
    "num_comments": 5,
    "created_utc": 1714933088.0,
    "convurl": "https://i.redd.it/1c8k75djgnyc1.jpeg",
    "comments": [
        "**When the ship is sinking the rats jump first.**",
        "yay",
        "Bahut network connected nodes se eksath request aane lagi toh server pe load padta hai. Isi wajah se kabhee kabhee phonepe / Paytm / Google pay payment stuck ho jaata hai. Bas itni si baat hai, jyada kuch nahi. Thode din mein normal ho jayega.",
        "\"सबसे पहले हमने बताया\"\n\n\"मूडी गिरने वाले हैं\" \n\n\"येस सर\" \n\n\"बस, पैसा बनना चाहिए आप का\"",
        "what are you on bruh"
    ],
    "cleaned_text": "jee news stopped sucking mody cawk snil ainghvi beepanshu dandhari also stop see arent free air theyre showing jee action place supporting information ",
    "cleaned_title": "jee news stopped sucking mody cawk snil ainghvi beepanshu dandhari also stop",
    "cleaned_selftext": "see arent free air theyre showing jee action place supporting information",
    "cleaned_comments": "ship sinking rats jump first yay bahut network connected nodes se eksath request aane lagi toh server pe load padta hai isi wajah se kabhee kabhee phonepe paytm google pay payment stuck ho jaata hai bas itni si baat hai jyada kuch nahi thode din mein normal ho jayega bruh",
    "light_cleaned_title": "Jee News stopped sucking mody cawk, will Snil Ainghvi & Beepanshu Dandhari also stop?",
    "light_cleaned_selftext": "i see they aren't free to air, or they're showing jee action in their place. supporting information",
    "light_cleaned_comments": "**When the ship is sinking the rats jump first.** yay Bahut network connected nodes se eksath request aane lagi toh server pe load padta hai. Isi wajah se kabhee kabhee phonepe / Paytm / Google pay payment stuck ho jaata hai. Bas itni si baat hai, jyada kuch nahi. Thode din mein normal ho jayega. \"सबसे पहले हमने बताया\" \"मूडी गिरने वाले हैं\" \"येस सर\" \"बस, पैसा बनना चाहिए आप का\" what are you on bruh"
}