{
    "id": "i2rvnj",
    "title": "Explainer: Law enforcement access to personal electronic devices",
    "url": "https://www.reddit.com/r/india/comments/i2rvnj/explainer_law_enforcement_access_to_personal/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/dpe53qeibqe51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=bcb362a8ca7df041490dadef7942722705cc3c64\n\n### Introduction\n\nThis explainer is to help the reader navigate a situation where the police seize and intend to/or demand access to your personal electronic device (PED) such as a mobile phone, laptop, tablet, etc.\n\nOur personal electronic devices are akin to a physical extension of ourselves- we are virtually one with them. Given our increased interaction and the near assimilation of our mind with such devices – laws governing access to PEDs by the police/law enforcement agencies (LEAs) demand scrutiny.\n\n### Legal Blueprint\n\nThe Criminal Procedure Code, 1973 (Cr.P.C.) provides the manner in which the police and judicial authorities employ powers of search and seizure during a criminal investigation.\n\n**Step 1- Seizure**\n\nThe law broadly empowers -\n\n* The police and judicial authorities to compel a person to produce a PED if it is deemed essential to an investigation;\n* The judicial authorities can issue a search warrant (either general or specific) if-  \ni.         a person is not complying with the directions under (a);  \nii.        the person in possession of the PED is unknown; and  \niii.       to further an investigation.\n* Currently, the Cr.P.C provides for issuance of a warrant to search a place. However, these are limited to physical spaces like a house, building, tent vessel, etc. There is no provision with respect to accessing a PED as a whole or any specific information/applications on it.\n* A police officer can conduct a physical search of a person to seize a PED without a warrant, but afterwards must record his reasons in writing.\n* A police officer can seize property (PED) either under the suspicion of being stolen or found in circumstances which creates suspicion regarding committing of an offence.\n\nThus, within the broad structure of its investigating powers, it seems the police have the power to seize PEDs.\n\n**Step 2 – Search**\n\nHowever, as opposed to most physical objects- the seizure of a PED is ineffective unless it can be searched or accessed. The seizure is only the first step- the owner must unlock a device and/or grant police access to the information stored on it. Hence, the statutory framework provides power to the police to seize PEDs, but lacks force in terms of compelling a person to unlock/ allow access to their PEDs.\n\nIn practice, a person *may* refuse to grant the police access to their PEDs and approach a judicial authority to seek an appropriate legal remedy. However, depending upon the scenario, the judicial authority could–\n\n* Agree with a person’s refusal to grant the police access to their PEDs;\n* Disagree with a person’s refusal to grant the police access to their PEDs and grant limited and/or complete access to their PEDs;\n* Limit the police’s access of a person’s PED to a particular application and/or information on the device. Eg. The police can view WhatsApp communications with person(s) potentially relevant to an investigation, but not family members and friends.\n\n### Extent of police powers\n\nIn practice, the police while examining a person during an investigation will ask for access (read passwords) to their PEDs. By law, a person is required to answer questions truthfully during an investigation. A failure to do so, may itself maybe a criminal offence. \n\nHowever, providing information in order to aid an investigation must be prudently balanced with respect to the constitutionally guaranteed right against self-incrimination. A person may refuse to provide information which is potentially self-incriminating, provide password(s) to PEDs which may point to ownership and/or control or knowledge of its contents. In such a scenario, a person may consider refusing to provide such information and subsequently seek an appropriate legal remedy to protect their right against self-incrimination.\n\nA notice maybe given to a person by the police requiring their physical appearance. This is another tool used to seek access to PEDs in the garb of cooperation for the purposes of an investigation.\n\nAs stated earlier, people and PEDs have an inalienable bond and these devices contain a range of personal information. Consequently, compelling a person to provide access is a breach of the Right to Privacy under Article 21 of the Constitution. Unless, the police can satisfy the following conditions-\n\n* the direction to compel the disclosure must have a clear legal basis;\n* the infringement must be necessary i.e. there should be no less restrictive alternatives available;\n* the infringement must be proportionate i.e. it should not cause disproportionate harm to the rights holder; and\n* the infringement should have a legitimate aim.\n\nConsequently, if the police are unable to satisfy these four criteria- access to the PED is illegal.\n\n### Issues to consider\n\nGiving access to a PED is akin to allowing the police to search your house. However, providing the house keys doesn’t necessarily imply they have access to your personal documents, the family jewels in your parent’s safe or have the right to peep over your garden fence and into your neighbour’s home.\n\nFollowing are certain limitations to the police powers of search and seizure.\n\nA PED may require one password to access, but several other passwords could be necessary to unlock applications/software within it. Thus, raising certain vital questions-\n\n* What is the definition of access to a PED under Cr.P.C?\n* What is the scope of the access – is it specific, limited and/or complete?\n* What is the nature of the access- is it limited to information sought as per a warrant, is it only a person’s personal information, general information or anonymised information?\n* Does access to a person’s PED mean the police can also gather a third person’s personal information (without their consent) from the device or from an application on it?\n* Are there limits to which a person can consent to granting the police access to a PED or does consent qualify as absolute?\n\n### The Social Network conundrum\n\nSearching or accessing a device is different from a physical space. In theory, if access is granted to a PED- it will be unlimited, unless categorically restricted. This gives rise to a precarious situation where searching a PED provides disproportionate access to a person’s social networking accounts (Whatsapp, Twitter, Facebook, Instagram, etc.) and other information which may or may not be relevant for the police investigation.\n\nThe key issue here is - accessing a social networking application on a PED is a single point within a larger network. Hence, the police are now accessing personal information of several persons who have not consented to part with it or may not have any co-relation to an investigation.\n\nArguably, the purpose of accessing a PED is to extract as much information to aid an investigation. However, even as a justifiable corollary -the power to search by its very nature is limited to the person whose PED is being accessed.\n\n### Reality check!\n\nAny person is likely to buckle under pressure from the police and simply give up their passwords to their PEDs, social media accounts, etc. Now that you have read this explainer, hopefully you are better informed to handle the situation.\n\nLawyers are still not allowed to be physically present during questioning by the police. However, a lawyer can accompany a person and observe the questioning, but cannot assist him in answering any questions.\n\nA person cannot record the event when they are being questioned by the police. The only version of the interaction officially reported is the one by the police officer. Thus, there is usually a slim chance to negate the evidence obtained by means which are strictly not in accordance with law.\n\n### Conclusion\n\nAn investigation can lead to many delicate situations where- either a person feels their rights are violated or the police allege non-cooperation. Balancing the rights of persons vis-à-vis allowing the police to conduct investigations in various scenarios cannot be solved by applying uniform solutions. Hence, the rights and duties of both sides must strike a balance for a harmonious outcome within the confines of the law.\n\n*(This explainer has been authored by Advocate Amrit Grewal who generously volunteered some of his time for this.)*",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 5,
    "created_utc": 1596435122,
    "convurl": "https://b.thumbs.redditmedia.com/KiJE4JxBrhbwZKgqnzoiwGaltLEfaW2jz10v8RftGFY.jpg",
    "comments": [
        "What happens if I simply say \"forgot my password\"?",
        "it doesn't work that way . they might force you to reset . so saying NO is better",
        "How about a voice-activated \"switch\" which would wipe your device?\n\nYou just blurt out a command like \"SELF DESTRUCT INITIATE\" and it would go ahead and do its thing.",
        "Couldn't they charge you for destruction of evidence?",
        "Is it possible to give read only rights to your PED in order to protect against police planting evidence."
    ],
    "cleaned_text": "explainer law enforcement access personal electronic devices ampxb introduction explainer help reader navigate situation police seize intend toor demand access personal electronic device ped mobile phone laptop tablet etc personal electronic devices akin physical extension virtually one given increased interaction near assimilation mind devices laws governing access peds policelaw enforcement agencies leas demand scrutiny legal blueprint criminal procedure code crpc provides manner police judicial authorities employ powers search seizure criminal investigation step seizure law broadly empowers police judicial authorities compel person produce ped deemed essential investigation judicial authorities issue search warrant either general specific person complying directions ii person possession ped unknown iii investigation currently crpc provides issuance warrant search place however limited physical spaces like house building tent vessel etc provision respect accessing ped whole specific informationapplications police officer conduct physical search person seize ped without warrant afterwards must record reasons writing police officer seize property ped either suspicion stolen found circumstances creates suspicion regarding committing offence thus within broad structure investigating powers seems police power seize peds step search however opposed physical objects seizure ped ineffective unless searched accessed seizure first step owner must unlock device andor grant police access information stored hence statutory framework provides power police seize peds lacks force terms compelling person unlock allow access peds practice person may refuse grant police access peds approach judicial authority seek appropriate legal remedy however depending upon scenario judicial authority could agree persons refusal grant police access peds disagree persons refusal grant police access peds grant limited andor complete access peds limit polices access persons ped particular application andor information device eg police view whatsapp communications persons potentially relevant investigation family members friends extent police powers practice police examining person investigation ask access read passwords peds law person required answer questions truthfully investigation failure may maybe criminal offence however providing information order aid investigation must prudently balanced respect constitutionally guaranteed right selfincrimination person may refuse provide information potentially selfincriminating provide passwords peds may point ownership andor control knowledge contents scenario person may consider refusing provide information subsequently seek appropriate legal remedy protect right selfincrimination notice maybe given person police requiring physical appearance another tool used seek access peds garb cooperation purposes investigation stated earlier people peds inalienable bond devices contain range personal information consequently compelling person provide access breach right privacy article constitution unless police satisfy following conditions direction compel disclosure must clear legal basis infringement must necessary ie less restrictive alternatives available infringement must proportionate ie cause disproportionate harm rights holder infringement legitimate aim consequently police unable satisfy four criteria access ped illegal issues consider giving access ped akin allowing police search house however providing house keys doesnt necessarily imply access personal documents family jewels parents safe right peep garden fence neighbours home following certain limitations police powers search seizure ped may require one password access several passwords could necessary unlock applicationssoftware within thus raising certain vital questions definition access ped crpc scope access specific limited andor complete nature access limited information sought per warrant persons personal information general information anonymised information access persons ped mean police also gather third persons personal information without consent device application limits person consent granting police access ped consent qualify absolute social network conundrum searching accessing device different physical space theory access granted ped unlimited unless categorically restricted gives rise precarious situation searching ped provides disproportionate access persons social networking accounts whatsapp twitter facebook instagram etc information may may relevant police investigation key issue accessing social networking application ped single point within larger network hence police accessing personal information several persons consented part may corelation investigation arguably purpose accessing ped extract much information aid investigation however even justifiable corollary power search nature limited person whose ped accessed reality check person likely buckle pressure police simply give passwords peds social media accounts etc read explainer hopefully better informed handle situation lawyers still allowed physically present questioning police however lawyer accompany person observe questioning assist answering questions person record event questioned police version interaction officially reported one police officer thus usually slim chance negate evidence obtained means strictly accordance law conclusion investigation lead many delicate situations either person feels rights violated police allege noncooperation balancing rights persons visvis allowing police conduct investigations various scenarios solved applying uniform solutions hence rights duties sides must strike balance harmonious outcome within confines law explainer authored advocate amrit grewal generously volunteered time ",
    "cleaned_title": "explainer law enforcement access personal electronic devices",
    "cleaned_selftext": "ampxb introduction explainer help reader navigate situation police seize intend toor demand access personal electronic device ped mobile phone laptop tablet etc personal electronic devices akin physical extension virtually one given increased interaction near assimilation mind devices laws governing access peds policelaw enforcement agencies leas demand scrutiny legal blueprint criminal procedure code crpc provides manner police judicial authorities employ powers search seizure criminal investigation step seizure law broadly empowers police judicial authorities compel person produce ped deemed essential investigation judicial authorities issue search warrant either general specific person complying directions ii person possession ped unknown iii investigation currently crpc provides issuance warrant search place however limited physical spaces like house building tent vessel etc provision respect accessing ped whole specific informationapplications police officer conduct physical search person seize ped without warrant afterwards must record reasons writing police officer seize property ped either suspicion stolen found circumstances creates suspicion regarding committing offence thus within broad structure investigating powers seems police power seize peds step search however opposed physical objects seizure ped ineffective unless searched accessed seizure first step owner must unlock device andor grant police access information stored hence statutory framework provides power police seize peds lacks force terms compelling person unlock allow access peds practice person may refuse grant police access peds approach judicial authority seek appropriate legal remedy however depending upon scenario judicial authority could agree persons refusal grant police access peds disagree persons refusal grant police access peds grant limited andor complete access peds limit polices access persons ped particular application andor information device eg police view whatsapp communications persons potentially relevant investigation family members friends extent police powers practice police examining person investigation ask access read passwords peds law person required answer questions truthfully investigation failure may maybe criminal offence however providing information order aid investigation must prudently balanced respect constitutionally guaranteed right selfincrimination person may refuse provide information potentially selfincriminating provide passwords peds may point ownership andor control knowledge contents scenario person may consider refusing provide information subsequently seek appropriate legal remedy protect right selfincrimination notice maybe given person police requiring physical appearance another tool used seek access peds garb cooperation purposes investigation stated earlier people peds inalienable bond devices contain range personal information consequently compelling person provide access breach right privacy article constitution unless police satisfy following conditions direction compel disclosure must clear legal basis infringement must necessary ie less restrictive alternatives available infringement must proportionate ie cause disproportionate harm rights holder infringement legitimate aim consequently police unable satisfy four criteria access ped illegal issues consider giving access ped akin allowing police search house however providing house keys doesnt necessarily imply access personal documents family jewels parents safe right peep garden fence neighbours home following certain limitations police powers search seizure ped may require one password access several passwords could necessary unlock applicationssoftware within thus raising certain vital questions definition access ped crpc scope access specific limited andor complete nature access limited information sought per warrant persons personal information general information anonymised information access persons ped mean police also gather third persons personal information without consent device application limits person consent granting police access ped consent qualify absolute social network conundrum searching accessing device different physical space theory access granted ped unlimited unless categorically restricted gives rise precarious situation searching ped provides disproportionate access persons social networking accounts whatsapp twitter facebook instagram etc information may may relevant police investigation key issue accessing social networking application ped single point within larger network hence police accessing personal information several persons consented part may corelation investigation arguably purpose accessing ped extract much information aid investigation however even justifiable corollary power search nature limited person whose ped accessed reality check person likely buckle pressure police simply give passwords peds social media accounts etc read explainer hopefully better informed handle situation lawyers still allowed physically present questioning police however lawyer accompany person observe questioning assist answering questions person record event questioned police version interaction officially reported one police officer thus usually slim chance negate evidence obtained means strictly accordance law conclusion investigation lead many delicate situations either person feels rights violated police allege noncooperation balancing rights persons visvis allowing police conduct investigations various scenarios solved applying uniform solutions hence rights duties sides must strike balance harmonious outcome within confines law explainer authored advocate amrit grewal generously volunteered time",
    "cleaned_comments": "happens simply say forgot password doesnt work way might force reset saying better voiceactivated switch would wipe device blurt command like self destruct initiate would go ahead thing couldnt charge destruction evidence possible give read rights ped order protect police planting evidence",
    "light_cleaned_title": "Explainer: Law enforcement access to personal electronic devices",
    "light_cleaned_selftext": "### Introduction This explainer is to help the reader navigate a situation where the police seize and intend to/or demand access to your personal electronic device (PED) such as a mobile phone, laptop, tablet, etc. Our personal electronic devices are akin to a physical extension of ourselves- we are virtually one with them. Given our increased interaction and the near assimilation of our mind with such devices – laws governing access to PEDs by the police/law enforcement agencies (LEAs) demand scrutiny. ### Legal Blueprint The Criminal Procedure Code, 1973 (Cr.P.C.) provides the manner in which the police and judicial authorities employ powers of search and seizure during a criminal investigation. **Step 1- Seizure** The law broadly empowers - * The police and judicial authorities to compel a person to produce a PED if it is deemed essential to an investigation; * The judicial authorities can issue a search warrant (either general or specific) if- i. a person is not complying with the directions under (a); ii. the person in possession of the PED is unknown; and iii. to further an investigation. * Currently, the Cr.P.C provides for issuance of a warrant to search a place. However, these are limited to physical spaces like a house, building, tent vessel, etc. There is no provision with respect to accessing a PED as a whole or any specific information/applications on it. * A police officer can conduct a physical search of a person to seize a PED without a warrant, but afterwards must record his reasons in writing. * A police officer can seize property (PED) either under the suspicion of being stolen or found in circumstances which creates suspicion regarding committing of an offence. Thus, within the broad structure of its investigating powers, it seems the police have the power to seize PEDs. **Step 2 – Search** However, as opposed to most physical objects- the seizure of a PED is ineffective unless it can be searched or accessed. The seizure is only the first step- the owner must unlock a device and/or grant police access to the information stored on it. Hence, the statutory framework provides power to the police to seize PEDs, but lacks force in terms of compelling a person to unlock/ allow access to their PEDs. In practice, a person *may* refuse to grant the police access to their PEDs and approach a judicial authority to seek an appropriate legal remedy. However, depending upon the scenario, the judicial authority could– * Agree with a person’s refusal to grant the police access to their PEDs; * Disagree with a person’s refusal to grant the police access to their PEDs and grant limited and/or complete access to their PEDs; * Limit the police’s access of a person’s PED to a particular application and/or information on the device. Eg. The police can view WhatsApp communications with person(s) potentially relevant to an investigation, but not family members and friends. ### Extent of police powers In practice, the police while examining a person during an investigation will ask for access (read passwords) to their PEDs. By law, a person is required to answer questions truthfully during an investigation. A failure to do so, may itself maybe a criminal offence. However, providing information in order to aid an investigation must be prudently balanced with respect to the constitutionally guaranteed right against self-incrimination. A person may refuse to provide information which is potentially self-incriminating, provide password(s) to PEDs which may point to ownership and/or control or knowledge of its contents. In such a scenario, a person may consider refusing to provide such information and subsequently seek an appropriate legal remedy to protect their right against self-incrimination. A notice maybe given to a person by the police requiring their physical appearance. This is another tool used to seek access to PEDs in the garb of cooperation for the purposes of an investigation. As stated earlier, people and PEDs have an inalienable bond and these devices contain a range of personal information. Consequently, compelling a person to provide access is a breach of the Right to Privacy under Article 21 of the Constitution. Unless, the police can satisfy the following conditions- * the direction to compel the disclosure must have a clear legal basis; * the infringement must be necessary i.e. there should be no less restrictive alternatives available; * the infringement must be proportionate i.e. it should not cause disproportionate harm to the rights holder; and * the infringement should have a legitimate aim. Consequently, if the police are unable to satisfy these four criteria- access to the PED is illegal. ### Issues to consider Giving access to a PED is akin to allowing the police to search your house. However, providing the house keys doesn’t necessarily imply they have access to your personal documents, the family jewels in your parent’s safe or have the right to peep over your garden fence and into your neighbour’s home. Following are certain limitations to the police powers of search and seizure. A PED may require one password to access, but several other passwords could be necessary to unlock applications/software within it. Thus, raising certain vital questions- * What is the definition of access to a PED under Cr.P.C? * What is the scope of the access – is it specific, limited and/or complete? * What is the nature of the access- is it limited to information sought as per a warrant, is it only a person’s personal information, general information or anonymised information? * Does access to a person’s PED mean the police can also gather a third person’s personal information (without their consent) from the device or from an application on it? * Are there limits to which a person can consent to granting the police access to a PED or does consent qualify as absolute? ### The Social Network conundrum Searching or accessing a device is different from a physical space. In theory, if access is granted to a PED- it will be unlimited, unless categorically restricted. This gives rise to a precarious situation where searching a PED provides disproportionate access to a person’s social networking accounts (Whatsapp, Twitter, Facebook, Instagram, etc.) and other information which may or may not be relevant for the police investigation. The key issue here is - accessing a social networking application on a PED is a single point within a larger network. Hence, the police are now accessing personal information of several persons who have not consented to part with it or may not have any co-relation to an investigation. Arguably, the purpose of accessing a PED is to extract as much information to aid an investigation. However, even as a justifiable corollary -the power to search by its very nature is limited to the person whose PED is being accessed. ### Reality check! Any person is likely to buckle under pressure from the police and simply give up their passwords to their PEDs, social media accounts, etc. Now that you have read this explainer, hopefully you are better informed to handle the situation. Lawyers are still not allowed to be physically present during questioning by the police. However, a lawyer can accompany a person and observe the questioning, but cannot assist him in answering any questions. A person cannot record the event when they are being questioned by the police. The only version of the interaction officially reported is the one by the police officer. Thus, there is usually a slim chance to negate the evidence obtained by means which are strictly not in accordance with law. ### Conclusion An investigation can lead to many delicate situations where- either a person feels their rights are violated or the police allege non-cooperation. Balancing the rights of persons vis-à-vis allowing the police to conduct investigations in various scenarios cannot be solved by applying uniform solutions. Hence, the rights and duties of both sides must strike a balance for a harmonious outcome within the confines of the law. *(This explainer has been authored by Advocate Amrit Grewal who generously volunteered some of his time for this.)*",
    "light_cleaned_comments": "What happens if I simply say \"forgot my password\"? it doesn't work that way . they might force you to reset . so saying NO is better How about a voice-activated \"switch\" which would wipe your device? You just blurt out a command like \"SELF DESTRUCT INITIATE\" and it would go ahead and do its thing. Couldn't they charge you for destruction of evidence? Is it possible to give read only rights to your PED in order to protect against police planting evidence."
}