{
    "id": "16nqs8x",
    "title": "Gorakhpur Deaths: Adityanath Government Ignored SOS on Oxygen Payments for Months",
    "url": "https://thewire.in/health/gorakhpur-deaths-adityanath-government-ignored-sos-on-oxygen-payments-for-months",
    "selftext": "Just a reminder now that Jawan movie is running in theatres.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1695229984.0,
    "convurl": "https://external-preview.redd.it/f1VASUsGJpvPHdy-0GJzz3PuS7kO_HDJpScaBEk16_Q.jpg?auto=webp&s=c922f8930201c1902d0049684860d5c864c463b6",
    "comments": [
        "Oxygen is a western concept and I’m not paying for it ~ Yogi may be",
        "Also stop breathing it, it is a western concept.",
        "*itni hava hai, le to le bawde* - Lala ramdev",
        "The only thing good about Yogi is that should Vin Diesel die,  he can replace him in Fast 11. Other than that, this guy is the epitome of evil.",
        "We should replace Bhogi Adityanath with Vin Diesel\n\nhttps://preview.redd.it/d03gcd1yqkpb1.png?width=288&format=pjpg&auto=webp&s=082c9ac1f8d9ac15d2490c332bf35b62a8ed1688"
    ],
    "cleaned_text": "gorakhpur deaths adityanath government ignored sos oxygen payments months reminder jawan movie running theatres ",
    "cleaned_title": "gorakhpur deaths adityanath government ignored sos oxygen payments months",
    "cleaned_selftext": "reminder jawan movie running theatres",
    "cleaned_comments": "oxygen western concept im paying yogi may also stop breathing western concept itni hava hai le le bawde lala ramdev thing good yogi vin diesel die replace fast guy epitome evil replace bhogi adityanath vin diesel",
    "light_cleaned_title": "Gorakhpur Deaths: Adityanath Government Ignored SOS on Oxygen Payments for Months",
    "light_cleaned_selftext": "Just a reminder now that Jawan movie is running in theatres.",
    "light_cleaned_comments": "Oxygen is a western concept and I’m not paying for it ~ Yogi may be Also stop breathing it, it is a western concept. *itni hava hai, le to le bawde* - Lala ramdev The only thing good about Yogi is that should Vin Diesel die, he can replace him in Fast 11. Other than that, this guy is the epitome of evil. We should replace Bhogi Adityanath with Vin Diesel"
}