{
    "id": "1fbtetv",
    "title": "Manu Joseph: Why Indian cities may be doomed to remain unliveable",
    "url": "https://www.livemint.com/opinion/columns/manu-joseph-why-indian-cities-may-be-doomed-to-remain-unliveable-nitin-gadkari-urban-development-11725781457626.html",
    "selftext": "\"As an Indian, my standards are so low that my idea of exciting urban development is a Nitin Gadkari tweet. I enjoy reading the plans of the minister for road transport and highways—his great projects, how he would punish Indians who don’t follow the law (this part especially), how he hopes to replace vehicular horns with the sound of Indian musical instruments, and how very soon road travel from Chennai to Bangalore would take only two hours. \n\nI did try to point out to him on X that right now Bangalore to Bangalore is two hours. I do not seriously believe he can change my quality of life, but he is the only politician I know who at least gets the fantasy right. And I so enjoy reading his tweets that sometimes I look furtively behind my shoulders to see if I am alone.\"\n\nThe starting paragraphs really hooked me :D\n",
    "flair": "Policy/Economy",
    "score": 397,
    "num_comments": 42,
    "created_utc": 1725785737.0,
    "convurl": "https://external-preview.redd.it/962BUL16Ej3MuUEl4EUmh8m4828629gedcIVZ-RBB0E.jpg?auto=webp&s=102cd44989605606e6d4244798f954c268b0cd5f",
    "comments": [
        "Bulldozer on standby",
        "\"I do not believe that he can seriously change the quality of my life\"......true for every single politician in our joke of a government ",
        "This is gold, but sadly behind paywall",
        "Manu Joseph writes rellay well.",
        "Oh, didn't know that. My reader usually parses the full text for me. I'll share the full text.",
        "Unpaywall - As an Indian, my standards are so low that my idea of exciting urban development is a Nitin Gadkari tweet. I enjoy reading the plans of the minister for road transport and highways—his great projects, how he would punish Indians who don’t follow the law (this part especially), how he hopes to replace vehicular horns with the sound of Indian musical instruments, and how very soon road travel from Chennai to Bangalore would take only two hours. \n\nI did try to point out to him on X that right now Bangalore to Bangalore is two hours. I do not seriously believe he can change my quality of life, but he is the only politician I know who at least gets the fantasy right. And I so enjoy reading his tweets that sometimes I look furtively behind my shoulders to see if I am alone. \n\n\nAlso read: Mumbai most expensive city for expats in India; see full list here \n\nUsually, Indian politicians don’t give any hope when they speak of our urban future. They speak of nonsensical things like “smart cities\" and “twin cities.\" The fact is India’s politicians and people have worked together to make Indian cities among the most unliveable and ugly places on earth. \n\nIndia is obsessed with the image of its airports. Otherwise, across a vast landscape, India is an urban catastrophe. I believe this will not change. There is no hope. I can think of only two phenomena that convey an accurate representation of modern India. \n\nOne is the Olympics and the other is any Indian town. The games expose how poorly run India is and how unkind we must be to each other to fare so poorly even against small nations. Our cities convey the same. \n\nPoliticians are blamed a bit too much for what is essentially national character. The political stamina that Indians have for useless issues, if a fraction of that emotion were dedicated to our decrepit civic infrastructure, the lack of parks and beauty, our lives would be instantly richer. But that is not going to happen. \n\n\nAlso read: Global Cities Index 2024: Delhi better than Mumbai in economy, quality of life; UP’s Sultanpur takes last spot on list \n\nOne of the reasons our lives will not improve is that India is unable to change its attitude towards how to treat Indians. India treats all its people as though they are poor. In the administrative subconscious, there is a feeling that this is enough for Indians, they don’t deserve more, they don’t want more. \n\nJust imagine, wherever you are, what are the meetings scheduled in your municipal body today? You think they are going to discuss how to make roads endure, lane discipline, proper medians, working signals and how to make the city aesthetic so that it can serve the well-being of residents? \n\nTraffic is not the greatest enemy of urban life. Many great cities in the world have that problem. Take Bangkok, for example. It has terrible traffic. Even though its efficient metro system makes life somewhat bearable, the fact is that it has very bad traffic, and like in India, its upper middle class prefers car travel despite the jams. \n\nBut Thais have such high civic sense and public dignity that Bangkok cannot match the misery of any Indian metro. India has never seriously tried to change the public behaviour of Indians. \n\nIndia’s most influential people do not seem to believe in the idea of a city. Somehow, they do not appear to crave order or aesthetics or the comfort of ordinary people. \n\nAlso, maybe they intuitively feel that the chaos and ugliness of public life also make the poor feel that the country has not left them behind. At any given point of time, visually, India never alienates its poor. Except at fancy airport terminals. \n\nIndia’s urban mess may also come from what is widely viewed as a political virtue—the fact that modern India was not governed long enough by its cultural elite. There was a lot of democracy very soon. \n\n\nAlso read: ’Bangalore will not be liveable in next 5 yrs, Delhi isn’t now’, says IIT Madras alum, viral post sparks debate \n\nThe elite can be despicable, but they always know how to live well. Every great city in the world has been a beneficiary of the vision of a social elite and the ease with which they could enforce codes of social behaviour. \n\nThe fundamentals of modern India too were created by its elite, but they did not prevail long enough to nurture its cities. Some of India’s early leaders did not think cities were important. \n\nGandhi, for instance, wanted to bet big on villages. He was a famous evangelist of hygiene, but he seemed indifferent to urban planning. He wanted Indian children to learn handicraft even before their formal primary education (an idea that lurked in the first five-year plan). \n\nThe failure of the modern Indian elite is more interesting. For centuries, migration was always something that the unfortunate had to do. People fled nature and persecution. But many developing nations endured a new kind of migration where the luckiest people migrated to expand their luck. \n\nFor several generations now, the cream of India has migrated abroad or been in migration mode. It is not as though they hold the secret to improving urban life, but what the elite’s migration did was lower their stake in home, and in reforming home. \n\nAll successful nations were transformed by their elite. When a society’s luckiest people do not have high stakes in home, we get modern India. \n\nIn this phenomenon also lies our only hope. The Indian upper class never fully enjoyed migration. Now India has prospered enough to hold some attraction for the new economic elite, especially those who do not fully feel they belong in the West. \n\nIt costs little to act like feudal lords in India and many find living here better than having to endure Western order and culture. So, they may have a growing stake in making Indian cities liveable. They may want safer roads, and, who knows, even parks, clean air and lane discipline.",
        "I feel it will change as people start demanding more,  we don't have basics like electricity and water in all corners of the city. People who live in posh societies have carved out a nice living space for themselves but people who live 100m away in slums still don't have water connections. As the writer points out, Indian cities are hospitable to their poor because the poor and underprivileged people run the cities. From cleaning, manual labour to keeping prices in check by accepting less wages.\n\nWe need to make sure all these underprivileged people get water they will ask for electricity, then good roads, walking space. Without taking them together we can't build cities. Elites of India always had little stake in its development, they were always well off which riches enough to go abroad anytime. Indian working class pines for a better future where they can live peacefully and work for it.\n\nWhen it comes to politicians lacking vision it's not really true. Most of these people go out for vacations to European cities, Thakares spend summer in London, I don't think they lack the understanding of global cities. The problem is selling global cities will not get them as many votes as some of the other investments. Mumbai  has more people than many countries and  making such high density cities livable is expensive. Political ROI is dependent on most people getting something & making beautiful roads will make some people happy but won't solve issues like hunger.\n\nI do agree with the author on the lack of civil sense though. Most of the people think their country has failed them and they don't owe it the same respect. Our govt healthcare is a joke, infrastructure is still developing, taxes are stingy and people are exposed to how better other countries are. There is no easy solution to it, like playing the national anthem before movies. If you want people to respect laws, you need to uphold their dignity.",
        "> when the cream of your crop don't give a shit about you, it turns out things don't go so well\n\nHuh. Who'd a thunk!",
        "A massive population needs extreme discipline to have an organized modern society - look at Japan, they are just as densely populated with frequent natural disasters\n\nThey organize and are disciplined enough to have a modern society\n\nHere we are too busy with jhumla instead of actual change",
        "Is this the same Manu Joseph who wrote Illicit Happiness, Serious Men, and Miss Laila?",
        "Kartik Muralidharan said in his book as long as we the elites of our country sidestep government and try private solutions for public issues, they’ll never improve. Water, security, garbage, hospital - everything has a private solution now. Why care about public infrastructure or utilities.",
        "A large part is because we don’t have functional City governments, for a large part, because what affects our day to day life in large part is to be taken care of by the city government m which they do not\n\nThe same state governments that seek greater federalism and devolution of powers from the centre, refuse to follow even the basics of the same request when it comes to devolution of governance responsibilities and powers to the urban local bodies who can do so much more, so we are doomed there, because the guy who can change the life of city dwellers the most is the local Mayor and the Corporator, who in Bangalores case do not exist, be the same congress which went to the high court asking for the City local election to be conducted, has completely changed their stand, once they themselves came to power\n\nSo our cities will continue to languish at the apathy of the state governments, who draw their major revenues and funds fir the large cities, but are put in place by the largely rural populace of the state at large, and hence aren’t as answerable to the city residents as they should ideally be……",
        "What else could you expect when our forefathers bred like rats and popped out 1 billion babies in 70 years with no plan and no money? China at least acknowledged the problem, but here we continue to create an Australia every year.",
        "India is doing much better in connecting cities vs intra city. The new highways are pretty great eg pune to nasik is a recent example",
        "Yes.",
        "State governments ignoring the 74 Amendment to the constitution with impunity with no party willing to stop everything else and make sure the 74th amendment is implemented is a scandal no one knows about.",
        "The article is about (un)livable cities.",
        "Bangalore really takes the cake with the concept of a \"Bangalore Development Minister\" who doesn't need to be elected by the people of Bangalore and isn't answerable to them. If that doesn't enough, the city's infra and planning is managed by a complex web of institutions, none of which are answerable to each other or to the people. Even the one institution that is nominally answerable, BBMP, has had its elections repeatedly delayed on one excuse or the other",
        "The crux of the problem is that the Indian urban elite, who are majorly the BJP's core vote base, don't want great infra for everyone. They want it only for themselves. \n\nThis is why you have situations where NRIs are jerking themselves off over Vande Bharat in Boston and Bristol while the poor migrant laborers of Bihar travel in rickety, overcrowded trains.",
        "Could you share which reader you use so we don't have to bother you with requests asking for the unpaywalled edition everytime? :)",
        "Don't forget that this  idiot gadkari wanted to paint optical illusion of speed breakers on the road and endanger lives in the name of modern methods to regulate speed. ",
        "Excellent points. But I guess the frail hope at the ending is only to end the essay well, not a real hope. I don't have any hope.",
        "Sure! I use [NewsFlash](https://gitlab.com/news-flash/news_flash_gtk) on desktop and [ReadYou](https://github.com/Ashinch/ReadYou) on Android. [PolitePol](https://politepol.com) helps me create feeds where unavailable.",
        "Wouldn't Banglore city roads fall under the responsibility of the local municipality and not under the center's?",
        "What a fantastic read.",
        "I'm new to RSS. How do you add this article to ReadYou app?",
        "Well written. We lack basic respect towards authority, towards public infrastructure, towards one another, and anyone who doesn't belong to our socio-economic 'group' ( family, city, state, caste, gender, etc)",
        "We add feeds to the app, and then it'll automatically fetch new articles for you. Here's the link to Mint's feeds - https://www.livemint.com/rss",
        "> our only hope. The Indian upper class\n\nwill be swamped over by the poor, useless mass",
        ">respect towards authority\n\nhuh? If anything, most Indians bend over backward when it comes to authority-figures. We have a problem with awful leaders and role-models.",
        "If anything large section of Indians love authoritarians and being told what to do by leaders, gurus and such.  Our problem is corruption of authorities aren't challenged enough so they hold unchecked power to do as they will (which just leads to bunch of criminals protecting other criminals). How will there be proper urban planning, education when most MLAs and MPs are criminals who joined politics to sweep their cases under the rug and to commit more crimes and corruption under the protection of govt. India is no different from cartel states in South America.",
        "Nah, our politico-criminal networks are better entrenched, more sophisticated and properly equipped for rent-seeking, extortion and racketeering than the narco-states of Latin America.",
        "I meant the rules, regulations and law makers. \n\nPoint taken, most of our role models ( politicians, fake gurus, actors, etc ) are awful.",
        "Manu Joseph's articles alone make Mint + WSJ subscription worth it",
        "oh, is it so? I've always thought about subscribing to one or two premium publications, but never knew which one to trust the most with regards to quality and aligns with my interests.\n\nBeing a writer myself, having someone like Manu Joseph as a regular source of inspiration could help a lot."
    ],
    "cleaned_text": "manu joseph indian cities may doomed remain unliveable indian standards low idea exciting urban development nitin gadkari tweet enjoy reading plans minister road transport highwayshis great projects would punish indians dont follow law part especially hopes replace vehicular horns sound indian musical instruments soon road travel chennai bangalore would take two hours try point x right bangalore bangalore two hours seriously believe change quality life politician know least gets fantasy right enjoy reading tweets sometimes look furtively behind shoulders see alone starting paragraphs really hooked ",
    "cleaned_title": "manu joseph indian cities may doomed remain unliveable",
    "cleaned_selftext": "indian standards low idea exciting urban development nitin gadkari tweet enjoy reading plans minister road transport highwayshis great projects would punish indians dont follow law part especially hopes replace vehicular horns sound indian musical instruments soon road travel chennai bangalore would take two hours try point x right bangalore bangalore two hours seriously believe change quality life politician know least gets fantasy right enjoy reading tweets sometimes look furtively behind shoulders see alone starting paragraphs really hooked",
    "cleaned_comments": "bulldozer standby believe seriously change quality lifetrue every single politician joke government gold sadly behind paywall manu joseph writes rellay well oh didnt know reader usually parses full text ill share full text unpaywall indian standards low idea exciting urban development nitin gadkari tweet enjoy reading plans minister road transport highwayshis great projects would punish indians dont follow law part especially hopes replace vehicular horns sound indian musical instruments soon road travel chennai bangalore would take two hours try point x right bangalore bangalore two hours seriously believe change quality life politician know least gets fantasy right enjoy reading tweets sometimes look furtively behind shoulders see alone also read mumbai expensive city expats india see full list usually indian politicians dont give hope speak urban future speak nonsensical things like smart cities twin cities fact indias politicians people worked together make indian cities among unliveable ugly places earth india obsessed image airports otherwise across vast landscape india urban catastrophe believe change hope think two phenomena convey accurate representation modern india one olympics indian town games expose poorly run india unkind must fare poorly even small nations cities convey politicians blamed bit much essentially national character political stamina indians useless issues fraction emotion dedicated decrepit civic infrastructure lack parks beauty lives would instantly richer going happen also read global cities index delhi better mumbai economy quality life ups sultanpur takes last spot list one reasons lives improve india unable change attitude towards treat indians india treats people though poor administrative subconscious feeling enough indians dont deserve dont want imagine wherever meetings scheduled municipal body today think going discuss make roads endure lane discipline proper medians working signals make city aesthetic serve wellbeing residents traffic greatest enemy urban life many great cities world problem take bangkok example terrible traffic even though efficient metro system makes life somewhat bearable fact bad traffic like india upper middle class prefers car travel despite jams thais high civic sense public dignity bangkok match misery indian metro india never seriously tried change public behaviour indians indias influential people seem believe idea city somehow appear crave order aesthetics comfort ordinary people also maybe intuitively feel chaos ugliness public life also make poor feel country left behind given point time visually india never alienates poor except fancy airport terminals indias urban mess may also come widely viewed political virtuethe fact modern india governed long enough cultural elite lot democracy soon also read bangalore liveable next yrs delhi isnt says iit madras alum viral post sparks debate elite despicable always know live well every great city world beneficiary vision social elite ease could enforce codes social behaviour fundamentals modern india created elite prevail long enough nurture cities indias early leaders think cities important gandhi instance wanted bet big villages famous evangelist hygiene seemed indifferent urban planning wanted indian children learn handicraft even formal primary education idea lurked first fiveyear plan failure modern indian elite interesting centuries migration always something unfortunate people fled nature persecution many developing nations endured new kind migration luckiest people migrated expand luck several generations cream india migrated abroad migration mode though hold secret improving urban life elites migration lower stake home reforming home successful nations transformed elite societys luckiest people high stakes home get modern india phenomenon also lies hope indian upper class never fully enjoyed migration india prospered enough hold attraction new economic elite especially fully feel belong west costs little act like feudal lords india many find living better endure western order culture may growing stake making indian cities liveable may want safer roads knows even parks clean air lane discipline feel change people start demanding dont basics like electricity water corners city people live posh societies carved nice living space people live away slums still dont water connections writer points indian cities hospitable poor poor underprivileged people run cities cleaning manual labour keeping prices check accepting less wages need make sure underprivileged people get water ask electricity good roads walking space without taking together cant build cities elites india always little stake development always well riches enough go abroad anytime indian working class pines better future live peacefully work comes politicians lacking vision really true people go vacations european cities thakares spend summer london dont think lack understanding global cities problem selling global cities get many votes investments mumbai people many countries making high density cities livable expensive political roi dependent people getting something making beautiful roads make people happy wont solve issues like hunger agree author lack civil sense though people think country failed dont owe respect govt healthcare joke infrastructure still developing taxes stingy people exposed better countries easy solution like playing national anthem movies want people respect laws need uphold dignity cream crop dont give shit turns things dont go well huh whod thunk massive population needs extreme discipline organized modern society look japan densely populated frequent natural disasters organize disciplined enough modern society busy jhumla instead actual change manu joseph wrote illicit happiness serious men miss laila kartik muralidharan said book long elites country sidestep government try private solutions public issues theyll never improve water security garbage hospital everything private solution care public infrastructure utilities large part dont functional city governments large part affects day day life large part taken care city government state governments seek greater federalism devolution powers centre refuse follow even basics request comes devolution governance responsibilities powers urban local bodies much doomed guy change life city dwellers local mayor corporator bangalores case exist congress went high court asking city local election conducted completely changed stand came power cities continue languish apathy state governments draw major revenues funds fir large cities put place largely rural populace state large hence arent answerable city residents ideally else could expect forefathers bred like rats popped billion babies years plan money china least acknowledged problem continue create australia every year india much better connecting cities vs intra city new highways pretty great eg pune nasik recent example yes state governments ignoring amendment constitution impunity party willing stop everything else make sure th amendment implemented scandal one knows article unlivable cities bangalore really takes cake concept bangalore development minister doesnt need elected people bangalore isnt answerable doesnt enough citys infra planning managed complex web institutions none answerable people even one institution nominally answerable bbmp elections repeatedly delayed one excuse crux problem indian urban elite majorly bjps core vote base dont want great infra everyone want situations nris jerking vande bharat boston bristol poor migrant laborers bihar travel rickety overcrowded trains could share reader use dont bother requests asking unpaywalled edition everytime dont forget idiot gadkari wanted paint optical illusion speed breakers road endanger lives name modern methods regulate speed excellent points guess frail hope ending end essay well real hope dont hope sure use newsflashhttpsgitlabcomnewsflashnewsflashgtk desktop readyouhttpsgithubcomashinchreadyou android politepolhttpspolitepolcom helps create feeds unavailable wouldnt banglore city roads fall responsibility local municipality centers fantastic read im new rss add article readyou app well written lack basic respect towards authority towards public infrastructure towards one another anyone doesnt belong socioeconomic group family city state caste gender etc add feeds app itll automatically fetch new articles heres link mints feeds hope indian upper class swamped poor useless mass respect towards authority huh anything indians bend backward comes authorityfigures problem awful leaders rolemodels anything large section indians love authoritarians told leaders gurus problem corruption authorities arent challenged enough hold unchecked power leads bunch criminals protecting criminals proper urban planning education mlas mps criminals joined politics sweep cases rug commit crimes corruption protection govt india different cartel states south america nah politicocriminal networks better entrenched sophisticated properly equipped rentseeking extortion racketeering narcostates latin america meant rules regulations law makers point taken role models politicians fake gurus actors etc awful manu josephs articles alone make mint wsj subscription worth oh ive always thought subscribing one two premium publications never knew one trust regards quality aligns interests writer someone like manu joseph regular source inspiration could help lot",
    "light_cleaned_title": "Manu Joseph: Why Indian cities may be doomed to remain unliveable",
    "light_cleaned_selftext": "\"As an Indian, my standards are so low that my idea of exciting urban development is a Nitin Gadkari tweet. I enjoy reading the plans of the minister for road transport and highways—his great projects, how he would punish Indians who don’t follow the law (this part especially), how he hopes to replace vehicular horns with the sound of Indian musical instruments, and how very soon road travel from Chennai to Bangalore would take only two hours. I did try to point out to him on X that right now Bangalore to Bangalore is two hours. I do not seriously believe he can change my quality of life, but he is the only politician I know who at least gets the fantasy right. And I so enjoy reading his tweets that sometimes I look furtively behind my shoulders to see if I am alone.\" The starting paragraphs really hooked me :D",
    "light_cleaned_comments": "Bulldozer on standby \"I do not believe that he can seriously change the quality of my life\"......true for every single politician in our joke of a government This is gold, but sadly behind paywall Manu Joseph writes rellay well. Oh, didn't know that. My reader usually parses the full text for me. I'll share the full text. Unpaywall - As an Indian, my standards are so low that my idea of exciting urban development is a Nitin Gadkari tweet. I enjoy reading the plans of the minister for road transport and highways—his great projects, how he would punish Indians who don’t follow the law (this part especially), how he hopes to replace vehicular horns with the sound of Indian musical instruments, and how very soon road travel from Chennai to Bangalore would take only two hours. I did try to point out to him on X that right now Bangalore to Bangalore is two hours. I do not seriously believe he can change my quality of life, but he is the only politician I know who at least gets the fantasy right. And I so enjoy reading his tweets that sometimes I look furtively behind my shoulders to see if I am alone. Also read: Mumbai most expensive city for expats in India; see full list here Usually, Indian politicians don’t give any hope when they speak of our urban future. They speak of nonsensical things like “smart cities\" and “twin cities.\" The fact is India’s politicians and people have worked together to make Indian cities among the most unliveable and ugly places on earth. India is obsessed with the image of its airports. Otherwise, across a vast landscape, India is an urban catastrophe. I believe this will not change. There is no hope. I can think of only two phenomena that convey an accurate representation of modern India. One is the Olympics and the other is any Indian town. The games expose how poorly run India is and how unkind we must be to each other to fare so poorly even against small nations. Our cities convey the same. Politicians are blamed a bit too much for what is essentially national character. The political stamina that Indians have for useless issues, if a fraction of that emotion were dedicated to our decrepit civic infrastructure, the lack of parks and beauty, our lives would be instantly richer. But that is not going to happen. Also read: Global Cities Index 2024: Delhi better than Mumbai in economy, quality of life; UP’s Sultanpur takes last spot on list One of the reasons our lives will not improve is that India is unable to change its attitude towards how to treat Indians. India treats all its people as though they are poor. In the administrative subconscious, there is a feeling that this is enough for Indians, they don’t deserve more, they don’t want more. Just imagine, wherever you are, what are the meetings scheduled in your municipal body today? You think they are going to discuss how to make roads endure, lane discipline, proper medians, working signals and how to make the city aesthetic so that it can serve the well-being of residents? Traffic is not the greatest enemy of urban life. Many great cities in the world have that problem. Take Bangkok, for example. It has terrible traffic. Even though its efficient metro system makes life somewhat bearable, the fact is that it has very bad traffic, and like in India, its upper middle class prefers car travel despite the jams. But Thais have such high civic sense and public dignity that Bangkok cannot match the misery of any Indian metro. India has never seriously tried to change the public behaviour of Indians. India’s most influential people do not seem to believe in the idea of a city. Somehow, they do not appear to crave order or aesthetics or the comfort of ordinary people. Also, maybe they intuitively feel that the chaos and ugliness of public life also make the poor feel that the country has not left them behind. At any given point of time, visually, India never alienates its poor. Except at fancy airport terminals. India’s urban mess may also come from what is widely viewed as a political virtue—the fact that modern India was not governed long enough by its cultural elite. There was a lot of democracy very soon. Also read: ’Bangalore will not be liveable in next 5 yrs, Delhi isn’t now’, says IIT Madras alum, viral post sparks debate The elite can be despicable, but they always know how to live well. Every great city in the world has been a beneficiary of the vision of a social elite and the ease with which they could enforce codes of social behaviour. The fundamentals of modern India too were created by its elite, but they did not prevail long enough to nurture its cities. Some of India’s early leaders did not think cities were important. Gandhi, for instance, wanted to bet big on villages. He was a famous evangelist of hygiene, but he seemed indifferent to urban planning. He wanted Indian children to learn handicraft even before their formal primary education (an idea that lurked in the first five-year plan). The failure of the modern Indian elite is more interesting. For centuries, migration was always something that the unfortunate had to do. People fled nature and persecution. But many developing nations endured a new kind of migration where the luckiest people migrated to expand their luck. For several generations now, the cream of India has migrated abroad or been in migration mode. It is not as though they hold the secret to improving urban life, but what the elite’s migration did was lower their stake in home, and in reforming home. All successful nations were transformed by their elite. When a society’s luckiest people do not have high stakes in home, we get modern India. In this phenomenon also lies our only hope. The Indian upper class never fully enjoyed migration. Now India has prospered enough to hold some attraction for the new economic elite, especially those who do not fully feel they belong in the West. It costs little to act like feudal lords in India and many find living here better than having to endure Western order and culture. So, they may have a growing stake in making Indian cities liveable. They may want safer roads, and, who knows, even parks, clean air and lane discipline. I feel it will change as people start demanding more, we don't have basics like electricity and water in all corners of the city. People who live in posh societies have carved out a nice living space for themselves but people who live 100m away in slums still don't have water connections. As the writer points out, Indian cities are hospitable to their poor because the poor and underprivileged people run the cities. From cleaning, manual labour to keeping prices in check by accepting less wages. We need to make sure all these underprivileged people get water they will ask for electricity, then good roads, walking space. Without taking them together we can't build cities. Elites of India always had little stake in its development, they were always well off which riches enough to go abroad anytime. Indian working class pines for a better future where they can live peacefully and work for it. When it comes to politicians lacking vision it's not really true. Most of these people go out for vacations to European cities, Thakares spend summer in London, I don't think they lack the understanding of global cities. The problem is selling global cities will not get them as many votes as some of the other investments. Mumbai has more people than many countries and making such high density cities livable is expensive. Political ROI is dependent on most people getting something & making beautiful roads will make some people happy but won't solve issues like hunger. I do agree with the author on the lack of civil sense though. Most of the people think their country has failed them and they don't owe it the same respect. Our govt healthcare is a joke, infrastructure is still developing, taxes are stingy and people are exposed to how better other countries are. There is no easy solution to it, like playing the national anthem before movies. If you want people to respect laws, you need to uphold their dignity. > when the cream of your crop don't give a shit about you, it turns out things don't go so well Huh. Who'd a thunk! A massive population needs extreme discipline to have an organized modern society - look at Japan, they are just as densely populated with frequent natural disasters They organize and are disciplined enough to have a modern society Here we are too busy with jhumla instead of actual change Is this the same Manu Joseph who wrote Illicit Happiness, Serious Men, and Miss Laila? Kartik Muralidharan said in his book as long as we the elites of our country sidestep government and try private solutions for public issues, they’ll never improve. Water, security, garbage, hospital - everything has a private solution now. Why care about public infrastructure or utilities. A large part is because we don’t have functional City governments, for a large part, because what affects our day to day life in large part is to be taken care of by the city government m which they do not The same state governments that seek greater federalism and devolution of powers from the centre, refuse to follow even the basics of the same request when it comes to devolution of governance responsibilities and powers to the urban local bodies who can do so much more, so we are doomed there, because the guy who can change the life of city dwellers the most is the local Mayor and the Corporator, who in Bangalores case do not exist, be the same congress which went to the high court asking for the City local election to be conducted, has completely changed their stand, once they themselves came to power So our cities will continue to languish at the apathy of the state governments, who draw their major revenues and funds fir the large cities, but are put in place by the largely rural populace of the state at large, and hence aren’t as answerable to the city residents as they should ideally be…… What else could you expect when our forefathers bred like rats and popped out 1 billion babies in 70 years with no plan and no money? China at least acknowledged the problem, but here we continue to create an Australia every year. India is doing much better in connecting cities vs intra city. The new highways are pretty great eg pune to nasik is a recent example Yes. State governments ignoring the 74 Amendment to the constitution with impunity with no party willing to stop everything else and make sure the 74th amendment is implemented is a scandal no one knows about. The article is about (un)livable cities. Bangalore really takes the cake with the concept of a \"Bangalore Development Minister\" who doesn't need to be elected by the people of Bangalore and isn't answerable to them. If that doesn't enough, the city's infra and planning is managed by a complex web of institutions, none of which are answerable to each other or to the people. Even the one institution that is nominally answerable, BBMP, has had its elections repeatedly delayed on one excuse or the other The crux of the problem is that the Indian urban elite, who are majorly the BJP's core vote base, don't want great infra for everyone. They want it only for themselves. This is why you have situations where NRIs are jerking themselves off over Vande Bharat in Boston and Bristol while the poor migrant laborers of Bihar travel in rickety, overcrowded trains. Could you share which reader you use so we don't have to bother you with requests asking for the unpaywalled edition everytime? :) Don't forget that this idiot gadkari wanted to paint optical illusion of speed breakers on the road and endanger lives in the name of modern methods to regulate speed. Excellent points. But I guess the frail hope at the ending is only to end the essay well, not a real hope. I don't have any hope. Sure! I use [NewsFlash](https://gitlab.com/news-flash/news_flash_gtk) on desktop and [ReadYou](https://github.com/Ashinch/ReadYou) on Android. [PolitePol](https://politepol.com) helps me create feeds where unavailable. Wouldn't Banglore city roads fall under the responsibility of the local municipality and not under the center's? What a fantastic read. I'm new to RSS. How do you add this article to ReadYou app? Well written. We lack basic respect towards authority, towards public infrastructure, towards one another, and anyone who doesn't belong to our socio-economic 'group' ( family, city, state, caste, gender, etc) We add feeds to the app, and then it'll automatically fetch new articles for you. Here's the link to Mint's feeds - > our only hope. The Indian upper class will be swamped over by the poor, useless mass >respect towards authority huh? If anything, most Indians bend over backward when it comes to authority-figures. We have a problem with awful leaders and role-models. If anything large section of Indians love authoritarians and being told what to do by leaders, gurus and such. Our problem is corruption of authorities aren't challenged enough so they hold unchecked power to do as they will (which just leads to bunch of criminals protecting other criminals). How will there be proper urban planning, education when most MLAs and MPs are criminals who joined politics to sweep their cases under the rug and to commit more crimes and corruption under the protection of govt. India is no different from cartel states in South America. Nah, our politico-criminal networks are better entrenched, more sophisticated and properly equipped for rent-seeking, extortion and racketeering than the narco-states of Latin America. I meant the rules, regulations and law makers. Point taken, most of our role models ( politicians, fake gurus, actors, etc ) are awful. Manu Joseph's articles alone make Mint + WSJ subscription worth it oh, is it so? I've always thought about subscribing to one or two premium publications, but never knew which one to trust the most with regards to quality and aligns with my interests. Being a writer myself, having someone like Manu Joseph as a regular source of inspiration could help a lot."
}