{
    "id": "1bhll33",
    "title": "Fraud of 1096 crores in Mumbai",
    "url": "https://www.reddit.com/r/india/comments/1bhll33/fraud_of_1096_crores_in_mumbai/",
    "selftext": " CA Amber Dalal of Ritz Consultancy has absconded, leaving hundreds of investors thronging the Oshiwara Police Station as a Ponzi fraud of over Rs 1000 crores comes to light.\n\nThe fraud, involving over 900 investors, came to light last evening after an FIR was filed against Chartered Accountant Amber Dalal under his company name Ritz Consultancy. His modus operandi was to lure investors by promising a 2% return per month with a legal guarantee of capital safety, resulting in large numbers of investors and senior citizens investing in his company. The matter came to light after investors did not receive their payment for March and started inquiring about the same.\n\nThey were then informed by Amber Dalal’s family that he has been missing since March 14th, 10 am, and they had already filed a missing report with the Oshiwara Police Station.\n\nThis is true as I am one of the investors \n\nSpread the word please and let this reach mainstream media\n\nhttps://mypunepulse.com/mumbai-based-ca-ambar-dalal-absconds-as-hundreds-of-investors-throng-oshiwara-police-station-ponzi-fraud-of-rs-1000-crores-comes-to-light/\n\nAs per reports on social media, he was last seen on his way to Gujarat in a silver Ciaz ",
    "flair": "Crime",
    "score": 434,
    "num_comments": 59,
    "created_utc": 1710749621.0,
    "convurl": "https://external-preview.redd.it/LmEZ7jgERuOO9oJuWK07UyEhw0miJnYmu7yUY-Cv8xQ.jpg?auto=webp&s=e7f12790976410b90403792b40743271e7bfd3ff",
    "comments": [
        "Vijay Mallya getting a new room mate /s",
        "Why do people keep falling for this again and again?",
        "Is his name Ambar (as in neele neele ambar pe) or Amber (as in amber heard)",
        "Greed",
        "Greed",
        "He did shit the bed.",
        "Why did you fall for this scam though?",
        "That's why we need realistic expectations of return, 12% is the ballpark achievable and over a long term massive gains,  still people keep chasing these 20%, double returns, 50% returns and then cry foul.\n\nPlay messed up games and win messed up prizes.",
        "Greed",
        "Greed",
        "Agreed",
        "Maybe his family knows where he is and have filed a fake missing complaint \n\nHe might have already fled the country too \n\nAnd even the police and Officials will support him if given bribe",
        "24% ka chakkar hai babu bhaiya, 24% ka.",
        "Thank you. I read 2% in the original post and wondered if it's real or a typo.",
        "Ohh man I have heard of a similar case with the exact same MO from 10 years back. Although this guy had promised 5% returns every month. He got caught, so hopefully this guy also gets caught.\n\n  \n[https://www.telegraphindia.com/india/billionaire-chit-fund-cheat-s-wings-clipped/cid/1476313](https://www.telegraphindia.com/india/billionaire-chit-fund-cheat-s-wings-clipped/cid/1476313)",
        "Greed",
        "Greed",
        "Uh no. You do stupid things you'll get stupid results.",
        "In 2020 another such firm named TejiMandi Analytics did exact same with portfolio of 1300 Crore. They were promising 1.25% every month and paying the existing customers profit from new customer's capital. Fraud came to light after their margin crumbled due to Corona News. I was building CRM for these guys and had to face loss after closure and owners fled to US.",
        "I read it as riZZ consultancy... 🥲. He got that riZZ to scam people tho",
        "But text Mandi is still present.",
        "Laalach",
        "Bernie madoff lite",
        "Breed",
        "If you did the due diligence....",
        "2% monthly hai bhai compounding bhi to hogi to 31% ke around ban gaya saal ka 🤑",
        " 24% ROI .. seems legit.",
        "Stupidity",
        "You are saying 1096 crores, but the media is reporting 54 crores. Which one is it?",
        "The number is only increasing\n\n1096 is as per the investors from which the official police complaints is as of 54 now. People are still flocking to file FIRs",
        "But the interest must have been compound",
        "shit my bad. Even more insane that people actually fell for it.",
        "2% per MONTH  \nThats over 25 per year because of compounding",
        "And people who have given their black money mostly won’t file the FIR cause they are anyways stuck",
        "We want to know how he lured you to invest in this?\n900 Crore is big amount and that means people hage lots of money in spare.",
        "The money is all white and FIR has already been done",
        "Wish I could breed ",
        "I read somewhere that he had been giving back returns of 2% per month for over 10 years now . Not even one payment was missed . This march he missed the first payment.\n\nSo not sure if he had this plan from 10 years that once he accumulates 1000cr he will run away or he got greedy suddenly and now went missing",
        "26.8%",
        "They deserved it anyway. Easy money never pays.",
        "If anything sounds too good to be true then it usually is",
        "20% gains in not unrealistic, I have \\~22% XIRR on my stock market portfolio and \\~21% on my Mutual Funds. The issue here is believing that you can get that without any risk to your capital.\n\nGuess what, I have seen SBI sell ultra high risk small cap MF's to senior citizens who come to the bank for opening FD's. They tell them that they will get 20-30% guaranteed returns. A pubic sector bank like SBI is running scamming people like this.\n\nAnd these senior citizens invest in these funds blinded by greed and they don't listen to their children who tell them that its not a good idea to put all their money in highly volatile small cap funds because their ego prevents them.\n\nAnother similar issue is people putting all their savings into cooperative banks just because they advertise a higher interest rate even though on average 20-30 of these banks get shutdown every year.",
        "The risk-o-meter AMFI uses is part of the problem, even an NIFTY 50 Index fund has same rating as an actively managed smallcap fund. Investor education sucks, i hope I'll change that with a startup, but that's separate.\n\nI don't think 20-25% is realistic, you've had good fortune, good for you, but many genz I see think it's average to have 17-18% return coz most of them started their career in the post COVID market book! 12% is long run average of nifty and the one I think people should benchmark.",
        "# just gujju things",
        "Just remove maybe from your reply and you’ll be 100% on point.",
        "I live in jaipur. There is a large scam going on, promising return of 84% per year. I know one person who invested his money in this and getting monthly return of 7%,and they will get $20 for every customer they bring.He told me that the people who have taken his money are investing in forex trading. I tried to told him it's  a scam. but he's ready for risk so i leave it there.I contacted one indian express news reporter who earlier had covered such news (similar kind of scam happened in himachal named Crypto con) but he's  also not ready to help untill any FIR is filed. They are waiting for someone to do suicide and than they will publish the news.",
        "On his way to Gujarat. Of course it’s Gujarat.",
        "25 din me Paisa double.",
        "Extremeeeee liteeeee. That guy did billions",
        "1000+ crores and drives a silver ciaz?",
        "Fuck around and find out kind of thing.",
        "A developing economy entails more disposable income. That in turn entails that people should invest and multiply their money. It's not greed. It's good money management. In this case, it turned out to be a scam. But it's not correct to simply brand it as greed when people are trying to take control of their own finances and gain monetary independence.",
        "Is it owned by Raamdeo Agarwal and his son Vaibhav Agarwal? I thought they are still in India",
        "No this one is different, even tho similar names.",
        "Yes, they even tried to again comeback by name of \"Anugrah Stock & Borking\" got banned by SEBI & some penalty too.\n\nI didn't know they have fled the country too. \n\nSab ka Sab chor idhar milenga.",
        "First one",
        "Yes, this is correct",
        "Praying that this guy gets caught 🙏🏻",
        "1. Greed\n\n2. Insane inflation in India, especially in Healthcare (medical) and Real Estate (house).\n\nIs why people keep on falling for these schemes!\n\n8% in FD and about 12℅ in Mutual Fund ( that too if you choose the MF wisely and the fund manager is very good & not corrupt) should be the only realistic expectations in India.\n\nAnything or anyone who gurantees  more than that is either a scam or extremely extremely risky! 99% you will lose it all!",
        "ADANI stock investors will be next.\n\nI think very soon Indian Stock exchange will be like the Japanese stock exchange and remain stagnant for the next 25-30 years.\n\nThe recent BULL market has blinded many people. They think Sensex is going to reach 100,000 etc. The Indian IT story is over, AI, Automatic taking over jobs etc.\n\nTemple economy, subsidies, reservations etc is going to cost India soon.",
        "Washing Powder Modi x2"
    ],
    "cleaned_text": "fraud crores mumbai ca amber dalal ritz consultancy absconded leaving hundreds investors thronging oshiwara police station ponzi fraud rs crores comes light fraud involving investors came light last evening fir filed chartered accountant amber dalal company name ritz consultancy modus operandi lure investors promising return per month legal guarantee capital safety resulting large numbers investors senior citizens investing company matter came light investors receive payment march started inquiring informed amber dalals family missing since march th already filed missing report oshiwara police station true one investors spread word please let reach mainstream media per reports social media last seen way gujarat silver ciaz ",
    "cleaned_title": "fraud crores mumbai",
    "cleaned_selftext": "ca amber dalal ritz consultancy absconded leaving hundreds investors thronging oshiwara police station ponzi fraud rs crores comes light fraud involving investors came light last evening fir filed chartered accountant amber dalal company name ritz consultancy modus operandi lure investors promising return per month legal guarantee capital safety resulting large numbers investors senior citizens investing company matter came light investors receive payment march started inquiring informed amber dalals family missing since march th already filed missing report oshiwara police station true one investors spread word please let reach mainstream media per reports social media last seen way gujarat silver ciaz",
    "cleaned_comments": "vijay mallya getting new room mate people keep falling name ambar neele neele ambar pe amber amber heard greed greed shit bed fall scam though thats need realistic expectations return ballpark achievable long term massive gains still people keep chasing double returns returns cry foul play messed games win messed prizes greed greed agreed maybe family knows filed fake missing complaint might already fled country even police officials support given bribe ka chakkar hai babu bhaiya ka thank read original post wondered real typo ohh man heard similar case exact mo years back although guy promised returns every month got caught hopefully guy also gets caught httpswwwtelegraphindiacomindiabillionairechitfundcheatswingsclippedcidhttpswwwtelegraphindiacomindiabillionairechitfundcheatswingsclippedcid greed greed uh stupid things youll get stupid results another firm named tejimandi analytics exact portfolio crore promising every month paying existing customers profit new customers capital fraud came light margin crumbled due corona news building crm guys face loss closure owners fled us read rizz consultancy got rizz scam people tho text mandi still present laalach bernie madoff lite breed due diligence monthly hai bhai compounding bhi hogi ke around ban gaya saal ka roi seems legit stupidity saying crores media reporting crores one number increasing per investors official police complaints people still flocking file firs interest must compound shit bad even insane people actually fell per month thats per year compounding people given black money mostly wont file fir cause anyways stuck want know lured invest crore big amount means people hage lots money spare money white fir already done wish could breed read somewhere giving back returns per month years even one payment missed march missed first payment sure plan years accumulates cr run away got greedy suddenly went missing deserved anyway easy money never pays anything sounds good true usually gains unrealistic xirr stock market portfolio mutual funds issue believing get without risk capital guess seen sbi sell ultra high risk small cap mfs senior citizens come bank opening fds tell get guaranteed returns pubic sector bank like sbi running scamming people like senior citizens invest funds blinded greed dont listen children tell good idea put money highly volatile small cap funds ego prevents another similar issue people putting savings cooperative banks advertise higher interest rate even though average banks get shutdown every year riskometer amfi uses part problem even nifty index fund rating actively managed smallcap fund investor education sucks hope ill change startup thats separate dont think realistic youve good fortune good many genz see think average return coz started career post covid market book long run average nifty one think people benchmark gujju things remove maybe reply youll point live jaipur large scam going promising return per year know one person invested money getting monthly return get every customer bringhe told people taken money investing forex trading tried told scam hes ready risk leave therei contacted one indian express news reporter earlier covered news similar kind scam happened himachal named crypto con hes also ready help untill fir filed waiting someone suicide publish news way gujarat course gujarat din paisa double extremeeeee liteeeee guy billions crores drives silver ciaz fuck around find kind thing developing economy entails disposable income turn entails people invest multiply money greed good money management case turned scam correct simply brand greed people trying take control finances gain monetary independence owned raamdeo agarwal son vaibhav agarwal thought still india one different even tho similar names yes even tried comeback name anugrah stock borking got banned sebi penalty didnt know fled country sab ka sab chor idhar milenga first one yes correct praying guy gets caught greed insane inflation india especially healthcare medical real estate house people keep falling schemes fd mutual fund choose mf wisely fund manager good corrupt realistic expectations india anything anyone gurantees either scam extremely extremely risky lose adani stock investors next think soon indian stock exchange like japanese stock exchange remain stagnant next years recent bull market blinded many people think sensex going reach etc indian story ai automatic taking jobs etc temple economy subsidies reservations etc going cost india soon washing powder modi x",
    "light_cleaned_title": "Fraud of 1096 crores in Mumbai",
    "light_cleaned_selftext": "CA Amber Dalal of Ritz Consultancy has absconded, leaving hundreds of investors thronging the Oshiwara Police Station as a Ponzi fraud of over Rs 1000 crores comes to light. The fraud, involving over 900 investors, came to light last evening after an FIR was filed against Chartered Accountant Amber Dalal under his company name Ritz Consultancy. His modus operandi was to lure investors by promising a 2% return per month with a legal guarantee of capital safety, resulting in large numbers of investors and senior citizens investing in his company. The matter came to light after investors did not receive their payment for March and started inquiring about the same. They were then informed by Amber Dalal’s family that he has been missing since March 14th, 10 am, and they had already filed a missing report with the Oshiwara Police Station. This is true as I am one of the investors Spread the word please and let this reach mainstream media As per reports on social media, he was last seen on his way to Gujarat in a silver Ciaz",
    "light_cleaned_comments": "Vijay Mallya getting a new room mate /s Why do people keep falling for this again and again? Is his name Ambar (as in neele neele ambar pe) or Amber (as in amber heard) Greed Greed He did shit the bed. Why did you fall for this scam though? That's why we need realistic expectations of return, 12% is the ballpark achievable and over a long term massive gains, still people keep chasing these 20%, double returns, 50% returns and then cry foul. Play messed up games and win messed up prizes. Greed Greed Agreed Maybe his family knows where he is and have filed a fake missing complaint He might have already fled the country too And even the police and Officials will support him if given bribe 24% ka chakkar hai babu bhaiya, 24% ka. Thank you. I read 2% in the original post and wondered if it's real or a typo. Ohh man I have heard of a similar case with the exact same MO from 10 years back. Although this guy had promised 5% returns every month. He got caught, so hopefully this guy also gets caught. [https://www.telegraphindia.com/india/billionaire-chit-fund-cheat-s-wings-clipped/cid/1476313](https://www.telegraphindia.com/india/billionaire-chit-fund-cheat-s-wings-clipped/cid/1476313) Greed Greed Uh no. You do stupid things you'll get stupid results. In 2020 another such firm named TejiMandi Analytics did exact same with portfolio of 1300 Crore. They were promising 1.25% every month and paying the existing customers profit from new customer's capital. Fraud came to light after their margin crumbled due to Corona News. I was building CRM for these guys and had to face loss after closure and owners fled to US. I read it as riZZ consultancy... 🥲. He got that riZZ to scam people tho But text Mandi is still present. Laalach Bernie madoff lite Breed If you did the due diligence.... 2% monthly hai bhai compounding bhi to hogi to 31% ke around ban gaya saal ka 🤑 24% ROI .. seems legit. Stupidity You are saying 1096 crores, but the media is reporting 54 crores. Which one is it? The number is only increasing 1096 is as per the investors from which the official police complaints is as of 54 now. People are still flocking to file FIRs But the interest must have been compound shit my bad. Even more insane that people actually fell for it. 2% per MONTH Thats over 25 per year because of compounding And people who have given their black money mostly won’t file the FIR cause they are anyways stuck We want to know how he lured you to invest in this? 900 Crore is big amount and that means people hage lots of money in spare. The money is all white and FIR has already been done Wish I could breed I read somewhere that he had been giving back returns of 2% per month for over 10 years now . Not even one payment was missed . This march he missed the first payment. So not sure if he had this plan from 10 years that once he accumulates 1000cr he will run away or he got greedy suddenly and now went missing 26.8% They deserved it anyway. Easy money never pays. If anything sounds too good to be true then it usually is 20% gains in not unrealistic, I have \\~22% XIRR on my stock market portfolio and \\~21% on my Mutual Funds. The issue here is believing that you can get that without any risk to your capital. Guess what, I have seen SBI sell ultra high risk small cap MF's to senior citizens who come to the bank for opening FD's. They tell them that they will get 20-30% guaranteed returns. A pubic sector bank like SBI is running scamming people like this. And these senior citizens invest in these funds blinded by greed and they don't listen to their children who tell them that its not a good idea to put all their money in highly volatile small cap funds because their ego prevents them. Another similar issue is people putting all their savings into cooperative banks just because they advertise a higher interest rate even though on average 20-30 of these banks get shutdown every year. The risk-o-meter AMFI uses is part of the problem, even an NIFTY 50 Index fund has same rating as an actively managed smallcap fund. Investor education sucks, i hope I'll change that with a startup, but that's separate. I don't think 20-25% is realistic, you've had good fortune, good for you, but many genz I see think it's average to have 17-18% return coz most of them started their career in the post COVID market book! 12% is long run average of nifty and the one I think people should benchmark. # just gujju things Just remove maybe from your reply and you’ll be 100% on point. I live in jaipur. There is a large scam going on, promising return of 84% per year. I know one person who invested his money in this and getting monthly return of 7%,and they will get $20 for every customer they bring.He told me that the people who have taken his money are investing in forex trading. I tried to told him it's a scam. but he's ready for risk so i leave it there.I contacted one indian express news reporter who earlier had covered such news (similar kind of scam happened in himachal named Crypto con) but he's also not ready to help untill any FIR is filed. They are waiting for someone to do suicide and than they will publish the news. On his way to Gujarat. Of course it’s Gujarat. 25 din me Paisa double. Extremeeeee liteeeee. That guy did billions 1000+ crores and drives a silver ciaz? Fuck around and find out kind of thing. A developing economy entails more disposable income. That in turn entails that people should invest and multiply their money. It's not greed. It's good money management. In this case, it turned out to be a scam. But it's not correct to simply brand it as greed when people are trying to take control of their own finances and gain monetary independence. Is it owned by Raamdeo Agarwal and his son Vaibhav Agarwal? I thought they are still in India No this one is different, even tho similar names. Yes, they even tried to again comeback by name of \"Anugrah Stock & Borking\" got banned by SEBI & some penalty too. I didn't know they have fled the country too. Sab ka Sab chor idhar milenga. First one Yes, this is correct Praying that this guy gets caught 🙏🏻 1. Greed 2. Insane inflation in India, especially in Healthcare (medical) and Real Estate (house). Is why people keep on falling for these schemes! 8% in FD and about 12℅ in Mutual Fund ( that too if you choose the MF wisely and the fund manager is very good & not corrupt) should be the only realistic expectations in India. Anything or anyone who gurantees more than that is either a scam or extremely extremely risky! 99% you will lose it all! ADANI stock investors will be next. I think very soon Indian Stock exchange will be like the Japanese stock exchange and remain stagnant for the next 25-30 years. The recent BULL market has blinded many people. They think Sensex is going to reach 100,000 etc. The Indian IT story is over, AI, Automatic taking over jobs etc. Temple economy, subsidies, reservations etc is going to cost India soon. Washing Powder Modi x2"
}