{
    "id": "149p4vt",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/149p4vt/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=79f0d698e4abf87f45628ddd3057be3fe4b83435",
    "flair": "Scheduled",
    "score": 3,
    "num_comments": 7,
    "created_utc": 1686792609.0,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "I am a 27 year old B. Tech computer science engg. Graduate, I quit my campus placement job for pursuing upsc (right after induction, so no job experience), how is the job scenario for someone like me at 29? What are the things I would have to do if it ever comes to that? (Not looking for a job rn but want to know about my options) TIA !",
        "Is upgrad data science courses really offer 100% campus placement? I'm 31 years old with no job experience looking for a job for the past 10 years I'm an Aeronautical Engineering graduate need an option to save myself from this torture",
        "Nope you will not a job anywhere you should try suicide",
        "have you thought about going abroad? Or that's not something you are looking into?",
        "Haven't thought much about going abroad but I am not against it.",
        "You can try it. I am 28 years old. Came to Germany when I was 26 - not high salary like my friends in USA, but you have so much mental peace and so safe. Nobody calls you at midnight to ask you take care of XYZ tasks, have many German friends and life is not bad. I can only recommend also to take a look into that. Computer Science has an insane demand in Germany right now.",
        "Synchrony is hiring in Hyderabad and New Delhi (Hyderabad being the central hub) for positions from Associates to Mangers, and higher positions.\n\nRequirements (starting from)\n- 12th/intermediate pass\n- Great English communication skills\n\nYou can contact me on Reddit or on Instagram Overly_Confused.\n\nPS. I'm not an HR, but I can refer folks for any position. Reach out to me with any questions.\n\nA little more about Synchrony.\n\nSynchrony Financials is a credit card company in the US. The Hyderabad hub has more than 5000 employees and you can work in hybrid mode.\n\nSynchrony is in top 5 for India's best workplace diversity, with it actively looking to hire women who have had break from working, veterans, LGBTQ+ community and PWDs, and also it's in top 10 Best places to work for women."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "year old b tech computer science engg graduate quit campus placement job pursuing upsc right induction job experience job scenario someone like things would ever comes looking job rn want know options tia upgrad data science courses really offer campus placement im years old job experience looking job past years im aeronautical engineering graduate need option save torture nope job anywhere try suicide thought going abroad thats something looking havent thought much going abroad try years old came germany high salary like friends usa much mental peace safe nobody calls midnight ask take care xyz tasks many german friends life bad recommend also take look computer science insane demand germany right synchrony hiring hyderabad new delhi hyderabad central hub positions associates mangers higher positions requirements starting thintermediate pass great english communication skills contact reddit instagram overlyconfused ps im hr refer folks position reach questions little synchrony synchrony financials credit card company us hyderabad hub employees work hybrid mode synchrony top indias best workplace diversity actively looking hire women break working veterans lgbtq community pwds also top best places work women",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I am a 27 year old B. Tech computer science engg. Graduate, I quit my campus placement job for pursuing upsc (right after induction, so no job experience), how is the job scenario for someone like me at 29? What are the things I would have to do if it ever comes to that? (Not looking for a job rn but want to know about my options) TIA ! Is upgrad data science courses really offer 100% campus placement? I'm 31 years old with no job experience looking for a job for the past 10 years I'm an Aeronautical Engineering graduate need an option to save myself from this torture Nope you will not a job anywhere you should try suicide have you thought about going abroad? Or that's not something you are looking into? Haven't thought much about going abroad but I am not against it. You can try it. I am 28 years old. Came to Germany when I was 26 - not high salary like my friends in USA, but you have so much mental peace and so safe. Nobody calls you at midnight to ask you take care of XYZ tasks, have many German friends and life is not bad. I can only recommend also to take a look into that. Computer Science has an insane demand in Germany right now. Synchrony is hiring in Hyderabad and New Delhi (Hyderabad being the central hub) for positions from Associates to Mangers, and higher positions. Requirements (starting from) - 12th/intermediate pass - Great English communication skills You can contact me on Reddit or on Instagram Overly_Confused. PS. I'm not an HR, but I can refer folks for any position. Reach out to me with any questions. A little more about Synchrony. Synchrony Financials is a credit card company in the US. The Hyderabad hub has more than 5000 employees and you can work in hybrid mode. Synchrony is in top 5 for India's best workplace diversity, with it actively looking to hire women who have had break from working, veterans, LGBTQ+ community and PWDs, and also it's in top 10 Best places to work for women."
}