{
    "id": "154hi9k",
    "title": "Wtf is this?",
    "url": "https://www.reddit.com/gallery/154hi9k",
    "selftext": "I was just scrolling through reddit and this popped up and my phone started vibrating with it. This happened twice. Kya ho raha hai bhai? Scam?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689829493.0,
    "convurl": "https://i.redd.it/d013axhmy1db1.jpg",
    "comments": [
        "No, this is very common in countries like Japan, US, etc where govt share emergency alert in case of any emergency like for ex earthquake. They were just testing if their system is working or not, this is also a common practice in the countries I mentioned above.\n\nFun Fact- In Japan TV opens up itself and start to emergency alter like in case of earthquake or missile alert from NK.",
        "It’s a test alert. Like the message says. Read the thing bro.",
        "Have you heard of Amber alerts in the US? Similar feature. It helps the authorities send timely alerts to every phone in the state at the same time. It can save lives.",
        "Haa I just thought it might be a scam or something. I'm like a 60 year old when it comes to tech 🤣",
        "Got it. Thanks",
        "Woah that's great!"
    ],
    "cleaned_text": "wtf scrolling reddit popped phone started vibrating happened twice kya ho raha hai bhai scam ",
    "cleaned_title": "wtf",
    "cleaned_selftext": "scrolling reddit popped phone started vibrating happened twice kya ho raha hai bhai scam",
    "cleaned_comments": "common countries like japan us etc govt share emergency alert case emergency like ex earthquake testing system working also common practice countries mentioned fun fact japan tv opens start emergency alter like case earthquake missile alert nk test alert like message says read thing bro heard amber alerts us similar feature helps authorities send timely alerts every phone state time save lives haa thought might scam something im like year old comes tech got thanks woah thats great",
    "light_cleaned_title": "Wtf is this?",
    "light_cleaned_selftext": "I was just scrolling through reddit and this popped up and my phone started vibrating with it. This happened twice. Kya ho raha hai bhai? Scam?",
    "light_cleaned_comments": "No, this is very common in countries like Japan, US, etc where govt share emergency alert in case of any emergency like for ex earthquake. They were just testing if their system is working or not, this is also a common practice in the countries I mentioned above. Fun Fact- In Japan TV opens up itself and start to emergency alter like in case of earthquake or missile alert from NK. It’s a test alert. Like the message says. Read the thing bro. Have you heard of Amber alerts in the US? Similar feature. It helps the authorities send timely alerts to every phone in the state at the same time. It can save lives. Haa I just thought it might be a scam or something. I'm like a 60 year old when it comes to tech 🤣 Got it. Thanks Woah that's great!"
}