{
    "id": "11hlker",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/11hlker/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 5,
    "num_comments": 10,
    "created_utc": 1677893411,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Morty i already told you.they are not your family.they are clones from an alternate reality possessed by demonic alien spirits from another dimension 😂😂 damn i love this show",
        "Saw Cocaine Bear. \n\nDumb, silly, gory and ridiculous. Passable vfx. Anticlimactic. Nevertheless, one terrific action scene made it worth the money :)",
        "Started season 1 of Peep Show. Goddamn how did I miss out on this gem. Jesse Armstrong is on of the writers. I have never laughed out loud so much in one episode. \n\nWill start a re-watch of  succession before the season 4 premiere. I'm having contradictory feelings towards the final 4th season. I love it and I want to watch it as long as possible and I also love that they will end as per the showrunner and the writers vision and almost definitely  end on a bang.",
        "Is Peep Show back on any streaming service? Watched it ages ago in Netflix.",
        "Poker face is amazing.",
        "I thought American Vandal and Dirk Gently's Holistic Detective Agency were underrated and did not deserve to be cancelled by Netflix",
        "Thankam - very good thriller\n\n\nNanpakal nerathu mayakkam - okay movie brilliant performances, brilliant cinematography and brilliant use of bgm\n\n\nKala - non stop action, terrific cinematography, editing and stunt choreography\n\nAll Malayalam movies",
        "&gt; Peep Show\n\nwhere can i watch it?",
        "Had to resort to the high seas my friend. I  could not find it anywhere."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "morty already told youthey familythey clones alternate reality possessed demonic alien spirits another dimension damn love show saw cocaine bear dumb silly gory ridiculous passable vfx anticlimactic nevertheless one terrific action scene made worth money started season peep show goddamn miss gem jesse armstrong writers never laughed loud much one episode start rewatch succession season premiere im contradictory feelings towards final th season love want watch long possible also love end per showrunner writers vision almost definitely end bang peep show back streaming service watched ages ago netflix poker face amazing thought american vandal dirk gentlys holistic detective agency underrated deserve cancelled netflix thankam good thriller nanpakal nerathu mayakkam okay movie brilliant performances brilliant cinematography brilliant use bgm kala non stop action terrific cinematography editing stunt choreography malayalam movies gt peep show watch resort high seas friend could find anywhere",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Morty i already told you.they are not your family.they are clones from an alternate reality possessed by demonic alien spirits from another dimension 😂😂 damn i love this show Saw Cocaine Bear. Dumb, silly, gory and ridiculous. Passable vfx. Anticlimactic. Nevertheless, one terrific action scene made it worth the money :) Started season 1 of Peep Show. Goddamn how did I miss out on this gem. Jesse Armstrong is on of the writers. I have never laughed out loud so much in one episode. Will start a re-watch of succession before the season 4 premiere. I'm having contradictory feelings towards the final 4th season. I love it and I want to watch it as long as possible and I also love that they will end as per the showrunner and the writers vision and almost definitely end on a bang. Is Peep Show back on any streaming service? Watched it ages ago in Netflix. Poker face is amazing. I thought American Vandal and Dirk Gently's Holistic Detective Agency were underrated and did not deserve to be cancelled by Netflix Thankam - very good thriller Nanpakal nerathu mayakkam - okay movie brilliant performances, brilliant cinematography and brilliant use of bgm Kala - non stop action, terrific cinematography, editing and stunt choreography All Malayalam movies &gt; Peep Show where can i watch it? Had to resort to the high seas my friend. I could not find it anywhere."
}