{
    "id": "19b6ukf",
    "title": "Diesel Scam in India",
    "url": "https://www.reddit.com/gallery/19b6ukf",
    "selftext": "I recently stopped at a HP Corp. Ltd to fill Diesel in our car at Ranjangaon, Pune & I immediately noticed that the Density of the Petrol was too below the Actual Density Limit set in India which is 820-845 kg/m³, My dad wasn't really paying attention to what i was saying. The motive of uploading this post is to stay aware whenever you are filling up your tank from an unknown village-side FuelPump!! Jaihind",
    "flair": "Crime",
    "score": 8,
    "num_comments": 2,
    "created_utc": 1705737925.0,
    "convurl": "https://i.redd.it/ylnvtj6hyjdc1.jpg",
    "comments": [
        "This is new information to me. We can assume the fuel quality of a fuel station based on the density displayed? How effective is this value in conveying the fuel quality I just want to ask?"
    ],
    "cleaned_text": "diesel scam india recently stopped hp corp ltd fill diesel car ranjangaon pune immediately noticed density petrol actual density limit set india kgm dad wasnt really paying attention saying motive uploading post stay aware whenever filling tank unknown villageside fuelpump jaihind ",
    "cleaned_title": "diesel scam india",
    "cleaned_selftext": "recently stopped hp corp ltd fill diesel car ranjangaon pune immediately noticed density petrol actual density limit set india kgm dad wasnt really paying attention saying motive uploading post stay aware whenever filling tank unknown villageside fuelpump jaihind",
    "cleaned_comments": "new information assume fuel quality fuel station based density displayed effective value conveying fuel quality want ask",
    "light_cleaned_title": "Diesel Scam in India",
    "light_cleaned_selftext": "I recently stopped at a HP Corp. Ltd to fill Diesel in our car at Ranjangaon, Pune & I immediately noticed that the Density of the Petrol was too below the Actual Density Limit set in India which is 820-845 kg/m³, My dad wasn't really paying attention to what i was saying. The motive of uploading this post is to stay aware whenever you are filling up your tank from an unknown village-side FuelPump!! Jaihind",
    "light_cleaned_comments": "This is new information to me. We can assume the fuel quality of a fuel station based on the density displayed? How effective is this value in conveying the fuel quality I just want to ask?"
}