{
    "id": "up6h7v",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/up6h7v/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 19,
    "num_comments": 29,
    "created_utc": 1652491810,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Just watched the Hansal Mehta and Vishal Bharadwaj directed episodes in Modern Love Mumbai on prime. The songs are just beautiful and melodious. I liked Vishal's episode more.\n\nDoes anyone know if they released the songs anywhere??",
        "Your lucky day.  They dropped the jukebox on youtube 1 day back. \n\nhttps://youtu.be/M3OM_w4aKRA\n\nSome of the songs are just amazing,  but they hit even more after the 'mahaul' has been set by the story.  😅",
        "This weekend I'm watching twin peaks again for second time.reall a masterpiece.",
        "I watched Everything Everywhere all at Once. Loved the movie. It’s a sci-fi movie with amazing action sequences while being a emotional roller coaster at the same time. The theme revolves around nhilism, and the act of kindness in face of nhilism.",
        "Watch Tomorrow Korean web series on Netflix. Pretty good, first series I watched through subtitles and its really good",
        "Watched a few movies after almost 2 years. Taxi 9211, Hasee to Phasee and Lakshya.",
        "Where did you watch it? Do you live outside India?",
        "Watched at a local theater, I live outside",
        "Sad i will never be able to see it in theatres. After Green Knight, they didn't release any A24 movie here.",
        "Dang that sucks. I think movie is really brilliant and lot of our generation could relate with it. Not to give the plot away, it revolves around a struggling asian family and lot of the family dynamics are something that I could see in our on culture. A kid looking for acceptance from her mom.",
        "Yeah I was so excited for EEAAO and The Northman, but they will never  get released here.",
        "The first episode of Modern Love (Season 2). Minnie Driver was phenomenal, the story quite poignant.",
        "Watched\n\n  \n\n\n1.saani kaayitham - soaring in technical aspects, absolutely brutal\n\n  \n\n\n2. Rocky (Tamil) - by the same saani kaayitham director debut movie - similar to saani kaayitham in all aspects but the single shots were a treat to watch\n\n  \n\n\n3. Puzhu (Malayalam) - got me depressed after watching the movie. My awe for Malayalam movies is increasing day by day. Starring mammooty without an ounce of heroism, no masala songs, comedy, fight. Movie based on caste discrimination.",
        "Better Call Saul. Things are getting hot.",
        "What this new podcast called - Why this Kolaveri podcast! Available on YouTube, Spotify, apple podcast and google podcast",
        "No spoilers please",
        "The Northman is available for streaming. EEAAO has its digital release on 17th May",
        "Puzhu was awesome. Captivating without any masala or over the top moments.\n\nIMHO, the movie talks about Caste discrimination and about men afraid of losing power (power play)",
        "what is it about?",
        "Watched Photograph. Nawaz and Sanya. But Dadi takes the cake. Such a beautiful bollywood movie of recent time.",
        "I can listen to its soundtrack forever.",
        "Watched “ the kingdom “ south korean zombie series loved it",
        "Probably the best series on television right now, aside from Succession. Lalo is an incredibly charming villain. Sometimes I root for him lol.\n\nI am excited in the direction in which they take Kim.",
        "There is a prequel to it.",
        "After watching the two seasons of the original and the Twin Peaks  movie you realize Laura Palmer was the busiest high school kid in history and it's no wonder she needed cocaine to get through all the shit she had going on",
        "I would never. I only spoil capeshit.",
        "Absolutely.",
        "Just a regular comedy podcast with AITA sections too"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watched hansal mehta vishal bharadwaj directed episodes modern love mumbai prime songs beautiful melodious liked vishals episode anyone know released songs anywhere lucky day dropped jukebox youtube day back songs amazing hit even mahaul set story weekend im watching twin peaks second timereall masterpiece watched everything everywhere loved movie scifi movie amazing action sequences emotional roller coaster time theme revolves around nhilism act kindness face nhilism watch tomorrow korean web series netflix pretty good first series watched subtitles really good watched movies almost years taxi hasee phasee lakshya watch live outside india watched local theater live outside sad never able see theatres green knight didnt release movie dang sucks think movie really brilliant lot generation could relate give plot away revolves around struggling asian family lot family dynamics something could see culture kid looking acceptance mom yeah excited eeaao northman never get released first episode modern love season minnie driver phenomenal story quite poignant watched saani kaayitham soaring technical aspects absolutely brutal rocky tamil saani kaayitham director debut movie similar saani kaayitham aspects single shots treat watch puzhu malayalam got depressed watching movie awe malayalam movies increasing day day starring mammooty without ounce heroism masala songs comedy fight movie based caste discrimination better call saul things getting hot new podcast called kolaveri podcast available youtube spotify apple podcast google podcast spoilers please northman available streaming eeaao digital release th may puzhu awesome captivating without masala top moments imho movie talks caste discrimination men afraid losing power power play watched photograph nawaz sanya dadi takes cake beautiful bollywood movie recent time listen soundtrack forever watched kingdom south korean zombie series loved probably best series television right aside succession lalo incredibly charming villain sometimes root lol excited direction take kim prequel watching two seasons original twin peaks movie realize laura palmer busiest high school kid history wonder needed cocaine get shit going would never spoil capeshit absolutely regular comedy podcast aita sections",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Just watched the Hansal Mehta and Vishal Bharadwaj directed episodes in Modern Love Mumbai on prime. The songs are just beautiful and melodious. I liked Vishal's episode more. Does anyone know if they released the songs anywhere?? Your lucky day. They dropped the jukebox on youtube 1 day back. Some of the songs are just amazing, but they hit even more after the 'mahaul' has been set by the story. 😅 This weekend I'm watching twin peaks again for second time.reall a masterpiece. I watched Everything Everywhere all at Once. Loved the movie. It’s a sci-fi movie with amazing action sequences while being a emotional roller coaster at the same time. The theme revolves around nhilism, and the act of kindness in face of nhilism. Watch Tomorrow Korean web series on Netflix. Pretty good, first series I watched through subtitles and its really good Watched a few movies after almost 2 years. Taxi 9211, Hasee to Phasee and Lakshya. Where did you watch it? Do you live outside India? Watched at a local theater, I live outside Sad i will never be able to see it in theatres. After Green Knight, they didn't release any A24 movie here. Dang that sucks. I think movie is really brilliant and lot of our generation could relate with it. Not to give the plot away, it revolves around a struggling asian family and lot of the family dynamics are something that I could see in our on culture. A kid looking for acceptance from her mom. Yeah I was so excited for EEAAO and The Northman, but they will never get released here. The first episode of Modern Love (Season 2). Minnie Driver was phenomenal, the story quite poignant. Watched 1.saani kaayitham - soaring in technical aspects, absolutely brutal 2. Rocky (Tamil) - by the same saani kaayitham director debut movie - similar to saani kaayitham in all aspects but the single shots were a treat to watch 3. Puzhu (Malayalam) - got me depressed after watching the movie. My awe for Malayalam movies is increasing day by day. Starring mammooty without an ounce of heroism, no masala songs, comedy, fight. Movie based on caste discrimination. Better Call Saul. Things are getting hot. What this new podcast called - Why this Kolaveri podcast! Available on YouTube, Spotify, apple podcast and google podcast No spoilers please The Northman is available for streaming. EEAAO has its digital release on 17th May Puzhu was awesome. Captivating without any masala or over the top moments. IMHO, the movie talks about Caste discrimination and about men afraid of losing power (power play) what is it about? Watched Photograph. Nawaz and Sanya. But Dadi takes the cake. Such a beautiful bollywood movie of recent time. I can listen to its soundtrack forever. Watched “ the kingdom “ south korean zombie series loved it Probably the best series on television right now, aside from Succession. Lalo is an incredibly charming villain. Sometimes I root for him lol. I am excited in the direction in which they take Kim. There is a prequel to it. After watching the two seasons of the original and the Twin Peaks movie you realize Laura Palmer was the busiest high school kid in history and it's no wonder she needed cocaine to get through all the shit she had going on I would never. I only spoil capeshit. Absolutely. Just a regular comedy podcast with AITA sections too"
}