{
    "id": "oprvv8",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/oprvv8/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 9,
    "num_comments": 5,
    "created_utc": 1627003817,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "What noone cooks here?\n\nHere's something.\n\nPrawns in garlic cheese sauce.\n\nSaute 1/2 kg (cleaned/deveined) prawns. Add 1/2 tsp salt. Just wait till color changes on each side and take off the heat. Prawns get very tough if overcooked.\n\nIn 1 inch piece of butter, fry 4 finely chopped cloves of garlic (more garlic is up to you). Add 1/2 tsp of chilly flakes, and then add 1/2 cup of water. Add 1/2 cup cheese. Add salt to taste, let the whole thing melt together into a sauce. Add 1/2 teaspoon of sugar and half a lemon juice. \n\nThen add the prawns, simmer for 1 to 2 min, done. The sauce should just coat the prawns, not be watery.\n\nFor a veg version, try with mushrooms or (boiled and then crispy fried) potatoes.",
        "I experimented with few things lol \n\n**Recipe 1 Mushroom Maggi**\n\nBoil water in bowl and add Maggi noodles and let it cook. \n\nIn another pot, fry chopped onions, garlic, veggies of your choice in a but of coconut oil. Add mushrooms. Add a bit of chilli powder and cook till mushrooms are soft. Add half the tastemaker packet and saute. Add the boiled noodles and the remaining tastemaker. You can also add the water in which it was boiled and let it cook. Garnish with some spring onions and coriander leaves and you're done \n\n\n**Recipe 2 Cheese/Paneer maggi** \n\nMake Maggi normally and when it's 90% cooked, just dump in a slice of cheese and cover it so it melts. It tastes heavenly. \n\nFor the paneer Maggi, make Maggi normally and cut the paneer into small cubes and dry them separately in a pan with a bit of oil/ghee and chilli powder. Add them in when the Maggi is 90% cooked.",
        "This is something I always love cooking coz its hella tasty \n\n**Chicken sukka**\n\nIt's a southern dish. \n\nTake a pan and add some ghee. Saute some chopped onions(1big onion or 2 medium) and then once the onions are cooked as some tomatoes(1.5 or double the quantity of onions so 3 medium tomatoes) and half a spoon of ginger garlic paste and saute. Once the tomatoes are slightly mushy, add the chicken sukka powder(The one I use is SRR chicken sukka powder. Store bought and easily available.) and cook it a bit. Then add cut pieces of chicken(I use 1/2 kg of chicken breasts). Add ghee if necessary. The more ghee you add the tastier it'll be(I usually add 75-100gm of ghee altogether). Add salt as per taste. Cover and cook on low-medium flame for around 10-15 mins(depends on how big or small you cut your chicken). Check in between once. Once it's 95% cooked, add some raw shredded coconut and mix it up. (It'll be sweet if you add too much so add 1/4th or 1/3rd cup?) At last garnish with coriander leaves and you're done. \n\nThe great thing about this is, it's a one pot dish.",
        "Here are some great and easy recipes for someone who wants to fry out cooking. I've tried them myself and they're really nice \n\nPaneer butter masala https://youtu.be/oYZ--rdHL6I\n\nMushroom masala https://youtu.be/Gm_doKq4hrw\n\nButter chicken https://youtu.be/a03U45jFxOI\n\nChanna masala https://youtu.be/aWwt0CTb_vI\n\nPonder masala fry https://youtu.be/oeh2eblP1Uk",
        "A simple pani puri ragda recipe which anyone can quickly prepare\n\n**Ingredients**\n\n* Boiled Potatoes\n* Boiled white peas\n* Garam masala\n* Turmeric/Yellow food colour\n* Salt\n* Pani puri water\n\n**Process**\n\n1. Cut potatoes in smaller pieces\n2. Add potatoes and peas to the pan\n3. Add pani puri water to the pan and let this boil on medium flame, while the water boils mash the potatoes make sure you do not crush the peas too much\n4. Once the potatoes are mashed add some garam masala, turmeric/colour and some salt(Keep it less as pani puri water might already contain some salt)\n5. Mix this well and your ragda is ready, you can use some coriander if you like for garnishing\n\nSome people also like to add tomato to this, you can add it in the beginning with peas and potatoes."
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "noone cooks heres something prawns garlic cheese sauce saute kg cleaneddeveined prawns add tsp salt wait till color changes side take heat prawns get tough overcooked inch piece butter fry finely chopped cloves garlic garlic add tsp chilly flakes add cup water add cup cheese add salt taste let whole thing melt together sauce add teaspoon sugar half lemon juice add prawns simmer min done sauce coat prawns watery veg version try mushrooms boiled crispy fried potatoes experimented things lol recipe mushroom maggi boil water bowl add maggi noodles let cook another pot fry chopped onions garlic veggies choice coconut oil add mushrooms add bit chilli powder cook till mushrooms soft add half tastemaker packet saute add boiled noodles remaining tastemaker also add water boiled let cook garnish spring onions coriander leaves youre done recipe cheesepaneer maggi make maggi normally cooked dump slice cheese cover melts tastes heavenly paneer maggi make maggi normally cut paneer small cubes dry separately pan bit oilghee chilli powder add maggi cooked something always love cooking coz hella tasty chicken sukka southern dish take pan add ghee saute chopped onionsbig onion medium onions cooked tomatoes double quantity onions medium tomatoes half spoon ginger garlic paste saute tomatoes slightly mushy add chicken sukka powderthe one use srr chicken sukka powder store bought easily available cook bit add cut pieces chickeni use kg chicken breasts add ghee necessary ghee add tastier itll bei usually add gm ghee altogether add salt per taste cover cook lowmedium flame around minsdepends big small cut chicken check cooked add raw shredded coconut mix itll sweet add much add th rd cup last garnish coriander leaves youre done great thing one pot dish great easy recipes someone wants fry cooking ive tried theyre really nice paneer butter masala mushroom masala butter chicken channa masala ponder masala fry simple pani puri ragda recipe anyone quickly prepare ingredients boiled potatoes boiled white peas garam masala turmericyellow food colour salt pani puri water process cut potatoes smaller pieces add potatoes peas pan add pani puri water pan let boil medium flame water boils mash potatoes make sure crush peas much potatoes mashed add garam masala turmericcolour saltkeep less pani puri water might already contain salt mix well ragda ready use coriander like garnishing people also like add tomato add beginning peas potatoes",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "What noone cooks here? Here's something. Prawns in garlic cheese sauce. Saute 1/2 kg (cleaned/deveined) prawns. Add 1/2 tsp salt. Just wait till color changes on each side and take off the heat. Prawns get very tough if overcooked. In 1 inch piece of butter, fry 4 finely chopped cloves of garlic (more garlic is up to you). Add 1/2 tsp of chilly flakes, and then add 1/2 cup of water. Add 1/2 cup cheese. Add salt to taste, let the whole thing melt together into a sauce. Add 1/2 teaspoon of sugar and half a lemon juice. Then add the prawns, simmer for 1 to 2 min, done. The sauce should just coat the prawns, not be watery. For a veg version, try with mushrooms or (boiled and then crispy fried) potatoes. I experimented with few things lol **Recipe 1 Mushroom Maggi** Boil water in bowl and add Maggi noodles and let it cook. In another pot, fry chopped onions, garlic, veggies of your choice in a but of coconut oil. Add mushrooms. Add a bit of chilli powder and cook till mushrooms are soft. Add half the tastemaker packet and saute. Add the boiled noodles and the remaining tastemaker. You can also add the water in which it was boiled and let it cook. Garnish with some spring onions and coriander leaves and you're done **Recipe 2 Cheese/Paneer maggi** Make Maggi normally and when it's 90% cooked, just dump in a slice of cheese and cover it so it melts. It tastes heavenly. For the paneer Maggi, make Maggi normally and cut the paneer into small cubes and dry them separately in a pan with a bit of oil/ghee and chilli powder. Add them in when the Maggi is 90% cooked. This is something I always love cooking coz its hella tasty **Chicken sukka** It's a southern dish. Take a pan and add some ghee. Saute some chopped onions(1big onion or 2 medium) and then once the onions are cooked as some tomatoes(1.5 or double the quantity of onions so 3 medium tomatoes) and half a spoon of ginger garlic paste and saute. Once the tomatoes are slightly mushy, add the chicken sukka powder(The one I use is SRR chicken sukka powder. Store bought and easily available.) and cook it a bit. Then add cut pieces of chicken(I use 1/2 kg of chicken breasts). Add ghee if necessary. The more ghee you add the tastier it'll be(I usually add 75-100gm of ghee altogether). Add salt as per taste. Cover and cook on low-medium flame for around 10-15 mins(depends on how big or small you cut your chicken). Check in between once. Once it's 95% cooked, add some raw shredded coconut and mix it up. (It'll be sweet if you add too much so add 1/4th or 1/3rd cup?) At last garnish with coriander leaves and you're done. The great thing about this is, it's a one pot dish. Here are some great and easy recipes for someone who wants to fry out cooking. I've tried them myself and they're really nice Paneer butter masala Mushroom masala Butter chicken Channa masala Ponder masala fry A simple pani puri ragda recipe which anyone can quickly prepare **Ingredients** * Boiled Potatoes * Boiled white peas * Garam masala * Turmeric/Yellow food colour * Salt * Pani puri water **Process** 1. Cut potatoes in smaller pieces 2. Add potatoes and peas to the pan 3. Add pani puri water to the pan and let this boil on medium flame, while the water boils mash the potatoes make sure you do not crush the peas too much 4. Once the potatoes are mashed add some garam masala, turmeric/colour and some salt(Keep it less as pani puri water might already contain some salt) 5. Mix this well and your ragda is ready, you can use some coriander if you like for garnishing Some people also like to add tomato to this, you can add it in the beginning with peas and potatoes."
}