{
    "id": "tan4g4",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/tan4g4/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 19,
    "num_comments": 23,
    "created_utc": 1646875810,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Made a post earlier about this\n\nhttps://www.reddit.com/r/india/comments/t9ji9p/i_just_want_to_land_myself_in_a_wfh_part_time_job/",
        "I am looking for a completely remote/semi-remote job. Here's my current set of skills and work experience:\n\n* Experience with monitoring tools SolarWinds and SCOM, and New Relic with basic troubleshooting in Windows and Linux machines. \n\n* Monitored and maintained network infrastructure through alert and incident management.\n\n* Have experience in change management and problem management.\n\n* Comfortably able to co-ordinate with clients and vendors while dealing with support tickets and flow management.\n\nI am a team player and have consistently been the top performer in my current organization. I try to learn as much as humanely possible everyday and currently in the process of learning AWS. Please DM me if you have any opportunities for me.",
        "Yaaron any chance for a BBA person ? Any decent company that could offer a chance ?",
        "Looking for \n \n1) backend / fullstack dev with atleast 2+ year experience (Django)\n \n2) UX / UI people with 2+ year experience with good knowledge of UX, not just UI\n \nContact through pm for further details",
        "I am actively in pursuit of a Data Analyst /BA role with skills in data preparation, manipulation and visualisation on Python, Tableau, SQL and Excel. I have a year of relevant experience and available for relocation as well as remote work.",
        "Looking for any role that can take me out of Fund Accounting:-\n\n 1. 5 years work ex in Investment banking back office of an MNC\n\n2. Skills - Problem solving , Query Handling, Project management, Process Improvement, Testing\nCurrently trying to learn JIRA and how Project Management works.\n\n3.WFH from hometown. Open to relocate to Bangalore, Hyderabad,Gurgaon,Pune or continue working remotely\n\n4.Contact through PM\n\nP.S - I am from a non tech background, if you can advise me to get out of Finance industry and help me with what career path to choose and how. It will be of great help. Sorry I'm extremely directionless now and stuck in a low paying job",
        "dm me your email id",
        "Your current salary and expectations",
        "I am a student and looking to get hired. I don't have any experience but interested in content writing and poetry work of any",
        "Architecture freshman. Going to pass out this August looking for opportunities",
        "Potential Candidate \n\n3 years work experience in a F500 Bank as an Enterprise Data Architect.\nGraduated from a top tier institute (hired through placements)\n\nWorkstreams included, policy based analysis and corrections (regulatory and internal), Data Engineering (Drove multiple engineering projects and ensured skill development for the team to bring down TAT by 33%) \n\nNon work ex - have experience in running large policy/administrative efforts, in this case ran the Students Union for 2 years managing well over 100+ at a given time to ensure the well being of 2000+ students. \n\nLocation: Current office is in Hyderabad, open to relocate or work remotely. \n\nInterests: motorcycling, analytical deduction, trend analysis, systems thinking, sustainable and pro-climate ideology \n\nType of work I'm looking for: \n\ntransformation, Leadership, Innovation, Feedback oriented philosophy, Technology\n\nContact: please feel free to comment, DM and i can share my LinkedIn for verification",
        "I have worked as an Assurance Associate in the past in the consulting and advisory services industry.  I have experience in areas related to E-Discovery, Company Compliances, Contract Management, and Business Negotiations.  I am a strong professional with a BA.LL.B (H) focused on Banking, Corporate, Finance, and Securities Law from Amity Law School, Noida.   \nPractice Areas - \n- Anti-Money Laundering \n- Anti-Bribery and Corruption \n- Anti-Trust Laws \n- Tax Evasion \n- FCPA &amp; UK Bribery Act \n- Corporate Fraud and Misconduct \n- Banking &amp; Insurance Frauds  \n\nProminent Sectors - \n- Real Estate and Infrastructure \n- Government \n- Banking &amp; Insurance \n- Telecommunication \n- Fashion and Clothing \n- Tourism \n- Automobile\n\nPrevious organisations I have worked with -\n\n-EY (2 year)\n-Wipro ( currently working)\n\nEducation - BALLB &amp; MBA in finance .\n\nLocation : NCR or Mumbai .",
        "Please contact me via DM . \nI will share my Resume and LinkedIn profile for further verification.",
        "I am an English Language &amp; Literature tutor for grades 3 to 12, ICSE, IGCSE &amp; CBSE syllabus. \n\nCan tutor history, civics and geography too. \n\nPlease spread the word.",
        "Hiring for a Senior Data Scientist Position @ Bangalore. 3+ data science experience, core modeling profiles.",
        "I am a B.Sc graduate \nI want to do job in any private Bank\nPreferably location:- kolkata\nHow to get a job in a private bank?",
        "I saw an ad for trailhead on twitter. Can I learn Salesforce and get a well paying work from home job, or a job abroad, in say Dubai or Canada? I work in insurance for 12 lpa. Thanks.",
        "Put an ad on Justdial, Google etc. Which city are you from? Create an Instagram page targeting parents in big cities....",
        "Any idea when IBs revert back post Superdays in India? I had one with a bulge bracket IB and it’s been like a week now.",
        "Looking  for a Sales executive for Orthopaedic Implants or related Surgical Sales, or in the healthCare Industry.\nExperience 1-2 years.\nLocation is Mumbai ( would require travelling Pan India)\nDM me if interested"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "made post earlier looking completely remotesemiremote job heres current set skills work experience experience monitoring tools solarwinds scom new relic basic troubleshooting windows linux machines monitored maintained network infrastructure alert incident management experience change management problem management comfortably able coordinate clients vendors dealing support tickets flow management team player consistently top performer current organization try learn much humanely possible everyday currently process learning aws please dm opportunities yaaron chance bba person decent company could offer chance looking backend fullstack dev atleast year experience django ux ui people year experience good knowledge ux ui contact pm details actively pursuit data analyst ba role skills data preparation manipulation visualisation python tableau sql excel year relevant experience available relocation well remote work looking role take fund accounting years work ex investment banking back office mnc skills problem solving query handling project management process improvement testing currently trying learn jira project management works wfh hometown open relocate bangalore hyderabadgurgaonpune continue working remotely contact pm ps non tech background advise get finance industry help career path choose great help sorry im extremely directionless stuck low paying job dm email id current salary expectations student looking get hired dont experience interested content writing poetry work architecture freshman going pass august looking opportunities potential candidate years work experience f bank enterprise data architect graduated top tier institute hired placements workstreams included policy based analysis corrections regulatory internal data engineering drove multiple engineering projects ensured skill development team bring tat non work ex experience running large policyadministrative efforts case ran students union years managing well given time ensure well students location current office hyderabad open relocate work remotely interests motorcycling analytical deduction trend analysis systems thinking sustainable proclimate ideology type work im looking transformation leadership innovation feedback oriented philosophy technology contact please feel free comment dm share linkedin verification worked assurance associate past consulting advisory services industry experience areas related ediscovery company compliances contract management business negotiations strong professional ballb h focused banking corporate finance securities law amity law school noida practice areas antimoney laundering antibribery corruption antitrust laws tax evasion fcpa amp uk bribery act corporate fraud misconduct banking amp insurance frauds prominent sectors real estate infrastructure government banking amp insurance telecommunication fashion clothing tourism automobile previous organisations worked ey year wipro currently working education ballb amp mba finance location ncr mumbai please contact via dm share resume linkedin profile verification english language amp literature tutor grades icse igcse amp cbse syllabus tutor history civics geography please spread word hiring senior data scientist position bangalore data science experience core modeling profiles bsc graduate want job private bank preferably location kolkata get job private bank saw ad trailhead twitter learn salesforce get well paying work home job job abroad say dubai canada work insurance lpa thanks put ad justdial google etc city create instagram page targeting parents big cities idea ibs revert back post superdays india one bulge bracket ib like week looking sales executive orthopaedic implants related surgical sales healthcare industry experience years location mumbai would require travelling pan india dm interested",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Made a post earlier about this I am looking for a completely remote/semi-remote job. Here's my current set of skills and work experience: * Experience with monitoring tools SolarWinds and SCOM, and New Relic with basic troubleshooting in Windows and Linux machines. * Monitored and maintained network infrastructure through alert and incident management. * Have experience in change management and problem management. * Comfortably able to co-ordinate with clients and vendors while dealing with support tickets and flow management. I am a team player and have consistently been the top performer in my current organization. I try to learn as much as humanely possible everyday and currently in the process of learning AWS. Please DM me if you have any opportunities for me. Yaaron any chance for a BBA person ? Any decent company that could offer a chance ? Looking for 1) backend / fullstack dev with atleast 2+ year experience (Django) 2) UX / UI people with 2+ year experience with good knowledge of UX, not just UI Contact through pm for further details I am actively in pursuit of a Data Analyst /BA role with skills in data preparation, manipulation and visualisation on Python, Tableau, SQL and Excel. I have a year of relevant experience and available for relocation as well as remote work. Looking for any role that can take me out of Fund Accounting:- 1. 5 years work ex in Investment banking back office of an MNC 2. Skills - Problem solving , Query Handling, Project management, Process Improvement, Testing Currently trying to learn JIRA and how Project Management works. 3.WFH from hometown. Open to relocate to Bangalore, Hyderabad,Gurgaon,Pune or continue working remotely 4.Contact through PM P.S - I am from a non tech background, if you can advise me to get out of Finance industry and help me with what career path to choose and how. It will be of great help. Sorry I'm extremely directionless now and stuck in a low paying job dm me your email id Your current salary and expectations I am a student and looking to get hired. I don't have any experience but interested in content writing and poetry work of any Architecture freshman. Going to pass out this August looking for opportunities Potential Candidate 3 years work experience in a F500 Bank as an Enterprise Data Architect. Graduated from a top tier institute (hired through placements) Workstreams included, policy based analysis and corrections (regulatory and internal), Data Engineering (Drove multiple engineering projects and ensured skill development for the team to bring down TAT by 33%) Non work ex - have experience in running large policy/administrative efforts, in this case ran the Students Union for 2 years managing well over 100+ at a given time to ensure the well being of 2000+ students. Location: Current office is in Hyderabad, open to relocate or work remotely. Interests: motorcycling, analytical deduction, trend analysis, systems thinking, sustainable and pro-climate ideology Type of work I'm looking for: transformation, Leadership, Innovation, Feedback oriented philosophy, Technology Contact: please feel free to comment, DM and i can share my LinkedIn for verification I have worked as an Assurance Associate in the past in the consulting and advisory services industry. I have experience in areas related to E-Discovery, Company Compliances, Contract Management, and Business Negotiations. I am a strong professional with a BA.LL.B (H) focused on Banking, Corporate, Finance, and Securities Law from Amity Law School, Noida. Practice Areas - - Anti-Money Laundering - Anti-Bribery and Corruption - Anti-Trust Laws - Tax Evasion - FCPA &amp; UK Bribery Act - Corporate Fraud and Misconduct - Banking &amp; Insurance Frauds Prominent Sectors - - Real Estate and Infrastructure - Government - Banking &amp; Insurance - Telecommunication - Fashion and Clothing - Tourism - Automobile Previous organisations I have worked with - -EY (2 year) -Wipro ( currently working) Education - BALLB &amp; MBA in finance . Location : NCR or Mumbai . Please contact me via DM . I will share my Resume and LinkedIn profile for further verification. I am an English Language &amp; Literature tutor for grades 3 to 12, ICSE, IGCSE &amp; CBSE syllabus. Can tutor history, civics and geography too. Please spread the word. Hiring for a Senior Data Scientist Position @ Bangalore. 3+ data science experience, core modeling profiles. I am a B.Sc graduate I want to do job in any private Bank Preferably location:- kolkata How to get a job in a private bank? I saw an ad for trailhead on twitter. Can I learn Salesforce and get a well paying work from home job, or a job abroad, in say Dubai or Canada? I work in insurance for 12 lpa. Thanks. Put an ad on Justdial, Google etc. Which city are you from? Create an Instagram page targeting parents in big cities.... Any idea when IBs revert back post Superdays in India? I had one with a bulge bracket IB and it’s been like a week now. Looking for a Sales executive for Orthopaedic Implants or related Surgical Sales, or in the healthCare Industry. Experience 1-2 years. Location is Mumbai ( would require travelling Pan India) DM me if interested"
}