{
    "id": "k0mp38",
    "title": "Strengthening the Joint Parliamentary Committee process on the Personal Data Protection Bill, 2019",
    "url": "https://www.reddit.com/r/india/comments/k0mp38/strengthening_the_joint_parliamentary_committee/",
    "selftext": "https://preview.redd.it/27uao9xuwb161.png?width=1600&amp;format=png&amp;auto=webp&amp;s=1767517c5488695e7dcaf4cc3d5910d0ce8d5195\n\n### Tl;dr\n\nThe Joint Parliamentary Committee (JPC) for Personal Data Protection Bill, 2019 is considering a revolutionary legislative proposal. To strengthen its process we have requested for two things. First, we have humbly requested the Joint Parliamentary Committee to work within its mandate and not be distracted by extraneous issues such as content takedowns of Kunal Kamra's tweets. Second, to provide a fuller perspective, we have asked the Joint Parliamentary Committee to consider more consultations with civil society who at present are only 10% of the total number of witnesses examined for depositions.\n\n### Mandate of the Joint Parliamentary Committee\n\nThe Joint Parliamentary Committee (JPC) was constituted to examine The Personal Data Protection Bill, 2019 (PDPB). According to [**press reports**](https://www.medianama.com/2020/11/223-jpc-twitter-kunal-kamra-tweets-sflc-in-letter/), the Committee recently questioned the social media platform Twitter over a recent tweet by comedian Kunal Kamra on which the Ld. the Attorney General of India has granted consent for initiation of contempt proceedings.\n\nGiven the mandate and the volume of work to be considered by this Committee, such an action may fall beyond the ambit of the JPC. Further, the Standing Committee of Information Technology already exists and is more than capable of scrutinising such complex matters that involve issues of intermediary liability and content takedowns, it is better if such matter are left to the Standing Committee so that the JPC can fulfil the crucial task of providing a robust framework for the processing of data. This is a tremendous task and there are high public expectations that the JPC will act to safeagaurd user privacy through this path breaking legislation.\n\nRegardless, on the issue of takedowns, as at present there is an absence of a legal order requiring any such action as per the Shreya Singhal decision of the Supreme Court of India. We have witnessed such a situation Twitter itself before, as we noted in a joint letter  endorsed by 243 lawyers when Twitter took down a tweet by Shri Prashant Bhushan ([**link**](https://internetfreedom.in/joint-letter-to-twitter-about-removal-of-prashant-bhushan-tweets/)).\n\n### Need for more diverse consultations\n\nThe Personal Data Protection Bill, 2019 is an extremely important piece of legislation, and thus the holding of consultations with stakeholders is welcomed. However, as of 20th November 2020, of the 30 consultations held, 19 (63%) had been with industry bodies. Meanwhile, only 3 (10%) consultations have been held with a civil society organisation. Thus, we request the JPC that in the future it hold further consultations with academics, civil society, digital rights experts and organisations, and technologists.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ffcxqu6wwb161.png?width=480&amp;format=png&amp;auto=webp&amp;s=b4dda10f9674f18b4d66045155bc32e9c0fb2c72\n\nSuch groups can offer not only domain expertise but also a unique perspective on how best to regulate the processing of data beyond large technology companies or government departments. By helping the JPC understand how best to not only comprehensively protect the digital rights of the citizens but also ensure that social and economic justice are enshrined in our legislative framework, they can perform an important function and help build a more robust data protection law.\n\n*\\*Kindly note that the Letter dated November 24, 2020 contains an inadvertent error where the name of the chairperson should be spelt as, \"Meenakshi Lekhi\". We regret this but in all other respects the accuracy of the letter stands.*\n\n### Important Documents\n\n1. Our representation dated November 24, 2020 to the JPC on the Personal Data Protection Bill, 2019 submitting suggestions on improving process ([**link**](https://drive.google.com/file/d/1WN7zlNnxNUZ5Kjsv5xVKOEz7YBlpyYxM/view?usp=sharing))\n2. Our representation dated August 27, 2020 to the JPC on the Personal Data Protection Bill, 2019 to invite diverse stakeholders specially from the civil society sector ([**link**](https://internetfreedom.in/the-jpc-needs-to-invite-diverse-views-on-pdp-bill-saveourprivacy/))\n3. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf))\n\n[**We need your support and help to sustain our efforts in protecting your digital rights. We urge you to fund our work by making a one time donation or becoming an IFF member today!**](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 39,
    "num_comments": 0,
    "created_utc": 1606285224,
    "convurl": "https://b.thumbs.redditmedia.com/pMLZpPWkixyZD5K1f9WKF_FqnUFy3KD4GSx4uh6EUkE.jpg",
    "comments": [],
    "cleaned_text": "strengthening joint parliamentary committee process personal data protection bill tldr joint parliamentary committee jpc personal data protection bill considering revolutionary legislative proposal strengthen process requested two things first humbly requested joint parliamentary committee work within mandate distracted extraneous issues content takedowns kunal kamras tweets second provide fuller perspective asked joint parliamentary committee consider consultations civil society present total number witnesses examined depositions mandate joint parliamentary committee joint parliamentary committee jpc constituted examine personal data protection bill pdpb according press reportshttpswwwmedianamacomjpctwitterkunalkamratweetssflcinletter committee recently questioned social media platform twitter recent tweet comedian kunal kamra ld attorney general india granted consent initiation contempt proceedings given mandate volume work considered committee action may fall beyond ambit jpc standing committee information technology already exists capable scrutinising complex matters involve issues intermediary liability content takedowns better matter left standing committee jpc fulfil crucial task providing robust framework processing data tremendous task high public expectations jpc act safeagaurd user privacy path breaking legislation regardless issue takedowns present absence legal order requiring action per shreya singhal decision supreme court india witnessed situation twitter noted joint letter endorsed lawyers twitter took tweet shri prashant bhushan linkhttpsinternetfreedominjointlettertotwitteraboutremovalofprashantbhushantweets need diverse consultations personal data protection bill extremely important piece legislation thus holding consultations stakeholders welcomed however th november consultations held industry bodies meanwhile consultations held civil society organisation thus request jpc future hold consultations academics civil society digital rights experts organisations technologists ampxb groups offer domain expertise also unique perspective best regulate processing data beyond large technology companies government departments helping jpc understand best comprehensively protect digital rights citizens also ensure social economic justice enshrined legislative framework perform important function help build robust data protection law kindly note letter dated november contains inadvertent error name chairperson spelt meenakshi lekhi regret respects accuracy letter stands important documents representation dated november jpc personal data protection bill submitting suggestions improving process linkhttpsdrivegooglecomfiledwnzlnnxnuzkjsvxvkoezyblpyyxmviewuspsharing representation dated august jpc personal data protection bill invite diverse stakeholders specially civil society sector linkhttpsinternetfreedominthejpcneedstoinvitediverseviewsonpdpbillsaveourprivacy personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf need support help sustain efforts protecting digital rights urge fund work making one time donation becoming iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "strengthening joint parliamentary committee process personal data protection bill",
    "cleaned_selftext": "tldr joint parliamentary committee jpc personal data protection bill considering revolutionary legislative proposal strengthen process requested two things first humbly requested joint parliamentary committee work within mandate distracted extraneous issues content takedowns kunal kamras tweets second provide fuller perspective asked joint parliamentary committee consider consultations civil society present total number witnesses examined depositions mandate joint parliamentary committee joint parliamentary committee jpc constituted examine personal data protection bill pdpb according press reportshttpswwwmedianamacomjpctwitterkunalkamratweetssflcinletter committee recently questioned social media platform twitter recent tweet comedian kunal kamra ld attorney general india granted consent initiation contempt proceedings given mandate volume work considered committee action may fall beyond ambit jpc standing committee information technology already exists capable scrutinising complex matters involve issues intermediary liability content takedowns better matter left standing committee jpc fulfil crucial task providing robust framework processing data tremendous task high public expectations jpc act safeagaurd user privacy path breaking legislation regardless issue takedowns present absence legal order requiring action per shreya singhal decision supreme court india witnessed situation twitter noted joint letter endorsed lawyers twitter took tweet shri prashant bhushan linkhttpsinternetfreedominjointlettertotwitteraboutremovalofprashantbhushantweets need diverse consultations personal data protection bill extremely important piece legislation thus holding consultations stakeholders welcomed however th november consultations held industry bodies meanwhile consultations held civil society organisation thus request jpc future hold consultations academics civil society digital rights experts organisations technologists ampxb groups offer domain expertise also unique perspective best regulate processing data beyond large technology companies government departments helping jpc understand best comprehensively protect digital rights citizens also ensure social economic justice enshrined legislative framework perform important function help build robust data protection law kindly note letter dated november contains inadvertent error name chairperson spelt meenakshi lekhi regret respects accuracy letter stands important documents representation dated november jpc personal data protection bill submitting suggestions improving process linkhttpsdrivegooglecomfiledwnzlnnxnuzkjsvxvkoezyblpyyxmviewuspsharing representation dated august jpc personal data protection bill invite diverse stakeholders specially civil society sector linkhttpsinternetfreedominthejpcneedstoinvitediverseviewsonpdpbillsaveourprivacy personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf need support help sustain efforts protecting digital rights urge fund work making one time donation becoming iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Strengthening the Joint Parliamentary Committee process on the Personal Data Protection Bill, 2019",
    "light_cleaned_selftext": "### Tl;dr The Joint Parliamentary Committee (JPC) for Personal Data Protection Bill, 2019 is considering a revolutionary legislative proposal. To strengthen its process we have requested for two things. First, we have humbly requested the Joint Parliamentary Committee to work within its mandate and not be distracted by extraneous issues such as content takedowns of Kunal Kamra's tweets. Second, to provide a fuller perspective, we have asked the Joint Parliamentary Committee to consider more consultations with civil society who at present are only 10% of the total number of witnesses examined for depositions. ### Mandate of the Joint Parliamentary Committee The Joint Parliamentary Committee (JPC) was constituted to examine The Personal Data Protection Bill, 2019 (PDPB). According to [**press reports**](https://www.medianama.com/2020/11/223-jpc-twitter-kunal-kamra-tweets-sflc-in-letter/), the Committee recently questioned the social media platform Twitter over a recent tweet by comedian Kunal Kamra on which the Ld. the Attorney General of India has granted consent for initiation of contempt proceedings. Given the mandate and the volume of work to be considered by this Committee, such an action may fall beyond the ambit of the JPC. Further, the Standing Committee of Information Technology already exists and is more than capable of scrutinising such complex matters that involve issues of intermediary liability and content takedowns, it is better if such matter are left to the Standing Committee so that the JPC can fulfil the crucial task of providing a robust framework for the processing of data. This is a tremendous task and there are high public expectations that the JPC will act to safeagaurd user privacy through this path breaking legislation. Regardless, on the issue of takedowns, as at present there is an absence of a legal order requiring any such action as per the Shreya Singhal decision of the Supreme Court of India. We have witnessed such a situation Twitter itself before, as we noted in a joint letter endorsed by 243 lawyers when Twitter took down a tweet by Shri Prashant Bhushan ([**link**](https://internetfreedom.in/joint-letter-to-twitter-about-removal-of-prashant-bhushan-tweets/)). ### Need for more diverse consultations The Personal Data Protection Bill, 2019 is an extremely important piece of legislation, and thus the holding of consultations with stakeholders is welcomed. However, as of 20th November 2020, of the 30 consultations held, 19 (63%) had been with industry bodies. Meanwhile, only 3 (10%) consultations have been held with a civil society organisation. Thus, we request the JPC that in the future it hold further consultations with academics, civil society, digital rights experts and organisations, and technologists.  Such groups can offer not only domain expertise but also a unique perspective on how best to regulate the processing of data beyond large technology companies or government departments. By helping the JPC understand how best to not only comprehensively protect the digital rights of the citizens but also ensure that social and economic justice are enshrined in our legislative framework, they can perform an important function and help build a more robust data protection law. *\\*Kindly note that the Letter dated November 24, 2020 contains an inadvertent error where the name of the chairperson should be spelt as, \"Meenakshi Lekhi\". We regret this but in all other respects the accuracy of the letter stands.* ### Important Documents 1. Our representation dated November 24, 2020 to the JPC on the Personal Data Protection Bill, 2019 submitting suggestions on improving process ([**link**](https://drive.google.com/file/d/1WN7zlNnxNUZ5Kjsv5xVKOEz7YBlpyYxM/view?usp=sharing)) 2. Our representation dated August 27, 2020 to the JPC on the Personal Data Protection Bill, 2019 to invite diverse stakeholders specially from the civil society sector ([**link**](https://internetfreedom.in/the-jpc-needs-to-invite-diverse-views-on-pdp-bill-saveourprivacy/)) 3. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf)) [**We need your support and help to sustain our efforts in protecting your digital rights. We urge you to fund our work by making a one time donation or becoming an IFF member today!**](https://internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}