{
    "id": "16ri4p4",
    "title": "Another day another Flipkart Scam",
    "url": "https://www.reddit.com/r/india/comments/16ri4p4/another_day_another_flipkart_scam/",
    "selftext": "\nI purchased a New Mobile - Oneplus 9 5g 12gb 256 gb from Flipkart.com but recieved an Out of warranty and refurbished product whose warranty had already expired on 18/9/2022 which the Oneplus service centre informed me when I went there to confirm whether my product is used or not. They also informed me that the mobile box is not Genuine. After a google search about the seller I came to know that many people like me have already been scammed by this fraudulent seller. Now I have elaborated my whole issue to Flipkart along with the Jobsheet, audio recording of oneplus customer care, videos and photos of the product but they have not processed any refund/replacement yet and just keep saying that they will resolve the issue. Its been 2 days I can't use my newly bought phone and using my friends secondary phone. I bought the mobile with my hard earned money but they are just ignoring me. I am mentally stressed and totally devastated as 38k is a lot of amount for me. Please help me get my refund. Heres a video where I explain and show the mobile.\nhttps://youtu.be/tOSwZQfL_hc?si=9j8asacon3J_j7vC",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695615262.0,
    "convurl": "https://external-preview.redd.it/s9T6xuPavYwkA2QCkj7UtPJJFI2hVKWIpgjcOAgPq80.jpg?auto=webp&s=16d8fa881e12c3125e6da85ed99607f5f02bd0ec",
    "comments": [],
    "cleaned_text": "another day another flipkart scam purchased new mobile oneplus g gb gb flipkartcom recieved warranty refurbished product whose warranty already expired oneplus service centre informed went confirm whether product used also informed mobile box genuine google search seller came know many people like already scammed fraudulent seller elaborated whole issue flipkart along jobsheet audio recording oneplus customer care videos photos product processed refundreplacement yet keep saying resolve issue days cant use newly bought phone using friends secondary phone bought mobile hard earned money ignoring mentally stressed totally devastated k lot amount please help get refund heres video explain show mobile ",
    "cleaned_title": "another day another flipkart scam",
    "cleaned_selftext": "purchased new mobile oneplus g gb gb flipkartcom recieved warranty refurbished product whose warranty already expired oneplus service centre informed went confirm whether product used also informed mobile box genuine google search seller came know many people like already scammed fraudulent seller elaborated whole issue flipkart along jobsheet audio recording oneplus customer care videos photos product processed refundreplacement yet keep saying resolve issue days cant use newly bought phone using friends secondary phone bought mobile hard earned money ignoring mentally stressed totally devastated k lot amount please help get refund heres video explain show mobile",
    "cleaned_comments": "",
    "light_cleaned_title": "Another day another Flipkart Scam",
    "light_cleaned_selftext": "I purchased a New Mobile - Oneplus 9 5g 12gb 256 gb from Flipkart.com but recieved an Out of warranty and refurbished product whose warranty had already expired on 18/9/2022 which the Oneplus service centre informed me when I went there to confirm whether my product is used or not. They also informed me that the mobile box is not Genuine. After a google search about the seller I came to know that many people like me have already been scammed by this fraudulent seller. Now I have elaborated my whole issue to Flipkart along with the Jobsheet, audio recording of oneplus customer care, videos and photos of the product but they have not processed any refund/replacement yet and just keep saying that they will resolve the issue. Its been 2 days I can't use my newly bought phone and using my friends secondary phone. I bought the mobile with my hard earned money but they are just ignoring me. I am mentally stressed and totally devastated as 38k is a lot of amount for me. Please help me get my refund. Heres a video where I explain and show the mobile.",
    "light_cleaned_comments": ""
}