{
    "id": "12iault",
    "title": "HUGE Update | The Bombay HC has ordered MeitY to disclose the factual background that necessitated the IT Rules Amendments by April 19, which subjects ALL online content about the Central Govt. to be fact-checked by the Central Govt. itself!",
    "url": "https://www.reddit.com/r/india/comments/12iault/huge_update_the_bombay_hc_has_ordered_meity_to/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/5s8wedbc77ta1.png?width=1600&format=png&auto=webp&v=enabled&s=fec2b1a11cc40875d18735802fedef6a0548d504\n\n### tl;dr\n\nOn April 6, 2023, the Ministry of Electronics and Information Technology (MeitY) notified the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2023 (IT Amendment Rules, 2023). Among several provisions related to online gaming, it also contains a provision empowering a “fact check unit of the Central Government” to declare any content on the internet relating to “any business of the Central Government” as “fake or false or misleading” and order it to be taken down from the internet. Mr. Kunal Kamra, a political satirist and standup artist, filed a writ petition before the Bombay High Court challenging the constitutional validity of this provision of the IT Rules Amendment, 2023 for being *ultra vires* the Information Technology Act, 2000 (IT Act, 2000), and violating the right to freedom of speech and expression and the right to practice one’s trade and profession. The Bombay High Court has directed MeitY to file its response within one week on why the IT Amendment Rules, 2023 should not be stayed, and also describe the factual background that necessitated the issuance of the amendments.\n\n### Why should you care\n\nThe IT Rules, 2021 granted the government greater authority over digital news media platforms, OTT platforms, and social media intermediaries. However, MeitY has now amended IT Rules, 2021, and provided itself even broader powers of censorship of any content that it deems fake, false or misleading. Such a degree of regulation is highly susceptible to abuse and will strongly threaten press freedom by increasing censorship in India.\n\n### Background\n\nThe IT Amendment Rules, 2023 make significant changes to Rule 3(1)(b)(v) of the IT Rules, 2021 which governs due diligence requirements for intermediaries. The amendments require intermediaries to make “reasonable efforts” and ensure that their users do not upload or share any information about the Central Government, which is “identified as fake or false or misleading”. This will be determined unilaterally by a “fact check” unit to be appointed by the Central Government itself\n\nIf intermediaries are not in compliance with the due diligence requirements, they risk losing their safe harbour status under Section 79 of the IT Act, 2000.\n\n### The IT Amendment Rules, 2023 are unconstitutional\n\nMr. Kunal Kamra, political satirist and standup artist, has filed a writ petition before the Bombay HC challenging the constitutional validity of the IT Amendment Rules, 2023 on the following grounds:\n\n1. **Ultra vires Sec.79 of the IT Act, 2000**\\- In *Shreya Singhal v. Union of India*, the Supreme Court held that revocation of safe harbour for intermediaries must conform to subject matters laid down in Article 19(2).  “Fake or false or misleading ” content is not a ground enumerated in Art. 19(2) or Section 69A of the IT Act, 2000.\n2. **Violates the right to freedom of speech and expression under Article 19 (1)(a)** \\- The IT Amendment Rules, 2023 do not define the phrases “any business of the Central Government”; “fake or false or misleading”; or “reasonable efforts”. The phrase “any business of the Central Government'' is boundless and easily manipulated to include almost any aspect of modern life under a welfare state.  In *Shreya Singhal,* restrictions of freedom of speech and expression were held unconstitutional on the ground of vagueness and overbreadth, and for having a chilling effect on freedom of speech and expression. The Amendment will cause intermediaries to prioritize taking down any content flagged by the government's fact-checking unit rather than risking the loss of their safe harbour protections.\n3. **Does not satisfy reasonable restrictions on freedom of speech and expression under Article 19(2)** \\- Restrictions on speech must be justified within the parameters of Article 19(2) and cannot be based on grounds outside of it. ”Fake or false or misleading” content is not enumerated in Article 19(2).  Further, the IT Amendment Rules, 2023 do not satisfy the proportionality test that requires that the least restrictive alternative be chosen. There are several less restrictive alternatives available, such as issuing clarifications or corrections, specifically regarding information that the government deems incorrect in relation to its business, rather than requiring intermediaries to take down online content.\n4. **Violates the right to practice and trade or profession under Article 19 (1)(g)** \\- As a political satirist, Mr. Kamra relies on the internet's extensive outreach, particularly social media platforms, to disseminate his work. Subjecting their content to a capricious and biased \"fact check\" by a unit chosen by the Central Government would significantly curtail his capacity to partake in political satire. If the IT Amendment Rules, 2023 were applied to the creations of political satirists and comedians, their social media accounts might be deactivated or suspended, which would unjustly restrict their right to exercise their profession or trade.\n\n### Proceedings at the Bombay HC\n\nAfter the IT Amendment Rules, 2023 were notified on Thursday, April 6, 2023, Mr. Kamra reached out to us to challenge this unconstitutional provision. IFF filed this petition on Monday April 10, 2023 and mentioned the matter for urgent listing. A bench of the Bombay High Court comprisnig Justice Gautam Patel and Justice Neela Gokhale allowed the mentioning, and directed that the matter be listed on Tuesday, April 11, 2023.\n\nAfter hearing detailed submissions by Sr. Advocate Mr. Navroz Seervai appearing on behalf of Mr. Karma, and the counsel for the Respondent, the Bombay High Court has directed MeitY to file its response within one week on why the IT Amendment Rules, 2023 should not be stayed. Specifically, MeitY has been ordered to describe the factual background that necessitated the issuance of the amendments in its affidavit.\n\nThe affidavit has been ordered to be filed by April 19, 2023, and the next date of hearing in the matter is April 21. We will keep you updated on that day.\n\nWe will continue to provide legal support to Mr Kunal Kamra in their efforts to protect the right to speech and privacy of Indians on the internet. We are immensely grateful to Sr. Adv. Navroz Seervai for leading us in the matter. He was assisted by Advocates Arti Raghavan, Meenaz Kakalia, and the legal team from IFF comprising Gautam Bhatia, Vrinda Bhandari, Abhinav Sekhri, Tanmay Singh and Gayatri Malhotra.\n\n### Important Documents\n\n1. Writ petition in Kunal Kamra v. Union of India ([**Link**](https://drive.google.com/file/d/1geA71gYN-V0akSF2t2j6L8Z_W7KNwbTX/view?usp=sharing))",
    "flair": "Law & Courts",
    "score": 370,
    "num_comments": 27,
    "created_utc": 1681194020.0,
    "convurl": "https://b.thumbs.redditmedia.com/6eO6OtgWIXbyW0mi4WbXhHaRCh2m3_AoPYtzLHTSB4E.jpg",
    "comments": [
        "Keep doing the good work.",
        "Help us sustain the work we do, become an IFF member today or make a one-time donation. \n\nhttps://internetfreedom.in/donate",
        "Yes this is a ridiculous rule.",
        "Coming up next: any tweets & posts about Salman Khan must be fact-checked by .... Salman Khan.",
        "Why u need my pan number?",
        "Obviously they need the PAN number to show their external auditors that the donors are legitimate individuals. Every NGO undergoes an audit annually. If they receive suspicious sums of money that is unaccountable, then it becomes a problem.",
        "hello u/Lonelyguy999\n\nIndian laws require us to collect the PAN details of all our donors. If you have any other queries, please drop them here in the thread or shoot us an email at [donate@internetfreedom.in](mailto:donate@internetfreedom.in)",
        "its time r/india does a fundraiser campaign for IFF",
        "👉👈 mods, are you listening?",
        "How dare you auntyNashnuls question the honesty of the govt?!! 🤣🤣",
        "While political parties don’t have to disclose who their donors are.",
        "A comedian doing the work of opposition",
        "Ache din",
        "Based Kunal Kamra and IFF",
        "We should ask this to our family and friends who voted for such acche din.",
        "Bro this kamra guy is a really decent person behind the scenes. More power to him",
        "Thank you for the detailed post !",
        "Great work guys! Hope the Court grants a stay.",
        "And opposition is doing comedian's work",
        "Electoral bonds would be the biggest issue for months in any mature democracy.",
        "The entire opposition is so frail and has turned into a massive running joke.",
        "India is no more a mature democracy.",
        "Can someone explain this in simpler words?",
        "Political parties dont because if the party you sopport loses, the winning politician can take out a vendetta against you. \n\nAlteast thats the thought process..."
    ],
    "cleaned_text": "huge update bombay hc ordered meity disclose factual background necessitated rules amendments april subjects online content central govt factchecked central govt xb tldr april ministry electronics information technology meity notified information technology intermediary guidelines digital media ethics code amendment rules amendment rules among several provisions related online gaming also contains provision empowering fact check unit central government declare content internet relating business central government fake false misleading order taken internet mr kunal kamra political satirist standup artist filed writ petition bombay high court challenging constitutional validity provision rules amendment ultra vires information technology act act violating right freedom speech expression right practice ones trade profession bombay high court directed meity file response within one week amendment rules stayed also describe factual background necessitated issuance amendments care rules granted government greater authority digital news media platforms ott platforms social media intermediaries however meity amended rules provided even broader powers censorship content deems fake false misleading degree regulation highly susceptible abuse strongly threaten press freedom increasing censorship india background amendment rules make significant changes rule bv rules governs due diligence requirements intermediaries amendments require intermediaries make reasonable efforts ensure users upload share information central government identified fake false misleading determined unilaterally fact check unit appointed central government intermediaries compliance due diligence requirements risk losing safe harbour status section act amendment rules unconstitutional mr kunal kamra political satirist standup artist filed writ petition bombay hc challenging constitutional validity amendment rules following grounds ultra vires sec act shreya singhal v union india supreme court held revocation safe harbour intermediaries must conform subject matters laid article fake false misleading content ground enumerated art section act violates right freedom speech expression article amendment rules define phrases business central government fake false misleading reasonable efforts phrase business central government boundless easily manipulated include almost aspect modern life welfare state shreya singhal restrictions freedom speech expression held unconstitutional ground vagueness overbreadth chilling effect freedom speech expression amendment cause intermediaries prioritize taking content flagged governments factchecking unit rather risking loss safe harbour protections satisfy reasonable restrictions freedom speech expression article restrictions speech must justified within parameters article based grounds outside fake false misleading content enumerated article amendment rules satisfy proportionality test requires least restrictive alternative chosen several less restrictive alternatives available issuing clarifications corrections specifically regarding information government deems incorrect relation business rather requiring intermediaries take online content violates right practice trade profession article g political satirist mr kamra relies internets extensive outreach particularly social media platforms disseminate work subjecting content capricious biased fact check unit chosen central government would significantly curtail capacity partake political satire amendment rules applied creations political satirists comedians social media accounts might deactivated suspended would unjustly restrict right exercise profession trade proceedings bombay hc amendment rules notified thursday april mr kamra reached us challenge unconstitutional provision iff filed petition monday april mentioned matter urgent listing bench bombay high court comprisnig justice gautam patel justice neela gokhale allowed mentioning directed matter listed tuesday april hearing detailed submissions sr advocate mr navroz seervai appearing behalf mr karma counsel respondent bombay high court directed meity file response within one week amendment rules stayed specifically meity ordered describe factual background necessitated issuance amendments affidavit affidavit ordered filed april next date hearing matter april keep updated day continue provide legal support mr kunal kamra efforts protect right speech privacy indians internet immensely grateful sr adv navroz seervai leading us matter assisted advocates arti raghavan meenaz kakalia legal team iff comprising gautam bhatia vrinda bhandari abhinav sekhri tanmay singh gayatri malhotra important documents writ petition kunal kamra v union india linkhttpsdrivegooglecomfiledgeagynvaksftjlzwknwbtxviewuspsharing ",
    "cleaned_title": "huge update bombay hc ordered meity disclose factual background necessitated rules amendments april subjects online content central govt factchecked central govt",
    "cleaned_selftext": "xb tldr april ministry electronics information technology meity notified information technology intermediary guidelines digital media ethics code amendment rules amendment rules among several provisions related online gaming also contains provision empowering fact check unit central government declare content internet relating business central government fake false misleading order taken internet mr kunal kamra political satirist standup artist filed writ petition bombay high court challenging constitutional validity provision rules amendment ultra vires information technology act act violating right freedom speech expression right practice ones trade profession bombay high court directed meity file response within one week amendment rules stayed also describe factual background necessitated issuance amendments care rules granted government greater authority digital news media platforms ott platforms social media intermediaries however meity amended rules provided even broader powers censorship content deems fake false misleading degree regulation highly susceptible abuse strongly threaten press freedom increasing censorship india background amendment rules make significant changes rule bv rules governs due diligence requirements intermediaries amendments require intermediaries make reasonable efforts ensure users upload share information central government identified fake false misleading determined unilaterally fact check unit appointed central government intermediaries compliance due diligence requirements risk losing safe harbour status section act amendment rules unconstitutional mr kunal kamra political satirist standup artist filed writ petition bombay hc challenging constitutional validity amendment rules following grounds ultra vires sec act shreya singhal v union india supreme court held revocation safe harbour intermediaries must conform subject matters laid article fake false misleading content ground enumerated art section act violates right freedom speech expression article amendment rules define phrases business central government fake false misleading reasonable efforts phrase business central government boundless easily manipulated include almost aspect modern life welfare state shreya singhal restrictions freedom speech expression held unconstitutional ground vagueness overbreadth chilling effect freedom speech expression amendment cause intermediaries prioritize taking content flagged governments factchecking unit rather risking loss safe harbour protections satisfy reasonable restrictions freedom speech expression article restrictions speech must justified within parameters article based grounds outside fake false misleading content enumerated article amendment rules satisfy proportionality test requires least restrictive alternative chosen several less restrictive alternatives available issuing clarifications corrections specifically regarding information government deems incorrect relation business rather requiring intermediaries take online content violates right practice trade profession article g political satirist mr kamra relies internets extensive outreach particularly social media platforms disseminate work subjecting content capricious biased fact check unit chosen central government would significantly curtail capacity partake political satire amendment rules applied creations political satirists comedians social media accounts might deactivated suspended would unjustly restrict right exercise profession trade proceedings bombay hc amendment rules notified thursday april mr kamra reached us challenge unconstitutional provision iff filed petition monday april mentioned matter urgent listing bench bombay high court comprisnig justice gautam patel justice neela gokhale allowed mentioning directed matter listed tuesday april hearing detailed submissions sr advocate mr navroz seervai appearing behalf mr karma counsel respondent bombay high court directed meity file response within one week amendment rules stayed specifically meity ordered describe factual background necessitated issuance amendments affidavit affidavit ordered filed april next date hearing matter april keep updated day continue provide legal support mr kunal kamra efforts protect right speech privacy indians internet immensely grateful sr adv navroz seervai leading us matter assisted advocates arti raghavan meenaz kakalia legal team iff comprising gautam bhatia vrinda bhandari abhinav sekhri tanmay singh gayatri malhotra important documents writ petition kunal kamra v union india linkhttpsdrivegooglecomfiledgeagynvaksftjlzwknwbtxviewuspsharing",
    "cleaned_comments": "keep good work help us sustain work become iff member today make onetime donation yes ridiculous rule coming next tweets posts salman khan must factchecked salman khan u need pan number obviously need pan number show external auditors donors legitimate individuals every ngo undergoes audit annually receive suspicious sums money unaccountable becomes problem hello ulonelyguy indian laws require us collect pan details donors queries please drop thread shoot us email donateinternetfreedominmailtodonateinternetfreedomin time rindia fundraiser campaign iff mods listening dare auntynashnuls question honesty govt political parties dont disclose donors comedian work opposition ache din based kunal kamra iff ask family friends voted acche din bro kamra guy really decent person behind scenes power thank detailed post great work guys hope court grants stay opposition comedians work electoral bonds would biggest issue months mature democracy entire opposition frail turned massive running joke india mature democracy someone explain simpler words political parties dont party sopport loses winning politician take vendetta alteast thats thought process",
    "light_cleaned_title": "HUGE Update | The Bombay HC has ordered MeitY to disclose the factual background that necessitated the IT Rules Amendments by April 19, which subjects ALL online content about the Central Govt. to be fact-checked by the Central Govt. itself!",
    "light_cleaned_selftext": "&#x200B; ### tl;dr On April 6, 2023, the Ministry of Electronics and Information Technology (MeitY) notified the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2023 (IT Amendment Rules, 2023). Among several provisions related to online gaming, it also contains a provision empowering a “fact check unit of the Central Government” to declare any content on the internet relating to “any business of the Central Government” as “fake or false or misleading” and order it to be taken down from the internet. Mr. Kunal Kamra, a political satirist and standup artist, filed a writ petition before the Bombay High Court challenging the constitutional validity of this provision of the IT Rules Amendment, 2023 for being *ultra vires* the Information Technology Act, 2000 (IT Act, 2000), and violating the right to freedom of speech and expression and the right to practice one’s trade and profession. The Bombay High Court has directed MeitY to file its response within one week on why the IT Amendment Rules, 2023 should not be stayed, and also describe the factual background that necessitated the issuance of the amendments. ### Why should you care The IT Rules, 2021 granted the government greater authority over digital news media platforms, OTT platforms, and social media intermediaries. However, MeitY has now amended IT Rules, 2021, and provided itself even broader powers of censorship of any content that it deems fake, false or misleading. Such a degree of regulation is highly susceptible to abuse and will strongly threaten press freedom by increasing censorship in India. ### Background The IT Amendment Rules, 2023 make significant changes to Rule 3(1)(b)(v) of the IT Rules, 2021 which governs due diligence requirements for intermediaries. The amendments require intermediaries to make “reasonable efforts” and ensure that their users do not upload or share any information about the Central Government, which is “identified as fake or false or misleading”. This will be determined unilaterally by a “fact check” unit to be appointed by the Central Government itself If intermediaries are not in compliance with the due diligence requirements, they risk losing their safe harbour status under Section 79 of the IT Act, 2000. ### The IT Amendment Rules, 2023 are unconstitutional Mr. Kunal Kamra, political satirist and standup artist, has filed a writ petition before the Bombay HC challenging the constitutional validity of the IT Amendment Rules, 2023 on the following grounds: 1. **Ultra vires Sec.79 of the IT Act, 2000**\\- In *Shreya Singhal v. Union of India*, the Supreme Court held that revocation of safe harbour for intermediaries must conform to subject matters laid down in Article 19(2). “Fake or false or misleading ” content is not a ground enumerated in Art. 19(2) or Section 69A of the IT Act, 2000. 2. **Violates the right to freedom of speech and expression under Article 19 (1)(a)** \\- The IT Amendment Rules, 2023 do not define the phrases “any business of the Central Government”; “fake or false or misleading”; or “reasonable efforts”. The phrase “any business of the Central Government'' is boundless and easily manipulated to include almost any aspect of modern life under a welfare state. In *Shreya Singhal,* restrictions of freedom of speech and expression were held unconstitutional on the ground of vagueness and overbreadth, and for having a chilling effect on freedom of speech and expression. The Amendment will cause intermediaries to prioritize taking down any content flagged by the government's fact-checking unit rather than risking the loss of their safe harbour protections. 3. **Does not satisfy reasonable restrictions on freedom of speech and expression under Article 19(2)** \\- Restrictions on speech must be justified within the parameters of Article 19(2) and cannot be based on grounds outside of it. ”Fake or false or misleading” content is not enumerated in Article 19(2). Further, the IT Amendment Rules, 2023 do not satisfy the proportionality test that requires that the least restrictive alternative be chosen. There are several less restrictive alternatives available, such as issuing clarifications or corrections, specifically regarding information that the government deems incorrect in relation to its business, rather than requiring intermediaries to take down online content. 4. **Violates the right to practice and trade or profession under Article 19 (1)(g)** \\- As a political satirist, Mr. Kamra relies on the internet's extensive outreach, particularly social media platforms, to disseminate his work. Subjecting their content to a capricious and biased \"fact check\" by a unit chosen by the Central Government would significantly curtail his capacity to partake in political satire. If the IT Amendment Rules, 2023 were applied to the creations of political satirists and comedians, their social media accounts might be deactivated or suspended, which would unjustly restrict their right to exercise their profession or trade. ### Proceedings at the Bombay HC After the IT Amendment Rules, 2023 were notified on Thursday, April 6, 2023, Mr. Kamra reached out to us to challenge this unconstitutional provision. IFF filed this petition on Monday April 10, 2023 and mentioned the matter for urgent listing. A bench of the Bombay High Court comprisnig Justice Gautam Patel and Justice Neela Gokhale allowed the mentioning, and directed that the matter be listed on Tuesday, April 11, 2023. After hearing detailed submissions by Sr. Advocate Mr. Navroz Seervai appearing on behalf of Mr. Karma, and the counsel for the Respondent, the Bombay High Court has directed MeitY to file its response within one week on why the IT Amendment Rules, 2023 should not be stayed. Specifically, MeitY has been ordered to describe the factual background that necessitated the issuance of the amendments in its affidavit. The affidavit has been ordered to be filed by April 19, 2023, and the next date of hearing in the matter is April 21. We will keep you updated on that day. We will continue to provide legal support to Mr Kunal Kamra in their efforts to protect the right to speech and privacy of Indians on the internet. We are immensely grateful to Sr. Adv. Navroz Seervai for leading us in the matter. He was assisted by Advocates Arti Raghavan, Meenaz Kakalia, and the legal team from IFF comprising Gautam Bhatia, Vrinda Bhandari, Abhinav Sekhri, Tanmay Singh and Gayatri Malhotra. ### Important Documents 1. Writ petition in Kunal Kamra v. Union of India ([**Link**](https://drive.google.com/file/d/1geA71gYN-V0akSF2t2j6L8Z_W7KNwbTX/view?usp=sharing))",
    "light_cleaned_comments": "Keep doing the good work. Help us sustain the work we do, become an IFF member today or make a one-time donation. Yes this is a ridiculous rule. Coming up next: any tweets & posts about Salman Khan must be fact-checked by .... Salman Khan. Why u need my pan number? Obviously they need the PAN number to show their external auditors that the donors are legitimate individuals. Every NGO undergoes an audit annually. If they receive suspicious sums of money that is unaccountable, then it becomes a problem. hello u/Lonelyguy999 Indian laws require us to collect the PAN details of all our donors. If you have any other queries, please drop them here in the thread or shoot us an email at [donate@internetfreedom.in](mailto:donate@internetfreedom.in) its time r/india does a fundraiser campaign for IFF 👉👈 mods, are you listening? How dare you auntyNashnuls question the honesty of the govt?!! 🤣🤣 While political parties don’t have to disclose who their donors are. A comedian doing the work of opposition Ache din Based Kunal Kamra and IFF We should ask this to our family and friends who voted for such acche din. Bro this kamra guy is a really decent person behind the scenes. More power to him Thank you for the detailed post ! Great work guys! Hope the Court grants a stay. And opposition is doing comedian's work Electoral bonds would be the biggest issue for months in any mature democracy. The entire opposition is so frail and has turned into a massive running joke. India is no more a mature democracy. Can someone explain this in simpler words? Political parties dont because if the party you sopport loses, the winning politician can take out a vendetta against you. Alteast thats the thought process..."
}