{
    "id": "1envjy8",
    "title": "Exposed: How a 5-Star Real Estate Project Turned into a Horror Story",
    "url": "https://www.reddit.com/r/india/comments/1envjy8/exposed_how_a_5star_real_estate_project_turned/",
    "selftext": "Hey, Reddit fam, We need some serious advice/help here!\n\nWe invested in what we thought was a dream project – two 3 BHK apartments (3011 & 3081) in [Leela Residences at Bhartiya City, Bangalore](https://imgur.com/a/oecuwTv), managed by the reputed Leela Hotels. But what we’ve experienced is nothing short of a horror story. Even nearly three years after OC from BBMP (Bangalore's Municipal Authority), from non-existent electricity connections (yes, the building is running on borrowed electricity from Leela Hotel) to falling ceilings, incomplete amenities and endless legal battles, we're at our wits' end. The authorities are either oblivious or complicit.\n\nOur lawyer thoroughly checked the documents including the Occupancy Certificate (OC) before investing but the OC itself turned out to be misleading. Do we trust these govt. issued documents, or do we need to investigate even the government documents? In any case, here's our rant!\n\n# Background\n\n* Developer: Bhartiya Urban Private Limited\n* Location: Bhartiya City, Thanisandra, North Bangalore (125-acre project)\n* Project: Leela Residences – 176 apartments managed by Leela Hotels\n* Attractions: Managed by Leela Hotels and [claimed to be living in your own 5-star hotel](https://www.youtube.com/watch?v=t10CiVq5jdk&t=425s). Additionally, a mall and multiplex are in the same compound.\n* This property's [OC was issued in January 2022](https://drive.google.com/file/d/11IqegUmcVAh0QEmIhugrGjE4ialIuSfg/view), so it's been close to 3 years. (OC is issued after the project is completed and ready for occupation!). Read below with that context in mind.\n\n# Our Nightmare\n\nEven though none of these issues (in isolation) is severe, they are cumulative, and we failed to convince the authorities or the developer to address them.\n\n* Electricity Woes: No BESCOM connection for two years! We've been running on hotel power and generators. Frequent power trips and appliance damage are regular occurrences. Our [electricity bill is issued on Leela Hotels letterhead](https://drive.google.com/file/d/1DlFAcIx5iYSrFfTyho3p5fS7FPTY5Q-s/view) with an illegal 18% GST. BBMP knows but ignores!\n* Access Road Issues: A 125-acre development does not have a proper road. The main road (is private property) and the other is a narrow back road through a village (which is also apparently under litigation). We have yet to digest how the developer hid something so fundamental, if not trying to cheat. There are IG posts/videos (search \"Namma Bangalore Bhartiya mall Trespassers\" on Google) and [another reddit post](https://op.reddit.com/r/bangalore/comments/11zr2q0/land_owner_holds_township_ransom/) on this topic. How did the authorities permit such a project?\n* Dropping Ceilings: On Dec 31, 2023, a roof section collapsed from ten floors above and fell on the mall's pavement. See these pictures: [one](https://drive.google.com/drive/folders/1lHMFllwf__7auDWQkCauYdy9G2zml4oC) and [two](https://drive.google.com/drive/folders/1lHMFllwf__7auDWQkCauYdy9G2zml4oC). A couple escaped by a split second.\n* Incomplete Construction: Despite having an Occupancy Certificate (which means everything is completed) that is three years old, the [Penthouses in Tower B are under construction as of August 2024](https://www.youtube.com/watch?v=L0F60bY5bg0), and this is the [condition of the clubhouse as of August 2024](https://youtu.be/rGrwYzYwdMg). Even the building facade is incomplete after three years ([incomplete](https://imgur.com/a/5lDZe07) photo and [completed look](https://imgur.com/a/o2hm5M1)). What exactly is BBMP doing?\n* Lifts: The lifts stop working when it rains. There were two incidents where the lift had free fall of 1-2 floors. Even as of 9/8/24 the lifts in Tower B stopped working - reasons aside, such occurrences are way too frequent. Hearsay: the developer is skimping by not paying for something as basic an AMC for lifts.\n* Waterlogging: These were our lobbies (managed by Leela Hotels!) when the rainwater[ flooded the residences](https://www.youtube.com/shorts/hmSWma3pHhs) (a few months back).\n* Park Lies: The advertised 7-acre park has shrunk to less than half, with new office buildings encroaching. The brochure clearly states 7 acres; even on 08/08/24, [Google results show the same](https://imgur.com/lOQo0Hj). All marketing says, \"7 acre park\" and the developer just mentioned \"park\" in the agreement. Are we screwed?\n* Shoddy Materials: Windows that leak air and water (agreement promises double-glazed but worse than locally made), patched-up marble floors ([promised](https://drive.google.com/file/d/1ZlrMuVM7-fKjl42OgCOH7NdW55nvHl36/view?usp=drive_link) vs [actual](https://drive.google.com/file/d/1LNlIH3ORI1WQVjJkI5ToEL3GyF3qTCOS/view?usp=drive_link)), and fake marble counters in bathrooms (agreement promises marble counters, but the developer wants us to accept cheap plywood).\n* No Gas NOC: The apartment promised piped gas, but apparently Gail did not oblige due to a lack of adherence to norms. So, the condo provides gas via [gas cylinders stored on the premises](https://youtube.com/shorts/JQhdW-ySecc?feature=share), which need special NOC but is not there. Both KSFES and BBMP are aware of this but have taken no action.\n\n# What We’ve Done\n\n* Before we purchased, we had a lawyer look through the documents. Based on the documents, things seemed acceptable, but the documents turned out to be misleading. Law says OC means everything has been checked and the building is fit for occupation, but reality seemed different.\n* Escalated to Developer: We sent numerous emails to the CRM team, then to the CEO, and finally to the Chairman. There was no substantial response, so we had to continue the legal route.\n* More than 20 of fellow resident owners sent a letter to management, but the issues have not been completely resolved. Here is the [letter issued over six months ago](https://drive.google.com/file/d/1_Ro2eIXaHTNd5UVkRUCTFlM9HX6orW4w/view), but there has been no action so far.\n* Legal Action: Filed a RERA case (unsuccessful outcome) with all the information we had. The unfavourable order was in spite of [RERA's Engineers report](https://drive.google.com/file/d/1Uks4nwxoVaFOdd4c_grWrKw2zxWGAfGi/view?usp=drive_link) that apartments are not complete, and also recording that Developer obstructed inspection of amenities. An appeal is pending with the High Court, which also granted an injunction on the apartment sale (for which we are grateful!).\n* Developer’s Response: Ignoring us, threatening prolonged legal battles, and trying to force us to accept subpar conditions and withdraw our cases (or face the delay in courts). (Note: they recently issued a cancellation letter on false grounds to harass us. We challenged in the high court)\n\n# Blatant apathy of authorities\n\n* BBMP – OC issued despite ongoing penthouse construction, no BESCOM connection, incomplete façade, flouting of fire (KSFES) norms, incomplete clubhouse, and pool having no OC.\n* Fire Department – how was NOC issued when norms for Gas piping and storage were not followed?\n* Lift (Department of Electrical Inspectorate) – How can lift freefall on multiple occasions if the inspection was done thoroughly?\n* RERA – How was completion status granted without a completion certificate, BESCOM sanction letter, inadequate NOC, or NOC for lifts? Even despite a written complaint, how was it ignored?\n* Leela Hotels – How did Leela Hotels lend their brand without due diligence?\n\n# Current Situation\n\n* Our 75% deposit is still with the developer, along with both apartments. To further harass us, the developer has even issued a cancellation letter with a 1 crore penalty.\n* We are struggling with ongoing legal battles and relentless mental harassment.\n* It has become clear that the developer is well-versed in navigating legal cases and working with the authorities. Despite this, we trust that the truth will ultimately prevail.\n* As a last resort, given that the developer has spared no effort in trying to intimidate us, we are taking to social media to expose their tactics, make them accountable, and seek advice on how to resolve this situation.\n\n# How can you help?\n\nWe trust the legal and judicial system and following due process. However, we have been made aware that things take its own time (to the developer's advantage). Please share if you've faced similar issues or have any advice on tackling such fraud.\n\n* Any social media contacts to amplify the message\n* Any media contacts (digital or print)\n* Any specific legal approach that may have worked\n* Any government contacts\n\n# How can you avoid this mess?\n\ntl;dr \"devil is in the details\"\n\nBefore investing in Nikoo Homes or any other project, always request for:\n\n* Spend on a decent lawyer to get title check done.\n* Detailed specifications for materials (instead of vague terms like 'imported' or 'similar brand'), verify specifics for critical infrastructure such as road width and park size (park can be 7 acres or 70 sft!)\n* Insist on key documents such as the Fire clearance, Completion certificate, Deed of Declaration, KSPCB clearance, BESCOM NOC, BESCOM Load Sanction Letter (this is different from NOC) as necessary.\n* Speak to owners from same project and other projects completed by that developer.\n* Ensure that all promises the developer makes are clearly documented and legally binding.\n* Verify access points and other essential amenities to avoid future disputes.",
    "flair": "Rant / Vent",
    "score": 24,
    "num_comments": 4,
    "created_utc": 1723196458,
    "convurl": "https://external-preview.redd.it/tFTJ1Zb1MnhLxt7SIXN1ALS7sAhitohTJtG8GHTlGJE.jpg?auto=webp&s=fd19f7d2749f2a47b5e788ca2f9952e307a9815e",
    "comments": [
        "Identify their current projects and tag those so that prospective buyers can see this nightmare. Reputational damage from public awareness may be the only persuasive factor here.",
        "Forgive my ignorance. I do not know how to tag their projects. However, these are the projects currently being sold by them - Nikoo Homes 4, Nikoo Homes 5 and Nikoo Homes 6.\n\n  \nWe did legal diligence, and the documents were in order. We did not check if the OC was given as per the rules or not.",
        "It would seem prudent to verify by inspecting the property than by relying on documents and assurances. It is a standard practice in some countries, for the buyer to pay for an inspection before making final payment to builder. Because, if something goes wrong, the burden falls on the buyer and it's very stressful, especially if it's your primary residence. It is unfortunate for you that a reputed brand is indulging in unethical business practices.",
        "We did all that:\n\n  \n1. Before paying in advance - we did legal due diligence.\n\n2. As the handover date neared  - we employed a professional agency that provided a list of snags, but the developer is refusing to fix those. After we approached RERA, the developer sent cancellation letter to harass us (thankfully, we got High court to grant an injunction)"
    ],
    "cleaned_text": "exposed star real estate project turned horror story hey reddit fam need serious advicehelp invested thought dream project two bhk apartments leela residences bhartiya city bangalorehttpsimgurcomaoecuwtv managed reputed leela hotels weve experienced nothing short horror story even nearly three years oc bbmp bangalores municipal authority nonexistent electricity connections yes building running borrowed electricity leela hotel falling ceilings incomplete amenities endless legal battles wits end authorities either oblivious complicit lawyer thoroughly checked documents including occupancy certificate oc investing oc turned misleading trust govt issued documents need investigate even government documents case heres rant background developer bhartiya urban private limited location bhartiya city thanisandra north bangalore acre project project leela residences apartments managed leela hotels attractions managed leela hotels claimed living star hotelhttpswwwyoutubecomwatchvtcivqjdkts additionally mall multiplex compound propertys oc issued january httpsdrivegooglecomfilediqegumcvahqemihugrgjeialiusfgview close years oc issued project completed ready occupation read context mind nightmare even though none issues isolation severe cumulative failed convince authorities developer address electricity woes bescom connection two years weve running hotel power generators frequent power trips appliance damage regular occurrences electricity bill issued leela hotels letterheadhttpsdrivegooglecomfileddlfacixiysrfftyhopfsfptyqsview illegal gst bbmp knows ignores access road issues acre development proper road main road private property narrow back road village also apparently litigation yet digest developer hid something fundamental trying cheat ig postsvideos search namma bangalore bhartiya mall trespassers google another reddit posthttpsopredditcomrbangalorecommentszrqlandownerholdstownshipransom topic authorities permit project dropping ceilings dec roof section collapsed ten floors fell malls pavement see pictures onehttpsdrivegooglecomdrivefolderslhmfllwfaudwqkcauydygzmloc twohttpsdrivegooglecomdrivefolderslhmfllwfaudwqkcauydygzmloc couple escaped split second incomplete construction despite occupancy certificate means everything completed three years old penthouses tower b construction august httpswwwyoutubecomwatchvlfbybg condition clubhouse august httpsyoutubergrwyzywdmg even building facade incomplete three years incompletehttpsimgurcomaldze photo completed lookhttpsimgurcomaohmm exactly bbmp lifts lifts stop working rains two incidents lift free fall floors even lifts tower b stopped working reasons aside occurrences way frequent hearsay developer skimping paying something basic amc lifts waterlogging lobbies managed leela hotels rainwater flooded residenceshttpswwwyoutubecomshortshmswmaphhs months back park lies advertised acre park shrunk less half new office buildings encroaching brochure clearly states acres even google results show samehttpsimgurcomloqohj marketing says acre park developer mentioned park agreement screwed shoddy materials windows leak air water agreement promises doubleglazed worse locally made patchedup marble floors promisedhttpsdrivegooglecomfiledzlrmuvmfkjlogcohndwnvhlviewuspdrivelink vs actualhttpsdrivegooglecomfiledlnlihoriwqvjjkitoelgyfqtcosviewuspdrivelink fake marble counters bathrooms agreement promises marble counters developer wants us accept cheap plywood gas noc apartment promised piped gas apparently gail oblige due lack adherence norms condo provides gas via gas cylinders stored premiseshttpsyoutubecomshortsjqhdwyseccfeatureshare need special noc ksfes bbmp aware taken action weve done purchased lawyer look documents based documents things seemed acceptable documents turned misleading law says oc means everything checked building fit occupation reality seemed different escalated developer sent numerous emails crm team ceo finally chairman substantial response continue legal route fellow resident owners sent letter management issues completely resolved letter issued six months agohttpsdrivegooglecomfiledroeixahtnduvkructflmhxorwwview action far legal action filed rera case unsuccessful outcome information unfavourable order spite reras engineers reporthttpsdrivegooglecomfileduksnwxovafoddcgrwrkwzxwgafgiviewuspdrivelink apartments complete also recording developer obstructed inspection amenities appeal pending high court also granted injunction apartment sale grateful developers response ignoring us threatening prolonged legal battles trying force us accept subpar conditions withdraw cases face delay courts note recently issued cancellation letter false grounds harass us challenged high court blatant apathy authorities bbmp oc issued despite ongoing penthouse construction bescom connection incomplete faade flouting fire ksfes norms incomplete clubhouse pool oc fire department noc issued norms gas piping storage followed lift department electrical inspectorate lift freefall multiple occasions inspection done thoroughly rera completion status granted without completion certificate bescom sanction letter inadequate noc noc lifts even despite written complaint ignored leela hotels leela hotels lend brand without due diligence current situation deposit still developer along apartments harass us developer even issued cancellation letter crore penalty struggling ongoing legal battles relentless mental harassment become clear developer wellversed navigating legal cases working authorities despite trust truth ultimately prevail last resort given developer spared effort trying intimidate us taking social media expose tactics make accountable seek advice resolve situation help trust legal judicial system following due process however made aware things take time developers advantage please share youve faced similar issues advice tackling fraud social media contacts amplify message media contacts digital print specific legal approach may worked government contacts avoid mess tldr devil details investing nikoo homes project always request spend decent lawyer get title check done detailed specifications materials instead vague terms like imported similar brand verify specifics critical infrastructure road width park size park acres sft insist key documents fire clearance completion certificate deed declaration kspcb clearance bescom noc bescom load sanction letter different noc necessary speak owners project projects completed developer ensure promises developer makes clearly documented legally binding verify access points essential amenities avoid future disputes ",
    "cleaned_title": "exposed star real estate project turned horror story",
    "cleaned_selftext": "hey reddit fam need serious advicehelp invested thought dream project two bhk apartments leela residences bhartiya city bangalorehttpsimgurcomaoecuwtv managed reputed leela hotels weve experienced nothing short horror story even nearly three years oc bbmp bangalores municipal authority nonexistent electricity connections yes building running borrowed electricity leela hotel falling ceilings incomplete amenities endless legal battles wits end authorities either oblivious complicit lawyer thoroughly checked documents including occupancy certificate oc investing oc turned misleading trust govt issued documents need investigate even government documents case heres rant background developer bhartiya urban private limited location bhartiya city thanisandra north bangalore acre project project leela residences apartments managed leela hotels attractions managed leela hotels claimed living star hotelhttpswwwyoutubecomwatchvtcivqjdkts additionally mall multiplex compound propertys oc issued january httpsdrivegooglecomfilediqegumcvahqemihugrgjeialiusfgview close years oc issued project completed ready occupation read context mind nightmare even though none issues isolation severe cumulative failed convince authorities developer address electricity woes bescom connection two years weve running hotel power generators frequent power trips appliance damage regular occurrences electricity bill issued leela hotels letterheadhttpsdrivegooglecomfileddlfacixiysrfftyhopfsfptyqsview illegal gst bbmp knows ignores access road issues acre development proper road main road private property narrow back road village also apparently litigation yet digest developer hid something fundamental trying cheat ig postsvideos search namma bangalore bhartiya mall trespassers google another reddit posthttpsopredditcomrbangalorecommentszrqlandownerholdstownshipransom topic authorities permit project dropping ceilings dec roof section collapsed ten floors fell malls pavement see pictures onehttpsdrivegooglecomdrivefolderslhmfllwfaudwqkcauydygzmloc twohttpsdrivegooglecomdrivefolderslhmfllwfaudwqkcauydygzmloc couple escaped split second incomplete construction despite occupancy certificate means everything completed three years old penthouses tower b construction august httpswwwyoutubecomwatchvlfbybg condition clubhouse august httpsyoutubergrwyzywdmg even building facade incomplete three years incompletehttpsimgurcomaldze photo completed lookhttpsimgurcomaohmm exactly bbmp lifts lifts stop working rains two incidents lift free fall floors even lifts tower b stopped working reasons aside occurrences way frequent hearsay developer skimping paying something basic amc lifts waterlogging lobbies managed leela hotels rainwater flooded residenceshttpswwwyoutubecomshortshmswmaphhs months back park lies advertised acre park shrunk less half new office buildings encroaching brochure clearly states acres even google results show samehttpsimgurcomloqohj marketing says acre park developer mentioned park agreement screwed shoddy materials windows leak air water agreement promises doubleglazed worse locally made patchedup marble floors promisedhttpsdrivegooglecomfiledzlrmuvmfkjlogcohndwnvhlviewuspdrivelink vs actualhttpsdrivegooglecomfiledlnlihoriwqvjjkitoelgyfqtcosviewuspdrivelink fake marble counters bathrooms agreement promises marble counters developer wants us accept cheap plywood gas noc apartment promised piped gas apparently gail oblige due lack adherence norms condo provides gas via gas cylinders stored premiseshttpsyoutubecomshortsjqhdwyseccfeatureshare need special noc ksfes bbmp aware taken action weve done purchased lawyer look documents based documents things seemed acceptable documents turned misleading law says oc means everything checked building fit occupation reality seemed different escalated developer sent numerous emails crm team ceo finally chairman substantial response continue legal route fellow resident owners sent letter management issues completely resolved letter issued six months agohttpsdrivegooglecomfiledroeixahtnduvkructflmhxorwwview action far legal action filed rera case unsuccessful outcome information unfavourable order spite reras engineers reporthttpsdrivegooglecomfileduksnwxovafoddcgrwrkwzxwgafgiviewuspdrivelink apartments complete also recording developer obstructed inspection amenities appeal pending high court also granted injunction apartment sale grateful developers response ignoring us threatening prolonged legal battles trying force us accept subpar conditions withdraw cases face delay courts note recently issued cancellation letter false grounds harass us challenged high court blatant apathy authorities bbmp oc issued despite ongoing penthouse construction bescom connection incomplete faade flouting fire ksfes norms incomplete clubhouse pool oc fire department noc issued norms gas piping storage followed lift department electrical inspectorate lift freefall multiple occasions inspection done thoroughly rera completion status granted without completion certificate bescom sanction letter inadequate noc noc lifts even despite written complaint ignored leela hotels leela hotels lend brand without due diligence current situation deposit still developer along apartments harass us developer even issued cancellation letter crore penalty struggling ongoing legal battles relentless mental harassment become clear developer wellversed navigating legal cases working authorities despite trust truth ultimately prevail last resort given developer spared effort trying intimidate us taking social media expose tactics make accountable seek advice resolve situation help trust legal judicial system following due process however made aware things take time developers advantage please share youve faced similar issues advice tackling fraud social media contacts amplify message media contacts digital print specific legal approach may worked government contacts avoid mess tldr devil details investing nikoo homes project always request spend decent lawyer get title check done detailed specifications materials instead vague terms like imported similar brand verify specifics critical infrastructure road width park size park acres sft insist key documents fire clearance completion certificate deed declaration kspcb clearance bescom noc bescom load sanction letter different noc necessary speak owners project projects completed developer ensure promises developer makes clearly documented legally binding verify access points essential amenities avoid future disputes",
    "cleaned_comments": "identify current projects tag prospective buyers see nightmare reputational damage public awareness may persuasive factor forgive ignorance know tag projects however projects currently sold nikoo homes nikoo homes nikoo homes legal diligence documents order check oc given per rules would seem prudent verify inspecting property relying documents assurances standard practice countries buyer pay inspection making final payment builder something goes wrong burden falls buyer stressful especially primary residence unfortunate reputed brand indulging unethical business practices paying advance legal due diligence handover date neared employed professional agency provided list snags developer refusing fix approached rera developer sent cancellation letter harass us thankfully got high court grant injunction",
    "light_cleaned_title": "Exposed: How a 5-Star Real Estate Project Turned into a Horror Story",
    "light_cleaned_selftext": "Hey, Reddit fam, We need some serious advice/help here! We invested in what we thought was a dream project – two 3 BHK apartments (3011 & 3081) in [Leela Residences at Bhartiya City, Bangalore](https://imgur.com/a/oecuwTv), managed by the reputed Leela Hotels. But what we’ve experienced is nothing short of a horror story. Even nearly three years after OC from BBMP (Bangalore's Municipal Authority), from non-existent electricity connections (yes, the building is running on borrowed electricity from Leela Hotel) to falling ceilings, incomplete amenities and endless legal battles, we're at our wits' end. The authorities are either oblivious or complicit. Our lawyer thoroughly checked the documents including the Occupancy Certificate (OC) before investing but the OC itself turned out to be misleading. Do we trust these govt. issued documents, or do we need to investigate even the government documents? In any case, here's our rant! # Background * Developer: Bhartiya Urban Private Limited * Location: Bhartiya City, Thanisandra, North Bangalore (125-acre project) * Project: Leela Residences – 176 apartments managed by Leela Hotels * Attractions: Managed by Leela Hotels and [claimed to be living in your own 5-star hotel](https://www.youtube.com/watch?v=t10CiVq5jdk&t=425s). Additionally, a mall and multiplex are in the same compound. * This property's [OC was issued in January 2022](https://drive.google.com/file/d/11IqegUmcVAh0QEmIhugrGjE4ialIuSfg/view), so it's been close to 3 years. (OC is issued after the project is completed and ready for occupation!). Read below with that context in mind. # Our Nightmare Even though none of these issues (in isolation) is severe, they are cumulative, and we failed to convince the authorities or the developer to address them. * Electricity Woes: No BESCOM connection for two years! We've been running on hotel power and generators. Frequent power trips and appliance damage are regular occurrences. Our [electricity bill is issued on Leela Hotels letterhead](https://drive.google.com/file/d/1DlFAcIx5iYSrFfTyho3p5fS7FPTY5Q-s/view) with an illegal 18% GST. BBMP knows but ignores! * Access Road Issues: A 125-acre development does not have a proper road. The main road (is private property) and the other is a narrow back road through a village (which is also apparently under litigation). We have yet to digest how the developer hid something so fundamental, if not trying to cheat. There are IG posts/videos (search \"Namma Bangalore Bhartiya mall Trespassers\" on Google) and [another reddit post](https://op.reddit.com/r/bangalore/comments/11zr2q0/land_owner_holds_township_ransom/) on this topic. How did the authorities permit such a project? * Dropping Ceilings: On Dec 31, 2023, a roof section collapsed from ten floors above and fell on the mall's pavement. See these pictures: [one](https://drive.google.com/drive/folders/1lHMFllwf__7auDWQkCauYdy9G2zml4oC) and [two](https://drive.google.com/drive/folders/1lHMFllwf__7auDWQkCauYdy9G2zml4oC). A couple escaped by a split second. * Incomplete Construction: Despite having an Occupancy Certificate (which means everything is completed) that is three years old, the [Penthouses in Tower B are under construction as of August 2024](https://www.youtube.com/watch?v=L0F60bY5bg0), and this is the [condition of the clubhouse as of August 2024](https://youtu.be/rGrwYzYwdMg). Even the building facade is incomplete after three years ([incomplete](https://imgur.com/a/5lDZe07) photo and [completed look](https://imgur.com/a/o2hm5M1)). What exactly is BBMP doing? * Lifts: The lifts stop working when it rains. There were two incidents where the lift had free fall of 1-2 floors. Even as of 9/8/24 the lifts in Tower B stopped working - reasons aside, such occurrences are way too frequent. Hearsay: the developer is skimping by not paying for something as basic an AMC for lifts. * Waterlogging: These were our lobbies (managed by Leela Hotels!) when the rainwater[ flooded the residences](https://www.youtube.com/shorts/hmSWma3pHhs) (a few months back). * Park Lies: The advertised 7-acre park has shrunk to less than half, with new office buildings encroaching. The brochure clearly states 7 acres; even on 08/08/24, [Google results show the same](https://imgur.com/lOQo0Hj). All marketing says, \"7 acre park\" and the developer just mentioned \"park\" in the agreement. Are we screwed? * Shoddy Materials: Windows that leak air and water (agreement promises double-glazed but worse than locally made), patched-up marble floors ([promised](https://drive.google.com/file/d/1ZlrMuVM7-fKjl42OgCOH7NdW55nvHl36/view?usp=drive_link) vs [actual](https://drive.google.com/file/d/1LNlIH3ORI1WQVjJkI5ToEL3GyF3qTCOS/view?usp=drive_link)), and fake marble counters in bathrooms (agreement promises marble counters, but the developer wants us to accept cheap plywood). * No Gas NOC: The apartment promised piped gas, but apparently Gail did not oblige due to a lack of adherence to norms. So, the condo provides gas via [gas cylinders stored on the premises](https://youtube.com/shorts/JQhdW-ySecc?feature=share), which need special NOC but is not there. Both KSFES and BBMP are aware of this but have taken no action. # What We’ve Done * Before we purchased, we had a lawyer look through the documents. Based on the documents, things seemed acceptable, but the documents turned out to be misleading. Law says OC means everything has been checked and the building is fit for occupation, but reality seemed different. * Escalated to Developer: We sent numerous emails to the CRM team, then to the CEO, and finally to the Chairman. There was no substantial response, so we had to continue the legal route. * More than 20 of fellow resident owners sent a letter to management, but the issues have not been completely resolved. Here is the [letter issued over six months ago](https://drive.google.com/file/d/1_Ro2eIXaHTNd5UVkRUCTFlM9HX6orW4w/view), but there has been no action so far. * Legal Action: Filed a RERA case (unsuccessful outcome) with all the information we had. The unfavourable order was in spite of [RERA's Engineers report](https://drive.google.com/file/d/1Uks4nwxoVaFOdd4c_grWrKw2zxWGAfGi/view?usp=drive_link) that apartments are not complete, and also recording that Developer obstructed inspection of amenities. An appeal is pending with the High Court, which also granted an injunction on the apartment sale (for which we are grateful!). * Developer’s Response: Ignoring us, threatening prolonged legal battles, and trying to force us to accept subpar conditions and withdraw our cases (or face the delay in courts). (Note: they recently issued a cancellation letter on false grounds to harass us. We challenged in the high court) # Blatant apathy of authorities * BBMP – OC issued despite ongoing penthouse construction, no BESCOM connection, incomplete façade, flouting of fire (KSFES) norms, incomplete clubhouse, and pool having no OC. * Fire Department – how was NOC issued when norms for Gas piping and storage were not followed? * Lift (Department of Electrical Inspectorate) – How can lift freefall on multiple occasions if the inspection was done thoroughly? * RERA – How was completion status granted without a completion certificate, BESCOM sanction letter, inadequate NOC, or NOC for lifts? Even despite a written complaint, how was it ignored? * Leela Hotels – How did Leela Hotels lend their brand without due diligence? # Current Situation * Our 75% deposit is still with the developer, along with both apartments. To further harass us, the developer has even issued a cancellation letter with a 1 crore penalty. * We are struggling with ongoing legal battles and relentless mental harassment. * It has become clear that the developer is well-versed in navigating legal cases and working with the authorities. Despite this, we trust that the truth will ultimately prevail. * As a last resort, given that the developer has spared no effort in trying to intimidate us, we are taking to social media to expose their tactics, make them accountable, and seek advice on how to resolve this situation. # How can you help? We trust the legal and judicial system and following due process. However, we have been made aware that things take its own time (to the developer's advantage). Please share if you've faced similar issues or have any advice on tackling such fraud. * Any social media contacts to amplify the message * Any media contacts (digital or print) * Any specific legal approach that may have worked * Any government contacts # How can you avoid this mess? tl;dr \"devil is in the details\" Before investing in Nikoo Homes or any other project, always request for: * Spend on a decent lawyer to get title check done. * Detailed specifications for materials (instead of vague terms like 'imported' or 'similar brand'), verify specifics for critical infrastructure such as road width and park size (park can be 7 acres or 70 sft!) * Insist on key documents such as the Fire clearance, Completion certificate, Deed of Declaration, KSPCB clearance, BESCOM NOC, BESCOM Load Sanction Letter (this is different from NOC) as necessary. * Speak to owners from same project and other projects completed by that developer. * Ensure that all promises the developer makes are clearly documented and legally binding. * Verify access points and other essential amenities to avoid future disputes.",
    "light_cleaned_comments": "Identify their current projects and tag those so that prospective buyers can see this nightmare. Reputational damage from public awareness may be the only persuasive factor here. Forgive my ignorance. I do not know how to tag their projects. However, these are the projects currently being sold by them - Nikoo Homes 4, Nikoo Homes 5 and Nikoo Homes 6. We did legal diligence, and the documents were in order. We did not check if the OC was given as per the rules or not. It would seem prudent to verify by inspecting the property than by relying on documents and assurances. It is a standard practice in some countries, for the buyer to pay for an inspection before making final payment to builder. Because, if something goes wrong, the burden falls on the buyer and it's very stressful, especially if it's your primary residence. It is unfortunate for you that a reputed brand is indulging in unethical business practices. We did all that: 1. Before paying in advance - we did legal due diligence. 2. As the handover date neared - we employed a professional agency that provided a list of snags, but the developer is refusing to fix those. After we approached RERA, the developer sent cancellation letter to harass us (thankfully, we got High court to grant an injunction)"
}