{
    "id": "166ywvl",
    "title": "Sharing #mystory - This is what happens if one refuses to pay a HUGE bribe in India!",
    "url": "https://www.reddit.com/r/india/comments/166ywvl/sharing_mystory_this_is_what_happens_if_one/",
    "selftext": "I have been pursuing the update our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka).\n\nLast year, an agent working with the revenue department officials approached me and asked for a HUGE fee - amount ranging from ₹10-15 lakhs! ([my story in Times of India](https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-5-years-after-court-direction-to-deputy-commissioner-man-still-awaits-khata/articleshow/92713420.cms)) \n\nAs the officials dragged their feet, I took the matter to Karnataka High Court. The honorable court passed an order in my favour on 28 March 2023\n\nWhen officials still refused to act per the order on time, my lawyer filed a contempt of court against the Bangalore Urban Deputy Commissioner (DC). The Karnataka High Court has issued a \n\n# Contempt of Court Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023\n\nSome might argue that I could/should simply have paid the damn bribe and moved on. \n\nBut why?!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693548186.0,
    "convurl": "https://external-preview.redd.it/NhXebUw5gwSsq25iVbqNn_USzIZzoONTHEnV4IlTlQk.jpg?auto=webp&amp;s=9f4c958bc8244e1ae8a6942608750e8fbfb4eb67",
    "comments": [
        "Details of \n# Contempt of Court [Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023 (link)](https://twitter.com/PetitionIssue/status/1697096822261727434)"
    ],
    "cleaned_text": "sharing mystory happens one refuses pay huge bribe india pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka last year agent working revenue department officials approached asked huge fee amount ranging lakhs story times indiahttpstimesofindiaindiatimescomcitybengalurubengaluruyearsaftercourtdirectiontodeputycommissionermanstillawaitskhataarticleshowcms officials dragged feet took matter karnataka high court honorable court passed order favour march officials still refused act per order time lawyer filed contempt court bangalore urban deputy commissioner dc karnataka high court issued contempt court notice bengaluru urban deputy commissioner revenue department aug might argue couldshould simply paid damn bribe moved ",
    "cleaned_title": "sharing mystory happens one refuses pay huge bribe india",
    "cleaned_selftext": "pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka last year agent working revenue department officials approached asked huge fee amount ranging lakhs story times indiahttpstimesofindiaindiatimescomcitybengalurubengaluruyearsaftercourtdirectiontodeputycommissionermanstillawaitskhataarticleshowcms officials dragged feet took matter karnataka high court honorable court passed order favour march officials still refused act per order time lawyer filed contempt court bangalore urban deputy commissioner dc karnataka high court issued contempt court notice bengaluru urban deputy commissioner revenue department aug might argue couldshould simply paid damn bribe moved",
    "cleaned_comments": "details contempt court notice bengaluru urban deputy commissioner revenue department aug linkhttpstwittercompetitionissuestatus",
    "light_cleaned_title": "Sharing #mystory - This is what happens if one refuses to pay a HUGE bribe in India!",
    "light_cleaned_selftext": "I have been pursuing the update our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka). Last year, an agent working with the revenue department officials approached me and asked for a HUGE fee - amount ranging from ₹10-15 lakhs! ([my story in Times of India](https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-5-years-after-court-direction-to-deputy-commissioner-man-still-awaits-khata/articleshow/92713420.cms)) As the officials dragged their feet, I took the matter to Karnataka High Court. The honorable court passed an order in my favour on 28 March 2023 When officials still refused to act per the order on time, my lawyer filed a contempt of court against the Bangalore Urban Deputy Commissioner (DC). The Karnataka High Court has issued a # Contempt of Court Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023 Some might argue that I could/should simply have paid the damn bribe and moved on. But why?!",
    "light_cleaned_comments": "Details of # Contempt of Court [Notice to Bengaluru Urban Deputy Commissioner & Revenue Department on 14 Aug 2023 (link)](https://twitter.com/PetitionIssue/status/1697096822261727434)"
}