{
    "id": "ls00eh",
    "title": "Latest Draft Intermediary Rules: Fixing big tech, by breaking our digital rights?",
    "url": "https://www.reddit.com/r/india/comments/ls00eh/latest_draft_intermediary_rules_fixing_big_tech/",
    "selftext": "https://preview.redd.it/i2rdqs12hkj61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=b887864f6e1190b4364585f4edf7dea33abe59da\n\n## tl;dr\n\nHere we will provide you with information about everything that has happened and is happening with the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021. We provide you a quick rundown on its contentious history, the need for starting afresh on this vital conversation about platform accountability and also an analysis of the present draft of the rules. Given that it seeks to now even regulate digital news platforms and OTT content providers, we recommend a fresh consultation and greater transparency. Several proposals in their present form suffer from unconstitutionality and will undermine free expression and privacy for internet users in India.\n\n## A controversial past\n\nJust to be clear, we believe that social media is broken. The large platforms owe us accountability and user rights. But a recent draft government proposal we have accessed makes this problem worse. It will increase censorship and reduce user privacy. Before we get into the specifics of the proposal, let us just do a quick recap of the history of this issue.\n\nOn December 24, 2018, the[ **Indian Express**](https://indianexpress.com/article/india/it-act-amendments-data-privacy-freedom-of-speech-fb-twitter-5506572/) first broke the news about a “confidential” meeting in which proposed amendments to the rules under Section 79 of the Information Technology Act, 2000 (IT Act) were discussed. Section 79 of the IT Act provides what is called a ‘safe harbour’ to intermediaries who host user generated content and exempts them from liability for the actions of users on their platform if they adhere to guidelines prescribed by the government. The existing guidelines that intermediaries are required to comply with are present under the [**Information Technology (Intermediaries Guidelines) Rules, 2011**](https://www.meity.gov.in/writereaddata/files/GSR314E_10511%281%29_0.pdf) but the government has been contemplating changes to these guidelines since December 2018.\n\nAfter we learnt about the private meeting between government officials and company representatives regarding amendments to the guidelines for intermediary liability, we made available a[ **complete copy of the draft rules**](https://drive.google.com/file/d/1ong2rw-WeYzS-9eMNCP0R3yn9srfiXBb/view?usp=sharing) because there was [**substantial public interest at stake**](https://internetfreedom.in/india-must-resist-the-lure-of-the-chinese-model-of-surveillance-and-censorship-intermediaryrules-righttomeme-saveourprivacy/).  While, at first, the Ministry of Electronics and Information Technology (MeitY) denied any knowledge of any such meeting and the proposed changes, they subsequently acknowledged them and initiated a public consultation.\n\nhttps://preview.redd.it/zoj0igm3hkj61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=9c0d9b943e82d3b8d934fb9c0f5882edbd7b6f00\n\n## Flawed consultation\n\nShortly after this, MeitY announced a[ **public consultation**](http://meity.gov.in/content/comments-suggestions-invited-draft-%E2%80%9C-information-technology-intermediary-guidelines) on the proposed changes. These were proposals to make changes to the liability exemptions for online platforms or service providers. An intermediary is any service provider which transmits, hosts and publishes user content without exercising editorial control over the content like traditional publishers do. So it can be your ISP, email provider, social media platform, or any web-service which allows you to post, upload and publish. These platforms because of their technical ability to connect us to others, host our data, publish it, help us realise our freedom of speech, they mediate our online experience, impact our privacy and hold great power.\n\nWe feared this exercise was expending energy and resources on the basis of draft legal rules that lack any clear rationale that has been articulated by MeitY. The proposals themselves were substantively harmful to our fundamental rights to freedom of speech and privacy as we explained in [**our submissions**](https://drive.google.com/open?id=1pDQt1M81spH66kv0CHcUk8P9U_Dp9_oc). We instead advocated for a fresh start and urged the government to first publish a white paper which clearly identified the problems it seeks to solve through the proposed amendments.\n\n## Pending litigation\n\nOne of the contentious provisions which had been proposed by MeitY in the December 2018 version and which also features in the latest 2021 version of the draft Rules relates to traceability of originators of information on the internet, The issue of traceability of originators of information on messaging platforms is also the [**subject of litigation**](https://internetfreedom.in/facebooks-transfer-petition-in-madras-hc-case-involving-encryption-and-traceability-allowed-after-tamil-nadu-government-withdraws-objections/) before the Supreme Court in *Antony Clement Rubin v. Union of India (T.C. Civil No.189 of 2020)*. This case originated as  a [**PIL before the Madras High Court**](https://internetfreedom.in/aadhaar-linking/) seeking linking of Aadhaar with social media accounts. However, during the course of hearings before the Madras High Court, the focus shifted to traceability of originators of information on end to end encrypted platforms such as WhatsApp, and the case was later transferred to the Supreme Court.\n\nIFF is an intervenor in this case and we have filed an [**independent expert report**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/) authored by Dr. Manoj Prabhakaran, Professor of Computer Science and Engineering at IIT Bombay, which explains the long term ineffectiveness of proposals to facilitate traceability on end to end encrypted platforms. Prof. Prabhakaran's report is in addition to our written submissions  which highlight that any attempts to weaken encryption through backdoors or key escrow systems would undermine the privacy and security of all users because these vulnerabilities could be exploited by criminals as well.\n\nhttps://preview.redd.it/ztl54yx5hkj61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=6ffc4157c108701e72788fe696cd8a3b948e7b9f\n\n## Draft Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021\n\nRecently, there were multiple disquieting media reports (see [**here**](https://www.hindustantimes.com/india-news/ib-ministry-works-on-self-regulation-law-for-ott-platforms-and-digital-media-101610774195596.html) and [**here**](https://timesofindia.indiatimes.com/india/government-examines-ott-regulations-in-foreign-countries/articleshow/80376346.cms)) about possible legislation to regulate OTT platforms which stream curated content such as Netflix, Amazon Prime, Hotstar etc. This is especially concerning after a recent controversy over the web series Tandav (see [**here**](https://www.thehindu.com/news/cities/mumbai/tandav-controversy-ib-ministry-seeks-explanation-from-amazon-prime-video/article33595435.ece) and [**here**](https://www.thehindu.com/news/national/other-states/one-more-fir-against-amazon-primes-tandav/article33612281.ece)), which is the latest in a long line of incidents in which there was public outcry over a perceived slight to religious beliefs. Acting on this the Information and Broadcasting Union Minister Prakash Javadekar has recently [**stated**](https://www.indiatoday.in/binge-watch/story/i-b-ministry-to-issue-guidelines-for-ott-platforms-after-tandav-row-prakash-javadekar-1764444-2021-01-31) that guidelines for OTT platforms are being considered by the Government.\n\nIt seems that from December, 2018 to February, 2021 the Draft Intermediaries Rules, 2018 have now transformed into the [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing).\n\nActing in public interest, just like we had released a prior December 2018 version of these Rules and a proposal to amend Section 66A, we are today releasing a [**copy of the**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) to the public and calling for a public consultation since these amendments will impact the fundamental rights of all Indian internet users.\n\n## “Regulation” of Video Streaming Platforms\n\nThe first of the three big changes we are highlighting is the regulation of OTT and news media platforms through proxy. We find this grossly unconstitutional. The draft IT Rules, 2021 have, in the Appendix to the Rules defined a “Code Of Ethics And Procedure And Safeguards In Relation To Digital/Online Media” which shall apply on “applicable entities”. “Applicable entities” as contained in Rule 7 include, “publishers of news and current affairs content”; and “intermediaries which primarily enable the transmission of news and current affairs content”; and “publishers of online curated content”; and, “intermediaries which primarily enable the transmission of online curated content.”\n\nFurther, under sub-rule (3) of Rule 8, the Rules lay down a three-tier structure for observance and adherence to the Code which is as follows, “Level I - Self-regulation by the applicable entity”; “Level II - Self-regulation by the self-regulating bodies of the applicable entities”; “Level III - Oversight mechanism by the Central Government.” What does this mean? In all likelihood, government oversight and more censorship.\n\nThis oversight mechanism is being created without any clear legislative backing and will now increasingly perform functions similar to those played by the Ministry of Information and Broadcasting for TV regulation. For instance, as per Rule 13(4) this also now includes powers of censorship such as apology scrolls, but also blocking of content! All of this is being planned to be done without any legislative backing or a clear law made by parliament.\n\nAny potential legislation regarding the OTT video streaming sector in India may cause immense harm to individual rights as well as the national interest. Today, India is no longer a consumer but a producer of original high quality video content that provides employment and entertainment to audiences locally and globally. It competes actively with other countries such as South Korea and needs an environment that recognises that traditional cinema or television based regulation may irreparably harm the sector. Any such model of regulation will likely have a substantial impact on citizens’ digital rights, result in economic harm, and also negatively impact India's growing cultural influence through the production of modern and contemporary video formats entertainment. We have written about more potential harms [**here**](https://internetfreedom.in/protect-users-do-not-license-the-internet-ottconsultation-savetheinternet/).\n\nOn February 12, 2021, the Mint also published a report titled, “[**17 OTT platforms release self-regulation toolkit**](https://www.livemint.com/industry/media/ott-services-release-tool-kit-for-selfregulation-11613035662795.html)”, which stated that 17 of India’s largest streaming services have launched a self-regulation toolkit, under the aegis of the Internet and Mobile Association of India (IAMAI), pre-empting government plans to bring out a code for all over-the-top (OTT) services. This toolkit builds upon the Self-Regulation Code of Online Curated Content Providers adopted by 15 Indian streaming services and digital companies. The Code has several issues itself, including providing a significant impetus towards self-censorship. More importantly, the provisions of the code relating to self-regulation may harmonise with the mechanisms laid down in clauses 11, 12, and 13, resulting in both a push towards self-censorship as well as a sizeable amount of government oversight.\n\n## Digital News Media\n\nWith respect to regulation of news media, several concerns abound. The purview of the Information Technology Act, 2000 does not extend to news media, and so the guidelines do not have the legislative backing to regulate news media. Thus, these Rules are exercising powers far beyond the parent legislation. Additionally, these guidelines are *ultra vires* section 79 of the IT Act, which provides a ‘safe harbour’ through an exemption from liabilities in certain cases. This makes these guidelines a camouflaged way to indirectly regulate online news media by bringing these platforms under the aegis of the Information Technology Act, 2000 instead of following the due process of parliamentary scrutiny and subsequent legislation.\n\nThe vague definition of “publisher of news and current affairs content” may also lead to further arbitrariness. The definition excludes replica e-papers of newspapers from its ambit. Now, will this mean media publications such as the Caravan magazine, which physically publishes a monthly magazine and was recently at the [**centre of a social media storm involving blockages of its Twitter accounts**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/), falls under the category of ‘publishers of news and current affairs content’? This vagueness in definition would allow arbitrariness by the government in the exercise of significant discretionary powers and would allow them to censor media at their pleasure. Such a definition also privileges the established media houses, who may have a print newspaper as a significant component of their operations and could thus claim to be exempted from these guidelines. Smaller and independent media houses on the other hand may not have the luxury to do so, and instead rely on the internet to disseminate news and information. This discriminatory approach between online news media and traditional print newspapers and legacy media will place additional responsibilities on the former on the basis of an ambiguous definition that lends itself to confusion and uncertainty, and thus potentially stifle independent online news media.\n\nMoreover, it is unclear what is the purpose of requiring significant publishers of news and current affairs content to notify the Broadcast Seva established by the government. For instance, the Press and Registration of Books Act, 1867 required registration because it was aimed at preservation of copies of books and periodicals containing news printed in India. While this may have been necessary in 1867, such requirements have outlived their archival utility in the modern digital age with the internet maintaining a record of news and current affairs. Therefore, there is a need to fundamentally re-examine the purpose and scope of the notification requirement present under Rule 16 of the draft IT Rules, 2021. It should also be noted that while the government earlier planned to bring about these changes [**through a legislation**](https://internetfreedom.in/say-no-to-overregulation-of-digital-news-media-and-social-media/) which would have to be approved by the Parliament, it may now go ahead and implement it through mere executive fiat and bypass legislative debate on this issue.\n\nhttps://preview.redd.it/n048zgs8hkj61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=478568bf55ba58882c8a1924fc49c22b147233d8\n\n## “Traceability” and breaking encryption?\n\nThe draft IT Rules, 2021 have, under sub-rule (2) of Rule 5, made it mandatory for a significant social media intermediary providing services primarily in the nature of messaging, such as Whatsapp, Signal, Telegram etc., to enable the identification of the first originator of the information. This introduces the requirement of traceability which would break end-to-end encryption. It should be noted that previous proposals which seek to implement traceability in a manner which is compatible with end to end encryption have been shown to be [**vulnerable to spoofing**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/) where bad actors can falsely modify the originator information to frame an innocent person. Further, the originator of the message has no control over who forwards the content, or how many times it is forwarded, or in which fora.\n\nMany platforms (Whatsapp, Signal, Telegram but even other platforms) retain minimal user data for electronic information exchange and also deploy end-to-end encryption to provide reliability, security and privacy to users. These are used by millions of Indians to prevent identity theft, code injection attacks and many other threats. Encryption becomes even more important now as more of our lives involve our personal data being aggregated and analysed at a scale that was never possible before. In the past, the Report of the Justice Srikrishna Committee on Data Protection has also criticised the government for mandating low encryption standards in license agreements with telecom service providers because *“this poses a threat to safety and security of the personal data of data principals.”*\n\nWithout thought or involving technical experts in an open consultative process, without any data protection law or surveillance reform, this is being tinkered with by introducing the requirement of “traceability”. To understand how encryption technologies defend and expand human freedom, we urge you to watch this [**Independence Day lecture**](https://www.youtube.com/watch?v=vrU1J8SzCLk) by Dr. Debayan Gupta, Assistant Professor of Computer Science at Ashoka University.\n\nThis introduction of a traceability requirement has important consequences for everyday users of online services and should also be seen in the context of the [**MHA notification**](https://www.mha.gov.in/sites/default/files/PressReleaseLawfulinterception_24122018.pdf) which activates the [**IT (Procedure and Safeguards for Interception, Monitoring and Decryption of Information) Rules, 2009**](https://www.meity.gov.in/writereaddata/files/Information%20Technology%20%28Procedure%20and%20Safeguards%20for%20Interception%2C%20Monitoring%20and%20Decryption%20of%20Information%29%20Rules%2C%202009.pdf) that hold the power to direct, “decryption”. We do not have any proper parliamentary oversight or judicial check on surveillance, and the latest draft rules, if they go through, would be a tremendous expansion in the power of the government over ordinary citizens eerily reminiscent of China’s blocking and breaking of user encryption to surveil its citizens.\n\nIn so far as Rule 5(2) requires modifications to the design of encrypted platforms to enable traceability, it is beyond the scope of the parent provision that is Section 79 of the IT Act. Here, it is important to note that the power to prescribe encryption standards and methods originates from Section 84A of the IT Act, and not Section 79, which is a safe harbour provision. Even Section 84A empowers the Central Government to prescribe modes and methods of encryption for the purpose of *“secure use of the electronic medium and for promotion of e-governance and e-commerce.”* Any attempts to weaken encryption to enable traceability would not satisfy the objective of ensuring secure use of the electronic medium.\n\n## Development of AI to automate censorship?\n\nFurther, under sub-rule (4) of Rule 5, the draft IT Rules made it mandatory for a significant social media intermediary (such as WhatsApp, Signal, Twitter, Instagram or Facebook etc.) to deploy technology-based measures, including automated tools or other mechanisms to proactively identify information that depicts any act or simulation in any form depicting rape, child sexual abuse or conduct, whether explicit or implicit.\n\nWhile these automated tools are presently proposed to be deployed in respect of highly objectionable content, such as depictions of rape or child sexual abuse, such a measure is nevertheless alarming. Once technical changes are implemented in systems very quickly they suffer from a function creep. This will be a slippery slope where use of automated tools will be expanded beyond instances of sexual violence and child sexual abuse material. For instance, in 2019, the Central Bureau of Investigation [**asked**](https://gadgets.ndtv.com/social-networking/news/cbi-reportedly-asks-social-media-firms-to-use-intrusive-photodna-technology-to-track-suspects-1971042) social media companies to use PhotoDNA, a technological tool meant to identify child sexual abuse material, to track suspects in regular criminal cases. Moreover if one reads Rule 5(4) closely, it also goes beyond to a re-upload requirement, when it states that, “*or any information which is exactly identical in content to information that has previously been removed or access to which has been disabled on the computer resource of such intermediary under clause (d) of sub-rule (1) of rule 4.*”\n\nDevelopment of artificial intelligence (AI) tools of censorship is replete with a host of risks, including the underdeveloped and imperfect nature of AI in the current state-of-the-art. AI “learns” by examining vast amounts of data, and the development of a censorship AI is likely to require social media intermediaries to store and examine large amounts of user-generated content that does not in any way relate to the kind of content sought to be censored.\n\nAdditionally, coding biases in the development of AI often lead to discrimination, overbreadth and a lack of accountability and transparency. This is of particular concern since the AI seeks to control and monitor the exercise of a user’s fundamental right to freedom of speech and expression. It is necessary to carefully consider whether AI ought to be allowed to regulate the fundamental rights of citizens.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gyqisdsahkj61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=87f0a38d808c9ea9598de1141192bed90e1b160b\n\n## SOS! We urgently need a public consultation!\n\nThe [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) have the potential to fundamentally change how the internet is accessed and used by millions of users across India. Many of the changes proposed continue with greater finesse, what we had first in 2018 termed as a, “Chinese model of online surveillance and censorship”. We fear that despite material changes made to the draft rules, and some noticeable improvements in greater precision the core and the substance of these concerns remain.\n\nIn some respects it has even become worse, with an illegal and unconstitutional proposed extension of executive power to regulate online news media and video streaming platforms. This makes a fresh consultation, commencing with a white paper an urgent necessity. The Internet Freedom Foundation believes in a clear need for regulation that is centred within our constitutionality and advances fundamental rights. This helps bring much needed oversight and accountability to big tech. However, the present approach, not only fails to adopt this in letter in spirit but has the potential of chilling our voices online and also hurting our privacy.\n\n## Important documents\n\n1. Draft Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing)).\n2. Submission to the Ministry of Electronics and Information Technology on the Draft of The Information Technology \\[Intermediary Guidelines (Amendment) Rules\\] 2018 dated January 30, 2019 ([**link**](https://drive.google.com/file/d/1pDQt1M81spH66kv0CHcUk8P9U_Dp9_oc/view))\n3. IFF files independent expert's submission before Madras HC on PIL relating to encryption and traceability dated August 23, 2019 ([**link**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/))\n4. Government censorship and the dire need for transparency dated February 8, 2021 ([**link**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/))\n5. Say no to overregulation of digital news media dated December 23, 2019 ([**link**](https://internetfreedom.in/say-no-to-overregulation-of-digital-news-media-and-social-media/))\n6. \\#LetUsChill: Confusion and Opacity over OTT guidelines dated February 4, 2021 ([**link**](https://internetfreedom.in/ott-transparency-representation/))\n\n[**Imagine a free and open internet  without the fear of censorship and surveillance. We need it today, more than ever and need your help in sustaining our mission. Donate generously and become a IFF Member today!**](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 13,
    "num_comments": 0,
    "created_utc": 1614234258,
    "convurl": "https://b.thumbs.redditmedia.com/SrIhPk8ueBkwHykBdMmKpwZELqbLDSOmT3BD77Hg_sY.jpg",
    "comments": [],
    "cleaned_text": "latest draft intermediary rules fixing big tech breaking digital rights tldr provide information everything happened happening information technology intermediary guidelines digital media ethics code rules provide quick rundown contentious history need starting afresh vital conversation platform accountability also analysis present draft rules given seeks even regulate digital news platforms ott content providers recommend fresh consultation greater transparency several proposals present form suffer unconstitutionality undermine free expression privacy internet users india controversial past clear believe social media broken large platforms owe us accountability user rights recent draft government proposal accessed makes problem worse increase censorship reduce user privacy get specifics proposal let us quick recap history issue december indian expresshttpsindianexpresscomarticleindiaitactamendmentsdataprivacyfreedomofspeechfbtwitter first broke news confidential meeting proposed amendments rules section information technology act act discussed section act provides called safe harbour intermediaries host user generated content exempts liability actions users platform adhere guidelines prescribed government existing guidelines intermediaries required comply present information technology intermediaries guidelines rules httpswwwmeitygovinwritereaddatafilesgsrepdf government contemplating changes guidelines since december learnt private meeting government officials company representatives regarding amendments guidelines intermediary liability made available complete copy draft ruleshttpsdrivegooglecomfiledongrwweyzsemncprynsrfixbbviewuspsharing substantial public interest stakehttpsinternetfreedominindiamustresistthelureofthechinesemodelofsurveillanceandcensorshipintermediaryrulesrighttomemesaveourprivacy first ministry electronics information technology meity denied knowledge meeting proposed changes subsequently acknowledged initiated public consultation flawed consultation shortly meity announced public consultationhttpmeitygovincontentcommentssuggestionsinviteddraftecinformationtechnologyintermediaryguidelines proposed changes proposals make changes liability exemptions online platforms service providers intermediary service provider transmits hosts publishes user content without exercising editorial control content like traditional publishers isp email provider social media platform webservice allows post upload publish platforms technical ability connect us others host data publish help us realise freedom speech mediate online experience impact privacy hold great power feared exercise expending energy resources basis draft legal rules lack clear rationale articulated meity proposals substantively harmful fundamental rights freedom speech privacy explained submissionshttpsdrivegooglecomopenidpdqtmsphkvchcukpudpoc instead advocated fresh start urged government first publish white paper clearly identified problems seeks solve proposed amendments pending litigation one contentious provisions proposed meity december version also features latest version draft rules relates traceability originators information internet issue traceability originators information messaging platforms also subject litigationhttpsinternetfreedominfacebookstransferpetitioninmadrashccaseinvolvingencryptionandtraceabilityallowedaftertamilnadugovernmentwithdrawsobjections supreme court antony clement rubin v union india tc civil case originated pil madras high courthttpsinternetfreedominaadhaarlinking seeking linking aadhaar social media accounts however course hearings madras high court focus shifted traceability originators information end end encrypted platforms whatsapp case later transferred supreme court iff intervenor case filed independent expert reporthttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc authored dr manoj prabhakaran professor computer science engineering iit bombay explains long term ineffectiveness proposals facilitate traceability end end encrypted platforms prof prabhakarans report addition written submissions highlight attempts weaken encryption backdoors key escrow systems would undermine privacy security users vulnerabilities could exploited criminals well draft information technology guidelines intermediaries digital media ethics code rules recently multiple disquieting media reports see herehttpswwwhindustantimescomindianewsibministryworksonselfregulationlawforottplatformsanddigitalmediahtml herehttpstimesofindiaindiatimescomindiagovernmentexaminesottregulationsinforeigncountriesarticleshowcms possible legislation regulate ott platforms stream curated content netflix amazon prime hotstar etc especially concerning recent controversy web series tandav see herehttpswwwthehinducomnewscitiesmumbaitandavcontroversyibministryseeksexplanationfromamazonprimevideoarticleece herehttpswwwthehinducomnewsnationalotherstatesonemorefiragainstamazonprimestandavarticleece latest long line incidents public outcry perceived slight religious beliefs acting information broadcasting union minister prakash javadekar recently statedhttpswwwindiatodayinbingewatchstoryibministrytoissueguidelinesforottplatformsaftertandavrowprakashjavadekar guidelines ott platforms considered government seems december february draft intermediaries rules transformed information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing acting public interest like released prior december version rules proposal amend section today releasing copy thehttpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing public calling public consultation since amendments impact fundamental rights indian internet users regulation video streaming platforms first three big changes highlighting regulation ott news media platforms proxy find grossly unconstitutional draft rules appendix rules defined code ethics procedure safeguards relation digitalonline media shall apply applicable entities applicable entities contained rule include publishers news current affairs content intermediaries primarily enable transmission news current affairs content publishers online curated content intermediaries primarily enable transmission online curated content subrule rule rules lay threetier structure observance adherence code follows level selfregulation applicable entity level ii selfregulation selfregulating bodies applicable entities level iii oversight mechanism central government mean likelihood government oversight censorship oversight mechanism created without clear legislative backing increasingly perform functions similar played ministry information broadcasting tv regulation instance per rule also includes powers censorship apology scrolls also blocking content planned done without legislative backing clear law made parliament potential legislation regarding ott video streaming sector india may cause immense harm individual rights well national interest today india longer consumer producer original high quality video content provides employment entertainment audiences locally globally competes actively countries south korea needs environment recognises traditional cinema television based regulation may irreparably harm sector model regulation likely substantial impact citizens digital rights result economic harm also negatively impact indias growing cultural influence production modern contemporary video formats entertainment written potential harms herehttpsinternetfreedominprotectusersdonotlicensetheinternetottconsultationsavetheinternet february mint also published report titled ott platforms release selfregulation toolkithttpswwwlivemintcomindustrymediaottservicesreleasetoolkitforselfregulationhtml stated indias largest streaming services launched selfregulation toolkit aegis internet mobile association india iamai preempting government plans bring code overthetop ott services toolkit builds upon selfregulation code online curated content providers adopted indian streaming services digital companies code several issues including providing significant impetus towards selfcensorship importantly provisions code relating selfregulation may harmonise mechanisms laid clauses resulting push towards selfcensorship well sizeable amount government oversight digital news media respect regulation news media several concerns abound purview information technology act extend news media guidelines legislative backing regulate news media thus rules exercising powers far beyond parent legislation additionally guidelines ultra vires section act provides safe harbour exemption liabilities certain cases makes guidelines camouflaged way indirectly regulate online news media bringing platforms aegis information technology act instead following due process parliamentary scrutiny subsequent legislation vague definition publisher news current affairs content may also lead arbitrariness definition excludes replica epapers newspapers ambit mean media publications caravan magazine physically publishes monthly magazine recently centre social media storm involving blockages twitter accountshttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency falls category publishers news current affairs content vagueness definition would allow arbitrariness government exercise significant discretionary powers would allow censor media pleasure definition also privileges established media houses may print newspaper significant component operations could thus claim exempted guidelines smaller independent media houses hand may luxury instead rely internet disseminate news information discriminatory approach online news media traditional print newspapers legacy media place additional responsibilities former basis ambiguous definition lends confusion uncertainty thus potentially stifle independent online news media moreover unclear purpose requiring significant publishers news current affairs content notify broadcast seva established government instance press registration books act required registration aimed preservation copies books periodicals containing news printed india may necessary requirements outlived archival utility modern digital age internet maintaining record news current affairs therefore need fundamentally reexamine purpose scope notification requirement present rule draft rules also noted government earlier planned bring changes legislationhttpsinternetfreedominsaynotooverregulationofdigitalnewsmediaandsocialmedia would approved parliament may go ahead implement mere executive fiat bypass legislative debate issue traceability breaking encryption draft rules subrule rule made mandatory significant social media intermediary providing services primarily nature messaging whatsapp signal telegram etc enable identification first originator information introduces requirement traceability would break endtoend encryption noted previous proposals seek implement traceability manner compatible end end encryption shown vulnerable spoofinghttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc bad actors falsely modify originator information frame innocent person originator message control forwards content many times forwarded fora many platforms whatsapp signal telegram even platforms retain minimal user data electronic information exchange also deploy endtoend encryption provide reliability security privacy users used millions indians prevent identity theft code injection attacks many threats encryption becomes even important lives involve personal data aggregated analysed scale never possible past report justice srikrishna committee data protection also criticised government mandating low encryption standards license agreements telecom service providers poses threat safety security personal data data principals without thought involving technical experts open consultative process without data protection law surveillance reform tinkered introducing requirement traceability understand encryption technologies defend expand human freedom urge watch independence day lecturehttpswwwyoutubecomwatchvvrujszclk dr debayan gupta assistant professor computer science ashoka university introduction traceability requirement important consequences everyday users online services also seen context mha notificationhttpswwwmhagovinsitesdefaultfilespressreleaselawfulinterceptionpdf activates procedure safeguards interception monitoring decryption information rules httpswwwmeitygovinwritereaddatafilesinformationtechnologyprocedureandsafeguardsforinterceptioncmonitoringanddecryptionofinformationrulescpdf hold power direct decryption proper parliamentary oversight judicial check surveillance latest draft rules go would tremendous expansion power government ordinary citizens eerily reminiscent chinas blocking breaking user encryption surveil citizens far rule requires modifications design encrypted platforms enable traceability beyond scope parent provision section act important note power prescribe encryption standards methods originates section act section safe harbour provision even section empowers central government prescribe modes methods encryption purpose secure use electronic medium promotion egovernance ecommerce attempts weaken encryption enable traceability would satisfy objective ensuring secure use electronic medium development ai automate censorship subrule rule draft rules made mandatory significant social media intermediary whatsapp signal twitter instagram facebook etc deploy technologybased measures including automated tools mechanisms proactively identify information depicts act simulation form depicting rape child sexual abuse conduct whether explicit implicit automated tools presently proposed deployed respect highly objectionable content depictions rape child sexual abuse measure nevertheless alarming technical changes implemented systems quickly suffer function creep slippery slope use automated tools expanded beyond instances sexual violence child sexual abuse material instance central bureau investigation askedhttpsgadgetsndtvcomsocialnetworkingnewscbireportedlyaskssocialmediafirmstouseintrusivephotodnatechnologytotracksuspects social media companies use photodna technological tool meant identify child sexual abuse material track suspects regular criminal cases moreover one reads rule closely also goes beyond reupload requirement states information exactly identical content information previously removed access disabled computer resource intermediary clause subrule rule development artificial intelligence ai tools censorship replete host risks including underdeveloped imperfect nature ai current stateoftheart ai learns examining vast amounts data development censorship ai likely require social media intermediaries store examine large amounts usergenerated content way relate kind content sought censored additionally coding biases development ai often lead discrimination overbreadth lack accountability transparency particular concern since ai seeks control monitor exercise users fundamental right freedom speech expression necessary carefully consider whether ai ought allowed regulate fundamental rights citizens ampxb sos urgently need public consultation information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing potential fundamentally change internet accessed used millions users across india many changes proposed continue greater finesse first termed chinese model online surveillance censorship fear despite material changes made draft rules noticeable improvements greater precision core substance concerns remain respects even become worse illegal unconstitutional proposed extension executive power regulate online news media video streaming platforms makes fresh consultation commencing white paper urgent necessity internet freedom foundation believes clear need regulation centred within constitutionality advances fundamental rights helps bring much needed oversight accountability big tech however present approach fails adopt letter spirit potential chilling voices online also hurting privacy important documents draft information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing submission ministry electronics information technology draft information technology intermediary guidelines amendment rules dated january linkhttpsdrivegooglecomfiledpdqtmsphkvchcukpudpocview iff files independent experts submission madras hc pil relating encryption traceability dated august linkhttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc government censorship dire need transparency dated february linkhttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency say overregulation digital news media dated december linkhttpsinternetfreedominsaynotooverregulationofdigitalnewsmediaandsocialmedia letuschill confusion opacity ott guidelines dated february linkhttpsinternetfreedominotttransparencyrepresentation imagine free open internet without fear censorship surveillance need today ever need help sustaining mission donate generously become iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "latest draft intermediary rules fixing big tech breaking digital rights",
    "cleaned_selftext": "tldr provide information everything happened happening information technology intermediary guidelines digital media ethics code rules provide quick rundown contentious history need starting afresh vital conversation platform accountability also analysis present draft rules given seeks even regulate digital news platforms ott content providers recommend fresh consultation greater transparency several proposals present form suffer unconstitutionality undermine free expression privacy internet users india controversial past clear believe social media broken large platforms owe us accountability user rights recent draft government proposal accessed makes problem worse increase censorship reduce user privacy get specifics proposal let us quick recap history issue december indian expresshttpsindianexpresscomarticleindiaitactamendmentsdataprivacyfreedomofspeechfbtwitter first broke news confidential meeting proposed amendments rules section information technology act act discussed section act provides called safe harbour intermediaries host user generated content exempts liability actions users platform adhere guidelines prescribed government existing guidelines intermediaries required comply present information technology intermediaries guidelines rules httpswwwmeitygovinwritereaddatafilesgsrepdf government contemplating changes guidelines since december learnt private meeting government officials company representatives regarding amendments guidelines intermediary liability made available complete copy draft ruleshttpsdrivegooglecomfiledongrwweyzsemncprynsrfixbbviewuspsharing substantial public interest stakehttpsinternetfreedominindiamustresistthelureofthechinesemodelofsurveillanceandcensorshipintermediaryrulesrighttomemesaveourprivacy first ministry electronics information technology meity denied knowledge meeting proposed changes subsequently acknowledged initiated public consultation flawed consultation shortly meity announced public consultationhttpmeitygovincontentcommentssuggestionsinviteddraftecinformationtechnologyintermediaryguidelines proposed changes proposals make changes liability exemptions online platforms service providers intermediary service provider transmits hosts publishes user content without exercising editorial control content like traditional publishers isp email provider social media platform webservice allows post upload publish platforms technical ability connect us others host data publish help us realise freedom speech mediate online experience impact privacy hold great power feared exercise expending energy resources basis draft legal rules lack clear rationale articulated meity proposals substantively harmful fundamental rights freedom speech privacy explained submissionshttpsdrivegooglecomopenidpdqtmsphkvchcukpudpoc instead advocated fresh start urged government first publish white paper clearly identified problems seeks solve proposed amendments pending litigation one contentious provisions proposed meity december version also features latest version draft rules relates traceability originators information internet issue traceability originators information messaging platforms also subject litigationhttpsinternetfreedominfacebookstransferpetitioninmadrashccaseinvolvingencryptionandtraceabilityallowedaftertamilnadugovernmentwithdrawsobjections supreme court antony clement rubin v union india tc civil case originated pil madras high courthttpsinternetfreedominaadhaarlinking seeking linking aadhaar social media accounts however course hearings madras high court focus shifted traceability originators information end end encrypted platforms whatsapp case later transferred supreme court iff intervenor case filed independent expert reporthttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc authored dr manoj prabhakaran professor computer science engineering iit bombay explains long term ineffectiveness proposals facilitate traceability end end encrypted platforms prof prabhakarans report addition written submissions highlight attempts weaken encryption backdoors key escrow systems would undermine privacy security users vulnerabilities could exploited criminals well draft information technology guidelines intermediaries digital media ethics code rules recently multiple disquieting media reports see herehttpswwwhindustantimescomindianewsibministryworksonselfregulationlawforottplatformsanddigitalmediahtml herehttpstimesofindiaindiatimescomindiagovernmentexaminesottregulationsinforeigncountriesarticleshowcms possible legislation regulate ott platforms stream curated content netflix amazon prime hotstar etc especially concerning recent controversy web series tandav see herehttpswwwthehinducomnewscitiesmumbaitandavcontroversyibministryseeksexplanationfromamazonprimevideoarticleece herehttpswwwthehinducomnewsnationalotherstatesonemorefiragainstamazonprimestandavarticleece latest long line incidents public outcry perceived slight religious beliefs acting information broadcasting union minister prakash javadekar recently statedhttpswwwindiatodayinbingewatchstoryibministrytoissueguidelinesforottplatformsaftertandavrowprakashjavadekar guidelines ott platforms considered government seems december february draft intermediaries rules transformed information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing acting public interest like released prior december version rules proposal amend section today releasing copy thehttpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing public calling public consultation since amendments impact fundamental rights indian internet users regulation video streaming platforms first three big changes highlighting regulation ott news media platforms proxy find grossly unconstitutional draft rules appendix rules defined code ethics procedure safeguards relation digitalonline media shall apply applicable entities applicable entities contained rule include publishers news current affairs content intermediaries primarily enable transmission news current affairs content publishers online curated content intermediaries primarily enable transmission online curated content subrule rule rules lay threetier structure observance adherence code follows level selfregulation applicable entity level ii selfregulation selfregulating bodies applicable entities level iii oversight mechanism central government mean likelihood government oversight censorship oversight mechanism created without clear legislative backing increasingly perform functions similar played ministry information broadcasting tv regulation instance per rule also includes powers censorship apology scrolls also blocking content planned done without legislative backing clear law made parliament potential legislation regarding ott video streaming sector india may cause immense harm individual rights well national interest today india longer consumer producer original high quality video content provides employment entertainment audiences locally globally competes actively countries south korea needs environment recognises traditional cinema television based regulation may irreparably harm sector model regulation likely substantial impact citizens digital rights result economic harm also negatively impact indias growing cultural influence production modern contemporary video formats entertainment written potential harms herehttpsinternetfreedominprotectusersdonotlicensetheinternetottconsultationsavetheinternet february mint also published report titled ott platforms release selfregulation toolkithttpswwwlivemintcomindustrymediaottservicesreleasetoolkitforselfregulationhtml stated indias largest streaming services launched selfregulation toolkit aegis internet mobile association india iamai preempting government plans bring code overthetop ott services toolkit builds upon selfregulation code online curated content providers adopted indian streaming services digital companies code several issues including providing significant impetus towards selfcensorship importantly provisions code relating selfregulation may harmonise mechanisms laid clauses resulting push towards selfcensorship well sizeable amount government oversight digital news media respect regulation news media several concerns abound purview information technology act extend news media guidelines legislative backing regulate news media thus rules exercising powers far beyond parent legislation additionally guidelines ultra vires section act provides safe harbour exemption liabilities certain cases makes guidelines camouflaged way indirectly regulate online news media bringing platforms aegis information technology act instead following due process parliamentary scrutiny subsequent legislation vague definition publisher news current affairs content may also lead arbitrariness definition excludes replica epapers newspapers ambit mean media publications caravan magazine physically publishes monthly magazine recently centre social media storm involving blockages twitter accountshttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency falls category publishers news current affairs content vagueness definition would allow arbitrariness government exercise significant discretionary powers would allow censor media pleasure definition also privileges established media houses may print newspaper significant component operations could thus claim exempted guidelines smaller independent media houses hand may luxury instead rely internet disseminate news information discriminatory approach online news media traditional print newspapers legacy media place additional responsibilities former basis ambiguous definition lends confusion uncertainty thus potentially stifle independent online news media moreover unclear purpose requiring significant publishers news current affairs content notify broadcast seva established government instance press registration books act required registration aimed preservation copies books periodicals containing news printed india may necessary requirements outlived archival utility modern digital age internet maintaining record news current affairs therefore need fundamentally reexamine purpose scope notification requirement present rule draft rules also noted government earlier planned bring changes legislationhttpsinternetfreedominsaynotooverregulationofdigitalnewsmediaandsocialmedia would approved parliament may go ahead implement mere executive fiat bypass legislative debate issue traceability breaking encryption draft rules subrule rule made mandatory significant social media intermediary providing services primarily nature messaging whatsapp signal telegram etc enable identification first originator information introduces requirement traceability would break endtoend encryption noted previous proposals seek implement traceability manner compatible end end encryption shown vulnerable spoofinghttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc bad actors falsely modify originator information frame innocent person originator message control forwards content many times forwarded fora many platforms whatsapp signal telegram even platforms retain minimal user data electronic information exchange also deploy endtoend encryption provide reliability security privacy users used millions indians prevent identity theft code injection attacks many threats encryption becomes even important lives involve personal data aggregated analysed scale never possible past report justice srikrishna committee data protection also criticised government mandating low encryption standards license agreements telecom service providers poses threat safety security personal data data principals without thought involving technical experts open consultative process without data protection law surveillance reform tinkered introducing requirement traceability understand encryption technologies defend expand human freedom urge watch independence day lecturehttpswwwyoutubecomwatchvvrujszclk dr debayan gupta assistant professor computer science ashoka university introduction traceability requirement important consequences everyday users online services also seen context mha notificationhttpswwwmhagovinsitesdefaultfilespressreleaselawfulinterceptionpdf activates procedure safeguards interception monitoring decryption information rules httpswwwmeitygovinwritereaddatafilesinformationtechnologyprocedureandsafeguardsforinterceptioncmonitoringanddecryptionofinformationrulescpdf hold power direct decryption proper parliamentary oversight judicial check surveillance latest draft rules go would tremendous expansion power government ordinary citizens eerily reminiscent chinas blocking breaking user encryption surveil citizens far rule requires modifications design encrypted platforms enable traceability beyond scope parent provision section act important note power prescribe encryption standards methods originates section act section safe harbour provision even section empowers central government prescribe modes methods encryption purpose secure use electronic medium promotion egovernance ecommerce attempts weaken encryption enable traceability would satisfy objective ensuring secure use electronic medium development ai automate censorship subrule rule draft rules made mandatory significant social media intermediary whatsapp signal twitter instagram facebook etc deploy technologybased measures including automated tools mechanisms proactively identify information depicts act simulation form depicting rape child sexual abuse conduct whether explicit implicit automated tools presently proposed deployed respect highly objectionable content depictions rape child sexual abuse measure nevertheless alarming technical changes implemented systems quickly suffer function creep slippery slope use automated tools expanded beyond instances sexual violence child sexual abuse material instance central bureau investigation askedhttpsgadgetsndtvcomsocialnetworkingnewscbireportedlyaskssocialmediafirmstouseintrusivephotodnatechnologytotracksuspects social media companies use photodna technological tool meant identify child sexual abuse material track suspects regular criminal cases moreover one reads rule closely also goes beyond reupload requirement states information exactly identical content information previously removed access disabled computer resource intermediary clause subrule rule development artificial intelligence ai tools censorship replete host risks including underdeveloped imperfect nature ai current stateoftheart ai learns examining vast amounts data development censorship ai likely require social media intermediaries store examine large amounts usergenerated content way relate kind content sought censored additionally coding biases development ai often lead discrimination overbreadth lack accountability transparency particular concern since ai seeks control monitor exercise users fundamental right freedom speech expression necessary carefully consider whether ai ought allowed regulate fundamental rights citizens ampxb sos urgently need public consultation information technology intermediary guidelines digital media ethics code rules httpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing potential fundamentally change internet accessed used millions users across india many changes proposed continue greater finesse first termed chinese model online surveillance censorship fear despite material changes made draft rules noticeable improvements greater precision core substance concerns remain respects even become worse illegal unconstitutional proposed extension executive power regulate online news media video streaming platforms makes fresh consultation commencing white paper urgent necessity internet freedom foundation believes clear need regulation centred within constitutionality advances fundamental rights helps bring much needed oversight accountability big tech however present approach fails adopt letter spirit potential chilling voices online also hurting privacy important documents draft information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledbeohgrddwwkscofvlbjxqizlpviewuspsharing submission ministry electronics information technology draft information technology intermediary guidelines amendment rules dated january linkhttpsdrivegooglecomfiledpdqtmsphkvchcukpudpocview iff files independent experts submission madras hc pil relating encryption traceability dated august linkhttpsinternetfreedominifffilesindependentexpertsubmissionbeforemadrashc government censorship dire need transparency dated february linkhttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency say overregulation digital news media dated december linkhttpsinternetfreedominsaynotooverregulationofdigitalnewsmediaandsocialmedia letuschill confusion opacity ott guidelines dated february linkhttpsinternetfreedominotttransparencyrepresentation imagine free open internet without fear censorship surveillance need today ever need help sustaining mission donate generously become iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Latest Draft Intermediary Rules: Fixing big tech, by breaking our digital rights?",
    "light_cleaned_selftext": "## tl;dr Here we will provide you with information about everything that has happened and is happening with the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021. We provide you a quick rundown on its contentious history, the need for starting afresh on this vital conversation about platform accountability and also an analysis of the present draft of the rules. Given that it seeks to now even regulate digital news platforms and OTT content providers, we recommend a fresh consultation and greater transparency. Several proposals in their present form suffer from unconstitutionality and will undermine free expression and privacy for internet users in India. ## A controversial past Just to be clear, we believe that social media is broken. The large platforms owe us accountability and user rights. But a recent draft government proposal we have accessed makes this problem worse. It will increase censorship and reduce user privacy. Before we get into the specifics of the proposal, let us just do a quick recap of the history of this issue. On December 24, 2018, the[ **Indian Express**](https://indianexpress.com/article/india/it-act-amendments-data-privacy-freedom-of-speech-fb-twitter-5506572/) first broke the news about a “confidential” meeting in which proposed amendments to the rules under Section 79 of the Information Technology Act, 2000 (IT Act) were discussed. Section 79 of the IT Act provides what is called a ‘safe harbour’ to intermediaries who host user generated content and exempts them from liability for the actions of users on their platform if they adhere to guidelines prescribed by the government. The existing guidelines that intermediaries are required to comply with are present under the [**Information Technology (Intermediaries Guidelines) Rules, 2011**](https://www.meity.gov.in/writereaddata/files/GSR314E_10511%281%29_0.pdf) but the government has been contemplating changes to these guidelines since December 2018. After we learnt about the private meeting between government officials and company representatives regarding amendments to the guidelines for intermediary liability, we made available a[ **complete copy of the draft rules**](https://drive.google.com/file/d/1ong2rw-WeYzS-9eMNCP0R3yn9srfiXBb/view?usp=sharing) because there was [**substantial public interest at stake**](https://internetfreedom.in/india-must-resist-the-lure-of-the-chinese-model-of-surveillance-and-censorship-intermediaryrules-righttomeme-saveourprivacy/). While, at first, the Ministry of Electronics and Information Technology (MeitY) denied any knowledge of any such meeting and the proposed changes, they subsequently acknowledged them and initiated a public consultation. ## Flawed consultation Shortly after this, MeitY announced a[ **public consultation**](http://meity.gov.in/content/comments-suggestions-invited-draft-%E2%80%9C-information-technology-intermediary-guidelines) on the proposed changes. These were proposals to make changes to the liability exemptions for online platforms or service providers. An intermediary is any service provider which transmits, hosts and publishes user content without exercising editorial control over the content like traditional publishers do. So it can be your ISP, email provider, social media platform, or any web-service which allows you to post, upload and publish. These platforms because of their technical ability to connect us to others, host our data, publish it, help us realise our freedom of speech, they mediate our online experience, impact our privacy and hold great power. We feared this exercise was expending energy and resources on the basis of draft legal rules that lack any clear rationale that has been articulated by MeitY. The proposals themselves were substantively harmful to our fundamental rights to freedom of speech and privacy as we explained in [**our submissions**](https://drive.google.com/open?id=1pDQt1M81spH66kv0CHcUk8P9U_Dp9_oc). We instead advocated for a fresh start and urged the government to first publish a white paper which clearly identified the problems it seeks to solve through the proposed amendments. ## Pending litigation One of the contentious provisions which had been proposed by MeitY in the December 2018 version and which also features in the latest 2021 version of the draft Rules relates to traceability of originators of information on the internet, The issue of traceability of originators of information on messaging platforms is also the [**subject of litigation**](https://internetfreedom.in/facebooks-transfer-petition-in-madras-hc-case-involving-encryption-and-traceability-allowed-after-tamil-nadu-government-withdraws-objections/) before the Supreme Court in *Antony Clement Rubin v. Union of India (T.C. Civil No.189 of 2020)*. This case originated as a [**PIL before the Madras High Court**](https://internetfreedom.in/aadhaar-linking/) seeking linking of Aadhaar with social media accounts. However, during the course of hearings before the Madras High Court, the focus shifted to traceability of originators of information on end to end encrypted platforms such as WhatsApp, and the case was later transferred to the Supreme Court. IFF is an intervenor in this case and we have filed an [**independent expert report**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/) authored by Dr. Manoj Prabhakaran, Professor of Computer Science and Engineering at IIT Bombay, which explains the long term ineffectiveness of proposals to facilitate traceability on end to end encrypted platforms. Prof. Prabhakaran's report is in addition to our written submissions which highlight that any attempts to weaken encryption through backdoors or key escrow systems would undermine the privacy and security of all users because these vulnerabilities could be exploited by criminals as well. ## Draft Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 Recently, there were multiple disquieting media reports (see [**here**](https://www.hindustantimes.com/india-news/ib-ministry-works-on-self-regulation-law-for-ott-platforms-and-digital-media-101610774195596.html) and [**here**](https://timesofindia.indiatimes.com/india/government-examines-ott-regulations-in-foreign-countries/articleshow/80376346.cms)) about possible legislation to regulate OTT platforms which stream curated content such as Netflix, Amazon Prime, Hotstar etc. This is especially concerning after a recent controversy over the web series Tandav (see [**here**](https://www.thehindu.com/news/cities/mumbai/tandav-controversy-ib-ministry-seeks-explanation-from-amazon-prime-video/article33595435.ece) and [**here**](https://www.thehindu.com/news/national/other-states/one-more-fir-against-amazon-primes-tandav/article33612281.ece)), which is the latest in a long line of incidents in which there was public outcry over a perceived slight to religious beliefs. Acting on this the Information and Broadcasting Union Minister Prakash Javadekar has recently [**stated**](https://www.indiatoday.in/binge-watch/story/i-b-ministry-to-issue-guidelines-for-ott-platforms-after-tandav-row-prakash-javadekar-1764444-2021-01-31) that guidelines for OTT platforms are being considered by the Government. It seems that from December, 2018 to February, 2021 the Draft Intermediaries Rules, 2018 have now transformed into the [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing). Acting in public interest, just like we had released a prior December 2018 version of these Rules and a proposal to amend Section 66A, we are today releasing a [**copy of the**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) to the public and calling for a public consultation since these amendments will impact the fundamental rights of all Indian internet users. ## “Regulation” of Video Streaming Platforms The first of the three big changes we are highlighting is the regulation of OTT and news media platforms through proxy. We find this grossly unconstitutional. The draft IT Rules, 2021 have, in the Appendix to the Rules defined a “Code Of Ethics And Procedure And Safeguards In Relation To Digital/Online Media” which shall apply on “applicable entities”. “Applicable entities” as contained in Rule 7 include, “publishers of news and current affairs content”; and “intermediaries which primarily enable the transmission of news and current affairs content”; and “publishers of online curated content”; and, “intermediaries which primarily enable the transmission of online curated content.” Further, under sub-rule (3) of Rule 8, the Rules lay down a three-tier structure for observance and adherence to the Code which is as follows, “Level I - Self-regulation by the applicable entity”; “Level II - Self-regulation by the self-regulating bodies of the applicable entities”; “Level III - Oversight mechanism by the Central Government.” What does this mean? In all likelihood, government oversight and more censorship. This oversight mechanism is being created without any clear legislative backing and will now increasingly perform functions similar to those played by the Ministry of Information and Broadcasting for TV regulation. For instance, as per Rule 13(4) this also now includes powers of censorship such as apology scrolls, but also blocking of content! All of this is being planned to be done without any legislative backing or a clear law made by parliament. Any potential legislation regarding the OTT video streaming sector in India may cause immense harm to individual rights as well as the national interest. Today, India is no longer a consumer but a producer of original high quality video content that provides employment and entertainment to audiences locally and globally. It competes actively with other countries such as South Korea and needs an environment that recognises that traditional cinema or television based regulation may irreparably harm the sector. Any such model of regulation will likely have a substantial impact on citizens’ digital rights, result in economic harm, and also negatively impact India's growing cultural influence through the production of modern and contemporary video formats entertainment. We have written about more potential harms [**here**](https://internetfreedom.in/protect-users-do-not-license-the-internet-ottconsultation-savetheinternet/). On February 12, 2021, the Mint also published a report titled, “[**17 OTT platforms release self-regulation toolkit**](https://www.livemint.com/industry/media/ott-services-release-tool-kit-for-selfregulation-11613035662795.html)”, which stated that 17 of India’s largest streaming services have launched a self-regulation toolkit, under the aegis of the Internet and Mobile Association of India (IAMAI), pre-empting government plans to bring out a code for all over-the-top (OTT) services. This toolkit builds upon the Self-Regulation Code of Online Curated Content Providers adopted by 15 Indian streaming services and digital companies. The Code has several issues itself, including providing a significant impetus towards self-censorship. More importantly, the provisions of the code relating to self-regulation may harmonise with the mechanisms laid down in clauses 11, 12, and 13, resulting in both a push towards self-censorship as well as a sizeable amount of government oversight. ## Digital News Media With respect to regulation of news media, several concerns abound. The purview of the Information Technology Act, 2000 does not extend to news media, and so the guidelines do not have the legislative backing to regulate news media. Thus, these Rules are exercising powers far beyond the parent legislation. Additionally, these guidelines are *ultra vires* section 79 of the IT Act, which provides a ‘safe harbour’ through an exemption from liabilities in certain cases. This makes these guidelines a camouflaged way to indirectly regulate online news media by bringing these platforms under the aegis of the Information Technology Act, 2000 instead of following the due process of parliamentary scrutiny and subsequent legislation. The vague definition of “publisher of news and current affairs content” may also lead to further arbitrariness. The definition excludes replica e-papers of newspapers from its ambit. Now, will this mean media publications such as the Caravan magazine, which physically publishes a monthly magazine and was recently at the [**centre of a social media storm involving blockages of its Twitter accounts**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/), falls under the category of ‘publishers of news and current affairs content’? This vagueness in definition would allow arbitrariness by the government in the exercise of significant discretionary powers and would allow them to censor media at their pleasure. Such a definition also privileges the established media houses, who may have a print newspaper as a significant component of their operations and could thus claim to be exempted from these guidelines. Smaller and independent media houses on the other hand may not have the luxury to do so, and instead rely on the internet to disseminate news and information. This discriminatory approach between online news media and traditional print newspapers and legacy media will place additional responsibilities on the former on the basis of an ambiguous definition that lends itself to confusion and uncertainty, and thus potentially stifle independent online news media. Moreover, it is unclear what is the purpose of requiring significant publishers of news and current affairs content to notify the Broadcast Seva established by the government. For instance, the Press and Registration of Books Act, 1867 required registration because it was aimed at preservation of copies of books and periodicals containing news printed in India. While this may have been necessary in 1867, such requirements have outlived their archival utility in the modern digital age with the internet maintaining a record of news and current affairs. Therefore, there is a need to fundamentally re-examine the purpose and scope of the notification requirement present under Rule 16 of the draft IT Rules, 2021. It should also be noted that while the government earlier planned to bring about these changes [**through a legislation**](https://internetfreedom.in/say-no-to-overregulation-of-digital-news-media-and-social-media/) which would have to be approved by the Parliament, it may now go ahead and implement it through mere executive fiat and bypass legislative debate on this issue. ## “Traceability” and breaking encryption? The draft IT Rules, 2021 have, under sub-rule (2) of Rule 5, made it mandatory for a significant social media intermediary providing services primarily in the nature of messaging, such as Whatsapp, Signal, Telegram etc., to enable the identification of the first originator of the information. This introduces the requirement of traceability which would break end-to-end encryption. It should be noted that previous proposals which seek to implement traceability in a manner which is compatible with end to end encryption have been shown to be [**vulnerable to spoofing**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/) where bad actors can falsely modify the originator information to frame an innocent person. Further, the originator of the message has no control over who forwards the content, or how many times it is forwarded, or in which fora. Many platforms (Whatsapp, Signal, Telegram but even other platforms) retain minimal user data for electronic information exchange and also deploy end-to-end encryption to provide reliability, security and privacy to users. These are used by millions of Indians to prevent identity theft, code injection attacks and many other threats. Encryption becomes even more important now as more of our lives involve our personal data being aggregated and analysed at a scale that was never possible before. In the past, the Report of the Justice Srikrishna Committee on Data Protection has also criticised the government for mandating low encryption standards in license agreements with telecom service providers because *“this poses a threat to safety and security of the personal data of data principals.”* Without thought or involving technical experts in an open consultative process, without any data protection law or surveillance reform, this is being tinkered with by introducing the requirement of “traceability”. To understand how encryption technologies defend and expand human freedom, we urge you to watch this [**Independence Day lecture**](https://www.youtube.com/watch?v=vrU1J8SzCLk) by Dr. Debayan Gupta, Assistant Professor of Computer Science at Ashoka University. This introduction of a traceability requirement has important consequences for everyday users of online services and should also be seen in the context of the [**MHA notification**](https://www.mha.gov.in/sites/default/files/PressReleaseLawfulinterception_24122018.pdf) which activates the [**IT (Procedure and Safeguards for Interception, Monitoring and Decryption of Information) Rules, 2009**](https://www.meity.gov.in/writereaddata/files/Information%20Technology%20%28Procedure%20and%20Safeguards%20for%20Interception%2C%20Monitoring%20and%20Decryption%20of%20Information%29%20Rules%2C%202009.pdf) that hold the power to direct, “decryption”. We do not have any proper parliamentary oversight or judicial check on surveillance, and the latest draft rules, if they go through, would be a tremendous expansion in the power of the government over ordinary citizens eerily reminiscent of China’s blocking and breaking of user encryption to surveil its citizens. In so far as Rule 5(2) requires modifications to the design of encrypted platforms to enable traceability, it is beyond the scope of the parent provision that is Section 79 of the IT Act. Here, it is important to note that the power to prescribe encryption standards and methods originates from Section 84A of the IT Act, and not Section 79, which is a safe harbour provision. Even Section 84A empowers the Central Government to prescribe modes and methods of encryption for the purpose of *“secure use of the electronic medium and for promotion of e-governance and e-commerce.”* Any attempts to weaken encryption to enable traceability would not satisfy the objective of ensuring secure use of the electronic medium. ## Development of AI to automate censorship? Further, under sub-rule (4) of Rule 5, the draft IT Rules made it mandatory for a significant social media intermediary (such as WhatsApp, Signal, Twitter, Instagram or Facebook etc.) to deploy technology-based measures, including automated tools or other mechanisms to proactively identify information that depicts any act or simulation in any form depicting rape, child sexual abuse or conduct, whether explicit or implicit. While these automated tools are presently proposed to be deployed in respect of highly objectionable content, such as depictions of rape or child sexual abuse, such a measure is nevertheless alarming. Once technical changes are implemented in systems very quickly they suffer from a function creep. This will be a slippery slope where use of automated tools will be expanded beyond instances of sexual violence and child sexual abuse material. For instance, in 2019, the Central Bureau of Investigation [**asked**](https://gadgets.ndtv.com/social-networking/news/cbi-reportedly-asks-social-media-firms-to-use-intrusive-photodna-technology-to-track-suspects-1971042) social media companies to use PhotoDNA, a technological tool meant to identify child sexual abuse material, to track suspects in regular criminal cases. Moreover if one reads Rule 5(4) closely, it also goes beyond to a re-upload requirement, when it states that, “*or any information which is exactly identical in content to information that has previously been removed or access to which has been disabled on the computer resource of such intermediary under clause (d) of sub-rule (1) of rule 4.*” Development of artificial intelligence (AI) tools of censorship is replete with a host of risks, including the underdeveloped and imperfect nature of AI in the current state-of-the-art. AI “learns” by examining vast amounts of data, and the development of a censorship AI is likely to require social media intermediaries to store and examine large amounts of user-generated content that does not in any way relate to the kind of content sought to be censored. Additionally, coding biases in the development of AI often lead to discrimination, overbreadth and a lack of accountability and transparency. This is of particular concern since the AI seeks to control and monitor the exercise of a user’s fundamental right to freedom of speech and expression. It is necessary to carefully consider whether AI ought to be allowed to regulate the fundamental rights of citizens.  ## SOS! We urgently need a public consultation! The [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing) have the potential to fundamentally change how the internet is accessed and used by millions of users across India. Many of the changes proposed continue with greater finesse, what we had first in 2018 termed as a, “Chinese model of online surveillance and censorship”. We fear that despite material changes made to the draft rules, and some noticeable improvements in greater precision the core and the substance of these concerns remain. In some respects it has even become worse, with an illegal and unconstitutional proposed extension of executive power to regulate online news media and video streaming platforms. This makes a fresh consultation, commencing with a white paper an urgent necessity. The Internet Freedom Foundation believes in a clear need for regulation that is centred within our constitutionality and advances fundamental rights. This helps bring much needed oversight and accountability to big tech. However, the present approach, not only fails to adopt this in letter in spirit but has the potential of chilling our voices online and also hurting our privacy. ## Important documents 1. Draft Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1BEOhgR4dDWW9KSC3OfV30lB-JXqizl3P/view?usp=sharing)). 2. Submission to the Ministry of Electronics and Information Technology on the Draft of The Information Technology \\[Intermediary Guidelines (Amendment) Rules\\] 2018 dated January 30, 2019 ([**link**](https://drive.google.com/file/d/1pDQt1M81spH66kv0CHcUk8P9U_Dp9_oc/view)) 3. IFF files independent expert's submission before Madras HC on PIL relating to encryption and traceability dated August 23, 2019 ([**link**](https://internetfreedom.in/iff-files-independent-expert-submission-before-madras-hc/)) 4. Government censorship and the dire need for transparency dated February 8, 2021 ([**link**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/)) 5. Say no to overregulation of digital news media dated December 23, 2019 ([**link**](https://internetfreedom.in/say-no-to-overregulation-of-digital-news-media-and-social-media/)) 6. \\#LetUsChill: Confusion and Opacity over OTT guidelines dated February 4, 2021 ([**link**](https://internetfreedom.in/ott-transparency-representation/)) [**Imagine a free and open internet without the fear of censorship and surveillance. We need it today, more than ever and need your help in sustaining our mission. Donate generously and become a IFF Member today!**](https://internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}