{
    "id": "1e2lfw4",
    "title": "In a time of religious polarisation, Supreme Court verdict on alimony for Muslim women is a step forward",
    "url": "https://indianexpress.com/article/opinion/columns/in-a-time-of-religious-polarisation-supreme-court-verdict-on-alimony-for-muslim-women-is-a-step-forward-9447081/",
    "selftext": "Muslim women continue to be denied their Quranic rights as well as constitutional rights. SC verdict can enable them to fight for justice. ",
    "flair": "Law & Courts",
    "score": 109,
    "num_comments": 20,
    "created_utc": 1720906505.0,
    "convurl": "https://external-preview.redd.it/mYxED79rnC46f9YAj8PDI4_C-bV5-MgUrXl69dFvg1I.jpg?auto=webp&s=25c17ee252f228a8c47e8673f7e160eb7fa9c3af",
    "comments": [
        "There are a lot of reforms needed for Muslim women if we want to give them basic human rights.",
        "If we are striving for equal rights between men and women and equal opportunities in education and work, then is it fair that a man should support a woman after divorce? If a man is jobless and the woman was earning well, would the verdict be the opposite?",
        "Afaik the opposite is also possible.",
        "Excerpts \n\n> Why are we celebrating this judgment? Section 125 is nothing new, it has existed since 1973. Upholding diversity and pluralism is important in a secular democracy. This includes a diversity of personal laws. But we must not confuse diversity with unjust patriarchal practices. There is nothing laudatory or “personal” about the subjugation of women and violation of their rights.\n\n> The Quran emphasises maintenance to be provided to the wife after divorce. However, husbands often continue to look for loopholes. This happened in the case of Shah Bano. Her husband refused to pay the maintenance granted by the court.\n\n> The conservative clergy and other leaders jumped on the bandwagon to defend personal laws and against the imposition of secular laws on Muslims. They called it interference in Shariat and thereby, a violation of minority rights. The Rajiv Gandhi-led government came under pressure and overturned through legislation the ruling that granted maintenance to Shah Bano. A separate Shariat-compliant law was hastily enacted to provide maintenance to divorced Muslim women. The BJP began to accuse Congress of Muslim appeasement. In a sense, the Shah Bano episode kickstarted the politics of religious division.\n\n> In seven decades since Independence, no government felt obliged to enable Muslim women to attain legal parity with their Hindu and Christian counterparts who enjoy the protection of reformed personal laws enacted by Parliament. No government felt the need to fulfil its constitutional obligation of upholding gender justice. As though granting legal rights to Muslim women would go against the principles of secularism. \n\n> Indian Muslims are governed by Shariat Application Act, 1937. This law is archaic. It merely states that Shariat will decide all personal law matters for Muslims. While Muslims are ostensibly governed by Shariat, in reality, unjust and unfair practices based on arbitrary interpretations prevail. Several important issues lack legal clarity. Patriarchal interpretations decide matters such as age of marriage, divorce, maintenance, polygamy, halala, custody and guardianship of children, share in property and inheritance and muta marriages. Islamic concepts of consent and mehr are diluted in practice.\n\n> Muslim marriage is a contract. But most women don’t possess a copy of their nikahnama and are unaware of their rights. Moreover, there is a common sense prevalent about the husband being superior in marital relationships.\n\n> The dominant conservative clergy have resisted reform. “Islam gave rights to women 1,400 years ago,” they say. But are these rights available to women? Anyone who raises such questions is demonised. Calls for reform are dismissed as the handiwork of those serving Western ways of thinking or these days, Hindutva. In this scenario, Muslim women continue to be denied their Quranic rights as well as constitutional rights.\n\n> We live in an era of religious polarisation. The condition of Muslim women is used to portray the community negatively. On the other hand, many Muslims are living under a sense of fear and insecurity. They are hardly in a position to appreciate this progressive verdict. The orthodoxy would club it with the ongoing onslaught on Muslim identity and dismiss it as unwarranted. The silver lining is that there are a large number of people within the community who welcome this judgment. There is a greater consciousness about rights not just amongst women themselves but their families too. The women-led movement against instant triple talaq received support from the whole community after it was highlighted that it does not enjoy Quranic sanction.\n\n> Justice Nagarathna emphasised that maintenance must not be viewed as charity but as a fundamental right. It is a right that transcends religious boundaries.",
        "Muslim community itself needs reforms but then some backward minded thinking to not just limited to Muslims, the whole male perspective towards women must be retaught.",
        "The thing is patriarchy affects every woman. But at least the reformed laws help Hindu and Christian women, Muslim women don't even have that sadly to help them if they wanna fight back.",
        "What does Muslim women not have as per law, that Hindu women already got?",
        "> Patriarchal interpretations decide matters such as age of marriage, divorce, maintenance, polygamy, halala, custody and guardianship of children, share in property and inheritance and muta marriages. Islamic concepts of consent and mehr are diluted in practice.\n\nBetter laws regarding all of this. Suggest you to read the article once.",
        "Im confused. I have seen many many Muslim men giving court ordered alimony to women and  women making unreasonable demands to settle the divorce cases. \n\n\nIs it really true Muslim women do not receive alimony?",
        "Yeah you are right, many people are mislabeling it as a landmark judgement which it's not. In the 'landmark' latifi judgement the court basically restored the assurances made in Shah bano caso and effectively nullified the Muslim women act brought by Rajeev gandhi. The court has only reiterated its earlier position here.",
        "Thanks for the clarification.  That makes sense.. I guess its ppl who are unaware who are celebrating this...",
        "This verdict might be good for Muslim women, but what has this got to do with religious polarization??",
        "The court reiterating it is also worth celebrating it, but the article was a good read anyways. There are many other laws which are unfavourable to the Muslim women (shariat laws) unlike other religions and we need secular laws for them. Even abolition of triple talaq and allowing women adoption by the sc was a welcome step.",
        "Read the article, it's a good read. Anyways the writer is saying this because - \n> We live in an era of religious polarisation. The condition of Muslim women is used to portray the community negatively.",
        "And this law won't fix that ",
        "I have never seen anyone or heard even remotely any distant relative practising halala! And regarding the divorce etc., just saying talaq 3 times doesn't make it eligible for one to get divorce certificate, the process is same for all.",
        "So triple talaq wasn't practiced before the sc abolished it , according to you? A Muslim woman wrote the article, she must also be knowing na what's happening and what's not?",
        "I didn't deny triple talaq, i denied halala. Man you seem to be stubborn to prove me wrong when I'm already aligning with most of what you said.\n\nWhen I'm talking about bigger issues that is affecting women irrespective of religion, for instance dowry... You at talking about Muslim women rights!\n\nTriple talaq is a very very rare scenario practised by idiots but that doesn't mean it doesn't exist. And what did government do? Made compulsory jail which is not the right way ahead because if one Muslim wife has issue with husband she will file case of triple talaq hence he goes to jail without bail... Hereby ending any chances of reconciliation. Settlement is not the best scenario but jailing isn't either.\n\nLike you said proper liberal thoughts must be taught to families but given the government works 24/7 on marketing their achievements towards helping Muslim women when actually their goals are not helpful in ground reality.\n\nI have seen worse cases of kangaroo courts too, these backward minded thinking is not just restricted to Muslims. But you are on pointing on only Muslim women.",
        "Why is it Shariq complaint in a secular country? Why Muslims preach secularism but don't practise it?",
        "Hopefully the government brings ucc soon."
    ],
    "cleaned_text": "time religious polarisation supreme court verdict alimony muslim women step forward muslim women continue denied quranic rights well constitutional rights sc verdict enable fight justice ",
    "cleaned_title": "time religious polarisation supreme court verdict alimony muslim women step forward",
    "cleaned_selftext": "muslim women continue denied quranic rights well constitutional rights sc verdict enable fight justice",
    "cleaned_comments": "lot reforms needed muslim women want give basic human rights striving equal rights men women equal opportunities education work fair man support woman divorce man jobless woman earning well would verdict opposite afaik opposite also possible excerpts celebrating judgment section nothing new existed since upholding diversity pluralism important secular democracy includes diversity personal laws must confuse diversity unjust patriarchal practices nothing laudatory personal subjugation women violation rights quran emphasises maintenance provided wife divorce however husbands often continue look loopholes happened case shah bano husband refused pay maintenance granted court conservative clergy leaders jumped bandwagon defend personal laws imposition secular laws muslims called interference shariat thereby violation minority rights rajiv gandhiled government came pressure overturned legislation ruling granted maintenance shah bano separate shariatcompliant law hastily enacted provide maintenance divorced muslim women bjp began accuse congress muslim appeasement sense shah bano episode kickstarted politics religious division seven decades since independence government felt obliged enable muslim women attain legal parity hindu christian counterparts enjoy protection reformed personal laws enacted parliament government felt need fulfil constitutional obligation upholding gender justice though granting legal rights muslim women would go principles secularism indian muslims governed shariat application act law archaic merely states shariat decide personal law matters muslims muslims ostensibly governed shariat reality unjust unfair practices based arbitrary interpretations prevail several important issues lack legal clarity patriarchal interpretations decide matters age marriage divorce maintenance polygamy halala custody guardianship children share property inheritance muta marriages islamic concepts consent mehr diluted practice muslim marriage contract women dont possess copy nikahnama unaware rights moreover common sense prevalent husband superior marital relationships dominant conservative clergy resisted reform islam gave rights women years ago say rights available women anyone raises questions demonised calls reform dismissed handiwork serving western ways thinking days hindutva scenario muslim women continue denied quranic rights well constitutional rights live era religious polarisation condition muslim women used portray community negatively hand many muslims living sense fear insecurity hardly position appreciate progressive verdict orthodoxy would club ongoing onslaught muslim identity dismiss unwarranted silver lining large number people within community welcome judgment greater consciousness rights amongst women families womenled movement instant triple talaq received support whole community highlighted enjoy quranic sanction justice nagarathna emphasised maintenance must viewed charity fundamental right right transcends religious boundaries muslim community needs reforms backward minded thinking limited muslims whole male perspective towards women must retaught thing patriarchy affects every woman least reformed laws help hindu christian women muslim women dont even sadly help wan na fight back muslim women per law hindu women already got patriarchal interpretations decide matters age marriage divorce maintenance polygamy halala custody guardianship children share property inheritance muta marriages islamic concepts consent mehr diluted practice better laws regarding suggest read article im confused seen many many muslim men giving court ordered alimony women women making unreasonable demands settle divorce cases really true muslim women receive alimony yeah right many people mislabeling landmark judgement landmark latifi judgement court basically restored assurances made shah bano caso effectively nullified muslim women act brought rajeev gandhi court reiterated earlier position thanks clarification makes sense guess ppl unaware celebrating verdict might good muslim women got religious polarization court reiterating also worth celebrating article good read anyways many laws unfavourable muslim women shariat laws unlike religions need secular laws even abolition triple talaq allowing women adoption sc welcome step read article good read anyways writer saying live era religious polarisation condition muslim women used portray community negatively law wont fix never seen anyone heard even remotely distant relative practising halala regarding divorce etc saying talaq times doesnt make eligible one get divorce certificate process triple talaq wasnt practiced sc abolished according muslim woman wrote article must also knowing na whats happening whats didnt deny triple talaq denied halala man seem stubborn prove wrong im already aligning said im talking bigger issues affecting women irrespective religion instance dowry talking muslim women rights triple talaq rare scenario practised idiots doesnt mean doesnt exist government made compulsory jail right way ahead one muslim wife issue husband file case triple talaq hence goes jail without bail hereby ending chances reconciliation settlement best scenario jailing isnt either like said proper liberal thoughts must taught families given government works marketing achievements towards helping muslim women actually goals helpful ground reality seen worse cases kangaroo courts backward minded thinking restricted muslims pointing muslim women shariq complaint secular country muslims preach secularism dont practise hopefully government brings ucc soon",
    "light_cleaned_title": "In a time of religious polarisation, Supreme Court verdict on alimony for Muslim women is a step forward",
    "light_cleaned_selftext": "Muslim women continue to be denied their Quranic rights as well as constitutional rights. SC verdict can enable them to fight for justice.",
    "light_cleaned_comments": "There are a lot of reforms needed for Muslim women if we want to give them basic human rights. If we are striving for equal rights between men and women and equal opportunities in education and work, then is it fair that a man should support a woman after divorce? If a man is jobless and the woman was earning well, would the verdict be the opposite? Afaik the opposite is also possible. Excerpts > Why are we celebrating this judgment? Section 125 is nothing new, it has existed since 1973. Upholding diversity and pluralism is important in a secular democracy. This includes a diversity of personal laws. But we must not confuse diversity with unjust patriarchal practices. There is nothing laudatory or “personal” about the subjugation of women and violation of their rights. > The Quran emphasises maintenance to be provided to the wife after divorce. However, husbands often continue to look for loopholes. This happened in the case of Shah Bano. Her husband refused to pay the maintenance granted by the court. > The conservative clergy and other leaders jumped on the bandwagon to defend personal laws and against the imposition of secular laws on Muslims. They called it interference in Shariat and thereby, a violation of minority rights. The Rajiv Gandhi-led government came under pressure and overturned through legislation the ruling that granted maintenance to Shah Bano. A separate Shariat-compliant law was hastily enacted to provide maintenance to divorced Muslim women. The BJP began to accuse Congress of Muslim appeasement. In a sense, the Shah Bano episode kickstarted the politics of religious division. > In seven decades since Independence, no government felt obliged to enable Muslim women to attain legal parity with their Hindu and Christian counterparts who enjoy the protection of reformed personal laws enacted by Parliament. No government felt the need to fulfil its constitutional obligation of upholding gender justice. As though granting legal rights to Muslim women would go against the principles of secularism. > Indian Muslims are governed by Shariat Application Act, 1937. This law is archaic. It merely states that Shariat will decide all personal law matters for Muslims. While Muslims are ostensibly governed by Shariat, in reality, unjust and unfair practices based on arbitrary interpretations prevail. Several important issues lack legal clarity. Patriarchal interpretations decide matters such as age of marriage, divorce, maintenance, polygamy, halala, custody and guardianship of children, share in property and inheritance and muta marriages. Islamic concepts of consent and mehr are diluted in practice. > Muslim marriage is a contract. But most women don’t possess a copy of their nikahnama and are unaware of their rights. Moreover, there is a common sense prevalent about the husband being superior in marital relationships. > The dominant conservative clergy have resisted reform. “Islam gave rights to women 1,400 years ago,” they say. But are these rights available to women? Anyone who raises such questions is demonised. Calls for reform are dismissed as the handiwork of those serving Western ways of thinking or these days, Hindutva. In this scenario, Muslim women continue to be denied their Quranic rights as well as constitutional rights. > We live in an era of religious polarisation. The condition of Muslim women is used to portray the community negatively. On the other hand, many Muslims are living under a sense of fear and insecurity. They are hardly in a position to appreciate this progressive verdict. The orthodoxy would club it with the ongoing onslaught on Muslim identity and dismiss it as unwarranted. The silver lining is that there are a large number of people within the community who welcome this judgment. There is a greater consciousness about rights not just amongst women themselves but their families too. The women-led movement against instant triple talaq received support from the whole community after it was highlighted that it does not enjoy Quranic sanction. > Justice Nagarathna emphasised that maintenance must not be viewed as charity but as a fundamental right. It is a right that transcends religious boundaries. Muslim community itself needs reforms but then some backward minded thinking to not just limited to Muslims, the whole male perspective towards women must be retaught. The thing is patriarchy affects every woman. But at least the reformed laws help Hindu and Christian women, Muslim women don't even have that sadly to help them if they wanna fight back. What does Muslim women not have as per law, that Hindu women already got? > Patriarchal interpretations decide matters such as age of marriage, divorce, maintenance, polygamy, halala, custody and guardianship of children, share in property and inheritance and muta marriages. Islamic concepts of consent and mehr are diluted in practice. Better laws regarding all of this. Suggest you to read the article once. Im confused. I have seen many many Muslim men giving court ordered alimony to women and women making unreasonable demands to settle the divorce cases. Is it really true Muslim women do not receive alimony? Yeah you are right, many people are mislabeling it as a landmark judgement which it's not. In the 'landmark' latifi judgement the court basically restored the assurances made in Shah bano caso and effectively nullified the Muslim women act brought by Rajeev gandhi. The court has only reiterated its earlier position here. Thanks for the clarification. That makes sense.. I guess its ppl who are unaware who are celebrating this... This verdict might be good for Muslim women, but what has this got to do with religious polarization?? The court reiterating it is also worth celebrating it, but the article was a good read anyways. There are many other laws which are unfavourable to the Muslim women (shariat laws) unlike other religions and we need secular laws for them. Even abolition of triple talaq and allowing women adoption by the sc was a welcome step. Read the article, it's a good read. Anyways the writer is saying this because - > We live in an era of religious polarisation. The condition of Muslim women is used to portray the community negatively. And this law won't fix that I have never seen anyone or heard even remotely any distant relative practising halala! And regarding the divorce etc., just saying talaq 3 times doesn't make it eligible for one to get divorce certificate, the process is same for all. So triple talaq wasn't practiced before the sc abolished it , according to you? A Muslim woman wrote the article, she must also be knowing na what's happening and what's not? I didn't deny triple talaq, i denied halala. Man you seem to be stubborn to prove me wrong when I'm already aligning with most of what you said. When I'm talking about bigger issues that is affecting women irrespective of religion, for instance dowry... You at talking about Muslim women rights! Triple talaq is a very very rare scenario practised by idiots but that doesn't mean it doesn't exist. And what did government do? Made compulsory jail which is not the right way ahead because if one Muslim wife has issue with husband she will file case of triple talaq hence he goes to jail without bail... Hereby ending any chances of reconciliation. Settlement is not the best scenario but jailing isn't either. Like you said proper liberal thoughts must be taught to families but given the government works 24/7 on marketing their achievements towards helping Muslim women when actually their goals are not helpful in ground reality. I have seen worse cases of kangaroo courts too, these backward minded thinking is not just restricted to Muslims. But you are on pointing on only Muslim women. Why is it Shariq complaint in a secular country? Why Muslims preach secularism but don't practise it? Hopefully the government brings ucc soon."
}