{
    "id": "14khw7i",
    "title": "If triple talaq is essential to Islam, why is it absent in Muslim majority countries: PM Modi",
    "url": "https://indianexpress.com/article/india/narendra-modi-bjp-booth-workers-programme-8688160/",
    "selftext": "Iss sajjan ko kya taplik hai?",
    "flair": "Politics",
    "score": 168,
    "num_comments": 81,
    "created_utc": 1687882346.0,
    "convurl": "https://external-preview.redd.it/Rr7ZLxByZf4GVdt00OeeOApf3dxI1HjqGfpxNzMCRGk.jpg?auto=webp&v=enabled&s=d1c4053c0ae034bfbf0808e7eef342d3655e0482",
    "comments": [
        "Here we go again. This dude fails miserably to gain approval on basis of positive development of country and rather relies heavily on either Muslims or Gandhi-Nehru family.",
        "Answer to \"Kya ho raha tha India mein\"",
        "Still not over triple talaq ?",
        "Triple talaq is against women rights. Rare moment he is right.",
        "A very thought provoking question for scientists & AI to ponder about after they failed to answer the previous question,\n\nIf it’s cloudy in Pakistan, what is the fuggin use of Radar?",
        "He is right though",
        "Is bande ne khud ne biwi chod rakhi hai.\nIsko koi moral rights nahi is par bolne ke",
        "But also he himself ran away from his wife \n.\nAtleast he has no moral rights to preach other on this topic",
        "Fighting for women rights with brijbhushan and several others",
        "Khud ki biwi chod ke bhag gaya..dusro ko sikha raha",
        "Oh so I did something wrong, so anything I say from now on is just flat out wrong? Once a sinner, always a sinner? Stfu.",
        "Stfu. You screwed up divorce topic than you can’t preach other on divorce.\nYou can preach on radar etc other topics if you are expert on them .. \n\nYou are idiot to understand it the way you wrote or a bhkt",
        "Didn't Divorce her tho",
        "Does anyone actually even support triple talaq anymore?",
        "Does that make triple talaq right. Don't hate everything someone says blindly and don't defend blindly that makes you seem like fool.",
        "The worse case scenario.. ruined her life",
        "He is making comment as a PM, and about his personal life.",
        "Did Idefended triple talak??? I just mean he got no morals rights to preach other on this topic",
        "Nothing illegal here, Man is not a slave to his wife. Husband can get up and leave if he is not feeling comfortable and loved in the marriage.",
        "Ye parmanu nuclear fusion ki or chala/s",
        "Nothing illegal but morally wrong. \nShould have told her instead of fleeing overnight",
        "Can nirav modi comment on bank fraud if some how he became rbi guv?  Can asaram preach on minor rapes??\nDoes one get moral rights to preach others on a subject when they themselves failed on it",
        "That's true but triple talaq needs to go.",
        "-> if somehow he became a rbi guy     \nExcept he can’t, so you are trying to pull arguments out of your ass",
        "Why be in a loveless marriage tho ? Would you judge people who are divorced? \n\nThere are a 1000 areas where you can criticise Modi , no need to show your backward thinking by talking about what is morally right or wrong in a marriage that doesn't involve you",
        "Was hypothetical but Let’s Replace him with adani..",
        "Adani doesn’t have a criminal charge so yeah he can.\nAlso the topic here is mentioned in regard to ucc bill , which make sense",
        "Leave with dignity.\nWhy did you assume I meant they should leave together forever???",
        "Aah adani is clean!!!\nBye bye bhkt no point talking to you.. will not reply anymore",
        "Except whether he is clean or not is upto law to decide , but that doesn’t mean if he propose a bill it should be thrown away because he brought it.",
        "Karvali bezati :)",
        "Jashodaben real Id se aa \n\nPs: you're all over the post. All good bruh",
        "Abb tak 31 Modi bhkto ki jali hai..\nItani khushi mujhe aaj tak nahi mili\nEdit : 50 bhkto ki chaddi jali",
        "Give zero fk to redditors",
        "to be fair he was just 18 tho. Can't blame a child",
        "Plenty of people in this country.",
        "I am pretty anti-bjp and don't like Modi. But he is correct in this case.  Religion cannot be the cornerstone of any law framework .",
        "Bal narendra kitab nahi padhi lagta tumne",
        "I have a hot take - a system like triple-talaq should be available to all Indians. Women, men, Hindus, Muslims, everyone should be able to move on from marriages they don't want without being forced into the cruel delays imposed by courts in India. Former cricketer Maninder Singh had to go through a 20 year divorce case before it was finally granted because his ex-wife wanted to deny it.",
        "He's talking about this in relation to UCC.\n\nGiving us a glimpse into what the agenda in the third term will be if he wins.",
        "Its already gone. But you cannot get vote over it unless you keep bringing it up",
        "Good. Let's do polygamy next.",
        "Muslims need to chill fr",
        "I don't like him or his party, but this argument of yours is lame.",
        "There is a system like that already present. It's called DON'T FUCKING MARRY.",
        "Triple talaq is dumb. Talking about triple talaq to distract people from your own Government's failure is dumber.\n\nIdiot bhakts lapping this garbage up are the dumbest.",
        "He's playing supreme court's greatest hits to his fans, who as usual give him credit where credit is due (to the supreme court).",
        "What's so significant about triple, why not two times or four times? Five times would be a good round number",
        "Any law or judiciary that uses religion to justify itself in this day and age needs to be reformed and rethought. Religion is a crutch of a bygone era, one that should be at best practiced in the privacy of one's home.",
        "People have no Islamic knowledge of triple talaq, yet keep lecturing each other.",
        "Yeahh to get a divorce you have to marry… you can’t take apples from someone who doesn’t have apples",
        "Ever heard of live-in?",
        "Then it’s not a divorce…"
    ],
    "cleaned_text": "triple talaq essential islam absent muslim majority countries pm modi iss sajjan ko kya taplik hai ",
    "cleaned_title": "triple talaq essential islam absent muslim majority countries pm modi",
    "cleaned_selftext": "iss sajjan ko kya taplik hai",
    "cleaned_comments": "go dude fails miserably gain approval basis positive development country rather relies heavily either muslims gandhinehru family answer kya ho raha tha india mein still triple talaq triple talaq women rights rare moment right thought provoking question scientists ai ponder failed answer previous question cloudy pakistan fuggin use radar right though bande ne khud ne biwi chod rakhi hai isko koi moral rights nahi par bolne ke also ran away wife atleast moral rights preach topic fighting women rights brijbhushan several others khud ki biwi chod ke bhag gayadusro ko sikha raha oh something wrong anything say flat wrong sinner always sinner stfu stfu screwed divorce topic cant preach divorce preach radar etc topics expert idiot understand way wrote bhkt didnt divorce tho anyone actually even support triple talaq anymore make triple talaq right dont hate everything someone says blindly dont defend blindly makes seem like fool worse case scenario ruined life making comment pm personal life idefended triple talak mean got morals rights preach topic nothing illegal man slave wife husband get leave feeling comfortable loved marriage ye parmanu nuclear fusion ki chalas nothing illegal morally wrong told instead fleeing overnight nirav modi comment bank fraud became rbi guv asaram preach minor rapes one get moral rights preach others subject failed thats true triple talaq needs go somehow became rbi guy except cant trying pull arguments ass loveless marriage tho would judge people divorced areas criticise modi need show backward thinking talking morally right wrong marriage doesnt involve hypothetical lets replace adani adani doesnt criminal charge yeah also topic mentioned regard ucc bill make sense leave dignity assume meant leave together forever aah adani clean bye bye bhkt point talking reply anymore except whether clean upto law decide doesnt mean propose bill thrown away brought karvali bezati jashodaben real id se aa ps youre post good bruh abb tak modi bhkto ki jali hai itani khushi mujhe aaj tak nahi mili edit bhkto ki chaddi jali give zero fk redditors fair tho cant blame child plenty people country pretty antibjp dont like modi correct case religion cornerstone law framework bal narendra kitab nahi padhi lagta tumne hot take system like tripletalaq available indians women men hindus muslims everyone able move marriages dont want without forced cruel delays imposed courts india former cricketer maninder singh go year divorce case finally granted exwife wanted deny hes talking relation ucc giving us glimpse agenda third term wins already gone get vote unless keep bringing good lets polygamy next muslims need chill fr dont like party argument lame system like already present called dont fucking marry triple talaq dumb talking triple talaq distract people governments failure dumber idiot bhakts lapping garbage dumbest hes playing supreme courts greatest hits fans usual give credit credit due supreme court whats significant triple two times four times five times would good round number law judiciary uses religion justify day age needs reformed rethought religion crutch bygone era one best practiced privacy ones home people islamic knowledge triple talaq yet keep lecturing yeahh get divorce marry cant take apples someone doesnt apples ever heard livein divorce",
    "light_cleaned_title": "If triple talaq is essential to Islam, why is it absent in Muslim majority countries: PM Modi",
    "light_cleaned_selftext": "Iss sajjan ko kya taplik hai?",
    "light_cleaned_comments": "Here we go again. This dude fails miserably to gain approval on basis of positive development of country and rather relies heavily on either Muslims or Gandhi-Nehru family. Answer to \"Kya ho raha tha India mein\" Still not over triple talaq ? Triple talaq is against women rights. Rare moment he is right. A very thought provoking question for scientists & AI to ponder about after they failed to answer the previous question, If it’s cloudy in Pakistan, what is the fuggin use of Radar? He is right though Is bande ne khud ne biwi chod rakhi hai. Isko koi moral rights nahi is par bolne ke But also he himself ran away from his wife . Atleast he has no moral rights to preach other on this topic Fighting for women rights with brijbhushan and several others Khud ki biwi chod ke bhag gaya..dusro ko sikha raha Oh so I did something wrong, so anything I say from now on is just flat out wrong? Once a sinner, always a sinner? Stfu. Stfu. You screwed up divorce topic than you can’t preach other on divorce. You can preach on radar etc other topics if you are expert on them .. You are idiot to understand it the way you wrote or a bhkt Didn't Divorce her tho Does anyone actually even support triple talaq anymore? Does that make triple talaq right. Don't hate everything someone says blindly and don't defend blindly that makes you seem like fool. The worse case scenario.. ruined her life He is making comment as a PM, and about his personal life. Did Idefended triple talak??? I just mean he got no morals rights to preach other on this topic Nothing illegal here, Man is not a slave to his wife. Husband can get up and leave if he is not feeling comfortable and loved in the marriage. Ye parmanu nuclear fusion ki or chala/s Nothing illegal but morally wrong. Should have told her instead of fleeing overnight Can nirav modi comment on bank fraud if some how he became rbi guv? Can asaram preach on minor rapes?? Does one get moral rights to preach others on a subject when they themselves failed on it That's true but triple talaq needs to go. -> if somehow he became a rbi guy Except he can’t, so you are trying to pull arguments out of your ass Why be in a loveless marriage tho ? Would you judge people who are divorced? There are a 1000 areas where you can criticise Modi , no need to show your backward thinking by talking about what is morally right or wrong in a marriage that doesn't involve you Was hypothetical but Let’s Replace him with adani.. Adani doesn’t have a criminal charge so yeah he can. Also the topic here is mentioned in regard to ucc bill , which make sense Leave with dignity. Why did you assume I meant they should leave together forever??? Aah adani is clean!!! Bye bye bhkt no point talking to you.. will not reply anymore Except whether he is clean or not is upto law to decide , but that doesn’t mean if he propose a bill it should be thrown away because he brought it. Karvali bezati :) Jashodaben real Id se aa Ps: you're all over the post. All good bruh Abb tak 31 Modi bhkto ki jali hai.. Itani khushi mujhe aaj tak nahi mili Edit : 50 bhkto ki chaddi jali Give zero fk to redditors to be fair he was just 18 tho. Can't blame a child Plenty of people in this country. I am pretty anti-bjp and don't like Modi. But he is correct in this case. Religion cannot be the cornerstone of any law framework . Bal narendra kitab nahi padhi lagta tumne I have a hot take - a system like triple-talaq should be available to all Indians. Women, men, Hindus, Muslims, everyone should be able to move on from marriages they don't want without being forced into the cruel delays imposed by courts in India. Former cricketer Maninder Singh had to go through a 20 year divorce case before it was finally granted because his ex-wife wanted to deny it. He's talking about this in relation to UCC. Giving us a glimpse into what the agenda in the third term will be if he wins. Its already gone. But you cannot get vote over it unless you keep bringing it up Good. Let's do polygamy next. Muslims need to chill fr I don't like him or his party, but this argument of yours is lame. There is a system like that already present. It's called DON'T FUCKING MARRY. Triple talaq is dumb. Talking about triple talaq to distract people from your own Government's failure is dumber. Idiot bhakts lapping this garbage up are the dumbest. He's playing supreme court's greatest hits to his fans, who as usual give him credit where credit is due (to the supreme court). What's so significant about triple, why not two times or four times? Five times would be a good round number Any law or judiciary that uses religion to justify itself in this day and age needs to be reformed and rethought. Religion is a crutch of a bygone era, one that should be at best practiced in the privacy of one's home. People have no Islamic knowledge of triple talaq, yet keep lecturing each other. Yeahh to get a divorce you have to marry… you can’t take apples from someone who doesn’t have apples Ever heard of live-in? Then it’s not a divorce…"
}