{
    "id": "19ags23",
    "title": "Got scammed, online cloth shopping website, police won't take it seriously",
    "url": "https://www.reddit.com/r/india/comments/19ags23/got_scammed_online_cloth_shopping_website_police/",
    "selftext": "Last week bought a Kurta set via https://aveattireset.in\n\n\nThey delivered product today (COD). The product was some cheap quality unstitched random pieces of clothes and not the one ordered. The company address is fake and they won't pick the call or respond to the mails. The company is based.in Gujrat. \nThis is their contact : +91 81608 80497. \n\nContacted cyber crime helpline and the local police station. The local police station did try to contact the courier service and informed me that they can't do much. They just asked me to come and write a written complaint. From what I understood, they kind of told me that cyber crime is on the rise and there is not much they can do. \n\nWill write a formal complaint in the cyber crime website,unsure if there will be any follow uo action. \nIs there anything else that can be done. \n\nI contacted Xpressbess courier who delivers the product, they said they will look into providing their client details.",
    "flair": "Crime",
    "score": 6,
    "num_comments": 4,
    "created_utc": 1705662851.0,
    "convurl": "https://external-preview.redd.it/GiIj7TIsUxIC0ObhKC6z7PjGLrpaDnLOte3_aCi4BbI.jpg?auto=webp&s=4d61a77892d6b1ae920a1f9071d009af536c0368",
    "comments": [
        "Just approved this. Feel free to post again if this doesn’t get enough attention.",
        "It's a common scam by Gujarat based scamsters. Shopify sites, 100s of URLs, a lot of Instagram Ads and same modus operandi."
    ],
    "cleaned_text": "got scammed online cloth shopping website police wont take seriously last week bought kurta set via delivered product today cod product cheap quality unstitched random pieces clothes one ordered company address fake wont pick call respond mails company basedin gujrat contact contacted cyber crime helpline local police station local police station try contact courier service informed cant much asked come write written complaint understood kind told cyber crime rise much write formal complaint cyber crime websiteunsure follow uo action anything else done contacted xpressbess courier delivers product said look providing client details ",
    "cleaned_title": "got scammed online cloth shopping website police wont take seriously",
    "cleaned_selftext": "last week bought kurta set via delivered product today cod product cheap quality unstitched random pieces clothes one ordered company address fake wont pick call respond mails company basedin gujrat contact contacted cyber crime helpline local police station local police station try contact courier service informed cant much asked come write written complaint understood kind told cyber crime rise much write formal complaint cyber crime websiteunsure follow uo action anything else done contacted xpressbess courier delivers product said look providing client details",
    "cleaned_comments": "approved feel free post doesnt get enough attention common scam gujarat based scamsters shopify sites urls lot instagram ads modus operandi",
    "light_cleaned_title": "Got scammed, online cloth shopping website, police won't take it seriously",
    "light_cleaned_selftext": "Last week bought a Kurta set via They delivered product today (COD). The product was some cheap quality unstitched random pieces of clothes and not the one ordered. The company address is fake and they won't pick the call or respond to the mails. The company is based.in Gujrat. This is their contact : +91 81608 80497. Contacted cyber crime helpline and the local police station. The local police station did try to contact the courier service and informed me that they can't do much. They just asked me to come and write a written complaint. From what I understood, they kind of told me that cyber crime is on the rise and there is not much they can do. Will write a formal complaint in the cyber crime website,unsure if there will be any follow uo action. Is there anything else that can be done. I contacted Xpressbess courier who delivers the product, they said they will look into providing their client details.",
    "light_cleaned_comments": "Just approved this. Feel free to post again if this doesn’t get enough attention. It's a common scam by Gujarat based scamsters. Shopify sites, 100s of URLs, a lot of Instagram Ads and same modus operandi."
}