{
    "id": "14ccrwa",
    "title": "Beware of MLMs such as Forver Living Products (FLP) which are basically a pyramid scheme made to scam you and your loved ones.",
    "url": "https://www.reddit.com/r/india/comments/14ccrwa/beware_of_mlms_such_as_forver_living_products_flp/",
    "selftext": "A few days ago I was given a good* opportunity of earning 20-30k a month with 2-3hrs daily wfh. It was from a company called Forever Living Product. \nDo not ever fall for their shit, they'll promise you a lot of things such as being your own boss, starting your own business (with a \"Small\" Investment). \nMy \"Onboarding\" Started with 3 1-1.5hr discussions with chhapri looking kids all in their early 20s using their influence to get money from a pyramid scheme and in turn getting more and more people enrolled in their business model which is basically as follows: to work there you have to pay the company anywhere between 7 (what I was offered) to 30k and in return they'll send you their shitty ass products which won't even be worth a quarter of what you're paying. After that you work for them as \"HR\"s onboarding more and more people to fund their pyramid. Stay away from FLP and these MLM (Multi Level Marketing). Any company who asks for a significant amount of oney before employment as most likely a pyramid scheme, they will shit talk corporate employees, preach just how much they make from their job and basically try to brainwash you by showing office trips, cars and other cash flex to influence young kids to invest. One thing that stood out to me as the most stupid shit was them asking people to not talk to your parents cos \"Bura mat manana lekin aapke parents kaafi purane khayalat ke honge, kyuki mere bhi the, toh unse kisi aur reason se paise maang lena woh ye sab nai cheezein nahi samajhte\". Like bro can you sound less like a scammer. Network Marketing ke naam pe chalate hai ye sab kuchh ye log. \nI'm adding the Instagram IDs of these Influencers below, I don't want anyone to show them hate but just be beware whenever you see lowlife puppets like them and dont make the mistake of falling into their scam like a lot of others do. \nAlso posting from alt cos they have my personal info and main account has my name in it 🥲\n\nScammer IDs\n1. Tushar Garg: https://imgur.com/a/bk37GMr\n2. Shivam: https://imgur.com/a/PAplCKS \n3. Abhishek Kasana: https://imgur.com/a/5l0tTAO",
    "flair": "Crime",
    "score": 71,
    "num_comments": 5,
    "created_utc": 1687068734.0,
    "convurl": "https://external-preview.redd.it/UZU5Qh6Bcbl90rsyB2tA3gRZM5QmCwOQKESD5b0uCOQ.jpg?auto=webp&v=enabled&s=bc1a69fab185c9fabb2aae8d9b58929b20954060",
    "comments": [
        "r/antimlm",
        "R/Mumbai"
    ],
    "cleaned_text": "beware mlms forver living products flp basically pyramid scheme made scam loved ones days ago given good opportunity earning k month hrs daily wfh company called forever living product ever fall shit theyll promise lot things boss starting business small investment onboarding started hr discussions chhapri looking kids early using influence get money pyramid scheme turn getting people enrolled business model basically follows work pay company anywhere offered k return theyll send shitty ass products wont even worth quarter youre paying work hrs onboarding people fund pyramid stay away flp mlm multi level marketing company asks significant amount oney employment likely pyramid scheme shit talk corporate employees preach much make job basically try brainwash showing office trips cars cash flex influence young kids invest one thing stood stupid shit asking people talk parents cos bura mat manana lekin aapke parents kaafi purane khayalat ke honge kyuki mere bhi toh unse kisi aur reason se paise maang lena woh ye sab nai cheezein nahi samajhte like bro sound less like scammer network marketing ke naam pe chalate hai ye sab kuchh ye log im adding instagram ids influencers dont want anyone show hate beware whenever see lowlife puppets like dont make mistake falling scam like lot others also posting alt cos personal info main account name scammer ids tushar garg shivam abhishek kasana ",
    "cleaned_title": "beware mlms forver living products flp basically pyramid scheme made scam loved ones",
    "cleaned_selftext": "days ago given good opportunity earning k month hrs daily wfh company called forever living product ever fall shit theyll promise lot things boss starting business small investment onboarding started hr discussions chhapri looking kids early using influence get money pyramid scheme turn getting people enrolled business model basically follows work pay company anywhere offered k return theyll send shitty ass products wont even worth quarter youre paying work hrs onboarding people fund pyramid stay away flp mlm multi level marketing company asks significant amount oney employment likely pyramid scheme shit talk corporate employees preach much make job basically try brainwash showing office trips cars cash flex influence young kids invest one thing stood stupid shit asking people talk parents cos bura mat manana lekin aapke parents kaafi purane khayalat ke honge kyuki mere bhi toh unse kisi aur reason se paise maang lena woh ye sab nai cheezein nahi samajhte like bro sound less like scammer network marketing ke naam pe chalate hai ye sab kuchh ye log im adding instagram ids influencers dont want anyone show hate beware whenever see lowlife puppets like dont make mistake falling scam like lot others also posting alt cos personal info main account name scammer ids tushar garg shivam abhishek kasana",
    "cleaned_comments": "rantimlm rmumbai",
    "light_cleaned_title": "Beware of MLMs such as Forver Living Products (FLP) which are basically a pyramid scheme made to scam you and your loved ones.",
    "light_cleaned_selftext": "A few days ago I was given a good* opportunity of earning 20-30k a month with 2-3hrs daily wfh. It was from a company called Forever Living Product. Do not ever fall for their shit, they'll promise you a lot of things such as being your own boss, starting your own business (with a \"Small\" Investment). My \"Onboarding\" Started with 3 1-1.5hr discussions with chhapri looking kids all in their early 20s using their influence to get money from a pyramid scheme and in turn getting more and more people enrolled in their business model which is basically as follows: to work there you have to pay the company anywhere between 7 (what I was offered) to 30k and in return they'll send you their shitty ass products which won't even be worth a quarter of what you're paying. After that you work for them as \"HR\"s onboarding more and more people to fund their pyramid. Stay away from FLP and these MLM (Multi Level Marketing). Any company who asks for a significant amount of oney before employment as most likely a pyramid scheme, they will shit talk corporate employees, preach just how much they make from their job and basically try to brainwash you by showing office trips, cars and other cash flex to influence young kids to invest. One thing that stood out to me as the most stupid shit was them asking people to not talk to your parents cos \"Bura mat manana lekin aapke parents kaafi purane khayalat ke honge, kyuki mere bhi the, toh unse kisi aur reason se paise maang lena woh ye sab nai cheezein nahi samajhte\". Like bro can you sound less like a scammer. Network Marketing ke naam pe chalate hai ye sab kuchh ye log. I'm adding the Instagram IDs of these Influencers below, I don't want anyone to show them hate but just be beware whenever you see lowlife puppets like them and dont make the mistake of falling into their scam like a lot of others do. Also posting from alt cos they have my personal info and main account has my name in it 🥲 Scammer IDs 1. Tushar Garg: 2. Shivam: 3. Abhishek Kasana:",
    "light_cleaned_comments": "r/antimlm R/Mumbai"
}