{
    "id": "192glrn",
    "title": "This is the reason why Indians are mocked on social media",
    "url": "https://www.reddit.com/gallery/192glrn",
    "selftext": "I never realised this but a lot of women use alt accounts pretending to be an Indian to send weird dms and stalk people. Indians have such a bad rep on using social media but most of it is not even us, just fake accounts posing as the most stereotypical Indian.",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 4,
    "created_utc": 1704812369.0,
    "convurl": "https://i.redd.it/a3m1mk5gifbc1.jpg",
    "comments": [
        "Not even surprised at this point",
        "Ok.",
        "Saying most of it is women pretending to be Indian men is a totally baseless claim. There is a big problem in India with sexual harassment that has carried over to the internet. Closing your eyes and pretending it doesn’t exist does nothing to change it and very much enables it"
    ],
    "cleaned_text": "reason indians mocked social media never realised lot women use alt accounts pretending indian send weird dms stalk people indians bad rep using social media even us fake accounts posing stereotypical indian ",
    "cleaned_title": "reason indians mocked social media",
    "cleaned_selftext": "never realised lot women use alt accounts pretending indian send weird dms stalk people indians bad rep using social media even us fake accounts posing stereotypical indian",
    "cleaned_comments": "even surprised point ok saying women pretending indian men totally baseless claim big problem india sexual harassment carried internet closing eyes pretending doesnt exist nothing change much enables",
    "light_cleaned_title": "This is the reason why Indians are mocked on social media",
    "light_cleaned_selftext": "I never realised this but a lot of women use alt accounts pretending to be an Indian to send weird dms and stalk people. Indians have such a bad rep on using social media but most of it is not even us, just fake accounts posing as the most stereotypical Indian.",
    "light_cleaned_comments": "Not even surprised at this point Ok. Saying most of it is women pretending to be Indian men is a totally baseless claim. There is a big problem in India with sexual harassment that has carried over to the internet. Closing your eyes and pretending it doesn’t exist does nothing to change it and very much enables it"
}