{
    "id": "1ceebl7",
    "title": "BJP-JDS MP, grandson of former Prime Minister, is accused of rape & sexual harassment. Why Media is Silent?",
    "url": "https://www.reddit.com/r/india/comments/1ceebl7/bjpjds_mp_grandson_of_former_prime_minister_is/",
    "selftext": "In Karnataka, from last few days there's a huge sex scandal (I don't know what else to call it) came to light accusing the Prajval Revanna, (Current MP from Hassan and grandson of former prime minister HD Devegowda and nephew of former Karnataka Chief minister HD Kumaraswamy.) of raping several women. I thought it was some election propaganda from opposition parties, so did not bother much. \n\nBut today two women (house hold workers) came to live TV Channel and accused both Prajval Revanna & his father HD Revanna of sexual harassment, these women are former workers at Prajval Revanna's house in Holenarasi pura, (his hometown in Hassan District). This is huge in the eyes of law, because two women came out and accusing openly of sexual harassment, now I believe it is more than election propaganda. I saw few videos where couple of MLA's expressed concern and Women welfare association president said, she has complained to the commissioner and demanded for investigation. \n\nAlso, yesterday DCM of Karnataka mentioned this incident briefly in an interview. Other than that everybody is silent, I don't know why, no major TV channels are covering it, nobody, who is powerful enough ever mentioned this incident at all, surprisingly nobody from HD Devegowda family nor anyone from BJP said anything about this (at least they should have denied about these incident ever happened), I am baffled at this point, I am truly questioning the society I am living in. I know Devegowda is from powerful caste, but most of the women who were being harassed are from their own caste. Also, he recorded several selfie/normal videos with female bureaucrats making them strip clothes.\n\nMy question is, at this point it's not politics anymore, everybody in the Karnataka know about this incident (at least powerful people), but they are all silent including media, why? is it fear? Being a Kannadiga myself, I did not know Kannadigas are this cowards. \n\n\n[Source (In Kannada)](https://www.youtube.com/live/2b6VNwmbkxU?si=nNE1dTiRJdXTRChk)\n\nTLDR - Prajval Revanna, the current MP and Grandson of former PM Devegowda has been accused of rapes & sexual harassment, but media is silent why?",
    "flair": "Law & Courts",
    "score": 344,
    "num_comments": 24,
    "created_utc": 1714223816.0,
    "convurl": "https://external-preview.redd.it/e6KH5IkV1Wc-7TdTHselQk8AaNwP0F00KOqDDWrj2rw.jpg?auto=webp&s=c8e990a24674258e75bb31e39d4cf26d312b1d87",
    "comments": [
        "Pre-2016 indian media was peak",
        "He has got a stay from court asking media not to cover it",
        "That was about videos. But now two women openly accused him, media should cover it.",
        "Houda. Nodteeni",
        "The first sentence in the title is the answer to the Why.\n\nThe first word is the clue to \"rape & sexual harassment\"",
        "Rape murder doesn’t matter if done by BJ party",
        "Karnataka is the new bihar",
        "😂",
        "I mean… it’s blatantly obvious why it’s not covered. But we bring this on ourselves. \n\nMaybe try getting out of the house to vote for the right candidate next time , if you want change. \n\nI mean this more generically and not directly at OP per say",
        "So much of nari shakti.",
        "searched after reading this https://www.youtube.com/live/9-Wkfxv09J8\nnot all no other tv medias are covering",
        "Why is the state government not making a scene out of it and doing the investigation thoroughly to bring him to justice? \n\nBJP would have set an example out of an opposition MP who was accused of such crimes, even if falsely, especially in an election year.",
        "Can someone tell me why an \"Accused\" person must ensure that harassment that comes along with media coverage. The accusation might be true it might be false but untill and unless the crime is proven in the courts the media should not disclose the name of the 'accused' because in our country innocent men's entire future gets destroyed.",
        "I think the reason why not a lot of news channels are openly questioning is due to his family. And until and unless they've all the proof they need, they don't want to go against that family and attract hate from the public. \n\nThe timing of the allegation is obviously making his followers question the validity of the allegations. And I'm not sure if the videos are edited are not, (I've read people saying it's edited and also that it's not), but many people seem to believe those are deep fake videos and it's not actually him. That maybe another reason why you don't see a lot of backlash online.\n\nBut he needs to be punished (and needs to be stripped off his MP title in case he wins, which he most probably will) if this turns out to be true.",
        "I know, but I think it is most likely true. No TV channel would have covered it if all the videos were deep faked. There are more than 2000 video clips and people who have it certainly know they are not faked videos. DCM mentioned it, Power TV channel anchor said videos are 100% real and he has them all. ",
        "Sidaramiah has formed a sit to check the claims \n\nThey should go hammer and tongs in the next rounds of campaigning .",
        "It may actually be real, yes. And the news is gaining traction even in English news channels now, so there'll be some major repercussions I feel",
        "This is 100% real, he fled the country, all ministers spoke about it and CM of Karnataka order a special investigation. But BJP & JDS completely silent about this.",
        "Hopefully the affected get the justice they deserve.",
        "Bro are you really that dumb? He has a rape case against him he should stay in india and fight the case then people will respect him instead of leaving the country 😂 of-course then people will look him guilty also he is from bjp coalition hence the media is not covering it extensively or else now andhbhakts will start defending someone who has been accused of rape lol",
        "I wrote this comment before the news of him leaving India came up. Also Indian laws regarding male rake accused are very biased and are essentially guilty until proven innocent so my point is still right.",
        "3000 female government officials raped?"
    ],
    "cleaned_text": "bjpjds mp grandson former prime minister accused rape sexual harassment media silent karnataka last days theres huge sex scandal dont know else call came light accusing prajval revanna current mp hassan grandson former prime minister hd devegowda nephew former karnataka chief minister hd kumaraswamy raping several women thought election propaganda opposition parties bother much today two women house hold workers came live tv channel accused prajval revanna father hd revanna sexual harassment women former workers prajval revannas house holenarasi pura hometown hassan district huge eyes law two women came accusing openly sexual harassment believe election propaganda saw videos couple mlas expressed concern women welfare association president said complained commissioner demanded investigation also yesterday dcm karnataka mentioned incident briefly interview everybody silent dont know major tv channels covering nobody powerful enough ever mentioned incident surprisingly nobody hd devegowda family anyone bjp said anything least denied incident ever happened baffled point truly questioning society living know devegowda powerful caste women harassed caste also recorded several selfienormal videos female bureaucrats making strip clothes question point politics anymore everybody karnataka know incident least powerful people silent including media fear kannadiga know kannadigas cowards source kannadahttpswwwyoutubecomlivebvnwmbkxusinnedtirjdxtrchk tldr prajval revanna current mp grandson former pm devegowda accused rapes sexual harassment media silent ",
    "cleaned_title": "bjpjds mp grandson former prime minister accused rape sexual harassment media silent",
    "cleaned_selftext": "karnataka last days theres huge sex scandal dont know else call came light accusing prajval revanna current mp hassan grandson former prime minister hd devegowda nephew former karnataka chief minister hd kumaraswamy raping several women thought election propaganda opposition parties bother much today two women house hold workers came live tv channel accused prajval revanna father hd revanna sexual harassment women former workers prajval revannas house holenarasi pura hometown hassan district huge eyes law two women came accusing openly sexual harassment believe election propaganda saw videos couple mlas expressed concern women welfare association president said complained commissioner demanded investigation also yesterday dcm karnataka mentioned incident briefly interview everybody silent dont know major tv channels covering nobody powerful enough ever mentioned incident surprisingly nobody hd devegowda family anyone bjp said anything least denied incident ever happened baffled point truly questioning society living know devegowda powerful caste women harassed caste also recorded several selfienormal videos female bureaucrats making strip clothes question point politics anymore everybody karnataka know incident least powerful people silent including media fear kannadiga know kannadigas cowards source kannadahttpswwwyoutubecomlivebvnwmbkxusinnedtirjdxtrchk tldr prajval revanna current mp grandson former pm devegowda accused rapes sexual harassment media silent",
    "cleaned_comments": "pre indian media peak got stay court asking media cover videos two women openly accused media cover houda nodteeni first sentence title answer first word clue rape sexual harassment rape murder doesnt matter done bj party karnataka new bihar mean blatantly obvious covered bring maybe try getting house vote right candidate next time want change mean generically directly op per say much nari shakti searched reading tv medias covering state government making scene investigation thoroughly bring justice bjp would set example opposition mp accused crimes even falsely especially election year someone tell accused person must ensure harassment comes along media coverage accusation might true might false untill unless crime proven courts media disclose name accused country innocent mens entire future gets destroyed think reason lot news channels openly questioning due family unless theyve proof need dont want go family attract hate public timing allegation obviously making followers question validity allegations im sure videos edited ive read people saying edited also many people seem believe deep fake videos actually maybe another reason dont see lot backlash online needs punished needs stripped mp title case wins probably turns true know think likely true tv channel would covered videos deep faked video clips people certainly know faked videos dcm mentioned power tv channel anchor said videos real sidaramiah formed sit check claims go hammer tongs next rounds campaigning may actually real yes news gaining traction even english news channels therell major repercussions feel real fled country ministers spoke cm karnataka order special investigation bjp jds completely silent hopefully affected get justice deserve bro really dumb rape case stay india fight case people respect instead leaving country ofcourse people look guilty also bjp coalition hence media covering extensively else andhbhakts start defending someone accused rape lol wrote comment news leaving india came also indian laws regarding male rake accused biased essentially guilty proven innocent point still right female government officials raped",
    "light_cleaned_title": "BJP-JDS MP, grandson of former Prime Minister, is accused of rape & sexual harassment. Why Media is Silent?",
    "light_cleaned_selftext": "In Karnataka, from last few days there's a huge sex scandal (I don't know what else to call it) came to light accusing the Prajval Revanna, (Current MP from Hassan and grandson of former prime minister HD Devegowda and nephew of former Karnataka Chief minister HD Kumaraswamy.) of raping several women. I thought it was some election propaganda from opposition parties, so did not bother much. But today two women (house hold workers) came to live TV Channel and accused both Prajval Revanna & his father HD Revanna of sexual harassment, these women are former workers at Prajval Revanna's house in Holenarasi pura, (his hometown in Hassan District). This is huge in the eyes of law, because two women came out and accusing openly of sexual harassment, now I believe it is more than election propaganda. I saw few videos where couple of MLA's expressed concern and Women welfare association president said, she has complained to the commissioner and demanded for investigation. Also, yesterday DCM of Karnataka mentioned this incident briefly in an interview. Other than that everybody is silent, I don't know why, no major TV channels are covering it, nobody, who is powerful enough ever mentioned this incident at all, surprisingly nobody from HD Devegowda family nor anyone from BJP said anything about this (at least they should have denied about these incident ever happened), I am baffled at this point, I am truly questioning the society I am living in. I know Devegowda is from powerful caste, but most of the women who were being harassed are from their own caste. Also, he recorded several selfie/normal videos with female bureaucrats making them strip clothes. My question is, at this point it's not politics anymore, everybody in the Karnataka know about this incident (at least powerful people), but they are all silent including media, why? is it fear? Being a Kannadiga myself, I did not know Kannadigas are this cowards. [Source (In Kannada)](https://www.youtube.com/live/2b6VNwmbkxU?si=nNE1dTiRJdXTRChk) TLDR - Prajval Revanna, the current MP and Grandson of former PM Devegowda has been accused of rapes & sexual harassment, but media is silent why?",
    "light_cleaned_comments": "Pre-2016 indian media was peak He has got a stay from court asking media not to cover it That was about videos. But now two women openly accused him, media should cover it. Houda. Nodteeni The first sentence in the title is the answer to the Why. The first word is the clue to \"rape & sexual harassment\" Rape murder doesn’t matter if done by BJ party Karnataka is the new bihar 😂 I mean… it’s blatantly obvious why it’s not covered. But we bring this on ourselves. Maybe try getting out of the house to vote for the right candidate next time , if you want change. I mean this more generically and not directly at OP per say So much of nari shakti. searched after reading this not all no other tv medias are covering Why is the state government not making a scene out of it and doing the investigation thoroughly to bring him to justice? BJP would have set an example out of an opposition MP who was accused of such crimes, even if falsely, especially in an election year. Can someone tell me why an \"Accused\" person must ensure that harassment that comes along with media coverage. The accusation might be true it might be false but untill and unless the crime is proven in the courts the media should not disclose the name of the 'accused' because in our country innocent men's entire future gets destroyed. I think the reason why not a lot of news channels are openly questioning is due to his family. And until and unless they've all the proof they need, they don't want to go against that family and attract hate from the public. The timing of the allegation is obviously making his followers question the validity of the allegations. And I'm not sure if the videos are edited are not, (I've read people saying it's edited and also that it's not), but many people seem to believe those are deep fake videos and it's not actually him. That maybe another reason why you don't see a lot of backlash online. But he needs to be punished (and needs to be stripped off his MP title in case he wins, which he most probably will) if this turns out to be true. I know, but I think it is most likely true. No TV channel would have covered it if all the videos were deep faked. There are more than 2000 video clips and people who have it certainly know they are not faked videos. DCM mentioned it, Power TV channel anchor said videos are 100% real and he has them all. Sidaramiah has formed a sit to check the claims They should go hammer and tongs in the next rounds of campaigning . It may actually be real, yes. And the news is gaining traction even in English news channels now, so there'll be some major repercussions I feel This is 100% real, he fled the country, all ministers spoke about it and CM of Karnataka order a special investigation. But BJP & JDS completely silent about this. Hopefully the affected get the justice they deserve. Bro are you really that dumb? He has a rape case against him he should stay in india and fight the case then people will respect him instead of leaving the country 😂 of-course then people will look him guilty also he is from bjp coalition hence the media is not covering it extensively or else now andhbhakts will start defending someone who has been accused of rape lol I wrote this comment before the news of him leaving India came up. Also Indian laws regarding male rake accused are very biased and are essentially guilty until proven innocent so my point is still right. 3000 female government officials raped?"
}