{
    "id": "12d52mz",
    "title": "Hyderabad: Muslim couple file complaint after right-wing 'harassment'",
    "url": "https://www.siasat.com/hyderabad-muslim-couple-file-complaint-after-right-wing-harassment-2562116/",
    "selftext": "Abidi also found out that his personal details were exposed to the public through a tweet by Goshmahal MLA and suspended BJP leader T Raja Singh.",
    "flair": "Crime",
    "score": 163,
    "num_comments": 5,
    "created_utc": 1680745027.0,
    "convurl": "https://external-preview.redd.it/YR2dnbLuIY-D12Sl5PDFZk_Bu9nVXqUz-_ii0AXYyFE.jpg?auto=webp&v=enabled&s=51435411d4754e78b9fefe61dc5739f43fe58565",
    "comments": [
        "This is insane. They were \"exposing their personal details such as phone numbers, names of their relatives, addresses\"\n\nIf that's not a violation of someone's life i don't know what is.",
        "Privacy violations only happen when you ask questions about somebody's clearly fake degrees.",
        "Those Twitter accounts must permanently be suspended for doxxing as well.",
        "\"Right wing\" more like \"Conservative\" in the indian context",
        "Entire political science    /s"
    ],
    "cleaned_text": "hyderabad muslim couple file complaint rightwing harassment abidi also found personal details exposed public tweet goshmahal mla suspended bjp leader raja singh ",
    "cleaned_title": "hyderabad muslim couple file complaint rightwing harassment",
    "cleaned_selftext": "abidi also found personal details exposed public tweet goshmahal mla suspended bjp leader raja singh",
    "cleaned_comments": "insane exposing personal details phone numbers names relatives addresses thats violation someones life dont know privacy violations happen ask questions somebodys clearly fake degrees twitter accounts must permanently suspended doxxing well right wing like conservative indian context entire political science",
    "light_cleaned_title": "Hyderabad: Muslim couple file complaint after right-wing 'harassment'",
    "light_cleaned_selftext": "Abidi also found out that his personal details were exposed to the public through a tweet by Goshmahal MLA and suspended BJP leader T Raja Singh.",
    "light_cleaned_comments": "This is insane. They were \"exposing their personal details such as phone numbers, names of their relatives, addresses\" If that's not a violation of someone's life i don't know what is. Privacy violations only happen when you ask questions about somebody's clearly fake degrees. Those Twitter accounts must permanently be suspended for doxxing as well. \"Right wing\" more like \"Conservative\" in the indian context Entire political science /s"
}