{
    "id": "13hbt3u",
    "title": "Karnataka Verdict: A secular disaster — neither religion nor caste politics came to BJP’s aid",
    "url": "https://www.moneycontrol.com/news/assembly-elections/karnataka/karnataka-verdict-a-secular-disaster-neither-religion-nor-caste-politics-came-to-bjps-aid-10584691.html",
    "selftext": "After the Karnataka  assembly poll results showed a clear victory for the Congress with  135 seats, party leader  Rahul Gandhi said: “Nafrat ki bazaar bandh, mohabbat ki dukan khuli hai,'' (the market of hate  is closed, the shop of love has opened).",
    "flair": "Politics",
    "score": 334,
    "num_comments": 32,
    "created_utc": 1684069693.0,
    "convurl": "https://external-preview.redd.it/_wLbfAzoT3vZdQcJjqlbORbUFBbJga9I0SxRs8jCHvU.jpg?auto=webp&v=enabled&s=45bb3e087b8358181fb3596798d05ccb1fe6bb9e",
    "comments": [
        "What did they expect from Karnataka. This isn't UP or Bihar.",
        "But it does have the UP pockets like coastal Karnataka",
        "Well, obviously it is not UP or Bihar, but it is the only state in southern India where the BJP had a footprint... So, it isn't beyond the realm of possibility that the politics of hindutva and caste could well have worked out for the BJP. I am glad that it didn't, but such shit posting about UP and Bihar is unnecessary.",
        "There are many reasons for the Congress win and for this most fitting defeat of the BJP. \n\nI hope, this election helps the Congress to build momentum and forge coalitions before the central government elections next year.",
        "BJP failed to win a single ST reserved seat. Even their star leader Sriramulu lost. Their SC seat tally came down from 22 to 12. Looks like Dalits and Tribals are fed up of constant casteism of upper castes (who had BJP support), ever increasing petrol diesel lpg prices and rising hatred against them.",
        "bjp still has 36% vote share. the threat is far from over.\n\nhope ktk govt implements schemes like Delhi and Punjab govt and boot bjp out forever.",
        "The irony is that coastal karnataka is 100% literate (unlike in UP or the rest of karnataka), and are supposedly 'independent thinkers', and yet, they blindly vote marveling at Modi's face and falling for the whatsapp university bakwas...😀",
        "Finally Karnataka got rid of “UP of south” tagline. Well done kannadigas 👏🏼",
        "Literate <> Educated.\n\nEven literate people can fall prey to misinfo. In fact it’s quite easy, just send them WhatsApp messages.\n\nCritical thinking is the key. And that’s much harder.",
        "Next state elections are coming up in Rajasthan, MP, Chattisgarh, and one of the NE states. Cong is in power in Rajasthan and Chattisgarh. BJP currently is in power in MP after Scindia took some MLAs with him. All three are important elections for both parties. The results will definitely be a harbinger for 2024.",
        "Was surprised with the high vote % for BJP. BJP certainly has a strong base. KA had several issues during the BJP term. Nothing affected this base. This is like DMK and ADMK in Tamilnadu. Both parties have a strong core base. The swing voters decide the fate and mostly lead to a complete majority.",
        "Actually, in 2019 we went to the elections after Cong won Raj, MP, and Chhattisgarh... And yet, BJP came to power with a resounding win in all these states. I don't think the state legislative assembly election results have much predictive value.\n\nMy estimation is that the 2024 election will hinge on  BJP's disinformation and divisive campaign. If people fall for their communal narratives, they will return to power.",
        "Good point. Sometimes state vs center people can have a different mindset. While there was some anti-BJP sentiment due to demonstration, GST and farmers protest -  Pulvama happened and BJP used it to their advantage. Recently we had some revelations from the then J&K Governor. Was surprised that 2019 was a resounding win better than 2014.",
        "Edit: demonetization not demonstration",
        "educated doesn't mean they can't be brainwashed or harbour more bigoted views than uneducated folks.",
        "Poor (and by some correlation uneducated) people often give parties the benefit of doubt. But really difficult to fool them twice if you don't deliver on the ground.\n\nYe \"mujhko gaali diya, Hanuman ko gaali diya, kerela mein ladki gaya Kiya\" Wala bakwas paise walo PE chal Jata hai.",
        "BJP has a footprint cos there is no legit regional party, JDS is just like congress.",
        "Infact educated can be easily persuaded with \"false reasoning\", meanwhile uneducated will not fall for any reasoning, if they see they faced a loss under this govt they will cut their losses next time.",
        "Wouldn't put it that way honestly. They lost in places that they are strong and gained in places that they are weak in. \n\nThey can reclaim their strength and would make inroads elsewhere next election. \n\nThe same 36% who voted for them last time didn't vote for them this time.",
        ">Pulvama happened\n\nIt did not just happen. It was orchestrated, or at least allowed to happen. And similar shit would recur before the next LS elections, as has on several occasions in the past ..."
    ],
    "cleaned_text": "karnataka verdict secular disaster neither religion caste politics came bjps aid karnataka assembly poll results showed clear victory congress seats party leader rahul gandhi said nafrat ki bazaar bandh mohabbat ki dukan khuli hai market hate closed shop love opened ",
    "cleaned_title": "karnataka verdict secular disaster neither religion caste politics came bjps aid",
    "cleaned_selftext": "karnataka assembly poll results showed clear victory congress seats party leader rahul gandhi said nafrat ki bazaar bandh mohabbat ki dukan khuli hai market hate closed shop love opened",
    "cleaned_comments": "expect karnataka isnt bihar pockets like coastal karnataka well obviously bihar state southern india bjp footprint isnt beyond realm possibility politics hindutva caste could well worked bjp glad didnt shit posting bihar unnecessary many reasons congress win fitting defeat bjp hope election helps congress build momentum forge coalitions central government elections next year bjp failed win single st reserved seat even star leader sriramulu lost sc seat tally came looks like dalits tribals fed constant casteism upper castes bjp support ever increasing petrol diesel lpg prices rising hatred bjp still vote share threat far hope ktk govt implements schemes like delhi punjab govt boot bjp forever irony coastal karnataka literate unlike rest karnataka supposedly independent thinkers yet blindly vote marveling modis face falling whatsapp university bakwas finally karnataka got rid south tagline well done kannadigas literate educated even literate people fall prey misinfo fact quite easy send whatsapp messages critical thinking key thats much harder next state elections coming rajasthan mp chattisgarh one ne states cong power rajasthan chattisgarh bjp currently power mp scindia took mlas three important elections parties results definitely harbinger surprised high vote bjp bjp certainly strong base ka several issues bjp term nothing affected base like dmk admk tamilnadu parties strong core base swing voters decide fate mostly lead complete majority actually went elections cong raj mp chhattisgarh yet bjp came power resounding win states dont think state legislative assembly election results much predictive value estimation election hinge bjps disinformation divisive campaign people fall communal narratives return power good point sometimes state vs center people different mindset antibjp sentiment due demonstration gst farmers protest pulvama happened bjp used advantage recently revelations jk governor surprised resounding win better edit demonetization demonstration educated doesnt mean cant brainwashed harbour bigoted views uneducated folks poor correlation uneducated people often give parties benefit doubt really difficult fool twice dont deliver ground ye mujhko gaali diya hanuman ko gaali diya kerela mein ladki gaya kiya wala bakwas paise walo pe chal jata hai bjp footprint cos legit regional party jds like congress infact educated easily persuaded false reasoning meanwhile uneducated fall reasoning see faced loss govt cut losses next time wouldnt put way honestly lost places strong gained places weak reclaim strength would make inroads elsewhere next election voted last time didnt vote time pulvama happened happen orchestrated least allowed happen similar shit would recur next ls elections several occasions past",
    "light_cleaned_title": "Karnataka Verdict: A secular disaster — neither religion nor caste politics came to BJP’s aid",
    "light_cleaned_selftext": "After the Karnataka assembly poll results showed a clear victory for the Congress with 135 seats, party leader Rahul Gandhi said: “Nafrat ki bazaar bandh, mohabbat ki dukan khuli hai,'' (the market of hate is closed, the shop of love has opened).",
    "light_cleaned_comments": "What did they expect from Karnataka. This isn't UP or Bihar. But it does have the UP pockets like coastal Karnataka Well, obviously it is not UP or Bihar, but it is the only state in southern India where the BJP had a footprint... So, it isn't beyond the realm of possibility that the politics of hindutva and caste could well have worked out for the BJP. I am glad that it didn't, but such shit posting about UP and Bihar is unnecessary. There are many reasons for the Congress win and for this most fitting defeat of the BJP. I hope, this election helps the Congress to build momentum and forge coalitions before the central government elections next year. BJP failed to win a single ST reserved seat. Even their star leader Sriramulu lost. Their SC seat tally came down from 22 to 12. Looks like Dalits and Tribals are fed up of constant casteism of upper castes (who had BJP support), ever increasing petrol diesel lpg prices and rising hatred against them. bjp still has 36% vote share. the threat is far from over. hope ktk govt implements schemes like Delhi and Punjab govt and boot bjp out forever. The irony is that coastal karnataka is 100% literate (unlike in UP or the rest of karnataka), and are supposedly 'independent thinkers', and yet, they blindly vote marveling at Modi's face and falling for the whatsapp university bakwas...😀 Finally Karnataka got rid of “UP of south” tagline. Well done kannadigas 👏🏼 Literate <> Educated. Even literate people can fall prey to misinfo. In fact it’s quite easy, just send them WhatsApp messages. Critical thinking is the key. And that’s much harder. Next state elections are coming up in Rajasthan, MP, Chattisgarh, and one of the NE states. Cong is in power in Rajasthan and Chattisgarh. BJP currently is in power in MP after Scindia took some MLAs with him. All three are important elections for both parties. The results will definitely be a harbinger for 2024. Was surprised with the high vote % for BJP. BJP certainly has a strong base. KA had several issues during the BJP term. Nothing affected this base. This is like DMK and ADMK in Tamilnadu. Both parties have a strong core base. The swing voters decide the fate and mostly lead to a complete majority. Actually, in 2019 we went to the elections after Cong won Raj, MP, and Chhattisgarh... And yet, BJP came to power with a resounding win in all these states. I don't think the state legislative assembly election results have much predictive value. My estimation is that the 2024 election will hinge on BJP's disinformation and divisive campaign. If people fall for their communal narratives, they will return to power. Good point. Sometimes state vs center people can have a different mindset. While there was some anti-BJP sentiment due to demonstration, GST and farmers protest - Pulvama happened and BJP used it to their advantage. Recently we had some revelations from the then J&K Governor. Was surprised that 2019 was a resounding win better than 2014. Edit: demonetization not demonstration educated doesn't mean they can't be brainwashed or harbour more bigoted views than uneducated folks. Poor (and by some correlation uneducated) people often give parties the benefit of doubt. But really difficult to fool them twice if you don't deliver on the ground. Ye \"mujhko gaali diya, Hanuman ko gaali diya, kerela mein ladki gaya Kiya\" Wala bakwas paise walo PE chal Jata hai. BJP has a footprint cos there is no legit regional party, JDS is just like congress. Infact educated can be easily persuaded with \"false reasoning\", meanwhile uneducated will not fall for any reasoning, if they see they faced a loss under this govt they will cut their losses next time. Wouldn't put it that way honestly. They lost in places that they are strong and gained in places that they are weak in. They can reclaim their strength and would make inroads elsewhere next election. The same 36% who voted for them last time didn't vote for them this time. >Pulvama happened It did not just happen. It was orchestrated, or at least allowed to happen. And similar shit would recur before the next LS elections, as has on several occasions in the past ..."
}