{
    "id": "17gbhlv",
    "title": "Is this genuine?",
    "url": "https://v.redd.it/oit7z3f36ewb1",
    "selftext": "Received this video on WhatsApp with the caption \"Keep forwarding till it reaches all your contacts, friends and family members\".\n\nTL;DR of video: A girl comes running towards a guy appearing to be afraid of some people who are after her. The guy offers help by calling police but she denies and only wants to call her dad or husband. She takes the guy's phone, calls them but no one picks up and she says she lives nearby and just goes abruptly. Guy receives a message which states Rs 4 Lakhs have been debited from his account. He comes to know through a police officer (who has caught the girl) that she frauds people by dialing some codes through people's phone by which all the calls and messages are forwarded to them. Then they empty the account of the victim by using the OTPs.\n\nThe supposed scam doesn't even seem possible. How can all the messages to be sent directly through the help of code?\nAnd even if is indeed possible, how can expired OTPs be used to access bank detailso or even transfer money from the bank.\n\nSeems completely fake. \n\n\n\n",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1698258388.0,
    "convurl": "https://external-preview.redd.it/bzRqbXV3NjM2ZXdiMfBFdOJTq-H44aIhbmW3xYMEcxqCE_MOtFdwFu30f0wd.png?format=pjpg&auto=webp&s=429311741f6b537b1945fdc7454360bafa9bbba2",
    "comments": [],
    "cleaned_text": "genuine received video whatsapp caption keep forwarding till reaches contacts friends family members tldr video girl comes running towards guy appearing afraid people guy offers help calling police denies wants call dad husband takes guys phone calls one picks says lives nearby goes abruptly guy receives message states rs lakhs debited account comes know police officer caught girl frauds people dialing codes peoples phone calls messages forwarded empty account victim using otps supposed scam doesnt even seem possible messages sent directly help code even indeed possible expired otps used access bank detailso even transfer money bank seems completely fake ",
    "cleaned_title": "genuine",
    "cleaned_selftext": "received video whatsapp caption keep forwarding till reaches contacts friends family members tldr video girl comes running towards guy appearing afraid people guy offers help calling police denies wants call dad husband takes guys phone calls one picks says lives nearby goes abruptly guy receives message states rs lakhs debited account comes know police officer caught girl frauds people dialing codes peoples phone calls messages forwarded empty account victim using otps supposed scam doesnt even seem possible messages sent directly help code even indeed possible expired otps used access bank detailso even transfer money bank seems completely fake",
    "cleaned_comments": "",
    "light_cleaned_title": "Is this genuine?",
    "light_cleaned_selftext": "Received this video on WhatsApp with the caption \"Keep forwarding till it reaches all your contacts, friends and family members\". TL;DR of video: A girl comes running towards a guy appearing to be afraid of some people who are after her. The guy offers help by calling police but she denies and only wants to call her dad or husband. She takes the guy's phone, calls them but no one picks up and she says she lives nearby and just goes abruptly. Guy receives a message which states Rs 4 Lakhs have been debited from his account. He comes to know through a police officer (who has caught the girl) that she frauds people by dialing some codes through people's phone by which all the calls and messages are forwarded to them. Then they empty the account of the victim by using the OTPs. The supposed scam doesn't even seem possible. How can all the messages to be sent directly through the help of code? And even if is indeed possible, how can expired OTPs be used to access bank detailso or even transfer money from the bank. Seems completely fake.",
    "light_cleaned_comments": ""
}