{
    "id": "14o2w4s",
    "title": "Myntra Sc@m Legal opinion needed",
    "url": "https://www.reddit.com/r/india/comments/14o2w4s/myntra_scm_legal_opinion_needed/",
    "selftext": "On July 20th, I purchased a pair of white Puma shoes worth 4700 after discounts. They were meant to be delivered on July 22nd; however, they arrived earlier, on July 21st. The sneakers had a crease and white, dusty, and yellow spots on them. Furthermore, there were no tags on the sneakers, and no official Puma shoe box was delivered. As a result, I requested a refund on July 22nd (which is within the time period set by Myntra policy). Myntra has a 5-day pickup policy, so they were scheduled to pick it up by the 27th of July. Despite being called several times, the delivery person did not show up. They finally picked it up on July 29th, in violation of their guidelines. On the same day, late at night, they messaged me, claiming the shoes seemed worn (despite the fact that I did not). In fact, you can see in the picture that I have not even broken the Zip tie thingy, and they denied my refund and reshipped the shoes despite the fact that I refused to accept them. They were scheduled to be reshipped by the 1st of July, but they were not, which is another breach of Myntra policy. When I again contacted their customer service and asked for a refund, they claimed it would take 48 hours for reshipment and then they would investigate for a refund. Every time I contact them, they claim that it will take more than 48 hours for the matter to be resolved. In addition, when I asked the executive for his full name so that I could file a consumer court complaint, he refused to do so. Lastly, when I asked him to lodge an internal complaint for return, he refused to do so and only lodged one for reshipment. All their customer support does is harass you.\n\nFor now, I have filed a grievance with the national consumer helpline. I would like to know if there is anything else I could do except file a consumer court complaint. Can I file a police complaint, and if so, under what sections of the IPC? \n\nPS: I would also like to tell the readers to avoid Myntra, as on further investigation, I realized that a Lot of people faced the same issue where Myntra Declined to give them a refund, stating some nonsense reason. I have never faced this issue with Amazon (Maybe because I am a Prime customer) or Ajio.\n\nOne important thing is that I will be traveling to a foreign country in August's first week to pursue my master's, and in addition, I won't be in India for 10 days in July, so I have little time to sort this out.\n\n[https://www.desidime.com/discussions/myntra-s-new-scam-to-not-refund](https://www.desidime.com/discussions/myntra-s-new-scam-to-not-refund)  \n[https://www.reddit.com/r/india/comments/12z4eux/myntra\\_scam\\_return\\_pick\\_up/](https://www.reddit.com/r/india/comments/12z4eux/myntra_scam_return_pick_up/)  \n[https://www.reddit.com/r/india/comments/10g34df/is\\_myntra\\_a\\_scum\\_company\\_nowadays/](https://www.reddit.com/r/india/comments/10g34df/is_myntra_a_scum_company_nowadays/)  \n\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 5,
    "created_utc": 1688238263.0,
    "convurl": "https://external-preview.redd.it/NMBV_4ldnIVmnujnJG_1mPOMsmjT5hmwl0LtCUJR8AU.jpg?auto=webp&v=enabled&s=927aceef0a58122dff9f565d9820423a38e29895",
    "comments": [
        "You sir, are a time traveller. We thank you for coming back in time and revealing this scam to us!!",
        "I wish I could travel back in time and never order from this shit site 😭",
        "Did you also buy a calendar from them which has June missing 🙂?",
        "Ahh shittt 😂😭"
    ],
    "cleaned_text": "myntra scm legal opinion needed july th purchased pair white puma shoes worth discounts meant delivered july nd however arrived earlier july st sneakers crease white dusty yellow spots furthermore tags sneakers official puma shoe box delivered result requested refund july nd within time period set myntra policy myntra day pickup policy scheduled pick th july despite called several times delivery person show finally picked july th violation guidelines day late night messaged claiming shoes seemed worn despite fact fact see picture even broken zip tie thingy denied refund reshipped shoes despite fact refused accept scheduled reshipped st july another breach myntra policy contacted customer service asked refund claimed would take hours reshipment would investigate refund every time contact claim take hours matter resolved addition asked executive full name could file consumer court complaint refused lastly asked lodge internal complaint return refused lodged one reshipment customer support harass filed grievance national consumer helpline would like know anything else could except file consumer court complaint file police complaint sections ipc ps would also like tell readers avoid myntra investigation realized lot people faced issue myntra declined give refund stating nonsense reason never faced issue amazon maybe prime customer ajio one important thing traveling foreign country augusts first week pursue masters addition wont india days july little time sort httpswwwdesidimecomdiscussionsmyntrasnewscamtonotrefundhttpswwwdesidimecomdiscussionsmyntrasnewscamtonotrefund httpswwwredditcomrindiacommentszeuxmyntrascamreturnpickuphttpswwwredditcomrindiacommentszeuxmyntrascamreturnpickup httpswwwredditcomrindiacommentsgdfismyntraascumcompanynowadayshttpswwwredditcomrindiacommentsgdfismyntraascumcompanynowadays xb ",
    "cleaned_title": "myntra scm legal opinion needed",
    "cleaned_selftext": "july th purchased pair white puma shoes worth discounts meant delivered july nd however arrived earlier july st sneakers crease white dusty yellow spots furthermore tags sneakers official puma shoe box delivered result requested refund july nd within time period set myntra policy myntra day pickup policy scheduled pick th july despite called several times delivery person show finally picked july th violation guidelines day late night messaged claiming shoes seemed worn despite fact fact see picture even broken zip tie thingy denied refund reshipped shoes despite fact refused accept scheduled reshipped st july another breach myntra policy contacted customer service asked refund claimed would take hours reshipment would investigate refund every time contact claim take hours matter resolved addition asked executive full name could file consumer court complaint refused lastly asked lodge internal complaint return refused lodged one reshipment customer support harass filed grievance national consumer helpline would like know anything else could except file consumer court complaint file police complaint sections ipc ps would also like tell readers avoid myntra investigation realized lot people faced issue myntra declined give refund stating nonsense reason never faced issue amazon maybe prime customer ajio one important thing traveling foreign country augusts first week pursue masters addition wont india days july little time sort httpswwwdesidimecomdiscussionsmyntrasnewscamtonotrefundhttpswwwdesidimecomdiscussionsmyntrasnewscamtonotrefund httpswwwredditcomrindiacommentszeuxmyntrascamreturnpickuphttpswwwredditcomrindiacommentszeuxmyntrascamreturnpickup httpswwwredditcomrindiacommentsgdfismyntraascumcompanynowadayshttpswwwredditcomrindiacommentsgdfismyntraascumcompanynowadays xb",
    "cleaned_comments": "sir time traveller thank coming back time revealing scam us wish could travel back time never order shit site also buy calendar june missing ahh shittt",
    "light_cleaned_title": "Myntra Sc@m Legal opinion needed",
    "light_cleaned_selftext": "On July 20th, I purchased a pair of white Puma shoes worth 4700 after discounts. They were meant to be delivered on July 22nd; however, they arrived earlier, on July 21st. The sneakers had a crease and white, dusty, and yellow spots on them. Furthermore, there were no tags on the sneakers, and no official Puma shoe box was delivered. As a result, I requested a refund on July 22nd (which is within the time period set by Myntra policy). Myntra has a 5-day pickup policy, so they were scheduled to pick it up by the 27th of July. Despite being called several times, the delivery person did not show up. They finally picked it up on July 29th, in violation of their guidelines. On the same day, late at night, they messaged me, claiming the shoes seemed worn (despite the fact that I did not). In fact, you can see in the picture that I have not even broken the Zip tie thingy, and they denied my refund and reshipped the shoes despite the fact that I refused to accept them. They were scheduled to be reshipped by the 1st of July, but they were not, which is another breach of Myntra policy. When I again contacted their customer service and asked for a refund, they claimed it would take 48 hours for reshipment and then they would investigate for a refund. Every time I contact them, they claim that it will take more than 48 hours for the matter to be resolved. In addition, when I asked the executive for his full name so that I could file a consumer court complaint, he refused to do so. Lastly, when I asked him to lodge an internal complaint for return, he refused to do so and only lodged one for reshipment. All their customer support does is harass you. For now, I have filed a grievance with the national consumer helpline. I would like to know if there is anything else I could do except file a consumer court complaint. Can I file a police complaint, and if so, under what sections of the IPC? PS: I would also like to tell the readers to avoid Myntra, as on further investigation, I realized that a Lot of people faced the same issue where Myntra Declined to give them a refund, stating some nonsense reason. I have never faced this issue with Amazon (Maybe because I am a Prime customer) or Ajio. One important thing is that I will be traveling to a foreign country in August's first week to pursue my master's, and in addition, I won't be in India for 10 days in July, so I have little time to sort this out. [https://www.desidime.com/discussions/myntra-s-new-scam-to-not-refund](https://www.desidime.com/discussions/myntra-s-new-scam-to-not-refund) [https://www.reddit.com/r/india/comments/12z4eux/myntra\\_scam\\_return\\_pick\\_up/](https://www.reddit.com/r/india/comments/12z4eux/myntra_scam_return_pick_up/) [https://www.reddit.com/r/india/comments/10g34df/is\\_myntra\\_a\\_scum\\_company\\_nowadays/](https://www.reddit.com/r/india/comments/10g34df/is_myntra_a_scum_company_nowadays/) &#x200B;",
    "light_cleaned_comments": "You sir, are a time traveller. We thank you for coming back in time and revealing this scam to us!! I wish I could travel back in time and never order from this shit site 😭 Did you also buy a calendar from them which has June missing 🙂? Ahh shittt 😂😭"
}