{
    "id": "14q9x0h",
    "title": "Nine years of Modi government: It’s time for radical course correction",
    "url": "https://scroll.in/article/1050965/nine-years-of-modi-government-its-time-for-radical-course-correction",
    "selftext": "Despite what an advertisement might claim, India is now counted amongst the most unequal societies with unacceptably high levels of unemployment and poverty.",
    "flair": "Politics",
    "score": 138,
    "num_comments": 36,
    "created_utc": 1688461519.0,
    "convurl": "https://external-preview.redd.it/MkMNFi4BGF48tVq4Iybc4AYh3chHBffUFGGvzl-vt7o.jpg?auto=webp&s=b2a1997cc90b7f7eddf13e71b3dac744371ea856",
    "comments": [
        "9 years of Kakistocracy.",
        "I envy the growth of our neighbouring countries, while we teach mature adults to take a shit inside toilets and that corruption doesn't have any religion or political beliefs. Our neighbouring countries are getting economically comparable to the US",
        "Itna bhi nahi gira bhai india 😳, china ko chodkar sab piche hi hai",
        "Which neighbouring country are you talking about bro? \nThe dictator china? \nThe dilapidated Nepal? \nThe cesspool Bangladesh? \nThe failed state Sri Lanka? \nOr, the king of them all Pakistan?",
        "Wow, someone doesn’t know anything. Pick up a news paper at times perhaps?",
        "https://www.deccanherald.com/opinion/india-s-gdp-gap-with-us-china-is-widening-alarmingly-1233747.html",
        "News flash. China isn’t the only neighbour\n\nMoreover, everyone knows the gap with China is wide and only increasing. \n\nRest of our neighbourhood is either bankrupt or on the verge of it",
        "Yeah that's the kind of sportsmanship I was expecting, compare yourself with dead countries like Pak or Nepal \n\nWhy can't we compare with China, what's stopping you. When they can capture our territory and kick our journalist why didn't your nationalist flame burn so much.\n\nWhenever people talk about slowing growth or stagnant reforms, some as'oles try to play smart like primetime news channel and literally have to compare with economically dead Pak.\n\nBangladesh on the other side has taken away a majority of garment business from us. Most of you must haven't even left to any foreign nation personally to see how Indians are portrayed because of rising Chinese influence in South Asia and Africa",
        "Yeah so should we celebrate and let them conquer our territories, why do you people turn cowardly when we have to see the real picture this country is turning into.\n\nAlways comparing with bankrupt countries or non influential ones like Nepal. Why don't for a change compare with China, S.Korea, Malaysia or any other country in South Asia that's doing better.\n\nWhy is our country stagnant in terms of public housing, why are they still uneducated and fighting over religions and tribe. Why our media is such a pussy and where is the information and broadcasting ministry that was supposed to govern them.\n\nNo instead you will praise that you are still better than a Pakistani beggar and call it a day.\n\nSorry but I don't plan to stay a coward like y'all and speak up if this country is rotting",
        "We’re merely correcting your incorrect statement. You said neighbors and now suddenly discussing Korea and Malaysia as well \n\nA lot of us here are very aware of the lack of progress and even speak our minds. You’re not privy to some exclusive info\n\nGet off your high horse.",
        "Cool cool you can continue living in your Dreamland",
        "There was a time when india was compared to China. BRICS was a competition between India and China. China clearly won.",
        "Chacha's classic one finger pose.\n\n*Mein yeh karoonga, woh karoonga, woh bhi karoonga. Poocho mat kya karoonga! Bas muche aur time do, range rover mast hai*"
    ],
    "cleaned_text": "nine years modi government time radical course correction despite advertisement might claim india counted amongst unequal societies unacceptably high levels unemployment poverty ",
    "cleaned_title": "nine years modi government time radical course correction",
    "cleaned_selftext": "despite advertisement might claim india counted amongst unequal societies unacceptably high levels unemployment poverty",
    "cleaned_comments": "years kakistocracy envy growth neighbouring countries teach mature adults take shit inside toilets corruption doesnt religion political beliefs neighbouring countries getting economically comparable us itna bhi nahi gira bhai india china ko chodkar sab piche hi hai neighbouring country talking bro dictator china dilapidated nepal cesspool bangladesh failed state sri lanka king pakistan wow someone doesnt know anything pick news paper times perhaps news flash china isnt neighbour moreover everyone knows gap china wide increasing rest neighbourhood either bankrupt verge yeah thats kind sportsmanship expecting compare dead countries like pak nepal cant compare china whats stopping capture territory kick journalist didnt nationalist flame burn much whenever people talk slowing growth stagnant reforms asoles try play smart like primetime news channel literally compare economically dead pak bangladesh side taken away majority garment business us must havent even left foreign nation personally see indians portrayed rising chinese influence south asia africa yeah celebrate let conquer territories people turn cowardly see real picture country turning always comparing bankrupt countries non influential ones like nepal dont change compare china skorea malaysia country south asia thats better country stagnant terms public housing still uneducated fighting religions tribe media pussy information broadcasting ministry supposed govern instead praise still better pakistani beggar call day sorry dont plan stay coward like yall speak country rotting merely correcting incorrect statement said neighbors suddenly discussing korea malaysia well lot us aware lack progress even speak minds youre privy exclusive info get high horse cool cool continue living dreamland time india compared china brics competition india china china clearly chachas classic one finger pose mein yeh karoonga woh karoonga woh bhi karoonga poocho mat kya karoonga bas muche aur time range rover mast hai",
    "light_cleaned_title": "Nine years of Modi government: It’s time for radical course correction",
    "light_cleaned_selftext": "Despite what an advertisement might claim, India is now counted amongst the most unequal societies with unacceptably high levels of unemployment and poverty.",
    "light_cleaned_comments": "9 years of Kakistocracy. I envy the growth of our neighbouring countries, while we teach mature adults to take a shit inside toilets and that corruption doesn't have any religion or political beliefs. Our neighbouring countries are getting economically comparable to the US Itna bhi nahi gira bhai india 😳, china ko chodkar sab piche hi hai Which neighbouring country are you talking about bro? The dictator china? The dilapidated Nepal? The cesspool Bangladesh? The failed state Sri Lanka? Or, the king of them all Pakistan? Wow, someone doesn’t know anything. Pick up a news paper at times perhaps? News flash. China isn’t the only neighbour Moreover, everyone knows the gap with China is wide and only increasing. Rest of our neighbourhood is either bankrupt or on the verge of it Yeah that's the kind of sportsmanship I was expecting, compare yourself with dead countries like Pak or Nepal Why can't we compare with China, what's stopping you. When they can capture our territory and kick our journalist why didn't your nationalist flame burn so much. Whenever people talk about slowing growth or stagnant reforms, some as'oles try to play smart like primetime news channel and literally have to compare with economically dead Pak. Bangladesh on the other side has taken away a majority of garment business from us. Most of you must haven't even left to any foreign nation personally to see how Indians are portrayed because of rising Chinese influence in South Asia and Africa Yeah so should we celebrate and let them conquer our territories, why do you people turn cowardly when we have to see the real picture this country is turning into. Always comparing with bankrupt countries or non influential ones like Nepal. Why don't for a change compare with China, S.Korea, Malaysia or any other country in South Asia that's doing better. Why is our country stagnant in terms of public housing, why are they still uneducated and fighting over religions and tribe. Why our media is such a pussy and where is the information and broadcasting ministry that was supposed to govern them. No instead you will praise that you are still better than a Pakistani beggar and call it a day. Sorry but I don't plan to stay a coward like y'all and speak up if this country is rotting We’re merely correcting your incorrect statement. You said neighbors and now suddenly discussing Korea and Malaysia as well A lot of us here are very aware of the lack of progress and even speak our minds. You’re not privy to some exclusive info Get off your high horse. Cool cool you can continue living in your Dreamland There was a time when india was compared to China. BRICS was a competition between India and China. China clearly won. Chacha's classic one finger pose. *Mein yeh karoonga, woh karoonga, woh bhi karoonga. Poocho mat kya karoonga! Bas muche aur time do, range rover mast hai*"
}