{
    "id": "15te0bb",
    "title": "a humble request to fill out a survey",
    "url": "https://forms.gle/TRZBWzbsxNii5RJL8",
    "selftext": "Hi everyone! \ni’m conducting a research study trying to understand the popularity of true crime media and particularly why many people find it relaxing. it’ll be a HUGE help for me if everyone could take just 5 minutes out of their time and fill this out this survey. \nThanking you all in advance <3",
    "flair": "Crime",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1692250265.0,
    "convurl": "https://external-preview.redd.it/i1eIhAN5PuTegemzc0qDyk3GJUGUAYqqILBY6s5t6cY.jpg?auto=webp&s=a6e02619affebec219f8be5bc14da4e28f28e31c",
    "comments": [
        "Why does your form say \"page 1 of 5\" when there is only one page in the survey?",
        "it is divided into 5 sections to make it easier to fill :)"
    ],
    "cleaned_text": "humble request fill survey hi everyone im conducting research study trying understand popularity true crime media particularly many people find relaxing itll huge help everyone could take minutes time fill survey thanking advance ",
    "cleaned_title": "humble request fill survey",
    "cleaned_selftext": "hi everyone im conducting research study trying understand popularity true crime media particularly many people find relaxing itll huge help everyone could take minutes time fill survey thanking advance",
    "cleaned_comments": "form say page one page survey divided sections make easier fill",
    "light_cleaned_title": "a humble request to fill out a survey",
    "light_cleaned_selftext": "Hi everyone! i’m conducting a research study trying to understand the popularity of true crime media and particularly why many people find it relaxing. it’ll be a HUGE help for me if everyone could take just 5 minutes out of their time and fill this out this survey. Thanking you all in advance <3",
    "light_cleaned_comments": "Why does your form say \"page 1 of 5\" when there is only one page in the survey? it is divided into 5 sections to make it easier to fill :)"
}