{
    "id": "1c0jrgo",
    "title": "After buying a house, I made a checklist of things you should see before buying a house in India",
    "url": "https://www.reddit.com/r/india/comments/1c0jrgo/after_buying_a_house_i_made_a_checklist_of_things/",
    "selftext": "Buying a house is no joke and other than the funding obviously, it requires time, patience and many other resources to see a property purchase through. It's likely to be one of the biggest if not the biggest purchases of your life so there are a few pointers you need to keep in mind when deciding to buy a house. So as a recent first-time home buyer myself,  here's a handy checklist of 10 factors you should look for before buying a house. (and learn from some of the mistakes I made.)\n\n**Checks related to compliance and legality**\n\nWhen you take a home on loan as most people do, the banks do the most legwork for you, but if you plan to buy it without the loan, then the onus of doing legal background checks on the house is on you.  \n\n### 1. Legal Clearance for the project/house\n\nGoes without saying, every house should have a legal clearance to be sold. In essence, the party or owner you're buying it from should have clear and vetted legal documents authorizing them as the legal owner of the house. Many gullible first home buyers get entangled in scams where they end up buying a property from someone who didn't own it to begin with or a property that's encumbered in a number of legal disputes between various claimants. \n\nRemember this epic scene from *Khosla Ka Ghosla*, a movie that surprisingly had more real estate ed than any other article! (except this one.)\n\n&#x200B;\n\nhttps://preview.redd.it/ph8i98em5ntc1.png?width=1460&format=png&auto=webp&s=dc3018c8b734a55fbf5916fccd10492d7c5c0db5\n\nTalking of legal documents, every house should have clear \"Agreement to sale deeds\" and 'land transfership\" records to establish the property as good for sale. Since the average home buyer can get lost in the legalese and non-native vernacular language of the documents, it's prudent to hire a lawyer to asses the property documents and have them vet the property. Any decent lawyer can run through the documents on a one-time charge of around INR 10,000-15,000. The same lawyer can be engaged later to help with registration of the property and so on.   \n\n\n### 2. Free from mortgage\n\nSimilar to the above, the house should not have been \"pledged' to a bank against a loan. In my case, before I bought my first house, I almost bought another one right before unearthing the fact that the house was already pledged to the bank against a home loan its original owner had taken out. If you plan to take a house without a loan, it's easy to overlook this aspect and end up buying a house that's been previously mortgaged. If the owner defaults the loan, you could end up in a sticky situation, and in a worst case scenario, lose the house too.\n\n### 3. Occupancy Certificate\n\nAn occupancy certificate is granted to a building that complies with all the laws and stipulations as set by a local government. It's like a green signal for the builder to \"go ahead your property is good to go\" It's granted in two phases -- Partial OC is given when the project's blueprint complies with all the stipulations like say approved project area, height, distance from water bodies, sewage treatment plans etc. in theory. And a full OC is granted when a project is complete and complies with all of the above in practice.\n\nGiven the spate of rampant construction in urban areas especially metro cities, new builders are coming up by the day . In rare cases it may happen that the apartment was constructed without obtaining the due approvals from govt officials or through some other unscrupulous means. (hint; bribes) In those cases, the apartments may not end up getting a final Occupancy Certificate from the municipal authorities because of various issues like encroachment of protected land, non-compliance with project height or build area, supply of water, electricity etc or any other violations. A house without an OC is as good as an illegal entity. You can buy one to live in, but it will be nearly impossible to sell it. A standout case for a project entangled in an OC battle is Bangalore's SJR Watermark apartments when its [OC was withdrawn](https://www.deccanherald.com/india/karnataka/bengaluru/despite-sc-intervention-bbmp-failed-to-remove-buildings-encroaching-kaikondrahalli-lake-1143138.html) for encroaching on the maximum permissible lakeside limits. Until today, the matter hangs in limbo, with the apartment's 1000+ residents helplessly sitting in their 2cr + houses without a valid OC. \n\nChecks related to the builder\n\nOther than legality and compliance, one must also look for checks that ascertain whether the builder can be trusted.\n\n### 4. Builder's reputation\n\nIn the real estate market, builder's reputation can help sell flats on the back of the name itself. For eg.[ ](http://eg.in/)in India, builders like Sobha, Prestige, DLF, SJR etc enjoy a certain reputation for having delivered projects with good quality construction and other factors that have lasted the test of time. While it's hard to ascertain a new builder's reputation, check Google reviews, and RERA cases against the builder as signals for its reputation. You don't want to buy a house only to come to know about the builder's imminent bankruptcy leading to a project never seeing the light of the day or its many RERA violations as was the [case with Supertech](https://www.indiatoday.in/cities/noida/story/homebuyer-frustrated-mercy-death-supertech-flat-after-insolvency-2368265-2023-05-04). (The Noida 'twin towers' that were demolished for building the towers above and beyond the approved construction as per the initial plans.)\n\n### 5. RERA cases \n\nThe govt of India provides for an effective consumer protection system in the form of RERA (Real Estate Regulation and Development Act, 2016)  a legislation passed by the Government of India to reform the real estate sector in India, encouraging greater transparency, citizen centricity, accountability and financial discipline.  Violation of any of the RERA specifications by a builder is grounds for a consumer to file a case against the builder under the RERA act. Hence, looking up RERA cases against a builder can provide an effective checkpoint into its reputation, potential risks and help a prospective home buyer to carry out their due diligence.   \n\n\n### Where to look for RERA cases against a builder?\n\nEvery state has its own RERA website. For example, this is the [site for Karnataka RERA cases](https://rera.karnataka.gov.in/projectComplaintReport). Even though every project is likely to have some RERA cases against it as it's easy to file one even for the smallest offences, if the list of complaints against a specific builder is heavily titled, it might be a red flag. \n\nChecks related to the area\n\n### 6. Future construction around the area\n\nA flat in a beautiful meadows today may be nestled amidst a concrete jungle 10 years down the line. That unobstructed view you're buying it today for may not allow even for a ray of sunshine to peek through later! Or the lake view you're paying a premium for may turn into a dry wasteland when the water dries up or worse another builder encroaches the lake for construction! When buying a house, look at the surroundings not just today but well within the next 10-20 years. \"I recently found out that the gas power plant near a property I've booked has resumed trial runs. While I was aware of the stay order from the Supreme court on it, it is a failure on my part to not have been aware that it has been given permission to conduct trial runs recently. I am just appalled that there is a power station right in the middle of a densely populated place.\", [says](https://www.reddit.com/r/indianrealestate/comments/1bxd392/is_it_safe_to_settle_down_on_doddaballapur_main/) a Reddit user.  \n\n### 7. Sources of water supply\n\nIn light of the latest water crisis in Bangalore, the most important question to ask when deciding to buy a house is \"does your future home have a reliable and sustainable source of fresh water?\" Fresh water could mean a borewell pumping water from the underground and/or the local municipal corporation supplying it from another source - like a river or lake -- through a dedicated water pipeline. Most new apartments in Bangalore are built in areas that have depleted their underground water reserves and therefore rely on water tanks to quench their water needs which is not sustainable in the long run. Ask the builder/owner if the place gets a regular supply of river (Cauvery in case of Bangalore) and how the groundwater levels are.\n\nChecks related to lifestyle \n\nOther than legal issues and builder-related checks, when deciding to invest a home, one must also factor in their own preferences and take a long term view of their lifestyle. To that end, here's a few checks:\n\n### 8. Pet friendliness\n\nAs a dog parent who's often faced the brunt of [animal-hostile neighbourhoods](https://www.theboholiving.com/post/feeders-harassed-rescuers-stretched-thin-culling-feared-the-stray-dog-story-and-how-to-help), for me dog-friendliness is an important check when considering a home, whether rented or own. Are the neighbours okay with dogs? Are there rules in place against movement of dogs in lifts and other common areas? Are there enough places to walk the dog peacefully? And is there a vet nearby?\n\nYou may not have a dog or pet today and these checks may slip through the cracks, but never say never. A locality or society that's hostile towards dogs also reflects a lot on the society and the kind of people you're likely to have for neighbours. In fact I judge the kind of people by their attitude and approach towards dogs and animals in general.\n\n### 9. Accessibility and local commute\n\nSure, the builder may be top-tier and the property may have the greatest views, but will you need to go through hell and back for your daily office commute? Accessibility and options for commute are one of the most important factors in home buying or even renting and yet are often overlooked in against the more instantly-gratifying amenities. The house you're buying should ideally be accessible to the last mile by a mode of public transport. There should be bus stops within a reasonable distance not just for your own but convenience of your domestic staff. And if you regularly commute to office and are in a tier 2 city, then current or future proximity to a metro station should also be factored in. There's a reason why houses that are close to a metro station are preferred by people. Such properties are also easier to rent out. \n\n### 10. Mobile Network Coverage\n\nAn important but most overlooked aspect of a house is network coverage. You may think that we're beyond that age when network issues were a factor and  pottering about with your phone held high hoping to catch a bar or two was a thing of the past, but you'd be surprised. There are still many areas that have poor service and will affect your quality of life.  (No Netflix? No Work from home?) Sometimes, it could be due to network jammers placed by sensitive areas. for eg. SJR Bluewaters is currently facing network issues due to the jammers present in the Bangalore Central Jail which it borders. \n\nThere are many more factors like your potential neighbours, build quality, soundness of the investment, rental prospects, but I've hopefully covered the most critical checks to perform before signing on the dotted line for buying.  All the best! Go get that dream home and make sure it doesn't turn into a nightmare. ",
    "flair": "Law & Courts",
    "score": 306,
    "num_comments": 46,
    "created_utc": 1712750220.0,
    "convurl": "https://b.thumbs.redditmedia.com/_UlwxMceQrFOsqvc-NE1us9vZAAZ7sdhtk05j6qWWUQ.jpg",
    "comments": [
        "saved, thank you!",
        "cfbr",
        "Mate I'll be buying my first property soon, thank you this is something I needed.",
        "Glad to know! All the best",
        "As someone who's closing in on a property, this is incredibly helpful. I've been searching for a down-to-earth and easy-to-read guide like this for months, if not years. Thank you so much!",
        "Aww, thank you so much! If this helped you, do you mind commenting the same on my original post here? [https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india](https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india)",
        "We really have the worst of all nations .Russian red tape combined with African infra",
        "If you apply for a loan from a bank's specialized branches dealing with home loans, they will carry out the above checklist for you from reputed legal firms and real estate valuers. It will save you some time finding a good lawyer.",
        "For houses already constructed, [check for seepage from above to your house and from your house to below](https://thescurvydawg.com/2021/08/25/seepage-woes/).",
        "Damm what a post, saved",
        "saved for future.. nicely written",
        "The original post I wrote resides here. This is an abridged version for reddit. [https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india](https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india)",
        "yeah i mentioned that",
        "Point 2 is not Valid. Many take home loans or LAP due to tax reasons and better cash flow management. Infact many buyers prefer to take a loan as the bank also does the title search in addition to the lawyer and broker.\nAlso when its mortgaged the Mortgage deed is dult registered and is available online\nPlus the Originals are with the bank or lender\nSo its safer that way",
        "List of docs you should get /verify etc \n\nPROPERTY-\n\nA. TITLE DOCU. S/B CLEAR\n\nB. SELLER SHOULD HAVE GOTTEN  THRU- SALE DEED OR  GIFT DEED\n\nC. POWER OF ATTORNEY, AAM MUKHTIYARNAMA TO SAVE TAXES - NEVER BUY POWER OF ATTORNEY BAUGHT LAND.- BCZ POA CAN BE REVOKED ANYTIME.\n\nD. LAW THAT  LAND SB REGISTERED SALE DEED/GIFT DEED. \n\nE. CHANNEL DOCUMENT- HISTORY OF PREVIOUS SALE DEEDS\n\nF. INCUMBERENCE CERTIFICAATE- TO CHECK LOANS-FORM 22 TO BE FILLED IN LAND RECORD OFFICE BY RESITRAR, CANB APPLIED ONLINE\n\nG . OCCUPANCY CERTIFICATE/NOC FROM MUNICIPALITY\n\nH. ALLOTMENT LETTER FORM BUILDER. BOTH FROM GOVT TO BUILDER & BUILDER TO CUSTOMER SB GOTTEN\n\nI. GET PROPERTY TAX DOCUS FROM MUNICIPALITY OR ORG LIKE GLADA/BOTH COMMERCIAL & RESIDENTIAL PROPERTY\n\nJ. GET MAINTENANCE FESS/WELFARE FEES FROM SOCIETY\n\nK. MUTATION DOCUMENT/JAMABANDI/DAKHUL-E -KHARIJ - JAMABANDI IS EXTREME NECCESSARY. FIRST GET SALE DEED THEN GO TO DEPTT SUCH AS GLADA  TO REGISTERY DONE /JAMABANDI DONE.\n\nL. CONCLUSIVE DOCU IS SALE DEED\n\nM. CONVERSION - CLU-",
        "Well i wrote this post and I didnt take a home loan and I did get scammed into almost buying a house that was already on mortgage.",
        "Yep, thanks!",
        "Yo Kudos for the efforts man .",
        "Savings this. Thanks",
        "Lol it doesn't work like that here",
        "Many thanks to OP.",
        "saved it, thank you man!",
        "bro dogs in our community bite people for no reason, when we call people to be transported away ( stray ones) (which costs money btw) the dog lovers hide them, so while i respect your opinion i dont like stray dogs. i know this is not related to your post. just wanted to say. \"A locality or society that's hostile towards dogs also reflects a lot on the society and the kind of people you're likely to have for neighbours.\" is  not  well whatever",
        "You're exactly the kind of person I'm taelinf about.",
        "Point 8 made me like you a lot!! You seem like a really nice person. I hope your home is a joy and comfort for you and all your current and future pets!",
        "Hello fellow dog lover?",
        "Hello!!! Do you have any dogs right now?",
        "Saving thisss, thankyouuu",
        "This is extremely helpful. Thank you!",
        "I had dogs previously and now am a cat mom.\nVery happy to see you added this point in between.\nHelps so much to live freely and in peace since we consider our pets as our family.",
        "I am in the process of buying my first property. This is gold for me. Grateful for this post. Saving it to revisit later. Cheers.",
        "r/indianhomebuyers",
        "Very cool!!",
        "Make sure there are no places of worship nearby. They are sources of noise that have the capability to drive you insane, quite literally.",
        "@admins,  Why's my post removed for having \"AI generated content?\" Not a line is from a GPT. In fact I don't use GPT or ai for content ever.\nI've written over 2000 articles, please I don't need GPT. \nPlease prove it to me before asserting it's chatGPT",
        "Yas!! Biggest red flag about a building is dog hostile rules. (Some even have \"pets not allowed in lifts\"  I'd stay a mile off from such)",
        "Ask for Original Title Papers and you can check online also if the property is mortgaged"
    ],
    "cleaned_text": "buying house made checklist things see buying house india buying house joke funding obviously requires time patience many resources see property purchase likely one biggest biggest purchases life pointers need keep mind deciding buy house recent firsttime home buyer heres handy checklist factors look buying house learn mistakes made checks related compliance legality take home loan people banks legwork plan buy without loan onus legal background checks house legal clearance projecthouse goes without saying every house legal clearance sold essence party owner youre buying clear vetted legal documents authorizing legal owner house many gullible first home buyers get entangled scams end buying property someone didnt begin property thats encumbered number legal disputes various claimants remember epic scene khosla ka ghosla movie surprisingly real estate ed article except one xb talking legal documents every house clear agreement sale deeds land transfership records establish property good sale since average home buyer get lost legalese nonnative vernacular language documents prudent hire lawyer asses property documents vet property decent lawyer run documents onetime charge around inr lawyer engaged later help registration property free mortgage similar house pledged bank loan case bought first house almost bought another one right unearthing fact house already pledged bank home loan original owner taken plan take house without loan easy overlook aspect end buying house thats previously mortgaged owner defaults loan could end sticky situation worst case scenario lose house occupancy certificate occupancy certificate granted building complies laws stipulations set local government like green signal builder go ahead property good go granted two phases partial oc given projects blueprint complies stipulations like say approved project area height distance water bodies sewage treatment plans etc theory full oc granted project complete complies practice given spate rampant construction urban areas especially metro cities new builders coming day rare cases may happen apartment constructed without obtaining due approvals govt officials unscrupulous means hint bribes cases apartments may end getting final occupancy certificate municipal authorities various issues like encroachment protected land noncompliance project height build area supply water electricity etc violations house without oc good illegal entity buy one live nearly impossible sell standout case project entangled oc battle bangalores sjr watermark apartments oc withdrawnhttpswwwdeccanheraldcomindiakarnatakabengalurudespitescinterventionbbmpfailedtoremovebuildingsencroachingkaikondrahallilakehtml encroaching maximum permissible lakeside limits today matter hangs limbo apartments residents helplessly sitting cr houses without valid oc checks related builder legality compliance one must also look checks ascertain whether builder trusted builders reputation real estate market builders reputation help sell flats back name eg httpeginin india builders like sobha prestige dlf sjr etc enjoy certain reputation delivered projects good quality construction factors lasted test time hard ascertain new builders reputation check google reviews rera cases builder signals reputation dont want buy house come know builders imminent bankruptcy leading project never seeing light day many rera violations case supertechhttpswwwindiatodayincitiesnoidastoryhomebuyerfrustratedmercydeathsupertechflatafterinsolvency noida twin towers demolished building towers beyond approved construction per initial plans rera cases govt india provides effective consumer protection system form rera real estate regulation development act legislation passed government india reform real estate sector india encouraging greater transparency citizen centricity accountability financial discipline violation rera specifications builder grounds consumer file case builder rera act hence looking rera cases builder provide effective checkpoint reputation potential risks help prospective home buyer carry due diligence look rera cases builder every state rera website example site karnataka rera caseshttpsrerakarnatakagovinprojectcomplaintreport even though every project likely rera cases easy file one even smallest offences list complaints specific builder heavily titled might red flag checks related area future construction around area flat beautiful meadows today may nestled amidst concrete jungle years line unobstructed view youre buying today may allow even ray sunshine peek later lake view youre paying premium may turn dry wasteland water dries worse another builder encroaches lake construction buying house look surroundings today well within next years recently found gas power plant near property ive booked resumed trial runs aware stay order supreme court failure part aware given permission conduct trial runs recently appalled power station right middle densely populated place sayshttpswwwredditcomrindianrealestatecommentsbxdisitsafetosettledownondoddaballapurmain reddit user sources water supply light latest water crisis bangalore important question ask deciding buy house future home reliable sustainable source fresh water fresh water could mean borewell pumping water underground andor local municipal corporation supplying another source like river lake dedicated water pipeline new apartments bangalore built areas depleted underground water reserves therefore rely water tanks quench water needs sustainable long run ask builderowner place gets regular supply river cauvery case bangalore groundwater levels checks related lifestyle legal issues builderrelated checks deciding invest home one must also factor preferences take long term view lifestyle end heres checks pet friendliness dog parent whos often faced brunt animalhostile neighbourhoodshttpswwwtheboholivingcompostfeedersharassedrescuersstretchedthincullingfearedthestraydogstoryandhowtohelp dogfriendliness important check considering home whether rented neighbours okay dogs rules place movement dogs lifts common areas enough places walk dog peacefully vet nearby may dog pet today checks may slip cracks never say never locality society thats hostile towards dogs also reflects lot society kind people youre likely neighbours fact judge kind people attitude approach towards dogs animals general accessibility local commute sure builder may toptier property may greatest views need go hell back daily office commute accessibility options commute one important factors home buying even renting yet often overlooked instantlygratifying amenities house youre buying ideally accessible last mile mode public transport bus stops within reasonable distance convenience domestic staff regularly commute office tier city current future proximity metro station also factored theres reason houses close metro station preferred people properties also easier rent mobile network coverage important overlooked aspect house network coverage may think beyond age network issues factor pottering phone held high hoping catch bar two thing past youd surprised still many areas poor service affect quality life netflix work home sometimes could due network jammers placed sensitive areas eg sjr bluewaters currently facing network issues due jammers present bangalore central jail borders many factors like potential neighbours build quality soundness investment rental prospects ive hopefully covered critical checks perform signing dotted line buying best go get dream home make sure doesnt turn nightmare ",
    "cleaned_title": "buying house made checklist things see buying house india",
    "cleaned_selftext": "buying house joke funding obviously requires time patience many resources see property purchase likely one biggest biggest purchases life pointers need keep mind deciding buy house recent firsttime home buyer heres handy checklist factors look buying house learn mistakes made checks related compliance legality take home loan people banks legwork plan buy without loan onus legal background checks house legal clearance projecthouse goes without saying every house legal clearance sold essence party owner youre buying clear vetted legal documents authorizing legal owner house many gullible first home buyers get entangled scams end buying property someone didnt begin property thats encumbered number legal disputes various claimants remember epic scene khosla ka ghosla movie surprisingly real estate ed article except one xb talking legal documents every house clear agreement sale deeds land transfership records establish property good sale since average home buyer get lost legalese nonnative vernacular language documents prudent hire lawyer asses property documents vet property decent lawyer run documents onetime charge around inr lawyer engaged later help registration property free mortgage similar house pledged bank loan case bought first house almost bought another one right unearthing fact house already pledged bank home loan original owner taken plan take house without loan easy overlook aspect end buying house thats previously mortgaged owner defaults loan could end sticky situation worst case scenario lose house occupancy certificate occupancy certificate granted building complies laws stipulations set local government like green signal builder go ahead property good go granted two phases partial oc given projects blueprint complies stipulations like say approved project area height distance water bodies sewage treatment plans etc theory full oc granted project complete complies practice given spate rampant construction urban areas especially metro cities new builders coming day rare cases may happen apartment constructed without obtaining due approvals govt officials unscrupulous means hint bribes cases apartments may end getting final occupancy certificate municipal authorities various issues like encroachment protected land noncompliance project height build area supply water electricity etc violations house without oc good illegal entity buy one live nearly impossible sell standout case project entangled oc battle bangalores sjr watermark apartments oc withdrawnhttpswwwdeccanheraldcomindiakarnatakabengalurudespitescinterventionbbmpfailedtoremovebuildingsencroachingkaikondrahallilakehtml encroaching maximum permissible lakeside limits today matter hangs limbo apartments residents helplessly sitting cr houses without valid oc checks related builder legality compliance one must also look checks ascertain whether builder trusted builders reputation real estate market builders reputation help sell flats back name eg httpeginin india builders like sobha prestige dlf sjr etc enjoy certain reputation delivered projects good quality construction factors lasted test time hard ascertain new builders reputation check google reviews rera cases builder signals reputation dont want buy house come know builders imminent bankruptcy leading project never seeing light day many rera violations case supertechhttpswwwindiatodayincitiesnoidastoryhomebuyerfrustratedmercydeathsupertechflatafterinsolvency noida twin towers demolished building towers beyond approved construction per initial plans rera cases govt india provides effective consumer protection system form rera real estate regulation development act legislation passed government india reform real estate sector india encouraging greater transparency citizen centricity accountability financial discipline violation rera specifications builder grounds consumer file case builder rera act hence looking rera cases builder provide effective checkpoint reputation potential risks help prospective home buyer carry due diligence look rera cases builder every state rera website example site karnataka rera caseshttpsrerakarnatakagovinprojectcomplaintreport even though every project likely rera cases easy file one even smallest offences list complaints specific builder heavily titled might red flag checks related area future construction around area flat beautiful meadows today may nestled amidst concrete jungle years line unobstructed view youre buying today may allow even ray sunshine peek later lake view youre paying premium may turn dry wasteland water dries worse another builder encroaches lake construction buying house look surroundings today well within next years recently found gas power plant near property ive booked resumed trial runs aware stay order supreme court failure part aware given permission conduct trial runs recently appalled power station right middle densely populated place sayshttpswwwredditcomrindianrealestatecommentsbxdisitsafetosettledownondoddaballapurmain reddit user sources water supply light latest water crisis bangalore important question ask deciding buy house future home reliable sustainable source fresh water fresh water could mean borewell pumping water underground andor local municipal corporation supplying another source like river lake dedicated water pipeline new apartments bangalore built areas depleted underground water reserves therefore rely water tanks quench water needs sustainable long run ask builderowner place gets regular supply river cauvery case bangalore groundwater levels checks related lifestyle legal issues builderrelated checks deciding invest home one must also factor preferences take long term view lifestyle end heres checks pet friendliness dog parent whos often faced brunt animalhostile neighbourhoodshttpswwwtheboholivingcompostfeedersharassedrescuersstretchedthincullingfearedthestraydogstoryandhowtohelp dogfriendliness important check considering home whether rented neighbours okay dogs rules place movement dogs lifts common areas enough places walk dog peacefully vet nearby may dog pet today checks may slip cracks never say never locality society thats hostile towards dogs also reflects lot society kind people youre likely neighbours fact judge kind people attitude approach towards dogs animals general accessibility local commute sure builder may toptier property may greatest views need go hell back daily office commute accessibility options commute one important factors home buying even renting yet often overlooked instantlygratifying amenities house youre buying ideally accessible last mile mode public transport bus stops within reasonable distance convenience domestic staff regularly commute office tier city current future proximity metro station also factored theres reason houses close metro station preferred people properties also easier rent mobile network coverage important overlooked aspect house network coverage may think beyond age network issues factor pottering phone held high hoping catch bar two thing past youd surprised still many areas poor service affect quality life netflix work home sometimes could due network jammers placed sensitive areas eg sjr bluewaters currently facing network issues due jammers present bangalore central jail borders many factors like potential neighbours build quality soundness investment rental prospects ive hopefully covered critical checks perform signing dotted line buying best go get dream home make sure doesnt turn nightmare",
    "cleaned_comments": "saved thank cfbr mate ill buying first property soon thank something needed glad know best someone whos closing property incredibly helpful ive searching downtoearth easytoread guide like months years thank much aww thank much helped mind commenting original post httpswwwtheboholivingcompostchecklistofthingstoseebeforebuyingahomeindiahttpswwwtheboholivingcompostchecklistofthingstoseebeforebuyingahomeindia really worst nations russian red tape combined african infra apply loan banks specialized branches dealing home loans carry checklist reputed legal firms real estate valuers save time finding good lawyer houses already constructed check seepage house house belowhttpsthescurvydawgcomseepagewoes damm post saved saved future nicely written original post wrote resides abridged version reddit httpswwwtheboholivingcompostchecklistofthingstoseebeforebuyingahomeindiahttpswwwtheboholivingcompostchecklistofthingstoseebeforebuyingahomeindia yeah mentioned point valid many take home loans lap due tax reasons better cash flow management infact many buyers prefer take loan bank also title search addition lawyer broker also mortgaged mortgage deed dult registered available online plus originals bank lender safer way list docs get verify etc property title docu sb clear b seller gotten thru sale deed gift deed c power attorney aam mukhtiyarnama save taxes never buy power attorney baught land bcz poa revoked anytime law land sb registered sale deedgift deed e channel document history previous sale deeds f incumberence certificaate check loansform filled land record office resitrar canb applied online g occupancy certificatenoc municipality h allotment letter form builder govt builder builder customer sb gotten get property tax docus municipality org like gladaboth commercial residential property j get maintenance fesswelfare fees society k mutation documentjamabandidakhule kharij jamabandi extreme neccessary first get sale deed go deptt glada registery done jamabandi done l conclusive docu sale deed conversion clu well wrote post didnt take home loan get scammed almost buying house already mortgage yep thanks yo kudos efforts man savings thanks lol doesnt work like many thanks op saved thank man bro dogs community bite people reason call people transported away stray ones costs money btw dog lovers hide respect opinion dont like stray dogs know related post wanted say locality society thats hostile towards dogs also reflects lot society kind people youre likely neighbours well whatever youre exactly kind person im taelinf point made like lot seem like really nice person hope home joy comfort current future pets hello fellow dog lover hello dogs right saving thisss thankyouuu extremely helpful thank dogs previously cat mom happy see added point helps much live freely peace since consider pets family process buying first property gold grateful post saving revisit later cheers rindianhomebuyers cool make sure places worship nearby sources noise capability drive insane quite literally admins whys post removed ai generated content line gpt fact dont use gpt ai content ever ive written articles please dont need gpt please prove asserting chatgpt yas biggest red flag building dog hostile rules even pets allowed lifts id stay mile ask original title papers check online also property mortgaged",
    "light_cleaned_title": "After buying a house, I made a checklist of things you should see before buying a house in India",
    "light_cleaned_selftext": "Buying a house is no joke and other than the funding obviously, it requires time, patience and many other resources to see a property purchase through. It's likely to be one of the biggest if not the biggest purchases of your life so there are a few pointers you need to keep in mind when deciding to buy a house. So as a recent first-time home buyer myself, here's a handy checklist of 10 factors you should look for before buying a house. (and learn from some of the mistakes I made.) **Checks related to compliance and legality** When you take a home on loan as most people do, the banks do the most legwork for you, but if you plan to buy it without the loan, then the onus of doing legal background checks on the house is on you. ### 1. Legal Clearance for the project/house Goes without saying, every house should have a legal clearance to be sold. In essence, the party or owner you're buying it from should have clear and vetted legal documents authorizing them as the legal owner of the house. Many gullible first home buyers get entangled in scams where they end up buying a property from someone who didn't own it to begin with or a property that's encumbered in a number of legal disputes between various claimants. Remember this epic scene from *Khosla Ka Ghosla*, a movie that surprisingly had more real estate ed than any other article! (except this one.) &#x200B; Talking of legal documents, every house should have clear \"Agreement to sale deeds\" and 'land transfership\" records to establish the property as good for sale. Since the average home buyer can get lost in the legalese and non-native vernacular language of the documents, it's prudent to hire a lawyer to asses the property documents and have them vet the property. Any decent lawyer can run through the documents on a one-time charge of around INR 10,000-15,000. The same lawyer can be engaged later to help with registration of the property and so on. ### 2. Free from mortgage Similar to the above, the house should not have been \"pledged' to a bank against a loan. In my case, before I bought my first house, I almost bought another one right before unearthing the fact that the house was already pledged to the bank against a home loan its original owner had taken out. If you plan to take a house without a loan, it's easy to overlook this aspect and end up buying a house that's been previously mortgaged. If the owner defaults the loan, you could end up in a sticky situation, and in a worst case scenario, lose the house too. ### 3. Occupancy Certificate An occupancy certificate is granted to a building that complies with all the laws and stipulations as set by a local government. It's like a green signal for the builder to \"go ahead your property is good to go\" It's granted in two phases -- Partial OC is given when the project's blueprint complies with all the stipulations like say approved project area, height, distance from water bodies, sewage treatment plans etc. in theory. And a full OC is granted when a project is complete and complies with all of the above in practice. Given the spate of rampant construction in urban areas especially metro cities, new builders are coming up by the day . In rare cases it may happen that the apartment was constructed without obtaining the due approvals from govt officials or through some other unscrupulous means. (hint; bribes) In those cases, the apartments may not end up getting a final Occupancy Certificate from the municipal authorities because of various issues like encroachment of protected land, non-compliance with project height or build area, supply of water, electricity etc or any other violations. A house without an OC is as good as an illegal entity. You can buy one to live in, but it will be nearly impossible to sell it. A standout case for a project entangled in an OC battle is Bangalore's SJR Watermark apartments when its [OC was withdrawn](https://www.deccanherald.com/india/karnataka/bengaluru/despite-sc-intervention-bbmp-failed-to-remove-buildings-encroaching-kaikondrahalli-lake-1143138.html) for encroaching on the maximum permissible lakeside limits. Until today, the matter hangs in limbo, with the apartment's 1000+ residents helplessly sitting in their 2cr + houses without a valid OC. Checks related to the builder Other than legality and compliance, one must also look for checks that ascertain whether the builder can be trusted. ### 4. Builder's reputation In the real estate market, builder's reputation can help sell flats on the back of the name itself. For eg.[ ](http://eg.in/)in India, builders like Sobha, Prestige, DLF, SJR etc enjoy a certain reputation for having delivered projects with good quality construction and other factors that have lasted the test of time. While it's hard to ascertain a new builder's reputation, check Google reviews, and RERA cases against the builder as signals for its reputation. You don't want to buy a house only to come to know about the builder's imminent bankruptcy leading to a project never seeing the light of the day or its many RERA violations as was the [case with Supertech](https://www.indiatoday.in/cities/noida/story/homebuyer-frustrated-mercy-death-supertech-flat-after-insolvency-2368265-2023-05-04). (The Noida 'twin towers' that were demolished for building the towers above and beyond the approved construction as per the initial plans.) ### 5. RERA cases The govt of India provides for an effective consumer protection system in the form of RERA (Real Estate Regulation and Development Act, 2016) a legislation passed by the Government of India to reform the real estate sector in India, encouraging greater transparency, citizen centricity, accountability and financial discipline. Violation of any of the RERA specifications by a builder is grounds for a consumer to file a case against the builder under the RERA act. Hence, looking up RERA cases against a builder can provide an effective checkpoint into its reputation, potential risks and help a prospective home buyer to carry out their due diligence. ### Where to look for RERA cases against a builder? Every state has its own RERA website. For example, this is the [site for Karnataka RERA cases](https://rera.karnataka.gov.in/projectComplaintReport). Even though every project is likely to have some RERA cases against it as it's easy to file one even for the smallest offences, if the list of complaints against a specific builder is heavily titled, it might be a red flag. Checks related to the area ### 6. Future construction around the area A flat in a beautiful meadows today may be nestled amidst a concrete jungle 10 years down the line. That unobstructed view you're buying it today for may not allow even for a ray of sunshine to peek through later! Or the lake view you're paying a premium for may turn into a dry wasteland when the water dries up or worse another builder encroaches the lake for construction! When buying a house, look at the surroundings not just today but well within the next 10-20 years. \"I recently found out that the gas power plant near a property I've booked has resumed trial runs. While I was aware of the stay order from the Supreme court on it, it is a failure on my part to not have been aware that it has been given permission to conduct trial runs recently. I am just appalled that there is a power station right in the middle of a densely populated place.\", [says](https://www.reddit.com/r/indianrealestate/comments/1bxd392/is_it_safe_to_settle_down_on_doddaballapur_main/) a Reddit user. ### 7. Sources of water supply In light of the latest water crisis in Bangalore, the most important question to ask when deciding to buy a house is \"does your future home have a reliable and sustainable source of fresh water?\" Fresh water could mean a borewell pumping water from the underground and/or the local municipal corporation supplying it from another source - like a river or lake -- through a dedicated water pipeline. Most new apartments in Bangalore are built in areas that have depleted their underground water reserves and therefore rely on water tanks to quench their water needs which is not sustainable in the long run. Ask the builder/owner if the place gets a regular supply of river (Cauvery in case of Bangalore) and how the groundwater levels are. Checks related to lifestyle Other than legal issues and builder-related checks, when deciding to invest a home, one must also factor in their own preferences and take a long term view of their lifestyle. To that end, here's a few checks: ### 8. Pet friendliness As a dog parent who's often faced the brunt of [animal-hostile neighbourhoods](https://www.theboholiving.com/post/feeders-harassed-rescuers-stretched-thin-culling-feared-the-stray-dog-story-and-how-to-help), for me dog-friendliness is an important check when considering a home, whether rented or own. Are the neighbours okay with dogs? Are there rules in place against movement of dogs in lifts and other common areas? Are there enough places to walk the dog peacefully? And is there a vet nearby? You may not have a dog or pet today and these checks may slip through the cracks, but never say never. A locality or society that's hostile towards dogs also reflects a lot on the society and the kind of people you're likely to have for neighbours. In fact I judge the kind of people by their attitude and approach towards dogs and animals in general. ### 9. Accessibility and local commute Sure, the builder may be top-tier and the property may have the greatest views, but will you need to go through hell and back for your daily office commute? Accessibility and options for commute are one of the most important factors in home buying or even renting and yet are often overlooked in against the more instantly-gratifying amenities. The house you're buying should ideally be accessible to the last mile by a mode of public transport. There should be bus stops within a reasonable distance not just for your own but convenience of your domestic staff. And if you regularly commute to office and are in a tier 2 city, then current or future proximity to a metro station should also be factored in. There's a reason why houses that are close to a metro station are preferred by people. Such properties are also easier to rent out. ### 10. Mobile Network Coverage An important but most overlooked aspect of a house is network coverage. You may think that we're beyond that age when network issues were a factor and pottering about with your phone held high hoping to catch a bar or two was a thing of the past, but you'd be surprised. There are still many areas that have poor service and will affect your quality of life. (No Netflix? No Work from home?) Sometimes, it could be due to network jammers placed by sensitive areas. for eg. SJR Bluewaters is currently facing network issues due to the jammers present in the Bangalore Central Jail which it borders. There are many more factors like your potential neighbours, build quality, soundness of the investment, rental prospects, but I've hopefully covered the most critical checks to perform before signing on the dotted line for buying. All the best! Go get that dream home and make sure it doesn't turn into a nightmare.",
    "light_cleaned_comments": "saved, thank you! cfbr Mate I'll be buying my first property soon, thank you this is something I needed. Glad to know! All the best As someone who's closing in on a property, this is incredibly helpful. I've been searching for a down-to-earth and easy-to-read guide like this for months, if not years. Thank you so much! Aww, thank you so much! If this helped you, do you mind commenting the same on my original post here? [https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india](https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india) We really have the worst of all nations .Russian red tape combined with African infra If you apply for a loan from a bank's specialized branches dealing with home loans, they will carry out the above checklist for you from reputed legal firms and real estate valuers. It will save you some time finding a good lawyer. For houses already constructed, [check for seepage from above to your house and from your house to below](https://thescurvydawg.com/2021/08/25/seepage-woes/). Damm what a post, saved saved for future.. nicely written The original post I wrote resides here. This is an abridged version for reddit. [https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india](https://www.theboholiving.com/post/checklist-of-things-to-see-before-buying-a-home-india) yeah i mentioned that Point 2 is not Valid. Many take home loans or LAP due to tax reasons and better cash flow management. Infact many buyers prefer to take a loan as the bank also does the title search in addition to the lawyer and broker. Also when its mortgaged the Mortgage deed is dult registered and is available online Plus the Originals are with the bank or lender So its safer that way List of docs you should get /verify etc PROPERTY- A. TITLE DOCU. S/B CLEAR B. SELLER SHOULD HAVE GOTTEN THRU- SALE DEED OR GIFT DEED C. POWER OF ATTORNEY, AAM MUKHTIYARNAMA TO SAVE TAXES - NEVER BUY POWER OF ATTORNEY BAUGHT LAND.- BCZ POA CAN BE REVOKED ANYTIME. D. LAW THAT LAND SB REGISTERED SALE DEED/GIFT DEED. E. CHANNEL DOCUMENT- HISTORY OF PREVIOUS SALE DEEDS F. INCUMBERENCE CERTIFICAATE- TO CHECK LOANS-FORM 22 TO BE FILLED IN LAND RECORD OFFICE BY RESITRAR, CANB APPLIED ONLINE G . OCCUPANCY CERTIFICATE/NOC FROM MUNICIPALITY H. ALLOTMENT LETTER FORM BUILDER. BOTH FROM GOVT TO BUILDER & BUILDER TO CUSTOMER SB GOTTEN I. GET PROPERTY TAX DOCUS FROM MUNICIPALITY OR ORG LIKE GLADA/BOTH COMMERCIAL & RESIDENTIAL PROPERTY J. GET MAINTENANCE FESS/WELFARE FEES FROM SOCIETY K. MUTATION DOCUMENT/JAMABANDI/DAKHUL-E -KHARIJ - JAMABANDI IS EXTREME NECCESSARY. FIRST GET SALE DEED THEN GO TO DEPTT SUCH AS GLADA TO REGISTERY DONE /JAMABANDI DONE. L. CONCLUSIVE DOCU IS SALE DEED M. CONVERSION - CLU- Well i wrote this post and I didnt take a home loan and I did get scammed into almost buying a house that was already on mortgage. Yep, thanks! Yo Kudos for the efforts man . Savings this. Thanks Lol it doesn't work like that here Many thanks to OP. saved it, thank you man! bro dogs in our community bite people for no reason, when we call people to be transported away ( stray ones) (which costs money btw) the dog lovers hide them, so while i respect your opinion i dont like stray dogs. i know this is not related to your post. just wanted to say. \"A locality or society that's hostile towards dogs also reflects a lot on the society and the kind of people you're likely to have for neighbours.\" is not well whatever You're exactly the kind of person I'm taelinf about. Point 8 made me like you a lot!! You seem like a really nice person. I hope your home is a joy and comfort for you and all your current and future pets! Hello fellow dog lover? Hello!!! Do you have any dogs right now? Saving thisss, thankyouuu This is extremely helpful. Thank you! I had dogs previously and now am a cat mom. Very happy to see you added this point in between. Helps so much to live freely and in peace since we consider our pets as our family. I am in the process of buying my first property. This is gold for me. Grateful for this post. Saving it to revisit later. Cheers. r/indianhomebuyers Very cool!! Make sure there are no places of worship nearby. They are sources of noise that have the capability to drive you insane, quite literally. @admins, Why's my post removed for having \"AI generated content?\" Not a line is from a GPT. In fact I don't use GPT or ai for content ever. I've written over 2000 articles, please I don't need GPT. Please prove it to me before asserting it's chatGPT Yas!! Biggest red flag about a building is dog hostile rules. (Some even have \"pets not allowed in lifts\" I'd stay a mile off from such) Ask for Original Title Papers and you can check online also if the property is mortgaged"
}