{
    "id": "1hj3p3d",
    "title": "Apparently Ola Foods can't do basic maths",
    "url": "https://i.redd.it/dbokkiw9758e1.png",
    "selftext": "I don't even care about the price anymore but atleast match the total amount to the charges you're showing ffs.\n137.97+12.60+10.95=161.52\n\nImagine this happening in Europe or US and they would be facing a lawsuit.",
    "flair": "Rant / Vent",
    "score": 479,
    "num_comments": 93,
    "created_utc": 1734761058.0,
    "convurl": "https://i.redd.it/dbokkiw9758e1.png",
    "comments": [
        "Lol. Wtf",
        "File a consumer complaint citing this as scam or a fraud. ",
        "I've created a post on twitter tagging ola, olafoods and consumer forum india. I'm not really sure if the consumer forum handle is correct though, but I didn't find a blue ticked one. Let's see if anything happens",
        "They counted the tax as double. Ola foods bhi like kaun hi notice karega.",
        "Even I wasn't looking but then I was like wait a minute",
        "Computers don’t make mistakes adding up. It’s a pet of their code and obviously a scam.",
        "Update: I decided to place an order regardless to see if the amount changes, voila, still doesn't match lol.\n\nhttps://preview.redd.it/5ots3prxa58e1.png?width=1264&format=pjpg&auto=webp&s=3f1c02af810f0b6a03d03ae486df8f8c9fec8b06",
        "I'm fine with getting charges stupid charges like festival hikes, but at least show them.",
        "Or it could be a bug",
        "Tag Olan. Ask him to focus on this rather than employee attendance.",
        "similar thing was happening to me on zepto, stopped ordering altogether",
        "Ola wale itna jyda scam kr chuke hai.  Ab kii bhi harkat pe interest hi nhi aata",
        "Very conveniently the bug just adds more than it subtracts. A nice bug to have.",
        "Math is outdated, Olan Musk has copy pasted Alien Math now. Why can't you peasants just suffer small losses in exchange for poor service so that Billionaire Olan can earn a bit more.",
        "Hankon's razor. \n\nNot everything is a conspiracy, sometimes mistakes do just happen.",
        "Already raised a complaint on X and Consumer helpline.",
        "Post on Twitter and tag Kunal Kamra.",
        "Damn, I'm gonna give him some good content to work with",
        "Ola should burn to the ground so that I dance on its grave or piss on its ashes.",
        "Bro don't use ola foods. I used it only once, it's the shittiest app of all. \nThe map is so poor. Even after putting the correct address, it showed at a random location and the delivery person went there. \nUninstalled right away.",
        "lodge a complain on consumer forum website",
        "I don't use it, but sometimes I do get good offers. But it's not even the point of service right now. If your charges don't match then you're just a scam at this point.",
        "Done",
        "Use the web portal to file a case. \n\nThey have a good track record.",
        "How dare you say that’s wrong?\n\nMaths is a western concept \nScam is an Indian concept\n\nCheck yourself before you wreck yourself",
        "My bad sire, I shall take my zeros with me",
        "Remind me! 2 days",
        "How dare you order chicken?!\nIs this India or Kentuckistan?",
        "I will be messaging you in 2 days on [**2024-12-23 06:41:24 UTC**](http://www.wolframalpha.com/input/?i=2024-12-23%2006:41:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1hj3p3d/apparently_ola_foods_cant_do_basic_maths/m33p6zb/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1hj3p3d%2Fapparently_ola_foods_cant_do_basic_maths%2Fm33p6zb%2F%5D%0A%0ARemindMe%21%202024-12-23%2006%3A41%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201hj3p3d)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "Everything Ola does is a mess. The app is infuriating—why would I want to order food when I'm just trying to book a ride that inevitably gets canceled? No, I don’t need a loan, your nightmare EV, or your AI chat. I just want to overpay for an auto ride in peace.",
        "If this code reached production where the monetary basics of your app malfunctions then you deserve to be screwed.",
        "Can you send me the link too. I once booked ola cab, in invoice it shows less but the amount i had to pay was more, when i tried to raise a ticket, it asked did you pay x (which showed more amount), I said yes, and nothing happened, i can't even complain against driver as he just asked me to pay what was showed to him.",
        "There's not even a human support chat available. I don't want to talk to ai and get told we are working on it",
        "And they will if you report it. What's the point?",
        "https://consumerhelpline.gov.in/user/register-complaint.php",
        "https://consumerhelpline.gov.in/public/",
        "Why don't their mistakes turn into our favour? Its always them who benefits from their mistakes",
        "Thank you",
        "Thank you",
        "I've attached a screenshot post order and they spiked the price of the item to 170, as if they're saying look we're charging you less than what it should be.",
        "there was also a very inconvenient bug some time back that led to a lot of people hitting jackpots on cred",
        "Is this a niche variant of Hanlon's razor? Funny how mistakes always happen in their favour.",
        "Most ppl don't even do the match just blindly go to checkout and complete the order. \n\nGood that u caught this, seem like they are adding 6.26% of the actual sum adn making it 172.47\n\nDefinitely not a Math issue here cos it's how they have done coding purposefully to add some percentage to the actual sum which most customer won't even notice.",
        "Do it dude, it will be fun!",
        "That the company might have duped customers worth crores because of this \"bug\"\n\nIt's about customer experience and customer promise, a bug showing inaccurate pricing is one thing but charging extra is a whole new level of problematic testing/software",
        "https://preview.redd.it/p0no0ksak58e1.png?width=720&format=pjpg&auto=webp&s=00de35adff9784901f9a9b25ae9fd87662a608b4\n\nI think they gave me your's.",
        "Already done. Everybody is welcome to share and tag kamra. He'll be happy to be spammed with this",
        "Thanks!",
        "Lol turns out after the order it did the same thing for me.\nBut it's not the point,  the point is, how can I be sure of what I'm being charged of, if the charges you're showing don't match the total you're showing. Then I could just be like oh, this is 1000 rupees dish, 200rs charges and pay me 500. I'll be happy to see 500 but confused as to why 500.",
        "Exactly this! Happened to me on car rides as well. Stopped using the app.",
        "So now it shows less than what it should be, I mean it's just a bug then",
        "Dude, I work in Fintech, assisting the leads of both the Design and Engineering. \n\nWhat you said is plain fucking stupid. \n\nWhat they did is actually illegal. It is called fraud if they didn't detect this in testing and just released it like that. \n\nSometimes I really wonder if before you spill it out like word vomit did you even stop for a second and think? \n\nHow is this bug not even reported yet? \n\nAlso to OP,  put the screenshot out on App Store or Play Store. They will immediately flag this version for review and the developers HAVE to work on it. Only way to get their attention.",
        "Best way to get their attention is to post on the App Store or Play Store. They flag the app for bugs and they either within a week or two need to fix the bug or revert to an older version they have.",
        "I don't really care, I paid what I was told. But this could go either way very quickly, and honestly I don't have any clarity of the amount I'm paying. That is what makes this much more serious.",
        "This company itself is a joke and scam",
        "That's true",
        "Tip must have got auto added",
        "Ola foods don't have tips.",
        "Basic maths like weekends, work-life balance is a western concept",
        "What’s OlA foods?",
        "I wouldn't Ola to get anything right.",
        "Share link",
        "It's the same as before if you take away the \"coins\" discount 172.47",
        "They would have automatically added a tip or charitable donation. \n\nI once tipped on swiggy and the next time I ordered it took the tip amount automatically.",
        "You're right. Anyway it's a super glitchy bloated app. Let's see how far it goes.",
        "share the link",
        "https://x.com/Veniato1/status/1870357710027288752?t=teDPrk30gKj5gf7UPlFD7w&s=19",
        "The price you're seeing along with item is a cached price.\n\nBut when calculating the final price, they use the \"final\" price from their database. \n\nUsually the price doesn't change much. Hence cached value == database value. \n\nLooks like you caught them in a situation where the restaurant owner was in midst of changing price",
        "OLA taking the Hidden charges thing to a whole new level",
        "Mostly they can't do anything right and we are supposed to worship them. For what? For getting kickbacks backs from the Government for clean energy and giving us shoddy scooters?  For posing in front of temples as if they know anything about our culture or devotion? I bet they can't even recite one sanskrit prayer properly. So what is this pretense about?",
        "Don't think there is much point in reporting, these pricks have connections so they can do whatever they like.\n India follows the principle of selective law. It's different for us and different for them. Bjus got a student banned from linkedin and quora using their connections beacuse he spoke about the toxic work culture and inferior products.",
        "How did the price of chicken kofta rice bowl go up while ordering lmao",
        "The tax mentioned is just CGST I believe. Double the tax and you’re set. NOT A SCAM, JUST OVERSIGHT.",
        "Not sure but could it be some kind of tip you accidentally added?",
        "It's a wonder it can even get the order delivered to your door. Chhota Musk has totally stepped away from running his firm and now tweets cringe as a full time job. These operations are probably being run by interns or something as plenty of middle management has bailed also.",
        "Go for that order and later file a complaint. That’s the best way to handle these kind of companies. ",
        "I guess the charity is his dumb wife's foundation. They have not filed csr reports for 2 years. What kind of laws are they governed by?",
        "!remindme 2 days",
        "Probably delete or blur your address there ",
        "Wondering what the bug would look like?\n\n\n    total = prev_total + 9.95",
        "Nah, this will be caught during regression for large orders. I think the bug is a bit more subtle like for instance \n\n    if(subtotal < 300) {\n      total = subtotal + package_charge + 2 * tax\n    }",
        "Why do people still use Ola products?",
        "The whole company is extremely deceptive and unethical. Idk why people would ever use their stuff.",
        "Math is definitely a concept and only aunty nashnuls use it 🤬",
        "Does ola foods give more discounts or something? I mean what benefit does it have over delivery other apps",
        "OP, have they fixed it though?\n\nI tried it now, I see the calculation is correct.\n\nhttps://preview.redd.it/e6pogbkipb8e1.jpeg?width=1179&format=pjpg&auto=webp&s=63aa8f62f84ea23acc8bcf3c0269878135ceac81",
        "I haven't tried another transaction but it's a good thing if they did",
        "To compete with the other apps ola did give more discounts. I specifically remember getting a regular potato california burrito bowl at just 170 instead of Zomato selling at some 260",
        "That's bs design. You calculate the price until its confirmed. Once it's confirmed,you save it into db for tracking and accounting purposes.",
        "Zomato also discreetly adds in 30 rupees tip so you have to go and change in settings. Consumer unfair practices.",
        "The annoying ola foods pops up while booking an urgent ride",
        "Woah that's cool ig I'll try ordering from them kabhi",
        "Nah, ola foods doesn't have a tip option. The price changed after the order was placed (ss in the comments), so it's just a pricing issue",
        "That's what happens if the ceo works 20 hours a day",
        "The tax is charged twice",
        "Old foods are like the worst delivery"
    ],
    "cleaned_text": "apparently ola foods cant basic maths dont even care price anymore atleast match total amount charges youre showing ffs imagine happening europe us would facing lawsuit ",
    "cleaned_title": "apparently ola foods cant basic maths",
    "cleaned_selftext": "dont even care price anymore atleast match total amount charges youre showing ffs imagine happening europe us would facing lawsuit",
    "cleaned_comments": "lol wtf file consumer complaint citing scam fraud ive created post twitter tagging ola olafoods consumer forum india im really sure consumer forum handle correct though didnt find blue ticked one lets see anything happens counted tax double ola foods bhi like kaun hi notice karega even wasnt looking like wait minute computers dont make mistakes adding pet code obviously scam update decided place order regardless see amount changes voila still doesnt match lol im fine getting charges stupid charges like festival hikes least show could bug tag olan ask focus rather employee attendance similar thing happening zepto stopped ordering altogether ola wale itna jyda scam kr chuke hai ab kii bhi harkat pe interest hi nhi aata conveniently bug adds subtracts nice bug math outdated olan musk copy pasted alien math cant peasants suffer small losses exchange poor service billionaire olan earn bit hankons razor everything conspiracy sometimes mistakes happen already raised complaint x consumer helpline post twitter tag kunal kamra damn im gon na give good content work ola burn ground dance grave piss ashes bro dont use ola foods used shittiest app map poor even putting correct address showed random location delivery person went uninstalled right away lodge complain consumer forum website dont use sometimes get good offers even point service right charges dont match youre scam point done use web portal file case good track record dare say thats wrong maths western concept scam indian concept check wreck bad sire shall take zeros remind days dare order chicken india kentuckistan messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentshjpdapparentlyolafoodscantdobasicmathsmpzbcontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfhjpdfapparentlyolafoodscantdobasicmathsfmpzbfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletehjpd infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback everything ola mess app infuriatingwhy would want order food im trying book ride inevitably gets canceled dont need loan nightmare ev ai chat want overpay auto ride peace code reached production monetary basics app malfunctions deserve screwed send link booked ola cab invoice shows less amount pay tried raise ticket asked pay x showed amount said yes nothing happened cant even complain driver asked pay showed theres even human support chat available dont want talk ai get told working report whats point dont mistakes turn favour always benefits mistakes thank thank ive attached screenshot post order spiked price item theyre saying look charging less also inconvenient bug time back led lot people hitting jackpots cred niche variant hanlons razor funny mistakes always happen favour ppl dont even match blindly go checkout complete order good u caught seem like adding actual sum adn making definitely math issue cos done coding purposefully add percentage actual sum customer wont even notice dude fun company might duped customers worth crores bug customer experience customer promise bug showing inaccurate pricing one thing charging extra whole new level problematic testingsoftware think gave already done everybody welcome share tag kamra hell happy spammed thanks lol turns order thing point point sure im charged charges youre showing dont match total youre showing could like oh rupees dish rs charges pay ill happy see confused exactly happened car rides well stopped using app shows less mean bug dude work fintech assisting leads design engineering said plain fucking stupid actually illegal called fraud didnt detect testing released like sometimes really wonder spill like word vomit even stop second think bug even reported yet also op put screenshot app store play store immediately flag version review developers work way get attention best way get attention post app store play store flag app bugs either within week two need fix bug revert older version dont really care paid told could go either way quickly honestly dont clarity amount im paying makes much serious company joke scam thats true tip must got auto added ola foods dont tips basic maths like weekends worklife balance western concept whats ola foods wouldnt ola get anything right share link take away coins discount would automatically added tip charitable donation tipped swiggy next time ordered took tip amount automatically youre right anyway super glitchy bloated app lets see far goes share link price youre seeing along item cached price calculating final price use final price database usually price doesnt change much hence cached value database value looks like caught situation restaurant owner midst changing price ola taking hidden charges thing whole new level mostly cant anything right supposed worship getting kickbacks backs government clean energy giving us shoddy scooters posing front temples know anything culture devotion bet cant even recite one sanskrit prayer properly pretense dont think much point reporting pricks connections whatever like india follows principle selective law different us different bjus got student banned linkedin quora using connections beacuse spoke toxic work culture inferior products price chicken kofta rice bowl go ordering lmao tax mentioned cgst believe double tax youre set scam oversight sure could kind tip accidentally added wonder even get order delivered door chhota musk totally stepped away running firm tweets cringe full time job operations probably run interns something plenty middle management bailed also go order later file complaint thats best way handle kind companies guess charity dumb wifes foundation filed csr reports years kind laws governed remindme days probably delete blur address wondering bug would look like total prevtotal nah caught regression large orders think bug bit subtle like instance ifsubtotal total subtotal packagecharge tax people still use ola products whole company extremely deceptive unethical idk people would ever use stuff math definitely concept aunty nashnuls use ola foods give discounts something mean benefit delivery apps op fixed though tried see calculation correct havent tried another transaction good thing compete apps ola give discounts specifically remember getting regular potato california burrito bowl instead zomato selling thats bs design calculate price confirmed confirmedyou save db tracking accounting purposes zomato also discreetly adds rupees tip go change settings consumer unfair practices annoying ola foods pops booking urgent ride woah thats cool ig ill try ordering kabhi nah ola foods doesnt tip option price changed order placed ss comments pricing issue thats happens ceo works hours day tax charged twice old foods like worst delivery",
    "light_cleaned_title": "Apparently Ola Foods can't do basic maths",
    "light_cleaned_selftext": "I don't even care about the price anymore but atleast match the total amount to the charges you're showing ffs. 137.97+12.60+10.95=161.52 Imagine this happening in Europe or US and they would be facing a lawsuit.",
    "light_cleaned_comments": "Lol. Wtf File a consumer complaint citing this as scam or a fraud. I've created a post on twitter tagging ola, olafoods and consumer forum india. I'm not really sure if the consumer forum handle is correct though, but I didn't find a blue ticked one. Let's see if anything happens They counted the tax as double. Ola foods bhi like kaun hi notice karega. Even I wasn't looking but then I was like wait a minute Computers don’t make mistakes adding up. It’s a pet of their code and obviously a scam. Update: I decided to place an order regardless to see if the amount changes, voila, still doesn't match lol. I'm fine with getting charges stupid charges like festival hikes, but at least show them. Or it could be a bug Tag Olan. Ask him to focus on this rather than employee attendance. similar thing was happening to me on zepto, stopped ordering altogether Ola wale itna jyda scam kr chuke hai. Ab kii bhi harkat pe interest hi nhi aata Very conveniently the bug just adds more than it subtracts. A nice bug to have. Math is outdated, Olan Musk has copy pasted Alien Math now. Why can't you peasants just suffer small losses in exchange for poor service so that Billionaire Olan can earn a bit more. Hankon's razor. Not everything is a conspiracy, sometimes mistakes do just happen. Already raised a complaint on X and Consumer helpline. Post on Twitter and tag Kunal Kamra. Damn, I'm gonna give him some good content to work with Ola should burn to the ground so that I dance on its grave or piss on its ashes. Bro don't use ola foods. I used it only once, it's the shittiest app of all. The map is so poor. Even after putting the correct address, it showed at a random location and the delivery person went there. Uninstalled right away. lodge a complain on consumer forum website I don't use it, but sometimes I do get good offers. But it's not even the point of service right now. If your charges don't match then you're just a scam at this point. Done Use the web portal to file a case. They have a good track record. How dare you say that’s wrong? Maths is a western concept Scam is an Indian concept Check yourself before you wreck yourself My bad sire, I shall take my zeros with me Remind me! 2 days How dare you order chicken?! Is this India or Kentuckistan? I will be messaging you in 2 days on [**2024-12-23 06:41:24 UTC**](http://www.wolframalpha.com/input/?i=2024-12-23%2006:41:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1hj3p3d/apparently_ola_foods_cant_do_basic_maths/m33p6zb/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1hj3p3d%2Fapparently_ola_foods_cant_do_basic_maths%2Fm33p6zb%2F%5D%0A%0ARemindMe%21%202024-12-23%2006%3A41%3A24%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201hj3p3d) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| Everything Ola does is a mess. The app is infuriating—why would I want to order food when I'm just trying to book a ride that inevitably gets canceled? No, I don’t need a loan, your nightmare EV, or your AI chat. I just want to overpay for an auto ride in peace. If this code reached production where the monetary basics of your app malfunctions then you deserve to be screwed. Can you send me the link too. I once booked ola cab, in invoice it shows less but the amount i had to pay was more, when i tried to raise a ticket, it asked did you pay x (which showed more amount), I said yes, and nothing happened, i can't even complain against driver as he just asked me to pay what was showed to him. There's not even a human support chat available. I don't want to talk to ai and get told we are working on it And they will if you report it. What's the point? Why don't their mistakes turn into our favour? Its always them who benefits from their mistakes Thank you Thank you I've attached a screenshot post order and they spiked the price of the item to 170, as if they're saying look we're charging you less than what it should be. there was also a very inconvenient bug some time back that led to a lot of people hitting jackpots on cred Is this a niche variant of Hanlon's razor? Funny how mistakes always happen in their favour. Most ppl don't even do the match just blindly go to checkout and complete the order. Good that u caught this, seem like they are adding 6.26% of the actual sum adn making it 172.47 Definitely not a Math issue here cos it's how they have done coding purposefully to add some percentage to the actual sum which most customer won't even notice. Do it dude, it will be fun! That the company might have duped customers worth crores because of this \"bug\" It's about customer experience and customer promise, a bug showing inaccurate pricing is one thing but charging extra is a whole new level of problematic testing/software I think they gave me your's. Already done. Everybody is welcome to share and tag kamra. He'll be happy to be spammed with this Thanks! Lol turns out after the order it did the same thing for me. But it's not the point, the point is, how can I be sure of what I'm being charged of, if the charges you're showing don't match the total you're showing. Then I could just be like oh, this is 1000 rupees dish, 200rs charges and pay me 500. I'll be happy to see 500 but confused as to why 500. Exactly this! Happened to me on car rides as well. Stopped using the app. So now it shows less than what it should be, I mean it's just a bug then Dude, I work in Fintech, assisting the leads of both the Design and Engineering. What you said is plain fucking stupid. What they did is actually illegal. It is called fraud if they didn't detect this in testing and just released it like that. Sometimes I really wonder if before you spill it out like word vomit did you even stop for a second and think? How is this bug not even reported yet? Also to OP, put the screenshot out on App Store or Play Store. They will immediately flag this version for review and the developers HAVE to work on it. Only way to get their attention. Best way to get their attention is to post on the App Store or Play Store. They flag the app for bugs and they either within a week or two need to fix the bug or revert to an older version they have. I don't really care, I paid what I was told. But this could go either way very quickly, and honestly I don't have any clarity of the amount I'm paying. That is what makes this much more serious. This company itself is a joke and scam That's true Tip must have got auto added Ola foods don't have tips. Basic maths like weekends, work-life balance is a western concept What’s OlA foods? I wouldn't Ola to get anything right. Share link It's the same as before if you take away the \"coins\" discount 172.47 They would have automatically added a tip or charitable donation. I once tipped on swiggy and the next time I ordered it took the tip amount automatically. You're right. Anyway it's a super glitchy bloated app. Let's see how far it goes. share the link The price you're seeing along with item is a cached price. But when calculating the final price, they use the \"final\" price from their database. Usually the price doesn't change much. Hence cached value == database value. Looks like you caught them in a situation where the restaurant owner was in midst of changing price OLA taking the Hidden charges thing to a whole new level Mostly they can't do anything right and we are supposed to worship them. For what? For getting kickbacks backs from the Government for clean energy and giving us shoddy scooters? For posing in front of temples as if they know anything about our culture or devotion? I bet they can't even recite one sanskrit prayer properly. So what is this pretense about? Don't think there is much point in reporting, these pricks have connections so they can do whatever they like. India follows the principle of selective law. It's different for us and different for them. Bjus got a student banned from linkedin and quora using their connections beacuse he spoke about the toxic work culture and inferior products. How did the price of chicken kofta rice bowl go up while ordering lmao The tax mentioned is just CGST I believe. Double the tax and you’re set. NOT A SCAM, JUST OVERSIGHT. Not sure but could it be some kind of tip you accidentally added? It's a wonder it can even get the order delivered to your door. Chhota Musk has totally stepped away from running his firm and now tweets cringe as a full time job. These operations are probably being run by interns or something as plenty of middle management has bailed also. Go for that order and later file a complaint. That’s the best way to handle these kind of companies. I guess the charity is his dumb wife's foundation. They have not filed csr reports for 2 years. What kind of laws are they governed by? !remindme 2 days Probably delete or blur your address there Wondering what the bug would look like? total = prev_total + 9.95 Nah, this will be caught during regression for large orders. I think the bug is a bit more subtle like for instance if(subtotal < 300) { total = subtotal + package_charge + 2 * tax } Why do people still use Ola products? The whole company is extremely deceptive and unethical. Idk why people would ever use their stuff. Math is definitely a concept and only aunty nashnuls use it 🤬 Does ola foods give more discounts or something? I mean what benefit does it have over delivery other apps OP, have they fixed it though? I tried it now, I see the calculation is correct. I haven't tried another transaction but it's a good thing if they did To compete with the other apps ola did give more discounts. I specifically remember getting a regular potato california burrito bowl at just 170 instead of Zomato selling at some 260 That's bs design. You calculate the price until its confirmed. Once it's confirmed,you save it into db for tracking and accounting purposes. Zomato also discreetly adds in 30 rupees tip so you have to go and change in settings. Consumer unfair practices. The annoying ola foods pops up while booking an urgent ride Woah that's cool ig I'll try ordering from them kabhi Nah, ola foods doesn't have a tip option. The price changed after the order was placed (ss in the comments), so it's just a pricing issue That's what happens if the ceo works 20 hours a day The tax is charged twice Old foods are like the worst delivery"
}