{
    "id": "14lwwno",
    "title": "I stopped using flipkart, 10 years back, when they refused to refund defective JBL headphones. They were/are complete scammers selling defective products on their website!!",
    "url": "https://imgur.io/IMQCx5i",
    "selftext": "Similar to this op post https://www.reddit.com/r/india/comments/14ljzzx/help_flipkart_nightmare_3_mistakes_of_my_life/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1",
    "flair": "Rant / Vent",
    "score": 42,
    "num_comments": 5,
    "created_utc": 1688018838.0,
    "convurl": "https://i.redd.it/fucomjonew8b1.jpg",
    "comments": [
        "https://imgur.io/IMQCx5i is the OC posted by me 10 years ago!",
        "Is this post like celebrating 10 year break-up anniversary ??",
        "It tells you a lot about a company on how they treat customers! 10 years is incidental.",
        "So you stopped using Flipkart due to one scammer seller?",
        "Due to bad customer service!"
    ],
    "cleaned_text": "stopped using flipkart years back refused refund defective jbl headphones wereare complete scammers selling defective products website similar op post ",
    "cleaned_title": "stopped using flipkart years back refused refund defective jbl headphones wereare complete scammers selling defective products website",
    "cleaned_selftext": "similar op post",
    "cleaned_comments": "oc posted years ago post like celebrating year breakup anniversary tells lot company treat customers years incidental stopped using flipkart due one scammer seller due bad customer service",
    "light_cleaned_title": "I stopped using flipkart, 10 years back, when they refused to refund defective JBL headphones. They were/are complete scammers selling defective products on their website!!",
    "light_cleaned_selftext": "Similar to this op post",
    "light_cleaned_comments": "is the OC posted by me 10 years ago! Is this post like celebrating 10 year break-up anniversary ?? It tells you a lot about a company on how they treat customers! 10 years is incidental. So you stopped using Flipkart due to one scammer seller? Due to bad customer service!"
}