{
    "id": "16ine3g",
    "title": "Understanding protein consumption: Survey",
    "url": "https://www.reddit.com/r/india/comments/16ine3g/understanding_protein_consumption_survey/",
    "selftext": "\nHello all, \n\nWe need your valuable input! Please take a few minutes to fill out our survey. Your responses will help us gather important data for our research.\n\nSince alternative food is on the boom, we are trying to understand the food habits particularly consumption of protein amongst Indians.  \n\nWe are not asking for your email Id and it’s not a marketing gimmick. It’s purely for research purpose. \n \nClick the link below to get started:\n\nhttps://forms.gle/TzWdStGDsBwZ9YTeA\n\nThank you for your participation!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1694710069.0,
    "convurl": "https://external-preview.redd.it/kC0O3yGDlHuCwIKkzUM-1PyNHmzCSUGMlIaXrLQ6r0k.jpg?auto=webp&s=34dfc505f0ec3876e97f588641b8b082b26020d0",
    "comments": [],
    "cleaned_text": "understanding protein consumption survey hello need valuable input please take minutes fill survey responses help us gather important data research since alternative food boom trying understand food habits particularly consumption protein amongst indians asking email id marketing gimmick purely research purpose click link get started thank participation ",
    "cleaned_title": "understanding protein consumption survey",
    "cleaned_selftext": "hello need valuable input please take minutes fill survey responses help us gather important data research since alternative food boom trying understand food habits particularly consumption protein amongst indians asking email id marketing gimmick purely research purpose click link get started thank participation",
    "cleaned_comments": "",
    "light_cleaned_title": "Understanding protein consumption: Survey",
    "light_cleaned_selftext": "Hello all, We need your valuable input! Please take a few minutes to fill out our survey. Your responses will help us gather important data for our research. Since alternative food is on the boom, we are trying to understand the food habits particularly consumption of protein amongst Indians. We are not asking for your email Id and it’s not a marketing gimmick. It’s purely for research purpose. Click the link below to get started: Thank you for your participation!",
    "light_cleaned_comments": ""
}