{
    "id": "1azkjpk",
    "title": "Scam alert : media monks",
    "url": "https://www.reddit.com/gallery/1azkjpk",
    "selftext": "Hi , I wanted to report a scam by  an entity called media monks. I got a whatsapp message offering a job for posting reviews on Google and getting 150 inr per posts. I knew it from beginning that it is a scam and decided to take some details and block them . \n\nNow I am getting video calls from USA numbers and continuous spam messages on WhatsApp.\n\nPlease suggest how have you guys Handled this.",
    "flair": "Crime",
    "score": 20,
    "num_comments": 6,
    "created_utc": 1708855766.0,
    "convurl": "https://i.redd.it/k98yrr4jhpkc1.png",
    "comments": [
        "You missed 150 rs. Someone earlier posted same scam. He managed to get 150 rs and blocked the contact ",
        "Don't get why people don't block such numbers, instead of playing with them."
    ],
    "cleaned_text": "scam alert media monks hi wanted report scam entity called media monks got whatsapp message offering job posting reviews google getting inr per posts knew beginning scam decided take details block getting video calls usa numbers continuous spam messages whatsapp please suggest guys handled ",
    "cleaned_title": "scam alert media monks",
    "cleaned_selftext": "hi wanted report scam entity called media monks got whatsapp message offering job posting reviews google getting inr per posts knew beginning scam decided take details block getting video calls usa numbers continuous spam messages whatsapp please suggest guys handled",
    "cleaned_comments": "missed rs someone earlier posted scam managed get rs blocked contact dont get people dont block numbers instead playing",
    "light_cleaned_title": "Scam alert : media monks",
    "light_cleaned_selftext": "Hi , I wanted to report a scam by an entity called media monks. I got a whatsapp message offering a job for posting reviews on Google and getting 150 inr per posts. I knew it from beginning that it is a scam and decided to take some details and block them . Now I am getting video calls from USA numbers and continuous spam messages on WhatsApp. Please suggest how have you guys Handled this.",
    "light_cleaned_comments": "You missed 150 rs. Someone earlier posted same scam. He managed to get 150 rs and blocked the contact Don't get why people don't block such numbers, instead of playing with them."
}