{
    "id": "1ec953l",
    "title": "Foreign investors pull out $ 1.27 billion from market after Budget",
    "url": "https://indianexpress.com/article/business/market/foreign-investors-pull-out-1-27-billion-from-market-after-budget-9476172/",
    "selftext": "According to stock exchange data, FPIs sold equities worth Rs 2,975 crore on July 23 when the Budget was announced and another Rs 5,130 crore on July 24. They withdrew Rs 2,605 crore on Thursday.\n",
    "flair": "Policy/Economy",
    "score": 201,
    "num_comments": 38,
    "created_utc": 1721949628.0,
    "convurl": "https://external-preview.redd.it/ZRbIk3ibf5JxyO4DSRw9GkhNUr9rUNGAXHI9Hk1lrTE.jpg?auto=webp&s=a9f64aeb1651fca6dc1167f766b779091df60133",
    "comments": [
        "FDIs are already going out,it seems like FPIs are also following the same route.",
        "Nice, this will increase market volatility and uncertainty. It'll also make Indian market less attractive to foreign investors, potentially reducing the inflow of foreign capital in the future. Now pawpaw and Nirmala didi will understand that they have hammered their own leg.",
        "Pawpaw is only interested in votes, this wasn't an economic but a political budget.",
        "I know, right? The common people are being taxed to death right now in India but pawpaw is focused & determined to keep his Ambani & Adani friends happy.",
        "It's not just the middle class, they haven't done anything for the rural economy too which has been in distress for quite some time now. Rahul was right- this is suit boot ki sarkar.",
        "BJP has always been determined to keep the rich happy. They don't care about the people living in rural areas or the common/middle-class people. Farmers are committing suicide and officials are doing daylight robbery.",
        "Is it because of policies in the budget or just lack of confidence based on other things?",
        "Don't worry.. China will invest",
        "it's because investors are surprised by the budget, why will they invest in market for charity lol",
        "It’s not just the budget, foreign investors are now getting serious doubts about compliance issues in India companies and SEBI seems to be acting childish.\n\nHow do you trust balance sheets of any companies? How do you trust there is no insider trading going on? SEBI is losing credibility because of they are blatantly favouring Adani and turning a blind eye to very valid concerns. \n\nI have no faith in SEBI to be honest. They seem to be incapable of regulating the market which means it’s the Wild West.\n\nI will guarantee this: Adani will be the Enron of India. \n\nIf you don’t know what Enron is, look up on YouTube or google. It crashed US markets because it turned out all their numbers on their books was fraud. Enron is also the reason the big 5 accounting firms became the big 4 now (Deloitte, EY, PWC, KPMG). There was a 5th one but that could not survive the fallout from the Enron disaster.\n\nSEBI’s adamant refusal to investigate credible allegations against Adani is giving people bad feeling about Indian markets. \n\n\nAnother example of SEBI sleeping is Jhunjhunwala. I am 100% convinced Rakesh Jhunjhunwala was working with insider information. He turned an average of 67% per year over 33 years. That’s laughable. Warren buffet, who is considered greatest investor of all time, returned 22% over 30 years. 67% over 33 years is a joke, it is impossible without some sketchy work. Ask any finance person, anyone with half decent knowledge of finance.\n\nJhunjhunwala even settled insider trading cases with SEBI for peanuts. How do you trust these regulators?\n\nForeign investors losing trust in SEBI is a dangerous development. SEBI needs to work to regain trust.",
        "I feel this man is very vengeful and venomous, now  when they couldn’t get the clear majority so they’ll just destroy everything. I think Ayodhya is the prime example post election.",
        "Govt: Best I can do is 2 more broken bridges ",
        "The firm was Arthur Andersen, which later became Accenture.",
        "But he himself layed brick for Ram mandir, he worked 16hrs a day all alone. Water coming from the ceiling is proof of his supernatural abilities.",
        "Yes",
        "Rakesh J (RIP) is most shady person in finance i have ever read about.  \nI only read about his fantasic investment returns.  \nBut there is no video, books or anything which tells about his strategy. Nothing.  \nHow can I ever trust such a person who claims to be all wise about market without sharing anything about his ideas?",
        "https://preview.redd.it/koaiprgq7ted1.jpeg?width=1080&format=pjpg&auto=webp&s=94351a2c715558f1aba70898fcb459333abbf56f\n\nStill wonder why it recovered",
        "There is no trading genius. It’s all inside information.\n\nAll you need to do is hit critical mass, get to a certain level of rich and from then on, you can buy everyone off. Including the regulators.",
        "Above all he wasn’t born bro, so he has no need of all earthly things. Only power",
        "THIS - There are serious trust issues.",
        "[https://www.livemint.com/opinion/online-views/indian-stock-market-rally-looks-like-a-self-sustaining-ponzi-scheme-stock-prices-nse-ulips-mutual-funds-11721070238701.html](https://www.livemint.com/opinion/online-views/indian-stock-market-rally-looks-like-a-self-sustaining-ponzi-scheme-stock-prices-nse-ulips-mutual-funds-11721070238701.html)",
        "I feel it's a mix of both - the budget also subtly brought certain issues to the fore like unemployment which govt was denying previously. There's a short term impact of the tax rise but I think long term impact is due to trust and confidence issues.",
        "I don't think the Emolument linked incentives will work btw, let's see. Unless they force the corporates to participate in schemes, I don't think there is enough inventive for them to participate.",
        "It's again to show they're doing something. It all depends on the finer details. I think they should allow small companies and startup ecosystem in the internship scheme to expand the opportunity net. They are still going after 'infrastructure' and 'construction labor' and 'manufacturing' employment without understanding youth aspirations. They talk about skilling and reduce education budget. I don't know when they realise both are two sides of the same coin. We are just doing doomsday talk about AI when China is doing cutting edge work with robotics. Why can't the govt promote these sectors which will change the face of tomorrow? \n\nP.S: Going by the past, they're capable of 'forcing' anything.",
        ">  I will guarantee this: Adani will be the Enron of India.\n\n\nMuch much worse, as adani controls way too much critical infrastructure and resources ",
        "Small companies and startups are laying off people,they hardly have any capacity to absorb more labour. They are gonna select the top companies for sure.\n\nAi and other cutting edge technology is good and we should invest but at the same time we also need to invest in labour intensive sectors,balancing them both to address the employment crisis in India. Private consumption is quite low and it is significantly linked with employment and income issues.",
        "Yeah i guess that's why the market is up 1.5% and nearing ATH.",
        "Yeah I guess someone has to sue Indian express for providing false info.",
        "This whole idea of this government to make national champions will only harm us in the long run.",
        "That is why startups can benefit from state funded allowance for internships - startups can offer the steep learning curve to 'skill' the people - it will also provide them with a supply of human resources, and then these skilled people can be absorbed in larger companies. Top companies will simply replace existing hirees with this.",
        "Government is gonna provide only a small subsidy (something 17k a year) and not play the whole salary. Btw read this, they are planning for top 500 companies. https://indianexpress.com/article/business/top-500-firms-likely-to-get-quota-for-interns-based-on-csr-spend-9476204/",
        "I think they should open up to more companies - referring to the scheme where they pay Rs 5K allowance per month for an internship (copy paste from Congress manifesto Right to Apprenticeship). Nirmala Sitaraman said they'll provide for 1cr internships - how can 500 companies do this? That's a new level of gotala math.",
        "1 Cr over 5 years I think.",
        "Yup I meant that only. Startups and smaller companies can also absorb these interns and skill them.",
        "Exactly. ",
        "Hmm I was talking about the employment schemes and not just internships.",
        "Deshdrohi investors pulling out from Vishwaguru!"
    ],
    "cleaned_text": "foreign investors pull billion market budget according stock exchange data fpis sold equities worth rs crore july budget announced another rs crore july withdrew rs crore thursday ",
    "cleaned_title": "foreign investors pull billion market budget",
    "cleaned_selftext": "according stock exchange data fpis sold equities worth rs crore july budget announced another rs crore july withdrew rs crore thursday",
    "cleaned_comments": "fdis already going outit seems like fpis also following route nice increase market volatility uncertainty itll also make indian market less attractive foreign investors potentially reducing inflow foreign capital future pawpaw nirmala didi understand hammered leg pawpaw interested votes wasnt economic political budget know right common people taxed death right india pawpaw focused determined keep ambani adani friends happy middle class havent done anything rural economy distress quite time rahul right suit boot ki sarkar bjp always determined keep rich happy dont care people living rural areas commonmiddleclass people farmers committing suicide officials daylight robbery policies budget lack confidence based things dont worry china invest investors surprised budget invest market charity lol budget foreign investors getting serious doubts compliance issues india companies sebi seems acting childish trust balance sheets companies trust insider trading going sebi losing credibility blatantly favouring adani turning blind eye valid concerns faith sebi honest seem incapable regulating market means wild west guarantee adani enron india dont know enron look youtube google crashed us markets turned numbers books fraud enron also reason big accounting firms became big deloitte ey pwc kpmg th one could survive fallout enron disaster sebis adamant refusal investigate credible allegations adani giving people bad feeling indian markets another example sebi sleeping jhunjhunwala convinced rakesh jhunjhunwala working insider information turned average per year years thats laughable warren buffet considered greatest investor time returned years years joke impossible without sketchy work ask finance person anyone half decent knowledge finance jhunjhunwala even settled insider trading cases sebi peanuts trust regulators foreign investors losing trust sebi dangerous development sebi needs work regain trust feel man vengeful venomous couldnt get clear majority theyll destroy everything think ayodhya prime example post election govt best broken bridges firm arthur andersen later became accenture layed brick ram mandir worked hrs day alone water coming ceiling proof supernatural abilities yes rakesh j rip shady person finance ever read read fantasic investment returns video books anything tells strategy nothing ever trust person claims wise market without sharing anything ideas still wonder recovered trading genius inside information need hit critical mass get certain level rich buy everyone including regulators wasnt born bro need earthly things power serious trust issues httpswwwlivemintcomopiniononlineviewsindianstockmarketrallylookslikeaselfsustainingponzischemestockpricesnseulipsmutualfundshtmlhttpswwwlivemintcomopiniononlineviewsindianstockmarketrallylookslikeaselfsustainingponzischemestockpricesnseulipsmutualfundshtml feel mix budget also subtly brought certain issues fore like unemployment govt denying previously theres short term impact tax rise think long term impact due trust confidence issues dont think emolument linked incentives work btw lets see unless force corporates participate schemes dont think enough inventive participate show theyre something depends finer details think allow small companies startup ecosystem internship scheme expand opportunity net still going infrastructure construction labor manufacturing employment without understanding youth aspirations talk skilling reduce education budget dont know realise two sides coin doomsday talk ai china cutting edge work robotics cant govt promote sectors change face tomorrow ps going past theyre capable forcing anything guarantee adani enron india much much worse adani controls way much critical infrastructure resources small companies startups laying peoplethey hardly capacity absorb labour gon na select top companies sure ai cutting edge technology good invest time also need invest labour intensive sectorsbalancing address employment crisis india private consumption quite low significantly linked employment income issues yeah guess thats market nearing ath yeah guess someone sue indian express providing false info whole idea government make national champions harm us long run startups benefit state funded allowance internships startups offer steep learning curve skill people also provide supply human resources skilled people absorbed larger companies top companies simply replace existing hirees government gon na provide small subsidy something k year play whole salary btw read planning top companies think open companies referring scheme pay rs k allowance per month internship copy paste congress manifesto right apprenticeship nirmala sitaraman said theyll provide cr internships companies thats new level gotala math cr years think yup meant startups smaller companies also absorb interns skill exactly hmm talking employment schemes internships deshdrohi investors pulling vishwaguru",
    "light_cleaned_title": "Foreign investors pull out $ 1.27 billion from market after Budget",
    "light_cleaned_selftext": "According to stock exchange data, FPIs sold equities worth Rs 2,975 crore on July 23 when the Budget was announced and another Rs 5,130 crore on July 24. They withdrew Rs 2,605 crore on Thursday.",
    "light_cleaned_comments": "FDIs are already going out,it seems like FPIs are also following the same route. Nice, this will increase market volatility and uncertainty. It'll also make Indian market less attractive to foreign investors, potentially reducing the inflow of foreign capital in the future. Now pawpaw and Nirmala didi will understand that they have hammered their own leg. Pawpaw is only interested in votes, this wasn't an economic but a political budget. I know, right? The common people are being taxed to death right now in India but pawpaw is focused & determined to keep his Ambani & Adani friends happy. It's not just the middle class, they haven't done anything for the rural economy too which has been in distress for quite some time now. Rahul was right- this is suit boot ki sarkar. BJP has always been determined to keep the rich happy. They don't care about the people living in rural areas or the common/middle-class people. Farmers are committing suicide and officials are doing daylight robbery. Is it because of policies in the budget or just lack of confidence based on other things? Don't worry.. China will invest it's because investors are surprised by the budget, why will they invest in market for charity lol It’s not just the budget, foreign investors are now getting serious doubts about compliance issues in India companies and SEBI seems to be acting childish. How do you trust balance sheets of any companies? How do you trust there is no insider trading going on? SEBI is losing credibility because of they are blatantly favouring Adani and turning a blind eye to very valid concerns. I have no faith in SEBI to be honest. They seem to be incapable of regulating the market which means it’s the Wild West. I will guarantee this: Adani will be the Enron of India. If you don’t know what Enron is, look up on YouTube or google. It crashed US markets because it turned out all their numbers on their books was fraud. Enron is also the reason the big 5 accounting firms became the big 4 now (Deloitte, EY, PWC, KPMG). There was a 5th one but that could not survive the fallout from the Enron disaster. SEBI’s adamant refusal to investigate credible allegations against Adani is giving people bad feeling about Indian markets. Another example of SEBI sleeping is Jhunjhunwala. I am 100% convinced Rakesh Jhunjhunwala was working with insider information. He turned an average of 67% per year over 33 years. That’s laughable. Warren buffet, who is considered greatest investor of all time, returned 22% over 30 years. 67% over 33 years is a joke, it is impossible without some sketchy work. Ask any finance person, anyone with half decent knowledge of finance. Jhunjhunwala even settled insider trading cases with SEBI for peanuts. How do you trust these regulators? Foreign investors losing trust in SEBI is a dangerous development. SEBI needs to work to regain trust. I feel this man is very vengeful and venomous, now when they couldn’t get the clear majority so they’ll just destroy everything. I think Ayodhya is the prime example post election. Govt: Best I can do is 2 more broken bridges The firm was Arthur Andersen, which later became Accenture. But he himself layed brick for Ram mandir, he worked 16hrs a day all alone. Water coming from the ceiling is proof of his supernatural abilities. Yes Rakesh J (RIP) is most shady person in finance i have ever read about. I only read about his fantasic investment returns. But there is no video, books or anything which tells about his strategy. Nothing. How can I ever trust such a person who claims to be all wise about market without sharing anything about his ideas? Still wonder why it recovered There is no trading genius. It’s all inside information. All you need to do is hit critical mass, get to a certain level of rich and from then on, you can buy everyone off. Including the regulators. Above all he wasn’t born bro, so he has no need of all earthly things. Only power THIS - There are serious trust issues. [https://www.livemint.com/opinion/online-views/indian-stock-market-rally-looks-like-a-self-sustaining-ponzi-scheme-stock-prices-nse-ulips-mutual-funds-11721070238701.html](https://www.livemint.com/opinion/online-views/indian-stock-market-rally-looks-like-a-self-sustaining-ponzi-scheme-stock-prices-nse-ulips-mutual-funds-11721070238701.html) I feel it's a mix of both - the budget also subtly brought certain issues to the fore like unemployment which govt was denying previously. There's a short term impact of the tax rise but I think long term impact is due to trust and confidence issues. I don't think the Emolument linked incentives will work btw, let's see. Unless they force the corporates to participate in schemes, I don't think there is enough inventive for them to participate. It's again to show they're doing something. It all depends on the finer details. I think they should allow small companies and startup ecosystem in the internship scheme to expand the opportunity net. They are still going after 'infrastructure' and 'construction labor' and 'manufacturing' employment without understanding youth aspirations. They talk about skilling and reduce education budget. I don't know when they realise both are two sides of the same coin. We are just doing doomsday talk about AI when China is doing cutting edge work with robotics. Why can't the govt promote these sectors which will change the face of tomorrow? P.S: Going by the past, they're capable of 'forcing' anything. > I will guarantee this: Adani will be the Enron of India. Much much worse, as adani controls way too much critical infrastructure and resources Small companies and startups are laying off people,they hardly have any capacity to absorb more labour. They are gonna select the top companies for sure. Ai and other cutting edge technology is good and we should invest but at the same time we also need to invest in labour intensive sectors,balancing them both to address the employment crisis in India. Private consumption is quite low and it is significantly linked with employment and income issues. Yeah i guess that's why the market is up 1.5% and nearing ATH. Yeah I guess someone has to sue Indian express for providing false info. This whole idea of this government to make national champions will only harm us in the long run. That is why startups can benefit from state funded allowance for internships - startups can offer the steep learning curve to 'skill' the people - it will also provide them with a supply of human resources, and then these skilled people can be absorbed in larger companies. Top companies will simply replace existing hirees with this. Government is gonna provide only a small subsidy (something 17k a year) and not play the whole salary. Btw read this, they are planning for top 500 companies. I think they should open up to more companies - referring to the scheme where they pay Rs 5K allowance per month for an internship (copy paste from Congress manifesto Right to Apprenticeship). Nirmala Sitaraman said they'll provide for 1cr internships - how can 500 companies do this? That's a new level of gotala math. 1 Cr over 5 years I think. Yup I meant that only. Startups and smaller companies can also absorb these interns and skill them. Exactly. Hmm I was talking about the employment schemes and not just internships. Deshdrohi investors pulling out from Vishwaguru!"
}