{
    "id": "13emu02",
    "title": "Can't pay on Amazon.in with my Pakistani Debit Mastercard",
    "url": "https://www.reddit.com/gallery/13emu02",
    "selftext": "Hey r/India, I live in Pakistan and I am trying to send a Birthday Gift to a friend who lives in India. I am trying to pay through my Pakistani Bank, they generated an OTP but when proceeded the payment gets declined. I tried doing it twice.\n\nIs this because the card belongs to a Pakistani Bank? Or is there some other kind of issue? You can see in the fourth picture that I have enough funds in my bank to process the payment.\n\nPlease help me with this situation and suggest me how can I get the gifts delivered to her?\n\nThankyou",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 28,
    "created_utc": 1683810239.0,
    "convurl": "https://i.redd.it/66ux3hzsa7za1.jpg",
    "comments": [
        "According to [this reddit post](https://www.reddit.com/r/india/comments/u7bjlv/are_international_credit_cards_no_longer_accepted/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)\n\nNon-indan cards are no longer accepted on Amazon india",
        "maybe send the money to someone in another country and they can order it from any indian person they know. \n\nhave you tried paypal? send it to any other indian you know and ask them to order it. \n\n&#x200B;\n\nother than that there are no easy options",
        "Not sure if that’s true. \nFor me at least US based cards are working.",
        "Maybe go with amazon.com",
        "Lol bro uski amazon india mein thodi na deliever karti",
        "Amazon US doesn't accept my Indian Card. WTF",
        "I'm from India & I had the same issue with every card I own both debit & credit card included. I removed every saved card & re-entered a card details at checkout & that worked. Weird but hey! If it works it works.",
        "I can still use my U.S.-issued American Express card (but my Visa and MasterCard don’t work).\n\nI think a lot of U.S. cards are rejected simply because they don’t meet RBI security standards—no 3D authentication capabilities and whatnot.",
        "thats a bummer, her birthday is around the corner:'(",
        "I asked my friend who lives in Saudi Arabia and that didn't work too. And sadly there's no Paypal in Pakistan. I might have to ask some other Indian friend I guess:(",
        "USD to PKR rates are just 💀",
        "Hey I tried to do that too but it isn't working for me:'(",
        "I'm sorry, perhaps use some other payment method, or transfer cash using net banking.",
        "I'm sorry, perhaps use some other payment method, or transfer cash using net banking.",
        "Does your card have international transactions enabled? If yes then it should",
        "I tried all my cards. It doesn't work. It says it must be a u.s. bank issued card.",
        "Read the first comment, international cards are stopped from using as per RBI guidelines.",
        "That's definitely not true - I've used both my Indian and my US card on Amazon US within the last month and it worked fine. I think it might be a problem with your card.",
        "Idk about weather the card may work or not, but I advise you not send Any gift, specially by making Any transaction from Pakistan,  \n\nYour friend will be on watch list of NIA.",
        "Nah. This isn’t East and West Germany.",
        "Have you purchased digital goods?! Like trying to buy/rent a movie on prime US? This didnt work.",
        "She will be, every transaction from Pakistan is monitored.",
        "But it’s not like it can get you into legal trouble can it?",
        "You don't get into any legal trouble until you do something detrimental towards the nation, but that doesn't mean that you are out of the watch list, all of your texts messages and chats are looked into, in a sense she will lose her privacy completely but she would have no clue about it (WhatsApp, telegram, insta, Gmail, phone calls everything)",
        "damn:0",
        "Yup everything is monitored now with even greater intensity.",
        "Lol even Amazon india doesn't want terrorists to send stuff in India"
    ],
    "cleaned_text": "cant pay amazonin pakistani debit mastercard hey rindia live pakistan trying send birthday gift friend lives india trying pay pakistani bank generated otp proceeded payment gets declined tried twice card belongs pakistani bank kind issue see fourth picture enough funds bank process payment please help situation suggest get gifts delivered thankyou ",
    "cleaned_title": "cant pay amazonin pakistani debit mastercard",
    "cleaned_selftext": "hey rindia live pakistan trying send birthday gift friend lives india trying pay pakistani bank generated otp proceeded payment gets declined tried twice card belongs pakistani bank kind issue see fourth picture enough funds bank process payment please help situation suggest get gifts delivered thankyou",
    "cleaned_comments": "according reddit posthttpswwwredditcomrindiacommentsubjlvareinternationalcreditcardsnolongeracceptedutmsourceshareutmmediumandroidapputmnameandroidcssutmtermutmcontentsharebutton nonindan cards longer accepted amazon india maybe send money someone another country order indian person know tried paypal send indian know ask order xb easy options sure thats true least us based cards working maybe go amazoncom lol bro uski amazon india mein thodi na deliever karti amazon us doesnt accept indian card wtf im india issue every card debit credit card included removed every saved card reentered card details checkout worked weird hey works works still use usissued american express card visa mastercard dont work think lot us cards rejected simply dont meet rbi security standardsno authentication capabilities whatnot thats bummer birthday around corner asked friend lives saudi arabia didnt work sadly theres paypal pakistan might ask indian friend guess usd pkr rates hey tried isnt working im sorry perhaps use payment method transfer cash using net banking im sorry perhaps use payment method transfer cash using net banking card international transactions enabled yes tried cards doesnt work says must us bank issued card read first comment international cards stopped using per rbi guidelines thats definitely true ive used indian us card amazon us within last month worked fine think might problem card idk weather card may work advise send gift specially making transaction pakistan friend watch list nia nah isnt east west germany purchased digital goods like trying buyrent movie prime us didnt work every transaction pakistan monitored like get legal trouble dont get legal trouble something detrimental towards nation doesnt mean watch list texts messages chats looked sense lose privacy completely would clue whatsapp telegram insta gmail phone calls everything damn yup everything monitored even greater intensity lol even amazon india doesnt want terrorists send stuff india",
    "light_cleaned_title": "Can't pay on Amazon.in with my Pakistani Debit Mastercard",
    "light_cleaned_selftext": "Hey r/India, I live in Pakistan and I am trying to send a Birthday Gift to a friend who lives in India. I am trying to pay through my Pakistani Bank, they generated an OTP but when proceeded the payment gets declined. I tried doing it twice. Is this because the card belongs to a Pakistani Bank? Or is there some other kind of issue? You can see in the fourth picture that I have enough funds in my bank to process the payment. Please help me with this situation and suggest me how can I get the gifts delivered to her? Thankyou",
    "light_cleaned_comments": "According to [this reddit post](https://www.reddit.com/r/india/comments/u7bjlv/are_international_credit_cards_no_longer_accepted/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button) Non-indan cards are no longer accepted on Amazon india maybe send the money to someone in another country and they can order it from any indian person they know. have you tried paypal? send it to any other indian you know and ask them to order it. &#x200B; other than that there are no easy options Not sure if that’s true. For me at least US based cards are working. Maybe go with amazon.com Lol bro uski amazon india mein thodi na deliever karti Amazon US doesn't accept my Indian Card. WTF I'm from India & I had the same issue with every card I own both debit & credit card included. I removed every saved card & re-entered a card details at checkout & that worked. Weird but hey! If it works it works. I can still use my U.S.-issued American Express card (but my Visa and MasterCard don’t work). I think a lot of U.S. cards are rejected simply because they don’t meet RBI security standards—no 3D authentication capabilities and whatnot. thats a bummer, her birthday is around the corner:'( I asked my friend who lives in Saudi Arabia and that didn't work too. And sadly there's no Paypal in Pakistan. I might have to ask some other Indian friend I guess:( USD to PKR rates are just 💀 Hey I tried to do that too but it isn't working for me:'( I'm sorry, perhaps use some other payment method, or transfer cash using net banking. I'm sorry, perhaps use some other payment method, or transfer cash using net banking. Does your card have international transactions enabled? If yes then it should I tried all my cards. It doesn't work. It says it must be a u.s. bank issued card. Read the first comment, international cards are stopped from using as per RBI guidelines. That's definitely not true - I've used both my Indian and my US card on Amazon US within the last month and it worked fine. I think it might be a problem with your card. Idk about weather the card may work or not, but I advise you not send Any gift, specially by making Any transaction from Pakistan, Your friend will be on watch list of NIA. Nah. This isn’t East and West Germany. Have you purchased digital goods?! Like trying to buy/rent a movie on prime US? This didnt work. She will be, every transaction from Pakistan is monitored. But it’s not like it can get you into legal trouble can it? You don't get into any legal trouble until you do something detrimental towards the nation, but that doesn't mean that you are out of the watch list, all of your texts messages and chats are looked into, in a sense she will lose her privacy completely but she would have no clue about it (WhatsApp, telegram, insta, Gmail, phone calls everything) damn:0 Yup everything is monitored now with even greater intensity. Lol even Amazon india doesn't want terrorists to send stuff in India"
}