{
    "id": "16i6kvn",
    "title": "Govt unveils special session agenda: Pending Bills, recall of ’75 years of Parliamentary Journey’",
    "url": "https://indianexpress.com/article/political-pulse/special-parliament-session-bill-chief-election-commissioner-order-of-business-8938842/",
    "selftext": "Opposition says unusual to have special session over this, 'govt might have surprises up its sleeve'; buzz grows over women's reservation Bill.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1694659214.0,
    "convurl": "https://external-preview.redd.it/s2BQXVdK3hWmSqxSxE4Z6R1GGv-HpboSD6yKdg5W7xU.jpg?auto=webp&s=e6e379a6769540bec31302f9504a082dc018222a",
    "comments": [
        ">However, a section of BJP leaders said one reason the government wanted to hold the special session was that the Winter Session of Parliament, otherwise held in November-December, could be delayed due to the Assembly elections in Madhya Pradesh, Chhattisgarh, Rajasthan, Telangana and Mizoram. The government wanted to highlight its recent “successes” such as hosting of the G20 Summit and the Chandrayaan 3 mission, in the House before the polls, they said.\n\n>As for more ambitious moves, there is still speculation that issues over which there is a larger consensus – putting the Opposition in a dilemma, and exposing the divides within – might still be on the table. The biggest buzz is over a women’s reservation Bill to provide quota for women in Parliament and Assemblies, apart from a proposal to reinstate statehood to Jammu and Kashmir.\n\n>The Opposition would have little ground to attack the government on either issue.\n\n>The J&K move will also help the government ward off the heat from the Supreme Court, which recently asked the Centre if it had a time frame to restore statehood to the region, while hearing pleas challenging the abrogation of Article 370.\n\n>While most parties in the INDIA bloc are in favour of women’s reservation, it could run into some hiccups when it comes to the Samajwadi Party and RJD. The two parties, with their strong caste bases, want “quota within the quota”, or caste- and community- based quotas within the reservation block for women. “Parties like the Congress would have difficulties with that,” an Opposition leader admitted.",
        "> “the agenda that has been circulated does not seem worthy of a special session”.    \n\nNon-stop Distractive Activities as always? Keeping the opposition busy in inconsequentials?",
        "https://preview.redd.it/aysn0wjzb6ob1.png?width=1080&format=pjpg&auto=webp&s=f5324078ae7a29b65f10ff01aaa410c98960c16b\n\nThis was posted in IE on last Sunday."
    ],
    "cleaned_text": "govt unveils special session agenda pending bills recall years parliamentary journey opposition says unusual special session govt might surprises sleeve buzz grows womens reservation bill ",
    "cleaned_title": "govt unveils special session agenda pending bills recall years parliamentary journey",
    "cleaned_selftext": "opposition says unusual special session govt might surprises sleeve buzz grows womens reservation bill",
    "cleaned_comments": "however section bjp leaders said one reason government wanted hold special session winter session parliament otherwise held novemberdecember could delayed due assembly elections madhya pradesh chhattisgarh rajasthan telangana mizoram government wanted highlight recent successes hosting g summit chandrayaan mission house polls said ambitious moves still speculation issues larger consensus putting opposition dilemma exposing divides within might still table biggest buzz womens reservation bill provide quota women parliament assemblies apart proposal reinstate statehood jammu kashmir opposition would little ground attack government either issue jk move also help government ward heat supreme court recently asked centre time frame restore statehood region hearing pleas challenging abrogation article parties india bloc favour womens reservation could run hiccups comes samajwadi party rjd two parties strong caste bases want quota within quota caste community based quotas within reservation block women parties like congress would difficulties opposition leader admitted agenda circulated seem worthy special session nonstop distractive activities always keeping opposition busy inconsequentials posted ie last sunday",
    "light_cleaned_title": "Govt unveils special session agenda: Pending Bills, recall of ’75 years of Parliamentary Journey’",
    "light_cleaned_selftext": "Opposition says unusual to have special session over this, 'govt might have surprises up its sleeve'; buzz grows over women's reservation Bill.",
    "light_cleaned_comments": ">However, a section of BJP leaders said one reason the government wanted to hold the special session was that the Winter Session of Parliament, otherwise held in November-December, could be delayed due to the Assembly elections in Madhya Pradesh, Chhattisgarh, Rajasthan, Telangana and Mizoram. The government wanted to highlight its recent “successes” such as hosting of the G20 Summit and the Chandrayaan 3 mission, in the House before the polls, they said. >As for more ambitious moves, there is still speculation that issues over which there is a larger consensus – putting the Opposition in a dilemma, and exposing the divides within – might still be on the table. The biggest buzz is over a women’s reservation Bill to provide quota for women in Parliament and Assemblies, apart from a proposal to reinstate statehood to Jammu and Kashmir. >The Opposition would have little ground to attack the government on either issue. >The J&K move will also help the government ward off the heat from the Supreme Court, which recently asked the Centre if it had a time frame to restore statehood to the region, while hearing pleas challenging the abrogation of Article 370. >While most parties in the INDIA bloc are in favour of women’s reservation, it could run into some hiccups when it comes to the Samajwadi Party and RJD. The two parties, with their strong caste bases, want “quota within the quota”, or caste- and community- based quotas within the reservation block for women. “Parties like the Congress would have difficulties with that,” an Opposition leader admitted. > “the agenda that has been circulated does not seem worthy of a special session”. Non-stop Distractive Activities as always? Keeping the opposition busy in inconsequentials? This was posted in IE on last Sunday."
}