{
    "id": "1b8p3dy",
    "title": "Mumbai Court allows Police to withdraw TRP Scam case against Arnab Goswami, others",
    "url": "https://www.barandbench.com/news/mumbai-court-allows-crime-branch-to-withdraw-trp-scam-case-against-arnab-goswami",
    "selftext": "The Court allowed withdrawal of the case after special public prosecutor Shishir Hiray told the Court that continuing the proceedings may not lead to conviction but would only end up wasting the court's time",
    "flair": "Law & Courts",
    "score": 24,
    "num_comments": 3,
    "created_utc": 1709798164.0,
    "convurl": "https://external-preview.redd.it/bFOWeCP0_pIeV-iLwK_p3AZrAev4Y8Oz45XMNrxoX3M.jpg?auto=webp&s=3fcf5de260672882a64b721182a6a8c4c6112b30",
    "comments": [
        "Anyone surprised ? Someone ? ",
        "Surprised Pika(Janta)chu face",
        "Oh my so much justice Modi ji is giving.. \n\nthis is exactly why bjp supporters gas light citizens with \"if you have a problem with it, file a case in court\".  They have been told that the courts won't dare touch them. \n\nThe courts are falling over each other to get their share of juicy bjp kickbacks it seems."
    ],
    "cleaned_text": "mumbai court allows police withdraw trp scam case arnab goswami others court allowed withdrawal case special public prosecutor shishir hiray told court continuing proceedings may lead conviction would end wasting courts time ",
    "cleaned_title": "mumbai court allows police withdraw trp scam case arnab goswami others",
    "cleaned_selftext": "court allowed withdrawal case special public prosecutor shishir hiray told court continuing proceedings may lead conviction would end wasting courts time",
    "cleaned_comments": "anyone surprised someone surprised pikajantachu face oh much justice modi ji giving exactly bjp supporters gas light citizens problem file case court told courts wont dare touch courts falling get share juicy bjp kickbacks seems",
    "light_cleaned_title": "Mumbai Court allows Police to withdraw TRP Scam case against Arnab Goswami, others",
    "light_cleaned_selftext": "The Court allowed withdrawal of the case after special public prosecutor Shishir Hiray told the Court that continuing the proceedings may not lead to conviction but would only end up wasting the court's time",
    "light_cleaned_comments": "Anyone surprised ? Someone ? Surprised Pika(Janta)chu face Oh my so much justice Modi ji is giving.. this is exactly why bjp supporters gas light citizens with \"if you have a problem with it, file a case in court\". They have been told that the courts won't dare touch them. The courts are falling over each other to get their share of juicy bjp kickbacks it seems."
}