{
    "id": "1e580rt",
    "title": "Just over 50% Indians have three meals a day",
    "url": "https://i.redd.it/aycx4rsvyzcd1.jpeg",
    "selftext": "https://epaper.hindustantimes.com/Home/ShareArticle?OrgId=177a30af68f&imageview=1",
    "flair": "Policy/Economy",
    "score": 1065,
    "num_comments": 206,
    "created_utc": 1721186411.0,
    "convurl": "https://i.redd.it/aycx4rsvyzcd1.jpeg",
    "comments": [
        "I haven't had 3 meals for like 10+ years. I skip either breakfast or lunch. I have been skipping lunch for the last 2 years. I would eat lunch only when I am feeling exhausted or I am hungry.\nEat less and live more.",
        "Whacko",
        "Out of touch response.",
        "Many people skip meals intentionally. The article never covered that response. This is called cherry picking. You are looking at things from the point that fits your agenda.",
        "Subhe chai ka sath muri biscuits dopaher ko aur saam ko aur bhi khana hota hai ky",
        "Accusing me of cherry picking but ignored the first paragraph in the article. Wah.",
        "I only eat two meals a day.",
        "This is soo dum and a fraudulent article.\nFalse Narratives\n1. Three meals are healthy: Intermittent fasting says otherwise \n2. Western outlook to 3 meals totally discounts Indian cultural practices . There are communities that only do two big meals.",
        "It's really hard to believe this. 50% of Indians can't afford meals 3 times a day?",
        "You are skipping breakfast/lunch because it's your choice. \n\nMost are skipping their breakfast/lunch because they have no other choice.",
        "Let them eat cake!!",
        "और विश्वगुरू बनने चले।",
        "A study says only 27% of Americans have the traditional 3 meals a day. Average person eats only 2 meals a day. \n\nhttps://www.wspa.com/news/study-most-americans-do-not-eat-3-meals-a-day/",
        "How large was the sample set?",
        "Internet did not disappoint",
        "I don't think that 50% of Indians can't afford but half of them choose not to eat 3 meals. I have seen families skipping breakfast or dinner and believe in intermediate fasting. ",
        "The majority of the population in India are poorer than you think.",
        "I skip breakfast, too, as part of intermittent fasting. But as a country as a whole, I really don't think even 1% is skipping a meal because of intermittent fasting.",
        "Mai afternoon me hi breakfast karta hu aur fir seedha dinner. 3 time khane ki zarurat hi nhi padti",
        "Maybe it's hard for me to believe because I am from Kerala, and in the graph it says more than 98% have 3 meals.",
        "Yeah. Farmers in village have heavy brunch and then dinner.",
        "Never take any health advice from Americans. The most obese people on the planet",
        "I usually skip breakfast just cos I don't feel like eating at that time of day",
        "Please make your food protein rich, we Indians don’t eat enough protein and suffer in latter stages of our life.",
        "Borgir",
        "Your title is Misleading",
        "I legit forget breakfast somedays.",
        "As a guy who skips breakfast, me uthta hi 12-1 baje hu",
        "i was the 50% in kota.\n\n7 baje breakfast milti thi  10 baje uth ta tha.",
        "Many do eat snacks or other junk foods in between",
        "As someone who is originally from who has lived in other states, its not very hard for me to believe.",
        "Very few are as privileged as you are.",
        "if you have a sedentary lifestyle , eat 2 meals a day. u will never get fat.",
        "I have only 1 meal a day. Which is sufficient for complete day",
        "I dont think it's because of affordability, if thats the case, why is both rich and the poor having a similar percentage in almost all states.",
        "Very few in India have the kind of jobs that result in a sedantry lifestyle.",
        "me: 2 time khana 1 time daaru.",
        "What about all the IT jobs and desk jobs in other sectors?",
        "I might be wrong but i think this number might be a bit inflated pds and food security act, 2013 has worked well in the regardof food grain availability. There is a widespread distribution of foodgrains which might not be nutritious but it’s better than nothing. However this doesn’t mean that there is no scarcity of food but to say like a number that 50% indians which is approximately 70 crores do not have food might be an exaggeration.",
        "Same...",
        "I am following OMAD diet. Greatly improved my health.",
        "3 meals are overrated",
        "Only 21.5% of Indians are currently estimated to even have regular salaried jobs. The share of Indians working in IT jobs and desk jobs would be even lower.",
        "Oldies are especially lacking in our country",
        "3 meals a day is a British concepts we for during British raj. India never had a breakfast culture.",
        "Never take health advice from \"Average American\".\n\n\nNot everyone are obese btw. You should also note that 10% of their demographics are Indians.",
        "How do you explain the richest 20% of the top 5 States also not eating 3 meals a day? Poverty is one of the causal factors, but it alone doesn't dictate dietary habits. Drier regions typically eat lesser number of meals for various reasons.",
        "I know never and everyone should NEVER be used. my goal isn't to be technically correct here",
        "I always eat yogurt in the morning or make smoothies out of it, In India we really don’t have a good yogurt available. It saves time, high in protein and is really good for my gut. I wonder why people in India don’t consume yogurt much compared to Europe and West.",
        "By choice or without a choice?",
        "Poor nutrition is the problem more than number of meals. \n\n80% Indians are protein deficient.  Loading up on carbs, with a small amount of vegetables and negligible protein. Then the Western junk - cornflakes, cookies, bread, rusk which is empty carbs.",
        "Same",
        "But that is by choice, most people don't eat it because they can't afford it",
        "You are goals man. I reduced my means from 5 per day to 3. Hoping to go for 2. Do you do breakfast and dinner or something other combination? How did you transition from more than 2 to 2? Why did you start?",
        "even i miss breakfast way too many times. ig i should wake up before 2pm",
        "10%? Just watched some video where dude said 6% of usa were Asians and 1.5% were Indian Americans",
        "Bruh, you do realise that yogurt is essentially hung curd? It's when you Remove excess water/liquid from dahi. The essential fermentation process is very very similar along with the product biotics post fermentation. \n\nAlso, it's usually a bad idea to consume fermented food from the shelf. Take care.",
        "It is unbelievable how unhealthy our eating habits are, and how offended people get when you point it out. \"Dal\" is enough, some will assert. Even Bengalis, who are probably the heaviest meat eaters have a completely unbalanced diet, because despite eating enough protein, they eat so much carbs through rice and potatoes.",
        "Why? Are you on weight loss goals/program?",
        "Or maybe bcz they wake up late or are fussy eaters. My sister wakes up at 11 on noon school days.",
        "Ig it is more like they don't eat and less like they are forced to not eat",
        "I choose not to eat 3 meals a day…",
        "The bacteria found in the yogurt and curd is completely different which is what makes yogurt different from curd.\n\nI don’t have time to make curd at home and especially the flavoured ones which we get without any added sugar. I love them and have been consuming them without any problem from last 7 years from the shelf and will continue to do so. \n\nMajority of us don’t have the time to make curd or milk the cow. \n\nTakecare :)",
        "Nope. I really do believe I don't need 3 meals. For the longest time I have been eating breakfast, lunch, snacks dinner and then a lite snack. I want to understand if I really need that much. Skipped the mid night stuff. Didn't notice a difference. Then skipped the evening snacks. Again, no difference. Been testing a plan where my meals are 3 and weekly skip a sing meal for the past 3 months. No difference at all. \n\nThe entire concept of 3 meals I feel is flawed. It was designed to increase productivity at factories for the workers. \n\nAgain, it's all exploratory rn. No reasearch backed. Just want to understand my body better.",
        "I sometimes eat only one meal a day, by choice. Autophagy.",
        "The stats are convoluted. USA's immigration laws were pathetic so they technically don't have updated data.",
        "Abbe Rural me wo Lunch hi agr 11 baje kar rhe hai, to kyu hi breakfast krenge🫠\nBeen going to my village(both, mom n dad side)since ages but, never have I ever seen a concept of breakfast(unless n until any occasion demands like guest, function n so on)\nFrom dinner's pov, it's done by 7-7:30PM\nBetween those 7-8 hrs, most of them do have some light snacks(especially good amount of tea at 3-4pm)",
        "Why do Indians need meals? They can chant \"Modi Modi\" to satisfy their hungres.\n\nAngen gatram, lode bhojanam.\n\n- Modi to all hungry Indians.",
        "some people need to do that tho",
        "Number of meals per day is an absolutely ineffective metric to quantify the health of a nation -- there are so many cultural, environmental, and ecological reasons that dictate dietary habits. A better method would be to calculate the caloric intake and output, and quantify the kind of essential nutrients (vitamins, minerals, carbs, proteins, and fat) that a person/family is consuming.",
        "I have been on omad for half a year now.",
        "Mess mei breakfast khatam hone ke baad soke uthta hu toh miss hoga hi🥲",
        "Strawberry?",
        "I haven’t come across single good yogurt brand in India yet.",
        "I think OP meant to say only over 50% of the people can afford to eat 3 meals a day and everything bad with India is just labelled as a British or foreign concept by y'all. \n\nWork life balance, weekends, having fun, sure these are foreign concepts but that doesn't mean we shouldn't follow them, they lead to a good and happy life. \n\nHere fuckers like Infosys ka Narayan Murthy and OLA, CEO Bhavesh promote shit like 70 hour work week, 100 hour work week, no work life balance, no weekends. \n\nSure I'd work 70-100 hours but for my own self, for my own company. Those people earn millions of dollars for their work and they wanna pay employees for 40 hours of work and expect them to work for 70-100 hours in the name of nationalism and growing India.",
        "My Grand parents,  parents everybody ate 3 meals a day .\n\nWhy would I want to change it .",
        "I do believe in this report bcz I used to assume that we are middle class then I knew about caste and income then I realised we are actually working class.\n\n\nMost of indians are working class and below.\n I once visited a temple where we had to wait before opening gate there I saw people from different states those who belong to rich family are quiet easy to spot ",
        "But people in India already consume a lot of curd, is yogurt wayy better than curd?",
        "Villagers mostly eat only two times. Heavy brunch and heavy dinner. In between tea & milk.",
        "I find yogurt texture and consistency way better than curd, I make multiple meals out of yogurt compared to curd. We get flavoured yogurts as well ( I consume without any added sugar) which helps my sugar craving go away and is also a tastier alternative. Yogurts have double the amount of protein.",
        "Very less percentage of people work in that job .",
        "Do you get enough protein ? I don't think omad is sustainable for long term .",
        "Right, but I would bet a sizeable chunk of people in that 50% usually skip one meal a day not because of financial condition, but because of choice",
        "Same here, lunch around 11 am then dinner at 8pm.",
        "Breakfast karne ka mann hi ni karta kabhi. Aur jis din kar leta hu to lunch ka schedule bigad jata hai.",
        "What is it?",
        "Lol me, but it's because I don't feel like it when I'm going out. I eat when I stay home.",
        "Pg only provides 2 meals",
        "That's not how you lose weight. Reduce your potion size and take the stairs instead of the elevator. Reducing the frequency of meals makes your body store more of the carbs and fats.",
        "Tamilnadu is Top becos of our Free Mid day meals. Very proud ❤️..",
        "3 is too much anyways.\n\nI feel full enough just by 2 meals itself and some exercise is optimal for the body imo",
        "If the richest 20% aren't that different from poorest 20%, then the analysis needs to be based on cultural practices or work related issues rather than portraying it as a poverty issue.\n\nLike,\nDelhi -         poorest 20% - 55.2%        richest 20- 35.2%\nchattisgarh - poorest 20% - 60.2%        richest 20% - 36.5%  \nHaryana -    poorest 20% - 60.3%         20-40% - 78%       richest - 82.7%\nTelangana - poorest 20% - 94.8%          20-40% - 84%\n\nRural regions have higher portion of 3 meals a days. \n\nThe important statistic is increase in difference between poor and richest. It is 11% in 2024, it was 3.5 in 2011-12. \n\nOverall, 3 meals a day don't mean proper nutrition.",
        "Guess what. Even Medicine is a British concept. Before that we Indians used to die from polio..",
        "no they dont, bottom 50% of india makes less than 15k a month, it's not by choice.",
        "I don’t do manual labor or heavy workout, and eating very early in the day makes me feel uneasy. I’m not following any diet plan or intermittent fasting; I just prefer to eat only when I’m actually hungry.",
        "cmon usa doesnt have 10% indians",
        "3 crore Indians in USA, that does not seem possible.\n1.5% seems correct, around 45 lakh Indians.",
        "I also skip breakfast not because of poverty, i just wake up at 10",
        "What a depressing infographic.",
        "richest 20% in many of those poor states arent really that rich, keep in mind top 10% monthly income in india is close to 25k, and those BIMARU states and other states with poorer pops top 20% arent actually that rich",
        "Doesn't everyone have free midday meals?",
        ">Work life balance, weekends, having fun\n\nNo these are not the foreign concepts z it's the basic human needs. We don't live to work. We work to live.\n\nI agree the OP meant to say that we can't even afford the food and that's the real point.\n\nHaving only 2 meals is not the actual problem and 🚭 a good way to surface the underlying problem",
        "One Meal A Day (OMAD). Not for everyone, obviously.",
        "They do not.\nMost people skip meals because they can't afford it.\nOver 32% kids under 5 years are considered underweight. \nThis is not because they are choosing to skip a meal. It's because parents can't afford to feed their kids.",
        "Half the college kids miss breakfast.",
        "I don't know. but heard hindi states don't give eggs in mid day meal schemes becoz it's against their vegetarian diet.\n\nTamilnadu even have started Free breaks fast scheme from previous year. May be That is also a reason. Child nutrition deficiency is lower in both Kerala and Tamilnadu..",
        "but if you have 2 meals a day you are rich and out of poverty :)",
        "Been doing it since COVID. No problem. Of course, I eat a lot of protein and fiber. \n\nNo refined flour, very little sugar. Workout in the evenings - then a big dinner. Thats it.",
        "In brief can you provide some inside? Like weight etc and what meal include what and how does it impact your health. And why did you decide omad? Thnx.",
        "Reasons can absolutely vary. And 50% of Indians can't afford 3 meals a day is something that's not true tbh. ",
        "Well, my blood tests about 6 years back were pretty bad. Working out wasnt making a difference. I am a big guy - 6'3 weighed about 104 kgs. Decided to cut out most carbs and follow OMAD. I dont eat simple carbs. I eat lot of chana, beans, dal, kabuli  chana etc. Then nuts - almonds and peanuts and walnuts. Vegetables which are not overly carb heavy - like Cucumber, Tindey etc. and about 150 gms of Chicken, fish or mutton. This meal fills you up for 24 hours as its high in protein and fiber. I avoid sugar as much as possible. Workout for an hour- weight and cardio. My weight has dropped to 81 and my blood tests are now normal and my overall health is now brilliant.",
        "Skip breakfast if you're younger than 50.",
        "Now we know the root cause of Gujarat Model.",
        "That's great . Eating 2000-2500 calories in one sitting seems big to me.",
        "I try the same too i only eat some moong chat sort of thing at night and one meal in the morning",
        "Even without counting you and people like you who choose to skip one meal; \"2 And the share of people who have three meals increases among the rich.\" says something.",
        "Well, its not for everyone. Suits me though, and saves time. I stay alone and dont want to waste time cooking three meals. I dont like junk food and I dont like hotel food.",
        "I'm a one meal a day person.",
        "Looking at the comments section - I would say this may not be such a bad thing.",
        "If you were eating 3 meals earlier, better to continue the routine. I was eating 3 meals till I was 29 and then reduced it to 2 meals thinking it was fine and in 2 years, I got gastritis. Please don't fuck up your stomach. That's the worst feeling ever.",
        "Much wider gap between states than economic sections. Yes some states are richer than others but no state’s 20%ile is richer than another state’s 80%ile.\n\nMakes this seem more like a result of culture than economics",
        "Skipping breakfast works for me. At first I was a bit hungry, so started drinking just a smoothie or ragi mslt with curd for breakfast. Then I slowly started reducing the quantify for a few days and then started not eating breakfast. Not much of a difference for me as long as eat lunch in time before 2.",
        "Honey Singh once said, \" Chaar Botal Vodka, Kaam Mera Roj Ka\"",
        "so do you want to starve those poor fat and rich souls,\nyou have no heart 🥹",
        "CICO is nearly universally agreed and proven method of reducing weight. You only burn a few hundred calories maximum with high intensity exercise, and even then after a few months your joy adapts to the exercise and stops burning alot of calories.\n\nThe only good way if burning calories is reducing consuming it. And one of the good method to reduce it is by intermittent fasting which many have tried and tested it. And I didn't see anyone talking about increasing time between meals increases fat storage with intermittent fasting.",
        "This isn’t about the chunk of population that’s trying to diet or doesn’t have time to eat breakfast. It’s about the part of the population that can’t afford it.",
        "I should never forget I'm blessed",
        "I don't like eating that early in the day, I'd much rather have a heavy lunch",
        "Same. Though this is not by choice. I just have a very bad sleep schedule.",
        "Ambani:\n\nhttps://preview.redd.it/laj178u3v1dd1.png?width=263&format=png&auto=webp&s=48111237100789b69b01f0e8f4f7703625758947",
        "Great.",
        "I am engineering college student in Bengaluru and our college starts at 9 am,so 60-70% of friends skip breakfast. Because they have to save time to compensate it for traffic",
        "I think in my state chhattisgarh, people don't eat 3 time is more of choice than about poverty.",
        "I know why it's considered misinformation because the stats say 1.6%. Those stats will never get updated is what I'm saying. Indians are amazing at data manipulation.\nJust look up for unauthorised immigrants in USA.",
        "That underweight problem is not because they are eating less it's about they are eating less protein rich food. Poor people can't afford nutritional food. They will eat carb 3 times but they will still underweight",
        "I do 2 meals a day lol.",
        "Guys, If you want to eat twice, skip dinner instead of breakfast, i see many people in the comment section tell that they skip breakfast.\n\nThere is a quote \" Eat breakfast like a king, lunch like a middle class person and dinner like poor \"",
        "I have two meals a day",
        "10 years of messaging like Acche Din, Amrit Kaal, smart cities, bullet trains and vikas has programmed Indians into thinking sab changa si. \n\nThe reality couldn’t be further from that. \n\nYou can’t blame people for falling for that propaganda though. \n\nNobody has been lied to as frequently and as effectively and at such scale as Indians in the last 10 years — and they’ve been lied to by the very people who’re supposed to speak the truth.",
        "I only eat 2 meals, on rare occasions I eat dinner.",
        "Still diabetes and hypertension is a big distrupter in our life due to wrong eating habits..\nEating less won't take us anywhere, eating right will.",
        "I avoid breakfast.  So I guess I too fall in this",
        "I see. Can you please share some sources that also claim that both are complete seperate from a bacterial point of view, fermentation point of view and preperation point of view? Would love to read about them.",
        "Here you go https://timesofindia.indiatimes.com/life-style/food-news/whats-the-real-difference-between-curd-and-yoghurt/amp_etphotostory/102859596.cms",
        "A lot of this could be attributed to the local culture and habits. Doesn't seem like there's any correlation to the Monthly per capita here.\n\nJust by comparing the poorest and richest within each state, they look very similar for every state. Except Jharkhand, Haryana and Karnataka, where the difference in people having 3 meals is 10+% less for poorest.",
        "The rest are DOING forced IMF.",
        "I eat less during 🌙 ",
        "Did they work office jobs or physical jobs?",
        "In my entire life I never felt hungry waking up. I only ever eat breakfast when it's included with my hotel room so I force myself a bit.",
        "I mean I only eat 2 meals 🙃 Today only one meal,lol feeling hungry",
        "Wrong information \n\nThe Pacific island nations of Nauru, Cook Islands, and Palau have the highest rates of obesity\n\nUSA comes 10th obese in the list",
        "Here people are just throwing random statements like “USA is the most obese country”\n\nIt’s a wrong statement \n\nAlso, some here immediately point to USA and find some mistake in their country to justify poor conditions here",
        "Classic!\n\nWhen they’re an issues pointed out, quickly finding some fault in a western country",
        "This study doesn't tell anything about affordability. Majority of Americans only eat 2 meals a day. There needs to be better surveys, that capture the nutritional content of the meal than number of times. \n\nI eat 1 meal a day, doesn't mean I am poor.",
        "Yup. \n\nI see that Tamil Nadu has 98%+ of people who eat 3 meals a day.\n\nI can say with full confidence that nearly everybody here in TN are ADDICTED to carbs. \n\nDo you know how many people I have come across who say they are \"starving\" because they ate the breakfast/lunch/dinner late? You don't \"starve\" when you miss a meal. Only people with carb addiction need constant supply of carbs to stop hunger pangs. \n\n\n\nAnd do you know how a majority of people here eat like 500-600 GRAMS of rice as lunch when they eat in restaurants? Almost all the restaurants here proudly proclaim their \"veg/non veg meals\" as unlimited (called as thali in north)",
        "This is not UPSC prelims",
        "Similar for MH. MH society is brutal towards people who over eat......",
        "This only tells me that Western states (MH, GJ and RJ) eat less than 3 meals a day irrespective of their financial background. And that South Indian states (Telangana, Tamil Nadu and Kerala) eat 3 meals a day irrespective of their financial background. This is also the reason why MH and GJ has less obesity compared to TN and Kerala."
    ],
    "cleaned_text": "indians three meals day  ",
    "cleaned_title": "indians three meals day",
    "cleaned_selftext": "",
    "cleaned_comments": "havent meals like years skip either breakfast lunch skipping lunch last years would eat lunch feeling exhausted hungry eat less live whacko touch response many people skip meals intentionally article never covered response called cherry picking looking things point fits agenda subhe chai ka sath muri biscuits dopaher ko aur saam ko aur bhi khana hota hai ky accusing cherry picking ignored first paragraph article wah eat two meals day soo dum fraudulent article false narratives three meals healthy intermittent fasting says otherwise western outlook meals totally discounts indian cultural practices communities two big meals really hard believe indians cant afford meals times day skipping breakfastlunch choice skipping breakfastlunch choice let eat cake study says americans traditional meals day average person eats meals day large sample set internet disappoint dont think indians cant afford half choose eat meals seen families skipping breakfast dinner believe intermediate fasting majority population india poorer think skip breakfast part intermittent fasting country whole really dont think even skipping meal intermittent fasting mai afternoon hi breakfast karta hu aur fir seedha dinner time khane ki zarurat hi nhi padti maybe hard believe kerala graph says meals yeah farmers village heavy brunch dinner never take health advice americans obese people planet usually skip breakfast cos dont feel like eating time day please make food protein rich indians dont eat enough protein suffer latter stages life borgir title misleading legit forget breakfast somedays guy skips breakfast uthta hi baje hu kota baje breakfast milti thi baje uth ta tha many eat snacks junk foods someone originally lived states hard believe privileged sedentary lifestyle eat meals day u never get fat meal day sufficient complete day dont think affordability thats case rich poor similar percentage almost states india kind jobs result sedantry lifestyle time khana time daaru jobs desk jobs sectors might wrong think number might bit inflated pds food security act worked well regardof food grain availability widespread distribution foodgrains might nutritious better nothing however doesnt mean scarcity food say like number indians approximately crores food might exaggeration following omad diet greatly improved health meals overrated indians currently estimated even regular salaried jobs share indians working jobs desk jobs would even lower oldies especially lacking country meals day british concepts british raj india never breakfast culture never take health advice average american everyone obese btw also note demographics indians explain richest top states also eating meals day poverty one causal factors alone doesnt dictate dietary habits drier regions typically eat lesser number meals various reasons know never everyone never used goal isnt technically correct always eat yogurt morning make smoothies india really dont good yogurt available saves time high protein really good gut wonder people india dont consume yogurt much compared europe west choice without choice poor nutrition problem number meals indians protein deficient loading carbs small amount vegetables negligible protein western junk cornflakes cookies bread rusk empty carbs choice people dont eat cant afford goals man reduced means per day hoping go breakfast dinner something combination transition start even miss breakfast way many times ig wake pm watched video dude said usa asians indian americans bruh realise yogurt essentially hung curd remove excess waterliquid dahi essential fermentation process similar along product biotics post fermentation also usually bad idea consume fermented food shelf take care unbelievable unhealthy eating habits offended people get point dal enough assert even bengalis probably heaviest meat eaters completely unbalanced diet despite eating enough protein eat much carbs rice potatoes weight loss goalsprogram maybe bcz wake late fussy eaters sister wakes noon school days ig like dont eat less like forced eat choose eat meals day bacteria found yogurt curd completely different makes yogurt different curd dont time make curd home especially flavoured ones get without added sugar love consuming without problem last years shelf continue majority us dont time make curd milk cow takecare nope really believe dont need meals longest time eating breakfast lunch snacks dinner lite snack want understand really need much skipped mid night stuff didnt notice difference skipped evening snacks difference testing plan meals weekly skip sing meal past months difference entire concept meals feel flawed designed increase productivity factories workers exploratory rn reasearch backed want understand body better sometimes eat one meal day choice autophagy stats convoluted usas immigration laws pathetic technically dont updated data abbe rural wo lunch hi agr baje kar rhe hai kyu hi breakfast krenge going villageboth mom n dad sidesince ages never ever seen concept breakfastunless n occasion demands like guest function n dinners pov done pm hrs light snacksespecially good amount tea pm indians need meals chant modi modi satisfy hungres angen gatram lode bhojanam modi hungry indians people need tho number meals per day absolutely ineffective metric quantify health nation many cultural environmental ecological reasons dictate dietary habits better method would calculate caloric intake output quantify kind essential nutrients vitamins minerals carbs proteins fat personfamily consuming omad half year mess mei breakfast khatam hone ke baad soke uthta hu toh miss hoga hi strawberry havent come across single good yogurt brand india yet think op meant say people afford eat meals day everything bad india labelled british foreign concept yall work life balance weekends fun sure foreign concepts doesnt mean shouldnt follow lead good happy life fuckers like infosys ka narayan murthy ola ceo bhavesh promote shit like hour work week hour work week work life balance weekends sure id work hours self company people earn millions dollars work wan na pay employees hours work expect work hours name nationalism growing india grand parents parents everybody ate meals day would want change believe report bcz used assume middle class knew caste income realised actually working class indians working class visited temple wait opening gate saw people different states belong rich family quiet easy spot people india already consume lot curd yogurt wayy better curd villagers mostly eat two times heavy brunch heavy dinner tea milk find yogurt texture consistency way better curd make multiple meals yogurt compared curd get flavoured yogurts well consume without added sugar helps sugar craving go away also tastier alternative yogurts double amount protein less percentage people work job get enough protein dont think omad sustainable long term right would bet sizeable chunk people usually skip one meal day financial condition choice lunch around dinner pm breakfast karne ka mann hi ni karta kabhi aur jis din kar leta hu lunch ka schedule bigad jata hai lol dont feel like im going eat stay home pg provides meals thats lose weight reduce potion size take stairs instead elevator reducing frequency meals makes body store carbs fats tamilnadu top becos free mid day meals proud much anyways feel full enough meals exercise optimal body imo richest arent different poorest analysis needs based cultural practices work related issues rather portraying poverty issue like delhi poorest richest chattisgarh poorest richest haryana poorest richest telangana poorest rural regions higher portion meals days important statistic increase difference poor richest overall meals day dont mean proper nutrition guess even medicine british concept indians used die polio dont bottom india makes less k month choice dont manual labor heavy workout eating early day makes feel uneasy im following diet plan intermittent fasting prefer eat im actually hungry cmon usa doesnt indians crore indians usa seem possible seems correct around lakh indians also skip breakfast poverty wake depressing infographic richest many poor states arent really rich keep mind top monthly income india close k bimaru states states poorer pops top arent actually rich doesnt everyone free midday meals work life balance weekends fun foreign concepts z basic human needs dont live work work live agree op meant say cant even afford food thats real point meals actual problem good way surface underlying problem one meal day omad everyone obviously people skip meals cant afford kids years considered underweight choosing skip meal parents cant afford feed kids half college kids miss breakfast dont know heard hindi states dont give eggs mid day meal schemes becoz vegetarian diet tamilnadu even started free breaks fast scheme previous year may also reason child nutrition deficiency lower kerala tamilnadu meals day rich poverty since covid problem course eat lot protein fiber refined flour little sugar workout evenings big dinner thats brief provide inside like weight etc meal include impact health decide omad thnx reasons absolutely vary indians cant afford meals day something thats true tbh well blood tests years back pretty bad working wasnt making difference big guy weighed kgs decided cut carbs follow omad dont eat simple carbs eat lot chana beans dal kabuli chana etc nuts almonds peanuts walnuts vegetables overly carb heavy like cucumber tindey etc gms chicken fish mutton meal fills hours high protein fiber avoid sugar much possible workout hour weight cardio weight dropped blood tests normal overall health brilliant skip breakfast youre younger know root cause gujarat model thats great eating calories one sitting seems big try eat moong chat sort thing night one meal morning even without counting people like choose skip one meal share people three meals increases among rich says something well everyone suits though saves time stay alone dont want waste time cooking three meals dont like junk food dont like hotel food im one meal day person looking comments section would say may bad thing eating meals earlier better continue routine eating meals till reduced meals thinking fine years got gastritis please dont fuck stomach thats worst feeling ever much wider gap states economic sections yes states richer others states ile richer another states ile makes seem like result culture economics skipping breakfast works first bit hungry started drinking smoothie ragi mslt curd breakfast slowly started reducing quantify days started eating breakfast much difference long eat lunch time honey singh said chaar botal vodka kaam mera roj ka want starve poor fat rich souls heart cico nearly universally agreed proven method reducing weight burn hundred calories maximum high intensity exercise even months joy adapts exercise stops burning alot calories good way burning calories reducing consuming one good method reduce intermittent fasting many tried tested didnt see anyone talking increasing time meals increases fat storage intermittent fasting isnt chunk population thats trying diet doesnt time eat breakfast part population cant afford never forget im blessed dont like eating early day id much rather heavy lunch though choice bad sleep schedule ambani great engineering college student bengaluru college starts amso friends skip breakfast save time compensate traffic think state chhattisgarh people dont eat time choice poverty know considered misinformation stats say stats never get updated im saying indians amazing data manipulation look unauthorised immigrants usa underweight problem eating less eating less protein rich food poor people cant afford nutritional food eat carb times still underweight meals day lol guys want eat twice skip dinner instead breakfast see many people comment section tell skip breakfast quote eat breakfast like king lunch like middle class person dinner like poor two meals day years messaging like acche din amrit kaal smart cities bullet trains vikas programmed indians thinking sab changa si reality couldnt cant blame people falling propaganda though nobody lied frequently effectively scale indians last years theyve lied people whore supposed speak truth eat meals rare occasions eat dinner still diabetes hypertension big distrupter life due wrong eating habits eating less wont take us anywhere eating right avoid breakfast guess fall see please share sources also claim complete seperate bacterial point view fermentation point view preperation point view would love read go lot could attributed local culture habits doesnt seem like theres correlation monthly per capita comparing poorest richest within state look similar every state except jharkhand haryana karnataka difference people meals less poorest rest forced imf eat less work office jobs physical jobs entire life never felt hungry waking ever eat breakfast included hotel room force bit mean eat meals today one meallol feeling hungry wrong information pacific island nations nauru cook islands palau highest rates obesity usa comes th obese list people throwing random statements like usa obese country wrong statement also immediately point usa find mistake country justify poor conditions classic theyre issues pointed quickly finding fault western country study doesnt tell anything affordability majority americans eat meals day needs better surveys capture nutritional content meal number times eat meal day doesnt mean poor yup see tamil nadu people eat meals day say full confidence nearly everybody tn addicted carbs know many people come across say starving ate breakfastlunchdinner late dont starve miss meal people carb addiction need constant supply carbs stop hunger pangs know majority people eat like grams rice lunch eat restaurants almost restaurants proudly proclaim vegnon veg meals unlimited called thali north upsc prelims similar mh mh society brutal towards people eat tells western states mh gj rj eat less meals day irrespective financial background south indian states telangana tamil nadu kerala eat meals day irrespective financial background also reason mh gj less obesity compared tn kerala",
    "light_cleaned_title": "Just over 50% Indians have three meals a day",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "I haven't had 3 meals for like 10+ years. I skip either breakfast or lunch. I have been skipping lunch for the last 2 years. I would eat lunch only when I am feeling exhausted or I am hungry. Eat less and live more. Whacko Out of touch response. Many people skip meals intentionally. The article never covered that response. This is called cherry picking. You are looking at things from the point that fits your agenda. Subhe chai ka sath muri biscuits dopaher ko aur saam ko aur bhi khana hota hai ky Accusing me of cherry picking but ignored the first paragraph in the article. Wah. I only eat two meals a day. This is soo dum and a fraudulent article. False Narratives 1. Three meals are healthy: Intermittent fasting says otherwise 2. Western outlook to 3 meals totally discounts Indian cultural practices . There are communities that only do two big meals. It's really hard to believe this. 50% of Indians can't afford meals 3 times a day? You are skipping breakfast/lunch because it's your choice. Most are skipping their breakfast/lunch because they have no other choice. Let them eat cake!! और विश्वगुरू बनने चले। A study says only 27% of Americans have the traditional 3 meals a day. Average person eats only 2 meals a day. How large was the sample set? Internet did not disappoint I don't think that 50% of Indians can't afford but half of them choose not to eat 3 meals. I have seen families skipping breakfast or dinner and believe in intermediate fasting. The majority of the population in India are poorer than you think. I skip breakfast, too, as part of intermittent fasting. But as a country as a whole, I really don't think even 1% is skipping a meal because of intermittent fasting. Mai afternoon me hi breakfast karta hu aur fir seedha dinner. 3 time khane ki zarurat hi nhi padti Maybe it's hard for me to believe because I am from Kerala, and in the graph it says more than 98% have 3 meals. Yeah. Farmers in village have heavy brunch and then dinner. Never take any health advice from Americans. The most obese people on the planet I usually skip breakfast just cos I don't feel like eating at that time of day Please make your food protein rich, we Indians don’t eat enough protein and suffer in latter stages of our life. Borgir Your title is Misleading I legit forget breakfast somedays. As a guy who skips breakfast, me uthta hi 12-1 baje hu i was the 50% in kota. 7 baje breakfast milti thi 10 baje uth ta tha. Many do eat snacks or other junk foods in between As someone who is originally from who has lived in other states, its not very hard for me to believe. Very few are as privileged as you are. if you have a sedentary lifestyle , eat 2 meals a day. u will never get fat. I have only 1 meal a day. Which is sufficient for complete day I dont think it's because of affordability, if thats the case, why is both rich and the poor having a similar percentage in almost all states. Very few in India have the kind of jobs that result in a sedantry lifestyle. me: 2 time khana 1 time daaru. What about all the IT jobs and desk jobs in other sectors? I might be wrong but i think this number might be a bit inflated pds and food security act, 2013 has worked well in the regardof food grain availability. There is a widespread distribution of foodgrains which might not be nutritious but it’s better than nothing. However this doesn’t mean that there is no scarcity of food but to say like a number that 50% indians which is approximately 70 crores do not have food might be an exaggeration. Same... I am following OMAD diet. Greatly improved my health. 3 meals are overrated Only 21.5% of Indians are currently estimated to even have regular salaried jobs. The share of Indians working in IT jobs and desk jobs would be even lower. Oldies are especially lacking in our country 3 meals a day is a British concepts we for during British raj. India never had a breakfast culture. Never take health advice from \"Average American\". Not everyone are obese btw. You should also note that 10% of their demographics are Indians. How do you explain the richest 20% of the top 5 States also not eating 3 meals a day? Poverty is one of the causal factors, but it alone doesn't dictate dietary habits. Drier regions typically eat lesser number of meals for various reasons. I know never and everyone should NEVER be used. my goal isn't to be technically correct here I always eat yogurt in the morning or make smoothies out of it, In India we really don’t have a good yogurt available. It saves time, high in protein and is really good for my gut. I wonder why people in India don’t consume yogurt much compared to Europe and West. By choice or without a choice? Poor nutrition is the problem more than number of meals. 80% Indians are protein deficient. Loading up on carbs, with a small amount of vegetables and negligible protein. Then the Western junk - cornflakes, cookies, bread, rusk which is empty carbs. Same But that is by choice, most people don't eat it because they can't afford it You are goals man. I reduced my means from 5 per day to 3. Hoping to go for 2. Do you do breakfast and dinner or something other combination? How did you transition from more than 2 to 2? Why did you start? even i miss breakfast way too many times. ig i should wake up before 2pm 10%? Just watched some video where dude said 6% of usa were Asians and 1.5% were Indian Americans Bruh, you do realise that yogurt is essentially hung curd? It's when you Remove excess water/liquid from dahi. The essential fermentation process is very very similar along with the product biotics post fermentation. Also, it's usually a bad idea to consume fermented food from the shelf. Take care. It is unbelievable how unhealthy our eating habits are, and how offended people get when you point it out. \"Dal\" is enough, some will assert. Even Bengalis, who are probably the heaviest meat eaters have a completely unbalanced diet, because despite eating enough protein, they eat so much carbs through rice and potatoes. Why? Are you on weight loss goals/program? Or maybe bcz they wake up late or are fussy eaters. My sister wakes up at 11 on noon school days. Ig it is more like they don't eat and less like they are forced to not eat I choose not to eat 3 meals a day… The bacteria found in the yogurt and curd is completely different which is what makes yogurt different from curd. I don’t have time to make curd at home and especially the flavoured ones which we get without any added sugar. I love them and have been consuming them without any problem from last 7 years from the shelf and will continue to do so. Majority of us don’t have the time to make curd or milk the cow. Takecare :) Nope. I really do believe I don't need 3 meals. For the longest time I have been eating breakfast, lunch, snacks dinner and then a lite snack. I want to understand if I really need that much. Skipped the mid night stuff. Didn't notice a difference. Then skipped the evening snacks. Again, no difference. Been testing a plan where my meals are 3 and weekly skip a sing meal for the past 3 months. No difference at all. The entire concept of 3 meals I feel is flawed. It was designed to increase productivity at factories for the workers. Again, it's all exploratory rn. No reasearch backed. Just want to understand my body better. I sometimes eat only one meal a day, by choice. Autophagy. The stats are convoluted. USA's immigration laws were pathetic so they technically don't have updated data. Abbe Rural me wo Lunch hi agr 11 baje kar rhe hai, to kyu hi breakfast krenge🫠 Been going to my village(both, mom n dad side)since ages but, never have I ever seen a concept of breakfast(unless n until any occasion demands like guest, function n so on) From dinner's pov, it's done by 7-7:30PM Between those 7-8 hrs, most of them do have some light snacks(especially good amount of tea at 3-4pm) Why do Indians need meals? They can chant \"Modi Modi\" to satisfy their hungres. Angen gatram, lode bhojanam. - Modi to all hungry Indians. some people need to do that tho Number of meals per day is an absolutely ineffective metric to quantify the health of a nation -- there are so many cultural, environmental, and ecological reasons that dictate dietary habits. A better method would be to calculate the caloric intake and output, and quantify the kind of essential nutrients (vitamins, minerals, carbs, proteins, and fat) that a person/family is consuming. I have been on omad for half a year now. Mess mei breakfast khatam hone ke baad soke uthta hu toh miss hoga hi🥲 Strawberry? I haven’t come across single good yogurt brand in India yet. I think OP meant to say only over 50% of the people can afford to eat 3 meals a day and everything bad with India is just labelled as a British or foreign concept by y'all. Work life balance, weekends, having fun, sure these are foreign concepts but that doesn't mean we shouldn't follow them, they lead to a good and happy life. Here fuckers like Infosys ka Narayan Murthy and OLA, CEO Bhavesh promote shit like 70 hour work week, 100 hour work week, no work life balance, no weekends. Sure I'd work 70-100 hours but for my own self, for my own company. Those people earn millions of dollars for their work and they wanna pay employees for 40 hours of work and expect them to work for 70-100 hours in the name of nationalism and growing India. My Grand parents, parents everybody ate 3 meals a day . Why would I want to change it . I do believe in this report bcz I used to assume that we are middle class then I knew about caste and income then I realised we are actually working class. Most of indians are working class and below. I once visited a temple where we had to wait before opening gate there I saw people from different states those who belong to rich family are quiet easy to spot But people in India already consume a lot of curd, is yogurt wayy better than curd? Villagers mostly eat only two times. Heavy brunch and heavy dinner. In between tea & milk. I find yogurt texture and consistency way better than curd, I make multiple meals out of yogurt compared to curd. We get flavoured yogurts as well ( I consume without any added sugar) which helps my sugar craving go away and is also a tastier alternative. Yogurts have double the amount of protein. Very less percentage of people work in that job . Do you get enough protein ? I don't think omad is sustainable for long term . Right, but I would bet a sizeable chunk of people in that 50% usually skip one meal a day not because of financial condition, but because of choice Same here, lunch around 11 am then dinner at 8pm. Breakfast karne ka mann hi ni karta kabhi. Aur jis din kar leta hu to lunch ka schedule bigad jata hai. What is it? Lol me, but it's because I don't feel like it when I'm going out. I eat when I stay home. Pg only provides 2 meals That's not how you lose weight. Reduce your potion size and take the stairs instead of the elevator. Reducing the frequency of meals makes your body store more of the carbs and fats. Tamilnadu is Top becos of our Free Mid day meals. Very proud ❤️.. 3 is too much anyways. I feel full enough just by 2 meals itself and some exercise is optimal for the body imo If the richest 20% aren't that different from poorest 20%, then the analysis needs to be based on cultural practices or work related issues rather than portraying it as a poverty issue. Like, Delhi - poorest 20% - 55.2% richest 20- 35.2% chattisgarh - poorest 20% - 60.2% richest 20% - 36.5% Haryana - poorest 20% - 60.3% 20-40% - 78% richest - 82.7% Telangana - poorest 20% - 94.8% 20-40% - 84% Rural regions have higher portion of 3 meals a days. The important statistic is increase in difference between poor and richest. It is 11% in 2024, it was 3.5 in 2011-12. Overall, 3 meals a day don't mean proper nutrition. Guess what. Even Medicine is a British concept. Before that we Indians used to die from polio.. no they dont, bottom 50% of india makes less than 15k a month, it's not by choice. I don’t do manual labor or heavy workout, and eating very early in the day makes me feel uneasy. I’m not following any diet plan or intermittent fasting; I just prefer to eat only when I’m actually hungry. cmon usa doesnt have 10% indians 3 crore Indians in USA, that does not seem possible. 1.5% seems correct, around 45 lakh Indians. I also skip breakfast not because of poverty, i just wake up at 10 What a depressing infographic. richest 20% in many of those poor states arent really that rich, keep in mind top 10% monthly income in india is close to 25k, and those BIMARU states and other states with poorer pops top 20% arent actually that rich Doesn't everyone have free midday meals? >Work life balance, weekends, having fun No these are not the foreign concepts z it's the basic human needs. We don't live to work. We work to live. I agree the OP meant to say that we can't even afford the food and that's the real point. Having only 2 meals is not the actual problem and 🚭 a good way to surface the underlying problem One Meal A Day (OMAD). Not for everyone, obviously. They do not. Most people skip meals because they can't afford it. Over 32% kids under 5 years are considered underweight. This is not because they are choosing to skip a meal. It's because parents can't afford to feed their kids. Half the college kids miss breakfast. I don't know. but heard hindi states don't give eggs in mid day meal schemes becoz it's against their vegetarian diet. Tamilnadu even have started Free breaks fast scheme from previous year. May be That is also a reason. Child nutrition deficiency is lower in both Kerala and Tamilnadu.. but if you have 2 meals a day you are rich and out of poverty :) Been doing it since COVID. No problem. Of course, I eat a lot of protein and fiber. No refined flour, very little sugar. Workout in the evenings - then a big dinner. Thats it. In brief can you provide some inside? Like weight etc and what meal include what and how does it impact your health. And why did you decide omad? Thnx. Reasons can absolutely vary. And 50% of Indians can't afford 3 meals a day is something that's not true tbh. Well, my blood tests about 6 years back were pretty bad. Working out wasnt making a difference. I am a big guy - 6'3 weighed about 104 kgs. Decided to cut out most carbs and follow OMAD. I dont eat simple carbs. I eat lot of chana, beans, dal, kabuli chana etc. Then nuts - almonds and peanuts and walnuts. Vegetables which are not overly carb heavy - like Cucumber, Tindey etc. and about 150 gms of Chicken, fish or mutton. This meal fills you up for 24 hours as its high in protein and fiber. I avoid sugar as much as possible. Workout for an hour- weight and cardio. My weight has dropped to 81 and my blood tests are now normal and my overall health is now brilliant. Skip breakfast if you're younger than 50. Now we know the root cause of Gujarat Model. That's great . Eating 2000-2500 calories in one sitting seems big to me. I try the same too i only eat some moong chat sort of thing at night and one meal in the morning Even without counting you and people like you who choose to skip one meal; \"2 And the share of people who have three meals increases among the rich.\" says something. Well, its not for everyone. Suits me though, and saves time. I stay alone and dont want to waste time cooking three meals. I dont like junk food and I dont like hotel food. I'm a one meal a day person. Looking at the comments section - I would say this may not be such a bad thing. If you were eating 3 meals earlier, better to continue the routine. I was eating 3 meals till I was 29 and then reduced it to 2 meals thinking it was fine and in 2 years, I got gastritis. Please don't fuck up your stomach. That's the worst feeling ever. Much wider gap between states than economic sections. Yes some states are richer than others but no state’s 20%ile is richer than another state’s 80%ile. Makes this seem more like a result of culture than economics Skipping breakfast works for me. At first I was a bit hungry, so started drinking just a smoothie or ragi mslt with curd for breakfast. Then I slowly started reducing the quantify for a few days and then started not eating breakfast. Not much of a difference for me as long as eat lunch in time before 2. Honey Singh once said, \" Chaar Botal Vodka, Kaam Mera Roj Ka\" so do you want to starve those poor fat and rich souls, you have no heart 🥹 CICO is nearly universally agreed and proven method of reducing weight. You only burn a few hundred calories maximum with high intensity exercise, and even then after a few months your joy adapts to the exercise and stops burning alot of calories. The only good way if burning calories is reducing consuming it. And one of the good method to reduce it is by intermittent fasting which many have tried and tested it. And I didn't see anyone talking about increasing time between meals increases fat storage with intermittent fasting. This isn’t about the chunk of population that’s trying to diet or doesn’t have time to eat breakfast. It’s about the part of the population that can’t afford it. I should never forget I'm blessed I don't like eating that early in the day, I'd much rather have a heavy lunch Same. Though this is not by choice. I just have a very bad sleep schedule. Ambani: Great. I am engineering college student in Bengaluru and our college starts at 9 am,so 60-70% of friends skip breakfast. Because they have to save time to compensate it for traffic I think in my state chhattisgarh, people don't eat 3 time is more of choice than about poverty. I know why it's considered misinformation because the stats say 1.6%. Those stats will never get updated is what I'm saying. Indians are amazing at data manipulation. Just look up for unauthorised immigrants in USA. That underweight problem is not because they are eating less it's about they are eating less protein rich food. Poor people can't afford nutritional food. They will eat carb 3 times but they will still underweight I do 2 meals a day lol. Guys, If you want to eat twice, skip dinner instead of breakfast, i see many people in the comment section tell that they skip breakfast. There is a quote \" Eat breakfast like a king, lunch like a middle class person and dinner like poor \" I have two meals a day 10 years of messaging like Acche Din, Amrit Kaal, smart cities, bullet trains and vikas has programmed Indians into thinking sab changa si. The reality couldn’t be further from that. You can’t blame people for falling for that propaganda though. Nobody has been lied to as frequently and as effectively and at such scale as Indians in the last 10 years — and they’ve been lied to by the very people who’re supposed to speak the truth. I only eat 2 meals, on rare occasions I eat dinner. Still diabetes and hypertension is a big distrupter in our life due to wrong eating habits.. Eating less won't take us anywhere, eating right will. I avoid breakfast. So I guess I too fall in this I see. Can you please share some sources that also claim that both are complete seperate from a bacterial point of view, fermentation point of view and preperation point of view? Would love to read about them. Here you go A lot of this could be attributed to the local culture and habits. Doesn't seem like there's any correlation to the Monthly per capita here. Just by comparing the poorest and richest within each state, they look very similar for every state. Except Jharkhand, Haryana and Karnataka, where the difference in people having 3 meals is 10+% less for poorest. The rest are DOING forced IMF. I eat less during 🌙 Did they work office jobs or physical jobs? In my entire life I never felt hungry waking up. I only ever eat breakfast when it's included with my hotel room so I force myself a bit. I mean I only eat 2 meals 🙃 Today only one meal,lol feeling hungry Wrong information The Pacific island nations of Nauru, Cook Islands, and Palau have the highest rates of obesity USA comes 10th obese in the list Here people are just throwing random statements like “USA is the most obese country” It’s a wrong statement Also, some here immediately point to USA and find some mistake in their country to justify poor conditions here Classic! When they’re an issues pointed out, quickly finding some fault in a western country This study doesn't tell anything about affordability. Majority of Americans only eat 2 meals a day. There needs to be better surveys, that capture the nutritional content of the meal than number of times. I eat 1 meal a day, doesn't mean I am poor. Yup. I see that Tamil Nadu has 98%+ of people who eat 3 meals a day. I can say with full confidence that nearly everybody here in TN are ADDICTED to carbs. Do you know how many people I have come across who say they are \"starving\" because they ate the breakfast/lunch/dinner late? You don't \"starve\" when you miss a meal. Only people with carb addiction need constant supply of carbs to stop hunger pangs. And do you know how a majority of people here eat like 500-600 GRAMS of rice as lunch when they eat in restaurants? Almost all the restaurants here proudly proclaim their \"veg/non veg meals\" as unlimited (called as thali in north) This is not UPSC prelims Similar for MH. MH society is brutal towards people who over eat...... This only tells me that Western states (MH, GJ and RJ) eat less than 3 meals a day irrespective of their financial background. And that South Indian states (Telangana, Tamil Nadu and Kerala) eat 3 meals a day irrespective of their financial background. This is also the reason why MH and GJ has less obesity compared to TN and Kerala."
}