{
    "id": "16c75hl",
    "title": "KKDRB decides to appoint 2,618 guest teachers tentatively by the month-end",
    "url": "https://www.reddit.com/r/india/comments/16c75hl/kkdrb_decides_to_appoint_2618_guest_teachers/",
    "selftext": "[https://localindiannews.com/kkdrb-decides-to-appoint-2618-guest-teachers-tentatively-by-the-month-end/](https://localindiannews.com/kkdrb-decides-to-appoint-2618-guest-teachers-tentatively-by-the-month-end/)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/89z1r0izormb1.png?width=1200&format=png&auto=webp&s=610c2228a14bfea483d4f147a3d5202a04020124\n\n \n\nChairman of the Kalyana Karnataka Region Development Board Ajay Singh, along with others, addressing a press conference in Kalaburagi on Wednesday.  \n| Photo Credit: ARUN KULKARNI\n\nBeside the State government appointing 16,041 guest teachers in primary and high schools to address the shortage of teachers in the Kalyana Karnataka region, the Kalyana Karnataka Region Development Board (KKRDB) will appoint 2,618 guest teachers to fill the gap.\n\nKKRDB chairman Ajay Singh, addressing a press conference here on Wednesday said that though the State government is appointing 16,041 guest teachers in two phases, there will be a shortage of 2,618 guest teachers in the region.\n\nKKRDB will appoint guest teachers to fill these 2,618 vacancies to fill the gap, he said.\n\nProviding data of the number of teachers and schools in the region, Dr. Singh said that 13.58 lakh children are studying in 9,249 government primary and high schools in seven districts of Kalyana Karnataka region.\n\nAs many as 18,282 posts of teachers are lying vacant against the total 49,439 sanctioned posts for the region. Despite the 16,041 guest teachers to be appointed by the State government, 62,748 students will be deprived of regular classes due to shortage of teachers. To fill this gap, the KKRDB has decided to appoint an additional 2,618 guest teachers, Dr. Singh said.\n\nOf the 2,618 guest teachers, 2,566 teachers will be appointed for primary schools and 52 for high schools. The KKRDB will be paying honorarium for these guest teachers for the next seven months (September to March next).\n\nThe guest teachers appointed for primary schools will be paid an honorarium of ₹10,000 per month and those appointed to high schools will get ₹15,000 per month.\n\nThe KKRDB has sanctioned a sum of ₹18.34 crore to pay honorarium for these guest teachers this academic year. All these guest teachers will be appointed tentatively by the end of this month, Dr. Singh said.\n\n“For the first time ever, the KKRDB has allocated funds for appointing guest teachers. By appointing a sizable number of guest teachers, we are making all efforts to improve the performance of the region in SSLC examination in the current academic year itself,” Dr. Singh added.\n\n#### Kalyana Utsav\n\nKalyana Karnataka Utsav will be celebrated in all the seven districts of the region. Year-long events will be planned for celebrating Kalyana Karnataka Amrut Mahotsava.\n\nIn Kalaburagi, a three-day event will begin on September 15. Chief Minister Siddaramaiah will participate in the utsav on September 17.\n\nDr. Singh said that the Kalyana Karnataka Utsav will be organised in all the seven districts of Kalyana Karnataka region in October and November.\n\nMember of Legislative Assembly Allamprabhu Patil, KKRDB secretary Aniruddh Sravan and Additional Commissioner of the Department of School Education S. Akash were present.\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694063709.0,
    "convurl": "https://external-preview.redd.it/lnlCmEeTB262Gwnq_60l3KwOMnskBjz8CEqvcqFvjCY.jpg?auto=webp&s=5f271b4a96c8f558254b58fdb27863f0098b278d",
    "comments": [],
    "cleaned_text": "kkdrb decides appoint guest teachers tentatively monthend httpslocalindiannewscomkkdrbdecidestoappointguestteacherstentativelybythemonthendhttpslocalindiannewscomkkdrbdecidestoappointguestteacherstentativelybythemonthend xb xb chairman kalyana karnataka region development board ajay singh along others addressing press conference kalaburagi wednesday photo credit arun kulkarni beside state government appointing guest teachers primary high schools address shortage teachers kalyana karnataka region kalyana karnataka region development board kkrdb appoint guest teachers fill gap kkrdb chairman ajay singh addressing press conference wednesday said though state government appointing guest teachers two phases shortage guest teachers region kkrdb appoint guest teachers fill vacancies fill gap said providing data number teachers schools region dr singh said lakh children studying government primary high schools seven districts kalyana karnataka region many posts teachers lying vacant total sanctioned posts region despite guest teachers appointed state government students deprived regular classes due shortage teachers fill gap kkrdb decided appoint additional guest teachers dr singh said guest teachers teachers appointed primary schools high schools kkrdb paying honorarium guest teachers next seven months september march next guest teachers appointed primary schools paid honorarium per month appointed high schools get per month kkrdb sanctioned sum crore pay honorarium guest teachers academic year guest teachers appointed tentatively end month dr singh said first time ever kkrdb allocated funds appointing guest teachers appointing sizable number guest teachers making efforts improve performance region sslc examination current academic year dr singh added kalyana utsav kalyana karnataka utsav celebrated seven districts region yearlong events planned celebrating kalyana karnataka amrut mahotsava kalaburagi threeday event begin september chief minister siddaramaiah participate utsav september dr singh said kalyana karnataka utsav organised seven districts kalyana karnataka region october november member legislative assembly allamprabhu patil kkrdb secretary aniruddh sravan additional commissioner department school education akash present xb ",
    "cleaned_title": "kkdrb decides appoint guest teachers tentatively monthend",
    "cleaned_selftext": "httpslocalindiannewscomkkdrbdecidestoappointguestteacherstentativelybythemonthendhttpslocalindiannewscomkkdrbdecidestoappointguestteacherstentativelybythemonthend xb xb chairman kalyana karnataka region development board ajay singh along others addressing press conference kalaburagi wednesday photo credit arun kulkarni beside state government appointing guest teachers primary high schools address shortage teachers kalyana karnataka region kalyana karnataka region development board kkrdb appoint guest teachers fill gap kkrdb chairman ajay singh addressing press conference wednesday said though state government appointing guest teachers two phases shortage guest teachers region kkrdb appoint guest teachers fill vacancies fill gap said providing data number teachers schools region dr singh said lakh children studying government primary high schools seven districts kalyana karnataka region many posts teachers lying vacant total sanctioned posts region despite guest teachers appointed state government students deprived regular classes due shortage teachers fill gap kkrdb decided appoint additional guest teachers dr singh said guest teachers teachers appointed primary schools high schools kkrdb paying honorarium guest teachers next seven months september march next guest teachers appointed primary schools paid honorarium per month appointed high schools get per month kkrdb sanctioned sum crore pay honorarium guest teachers academic year guest teachers appointed tentatively end month dr singh said first time ever kkrdb allocated funds appointing guest teachers appointing sizable number guest teachers making efforts improve performance region sslc examination current academic year dr singh added kalyana utsav kalyana karnataka utsav celebrated seven districts region yearlong events planned celebrating kalyana karnataka amrut mahotsava kalaburagi threeday event begin september chief minister siddaramaiah participate utsav september dr singh said kalyana karnataka utsav organised seven districts kalyana karnataka region october november member legislative assembly allamprabhu patil kkrdb secretary aniruddh sravan additional commissioner department school education akash present xb",
    "cleaned_comments": "",
    "light_cleaned_title": "KKDRB decides to appoint 2,618 guest teachers tentatively by the month-end",
    "light_cleaned_selftext": "[https://localindiannews.com/kkdrb-decides-to-appoint-2618-guest-teachers-tentatively-by-the-month-end/](https://localindiannews.com/kkdrb-decides-to-appoint-2618-guest-teachers-tentatively-by-the-month-end/) &#x200B; &#x200B; Chairman of the Kalyana Karnataka Region Development Board Ajay Singh, along with others, addressing a press conference in Kalaburagi on Wednesday. | Photo Credit: ARUN KULKARNI Beside the State government appointing 16,041 guest teachers in primary and high schools to address the shortage of teachers in the Kalyana Karnataka region, the Kalyana Karnataka Region Development Board (KKRDB) will appoint 2,618 guest teachers to fill the gap. KKRDB chairman Ajay Singh, addressing a press conference here on Wednesday said that though the State government is appointing 16,041 guest teachers in two phases, there will be a shortage of 2,618 guest teachers in the region. KKRDB will appoint guest teachers to fill these 2,618 vacancies to fill the gap, he said. Providing data of the number of teachers and schools in the region, Dr. Singh said that 13.58 lakh children are studying in 9,249 government primary and high schools in seven districts of Kalyana Karnataka region. As many as 18,282 posts of teachers are lying vacant against the total 49,439 sanctioned posts for the region. Despite the 16,041 guest teachers to be appointed by the State government, 62,748 students will be deprived of regular classes due to shortage of teachers. To fill this gap, the KKRDB has decided to appoint an additional 2,618 guest teachers, Dr. Singh said. Of the 2,618 guest teachers, 2,566 teachers will be appointed for primary schools and 52 for high schools. The KKRDB will be paying honorarium for these guest teachers for the next seven months (September to March next). The guest teachers appointed for primary schools will be paid an honorarium of ₹10,000 per month and those appointed to high schools will get ₹15,000 per month. The KKRDB has sanctioned a sum of ₹18.34 crore to pay honorarium for these guest teachers this academic year. All these guest teachers will be appointed tentatively by the end of this month, Dr. Singh said. “For the first time ever, the KKRDB has allocated funds for appointing guest teachers. By appointing a sizable number of guest teachers, we are making all efforts to improve the performance of the region in SSLC examination in the current academic year itself,” Dr. Singh added. #### Kalyana Utsav Kalyana Karnataka Utsav will be celebrated in all the seven districts of the region. Year-long events will be planned for celebrating Kalyana Karnataka Amrut Mahotsava. In Kalaburagi, a three-day event will begin on September 15. Chief Minister Siddaramaiah will participate in the utsav on September 17. Dr. Singh said that the Kalyana Karnataka Utsav will be organised in all the seven districts of Kalyana Karnataka region in October and November. Member of Legislative Assembly Allamprabhu Patil, KKRDB secretary Aniruddh Sravan and Additional Commissioner of the Department of School Education S. Akash were present. &#x200B;",
    "light_cleaned_comments": ""
}