{
    "id": "1e50h2g",
    "title": "Chitrakoot: Detained youth found dead, SHO and juniors booked for murder",
    "url": "https://indianexpress.com/article/cities/lucknow/chitrakoot-detained-youth-found-dead-sho-and-juniors-booked-for-murder-9457749/?tbref=hp",
    "selftext": "Family and friends allege torture in custody; police say the 22-year-old fled from thana, jumped in front of a train",
    "flair": "Crime",
    "score": 38,
    "num_comments": 7,
    "created_utc": 1721165391.0,
    "convurl": "https://external-preview.redd.it/yVg6qJmMTY8qwrUR9DsEJVve7TwB3uWrVb4A3LA1apM.jpg?auto=webp&s=2f9cd1d788fac05f4870c838bd2b950177177954",
    "comments": [
        "That's my issue with making a police state. You can't and shouldn't give police this much power as it may have long term consequences and it becomes much harder to keep the police in check. From this to bulldozer justice, I don't like this at all. I don't like the idea of giving unbridled power to the state or any one person.",
        "Where is chitrakoot?",
        "We desperately need a sub indianpolicebrutality...maybe the mods of this sub could make one. I'm from a rural area and I cannot stress enough how the method of custodial torture and apparent delayed arrest is used by police on weaker sections of society.",
        "Do the police also say he tied and blindfolded himself too? And knocked his teeth in himself too? \n\n/s",
        "This is why we need body cams for the police.",
        "Fuck... Mere hometown ki news idhar ",
        "I mean they are saying that he went out of the station (as if they will let someone out so easily), police didn't bother checking and he gave his life by coming in front of a moving train. Doesn't sound plausible. But what do I know 💁‍♂️",
        "https://np.reddit.com/r/t5_bznqnp/s/88ejggnh40\n\nHere take this"
    ],
    "cleaned_text": "chitrakoot detained youth found dead sho juniors booked murder family friends allege torture custody police say yearold fled thana jumped front train ",
    "cleaned_title": "chitrakoot detained youth found dead sho juniors booked murder",
    "cleaned_selftext": "family friends allege torture custody police say yearold fled thana jumped front train",
    "cleaned_comments": "thats issue making police state cant shouldnt give police much power may long term consequences becomes much harder keep police check bulldozer justice dont like dont like idea giving unbridled power state one person chitrakoot desperately need sub indianpolicebrutalitymaybe mods sub could make one im rural area stress enough method custodial torture apparent delayed arrest used police weaker sections society police also say tied blindfolded knocked teeth need body cams police fuck mere hometown ki news idhar mean saying went station let someone easily police didnt bother checking gave life coming front moving train doesnt sound plausible know take",
    "light_cleaned_title": "Chitrakoot: Detained youth found dead, SHO and juniors booked for murder",
    "light_cleaned_selftext": "Family and friends allege torture in custody; police say the 22-year-old fled from thana, jumped in front of a train",
    "light_cleaned_comments": "That's my issue with making a police state. You can't and shouldn't give police this much power as it may have long term consequences and it becomes much harder to keep the police in check. From this to bulldozer justice, I don't like this at all. I don't like the idea of giving unbridled power to the state or any one person. Where is chitrakoot? We desperately need a sub indianpolicebrutality...maybe the mods of this sub could make one. I'm from a rural area and I cannot stress enough how the method of custodial torture and apparent delayed arrest is used by police on weaker sections of society. Do the police also say he tied and blindfolded himself too? And knocked his teeth in himself too? /s This is why we need body cams for the police. Fuck... Mere hometown ki news idhar I mean they are saying that he went out of the station (as if they will let someone out so easily), police didn't bother checking and he gave his life by coming in front of a moving train. Doesn't sound plausible. But what do I know 💁‍♂️ Here take this"
}