{
    "id": "u4mvcj",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/u4mvcj/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 19,
    "created_utc": 1650072610,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Taking a break from watching series this month.",
        "Finished watching the LOTR and The Hobbit movie series. Now starting to watch The Indiana Jones movie series",
        "Watched The Guilty on Netflix. Its incredible how the movie is basically shot in a 911 call center but manages to make you laugh, Cry, emphatize and weep for good measure. \n\nJake Gyllenhaal is a master of pulling off brilliant performances when there's barely and set to work with.",
        "Barry, Atlanta and Better call Saul are all back this month. Was waiting for so long and they came all at once. All are top tier TV",
        "Skip the fourth Indiana Jones movie",
        "Watched Black books on youtube. I am trying not to finish all the 18 episodes in one go",
        "Is it that bad ? I just finished the 1st 3, and just started the 4th. I'm tempted to complete it.",
        "Also makes you appreciate Hollywood's writing despite all its shortcomings. It really is a great movie.",
        "The first three are good, the fourth one didn't feel that great",
        "I saw First Reformed and X.",
        "Completed watching Flower of the Evil and Mouse kdrama this month..\n\nboth were pretty good and thrilling..\n\nexcellent acting and the story was just too good..",
        "If you liked black books you might also like \nFather Ted.\nFawulty Towers.\nBlack Adder \nAnd Monty Python series and movies like Life of Brian and The holy grail",
        "Watched Mandibles. A movie about a giant pet fly. Insane.\n\n[more info](http://Mandibles https://g.co/kgs/LuKzz7)\n\nGullak on Sony liv was great watch too",
        "Thank you! I'll add them to my list. Have you watched The IT Crowd?",
        "I love IT crowd. It's brilliant.",
        "I forgot and Thanks for the reminder. Better Call Saul is GOAT",
        "Can you suggest some larger than life web series which are not old. Any web series whether it be Korean , German , Indian , Anime etc will work only if it has been dubbed to Hindi or English.\n\nFor context, I have seen All of us dead, Squid Game, Dark, Stranger Things, Money Heist and Erased (an anime series).",
        "Watching \n\n**Cobra Kai- 10/10**\n\nQUIET!\n\nAlso if anyone likes Cobra Kai I would recommend \" The Paper Tigers\" , brilliant and funny movie.\n\n\n**Arrested Development rewatch**=10/10\n\n**Moon Knight** -10/10 . I am so down for Moon Knight becoming a major character like Iron Man or Cap. Oscar Isaac is superb.\n\n Movies: \n\n**Naruto: Road to Ninja**- 7/10- Naruto does not have really good non canon movies like DBZ or One Piece.But this one is the best of the bunch. Amazing music, possibly even better than the main series. Cool alternate reality but I was disappointed they didnt show much of them and focused on Naruto and Sakuras personal life and faults . I really wanted to see more of the alternate world characters , the final villain was also shown for like 2 minutes. That is the only problem I have. The rest of the movie is flawless. Animation is also top notch",
        "Watched “The Afterparty” on Apple TV. Really funny and exciting."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "taking break watching series month finished watching lotr hobbit movie series starting watch indiana jones movie series watched guilty netflix incredible movie basically shot call center manages make laugh cry emphatize weep good measure jake gyllenhaal master pulling brilliant performances theres barely set work barry atlanta better call saul back month waiting long came top tier tv skip fourth indiana jones movie watched black books youtube trying finish episodes one go bad finished st started th im tempted complete also makes appreciate hollywoods writing despite shortcomings really great movie first three good fourth one didnt feel great saw first reformed x completed watching flower evil mouse kdrama month pretty good thrilling excellent acting story good liked black books might also like father ted fawulty towers black adder monty python series movies like life brian holy grail watched mandibles movie giant pet fly insane infohttpmandibles gullak sony liv great watch thank ill add list watched crowd love crowd brilliant forgot thanks reminder better call saul goat suggest larger life web series old web series whether korean german indian anime etc work dubbed hindi english context seen us dead squid game dark stranger things money heist erased anime series watching cobra kai quiet also anyone likes cobra kai would recommend paper tigers brilliant funny movie arrested development rewatch moon knight moon knight becoming major character like iron man cap oscar isaac superb movies naruto road ninja naruto really good non canon movies like dbz one piecebut one best bunch amazing music possibly even better main series cool alternate reality disappointed didnt show much focused naruto sakuras personal life faults really wanted see alternate world characters final villain also shown like minutes problem rest movie flawless animation also top notch watched afterparty apple tv really funny exciting",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Taking a break from watching series this month. Finished watching the LOTR and The Hobbit movie series. Now starting to watch The Indiana Jones movie series Watched The Guilty on Netflix. Its incredible how the movie is basically shot in a 911 call center but manages to make you laugh, Cry, emphatize and weep for good measure. Jake Gyllenhaal is a master of pulling off brilliant performances when there's barely and set to work with. Barry, Atlanta and Better call Saul are all back this month. Was waiting for so long and they came all at once. All are top tier TV Skip the fourth Indiana Jones movie Watched Black books on youtube. I am trying not to finish all the 18 episodes in one go Is it that bad ? I just finished the 1st 3, and just started the 4th. I'm tempted to complete it. Also makes you appreciate Hollywood's writing despite all its shortcomings. It really is a great movie. The first three are good, the fourth one didn't feel that great I saw First Reformed and X. Completed watching Flower of the Evil and Mouse kdrama this month.. both were pretty good and thrilling.. excellent acting and the story was just too good.. If you liked black books you might also like Father Ted. Fawulty Towers. Black Adder And Monty Python series and movies like Life of Brian and The holy grail Watched Mandibles. A movie about a giant pet fly. Insane. [more info](http://Mandibles Gullak on Sony liv was great watch too Thank you! I'll add them to my list. Have you watched The IT Crowd? I love IT crowd. It's brilliant. I forgot and Thanks for the reminder. Better Call Saul is GOAT Can you suggest some larger than life web series which are not old. Any web series whether it be Korean , German , Indian , Anime etc will work only if it has been dubbed to Hindi or English. For context, I have seen All of us dead, Squid Game, Dark, Stranger Things, Money Heist and Erased (an anime series). Watching **Cobra Kai- 10/10** QUIET! Also if anyone likes Cobra Kai I would recommend \" The Paper Tigers\" , brilliant and funny movie. **Arrested Development rewatch**=10/10 **Moon Knight** -10/10 . I am so down for Moon Knight becoming a major character like Iron Man or Cap. Oscar Isaac is superb. Movies: **Naruto: Road to Ninja**- 7/10- Naruto does not have really good non canon movies like DBZ or One Piece.But this one is the best of the bunch. Amazing music, possibly even better than the main series. Cool alternate reality but I was disappointed they didnt show much of them and focused on Naruto and Sakuras personal life and faults . I really wanted to see more of the alternate world characters , the final villain was also shown for like 2 minutes. That is the only problem I have. The rest of the movie is flawless. Animation is also top notch Watched “The Afterparty” on Apple TV. Really funny and exciting."
}