{
    "id": "158f9pz",
    "title": "Rant: The 1950's and the 1960's cinema not only dominated the Indian Film landscape but the Worldwide cinema at large",
    "url": "https://www.reddit.com/r/india/comments/158f9pz/rant_the_1950s_and_the_1960s_cinema_not_only/",
    "selftext": " \n\nThe 1950s and the subsequent period were absolutely the goldmines of the achievements in filmmaking with visionary directors like Bimal Roy, Guru Dutt, Mehboob Khan, and of course the Satyajit Ray. The films were impeccably directed and provided the opening for the classical stories to be told and appreciated. The 1950s were truly the time of the revolutionary directors\n\nTo give you a couple of example\n\n* The film Neecha Nagar was the movie by Cheatn Anad(1946) that won first ever Cannes Film Award Palma D Or. No film absoultely no Indian won a Palma D Or subsequently\n* The Film Do Beegha Zameen by Bimal Roy (1954) won the Prix International In Cannes Film Award and no Indian film after that won any award\n\nThese above are just one of the few incidents. Many films at that time won numerous Independent film awards too like Jagte Raho which won Crystal Globe Grand Prix at the Karlovy Vary International Film Festival in Czechoslovakia in 1957 and was blockbuster in Russia\n\nEventually though with the movie progression the commercialization of the movie took place and the film started to cater more towards the audience viweing habits.\n\nI could only remember the famous Interview by Satyajit Ray  \n\"We have a fairly backward audience, unsophisticated audience.\"-Satyajit Ray  \n[https://www.youtube.com/watch?v=UMp7dIGq2eI&t=1s](https://www.youtube.com/watch?v=UMp7dIGq2eI&t=1s)\n\nI am not attributing we dont make any good films, we do make but its a humongous tragedy we had such a headstart and we fell of.. The Indian Fillm Industry has enjoyed one of the most passionate incredible directors which dared to take risk wherever can\n\nAs i close this post, I still waiting for any movies to replace possibly the most favourite movie of mine Anand and Guide\n\nWhat are your favourite classical movies? Lets discuss it in comments",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690215662.0,
    "convurl": "https://external-preview.redd.it/kps23D9zA0-gOd8KnU-Ywto50aWxwrZL4LnLlT9b5EQ.jpg?auto=webp&s=24a67829e92e8c79df37a84946dedc7e36c01f53",
    "comments": [
        "And don't forget Shyam Benegal  who portrayed complex thinking and societies very well. \n\nHis movies like Kondura/Anugraham(religious beliefs ), Manthan (Based on Gujurat Milk Cooperative society) are one of a kind.\n\nTelugu (my home lang) had great movies. In Mayabazaar , the techniques used in showing moonlight was first in kind in the world. \n\nIn the movies like Maa Bhoomi (meaning our Land in Telugu) had shown a scene in which  an  upper caste married woman sexually harasses a young man how works in their house. He is low caste and scared of consequnces. The director did not hesitate to give away the name of the caste . I can't imagine those things happening now without outrage .\n\nYes, looking into movies of Hollywood of the same period, I was quite surprised their quality of movie making was not as good as our's .",
        "Yess so agreee.. I was only talking about indian films but i agree so much",
        "Whatever I mentioned were Indian movies only. Probably, you meant Hindi movies?",
        "Yes sorry I edited ... The comment:)",
        "Except for white people and leftists, nobody is interested in poverty porn.",
        "My grandmother (not a leftist, a woman who grew up working farmland) cried when she watched satyajit ray’s movies with me many years ago. Many people don’t see “poverty” in those parallel cinema flicks, but an accurate picture of how people used to (or still) live.",
        "The life experiences your grandmother had is way different than what today's generation experiences. Human tragedy and communistic films are out of fashion. Also they are not commercially viable. It's a niche and will stay that way.",
        "After the ‘50s and ‘60s, Indian alternative cinema moved on to talking about the urban middle classes. Satyajit Ray has his Calcutta trilogy and Basu Chatterjee made his beloved comedies about Bombay (Piya ka Ghar, Chhoti si Baat), for example. Your suggestion that alternative cinema only talks about poverty, tragedy or village life is incorrect. Ray himself directed a great many comedies.",
        "Satyajit Ray's films were not for the common person. They were for intellectual and ivory tower elitists. Hence he got such recognition in the West. Every decade has been a healthy mix of art and commercial cinema. There are plenty of great indie films with contemporary social issues that have done great artistically and socially. People should admire 'Sairat' more - a contemporary issue, directed by a Dalit that has done great in all facets than a UC elitist who did not respect the common Indian viewer.",
        "Who likes to watch poverty porn? Only rich people and smug foreigners .",
        "Tell me you're illiterate without telling me you're illiterate.",
        "Nobody’s interested in your poor ass either. So gtfo and go back to living your pathetic life",
        "You are correct \nThere is a reason why Karan Johar type movies are so popular. The world travelling rich elites surrounded by luxuries but troubled in personal relationships for some reason is what the Hindi speaking cow belt connects quite well with.",
        "No counterpoint then just shut up",
        "You're babbling like an illiterate. Case in point, your claim that his works are for ivory tower elitists. Nothing could be further from the truth. It is clear that you have neither seen his films nor are you aware that many of them were adaptations of works by popular Bengali authors."
    ],
    "cleaned_text": "rant cinema dominated indian film landscape worldwide cinema large subsequent period absolutely goldmines achievements filmmaking visionary directors like bimal roy guru dutt mehboob khan course satyajit ray films impeccably directed provided opening classical stories told appreciated truly time revolutionary directors give couple example film neecha nagar movie cheatn anad first ever cannes film award palma film absoultely indian palma subsequently film beegha zameen bimal roy prix international cannes film award indian film award one incidents many films time numerous independent film awards like jagte raho crystal globe grand prix karlovy vary international film festival czechoslovakia blockbuster russia eventually though movie progression commercialization movie took place film started cater towards audience viweing habits could remember famous interview satyajit ray fairly backward audience unsophisticated audiencesatyajit ray httpswwwyoutubecomwatchvumpdigqeitshttpswwwyoutubecomwatchvumpdigqeits attributing dont make good films make humongous tragedy headstart fell indian fillm industry enjoyed one passionate incredible directors dared take risk wherever close post still waiting movies replace possibly favourite movie mine anand guide favourite classical movies lets discuss comments ",
    "cleaned_title": "rant cinema dominated indian film landscape worldwide cinema large",
    "cleaned_selftext": "subsequent period absolutely goldmines achievements filmmaking visionary directors like bimal roy guru dutt mehboob khan course satyajit ray films impeccably directed provided opening classical stories told appreciated truly time revolutionary directors give couple example film neecha nagar movie cheatn anad first ever cannes film award palma film absoultely indian palma subsequently film beegha zameen bimal roy prix international cannes film award indian film award one incidents many films time numerous independent film awards like jagte raho crystal globe grand prix karlovy vary international film festival czechoslovakia blockbuster russia eventually though movie progression commercialization movie took place film started cater towards audience viweing habits could remember famous interview satyajit ray fairly backward audience unsophisticated audiencesatyajit ray httpswwwyoutubecomwatchvumpdigqeitshttpswwwyoutubecomwatchvumpdigqeits attributing dont make good films make humongous tragedy headstart fell indian fillm industry enjoyed one passionate incredible directors dared take risk wherever close post still waiting movies replace possibly favourite movie mine anand guide favourite classical movies lets discuss comments",
    "cleaned_comments": "dont forget shyam benegal portrayed complex thinking societies well movies like konduraanugrahamreligious beliefs manthan based gujurat milk cooperative society one kind telugu home lang great movies mayabazaar techniques used showing moonlight first kind world movies like maa bhoomi meaning land telugu shown scene upper caste married woman sexually harasses young man works house low caste scared consequnces director hesitate give away name caste cant imagine things happening without outrage yes looking movies hollywood period quite surprised quality movie making good yess agreee talking indian films agree much whatever mentioned indian movies probably meant hindi movies yes sorry edited comment except white people leftists nobody interested poverty porn grandmother leftist woman grew working farmland cried watched satyajit rays movies many years ago many people dont see poverty parallel cinema flicks accurate picture people used still live life experiences grandmother way different todays generation experiences human tragedy communistic films fashion also commercially viable niche stay way indian alternative cinema moved talking urban middle classes satyajit ray calcutta trilogy basu chatterjee made beloved comedies bombay piya ka ghar chhoti si baat example suggestion alternative cinema talks poverty tragedy village life incorrect ray directed great many comedies satyajit rays films common person intellectual ivory tower elitists hence got recognition west every decade healthy mix art commercial cinema plenty great indie films contemporary social issues done great artistically socially people admire sairat contemporary issue directed dalit done great facets uc elitist respect common indian viewer likes watch poverty porn rich people smug foreigners tell youre illiterate without telling youre illiterate nobodys interested poor ass either gtfo go back living pathetic life correct reason karan johar type movies popular world travelling rich elites surrounded luxuries troubled personal relationships reason hindi speaking cow belt connects quite well counterpoint shut youre babbling like illiterate case point claim works ivory tower elitists nothing could truth clear neither seen films aware many adaptations works popular bengali authors",
    "light_cleaned_title": "Rant: The 1950's and the 1960's cinema not only dominated the Indian Film landscape but the Worldwide cinema at large",
    "light_cleaned_selftext": "The 1950s and the subsequent period were absolutely the goldmines of the achievements in filmmaking with visionary directors like Bimal Roy, Guru Dutt, Mehboob Khan, and of course the Satyajit Ray. The films were impeccably directed and provided the opening for the classical stories to be told and appreciated. The 1950s were truly the time of the revolutionary directors To give you a couple of example * The film Neecha Nagar was the movie by Cheatn Anad(1946) that won first ever Cannes Film Award Palma D Or. No film absoultely no Indian won a Palma D Or subsequently * The Film Do Beegha Zameen by Bimal Roy (1954) won the Prix International In Cannes Film Award and no Indian film after that won any award These above are just one of the few incidents. Many films at that time won numerous Independent film awards too like Jagte Raho which won Crystal Globe Grand Prix at the Karlovy Vary International Film Festival in Czechoslovakia in 1957 and was blockbuster in Russia Eventually though with the movie progression the commercialization of the movie took place and the film started to cater more towards the audience viweing habits. I could only remember the famous Interview by Satyajit Ray \"We have a fairly backward audience, unsophisticated audience.\"-Satyajit Ray [https://www.youtube.com/watch?v=UMp7dIGq2eI&t=1s](https://www.youtube.com/watch?v=UMp7dIGq2eI&t=1s) I am not attributing we dont make any good films, we do make but its a humongous tragedy we had such a headstart and we fell of.. The Indian Fillm Industry has enjoyed one of the most passionate incredible directors which dared to take risk wherever can As i close this post, I still waiting for any movies to replace possibly the most favourite movie of mine Anand and Guide What are your favourite classical movies? Lets discuss it in comments",
    "light_cleaned_comments": "And don't forget Shyam Benegal who portrayed complex thinking and societies very well. His movies like Kondura/Anugraham(religious beliefs ), Manthan (Based on Gujurat Milk Cooperative society) are one of a kind. Telugu (my home lang) had great movies. In Mayabazaar , the techniques used in showing moonlight was first in kind in the world. In the movies like Maa Bhoomi (meaning our Land in Telugu) had shown a scene in which an upper caste married woman sexually harasses a young man how works in their house. He is low caste and scared of consequnces. The director did not hesitate to give away the name of the caste . I can't imagine those things happening now without outrage . Yes, looking into movies of Hollywood of the same period, I was quite surprised their quality of movie making was not as good as our's . Yess so agreee.. I was only talking about indian films but i agree so much Whatever I mentioned were Indian movies only. Probably, you meant Hindi movies? Yes sorry I edited ... The comment:) Except for white people and leftists, nobody is interested in poverty porn. My grandmother (not a leftist, a woman who grew up working farmland) cried when she watched satyajit ray’s movies with me many years ago. Many people don’t see “poverty” in those parallel cinema flicks, but an accurate picture of how people used to (or still) live. The life experiences your grandmother had is way different than what today's generation experiences. Human tragedy and communistic films are out of fashion. Also they are not commercially viable. It's a niche and will stay that way. After the ‘50s and ‘60s, Indian alternative cinema moved on to talking about the urban middle classes. Satyajit Ray has his Calcutta trilogy and Basu Chatterjee made his beloved comedies about Bombay (Piya ka Ghar, Chhoti si Baat), for example. Your suggestion that alternative cinema only talks about poverty, tragedy or village life is incorrect. Ray himself directed a great many comedies. Satyajit Ray's films were not for the common person. They were for intellectual and ivory tower elitists. Hence he got such recognition in the West. Every decade has been a healthy mix of art and commercial cinema. There are plenty of great indie films with contemporary social issues that have done great artistically and socially. People should admire 'Sairat' more - a contemporary issue, directed by a Dalit that has done great in all facets than a UC elitist who did not respect the common Indian viewer. Who likes to watch poverty porn? Only rich people and smug foreigners . Tell me you're illiterate without telling me you're illiterate. Nobody’s interested in your poor ass either. So gtfo and go back to living your pathetic life You are correct There is a reason why Karan Johar type movies are so popular. The world travelling rich elites surrounded by luxuries but troubled in personal relationships for some reason is what the Hindi speaking cow belt connects quite well with. No counterpoint then just shut up You're babbling like an illiterate. Case in point, your claim that his works are for ivory tower elitists. Nothing could be further from the truth. It is clear that you have neither seen his films nor are you aware that many of them were adaptations of works by popular Bengali authors."
}