{
    "id": "14uw21p",
    "title": "My father rescued this injured bird from crows and put it in our balcony. What can I do to help it?",
    "url": "https://www.reddit.com/gallery/14uw21p",
    "selftext": "My father placed it in our balcony without telling me and left the house. I just found it being attacked by crows and shooed them away. The bird can't fly and is really skittish and afraid of me. \n\nWhat can I do to help it and make sure it takes flight soon. I can't spend the entire day sitting at the balcony and keeping guard. I can't put it inside the house either, since it's really skittish and I'm afraid it might claw me or something. \n\nAlso, what kind of a bird is this?",
    "flair": "AskIndia",
    "score": 371,
    "num_comments": 58,
    "created_utc": 1688901452.0,
    "convurl": "https://i.redd.it/j8vhq284bxab1.jpg",
    "comments": [
        "That's an Asian koel, could be a female or a fledgling, females usually lay their eggs in the crows nest, maybe that's what that fight with the crows was about. if it is already sheltered, just let it be for a few hours, it may recover from the shock and fly away.",
        "It's been in my open balcony from the morning. It still can't fly. Honestly, I don't want to end up as collateral damage in a gang war. \n\nI don't wanna leave it in the balcony, in case the crows show up again.",
        "I noticed you are in Chennai. When i came across an injured bird a few years ago, Dr Ranjit Daniels was of great help, dm me if you would like to contact him.",
        "'Collateral damage in a gang war'\n🤣🤣🤣",
        "Look up how koel (cuckoo) eggs are laid and what the chicks do. They are parasites. While it isn't really the individual koels fault, don't blame the crowd either.\nIf you want, take it to a vet. It probably eats fruit and will drink water. They can be very loud when calling.",
        "Chicken tadka",
        "It is asian koel. If it is baby try feeding him worms or fruits(papaya).\nThis happen with me too.. i feed him for 4 days but unfortunately he died. He was injured.",
        "Talk to her and see if she needs help or any weapons for gang war. Help her out OP.",
        "Get him some food and water, maybe he can eat and gain some strength to recover and fly away?",
        "op, check the bird for any injuries; wings, breast area etc. if it looks fine, it's probably in shock. feed it some warm honey water, take a dropper and drop the honey water on it the tip of its upper beak, the water will flow into it mouth,  its hard but you'll get the trick. \n\n you have to put it in a small box and cover it with a light cloth, make some hole on the box to be extra. leave it like that for 12 hours, birds usually get better with this method if they aren't hurt too bad. Good luck friend",
        "Isko bolo sudhar jaye apna anda Crow k nest me na rakhe nahi to aise hi mar khata rhega.\n\nEdit: *Khati rhegi. Sorry Koyal for misidentifying your pronouns. (Koyal;She/Her) 😝",
        "Female cuckoo.",
        "Help yourself to something exotic.",
        "The Crowfather is not happy. He wants her to build her own damn nest to lay her eggs, or pay rent😤",
        "Make sure you sprinkle some water on its head and body. Let her cool down a little. Don't drench her though... It's the monsoons so u don't want her catching a cold.\n\nLeave some pieces of bread soaked in a little milk if possible. Doubt she will eat but just in case. Also keep some water nearby.\n\nShe will fly away when she feels better.",
        "Where to sign up to join the gang war?",
        "Bole jo koel",
        "Give some full grain, grams as food.",
        "eat it. free it from its pain.",
        "He's probably just joking but crows are no joke. They will remember your face and target you if you get on their wrong side. Even worse, they'll pass this info to other crows and to their offspring. You could suffer for years from bird poop attacks and divebombs 💀",
        "Chad father",
        "Female cuckoo ig",
        "leave it alone",
        "Chances of ‘murder’ are quite high.",
        "Give it some water in a shallow bowl and some cut fruits. It should recover soon enough. Place a chair over it and cover the chair with a light sheet to keep it out of sight of the crows. Leave one side open for light and air flow. When your dad gets home, he can decide what to do with it.",
        "you could do so by poking your nearest hornet nest or honey bee whichever is nearer",
        "Ye nahi bolti.. iska piya bolta hai..",
        "Khaati..\n\nFemale hai..",
        "This is true to some extent.",
        "It's a female",
        "Avlo Dil illa bro. Small time nu vachukonga 🫣",
        "Looks like a koel. You should  feed and then train train it for a few days to walk. Once it looks good they can fly. Not an expert advice as I didn't own or take care of any bird (injured or not) but I watched videos from yt like A chick called Albert so I do know a little.",
        "koel butter masala",
        "Cook it and eat",
        "Just from personal experience don't bring a ahole uncle( mama) in your home. Same situation i think it was pigeon i went to school next day came home. We had chicken but it wasn't chicken. \n\nNow back to the situation you can make a platform at high place enough and some pillow feather or better a small plastic box put some warm cloth in there .",
        "kannada nhi aati bro english ya hindi pls",
        "Give food and water he will recover in some days and fly again, had a kingfisher years ago in the same scenario",
        "Give it insects eat, if any. They’re usually in shock, they need some warmth. Lay out some cloth in the shape of a nest. Call animal helpline of your area, number can be found on the internet.",
        " Never give an injured  bird water or food ,that’s not a good practice . The best thing to do is place the bird in a dark and warm environment. Don’t disturb it, after a few hours the bird will regain its strength .",
        "Hi, see if you can someone from the forest department to pick it up. Birds are very cute to look after but they also have a lot of disease causing viruses and bacteria. Any flying bird or animal(bats) are biologically susceptible to carrying deadly viruses.\n\nSo better to work with a veterinarian or forest department to find it a home.",
        "iirc a dude removed a crow's dead body and the whole crow family terrorised him for a long time because apparently there was a period of \"mourning\" the dead crow which the he had unknowingly interrupted.",
        "First things first. Exorcism.",
        "Hardly seems fair if you didn’t know the custom.",
        "Try https://www.raww.in",
        "You can offer her a small piece of ripened papaya or guava and a cup of water.",
        "Where are you from? In Delhi there's a charitable bird hospital behind the Chandini Chowk Jain Temple which takes in injured birds for rehabilitation. I've dropped a baby crow off there which was injured by a kite string.\n\nThere are also bird hospitals run by Jains in Bangalore and Mumbai that I've read about - the community seems to have an affinity for birds. Google and check if there's one in your city.",
        "Piya more kuch bol tu, Piya more kuch bol tu,\nMore sang zara jhoom tu, more sang zara jhum tu,\nMore manwa ke tu hai tarsawat kahe?\nMori ankhiyan ke tu hai rulawat kahe?\nPiya more kuch bol tu, piya more kuch bol tu.\n\nSun sun sun, dil ki dhun, dhun hai pukarat tohe,\nPiya more mohe choom tu, Piya more mohe choom tu,\nMain hi baithi asiya mein teri, aas na meri yunhi tod tu,\nBarsha aayi re, tohe khatir piya, more piya mohe choom tu,\nSang mere dharti pe jhoom tu...\n\nPiya more mohe pukaar tu, apne hathwa se mohe dulaar tu,\nPiya more mohe choom tu, piya more mohe choom tu.\n\nHu bulawat tohe saanjh se,hui subah, ab toh awaaz de\nAisa piya kaisa piya aisa piya kaisa piya,hai tarsawat Mira jiya,\nMore piya na mujhse khel tu, more dilwa se na khel tu.\n\nDekh mohe, main hoon taiyar re, aaja leja  apne dwar re,\nHoon main baithi intezaar mein, aaja leja apne dwar re.\n\nAaja piya  raatiya na kaati jaye,\naaja piya mohe choom tu,\nMore piya mohe choom tu,\nSang mere dharti pe jhoom tu.\n\nPiya more kuch bol tu, hoon main roothi zara sa bol tu,\nHasi meri teri khushi hai, aansoon mere tere aansoon hai,\nMore piya aakar bol tu, pyaar hai na, dobara bol tu,\nMore piya mohe choom tu, more piya mohe choom tu.",
        "This is a song I wrote from the point of view of the koyal.\n\nDo let me know if you liked it or not!",
        "It is a song based on what koel feels.",
        "Aapke liye maine bulwa diya koel se.",
        "It's a good one. But in reality, male koyal is the one who sings. Female koyal doesn't sing.",
        "Thank you.\n\nAnd yes she doesn't sing. She waits.\n\nI never said she does. I have expressed her feelings in words.",
        "\"What's this you're sending me?\"\n\n\"Equipment list.\"\n\n\"That's a lot of hardware, John. What do you plan on doing?\"\n\n\"What you taught me to do. Kill em all.\"",
        "Please don't assume what it identifies as. Sex does not equal to gender.\n\n/s",
        "Back bencher's final exam sheet be like:",
        "🤣",
        "But it has been used synonymously 🤔",
        "That's Cuckoo my god. I hope it gets well soon."
    ],
    "cleaned_text": "father rescued injured bird crows put balcony help father placed balcony without telling left house found attacked crows shooed away bird cant fly really skittish afraid help make sure takes flight soon cant spend entire day sitting balcony keeping guard cant put inside house either since really skittish im afraid might claw something also kind bird ",
    "cleaned_title": "father rescued injured bird crows put balcony help",
    "cleaned_selftext": "father placed balcony without telling left house found attacked crows shooed away bird cant fly really skittish afraid help make sure takes flight soon cant spend entire day sitting balcony keeping guard cant put inside house either since really skittish im afraid might claw something also kind bird",
    "cleaned_comments": "thats asian koel could female fledgling females usually lay eggs crows nest maybe thats fight crows already sheltered let hours may recover shock fly away open balcony morning still cant fly honestly dont want end collateral damage gang war dont wan na leave balcony case crows show noticed chennai came across injured bird years ago dr ranjit daniels great help dm would like contact collateral damage gang war look koel cuckoo eggs laid chicks parasites isnt really individual koels fault dont blame crowd either want take vet probably eats fruit drink water loud calling chicken tadka asian koel baby try feeding worms fruitspapaya happen feed days unfortunately died injured talk see needs help weapons gang war help op get food water maybe eat gain strength recover fly away op check bird injuries wings breast area etc looks fine probably shock feed warm honey water take dropper drop honey water tip upper beak water flow mouth hard youll get trick put small box cover light cloth make hole box extra leave like hours birds usually get better method arent hurt bad good luck friend isko bolo sudhar jaye apna anda crow k nest na rakhe nahi aise hi mar khata rhega edit khati rhegi sorry koyal misidentifying pronouns koyalsheher female cuckoo help something exotic crowfather happy wants build damn nest lay eggs pay rent make sure sprinkle water head body let cool little dont drench though monsoons u dont want catching cold leave pieces bread soaked little milk possible doubt eat case also keep water nearby fly away feels better sign join gang war bole jo koel give full grain grams food eat free pain hes probably joking crows joke remember face target get wrong side even worse theyll pass info crows offspring could suffer years bird poop attacks divebombs chad father female cuckoo ig leave alone chances murder quite high give water shallow bowl cut fruits recover soon enough place chair cover chair light sheet keep sight crows leave one side open light air flow dad gets home decide could poking nearest hornet nest honey bee whichever nearer ye nahi bolti iska piya bolta hai khaati female hai true extent female avlo dil illa bro small time nu vachukonga looks like koel feed train train days walk looks good fly expert advice didnt take care bird injured watched videos yt like chick called albert know little koel butter masala cook eat personal experience dont bring ahole uncle mama home situation think pigeon went school next day came home chicken wasnt chicken back situation make platform high place enough pillow feather better small plastic box put warm cloth kannada nhi aati bro english ya hindi pls give food water recover days fly kingfisher years ago scenario give insects eat theyre usually shock need warmth lay cloth shape nest call animal helpline area number found internet never give injured bird water food thats good practice best thing place bird dark warm environment dont disturb hours bird regain strength hi see someone forest department pick birds cute look also lot disease causing viruses bacteria flying bird animalbats biologically susceptible carrying deadly viruses better work veterinarian forest department find home iirc dude removed crows dead body whole crow family terrorised long time apparently period mourning dead crow unknowingly interrupted first things first exorcism hardly seems fair didnt know custom try offer small piece ripened papaya guava cup water delhi theres charitable bird hospital behind chandini chowk jain temple takes injured birds rehabilitation ive dropped baby crow injured kite string also bird hospitals run jains bangalore mumbai ive read community seems affinity birds google check theres one city piya kuch bol tu piya kuch bol tu sang zara jhoom tu sang zara jhum tu manwa ke tu hai tarsawat kahe mori ankhiyan ke tu hai rulawat kahe piya kuch bol tu piya kuch bol tu sun sun sun dil ki dhun dhun hai pukarat tohe piya mohe choom tu piya mohe choom tu main hi baithi asiya mein teri aas na meri yunhi tod tu barsha aayi tohe khatir piya piya mohe choom tu sang mere dharti pe jhoom tu piya mohe pukaar tu apne hathwa se mohe dulaar tu piya mohe choom tu piya mohe choom tu hu bulawat tohe saanjh sehui subah ab toh awaaz de aisa piya kaisa piya aisa piya kaisa piyahai tarsawat mira jiya piya na mujhse khel tu dilwa se na khel tu dekh mohe main hoon taiyar aaja leja apne dwar hoon main baithi intezaar mein aaja leja apne dwar aaja piya raatiya na kaati jaye aaja piya mohe choom tu piya mohe choom tu sang mere dharti pe jhoom tu piya kuch bol tu hoon main roothi zara sa bol tu hasi meri teri khushi hai aansoon mere tere aansoon hai piya aakar bol tu pyaar hai na dobara bol tu piya mohe choom tu piya mohe choom tu song wrote point view koyal let know liked song based koel feels aapke liye maine bulwa diya koel se good one reality male koyal one sings female koyal doesnt sing thank yes doesnt sing waits never said expressed feelings words whats youre sending equipment list thats lot hardware john plan taught kill em please dont assume identifies sex equal gender back benchers final exam sheet like used synonymously thats cuckoo god hope gets well soon",
    "light_cleaned_title": "My father rescued this injured bird from crows and put it in our balcony. What can I do to help it?",
    "light_cleaned_selftext": "My father placed it in our balcony without telling me and left the house. I just found it being attacked by crows and shooed them away. The bird can't fly and is really skittish and afraid of me. What can I do to help it and make sure it takes flight soon. I can't spend the entire day sitting at the balcony and keeping guard. I can't put it inside the house either, since it's really skittish and I'm afraid it might claw me or something. Also, what kind of a bird is this?",
    "light_cleaned_comments": "That's an Asian koel, could be a female or a fledgling, females usually lay their eggs in the crows nest, maybe that's what that fight with the crows was about. if it is already sheltered, just let it be for a few hours, it may recover from the shock and fly away. It's been in my open balcony from the morning. It still can't fly. Honestly, I don't want to end up as collateral damage in a gang war. I don't wanna leave it in the balcony, in case the crows show up again. I noticed you are in Chennai. When i came across an injured bird a few years ago, Dr Ranjit Daniels was of great help, dm me if you would like to contact him. 'Collateral damage in a gang war' 🤣🤣🤣 Look up how koel (cuckoo) eggs are laid and what the chicks do. They are parasites. While it isn't really the individual koels fault, don't blame the crowd either. If you want, take it to a vet. It probably eats fruit and will drink water. They can be very loud when calling. Chicken tadka It is asian koel. If it is baby try feeding him worms or fruits(papaya). This happen with me too.. i feed him for 4 days but unfortunately he died. He was injured. Talk to her and see if she needs help or any weapons for gang war. Help her out OP. Get him some food and water, maybe he can eat and gain some strength to recover and fly away? op, check the bird for any injuries; wings, breast area etc. if it looks fine, it's probably in shock. feed it some warm honey water, take a dropper and drop the honey water on it the tip of its upper beak, the water will flow into it mouth, its hard but you'll get the trick. you have to put it in a small box and cover it with a light cloth, make some hole on the box to be extra. leave it like that for 12 hours, birds usually get better with this method if they aren't hurt too bad. Good luck friend Isko bolo sudhar jaye apna anda Crow k nest me na rakhe nahi to aise hi mar khata rhega. Edit: *Khati rhegi. Sorry Koyal for misidentifying your pronouns. (Koyal;She/Her) 😝 Female cuckoo. Help yourself to something exotic. The Crowfather is not happy. He wants her to build her own damn nest to lay her eggs, or pay rent😤 Make sure you sprinkle some water on its head and body. Let her cool down a little. Don't drench her though... It's the monsoons so u don't want her catching a cold. Leave some pieces of bread soaked in a little milk if possible. Doubt she will eat but just in case. Also keep some water nearby. She will fly away when she feels better. Where to sign up to join the gang war? Bole jo koel Give some full grain, grams as food. eat it. free it from its pain. He's probably just joking but crows are no joke. They will remember your face and target you if you get on their wrong side. Even worse, they'll pass this info to other crows and to their offspring. You could suffer for years from bird poop attacks and divebombs 💀 Chad father Female cuckoo ig leave it alone Chances of ‘murder’ are quite high. Give it some water in a shallow bowl and some cut fruits. It should recover soon enough. Place a chair over it and cover the chair with a light sheet to keep it out of sight of the crows. Leave one side open for light and air flow. When your dad gets home, he can decide what to do with it. you could do so by poking your nearest hornet nest or honey bee whichever is nearer Ye nahi bolti.. iska piya bolta hai.. Khaati.. Female hai.. This is true to some extent. It's a female Avlo Dil illa bro. Small time nu vachukonga 🫣 Looks like a koel. You should feed and then train train it for a few days to walk. Once it looks good they can fly. Not an expert advice as I didn't own or take care of any bird (injured or not) but I watched videos from yt like A chick called Albert so I do know a little. koel butter masala Cook it and eat Just from personal experience don't bring a ahole uncle( mama) in your home. Same situation i think it was pigeon i went to school next day came home. We had chicken but it wasn't chicken. Now back to the situation you can make a platform at high place enough and some pillow feather or better a small plastic box put some warm cloth in there . kannada nhi aati bro english ya hindi pls Give food and water he will recover in some days and fly again, had a kingfisher years ago in the same scenario Give it insects eat, if any. They’re usually in shock, they need some warmth. Lay out some cloth in the shape of a nest. Call animal helpline of your area, number can be found on the internet. Never give an injured bird water or food ,that’s not a good practice . The best thing to do is place the bird in a dark and warm environment. Don’t disturb it, after a few hours the bird will regain its strength . Hi, see if you can someone from the forest department to pick it up. Birds are very cute to look after but they also have a lot of disease causing viruses and bacteria. Any flying bird or animal(bats) are biologically susceptible to carrying deadly viruses. So better to work with a veterinarian or forest department to find it a home. iirc a dude removed a crow's dead body and the whole crow family terrorised him for a long time because apparently there was a period of \"mourning\" the dead crow which the he had unknowingly interrupted. First things first. Exorcism. Hardly seems fair if you didn’t know the custom. Try You can offer her a small piece of ripened papaya or guava and a cup of water. Where are you from? In Delhi there's a charitable bird hospital behind the Chandini Chowk Jain Temple which takes in injured birds for rehabilitation. I've dropped a baby crow off there which was injured by a kite string. There are also bird hospitals run by Jains in Bangalore and Mumbai that I've read about - the community seems to have an affinity for birds. Google and check if there's one in your city. Piya more kuch bol tu, Piya more kuch bol tu, More sang zara jhoom tu, more sang zara jhum tu, More manwa ke tu hai tarsawat kahe? Mori ankhiyan ke tu hai rulawat kahe? Piya more kuch bol tu, piya more kuch bol tu. Sun sun sun, dil ki dhun, dhun hai pukarat tohe, Piya more mohe choom tu, Piya more mohe choom tu, Main hi baithi asiya mein teri, aas na meri yunhi tod tu, Barsha aayi re, tohe khatir piya, more piya mohe choom tu, Sang mere dharti pe jhoom tu... Piya more mohe pukaar tu, apne hathwa se mohe dulaar tu, Piya more mohe choom tu, piya more mohe choom tu. Hu bulawat tohe saanjh se,hui subah, ab toh awaaz de Aisa piya kaisa piya aisa piya kaisa piya,hai tarsawat Mira jiya, More piya na mujhse khel tu, more dilwa se na khel tu. Dekh mohe, main hoon taiyar re, aaja leja apne dwar re, Hoon main baithi intezaar mein, aaja leja apne dwar re. Aaja piya raatiya na kaati jaye, aaja piya mohe choom tu, More piya mohe choom tu, Sang mere dharti pe jhoom tu. Piya more kuch bol tu, hoon main roothi zara sa bol tu, Hasi meri teri khushi hai, aansoon mere tere aansoon hai, More piya aakar bol tu, pyaar hai na, dobara bol tu, More piya mohe choom tu, more piya mohe choom tu. This is a song I wrote from the point of view of the koyal. Do let me know if you liked it or not! It is a song based on what koel feels. Aapke liye maine bulwa diya koel se. It's a good one. But in reality, male koyal is the one who sings. Female koyal doesn't sing. Thank you. And yes she doesn't sing. She waits. I never said she does. I have expressed her feelings in words. \"What's this you're sending me?\" \"Equipment list.\" \"That's a lot of hardware, John. What do you plan on doing?\" \"What you taught me to do. Kill em all.\" Please don't assume what it identifies as. Sex does not equal to gender. /s Back bencher's final exam sheet be like: 🤣 But it has been used synonymously 🤔 That's Cuckoo my god. I hope it gets well soon."
}