{
    "id": "13vf5jr",
    "title": "Which current generation leaders do you consider capable of leading India in coming decades?",
    "url": "https://www.reddit.com/r/india/comments/13vf5jr/which_current_generation_leaders_do_you_consider/",
    "selftext": " [China Built a Hypersonic Generator That Could Power Unimaginable Weapons (msn.com)](https://www.msn.com/en-us/news/technology/china-built-a-hypersonic-generator-that-could-power-unimaginable-weapons/ar-AA17b6so?rc=1&ocid=winp1taskbar&cvid=a7cee5fabbcf41d5df10b0cf80d73e61&ei=34) \n\nAmazing advancements in China in past 20 years, in terms of infrastructure, technology etc., with their current footprint in the name of OBOR , unarguably the most influential nation, in current times. India too advanced in last 20 years, thanks to the great leaders & thinkers, in Vajpayee, Manmohan and  Modi's regime. however, there is a huge gap to fill, and a lot needs to be done, What strategies can India employ to bridge the development gap with China? Putting politics aside, which current generation leaders do you consider capable of leading India in the coming decades?",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 3,
    "created_utc": 1685417138.0,
    "convurl": "https://external-preview.redd.it/7QmK06hqpZJPRdPXSLHnGA984CVvo3hDBCt0mSbigQg.jpg?auto=webp&v=enabled&s=edae89edf83b54c6ef7ce9db0ad535f9a454726c",
    "comments": [
        "Myself. 😜🤣"
    ],
    "cleaned_text": "current generation leaders consider capable leading india coming decades china built hypersonic generator could power unimaginable weapons msncomhttpswwwmsncomenusnewstechnologychinabuiltahypersonicgeneratorthatcouldpowerunimaginableweaponsaraabsorcocidwinptaskbarcvidaceefabbcfddfbcfdeei amazing advancements china past years terms infrastructure technology etc current footprint name obor unarguably influential nation current times india advanced last years thanks great leaders thinkers vajpayee manmohan modis regime however huge gap fill lot needs done strategies india employ bridge development gap china putting politics aside current generation leaders consider capable leading india coming decades ",
    "cleaned_title": "current generation leaders consider capable leading india coming decades",
    "cleaned_selftext": "china built hypersonic generator could power unimaginable weapons msncomhttpswwwmsncomenusnewstechnologychinabuiltahypersonicgeneratorthatcouldpowerunimaginableweaponsaraabsorcocidwinptaskbarcvidaceefabbcfddfbcfdeei amazing advancements china past years terms infrastructure technology etc current footprint name obor unarguably influential nation current times india advanced last years thanks great leaders thinkers vajpayee manmohan modis regime however huge gap fill lot needs done strategies india employ bridge development gap china putting politics aside current generation leaders consider capable leading india coming decades",
    "cleaned_comments": "",
    "light_cleaned_title": "Which current generation leaders do you consider capable of leading India in coming decades?",
    "light_cleaned_selftext": "[China Built a Hypersonic Generator That Could Power Unimaginable Weapons (msn.com)](https://www.msn.com/en-us/news/technology/china-built-a-hypersonic-generator-that-could-power-unimaginable-weapons/ar-AA17b6so?rc=1&ocid=winp1taskbar&cvid=a7cee5fabbcf41d5df10b0cf80d73e61&ei=34) Amazing advancements in China in past 20 years, in terms of infrastructure, technology etc., with their current footprint in the name of OBOR , unarguably the most influential nation, in current times. India too advanced in last 20 years, thanks to the great leaders & thinkers, in Vajpayee, Manmohan and Modi's regime. however, there is a huge gap to fill, and a lot needs to be done, What strategies can India employ to bridge the development gap with China? Putting politics aside, which current generation leaders do you consider capable of leading India in the coming decades?",
    "light_cleaned_comments": "Myself. 😜🤣"
}