{
    "id": "1brytsu",
    "title": "Shitty service by Amazon",
    "url": "https://www.reddit.com/gallery/1brytsu",
    "selftext": "I am from Thane, and me delivery was supposed to come yesterday (30th March) last by 10pm. \n\nGot in contact with an agent said will come by 10, didn't come by 10.\n\nSo I started the chat with Amazon customer service again and they literally transferred me with 10 different agents. (Have attached ss)\n\nAnd then when I called them, they said it will come on 31st March. Then I asked for monetory compensation and they refused.\n\nWtf is this unprofessional shitty service from a multi-billion dollar company.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1711850087.0,
    "convurl": "https://i.redd.it/l7t5r6i6tkrc1.png",
    "comments": [
        "So sorry to hear that you had a poor delivery experience.\n\n\nWe don't give a shit.",
        "Ngl the beginning of your message looked like any of these amazon customer service automated messages, thank you for writing something else",
        "Kis date ko order kiya?\n1-2 din delivery date shift hona bohot normal hai.\n\n\nThoda aur pehle mangwa lete 🤷",
        "Kyu hai normal? Multi-billion dollar company hai, problem hum mai hai, we get used to it very fast. \n26th ko order Kiya 30th ko ana tha. \nAlso mere sath pehli baar hora hai",
        "Akele tera order hi thodi hai...crores of orders are delivered every day in India.\n\n\nBohot sare factors hote hain.\n\n\nKuch orders ka late hona laazmi hai! 🤷",
        "Chalo thik hai late hua, \nBut mera post was on shitty customer service. 10 agents ko you will be transferred and they are blatantly lying. Not fair!",
        "Haan ye toh galat hai...seedha bata dete 31st ko aayega!\n\n\nGol gol kyu ghumana?! 🙂",
        "What did you order?",
        "Home theatre system",
        "Multi billion dollar company hum jaise log hi chala rahe  hain. Unki bhi apni mushkile ho sakti hai. Item collection, verification, packaging, transport, tracking, sorting, delivery... Logistics me kitne issue hota hai kuch idea hai?\n\nYou didn't planned well in advance and now blaming amazon for ruining your day. Itna important din tha to why were you dependent on others?",
        "Dont plan to give gifts around the delivery timelines of a service that you have no control over.   \n  \nIt is 100% Amazon's fault here, their size and multimillion dollar value doesnt change anything.  \nIt is also 100% your fault here for planning the birthday gift delivery just around the bday. Thats a risky proposition.   \n  \nI did this 3-4 times got into the same problem and then stopped. I finally started getting items delivered way before  the event date. Gives time to assess manufacturing defects,etc",
        "Capitalism leke jayega ham sabko. Mujhe downvote karne se Jeff Bezos gareeb nai ho jayega.",
        "It's really not my fault, late aya vo problem nai hai mera. The way they are treating is my problem, smaller firms would",
        "Again you are missing my point, my rant is not that they are late. My rant is the way they treat consumers."
    ],
    "cleaned_text": "shitty service amazon thane delivery supposed come yesterday th march last pm got contact agent said come didnt come started chat amazon customer service literally transferred different agents attached ss called said come st march asked monetory compensation refused wtf unprofessional shitty service multibillion dollar company ",
    "cleaned_title": "shitty service amazon",
    "cleaned_selftext": "thane delivery supposed come yesterday th march last pm got contact agent said come didnt come started chat amazon customer service literally transferred different agents attached ss called said come st march asked monetory compensation refused wtf unprofessional shitty service multibillion dollar company",
    "cleaned_comments": "sorry hear poor delivery experience dont give shit ngl beginning message looked like amazon customer service automated messages thank writing something else kis date ko order kiya din delivery date shift hona bohot normal hai thoda aur pehle mangwa lete kyu hai normal multibillion dollar company hai problem hum mai hai get used fast th ko order kiya th ko ana tha also mere sath pehli baar hora hai akele tera order hi thodi haicrores orders delivered every day india bohot sare factors hote hain kuch orders ka late hona laazmi hai chalo thik hai late hua mera post shitty customer service agents ko transferred blatantly lying fair haan ye toh galat haiseedha bata dete st ko aayega gol gol kyu ghumana order home theatre system multi billion dollar company hum jaise log hi chala rahe hain unki bhi apni mushkile ho sakti hai item collection verification packaging transport tracking sorting delivery logistics kitne issue hota hai kuch idea hai didnt planned well advance blaming amazon ruining day itna important din tha dependent others dont plan give gifts around delivery timelines service control amazons fault size multimillion dollar value doesnt change anything also fault planning birthday gift delivery around bday thats risky proposition times got problem stopped finally started getting items delivered way event date gives time assess manufacturing defectsetc capitalism leke jayega ham sabko mujhe downvote karne se jeff bezos gareeb nai ho jayega really fault late aya vo problem nai hai mera way treating problem smaller firms would missing point rant late rant way treat consumers",
    "light_cleaned_title": "Shitty service by Amazon",
    "light_cleaned_selftext": "I am from Thane, and me delivery was supposed to come yesterday (30th March) last by 10pm. Got in contact with an agent said will come by 10, didn't come by 10. So I started the chat with Amazon customer service again and they literally transferred me with 10 different agents. (Have attached ss) And then when I called them, they said it will come on 31st March. Then I asked for monetory compensation and they refused. Wtf is this unprofessional shitty service from a multi-billion dollar company.",
    "light_cleaned_comments": "So sorry to hear that you had a poor delivery experience. We don't give a shit. Ngl the beginning of your message looked like any of these amazon customer service automated messages, thank you for writing something else Kis date ko order kiya? 1-2 din delivery date shift hona bohot normal hai. Thoda aur pehle mangwa lete 🤷 Kyu hai normal? Multi-billion dollar company hai, problem hum mai hai, we get used to it very fast. 26th ko order Kiya 30th ko ana tha. Also mere sath pehli baar hora hai Akele tera order hi thodi hai...crores of orders are delivered every day in India. Bohot sare factors hote hain. Kuch orders ka late hona laazmi hai! 🤷 Chalo thik hai late hua, But mera post was on shitty customer service. 10 agents ko you will be transferred and they are blatantly lying. Not fair! Haan ye toh galat hai...seedha bata dete 31st ko aayega! Gol gol kyu ghumana?! 🙂 What did you order? Home theatre system Multi billion dollar company hum jaise log hi chala rahe hain. Unki bhi apni mushkile ho sakti hai. Item collection, verification, packaging, transport, tracking, sorting, delivery... Logistics me kitne issue hota hai kuch idea hai? You didn't planned well in advance and now blaming amazon for ruining your day. Itna important din tha to why were you dependent on others? Dont plan to give gifts around the delivery timelines of a service that you have no control over. It is 100% Amazon's fault here, their size and multimillion dollar value doesnt change anything. It is also 100% your fault here for planning the birthday gift delivery just around the bday. Thats a risky proposition. I did this 3-4 times got into the same problem and then stopped. I finally started getting items delivered way before the event date. Gives time to assess manufacturing defects,etc Capitalism leke jayega ham sabko. Mujhe downvote karne se Jeff Bezos gareeb nai ho jayega. It's really not my fault, late aya vo problem nai hai mera. The way they are treating is my problem, smaller firms would Again you are missing my point, my rant is not that they are late. My rant is the way they treat consumers."
}