{
    "id": "14d35ov",
    "title": "The Manipur conflict is now spilling into Assam and Mizoram. Where is the PM?",
    "url": "https://i.redd.it/lj74c8h58w6b1.jpg",
    "selftext": "https://www.indiatodayne.in/mizoram/story/manipuri-youths-association-declares-indefinite-economic-blockade-on-nh-54-connecting-assam-to-mizoram-600392-2023-06-18",
    "flair": "Politics",
    "score": 98,
    "num_comments": 12,
    "created_utc": 1687144954.0,
    "convurl": "https://i.redd.it/lj74c8h58w6b1.jpg",
    "comments": [
        "15-16 loksabha seats across 3 states are chillar for them. NRIs matter coz electoral bonds, RIs are just redundant matter.",
        "He 's travelling, Unuted States of Amrika need vishwa guru to tell them what a shithole India was before he came to save them all.",
        "As if \"PM CARES \" ,  he's out doing his favourite thing ..appeasing  NRI   bhakts",
        "Who tf are allowing them to do so as they please in other states! That's just blatant terrorism now!",
        "They voted for this.\n\nschadenfreude is the emotion I'm feeling.",
        "Gaand mara rahe hain, Amerikka me..."
    ],
    "cleaned_text": "manipur conflict spilling assam mizoram pm  ",
    "cleaned_title": "manipur conflict spilling assam mizoram pm",
    "cleaned_selftext": "",
    "cleaned_comments": "loksabha seats across states chillar nris matter coz electoral bonds ris redundant matter travelling unuted states amrika need vishwa guru tell shithole india came save pm cares hes favourite thing appeasing nri bhakts tf allowing please states thats blatant terrorism voted schadenfreude emotion im feeling gaand mara rahe hain amerikka",
    "light_cleaned_title": "The Manipur conflict is now spilling into Assam and Mizoram. Where is the PM?",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "15-16 loksabha seats across 3 states are chillar for them. NRIs matter coz electoral bonds, RIs are just redundant matter. He 's travelling, Unuted States of Amrika need vishwa guru to tell them what a shithole India was before he came to save them all. As if \"PM CARES \" , he's out doing his favourite thing ..appeasing NRI bhakts Who tf are allowing them to do so as they please in other states! That's just blatant terrorism now! They voted for this. schadenfreude is the emotion I'm feeling. Gaand mara rahe hain, Amerikka me..."
}