{
    "id": "16707ni",
    "title": "An actual tweet from BJPs official Twitter Handle",
    "url": "https://i.redd.it/5rc7dik1illb1.jpg",
    "selftext": "Source: https://twitter.com/BJP4India/status/1696837946660516268",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693552825.0,
    "convurl": "https://i.redd.it/5rc7dik1illb1.jpg",
    "comments": [
        "This is true. In 2014, the price of cylinder for which consumer get was approx 400 which ws subsidized rate. Remember the subsidies may not be directly but indirectly borne by consumers only. BJP selling it at the cost of MRP isn't wrong imo. But also I vouch of removal of all subsidies including the corporate subsidies in form of schemes like PLIs.",
        "I know subsidies are paid by tax money. Still, these essential commodities and services such as domestic LPG, Petrol, Diesel, train fare, etc should be subsidized especially when people are struggling to meet their household's expenditures. Moreover, this tweet shows hypocrisy of BJP leaders who used to criticize and took protest against the rising prises of essential commodities while they all are being silent now despite record breaking fuels prises.",
        "If it is market price comparison then what is the role of BJP in reducing the price of LPG?",
        "Men lives matter",
        "Despite lower crude oil prices in international markets, govt is charging so much compared to Congress rule before 2014 when crude oil was expansive.[link](https://tradingeconomics.com/commodity/crude-oil)",
        "What?",
        "Complete bullshit.. It was never more than 1000 back in 2014.",
        "Not really.",
        "May 1, 2014 : **928/-** \n\nMarch 1, 2023 : **1103/-**\n\nAugust 30, 2023 : **903/-**\n\n**Acche Din ! until elections.**",
        "Well of course they rely on the weak memory of their bhakts.",
        "When they can get all the information in one click of WhatsApp then why bother to Google anything.",
        "That was MRP (or whatever they call it), there was subsidy then, which made it way cheaper.",
        "Well according to IMF we already have the fourth highest subsidies on fuel and on your comment that people are struggling to meet their meet is bc of market intervention. The market shouldn't be interfered and gov interfering the market will create ruckus for everyone. \n\nPlus a politican are hypocrite by default bc we need to impossible from them, and which they're best at selling- impossible.",
        "Bc its not still a free market and bc is not reducing their tax part of it, which is nominal but paying that extra 200. Now, since we're already running a high fiscal deficit this may be by printing more currency which will add to more inflation.",
        "Non subsidised were. People have uploaded their gas receipts",
        "There was also a subsidy.",
        "It is not easy to move a giant elephant like India.",
        "This is actually a big achievement of memory loss 🫢 🥲",
        "Market deciding price making it good is utter bullshit. Companies can easily inflate this price and gobble up competition that threatens to hit their profit margins. Just look at the lord of Let Market Decide the Price, US. Nothings is affordable. Everything is inflated. The middle ground is where the true success lies. Let market influence price up to a limit, then subsidize. What has happened in our country is the opposite. Every govt that comes to power first subsidizes prices then lets market decide the rest course.",
        "Tbh US is not a free market according to the standards. Read mises.org blogs on it."
    ],
    "cleaned_text": "actual tweet bjps official twitter handle source ",
    "cleaned_title": "actual tweet bjps official twitter handle",
    "cleaned_selftext": "source",
    "cleaned_comments": "true price cylinder consumer get approx ws subsidized rate remember subsidies may directly indirectly borne consumers bjp selling cost mrp isnt wrong imo also vouch removal subsidies including corporate subsidies form schemes like plis know subsidies paid tax money still essential commodities services domestic lpg petrol diesel train fare etc subsidized especially people struggling meet households expenditures moreover tweet shows hypocrisy bjp leaders used criticize took protest rising prises essential commodities silent despite record breaking fuels prises market price comparison role bjp reducing price lpg men lives matter despite lower crude oil prices international markets govt charging much compared congress rule crude oil expansivelinkhttpstradingeconomicscomcommoditycrudeoil complete bullshit never back really may march august acche din elections well course rely weak memory bhakts get information one click whatsapp bother google anything mrp whatever call subsidy made way cheaper well according imf already fourth highest subsidies fuel comment people struggling meet meet bc market intervention market shouldnt interfered gov interfering market create ruckus everyone plus politican hypocrite default bc need impossible theyre best selling impossible bc still free market bc reducing tax part nominal paying extra since already running high fiscal deficit may printing currency add inflation non subsidised people uploaded gas receipts also subsidy easy move giant elephant like india actually big achievement memory loss market deciding price making good utter bullshit companies easily inflate price gobble competition threatens hit profit margins look lord let market decide price us nothings affordable everything inflated middle ground true success lies let market influence price limit subsidize happened country opposite every govt comes power first subsidizes prices lets market decide rest course tbh us free market according standards read misesorg blogs",
    "light_cleaned_title": "An actual tweet from BJPs official Twitter Handle",
    "light_cleaned_selftext": "Source:",
    "light_cleaned_comments": "This is true. In 2014, the price of cylinder for which consumer get was approx 400 which ws subsidized rate. Remember the subsidies may not be directly but indirectly borne by consumers only. BJP selling it at the cost of MRP isn't wrong imo. But also I vouch of removal of all subsidies including the corporate subsidies in form of schemes like PLIs. I know subsidies are paid by tax money. Still, these essential commodities and services such as domestic LPG, Petrol, Diesel, train fare, etc should be subsidized especially when people are struggling to meet their household's expenditures. Moreover, this tweet shows hypocrisy of BJP leaders who used to criticize and took protest against the rising prises of essential commodities while they all are being silent now despite record breaking fuels prises. If it is market price comparison then what is the role of BJP in reducing the price of LPG? Men lives matter Despite lower crude oil prices in international markets, govt is charging so much compared to Congress rule before 2014 when crude oil was expansive.[link](https://tradingeconomics.com/commodity/crude-oil) What? Complete bullshit.. It was never more than 1000 back in 2014. Not really. May 1, 2014 : **928/-** March 1, 2023 : **1103/-** August 30, 2023 : **903/-** **Acche Din ! until elections.** Well of course they rely on the weak memory of their bhakts. When they can get all the information in one click of WhatsApp then why bother to Google anything. That was MRP (or whatever they call it), there was subsidy then, which made it way cheaper. Well according to IMF we already have the fourth highest subsidies on fuel and on your comment that people are struggling to meet their meet is bc of market intervention. The market shouldn't be interfered and gov interfering the market will create ruckus for everyone. Plus a politican are hypocrite by default bc we need to impossible from them, and which they're best at selling- impossible. Bc its not still a free market and bc is not reducing their tax part of it, which is nominal but paying that extra 200. Now, since we're already running a high fiscal deficit this may be by printing more currency which will add to more inflation. Non subsidised were. People have uploaded their gas receipts There was also a subsidy. It is not easy to move a giant elephant like India. This is actually a big achievement of memory loss 🫢 🥲 Market deciding price making it good is utter bullshit. Companies can easily inflate this price and gobble up competition that threatens to hit their profit margins. Just look at the lord of Let Market Decide the Price, US. Nothings is affordable. Everything is inflated. The middle ground is where the true success lies. Let market influence price up to a limit, then subsidize. What has happened in our country is the opposite. Every govt that comes to power first subsidizes prices then lets market decide the rest course. Tbh US is not a free market according to the standards. Read mises.org blogs on it."
}