{
    "id": "15nzdt2",
    "title": "Gujarat judge who refused Rahul Gandhi stay in defamation case on transfer list with 3 others",
    "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-high-court-judges-transfer-8887069/",
    "selftext": "Good, there are consequences.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 15,
    "created_utc": 1691730320.0,
    "convurl": "https://external-preview.redd.it/9LSfczcjBdNHZLacs35xof6hpUEu7Mlf7U8D5NGlw-Q.jpg?auto=webp&s=e03e10ae760f8a5034dcbac955718c017e201ba6",
    "comments": [
        "Good to see that someone is war the actions of these rogue judges. Transfer is just a light slap on the wrist",
        "Can we transfer him to Kailasa Island?",
        "Laudya bhujam",
        "Him, another who recused from hearing that case and one who recused from hearing setalvad's case. Seems more like shifting to avoid pressure",
        "Should have been sent to manipur",
        "Send him to Sentinel Island",
        "Much better 😄",
        "He should've been removed. What's the point of having retarded judges? They're here to serve justice and they literally do the opposite. It's so easy not to mess it up but they still mess it up. Special breed of retard.",
        "I mentioned it at that time itself - the gujrat trial judge was a disgrace and the high court judge who did not suspend the sentence an even bigger disgrace \n\nSome context, in India all kinds of criminals from white collar to sometimes even attempted murder/even murder cases the sentence gets suspended. For a defamation case the sentence being suspended by high court is the default course of action. Any practicing advocate who knows a thing about how courts work in India will tell you this\n\nHowever gujrat high court also refused to suspend the conviction, for a petty defamation case. It shows how law and order is totally non existent in gujrat if you are against the government. \n\nThat the supreme court, the highest court of the country has to step in and suspend the conviction of a petty defamation case is a mockery of justice and a waste of supreme courts time. \n\nIts only fitting that these judges of gujrat HC who failed in their job upholding the process of law be held accountable. Shameful stuff really",
        "What if he gets transferred to Manipur.",
        "Transfer him to hell. Don’t need no spineless judges.",
        "The whole thing from the PIL to verdict to Lok Sabha suspension was coordinated. That's just how India's institutions are hollowed out right now."
    ],
    "cleaned_text": "gujarat judge refused rahul gandhi stay defamation case transfer list others good consequences ",
    "cleaned_title": "gujarat judge refused rahul gandhi stay defamation case transfer list others",
    "cleaned_selftext": "good consequences",
    "cleaned_comments": "good see someone war actions rogue judges transfer light slap wrist transfer kailasa island laudya bhujam another recused hearing case one recused hearing setalvads case seems like shifting avoid pressure sent manipur send sentinel island much better shouldve removed whats point retarded judges theyre serve justice literally opposite easy mess still mess special breed retard mentioned time gujrat trial judge disgrace high court judge suspend sentence even bigger disgrace context india kinds criminals white collar sometimes even attempted murdereven murder cases sentence gets suspended defamation case sentence suspended high court default course action practicing advocate knows thing courts work india tell however gujrat high court also refused suspend conviction petty defamation case shows law order totally non existent gujrat government supreme court highest court country step suspend conviction petty defamation case mockery justice waste supreme courts time fitting judges gujrat hc failed job upholding process law held accountable shameful stuff really gets transferred manipur transfer hell dont need spineless judges whole thing pil verdict lok sabha suspension coordinated thats indias institutions hollowed right",
    "light_cleaned_title": "Gujarat judge who refused Rahul Gandhi stay in defamation case on transfer list with 3 others",
    "light_cleaned_selftext": "Good, there are consequences.",
    "light_cleaned_comments": "Good to see that someone is war the actions of these rogue judges. Transfer is just a light slap on the wrist Can we transfer him to Kailasa Island? Laudya bhujam Him, another who recused from hearing that case and one who recused from hearing setalvad's case. Seems more like shifting to avoid pressure Should have been sent to manipur Send him to Sentinel Island Much better 😄 He should've been removed. What's the point of having retarded judges? They're here to serve justice and they literally do the opposite. It's so easy not to mess it up but they still mess it up. Special breed of retard. I mentioned it at that time itself - the gujrat trial judge was a disgrace and the high court judge who did not suspend the sentence an even bigger disgrace Some context, in India all kinds of criminals from white collar to sometimes even attempted murder/even murder cases the sentence gets suspended. For a defamation case the sentence being suspended by high court is the default course of action. Any practicing advocate who knows a thing about how courts work in India will tell you this However gujrat high court also refused to suspend the conviction, for a petty defamation case. It shows how law and order is totally non existent in gujrat if you are against the government. That the supreme court, the highest court of the country has to step in and suspend the conviction of a petty defamation case is a mockery of justice and a waste of supreme courts time. Its only fitting that these judges of gujrat HC who failed in their job upholding the process of law be held accountable. Shameful stuff really What if he gets transferred to Manipur. Transfer him to hell. Don’t need no spineless judges. The whole thing from the PIL to verdict to Lok Sabha suspension was coordinated. That's just how India's institutions are hollowed out right now."
}