{
    "id": "1614mht",
    "title": "Can someone file a Lawsuit on a Anonymous Website Owner?",
    "url": "https://www.reddit.com/r/india/comments/1614mht/can_someone_file_a_lawsuit_on_a_anonymous_website/",
    "selftext": "was watching this video: [\"Reality of Indian Media | Nitish Rajput | Hindi\"](https://youtu.be/-0NtDdchl7s).\n\nin which Sir Nitish Talks about \"SLAPP Suit\", these are basically Multiple Lawsuits from different places by a particular group/individual against a Journalist or a News Media, to suppress them from writing any articles against a group/individual or their interest.\n\nso if XYZ Journalist publishes something against the Supreme Leader, his fellow businessmen dogs will file multiple Lawsuits against that Journalist from places usually away from the Journalist, thus making it costly for him to attend the court and not to mention the money spent in hiring lawyer and stuff.\n\nso what if there was a News Site that shared unfiltered news on their website, and the owner/operator of the site was someone Anonymous.\n\nhow would someone file a Lawsuit against that person? or somehow take down that website?\n\nNote: i am talking about a single person operating this website with many journalist submitting their news, and all of this was for free, so no adverts no nothing, just a plain simple website that provides news.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692982371.0,
    "convurl": "https://external-preview.redd.it/vNFazTbYK255l2IEH6X_wr6XF7lhxWfItf0M8RZDoxQ.jpg?auto=webp&s=e7358f83eca4443f2697fbb8792c1b59840afa7f",
    "comments": [
        "Freedom of speech is everyone’s right. Freedom or perception is also everyone’s right.",
        "well i wish that was the case in our country.\n\na big media house can't just criticize the supreme leader, or else no ads, no priority or invitation in interviews or speeches and stuff.",
        "Which also means that they are chamchas and seek morsels from the table"
    ],
    "cleaned_text": "someone file lawsuit anonymous website owner watching video reality indian media nitish rajput hindihttpsyoutubentddchls sir nitish talks slapp suit basically multiple lawsuits different places particular groupindividual journalist news media suppress writing articles groupindividual interest xyz journalist publishes something supreme leader fellow businessmen dogs file multiple lawsuits journalist places usually away journalist thus making costly attend court mention money spent hiring lawyer stuff news site shared unfiltered news website owneroperator site someone anonymous would someone file lawsuit person somehow take website note talking single person operating website many journalist submitting news free adverts nothing plain simple website provides news ",
    "cleaned_title": "someone file lawsuit anonymous website owner",
    "cleaned_selftext": "watching video reality indian media nitish rajput hindihttpsyoutubentddchls sir nitish talks slapp suit basically multiple lawsuits different places particular groupindividual journalist news media suppress writing articles groupindividual interest xyz journalist publishes something supreme leader fellow businessmen dogs file multiple lawsuits journalist places usually away journalist thus making costly attend court mention money spent hiring lawyer stuff news site shared unfiltered news website owneroperator site someone anonymous would someone file lawsuit person somehow take website note talking single person operating website many journalist submitting news free adverts nothing plain simple website provides news",
    "cleaned_comments": "freedom speech everyones right freedom perception also everyones right well wish case country big media house cant criticize supreme leader else ads priority invitation interviews speeches stuff also means chamchas seek morsels table",
    "light_cleaned_title": "Can someone file a Lawsuit on a Anonymous Website Owner?",
    "light_cleaned_selftext": "was watching this video: [\"Reality of Indian Media | Nitish Rajput | Hindi\"](https://youtu.be/-0NtDdchl7s). in which Sir Nitish Talks about \"SLAPP Suit\", these are basically Multiple Lawsuits from different places by a particular group/individual against a Journalist or a News Media, to suppress them from writing any articles against a group/individual or their interest. so if XYZ Journalist publishes something against the Supreme Leader, his fellow businessmen dogs will file multiple Lawsuits against that Journalist from places usually away from the Journalist, thus making it costly for him to attend the court and not to mention the money spent in hiring lawyer and stuff. so what if there was a News Site that shared unfiltered news on their website, and the owner/operator of the site was someone Anonymous. how would someone file a Lawsuit against that person? or somehow take down that website? Note: i am talking about a single person operating this website with many journalist submitting their news, and all of this was for free, so no adverts no nothing, just a plain simple website that provides news.",
    "light_cleaned_comments": "Freedom of speech is everyone’s right. Freedom or perception is also everyone’s right. well i wish that was the case in our country. a big media house can't just criticize the supreme leader, or else no ads, no priority or invitation in interviews or speeches and stuff. Which also means that they are chamchas and seek morsels from the table"
}