{
    "id": "199rj2i",
    "title": "Chennai: Under-Construction Flyover Collapses, Video Surfaces",
    "url": "https://www.freepressjournal.in/amp/india/chennai-under-construction-flyover-collapses-video-surfaces",
    "selftext": "Corruption everywhere!!!",
    "flair": "Law & Courts",
    "score": 52,
    "num_comments": 8,
    "created_utc": 1705588531.0,
    "convurl": "https://external-preview.redd.it/48bdcAaXmQU2i8ijiqDwT-K-aoZZ83lgCjj1fNkne6A.jpg?auto=webp&s=a4e64c3f7fb1011ae5a29cafc49a295965320cba",
    "comments": [
        "NOT UP hence NO Traction",
        "CowBelt is so corrupt...oh wait it's the most developed state nevermind then ! Lol",
        "No video. Misleading headline.",
        "Seems to be a railway bridge (constructed by Southern Railways?). Locals can add more context.\n\nNot that it matters, but Gobi ji also seems to be in TN visiting temples (2 Shiva temples, 1 Aranganatha Perumal temple) with some connection to Rama. Note that none of the grand temples in TN are for Rama.",
        "> the beam was not seated and fell down\n\nThat would be considered a collapse",
        "what?"
    ],
    "cleaned_text": "chennai underconstruction flyover collapses video surfaces corruption everywhere ",
    "cleaned_title": "chennai underconstruction flyover collapses video surfaces",
    "cleaned_selftext": "corruption everywhere",
    "cleaned_comments": "hence traction cowbelt corruptoh wait developed state nevermind lol video misleading headline seems railway bridge constructed southern railways locals add context matters gobi ji also seems tn visiting temples shiva temples aranganatha perumal temple connection rama note none grand temples tn rama beam seated fell would considered collapse",
    "light_cleaned_title": "Chennai: Under-Construction Flyover Collapses, Video Surfaces",
    "light_cleaned_selftext": "Corruption everywhere!!!",
    "light_cleaned_comments": "NOT UP hence NO Traction CowBelt is so corrupt...oh wait it's the most developed state nevermind then ! Lol No video. Misleading headline. Seems to be a railway bridge (constructed by Southern Railways?). Locals can add more context. Not that it matters, but Gobi ji also seems to be in TN visiting temples (2 Shiva temples, 1 Aranganatha Perumal temple) with some connection to Rama. Note that none of the grand temples in TN are for Rama. > the beam was not seated and fell down That would be considered a collapse what?"
}