{
    "id": "1cjpwtr",
    "title": "Prisoner stabbed to death in Tihar jail ‘over serving food’ | Delhi News - The Indian Express ",
    "url": "https://indianexpress.com/article/cities/delhi/prisoner-stabbed-to-death-in-delhi-tihar-jail-over-issue-of-food-9306702/",
    "selftext": "Scares the shit out of me. \n\n\"According to jail officials, at 12.40 pm, an inmate, Afghan national Abdul Basir (44), allegedly stabbed another undertrial prisoner, Deepak Soni, without any provocation inside ward number 3 of Central Jail number 4.\"\n\nThe person who died was under trial!",
    "flair": "Crime",
    "score": 2,
    "num_comments": 4,
    "created_utc": 1714790092.0,
    "convurl": "https://external-preview.redd.it/Ps7BzIOZZPinAOH5QbCX_feEyATC-mBiTvpNirYUIU8.jpg?auto=webp&s=81a875b1cbe85a265649868eed25c97d342f319a",
    "comments": [
        "But why are you scared? It's a fucking prison.",
        "Well, undertrial prisoners are theoretically innocent. In fact in reality too, you can easily be jailed if someone just goes and files an FIR on you. It frightens me that this is how undertrials are treated.",
        "Life is pretty cheap in india if you are not connected or have a lot of wealth."
    ],
    "cleaned_text": "prisoner stabbed death tihar jail serving food delhi news indian express scares shit according jail officials pm inmate afghan national abdul basir allegedly stabbed another undertrial prisoner deepak soni without provocation inside ward number central jail number person died trial ",
    "cleaned_title": "prisoner stabbed death tihar jail serving food delhi news indian express",
    "cleaned_selftext": "scares shit according jail officials pm inmate afghan national abdul basir allegedly stabbed another undertrial prisoner deepak soni without provocation inside ward number central jail number person died trial",
    "cleaned_comments": "scared fucking prison well undertrial prisoners theoretically innocent fact reality easily jailed someone goes files fir frightens undertrials treated life pretty cheap india connected lot wealth",
    "light_cleaned_title": "Prisoner stabbed to death in Tihar jail ‘over serving food’ | Delhi News - The Indian Express",
    "light_cleaned_selftext": "Scares the shit out of me. \"According to jail officials, at 12.40 pm, an inmate, Afghan national Abdul Basir (44), allegedly stabbed another undertrial prisoner, Deepak Soni, without any provocation inside ward number 3 of Central Jail number 4.\" The person who died was under trial!",
    "light_cleaned_comments": "But why are you scared? It's a fucking prison. Well, undertrial prisoners are theoretically innocent. In fact in reality too, you can easily be jailed if someone just goes and files an FIR on you. It frightens me that this is how undertrials are treated. Life is pretty cheap in india if you are not connected or have a lot of wealth."
}