{
    "id": "1b9kut3",
    "title": "AAP government misusing it's power.                     Lovely professional university   prostitute case ",
    "url": "https://x.com/Nikhilsingh21_/status/1765728042293535058?t=hjOYQzFqWoYYBBpEm5PngA&s=34",
    "selftext": "All are same. Instead of improving the situation in Punjab, Punjab government is busy to arrest the one who is exposing prostitute activity happening around university. ",
    "flair": "Crime",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1709893051.0,
    "convurl": "https://external-preview.redd.it/LSIDle0grJKFJkxcZQUzZg65333iKwQ0RLLHT2KSBI4.jpg?auto=webp&s=9b3c2bc3fd5315bc30e12af26d96820e501a6881",
    "comments": [
        "AAP is no different than SAD or Congress. Look up Manik Goyal’s twitter handle. He has exposed how AAP Punjab is misusing tax money to get private jet for Kejriwal which costs more than 1 crore daily. \n\nAAP cries that BJP is misusing its power and trying to send their candidates to jail, while on the other hand they did same with Sukhpal Singh Khaira (Congress MLA). AAP says it is the right of farmers to do a peaceful protest while last month a activist was arrested for speaking against immigration mafia in Punjab because ofcourse the immigration mafia pays the police. People decided to protest for the release of Bhana Sidhu and then PP arrested journalists and put on barricades to stop the protesters from reaching their protest site.",
        "If people don't hold politicians accountable, the fifth should at least be churned every 5 years. No incumbency in all elections."
    ],
    "cleaned_text": "aap government misusing power lovely professional university prostitute case instead improving situation punjab punjab government busy arrest one exposing prostitute activity happening around university ",
    "cleaned_title": "aap government misusing power lovely professional university prostitute case",
    "cleaned_selftext": "instead improving situation punjab punjab government busy arrest one exposing prostitute activity happening around university",
    "cleaned_comments": "aap different sad congress look manik goyals twitter handle exposed aap punjab misusing tax money get private jet kejriwal costs crore daily aap cries bjp misusing power trying send candidates jail hand sukhpal singh khaira congress mla aap says right farmers peaceful protest last month activist arrested speaking immigration mafia punjab ofcourse immigration mafia pays police people decided protest release bhana sidhu pp arrested journalists put barricades stop protesters reaching protest site people dont hold politicians accountable fifth least churned every years incumbency elections",
    "light_cleaned_title": "AAP government misusing it's power. Lovely professional university prostitute case",
    "light_cleaned_selftext": "All are same. Instead of improving the situation in Punjab, Punjab government is busy to arrest the one who is exposing prostitute activity happening around university.",
    "light_cleaned_comments": "AAP is no different than SAD or Congress. Look up Manik Goyal’s twitter handle. He has exposed how AAP Punjab is misusing tax money to get private jet for Kejriwal which costs more than 1 crore daily. AAP cries that BJP is misusing its power and trying to send their candidates to jail, while on the other hand they did same with Sukhpal Singh Khaira (Congress MLA). AAP says it is the right of farmers to do a peaceful protest while last month a activist was arrested for speaking against immigration mafia in Punjab because ofcourse the immigration mafia pays the police. People decided to protest for the release of Bhana Sidhu and then PP arrested journalists and put on barricades to stop the protesters from reaching their protest site. If people don't hold politicians accountable, the fifth should at least be churned every 5 years. No incumbency in all elections."
}