{
    "id": "14wl1s6",
    "title": "Abrogation of Article 370: Day-to-day hearing in SC from Aug 2; Mehbooba expresses apprehension",
    "url": "https://indianexpress.com/article/india/sc-hearing-article-370-jk-august-2-8825541/",
    "selftext": "The bench recorded in its order that SG Tushar Mehta has assured that the affidavit filed by the Centre on Monday in the matter has “no bearing on the constitutional issues raised in petitions”.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1689063472.0,
    "convurl": "https://external-preview.redd.it/lRdqyD084GJg2lH3Tj3h0f4D8VotXKjRjlKpg6Uw1Es.jpg?auto=webp&v=enabled&s=ec64af3493d6560786dc5e4ea16ee2344032ef96",
    "comments": [
        ">@MehboobaMufti Hon’ble SCs decision to not rely on GOIs affidavit vindicates that it doesnt have a logical explanation to justify illegal abrogation of Article 370. Having said that there are legitimate apprehensions about why SC has taken up the Article 370 with such alacrity after their visit to Kashmir. After remaining silent for four years the decision to hear the case on a daily basis does evoke misgivings. Hope the constitution of this country by which judiciary swears is not sacrificed at the altar of power to satisfy collective conscience of people who know little about the matter."
    ],
    "cleaned_text": "abrogation article daytoday hearing sc aug mehbooba expresses apprehension bench recorded order sg tushar mehta assured affidavit filed centre monday matter bearing constitutional issues raised petitions ",
    "cleaned_title": "abrogation article daytoday hearing sc aug mehbooba expresses apprehension",
    "cleaned_selftext": "bench recorded order sg tushar mehta assured affidavit filed centre monday matter bearing constitutional issues raised petitions",
    "cleaned_comments": "mehboobamufti honble scs decision rely gois affidavit vindicates doesnt logical explanation justify illegal abrogation article said legitimate apprehensions sc taken article alacrity visit kashmir remaining silent four years decision hear case daily basis evoke misgivings hope constitution country judiciary swears sacrificed altar power satisfy collective conscience people know little matter",
    "light_cleaned_title": "Abrogation of Article 370: Day-to-day hearing in SC from Aug 2; Mehbooba expresses apprehension",
    "light_cleaned_selftext": "The bench recorded in its order that SG Tushar Mehta has assured that the affidavit filed by the Centre on Monday in the matter has “no bearing on the constitutional issues raised in petitions”.",
    "light_cleaned_comments": ">@MehboobaMufti Hon’ble SCs decision to not rely on GOIs affidavit vindicates that it doesnt have a logical explanation to justify illegal abrogation of Article 370. Having said that there are legitimate apprehensions about why SC has taken up the Article 370 with such alacrity after their visit to Kashmir. After remaining silent for four years the decision to hear the case on a daily basis does evoke misgivings. Hope the constitution of this country by which judiciary swears is not sacrificed at the altar of power to satisfy collective conscience of people who know little about the matter."
}