{
    "id": "1ayxeup",
    "title": "Changing the growth paradigm",
    "url": "https://www.thehindu.com/opinion/lead/changing-the-growth-paradigm/article67879540.ece/amp/",
    "selftext": "India’s policymakers must free themselves from western-dominated theories of economics and in this, local solutions are the way to solve global systemic problems",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1708789128.0,
    "convurl": "https://external-preview.redd.it/N9eJ0rB65RWNAmgaPdxQE9xnaxP0E2ZkFoSugX7Io8E.jpg?auto=webp&s=6f0f8647e11322691d62f23f094150a9f9eaeed6",
    "comments": [
        "Paywall.",
        "GDP and GDP per capita are not key metrics.\n\nIf 10 people make 10 billion dollars a year in a country of 1000 people. Then:-\n\nGDP is 100 billion dollars.\n\nGDP per capita is 100 million dollars.\n\nNow we are assuming the remaining 990 make 100 million a year. Which need not be true."
    ],
    "cleaned_text": "changing growth paradigm indias policymakers must free westerndominated theories economics local solutions way solve global systemic problems ",
    "cleaned_title": "changing growth paradigm",
    "cleaned_selftext": "indias policymakers must free westerndominated theories economics local solutions way solve global systemic problems",
    "cleaned_comments": "paywall gdp gdp per capita key metrics people make billion dollars year country people gdp billion dollars gdp per capita million dollars assuming remaining make million year need true",
    "light_cleaned_title": "Changing the growth paradigm",
    "light_cleaned_selftext": "India’s policymakers must free themselves from western-dominated theories of economics and in this, local solutions are the way to solve global systemic problems",
    "light_cleaned_comments": "Paywall. GDP and GDP per capita are not key metrics. If 10 people make 10 billion dollars a year in a country of 1000 people. Then:- GDP is 100 billion dollars. GDP per capita is 100 million dollars. Now we are assuming the remaining 990 make 100 million a year. Which need not be true."
}