{
    "id": "181do45",
    "title": "BJP moves EC against Rahul Gandhi's ‘panauti’ jibe at PM Modi | Latest News India - Hindustan Times",
    "url": "https://www.hindustantimes.com/india-news/bjp-moves-election-commission-against-rahul-gandhis-panauti-jibe-at-pm-modi-101700654173303.html",
    "selftext": ">The Bharatiya Janata Party on Wednesday moved the Election Commission against Congress MP Rahul Gandhi's ‘pickpocket’ and ‘panauti’ (bad omen) jibe against Prime Minister Narendra Modi. *“Panauti... Panauti... Panauti... our boys were well on their way to winning the world cup but Panauti made them lose... the people of this country know,”* Gandhi said at a rally in poll-bound Rajasthan on Tuesday. Addressing a poll rally in Rajasthan's Bharatpur today, Gandhi said, *\"The pickpocket never comes alone, there are three people. One comes from the front, one from the back and one from the distance...\n>####Prime Minister Narendra Modi's job is to divert your attention. He comes on TV from the front and distracts the public by raising topics of Hindu-Muslim, demonetization, and GST. Meanwhile, Adani comes from behind and takes the money.\"*",
    "flair": "Politics",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1700671695.0,
    "convurl": "https://external-preview.redd.it/fAmOKyzHR1jm14sA1z52LxQv8xWKiWeR_Iarjah6aOc.jpg",
    "comments": [],
    "cleaned_text": "bjp moves ec rahul gandhis panauti jibe pm modi latest news india hindustan times bharatiya janata party wednesday moved election commission congress mp rahul gandhis pickpocket panauti bad omen jibe prime minister narendra modi panauti panauti panauti boys well way winning world cup panauti made lose people country know gandhi said rally pollbound rajasthan tuesday addressing poll rally rajasthans bharatpur today gandhi said pickpocket never comes alone three people one comes front one back one distance prime minister narendra modis job divert attention comes tv front distracts public raising topics hindumuslim demonetization gst meanwhile adani comes behind takes money ",
    "cleaned_title": "bjp moves ec rahul gandhis panauti jibe pm modi latest news india hindustan times",
    "cleaned_selftext": "bharatiya janata party wednesday moved election commission congress mp rahul gandhis pickpocket panauti bad omen jibe prime minister narendra modi panauti panauti panauti boys well way winning world cup panauti made lose people country know gandhi said rally pollbound rajasthan tuesday addressing poll rally rajasthans bharatpur today gandhi said pickpocket never comes alone three people one comes front one back one distance prime minister narendra modis job divert attention comes tv front distracts public raising topics hindumuslim demonetization gst meanwhile adani comes behind takes money",
    "cleaned_comments": "",
    "light_cleaned_title": "BJP moves EC against Rahul Gandhi's ‘panauti’ jibe at PM Modi | Latest News India - Hindustan Times",
    "light_cleaned_selftext": ">The Bharatiya Janata Party on Wednesday moved the Election Commission against Congress MP Rahul Gandhi's ‘pickpocket’ and ‘panauti’ (bad omen) jibe against Prime Minister Narendra Modi. *“Panauti... Panauti... Panauti... our boys were well on their way to winning the world cup but Panauti made them lose... the people of this country know,”* Gandhi said at a rally in poll-bound Rajasthan on Tuesday. Addressing a poll rally in Rajasthan's Bharatpur today, Gandhi said, *\"The pickpocket never comes alone, there are three people. One comes from the front, one from the back and one from the distance... >####Prime Minister Narendra Modi's job is to divert your attention. He comes on TV from the front and distracts the public by raising topics of Hindu-Muslim, demonetization, and GST. Meanwhile, Adani comes from behind and takes the money.\"*",
    "light_cleaned_comments": ""
}