{
    "id": "15jjur8",
    "title": "For women : Is this a good gift for my girlfriend?",
    "url": "https://i.redd.it/7sx6qeq65ggb1.jpg",
    "selftext": "For context, we're both 19 and both like fashion. I'm in Singapore, and am returning to India as vacations are over. Will this tote bag make for a good gift?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691308728.0,
    "convurl": "https://i.redd.it/7sx6qeq65ggb1.jpg",
    "comments": [
        "This is difficult to answer when we don't know what your girlfriend likes or what her tastes/interests are. \n\nBut from a general point of view, while it's a good gift for a friend, I'd say you need a little more of a personal touch for a girlfriend.",
        "She likes such stuff. She saw me Carry a fanny pack and bought one for herself, so there's that.",
        "Ah then this is a great gift for sure! I love the bright yellow btw, such a happy colour."
    ],
    "cleaned_text": "women good gift girlfriend context like fashion im singapore returning india vacations tote bag make good gift ",
    "cleaned_title": "women good gift girlfriend",
    "cleaned_selftext": "context like fashion im singapore returning india vacations tote bag make good gift",
    "cleaned_comments": "difficult answer dont know girlfriend likes tastesinterests general point view good gift friend id say need little personal touch girlfriend likes stuff saw carry fanny pack bought one theres ah great gift sure love bright yellow btw happy colour",
    "light_cleaned_title": "For women : Is this a good gift for my girlfriend?",
    "light_cleaned_selftext": "For context, we're both 19 and both like fashion. I'm in Singapore, and am returning to India as vacations are over. Will this tote bag make for a good gift?",
    "light_cleaned_comments": "This is difficult to answer when we don't know what your girlfriend likes or what her tastes/interests are. But from a general point of view, while it's a good gift for a friend, I'd say you need a little more of a personal touch for a girlfriend. She likes such stuff. She saw me Carry a fanny pack and bought one for herself, so there's that. Ah then this is a great gift for sure! I love the bright yellow btw, such a happy colour."
}