{
    "id": "1evvial",
    "title": "If you think Indian journalism can go any lower",
    "url": "https://i.redd.it/bvisj2ejlkjd1.jpeg",
    "selftext": "Came across this today and dare I say that Indian Journalism is the worst in the world and if I was wondering that they can stoop any lower. ",
    "flair": "Rant / Vent",
    "score": 226,
    "num_comments": 49,
    "created_utc": 1724051256.0,
    "convurl": "https://i.redd.it/bvisj2ejlkjd1.jpeg",
    "comments": [
        "what was the fault of patients here?",
        "What is the issue here?\nDoctors are on strike and not treating patients, typical doctor move.\n\nThey should treat them. They took the oath while becoming a doctor. Follow it.\n\nJournalism ekdum sahi h, tumhara dimag kharab h.\nChal ab mujhe downvote kar aur apni aukat dikha de.",
        "India never had good journalism.\n\nThey don’t follow ethics or professionalism. This is even have clean words. There were articles where they use obscene languages.",
        "Becoming a doctor is like, spending years paying high fees for education, being unemployed for 7-8 years straight and then ending up in shit conditions. It sucks to be a government doctor in today's date. Even private don't pay good salary.",
        "Oath to what?\n\nSlavery\n\nBeing beaten, being underpaid, overworked and having to face a life of utter nonsense.",
        "This is just the tip of the iceberg",
        "So by that logic nobody can actually go on strike because they work in a certain sector? \n\nIt's us Indians who idolize and deitify everything. Doctors are human too and if they are getting raped and murdered, others will go on strike. It's not rocket science. And yaha aukat dikhane ki kuch baat hi nhi h.",
        "For some reason I feel Kolkata people who are not standing up against this dictatorship are doing a good thing.. today they will not speak up.. tomorrow their karma will speak up for them when such thing will happen again and again and again.. they deserve it",
        "Please go see a therapist",
        "People who are not standing up against this dictatorship clearly deserve it. They will cry when one of their members dies because of it .. All of Kolkata (excluding people who are fighting for it) deserves this terror and horror in their everyday lives",
        "India's journalism is basically clickbaits/ragebaits, just for some trp, Even back in 1980s when riots were happening they were never reporting , it is same today, \n\nEverything in India was always made for ruling party and its corrupt politicians, the worst thing is PEOPLE SUPPORT THEM",
        "Patients are dying, who will treat them?",
        "This post is plain BS emergency services in each hospital are still available and functioning. Only OPDs and regular check ups are affected by protests. If the patient is really that serious ki woh tadap rha hai to take him to emergency ward. This is just a propaganda post to deter doctors from protesting. I won't feel surprised if this post is sponsored by government ( I know many will disagree with this but no government good or bad likes protesting citizens as we have seen over the years that firstly governments try to subdue protest without listening to the protesters. It's only when protest becomes so huge to contain they listen to their demands",
        "Not much except majority of violence done on doctors hitherto were by normal patients . Indian patients don't have to pay extravagant amounts of money like USA , but they still don't respect them . Still , it's not neccsarily the fault of the patients but you have to weigh in the consequences for things to work - \n\n1) have minor inconvenience for some days(emergency services are still up) or \n\n2)have doctors getting brutalised and raped with no justice whatsover.  \n\nChoose your poison.",
        "Andolanjeevi \n\n/S",
        "Can someone translate/summarise the article ?",
        "are you saying that people unrelated to crime can be punished because they happen to belong to same class as criminals?",
        "Ahh can't read Hindi sry anyone can sum up?",
        "Doctors would, if they weren't getting raped in their workplace.",
        "Can anyone translate? not well-versed with reading hindi",
        "Hell is a buttomless pit, is can always get worse :)",
        "The headline basically says “the patients kept suffering (while) the doctors kept pretending” and pretending is a literal translation but what it implied was that the protest was just an excuse for doctors to not work in the OPD/emergency wards",
        "How is that the doctors' problem? If they're that crucial for society, maybe their demands for basic safety and humane working conditions should be fulfilled.\n\nP.S. I am not a doctor",
        "The headline basically says “the patients kept suffering (while) the doctors kept pretending” and pretending is a literal translation but what it implied was that the protest was just an excuse for doctors to not work in the OPD/emergency wards",
        "How do doctors sleep after knowing that due to their protests some patient died because they could not receive treatment on time.\n\nThe whole purpose of becoming a doctor gets defeated.",
        "Why should doctors tolerate rampant violence and inhumane working conditions for anybody?",
        "Translation?",
        "What the hell",
        "ask the government which created the environment of garlanding rapists. why subjugate poor patients?\njust because they are poor and helpless so it's easy. but protesting against government is hard?",
        "We all know how arrogant doctors are (especially to poor people). Then they come to us crying for support.",
        "Becoming a doctor is a job. The purpose is to earn money, like any other job.\n\nIf the doctor sees that one of them got raped and killed while working and not even getting justice for it, it is a very obvious thing to ask for better working conditions.\n\nThoda dimaag chala bhadwe. Why would anyone want to work in a place where you can get raped and killed without having anyone do anything about it.\n\nIf you are worried about patients dying, then support the doctors pleas to get them atleast bare minimum of workplace safety so that they can do their job properly.\n\nTo reiterate, doctors are asking to not be raped and murdered where they work, and you are bitching about that. Hopeless troll, go back to your cave.",
        "Do you not know that emergency services were still open ?",
        "Oath of being respectful to patients, which most doctors don’t. I have seen how doctors treat poor patients like they are scum on earth. Don’t be a victim here.",
        "\nHere is the translation:- \n\nHeadline: Patients kept suffering, doctors kept doing drama.\n\nText: \nResident doctor did not sit in OPD in protest against Kolkata incident, portrayed the pain of his colleague through acting. Around 1000 resident doctors and PG students left OPD outside PGIMS emergency gate, raised slogans and demonstrated. Told through street drama what happened to the trainee doctor at RG Kar Medical College, Kolkata on the night of 8th August.  All the doctors raised the slogan in unison, no safety, no work. \n\n Now the strike will continue until security is provided.  During this period, patients kept wandering here and there in OPD suffering from pain.  About 100 resident doctors are on strike.  About 400 PG students are in it.  At present the resident doctor is providing services only in case of fire emergency, due to which the OPD has been affected.  Due to the strike, about 100 small and big doctors took out a rally in PGI and demonstrated. There was less crowd in OPD and emergency. Due to the strike, the number of patients in OPD and emergency is less as compared to other days.  Only around 3000 patients are reaching the OPD of more than eight thousand.  At the same time, 200 to 250 patients are reaching the emergency department.  The operation could not be done.  OPD of 8000 patients has reached 3000.  Earlier, 1000 patients were treated daily in the emergency department.  Today the doctors who are being treated with difficulty here took out a Nyaya Yatra from Dean Park. \n\nI used Google translate so some error maybe there",
        "The translation is literally, \"The patients kept suffering, (while) doctors kept making drama\". The phrase used for \"making drama\" is *naaTak karnaa*. Most Indian languages have a word akin to naaTak, so I'm sure you get the gist.",
        "There were some reputable and good journalists, some still are. But yeah since the last 10 years they've been silenced. The Hindu largely remains an honest to god newspaper that doesn't shy away from anything and does not resort to cheap tactics.",
        "Every coin has 2 sides",
        "Went to a hospital today, doctors are still working,  just opd is closed.\n\nThese papers act like, doctors haath or haath dhare bethe h.",
        "Ooth to mamta n bhi li thi.",
        "Name this pro-rape newspaper. Destroy them on social media. Boycott it. Hope that teaches them a lesson.",
        "It is a bit nuanced. The doctors performed a “nukad natak” i.e. a street play to portray the plight of the victim. Natak can mean literally “a play” and more colloquially “pretence or make belief”. \n\nThe paper is being a smart ass by using the word natak for the headline. If someone complains, then they can say, look the doctors were performing a street play, that’s what we reported. The dog whistle although is quite evident here.",
        "Emergency services are still active, if the patient is under risk of death  without medical assistance the doctors will help them.",
        "Not sure what any of this says",
        "The actual content of the article is quite right.\n\nIt is the way this catchy headline is written that is problematic.",
        "Meanwhile BJ party is garlanding and giving parole to convicted rapists. The dictatorship is nationwide.",
        "Troll toh tum ho aur tumhari Puri life.\nSense wali baat karta hu wo tumhe samaj nhi ayegi",
        " \nIs chutie desh me koi h jo apna kaam dhang se krta h?",
        "So according to you, doctors should have no free will, and should mindlessly just go to work after seeing one of their own get raped and murdered in a hospital without getting proper justice?\n\nYeh hai teri sense wali baat?",
        "Yes were some",
        "Can we fire all these media people please? They create nothing but drama and add nothing of value.",
        "Doctors are also like pests sucking blood from patients.",
        "How else are doctors supposed to protest if not strike work - block roads and highways like those imbecile 'farmers'? And why are they not allowed to strike work? That's the right of any person on earth.",
        "because their strike can cause deaths to critical patients.\nesma is there to avoid such things from happening.\nif doctors want to protest they can find peaceful ways to do it. killing patients is just going to backfire on them. as government will jail such erring doctors and also ensure they won't practice any longer.",
        "Doctors are already dying and facing injuries from patients and other people because of bad working conditions. They still work because they want to make something of themselves, unlike the 'poor and helpless' who assault them across the country on a regular basis. A complete strike of medical services is long overdue.\n\n>killing patients is just going to backfire on them\n\nDirect your anger toward the useless politicians who will spend lakhs of crores on free stuff for the 'poor and helpless' but have not bothered to ensure a minimum safety and living standard for doctors who work inhumane shifts on a regular basis to keep the system from collapsing. Just because a law was passed to enslave doctors and other people (esma) doesn't mean doctors are supposed to become slaves. Striking work is the right of any person, essential service or not. If you don't care about their demands for basic safety when performing their duties, you don't deserve their services.\n\n>as government will jail such erring doctors and also ensure they won't practice any longer.\n\nThe government should do that, then. All doctors who can, should leave India for places that value them more. Whatever will happen is well deserved for the doctors and for the people of this country. If the doctors back down now, it's their loss. If they don't back down, good for them. I hope they prevail in their demands.",
        "Which newspaper is this"
    ],
    "cleaned_text": "think indian journalism go lower came across today dare say indian journalism worst world wondering stoop lower ",
    "cleaned_title": "think indian journalism go lower",
    "cleaned_selftext": "came across today dare say indian journalism worst world wondering stoop lower",
    "cleaned_comments": "fault patients issue doctors strike treating patients typical doctor move treat took oath becoming doctor follow journalism ekdum sahi h tumhara dimag kharab h chal ab mujhe downvote kar aur apni aukat dikha de india never good journalism dont follow ethics professionalism even clean words articles use obscene languages becoming doctor like spending years paying high fees education unemployed years straight ending shit conditions sucks government doctor todays date even private dont pay good salary oath slavery beaten underpaid overworked face life utter nonsense tip iceberg logic nobody actually go strike work certain sector us indians idolize deitify everything doctors human getting raped murdered others go strike rocket science yaha aukat dikhane ki kuch baat hi nhi h reason feel kolkata people standing dictatorship good thing today speak tomorrow karma speak thing happen deserve please go see therapist people standing dictatorship clearly deserve cry one members dies kolkata excluding people fighting deserves terror horror everyday lives indias journalism basically clickbaitsragebaits trp even back riots happening never reporting today everything india always made ruling party corrupt politicians worst thing people support patients dying treat post plain bs emergency services hospital still available functioning opds regular check ups affected protests patient really serious ki woh tadap rha hai take emergency ward propaganda post deter doctors protesting wont feel surprised post sponsored government know many disagree government good bad likes protesting citizens seen years firstly governments try subdue protest without listening protesters protest becomes huge contain listen demands much except majority violence done doctors hitherto normal patients indian patients dont pay extravagant amounts money like usa still dont respect still neccsarily fault patients weigh consequences things work minor inconvenience daysemergency services still doctors getting brutalised raped justice whatsover choose poison andolanjeevi someone translatesummarise article saying people unrelated crime punished happen belong class criminals ahh cant read hindi sry anyone sum doctors would werent getting raped workplace anyone translate wellversed reading hindi hell buttomless pit always get worse headline basically says patients kept suffering doctors kept pretending pretending literal translation implied protest excuse doctors work opdemergency wards doctors problem theyre crucial society maybe demands basic safety humane working conditions fulfilled ps doctor headline basically says patients kept suffering doctors kept pretending pretending literal translation implied protest excuse doctors work opdemergency wards doctors sleep knowing due protests patient died could receive treatment time whole purpose becoming doctor gets defeated doctors tolerate rampant violence inhumane working conditions anybody translation hell ask government created environment garlanding rapists subjugate poor patients poor helpless easy protesting government hard know arrogant doctors especially poor people come us crying support becoming doctor job purpose earn money like job doctor sees one got raped killed working even getting justice obvious thing ask better working conditions thoda dimaag chala bhadwe would anyone want work place get raped killed without anyone anything worried patients dying support doctors pleas get atleast bare minimum workplace safety job properly reiterate doctors asking raped murdered work bitching hopeless troll go back cave know emergency services still open oath respectful patients doctors dont seen doctors treat poor patients like scum earth dont victim translation headline patients kept suffering doctors kept drama text resident doctor sit opd protest kolkata incident portrayed pain colleague acting around resident doctors pg students left opd outside pgims emergency gate raised slogans demonstrated told street drama happened trainee doctor rg kar medical college kolkata night th august doctors raised slogan unison safety work strike continue security provided period patients kept wandering opd suffering pain resident doctors strike pg students present resident doctor providing services case fire emergency due opd affected due strike small big doctors took rally pgi demonstrated less crowd opd emergency due strike number patients opd emergency less compared days around patients reaching opd eight thousand time patients reaching emergency department operation could done opd patients reached earlier patients treated daily emergency department today doctors treated difficulty took nyaya yatra dean park used google translate error maybe translation literally patients kept suffering doctors kept making drama phrase used making drama naatak karnaa indian languages word akin naatak im sure get gist reputable good journalists still yeah since last years theyve silenced hindu largely remains honest god newspaper doesnt shy away anything resort cheap tactics every coin sides went hospital today doctors still working opd closed papers act like doctors haath haath dhare bethe h ooth mamta n bhi li thi name prorape newspaper destroy social media boycott hope teaches lesson bit nuanced doctors performed nukad natak ie street play portray plight victim natak mean literally play colloquially pretence make belief paper smart ass using word natak headline someone complains say look doctors performing street play thats reported dog whistle although quite evident emergency services still active patient risk death without medical assistance doctors help sure says actual content article quite right way catchy headline written problematic meanwhile bj party garlanding giving parole convicted rapists dictatorship nationwide troll toh tum ho aur tumhari puri life sense wali baat karta hu wo tumhe samaj nhi ayegi chutie desh koi h jo apna kaam dhang se krta h according doctors free mindlessly go work seeing one get raped murdered hospital without getting proper justice yeh hai teri sense wali baat yes fire media people please create nothing drama add nothing value doctors also like pests sucking blood patients else doctors supposed protest strike work block roads highways like imbecile farmers allowed strike work thats right person earth strike cause deaths critical patients esma avoid things happening doctors want protest find peaceful ways killing patients going backfire government jail erring doctors also ensure wont practice longer doctors already dying facing injuries patients people bad working conditions still work want make something unlike poor helpless assault across country regular basis complete strike medical services long overdue killing patients going backfire direct anger toward useless politicians spend lakhs crores free stuff poor helpless bothered ensure minimum safety living standard doctors work inhumane shifts regular basis keep system collapsing law passed enslave doctors people esma doesnt mean doctors supposed become slaves striking work right person essential service dont care demands basic safety performing duties dont deserve services government jail erring doctors also ensure wont practice longer government doctors leave india places value whatever happen well deserved doctors people country doctors back loss dont back good hope prevail demands newspaper",
    "light_cleaned_title": "If you think Indian journalism can go any lower",
    "light_cleaned_selftext": "Came across this today and dare I say that Indian Journalism is the worst in the world and if I was wondering that they can stoop any lower.",
    "light_cleaned_comments": "what was the fault of patients here? What is the issue here? Doctors are on strike and not treating patients, typical doctor move. They should treat them. They took the oath while becoming a doctor. Follow it. Journalism ekdum sahi h, tumhara dimag kharab h. Chal ab mujhe downvote kar aur apni aukat dikha de. India never had good journalism. They don’t follow ethics or professionalism. This is even have clean words. There were articles where they use obscene languages. Becoming a doctor is like, spending years paying high fees for education, being unemployed for 7-8 years straight and then ending up in shit conditions. It sucks to be a government doctor in today's date. Even private don't pay good salary. Oath to what? Slavery Being beaten, being underpaid, overworked and having to face a life of utter nonsense. This is just the tip of the iceberg So by that logic nobody can actually go on strike because they work in a certain sector? It's us Indians who idolize and deitify everything. Doctors are human too and if they are getting raped and murdered, others will go on strike. It's not rocket science. And yaha aukat dikhane ki kuch baat hi nhi h. For some reason I feel Kolkata people who are not standing up against this dictatorship are doing a good thing.. today they will not speak up.. tomorrow their karma will speak up for them when such thing will happen again and again and again.. they deserve it Please go see a therapist People who are not standing up against this dictatorship clearly deserve it. They will cry when one of their members dies because of it .. All of Kolkata (excluding people who are fighting for it) deserves this terror and horror in their everyday lives India's journalism is basically clickbaits/ragebaits, just for some trp, Even back in 1980s when riots were happening they were never reporting , it is same today, Everything in India was always made for ruling party and its corrupt politicians, the worst thing is PEOPLE SUPPORT THEM Patients are dying, who will treat them? This post is plain BS emergency services in each hospital are still available and functioning. Only OPDs and regular check ups are affected by protests. If the patient is really that serious ki woh tadap rha hai to take him to emergency ward. This is just a propaganda post to deter doctors from protesting. I won't feel surprised if this post is sponsored by government ( I know many will disagree with this but no government good or bad likes protesting citizens as we have seen over the years that firstly governments try to subdue protest without listening to the protesters. It's only when protest becomes so huge to contain they listen to their demands Not much except majority of violence done on doctors hitherto were by normal patients . Indian patients don't have to pay extravagant amounts of money like USA , but they still don't respect them . Still , it's not neccsarily the fault of the patients but you have to weigh in the consequences for things to work - 1) have minor inconvenience for some days(emergency services are still up) or 2)have doctors getting brutalised and raped with no justice whatsover. Choose your poison. Andolanjeevi /S Can someone translate/summarise the article ? are you saying that people unrelated to crime can be punished because they happen to belong to same class as criminals? Ahh can't read Hindi sry anyone can sum up? Doctors would, if they weren't getting raped in their workplace. Can anyone translate? not well-versed with reading hindi Hell is a buttomless pit, is can always get worse :) The headline basically says “the patients kept suffering (while) the doctors kept pretending” and pretending is a literal translation but what it implied was that the protest was just an excuse for doctors to not work in the OPD/emergency wards How is that the doctors' problem? If they're that crucial for society, maybe their demands for basic safety and humane working conditions should be fulfilled. P.S. I am not a doctor The headline basically says “the patients kept suffering (while) the doctors kept pretending” and pretending is a literal translation but what it implied was that the protest was just an excuse for doctors to not work in the OPD/emergency wards How do doctors sleep after knowing that due to their protests some patient died because they could not receive treatment on time. The whole purpose of becoming a doctor gets defeated. Why should doctors tolerate rampant violence and inhumane working conditions for anybody? Translation? What the hell ask the government which created the environment of garlanding rapists. why subjugate poor patients? just because they are poor and helpless so it's easy. but protesting against government is hard? We all know how arrogant doctors are (especially to poor people). Then they come to us crying for support. Becoming a doctor is a job. The purpose is to earn money, like any other job. If the doctor sees that one of them got raped and killed while working and not even getting justice for it, it is a very obvious thing to ask for better working conditions. Thoda dimaag chala bhadwe. Why would anyone want to work in a place where you can get raped and killed without having anyone do anything about it. If you are worried about patients dying, then support the doctors pleas to get them atleast bare minimum of workplace safety so that they can do their job properly. To reiterate, doctors are asking to not be raped and murdered where they work, and you are bitching about that. Hopeless troll, go back to your cave. Do you not know that emergency services were still open ? Oath of being respectful to patients, which most doctors don’t. I have seen how doctors treat poor patients like they are scum on earth. Don’t be a victim here. Here is the translation:- Headline: Patients kept suffering, doctors kept doing drama. Text: Resident doctor did not sit in OPD in protest against Kolkata incident, portrayed the pain of his colleague through acting. Around 1000 resident doctors and PG students left OPD outside PGIMS emergency gate, raised slogans and demonstrated. Told through street drama what happened to the trainee doctor at RG Kar Medical College, Kolkata on the night of 8th August. All the doctors raised the slogan in unison, no safety, no work. Now the strike will continue until security is provided. During this period, patients kept wandering here and there in OPD suffering from pain. About 100 resident doctors are on strike. About 400 PG students are in it. At present the resident doctor is providing services only in case of fire emergency, due to which the OPD has been affected. Due to the strike, about 100 small and big doctors took out a rally in PGI and demonstrated. There was less crowd in OPD and emergency. Due to the strike, the number of patients in OPD and emergency is less as compared to other days. Only around 3000 patients are reaching the OPD of more than eight thousand. At the same time, 200 to 250 patients are reaching the emergency department. The operation could not be done. OPD of 8000 patients has reached 3000. Earlier, 1000 patients were treated daily in the emergency department. Today the doctors who are being treated with difficulty here took out a Nyaya Yatra from Dean Park. I used Google translate so some error maybe there The translation is literally, \"The patients kept suffering, (while) doctors kept making drama\". The phrase used for \"making drama\" is *naaTak karnaa*. Most Indian languages have a word akin to naaTak, so I'm sure you get the gist. There were some reputable and good journalists, some still are. But yeah since the last 10 years they've been silenced. The Hindu largely remains an honest to god newspaper that doesn't shy away from anything and does not resort to cheap tactics. Every coin has 2 sides Went to a hospital today, doctors are still working, just opd is closed. These papers act like, doctors haath or haath dhare bethe h. Ooth to mamta n bhi li thi. Name this pro-rape newspaper. Destroy them on social media. Boycott it. Hope that teaches them a lesson. It is a bit nuanced. The doctors performed a “nukad natak” i.e. a street play to portray the plight of the victim. Natak can mean literally “a play” and more colloquially “pretence or make belief”. The paper is being a smart ass by using the word natak for the headline. If someone complains, then they can say, look the doctors were performing a street play, that’s what we reported. The dog whistle although is quite evident here. Emergency services are still active, if the patient is under risk of death without medical assistance the doctors will help them. Not sure what any of this says The actual content of the article is quite right. It is the way this catchy headline is written that is problematic. Meanwhile BJ party is garlanding and giving parole to convicted rapists. The dictatorship is nationwide. Troll toh tum ho aur tumhari Puri life. Sense wali baat karta hu wo tumhe samaj nhi ayegi Is chutie desh me koi h jo apna kaam dhang se krta h? So according to you, doctors should have no free will, and should mindlessly just go to work after seeing one of their own get raped and murdered in a hospital without getting proper justice? Yeh hai teri sense wali baat? Yes were some Can we fire all these media people please? They create nothing but drama and add nothing of value. Doctors are also like pests sucking blood from patients. How else are doctors supposed to protest if not strike work - block roads and highways like those imbecile 'farmers'? And why are they not allowed to strike work? That's the right of any person on earth. because their strike can cause deaths to critical patients. esma is there to avoid such things from happening. if doctors want to protest they can find peaceful ways to do it. killing patients is just going to backfire on them. as government will jail such erring doctors and also ensure they won't practice any longer. Doctors are already dying and facing injuries from patients and other people because of bad working conditions. They still work because they want to make something of themselves, unlike the 'poor and helpless' who assault them across the country on a regular basis. A complete strike of medical services is long overdue. >killing patients is just going to backfire on them Direct your anger toward the useless politicians who will spend lakhs of crores on free stuff for the 'poor and helpless' but have not bothered to ensure a minimum safety and living standard for doctors who work inhumane shifts on a regular basis to keep the system from collapsing. Just because a law was passed to enslave doctors and other people (esma) doesn't mean doctors are supposed to become slaves. Striking work is the right of any person, essential service or not. If you don't care about their demands for basic safety when performing their duties, you don't deserve their services. >as government will jail such erring doctors and also ensure they won't practice any longer. The government should do that, then. All doctors who can, should leave India for places that value them more. Whatever will happen is well deserved for the doctors and for the people of this country. If the doctors back down now, it's their loss. If they don't back down, good for them. I hope they prevail in their demands. Which newspaper is this"
}