{
    "id": "158ljc1",
    "title": "Doctors and Hospitals say 'Money, Money and Money', Ethics take a backseat",
    "url": "https://www.reddit.com/gallery/158ljc1",
    "selftext": "I am shattered, to say the least. \n\nMy recent experience dated July 19 and 20, 2023 with Dr. Shreya Krishna is pathetic. \n\nI consulted her in Primus Super Speciality hospital, Chanakyapuri, New Delhi where she is an on-call Oral and Maxillofacial surgeon. Firstly, she insisted on performing a biopsy even though it was not advised anywhere else. We trusted her and agreed for it. After one biopsy, she insisted on having the other one the same day. We were charged Rs. 15000 for the same even though were informed about Rs. 2000 only initially. \n\nThe next day after biopsies, my face swelled and looked like as if there is a facial deformity. It was traumatizing to see every random person giving me looks as if I am a ghost. \n\nConcerned about the exorbiant swelling, I informed the doctor and visited her. She absolutely refused to take any responsibility and shamelessly said that we can't do anything about it. We were asked to wait for 10 mins for the biopsy report. \n\nWorried after an hour long wait, my father walked in and asked about the report's status. She started shouting on my father. Even had the audacity to tell him to take my previous reports and consult someone else. Stooped so low that even mentioned 'India m kahin ilaaz ni milega aise'? Are patients expected to wait silently for hours when doctor refuses to hold responsibility? \n\nWell, I am thankful to her for asking me to consult someone else. That's the only good she did to me.\n\nDr. Shreya believes in minting money by performing unnecessary procedures. No ethics and humanity. I don't know how she performs surgeries with this attitude.\n\nPlease do yourself a favour by not consulting her. Her Google ratings include ratings from the supporting staff in Primus. I believe a doctor's rating is decided by patients. Maybe, it's different for her. \n\nI don't understand how the management of Primus hospital can afford such untrained and unprofessional staff in a hospital at such a high end and posh location. Do not waste your hard earned money at this hospital.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690229400.0,
    "convurl": "https://i.redd.it/e9qm86lszydb1.jpg",
    "comments": [
        "[Google link](https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKcTktelV3EAE!2m1!1s0x0:0xbdce4fb731a859d0!3m1!1s2@1:CIHM0ogKEICAgIDJq9-zUw%7CCgwI2sjypQYQqPvwswE%7C?hl=en-US)",
        "[Primus hospital](https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKeTdiOHF3RRAB!2m1!1s0x0:0x15e3c02de46eb6b6!3m1!1s2@1:CIHM0ogKEICAgIDJy7b8qwE%7CCgsI9vPwpQYQiO_NCA%7C?hl=en-US)",
        "While I do sympathize with your plight--we've all endured similar--your post will most probably be removed for identifying the facility and physician by name. You should edit your post to censor this information.",
        "upvoted",
        "I'm a doctor. Did they give any diagnosis or reason for biopsy?",
        "Sorry to hear that you had a similar experience. Undoubtedly, India's healthcare system is struggling currently.",
        "No. Only after seeing exorbiant swelling, the doctor started justifying that I follow the protocol that's why biopsy was done. \n\nI have consulted 5+ OMFS and all of them said it is not required in my case.",
        "Although i dont deny our system is faultless, i wouldnt assume everybody are here to rob your money. As a surgeon myself my first priority would also have been limb salvage as much as possible. But i dont have the luxury knowing the details of the case. Im sorry you had to go through such an ordeal.",
        "The whole point of the post is to name and shame. People already know the pathetic situation of private medical services in India in lots of cases. I guess it's best to get atleast some traction before the post is taken down.",
        "This hospital seems to have only 5 star and 1 star reviews. That's a huge redflag. Possibly lots of 5 reviews by staff and management.",
        "Please take care of yourself. Guys we know what we have to do.",
        "Guys rating gira do. That's the best we can do for her.",
        "Name and shame Businesses and Businessmen who take the commonman for a ride as they have money and police in pocket, @OP if Admin removes such posts, then do a post again but with attached proofs of how things came to be too... Kaise nahi rehne denge post.",
        "Bhai review bhi dal dena kal ek, maine dal diya.",
        "Sue her for medical negligence. Post this in r/legaladviceindia too",
        "This is Mumps, isn't it",
        "Let's bring the rating to 1 star, so other people don't waste their hard-earned money here.",
        "Yessssss",
        "Comment for visibility",
        "I wish for your recovery.",
        "Wish you a speedy recovery, left a review so others don't fall for such scam",
        "More power to you OP for calling a fraud doctor out. As a victim of malpractice too, it is imperative we ensure some form of accountability in the medical system, but their is close to none, and name shame is the most a common person can do with the resources they have. A lot of greedy professionals with ulterior motives and easy accsess to shirk responsibility are very dangerous for the masses and should be rightly called out.",
        "Tbh india doctor khud bhi majbur h 3-4 drop le ke neet clear Karo phir loan le ke padhai Karo 10+ years Tak ......jb aadmi doctor Banta h to morality backseat pe hti h .... Bhai financial well being banane ke chakkar Mai SB sahi lgta h",
        "This looks like it could be Mumps (one possibility). I would suggest you also see an Infectious Diseases specialist Doctor or an Internal Medicine specialist. It is unlikely that a dentist would know if it is Mumps (the test for this would be a viral test).\n\nMumps is a viral disease and contagious. I would recommend people around you take precaution and keep minimal physical contact with things you or things you may touch/use (to prevent spread and till you know what it is).",
        "Yeah, but do they ever complain about goverment not providing quality education for cheap to its citizens?",
        "Bhai SB copium mai h kisi sabko pta h government kuch nhi karegi...",
        "You're gonna go after someone's career built over more than a decade over a reddit post without knowing anything about the case?",
        "Did you consult a lawyer, does it make sense to file a lawsuit ?",
        "The swelling is due to the biopsy and not due to the condition for which she was getting checked. That’s what I gather from her description. So not mumps",
        "You can ask for the suspected diagnosis which required the biopsy and the protocol followed.",
        "Another red flag is, the good reviews are all AI generated.",
        "Exactly ! It's scary being a dentist myself. Just one person could come and tell anything, without any proof, and thousands of people would take it upon them to destroy them.",
        "What were your initial symptoms?",
        "Mera 3rd drop hai 😞",
        "https://www.google.com/search?client=ms-android-oneplus&cs=1&hl=en-IN&output=search&q=Dr.+Shreya+Krishna:+Best+Oral+and+Maxillofacial+Surgeon+in+Delhi+South+Delhi+%7C+Oral+Surgeon+%26+Jaw+Surgeon&ludocid=13676956766601501136&ibp=gwp;0,7&lsig=AB86z5W3kcAzoPdRYTdYgDDYLB7f&kgs=d1689d0098edf988&shndl=-1&shem=lsp&source=sh/x/kp/local/m1/4\n\n\nIs this the one? If yes then people who wanna support her know what to do eh!!!!",
        "https://www.google.com/search?client=ms-android-oneplus&cs=1&hl=en-IN&output=search&q=Dr.+Shreya+Krishna:+Best+Oral+and+Maxillofacial+Surgeon+in+Delhi+South+Delhi+%7C+Oral+Surgeon+%26+Jaw+Surgeon&ludocid=13676956766601501136&ibp=gwp;0,7&lsig=AB86z5W3kcAzoPdRYTdYgDDYLB7f&kgs=d1689d0098edf988&shndl=-1&shem=lsp&source=sh/x/kp/local/m1/4\n\n\nIs this the one? If yes then people who wanna support her know what to do eh!!!!",
        "Thanks for mora science but mai ab inn sab cheezo se upar uth chuka hu",
        "As a doctor myself, I’m really sorry you had to face this issue. Please do get legal counsel at the earliest. Secondly, if in the unfortunate event with you or any of your near and dear ones are subjected to an invasive procedure, ask the doctor regarding the indications, complications and alternatives (if applicable). This will help you a lot.",
        "Please put her google maps link. We will make sure she has true reviews about her.",
        "Every other surgeon I have consulted denied the need for a biopsy. If at all it was required, then can the doctor run away from treating the exorbiant swelling? I was told to take away my reports and consult someone else. The doctor cleary said swelling could increase, we can't do anything about it.",
        "True. I have seen some 5 star ratings from the supporting staff.",
        "Thank you.",
        "Thanks for the support.",
        "True, the healthcare system sucks for common man.",
        "*upvote for visibility*",
        "No offense to you, but can you atleast attach a payment bill as proof ?",
        "NAL\n\nLooks like you have grounds for a lawsuit.",
        "If you want people of Reddit to give negative rating, then you need to post all the consultation slips and bills . \nI fully sympathise with you and I really hope you recover fast because as per your post it is not clear why biopsy was recommended by that doctor and you did not go by the intuition of 5 doctors but you agreed to her recommendation of biopsy in a go. \nI would suggest you to add more relevant info .",
        "Please write your post on other communities also.",
        "Why did you consult her? I mean what were your reasons for going to the hospital? Your symptoms?",
        "Reported there in the review about mistreatment.",
        "Lol, digital marketing is a profession dude",
        "Not a doctor but isn't biopsy done when you have proof that you need to do biopsy?",
        "Tbh. In India Doctors are pathetic, have consulted From VMMC, MAMC to AIIMS- Delhi, bhopal, Jodhpur and bhubaneswar. Govt. Docs are worst they are least bothered, would stick the same diagnosis to everyone irrespective of the age. \n\nHad a few good experience in pvt (again guys who did their MBBS from pvt) practising in their own. Also Clause being they had pretty huge repo in the space. With heavenly 20-23 experience, they were the one who were Able to deliver. And felt actually relieved paying their Consulting fees , and had my recovery in the stipulated time.\n\nElse had various experience where in these Ukrainian and Russian docs and AIIMS doc especially practising private in their black money linked clinic, were literally speaking script. And giving the same diagnosis, and they were on prude being salesman, like you are late, you got less time and others. And selling various treatment. They were so horrible in that , one could tell it from her typewriter voice.\n\nAlso this is very wrong, but tbh I never really went wrong with chemist/pharmacy medicine. They work and are pocket friendly. Again I am not promoting jhola chaap doctors. I am saying the quality of Indian Docs have degraded that these chemist , helping assistant are doing way better than them. \n\nWhile on my trip to UK , had Consulted an derma , and he was phenomenal. To say it this way. Even if those specific breed of docs are in India I won't mind paying the shattering medical prices. But the problem with these Indian doc is , they want the same pay as in UK and US and working output is lower than an entry salesman. Common man has been left no other option to pay these guys. And expensive ones doesn't get you better, it's inversely proportional.",
        "Private Hospitals and clinics do this a lot every private hospital in my city is 4.5+ don’t pay attention to google reviews",
        "I had a bad experience with a maxillofacial surgeon in Kolkata. The doctor performed Condylectomy on both sides of my jaw. He had to cut open my jaws and during the tracheostomy, I heard him throwing slang towards his junior interns because they cut my throat wrong (!!?!!??). After the surgery the doctor kept my left jaw open and demanded we do a prosthetic surgery to \"cover it up\". We chose to dress the wound at home. Also I have calcification so the doctor said my issue may come back in future. Are all maxillofacial surgeons like this?",
        "Finally a sensible comment. Everyone's rushing to degrade the doctor without even confirming the authenticity of her claims. I feel like this is a troll post made to deliberately shame the doctor. There's no proof of her visits or payments, the story doesn't seem to add up too. Visited 5 doctors and decided to go with biopsy which is something she said none of the other doctors suggested.",
        "I am not saying she is deliberately trying to sabotage someone’s career but I and so many like me would like to substantial data to validate the claim",
        "My parents always used to take me to Primus for any medical advice or treatment since we live in a very close proximity to it. The waiting times were very long, sometimes 4 hours long! Not to mention that the advice they give is absolutely dogshit, I once went to orthopedist to get my flat foot checked and to know if there is anything we could do about it, we went to him twice and both the time he said the same thing, \" There are many Olympic runners who have flat foot\". Like what the fuck? I don't need to know if someone with flat foot is a runner ( I don't even know if it was true or he was just pulling stuff out of his ass), I just want to walk comfortably. \n\nThe people at Primus just assume that since they live in a posh area every patient will just shower them with money. \n\nEver since that incident I've always preferred to visit Max or Fortis, Because even though they are expensive they are 100 times better than Primus",
        "OP does not seem interested in doing that.",
        "I had meant about the case in another comment. I don't know why your dentist went for a biopsy. It is quite uncommon.",
        "True, most doctors there believe in minting money only. My family thought that since the hospital is in such a high end and posh location then atleast we can expect right treatment for good money.",
        "Yesss, please",
        "Thank you so much",
        "Not really. I have met some good ones too. No category of surgeons / doctors are bad altogether.",
        "I get it. Have seen many middle class aspirants drop for 3-4 years. I understand the costs involved. Doctors and private hospitals are free to charge whatever they want to. But atleast give the right treatment and have some accountability. Why should people suffer even after spending their hard earned money? :(",
        "All the very best!!! Hoping you make it this year and set the right example.",
        "I truly believe healthcare and education should be easily accessible to everyone. Both the sectors are collapsing.",
        "Yes please",
        "No, it isn't. My face looked absolutely fine before the biopsies.",
        "It isn't Mumps.",
        "Thank you",
        "I visited a dentist for treating my 10 yr old cavity in my upper jaw. My XRay report showed that my wisdom tooths are stuck and there is a knot formed around them. No symptoms at all. It just got detected by chance.",
        "You know what! I waited for 4 days before posting. But when all the other doctors said it was not needed at all. And the fact that she took no responsibility and instead shouted on my family pissed me off. My ethics don't allow me to do stuff for personal enemity. It is a genuinely pathetic experience. \n\nThanks for the support!",
        "Well yes that's what I'm asking OP to do. There is not much background info/reports in the post to explain or for me to understand.",
        "No symptoms. I went to a dentist for getting a cavity treated. By chance, the XRay report showed that my wisdom teeth are stuck and there are knots forming around them. No facial deformity was there.",
        "Well, your wish just came true. Anyways, it was a genuine case. 5+ OMFS were consulted once she did this to me and took no responsibility. Earlier, I had just taken opinion from 2 doctors who did not advise biopsy. But she insisted going for it for better treatment.",
        "I can post all the proofs. Took me 4 days to post this because even though she did wrong, I did not want to do this. But my misery was too much. And I consulted 5+ OMFS after she did this to me and took no responsibility. Earlier, I had consulted only 2 who didn't advise biopsy. But she insisted going for biopsy for better treatment. We trusted her because she was confident. \n\nLater on, not accepting responsibility and mindlessly shouting on my father isn't something she should have done. \n\nMistakes do happen, accept it. I wasn't even looking for an apology.",
        "It is always recommended that one should go for biopsy only after consulting more than 1 doctor because this is something you won’t be able to go back to stage where you were earlier in. Although,I can completely understand your stance but you can’t expect any random individual come in support with you just because you have made a post against someone . You have to share the concrete evidence too.",
        "Oh, Wishing you speedy recovery",
        "The doctor told us if you don't get it operated soon, it will fracture your jaw. They scare the family and then loot them. Even the most rational people fall for it at times. \n\nThis is not a personal attack against her. As a doctor, you got to take responsibility of the after effects of whatever procedures you perform. \n\nSure, I will come back with evidences. I have got them all.",
        "Please share .",
        "I will give my best to succeed and yes I will set the right example , will never loose my morality .... Promise",
        "Glad it isn't then"
    ],
    "cleaned_text": "doctors hospitals say money money money ethics take backseat shattered say least recent experience dated july dr shreya krishna pathetic consulted primus super speciality hospital chanakyapuri new delhi oncall oral maxillofacial surgeon firstly insisted performing biopsy even though advised anywhere else trusted agreed one biopsy insisted one day charged rs even though informed rs initially next day biopsies face swelled looked like facial deformity traumatizing see every random person giving looks ghost concerned exorbiant swelling informed doctor visited absolutely refused take responsibility shamelessly said cant anything asked wait mins biopsy report worried hour long wait father walked asked reports status started shouting father even audacity tell take previous reports consult someone else stooped low even mentioned india kahin ilaaz ni milega aise patients expected wait silently hours doctor refuses hold responsibility well thankful asking consult someone else thats good dr shreya believes minting money performing unnecessary procedures ethics humanity dont know performs surgeries attitude please favour consulting google ratings include ratings supporting staff primus believe doctors rating decided patients maybe different dont understand management primus hospital afford untrained unprofessional staff hospital high end posh location waste hard earned money hospital ",
    "cleaned_title": "doctors hospitals say money money money ethics take backseat",
    "cleaned_selftext": "shattered say least recent experience dated july dr shreya krishna pathetic consulted primus super speciality hospital chanakyapuri new delhi oncall oral maxillofacial surgeon firstly insisted performing biopsy even though advised anywhere else trusted agreed one biopsy insisted one day charged rs even though informed rs initially next day biopsies face swelled looked like facial deformity traumatizing see every random person giving looks ghost concerned exorbiant swelling informed doctor visited absolutely refused take responsibility shamelessly said cant anything asked wait mins biopsy report worried hour long wait father walked asked reports status started shouting father even audacity tell take previous reports consult someone else stooped low even mentioned india kahin ilaaz ni milega aise patients expected wait silently hours doctor refuses hold responsibility well thankful asking consult someone else thats good dr shreya believes minting money performing unnecessary procedures ethics humanity dont know performs surgeries attitude please favour consulting google ratings include ratings supporting staff primus believe doctors rating decided patients maybe different dont understand management primus hospital afford untrained unprofessional staff hospital high end posh location waste hard earned money hospital",
    "cleaned_comments": "google linkhttpswwwgooglecommapsreviewsdatammmmschzdsuhnmgnsvjqfnsurkctktelveaemsxxbdcefbadmscihmogkeicagidjqzuwccgwisjypqyqqpvwswechlenus primus hospitalhttpswwwgooglecommapsreviewsdatammmmschddsuhnmgnsvjqfnsurketdiohfrrabmsxxecdeebbmscihmogkeicagidjybqweccgsivpwpqyqioncachlenus sympathize plightweve endured similaryour post probably removed identifying facility physician name edit post censor information upvoted im doctor give diagnosis reason biopsy sorry hear similar experience undoubtedly indias healthcare system struggling currently seeing exorbiant swelling doctor started justifying follow protocol thats biopsy done consulted omfs said required case although dont deny system faultless wouldnt assume everybody rob money surgeon first priority would also limb salvage much possible dont luxury knowing details case im sorry go ordeal whole point post name shame people already know pathetic situation private medical services india lots cases guess best get atleast traction post taken hospital seems star star reviews thats huge redflag possibly lots reviews staff management please take care guys know guys rating gira thats best name shame businesses businessmen take commonman ride money police pocket op admin removes posts post attached proofs things came kaise nahi rehne denge post bhai review bhi dal dena kal ek maine dal diya sue medical negligence post rlegaladviceindia mumps isnt lets bring rating star people dont waste hardearned money yessssss comment visibility wish recovery wish speedy recovery left review others dont fall scam power op calling fraud doctor victim malpractice imperative ensure form accountability medical system close none name shame common person resources lot greedy professionals ulterior motives easy accsess shirk responsibility dangerous masses rightly called tbh india doctor khud bhi majbur h drop le ke neet clear karo phir loan le ke padhai karo years tak jb aadmi doctor banta h morality backseat pe hti h bhai financial well banane ke chakkar mai sb sahi lgta h looks like could mumps one possibility would suggest also see infectious diseases specialist doctor internal medicine specialist unlikely dentist would know mumps test would viral test mumps viral disease contagious would recommend people around take precaution keep minimal physical contact things things may touchuse prevent spread till know yeah ever complain goverment providing quality education cheap citizens bhai sb copium mai h kisi sabko pta h government kuch nhi karegi youre gon na go someones career built decade reddit post without knowing anything case consult lawyer make sense file lawsuit swelling due biopsy due condition getting checked thats gather description mumps ask suspected diagnosis required biopsy protocol followed another red flag good reviews ai generated exactly scary dentist one person could come tell anything without proof thousands people would take upon destroy initial symptoms mera rd drop hai one yes people wan na support know eh one yes people wan na support know eh thanks mora science mai ab inn sab cheezo se upar uth chuka hu doctor im really sorry face issue please get legal counsel earliest secondly unfortunate event near dear ones subjected invasive procedure ask doctor regarding indications complications alternatives applicable help lot please put google maps link make sure true reviews every surgeon consulted denied need biopsy required doctor run away treating exorbiant swelling told take away reports consult someone else doctor cleary said swelling could increase cant anything true seen star ratings supporting staff thank thanks support true healthcare system sucks common man upvote visibility offense atleast attach payment bill proof nal looks like grounds lawsuit want people reddit give negative rating need post consultation slips bills fully sympathise really hope recover fast per post clear biopsy recommended doctor go intuition doctors agreed recommendation biopsy go would suggest add relevant info please write post communities also consult mean reasons going hospital symptoms reported review mistreatment lol digital marketing profession dude doctor isnt biopsy done proof need biopsy tbh india doctors pathetic consulted vmmc mamc aiims delhi bhopal jodhpur bhubaneswar govt docs worst least bothered would stick diagnosis everyone irrespective age good experience pvt guys mbbs pvt practising also clause pretty huge repo space heavenly experience one able deliver felt actually relieved paying consulting fees recovery stipulated time else various experience ukrainian russian docs aiims doc especially practising private black money linked clinic literally speaking script giving diagnosis prude salesman like late got less time others selling various treatment horrible one could tell typewriter voice also wrong tbh never really went wrong chemistpharmacy medicine work pocket friendly promoting jhola chaap doctors saying quality indian docs degraded chemist helping assistant way better trip uk consulted derma phenomenal say way even specific breed docs india wont mind paying shattering medical prices problem indian doc want pay uk us working output lower entry salesman common man left option pay guys expensive ones doesnt get better inversely proportional private hospitals clinics lot every private hospital city dont pay attention google reviews bad experience maxillofacial surgeon kolkata doctor performed condylectomy sides jaw cut open jaws tracheostomy heard throwing slang towards junior interns cut throat wrong surgery doctor kept left jaw open demanded prosthetic surgery cover chose dress wound home also calcification doctor said issue may come back future maxillofacial surgeons like finally sensible comment everyones rushing degrade doctor without even confirming authenticity claims feel like troll post made deliberately shame doctor theres proof visits payments story doesnt seem add visited doctors decided go biopsy something said none doctors suggested saying deliberately trying sabotage someones career many like would like substantial data validate claim parents always used take primus medical advice treatment since live close proximity waiting times long sometimes hours long mention advice give absolutely dogshit went orthopedist get flat foot checked know anything could went twice time said thing many olympic runners flat foot like fuck dont need know someone flat foot runner dont even know true pulling stuff ass want walk comfortably people primus assume since live posh area every patient shower money ever since incident ive always preferred visit max fortis even though expensive times better primus op seem interested meant case another comment dont know dentist went biopsy quite uncommon true doctors believe minting money family thought since hospital high end posh location atleast expect right treatment good money yesss please thank much really met good ones category surgeons doctors bad altogether get seen many middle class aspirants drop years understand costs involved doctors private hospitals free charge whatever want atleast give right treatment accountability people suffer even spending hard earned money best hoping make year set right example truly believe healthcare education easily accessible everyone sectors collapsing yes please isnt face looked absolutely fine biopsies isnt mumps thank visited dentist treating yr old cavity upper jaw xray report showed wisdom tooths stuck knot formed around symptoms got detected chance know waited days posting doctors said needed fact took responsibility instead shouted family pissed ethics dont allow stuff personal enemity genuinely pathetic experience thanks support well yes thats im asking op much background inforeports post explain understand symptoms went dentist getting cavity treated chance xray report showed wisdom teeth stuck knots forming around facial deformity well wish came true anyways genuine case omfs consulted took responsibility earlier taken opinion doctors advise biopsy insisted going better treatment post proofs took days post even though wrong want misery much consulted omfs took responsibility earlier consulted didnt advise biopsy insisted going biopsy better treatment trusted confident later accepting responsibility mindlessly shouting father isnt something done mistakes happen accept wasnt even looking apology always recommended one go biopsy consulting doctor something wont able go back stage earlier althoughi completely understand stance cant expect random individual come support made post someone share concrete evidence oh wishing speedy recovery doctor told us dont get operated soon fracture jaw scare family loot even rational people fall times personal attack doctor got take responsibility effects whatever procedures perform sure come back evidences got please share give best succeed yes set right example never loose morality promise glad isnt",
    "light_cleaned_title": "Doctors and Hospitals say 'Money, Money and Money', Ethics take a backseat",
    "light_cleaned_selftext": "I am shattered, to say the least. My recent experience dated July 19 and 20, 2023 with Dr. Shreya Krishna is pathetic. I consulted her in Primus Super Speciality hospital, Chanakyapuri, New Delhi where she is an on-call Oral and Maxillofacial surgeon. Firstly, she insisted on performing a biopsy even though it was not advised anywhere else. We trusted her and agreed for it. After one biopsy, she insisted on having the other one the same day. We were charged Rs. 15000 for the same even though were informed about Rs. 2000 only initially. The next day after biopsies, my face swelled and looked like as if there is a facial deformity. It was traumatizing to see every random person giving me looks as if I am a ghost. Concerned about the exorbiant swelling, I informed the doctor and visited her. She absolutely refused to take any responsibility and shamelessly said that we can't do anything about it. We were asked to wait for 10 mins for the biopsy report. Worried after an hour long wait, my father walked in and asked about the report's status. She started shouting on my father. Even had the audacity to tell him to take my previous reports and consult someone else. Stooped so low that even mentioned 'India m kahin ilaaz ni milega aise'? Are patients expected to wait silently for hours when doctor refuses to hold responsibility? Well, I am thankful to her for asking me to consult someone else. That's the only good she did to me. Dr. Shreya believes in minting money by performing unnecessary procedures. No ethics and humanity. I don't know how she performs surgeries with this attitude. Please do yourself a favour by not consulting her. Her Google ratings include ratings from the supporting staff in Primus. I believe a doctor's rating is decided by patients. Maybe, it's different for her. I don't understand how the management of Primus hospital can afford such untrained and unprofessional staff in a hospital at such a high end and posh location. Do not waste your hard earned money at this hospital.",
    "light_cleaned_comments": "[Google link](https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKcTktelV3EAE!2m1!1s0x0:0xbdce4fb731a859d0!3m1!1s2@1:CIHM0ogKEICAgIDJq9-zUw%7CCgwI2sjypQYQqPvwswE%7C?hl=en-US) [Primus hospital](https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKeTdiOHF3RRAB!2m1!1s0x0:0x15e3c02de46eb6b6!3m1!1s2@1:CIHM0ogKEICAgIDJy7b8qwE%7CCgsI9vPwpQYQiO_NCA%7C?hl=en-US) While I do sympathize with your plight--we've all endured similar--your post will most probably be removed for identifying the facility and physician by name. You should edit your post to censor this information. upvoted I'm a doctor. Did they give any diagnosis or reason for biopsy? Sorry to hear that you had a similar experience. Undoubtedly, India's healthcare system is struggling currently. No. Only after seeing exorbiant swelling, the doctor started justifying that I follow the protocol that's why biopsy was done. I have consulted 5+ OMFS and all of them said it is not required in my case. Although i dont deny our system is faultless, i wouldnt assume everybody are here to rob your money. As a surgeon myself my first priority would also have been limb salvage as much as possible. But i dont have the luxury knowing the details of the case. Im sorry you had to go through such an ordeal. The whole point of the post is to name and shame. People already know the pathetic situation of private medical services in India in lots of cases. I guess it's best to get atleast some traction before the post is taken down. This hospital seems to have only 5 star and 1 star reviews. That's a huge redflag. Possibly lots of 5 reviews by staff and management. Please take care of yourself. Guys we know what we have to do. Guys rating gira do. That's the best we can do for her. Name and shame Businesses and Businessmen who take the commonman for a ride as they have money and police in pocket, @OP if Admin removes such posts, then do a post again but with attached proofs of how things came to be too... Kaise nahi rehne denge post. Bhai review bhi dal dena kal ek, maine dal diya. Sue her for medical negligence. Post this in r/legaladviceindia too This is Mumps, isn't it Let's bring the rating to 1 star, so other people don't waste their hard-earned money here. Yessssss Comment for visibility I wish for your recovery. Wish you a speedy recovery, left a review so others don't fall for such scam More power to you OP for calling a fraud doctor out. As a victim of malpractice too, it is imperative we ensure some form of accountability in the medical system, but their is close to none, and name shame is the most a common person can do with the resources they have. A lot of greedy professionals with ulterior motives and easy accsess to shirk responsibility are very dangerous for the masses and should be rightly called out. Tbh india doctor khud bhi majbur h 3-4 drop le ke neet clear Karo phir loan le ke padhai Karo 10+ years Tak ......jb aadmi doctor Banta h to morality backseat pe hti h .... Bhai financial well being banane ke chakkar Mai SB sahi lgta h This looks like it could be Mumps (one possibility). I would suggest you also see an Infectious Diseases specialist Doctor or an Internal Medicine specialist. It is unlikely that a dentist would know if it is Mumps (the test for this would be a viral test). Mumps is a viral disease and contagious. I would recommend people around you take precaution and keep minimal physical contact with things you or things you may touch/use (to prevent spread and till you know what it is). Yeah, but do they ever complain about goverment not providing quality education for cheap to its citizens? Bhai SB copium mai h kisi sabko pta h government kuch nhi karegi... You're gonna go after someone's career built over more than a decade over a reddit post without knowing anything about the case? Did you consult a lawyer, does it make sense to file a lawsuit ? The swelling is due to the biopsy and not due to the condition for which she was getting checked. That’s what I gather from her description. So not mumps You can ask for the suspected diagnosis which required the biopsy and the protocol followed. Another red flag is, the good reviews are all AI generated. Exactly ! It's scary being a dentist myself. Just one person could come and tell anything, without any proof, and thousands of people would take it upon them to destroy them. What were your initial symptoms? Mera 3rd drop hai 😞 Is this the one? If yes then people who wanna support her know what to do eh!!!! Is this the one? If yes then people who wanna support her know what to do eh!!!! Thanks for mora science but mai ab inn sab cheezo se upar uth chuka hu As a doctor myself, I’m really sorry you had to face this issue. Please do get legal counsel at the earliest. Secondly, if in the unfortunate event with you or any of your near and dear ones are subjected to an invasive procedure, ask the doctor regarding the indications, complications and alternatives (if applicable). This will help you a lot. Please put her google maps link. We will make sure she has true reviews about her. Every other surgeon I have consulted denied the need for a biopsy. If at all it was required, then can the doctor run away from treating the exorbiant swelling? I was told to take away my reports and consult someone else. The doctor cleary said swelling could increase, we can't do anything about it. True. I have seen some 5 star ratings from the supporting staff. Thank you. Thanks for the support. True, the healthcare system sucks for common man. *upvote for visibility* No offense to you, but can you atleast attach a payment bill as proof ? NAL Looks like you have grounds for a lawsuit. If you want people of Reddit to give negative rating, then you need to post all the consultation slips and bills . I fully sympathise with you and I really hope you recover fast because as per your post it is not clear why biopsy was recommended by that doctor and you did not go by the intuition of 5 doctors but you agreed to her recommendation of biopsy in a go. I would suggest you to add more relevant info . Please write your post on other communities also. Why did you consult her? I mean what were your reasons for going to the hospital? Your symptoms? Reported there in the review about mistreatment. Lol, digital marketing is a profession dude Not a doctor but isn't biopsy done when you have proof that you need to do biopsy? Tbh. In India Doctors are pathetic, have consulted From VMMC, MAMC to AIIMS- Delhi, bhopal, Jodhpur and bhubaneswar. Govt. Docs are worst they are least bothered, would stick the same diagnosis to everyone irrespective of the age. Had a few good experience in pvt (again guys who did their MBBS from pvt) practising in their own. Also Clause being they had pretty huge repo in the space. With heavenly 20-23 experience, they were the one who were Able to deliver. And felt actually relieved paying their Consulting fees , and had my recovery in the stipulated time. Else had various experience where in these Ukrainian and Russian docs and AIIMS doc especially practising private in their black money linked clinic, were literally speaking script. And giving the same diagnosis, and they were on prude being salesman, like you are late, you got less time and others. And selling various treatment. They were so horrible in that , one could tell it from her typewriter voice. Also this is very wrong, but tbh I never really went wrong with chemist/pharmacy medicine. They work and are pocket friendly. Again I am not promoting jhola chaap doctors. I am saying the quality of Indian Docs have degraded that these chemist , helping assistant are doing way better than them. While on my trip to UK , had Consulted an derma , and he was phenomenal. To say it this way. Even if those specific breed of docs are in India I won't mind paying the shattering medical prices. But the problem with these Indian doc is , they want the same pay as in UK and US and working output is lower than an entry salesman. Common man has been left no other option to pay these guys. And expensive ones doesn't get you better, it's inversely proportional. Private Hospitals and clinics do this a lot every private hospital in my city is 4.5+ don’t pay attention to google reviews I had a bad experience with a maxillofacial surgeon in Kolkata. The doctor performed Condylectomy on both sides of my jaw. He had to cut open my jaws and during the tracheostomy, I heard him throwing slang towards his junior interns because they cut my throat wrong (!!?!!??). After the surgery the doctor kept my left jaw open and demanded we do a prosthetic surgery to \"cover it up\". We chose to dress the wound at home. Also I have calcification so the doctor said my issue may come back in future. Are all maxillofacial surgeons like this? Finally a sensible comment. Everyone's rushing to degrade the doctor without even confirming the authenticity of her claims. I feel like this is a troll post made to deliberately shame the doctor. There's no proof of her visits or payments, the story doesn't seem to add up too. Visited 5 doctors and decided to go with biopsy which is something she said none of the other doctors suggested. I am not saying she is deliberately trying to sabotage someone’s career but I and so many like me would like to substantial data to validate the claim My parents always used to take me to Primus for any medical advice or treatment since we live in a very close proximity to it. The waiting times were very long, sometimes 4 hours long! Not to mention that the advice they give is absolutely dogshit, I once went to orthopedist to get my flat foot checked and to know if there is anything we could do about it, we went to him twice and both the time he said the same thing, \" There are many Olympic runners who have flat foot\". Like what the fuck? I don't need to know if someone with flat foot is a runner ( I don't even know if it was true or he was just pulling stuff out of his ass), I just want to walk comfortably. The people at Primus just assume that since they live in a posh area every patient will just shower them with money. Ever since that incident I've always preferred to visit Max or Fortis, Because even though they are expensive they are 100 times better than Primus OP does not seem interested in doing that. I had meant about the case in another comment. I don't know why your dentist went for a biopsy. It is quite uncommon. True, most doctors there believe in minting money only. My family thought that since the hospital is in such a high end and posh location then atleast we can expect right treatment for good money. Yesss, please Thank you so much Not really. I have met some good ones too. No category of surgeons / doctors are bad altogether. I get it. Have seen many middle class aspirants drop for 3-4 years. I understand the costs involved. Doctors and private hospitals are free to charge whatever they want to. But atleast give the right treatment and have some accountability. Why should people suffer even after spending their hard earned money? :( All the very best!!! Hoping you make it this year and set the right example. I truly believe healthcare and education should be easily accessible to everyone. Both the sectors are collapsing. Yes please No, it isn't. My face looked absolutely fine before the biopsies. It isn't Mumps. Thank you I visited a dentist for treating my 10 yr old cavity in my upper jaw. My XRay report showed that my wisdom tooths are stuck and there is a knot formed around them. No symptoms at all. It just got detected by chance. You know what! I waited for 4 days before posting. But when all the other doctors said it was not needed at all. And the fact that she took no responsibility and instead shouted on my family pissed me off. My ethics don't allow me to do stuff for personal enemity. It is a genuinely pathetic experience. Thanks for the support! Well yes that's what I'm asking OP to do. There is not much background info/reports in the post to explain or for me to understand. No symptoms. I went to a dentist for getting a cavity treated. By chance, the XRay report showed that my wisdom teeth are stuck and there are knots forming around them. No facial deformity was there. Well, your wish just came true. Anyways, it was a genuine case. 5+ OMFS were consulted once she did this to me and took no responsibility. Earlier, I had just taken opinion from 2 doctors who did not advise biopsy. But she insisted going for it for better treatment. I can post all the proofs. Took me 4 days to post this because even though she did wrong, I did not want to do this. But my misery was too much. And I consulted 5+ OMFS after she did this to me and took no responsibility. Earlier, I had consulted only 2 who didn't advise biopsy. But she insisted going for biopsy for better treatment. We trusted her because she was confident. Later on, not accepting responsibility and mindlessly shouting on my father isn't something she should have done. Mistakes do happen, accept it. I wasn't even looking for an apology. It is always recommended that one should go for biopsy only after consulting more than 1 doctor because this is something you won’t be able to go back to stage where you were earlier in. Although,I can completely understand your stance but you can’t expect any random individual come in support with you just because you have made a post against someone . You have to share the concrete evidence too. Oh, Wishing you speedy recovery The doctor told us if you don't get it operated soon, it will fracture your jaw. They scare the family and then loot them. Even the most rational people fall for it at times. This is not a personal attack against her. As a doctor, you got to take responsibility of the after effects of whatever procedures you perform. Sure, I will come back with evidences. I have got them all. Please share . I will give my best to succeed and yes I will set the right example , will never loose my morality .... Promise Glad it isn't then"
}