{
    "id": "15as0gc",
    "title": "Delhivery took out my Adidas hoodie from the package.",
    "url": "https://www.reddit.com/gallery/15as0gc",
    "selftext": "On 21st this month I sent a package from Gurgaon to Bangalore via Delhivery to my sister's place. The package had miscellaneous items and also had a Adidas hoodie which was in a poly bag and packed tightly. Upon delivery on 24th I was there myself in BLR to receive it. The delivery guy gave it to our security guard and left which is normal. But when I took the package I saw some cut/torn marks on the sides. \n\nI packed my box in such a way that all the openings had a tape on it and full box was bubblewrapped.\n\nOn delhivery it was torn a bit, so I started taking photos and videos bcz I was suspicious and then I removed the bubblewrap and saw a huge cut on the box and my Adidas hoodie was missing. I'm 100% sure that I packed it. Now delhivery support number is just IVR and doesn't accept the complaints. I raised a ticket but got a response a day later and they asked for unboxing pics and videos and I sent them all in email. Haven't heard back yet, it's been 2 days. What are my options? Does anyone know any contact higher up in delhivery that can help me ?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690432789.0,
    "convurl": "https://i.redd.it/p6onffiksfeb1.jpg",
    "comments": [
        "Go to their warehouse/office closest to your delivery location."
    ],
    "cleaned_text": "delhivery took adidas hoodie package st month sent package gurgaon bangalore via delhivery sisters place package miscellaneous items also adidas hoodie poly bag packed tightly upon delivery th blr receive delivery guy gave security guard left normal took package saw cuttorn marks sides packed box way openings tape full box bubblewrapped delhivery torn bit started taking photos videos bcz suspicious removed bubblewrap saw huge cut box adidas hoodie missing im sure packed delhivery support number ivr doesnt accept complaints raised ticket got response day later asked unboxing pics videos sent email havent heard back yet days options anyone know contact higher delhivery help ",
    "cleaned_title": "delhivery took adidas hoodie package",
    "cleaned_selftext": "st month sent package gurgaon bangalore via delhivery sisters place package miscellaneous items also adidas hoodie poly bag packed tightly upon delivery th blr receive delivery guy gave security guard left normal took package saw cuttorn marks sides packed box way openings tape full box bubblewrapped delhivery torn bit started taking photos videos bcz suspicious removed bubblewrap saw huge cut box adidas hoodie missing im sure packed delhivery support number ivr doesnt accept complaints raised ticket got response day later asked unboxing pics videos sent email havent heard back yet days options anyone know contact higher delhivery help",
    "cleaned_comments": "go warehouseoffice closest delivery location",
    "light_cleaned_title": "Delhivery took out my Adidas hoodie from the package.",
    "light_cleaned_selftext": "On 21st this month I sent a package from Gurgaon to Bangalore via Delhivery to my sister's place. The package had miscellaneous items and also had a Adidas hoodie which was in a poly bag and packed tightly. Upon delivery on 24th I was there myself in BLR to receive it. The delivery guy gave it to our security guard and left which is normal. But when I took the package I saw some cut/torn marks on the sides. I packed my box in such a way that all the openings had a tape on it and full box was bubblewrapped. On delhivery it was torn a bit, so I started taking photos and videos bcz I was suspicious and then I removed the bubblewrap and saw a huge cut on the box and my Adidas hoodie was missing. I'm 100% sure that I packed it. Now delhivery support number is just IVR and doesn't accept the complaints. I raised a ticket but got a response a day later and they asked for unboxing pics and videos and I sent them all in email. Haven't heard back yet, it's been 2 days. What are my options? Does anyone know any contact higher up in delhivery that can help me ?",
    "light_cleaned_comments": "Go to their warehouse/office closest to your delivery location."
}