{
    "id": "17c58s0",
    "title": "Beware of JIO, they are absolutely the worst out there!",
    "url": "https://www.reddit.com/r/india/comments/17c58s0/beware_of_jio_they_are_absolutely_the_worst_out/",
    "selftext": "On 15th Oct 2023, we called their customer service helpline in India and asked if it's possible to transfer my eSIM profile from my old phone to new phone. I'm currently living outside India and in UAE, and did some research on this topic a bit and found that it is definitely possible with those who have Airtel as their network provider. \n\nSo we verified about this by calling the customer service and they told to send an email to [care@jio.com](mailto:care@jio.com) with all the necessary documents to do the process outside India. I send them an email and even they reply saying they will gladly assist me with this, and asked me to fill some CRF form, asked all my documents like Passport, VISA, etc. Now they take more than 24 hours to reply to each mail, and in each day they keep telling me to change one thing or another instead of properly giving the instructions at the start itself. I had initially filled the form using iPad digitally and they made me submit the form again by taking a print, filling it physically and scanning it (it makes no sense at all, but I still did). \n\nThis back and forth happens from 15th Oct - 20 Oct, and now suddenly they are saying according to DOT guidelines it is not possible to do so. Why the fuck did they waste my time earlier with all this drama if it was not possible? I swear I'm not making this up, and I would recommend others who might be in similar situation as mine to be careful and not get JIO eSIM if they are moving out of India.\n\nI've added necessary screenshots of the mail conversation in this twitter thread: https://x.com/rohit901/status/1715259029054726172?s=20",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697786063.0,
    "convurl": "https://external-preview.redd.it/GzX2JmpMPLXw4h0OUD16GXdhRvfpuFbkMuHivIgP0nc.jpg?auto=webp&s=0aa6f1e1881aa18fae0e1b0201d50ba2aeb23ed0",
    "comments": [
        "Never be a reliance customer. The only worthwhile relationship with the group is as a shareholder. \n\nI heard this advice from my dad’s stock broker in the 90s. Not a lot has changed since.",
        "Yeah I think that’s why monopoly of any form is bad ultimately for the consumers themselves",
        "Correct."
    ],
    "cleaned_text": "beware jio absolutely worst th oct called customer service helpline india asked possible transfer esim profile old phone new phone im currently living outside india uae research topic bit found definitely possible airtel network provider verified calling customer service told send email carejiocommailtocarejiocom necessary documents process outside india send email even reply saying gladly assist asked fill crf form asked documents like passport visa etc take hours reply mail day keep telling change one thing another instead properly giving instructions start initially filled form using ipad digitally made submit form taking print filling physically scanning makes sense still back forth happens th oct oct suddenly saying according dot guidelines possible fuck waste time earlier drama possible swear im making would recommend others might similar situation mine careful get jio esim moving india ive added necessary screenshots mail conversation twitter thread ",
    "cleaned_title": "beware jio absolutely worst",
    "cleaned_selftext": "th oct called customer service helpline india asked possible transfer esim profile old phone new phone im currently living outside india uae research topic bit found definitely possible airtel network provider verified calling customer service told send email carejiocommailtocarejiocom necessary documents process outside india send email even reply saying gladly assist asked fill crf form asked documents like passport visa etc take hours reply mail day keep telling change one thing another instead properly giving instructions start initially filled form using ipad digitally made submit form taking print filling physically scanning makes sense still back forth happens th oct oct suddenly saying according dot guidelines possible fuck waste time earlier drama possible swear im making would recommend others might similar situation mine careful get jio esim moving india ive added necessary screenshots mail conversation twitter thread",
    "cleaned_comments": "never reliance customer worthwhile relationship group shareholder heard advice dads stock broker lot changed since yeah think thats monopoly form bad ultimately consumers correct",
    "light_cleaned_title": "Beware of JIO, they are absolutely the worst out there!",
    "light_cleaned_selftext": "On 15th Oct 2023, we called their customer service helpline in India and asked if it's possible to transfer my eSIM profile from my old phone to new phone. I'm currently living outside India and in UAE, and did some research on this topic a bit and found that it is definitely possible with those who have Airtel as their network provider. So we verified about this by calling the customer service and they told to send an email to [care@jio.com](mailto:care@jio.com) with all the necessary documents to do the process outside India. I send them an email and even they reply saying they will gladly assist me with this, and asked me to fill some CRF form, asked all my documents like Passport, VISA, etc. Now they take more than 24 hours to reply to each mail, and in each day they keep telling me to change one thing or another instead of properly giving the instructions at the start itself. I had initially filled the form using iPad digitally and they made me submit the form again by taking a print, filling it physically and scanning it (it makes no sense at all, but I still did). This back and forth happens from 15th Oct - 20 Oct, and now suddenly they are saying according to DOT guidelines it is not possible to do so. Why the fuck did they waste my time earlier with all this drama if it was not possible? I swear I'm not making this up, and I would recommend others who might be in similar situation as mine to be careful and not get JIO eSIM if they are moving out of India. I've added necessary screenshots of the mail conversation in this twitter thread:",
    "light_cleaned_comments": "Never be a reliance customer. The only worthwhile relationship with the group is as a shareholder. I heard this advice from my dad’s stock broker in the 90s. Not a lot has changed since. Yeah I think that’s why monopoly of any form is bad ultimately for the consumers themselves Correct."
}