{
    "id": "14kvvny",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/14kvvny/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687915812.0,
    "convurl": "https://a.thumbs.redditmedia.com/gNJZMm9aGqgPv5G-HynS9HZ3V2aN5G64HxcOekLgbS8.jpg",
    "comments": [
        "My self post was removed because of: 'Generic Rants/Discussion Post' and was told to post  in the daily discussion thread that is a sticky on the sub.\n\nNSFW, TW, SA\n\nEdit 1: sent it to multiple outlets but they rejected it for being too triggering, i just had to find a home for it anyway.\n....\n\nIt starts with preying eyes; I don't know how easy to spot these things are and I wonder what gives it away. Is it the anxious transfer of weight from one leg to another, is it the nervous glances around the room, is it the pressing further back into the already secluded corner trying to make yourself smaller, unnoticeable? But the attention comes, they see you fidgeting, awkwardly nursing your sixth glass of the evening, how do they know it's your sixth? Because they had been trying to get to your previous five. They offer you a harmless glass of water, off the counter, two lemon wedges floating refreshingly. You can't help but titter at the unexpected thoughtfulness and you take it from him.\n\nIt is an easy conversation, he seems to know a lot of things about a lot of things, he makes every niche feel mainstream. The conversation flows so freely you don't want it to end, but you feel your eyes tire, the social battery draining. That was fast you think, then there is a slight buildup of pressure behind your right eyeball, you know it's the start of a terrible migraine that's going to last a week but maybe if you pass out now, choke yourself full with ibuprofen and ondansetron that you can still make it through the night. Thankfully, the kind guy notices, it's his friend's house and his sister get migraines all the time. He knows just the room you can retire to, no sounds reach in he assures, but you don't have the time to think that no sound comes out either.\n\nHe cozies up the bed, gives you proper neck support, and even an eye-mask. Your last drifting, sensible thought is that there is still some kindness left in the world but soon the darkness takes you and you hear the door close.\n\nIt starts with the preying eyes, that had been fixated on a lot of faces that night. Even passed out you notice the door crack open from that small gap where the eye-mask doesn't curve itself right. You try to ask who it is but you are too tired and the words don't quite form themselves well, they never escape your mouth just like the sound doesn't escape this room and then the door closes.\n\nA long time seems to pass before the second sound registers or has it only been a minute? you hear the belt buckle unfasten, as it frees itself from each hoop it summons a memory from your forgotten cranial crevices, the sound of belt striking bare flesh, when the buckle rang like a steely tail tip of a venomous snake and then it strikes your present. You feel it on your thighs and it opens all old scars including the physical ones, you become numbingly aware of the blood it has drawn because you feel the warmth of it on your cold legs, giving rise to a tempest of feelings of being scared, guilty, and sadness, that's when you feel the shape of an ear breathing into your nape, you can't make out the name he says but you are aware of the anger and hurt behind that name, you know it brings him a lot of anguish to even say it, and you feel bad for him but do you feel enough of it to let him have his way with you if it alleviates his pain, because your threshold is higher, you try to find some rationality in this act, maybe you can absorb his pain within yours like you are doing with his smell; of lingering smokes, rum and a woman's perfume, perhaps pried from someone who didn't want it either earlier that night .\n\nSuddenly the smell is now the smell of your fear, you will forever hate this brand of whiskey, he whispers something in your ear, is it a sorry or do you imagine it. You feel a ball of bile and unuttered cries in your throat, it grows bigger but your breaths aren't making it through, you try to recall albeit vaguely a coping strategy. What was it? Notice what's happening around you instead of what's happening inside of you. But it's just so difficult to ignore, the knot coiling, tightening inside your chest, you are aware of your heart going at it like if the skin were any thinner and there was no sternum to catch it, you'd see the shape of it like some old cartoon show. Your mind travels to other parts of your body (does it still belong to you?) your hands are held down, your fingertips feel sore, it's his flesh on the underside of your nails, it's his flesh on the inside of you.\n\nYou are reminded of trying to rescue your favorite ball from an abandoned burrow, first you dug the loose earth with your fingers, then with your tools, trying to catch a glimpse, but he was burrowing inside of you looking for what? What is it that you had inside of you anyway but pain and a void which was now coupled with this seething guilt?",
        "\"You brought this upon yourself”, you hear a voice from your past. \"Are you going out wearing that?\" Echoes a maternally taunting voice in the recesses of your memories. \"You look like a fucking whore\" comes another quip; you try to cover yourself with a sheet but his hands are holding yours down so goddamn hard. He weighs more than you but it almost feels like a weighted blanket, isn't this technically a hug if you rationalize this enough? suggests the bit that uses self-deprecating humor to cope.\n\nYou draw back your nails from digging into your palm, you open your fists and you can feel him feeling this too. You are no longer resisting; your flesh tells him as it relaxes around his. She has consented he thinks and his stance becomes almost loving. The arch of his back releases from that position of an attacking wolf to a passionate lover. You embrace him then because you don't want to feel so alone right now, you disassociate yourself enough to make this embrace feel like that of a caring friend and you feel him breakdown, his tears come to know yours intimately. It almost poetic you feel him breakdown inside of you. He spills out of you but he also spills you out of you too as his hands slowly leave yours. You see him fading into the dark, into muffled sounds of music. You feel a piece of you, taken away forever. A part of your glow, that's scarred and, in his hands, he will do with it as he deems fit, maybe he will share it with the world, he will brag about it, and one day it will make its way back to you and you will refuse to recognize it then, but for now it was over.\n\nYou don't want to move, you can't. Is it the pain? Or the shame? You can't quite tell. You feel like if you stay there longer you will probably wake up in your bed like you used to magically when you were little, up until you started having your own opinions, before the physical abuse started, before evenings reeked of alcohol and contempt. But you can’t, you want to wake up and wash yourself but you don't want him to drip any lower, desecrating other parts of your body, you don’t want him to claim any more of you than what he already had, so you just wait.\n\nYou hear a familiar song being hummed but you can't call out, although it stops abruptly. The door is now open. Your best friend has walked in on you in many an embarrassing situation but none of them will scar him so. He closes the door behind him and walks up to you, there is fear in his stance or is it disgust you see because who lets anyone do this to them, only whores and at least they get paid. He touches your neck and you flinch. You don’t want him to catch that smell and spread it, it will be like spreading the word of what had just happened. He wipes you down gently, like you were newly born the way they wash the newly dead, you are overwhelmed with emotions but he is very gentle, it wasn't something he had to forcefully enter, it was a place of hurt and unspeakable shame, something he had had his unfortunate share of.\n\n\"Did you see who he was” he asks, you look at the eye mask, \"You are still bleeding, do you have pads on you? actually never mind I will bring them\". Few minutes later he appears and puts your cloth back on, \"thank god you are wearing black, the blood won’t show through for a while\", talk about a silver lining. \"Can you walk?\" But you can’t so he makes you sniff on something which you deeply inhale and feel some warmth and sense return.\n\n\"Are you going to report this? because as much as I want to come with I can’t, it does a number on me to be near police stations\". His expression communicates much more than his words and together you both embark upon your walk of shame. People know he is gay so it is probably just you who has gone wild and passed out. He is just taking you home. You bleed through the pads onto the stairs, leaving a mark behind you. \"It could be a fissure; you need to see a doctor\" he suggests. \"I know someone, he is not a doctor but he qualifies he has handled it before.\"\n\n\"It is a fissure; you have lost a lot of blood. I will give you some pills, it's a routine b plan and something to help with coagulation and nightmares. I do want you to get some tests done as soon as you can. Wait until tomorrow so it doesn’t react with whatever you have in your system right now”. You want to tell him it wasn’t the whatever but whoever you had inside your system that needed addressing.\n\nThe scars heal like they always do and the bruises fade having run their course of color spectrum. But the inside of you is an irreparable mess. You will never go to parties or drink outside again not even water. You will wear longer dresses; you will never dare to have a migraine in public. You will not talk or tell them about your interests and you will never ever be the same. There is something you carry inside of you all the time now. It is in every flinch that close contact makes you feel, in every word that goes unescaped, in every touch of intimacy that makes you feel gross about yourself, but mostly it's the fear of not knowing who he was and what will become of you should you ever encounter him again.\n\nYou feel it in you as you try to reconquer your fear, letting others in so there is less room for him to occupy, but like a curse it never leaves instead turns everything you feel into one condensed pain. It is on the tiny pebbles that grind against your back in an abandoned building, or the blades of grass you wish were thorns and would lacerate this feeling out of you, at least external pain will distract you. You will feel it when you leave a stranger’s bed, you will feel it drawn fresh every time you will let someone take you so you can find control, you will feel it more than you have ever felt yourself. Somewhere out there has taken something very crucial, something that was such a beautiful part of you, so you will shut the door on your face, you will change your appearances, off the hair length goes, more drastic the change fewer chances of him recognizing you and even fewer of you recognizing yourself"
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "self post removed generic rantsdiscussion post told post daily discussion thread sticky sub nsfw tw sa edit sent multiple outlets rejected triggering find home anyway starts preying eyes dont know easy spot things wonder gives away anxious transfer weight one leg another nervous glances around room pressing back already secluded corner trying make smaller unnoticeable attention comes see fidgeting awkwardly nursing sixth glass evening know sixth trying get previous five offer harmless glass water counter two lemon wedges floating refreshingly cant help titter unexpected thoughtfulness take easy conversation seems know lot things lot things makes every niche feel mainstream conversation flows freely dont want end feel eyes tire social battery draining fast think slight buildup pressure behind right eyeball know start terrible migraine thats going last week maybe pass choke full ibuprofen ondansetron still make night thankfully kind guy notices friends house sister get migraines time knows room retire sounds reach assures dont time think sound comes either cozies bed gives proper neck support even eyemask last drifting sensible thought still kindness left world soon darkness takes hear door close starts preying eyes fixated lot faces night even passed notice door crack open small gap eyemask doesnt curve right try ask tired words dont quite form well never escape mouth like sound doesnt escape room door closes long time seems pass second sound registers minute hear belt buckle unfasten frees hoop summons memory forgotten cranial crevices sound belt striking bare flesh buckle rang like steely tail tip venomous snake strikes present feel thighs opens old scars including physical ones become numbingly aware blood drawn feel warmth cold legs giving rise tempest feelings scared guilty sadness thats feel shape ear breathing nape cant make name says aware anger hurt behind name know brings lot anguish even say feel bad feel enough let way alleviates pain threshold higher try find rationality act maybe absorb pain within like smell lingering smokes rum womans perfume perhaps pried someone didnt want either earlier night suddenly smell smell fear forever hate brand whiskey whispers something ear sorry imagine feel ball bile unuttered cries throat grows bigger breaths arent making try recall albeit vaguely coping strategy notice whats happening around instead whats happening inside difficult ignore knot coiling tightening inside chest aware heart going like skin thinner sternum catch youd see shape like old cartoon show mind travels parts body still belong hands held fingertips feel sore flesh underside nails flesh inside reminded trying rescue favorite ball abandoned burrow first dug loose earth fingers tools trying catch glimpse burrowing inside looking inside anyway pain void coupled seething guilt brought upon hear voice past going wearing echoes maternally taunting voice recesses memories look like fucking whore comes another quip try cover sheet hands holding goddamn hard weighs almost feels like weighted blanket isnt technically hug rationalize enough suggests bit uses selfdeprecating humor cope draw back nails digging palm open fists feel feeling longer resisting flesh tells relaxes around consented thinks stance becomes almost loving arch back releases position attacking wolf passionate lover embrace dont want feel alone right disassociate enough make embrace feel like caring friend feel breakdown tears come know intimately almost poetic feel breakdown inside spills also spills hands slowly leave see fading dark muffled sounds music feel piece taken away forever part glow thats scarred hands deems fit maybe share world brag one day make way back refuse recognize dont want move cant pain shame cant quite tell feel like stay longer probably wake bed like used magically little started opinions physical abuse started evenings reeked alcohol contempt cant want wake wash dont want drip lower desecrating parts body dont want claim already wait hear familiar song hummed cant call although stops abruptly door open best friend walked many embarrassing situation none scar closes door behind walks fear stance disgust see lets anyone whores least get paid touches neck flinch dont want catch smell spread like spreading word happened wipes gently like newly born way wash newly dead overwhelmed emotions gentle wasnt something forcefully enter place hurt unspeakable shame something unfortunate share see asks look eye mask still bleeding pads actually never mind bring minutes later appears puts cloth back thank god wearing black blood wont show talk silver lining walk cant makes sniff something deeply inhale feel warmth sense return going report much want come cant number near police stations expression communicates much words together embark upon walk shame people know gay probably gone wild passed taking home bleed pads onto stairs leaving mark behind could fissure need see doctor suggests know someone doctor qualifies handled fissure lost lot blood give pills routine b plan something help coagulation nightmares want get tests done soon wait tomorrow doesnt react whatever system right want tell wasnt whatever whoever inside system needed addressing scars heal like always bruises fade run course color spectrum inside irreparable mess never go parties drink outside even water wear longer dresses never dare migraine public talk tell interests never ever something carry inside time every flinch close contact makes feel every word goes unescaped every touch intimacy makes feel gross mostly fear knowing become ever encounter feel try reconquer fear letting others less room occupy like curse never leaves instead turns everything feel one condensed pain tiny pebbles grind back abandoned building blades grass wish thorns would lacerate feeling least external pain distract feel leave strangers bed feel drawn fresh every time let someone take find control feel ever felt somewhere taken something crucial something beautiful part shut door face change appearances hair length goes drastic change fewer chances recognizing even fewer recognizing",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "My self post was removed because of: 'Generic Rants/Discussion Post' and was told to post in the daily discussion thread that is a sticky on the sub. NSFW, TW, SA Edit 1: sent it to multiple outlets but they rejected it for being too triggering, i just had to find a home for it anyway. .... It starts with preying eyes; I don't know how easy to spot these things are and I wonder what gives it away. Is it the anxious transfer of weight from one leg to another, is it the nervous glances around the room, is it the pressing further back into the already secluded corner trying to make yourself smaller, unnoticeable? But the attention comes, they see you fidgeting, awkwardly nursing your sixth glass of the evening, how do they know it's your sixth? Because they had been trying to get to your previous five. They offer you a harmless glass of water, off the counter, two lemon wedges floating refreshingly. You can't help but titter at the unexpected thoughtfulness and you take it from him. It is an easy conversation, he seems to know a lot of things about a lot of things, he makes every niche feel mainstream. The conversation flows so freely you don't want it to end, but you feel your eyes tire, the social battery draining. That was fast you think, then there is a slight buildup of pressure behind your right eyeball, you know it's the start of a terrible migraine that's going to last a week but maybe if you pass out now, choke yourself full with ibuprofen and ondansetron that you can still make it through the night. Thankfully, the kind guy notices, it's his friend's house and his sister get migraines all the time. He knows just the room you can retire to, no sounds reach in he assures, but you don't have the time to think that no sound comes out either. He cozies up the bed, gives you proper neck support, and even an eye-mask. Your last drifting, sensible thought is that there is still some kindness left in the world but soon the darkness takes you and you hear the door close. It starts with the preying eyes, that had been fixated on a lot of faces that night. Even passed out you notice the door crack open from that small gap where the eye-mask doesn't curve itself right. You try to ask who it is but you are too tired and the words don't quite form themselves well, they never escape your mouth just like the sound doesn't escape this room and then the door closes. A long time seems to pass before the second sound registers or has it only been a minute? you hear the belt buckle unfasten, as it frees itself from each hoop it summons a memory from your forgotten cranial crevices, the sound of belt striking bare flesh, when the buckle rang like a steely tail tip of a venomous snake and then it strikes your present. You feel it on your thighs and it opens all old scars including the physical ones, you become numbingly aware of the blood it has drawn because you feel the warmth of it on your cold legs, giving rise to a tempest of feelings of being scared, guilty, and sadness, that's when you feel the shape of an ear breathing into your nape, you can't make out the name he says but you are aware of the anger and hurt behind that name, you know it brings him a lot of anguish to even say it, and you feel bad for him but do you feel enough of it to let him have his way with you if it alleviates his pain, because your threshold is higher, you try to find some rationality in this act, maybe you can absorb his pain within yours like you are doing with his smell; of lingering smokes, rum and a woman's perfume, perhaps pried from someone who didn't want it either earlier that night . Suddenly the smell is now the smell of your fear, you will forever hate this brand of whiskey, he whispers something in your ear, is it a sorry or do you imagine it. You feel a ball of bile and unuttered cries in your throat, it grows bigger but your breaths aren't making it through, you try to recall albeit vaguely a coping strategy. What was it? Notice what's happening around you instead of what's happening inside of you. But it's just so difficult to ignore, the knot coiling, tightening inside your chest, you are aware of your heart going at it like if the skin were any thinner and there was no sternum to catch it, you'd see the shape of it like some old cartoon show. Your mind travels to other parts of your body (does it still belong to you?) your hands are held down, your fingertips feel sore, it's his flesh on the underside of your nails, it's his flesh on the inside of you. You are reminded of trying to rescue your favorite ball from an abandoned burrow, first you dug the loose earth with your fingers, then with your tools, trying to catch a glimpse, but he was burrowing inside of you looking for what? What is it that you had inside of you anyway but pain and a void which was now coupled with this seething guilt? \"You brought this upon yourself”, you hear a voice from your past. \"Are you going out wearing that?\" Echoes a maternally taunting voice in the recesses of your memories. \"You look like a fucking whore\" comes another quip; you try to cover yourself with a sheet but his hands are holding yours down so goddamn hard. He weighs more than you but it almost feels like a weighted blanket, isn't this technically a hug if you rationalize this enough? suggests the bit that uses self-deprecating humor to cope. You draw back your nails from digging into your palm, you open your fists and you can feel him feeling this too. You are no longer resisting; your flesh tells him as it relaxes around his. She has consented he thinks and his stance becomes almost loving. The arch of his back releases from that position of an attacking wolf to a passionate lover. You embrace him then because you don't want to feel so alone right now, you disassociate yourself enough to make this embrace feel like that of a caring friend and you feel him breakdown, his tears come to know yours intimately. It almost poetic you feel him breakdown inside of you. He spills out of you but he also spills you out of you too as his hands slowly leave yours. You see him fading into the dark, into muffled sounds of music. You feel a piece of you, taken away forever. A part of your glow, that's scarred and, in his hands, he will do with it as he deems fit, maybe he will share it with the world, he will brag about it, and one day it will make its way back to you and you will refuse to recognize it then, but for now it was over. You don't want to move, you can't. Is it the pain? Or the shame? You can't quite tell. You feel like if you stay there longer you will probably wake up in your bed like you used to magically when you were little, up until you started having your own opinions, before the physical abuse started, before evenings reeked of alcohol and contempt. But you can’t, you want to wake up and wash yourself but you don't want him to drip any lower, desecrating other parts of your body, you don’t want him to claim any more of you than what he already had, so you just wait. You hear a familiar song being hummed but you can't call out, although it stops abruptly. The door is now open. Your best friend has walked in on you in many an embarrassing situation but none of them will scar him so. He closes the door behind him and walks up to you, there is fear in his stance or is it disgust you see because who lets anyone do this to them, only whores and at least they get paid. He touches your neck and you flinch. You don’t want him to catch that smell and spread it, it will be like spreading the word of what had just happened. He wipes you down gently, like you were newly born the way they wash the newly dead, you are overwhelmed with emotions but he is very gentle, it wasn't something he had to forcefully enter, it was a place of hurt and unspeakable shame, something he had had his unfortunate share of. \"Did you see who he was” he asks, you look at the eye mask, \"You are still bleeding, do you have pads on you? actually never mind I will bring them\". Few minutes later he appears and puts your cloth back on, \"thank god you are wearing black, the blood won’t show through for a while\", talk about a silver lining. \"Can you walk?\" But you can’t so he makes you sniff on something which you deeply inhale and feel some warmth and sense return. \"Are you going to report this? because as much as I want to come with I can’t, it does a number on me to be near police stations\". His expression communicates much more than his words and together you both embark upon your walk of shame. People know he is gay so it is probably just you who has gone wild and passed out. He is just taking you home. You bleed through the pads onto the stairs, leaving a mark behind you. \"It could be a fissure; you need to see a doctor\" he suggests. \"I know someone, he is not a doctor but he qualifies he has handled it before.\" \"It is a fissure; you have lost a lot of blood. I will give you some pills, it's a routine b plan and something to help with coagulation and nightmares. I do want you to get some tests done as soon as you can. Wait until tomorrow so it doesn’t react with whatever you have in your system right now”. You want to tell him it wasn’t the whatever but whoever you had inside your system that needed addressing. The scars heal like they always do and the bruises fade having run their course of color spectrum. But the inside of you is an irreparable mess. You will never go to parties or drink outside again not even water. You will wear longer dresses; you will never dare to have a migraine in public. You will not talk or tell them about your interests and you will never ever be the same. There is something you carry inside of you all the time now. It is in every flinch that close contact makes you feel, in every word that goes unescaped, in every touch of intimacy that makes you feel gross about yourself, but mostly it's the fear of not knowing who he was and what will become of you should you ever encounter him again. You feel it in you as you try to reconquer your fear, letting others in so there is less room for him to occupy, but like a curse it never leaves instead turns everything you feel into one condensed pain. It is on the tiny pebbles that grind against your back in an abandoned building, or the blades of grass you wish were thorns and would lacerate this feeling out of you, at least external pain will distract you. You will feel it when you leave a stranger’s bed, you will feel it drawn fresh every time you will let someone take you so you can find control, you will feel it more than you have ever felt yourself. Somewhere out there has taken something very crucial, something that was such a beautiful part of you, so you will shut the door on your face, you will change your appearances, off the hair length goes, more drastic the change fewer chances of him recognizing you and even fewer of you recognizing yourself"
}