{
    "id": "15gykhw",
    "title": "Suspected Qaeda terror cell busted in Rajkot, Gujrat. The ATS also recovered a semi-automated country-made pistol with 10 rounds, five mobile phones with radicalizing materials and terror activities.",
    "url": "https://timesofindia.indiatimes.com/videos/city/ahmedabad/major-victory-for-gujarat-ats-al-qaeda-terror-cell-busted-weapons-jihadi-literature-found/videoshow/102328352.cms",
    "selftext": "More @ https://timesofindia.indiatimes.com/videos/city/ahmedabad/major-victory-for-gujarat-ats-al-qaeda-terror-cell-busted-weapons-jihadi-literature-found/videoshow/102328352.cms",
    "flair": "Crime",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1691052593.0,
    "convurl": "https://external-preview.redd.it/Ya1LrXG1qmwkWMTbteGP1UEFel2AvUTlflWJAU2ZpR8.jpg?auto=webp&s=2288704a753855b77c277f9e444c78290cbabff1",
    "comments": [
        "I thought only Kerala had such centres. Huh.",
        "Gujarat Anti-Terrorist Squad on August 01 arrested three persons from Rajkot suspected to be part of a terrorist organisation Al-Qaeda. The ATS also recovered a semi-automated country-made pistol with 10 rounds from them. Five mobile phones were also seized from these three individuals that had radicalizing materials and materials related to jihad and terror activities. Accused have been identified as Shukr Ali alias Abdullah, Saif Nawaz and Aman Malik. Speaking to ANI, ATS Gujarat SP Om Prakash Jat said, “We received secret information through our channels according to which it was suspected that three individuals - Shukr Ali alias Abdullah, Saif Nawaz & Aman Malik who are basically from West Bengal - are involved and associated with activities of Al Qaeda and they are also trying to add other people in the tanzeem...On 31st July, we apprehended and detained three individuals. We recovered a semi-automated country-made pistol with 10 rounds from them. We also seized five mobile phones from these three individuals. These phones had a lot of radicalising materials and also materials associated with jihad activities and terror activities. We are trying to find out who their handles were. Till now, our investigation has found that they were associated with their foreign handlers through encrypted messaging apps like Telegram, Conversation and Element...We are yet to ascertain their motive at the local level but they were influenced by the ideology of Al Qaeda which is based on establishing Caliphate in the longer run and creating small cells in different places...They received these materials through Telegram & Conversation and also downloaded it through various websites...”",
        "ATS seems to have suddenly waken. Recent ISIS-related arrests made in Pune, and now this in Gujarat.    \nI'm skeptical of any alleged \"Islamic terrorism\" related atrests made by this government. A decade or so down the line, we might see these folks being declared innocent & released without much compensation.",
        "Lol everytime Indian government gets bad PR dur to domestic situation there's a busted terrorist group news that starts circulating in Indian media.",
        "Your subtle try to side with suspected terrorists is appalling",
        "He is happy they caught them. But he is just reading the pattern"
    ],
    "cleaned_text": "suspected qaeda terror cell busted rajkot gujrat ats also recovered semiautomated countrymade pistol rounds five mobile phones radicalizing materials terror activities  ",
    "cleaned_title": "suspected qaeda terror cell busted rajkot gujrat ats also recovered semiautomated countrymade pistol rounds five mobile phones radicalizing materials terror activities",
    "cleaned_selftext": "",
    "cleaned_comments": "thought kerala centres huh gujarat antiterrorist squad august arrested three persons rajkot suspected part terrorist organisation alqaeda ats also recovered semiautomated countrymade pistol rounds five mobile phones also seized three individuals radicalizing materials materials related jihad terror activities accused identified shukr ali alias abdullah saif nawaz aman malik speaking ani ats gujarat sp om prakash jat said received secret information channels according suspected three individuals shukr ali alias abdullah saif nawaz aman malik basically west bengal involved associated activities al qaeda also trying add people tanzeemon st july apprehended detained three individuals recovered semiautomated countrymade pistol rounds also seized five mobile phones three individuals phones lot radicalising materials also materials associated jihad activities terror activities trying find handles till investigation found associated foreign handlers encrypted messaging apps like telegram conversation elementwe yet ascertain motive local level influenced ideology al qaeda based establishing caliphate longer run creating small cells different placesthey received materials telegram conversation also downloaded various websites ats seems suddenly waken recent isisrelated arrests made pune gujarat im skeptical alleged islamic terrorism related atrests made government decade line might see folks declared innocent released without much compensation lol everytime indian government gets bad pr dur domestic situation theres busted terrorist group news starts circulating indian media subtle try side suspected terrorists appalling happy caught reading pattern",
    "light_cleaned_title": "Suspected Qaeda terror cell busted in Rajkot, Gujrat. The ATS also recovered a semi-automated country-made pistol with 10 rounds, five mobile phones with radicalizing materials and terror activities.",
    "light_cleaned_selftext": "More @",
    "light_cleaned_comments": "I thought only Kerala had such centres. Huh. Gujarat Anti-Terrorist Squad on August 01 arrested three persons from Rajkot suspected to be part of a terrorist organisation Al-Qaeda. The ATS also recovered a semi-automated country-made pistol with 10 rounds from them. Five mobile phones were also seized from these three individuals that had radicalizing materials and materials related to jihad and terror activities. Accused have been identified as Shukr Ali alias Abdullah, Saif Nawaz and Aman Malik. Speaking to ANI, ATS Gujarat SP Om Prakash Jat said, “We received secret information through our channels according to which it was suspected that three individuals - Shukr Ali alias Abdullah, Saif Nawaz & Aman Malik who are basically from West Bengal - are involved and associated with activities of Al Qaeda and they are also trying to add other people in the tanzeem...On 31st July, we apprehended and detained three individuals. We recovered a semi-automated country-made pistol with 10 rounds from them. We also seized five mobile phones from these three individuals. These phones had a lot of radicalising materials and also materials associated with jihad activities and terror activities. We are trying to find out who their handles were. Till now, our investigation has found that they were associated with their foreign handlers through encrypted messaging apps like Telegram, Conversation and Element...We are yet to ascertain their motive at the local level but they were influenced by the ideology of Al Qaeda which is based on establishing Caliphate in the longer run and creating small cells in different places...They received these materials through Telegram & Conversation and also downloaded it through various websites...” ATS seems to have suddenly waken. Recent ISIS-related arrests made in Pune, and now this in Gujarat. I'm skeptical of any alleged \"Islamic terrorism\" related atrests made by this government. A decade or so down the line, we might see these folks being declared innocent & released without much compensation. Lol everytime Indian government gets bad PR dur to domestic situation there's a busted terrorist group news that starts circulating in Indian media. Your subtle try to side with suspected terrorists is appalling He is happy they caught them. But he is just reading the pattern"
}