{
    "id": "pbpalk",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/pbpalk/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 37,
    "num_comments": 37,
    "created_utc": 1629941411,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Cyient\nHyderabad\nFor test automation architect \nMust have good knowledge in AWS\n8 yrs + experience\nFor subsystems architects - embedded sw design and development - invetro dignostics (IVD)\n12 to 15 years of experience\nAt least 7 years in medical devices\nExpertise in hl7, dicom, hippa\nExperience in agile/scrum\n\nContact me here first then we can proceed to linkedin and emails",
        "It's HIPAA!",
        "We are expanding aggressively and hiring for a bunch of roles. All of them have multiple openings. \n\n- Backend dev (min. 4+ YOE in Python + Django, good grip on DS &amp; A) \n\n- NLP engineer \n\n- AI/ML engineer (bonus if you have exposure to federated learning / distributed computing) \n\n- HR generalists \n\n- Talent acquisition specialists (international and tech hiring exposure is a plus) \n\n- Strategic sourcing manager (lighting, electrical, or industrial field exp. is required. dropshipping exp. through Alibaba would be good to have) \n\nAll roles are permanently remote. \n\nSend me a PM if you fit.",
        "Not sure if this is the right place, but I'll give it a try.\nI'm a German national playing with the idea of working and living in India, at least for a while. \nI have a Master's equivalent degree in mechanical engineering from a German university, I'm a certified project manager and I have 5 years experience working as a project manager in various fields of engineering (heavy weight transporters, automated production machines, sensors and measuring equipment).\nI speak German, English and French fluently. \nI'm looking for a midsized or not too large company with an interesting product. \nWhat are my best chances of employment, which regions or companies and what salary can I expect? Thanks in advance.",
        " Hey guys, Im looking for an internship/assistant role (remote as i cannot travel yet)\n\nI have done previous internships in marketing and HR.\n\nIf you know of any job openings, kindly let me know\nThanks!",
        "Germany -&gt; India? I have seen the opposite so many times but this is first. \n\nBangalore has so many tech centres of automotive OEMs and tier1s including german companies. I think you should head over to their careers page and apply. DM me if you need referral at MBRDI (daimler) or Aptiv. Others can DM too",
        "Depends on your current TC. \n\nIf you already have a 12 Lpa job then 14Lpa is not good, you can get more.\n\nIf you have a 6-7Lpa job then it's an amazing salary.",
        "Have you visited India? If given the option between Germany and India, I am sure 100% of this thread would pick Germany.",
        "Oh wow, super patronising post that's entirely not helpful. \nYes, I've been to India twice. And I get your perspective, but you're an Indian trying to leave and get a better life. I'm a German looking for opportunities, perspective and experiences",
        "Hi I'm looking for an internship in a hotel kitchen department. 1st year HM student. Preferred in delhi only",
        "how to get into data science? what are the minimum requirements for getting a job? I know this question has been done to the death... Would getting online certifications from Coursera/edX etc. enhance my chances?",
        "Too much going on in that field. It’s not something you can figure out in a jiffy. What’s your background? Have you graduated already?",
        "Looking for banking and financial role.Currently work in credit domain in a Indian MNC.\nLocation preference-Hyderabad, Chennai,Kolkata.\nPlease PM if know about any openings.",
        "yup I have four years of experience in Banking. I have an engineering degree and have experience with numpy and scipy etc during my Masters and RAship.",
        "Hi,I am looking for online part time job",
        "Hi I am looking for new opportunities in ESG domain\n\nHello\nI am looking for ESG(environment, social, Governance), I have 3 year of experience.\n\nI have hand on experience on corporate sustainability assessment, ESG scoring Analysis, CDP data, Gri/Sasb framework and contervsry screening.\n\nI also have experience in team management, and Qc check of data\n\nIT skill Python, Tableue, MS excel, PowerPoint, Client engagement.\n\n\nCurrently located in India.\nReady to relocate anywhere in world\nOwn passport\n\nI tried few companies back but my interview skill are not that much good.\n\nPlease do share if you are hiring.\n\nComments below or pm me I will share my email id/Linkdien id\n\nThanks",
        "Try Fiverr.",
        "Pune is auto manufacturing hub in India with companies like Tata, Bajaj, Mahindra, Mercedes, Force etc. \nIn my opinion you should make a list of prospective companies you would like to join. Find potential employers ( Managers, Directors, HRs ) from those companies on LinkedIn and try to have a word with them. I am sure it would be easy for you to get a job based on your prior experience. \n\nHowever, as you might know, India is economically weaker compared to Germany so generally pays are multiple times in Germany for the same job profile. This is the reason many people are surprised by your decison of moving to India. But, given your experience you might be able to get a good deal. \n\nSome good auto companies in India,\nTata Motors\nBajaj\nEicher Motors\nAshok Leyland\nMercedes\nMahindra\nFord\nTVS \nMaruti\nHero\nHyundai\nHonda\n\nThere are various electric vehicle startups emerging these days. You can also try reaching out to them on LinkedIn.",
        "How to get into into IT industry with two years of gap after engineering?",
        "Do freshers get hired for Data Engineer roles?",
        "Search bout Gsoc",
        "yeah that's definitely on my list but I think it might be hard to get chosen for since 2nd and 3rd years can also apply for that.",
        "We are looking to hire at an Edtech startup. DM me for details.",
        "I have done a Bachelor's degree in Electrical and Electronics engineering with a minor concept focused on Data Science. I landed a job at a Big 4 consulting firm from the campus. I work with a client on their ERP security. Which is frankly not the most exciting/challenging thing to do. I interned at the same firm for my last semester and i was a part of their internal web products team, handling DevOps functionality. Its been nearly a year since i started with the firm, and over a year since I graduated. \n\nI just need some insight as to what sort of profile one has to build/projects someone has to complete, to change their consulting profile to a tech company profile. I am skilled in cloud computing (AWS stack) and have most backend skills but am not sure my projects are good enough to back my skills. Any guidance or help would be appreciated.  Thanks",
        "Anyone looking for a fashion role can DM me, we are hiring.",
        "Gap doesn't matter much unless it's a pretty big company or their criteria of selection is based on your marks and college tier. If you have skills which are in demand and you can prove those in interview it should be enough to get you into IT.",
        "Actively writing code 100% of the time with peer code reviews done by the best engineers around. This will speed up your learning and you would have learned all about writing code in 2 years. Then 50% coding 30% design and 20% mentoring. As you grow active coding percentage comes down while other increase. Don’t try to act I know better than you in your initial years to your senior dev of course have perspective but don’t make juvenile comments back every comment with data or absolute certainty.",
        "Thank you so much. Is there a platform,  where i can spot some problem projects and not just competetive coding problems? I have tried Kaggle for Data Science. Just want to check if there is one for backend dev",
        "You got me confused now. Dont try to hack real world experience with these leaderboard based garbage. But Kaggle is actually pretty good for data science. TBH backend has reached a stage where its just too easy to build APIs for small to medium scale companies. Real challenges start when you deal with millions, large number of teams/services. You cannot replace actively working with a lot of humans in a project.",
        "Start with a German company that has Indian locations. I am pretty sure companies will gladly relocate you to India. Its not worth the effort for any Indian company to hire Germans. There is just too much competition here.",
        "off topic. You think there is still room for edtech startups ? Does your company have a logical/pratical plan to make money ?",
        "Ongoing Computer Science.\n\n\nWorking as Local Ubiquiti Wireless ISP for 2 Years, Ongoing\n\nCan work with Adobe applications ( Adobe only )\n\nGood with Network communication &amp; have Indian DFS Frequency band license, from 4.9Ghz upto 6.10 GHz \n\n20Y.O | Maharashtra - Raigad.\n\n(first time posting, don't mind my weird listing, not good with it)",
        "oh damn, forgot to mention that I'm looking for a job.",
        "It’s series c funded thigh as of now and yeah it’s unique",
        "Hey! If you're looking for a switch DM, I'd try to help!"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "cyient hyderabad test automation architect must good knowledge aws yrs experience subsystems architects embedded sw design development invetro dignostics ivd years experience least years medical devices expertise hl dicom hippa experience agilescrum contact first proceed linkedin emails hipaa expanding aggressively hiring bunch roles multiple openings backend dev min yoe python django good grip ds amp nlp engineer aiml engineer bonus exposure federated learning distributed computing hr generalists talent acquisition specialists international tech hiring exposure plus strategic sourcing manager lighting electrical industrial field exp required dropshipping exp alibaba would good roles permanently remote send pm fit sure right place ill give try im german national playing idea working living india least masters equivalent degree mechanical engineering german university im certified project manager years experience working project manager various fields engineering heavy weight transporters automated production machines sensors measuring equipment speak german english french fluently im looking midsized large company interesting product best chances employment regions companies salary expect thanks advance hey guys im looking internshipassistant role remote travel yet done previous internships marketing hr know job openings kindly let know thanks germany gt india seen opposite many times first bangalore many tech centres automotive oems tiers including german companies think head careers page apply dm need referral mbrdi daimler aptiv others dm depends current tc already lpa job lpa good get lpa job amazing salary visited india given option germany india sure thread would pick germany oh wow super patronising post thats entirely helpful yes ive india twice get perspective youre indian trying leave get better life im german looking opportunities perspective experiences hi im looking internship hotel kitchen department st year hm student preferred delhi get data science minimum requirements getting job know question done death would getting online certifications courseraedx etc enhance chances much going field something figure jiffy whats background graduated already looking banking financial rolecurrently work credit domain indian mnc location preferencehyderabad chennaikolkata please pm know openings yup four years experience banking engineering degree experience numpy scipy etc masters raship hii looking online part time job hi looking new opportunities esg domain hello looking esgenvironment social governance year experience hand experience corporate sustainability assessment esg scoring analysis cdp data grisasb framework contervsry screening also experience team management qc check data skill python tableue ms excel powerpoint client engagement currently located india ready relocate anywhere world passport tried companies back interview skill much good please share hiring comments pm share email idlinkdien id thanks try fiverr pune auto manufacturing hub india companies like tata bajaj mahindra mercedes force etc opinion make list prospective companies would like join find potential employers managers directors hrs companies linkedin try word sure would easy get job based prior experience however might know india economically weaker compared germany generally pays multiple times germany job profile reason many people surprised decison moving india given experience might able get good deal good auto companies india tata motors bajaj eicher motors ashok leyland mercedes mahindra ford tvs maruti hero hyundai honda various electric vehicle startups emerging days also try reaching linkedin get industry two years gap engineering freshers get hired data engineer roles search bout gsoc yeah thats definitely list think might hard get chosen since nd rd years also apply looking hire edtech startup dm details done bachelors degree electrical electronics engineering minor concept focused data science landed job big consulting firm campus work client erp security frankly excitingchallenging thing interned firm last semester part internal web products team handling devops functionality nearly year since started firm year since graduated need insight sort profile one buildprojects someone complete change consulting profile tech company profile skilled cloud computing aws stack backend skills sure projects good enough back skills guidance help would appreciated thanks anyone looking fashion role dm hiring gap doesnt matter much unless pretty big company criteria selection based marks college tier skills demand prove interview enough get actively writing code time peer code reviews done best engineers around speed learning would learned writing code years coding design mentoring grow active coding percentage comes increase dont try act know better initial years senior dev course perspective dont make juvenile comments back every comment data absolute certainty thank much platform spot problem projects competetive coding problems tried kaggle data science want check one backend dev got confused dont try hack real world experience leaderboard based garbage kaggle actually pretty good data science tbh backend reached stage easy build apis small medium scale companies real challenges start deal millions large number teamsservices replace actively working lot humans project start german company indian locations pretty sure companies gladly relocate india worth effort indian company hire germans much competition topic think still room edtech startups company logicalpratical plan make money ongoing computer science working local ubiquiti wireless isp years ongoing work adobe applications adobe good network communication amp indian dfs frequency band license ghz upto ghz yo maharashtra raigad first time posting dont mind weird listing good oh damn forgot mention im looking job series c funded thigh yeah unique hey youre looking switch dm id try help",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Cyient Hyderabad For test automation architect Must have good knowledge in AWS 8 yrs + experience For subsystems architects - embedded sw design and development - invetro dignostics (IVD) 12 to 15 years of experience At least 7 years in medical devices Expertise in hl7, dicom, hippa Experience in agile/scrum Contact me here first then we can proceed to linkedin and emails It's HIPAA! We are expanding aggressively and hiring for a bunch of roles. All of them have multiple openings. - Backend dev (min. 4+ YOE in Python + Django, good grip on DS &amp; A) - NLP engineer - AI/ML engineer (bonus if you have exposure to federated learning / distributed computing) - HR generalists - Talent acquisition specialists (international and tech hiring exposure is a plus) - Strategic sourcing manager (lighting, electrical, or industrial field exp. is required. dropshipping exp. through Alibaba would be good to have) All roles are permanently remote. Send me a PM if you fit. Not sure if this is the right place, but I'll give it a try. I'm a German national playing with the idea of working and living in India, at least for a while. I have a Master's equivalent degree in mechanical engineering from a German university, I'm a certified project manager and I have 5 years experience working as a project manager in various fields of engineering (heavy weight transporters, automated production machines, sensors and measuring equipment). I speak German, English and French fluently. I'm looking for a midsized or not too large company with an interesting product. What are my best chances of employment, which regions or companies and what salary can I expect? Thanks in advance. Hey guys, Im looking for an internship/assistant role (remote as i cannot travel yet) I have done previous internships in marketing and HR. If you know of any job openings, kindly let me know Thanks! Germany -&gt; India? I have seen the opposite so many times but this is first. Bangalore has so many tech centres of automotive OEMs and tier1s including german companies. I think you should head over to their careers page and apply. DM me if you need referral at MBRDI (daimler) or Aptiv. Others can DM too Depends on your current TC. If you already have a 12 Lpa job then 14Lpa is not good, you can get more. If you have a 6-7Lpa job then it's an amazing salary. Have you visited India? If given the option between Germany and India, I am sure 100% of this thread would pick Germany. Oh wow, super patronising post that's entirely not helpful. Yes, I've been to India twice. And I get your perspective, but you're an Indian trying to leave and get a better life. I'm a German looking for opportunities, perspective and experiences Hi I'm looking for an internship in a hotel kitchen department. 1st year HM student. Preferred in delhi only how to get into data science? what are the minimum requirements for getting a job? I know this question has been done to the death... Would getting online certifications from Coursera/edX etc. enhance my chances? Too much going on in that field. It’s not something you can figure out in a jiffy. What’s your background? Have you graduated already? Looking for banking and financial role.Currently work in credit domain in a Indian MNC. Location preference-Hyderabad, Chennai,Kolkata. Please PM if know about any openings. yup I have four years of experience in Banking. I have an engineering degree and have experience with numpy and scipy etc during my Masters and RAship. Hi,I am looking for online part time job Hi I am looking for new opportunities in ESG domain Hello I am looking for ESG(environment, social, Governance), I have 3 year of experience. I have hand on experience on corporate sustainability assessment, ESG scoring Analysis, CDP data, Gri/Sasb framework and contervsry screening. I also have experience in team management, and Qc check of data IT skill Python, Tableue, MS excel, PowerPoint, Client engagement. Currently located in India. Ready to relocate anywhere in world Own passport I tried few companies back but my interview skill are not that much good. Please do share if you are hiring. Comments below or pm me I will share my email id/Linkdien id Thanks Try Fiverr. Pune is auto manufacturing hub in India with companies like Tata, Bajaj, Mahindra, Mercedes, Force etc. In my opinion you should make a list of prospective companies you would like to join. Find potential employers ( Managers, Directors, HRs ) from those companies on LinkedIn and try to have a word with them. I am sure it would be easy for you to get a job based on your prior experience. However, as you might know, India is economically weaker compared to Germany so generally pays are multiple times in Germany for the same job profile. This is the reason many people are surprised by your decison of moving to India. But, given your experience you might be able to get a good deal. Some good auto companies in India, Tata Motors Bajaj Eicher Motors Ashok Leyland Mercedes Mahindra Ford TVS Maruti Hero Hyundai Honda There are various electric vehicle startups emerging these days. You can also try reaching out to them on LinkedIn. How to get into into IT industry with two years of gap after engineering? Do freshers get hired for Data Engineer roles? Search bout Gsoc yeah that's definitely on my list but I think it might be hard to get chosen for since 2nd and 3rd years can also apply for that. We are looking to hire at an Edtech startup. DM me for details. I have done a Bachelor's degree in Electrical and Electronics engineering with a minor concept focused on Data Science. I landed a job at a Big 4 consulting firm from the campus. I work with a client on their ERP security. Which is frankly not the most exciting/challenging thing to do. I interned at the same firm for my last semester and i was a part of their internal web products team, handling DevOps functionality. Its been nearly a year since i started with the firm, and over a year since I graduated. I just need some insight as to what sort of profile one has to build/projects someone has to complete, to change their consulting profile to a tech company profile. I am skilled in cloud computing (AWS stack) and have most backend skills but am not sure my projects are good enough to back my skills. Any guidance or help would be appreciated. Thanks Anyone looking for a fashion role can DM me, we are hiring. Gap doesn't matter much unless it's a pretty big company or their criteria of selection is based on your marks and college tier. If you have skills which are in demand and you can prove those in interview it should be enough to get you into IT. Actively writing code 100% of the time with peer code reviews done by the best engineers around. This will speed up your learning and you would have learned all about writing code in 2 years. Then 50% coding 30% design and 20% mentoring. As you grow active coding percentage comes down while other increase. Don’t try to act I know better than you in your initial years to your senior dev of course have perspective but don’t make juvenile comments back every comment with data or absolute certainty. Thank you so much. Is there a platform, where i can spot some problem projects and not just competetive coding problems? I have tried Kaggle for Data Science. Just want to check if there is one for backend dev You got me confused now. Dont try to hack real world experience with these leaderboard based garbage. But Kaggle is actually pretty good for data science. TBH backend has reached a stage where its just too easy to build APIs for small to medium scale companies. Real challenges start when you deal with millions, large number of teams/services. You cannot replace actively working with a lot of humans in a project. Start with a German company that has Indian locations. I am pretty sure companies will gladly relocate you to India. Its not worth the effort for any Indian company to hire Germans. There is just too much competition here. off topic. You think there is still room for edtech startups ? Does your company have a logical/pratical plan to make money ? Ongoing Computer Science. Working as Local Ubiquiti Wireless ISP for 2 Years, Ongoing Can work with Adobe applications ( Adobe only ) Good with Network communication &amp; have Indian DFS Frequency band license, from 4.9Ghz upto 6.10 GHz 20Y.O | Maharashtra - Raigad. (first time posting, don't mind my weird listing, not good with it) oh damn, forgot to mention that I'm looking for a job. It’s series c funded thigh as of now and yeah it’s unique Hey! If you're looking for a switch DM, I'd try to help!"
}