{
    "id": "1e0k2t1",
    "title": "What is a divorced Muslim woman’s right to maintenance under the CrPC?",
    "url": "https://indianexpress.com/article/explained/explained-law/what-is-a-divorced-muslim-womans-right-to-maintenance-under-the-crpc-9445641/",
    "selftext": "While the ruling follows a 22-year-old landmark precedent, it sparked a discussion on the chequered legal and political history of the right to maintenance of Muslim women.",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 6,
    "created_utc": 1720687249.0,
    "convurl": "https://external-preview.redd.it/qzTULFFh41A0F_Dy-KsVYM9Rj9RyvHhqima2vbB9FbA.jpg?auto=webp&s=45bfad716c0b313cfa00c7179e288c6fd2ccdecc",
    "comments": [
        "The Supreme Court on Wednesday dismissed an appeal by a Muslim man against a Telangana High Court order allowing his ex-wife to seek maintenance under the Code of Criminal Procedure, 1973 (CrPC).\n\nA two-judge Bench of Justices B V Nagarathna and George Masih reiterated that a Muslim woman is entitled to seek maintenance from her husband under Section 125 of the CrPC — a secular legislation — even if they were divorced under religious personal law.\n\nWhile the ruling follows a 22-year-old landmark precedent, it sparked a discussion on the chequered legal and political history of the right to maintenance of Muslim women.\n\nThe present case\n\nPetitioner Mohd Adbul Samad challenged a 2017 family court order directing him to pay maintenance of Rs 20,000 per month to his former wife. The Telangana High Court, on appeal, refused to set aside the order of the family court.\n\nSection 125 CrPC places an obligation on “any person having sufficient means” to maintain “his wife” or “his legitimate or illegitimate minor child” if they are unable to maintain themselves — typically through monetary support at regular intervals. The explanation in the section clarifies that the word “wife” also includes a divorced woman who has not re-married\n\nJustice Nagarathna, in her opinion, said that Section 125 CrPC is “embedded in the text, structure and philosophy of the Constitution” as a social justice measure. “The remedy of maintenance is a critical source of succour for the destitute, the deserted and the deprived sections of women… It is an instantiation of the constitutional philosophy of social justice that seeks to liberate the Indian wife including a divorced woman from the shackles of gender-based discrimination, disadvantage and deprivation,” Justice Nagarathna wrote.\n\nThe ruling reiterated that maintenance under Section 125 CrPC exists “in addition” to the provisions for maintenance under the Muslim Women (Protection of Rights on Divorce) Act, 1986 (MWPRD Act), not “against” it.\n\n“…While enacting the 1986 Act, Parliament did not simultaneously or at anytime thereafter create any bar for a divorced Muslim woman from claiming maintenance under Section 125 of the CrPC,” Justice Nagarathna wrote.\n\nThis position was first taken in the landmark 2001 ruling in Danial Latifi & Anr v. Union of India.",
        "# Shah Bano decision\n\nIn 1978, a woman named Shah Bano Begum filed a petition seeking maintenance from her husband under Section 125 for herself and her five children. Divorcing Shah Bano via ‘irrevocable talaq’ later that same year, her former husband, Mohammed Ahmad Khan, argued that he is only required to provide maintenance during the iddat period following divorce — three months under ordinary circumstances during which she cannot marry another man — according to Muslim personal law.\n\nAfter Shah Bano’s plea was granted by Madhya Pradesh High Court in 1980, the matter reached the Supreme Court. The All Indian Muslim Personal Law Board argued that the court was bound to apply Muslim personal law as per The Muslim Personal Law (Shariat) Application Act, 1937.\n\nA five-judge Constitution Bench upheld the High Court’s decision. Then Chief Justice of India Y V Chandrachud held that provisions such as Section 125 CrPC “cut across the barriers of religion”, and “whether the spouses are Hindus or Muslims, Christians or Parsis, pagans or heathens, is wholly irrelevant”. The court also held that the divorced wife was entitled to maintenance under Section 125 even after the iddat period “if she is unable to maintain herself”.\n\nThe government of Prime Minister Rajiv Gandhi then enacted the MWPRD Act, which effectively overturned the Shah Bano verdict. Under the Act, the obligation to pay maintenance after the iddat period was placed on the relatives or children of the divorced wife and, in their absence, on the State Wakf Board.\n\n#  Challenge to 1986 Act\n\nSoon after the MWPRD Act was enacted, Shah Bano’s lawyer, Danial Latifi Nafess Ahmad Siddiqui, challenged its constitutionality before the Supreme Court.\n\nHe argued that Section 125 is meant to protect women of all religions from “destitution or vagrancy”, and that the MWPRD Act discriminates against Muslim women, violating their right to equality (Article 14) and right to life with dignity (Article 21).\n\nThe Centre argued that personal law is a legitimate basis for discrimination and does not violate the right to equality.\n\nThe All India Muslim Personal Law Board argued that the Act takes care of Muslim women and prevents “vagrancy” while being in tune with Muslim personal law, which only places an obligation for maintenance on the husband during the iddat period.\n\nIn an endeavour to uphold the constitutionality of the law while securing maintenance for a divorced Muslim woman beyond the iddat period, the five-judge Constitution Bench in its judgment creatively interpreted Section 3(a) of the MWPRD Act, which requires the former husband to provide “a reasonable and fair provision and maintenance to be made and paid to her within the iddat period”.\n\nThe court interpreted this to mean that the husband “is required to contemplate the future needs (of the divorced wife) and make preparatory arrangements in advance for meeting those needs” within the iddat period. In contrast, the actual payment would not be limited to this period and could “extend to the whole life of the divorced wife unless she gets married for a second time”.\n\nAs a result, the court held, a Muslim husband is responsible for paying maintenance even beyond the iddat period, and upheld the constitutionality of the MWPRD Act.",
        "Yesterday many of you guys in the sub and news articles were claiming that it's a 'landmark' judgement which is absolutely false. Read the article and you will know how this has been the law of the land since the 2001 latifi case.",
        "They get to be not married to a Muslim man , well that's a achievement by itself",
        "That's what you deduce from this article? 🤦‍♂️",
        "bruh i am not gonna go into the legal stuff and all i am not that intelligent there is like religion based law and all mixed with it, so you know its noting good. why would i fry my brain over it"
    ],
    "cleaned_text": "divorced muslim womans right maintenance crpc ruling follows yearold landmark precedent sparked discussion chequered legal political history right maintenance muslim women ",
    "cleaned_title": "divorced muslim womans right maintenance crpc",
    "cleaned_selftext": "ruling follows yearold landmark precedent sparked discussion chequered legal political history right maintenance muslim women",
    "cleaned_comments": "supreme court wednesday dismissed appeal muslim man telangana high court order allowing exwife seek maintenance code criminal procedure crpc twojudge bench justices b v nagarathna george masih reiterated muslim woman entitled seek maintenance husband section crpc secular legislation even divorced religious personal law ruling follows yearold landmark precedent sparked discussion chequered legal political history right maintenance muslim women present case petitioner mohd adbul samad challenged family court order directing pay maintenance rs per month former wife telangana high court appeal refused set aside order family court section crpc places obligation person sufficient means maintain wife legitimate illegitimate minor child unable maintain typically monetary support regular intervals explanation section clarifies word wife also includes divorced woman remarried justice nagarathna opinion said section crpc embedded text structure philosophy constitution social justice measure remedy maintenance critical source succour destitute deserted deprived sections women instantiation constitutional philosophy social justice seeks liberate indian wife including divorced woman shackles genderbased discrimination disadvantage deprivation justice nagarathna wrote ruling reiterated maintenance section crpc exists addition provisions maintenance muslim women protection rights divorce act mwprd act enacting act parliament simultaneously anytime thereafter create bar divorced muslim woman claiming maintenance section crpc justice nagarathna wrote position first taken landmark ruling danial latifi anr v union india shah bano decision woman named shah bano begum filed petition seeking maintenance husband section five children divorcing shah bano via irrevocable talaq later year former husband mohammed ahmad khan argued required provide maintenance iddat period following divorce three months ordinary circumstances marry another man according muslim personal law shah banos plea granted madhya pradesh high court matter reached supreme court indian muslim personal law board argued court bound apply muslim personal law per muslim personal law shariat application act fivejudge constitution bench upheld high courts decision chief justice india v chandrachud held provisions section crpc cut across barriers religion whether spouses hindus muslims christians parsis pagans heathens wholly irrelevant court also held divorced wife entitled maintenance section even iddat period unable maintain government prime minister rajiv gandhi enacted mwprd act effectively overturned shah bano verdict act obligation pay maintenance iddat period placed relatives children divorced wife absence state wakf board challenge act soon mwprd act enacted shah banos lawyer danial latifi nafess ahmad siddiqui challenged constitutionality supreme court argued section meant protect women religions destitution vagrancy mwprd act discriminates muslim women violating right equality article right life dignity article centre argued personal law legitimate basis discrimination violate right equality india muslim personal law board argued act takes care muslim women prevents vagrancy tune muslim personal law places obligation maintenance husband iddat period endeavour uphold constitutionality law securing maintenance divorced muslim woman beyond iddat period fivejudge constitution bench judgment creatively interpreted section mwprd act requires former husband provide reasonable fair provision maintenance made paid within iddat period court interpreted mean husband required contemplate future needs divorced wife make preparatory arrangements advance meeting needs within iddat period contrast actual payment would limited period could extend whole life divorced wife unless gets married second time result court held muslim husband responsible paying maintenance even beyond iddat period upheld constitutionality mwprd act yesterday many guys sub news articles claiming landmark judgement absolutely false read article know law land since latifi case get married muslim man well thats achievement thats deduce article bruh gon na go legal stuff intelligent like religion based law mixed know noting good would fry brain",
    "light_cleaned_title": "What is a divorced Muslim woman’s right to maintenance under the CrPC?",
    "light_cleaned_selftext": "While the ruling follows a 22-year-old landmark precedent, it sparked a discussion on the chequered legal and political history of the right to maintenance of Muslim women.",
    "light_cleaned_comments": "The Supreme Court on Wednesday dismissed an appeal by a Muslim man against a Telangana High Court order allowing his ex-wife to seek maintenance under the Code of Criminal Procedure, 1973 (CrPC). A two-judge Bench of Justices B V Nagarathna and George Masih reiterated that a Muslim woman is entitled to seek maintenance from her husband under Section 125 of the CrPC — a secular legislation — even if they were divorced under religious personal law. While the ruling follows a 22-year-old landmark precedent, it sparked a discussion on the chequered legal and political history of the right to maintenance of Muslim women. The present case Petitioner Mohd Adbul Samad challenged a 2017 family court order directing him to pay maintenance of Rs 20,000 per month to his former wife. The Telangana High Court, on appeal, refused to set aside the order of the family court. Section 125 CrPC places an obligation on “any person having sufficient means” to maintain “his wife” or “his legitimate or illegitimate minor child” if they are unable to maintain themselves — typically through monetary support at regular intervals. The explanation in the section clarifies that the word “wife” also includes a divorced woman who has not re-married Justice Nagarathna, in her opinion, said that Section 125 CrPC is “embedded in the text, structure and philosophy of the Constitution” as a social justice measure. “The remedy of maintenance is a critical source of succour for the destitute, the deserted and the deprived sections of women… It is an instantiation of the constitutional philosophy of social justice that seeks to liberate the Indian wife including a divorced woman from the shackles of gender-based discrimination, disadvantage and deprivation,” Justice Nagarathna wrote. The ruling reiterated that maintenance under Section 125 CrPC exists “in addition” to the provisions for maintenance under the Muslim Women (Protection of Rights on Divorce) Act, 1986 (MWPRD Act), not “against” it. “…While enacting the 1986 Act, Parliament did not simultaneously or at anytime thereafter create any bar for a divorced Muslim woman from claiming maintenance under Section 125 of the CrPC,” Justice Nagarathna wrote. This position was first taken in the landmark 2001 ruling in Danial Latifi & Anr v. Union of India. # Shah Bano decision In 1978, a woman named Shah Bano Begum filed a petition seeking maintenance from her husband under Section 125 for herself and her five children. Divorcing Shah Bano via ‘irrevocable talaq’ later that same year, her former husband, Mohammed Ahmad Khan, argued that he is only required to provide maintenance during the iddat period following divorce — three months under ordinary circumstances during which she cannot marry another man — according to Muslim personal law. After Shah Bano’s plea was granted by Madhya Pradesh High Court in 1980, the matter reached the Supreme Court. The All Indian Muslim Personal Law Board argued that the court was bound to apply Muslim personal law as per The Muslim Personal Law (Shariat) Application Act, 1937. A five-judge Constitution Bench upheld the High Court’s decision. Then Chief Justice of India Y V Chandrachud held that provisions such as Section 125 CrPC “cut across the barriers of religion”, and “whether the spouses are Hindus or Muslims, Christians or Parsis, pagans or heathens, is wholly irrelevant”. The court also held that the divorced wife was entitled to maintenance under Section 125 even after the iddat period “if she is unable to maintain herself”. The government of Prime Minister Rajiv Gandhi then enacted the MWPRD Act, which effectively overturned the Shah Bano verdict. Under the Act, the obligation to pay maintenance after the iddat period was placed on the relatives or children of the divorced wife and, in their absence, on the State Wakf Board. # Challenge to 1986 Act Soon after the MWPRD Act was enacted, Shah Bano’s lawyer, Danial Latifi Nafess Ahmad Siddiqui, challenged its constitutionality before the Supreme Court. He argued that Section 125 is meant to protect women of all religions from “destitution or vagrancy”, and that the MWPRD Act discriminates against Muslim women, violating their right to equality (Article 14) and right to life with dignity (Article 21). The Centre argued that personal law is a legitimate basis for discrimination and does not violate the right to equality. The All India Muslim Personal Law Board argued that the Act takes care of Muslim women and prevents “vagrancy” while being in tune with Muslim personal law, which only places an obligation for maintenance on the husband during the iddat period. In an endeavour to uphold the constitutionality of the law while securing maintenance for a divorced Muslim woman beyond the iddat period, the five-judge Constitution Bench in its judgment creatively interpreted Section 3(a) of the MWPRD Act, which requires the former husband to provide “a reasonable and fair provision and maintenance to be made and paid to her within the iddat period”. The court interpreted this to mean that the husband “is required to contemplate the future needs (of the divorced wife) and make preparatory arrangements in advance for meeting those needs” within the iddat period. In contrast, the actual payment would not be limited to this period and could “extend to the whole life of the divorced wife unless she gets married for a second time”. As a result, the court held, a Muslim husband is responsible for paying maintenance even beyond the iddat period, and upheld the constitutionality of the MWPRD Act. Yesterday many of you guys in the sub and news articles were claiming that it's a 'landmark' judgement which is absolutely false. Read the article and you will know how this has been the law of the land since the 2001 latifi case. They get to be not married to a Muslim man , well that's a achievement by itself That's what you deduce from this article? 🤦‍♂️ bruh i am not gonna go into the legal stuff and all i am not that intelligent there is like religion based law and all mixed with it, so you know its noting good. why would i fry my brain over it"
}