{
    "id": "14bkiot",
    "title": "Why are such racist things on youtube with millions of views and yet no one is talking about it?",
    "url": "https://www.reddit.com/r/india/comments/14bkiot/why_are_such_racist_things_on_youtube_with/",
    "selftext": "&#x200B;\n\n[source :youtube, link:https:\\/\\/youtu.be\\/4Ma\\_DQyOvHI](https://preview.redd.it/d90anci74j6b1.png?width=1113&format=png&auto=webp&v=enabled&s=c93d6a03fae75510ea2ded62fd204d7d77d2913a)\n\n&#x200B;\n\nThis is the worst portrayal of how filthy and such racist content is lurking on youtube under such triggering names. Worst of all they show their moral of the story at end and you all might know what their moral will be. \n\nNot even a single soul till this date ever mentioned or took action against such open racist content being shown on this channel and not just one part but the amount of response made them to make multiple parts of this video. Just the thought of watching through the lens of those li'l kid who are acting here even if they have done make up or not breaks my heart.\n\nAnd what do we as a society do ,let's see some comments:\n\n&#x200B;\n\n[source :youtube](https://preview.redd.it/3ymywgpn5j6b1.png?width=787&format=png&auto=webp&v=enabled&s=b9da466863661c49d5abe9f8b77815884bfcf034)\n\n&#x200B;\n\nHow does any kind of moral these videos have justify the hatred they are showing through out the video.  Please report the videos atleast. I hope you can go through even a minute of these videos they are so painful to even watch few seconds.",
    "flair": "Rant / Vent",
    "score": 46,
    "num_comments": 17,
    "created_utc": 1686987006.0,
    "convurl": "https://external-preview.redd.it/4Kb36BLp_pmAx5KaVi245RtYQsaQ0KgEQxcKJxipEzc.jpg?auto=webp&v=enabled&s=3c7ccf82b692366342cc1d5e2a9c065ec6582b77",
    "comments": [
        "Only racist when non-Indians do it. Otherwise, it is a \"beautiful story 😍🥰 heart touching can't wait for more\". Clown people.",
        "😂😂 these are AI generated stories with comments by bot farm accounts. Ignore them.",
        "Kidney touching stories like these should be taken down by YouTube",
        "The last comment is 100% bot",
        "These stories are a reflection of the society in which the poor live. They are not trying to be racist.",
        "yeah and being poor is also equal to black? is that what they're trying to convey. with add on make up so that no it must be definite that she's black ,not dusky, not brown, just black? I mean whatever they wanted to make could have made without explicitly using that racist title and discrimination on basis of color.",
        "because there are millions of racists in the world 🤷‍♂️",
        "Arey bhai ye chapri yt content hai, ye Inka content inki community Mai kaafi popular hai. Apna alag dekho bhai, silly point wagera dekhlo wo badiya hai",
        "I think they want to show that their society is prejudiced against people who are dark skinned.",
        "Racism is so normalised in India that everyone thinks that it's funny\n\nSo pathetic to be honest",
        "Quite stoned i assume.",
        "The number of typos in the last comment gave me a seizure. This provides a glimplse if the audience.",
        "I don't want to watch it and give it a view but I'm really curious what it is. Can someone describe it?",
        "Dude India k andar racism is like a norm, farak sirf foreign jaakr padta hai. Tab saare Indian, Pakistani aur Bangladeshi ek saath dikhte hai..",
        "Why are you Indians all so obsessed with whiteness? You have to accept reality…you are brown and will NEVER be white. No matter how much you bleach your skin.",
        "Then there will be people like- no no no Indians aren't racist. It's colorism not racism, and it's after effect of hundreds of years of British Raj.",
        "imo these hypocritical Indians who criticize americans for being racist are infinitely more racist than they'd ever be"
    ],
    "cleaned_text": "racist things youtube millions views yet one talking xb source youtube linkhttpsyoutubemadqyovhihttpspreviewredditdancijbpngwidthformatpngautowebpvenabledscdafaeeadedfdddda xb worst portrayal filthy racist content lurking youtube triggering names worst show moral story end might know moral even single soul till date ever mentioned took action open racist content shown channel one part amount response made make multiple parts video thought watching lens lil kid acting even done make breaks heart society lets see comments xb source youtubehttpspreviewredditymywgpnjbpngwidthformatpngautowebpvenabledsbdacdabefbbfcf xb kind moral videos justify hatred showing video please report videos atleast hope go even minute videos painful even watch seconds ",
    "cleaned_title": "racist things youtube millions views yet one talking",
    "cleaned_selftext": "xb source youtube linkhttpsyoutubemadqyovhihttpspreviewredditdancijbpngwidthformatpngautowebpvenabledscdafaeeadedfdddda xb worst portrayal filthy racist content lurking youtube triggering names worst show moral story end might know moral even single soul till date ever mentioned took action open racist content shown channel one part amount response made make multiple parts video thought watching lens lil kid acting even done make breaks heart society lets see comments xb source youtubehttpspreviewredditymywgpnjbpngwidthformatpngautowebpvenabledsbdacdabefbbfcf xb kind moral videos justify hatred showing video please report videos atleast hope go even minute videos painful even watch seconds",
    "cleaned_comments": "racist nonindians otherwise beautiful story heart touching cant wait clown people ai generated stories comments bot farm accounts ignore kidney touching stories like taken youtube last comment bot stories reflection society poor live trying racist yeah poor also equal black theyre trying convey add make must definite shes black dusky brown black mean whatever wanted make could made without explicitly using racist title discrimination basis color millions racists world arey bhai ye chapri yt content hai ye inka content inki community mai kaafi popular hai apna alag dekho bhai silly point wagera dekhlo wo badiya hai think want show society prejudiced people dark skinned racism normalised india everyone thinks funny pathetic honest quite stoned assume number typos last comment gave seizure provides glimplse audience dont want watch give view im really curious someone describe dude india k andar racism like norm farak sirf foreign jaakr padta hai tab saare indian pakistani aur bangladeshi ek saath dikhte hai indians obsessed whiteness accept realityyou brown never white matter much bleach skin people like indians arent racist colorism racism effect hundreds years british raj imo hypocritical indians criticize americans racist infinitely racist theyd ever",
    "light_cleaned_title": "Why are such racist things on youtube with millions of views and yet no one is talking about it?",
    "light_cleaned_selftext": "&#x200B; [source :youtube, link:https:\\/\\/youtu.be\\/4Ma\\_DQyOvHI](https://preview.redd.it/d90anci74j6b1.png?width=1113&format=png&auto=webp&v=enabled&s=c93d6a03fae75510ea2ded62fd204d7d77d2913a) &#x200B; This is the worst portrayal of how filthy and such racist content is lurking on youtube under such triggering names. Worst of all they show their moral of the story at end and you all might know what their moral will be. Not even a single soul till this date ever mentioned or took action against such open racist content being shown on this channel and not just one part but the amount of response made them to make multiple parts of this video. Just the thought of watching through the lens of those li'l kid who are acting here even if they have done make up or not breaks my heart. And what do we as a society do ,let's see some comments: &#x200B; [source :youtube](https://preview.redd.it/3ymywgpn5j6b1.png?width=787&format=png&auto=webp&v=enabled&s=b9da466863661c49d5abe9f8b77815884bfcf034) &#x200B; How does any kind of moral these videos have justify the hatred they are showing through out the video. Please report the videos atleast. I hope you can go through even a minute of these videos they are so painful to even watch few seconds.",
    "light_cleaned_comments": "Only racist when non-Indians do it. Otherwise, it is a \"beautiful story 😍🥰 heart touching can't wait for more\". Clown people. 😂😂 these are AI generated stories with comments by bot farm accounts. Ignore them. Kidney touching stories like these should be taken down by YouTube The last comment is 100% bot These stories are a reflection of the society in which the poor live. They are not trying to be racist. yeah and being poor is also equal to black? is that what they're trying to convey. with add on make up so that no it must be definite that she's black ,not dusky, not brown, just black? I mean whatever they wanted to make could have made without explicitly using that racist title and discrimination on basis of color. because there are millions of racists in the world 🤷‍♂️ Arey bhai ye chapri yt content hai, ye Inka content inki community Mai kaafi popular hai. Apna alag dekho bhai, silly point wagera dekhlo wo badiya hai I think they want to show that their society is prejudiced against people who are dark skinned. Racism is so normalised in India that everyone thinks that it's funny So pathetic to be honest Quite stoned i assume. The number of typos in the last comment gave me a seizure. This provides a glimplse if the audience. I don't want to watch it and give it a view but I'm really curious what it is. Can someone describe it? Dude India k andar racism is like a norm, farak sirf foreign jaakr padta hai. Tab saare Indian, Pakistani aur Bangladeshi ek saath dikhte hai.. Why are you Indians all so obsessed with whiteness? You have to accept reality…you are brown and will NEVER be white. No matter how much you bleach your skin. Then there will be people like- no no no Indians aren't racist. It's colorism not racism, and it's after effect of hundreds of years of British Raj. imo these hypocritical Indians who criticize americans for being racist are infinitely more racist than they'd ever be"
}