{
    "id": "16ba06o",
    "title": "‘India’ and ‘Bharat’ interchangeable, can be used in official invitation, say legal experts",
    "url": "https://www.thehindu.com/news/national/india-and-bharat-interchangeable-can-be-used-in-official-invitation-say-legal-experts/article67274291.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Findia-and-bharat-interchangeable-can-be-used-in-official-invitation-say-legal-experts%2Farticle67274291.ece",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693972921.0,
    "convurl": "https://external-preview.redd.it/MM5JE2lWKUjGXImJ33p-sK4cOuZSfBL8ceXtoGCLcgY.jpg?auto=webp&s=161d520608bebe2d5a1d253a46176f6f8af38d6a",
    "comments": [
        ">Constitutional amendment will be required only if any one particular term is to be removed, say experts\n\n>Senior Supreme Court advocate and Congress member Abhishek Singhvi said “The fact is that the terms Bharat and India can be used interchangeably, especially in view of the authorised Hindi version of the Indian Constitution, but the government cannot stipulate that everyone use only one name: either is permissible and usable interchangeably.”\n\n>Former Additional Solicitor-General and senior Supreme Court advocate Aman Lekhi said it was officially the “Republic of India” and even the G-20 Presidency was known as the “Indian Presidency”. He said that any change of name would require a constitutional amendment under Article 368.\n\n>“The change is possible but is it necessary? There are certain things that should be free of controversy and the name of the country should highest in that list,” Mr. Lekhi said.",
        "Congress MP Singhvi is saying something, Congress communication lead Jairam Ramesh is saying something else. Should've consulted with one of the top lawyers of the country - who's in their own party, before making those tweets"
    ],
    "cleaned_text": "india bharat interchangeable used official invitation say legal experts  ",
    "cleaned_title": "india bharat interchangeable used official invitation say legal experts",
    "cleaned_selftext": "",
    "cleaned_comments": "constitutional amendment required one particular term removed say experts senior supreme court advocate congress member abhishek singhvi said fact terms bharat india used interchangeably especially view authorised hindi version indian constitution government stipulate everyone use one name either permissible usable interchangeably former additional solicitorgeneral senior supreme court advocate aman lekhi said officially republic india even g presidency known indian presidency said change name would require constitutional amendment article change possible necessary certain things free controversy name country highest list mr lekhi said congress mp singhvi saying something congress communication lead jairam ramesh saying something else shouldve consulted one top lawyers country whos party making tweets",
    "light_cleaned_title": "‘India’ and ‘Bharat’ interchangeable, can be used in official invitation, say legal experts",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">Constitutional amendment will be required only if any one particular term is to be removed, say experts >Senior Supreme Court advocate and Congress member Abhishek Singhvi said “The fact is that the terms Bharat and India can be used interchangeably, especially in view of the authorised Hindi version of the Indian Constitution, but the government cannot stipulate that everyone use only one name: either is permissible and usable interchangeably.” >Former Additional Solicitor-General and senior Supreme Court advocate Aman Lekhi said it was officially the “Republic of India” and even the G-20 Presidency was known as the “Indian Presidency”. He said that any change of name would require a constitutional amendment under Article 368. >“The change is possible but is it necessary? There are certain things that should be free of controversy and the name of the country should highest in that list,” Mr. Lekhi said. Congress MP Singhvi is saying something, Congress communication lead Jairam Ramesh is saying something else. Should've consulted with one of the top lawyers of the country - who's in their own party, before making those tweets"
}