{
    "id": "mpwjmx",
    "title": "Digitization of Indian Judiciary: Phase III",
    "url": "https://www.reddit.com/r/india/comments/mpwjmx/digitization_of_indian_judiciary_phase_iii/",
    "selftext": "# Buffering Justice : A call for greater participation in the Draft Vision Document for Judicial Digitisation\n\nhttps://preview.redd.it/v3r2ff51vvs61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=df10c418ec64101186c1734d5357be762f5556ce\n\n### Tl;dr\n\nA sub-committee of the E-Committee of the Supreme Court has released the [**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/). The objective it hopes to achieve is on finalisation to provide a blueprint for the judiciary to adopt and implement digitisation. Since comments on the vision document have been invited by April, 23 we are encouraging feedback by providing a main outline that helps you understand these issues. Our outline notes the obvious positives of transparency and efficiency, while noting some preliminary concerns on data protection, the digital divide and automation of judicial functions. We encourage wide participation not only by lawyers, academics and technologists – but every Indian passionate about improving our justice system.\n\n### First, how to participate?\n\n* Document link:[**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/)\n* How to participate: Submit your comments on **ecommittee@aij.gov.in** or submit them on the [**CIVIS platform**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts).\n* Last date: Comments on the document by the [**23rd of April**](https://www.mygov.in/group-issue/inviting-suggestions-draft-vision-document-phase-iii-ecourts-project/).\n\n### Massive changes are underway\n\nWe often hear for the need for judicial reforms. But does technology have a role to play in it?  In the 21st century, the judiciary continues to operate in the [**brick and mortar**](https://www.firstpost.com/india/what-ails-indias-courts-crumbling-buildings-poor-infrastructure-cripple-daily-functioning-4456905.html) (and [**paper**](https://www.thequint.com/news/india/indian-judiciary-uses-eleven-billion-papers-in-a-year-a-million-tress-and-hundred-and-nine-billion-litres-of-water)?) world, and suffers from a [**large pendency of cases**](https://www.barandbench.com/news/india-justice-report-on-the-judiciary-average-case-pendency-in-subordinate-courts-is-5-years) which have [**only increased**](https://indianexpress.com/article/india/pandemic-impact-record-pendency-of-cases-at-all-levels-of-judiciary-7247271/) during the pandemic.\n\nLast week, as a response to these challenges, significant developments took place at the Supreme Court. First, the Supreme Court E-Committee invited comments on the [**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/). Second, the Chief Justice [**launched**](https://www.livelaw.in/top-stories/supreme-court-artificial-intelligence-portal-supace-chief-justice-sa-bobde-172220) the Supreme Court Portal for Assistance in Court’s efficiency (SUPACE) which is an AI driven tool designed to assist judges with processing information. Interestingly, SUPACE is not discussed in the draft vision document of e-Courts project Phase III. And third, Justice D.Y Chandrachud, who heads the E-Committee [**indicated**](https://www.barandbench.com/news/litigation/e-committee-anvil-finalising-rules-live-streaming-court-proceedings-justice-dy-chandrachud) that it was at the anvil of finalising rules for live streaming of court proceedings across the country. These massive changes will change the interactions of citizens with the judicial branch and it is important we all pay attention, and if possible, participate in consultative processes.\n\nWith this objective we are providing an outline of the Draft Vision Document of e-Courts Project Phase III. This 86 page document, drafted by a sub-committee of the E-Committee, is going to set the template of how our judiciary moves towards digitisation over the next few years.\n\n### Wait, what happened in phases I and II?\n\nDespite being perceived as stodgy and glacial (*often a fair criticism!*), the judiciary has shown a remarkable foresight for adopting technology. [**The E-Committee of the Supreme Court**](https://ecommitteesci.gov.in/about-department/introduction/) was established way back in 2004 and has the objective of *‘Information and Communication Technology (ICT) enablement of the Indian Judicial System*’. Since then the E-Committee has introduced [**Phases I and II**](https://doj.gov.in/sites/default/files/Brief-on-eCourts-Project-(Phase-I-%26-Phase-II)-30.09.2015.pdf) of e-Courts Project with an overall budget of approximately 2400 crores.\n\nPhase I focused on the nuts and bolts of digitisation - setting up hardware, ensuring internet connectivity, digitising case records and operationalising the e-Courts platform.  Phase II provided systems which operated independent of each other and catered to the needs of the litigant, such as [**National Judicial Data Grid (NJDG)**](https://njdg.ecourts.gov.in/njdgnew/) which permits citizens to check pendency of cases across the country, virtual courts, [**E-Seva Kendras**](https://ecommitteesci.gov.in/service/e-sewa-kendra/) and the eCourts Services App.\n\nWhile this process has taken years (17 years since it started), the digitisation has helped the judiciary become more efficient. But is such efficiency sufficient, or failing to utilise existing digital tools and processes? Also, does it provide solutions that may create independent problems, or fail to address existing ones?\n\n### What is Phase III of the e-Courts Project?\n\nThe draft vision document suggests a plan of action for Phase III of the eCourt Project. As per the document, Phase III, as opposed to Phase II, seeks to adopt an ‘*ecosystem*’ approach where systems interact with each other. The document suggests several ambitious developments such as a digital case registry, a repository of case law, intelligent scheduling, digital case management system, an interoperable criminal justice system, E-Filing and open digital hearings. All of these developments will be based on ‘*an intelligent system that enables data-based decision making for judges and registries’ and the system ‘combines the vast body of judicial data to foster legal literacy.*’\n\nWhile these developments are welcome, they will be brought in without any independent evaluation of Phase I and II of the project, as much as, without data protection legislation. Now let us, draw some broad strokes on how we are initially looking at the draft vision document. We request the IFF community to post on the [**Internet Freedom Forum**](https://internetfreedom.in/digitization-of-indian-judiciary-phase-iii/forum.internetfreedom.in) and help steer us on whether we are omitting anything or if there are any critical areas that we have failed to notice!\n\n### The good\n\nhttps://preview.redd.it/pvxd9dnhvvs61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=50f3f99e98ed6d14dbbb4a9b869e2b30a8e17419\n\n1. **Database of legal precedents:** As the vision document rightly points out, a ‘*database of all legal precedents must form the backbone to a judicial system based on common law’*. As of now, lawyers have to use websites such as Manupatra, SCCOnline and Indian Kanoon which do not provide case law from district courts. Moreover, Manupatra and SCCOnline are expensive and only further the digital divide. Lawyers also use websites of the High Courts and eCourts platform, however these only provide case law from particular courts. A freely available repository developed by the judiciary will enable lawyers from all backgrounds to undertake high quality legal research and foster legal literacy by permitting citizens to read judgments.\n2. **Data Protection:** The document undertakes to develop phase III with the principle of capturing minimum personal identifiable data, keeping the transient data in memory only and storing data in anonymised ways. However, this in no way is a substitute for data protection legislation and there are problems with processing data at such a scale without a legislation. Nevertheless, the undertaking from the sub-committee that data of individuals will be protected, is encouraging.\n3. **Standardisation:** Currently different lower courts use different methods to classify a case. The usage of different vocabulary makes research difficult and does not permit interoperability of data across courts. Standardisation will enable interaction of data between different services. We have faced difficulties because of the lack of standardisation. After Section 66A was struck down by the Supreme Court in *Shreya Singhal vs Union of India,* IFF collaborated with Civic Data Labs to develop [**Zombie Tracker**](https://zombietracker.in/), a website which tracks cases where individuals were being charged under Section 66A despite its unconstitutional status. As we have highlighted [**here**](https://internetfreedom.in/update-on-zombie-tracker/), collecting such data was difficult because Section 66A was classified in different ways on the eCourts platform.\n4. **Research-friendly Approach:** The draft vision document’s approach also involves development of infrastructural capabilities which will permit researchers, academics and private actors to undertake research and develop solutions. This is encouraging. Till now, all ‘e-services’ have been provided by the judiciary and other stakeholders have not been able to develop their own solutions which interact with the tools developed by the judiciary.\n5. **Provide templates to judges:** The document proposes the creation of templates for judgments which can be used by judges. The template will be based on analysis of certain inputs by judges, other data from the case and data from similar cases that have been disposed. These templates will only be suggestions, however, and are not intended to replace the decision making process of the judge. This will help save a lot of precious judicial time, and can be a major factor in decreasing case pendency. However, we need a lot more clarity on the systems which will be used to develop such templates and deployed (think about our district courts). Here, we need clear checks to avoid it from becoming a mechanical method in which the application of mind is jettisoned in favour of operational efficiency. We are of the initial view that we should be mindful of automating justice that may also creep in risks of lack of accountability. Hence, this specific proposal should be put to rigorous scrutiny and annual reviews without any institutional bias for proceeding with it due to investment of resources.\n\n### Some initial concerns emerge\n\n1. **The distance between** ***bharat*** **and** ***digital india*****:** As we have pointed out [**previously**](https://internetfreedom.in/on-chronic-inequalities-in-internet-access/), whether or not one has access to the internet is dependent on the demographic they belong to. While access has certainly been increasing, [**digital literacy continues to remain low**](https://sprf.in/digital-literacy-in-india-structural-constraints-and-the-nep-2020/) and is likely to remain an issue for decades. Further, technology systems if deployed compulsorily may exclude litigants from access to court services. Hence, backward compatibility will be essential and budget outlays for physical filing and registry functions will need to be maintained for a long period of time. The document does contemplate training judges, court staff and lawyers in ‘*specifics of technology’.* The large scale digitisation does not account for how it will impact litigants on the other side of the digital divide.\n2. **Centralisation:** As per Articles 227 and 235 of the Constitution, the High Courts are responsible for administration of lower judiciary. The Supreme Court can overrule the High Court on the judicial side but cannot control its administration. Admittedly, this has led to lack of standardisation which makes sharing of information across state lines difficult. Nevertheless, since the power is vested in High Courts, the E-Committee or the proposed National Judicial Technology Council ought to provide adequate measure of discretion to high courts. It may be noted that the document does say that the ‘*High Courts have the strategic autonomy for digitisation and configuration of digital services for their state judiciary’.* Moreover, the sub-committee has consulted with High Courts while preparing this document but concerns on centralisation do remain.\n3. **Robo Lawyers:** Another ambitious suggestion from the sub-committee is creation of a portal which will use appropriate data from eCourts database to provide a citizen information on justiciability of their case, the court with jurisdiction over their case and applicable legislations. The portal will then proceed to give information to the citizen on ‘*outcomes of filing a suit’* or alternative dispute resolution (ADR) options. Such advice and nudges for ADR options, may if not correctly designed lead to what are termed as dark patterns that reduce individual autonomy and result in behavioural changes. We note that such proposals, while seemingly beneficial will be applied to complex questions of law and fact on which even lawyers may have different opinions. An automated portal cannot be trusted to give an authoritative answer on these questions. If such a step is undertaken, there must be grievance redressal mechanism against advice from the portal which is patently incorrect.\n\n### The ugly\n\nhttps://preview.redd.it/8oj4kpfjvvs61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=0cf07dffda558353aadf7a14d6b85d4a35619f18\n\n1. **Surveillance:** The document discusses an ‘Interoperable Criminal Justice System (ICJS)’ which makes data interoperability between different institutions such as police, prisons and courts. This was implemented in part during the earlier phases but data was not entirely interoperable. In this phase, the Committee seeks to ensure ‘*seamless exchange of live data between arms of the criminal justice system’* which will allow for ‘*seamless tracking and prioritising of processes’.* Researchers such as Srinivas Kodali have [**pointed out**](https://twitter.com/digitaldutta/status/1380455029165879301) that since ICJS is housed within the Ministry of Home Affairs, the large scale collections of data will permit investigative agencies to undertake surveillance. This is of particular concern, since the draft vision document does not make clear how it intends to limit the purposes for which the collected data will be used and there is no data protection law and neither is there any meaningful surveillance reforms.\n2. **Delegation of judicial duties to ‘transformative technologies’:** Most of the developments proposed in the document seek to computerise administrative processes. However, the document also seeks to computerise judicial duties. The document states that transformative technologies can be used to resolve cases under Motor Vehicle Act, 1988 and Employee Compensation Act, 1923 *‘that do need application of judicial mind’.* This is a radical proposal. In this regard we have the following concerns:\n\n* This proposal requires an amendment to these legislations. Parliament in its wisdom has empowered judges to resolve these disputes. Such a power cannot be delegated.\n* There is no clarity on what these ‘transformative technologies’ are and how they operate. If the Committee intends to empower a code to impose civil liabilities (hopefully this does not extend to criminal liabilities) on litigants, it ought to have provided more information regarding the code from the outset.\n* This proposal is also seemingly contrary to the comments of the Chief Justice of India at the launch of SUPACE that artificial intelligence will not do decision making.\n* Most importantly, there are serious constitutional concerns over whether a code can perform a judicial function.\n\n### Next Steps\n\nPlease note that our analysis of the draft vision document are only presumptive to invite a critical lens and are open to correction. These concerns are based on an initial reading of the document and we are continuously studying it. Again, we want to hear from you and hope to encourage a broader conversation!   The sub-committee has invited suggestions to the draft vision document. We are in the process of drafting these suggestions and we shall update the IFF community once we submit those suggestions. In the meantime, we encourage you to also review the document and submit their suggestions at **ecommittee@aij.gov.in** by [**April 23, 2021**](https://www.mygov.in/group-issue/inviting-suggestions-draft-vision-document-phase-iii-ecourts-project/) which is the last date. You can also submit your suggestions on the [**CIVIS platform**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts).\n\n### Important documents\n\n1. Draft Vision Document of e-Courts Project Phase III ([**link**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/))\n2. IFF post highlighting the digital divide in India ([**link**](https://internetfreedom.in/on-chronic-inequalities-in-internet-access/))\n3. IFF post discussing the lack of standardisation on the eCourts portal ([**link**](https://internetfreedom.in/update-on-zombie-tracker/))\n4. CIVIS Platform ([**link**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts))\n5. Zombie Tracker website ([**link**](http://zombietracker.in/))  \n\n\n[We need your help and support in ensuring that we continue our efforts in demanding transparency from the authorities. Support us through one time donations or becoming a member with us. ](https://internetfreedom.in/donate)\n\n# [Donate today!](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 29,
    "num_comments": 0,
    "created_utc": 1618294834,
    "convurl": "https://a.thumbs.redditmedia.com/FlUEpcB67dEc5ogTtuBglFb1RKhVTZcQsWa87lFiKL4.jpg",
    "comments": [],
    "cleaned_text": "digitization indian judiciary phase iii buffering justice call greater participation draft vision document judicial digitisation tldr subcommittee ecommittee supreme court released draft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii objective hopes achieve finalisation provide blueprint judiciary adopt implement digitisation since comments vision document invited april encouraging feedback providing main outline helps understand issues outline notes obvious positives transparency efficiency noting preliminary concerns data protection digital divide automation judicial functions encourage wide participation lawyers academics technologists every indian passionate improving justice system first participate document linkdraft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii participate submit comments ecommitteeaijgovin submit civis platformhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts last date comments document rd aprilhttpswwwmygovingroupissueinvitingsuggestionsdraftvisiondocumentphaseiiiecourtsproject massive changes underway often hear need judicial reforms technology role play st century judiciary continues operate brick mortarhttpswwwfirstpostcomindiawhatailsindiascourtscrumblingbuildingspoorinfrastructurecrippledailyfunctioninghtml paperhttpswwwthequintcomnewsindiaindianjudiciaryuseselevenbillionpapersinayearamilliontressandhundredandninebillionlitresofwater world suffers large pendency caseshttpswwwbarandbenchcomnewsindiajusticereportonthejudiciaryaveragecasependencyinsubordinatecourtsisyears increasedhttpsindianexpresscomarticleindiapandemicimpactrecordpendencyofcasesatalllevelsofjudiciary pandemic last week response challenges significant developments took place supreme court first supreme court ecommittee invited comments draft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii second chief justice launchedhttpswwwlivelawintopstoriessupremecourtartificialintelligenceportalsupacechiefjusticesabobde supreme court portal assistance courts efficiency supace ai driven tool designed assist judges processing information interestingly supace discussed draft vision document ecourts project phase iii third justice dy chandrachud heads ecommittee indicatedhttpswwwbarandbenchcomnewslitigationecommitteeanvilfinalisingruleslivestreamingcourtproceedingsjusticedychandrachud anvil finalising rules live streaming court proceedings across country massive changes change interactions citizens judicial branch important pay attention possible participate consultative processes objective providing outline draft vision document ecourts project phase iii page document drafted subcommittee ecommittee going set template judiciary moves towards digitisation next years wait happened phases ii despite perceived stodgy glacial often fair criticism judiciary shown remarkable foresight adopting technology ecommittee supreme courthttpsecommitteescigovinaboutdepartmentintroduction established way back objective information communication technology ict enablement indian judicial system since ecommittee introduced phases iihttpsdojgovinsitesdefaultfilesbriefonecourtsprojectphaseiphaseiipdf ecourts project overall budget approximately crores phase focused nuts bolts digitisation setting hardware ensuring internet connectivity digitising case records operationalising ecourts platform phase ii provided systems operated independent catered needs litigant national judicial data grid njdghttpsnjdgecourtsgovinnjdgnew permits citizens check pendency cases across country virtual courts eseva kendrashttpsecommitteescigovinserviceesewakendra ecourts services app process taken years years since started digitisation helped judiciary become efficient efficiency sufficient failing utilise existing digital tools processes also provide solutions may create independent problems fail address existing ones phase iii ecourts project draft vision document suggests plan action phase iii ecourt project per document phase iii opposed phase ii seeks adopt ecosystem approach systems interact document suggests several ambitious developments digital case registry repository case law intelligent scheduling digital case management system interoperable criminal justice system efiling open digital hearings developments based intelligent system enables databased decision making judges registries system combines vast body judicial data foster legal literacy developments welcome brought without independent evaluation phase ii project much without data protection legislation let us draw broad strokes initially looking draft vision document request iff community post internet freedom forumhttpsinternetfreedomindigitizationofindianjudiciaryphaseiiiforuminternetfreedomin help steer us whether omitting anything critical areas failed notice good database legal precedents vision document rightly points database legal precedents must form backbone judicial system based common law lawyers use websites manupatra scconline indian kanoon provide case law district courts moreover manupatra scconline expensive digital divide lawyers also use websites high courts ecourts platform however provide case law particular courts freely available repository developed judiciary enable lawyers backgrounds undertake high quality legal research foster legal literacy permitting citizens read judgments data protection document undertakes develop phase iii principle capturing minimum personal identifiable data keeping transient data memory storing data anonymised ways however way substitute data protection legislation problems processing data scale without legislation nevertheless undertaking subcommittee data individuals protected encouraging standardisation currently different lower courts use different methods classify case usage different vocabulary makes research difficult permit interoperability data across courts standardisation enable interaction data different services faced difficulties lack standardisation section struck supreme court shreya singhal vs union india iff collaborated civic data labs develop zombie trackerhttpszombietrackerin website tracks cases individuals charged section despite unconstitutional status highlighted herehttpsinternetfreedominupdateonzombietracker collecting data difficult section classified different ways ecourts platform researchfriendly approach draft vision documents approach also involves development infrastructural capabilities permit researchers academics private actors undertake research develop solutions encouraging till eservices provided judiciary stakeholders able develop solutions interact tools developed judiciary provide templates judges document proposes creation templates judgments used judges template based analysis certain inputs judges data case data similar cases disposed templates suggestions however intended replace decision making process judge help save lot precious judicial time major factor decreasing case pendency however need lot clarity systems used develop templates deployed think district courts need clear checks avoid becoming mechanical method application mind jettisoned favour operational efficiency initial view mindful automating justice may also creep risks lack accountability hence specific proposal put rigorous scrutiny annual reviews without institutional bias proceeding due investment resources initial concerns emerge distance bharat digital india pointed previouslyhttpsinternetfreedominonchronicinequalitiesininternetaccess whether one access internet dependent demographic belong access certainly increasing digital literacy continues remain lowhttpssprfindigitalliteracyinindiastructuralconstraintsandthenep likely remain issue decades technology systems deployed compulsorily may exclude litigants access court services hence backward compatibility essential budget outlays physical filing registry functions need maintained long period time document contemplate training judges court staff lawyers specifics technology large scale digitisation account impact litigants side digital divide centralisation per articles constitution high courts responsible administration lower judiciary supreme court overrule high court judicial side control administration admittedly led lack standardisation makes sharing information across state lines difficult nevertheless since power vested high courts ecommittee proposed national judicial technology council ought provide adequate measure discretion high courts may noted document say high courts strategic autonomy digitisation configuration digital services state judiciary moreover subcommittee consulted high courts preparing document concerns centralisation remain robo lawyers another ambitious suggestion subcommittee creation portal use appropriate data ecourts database provide citizen information justiciability case court jurisdiction case applicable legislations portal proceed give information citizen outcomes filing suit alternative dispute resolution adr options advice nudges adr options may correctly designed lead termed dark patterns reduce individual autonomy result behavioural changes note proposals seemingly beneficial applied complex questions law fact even lawyers may different opinions automated portal trusted give authoritative answer questions step undertaken must grievance redressal mechanism advice portal patently incorrect ugly surveillance document discusses interoperable criminal justice system icjs makes data interoperability different institutions police prisons courts implemented part earlier phases data entirely interoperable phase committee seeks ensure seamless exchange live data arms criminal justice system allow seamless tracking prioritising processes researchers srinivas kodali pointed outhttpstwittercomdigitalduttastatus since icjs housed within ministry home affairs large scale collections data permit investigative agencies undertake surveillance particular concern since draft vision document make clear intends limit purposes collected data used data protection law neither meaningful surveillance reforms delegation judicial duties transformative technologies developments proposed document seek computerise administrative processes however document also seeks computerise judicial duties document states transformative technologies used resolve cases motor vehicle act employee compensation act need application judicial mind radical proposal regard following concerns proposal requires amendment legislations parliament wisdom empowered judges resolve disputes power delegated clarity transformative technologies operate committee intends empower code impose civil liabilities hopefully extend criminal liabilities litigants ought provided information regarding code outset proposal also seemingly contrary comments chief justice india launch supace artificial intelligence decision making importantly serious constitutional concerns whether code perform judicial function next steps please note analysis draft vision document presumptive invite critical lens open correction concerns based initial reading document continuously studying want hear hope encourage broader conversation subcommittee invited suggestions draft vision document process drafting suggestions shall update iff community submit suggestions meantime encourage also review document submit suggestions ecommitteeaijgovin april httpswwwmygovingroupissueinvitingsuggestionsdraftvisiondocumentphaseiiiecourtsproject last date also submit suggestions civis platformhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts important documents draft vision document ecourts project phase iii linkhttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii iff post highlighting digital divide india linkhttpsinternetfreedominonchronicinequalitiesininternetaccess iff post discussing lack standardisation ecourts portal linkhttpsinternetfreedominupdateonzombietracker civis platform linkhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts zombie tracker website linkhttpzombietrackerin need help support ensuring continue efforts demanding transparency authorities support us one time donations becoming member us httpsinternetfreedomindonate donate todayhttpsinternetfreedomindonate ",
    "cleaned_title": "digitization indian judiciary phase iii",
    "cleaned_selftext": "buffering justice call greater participation draft vision document judicial digitisation tldr subcommittee ecommittee supreme court released draft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii objective hopes achieve finalisation provide blueprint judiciary adopt implement digitisation since comments vision document invited april encouraging feedback providing main outline helps understand issues outline notes obvious positives transparency efficiency noting preliminary concerns data protection digital divide automation judicial functions encourage wide participation lawyers academics technologists every indian passionate improving justice system first participate document linkdraft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii participate submit comments ecommitteeaijgovin submit civis platformhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts last date comments document rd aprilhttpswwwmygovingroupissueinvitingsuggestionsdraftvisiondocumentphaseiiiecourtsproject massive changes underway often hear need judicial reforms technology role play st century judiciary continues operate brick mortarhttpswwwfirstpostcomindiawhatailsindiascourtscrumblingbuildingspoorinfrastructurecrippledailyfunctioninghtml paperhttpswwwthequintcomnewsindiaindianjudiciaryuseselevenbillionpapersinayearamilliontressandhundredandninebillionlitresofwater world suffers large pendency caseshttpswwwbarandbenchcomnewsindiajusticereportonthejudiciaryaveragecasependencyinsubordinatecourtsisyears increasedhttpsindianexpresscomarticleindiapandemicimpactrecordpendencyofcasesatalllevelsofjudiciary pandemic last week response challenges significant developments took place supreme court first supreme court ecommittee invited comments draft vision document ecourts project phase iiihttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii second chief justice launchedhttpswwwlivelawintopstoriessupremecourtartificialintelligenceportalsupacechiefjusticesabobde supreme court portal assistance courts efficiency supace ai driven tool designed assist judges processing information interestingly supace discussed draft vision document ecourts project phase iii third justice dy chandrachud heads ecommittee indicatedhttpswwwbarandbenchcomnewslitigationecommitteeanvilfinalisingruleslivestreamingcourtproceedingsjusticedychandrachud anvil finalising rules live streaming court proceedings across country massive changes change interactions citizens judicial branch important pay attention possible participate consultative processes objective providing outline draft vision document ecourts project phase iii page document drafted subcommittee ecommittee going set template judiciary moves towards digitisation next years wait happened phases ii despite perceived stodgy glacial often fair criticism judiciary shown remarkable foresight adopting technology ecommittee supreme courthttpsecommitteescigovinaboutdepartmentintroduction established way back objective information communication technology ict enablement indian judicial system since ecommittee introduced phases iihttpsdojgovinsitesdefaultfilesbriefonecourtsprojectphaseiphaseiipdf ecourts project overall budget approximately crores phase focused nuts bolts digitisation setting hardware ensuring internet connectivity digitising case records operationalising ecourts platform phase ii provided systems operated independent catered needs litigant national judicial data grid njdghttpsnjdgecourtsgovinnjdgnew permits citizens check pendency cases across country virtual courts eseva kendrashttpsecommitteescigovinserviceesewakendra ecourts services app process taken years years since started digitisation helped judiciary become efficient efficiency sufficient failing utilise existing digital tools processes also provide solutions may create independent problems fail address existing ones phase iii ecourts project draft vision document suggests plan action phase iii ecourt project per document phase iii opposed phase ii seeks adopt ecosystem approach systems interact document suggests several ambitious developments digital case registry repository case law intelligent scheduling digital case management system interoperable criminal justice system efiling open digital hearings developments based intelligent system enables databased decision making judges registries system combines vast body judicial data foster legal literacy developments welcome brought without independent evaluation phase ii project much without data protection legislation let us draw broad strokes initially looking draft vision document request iff community post internet freedom forumhttpsinternetfreedomindigitizationofindianjudiciaryphaseiiiforuminternetfreedomin help steer us whether omitting anything critical areas failed notice good database legal precedents vision document rightly points database legal precedents must form backbone judicial system based common law lawyers use websites manupatra scconline indian kanoon provide case law district courts moreover manupatra scconline expensive digital divide lawyers also use websites high courts ecourts platform however provide case law particular courts freely available repository developed judiciary enable lawyers backgrounds undertake high quality legal research foster legal literacy permitting citizens read judgments data protection document undertakes develop phase iii principle capturing minimum personal identifiable data keeping transient data memory storing data anonymised ways however way substitute data protection legislation problems processing data scale without legislation nevertheless undertaking subcommittee data individuals protected encouraging standardisation currently different lower courts use different methods classify case usage different vocabulary makes research difficult permit interoperability data across courts standardisation enable interaction data different services faced difficulties lack standardisation section struck supreme court shreya singhal vs union india iff collaborated civic data labs develop zombie trackerhttpszombietrackerin website tracks cases individuals charged section despite unconstitutional status highlighted herehttpsinternetfreedominupdateonzombietracker collecting data difficult section classified different ways ecourts platform researchfriendly approach draft vision documents approach also involves development infrastructural capabilities permit researchers academics private actors undertake research develop solutions encouraging till eservices provided judiciary stakeholders able develop solutions interact tools developed judiciary provide templates judges document proposes creation templates judgments used judges template based analysis certain inputs judges data case data similar cases disposed templates suggestions however intended replace decision making process judge help save lot precious judicial time major factor decreasing case pendency however need lot clarity systems used develop templates deployed think district courts need clear checks avoid becoming mechanical method application mind jettisoned favour operational efficiency initial view mindful automating justice may also creep risks lack accountability hence specific proposal put rigorous scrutiny annual reviews without institutional bias proceeding due investment resources initial concerns emerge distance bharat digital india pointed previouslyhttpsinternetfreedominonchronicinequalitiesininternetaccess whether one access internet dependent demographic belong access certainly increasing digital literacy continues remain lowhttpssprfindigitalliteracyinindiastructuralconstraintsandthenep likely remain issue decades technology systems deployed compulsorily may exclude litigants access court services hence backward compatibility essential budget outlays physical filing registry functions need maintained long period time document contemplate training judges court staff lawyers specifics technology large scale digitisation account impact litigants side digital divide centralisation per articles constitution high courts responsible administration lower judiciary supreme court overrule high court judicial side control administration admittedly led lack standardisation makes sharing information across state lines difficult nevertheless since power vested high courts ecommittee proposed national judicial technology council ought provide adequate measure discretion high courts may noted document say high courts strategic autonomy digitisation configuration digital services state judiciary moreover subcommittee consulted high courts preparing document concerns centralisation remain robo lawyers another ambitious suggestion subcommittee creation portal use appropriate data ecourts database provide citizen information justiciability case court jurisdiction case applicable legislations portal proceed give information citizen outcomes filing suit alternative dispute resolution adr options advice nudges adr options may correctly designed lead termed dark patterns reduce individual autonomy result behavioural changes note proposals seemingly beneficial applied complex questions law fact even lawyers may different opinions automated portal trusted give authoritative answer questions step undertaken must grievance redressal mechanism advice portal patently incorrect ugly surveillance document discusses interoperable criminal justice system icjs makes data interoperability different institutions police prisons courts implemented part earlier phases data entirely interoperable phase committee seeks ensure seamless exchange live data arms criminal justice system allow seamless tracking prioritising processes researchers srinivas kodali pointed outhttpstwittercomdigitalduttastatus since icjs housed within ministry home affairs large scale collections data permit investigative agencies undertake surveillance particular concern since draft vision document make clear intends limit purposes collected data used data protection law neither meaningful surveillance reforms delegation judicial duties transformative technologies developments proposed document seek computerise administrative processes however document also seeks computerise judicial duties document states transformative technologies used resolve cases motor vehicle act employee compensation act need application judicial mind radical proposal regard following concerns proposal requires amendment legislations parliament wisdom empowered judges resolve disputes power delegated clarity transformative technologies operate committee intends empower code impose civil liabilities hopefully extend criminal liabilities litigants ought provided information regarding code outset proposal also seemingly contrary comments chief justice india launch supace artificial intelligence decision making importantly serious constitutional concerns whether code perform judicial function next steps please note analysis draft vision document presumptive invite critical lens open correction concerns based initial reading document continuously studying want hear hope encourage broader conversation subcommittee invited suggestions draft vision document process drafting suggestions shall update iff community submit suggestions meantime encourage also review document submit suggestions ecommitteeaijgovin april httpswwwmygovingroupissueinvitingsuggestionsdraftvisiondocumentphaseiiiecourtsproject last date also submit suggestions civis platformhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts important documents draft vision document ecourts project phase iii linkhttpsecommitteescigovindocumentdraftvisiondocumentforecourtsprojectphaseiii iff post highlighting digital divide india linkhttpsinternetfreedominonchronicinequalitiesininternetaccess iff post discussing lack standardisation ecourts portal linkhttpsinternetfreedominupdateonzombietracker civis platform linkhttpswwwcivisvoteconsultationsreadutmsourceagamiamputmmediumemailamputmcampaignecourts zombie tracker website linkhttpzombietrackerin need help support ensuring continue efforts demanding transparency authorities support us one time donations becoming member us httpsinternetfreedomindonate donate todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Digitization of Indian Judiciary: Phase III",
    "light_cleaned_selftext": "# Buffering Justice : A call for greater participation in the Draft Vision Document for Judicial Digitisation ### Tl;dr A sub-committee of the E-Committee of the Supreme Court has released the [**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/). The objective it hopes to achieve is on finalisation to provide a blueprint for the judiciary to adopt and implement digitisation. Since comments on the vision document have been invited by April, 23 we are encouraging feedback by providing a main outline that helps you understand these issues. Our outline notes the obvious positives of transparency and efficiency, while noting some preliminary concerns on data protection, the digital divide and automation of judicial functions. We encourage wide participation not only by lawyers, academics and technologists – but every Indian passionate about improving our justice system. ### First, how to participate? * Document link:[**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/) * How to participate: Submit your comments on **ecommittee@aij.gov.in** or submit them on the [**CIVIS platform**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts). * Last date: Comments on the document by the [**23rd of April**](https://www.mygov.in/group-issue/inviting-suggestions-draft-vision-document-phase-iii-ecourts-project/). ### Massive changes are underway We often hear for the need for judicial reforms. But does technology have a role to play in it? In the 21st century, the judiciary continues to operate in the [**brick and mortar**](https://www.firstpost.com/india/what-ails-indias-courts-crumbling-buildings-poor-infrastructure-cripple-daily-functioning-4456905.html) (and [**paper**](https://www.thequint.com/news/india/indian-judiciary-uses-eleven-billion-papers-in-a-year-a-million-tress-and-hundred-and-nine-billion-litres-of-water)?) world, and suffers from a [**large pendency of cases**](https://www.barandbench.com/news/india-justice-report-on-the-judiciary-average-case-pendency-in-subordinate-courts-is-5-years) which have [**only increased**](https://indianexpress.com/article/india/pandemic-impact-record-pendency-of-cases-at-all-levels-of-judiciary-7247271/) during the pandemic. Last week, as a response to these challenges, significant developments took place at the Supreme Court. First, the Supreme Court E-Committee invited comments on the [**Draft Vision Document of e-Courts Project Phase III**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/). Second, the Chief Justice [**launched**](https://www.livelaw.in/top-stories/supreme-court-artificial-intelligence-portal-supace-chief-justice-sa-bobde-172220) the Supreme Court Portal for Assistance in Court’s efficiency (SUPACE) which is an AI driven tool designed to assist judges with processing information. Interestingly, SUPACE is not discussed in the draft vision document of e-Courts project Phase III. And third, Justice D.Y Chandrachud, who heads the E-Committee [**indicated**](https://www.barandbench.com/news/litigation/e-committee-anvil-finalising-rules-live-streaming-court-proceedings-justice-dy-chandrachud) that it was at the anvil of finalising rules for live streaming of court proceedings across the country. These massive changes will change the interactions of citizens with the judicial branch and it is important we all pay attention, and if possible, participate in consultative processes. With this objective we are providing an outline of the Draft Vision Document of e-Courts Project Phase III. This 86 page document, drafted by a sub-committee of the E-Committee, is going to set the template of how our judiciary moves towards digitisation over the next few years. ### Wait, what happened in phases I and II? Despite being perceived as stodgy and glacial (*often a fair criticism!*), the judiciary has shown a remarkable foresight for adopting technology. [**The E-Committee of the Supreme Court**](https://ecommitteesci.gov.in/about-department/introduction/) was established way back in 2004 and has the objective of *‘Information and Communication Technology (ICT) enablement of the Indian Judicial System*’. Since then the E-Committee has introduced [**Phases I and II**](https://doj.gov.in/sites/default/files/Brief-on-eCourts-Project-(Phase-I-%26-Phase-II)-30.09.2015.pdf) of e-Courts Project with an overall budget of approximately 2400 crores. Phase I focused on the nuts and bolts of digitisation - setting up hardware, ensuring internet connectivity, digitising case records and operationalising the e-Courts platform. Phase II provided systems which operated independent of each other and catered to the needs of the litigant, such as [**National Judicial Data Grid (NJDG)**](https://njdg.ecourts.gov.in/njdgnew/) which permits citizens to check pendency of cases across the country, virtual courts, [**E-Seva Kendras**](https://ecommitteesci.gov.in/service/e-sewa-kendra/) and the eCourts Services App. While this process has taken years (17 years since it started), the digitisation has helped the judiciary become more efficient. But is such efficiency sufficient, or failing to utilise existing digital tools and processes? Also, does it provide solutions that may create independent problems, or fail to address existing ones? ### What is Phase III of the e-Courts Project? The draft vision document suggests a plan of action for Phase III of the eCourt Project. As per the document, Phase III, as opposed to Phase II, seeks to adopt an ‘*ecosystem*’ approach where systems interact with each other. The document suggests several ambitious developments such as a digital case registry, a repository of case law, intelligent scheduling, digital case management system, an interoperable criminal justice system, E-Filing and open digital hearings. All of these developments will be based on ‘*an intelligent system that enables data-based decision making for judges and registries’ and the system ‘combines the vast body of judicial data to foster legal literacy.*’ While these developments are welcome, they will be brought in without any independent evaluation of Phase I and II of the project, as much as, without data protection legislation. Now let us, draw some broad strokes on how we are initially looking at the draft vision document. We request the IFF community to post on the [**Internet Freedom Forum**](https://internetfreedom.in/digitization-of-indian-judiciary-phase-iii/forum.internetfreedom.in) and help steer us on whether we are omitting anything or if there are any critical areas that we have failed to notice! ### The good 1. **Database of legal precedents:** As the vision document rightly points out, a ‘*database of all legal precedents must form the backbone to a judicial system based on common law’*. As of now, lawyers have to use websites such as Manupatra, SCCOnline and Indian Kanoon which do not provide case law from district courts. Moreover, Manupatra and SCCOnline are expensive and only further the digital divide. Lawyers also use websites of the High Courts and eCourts platform, however these only provide case law from particular courts. A freely available repository developed by the judiciary will enable lawyers from all backgrounds to undertake high quality legal research and foster legal literacy by permitting citizens to read judgments. 2. **Data Protection:** The document undertakes to develop phase III with the principle of capturing minimum personal identifiable data, keeping the transient data in memory only and storing data in anonymised ways. However, this in no way is a substitute for data protection legislation and there are problems with processing data at such a scale without a legislation. Nevertheless, the undertaking from the sub-committee that data of individuals will be protected, is encouraging. 3. **Standardisation:** Currently different lower courts use different methods to classify a case. The usage of different vocabulary makes research difficult and does not permit interoperability of data across courts. Standardisation will enable interaction of data between different services. We have faced difficulties because of the lack of standardisation. After Section 66A was struck down by the Supreme Court in *Shreya Singhal vs Union of India,* IFF collaborated with Civic Data Labs to develop [**Zombie Tracker**](https://zombietracker.in/), a website which tracks cases where individuals were being charged under Section 66A despite its unconstitutional status. As we have highlighted [**here**](https://internetfreedom.in/update-on-zombie-tracker/), collecting such data was difficult because Section 66A was classified in different ways on the eCourts platform. 4. **Research-friendly Approach:** The draft vision document’s approach also involves development of infrastructural capabilities which will permit researchers, academics and private actors to undertake research and develop solutions. This is encouraging. Till now, all ‘e-services’ have been provided by the judiciary and other stakeholders have not been able to develop their own solutions which interact with the tools developed by the judiciary. 5. **Provide templates to judges:** The document proposes the creation of templates for judgments which can be used by judges. The template will be based on analysis of certain inputs by judges, other data from the case and data from similar cases that have been disposed. These templates will only be suggestions, however, and are not intended to replace the decision making process of the judge. This will help save a lot of precious judicial time, and can be a major factor in decreasing case pendency. However, we need a lot more clarity on the systems which will be used to develop such templates and deployed (think about our district courts). Here, we need clear checks to avoid it from becoming a mechanical method in which the application of mind is jettisoned in favour of operational efficiency. We are of the initial view that we should be mindful of automating justice that may also creep in risks of lack of accountability. Hence, this specific proposal should be put to rigorous scrutiny and annual reviews without any institutional bias for proceeding with it due to investment of resources. ### Some initial concerns emerge 1. **The distance between** ***bharat*** **and** ***digital india*****:** As we have pointed out [**previously**](https://internetfreedom.in/on-chronic-inequalities-in-internet-access/), whether or not one has access to the internet is dependent on the demographic they belong to. While access has certainly been increasing, [**digital literacy continues to remain low**](https://sprf.in/digital-literacy-in-india-structural-constraints-and-the-nep-2020/) and is likely to remain an issue for decades. Further, technology systems if deployed compulsorily may exclude litigants from access to court services. Hence, backward compatibility will be essential and budget outlays for physical filing and registry functions will need to be maintained for a long period of time. The document does contemplate training judges, court staff and lawyers in ‘*specifics of technology’.* The large scale digitisation does not account for how it will impact litigants on the other side of the digital divide. 2. **Centralisation:** As per Articles 227 and 235 of the Constitution, the High Courts are responsible for administration of lower judiciary. The Supreme Court can overrule the High Court on the judicial side but cannot control its administration. Admittedly, this has led to lack of standardisation which makes sharing of information across state lines difficult. Nevertheless, since the power is vested in High Courts, the E-Committee or the proposed National Judicial Technology Council ought to provide adequate measure of discretion to high courts. It may be noted that the document does say that the ‘*High Courts have the strategic autonomy for digitisation and configuration of digital services for their state judiciary’.* Moreover, the sub-committee has consulted with High Courts while preparing this document but concerns on centralisation do remain. 3. **Robo Lawyers:** Another ambitious suggestion from the sub-committee is creation of a portal which will use appropriate data from eCourts database to provide a citizen information on justiciability of their case, the court with jurisdiction over their case and applicable legislations. The portal will then proceed to give information to the citizen on ‘*outcomes of filing a suit’* or alternative dispute resolution (ADR) options. Such advice and nudges for ADR options, may if not correctly designed lead to what are termed as dark patterns that reduce individual autonomy and result in behavioural changes. We note that such proposals, while seemingly beneficial will be applied to complex questions of law and fact on which even lawyers may have different opinions. An automated portal cannot be trusted to give an authoritative answer on these questions. If such a step is undertaken, there must be grievance redressal mechanism against advice from the portal which is patently incorrect. ### The ugly 1. **Surveillance:** The document discusses an ‘Interoperable Criminal Justice System (ICJS)’ which makes data interoperability between different institutions such as police, prisons and courts. This was implemented in part during the earlier phases but data was not entirely interoperable. In this phase, the Committee seeks to ensure ‘*seamless exchange of live data between arms of the criminal justice system’* which will allow for ‘*seamless tracking and prioritising of processes’.* Researchers such as Srinivas Kodali have [**pointed out**](https://twitter.com/digitaldutta/status/1380455029165879301) that since ICJS is housed within the Ministry of Home Affairs, the large scale collections of data will permit investigative agencies to undertake surveillance. This is of particular concern, since the draft vision document does not make clear how it intends to limit the purposes for which the collected data will be used and there is no data protection law and neither is there any meaningful surveillance reforms. 2. **Delegation of judicial duties to ‘transformative technologies’:** Most of the developments proposed in the document seek to computerise administrative processes. However, the document also seeks to computerise judicial duties. The document states that transformative technologies can be used to resolve cases under Motor Vehicle Act, 1988 and Employee Compensation Act, 1923 *‘that do need application of judicial mind’.* This is a radical proposal. In this regard we have the following concerns: * This proposal requires an amendment to these legislations. Parliament in its wisdom has empowered judges to resolve these disputes. Such a power cannot be delegated. * There is no clarity on what these ‘transformative technologies’ are and how they operate. If the Committee intends to empower a code to impose civil liabilities (hopefully this does not extend to criminal liabilities) on litigants, it ought to have provided more information regarding the code from the outset. * This proposal is also seemingly contrary to the comments of the Chief Justice of India at the launch of SUPACE that artificial intelligence will not do decision making. * Most importantly, there are serious constitutional concerns over whether a code can perform a judicial function. ### Next Steps Please note that our analysis of the draft vision document are only presumptive to invite a critical lens and are open to correction. These concerns are based on an initial reading of the document and we are continuously studying it. Again, we want to hear from you and hope to encourage a broader conversation! The sub-committee has invited suggestions to the draft vision document. We are in the process of drafting these suggestions and we shall update the IFF community once we submit those suggestions. In the meantime, we encourage you to also review the document and submit their suggestions at **ecommittee@aij.gov.in** by [**April 23, 2021**](https://www.mygov.in/group-issue/inviting-suggestions-draft-vision-document-phase-iii-ecourts-project/) which is the last date. You can also submit your suggestions on the [**CIVIS platform**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts). ### Important documents 1. Draft Vision Document of e-Courts Project Phase III ([**link**](https://ecommitteesci.gov.in/document/draft-vision-document-for-e-courts-project-phase-iii/)) 2. IFF post highlighting the digital divide in India ([**link**](https://internetfreedom.in/on-chronic-inequalities-in-internet-access/)) 3. IFF post discussing the lack of standardisation on the eCourts portal ([**link**](https://internetfreedom.in/update-on-zombie-tracker/)) 4. CIVIS Platform ([**link**](https://www.civis.vote/consultations/183/read?utm_source=Agami&amp;utm_medium=email&amp;utm_campaign=e_courts)) 5. Zombie Tracker website ([**link**](http://zombietracker.in/)) [We need your help and support in ensuring that we continue our efforts in demanding transparency from the authorities. Support us through one time donations or becoming a member with us. ](https://internetfreedom.in/donate) # [Donate today!](https://internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}