{
    "id": "1cm5qul",
    "title": "Dont order from Littlebox India ! (shark tank fame)",
    "url": "https://i.redd.it/njoml77rdyyc1.png",
    "selftext": "I placed an order on 16th April and still havent recieved it yet ! \nThe order is not showing in my order history ,so not able to track it and not able to \"raise a ticket\".\nThe only thing I have is email and text of order confirmation.\n\nThey dont even have a direct customer support and the service is very shitty ! I have dmed them on insta still no reply , I dont know what to do now .\n1000 rs may not mean much to someone but it means a lot to me , m feeling helpless.\n\nCreating this post to spread awareness and shame them ",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 4,
    "created_utc": 1715065327.0,
    "convurl": "https://i.redd.it/njoml77rdyyc1.png",
    "comments": [
        "Same. I also ordered on April 16. Till now no  response from then. They are not responding on email, Instagram or tweeter as well.",
        "[https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/)",
        "bro please check everything before ordering.\n\nshark tank is nothing but advertisement program. i watched stindia first ever episode, and understood it's caliber.",
        "thanks ,will try this",
        "Flip kart is shit too, i lost 800 and they gave me a fucking scratched up disk, fucking scratched intentionally to the core."
    ],
    "cleaned_text": "dont order littlebox india shark tank fame placed order th april still havent recieved yet order showing order history able track able raise ticket thing email text order confirmation dont even direct customer support service shitty dmed insta still reply dont know rs may mean much someone means lot feeling helpless creating post spread awareness shame ",
    "cleaned_title": "dont order littlebox india shark tank fame",
    "cleaned_selftext": "placed order th april still havent recieved yet order showing order history able track able raise ticket thing email text order confirmation dont even direct customer support service shitty dmed insta still reply dont know rs may mean much someone means lot feeling helpless creating post spread awareness shame",
    "cleaned_comments": "also ordered april till response responding email instagram tweeter well httpsconsumerhelplinegovinhttpsconsumerhelplinegovin bro please check everything ordering shark tank nothing advertisement program watched stindia first ever episode understood caliber thanks try flip kart shit lost gave fucking scratched disk fucking scratched intentionally core",
    "light_cleaned_title": "Dont order from Littlebox India ! (shark tank fame)",
    "light_cleaned_selftext": "I placed an order on 16th April and still havent recieved it yet ! The order is not showing in my order history ,so not able to track it and not able to \"raise a ticket\". The only thing I have is email and text of order confirmation. They dont even have a direct customer support and the service is very shitty ! I have dmed them on insta still no reply , I dont know what to do now . 1000 rs may not mean much to someone but it means a lot to me , m feeling helpless. Creating this post to spread awareness and shame them",
    "light_cleaned_comments": "Same. I also ordered on April 16. Till now no response from then. They are not responding on email, Instagram or tweeter as well. [https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/) bro please check everything before ordering. shark tank is nothing but advertisement program. i watched stindia first ever episode, and understood it's caliber. thanks ,will try this Flip kart is shit too, i lost 800 and they gave me a fucking scratched up disk, fucking scratched intentionally to the core."
}