{
    "id": "14peuqx",
    "title": "If there is a law on honking, why it is not strictly applied all over the country?",
    "url": "https://www.reddit.com/r/india/comments/14peuqx/if_there_is_a_law_on_honking_why_it_is_not/",
    "selftext": "[https://www.cag.org.in/blogs/i-honk-therefore-i-am#:\\~:text=To%20honk%20or%20not%20to,is%20continuous%20or%20needless%20honking](https://www.cag.org.in/blogs/i-honk-therefore-i-am#:~:text=To%20honk%20or%20not%20to,is%20continuous%20or%20needless%20honking).  \n\n\nThis will make all our lives a lot easier and peaceful.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1688378818.0,
    "convurl": "https://external-preview.redd.it/dS369bNz4T84KgoMKo4YgRnP-QQ1ZQi0bOwLNNW2OU8.jpg?auto=webp&v=enabled&s=108424fb325ad557b35225671bec847560d85bd1",
    "comments": [
        "There sadly is no designated law against it unless the area has a sign saying so. But yeah extensive honking is seriously an issue.",
        "There aren't enough resources to enforce it.",
        "I think ensuring that motorists are actually qualified to drive should be a greater priority. \n\nWhen I was living in India, I regularly took long-distance motorbike trips, sometimes travelling thousands of kilometers across highways, cities, and villages. \n\nIf I’m being very honest, I see horns as a practical necessity. The average Indian driver assumes that large vehicles always have the right-of-way, and they are completely oblivious to their surroundings. Few people seem to check their mirrors before initiating any sort of manoeuver, let alone their blind spots. If you don’t honk, you’ll get side-swiped (or worse). \n\nThe only way to mitigate these sorts of problems is to ensure that only people who actually know how to drive are allowed to drive. \n\nBut that would be a very, very difficult undertaking. I, like many of us, have many friends whose driving test consisted of “turn on the vehicle and make a left turn without crashing.” Instructors often take bribes, as do RTO officials. In Kolkata, for instance, there are lines of so-called agents outside of most RTOs, who will submit your documents and even take written exams for a relatively paltry amount of money. \n\nNothing is ever going to change—not corruption, not noise pollution—until the bureaucracy is downsized and restructured to disincentivise corruption. Many of India’s problems are a direct consequence of unwieldy and inefficient governance. \n\nIf the police are well-trained, literate, and paid sufficiently, they could better enforce most laws. But, as it stands, most lower-level officials have a tenuous grasp on basic legal theory, and simply treat routine traffic stops as an excuse to extort money from motorists.",
        "To stop first you gotta find What causing drivers to honk"
    ],
    "cleaned_text": "law honking strictly applied country httpswwwcagorginblogsihonkthereforeiamtexttohonkornottoiscontinuousorneedlesshonkinghttpswwwcagorginblogsihonkthereforeiamtexttohonkornottoiscontinuousorneedlesshonking make lives lot easier peaceful ",
    "cleaned_title": "law honking strictly applied country",
    "cleaned_selftext": "httpswwwcagorginblogsihonkthereforeiamtexttohonkornottoiscontinuousorneedlesshonkinghttpswwwcagorginblogsihonkthereforeiamtexttohonkornottoiscontinuousorneedlesshonking make lives lot easier peaceful",
    "cleaned_comments": "sadly designated law unless area sign saying yeah extensive honking seriously issue arent enough resources enforce think ensuring motorists actually qualified drive greater priority living india regularly took longdistance motorbike trips sometimes travelling thousands kilometers across highways cities villages im honest see horns practical necessity average indian driver assumes large vehicles always rightofway completely oblivious surroundings people seem check mirrors initiating sort manoeuver let alone blind spots dont honk youll get sideswiped worse way mitigate sorts problems ensure people actually know drive allowed drive would difficult undertaking like many us many friends whose driving test consisted turn vehicle make left turn without crashing instructors often take bribes rto officials kolkata instance lines socalled agents outside rtos submit documents even take written exams relatively paltry amount money nothing ever going changenot corruption noise pollutionuntil bureaucracy downsized restructured disincentivise corruption many indias problems direct consequence unwieldy inefficient governance police welltrained literate paid sufficiently could better enforce laws stands lowerlevel officials tenuous grasp basic legal theory simply treat routine traffic stops excuse extort money motorists stop first got ta find causing drivers honk",
    "light_cleaned_title": "If there is a law on honking, why it is not strictly applied all over the country?",
    "light_cleaned_selftext": "[https://www.cag.org.in/blogs/i-honk-therefore-i-am#:\\~:text=To%20honk%20or%20not%20to,is%20continuous%20or%20needless%20honking](https://www.cag.org.in/blogs/i-honk-therefore-i-am#:~:text=To%20honk%20or%20not%20to,is%20continuous%20or%20needless%20honking). This will make all our lives a lot easier and peaceful.",
    "light_cleaned_comments": "There sadly is no designated law against it unless the area has a sign saying so. But yeah extensive honking is seriously an issue. There aren't enough resources to enforce it. I think ensuring that motorists are actually qualified to drive should be a greater priority. When I was living in India, I regularly took long-distance motorbike trips, sometimes travelling thousands of kilometers across highways, cities, and villages. If I’m being very honest, I see horns as a practical necessity. The average Indian driver assumes that large vehicles always have the right-of-way, and they are completely oblivious to their surroundings. Few people seem to check their mirrors before initiating any sort of manoeuver, let alone their blind spots. If you don’t honk, you’ll get side-swiped (or worse). The only way to mitigate these sorts of problems is to ensure that only people who actually know how to drive are allowed to drive. But that would be a very, very difficult undertaking. I, like many of us, have many friends whose driving test consisted of “turn on the vehicle and make a left turn without crashing.” Instructors often take bribes, as do RTO officials. In Kolkata, for instance, there are lines of so-called agents outside of most RTOs, who will submit your documents and even take written exams for a relatively paltry amount of money. Nothing is ever going to change—not corruption, not noise pollution—until the bureaucracy is downsized and restructured to disincentivise corruption. Many of India’s problems are a direct consequence of unwieldy and inefficient governance. If the police are well-trained, literate, and paid sufficiently, they could better enforce most laws. But, as it stands, most lower-level officials have a tenuous grasp on basic legal theory, and simply treat routine traffic stops as an excuse to extort money from motorists. To stop first you gotta find What causing drivers to honk"
}