{
    "id": "1g71vec",
    "title": "House panel to study armed forces’ preparedness to deal with ‘non-kinetic warfare’ ",
    "url": "https://www.thehindu.com/news/national/house-panel-to-study-armed-forces-preparedness-to-deal-with-non-kinetic-warfare/article68769409.ece",
    "selftext": "> According to informed sources, Leader of the Opposition in the Lok Sabha Rahul Gandhi, a member of the committee, spoke extensively on the growing danger of “non-kinetic warfare” citing the examples of ongoing Russia-Ukraine and Israel-Palestine conflicts, where these methods have been deployed. He contended that the future wars will be fought using these tools and urged chairman and BJP MP Radha Mohan Singh, at the committee’s first meeting on October 15, to ensure that the parliamentary panel closely investigates the Army’s preparedness to face these threats.",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 1,
    "created_utc": 1729315044.0,
    "convurl": "https://external-preview.redd.it/ioA8laj1y9KLbJTAW10ZGv-LTwpuWAdcgFb_RnBUytM.jpg?auto=webp&s=1b1b0fbfe1b96593b6d9bc8f8c9c7f4a7440a760",
    "comments": [
        "Non kinetic means? Ion cannon from Unreal Tournament is the only one I can relate to"
    ],
    "cleaned_text": "house panel study armed forces preparedness deal nonkinetic warfare according informed sources leader opposition lok sabha rahul gandhi member committee spoke extensively growing danger nonkinetic warfare citing examples ongoing russiaukraine israelpalestine conflicts methods deployed contended future wars fought using tools urged chairman bjp mp radha mohan singh committees first meeting october ensure parliamentary panel closely investigates armys preparedness face threats ",
    "cleaned_title": "house panel study armed forces preparedness deal nonkinetic warfare",
    "cleaned_selftext": "according informed sources leader opposition lok sabha rahul gandhi member committee spoke extensively growing danger nonkinetic warfare citing examples ongoing russiaukraine israelpalestine conflicts methods deployed contended future wars fought using tools urged chairman bjp mp radha mohan singh committees first meeting october ensure parliamentary panel closely investigates armys preparedness face threats",
    "cleaned_comments": "non kinetic means ion cannon unreal tournament one relate",
    "light_cleaned_title": "House panel to study armed forces’ preparedness to deal with ‘non-kinetic warfare’",
    "light_cleaned_selftext": "> According to informed sources, Leader of the Opposition in the Lok Sabha Rahul Gandhi, a member of the committee, spoke extensively on the growing danger of “non-kinetic warfare” citing the examples of ongoing Russia-Ukraine and Israel-Palestine conflicts, where these methods have been deployed. He contended that the future wars will be fought using these tools and urged chairman and BJP MP Radha Mohan Singh, at the committee’s first meeting on October 15, to ensure that the parliamentary panel closely investigates the Army’s preparedness to face these threats.",
    "light_cleaned_comments": "Non kinetic means? Ion cannon from Unreal Tournament is the only one I can relate to"
}