{
    "id": "173igyv",
    "title": "Everybody needs to stop picking sides! Whenever a war happens, everybody loses!",
    "url": "https://i.redd.it/ydjnqrupn3tb1.jpg",
    "selftext": "There is a war happening in Israel, Israel vs Hamas, we all know. \nAnother war has been ongoing, Ukraine vs Russia. We all know. \nRecently, there was a war within the country itself, still ongoing, in Manipur. \n\nAs a simple citizen of the country and the world, who has to hustle for a minimum wage just to afford day to day living costs, IMO, the only side we should be choosing is the side of collateral damage- innocent civilians. We should all technically choose the side against any kind of war: anti-war! Whenever a war breaks out, it is innocent civilians who suffer, all over the world, since ages! \n\nThere is absolutely no logic behind picking sides! This is not our battle, it never was! \n\nThese wars are just a pure policy by elites, dealers, capitalists and the front runners of the world to DIVIDE AND CONQUER! They never end well for anyone! These powerful people are never in harms way, it is always the innocent and the powerless who are baited and who suffer! \n\nI do not understand anybody who is marching on the streets for either sides! Atrocities of any kind cannot be supported! The world needs to stay United and question the role of the UN! \n\nPeople do not have proper housing anymore, no proper jobs all over the world and oil prices are already rising again! More people are becoming refugees every minute! We cannot divide ourselves again with this old world propogandas! \n\nWE CANNOT PICK SIDES WITH ANYBODY CAUSING ANY KIND OF CONFLICTS! \n\nWhenever a war happens, nobody wins, everybody loses! \n\nTo see people divided everywhere to such an extent and innocent people dying and suffering, I cannot even express how depressing this is. \n\nWe are all being scapegoated! We are all losing.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696823594.0,
    "convurl": "https://i.redd.it/ydjnqrupn3tb1.jpg",
    "comments": [
        "Source of image : from TheDeplorableVeteran 's X(Twitter) handle.",
        "We can pray for mercy and the end of bloodshed, but that’s the extent of it. \n\nBack to your post, solider.\nBigger fish to fry.",
        "India as a political entity never sought a war but we were forced to fight several and have lost one. During these wars some countries supported us. During the 72 war the USA and UK send their warships against us which would have inflicted crushing defeat on us had not Russia send it warships in support of India. Most countries don't want war but have it forced on them. So are we not supposed to support it or express solidarity with it especially if we have decades of relationship with them? Where would India be if no one support us during our hour of need during those wars?"
    ],
    "cleaned_text": "everybody needs stop picking sides whenever war happens everybody loses war happening israel israel vs hamas know another war ongoing ukraine vs russia know recently war within country still ongoing manipur simple citizen country world hustle minimum wage afford day day living costs imo side choosing side collateral damage innocent civilians technically choose side kind war antiwar whenever war breaks innocent civilians suffer world since ages absolutely logic behind picking sides battle never wars pure policy elites dealers capitalists front runners world divide conquer never end well anyone powerful people never harms way always innocent powerless baited suffer understand anybody marching streets either sides atrocities kind supported world needs stay united question role un people proper housing anymore proper jobs world oil prices already rising people becoming refugees every minute divide old world propogandas pick sides anybody causing kind conflicts whenever war happens nobody wins everybody loses see people divided everywhere extent innocent people dying suffering even express depressing scapegoated losing ",
    "cleaned_title": "everybody needs stop picking sides whenever war happens everybody loses",
    "cleaned_selftext": "war happening israel israel vs hamas know another war ongoing ukraine vs russia know recently war within country still ongoing manipur simple citizen country world hustle minimum wage afford day day living costs imo side choosing side collateral damage innocent civilians technically choose side kind war antiwar whenever war breaks innocent civilians suffer world since ages absolutely logic behind picking sides battle never wars pure policy elites dealers capitalists front runners world divide conquer never end well anyone powerful people never harms way always innocent powerless baited suffer understand anybody marching streets either sides atrocities kind supported world needs stay united question role un people proper housing anymore proper jobs world oil prices already rising people becoming refugees every minute divide old world propogandas pick sides anybody causing kind conflicts whenever war happens nobody wins everybody loses see people divided everywhere extent innocent people dying suffering even express depressing scapegoated losing",
    "cleaned_comments": "source image thedeplorableveteran xtwitter handle pray mercy end bloodshed thats extent back post solider bigger fish fry india political entity never sought war forced fight several lost one wars countries supported us war usa uk send warships us would inflicted crushing defeat us russia send warships support india countries dont want war forced supposed support express solidarity especially decades relationship would india one support us hour need wars",
    "light_cleaned_title": "Everybody needs to stop picking sides! Whenever a war happens, everybody loses!",
    "light_cleaned_selftext": "There is a war happening in Israel, Israel vs Hamas, we all know. Another war has been ongoing, Ukraine vs Russia. We all know. Recently, there was a war within the country itself, still ongoing, in Manipur. As a simple citizen of the country and the world, who has to hustle for a minimum wage just to afford day to day living costs, IMO, the only side we should be choosing is the side of collateral damage- innocent civilians. We should all technically choose the side against any kind of war: anti-war! Whenever a war breaks out, it is innocent civilians who suffer, all over the world, since ages! There is absolutely no logic behind picking sides! This is not our battle, it never was! These wars are just a pure policy by elites, dealers, capitalists and the front runners of the world to DIVIDE AND CONQUER! They never end well for anyone! These powerful people are never in harms way, it is always the innocent and the powerless who are baited and who suffer! I do not understand anybody who is marching on the streets for either sides! Atrocities of any kind cannot be supported! The world needs to stay United and question the role of the UN! People do not have proper housing anymore, no proper jobs all over the world and oil prices are already rising again! More people are becoming refugees every minute! We cannot divide ourselves again with this old world propogandas! WE CANNOT PICK SIDES WITH ANYBODY CAUSING ANY KIND OF CONFLICTS! Whenever a war happens, nobody wins, everybody loses! To see people divided everywhere to such an extent and innocent people dying and suffering, I cannot even express how depressing this is. We are all being scapegoated! We are all losing.",
    "light_cleaned_comments": "Source of image : from TheDeplorableVeteran 's X(Twitter) handle. We can pray for mercy and the end of bloodshed, but that’s the extent of it. Back to your post, solider. Bigger fish to fry. India as a political entity never sought a war but we were forced to fight several and have lost one. During these wars some countries supported us. During the 72 war the USA and UK send their warships against us which would have inflicted crushing defeat on us had not Russia send it warships in support of India. Most countries don't want war but have it forced on them. So are we not supposed to support it or express solidarity with it especially if we have decades of relationship with them? Where would India be if no one support us during our hour of need during those wars?"
}