{
    "id": "15fu90r",
    "title": "A realistic chance for 2024?",
    "url": "https://www.reddit.com/r/india/comments/15fu90r/a_realistic_chance_for_2024/",
    "selftext": "Not a big admirer of Rahul Gandhi, but Indian elections are always about choosing the lesser of the two evils. The way Modi-Shah duo have pushed the country to an abyss is simply terrifying.  I was looking at the distribution of the ruling parties in different state and it looks like BJP is on a pretty shaky ground as compared to 2019. While it's true that state election and central elections are fought on a different level, but I.N.D.I.A. still has a realistic chance if they play their cards well.  This nightmare has to end, we can let them turn our  country into the next Somalia.\n\n&#x200B;\n\nhttps://preview.redd.it/2opvi6hp7lfb1.png?width=1604&format=png&auto=webp&s=dfc8a12dbc8de6ff09df347c763c339cd8dc62e3",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690937552.0,
    "convurl": "https://b.thumbs.redditmedia.com/SAtp7KagHt71GpksX9b_V9RnDxcCJLEuZirJBTRoewQ.jpg",
    "comments": [
        "BJP knows 2024 is going to be challenging because of the opposition uniting. That's why the BJP is trying to pull a Godhra at the national level before the election. Opposition has to not play into their hands and focus the voters attention to the real issues. How much either side is successful remains to be seen.",
        "I have very little faith in the voters to vote sensibly but I still get disappointed every election results.\n\nI guess we should start by educating people how to strategically vote for a better outcome (i.e. vote for India) instead of wasting their votes doing stupid shit.",
        "Somehow people- get the chuckleheads of NDA out in 2024. We will.become the next sub saharan Africa otherwise.",
        "Agreed. My parents were Sanghis but post Manipur their perception of the BJP is changing. I think talking with our friends, peers and family members can go a long way. We are all in this together",
        "BJP will not get majority like last time but still they will win.",
        "We need presidential style elections at the center. biparty system to minimize the chaos.",
        "I would start stockpiling food and other necessities, the way things are going, civil unrest is due before the elections or even during them so that elections are called off.",
        "\nBJP is uncomfortable with a united opposition and yes will engineer riots to hold on to vote bank. IMO.",
        "\nDeshDrohi!😉",
        "\nYes. Unless opposition is truly united in fighting for the win. BJP will go mergers and acquisitions route.",
        "Yogendra Yadav's predictions, although rare have been quite accurate, which shows his accuracy of analysis. In a very recent interview, he says if I.N.D.I.A focuses on economic issues on the ground, and keeps doing so till '24 then it will be very difficult for bjp to make a comeback. And there are signs that I.N.D.I.A is starting to do it. \n\nSo there is hope, although not a guarantee",
        "The opposition that are you talking about are created by people who are opposion of each other.",
        "Defeating Mudi in general elections is next to impossible",
        "Education hi toh band kar de rahe sirf propaganda chal raha.",
        "I.N.D.I.A must elect a PM candidate and support that person through and through. But BJP can buy MPs in the final lap and win if they need to.",
        "\nWhen existence is threatened, they may stick together.",
        "Still PM Vajpayee was able to form an alliance with radically different parties. The situation in India is too dire and parties have to come together",
        "Anything is a step up from fascism",
        "Your message also indicates how much easier it is to fool public in the name of hindu muslim riots",
        "Punjab is ruled by AAP which is part of INDIA.",
        "nope. don't give a name for pm. BJP it cell will start defaming that person. they will start finding any and all shortcomings of the person. so I.N.D.I.A. should postpone it as much as possible.",
        "Yes, the electing the PM candidate happens after they have the people’s mandate, not before.",
        "Absolutely not. India needs to have coalition govts in order to ensure representation. In fact the ECI should start taking action against parties that are turning a representative electoral system into a presidential one.",
        "Having a face always help. BJP won by saying \"abki bar Modi Sarkar\" \n\nHopefully the opposition takes notes.",
        "BJP likely to win next election. The opposition needs to seriously up their game.",
        "We have a representative parliamentary democracy. Espousing presidential concepts, breaks the system that has been put in place. Only the people from the constituency where Modi contested, voted for him, the rest voted for rapists, murderers and crooks all in the name of Modi, and mostly voted against their interests to get BJP to power.\n\nThe ECI needs to step in and for once in their miserable existence do their job.",
        "ECI is a joke. They won't do anything because they can't.",
        "They can do a lot. They won’t is the sad part. Sell outs and corrupt bastards have completely permeated the public sector.",
        "Shit, I thought that would be worst case scenario",
        "Let me tell you the main problem here.\n\nI.N.D.I.A is not even a united opposition. You see all that photo op where everyone is sitting together but then you see news where Sharad Pawar is sharing stage with Modi. Nitish Kumar is pushing his agenda to become a PM face but Congress won't let that happen. TMC convinced AAP to stand with Congress but AAP says it will only support Congress if they in turn support them for the Ordinance bill. Then, you do not have any big party from the north where the major seat sharing is. Congress and SP has minimal presence in Uttar Pradesh and on top of that Owaisi is not part of the coalition which means muslim votes will get distributed wherever he contests on North.\n\nAnd even if I.N.D.I.A somehow achieves the majority. Nitish Kumar, Mamta won't let Congress put forward their PM face which will result in infighting.\n\nPS: I watch Saurabh Dwivedi's Netanagiri to gain all this knowledge and these are not my personal views.",
        "For starters, voters like you have to unite and throw them out. This is as much a fight that opposition has to fight that a common man like you has to fight.",
        "For the opposition to win, it has to win big. Otherwise you are going to have horse trading and them disintegrating. \n\nPlus, two of the 'Other' states you have mentioned is already in BJPs pockets. \n\nSo, like others have mentioned, BJP is going to win but with lesser majority.",
        "Which states are already in their pockets ?",
        "Agree.\n\nEvery rational thinking person has to get the disinterested/ fence-sitters to  see reason and  vote.  It is on us.",
        "See the Gurgaon riots. Create a riot-conducive atmosphere. Don't pre-empt riots.\n\nLater blame minorities.",
        "*we _can't_ let them turn our country into the next Somalia.\n\nFTFY",
        "My favorite KRK movie",
        "How though ? You telling me Delhi Congress & Punjab would be fine with playing second fiddle to AAP ? Or CPI would be fine with giving all seats in Bengal to TMC ?\n\nIt's extremely difficult to see such long time rivalries not playing a spoil sport.",
        "They may get enough seats to force BJP into a modi-less coalition. But thats as far as I expect them to go.",
        "Purely form economic perspective and taking stock market as an indication of growth..\n\nWe are going to see bloodbath on the finance side if at all BJP cant get a clear majority with hung state. The opposition , the way it is today is nothing less than a noodle soup. they cant pull off forming a stable govt.\n\nPS: I am not a bhakt not a mudi fan",
        "\nAdapt or cease to exist.  \n\n Else, BJP is expert in Mergers and Acquisitions.",
        "I.N.D.I.A is a big Noo as of now. I have listed reasons and things they can improve on. \n\nIt doesn't make sense for them politically and RaGa is a joker. He benefits BJP more than he does to his own party. \n\nHere's my concern with I.N.D.I.A\n\n1. The name didn't invoke a sense of nationalism in people, as they had expected. Rather people are expecting them to do better, so to become good enough to be worthy of voting. No one wants I.N.D.I.A. to win the elections. They either want the BJP to win, or they want the BJP to lose. \n\n2. Seat sharing during Lok Sabha elections is going to be a mess. It's not just about who gets how many. It's also about who gets which ones? \n\n3. It makes it easy for the BJP to target them. Earlier they had to fight with every party, now it's all in one alliance so they just need to imply that the entire alliance is not good enough. On a local level, a BJP candidate who had to fight with multiple opponents will now fight with one. The country is desperately looking for options. I.N.D.I.A reduced them further. \n\n4. Coming to RaGa because apparently he is the PM candidate. Remember in 2019 he became a shiv bhakt before elections? yeah he is that stupid and people are not. If he does something like that again, The alliance is gone. \n\nHere are a few things I.N.D.I.A should promise to raise support (my opinion)\n\n1. Strict New Law to make it difficult for the ruling party to go MLA shopping. Also, Explain what that law would be. \n\n2. Expose the weakness of this government, The National Security. And no, I don't mean china. I mean these violent riots. How did Seema enter. Raise the issue of drugs in Sikkim, Jammu and Punjab. Paint it a national issue, not a regional one. \n\n3. A strict new law to make sure the ruling party cannot control the media the way it does today. \n\n4. A clear economic policy. No freebies please. They need to understand that people are loving infrastructure building and Congress needs to promise that. \n\n5. A very difficult demand and hence optional, but can turn the tides. Promise to make top ranking officers the ministers. Make it clear that there would be no internal struggle for ministry offices because we won't take any. We would offer it based on the qualification of people. The question is, Can they do this one?",
        "India deserves better than Modi or Rahul.",
        "Atal and manmohan years were coalition governments. Economy in those times was far better than today",
        "They won't win. But will they play all their dirty tricks to hold on to power, is a totally different question.",
        "Cast your Vote right people!  \n\n\nAll the people posting about leaving the country must understand they need to make themselves count if they wish their family & friends to live in a safe, peaceful & progressive country.   \n\n\nUsually People who are swayed by religion politics are left behind and are also the ones who make their votes count.",
        "you are comparing that coalition with the current one. phew!",
        "Yes, it most certainly is on us. I won't wait for an XYZ opposition group to educate me on what's going on inside my own country. It's my responsibility to aid my country in eliminating the threat to democracy it's currently facing.",
        "If they care at all about ‘INDIA’, they’ll need to realize they are fighting for something bigger than themselves!",
        "You overestimate the loyalty of these opposition parties.\n\nGenuine question, what unites them? Other than their hatred of the BJP? There isn’t a single unifying ideology or plan that brings them together. The only reason they are together is they don’t like the BJP and want power for themselves.\n\nOne phone call from Amit Shah post election and many of the small parties will jump ship if the offer is good.\n\nIt’s a matter of price, they are just trying to increase their price for that eventual phone call from Shah.\n\nYou cannot rely on these hotchpotch clown car of opportunists, dynasts and crooks who will jump ship at one offer from Amit Shah. \n\nCongress needs to become stronger, these regional parties are not reliable",
        "The map does not display all INDIA run states. It is missing Punjab (AAP), WB (TMC), and Kerala (Left parties).\n\n[This img][updated image] is more accurate.\n\n[img]: https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Ruling_Alliances_in_India.jpg/266px-Ruling_Alliances_in_India.jpg",
        "this is a easy wager, BJP is for sure coming back in 2024, the worst thing entire opposition did was to unite under 1 umbrella, it feels more like a desperate bid to keep Modi at bay rather then focusing of development and empowerment.  \n\n\nMoreover the likes of who & who under this I.N.D.I.A, have already been rejected multiple times in previous polls by masses, not sure has changed time time for them.",
        "Until some of them are paid handsomely to switch sides or make breakaway parties post election. Or have the Governor/President choose bhajpa for 6hours at early morning without any notification just to get shitty ordinances passed. The shenanigans bhajpa had been doing in MH since 2014 has been a rollercoaster and are hints as to what they can do. Just yesterday, a study found Bhajpa had disproportionately high wins in recounting everywhere. They won't stop at anything.",
        "Rahul Gandhi has no vision to present to the country his only platform is that he is not modi , he is trying to pull a Joe Biden but Indias electoral realities are different and an anti-modi campaign will not work. He has to present something positive but the best the congress has to offer until now has been outcompeting BJP on freebies and now Karnataka doesn't have Infrastructure budget for a year . The I.N.D.I.A alliance acronym did take the BJP by surprise but the most important thing for the alliance is not to decide a leader nor come up with a common minimum mission but the seat share , lets see how power hungry politicians decide to share their seats , if they work this out without any last minute squabbling they may stand a chance but their chances of getting a majority are near zero",
        "Unless Congress stops backstabbing other parties, people will keep having low faith in coalitions and will vote for a \"directioned\" party instead, no matter how bad is the direction. That was the talk pre-2014 post 26/11 after people demanded war.",
        "24hour news cycle shows voters forget demonetisation woes, fake surgical strikes, covid bodies by the Ganges by the time they have to answer a single 5yearly multiple choice question. The only real way people can press their will on the government is by protesting on the streets the moment such incidents happen. It is a real shame people can congregate and protest for wrong reasons, like gujjars can protest for reservations, people can protest to free rapists but the sane ones won't congregate to protest.\n\nOtherwise voting in democracy is just to see which party has slightly more legitimacy to prevent riots. That is after all the philosophy of voting for the lesser evil, as seen in US, UK where anti-people laws get passed during rw governments but rarely repealed when the left forms government. In captalist democracies, companies like TATA, Airtel will get their way treating people as dirt while getting to blame the rw as scapegoats.",
        "Must elect an administration experienced candidate as PM, not a Chandrasekhar PM like potential Rahul Gandhi. Having Rahul Gandhi as PM will be accepting of the trend of us embracing people idolised by PR, like Modi. PM role should have civil service, military or CM experience as eligibility.",
        "Those are not exactly coalitions but alliances. Coalition is when opposing ideologies group up. INDIA is an alliance. \n\nEconomy and Stock Market should not be taken into account. The former doesn't care about HDI(gujrat model), the latter only shows the trend for conglomerates like Tata, Reliance and Adani. \n\nEconomic principles that was already established with Narsimha Rao govt was destined to be good early on. Atal government might have trimmed it but people would not realize. When Atal govt failed a year after 2002 riots, stock market went to a major bloodbath thinking it would never recover. So investors were fine with 2002 riots, only private money matters in stock market not the country's economy or development.",
        "Back in 2014, TMC had more LS seats than Congress and the level Congress f'ed up meant there wasn't going to be labelled as legal opposition in parliament. I don't see why Congress should be getting special and national treatment. PM role doesn't matter as much as who all takes up cabinet roles. Maybe not AAP or TMC, but rest of the parties know from history that Congress will eventually make demands on seatsharing or backstab the alliance members beyond their seat capability, and that is what will fail INDIA eventually. People should realize electing congress simply out of anti-incumbency wave and electing lesser of two sycophants is perpetuating the same cycle thats been going on since independence. When regional parties have already formed a national coalition, there should little reason to keep INC relevant anymore just like bhajpa.",
        "Yeah so that Bhajpa and INC alike can do Hindi imposition with no way for people to protest against it.",
        "It really hurts when a naive and internet illiterate heavy population like us can be manipulated so easily by sold media and fake news factory. The ones who are not Falling prey to this should atleast do their bits in throwing the fascists out.",
        ">PM role doesn't matter as much as who all takes up cabinet roles.\n\nThis is where the big fighting is going to happen. Coalition works where a party is in majority and other parties support it with smaller numbers. In case of I.N.D.I.A the Congress will hold as much importance as other parties in terms of numbers and that will result in cabinet reshuffle more often. \n\nAlso, There was a time when Congress was the biggest party in the North but it's their own doing that has led to this. Rahul Gandhi himself lost the election from a seat where Congress was never defeated since independence.",
        "People have been too neutered by social media and workhours to come to the streets. All we do is complain on something online, in line with 24hr news cycle, make witty jokes, get that serotonin suppress our fears and depression and get ready for the next 24hour cycle while jobless sanghi uncles will come to the streets to protect rapists and shit.",
        "Coming out on streets is a one way ticket to jail with NSA/UAPA charges.",
        "How do you rate someone who was never a PM and tell we need better. You had examples from Gujrat of the riots and of fake progress still had no problem making Modi as PM.",
        "Sticking to what our founding fathers thought as idea of India is a better vision by mile than whatever Vikaas vision BJP has.",
        "A nation fundamentally runs on the productivity of its people. A protest is not just for a show but to blockade the functioning of a bad government. How many of the working class can government afford to jail, we already have a brain drain. Even if you are working and not paying tax, your employer is providing a value to the government and so lower paid employees protesting is still reducing the productivity for the government. Yes we have a 1.4billion population and there would be picketing but not without a drop in productivity.",
        "It is a fcked up situation. 18-25 are glued to making comments on social media while 25+ are bogged down by 9-10work hours and family responsibilities. Compare the protests of the 19th and 20th century globally especially India, most were 18-25yo youths, a stark contrast from today. There was once a saying saying in India till the 90s that onion prices can take down the government. It is no longer true.\n\nSchool Education has become like handing prizes to everybody, most gets 80% or 90% easily while curriculum has been getting trimmed for decades now. People get incredibly pampered in India this way feeling sab changa si. They want to be dependent on parents or religion to instruct them what to do. I would not even call people up till 25 to be adults, matured enough to vote or do adult things, same way 16 threshold got increased to 18 once upon a time.",
        "Can you elaborate what you mean by \"pushed the country into an abyss\"? Please add specific examples too.",
        "There will be more planned riots \n\nMore people like Monu Manesar will instigate riots\n\n\n\nEven 2019 was risky they pulled a Pulwama and won",
        "INDIA could win easily if they manage to get Mayavati, KCR and Jagan on board. They can still win without these but it’ll be tough",
        "Why not Sachin Pilot , why not Supriya Srinet or Shashi Tharoor for PM\nThey all are more experienced and qualified then him\n\nWhy only Rahul",
        "Asking CPI to adapt is basically asking them to die in Bengal, it's not as black and white as you think.",
        "I know.\n\nI am sure there are issues even in Kerala with INC Vs CPM.\n\nBut, if either of them wins, it is good enough for the support of a non-BJP Govt.",
        "We can't sit on our hands and hope INDIA Alliance delivers. We need to get out, organized, protest, call out, shame, and convince people to not vote for the absolute worst option destroying this country.",
        ">Asking CPI to adapt is basically asking them to die in Bengal, \n\nNope. They can still fight against tmc at state and local levels, just not at national level till the menace of bjp is finished.",
        "Chahe  ho jaye vote toh Modi ji ko hi denge",
        "Enough states are under the rule of Congress for the last 9 years and they have done nothing impressive there.\n\nJust because BJP has been horrible, it does not mean that Congress becomes automatically great.",
        "Congress is way better especially at the center. How old are you? Manmohan singh ran a competent govt before BJP and Kejriwal just spread propoganda. If ministers were corrupt, they got convicted.",
        "They still haven't played all their cards. Who knows what nightmare will haunt us in this one year 😔",
        "You mean Murders and Executions? /s",
        "I don't get the obsession with founding fathers whether its here or anywhere else in the world , they lived in a completely different era, their realities were completely different than ours . \nWhile the social integration thoughts of our founding fathers was better than the BJP their economic policies were terrible and they tried to be extra smart with their foreign policy, I am not saying the BJP is better in these regards but just pointing out that they weren't as great as our history textbooks would like us to believe, everyone has flaws and Indias founding fathers had some major ones",
        "BJD and YSCRP",
        "Just because opposition doesn’t have pm candidate doesn’t mean modi should win. \n\nImagine hitler asking if not hitler than who .\n\nCountry is run by institutions which modi destroyed and made in to just 2. \nEverything is controlled by modisha.\n\nIf someone from opposition comes then power will be shared with institutions and Supreme Court and states and not just the two",
        "Yes, INDIA has a realistic chance if they keep doing the right thing till the very end without fighting. Also the more confidence they can project, parties that have chosen to be neutral may swing in their favour. Rahul Gandhi obviously, shouldn't and isn't the PM face and as of now they are fighting for some cause without projecting any PM candidate but that will be a major issue. \n\nWhat worries me more is the BJP thinking that they can lose. If they do, they have run out of all cards except to fall back to total Hindutva ergo show of strength by Hindutva outfits which will predictably be followed by violence followed by the BJP winning. It's a tried and tested model for them and it's already happening. Look how they completely changed the states of affairs in Maharashtra (Nashik, Kolhapur, Amravati). Maharashtra was not prone to such communal incidents and suddenly we have a spate of them. Look at Haryana and now the planned 'protests' in Delhi. They will try to keep the country as polarized as possible.",
        "What economic policy from Nehruvian period has pulled Indian economy’s growth as much as Demonitisation? And, what exactly has changed in economic policy since liberalization started by Manmohan as FM other than more liberalization? What kind of economy is better for India is a debatable topic, an economy similar to an European welfare state or that similar to USA that has major wealth disparities and yet has a great GDP and infrastructure but only available for a few.",
        "If course there is a realistic chance, if people of our country find enough courage in their consciousness to take the correct action through their vote.",
        "Welllll there was no growth in the first place to pull it down , demonitisation was an absolute disaster class but lets not kid ourselves that this was the only reason for Indias slowdown, bank lending in india fell off a cliff around 2010 , due to the new bankruptcy code implemented in 2016 , many previous NPA's were caught and banks became extra wary of lending. I am not discounting demonitisation but the people majorly affected by it were the people who were not contributing to the GDP greatly in the first place to put it bluntly , most people with resources got their cash converted at a cost and that did slow us down. \nBefore covid the governments economic policy wasn't great but after covid they have been quite good, before covid all the stories were india is slowing down and no consumer demand etc, now most articles are quite bullish on India with the govts commitment towards building hard Infrastructure in the country, if they build what they are saying they will build it shall be excellent for the country.The UPA presided over the country when we had our best growth figures but they didn't reinvest it into infrastructure they instead went for wealth redistribution (modi has alos done it but not to that extent) , this govt has even in the last full budget before election gone for massive Infra spending, this is what the country requires at the moment.\nThe European welfare state got its money because  of either natural resources Ex: Netherlands or Norway or a massive Industrial base like Germany.\nWe need to get to a certain Gdp per capita before even dreaming about such an extensive welfare and redistribution state. Right now the country would be better served with providing jobs to people with industrialisation rather than helicopter money.",
        "BJP still have some huge opportunities to do a masterstroke.\n1) Ram mandir will open soon and the amount of hype and marketing will be surreal. The only thing which can backfire in this is the possibility of Adavi passing away before the opening. Then I think they may get criticism for not inaugurating the temple earlier. \n2) All important world cup matches are gonna be held in Narendra Modi stadium and Modi ji definitely will do some stunt there to gain clout. If india wins world cup there is gonna be Modi posters every where along with the indian cricket team.\n\nBut I hope people see through these shenanigans this time and vote for the best.",
        "my hope is bjp doesn't get full majority otherwise be prepared for kneejerk decisions with no accountability, remember demo, lockdowns, farm laws etc. They would keep doing it as they are too arrogant to be held accountable in parliament and media is their puppy.\n\nRaga's image has been tarnished by bjp and media for a decade,  listen to his interviews on forums the guy is much more knowledgable and articulate than he's given credit for. I just hope people wake up and reject this gov next year.",
        "Coal scam, 2G scam, commonwealth scam, railways scam, shall I keep going on or you got the gist?",
        "Just fyi not one person accused in the 2G scam was found guilty. Every single accused person was acquitted. \n\nThe court ruled that the case was baseless. \n\nAnd if people still think that there was weight to that case, like you've just demonstrated, it means that BJPs propaganda machinery has done its job.",
        "No, I didnt. Many of them were not scams. Some of them were and courts sentenced people. You have to read about individual cases and how they ended. BJP and kejru just fooled people by repeating scam names. Indians were really get I to details and keep parroting.",
        ">You cant blame congress for corruption alone.\n\nOkay then why should anyone choose Congress over BJP, if corruption is everyone's faults then so does everything else as well.",
        "Don't choose. I am not here for stupid arguments. Vote BJP and enjoy the lynching show. You are doing false equivalence, and either disingenuous or plain stupid. Did you read what happened to those scams?",
        "Modi will win. Indians don't deserve freedom as it requires sacrifice that was never paid. It was given by British for free and squandered very easily. There will be subjugation for centuries like there always was. Sometimes by mughals, sometimes based on caste, women lynchings. I mean in which country on earth sati like practice existed in 20th century or 19th or 18th. Discrimination within same race based on caste.\n\nMay be start by looking at your past to understand who we really were.",
        "Their 2nd masterstroke completely backfired 🤭"
    ],
    "cleaned_text": "realistic chance big admirer rahul gandhi indian elections always choosing lesser two evils way modishah duo pushed country abyss simply terrifying looking distribution ruling parties different state looks like bjp pretty shaky ground compared true state election central elections fought different level india still realistic chance play cards well nightmare end let turn country next somalia xb ",
    "cleaned_title": "realistic chance",
    "cleaned_selftext": "big admirer rahul gandhi indian elections always choosing lesser two evils way modishah duo pushed country abyss simply terrifying looking distribution ruling parties different state looks like bjp pretty shaky ground compared true state election central elections fought different level india still realistic chance play cards well nightmare end let turn country next somalia xb",
    "cleaned_comments": "bjp knows going challenging opposition uniting thats bjp trying pull godhra national level election opposition play hands focus voters attention real issues much either side successful remains seen little faith voters vote sensibly still get disappointed every election results guess start educating people strategically vote better outcome ie vote india instead wasting votes stupid shit somehow people get chuckleheads nda willbecome next sub saharan africa otherwise agreed parents sanghis post manipur perception bjp changing think talking friends peers family members go long way together bjp get majority like last time still win need presidential style elections center biparty system minimize chaos would start stockpiling food necessities way things going civil unrest due elections even elections called bjp uncomfortable united opposition yes engineer riots hold vote bank imo deshdrohi yes unless opposition truly united fighting win bjp go mergers acquisitions route yogendra yadavs predictions although rare quite accurate shows accuracy analysis recent interview says india focuses economic issues ground keeps till difficult bjp make comeback signs india starting hope although guarantee opposition talking created people opposion defeating mudi general elections next impossible education hi toh band kar de rahe sirf propaganda chal raha india must elect pm candidate support person bjp buy mps final lap win need existence threatened may stick together still pm vajpayee able form alliance radically different parties situation india dire parties come together anything step fascism message also indicates much easier fool public name hindu muslim riots punjab ruled aap part india nope dont give name pm bjp cell start defaming person start finding shortcomings person india postpone much possible yes electing pm candidate happens peoples mandate absolutely india needs coalition govts order ensure representation fact eci start taking action parties turning representative electoral system presidential one face always help bjp saying abki bar modi sarkar hopefully opposition takes notes bjp likely win next election opposition needs seriously game representative parliamentary democracy espousing presidential concepts breaks system put place people constituency modi contested voted rest voted rapists murderers crooks name modi mostly voted interests get bjp power eci needs step miserable existence job eci joke wont anything cant lot wont sad part sell outs corrupt bastards completely permeated public sector shit thought would worst case scenario let tell main problem india even united opposition see photo op everyone sitting together see news sharad pawar sharing stage modi nitish kumar pushing agenda become pm face congress wont let happen tmc convinced aap stand congress aap says support congress turn support ordinance bill big party north major seat sharing congress sp minimal presence uttar pradesh top owaisi part coalition means muslim votes get distributed wherever contests north even india somehow achieves majority nitish kumar mamta wont let congress put forward pm face result infighting ps watch saurabh dwivedis netanagiri gain knowledge personal views starters voters like unite throw much fight opposition fight common man like fight opposition win win big otherwise going horse trading disintegrating plus two states mentioned already bjps pockets like others mentioned bjp going win lesser majority states already pockets agree every rational thinking person get disinterested fencesitters see reason vote us see gurgaon riots create riotconducive atmosphere dont preempt riots later blame minorities cant let turn country next somalia ftfy favorite krk movie though telling delhi congress punjab would fine playing second fiddle aap cpi would fine giving seats bengal tmc extremely difficult see long time rivalries playing spoil sport may get enough seats force bjp modiless coalition thats far expect go purely form economic perspective taking stock market indication growth going see bloodbath finance side bjp cant get clear majority hung state opposition way today nothing less noodle soup cant pull forming stable govt ps bhakt mudi fan adapt cease exist else bjp expert mergers acquisitions india big noo listed reasons things improve doesnt make sense politically raga joker benefits bjp party heres concern india name didnt invoke sense nationalism people expected rather people expecting better become good enough worthy voting one wants india win elections either want bjp win want bjp lose seat sharing lok sabha elections going mess gets many also gets ones makes easy bjp target earlier fight every party one alliance need imply entire alliance good enough local level bjp candidate fight multiple opponents fight one country desperately looking options india reduced coming raga apparently pm candidate remember became shiv bhakt elections yeah stupid people something like alliance gone things india promise raise support opinion strict new law make difficult ruling party go mla shopping also explain law would expose weakness government national security dont mean china mean violent riots seema enter raise issue drugs sikkim jammu punjab paint national issue regional one strict new law make sure ruling party control media way today clear economic policy freebies please need understand people loving infrastructure building congress needs promise difficult demand hence optional turn tides promise make top ranking officers ministers make clear would internal struggle ministry offices wont take would offer based qualification people question one india deserves better modi rahul atal manmohan years coalition governments economy times far better today wont win play dirty tricks hold power totally different question cast vote right people people posting leaving country must understand need make count wish family friends live safe peaceful progressive country usually people swayed religion politics left behind also ones make votes count comparing coalition current one phew yes certainly us wont wait xyz opposition group educate whats going inside country responsibility aid country eliminating threat democracy currently facing care india theyll need realize fighting something bigger overestimate loyalty opposition parties genuine question unites hatred bjp isnt single unifying ideology plan brings together reason together dont like bjp want power one phone call amit shah post election many small parties jump ship offer good matter price trying increase price eventual phone call shah rely hotchpotch clown car opportunists dynasts crooks jump ship one offer amit shah congress needs become stronger regional parties reliable map display india run states missing punjab aap wb tmc kerala left parties imgupdated image accurate img easy wager bjp sure coming back worst thing entire opposition unite umbrella feels like desperate bid keep modi bay rather focusing development empowerment moreover likes india already rejected multiple times previous polls masses sure changed time time paid handsomely switch sides make breakaway parties post election governorpresident choose bhajpa hours early morning without notification get shitty ordinances passed shenanigans bhajpa mh since rollercoaster hints yesterday study found bhajpa disproportionately high wins recounting everywhere wont stop anything rahul gandhi vision present country platform modi trying pull joe biden indias electoral realities different antimodi campaign work present something positive best congress offer outcompeting bjp freebies karnataka doesnt infrastructure budget year india alliance acronym take bjp surprise important thing alliance decide leader come common minimum mission seat share lets see power hungry politicians decide share seats work without last minute squabbling may stand chance chances getting majority near zero unless congress stops backstabbing parties people keep low faith coalitions vote directioned party instead matter bad direction talk pre post people demanded war hour news cycle shows voters forget demonetisation woes fake surgical strikes covid bodies ganges time answer single yearly multiple choice question real way people press government protesting streets moment incidents happen real shame people congregate protest wrong reasons like gujjars protest reservations people protest free rapists sane ones wont congregate protest otherwise voting democracy see party slightly legitimacy prevent riots philosophy voting lesser evil seen us uk antipeople laws get passed rw governments rarely repealed left forms government captalist democracies companies like tata airtel get way treating people dirt getting blame rw scapegoats must elect administration experienced candidate pm chandrasekhar pm like potential rahul gandhi rahul gandhi pm accepting trend us embracing people idolised pr like modi pm role civil service military cm experience eligibility exactly coalitions alliances coalition opposing ideologies group india alliance economy stock market taken account former doesnt care hdigujrat model latter shows trend conglomerates like tata reliance adani economic principles already established narsimha rao govt destined good early atal government might trimmed people would realize atal govt failed year riots stock market went major bloodbath thinking would never recover investors fine riots private money matters stock market countrys economy development back tmc ls seats congress level congress fed meant wasnt going labelled legal opposition parliament dont see congress getting special national treatment pm role doesnt matter much takes cabinet roles maybe aap tmc rest parties know history congress eventually make demands seatsharing backstab alliance members beyond seat capability fail india eventually people realize electing congress simply antiincumbency wave electing lesser two sycophants perpetuating cycle thats going since independence regional parties already formed national coalition little reason keep inc relevant anymore like bhajpa yeah bhajpa inc alike hindi imposition way people protest really hurts naive internet illiterate heavy population like us manipulated easily sold media fake news factory ones falling prey atleast bits throwing fascists pm role doesnt matter much takes cabinet roles big fighting going happen coalition works party majority parties support smaller numbers case india congress hold much importance parties terms numbers result cabinet reshuffle often also time congress biggest party north led rahul gandhi lost election seat congress never defeated since independence people neutered social media workhours come streets complain something online line hr news cycle make witty jokes get serotonin suppress fears depression get ready next hour cycle jobless sanghi uncles come streets protect rapists shit coming streets one way ticket jail nsauapa charges rate someone never pm tell need better examples gujrat riots fake progress still problem making modi pm sticking founding fathers thought idea india better vision mile whatever vikaas vision bjp nation fundamentally runs productivity people protest show blockade functioning bad government many working class government afford jail already brain drain even working paying tax employer providing value government lower paid employees protesting still reducing productivity government yes billion population would picketing without drop productivity fcked situation glued making comments social media bogged work hours family responsibilities compare protests th th century globally especially india yo youths stark contrast today saying saying india till onion prices take government longer true school education become like handing prizes everybody gets easily curriculum getting trimmed decades people get incredibly pampered india way feeling sab changa si want dependent parents religion instruct would even call people till adults matured enough vote adult things way threshold got increased upon time elaborate mean pushed country abyss please add specific examples planned riots people like monu manesar instigate riots even risky pulled pulwama india could win easily manage get mayavati kcr jagan board still win without itll tough sachin pilot supriya srinet shashi tharoor pm experienced qualified rahul asking cpi adapt basically asking die bengal black white think know sure issues even kerala inc vs cpm either wins good enough support nonbjp govt cant sit hands hope india alliance delivers need get organized protest call shame convince people vote absolute worst option destroying country asking cpi adapt basically asking die bengal nope still fight tmc state local levels national level till menace bjp finished chahe ho jaye vote toh modi ji ko hi denge enough states rule congress last years done nothing impressive bjp horrible mean congress becomes automatically great congress way better especially center old manmohan singh ran competent govt bjp kejriwal spread propoganda ministers corrupt got convicted still havent played cards knows nightmare haunt us one year mean murders executions dont get obsession founding fathers whether anywhere else world lived completely different era realities completely different social integration thoughts founding fathers better bjp economic policies terrible tried extra smart foreign policy saying bjp better regards pointing werent great history textbooks would like us believe everyone flaws indias founding fathers major ones bjd yscrp opposition doesnt pm candidate doesnt mean modi win imagine hitler asking hitler country run institutions modi destroyed made everything controlled modisha someone opposition comes power shared institutions supreme court states two yes india realistic chance keep right thing till end without fighting also confidence project parties chosen neutral may swing favour rahul gandhi obviously shouldnt isnt pm face fighting cause without projecting pm candidate major issue worries bjp thinking lose run cards except fall back total hindutva ergo show strength hindutva outfits predictably followed violence followed bjp winning tried tested model already happening look completely changed states affairs maharashtra nashik kolhapur amravati maharashtra prone communal incidents suddenly spate look haryana planned protests delhi try keep country polarized possible economic policy nehruvian period pulled indian economys growth much demonitisation exactly changed economic policy since liberalization started manmohan fm liberalization kind economy better india debatable topic economy similar european welfare state similar usa major wealth disparities yet great gdp infrastructure available course realistic chance people country find enough courage consciousness take correct action vote welllll growth first place pull demonitisation absolute disaster class lets kid reason indias slowdown bank lending india fell cliff around due new bankruptcy code implemented many previous npas caught banks became extra wary lending discounting demonitisation people majorly affected people contributing gdp greatly first place put bluntly people resources got cash converted cost slow us covid governments economic policy wasnt great covid quite good covid stories india slowing consumer demand etc articles quite bullish india govts commitment towards building hard infrastructure country build saying build shall excellent countrythe upa presided country best growth figures didnt reinvest infrastructure instead went wealth redistribution modi alos done extent govt even last full budget election gone massive infra spending country requires moment european welfare state got money either natural resources ex netherlands norway massive industrial base like germany need get certain gdp per capita even dreaming extensive welfare redistribution state right country would better served providing jobs people industrialisation rather helicopter money bjp still huge opportunities masterstroke ram mandir open soon amount hype marketing surreal thing backfire possibility adavi passing away opening think may get criticism inaugurating temple earlier important world cup matches gon na held narendra modi stadium modi ji definitely stunt gain clout india wins world cup gon na modi posters every along indian cricket team hope people see shenanigans time vote best hope bjp doesnt get full majority otherwise prepared kneejerk decisions accountability remember demo lockdowns farm laws etc would keep arrogant held accountable parliament media puppy ragas image tarnished bjp media decade listen interviews forums guy much knowledgable articulate hes given credit hope people wake reject gov next year coal scam g scam commonwealth scam railways scam shall keep going got gist fyi one person accused g scam found guilty every single accused person acquitted court ruled case baseless people still think weight case like youve demonstrated means bjps propaganda machinery done job didnt many scams courts sentenced people read individual cases ended bjp kejru fooled people repeating scam names indians really get details keep parroting cant blame congress corruption alone okay anyone choose congress bjp corruption everyones faults everything else well dont choose stupid arguments vote bjp enjoy lynching show false equivalence either disingenuous plain stupid read happened scams modi win indians dont deserve freedom requires sacrifice never paid given british free squandered easily subjugation centuries like always sometimes mughals sometimes based caste women lynchings mean country earth sati like practice existed th century th th discrimination within race based caste may start looking past understand really nd masterstroke completely backfired",
    "light_cleaned_title": "A realistic chance for 2024?",
    "light_cleaned_selftext": "Not a big admirer of Rahul Gandhi, but Indian elections are always about choosing the lesser of the two evils. The way Modi-Shah duo have pushed the country to an abyss is simply terrifying. I was looking at the distribution of the ruling parties in different state and it looks like BJP is on a pretty shaky ground as compared to 2019. While it's true that state election and central elections are fought on a different level, but I.N.D.I.A. still has a realistic chance if they play their cards well. This nightmare has to end, we can let them turn our country into the next Somalia. &#x200B;",
    "light_cleaned_comments": "BJP knows 2024 is going to be challenging because of the opposition uniting. That's why the BJP is trying to pull a Godhra at the national level before the election. Opposition has to not play into their hands and focus the voters attention to the real issues. How much either side is successful remains to be seen. I have very little faith in the voters to vote sensibly but I still get disappointed every election results. I guess we should start by educating people how to strategically vote for a better outcome (i.e. vote for India) instead of wasting their votes doing stupid shit. Somehow people- get the chuckleheads of NDA out in 2024. We will.become the next sub saharan Africa otherwise. Agreed. My parents were Sanghis but post Manipur their perception of the BJP is changing. I think talking with our friends, peers and family members can go a long way. We are all in this together BJP will not get majority like last time but still they will win. We need presidential style elections at the center. biparty system to minimize the chaos. I would start stockpiling food and other necessities, the way things are going, civil unrest is due before the elections or even during them so that elections are called off. BJP is uncomfortable with a united opposition and yes will engineer riots to hold on to vote bank. IMO. DeshDrohi!😉 Yes. Unless opposition is truly united in fighting for the win. BJP will go mergers and acquisitions route. Yogendra Yadav's predictions, although rare have been quite accurate, which shows his accuracy of analysis. In a very recent interview, he says if I.N.D.I.A focuses on economic issues on the ground, and keeps doing so till '24 then it will be very difficult for bjp to make a comeback. And there are signs that I.N.D.I.A is starting to do it. So there is hope, although not a guarantee The opposition that are you talking about are created by people who are opposion of each other. Defeating Mudi in general elections is next to impossible Education hi toh band kar de rahe sirf propaganda chal raha. I.N.D.I.A must elect a PM candidate and support that person through and through. But BJP can buy MPs in the final lap and win if they need to. When existence is threatened, they may stick together. Still PM Vajpayee was able to form an alliance with radically different parties. The situation in India is too dire and parties have to come together Anything is a step up from fascism Your message also indicates how much easier it is to fool public in the name of hindu muslim riots Punjab is ruled by AAP which is part of INDIA. nope. don't give a name for pm. BJP it cell will start defaming that person. they will start finding any and all shortcomings of the person. so I.N.D.I.A. should postpone it as much as possible. Yes, the electing the PM candidate happens after they have the people’s mandate, not before. Absolutely not. India needs to have coalition govts in order to ensure representation. In fact the ECI should start taking action against parties that are turning a representative electoral system into a presidential one. Having a face always help. BJP won by saying \"abki bar Modi Sarkar\" Hopefully the opposition takes notes. BJP likely to win next election. The opposition needs to seriously up their game. We have a representative parliamentary democracy. Espousing presidential concepts, breaks the system that has been put in place. Only the people from the constituency where Modi contested, voted for him, the rest voted for rapists, murderers and crooks all in the name of Modi, and mostly voted against their interests to get BJP to power. The ECI needs to step in and for once in their miserable existence do their job. ECI is a joke. They won't do anything because they can't. They can do a lot. They won’t is the sad part. Sell outs and corrupt bastards have completely permeated the public sector. Shit, I thought that would be worst case scenario Let me tell you the main problem here. I.N.D.I.A is not even a united opposition. You see all that photo op where everyone is sitting together but then you see news where Sharad Pawar is sharing stage with Modi. Nitish Kumar is pushing his agenda to become a PM face but Congress won't let that happen. TMC convinced AAP to stand with Congress but AAP says it will only support Congress if they in turn support them for the Ordinance bill. Then, you do not have any big party from the north where the major seat sharing is. Congress and SP has minimal presence in Uttar Pradesh and on top of that Owaisi is not part of the coalition which means muslim votes will get distributed wherever he contests on North. And even if I.N.D.I.A somehow achieves the majority. Nitish Kumar, Mamta won't let Congress put forward their PM face which will result in infighting. PS: I watch Saurabh Dwivedi's Netanagiri to gain all this knowledge and these are not my personal views. For starters, voters like you have to unite and throw them out. This is as much a fight that opposition has to fight that a common man like you has to fight. For the opposition to win, it has to win big. Otherwise you are going to have horse trading and them disintegrating. Plus, two of the 'Other' states you have mentioned is already in BJPs pockets. So, like others have mentioned, BJP is going to win but with lesser majority. Which states are already in their pockets ? Agree. Every rational thinking person has to get the disinterested/ fence-sitters to see reason and vote. It is on us. See the Gurgaon riots. Create a riot-conducive atmosphere. Don't pre-empt riots. Later blame minorities. *we _can't_ let them turn our country into the next Somalia. FTFY My favorite KRK movie How though ? You telling me Delhi Congress & Punjab would be fine with playing second fiddle to AAP ? Or CPI would be fine with giving all seats in Bengal to TMC ? It's extremely difficult to see such long time rivalries not playing a spoil sport. They may get enough seats to force BJP into a modi-less coalition. But thats as far as I expect them to go. Purely form economic perspective and taking stock market as an indication of growth.. We are going to see bloodbath on the finance side if at all BJP cant get a clear majority with hung state. The opposition , the way it is today is nothing less than a noodle soup. they cant pull off forming a stable govt. PS: I am not a bhakt not a mudi fan Adapt or cease to exist. Else, BJP is expert in Mergers and Acquisitions. I.N.D.I.A is a big Noo as of now. I have listed reasons and things they can improve on. It doesn't make sense for them politically and RaGa is a joker. He benefits BJP more than he does to his own party. Here's my concern with I.N.D.I.A 1. The name didn't invoke a sense of nationalism in people, as they had expected. Rather people are expecting them to do better, so to become good enough to be worthy of voting. No one wants I.N.D.I.A. to win the elections. They either want the BJP to win, or they want the BJP to lose. 2. Seat sharing during Lok Sabha elections is going to be a mess. It's not just about who gets how many. It's also about who gets which ones? 3. It makes it easy for the BJP to target them. Earlier they had to fight with every party, now it's all in one alliance so they just need to imply that the entire alliance is not good enough. On a local level, a BJP candidate who had to fight with multiple opponents will now fight with one. The country is desperately looking for options. I.N.D.I.A reduced them further. 4. Coming to RaGa because apparently he is the PM candidate. Remember in 2019 he became a shiv bhakt before elections? yeah he is that stupid and people are not. If he does something like that again, The alliance is gone. Here are a few things I.N.D.I.A should promise to raise support (my opinion) 1. Strict New Law to make it difficult for the ruling party to go MLA shopping. Also, Explain what that law would be. 2. Expose the weakness of this government, The National Security. And no, I don't mean china. I mean these violent riots. How did Seema enter. Raise the issue of drugs in Sikkim, Jammu and Punjab. Paint it a national issue, not a regional one. 3. A strict new law to make sure the ruling party cannot control the media the way it does today. 4. A clear economic policy. No freebies please. They need to understand that people are loving infrastructure building and Congress needs to promise that. 5. A very difficult demand and hence optional, but can turn the tides. Promise to make top ranking officers the ministers. Make it clear that there would be no internal struggle for ministry offices because we won't take any. We would offer it based on the qualification of people. The question is, Can they do this one? India deserves better than Modi or Rahul. Atal and manmohan years were coalition governments. Economy in those times was far better than today They won't win. But will they play all their dirty tricks to hold on to power, is a totally different question. Cast your Vote right people! All the people posting about leaving the country must understand they need to make themselves count if they wish their family & friends to live in a safe, peaceful & progressive country. Usually People who are swayed by religion politics are left behind and are also the ones who make their votes count. you are comparing that coalition with the current one. phew! Yes, it most certainly is on us. I won't wait for an XYZ opposition group to educate me on what's going on inside my own country. It's my responsibility to aid my country in eliminating the threat to democracy it's currently facing. If they care at all about ‘INDIA’, they’ll need to realize they are fighting for something bigger than themselves! You overestimate the loyalty of these opposition parties. Genuine question, what unites them? Other than their hatred of the BJP? There isn’t a single unifying ideology or plan that brings them together. The only reason they are together is they don’t like the BJP and want power for themselves. One phone call from Amit Shah post election and many of the small parties will jump ship if the offer is good. It’s a matter of price, they are just trying to increase their price for that eventual phone call from Shah. You cannot rely on these hotchpotch clown car of opportunists, dynasts and crooks who will jump ship at one offer from Amit Shah. Congress needs to become stronger, these regional parties are not reliable The map does not display all INDIA run states. It is missing Punjab (AAP), WB (TMC), and Kerala (Left parties). [This img][updated image] is more accurate. [img]: this is a easy wager, BJP is for sure coming back in 2024, the worst thing entire opposition did was to unite under 1 umbrella, it feels more like a desperate bid to keep Modi at bay rather then focusing of development and empowerment. Moreover the likes of who & who under this I.N.D.I.A, have already been rejected multiple times in previous polls by masses, not sure has changed time time for them. Until some of them are paid handsomely to switch sides or make breakaway parties post election. Or have the Governor/President choose bhajpa for 6hours at early morning without any notification just to get shitty ordinances passed. The shenanigans bhajpa had been doing in MH since 2014 has been a rollercoaster and are hints as to what they can do. Just yesterday, a study found Bhajpa had disproportionately high wins in recounting everywhere. They won't stop at anything. Rahul Gandhi has no vision to present to the country his only platform is that he is not modi , he is trying to pull a Joe Biden but Indias electoral realities are different and an anti-modi campaign will not work. He has to present something positive but the best the congress has to offer until now has been outcompeting BJP on freebies and now Karnataka doesn't have Infrastructure budget for a year . The I.N.D.I.A alliance acronym did take the BJP by surprise but the most important thing for the alliance is not to decide a leader nor come up with a common minimum mission but the seat share , lets see how power hungry politicians decide to share their seats , if they work this out without any last minute squabbling they may stand a chance but their chances of getting a majority are near zero Unless Congress stops backstabbing other parties, people will keep having low faith in coalitions and will vote for a \"directioned\" party instead, no matter how bad is the direction. That was the talk pre-2014 post 26/11 after people demanded war. 24hour news cycle shows voters forget demonetisation woes, fake surgical strikes, covid bodies by the Ganges by the time they have to answer a single 5yearly multiple choice question. The only real way people can press their will on the government is by protesting on the streets the moment such incidents happen. It is a real shame people can congregate and protest for wrong reasons, like gujjars can protest for reservations, people can protest to free rapists but the sane ones won't congregate to protest. Otherwise voting in democracy is just to see which party has slightly more legitimacy to prevent riots. That is after all the philosophy of voting for the lesser evil, as seen in US, UK where anti-people laws get passed during rw governments but rarely repealed when the left forms government. In captalist democracies, companies like TATA, Airtel will get their way treating people as dirt while getting to blame the rw as scapegoats. Must elect an administration experienced candidate as PM, not a Chandrasekhar PM like potential Rahul Gandhi. Having Rahul Gandhi as PM will be accepting of the trend of us embracing people idolised by PR, like Modi. PM role should have civil service, military or CM experience as eligibility. Those are not exactly coalitions but alliances. Coalition is when opposing ideologies group up. INDIA is an alliance. Economy and Stock Market should not be taken into account. The former doesn't care about HDI(gujrat model), the latter only shows the trend for conglomerates like Tata, Reliance and Adani. Economic principles that was already established with Narsimha Rao govt was destined to be good early on. Atal government might have trimmed it but people would not realize. When Atal govt failed a year after 2002 riots, stock market went to a major bloodbath thinking it would never recover. So investors were fine with 2002 riots, only private money matters in stock market not the country's economy or development. Back in 2014, TMC had more LS seats than Congress and the level Congress f'ed up meant there wasn't going to be labelled as legal opposition in parliament. I don't see why Congress should be getting special and national treatment. PM role doesn't matter as much as who all takes up cabinet roles. Maybe not AAP or TMC, but rest of the parties know from history that Congress will eventually make demands on seatsharing or backstab the alliance members beyond their seat capability, and that is what will fail INDIA eventually. People should realize electing congress simply out of anti-incumbency wave and electing lesser of two sycophants is perpetuating the same cycle thats been going on since independence. When regional parties have already formed a national coalition, there should little reason to keep INC relevant anymore just like bhajpa. Yeah so that Bhajpa and INC alike can do Hindi imposition with no way for people to protest against it. It really hurts when a naive and internet illiterate heavy population like us can be manipulated so easily by sold media and fake news factory. The ones who are not Falling prey to this should atleast do their bits in throwing the fascists out. >PM role doesn't matter as much as who all takes up cabinet roles. This is where the big fighting is going to happen. Coalition works where a party is in majority and other parties support it with smaller numbers. In case of I.N.D.I.A the Congress will hold as much importance as other parties in terms of numbers and that will result in cabinet reshuffle more often. Also, There was a time when Congress was the biggest party in the North but it's their own doing that has led to this. Rahul Gandhi himself lost the election from a seat where Congress was never defeated since independence. People have been too neutered by social media and workhours to come to the streets. All we do is complain on something online, in line with 24hr news cycle, make witty jokes, get that serotonin suppress our fears and depression and get ready for the next 24hour cycle while jobless sanghi uncles will come to the streets to protect rapists and shit. Coming out on streets is a one way ticket to jail with NSA/UAPA charges. How do you rate someone who was never a PM and tell we need better. You had examples from Gujrat of the riots and of fake progress still had no problem making Modi as PM. Sticking to what our founding fathers thought as idea of India is a better vision by mile than whatever Vikaas vision BJP has. A nation fundamentally runs on the productivity of its people. A protest is not just for a show but to blockade the functioning of a bad government. How many of the working class can government afford to jail, we already have a brain drain. Even if you are working and not paying tax, your employer is providing a value to the government and so lower paid employees protesting is still reducing the productivity for the government. Yes we have a 1.4billion population and there would be picketing but not without a drop in productivity. It is a fcked up situation. 18-25 are glued to making comments on social media while 25+ are bogged down by 9-10work hours and family responsibilities. Compare the protests of the 19th and 20th century globally especially India, most were 18-25yo youths, a stark contrast from today. There was once a saying saying in India till the 90s that onion prices can take down the government. It is no longer true. School Education has become like handing prizes to everybody, most gets 80% or 90% easily while curriculum has been getting trimmed for decades now. People get incredibly pampered in India this way feeling sab changa si. They want to be dependent on parents or religion to instruct them what to do. I would not even call people up till 25 to be adults, matured enough to vote or do adult things, same way 16 threshold got increased to 18 once upon a time. Can you elaborate what you mean by \"pushed the country into an abyss\"? Please add specific examples too. There will be more planned riots More people like Monu Manesar will instigate riots Even 2019 was risky they pulled a Pulwama and won INDIA could win easily if they manage to get Mayavati, KCR and Jagan on board. They can still win without these but it’ll be tough Why not Sachin Pilot , why not Supriya Srinet or Shashi Tharoor for PM They all are more experienced and qualified then him Why only Rahul Asking CPI to adapt is basically asking them to die in Bengal, it's not as black and white as you think. I know. I am sure there are issues even in Kerala with INC Vs CPM. But, if either of them wins, it is good enough for the support of a non-BJP Govt. We can't sit on our hands and hope INDIA Alliance delivers. We need to get out, organized, protest, call out, shame, and convince people to not vote for the absolute worst option destroying this country. >Asking CPI to adapt is basically asking them to die in Bengal, Nope. They can still fight against tmc at state and local levels, just not at national level till the menace of bjp is finished. Chahe ho jaye vote toh Modi ji ko hi denge Enough states are under the rule of Congress for the last 9 years and they have done nothing impressive there. Just because BJP has been horrible, it does not mean that Congress becomes automatically great. Congress is way better especially at the center. How old are you? Manmohan singh ran a competent govt before BJP and Kejriwal just spread propoganda. If ministers were corrupt, they got convicted. They still haven't played all their cards. Who knows what nightmare will haunt us in this one year 😔 You mean Murders and Executions? /s I don't get the obsession with founding fathers whether its here or anywhere else in the world , they lived in a completely different era, their realities were completely different than ours . While the social integration thoughts of our founding fathers was better than the BJP their economic policies were terrible and they tried to be extra smart with their foreign policy, I am not saying the BJP is better in these regards but just pointing out that they weren't as great as our history textbooks would like us to believe, everyone has flaws and Indias founding fathers had some major ones BJD and YSCRP Just because opposition doesn’t have pm candidate doesn’t mean modi should win. Imagine hitler asking if not hitler than who . Country is run by institutions which modi destroyed and made in to just 2. Everything is controlled by modisha. If someone from opposition comes then power will be shared with institutions and Supreme Court and states and not just the two Yes, INDIA has a realistic chance if they keep doing the right thing till the very end without fighting. Also the more confidence they can project, parties that have chosen to be neutral may swing in their favour. Rahul Gandhi obviously, shouldn't and isn't the PM face and as of now they are fighting for some cause without projecting any PM candidate but that will be a major issue. What worries me more is the BJP thinking that they can lose. If they do, they have run out of all cards except to fall back to total Hindutva ergo show of strength by Hindutva outfits which will predictably be followed by violence followed by the BJP winning. It's a tried and tested model for them and it's already happening. Look how they completely changed the states of affairs in Maharashtra (Nashik, Kolhapur, Amravati). Maharashtra was not prone to such communal incidents and suddenly we have a spate of them. Look at Haryana and now the planned 'protests' in Delhi. They will try to keep the country as polarized as possible. What economic policy from Nehruvian period has pulled Indian economy’s growth as much as Demonitisation? And, what exactly has changed in economic policy since liberalization started by Manmohan as FM other than more liberalization? What kind of economy is better for India is a debatable topic, an economy similar to an European welfare state or that similar to USA that has major wealth disparities and yet has a great GDP and infrastructure but only available for a few. If course there is a realistic chance, if people of our country find enough courage in their consciousness to take the correct action through their vote. Welllll there was no growth in the first place to pull it down , demonitisation was an absolute disaster class but lets not kid ourselves that this was the only reason for Indias slowdown, bank lending in india fell off a cliff around 2010 , due to the new bankruptcy code implemented in 2016 , many previous NPA's were caught and banks became extra wary of lending. I am not discounting demonitisation but the people majorly affected by it were the people who were not contributing to the GDP greatly in the first place to put it bluntly , most people with resources got their cash converted at a cost and that did slow us down. Before covid the governments economic policy wasn't great but after covid they have been quite good, before covid all the stories were india is slowing down and no consumer demand etc, now most articles are quite bullish on India with the govts commitment towards building hard Infrastructure in the country, if they build what they are saying they will build it shall be excellent for the country.The UPA presided over the country when we had our best growth figures but they didn't reinvest it into infrastructure they instead went for wealth redistribution (modi has alos done it but not to that extent) , this govt has even in the last full budget before election gone for massive Infra spending, this is what the country requires at the moment. The European welfare state got its money because of either natural resources Ex: Netherlands or Norway or a massive Industrial base like Germany. We need to get to a certain Gdp per capita before even dreaming about such an extensive welfare and redistribution state. Right now the country would be better served with providing jobs to people with industrialisation rather than helicopter money. BJP still have some huge opportunities to do a masterstroke. 1) Ram mandir will open soon and the amount of hype and marketing will be surreal. The only thing which can backfire in this is the possibility of Adavi passing away before the opening. Then I think they may get criticism for not inaugurating the temple earlier. 2) All important world cup matches are gonna be held in Narendra Modi stadium and Modi ji definitely will do some stunt there to gain clout. If india wins world cup there is gonna be Modi posters every where along with the indian cricket team. But I hope people see through these shenanigans this time and vote for the best. my hope is bjp doesn't get full majority otherwise be prepared for kneejerk decisions with no accountability, remember demo, lockdowns, farm laws etc. They would keep doing it as they are too arrogant to be held accountable in parliament and media is their puppy. Raga's image has been tarnished by bjp and media for a decade, listen to his interviews on forums the guy is much more knowledgable and articulate than he's given credit for. I just hope people wake up and reject this gov next year. Coal scam, 2G scam, commonwealth scam, railways scam, shall I keep going on or you got the gist? Just fyi not one person accused in the 2G scam was found guilty. Every single accused person was acquitted. The court ruled that the case was baseless. And if people still think that there was weight to that case, like you've just demonstrated, it means that BJPs propaganda machinery has done its job. No, I didnt. Many of them were not scams. Some of them were and courts sentenced people. You have to read about individual cases and how they ended. BJP and kejru just fooled people by repeating scam names. Indians were really get I to details and keep parroting. >You cant blame congress for corruption alone. Okay then why should anyone choose Congress over BJP, if corruption is everyone's faults then so does everything else as well. Don't choose. I am not here for stupid arguments. Vote BJP and enjoy the lynching show. You are doing false equivalence, and either disingenuous or plain stupid. Did you read what happened to those scams? Modi will win. Indians don't deserve freedom as it requires sacrifice that was never paid. It was given by British for free and squandered very easily. There will be subjugation for centuries like there always was. Sometimes by mughals, sometimes based on caste, women lynchings. I mean in which country on earth sati like practice existed in 20th century or 19th or 18th. Discrimination within same race based on caste. May be start by looking at your past to understand who we really were. Their 2nd masterstroke completely backfired 🤭"
}