{
    "id": "jque96",
    "title": "Focusing the draft Online Dispute Resolution (ODR) Policy towards the delivery of justice",
    "url": "https://www.reddit.com/r/india/comments/jque96/focusing_the_draft_online_dispute_resolution_odr/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/k3kx6jz7k6y51.png?width=1280&amp;format=png&amp;auto=webp&amp;s=3bdbe43b263d9df81d4b951e859dfa55c675d055\n\n### Tl;dr\n\nIFF has submitted comments pursuant to the Niti Aayog’s draft report [**Designing the Future of Dispute Resolution: The ODR Policy Plan for India**](https://ourgovdotin.files.wordpress.com/2020/10/draft-odr-report-niti-aayog-committee.pdf). In our comments, we highlighted three issues that we felt the draft ODR policy must address, namely: firstly, that any new system must ensure that it does not exclude litigants and provides access to judicial remedies for everyone; secondly, that certain outstanding concerns related to data protection must be adressed, and thirdly, that rather than allowing self-regulation the government must step in and provide regulatory oversight.\n\n### Draft ODR Policy\n\nThe NITI Aayog recently released it's draft report on the proposed ODR Policy. ODR refers not only to an increased role of information and communication technology in facilitating judicial processes but also to a greater use of technology in the mediation and litigation processes themselves. However, the adoption of such technology should not be looked at through the lens of service delivery, and instead should focus on improving the imparting of justice.\n\nWhile India’s internet penetration is improving, evidence from government reports suggests that the country has a long way to go before attaining universal internet penetration. For example, TRAI’s ‘The Indian Telecom Services Performance Indicators January – March, 2020’ report states that India has 743.19 million internet subscribers, which indicates an internet penetration rate of only 55.12%. Rural-urban disparities prevail as indicated by the rural penetration rate of 32.24%, with 285.97 million rural internet subscribers, which is not even one third of the urban penetration rate of 99.12%, with 457.23 million urban internet subscribers. Additionally, 96.9% of all internet subscribers use mobile devices for accessing the internet, which may not be well suited for ODR mediation. Given that around 27,721 villages in India are still not covered by telecom service providers, it is clear India’s digital infrastructure requires further expansion. In such a situation, the introduction of ODR should make sure that judicial rights of the citizens are not affected by technological exclusion or by forcing mediation between parties with unequal access to resources.\n\nInnovations should always be welcomed, but innovations should also be grounded in the social needs and in the concerns of society. The existing system has faced certain issues for a long time, and so the use ODR should be directed at adressing these problems. An implementation of ODR that does not take into concerns such as data leakage or unequal bargaining powers between two parties would negatively large masses of the indian citizenry. An effort has to be made to ensure that justice is delivered not just in the metropolitan cities of India but also to the large swathes of Bharat.\n\n### Our submissions\n\n* **Inclusion and access:** Many litigants require a day in court to adequately establish their claim, and technology which can help improve the established processes is sorely needed. However, the level of teleconnectivity, access to high speed internet access, and digital literacy are still aspirational for large segments of the population. To mitigate any impacts on large sections of indian society we recommend that a process of purely optional, voluntary, and step-by-step measures may be adopted to prevent exclusion. This is vital since without internet access many people will lack the means to properly defendntheir claims, which will have adverse legal impacts.\n* **Specialised privacy protections by a DPA:** We do support the implementation of ODR, especially when it is used to tackle currently existing problems such as delays and a lack of transparency in processes. Further, we recognise and support court data to be largely open data sets meant primarily for legal research.  However, we do have some outstanding issues, which we think can be objectively assessed by a specialised Data Protection Authority proposed by the Draft Personal Data Protection Bill, especially any possible restrictions on the use of court data that may threaten or endanger individuals. We believe that the detailed examination of such privacy protections should be governed by balancing interests of researchers and open data in a specialised manner to prevent court data becoming another spoke in the larger wheel of surveillance capitalism. Hence, we believe that oversight on privacy related concerns may be regulated under the aegis of the Data Protection Authority.\n* **Need for oversight than self-regulation:** We recognise the need to encourage growth in a fledgling sector such as ODR, however, given that justice delivery is a core state function that results in binding and legal judgements, it can have significant impact on individuals. Given that strong private sector incentives towards profit and growth will be predominant they are likely to overtake the actual intent of the initiative of ODR towards providing better delivery of justice and a facilitating the mediation experience for litigants, lawyers, and judges. Hence, it is our strong recommendation, in the absence of any evidence (and we note there is a lack of any evidence cited in the paper) on an adverse impact of a government regulation on private enterprise, that a regulatory body (as the report also contemplates legislative changes), or a process of standards, prescription and governance be implemented through the Ministry of Law and Justice.\n\nWe also asked that civil society organisations be included in future consultation, as they can provide valuable feedback and alternative perspectives on such matters.\n\nWe invite you to offer us your comments [**here**](https://forum.internetfreedom.in/t/thoughts-about-draft-odr-report/1507). Additionally, NITI Aayog has asked for inputs from the public, which may be offered [**here**](https://forum.internetfreedom.in/t/thoughts-about-draft-odr-report/1507).\n\n[**We need your help and support to continue the work we do. Support us through one time donations or becoming a member with us. Donate now!**](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1604912921,
    "convurl": "https://b.thumbs.redditmedia.com/2ws213tkC1PEyNaCTOijeeDL7cqEo5BLSynmzgRAWCQ.jpg",
    "comments": [],
    "cleaned_text": "focusing draft online dispute resolution odr policy towards delivery justice ampxb tldr iff submitted comments pursuant niti aayogs draft report designing future dispute resolution odr policy plan indiahttpsourgovdotinfileswordpresscomdraftodrreportnitiaayogcommitteepdf comments highlighted three issues felt draft odr policy must address namely firstly new system must ensure exclude litigants provides access judicial remedies everyone secondly certain outstanding concerns related data protection must adressed thirdly rather allowing selfregulation government must step provide regulatory oversight draft odr policy niti aayog recently released draft report proposed odr policy odr refers increased role information communication technology facilitating judicial processes also greater use technology mediation litigation processes however adoption technology looked lens service delivery instead focus improving imparting justice indias internet penetration improving evidence government reports suggests country long way go attaining universal internet penetration example trais indian telecom services performance indicators january march report states india million internet subscribers indicates internet penetration rate ruralurban disparities prevail indicated rural penetration rate million rural internet subscribers even one third urban penetration rate million urban internet subscribers additionally internet subscribers use mobile devices accessing internet may well suited odr mediation given around villages india still covered telecom service providers clear indias digital infrastructure requires expansion situation introduction odr make sure judicial rights citizens affected technological exclusion forcing mediation parties unequal access resources innovations always welcomed innovations also grounded social needs concerns society existing system faced certain issues long time use odr directed adressing problems implementation odr take concerns data leakage unequal bargaining powers two parties would negatively large masses indian citizenry effort made ensure justice delivered metropolitan cities india also large swathes bharat submissions inclusion access many litigants require day court adequately establish claim technology help improve established processes sorely needed however level teleconnectivity access high speed internet access digital literacy still aspirational large segments population mitigate impacts large sections indian society recommend process purely optional voluntary stepbystep measures may adopted prevent exclusion vital since without internet access many people lack means properly defendntheir claims adverse legal impacts specialised privacy protections dpa support implementation odr especially used tackle currently existing problems delays lack transparency processes recognise support court data largely open data sets meant primarily legal research however outstanding issues think objectively assessed specialised data protection authority proposed draft personal data protection bill especially possible restrictions use court data may threaten endanger individuals believe detailed examination privacy protections governed balancing interests researchers open data specialised manner prevent court data becoming another spoke larger wheel surveillance capitalism hence believe oversight privacy related concerns may regulated aegis data protection authority need oversight selfregulation recognise need encourage growth fledgling sector odr however given justice delivery core state function results binding legal judgements significant impact individuals given strong private sector incentives towards profit growth predominant likely overtake actual intent initiative odr towards providing better delivery justice facilitating mediation experience litigants lawyers judges hence strong recommendation absence evidence note lack evidence cited paper adverse impact government regulation private enterprise regulatory body report also contemplates legislative changes process standards prescription governance implemented ministry law justice also asked civil society organisations included future consultation provide valuable feedback alternative perspectives matters invite offer us comments herehttpsforuminternetfreedomintthoughtsaboutdraftodrreport additionally niti aayog asked inputs public may offered herehttpsforuminternetfreedomintthoughtsaboutdraftodrreport need help support continue work support us one time donations becoming member us donate nowhttpsinternetfreedomindonate ",
    "cleaned_title": "focusing draft online dispute resolution odr policy towards delivery justice",
    "cleaned_selftext": "ampxb tldr iff submitted comments pursuant niti aayogs draft report designing future dispute resolution odr policy plan indiahttpsourgovdotinfileswordpresscomdraftodrreportnitiaayogcommitteepdf comments highlighted three issues felt draft odr policy must address namely firstly new system must ensure exclude litigants provides access judicial remedies everyone secondly certain outstanding concerns related data protection must adressed thirdly rather allowing selfregulation government must step provide regulatory oversight draft odr policy niti aayog recently released draft report proposed odr policy odr refers increased role information communication technology facilitating judicial processes also greater use technology mediation litigation processes however adoption technology looked lens service delivery instead focus improving imparting justice indias internet penetration improving evidence government reports suggests country long way go attaining universal internet penetration example trais indian telecom services performance indicators january march report states india million internet subscribers indicates internet penetration rate ruralurban disparities prevail indicated rural penetration rate million rural internet subscribers even one third urban penetration rate million urban internet subscribers additionally internet subscribers use mobile devices accessing internet may well suited odr mediation given around villages india still covered telecom service providers clear indias digital infrastructure requires expansion situation introduction odr make sure judicial rights citizens affected technological exclusion forcing mediation parties unequal access resources innovations always welcomed innovations also grounded social needs concerns society existing system faced certain issues long time use odr directed adressing problems implementation odr take concerns data leakage unequal bargaining powers two parties would negatively large masses indian citizenry effort made ensure justice delivered metropolitan cities india also large swathes bharat submissions inclusion access many litigants require day court adequately establish claim technology help improve established processes sorely needed however level teleconnectivity access high speed internet access digital literacy still aspirational large segments population mitigate impacts large sections indian society recommend process purely optional voluntary stepbystep measures may adopted prevent exclusion vital since without internet access many people lack means properly defendntheir claims adverse legal impacts specialised privacy protections dpa support implementation odr especially used tackle currently existing problems delays lack transparency processes recognise support court data largely open data sets meant primarily legal research however outstanding issues think objectively assessed specialised data protection authority proposed draft personal data protection bill especially possible restrictions use court data may threaten endanger individuals believe detailed examination privacy protections governed balancing interests researchers open data specialised manner prevent court data becoming another spoke larger wheel surveillance capitalism hence believe oversight privacy related concerns may regulated aegis data protection authority need oversight selfregulation recognise need encourage growth fledgling sector odr however given justice delivery core state function results binding legal judgements significant impact individuals given strong private sector incentives towards profit growth predominant likely overtake actual intent initiative odr towards providing better delivery justice facilitating mediation experience litigants lawyers judges hence strong recommendation absence evidence note lack evidence cited paper adverse impact government regulation private enterprise regulatory body report also contemplates legislative changes process standards prescription governance implemented ministry law justice also asked civil society organisations included future consultation provide valuable feedback alternative perspectives matters invite offer us comments herehttpsforuminternetfreedomintthoughtsaboutdraftodrreport additionally niti aayog asked inputs public may offered herehttpsforuminternetfreedomintthoughtsaboutdraftodrreport need help support continue work support us one time donations becoming member us donate nowhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Focusing the draft Online Dispute Resolution (ODR) Policy towards the delivery of justice",
    "light_cleaned_selftext": "### Tl;dr IFF has submitted comments pursuant to the Niti Aayog’s draft report [**Designing the Future of Dispute Resolution: The ODR Policy Plan for India**](https://ourgovdotin.files.wordpress.com/2020/10/draft-odr-report-niti-aayog-committee.pdf). In our comments, we highlighted three issues that we felt the draft ODR policy must address, namely: firstly, that any new system must ensure that it does not exclude litigants and provides access to judicial remedies for everyone; secondly, that certain outstanding concerns related to data protection must be adressed, and thirdly, that rather than allowing self-regulation the government must step in and provide regulatory oversight. ### Draft ODR Policy The NITI Aayog recently released it's draft report on the proposed ODR Policy. ODR refers not only to an increased role of information and communication technology in facilitating judicial processes but also to a greater use of technology in the mediation and litigation processes themselves. However, the adoption of such technology should not be looked at through the lens of service delivery, and instead should focus on improving the imparting of justice. While India’s internet penetration is improving, evidence from government reports suggests that the country has a long way to go before attaining universal internet penetration. For example, TRAI’s ‘The Indian Telecom Services Performance Indicators January – March, 2020’ report states that India has 743.19 million internet subscribers, which indicates an internet penetration rate of only 55.12%. Rural-urban disparities prevail as indicated by the rural penetration rate of 32.24%, with 285.97 million rural internet subscribers, which is not even one third of the urban penetration rate of 99.12%, with 457.23 million urban internet subscribers. Additionally, 96.9% of all internet subscribers use mobile devices for accessing the internet, which may not be well suited for ODR mediation. Given that around 27,721 villages in India are still not covered by telecom service providers, it is clear India’s digital infrastructure requires further expansion. In such a situation, the introduction of ODR should make sure that judicial rights of the citizens are not affected by technological exclusion or by forcing mediation between parties with unequal access to resources. Innovations should always be welcomed, but innovations should also be grounded in the social needs and in the concerns of society. The existing system has faced certain issues for a long time, and so the use ODR should be directed at adressing these problems. An implementation of ODR that does not take into concerns such as data leakage or unequal bargaining powers between two parties would negatively large masses of the indian citizenry. An effort has to be made to ensure that justice is delivered not just in the metropolitan cities of India but also to the large swathes of Bharat. ### Our submissions * **Inclusion and access:** Many litigants require a day in court to adequately establish their claim, and technology which can help improve the established processes is sorely needed. However, the level of teleconnectivity, access to high speed internet access, and digital literacy are still aspirational for large segments of the population. To mitigate any impacts on large sections of indian society we recommend that a process of purely optional, voluntary, and step-by-step measures may be adopted to prevent exclusion. This is vital since without internet access many people will lack the means to properly defendntheir claims, which will have adverse legal impacts. * **Specialised privacy protections by a DPA:** We do support the implementation of ODR, especially when it is used to tackle currently existing problems such as delays and a lack of transparency in processes. Further, we recognise and support court data to be largely open data sets meant primarily for legal research. However, we do have some outstanding issues, which we think can be objectively assessed by a specialised Data Protection Authority proposed by the Draft Personal Data Protection Bill, especially any possible restrictions on the use of court data that may threaten or endanger individuals. We believe that the detailed examination of such privacy protections should be governed by balancing interests of researchers and open data in a specialised manner to prevent court data becoming another spoke in the larger wheel of surveillance capitalism. Hence, we believe that oversight on privacy related concerns may be regulated under the aegis of the Data Protection Authority. * **Need for oversight than self-regulation:** We recognise the need to encourage growth in a fledgling sector such as ODR, however, given that justice delivery is a core state function that results in binding and legal judgements, it can have significant impact on individuals. Given that strong private sector incentives towards profit and growth will be predominant they are likely to overtake the actual intent of the initiative of ODR towards providing better delivery of justice and a facilitating the mediation experience for litigants, lawyers, and judges. Hence, it is our strong recommendation, in the absence of any evidence (and we note there is a lack of any evidence cited in the paper) on an adverse impact of a government regulation on private enterprise, that a regulatory body (as the report also contemplates legislative changes), or a process of standards, prescription and governance be implemented through the Ministry of Law and Justice. We also asked that civil society organisations be included in future consultation, as they can provide valuable feedback and alternative perspectives on such matters. We invite you to offer us your comments [**here**](https://forum.internetfreedom.in/t/thoughts-about-draft-odr-report/1507). Additionally, NITI Aayog has asked for inputs from the public, which may be offered [**here**](https://forum.internetfreedom.in/t/thoughts-about-draft-odr-report/1507). [**We need your help and support to continue the work we do. Support us through one time donations or becoming a member with us. Donate now!**](https://internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}