{
    "id": "17r8tbg",
    "title": "How is India's Economic Growth in the past 10 years? An analysis taking care of general objections.",
    "url": "https://www.reddit.com/r/india/comments/17r8tbg/how_is_indias_economic_growth_in_the_past_10/",
    "selftext": "When we talk about economic growth comparisons, generally people have two objections.\n\n1. Global growth was like this, so you cannot compare.\n2. This is just one year, so you cannot compare.\n\n&#x200B;\n\nTo counter those objections, I am using a simple metric which does two things. First smoothen growth to 5 year rolling CAGR. Basically, if we were growing at constant growth for 5 years, what that constant number will be.\n\n&#x200B;\n\nSecond, take difference of 5 year rolling CAGR of India with 5 year rolling CAGR of the world, that way any global influence is taken care of.\n\n&#x200B;\n\nResult is the following\n\n[India has been slowing down compared to the world](https://preview.redd.it/ha9l9axedazb1.png?width=771&format=png&auto=webp&s=c95fe121ecfa62119f2d07a8b8808e9e05b5391f)",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 15,
    "created_utc": 1699520050.0,
    "convurl": "https://b.thumbs.redditmedia.com/HR1LjhvR5Drn5aJIuPA-sRBJlfRgX7HnC3pDYSW5xbY.jpg",
    "comments": [
        "Is this a surprise? Not at all. If you can remember 2014, it was all about growth story, now what are we hearing... what happened to growth story from 2014? Coz the economy is squandered, nobody wants to talk about it from the ruling party. They happily say India will be developed by 2047.",
        "You do realise your graph stops at around 2020 right? At the absolute low point of covid?",
        "In 2014, the world was not ready for COVID 19. In 2014, the world was not ready for the Ukraine Russia war. In 2014, the world was not ready for open war between Israel and Hamas. In 2014, the world was not ready for anti-china movement.",
        "That is why this performance is relative to the world",
        "That was my first reaction too.\n\nBut, the graph denotes the difference between India and the World. COVID-19 was a global phenomenon, affecting the global economy.",
        "Most major economies printed trillions during covid to keep their economies going. We did not.\n\nThey are now paying the price with rampant inflation and potential recession. Except US, all other western nations are either in or entering recession soon. \n\nThey tried to smooth the covid crash with $$$ printing, now it’s coming back to bite them.",
        "I understand that and that we can not conclude anything without data from a few more years. Just pointing out that the graph isn't biased by COVID-19.",
        "2022 actually. But, it looks at difference. See, I have been told to give this government time. All right, I will return after five more years with a lower graph for more reasons to wait more.",
        "Just give them 60 more years. Ten years prove nothing",
        "Drop started in 2016. I think something big happened in 2016.",
        "Something something Nov 8th at 8 PM ....",
        "This stops at 2021",
        "See 2022 and 2023 data"
    ],
    "cleaned_text": "indias economic growth past years analysis taking care general objections talk economic growth comparisons generally people two objections global growth like compare one year compare xb counter objections using simple metric two things first smoothen growth year rolling cagr basically growing constant growth years constant number xb second take difference year rolling cagr india year rolling cagr world way global influence taken care xb result following india slowing compared worldhttpspreviewreddithalaxedazbpngwidthformatpngautowebpscfeecfafdabeebf ",
    "cleaned_title": "indias economic growth past years analysis taking care general objections",
    "cleaned_selftext": "talk economic growth comparisons generally people two objections global growth like compare one year compare xb counter objections using simple metric two things first smoothen growth year rolling cagr basically growing constant growth years constant number xb second take difference year rolling cagr india year rolling cagr world way global influence taken care xb result following india slowing compared worldhttpspreviewreddithalaxedazbpngwidthformatpngautowebpscfeecfafdabeebf",
    "cleaned_comments": "surprise remember growth story hearing happened growth story coz economy squandered nobody wants talk ruling party happily say india developed realise graph stops around right absolute low point covid world ready covid world ready ukraine russia war world ready open war israel hamas world ready antichina movement performance relative world first reaction graph denotes difference india world covid global phenomenon affecting global economy major economies printed trillions covid keep economies going paying price rampant inflation potential recession except us western nations either entering recession soon tried smooth covid crash printing coming back bite understand conclude anything without data years pointing graph isnt biased covid actually looks difference see told give government time right return five years lower graph reasons wait give years ten years prove nothing drop started think something big happened something something nov th pm stops see data",
    "light_cleaned_title": "How is India's Economic Growth in the past 10 years? An analysis taking care of general objections.",
    "light_cleaned_selftext": "When we talk about economic growth comparisons, generally people have two objections. 1. Global growth was like this, so you cannot compare. 2. This is just one year, so you cannot compare. &#x200B; To counter those objections, I am using a simple metric which does two things. First smoothen growth to 5 year rolling CAGR. Basically, if we were growing at constant growth for 5 years, what that constant number will be. &#x200B; Second, take difference of 5 year rolling CAGR of India with 5 year rolling CAGR of the world, that way any global influence is taken care of. &#x200B; Result is the following [India has been slowing down compared to the world](https://preview.redd.it/ha9l9axedazb1.png?width=771&format=png&auto=webp&s=c95fe121ecfa62119f2d07a8b8808e9e05b5391f)",
    "light_cleaned_comments": "Is this a surprise? Not at all. If you can remember 2014, it was all about growth story, now what are we hearing... what happened to growth story from 2014? Coz the economy is squandered, nobody wants to talk about it from the ruling party. They happily say India will be developed by 2047. You do realise your graph stops at around 2020 right? At the absolute low point of covid? In 2014, the world was not ready for COVID 19. In 2014, the world was not ready for the Ukraine Russia war. In 2014, the world was not ready for open war between Israel and Hamas. In 2014, the world was not ready for anti-china movement. That is why this performance is relative to the world That was my first reaction too. But, the graph denotes the difference between India and the World. COVID-19 was a global phenomenon, affecting the global economy. Most major economies printed trillions during covid to keep their economies going. We did not. They are now paying the price with rampant inflation and potential recession. Except US, all other western nations are either in or entering recession soon. They tried to smooth the covid crash with $$$ printing, now it’s coming back to bite them. I understand that and that we can not conclude anything without data from a few more years. Just pointing out that the graph isn't biased by COVID-19. 2022 actually. But, it looks at difference. See, I have been told to give this government time. All right, I will return after five more years with a lower graph for more reasons to wait more. Just give them 60 more years. Ten years prove nothing Drop started in 2016. I think something big happened in 2016. Something something Nov 8th at 8 PM .... This stops at 2021 See 2022 and 2023 data"
}