{
    "id": "lr3s1a",
    "title": "MHA's new programme allows volunteers to report \"anti-national\" online content for removal",
    "url": "https://www.reddit.com/r/india/comments/lr3s1a/mhas_new_programme_allows_volunteers_to_report/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/9lze8j89tcj61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=dba01e4ceaf77e36bf400557b98b3c82c8a9de68\n\n## tl;dr\n\nThe Indian Cyber Crime Coordination Centre (I4C) under the Ministry of Home Affairs (MHA) has launched a new programme which will allow citizens to register themselves as \"unlawful content flaggers\" to report online content for removal. Mindful of the chilling effect this could have on free speech on the internet, we wrote to the MHA highlighting our concerns related to the programme.\n\n## The Cyber Crime Volunteers Program\n\nThe Indian Cyber Crime Coordination Centre (I4C) has recently launched the [**Cyber Crime Volunteers Program**](https://cybercrime.gov.in/Webform/cyber_volunteers_concept.aspx). The aim of the program, as stated on the official website of the National Cyber Crime Reporting Portal under the specific section for this programme,  is to allow citizens to register themselves as “Cyber Crime Volunteers'' in the role of  “Unlawful Content Flaggers”. As per the website, the programme will help law enforcement agencies in identifying, reporting and removal of illegal / unlawful online content. The programme, which will be launched all over the country, is going to have its test run in [**Jammu &amp; Kashmir**](https://thewire.in/government/jammu-and-kashmir-police-cyber-volunteers) and [**Tripura**](https://tripurapolice.gov.in/files/uploaded-file/001bbb.pdf).\n\n## Why is this programme problematic?\n\n1. **Concerns related to privacy and mass surveillance**\n\n* **The programme could lead to increase in lateral surveillance and cyber vigilantism**: Lateral surveillance refers to the phenomenon of peer-to-peer surveillance practices wherein instead of a State surveilling its subjects citizens are incentivised to surveil each other as a means of “watching over” one another as stated in their 2021 paper titled [**\"Widening the Horizons of Surveillance\"**](http://https//cis-india.org/horizonsofsurveillance) by Mira Swaminathan &amp; Shubhika Saluja . Such practices will lead to a culture of surveillance and constant suspicion in society creating potential social distrust. This will give rise to the need to balance security with privacy and could result in situations of cyber vigilantism.\n* **Lack of necessity for the programme**: The offences included into the scope of this programme under the website of National Cyber Crime Reporting Portal are already cognizable and can be reported to the police by any person. Therefore, there is ongoing confusion as to the necessity of this programme as well as the need to create a special class of volunteers.\n* **No prior verification required for becoming a “Cyber Volunteer Unlawful Content Flagger”**: Under the programme, I4C and the MHA have allowed a person to [**register**](http://https//cybercrime.gov.in/Webform/CyberVolunteerinstruction.aspx) as a “Cyber Volunteer Unlawful Content Flagger” without fulfilling the requirement of any prior verification (KYC). Since no verification is required and the nature of the position itself is voluntary, it absolves the I4C as well as the MHA of any liability or guilt in cases of misuse. In [***Nandini Sundar &amp; Ors vs State Of Chattisgarh***](http://https//indiankanoon.org/doc/920448/) (2011) 7 SCC 547, the Hon’ble Supreme Court held that it is the duty of the State to undertake all those necessary socially, economically and politically remedial policies that lessen social disaffection and develop well trained, and professional law enforcement capacities and forces that function within the limits of constitutional action. Creation of this volunteer programme goes starkly against both these duties since it will allow social disaffection to be weaponized by amateurs who have little to no understanding of constitutionally protected speech.\n\n1. **Concerns related to online free speech**\n\n* **Lack of underlying legal framework**: The programme has been launched by the I4C without having any underlying legal framework or Standard Operating Procedure (SOP) in place which would regulate the functioning of this programme and define its parameters. The [**terms and conditions**](http://https//cybercrime.gov.in/Webform/cyber_volunteers_TnC.aspx) which have been laid out on the official website of the National Cyber Crime Reporting Portal for this programme do not refer to any underlying legal framework as well. In the absence of such a framework, the possibility of misuse and arbitrariness increases as there are no clear guidelines to be followed in its implementation.\n* **Lack of clarity with regard to the definition of “anti-national activities”**: The website of National Cyber Crime Reporting Portal provides little insight into what is included into [**unlawful content**](http://https//cybercrime.gov.in/Webform/about_unlawful_content.aspx) (content that is against sovereignty and integrity of India, against defence of India, against security of the State, against friendly relations with foreign States, content aimed at disturbing public order, disturbing communal harmony falls into broad categories whose judicial interpretation lies in a grey area thus giving excessive discretion to a volunteer to determine which content is unlawful). Further, the [**Tripura**](http://tripurapolice.gov.in/files/uploaded-file/001bbb.pdf) and the Jammu &amp; Kashmir press circulars for the MHA’s volunteer programme go one step further and ask volunteers to report content pertaining to, inter alia, “radicalisation” and “anti-national activities” without actually defining which content constitutes the two categories. This could lead to overzealous and overbroad restrictions being put onto the freedom of speech online and could further result in a chilling effect on online speech wherein citizens would self-regulate themselves before posting any content online for fear of being maliciously prosecuted through this programme. Such a programme would thus be in direct violation of the decision of the Hon’ble Supreme Court in [***Shreya Singhal v Union of India***](http://https//indiankanoon.org/doc/110813550/) (2013) 12 SCC 73 which highlights the need to ensure that overbroad restrictions on online speech are not used as a tool by the State to criminalise free speech on the internet.\n* **Doubts over authenticity of reports received**: Since there is no legal backing or SOP in place, another doubt which arises is how will the authenticity of these reports be ensured. There is currently no information that has been made available on the official website which outlines how the I4C and the MHA will ensure that this programme is not misused by certain elements to extract misguided personal/political vendettas. It should also be noted that there is no process in place for withdrawal of complaints once submitted. Currently, according to a report titled, “[**MHA tells States to register more FIRs for cybercrime**](http://https//www.thehindu.com/news/national/mha-tells-states-to-register-more-firs-for-cyber-crime/article32997209.ece#:~:text=Photo%20Credit%3A%20Reuters-,Ministry%20wants%20volunteers%20to%20report%20'unlawful%20content',.cybercrime.gov.in.)” published in the Hindu on November 1, 2020, the conversion rate of complaints registered on the portal into First Information Reports (FIR) is only 2.5%.\n\n## India is not 1950's East Germany\n\nThe [**Stasi**](https://www.bstu.de/en/the-stasi/introduction/) was the Ministry for State Security for the Socialist Unity Party of Germany (SED), which governed the German Democratic Republic for 40 years from 1950 to 1980, without ever being legitimised in a democratic election. To quash all forms of dissent, the Stasi relied on a network of around 2 lakh informants who spied on friends, colleagues and relatives. [**\"The perception that the Stasi was all-knowing also led to self-censorship.\"**](https://www.theatlantic.com/international/archive/2019/11/lingering-trauma-east-german-police-state/601669/)  \"[**Laid out upright and end to end the files the Stasi kept on their countrymen would form a line 180km long**](https://www.independent.co.uk/arts-entertainment/books/features/anna-funder-inside-the-real-room-101-732525.html)\" as per the book \"[**Stasiland**](https://www.goodreads.com/book/show/226369.Stasiland)\" by Anna Funder.\n\nThis programme by the MHA, which purportedly aims to bring together \"Good Samaritans\" with \"[**passion to serve the nation on a single platform and contribute in fight against cybercrime in the country**](https://cybercrime.gov.in/Webform/cyber_volunteers_concept.aspx)\", will essentially result in a similar situation to the one which East Germany was in the 1950s. Asking citizens to report their fellow citizens would lead cyber-vigilantism, as stated above, and would lead to peers turning against their peers to snitch on them. Since, the MHA has failed to clearly define unlawful content and content which would relate to \"anti-national\" activities, this could allow the volunteers to exercise far more discretion than is necessary and report on citizens who are well within their rights to post content which is critical of the State. This kind of \"lateral surveillance\" could lead lead to a culture of surveillance and constant suspicion in society creating potential social distrust as per the 2021 paper titled [**\"Widening the Horizons of Surveillance\"**](http://https//cis-india.org/horizonsofsurveillance) by Mira Swaminathan &amp; Shubhika Saluja. While we appreciate the MHA's intention behind trying to reduce harmful content online, this programme will lead to ultimately result in more harms and thus is not the solution for this issue.\n\n## Our recommendation\n\nIn our representation, we have thus recommended to the MHA that this programme be halted immediately.\n\n## Important documents\n\n1. Representation to MHA on Cyber Crime Volunteers Programme dated February 23, 2021 ([**link**](https://drive.google.com/file/d/1ptH8jplyEBtr6jcQxyXv1sRUxSPuA9xr/view?usp=sharing))",
    "flair": "Policy/Economy",
    "score": 95,
    "num_comments": 10,
    "created_utc": 1614141310,
    "convurl": "https://a.thumbs.redditmedia.com/UUxdTXzfHe5zJMXBoKThxh4X0moCE7oZQQorly7X5z0.jpg",
    "comments": [
        "It's unlawful to be anti-national by being critical?\n\n\nOh my God, that means nothing is ever going to improve because everyone has got to say it's all perfect.\n\n\nIsn't that what happens in dictatorships...",
        "Whole world is moving forward and India, we are going backward.",
        "Our own Stasi",
        "Step 1: Register as a volunteer\nStep 2: Report all BJP's accounts",
        "Swastik intensifies",
        "Matlab IT Cell ab mainstream ho raha hai.",
        " Acche din!",
        "Pados ka aunty , now available online."
    ],
    "cleaned_text": "mhas new programme allows volunteers report antinational online content removal ampxb tldr indian cyber crime coordination centre ic ministry home affairs mha launched new programme allow citizens register unlawful content flaggers report online content removal mindful chilling effect could free speech internet wrote mha highlighting concerns related programme cyber crime volunteers program indian cyber crime coordination centre ic recently launched cyber crime volunteers programhttpscybercrimegovinwebformcybervolunteersconceptaspx aim program stated official website national cyber crime reporting portal specific section programme allow citizens register cyber crime volunteers role unlawful content flaggers per website programme help law enforcement agencies identifying reporting removal illegal unlawful online content programme launched country going test run jammu amp kashmirhttpsthewireingovernmentjammuandkashmirpolicecybervolunteers tripurahttpstripurapolicegovinfilesuploadedfilebbbpdf programme problematic concerns related privacy mass surveillance programme could lead increase lateral surveillance cyber vigilantism lateral surveillance refers phenomenon peertopeer surveillance practices wherein instead state surveilling subjects citizens incentivised surveil means watching one another stated paper titled widening horizons surveillancehttphttpscisindiaorghorizonsofsurveillance mira swaminathan amp shubhika saluja practices lead culture surveillance constant suspicion society creating potential social distrust give rise need balance security privacy could result situations cyber vigilantism lack necessity programme offences included scope programme website national cyber crime reporting portal already cognizable reported police person therefore ongoing confusion necessity programme well need create special class volunteers prior verification required becoming cyber volunteer unlawful content flagger programme ic mha allowed person registerhttphttpscybercrimegovinwebformcybervolunteerinstructionaspx cyber volunteer unlawful content flagger without fulfilling requirement prior verification kyc since verification required nature position voluntary absolves ic well mha liability guilt cases misuse nandini sundar amp ors vs state chattisgarhhttphttpsindiankanoonorgdoc scc honble supreme court held duty state undertake necessary socially economically politically remedial policies lessen social disaffection develop well trained professional law enforcement capacities forces function within limits constitutional action creation volunteer programme goes starkly duties since allow social disaffection weaponized amateurs little understanding constitutionally protected speech concerns related online free speech lack underlying legal framework programme launched ic without underlying legal framework standard operating procedure sop place would regulate functioning programme define parameters terms conditionshttphttpscybercrimegovinwebformcybervolunteerstncaspx laid official website national cyber crime reporting portal programme refer underlying legal framework well absence framework possibility misuse arbitrariness increases clear guidelines followed implementation lack clarity regard definition antinational activities website national cyber crime reporting portal provides little insight included unlawful contenthttphttpscybercrimegovinwebformaboutunlawfulcontentaspx content sovereignty integrity india defence india security state friendly relations foreign states content aimed disturbing public order disturbing communal harmony falls broad categories whose judicial interpretation lies grey area thus giving excessive discretion volunteer determine content unlawful tripurahttptripurapolicegovinfilesuploadedfilebbbpdf jammu amp kashmir press circulars mhas volunteer programme go one step ask volunteers report content pertaining inter alia radicalisation antinational activities without actually defining content constitutes two categories could lead overzealous overbroad restrictions put onto freedom speech online could result chilling effect online speech wherein citizens would selfregulate posting content online fear maliciously prosecuted programme programme would thus direct violation decision honble supreme court shreya singhal v union indiahttphttpsindiankanoonorgdoc scc highlights need ensure overbroad restrictions online speech used tool state criminalise free speech internet doubts authenticity reports received since legal backing sop place another doubt arises authenticity reports ensured currently information made available official website outlines ic mha ensure programme misused certain elements extract misguided personalpolitical vendettas also noted process place withdrawal complaints submitted currently according report titled mha tells states register firs cybercrimehttphttpswwwthehinducomnewsnationalmhatellsstatestoregistermorefirsforcybercrimearticleecetextphotocreditareutersministrywantsvolunteerstoreportunlawfulcontentcybercrimegovin published hindu november conversion rate complaints registered portal first information reports fir india east germany stasihttpswwwbstudeenthestasiintroduction ministry state security socialist unity party germany sed governed german democratic republic years without ever legitimised democratic election quash forms dissent stasi relied network around lakh informants spied friends colleagues relatives perception stasi allknowing also led selfcensorshiphttpswwwtheatlanticcominternationalarchivelingeringtraumaeastgermanpolicestate laid upright end end files stasi kept countrymen would form line km longhttpswwwindependentcoukartsentertainmentbooksfeaturesannafunderinsidetherealroomhtml per book stasilandhttpswwwgoodreadscombookshowstasiland anna funder programme mha purportedly aims bring together good samaritans passion serve nation single platform contribute fight cybercrime countryhttpscybercrimegovinwebformcybervolunteersconceptaspx essentially result similar situation one east germany asking citizens report fellow citizens would lead cybervigilantism stated would lead peers turning peers snitch since mha failed clearly define unlawful content content would relate antinational activities could allow volunteers exercise far discretion necessary report citizens well within rights post content critical state kind lateral surveillance could lead lead culture surveillance constant suspicion society creating potential social distrust per paper titled widening horizons surveillancehttphttpscisindiaorghorizonsofsurveillance mira swaminathan amp shubhika saluja appreciate mhas intention behind trying reduce harmful content online programme lead ultimately result harms thus solution issue recommendation representation thus recommended mha programme halted immediately important documents representation mha cyber crime volunteers programme dated february linkhttpsdrivegooglecomfiledpthjplyebtrjcqxyxvsruxspuaxrviewuspsharing ",
    "cleaned_title": "mhas new programme allows volunteers report antinational online content removal",
    "cleaned_selftext": "ampxb tldr indian cyber crime coordination centre ic ministry home affairs mha launched new programme allow citizens register unlawful content flaggers report online content removal mindful chilling effect could free speech internet wrote mha highlighting concerns related programme cyber crime volunteers program indian cyber crime coordination centre ic recently launched cyber crime volunteers programhttpscybercrimegovinwebformcybervolunteersconceptaspx aim program stated official website national cyber crime reporting portal specific section programme allow citizens register cyber crime volunteers role unlawful content flaggers per website programme help law enforcement agencies identifying reporting removal illegal unlawful online content programme launched country going test run jammu amp kashmirhttpsthewireingovernmentjammuandkashmirpolicecybervolunteers tripurahttpstripurapolicegovinfilesuploadedfilebbbpdf programme problematic concerns related privacy mass surveillance programme could lead increase lateral surveillance cyber vigilantism lateral surveillance refers phenomenon peertopeer surveillance practices wherein instead state surveilling subjects citizens incentivised surveil means watching one another stated paper titled widening horizons surveillancehttphttpscisindiaorghorizonsofsurveillance mira swaminathan amp shubhika saluja practices lead culture surveillance constant suspicion society creating potential social distrust give rise need balance security privacy could result situations cyber vigilantism lack necessity programme offences included scope programme website national cyber crime reporting portal already cognizable reported police person therefore ongoing confusion necessity programme well need create special class volunteers prior verification required becoming cyber volunteer unlawful content flagger programme ic mha allowed person registerhttphttpscybercrimegovinwebformcybervolunteerinstructionaspx cyber volunteer unlawful content flagger without fulfilling requirement prior verification kyc since verification required nature position voluntary absolves ic well mha liability guilt cases misuse nandini sundar amp ors vs state chattisgarhhttphttpsindiankanoonorgdoc scc honble supreme court held duty state undertake necessary socially economically politically remedial policies lessen social disaffection develop well trained professional law enforcement capacities forces function within limits constitutional action creation volunteer programme goes starkly duties since allow social disaffection weaponized amateurs little understanding constitutionally protected speech concerns related online free speech lack underlying legal framework programme launched ic without underlying legal framework standard operating procedure sop place would regulate functioning programme define parameters terms conditionshttphttpscybercrimegovinwebformcybervolunteerstncaspx laid official website national cyber crime reporting portal programme refer underlying legal framework well absence framework possibility misuse arbitrariness increases clear guidelines followed implementation lack clarity regard definition antinational activities website national cyber crime reporting portal provides little insight included unlawful contenthttphttpscybercrimegovinwebformaboutunlawfulcontentaspx content sovereignty integrity india defence india security state friendly relations foreign states content aimed disturbing public order disturbing communal harmony falls broad categories whose judicial interpretation lies grey area thus giving excessive discretion volunteer determine content unlawful tripurahttptripurapolicegovinfilesuploadedfilebbbpdf jammu amp kashmir press circulars mhas volunteer programme go one step ask volunteers report content pertaining inter alia radicalisation antinational activities without actually defining content constitutes two categories could lead overzealous overbroad restrictions put onto freedom speech online could result chilling effect online speech wherein citizens would selfregulate posting content online fear maliciously prosecuted programme programme would thus direct violation decision honble supreme court shreya singhal v union indiahttphttpsindiankanoonorgdoc scc highlights need ensure overbroad restrictions online speech used tool state criminalise free speech internet doubts authenticity reports received since legal backing sop place another doubt arises authenticity reports ensured currently information made available official website outlines ic mha ensure programme misused certain elements extract misguided personalpolitical vendettas also noted process place withdrawal complaints submitted currently according report titled mha tells states register firs cybercrimehttphttpswwwthehinducomnewsnationalmhatellsstatestoregistermorefirsforcybercrimearticleecetextphotocreditareutersministrywantsvolunteerstoreportunlawfulcontentcybercrimegovin published hindu november conversion rate complaints registered portal first information reports fir india east germany stasihttpswwwbstudeenthestasiintroduction ministry state security socialist unity party germany sed governed german democratic republic years without ever legitimised democratic election quash forms dissent stasi relied network around lakh informants spied friends colleagues relatives perception stasi allknowing also led selfcensorshiphttpswwwtheatlanticcominternationalarchivelingeringtraumaeastgermanpolicestate laid upright end end files stasi kept countrymen would form line km longhttpswwwindependentcoukartsentertainmentbooksfeaturesannafunderinsidetherealroomhtml per book stasilandhttpswwwgoodreadscombookshowstasiland anna funder programme mha purportedly aims bring together good samaritans passion serve nation single platform contribute fight cybercrime countryhttpscybercrimegovinwebformcybervolunteersconceptaspx essentially result similar situation one east germany asking citizens report fellow citizens would lead cybervigilantism stated would lead peers turning peers snitch since mha failed clearly define unlawful content content would relate antinational activities could allow volunteers exercise far discretion necessary report citizens well within rights post content critical state kind lateral surveillance could lead lead culture surveillance constant suspicion society creating potential social distrust per paper titled widening horizons surveillancehttphttpscisindiaorghorizonsofsurveillance mira swaminathan amp shubhika saluja appreciate mhas intention behind trying reduce harmful content online programme lead ultimately result harms thus solution issue recommendation representation thus recommended mha programme halted immediately important documents representation mha cyber crime volunteers programme dated february linkhttpsdrivegooglecomfiledpthjplyebtrjcqxyxvsruxspuaxrviewuspsharing",
    "cleaned_comments": "unlawful antinational critical oh god means nothing ever going improve everyone got say perfect isnt happens dictatorships whole world moving forward india going backward stasi step register volunteer step report bjps accounts swastik intensifies matlab cell ab mainstream ho raha hai acche din pados ka aunty available online",
    "light_cleaned_title": "MHA's new programme allows volunteers to report \"anti-national\" online content for removal",
    "light_cleaned_selftext": "## tl;dr The Indian Cyber Crime Coordination Centre (I4C) under the Ministry of Home Affairs (MHA) has launched a new programme which will allow citizens to register themselves as \"unlawful content flaggers\" to report online content for removal. Mindful of the chilling effect this could have on free speech on the internet, we wrote to the MHA highlighting our concerns related to the programme. ## The Cyber Crime Volunteers Program The Indian Cyber Crime Coordination Centre (I4C) has recently launched the [**Cyber Crime Volunteers Program**](https://cybercrime.gov.in/Webform/cyber_volunteers_concept.aspx). The aim of the program, as stated on the official website of the National Cyber Crime Reporting Portal under the specific section for this programme, is to allow citizens to register themselves as “Cyber Crime Volunteers'' in the role of “Unlawful Content Flaggers”. As per the website, the programme will help law enforcement agencies in identifying, reporting and removal of illegal / unlawful online content. The programme, which will be launched all over the country, is going to have its test run in [**Jammu &amp; Kashmir**](https://thewire.in/government/jammu-and-kashmir-police-cyber-volunteers) and [**Tripura**](https://tripurapolice.gov.in/files/uploaded-file/001bbb.pdf). ## Why is this programme problematic? 1. **Concerns related to privacy and mass surveillance** * **The programme could lead to increase in lateral surveillance and cyber vigilantism**: Lateral surveillance refers to the phenomenon of peer-to-peer surveillance practices wherein instead of a State surveilling its subjects citizens are incentivised to surveil each other as a means of “watching over” one another as stated in their 2021 paper titled [**\"Widening the Horizons of Surveillance\"**](http://https//cis-india.org/horizonsofsurveillance) by Mira Swaminathan &amp; Shubhika Saluja . Such practices will lead to a culture of surveillance and constant suspicion in society creating potential social distrust. This will give rise to the need to balance security with privacy and could result in situations of cyber vigilantism. * **Lack of necessity for the programme**: The offences included into the scope of this programme under the website of National Cyber Crime Reporting Portal are already cognizable and can be reported to the police by any person. Therefore, there is ongoing confusion as to the necessity of this programme as well as the need to create a special class of volunteers. * **No prior verification required for becoming a “Cyber Volunteer Unlawful Content Flagger”**: Under the programme, I4C and the MHA have allowed a person to [**register**](http://https//cybercrime.gov.in/Webform/CyberVolunteerinstruction.aspx) as a “Cyber Volunteer Unlawful Content Flagger” without fulfilling the requirement of any prior verification (KYC). Since no verification is required and the nature of the position itself is voluntary, it absolves the I4C as well as the MHA of any liability or guilt in cases of misuse. In [***Nandini Sundar &amp; Ors vs State Of Chattisgarh***](http://https//indiankanoon.org/doc/920448/) (2011) 7 SCC 547, the Hon’ble Supreme Court held that it is the duty of the State to undertake all those necessary socially, economically and politically remedial policies that lessen social disaffection and develop well trained, and professional law enforcement capacities and forces that function within the limits of constitutional action. Creation of this volunteer programme goes starkly against both these duties since it will allow social disaffection to be weaponized by amateurs who have little to no understanding of constitutionally protected speech. 1. **Concerns related to online free speech** * **Lack of underlying legal framework**: The programme has been launched by the I4C without having any underlying legal framework or Standard Operating Procedure (SOP) in place which would regulate the functioning of this programme and define its parameters. The [**terms and conditions**](http://https//cybercrime.gov.in/Webform/cyber_volunteers_TnC.aspx) which have been laid out on the official website of the National Cyber Crime Reporting Portal for this programme do not refer to any underlying legal framework as well. In the absence of such a framework, the possibility of misuse and arbitrariness increases as there are no clear guidelines to be followed in its implementation. * **Lack of clarity with regard to the definition of “anti-national activities”**: The website of National Cyber Crime Reporting Portal provides little insight into what is included into [**unlawful content**](http://https//cybercrime.gov.in/Webform/about_unlawful_content.aspx) (content that is against sovereignty and integrity of India, against defence of India, against security of the State, against friendly relations with foreign States, content aimed at disturbing public order, disturbing communal harmony falls into broad categories whose judicial interpretation lies in a grey area thus giving excessive discretion to a volunteer to determine which content is unlawful). Further, the [**Tripura**](http://tripurapolice.gov.in/files/uploaded-file/001bbb.pdf) and the Jammu &amp; Kashmir press circulars for the MHA’s volunteer programme go one step further and ask volunteers to report content pertaining to, inter alia, “radicalisation” and “anti-national activities” without actually defining which content constitutes the two categories. This could lead to overzealous and overbroad restrictions being put onto the freedom of speech online and could further result in a chilling effect on online speech wherein citizens would self-regulate themselves before posting any content online for fear of being maliciously prosecuted through this programme. Such a programme would thus be in direct violation of the decision of the Hon’ble Supreme Court in [***Shreya Singhal v Union of India***](http://https//indiankanoon.org/doc/110813550/) (2013) 12 SCC 73 which highlights the need to ensure that overbroad restrictions on online speech are not used as a tool by the State to criminalise free speech on the internet. * **Doubts over authenticity of reports received**: Since there is no legal backing or SOP in place, another doubt which arises is how will the authenticity of these reports be ensured. There is currently no information that has been made available on the official website which outlines how the I4C and the MHA will ensure that this programme is not misused by certain elements to extract misguided personal/political vendettas. It should also be noted that there is no process in place for withdrawal of complaints once submitted. Currently, according to a report titled, “[**MHA tells States to register more FIRs for cybercrime**](http://https//www.thehindu.com/news/national/mha-tells-states-to-register-more-firs-for-cyber-crime/article32997209.ece#:~:text=Photo%20Credit%3A%20Reuters-,Ministry%20wants%20volunteers%20to%20report%20'unlawful%20content',.cybercrime.gov.in.)” published in the Hindu on November 1, 2020, the conversion rate of complaints registered on the portal into First Information Reports (FIR) is only 2.5%. ## India is not 1950's East Germany The [**Stasi**](https://www.bstu.de/en/the-stasi/introduction/) was the Ministry for State Security for the Socialist Unity Party of Germany (SED), which governed the German Democratic Republic for 40 years from 1950 to 1980, without ever being legitimised in a democratic election. To quash all forms of dissent, the Stasi relied on a network of around 2 lakh informants who spied on friends, colleagues and relatives. [**\"The perception that the Stasi was all-knowing also led to self-censorship.\"**](https://www.theatlantic.com/international/archive/2019/11/lingering-trauma-east-german-police-state/601669/) \"[**Laid out upright and end to end the files the Stasi kept on their countrymen would form a line 180km long**](https://www.independent.co.uk/arts-entertainment/books/features/anna-funder-inside-the-real-room-101-732525.html)\" as per the book \"[**Stasiland**](https://www.goodreads.com/book/show/226369.Stasiland)\" by Anna Funder. This programme by the MHA, which purportedly aims to bring together \"Good Samaritans\" with \"[**passion to serve the nation on a single platform and contribute in fight against cybercrime in the country**](https://cybercrime.gov.in/Webform/cyber_volunteers_concept.aspx)\", will essentially result in a similar situation to the one which East Germany was in the 1950s. Asking citizens to report their fellow citizens would lead cyber-vigilantism, as stated above, and would lead to peers turning against their peers to snitch on them. Since, the MHA has failed to clearly define unlawful content and content which would relate to \"anti-national\" activities, this could allow the volunteers to exercise far more discretion than is necessary and report on citizens who are well within their rights to post content which is critical of the State. This kind of \"lateral surveillance\" could lead lead to a culture of surveillance and constant suspicion in society creating potential social distrust as per the 2021 paper titled [**\"Widening the Horizons of Surveillance\"**](http://https//cis-india.org/horizonsofsurveillance) by Mira Swaminathan &amp; Shubhika Saluja. While we appreciate the MHA's intention behind trying to reduce harmful content online, this programme will lead to ultimately result in more harms and thus is not the solution for this issue. ## Our recommendation In our representation, we have thus recommended to the MHA that this programme be halted immediately. ## Important documents 1. Representation to MHA on Cyber Crime Volunteers Programme dated February 23, 2021 ([**link**](https://drive.google.com/file/d/1ptH8jplyEBtr6jcQxyXv1sRUxSPuA9xr/view?usp=sharing))",
    "light_cleaned_comments": "It's unlawful to be anti-national by being critical? Oh my God, that means nothing is ever going to improve because everyone has got to say it's all perfect. Isn't that what happens in dictatorships... Whole world is moving forward and India, we are going backward. Our own Stasi Step 1: Register as a volunteer Step 2: Report all BJP's accounts Swastik intensifies Matlab IT Cell ab mainstream ho raha hai. Acche din! Pados ka aunty , now available online."
}