{
    "id": "16k84vu",
    "title": "Urgent help required lost 28 Lakhs",
    "url": "https://www.reddit.com/r/india/comments/16k84vu/urgent_help_required_lost_28_lakhs/",
    "selftext": "I lost 28 Lakhs through scamsters pretended to be Mumbai cyber police IPS officers. I have raised complaint on cybercrime portal is there any other way to recover the lost money? Will I get any money that has lost?\n\nRelated similar case report: https://indianexpress.com/article/cities/pune/drugs-parcel-sent-to-taiwan-ips-officers-name-cheat-techie-rs-25-lakh-third-such-case-3-weeks-8556366/lite/",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694872393.0,
    "convurl": "https://external-preview.redd.it/zYfvQbo6eugjpeM1yLhBPzKTgYgGYOCVPWTfOlPjVSY.jpg?auto=webp&s=5e961e706875f01d94938fa7bf74832c0b51716d",
    "comments": [
        "You could go to actual cyber police. But since you were scammed chances are they blackmailed you for something you did. Whatever it is will be in the open. If you are okay with that, report the crime."
    ],
    "cleaned_text": "urgent help required lost lakhs lost lakhs scamsters pretended mumbai cyber police ips officers raised complaint cybercrime portal way recover lost money get money lost related similar case report ",
    "cleaned_title": "urgent help required lost lakhs",
    "cleaned_selftext": "lost lakhs scamsters pretended mumbai cyber police ips officers raised complaint cybercrime portal way recover lost money get money lost related similar case report",
    "cleaned_comments": "could go actual cyber police since scammed chances blackmailed something whatever open okay report crime",
    "light_cleaned_title": "Urgent help required lost 28 Lakhs",
    "light_cleaned_selftext": "I lost 28 Lakhs through scamsters pretended to be Mumbai cyber police IPS officers. I have raised complaint on cybercrime portal is there any other way to recover the lost money? Will I get any money that has lost? Related similar case report:",
    "light_cleaned_comments": "You could go to actual cyber police. But since you were scammed chances are they blackmailed you for something you did. Whatever it is will be in the open. If you are okay with that, report the crime."
}