{
    "id": "1el2fwv",
    "title": "Propaganda regarding the attacks on Bangladeshi Hindus following the collapse of the government",
    "url": "https://www.reddit.com/gallery/1el2fwv",
    "selftext": "If you’re unaware of the current situation in bangladesh, our prime minister (dictator) Sheikh Hasina has resigned and fled to india following mass protests. Shortly after she stepped down, civil unrest erupted and many Bangladeshi Hindus have had to be victims of attacks. But please keep in mind, these attacks are not being carried out by students or civilians. We fully condemn these attacks as our goal is a peaceful and democratic Bangladesh, which has no place for religious discrimination. The locals are trying to protect the temples and churches.\n\nThese attacks are being carried out by Sheikh Hasina’s goons, also known as Chhatro League (BCL). Why would she do this? Targeting Bangladeshi Hindus will surely hurt the sentiments of Indians. This will present the indian army with an excuse to enter bangladesh in the name of ‘protection’, while intending for an invasion. RAW agents (indian agents) have already been spotted in Dhaka, shooting aimlessly. \n\nWhile it is true that Hindus are being targeted, the indian media is currently being filled with propaganda to secure the support of regular indian civilians for an invasion/interference. Please don’t fall for it! \n\nIn one of the pictures I’ve shared, it shows a tweet that says that Bangladeshi Hindu cricketer Liton Das’s house has been burned as a result of religious targeting. This is what actually happened: that house belongs to cricketer Mashrafe Mortaza, who is actually a Bangladeshi Muslim. His house was burnt as he sided with the fascist government. Has nothing to do with religion. This is one example of many (I’ll try to post the other ones too).",
    "flair": "Crime",
    "score": 1,
    "num_comments": 26,
    "created_utc": 1722900091.0,
    "convurl": "https://i.redd.it/1amq0zyiixgd1.jpg",
    "comments": [
        "You all stay as safe as you can and keep fighting for a free Bangladesh. The whole world is watching.",
        "> These attacks are being carried out by Sheikh Hasina’s goons, also known as Chhatro League (BCL). Why would she do this? Targeting Bangladeshi Hindus will surely hurt the sentiments of Indians. This will present the indian army with an excuse to enter bangladesh in the name of ‘protection’, while intending for an invasion. RAW agents (indian agents) have already been spotted in Dhaka, shooting aimlessly.\n\nCalls others as propaganda and then goes on to level allegations without any references. Dude, we don't need any lessons on how our army works. We are well aware about its capabilities and shortcomings. India is not an imperial state like Russia or China and we would have been long done with it if we did have any imperial designs on Bangladesh.",
        "Bangladesh looks effed. The Pro-BNP Islamic movement against Hasina's government could not topple it for years. It needed a revolt led by university students. And now when it succeed in deposing Hasina, Military takes over with spoonfuls of reinvigorated Islamist rhetoric. Best wishes!",
        "https://m.economictimes.com/news/international/world-news/bangladesh-protest-anti-hindu-attacks-grow-amid-political-turmoil-iskcon-temples-defaced/articleshow/112289047.cms[In an escalation of violence during protests across Bangladesh on Sunday, Hindu houses and temples, including Iskcon and Kali temples, were specifically targeted, resulting in the deaths of nearly 100 people, including Kajal Roy, a Hindu councillor](https://m.economictimes.com/news/international/world-news/bangladesh-protest-anti-hindu-attacks-grow-amid-political-turmoil-iskcon-temples-defaced/articleshow/112289047.cms)",
        "I am sensing something akin to the aftermath of the Egyptian arab spring revolution",
        "You are claiming that Hindus being attacked is propaganda and also simultaneously claiming that it's the work of a fringe group and also that RAW is involved in violence and finally draw a conclusion that India will invade Bangladesh. \n\nNow I don't claim any knowledge of the actual facts on the ground but your post is also prey to the standard trope that India is somehow desperate to invade Bangladesh. \n\nHonestly if India wanted to invade Bangladesh can Bangaladesh stop it based purely on the strength of the army and economic heft ? Can Bangladesh be blockaded from the sea route ? Almost certainly since the Indian Navy can easily control the Bay of Bengal. \n\nHas India ever used it's military might against Bangladesh? What does India gain by occupying Bangladesh? What does India gain by embroiling Bangladesh in a civil war ? Are millions of Indians marching on the streets demanding any army action ? \n\nRandom SM posts and meltdowns do not form the basis of foreign policy. All the official Indian sources have asserted that the events are an internal matter of Bangladesh.",
        "Sorry but I saw videos where homes of some people were being attacked, I can't say what religion they were but it is not acceptable. You talk so casually about burning Mortaza's house as if his wife and children were also complicit in it. What if people rape the family of complicit men? What is the movement doing to protect that?!\n\nBangladesh was born out of horrific crimes, rapes, pillaging by Pakistan. I hope you guys know your history well and avoid being the perpetrators of the same crimes. \n\nIndia has zero interest in annexing Bangladesh. Not sure what propaganda you are fed there but please ignore our news channels and right wing social media, they are shit. They post similar nonsensical things about the US, doesn't mean India will invade the US.",
        "True",
        "Many videos are emerging showing Hindu girl's being raped and Hindu temples, houses being torched.In a nutshell, a genocide has been launched against the Hindu minority in Bangladesh. What I want to ask is: We know radicals from a particular community can't coexist with people of other religion and often unleash violence against them.Instead of holding them responsible, we, on the other hand, put them on a pedestal and bend out rules to accomodate them. We know which radical ideology is responsible for this bloodshed, but we do nothing to counter it. Why do we lack the courage to punish them or hold them accountable",
        "What kind propaganda bangladeshi are being fed. There is no profit in anexing Bangladesh nor we would like to have 15 crore Bangladeshi Muslim in our soil. So Stop this propaganda like India planning something like this",
        "It is a propaganda brother . If you don't believe it , then see dhruv rathe's Twitter post . He talked about it being false . And RAW was spotted here in Bangladesh protests . We have vdos where they were seen speaking in Hindi.",
        "See dhruv rathe's Twitter post. And even if India invade Bangladesh, you very well know that Bangladeshis won't have let go of their freedom so easily. Have a good day bro.",
        "When the teacher leaves the room , there will be chaos in the classroom. It's what happening in Bangladesh. Please give us some time and don't judge too quickly. You can also research about what's happening here if you are worried.",
        "Thank you for making this post.\nI'm worried that  this propaganda will be taken as truth .",
        "Students dont kills and rape women when the teacher is out. It is a movement worthy of support but students need to be mature enough to make sure innocents are protected at all cost.",
        "The only propaganda exist here is your post \n\n\n1) India & Indians not interested in Annexing Bangladesh \n\n\n2) Attack on Minority Hindus in Islamic Majority Bangladesh is widespread videos photos all available,kindly don't mislead us",
        "So because of these RW accounts on X we have to overlook how Hindus  are being persecuted by radicals there ? What kind of logic is this ? What kind of human are you ?",
        "Students aren't doing it ! That's the point . The Awami League's student font ' chatra league ' is doing it . A chat of them was leaked where they were seen discussing about attacking on minorities so that the international media thinks that the students and islamists grps are hurting our Hindus . And you'll be less worried to know that the locals and students came forward to protect the temples and Hindu homes . I can send you the pic if you don't believe. And students and their parents offered the Hindu families their homes for shelter. The student protest coordinators are also told to create team in their area to protect the minorities. We are not Hindu vs Muslim, we are trying to create unity so please don't create division among us .",
        "You are taking one line in an entire argument to claim the same BS that you were claiming earlier. \n\nRepeat after me \"India has no strategic advantage in invading Bangladesh\". \" Random SM posts are not an indication of foreign policy\".  \" Just because something is theoretically possible does not make it probable\"",
        "Always the indian muslims denying it when we are getting footages directly from their hindus",
        "How about you say this to other indians who are keep saying that India should invade Bangladesh?? It seems to me that they are desperate.",
        "what? of course not. what’s happening to the bangladeshi hindus is HORRIBLE. there is no excuse for it. if you read my post properly, you would see that im completely against it. however, a lot of the information regarding the attacks is being over exaggerated and misinformed. that is my point.",
        "Students are not a part of the vandalism and violence (I’m sure there are notable exceptions). The attacks are being carried out by political parties (Jamaat, BNP, BAL, BCL)."
    ],
    "cleaned_text": "propaganda regarding attacks bangladeshi hindus following collapse government youre unaware current situation bangladesh prime minister dictator sheikh hasina resigned fled india following mass protests shortly stepped civil unrest erupted many bangladeshi hindus victims attacks please keep mind attacks carried students civilians fully condemn attacks goal peaceful democratic bangladesh place religious discrimination locals trying protect temples churches attacks carried sheikh hasinas goons also known chhatro league bcl would targeting bangladeshi hindus surely hurt sentiments indians present indian army excuse enter bangladesh name protection intending invasion raw agents indian agents already spotted dhaka shooting aimlessly true hindus targeted indian media currently filled propaganda secure support regular indian civilians invasioninterference please dont fall one pictures ive shared shows tweet says bangladeshi hindu cricketer liton dass house burned result religious targeting actually happened house belongs cricketer mashrafe mortaza actually bangladeshi muslim house burnt sided fascist government nothing religion one example many ill try post ones ",
    "cleaned_title": "propaganda regarding attacks bangladeshi hindus following collapse government",
    "cleaned_selftext": "youre unaware current situation bangladesh prime minister dictator sheikh hasina resigned fled india following mass protests shortly stepped civil unrest erupted many bangladeshi hindus victims attacks please keep mind attacks carried students civilians fully condemn attacks goal peaceful democratic bangladesh place religious discrimination locals trying protect temples churches attacks carried sheikh hasinas goons also known chhatro league bcl would targeting bangladeshi hindus surely hurt sentiments indians present indian army excuse enter bangladesh name protection intending invasion raw agents indian agents already spotted dhaka shooting aimlessly true hindus targeted indian media currently filled propaganda secure support regular indian civilians invasioninterference please dont fall one pictures ive shared shows tweet says bangladeshi hindu cricketer liton dass house burned result religious targeting actually happened house belongs cricketer mashrafe mortaza actually bangladeshi muslim house burnt sided fascist government nothing religion one example many ill try post ones",
    "cleaned_comments": "stay safe keep fighting free bangladesh whole world watching attacks carried sheikh hasinas goons also known chhatro league bcl would targeting bangladeshi hindus surely hurt sentiments indians present indian army excuse enter bangladesh name protection intending invasion raw agents indian agents already spotted dhaka shooting aimlessly calls others propaganda goes level allegations without references dude dont need lessons army works well aware capabilities shortcomings india imperial state like russia china would long done imperial designs bangladesh bangladesh looks effed probnp islamic movement hasinas government could topple years needed revolt led university students succeed deposing hasina military takes spoonfuls reinvigorated islamist rhetoric best wishes escalation violence protests across bangladesh sunday hindu houses temples including iskcon kali temples specifically targeted resulting deaths nearly people including kajal roy hindu councillorhttpsmeconomictimescomnewsinternationalworldnewsbangladeshprotestantihinduattacksgrowamidpoliticalturmoiliskcontemplesdefacedarticleshowcms sensing something akin aftermath egyptian arab spring revolution claiming hindus attacked propaganda also simultaneously claiming work fringe group also raw involved violence finally draw conclusion india invade bangladesh dont claim knowledge actual facts ground post also prey standard trope india somehow desperate invade bangladesh honestly india wanted invade bangladesh bangaladesh stop based purely strength army economic heft bangladesh blockaded sea route almost certainly since indian navy easily control bay bengal india ever used military might bangladesh india gain occupying bangladesh india gain embroiling bangladesh civil war millions indians marching streets demanding army action random sm posts meltdowns form basis foreign policy official indian sources asserted events internal matter bangladesh sorry saw videos homes people attacked cant say religion acceptable talk casually burning mortazas house wife children also complicit people rape family complicit men movement protect bangladesh born horrific crimes rapes pillaging pakistan hope guys know history well avoid perpetrators crimes india zero interest annexing bangladesh sure propaganda fed please ignore news channels right wing social media shit post similar nonsensical things us doesnt mean india invade us true many videos emerging showing hindu girls raped hindu temples houses torchedin nutshell genocide launched hindu minority bangladesh want ask know radicals particular community cant coexist people religion often unleash violence theminstead holding responsible hand put pedestal bend rules accomodate know radical ideology responsible bloodshed nothing counter lack courage punish hold accountable kind propaganda bangladeshi fed profit anexing bangladesh would like crore bangladeshi muslim soil stop propaganda like india planning something like propaganda brother dont believe see dhruv rathes twitter post talked false raw spotted bangladesh protests vdos seen speaking hindi see dhruv rathes twitter post even india invade bangladesh well know bangladeshis wont let go freedom easily good day bro teacher leaves room chaos classroom happening bangladesh please give us time dont judge quickly also research whats happening worried thank making post im worried propaganda taken truth students dont kills rape women teacher movement worthy support students need mature enough make sure innocents protected cost propaganda exist post india indians interested annexing bangladesh attack minority hindus islamic majority bangladesh widespread videos photos availablekindly dont mislead us rw accounts x overlook hindus persecuted radicals kind logic kind human students arent thats point awami leagues student font chatra league chat leaked seen discussing attacking minorities international media thinks students islamists grps hurting hindus youll less worried know locals students came forward protect temples hindu homes send pic dont believe students parents offered hindu families homes shelter student protest coordinators also told create team area protect minorities hindu vs muslim trying create unity please dont create division among us taking one line entire argument claim bs claiming earlier repeat india strategic advantage invading bangladesh random sm posts indication foreign policy something theoretically possible make probable always indian muslims denying getting footages directly hindus say indians keep saying india invade bangladesh seems desperate course whats happening bangladeshi hindus horrible excuse read post properly would see im completely however lot information regarding attacks exaggerated misinformed point students part vandalism violence im sure notable exceptions attacks carried political parties jamaat bnp bal bcl",
    "light_cleaned_title": "Propaganda regarding the attacks on Bangladeshi Hindus following the collapse of the government",
    "light_cleaned_selftext": "If you’re unaware of the current situation in bangladesh, our prime minister (dictator) Sheikh Hasina has resigned and fled to india following mass protests. Shortly after she stepped down, civil unrest erupted and many Bangladeshi Hindus have had to be victims of attacks. But please keep in mind, these attacks are not being carried out by students or civilians. We fully condemn these attacks as our goal is a peaceful and democratic Bangladesh, which has no place for religious discrimination. The locals are trying to protect the temples and churches. These attacks are being carried out by Sheikh Hasina’s goons, also known as Chhatro League (BCL). Why would she do this? Targeting Bangladeshi Hindus will surely hurt the sentiments of Indians. This will present the indian army with an excuse to enter bangladesh in the name of ‘protection’, while intending for an invasion. RAW agents (indian agents) have already been spotted in Dhaka, shooting aimlessly. While it is true that Hindus are being targeted, the indian media is currently being filled with propaganda to secure the support of regular indian civilians for an invasion/interference. Please don’t fall for it! In one of the pictures I’ve shared, it shows a tweet that says that Bangladeshi Hindu cricketer Liton Das’s house has been burned as a result of religious targeting. This is what actually happened: that house belongs to cricketer Mashrafe Mortaza, who is actually a Bangladeshi Muslim. His house was burnt as he sided with the fascist government. Has nothing to do with religion. This is one example of many (I’ll try to post the other ones too).",
    "light_cleaned_comments": "You all stay as safe as you can and keep fighting for a free Bangladesh. The whole world is watching. > These attacks are being carried out by Sheikh Hasina’s goons, also known as Chhatro League (BCL). Why would she do this? Targeting Bangladeshi Hindus will surely hurt the sentiments of Indians. This will present the indian army with an excuse to enter bangladesh in the name of ‘protection’, while intending for an invasion. RAW agents (indian agents) have already been spotted in Dhaka, shooting aimlessly. Calls others as propaganda and then goes on to level allegations without any references. Dude, we don't need any lessons on how our army works. We are well aware about its capabilities and shortcomings. India is not an imperial state like Russia or China and we would have been long done with it if we did have any imperial designs on Bangladesh. Bangladesh looks effed. The Pro-BNP Islamic movement against Hasina's government could not topple it for years. It needed a revolt led by university students. And now when it succeed in deposing Hasina, Military takes over with spoonfuls of reinvigorated Islamist rhetoric. Best wishes! an escalation of violence during protests across Bangladesh on Sunday, Hindu houses and temples, including Iskcon and Kali temples, were specifically targeted, resulting in the deaths of nearly 100 people, including Kajal Roy, a Hindu councillor](https://m.economictimes.com/news/international/world-news/bangladesh-protest-anti-hindu-attacks-grow-amid-political-turmoil-iskcon-temples-defaced/articleshow/112289047.cms) I am sensing something akin to the aftermath of the Egyptian arab spring revolution You are claiming that Hindus being attacked is propaganda and also simultaneously claiming that it's the work of a fringe group and also that RAW is involved in violence and finally draw a conclusion that India will invade Bangladesh. Now I don't claim any knowledge of the actual facts on the ground but your post is also prey to the standard trope that India is somehow desperate to invade Bangladesh. Honestly if India wanted to invade Bangladesh can Bangaladesh stop it based purely on the strength of the army and economic heft ? Can Bangladesh be blockaded from the sea route ? Almost certainly since the Indian Navy can easily control the Bay of Bengal. Has India ever used it's military might against Bangladesh? What does India gain by occupying Bangladesh? What does India gain by embroiling Bangladesh in a civil war ? Are millions of Indians marching on the streets demanding any army action ? Random SM posts and meltdowns do not form the basis of foreign policy. All the official Indian sources have asserted that the events are an internal matter of Bangladesh. Sorry but I saw videos where homes of some people were being attacked, I can't say what religion they were but it is not acceptable. You talk so casually about burning Mortaza's house as if his wife and children were also complicit in it. What if people rape the family of complicit men? What is the movement doing to protect that?! Bangladesh was born out of horrific crimes, rapes, pillaging by Pakistan. I hope you guys know your history well and avoid being the perpetrators of the same crimes. India has zero interest in annexing Bangladesh. Not sure what propaganda you are fed there but please ignore our news channels and right wing social media, they are shit. They post similar nonsensical things about the US, doesn't mean India will invade the US. True Many videos are emerging showing Hindu girl's being raped and Hindu temples, houses being torched.In a nutshell, a genocide has been launched against the Hindu minority in Bangladesh. What I want to ask is: We know radicals from a particular community can't coexist with people of other religion and often unleash violence against them.Instead of holding them responsible, we, on the other hand, put them on a pedestal and bend out rules to accomodate them. We know which radical ideology is responsible for this bloodshed, but we do nothing to counter it. Why do we lack the courage to punish them or hold them accountable What kind propaganda bangladeshi are being fed. There is no profit in anexing Bangladesh nor we would like to have 15 crore Bangladeshi Muslim in our soil. So Stop this propaganda like India planning something like this It is a propaganda brother . If you don't believe it , then see dhruv rathe's Twitter post . He talked about it being false . And RAW was spotted here in Bangladesh protests . We have vdos where they were seen speaking in Hindi. See dhruv rathe's Twitter post. And even if India invade Bangladesh, you very well know that Bangladeshis won't have let go of their freedom so easily. Have a good day bro. When the teacher leaves the room , there will be chaos in the classroom. It's what happening in Bangladesh. Please give us some time and don't judge too quickly. You can also research about what's happening here if you are worried. Thank you for making this post. I'm worried that this propaganda will be taken as truth . Students dont kills and rape women when the teacher is out. It is a movement worthy of support but students need to be mature enough to make sure innocents are protected at all cost. The only propaganda exist here is your post 1) India & Indians not interested in Annexing Bangladesh 2) Attack on Minority Hindus in Islamic Majority Bangladesh is widespread videos photos all available,kindly don't mislead us So because of these RW accounts on X we have to overlook how Hindus are being persecuted by radicals there ? What kind of logic is this ? What kind of human are you ? Students aren't doing it ! That's the point . The Awami League's student font ' chatra league ' is doing it . A chat of them was leaked where they were seen discussing about attacking on minorities so that the international media thinks that the students and islamists grps are hurting our Hindus . And you'll be less worried to know that the locals and students came forward to protect the temples and Hindu homes . I can send you the pic if you don't believe. And students and their parents offered the Hindu families their homes for shelter. The student protest coordinators are also told to create team in their area to protect the minorities. We are not Hindu vs Muslim, we are trying to create unity so please don't create division among us . You are taking one line in an entire argument to claim the same BS that you were claiming earlier. Repeat after me \"India has no strategic advantage in invading Bangladesh\". \" Random SM posts are not an indication of foreign policy\". \" Just because something is theoretically possible does not make it probable\" Always the indian muslims denying it when we are getting footages directly from their hindus How about you say this to other indians who are keep saying that India should invade Bangladesh?? It seems to me that they are desperate. what? of course not. what’s happening to the bangladeshi hindus is HORRIBLE. there is no excuse for it. if you read my post properly, you would see that im completely against it. however, a lot of the information regarding the attacks is being over exaggerated and misinformed. that is my point. Students are not a part of the vandalism and violence (I’m sure there are notable exceptions). The attacks are being carried out by political parties (Jamaat, BNP, BAL, BCL)."
}