{
    "id": "15ez1yy",
    "title": "Gujarat govt to study possibility of making parental nod must in love marriages if constitutionally feasible: CM Patel",
    "url": "https://www.thehindu.com/news/national/other-states/gujarat-govt-to-study-possibility-of-making-parental-nod-must-in-love-marriages-if-constitutionally-feasible-cm-patel/article67141788.ece",
    "selftext": "Non paywalled link: https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fother-states%2Fgujarat-govt-to-study-possibility-of-making-parental-nod-must-in-love-marriages-if-constitutionally-feasible-cm-patel%2Farticle67141788.ece",
    "flair": "Politics",
    "score": 1,
    "num_comments": 26,
    "created_utc": 1690855192.0,
    "convurl": "https://external-preview.redd.it/AYzZX6a0yUO2xv-vI7T1eUimA2tbwyq32wtnds34jGo.jpg?auto=webp&s=67dd813110f5ed43c69a222fae8e529837ab0acb",
    "comments": [
        "Third world s**t hole can only come up with s**t hole ideas.",
        "Interesting. This coming from a party of Modi who got married with the consent of his family and still chose to abandon his wife. He lied about his marriage and still doesn’t have the guts to let his wife go live a free life.",
        "You never know, these types of laws may have been already baked into the UCC they are proposing.",
        "So, what about मियाँ - बीवी राजी तो क्या करेगा काजी and all that?",
        "Thats for Muslim. Hindus must seek consent from parents in Hindu Rashtra /s",
        "Lets go backwards one step at a time.\n\nUntil we reach Ram Rajya. And then, we can set our wives on fire too.",
        "Of the million issues Gujarat has they wanted to make an issue out of thin air. In a nutshell we have more problems than what we started off with because these lunatics don't have a clue about basic human rights. What a bunch of retards",
        "\"If constitutionally feasible\" - It isnt. Supreme Court has ruled \"Right to marry\" as a fundamental right under article 21 ( as long as both are consenting adults, they dont need anyone's permission)",
        "Made me giggle",
        "Welp time to change the constitution then.",
        "\"Of course I want to marry you babe, I swear, but my parents won't let me. Sorry\".",
        "Could marrying for love be a threat to men like this because they know that women wouldn’t pick them.",
        "Average Manusmriti enjoyer",
        "Doesn't that happen a lot already",
        "Yes, but after this legislation gets passed, they won't even have the option to get married against the parents' will.",
        "BJP : Propose something extreme and get half go through , both sides will be happy",
        "Once upon a time, there was a concept of \"Swayamvar\". Consent of the women was more important than the consent of the parents. Don't know where we are moving...",
        "Yeah meant it as a joke",
        "Thurki buddhas can't allow young people to have sex.",
        "Smart move. Probably the only way for incel right wingers to get married.",
        "A country with no liberty and no justice. People better rise up the end is fast approaching.",
        "The Florida of India.",
        "These folks in Guj have lost it.",
        "Now we are being ruled by whatsapp uncles and ultra conservative grandpa's."
    ],
    "cleaned_text": "gujarat govt study possibility making parental nod must love marriages constitutionally feasible cm patel non paywalled link ",
    "cleaned_title": "gujarat govt study possibility making parental nod must love marriages constitutionally feasible cm patel",
    "cleaned_selftext": "non paywalled link",
    "cleaned_comments": "third world st hole come st hole ideas interesting coming party modi got married consent family still chose abandon wife lied marriage still doesnt guts let wife go live free life never know types laws may already baked ucc proposing thats muslim hindus must seek consent parents hindu rashtra lets go backwards one step time reach ram rajya set wives fire million issues gujarat wanted make issue thin air nutshell problems started lunatics dont clue basic human rights bunch retards constitutionally feasible isnt supreme court ruled right marry fundamental right article long consenting adults dont need anyones permission made giggle welp time change constitution course want marry babe swear parents wont let sorry could marrying love threat men like know women wouldnt pick average manusmriti enjoyer doesnt happen lot already yes legislation gets passed wont even option get married parents bjp propose something extreme get half go sides happy upon time concept swayamvar consent women important consent parents dont know moving yeah meant joke thurki buddhas cant allow young people sex smart move probably way incel right wingers get married country liberty justice people better rise end fast approaching florida india folks guj lost ruled whatsapp uncles ultra conservative grandpas",
    "light_cleaned_title": "Gujarat govt to study possibility of making parental nod must in love marriages if constitutionally feasible: CM Patel",
    "light_cleaned_selftext": "Non paywalled link:",
    "light_cleaned_comments": "Third world s**t hole can only come up with s**t hole ideas. Interesting. This coming from a party of Modi who got married with the consent of his family and still chose to abandon his wife. He lied about his marriage and still doesn’t have the guts to let his wife go live a free life. You never know, these types of laws may have been already baked into the UCC they are proposing. So, what about मियाँ - बीवी राजी तो क्या करेगा काजी and all that? Thats for Muslim. Hindus must seek consent from parents in Hindu Rashtra /s Lets go backwards one step at a time. Until we reach Ram Rajya. And then, we can set our wives on fire too. Of the million issues Gujarat has they wanted to make an issue out of thin air. In a nutshell we have more problems than what we started off with because these lunatics don't have a clue about basic human rights. What a bunch of retards \"If constitutionally feasible\" - It isnt. Supreme Court has ruled \"Right to marry\" as a fundamental right under article 21 ( as long as both are consenting adults, they dont need anyone's permission) Made me giggle Welp time to change the constitution then. \"Of course I want to marry you babe, I swear, but my parents won't let me. Sorry\". Could marrying for love be a threat to men like this because they know that women wouldn’t pick them. Average Manusmriti enjoyer Doesn't that happen a lot already Yes, but after this legislation gets passed, they won't even have the option to get married against the parents' will. BJP : Propose something extreme and get half go through , both sides will be happy Once upon a time, there was a concept of \"Swayamvar\". Consent of the women was more important than the consent of the parents. Don't know where we are moving... Yeah meant it as a joke Thurki buddhas can't allow young people to have sex. Smart move. Probably the only way for incel right wingers to get married. A country with no liberty and no justice. People better rise up the end is fast approaching. The Florida of India. These folks in Guj have lost it. Now we are being ruled by whatsapp uncles and ultra conservative grandpa's."
}