{
    "id": "16cc83b",
    "title": "This cant just be a co-incidence!",
    "url": "https://www.reddit.com/gallery/16cc83b",
    "selftext": "Look at these nutters. Wasnt just one page scroll either, I scrolled pages upon pages and still the same.",
    "flair": "Rant / Vent",
    "score": 94,
    "num_comments": 23,
    "created_utc": 1694082297,
    "convurl": "https://i.redd.it/o9vvf3mf8tmb1.jpg",
    "comments": [
        "Most likely the infamous IT Cell.",
        "NGL  \nISRO inspired NASA",
        "I think OP is referring to the comments to that post.",
        "\"India, that is Bharat\". Bhai bolne de na ek hi to hai",
        "I am surprised how many they were man. Hundreds if not thousands",
        "UPI payment of two rupees received.",
        "Modiji  ne bhakto  koh kaam pe laga diya .🤷‍♂️",
        "Yes, these people who are ashamed of the name of their own motherland are the patriots, while us questioning the dubious intentions of the chotti pp sarkar are the anti-nationals.",
        "Manipulation is their core competency social media, emotions, stocks, etc. Assemble 1000s of social media zombies, each handle 5-20 fake accounts. Sell any narrative.",
        "Is it weird that i find this much patriotism idiotic. It reminds me of fascism in italy and germany during ww2. Why should one be so obsessed with a nation to avoid talking about important topics or criticism but just be blinded by the nationalist values?",
        "They hate India but love Bharat. We love both. We are not the same.",
        "Most accounts are also bots giving you a sense that a lot more people engage than reality.",
        "Change it to r/Bharat",
        "As if NASA and their social media teams care about validations - specially from India. These seem like the troll armies.",
        "Yes indeed, but these type people are trying making a political statement made from a wicked agenda. (It's LinkedIn and NASA post, what's the need of such comments).\n\nInitially they may only like this but eventually you will see them making reasons about how India is not a true name for the country.\n\nWhen people like us, who seldom make sensible decisions don't call them out, eventually will see the tide turned against us.",
        "I actually got in a civil discussion with my friends regarding the name change they were supporting it because of history and British imposition (and other wrong info) while i put 13-14 arguments how name change will hurt us in the long turn i managed to convince a few but some are still hell bent on changing the name",
        "But why he is getting downvoted. \n\nHis statement isn't wrong though",
        "Bro can we get over this debate bharat and india",
        "Bhai /s to laga le aage",
        "What does OP trying to convey? Bharat is superior to  India if some few 100,200 ppl use it on social. I think this debate should end for good. Proud Indian/Bhartiya.",
        "Japan, too.\n\nhttps://preview.redd.it/7pq25vcwfumb1.jpeg?width=1284&format=pjpg&auto=webp&s=38bd25b06cb90abcc359c4e15a5e7ba78c07c47e"
    ],
    "cleaned_text": "cant coincidence look nutters wasnt one page scroll either scrolled pages upon pages still ",
    "cleaned_title": "cant coincidence",
    "cleaned_selftext": "look nutters wasnt one page scroll either scrolled pages upon pages still",
    "cleaned_comments": "likely infamous cell ngl isro inspired nasa think op referring comments post india bharat bhai bolne de na ek hi hai surprised many man hundreds thousands upi payment two rupees received modiji ne bhakto koh kaam pe laga diya yes people ashamed name motherland patriots us questioning dubious intentions chotti pp sarkar antinationals manipulation core competency social media emotions stocks etc assemble social media zombies handle fake accounts sell narrative weird find much patriotism idiotic reminds fascism italy germany ww one obsessed nation avoid talking important topics criticism blinded nationalist values hate india love bharat love accounts also bots giving sense lot people engage reality change rbharat nasa social media teams care validations specially india seem like troll armies yes indeed type people trying making political statement made wicked agenda linkedin nasa post whats need comments initially may like eventually see making reasons india true name country people like us seldom make sensible decisions dont call eventually see tide turned us actually got civil discussion friends regarding name change supporting history british imposition wrong info put arguments name change hurt us long turn managed convince still hell bent changing name getting downvoted statement isnt wrong though bro get debate bharat india bhai laga le aage op trying convey bharat superior india ppl use social think debate end good proud indianbhartiya japan",
    "light_cleaned_title": "This cant just be a co-incidence!",
    "light_cleaned_selftext": "Look at these nutters. Wasnt just one page scroll either, I scrolled pages upon pages and still the same.",
    "light_cleaned_comments": "Most likely the infamous IT Cell. NGL ISRO inspired NASA I think OP is referring to the comments to that post. \"India, that is Bharat\". Bhai bolne de na ek hi to hai I am surprised how many they were man. Hundreds if not thousands UPI payment of two rupees received. Modiji ne bhakto koh kaam pe laga diya .🤷‍♂️ Yes, these people who are ashamed of the name of their own motherland are the patriots, while us questioning the dubious intentions of the chotti pp sarkar are the anti-nationals. Manipulation is their core competency social media, emotions, stocks, etc. Assemble 1000s of social media zombies, each handle 5-20 fake accounts. Sell any narrative. Is it weird that i find this much patriotism idiotic. It reminds me of fascism in italy and germany during ww2. Why should one be so obsessed with a nation to avoid talking about important topics or criticism but just be blinded by the nationalist values? They hate India but love Bharat. We love both. We are not the same. Most accounts are also bots giving you a sense that a lot more people engage than reality. Change it to r/Bharat As if NASA and their social media teams care about validations - specially from India. These seem like the troll armies. Yes indeed, but these type people are trying making a political statement made from a wicked agenda. (It's LinkedIn and NASA post, what's the need of such comments). Initially they may only like this but eventually you will see them making reasons about how India is not a true name for the country. When people like us, who seldom make sensible decisions don't call them out, eventually will see the tide turned against us. I actually got in a civil discussion with my friends regarding the name change they were supporting it because of history and British imposition (and other wrong info) while i put 13-14 arguments how name change will hurt us in the long turn i managed to convince a few but some are still hell bent on changing the name But why he is getting downvoted. His statement isn't wrong though Bro can we get over this debate bharat and india Bhai /s to laga le aage What does OP trying to convey? Bharat is superior to India if some few 100,200 ppl use it on social. I think this debate should end for good. Proud Indian/Bhartiya. Japan, too."
}