{
    "id": "13dcizp",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/13dcizp/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1683682209.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg",
    "comments": [
        "I am in the last year of my master's and I am really stressed because I want to change fields. I feel it is too late now and also finding a job in this market is so stressful and tough. I really am slipping into depression and I already suffer from severe anxiety. I can't be productive even after trying every day I really don't know how to go forward from here. The pressure is more because I am the eldest in my family and I have so much responsibility. I really don't know how to go ahead from here.",
        "How do you get back your motivation? I am highly employable, but am not even motivated to apply for jobs. I feel low-key depressed and it’s been like this for a while. I believe that i know the causes of my depression, but how do i get back my motivation to close to 100%? I get bouts of motivation to do something here and there, but it’s not close to the motivation i felt earlier (when i worked hard to become highly employable). I should have been near the top management in big companies by now, but I don’t really care."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "last year masters really stressed want change fields feel late also finding job market stressful tough really slipping depression already suffer severe anxiety cant productive even trying every day really dont know go forward pressure eldest family much responsibility really dont know go ahead get back motivation highly employable even motivated apply jobs feel lowkey depressed like believe know causes depression get back motivation close get bouts motivation something close motivation felt earlier worked hard become highly employable near top management big companies dont really care",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I am in the last year of my master's and I am really stressed because I want to change fields. I feel it is too late now and also finding a job in this market is so stressful and tough. I really am slipping into depression and I already suffer from severe anxiety. I can't be productive even after trying every day I really don't know how to go forward from here. The pressure is more because I am the eldest in my family and I have so much responsibility. I really don't know how to go ahead from here. How do you get back your motivation? I am highly employable, but am not even motivated to apply for jobs. I feel low-key depressed and it’s been like this for a while. I believe that i know the causes of my depression, but how do i get back my motivation to close to 100%? I get bouts of motivation to do something here and there, but it’s not close to the motivation i felt earlier (when i worked hard to become highly employable). I should have been near the top management in big companies by now, but I don’t really care."
}