{
    "id": "mba72t",
    "title": "We wrote to the Ministry of Electronics and IT making a case for the withdrawal of the new IT Rules",
    "url": "https://www.reddit.com/r/india/comments/mba72t/we_wrote_to_the_ministry_of_electronics_and_it/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/vc1mtoblpqo61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=351865acd92ceabf8a626195a36309f466163788\n\n# TL;DR\n\nWe've written to the MeitY, making a case for the withdrawal of the new IT Rules. The reason is simple: the bad outweighs the good. The Rules fail to comply with basic principles for regulation to respect human rights set by international bodies. Progressive regulations absolutely must exist, but the new IT Rules are simply unconstitutional! We believe that the way to move towards a regulatory framework that will actually safeguards the rights of Indian users as a first priority is to withdraw the Rules.\n\n&amp;#x200B;\n\n## IT Rules: Are they any good?\n\nThe Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 were [**notified on February 25th, 2021**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). The Rules lay down an anti-democratic and unconstitutional framework for the regulation of online content. These concerns have been noted in our initial analysis. Such concerns demand a greater scrutiny of the Rules than has been the case, especially since no stakeholders consultations have been conducted between when they were first proposed to when dramatic changes were made and then they were notified.\n\nAt the same time, our analysis remains objective and we do note positive provisions such as, for example, mandating the provision of a counter-notice under rule 4 (8) (a) explaining the removal or disabling access to information or data. It will provide notices to users before their accounts are suspended or information that they post is removed. Such a move deepens the rights of users, and is to be maintained.\n\nRules 4(d) and 18(3) specify the need for periodic compliance reports to be furnished every month by significant social media intermediaries and publishers of news and current affairs content or online curated content respectively. These provisions ensure mechanisms for making large technology firms accountable and accessible.\n\nHowever, to achieve real accountability the relevant definitions require clear statutory definitions. The existence of such a vague and overbroad law will have a chilling effect on the freedom of speech and expression, and thus would run counter to any attempts to strengthen the digital rights of citizens. In this light, it is disappointing that such welcome provisions have not been placed within a broader framework of progressive regulation.\n\nStill, making furnishing these notices to users and publishing periodic compliance reports the law is a good thing.  Greater transparency and accountability helps build trust. This is a principle that should apply to technology platforms as well as to public authorities. But does it? We find that the prescribed paradigm is one of punitive enforcement of compliance without the necessary statutory protections for intermediaries under regulatory ‘safe-harbours’. Thus, even the positive provisions end up being only marginally beneficial, while the remaining provisions are significantly unwelcome.\n\n## The IT Rules: The Bad Bits\n\nNow, even the good parts of the IT Rule come with significant caveats, and may not even be implemented effectively. Unfortunately, the bad parts may be significantly worse.  We have  extensively analysed various concerns that arise with respect to the IT Rules: how the Rules are [**anti-democratic and unconstitutional**](https://internetfreedom.in/intermediaries-rules-2021/), what [**self-regulation (read self-censorship) in the OTT sector**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/) may look like under the Rules, and our asks of [**MEITY and MIB with respect to the Rules**](https://internetfreedom.in/constitutional-questions-against-unconstitutional-rules/), and so we know the significant harms that are likely to arise as a consequence of the Rules.\n\nFor example, part II of the Rules has serious implications on the freedom of speech and expression and the right to privacy of users of the internet:\n\n1. Rule 3(2) requires social media intermediaries to establish a grievance redressal mechanism by which users may complain against any content and a grievance officer has to dispose of such complaints within 15 days. An empirical study conducted by the Centre for Internet Society points out that intermediaries tend to over-comply with such takedown requests to limit their liability and this has a chilling effect on free speech and expression of all users.\n2. Rule 4(2) requires significant social media intermediaries which provide messaging services (such as Whatsapp) to enable identification of the “first originator” of a message. To implement this rule, entities will have to “fingerprint” each message and this may defeat end-to-end encryption. As a consequence, privacy of every user will be compromised to investigate crimes committed by a miniscule-minority.\n3. Rule 4(4) requires significant social media intermediaries to develop automated tools to censor content. While the efficacy of such tools is itself doubtful, intermediaries will collect large amounts of data of users to develop these tools in violation of the Right to Privacy of users.\n\nPart III of the Rules will have grave consequences for the freedom of speech and expression of Digital News Media and OTT Platforms, and the right of citizens to have access to information:\n\n1. The Rules establish a Code of Ethics which is enforced by an Inter-Departmental Committee which consists only of officers of the Government. The Inter-Departmental Committee may recommend the Ministry of Information and Broadcasting to block, delete or modify content published by Digital News Media and OTT platforms. Thus, the Central Government is now the sole arbiter of permissible speech. This affects the publisher’s Fundamental Right to Expression and the citizen’s right to access differing points of view because publishers will be compelled to only produce content which is palatable to the Central Government\n2. Notably, Rule 14(1)(b) r/w Rule 14(1)(6) permits the Ministry of Information and Broadcasting to refer complaints to an Inter-Departmental Committee and also decide upon those complaints after taking into consideration the recommendations of the Inter-Departmental Committee. This is arbitrary as the Ministry of Information and Broadcasting becomes a ‘judge in its own cause’, and has a chilling effect on speech of the publishers.\n3. The Code of Ethics mandates OTT Platforms to “take into consideration India’s multi-racial and multi-religious context” and exercise “due caution” when portraying any racial or religious group. If they do not exercise “due caution” their content may be blocked by the Inter-Departmental Committee. This obligation on OTT Platforms is vague and has a “chilling effect” because vague laws by their very nature, are overbroad and cover within their ambit both unlawful and legitimate speech.\n\n## Alternative regulatory visions\n\nFirstly, the proper legislative mandate for the IT Act is to focus on online interactions by information conduits that work with user generated content. Hence, the Rules must also be examined in the context of other regulatory paradigms for intermediary liability that integrate digital rights.\n\n[**International bodies and policy experts have called for the adoption**](https://www.eff.org/press/releases/international-coalition-launches-manila-principles-protect-freedom-expression) of the ‘[**Manilla Principles for Intermediary Liability**](https://www.manilaprinciples.org/)’ to protect online freedom of expression and innovation around the world. These principles are:\n\n1. Principle 1: Intermediaries should be shielded by law from liability for third party content\n2. Principle 2: Content must not be required to be restricted without an order by a judicial authority\n3. Principle 3: Requests for restrictions of content must be clear, be unambiguous, and follow due process\n4. Principle 4: Laws and content restriction orders and practices must comply with the tests of necessity and proportionality\n5. Principle 5: Laws and content restriction policies and practices must respect due process\n6. Principle 6: Transparency and accountability must be built into laws and content restriction policies and practices\n\nThe Manilla Principles attempt to provide for an intermediary liability regime that respects human rights, and so it is disappointing that, apart from arguably principle 2, the Rules do not incorporate the principles in its provisions, especially with respect to compliance with proportionality tests. Such disappointment is greater in light of the fact that the Intermediary Guidelines (Amendment) Rules, 2018, had also[ **been criticised for “large unalignment” with the Principles**](https://cis-india.org/internet-governance/files/draft-rules-and-manila-principles-1), and so the Rules had represented a chance to right these earlier mistakes.\n\nAnother regulatory framework that has not been fully engaged with is the ‘[**Santa Clara Principles**](https://santaclaraprinciples.org/)’,  which state that:\n\n1. Principle 1: Companies should publish the numbers of posts removed and accounts permanently or temporarily suspended due to violations of their content guidelines.\n2. Principle 2: Companies should provide notice to each user whose content is taken down or account is suspended about the reason for the removal or suspension.\n3. Principle 3: Companies should provide a meaningful opportunity for timely appeal of any content removal or account suspension.\n\nWe commend the incorporation of principles 1 and 2, through the provision of the aforementioned counter-notices under Rule 4(8)(a) and the requirement for intermediaries to publish periodic compliance reports under Rules 4(d) and 18(3) respectively. However, principle 3 has not been incorporated, as the grievance redressal mechanism specified by the Rules involves contracted timelines for responding and may lead to self-censorship.\n\n## What should be done\n\nWhile we understand the need for robust regulations and acknowledge the existence of certain progressive provisions, on the whole, the Rules are undemocratic, unconstitutional, and regressive. This is not to say social media is perfect – on the contrary it is broken. It requires large scale reforms that need to be conducted with transparency towards establishing a statutory framework that safeguards every day, ordinary Indians who use social media with increased frequency in every aspect of their lives.\n\nWe believe for this to happen the Rules must be withdrawn, and energy should be focussed towards extensive consultations that can lead to a statutory basis for instilling regulation that focuses on transparency and accountability from social media companies. The Rules today run the risk of becoming ‘shotgun legislation’: quick, sudden, and without precision towards addressing an issue with a targeted intervention, something which can only have a disproportionately stifling effect on the digital rights of Indian citizens.\n\n### Important Documents\n\n1. Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1XwWIs_26FRXkK6qkB193ajxfOP620iyx/view?usp=sharing)).\n2. Deep dive : How the intermediaries rules are anti-democratic and unconstitutional ([**link**](https://internetfreedom.in/intermediaries-rules-2021/))\n3. IFF's Letter to MEITY 'Regarding certain aspects of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021)' ([**link**](https://drive.google.com/file/d/1elhs46khdMd2lTWTE4ReFCIi2s8IYuAU/view?usp=sharing))",
    "flair": "Policy/Economy",
    "score": 178,
    "num_comments": 5,
    "created_utc": 1616488806,
    "convurl": "https://b.thumbs.redditmedia.com/RNgoKdwg6JlvWiOVun7MNAgAfOAL5apErtFOOAOnIpI.jpg",
    "comments": [
        "\" The Rules fail to comply with basic principles for regulation to respect human rights set by international bodies \"  \n\n\nHaayaashtyaag Internal Maatter",
        "I presume this letter will be directed to the spam folder and auto deleted, considering this government hates the notion of transparency and freedom.",
        "Thank you so much for representing us. \n:)"
    ],
    "cleaned_text": "wrote ministry electronics making case withdrawal new rules ampxb tldr weve written meity making case withdrawal new rules reason simple bad outweighs good rules fail comply basic principles regulation respect human rights set international bodies progressive regulations absolutely must exist new rules simply unconstitutional believe way move towards regulatory framework actually safeguards rights indian users first priority withdraw rules ampxb rules good information technology guidelines intermediaries digital media ethics code rules notified february th httpegazettenicinwritereaddatapdf rules lay antidemocratic unconstitutional framework regulation online content concerns noted initial analysis concerns demand greater scrutiny rules case especially since stakeholders consultations conducted first proposed dramatic changes made notified time analysis remains objective note positive provisions example mandating provision counternotice rule explaining removal disabling access information data provide notices users accounts suspended information post removed move deepens rights users maintained rules specify need periodic compliance reports furnished every month significant social media intermediaries publishers news current affairs content online curated content respectively provisions ensure mechanisms making large technology firms accountable accessible however achieve real accountability relevant definitions require clear statutory definitions existence vague overbroad law chilling effect freedom speech expression thus would run counter attempts strengthen digital rights citizens light disappointing welcome provisions placed within broader framework progressive regulation still making furnishing notices users publishing periodic compliance reports law good thing greater transparency accountability helps build trust principle apply technology platforms well public authorities find prescribed paradigm one punitive enforcement compliance without necessary statutory protections intermediaries regulatory safeharbours thus even positive provisions end marginally beneficial remaining provisions significantly unwelcome rules bad bits even good parts rule come significant caveats may even implemented effectively unfortunately bad parts may significantly worse extensively analysed various concerns arise respect rules rules antidemocratic unconstitutionalhttpsinternetfreedominintermediariesrules selfregulation read selfcensorship ott sectorhttpsinternetfreedominselfcensorshipandtheendofgoodcontent may look like rules asks meity mib respect ruleshttpsinternetfreedominconstitutionalquestionsagainstunconstitutionalrules know significant harms likely arise consequence rules example part ii rules serious implications freedom speech expression right privacy users internet rule requires social media intermediaries establish grievance redressal mechanism users may complain content grievance officer dispose complaints within days empirical study conducted centre internet society points intermediaries tend overcomply takedown requests limit liability chilling effect free speech expression users rule requires significant social media intermediaries provide messaging services whatsapp enable identification first originator message implement rule entities fingerprint message may defeat endtoend encryption consequence privacy every user compromised investigate crimes committed minisculeminority rule requires significant social media intermediaries develop automated tools censor content efficacy tools doubtful intermediaries collect large amounts data users develop tools violation right privacy users part iii rules grave consequences freedom speech expression digital news media ott platforms right citizens access information rules establish code ethics enforced interdepartmental committee consists officers government interdepartmental committee may recommend ministry information broadcasting block delete modify content published digital news media ott platforms thus central government sole arbiter permissible speech affects publishers fundamental right expression citizens right access differing points view publishers compelled produce content palatable central government notably rule b rw rule permits ministry information broadcasting refer complaints interdepartmental committee also decide upon complaints taking consideration recommendations interdepartmental committee arbitrary ministry information broadcasting becomes judge cause chilling effect speech publishers code ethics mandates ott platforms take consideration indias multiracial multireligious context exercise due caution portraying racial religious group exercise due caution content may blocked interdepartmental committee obligation ott platforms vague chilling effect vague laws nature overbroad cover within ambit unlawful legitimate speech alternative regulatory visions firstly proper legislative mandate act focus online interactions information conduits work user generated content hence rules must also examined context regulatory paradigms intermediary liability integrate digital rights international bodies policy experts called adoptionhttpswwwefforgpressreleasesinternationalcoalitionlaunchesmanilaprinciplesprotectfreedomexpression manilla principles intermediary liabilityhttpswwwmanilaprinciplesorg protect online freedom expression innovation around world principles principle intermediaries shielded law liability third party content principle content must required restricted without order judicial authority principle requests restrictions content must clear unambiguous follow due process principle laws content restriction orders practices must comply tests necessity proportionality principle laws content restriction policies practices must respect due process principle transparency accountability must built laws content restriction policies practices manilla principles attempt provide intermediary liability regime respects human rights disappointing apart arguably principle rules incorporate principles provisions especially respect compliance proportionality tests disappointment greater light fact intermediary guidelines amendment rules also criticised large unalignment principleshttpscisindiaorginternetgovernancefilesdraftrulesandmanilaprinciples rules represented chance right earlier mistakes another regulatory framework fully engaged santa clara principleshttpssantaclaraprinciplesorg state principle companies publish numbers posts removed accounts permanently temporarily suspended due violations content guidelines principle companies provide notice user whose content taken account suspended reason removal suspension principle companies provide meaningful opportunity timely appeal content removal account suspension commend incorporation principles provision aforementioned counternotices rule requirement intermediaries publish periodic compliance reports rules respectively however principle incorporated grievance redressal mechanism specified rules involves contracted timelines responding may lead selfcensorship done understand need robust regulations acknowledge existence certain progressive provisions whole rules undemocratic unconstitutional regressive say social media perfect contrary broken requires large scale reforms need conducted transparency towards establishing statutory framework safeguards every day ordinary indians use social media increased frequency every aspect lives believe happen rules must withdrawn energy focussed towards extensive consultations lead statutory basis instilling regulation focuses transparency accountability social media companies rules today run risk becoming shotgun legislation quick sudden without precision towards addressing issue targeted intervention something disproportionately stifling effect digital rights indian citizens important documents information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledxwwisfrxkkqkbajxfopiyxviewuspsharing deep dive intermediaries rules antidemocratic unconstitutional linkhttpsinternetfreedominintermediariesrules iffs letter meity regarding certain aspects information technology intermediary guidelines digital media ethics code rules linkhttpsdrivegooglecomfiledelhskhdmdltwterefciisiyuauviewuspsharing ",
    "cleaned_title": "wrote ministry electronics making case withdrawal new rules",
    "cleaned_selftext": "ampxb tldr weve written meity making case withdrawal new rules reason simple bad outweighs good rules fail comply basic principles regulation respect human rights set international bodies progressive regulations absolutely must exist new rules simply unconstitutional believe way move towards regulatory framework actually safeguards rights indian users first priority withdraw rules ampxb rules good information technology guidelines intermediaries digital media ethics code rules notified february th httpegazettenicinwritereaddatapdf rules lay antidemocratic unconstitutional framework regulation online content concerns noted initial analysis concerns demand greater scrutiny rules case especially since stakeholders consultations conducted first proposed dramatic changes made notified time analysis remains objective note positive provisions example mandating provision counternotice rule explaining removal disabling access information data provide notices users accounts suspended information post removed move deepens rights users maintained rules specify need periodic compliance reports furnished every month significant social media intermediaries publishers news current affairs content online curated content respectively provisions ensure mechanisms making large technology firms accountable accessible however achieve real accountability relevant definitions require clear statutory definitions existence vague overbroad law chilling effect freedom speech expression thus would run counter attempts strengthen digital rights citizens light disappointing welcome provisions placed within broader framework progressive regulation still making furnishing notices users publishing periodic compliance reports law good thing greater transparency accountability helps build trust principle apply technology platforms well public authorities find prescribed paradigm one punitive enforcement compliance without necessary statutory protections intermediaries regulatory safeharbours thus even positive provisions end marginally beneficial remaining provisions significantly unwelcome rules bad bits even good parts rule come significant caveats may even implemented effectively unfortunately bad parts may significantly worse extensively analysed various concerns arise respect rules rules antidemocratic unconstitutionalhttpsinternetfreedominintermediariesrules selfregulation read selfcensorship ott sectorhttpsinternetfreedominselfcensorshipandtheendofgoodcontent may look like rules asks meity mib respect ruleshttpsinternetfreedominconstitutionalquestionsagainstunconstitutionalrules know significant harms likely arise consequence rules example part ii rules serious implications freedom speech expression right privacy users internet rule requires social media intermediaries establish grievance redressal mechanism users may complain content grievance officer dispose complaints within days empirical study conducted centre internet society points intermediaries tend overcomply takedown requests limit liability chilling effect free speech expression users rule requires significant social media intermediaries provide messaging services whatsapp enable identification first originator message implement rule entities fingerprint message may defeat endtoend encryption consequence privacy every user compromised investigate crimes committed minisculeminority rule requires significant social media intermediaries develop automated tools censor content efficacy tools doubtful intermediaries collect large amounts data users develop tools violation right privacy users part iii rules grave consequences freedom speech expression digital news media ott platforms right citizens access information rules establish code ethics enforced interdepartmental committee consists officers government interdepartmental committee may recommend ministry information broadcasting block delete modify content published digital news media ott platforms thus central government sole arbiter permissible speech affects publishers fundamental right expression citizens right access differing points view publishers compelled produce content palatable central government notably rule b rw rule permits ministry information broadcasting refer complaints interdepartmental committee also decide upon complaints taking consideration recommendations interdepartmental committee arbitrary ministry information broadcasting becomes judge cause chilling effect speech publishers code ethics mandates ott platforms take consideration indias multiracial multireligious context exercise due caution portraying racial religious group exercise due caution content may blocked interdepartmental committee obligation ott platforms vague chilling effect vague laws nature overbroad cover within ambit unlawful legitimate speech alternative regulatory visions firstly proper legislative mandate act focus online interactions information conduits work user generated content hence rules must also examined context regulatory paradigms intermediary liability integrate digital rights international bodies policy experts called adoptionhttpswwwefforgpressreleasesinternationalcoalitionlaunchesmanilaprinciplesprotectfreedomexpression manilla principles intermediary liabilityhttpswwwmanilaprinciplesorg protect online freedom expression innovation around world principles principle intermediaries shielded law liability third party content principle content must required restricted without order judicial authority principle requests restrictions content must clear unambiguous follow due process principle laws content restriction orders practices must comply tests necessity proportionality principle laws content restriction policies practices must respect due process principle transparency accountability must built laws content restriction policies practices manilla principles attempt provide intermediary liability regime respects human rights disappointing apart arguably principle rules incorporate principles provisions especially respect compliance proportionality tests disappointment greater light fact intermediary guidelines amendment rules also criticised large unalignment principleshttpscisindiaorginternetgovernancefilesdraftrulesandmanilaprinciples rules represented chance right earlier mistakes another regulatory framework fully engaged santa clara principleshttpssantaclaraprinciplesorg state principle companies publish numbers posts removed accounts permanently temporarily suspended due violations content guidelines principle companies provide notice user whose content taken account suspended reason removal suspension principle companies provide meaningful opportunity timely appeal content removal account suspension commend incorporation principles provision aforementioned counternotices rule requirement intermediaries publish periodic compliance reports rules respectively however principle incorporated grievance redressal mechanism specified rules involves contracted timelines responding may lead selfcensorship done understand need robust regulations acknowledge existence certain progressive provisions whole rules undemocratic unconstitutional regressive say social media perfect contrary broken requires large scale reforms need conducted transparency towards establishing statutory framework safeguards every day ordinary indians use social media increased frequency every aspect lives believe happen rules must withdrawn energy focussed towards extensive consultations lead statutory basis instilling regulation focuses transparency accountability social media companies rules today run risk becoming shotgun legislation quick sudden without precision towards addressing issue targeted intervention something disproportionately stifling effect digital rights indian citizens important documents information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledxwwisfrxkkqkbajxfopiyxviewuspsharing deep dive intermediaries rules antidemocratic unconstitutional linkhttpsinternetfreedominintermediariesrules iffs letter meity regarding certain aspects information technology intermediary guidelines digital media ethics code rules linkhttpsdrivegooglecomfiledelhskhdmdltwterefciisiyuauviewuspsharing",
    "cleaned_comments": "rules fail comply basic principles regulation respect human rights set international bodies haayaashtyaag internal maatter presume letter directed spam folder auto deleted considering government hates notion transparency freedom thank much representing us",
    "light_cleaned_title": "We wrote to the Ministry of Electronics and IT making a case for the withdrawal of the new IT Rules",
    "light_cleaned_selftext": "# TL;DR We've written to the MeitY, making a case for the withdrawal of the new IT Rules. The reason is simple: the bad outweighs the good. The Rules fail to comply with basic principles for regulation to respect human rights set by international bodies. Progressive regulations absolutely must exist, but the new IT Rules are simply unconstitutional! We believe that the way to move towards a regulatory framework that will actually safeguards the rights of Indian users as a first priority is to withdraw the Rules.  ## IT Rules: Are they any good? The Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 were [**notified on February 25th, 2021**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). The Rules lay down an anti-democratic and unconstitutional framework for the regulation of online content. These concerns have been noted in our initial analysis. Such concerns demand a greater scrutiny of the Rules than has been the case, especially since no stakeholders consultations have been conducted between when they were first proposed to when dramatic changes were made and then they were notified. At the same time, our analysis remains objective and we do note positive provisions such as, for example, mandating the provision of a counter-notice under rule 4 (8) (a) explaining the removal or disabling access to information or data. It will provide notices to users before their accounts are suspended or information that they post is removed. Such a move deepens the rights of users, and is to be maintained. Rules 4(d) and 18(3) specify the need for periodic compliance reports to be furnished every month by significant social media intermediaries and publishers of news and current affairs content or online curated content respectively. These provisions ensure mechanisms for making large technology firms accountable and accessible. However, to achieve real accountability the relevant definitions require clear statutory definitions. The existence of such a vague and overbroad law will have a chilling effect on the freedom of speech and expression, and thus would run counter to any attempts to strengthen the digital rights of citizens. In this light, it is disappointing that such welcome provisions have not been placed within a broader framework of progressive regulation. Still, making furnishing these notices to users and publishing periodic compliance reports the law is a good thing. Greater transparency and accountability helps build trust. This is a principle that should apply to technology platforms as well as to public authorities. But does it? We find that the prescribed paradigm is one of punitive enforcement of compliance without the necessary statutory protections for intermediaries under regulatory ‘safe-harbours’. Thus, even the positive provisions end up being only marginally beneficial, while the remaining provisions are significantly unwelcome. ## The IT Rules: The Bad Bits Now, even the good parts of the IT Rule come with significant caveats, and may not even be implemented effectively. Unfortunately, the bad parts may be significantly worse. We have extensively analysed various concerns that arise with respect to the IT Rules: how the Rules are [**anti-democratic and unconstitutional**](https://internetfreedom.in/intermediaries-rules-2021/), what [**self-regulation (read self-censorship) in the OTT sector**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/) may look like under the Rules, and our asks of [**MEITY and MIB with respect to the Rules**](https://internetfreedom.in/constitutional-questions-against-unconstitutional-rules/), and so we know the significant harms that are likely to arise as a consequence of the Rules. For example, part II of the Rules has serious implications on the freedom of speech and expression and the right to privacy of users of the internet: 1. Rule 3(2) requires social media intermediaries to establish a grievance redressal mechanism by which users may complain against any content and a grievance officer has to dispose of such complaints within 15 days. An empirical study conducted by the Centre for Internet Society points out that intermediaries tend to over-comply with such takedown requests to limit their liability and this has a chilling effect on free speech and expression of all users. 2. Rule 4(2) requires significant social media intermediaries which provide messaging services (such as Whatsapp) to enable identification of the “first originator” of a message. To implement this rule, entities will have to “fingerprint” each message and this may defeat end-to-end encryption. As a consequence, privacy of every user will be compromised to investigate crimes committed by a miniscule-minority. 3. Rule 4(4) requires significant social media intermediaries to develop automated tools to censor content. While the efficacy of such tools is itself doubtful, intermediaries will collect large amounts of data of users to develop these tools in violation of the Right to Privacy of users. Part III of the Rules will have grave consequences for the freedom of speech and expression of Digital News Media and OTT Platforms, and the right of citizens to have access to information: 1. The Rules establish a Code of Ethics which is enforced by an Inter-Departmental Committee which consists only of officers of the Government. The Inter-Departmental Committee may recommend the Ministry of Information and Broadcasting to block, delete or modify content published by Digital News Media and OTT platforms. Thus, the Central Government is now the sole arbiter of permissible speech. This affects the publisher’s Fundamental Right to Expression and the citizen’s right to access differing points of view because publishers will be compelled to only produce content which is palatable to the Central Government 2. Notably, Rule 14(1)(b) r/w Rule 14(1)(6) permits the Ministry of Information and Broadcasting to refer complaints to an Inter-Departmental Committee and also decide upon those complaints after taking into consideration the recommendations of the Inter-Departmental Committee. This is arbitrary as the Ministry of Information and Broadcasting becomes a ‘judge in its own cause’, and has a chilling effect on speech of the publishers. 3. The Code of Ethics mandates OTT Platforms to “take into consideration India’s multi-racial and multi-religious context” and exercise “due caution” when portraying any racial or religious group. If they do not exercise “due caution” their content may be blocked by the Inter-Departmental Committee. This obligation on OTT Platforms is vague and has a “chilling effect” because vague laws by their very nature, are overbroad and cover within their ambit both unlawful and legitimate speech. ## Alternative regulatory visions Firstly, the proper legislative mandate for the IT Act is to focus on online interactions by information conduits that work with user generated content. Hence, the Rules must also be examined in the context of other regulatory paradigms for intermediary liability that integrate digital rights. [**International bodies and policy experts have called for the adoption**](https://www.eff.org/press/releases/international-coalition-launches-manila-principles-protect-freedom-expression) of the ‘[**Manilla Principles for Intermediary Liability**](https://www.manilaprinciples.org/)’ to protect online freedom of expression and innovation around the world. These principles are: 1. Principle 1: Intermediaries should be shielded by law from liability for third party content 2. Principle 2: Content must not be required to be restricted without an order by a judicial authority 3. Principle 3: Requests for restrictions of content must be clear, be unambiguous, and follow due process 4. Principle 4: Laws and content restriction orders and practices must comply with the tests of necessity and proportionality 5. Principle 5: Laws and content restriction policies and practices must respect due process 6. Principle 6: Transparency and accountability must be built into laws and content restriction policies and practices The Manilla Principles attempt to provide for an intermediary liability regime that respects human rights, and so it is disappointing that, apart from arguably principle 2, the Rules do not incorporate the principles in its provisions, especially with respect to compliance with proportionality tests. Such disappointment is greater in light of the fact that the Intermediary Guidelines (Amendment) Rules, 2018, had also[ **been criticised for “large unalignment” with the Principles**](https://cis-india.org/internet-governance/files/draft-rules-and-manila-principles-1), and so the Rules had represented a chance to right these earlier mistakes. Another regulatory framework that has not been fully engaged with is the ‘[**Santa Clara Principles**](https://santaclaraprinciples.org/)’, which state that: 1. Principle 1: Companies should publish the numbers of posts removed and accounts permanently or temporarily suspended due to violations of their content guidelines. 2. Principle 2: Companies should provide notice to each user whose content is taken down or account is suspended about the reason for the removal or suspension. 3. Principle 3: Companies should provide a meaningful opportunity for timely appeal of any content removal or account suspension. We commend the incorporation of principles 1 and 2, through the provision of the aforementioned counter-notices under Rule 4(8)(a) and the requirement for intermediaries to publish periodic compliance reports under Rules 4(d) and 18(3) respectively. However, principle 3 has not been incorporated, as the grievance redressal mechanism specified by the Rules involves contracted timelines for responding and may lead to self-censorship. ## What should be done While we understand the need for robust regulations and acknowledge the existence of certain progressive provisions, on the whole, the Rules are undemocratic, unconstitutional, and regressive. This is not to say social media is perfect – on the contrary it is broken. It requires large scale reforms that need to be conducted with transparency towards establishing a statutory framework that safeguards every day, ordinary Indians who use social media with increased frequency in every aspect of their lives. We believe for this to happen the Rules must be withdrawn, and energy should be focussed towards extensive consultations that can lead to a statutory basis for instilling regulation that focuses on transparency and accountability from social media companies. The Rules today run the risk of becoming ‘shotgun legislation’: quick, sudden, and without precision towards addressing an issue with a targeted intervention, something which can only have a disproportionately stifling effect on the digital rights of Indian citizens. ### Important Documents 1. Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1XwWIs_26FRXkK6qkB193ajxfOP620iyx/view?usp=sharing)). 2. Deep dive : How the intermediaries rules are anti-democratic and unconstitutional ([**link**](https://internetfreedom.in/intermediaries-rules-2021/)) 3. IFF's Letter to MEITY 'Regarding certain aspects of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021)' ([**link**](https://drive.google.com/file/d/1elhs46khdMd2lTWTE4ReFCIi2s8IYuAU/view?usp=sharing))",
    "light_cleaned_comments": "\" The Rules fail to comply with basic principles for regulation to respect human rights set by international bodies \" Haayaashtyaag Internal Maatter I presume this letter will be directed to the spam folder and auto deleted, considering this government hates the notion of transparency and freedom. Thank you so much for representing us. :)"
}