{
    "id": "1de2beq",
    "title": "IFF’s submission to the UN Human Rights Committee ahead of India’s 4th periodic review | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1de2beq/iffs_submission_to_the_un_human_rights_committee/",
    "selftext": "[https:\\/\\/internetfreedom.in\\/un-periodic-review\\/](https://preview.redd.it/wcaoo14rx36d1.jpg?width=1600&format=pjpg&auto=webp&s=aa21d0656de8379fdd574382e1bb7647e68841e1)\n\n# tl;dr\n\nIndia’s move towards large-scale digitalisation has necessitated a critical look at law and policy instruments governing the space—which commonly appear to be vague, arbitrary, exclusionary, or fail to place human rights at their core. New laws and digital interventions seem to share the lack of public consultations and stakeholder participation. A spike in public-private partnerships across sectors is weakening transparency and accountability mechanisms. The 2019-2024 window is a crucial time for a deep assessment of the state of privacy, dignity, free speech, and several other constitutional guarantees of Indian citizens, their interpretation in Indian courts, and the need for rights-based legislation in the digital sphere. We noted all these concerns and more in our report to the United Nations Human Rights Committee ahead of their 4th periodic review of India.\n\n# Issue-wise analysis as enlisted by the Committee\n\n# An introduction to “Digital India”\n\nAt the outset, we set context for the report by tracing India’s push towards digitalisation in the last five years. Here, we spanned a few themes:\n\n1. **The digital divide:** India suffers from a gaping digital divide, where factors of low literacy and unfamiliarity with emerging technological tools [~can impede~](https://static.internetfreedom.in/improving-internet-access-an-explainer/) many population groups from reaping the benefits of the internet and digital technologies recreationally as well as for better quality of life. This was especially seen during the COVID-19 pandemic, where increased digitalisation and reliance on online tools across sectors like education, labour, and health, forced many to fall through the cracks (see [~here~](https://www.leidenlawblog.nl/articles/a-digital-platform-driven-COVID-19-vaccine-drive-amidst-a-digital-divide-lessons-from-india?ref=static.internetfreedom.in), [~here~](https://thewire.in/education/millions-of-indian-children-affected-by-covid-related-school-closures-digital-divide?ref=static.internetfreedom.in), [~here~](https://www.epw.in/engage/article/how-covid-19-deepened-gender-fault-lines-indias?ref=static.internetfreedom.in)).\n2. **Connectivity:** Recent [~government data~](https://www.trai.gov.in/sites/default/files/QPIR_23042024_0.pdf?ref=static.internetfreedom.in) reveals that 95.66% of total broadband subscribers (wired and wireless) and \\~60% of the Indian population access the internet through their wireless devices (mobiles and dongles). Access to smartphones and internet is lower within women, especially rural women (see [~here~](https://www.gsma.com/r/wp-content/uploads/2022/06/The-Mobile-Gender-Gap-Report-2022.pdf?utm_source=website&utm_medium=download-button&utm_campaign=gender-gap-2022), [~here~](https://www.hindustantimes.com/ht-insight/gender-equality/the-digital-divide-and-is-it-holding-back-women-in-india-101641971745195.html?ref=static.internetfreedom.in), [~here~](https://india.unfpa.org/en/news/stage-has-been-set-gender-equity-digital-india?ref=static.internetfreedom.in)). Read IFF’s [~Connectivity Tracker~](https://internetfreedom.in/tag/connectivitytracker/?ref=static.internetfreedom.in) for more analysis on this issue. Union government’s efforts to enhance connectivity, namely PMGDISHA and BharatNet, [~significantly lag~](https://internetfreedom.in/legislative-brief-2024-budget/?ref=static.internetfreedom.in) behind in fulfilling their targets.\n3. **Data protection law:** The lack of an adequate (or active) data protection law is a big concern. The Digital Personal Data Protection Act (“**DPDPA**”), 2023 was passed and notified in 2023 after a long and winding journey through committees and consultations. Yet, its final version seemed unrecognisable and was never opened up for public scrutiny and consultation. In its present form, the Act [~falls short~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) on many counts.\n4. **Digital India:** Our ‘Digital India’ programme envisions large-scale digitalisation across sectors, which also means large-scale data collection and processing. The programme does not properly address foundational encumbrances like infrastructural capacity, tech-preparedness, and digital divide, and operates without an adequate data protection regime in place. Our concerns around the programme include socio-economic exclusion cast by welfare sector digitalisation, ‘IndiaStack’ and the lack of transparency and accountability within it, and a worrying roll-out of digital public infrastructures.\n\n# Gendered Harms on the Internet\n\nWe noted that persistent incidents of sexual harassment and doxxing have made social media platforms highly unsafe and toxic for women in the last five years, which may lead some of them to disengage from social media altogether. Most notably, the ‘Boiz Locker Room’ incident targeting school-going girls in 2020 (read our analysis [~here~](https://internetfreedom.in/the-internet-shouldnt-be-a-boys-club/?ref=static.internetfreedom.in)) and the Sulli and Bulli Deals incident targeting Muslim women in 2021 (read our analysis [~here~](https://internetfreedom.in/womens-safety-on-the-internet-intersectionality/?ref=static.internetfreedom.in)) point to the prevalent gendered harms online, and lack of adequate action by authorities, and sometimes even platforms. As per a recent Global Witness and IFF [~investigation~](https://internetfreedom.in/report-misogynistic-hate-speech/?ref=static.internetfreedom.in), content that targeted women on the basis of gender (including Islamophobic, racist, and casteist hate), was kept live on YouTube and Koo in both the US and India despite violating companies’ own policies. \n\n# Censorship of Communal Speech Online\n\nWe noted two significant instances. In August 2023, tweets related to a [~video~](https://www.thehindu.com/news/national/muzaffarnagar-slapping-case-sc-directly-criticises-uttar-pradesh-in-case-of-teacher-goading-students-to-slap-muslim-classmate/article67733661.ece?ref=static.internetfreedom.in) showing a school teacher in Muzaffarnagar, Uttar Pradesh instructing students to abuse and physically harm a fellow Muslim student, were [~reportedly~](https://theleaflet.in/the-curious-case-of-censorship-in-the-aftermath-of-muzaffarnagar-viral-video/?ref=static.internetfreedom.in) taken down from X (formerly Twitter) pursuant to orders sent by the Ministry of Information and Broadcasting. When asked, the Ministry denied access to blocking orders, citing the national security exemption under different laws, which we have analysed in depth in [~this post~](https://internetfreedom.in/muzaffarnagar-slapping-incident-censorship/?ref=static.internetfreedom.in). Secondly, in May 2024, an X post by the Bharatiya Janata Party’s Karnataka unit triggered nationwide outrage due to its communal attack on the Indian National Congress. The Karnataka Police, after being [~directed~](https://indianexpress.com/elections/ec-bjp-karnataka-x-post-muslims-9314058/?ref=static.internetfreedom.in) to do so by the Election Commission of India, asked X to take down the controversial post. \n\n# State of Privacy, Data Protection, and Surveillance\n\nIn this section, we summarised issues in relation to the following sub-themes pertaining to data privacy and protection:\n\n1. **The Puttaswamy standard:** We underlined the significance of *Justice (Retd.) K. S. Puttaswamy v. Union of India \\[(2017) 10 SCC 1\\],* or the Puttaswamy judgement—where a nine-judge bench of the Indian Supreme Court unanimously affirmed that the right to privacy is a fundamental right guaranteed under Part III of the Constitution of India, and prescribed the five-pronged Puttaswamy standard that any privacy-infringing measure must meet: (a) existence of a legitimate state interest; (b) suitability (rational nexus between the measure and goal); (c) necessity (least restrictive way of achieving the goal); (d) proportionality *stricto sensu* (balance between the extent of infringement and strength of the goal); (e) the existence of procedural safeguards.\n2. **Weak foundations of Aadhaar:** There is strong evidence from the last decade to suggest that Aadhaar linkage has instead led to exclusion, potential citizen surveillance and profiling, and a range of privacy concerns. While optional on paper, Aadhaar has been thrust upon populations and made mandatory in practice across sectors through the years. In this section, we spanned themes of Aadhaar integration in public and private sectors and lawfulness thereof, and the long list of vulnerabilities of Aadhaar data and inadequacy of state response thereto.\n3. **An inadequate data protection law:** As noted above, we expanded on the [~shortcomings~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) of the present DPDPA, 2023.\n4. **Surveillance through CMS:** The Centralised Monitoring System (“**CMS**”) enables state e-surveillance and monitoring of text messages, social-media engagement, and phone calls on landlines and cell phones, among other communications, which severely jeopardises privacy. We [~explored~](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/?ref=static.internetfreedom.in) how CMS does not meet transparency and accountability standards.\n\n# State of Free Speech in India\n\n1. **The right to peaceful protests:** Indian citizens have the fundamental right to protest, drawing from the right to free speech and expression i.e. Article 19(1)(a) and freedom of peaceful assembly i.e. Article 19(1)(b) of the constitution. While this right is not absolute and can be limited by reasonable restrictions, such restrictions must be necessary, proportionate, and follow procedures established by law. We noted many instances of digital repression (by censorship and internet shutdowns) and protest surveillance, which have a chilling effect on this right without meeting necessity or proportionality standards.\n2. **Internet shutdowns:** As India emerged as the country with the highest number of internet shutdowns in 2023, we trace our five-year history of such suspensions, exploring the statutory basis for internet shutdowns in India and the compliance mandate laid down in *Anuradha Bhasin v. Union of India \\[AIR 2020 SC 1308\\].* We studied how shutdowns play out in practice with a focus on human rights violations associated with cutting off access to digital resources and briefly highlight an [~ongoing~](https://internetfreedom.in/gauhati-hc-internet-shutdown-rules-update?ref=static.internetfreedom.in) challenge to the validity of the legal instrument legitimising internet shutdowns. \n3. **Digital censorship:** Over the last five years, we have seen concerning trends in online content blocking, website blocking, and social media account blocking, and how judicial interpretation of existing legal provisions giving the government powers to censor do not remedy the situation vastly. We also noted that existing online censorship practice in India falls afoul of prevailing legal norms, specifically the precedent set by the Supreme Court in *Shreya Singhal v. Union Of India, \\[AIR 2015 SC 1523\\].* We reiterated our [~concerns~](https://internetfreedom.in/comments-on-the-broadcasting-bill-2023/?ref=static.internetfreedom.in) on the Broadcasting Services (Regulation) Bill, 2023 and new attacks on journalistic expression and creative freedom. \n4. **Deficiencies in the IT Rules:** Platforms are governed in India through a network of laws, including three notable amendments to the Information Technology (“**IT**”) Act, 2000. These are the IT (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, Amendment Rules, 2022 to the IT Rules, 2021, and Amendment Rules, 2023 to the IT Rules, 2021. We charted their regulatory mechanisms and impact on free speech online, covering the arbitrary content blocking and takedown powers they confer and their misguided attempt to tackle “misinformation” by mandating Grievance Appellate Committees (read our analysis [~here~](https://internetfreedom.in/we-wrote-to-the-gac-seeking-answers/?ref=static.internetfreedom.in)) or setting up state-backed Fact-Check Units (read our response [~here~](https://internetfreedom.in/statement-on-the-notification-of-the-it-amendment-rules-2023/?ref=static.internetfreedom.in)). \n5. **Threats to end-to-end encryption:** India’s intent to build backdoors to end-to-end encrypted platforms for access to law enforcement agencies presents an undemocratic and unconstitutional framework for the regulation of online content. We traced the mandate of Rule 4(2) of the IT Rules, 2021, which can require messaging services (such as WhatsApp) to enable identification of the “first originator” of a message, the Cyber Security Directions issued by Indian Computer Emergency Response Team which can require VPNs and other specified entities to maintain logs for up to five years, and the new Telecommunications Act, 2023.\n6. **Press harassment and intimidation:** We noted the alarming use of spyware or threats of use of spyware by state authorities on the devices of journalists, researchers and opposition leaders, which reportedly happened at least twice in these five years. The [~lax response~](https://internetfreedom.in/pegasus-2-months-on-still-no-investigation/?ref=static.internetfreedom.in) of Indian authorities to Pegasus and allegations of [~planted evidence~](https://www.accessnow.org/india-malware/?ref=static.internetfreedom.in) during criminal proceedings against human rights defenders was deafening, but [~was also seen~](https://internetfreedom.in/a-worm-in-the-apple-iff-writes-to-cert-in-as-it-begins-probe-into-apples-state-sponsored-attack-notification/?ref=static.internetfreedom.in) when Apple, Inc. recently sent threat notifications to journalists and opposition leaders about potential state-sponsored attack on their devices.\n7. **Sedition:** In the past five years, there has been a notable misuse of Section 124-A of the Indian Penal Code, 1860 which criminalises the vague offence of ‘sedition.’ We noted the recurrent FIRs filed under the provision even as the Supreme Court, while hearing a pending challenge to the constitutional validity of Section 124-A, has issued a historic order suspending all pending trials, appeals, and proceedings under it until the law is re-examined. \n\nThis is a (very) concise summary of our report to the UNHRC ahead of their 4th periodic human rights review of India. We thank the Committee for undertaking this significant and timely exercise and giving civil society organisations like IFF the opportunity to draw from their work and provide diverse perspectives to the process.\n\nLink to our full submission: [https://content.internetfreedom.in/api/files/divco3ywedt9rpe/jtep0okt85ag03w/iff\\_s\\_written\\_contribution\\_to\\_unhrc\\_periodic\\_review\\_rWcAcYyWv6.pdf](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/jtep0okt85ag03w/iff_s_written_contribution_to_unhrc_periodic_review_rWcAcYyWv6.pdf)\n\nHelp us watch the watchmen: [Donate Now](https://static.internetfreedom.in/donate).",
    "flair": "Policy/Economy",
    "score": 7,
    "num_comments": 0,
    "created_utc": 1718183790.0,
    "convurl": "https://a.thumbs.redditmedia.com/ACE45QWot1p7dRE5IAz5lYd9i742vBp1mNceyu5Evx0.jpg",
    "comments": [],
    "cleaned_text": "iffs submission un human rights committee ahead indias th periodic review internet freedom foundation httpsinternetfreedominunperiodicreviewhttpspreviewredditwcaoorxdjpgwidthformatpjpgautowebpsaaddefddebbee tldr indias move towards largescale digitalisation necessitated critical look law policy instruments governing spacewhich commonly appear vague arbitrary exclusionary fail place human rights core new laws digital interventions seem share lack public consultations stakeholder participation spike publicprivate partnerships across sectors weakening transparency accountability mechanisms window crucial time deep assessment state privacy dignity free speech several constitutional guarantees indian citizens interpretation indian courts need rightsbased legislation digital sphere noted concerns report united nations human rights committee ahead th periodic review india issuewise analysis enlisted committee introduction digital india outset set context report tracing indias push towards digitalisation last five years spanned themes digital divide india suffers gaping digital divide factors low literacy unfamiliarity emerging technological tools impedehttpsstaticinternetfreedominimprovinginternetaccessanexplainer many population groups reaping benefits internet digital technologies recreationally well better quality life especially seen covid pandemic increased digitalisation reliance online tools across sectors like education labour health forced many fall cracks see herehttpswwwleidenlawblognlarticlesadigitalplatformdrivencovidvaccinedriveamidstadigitaldividelessonsfromindiarefstaticinternetfreedomin herehttpsthewireineducationmillionsofindianchildrenaffectedbycovidrelatedschoolclosuresdigitaldividerefstaticinternetfreedomin herehttpswwwepwinengagearticlehowcoviddeepenedgenderfaultlinesindiasrefstaticinternetfreedomin connectivity recent government datahttpswwwtraigovinsitesdefaultfilesqpirpdfrefstaticinternetfreedomin reveals total broadband subscribers wired wireless indian population access internet wireless devices mobiles dongles access smartphones internet lower within women especially rural women see herehttpswwwgsmacomrwpcontentuploadsthemobilegendergapreportpdfutmsourcewebsiteutmmediumdownloadbuttonutmcampaigngendergap herehttpswwwhindustantimescomhtinsightgenderequalitythedigitaldivideandisitholdingbackwomeninindiahtmlrefstaticinternetfreedomin herehttpsindiaunfpaorgennewsstagehasbeensetgenderequitydigitalindiarefstaticinternetfreedomin read iffs connectivity trackerhttpsinternetfreedomintagconnectivitytrackerrefstaticinternetfreedomin analysis issue union governments efforts enhance connectivity namely pmgdisha bharatnet significantly laghttpsinternetfreedominlegislativebriefbudgetrefstaticinternetfreedomin behind fulfilling targets data protection law lack adequate active data protection law big concern digital personal data protection act dpdpa passed notified long winding journey committees consultations yet final version seemed unrecognisable never opened public scrutiny consultation present form act falls shorthttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin many counts digital india digital india programme envisions largescale digitalisation across sectors also means largescale data collection processing programme properly address foundational encumbrances like infrastructural capacity techpreparedness digital divide operates without adequate data protection regime place concerns around programme include socioeconomic exclusion cast welfare sector digitalisation indiastack lack transparency accountability within worrying rollout digital public infrastructures gendered harms internet noted persistent incidents sexual harassment doxxing made social media platforms highly unsafe toxic women last five years may lead disengage social media altogether notably boiz locker room incident targeting schoolgoing girls read analysis herehttpsinternetfreedomintheinternetshouldntbeaboysclubrefstaticinternetfreedomin sulli bulli deals incident targeting muslim women read analysis herehttpsinternetfreedominwomenssafetyontheinternetintersectionalityrefstaticinternetfreedomin point prevalent gendered harms online lack adequate action authorities sometimes even platforms per recent global witness iff investigationhttpsinternetfreedominreportmisogynistichatespeechrefstaticinternetfreedomin content targeted women basis gender including islamophobic racist casteist hate kept live youtube koo us india despite violating companies policies censorship communal speech online noted two significant instances august tweets related videohttpswwwthehinducomnewsnationalmuzaffarnagarslappingcasescdirectlycriticisesuttarpradeshincaseofteachergoadingstudentstoslapmuslimclassmatearticleecerefstaticinternetfreedomin showing school teacher muzaffarnagar uttar pradesh instructing students abuse physically harm fellow muslim student reportedlyhttpstheleafletinthecuriouscaseofcensorshipintheaftermathofmuzaffarnagarviralvideorefstaticinternetfreedomin taken x formerly twitter pursuant orders sent ministry information broadcasting asked ministry denied access blocking orders citing national security exemption different laws analysed depth posthttpsinternetfreedominmuzaffarnagarslappingincidentcensorshiprefstaticinternetfreedomin secondly may x post bharatiya janata partys karnataka unit triggered nationwide outrage due communal attack indian national congress karnataka police directedhttpsindianexpresscomelectionsecbjpkarnatakaxpostmuslimsrefstaticinternetfreedomin election commission india asked x take controversial post state privacy data protection surveillance section summarised issues relation following subthemes pertaining data privacy protection puttaswamy standard underlined significance justice retd k puttaswamy v union india scc puttaswamy judgementwhere ninejudge bench indian supreme court unanimously affirmed right privacy fundamental right guaranteed part iii constitution india prescribed fivepronged puttaswamy standard privacyinfringing measure must meet existence legitimate state interest b suitability rational nexus measure goal c necessity least restrictive way achieving goal proportionality stricto sensu balance extent infringement strength goal e existence procedural safeguards weak foundations aadhaar strong evidence last decade suggest aadhaar linkage instead led exclusion potential citizen surveillance profiling range privacy concerns optional paper aadhaar thrust upon populations made mandatory practice across sectors years section spanned themes aadhaar integration public private sectors lawfulness thereof long list vulnerabilities aadhaar data inadequacy state response thereto inadequate data protection law noted expanded shortcomingshttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin present dpdpa surveillance cms centralised monitoring system cms enables state esurveillance monitoring text messages socialmedia engagement phone calls landlines cell phones among communications severely jeopardises privacy exploredhttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystemrefstaticinternetfreedomin cms meet transparency accountability standards state free speech india right peaceful protests indian citizens fundamental right protest drawing right free speech expression ie article freedom peaceful assembly ie article b constitution right absolute limited reasonable restrictions restrictions must necessary proportionate follow procedures established law noted many instances digital repression censorship internet shutdowns protest surveillance chilling effect right without meeting necessity proportionality standards internet shutdowns india emerged country highest number internet shutdowns trace fiveyear history suspensions exploring statutory basis internet shutdowns india compliance mandate laid anuradha bhasin v union india air sc studied shutdowns play practice focus human rights violations associated cutting access digital resources briefly highlight ongoinghttpsinternetfreedomingauhatihcinternetshutdownrulesupdaterefstaticinternetfreedomin challenge validity legal instrument legitimising internet shutdowns digital censorship last five years seen concerning trends online content blocking website blocking social media account blocking judicial interpretation existing legal provisions giving government powers censor remedy situation vastly also noted existing online censorship practice india falls afoul prevailing legal norms specifically precedent set supreme court shreya singhal v union india air sc reiterated concernshttpsinternetfreedomincommentsonthebroadcastingbillrefstaticinternetfreedomin broadcasting services regulation bill new attacks journalistic expression creative freedom deficiencies rules platforms governed india network laws including three notable amendments information technology act intermediary guidelines digital media ethics code rules amendment rules rules amendment rules rules charted regulatory mechanisms impact free speech online covering arbitrary content blocking takedown powers confer misguided attempt tackle misinformation mandating grievance appellate committees read analysis herehttpsinternetfreedominwewrotetothegacseekinganswersrefstaticinternetfreedomin setting statebacked factcheck units read response herehttpsinternetfreedominstatementonthenotificationoftheitamendmentrulesrefstaticinternetfreedomin threats endtoend encryption indias intent build backdoors endtoend encrypted platforms access law enforcement agencies presents undemocratic unconstitutional framework regulation online content traced mandate rule rules require messaging services whatsapp enable identification first originator message cyber security directions issued indian computer emergency response team require vpns specified entities maintain logs five years new telecommunications act press harassment intimidation noted alarming use spyware threats use spyware state authorities devices journalists researchers opposition leaders reportedly happened least twice five years lax responsehttpsinternetfreedominpegasusmonthsonstillnoinvestigationrefstaticinternetfreedomin indian authorities pegasus allegations planted evidencehttpswwwaccessnoworgindiamalwarerefstaticinternetfreedomin criminal proceedings human rights defenders deafening also seenhttpsinternetfreedominawormintheappleiffwritestocertinasitbeginsprobeintoapplesstatesponsoredattacknotificationrefstaticinternetfreedomin apple inc recently sent threat notifications journalists opposition leaders potential statesponsored attack devices sedition past five years notable misuse section indian penal code criminalises vague offence sedition noted recurrent firs filed provision even supreme court hearing pending challenge constitutional validity section issued historic order suspending pending trials appeals proceedings law reexamined concise summary report unhrc ahead th periodic human rights review india thank committee undertaking significant timely exercise giving civil society organisations like iff opportunity draw work provide diverse perspectives process link full submission httpscontentinternetfreedominapifilesdivcoywedtrpejtepoktagwiffswrittencontributiontounhrcperiodicreviewrwcacyywvpdfhttpscontentinternetfreedominapifilesdivcoywedtrpejtepoktagwiffswrittencontributiontounhrcperiodicreviewrwcacyywvpdf help us watch watchmen donate nowhttpsstaticinternetfreedomindonate ",
    "cleaned_title": "iffs submission un human rights committee ahead indias th periodic review internet freedom foundation",
    "cleaned_selftext": "httpsinternetfreedominunperiodicreviewhttpspreviewredditwcaoorxdjpgwidthformatpjpgautowebpsaaddefddebbee tldr indias move towards largescale digitalisation necessitated critical look law policy instruments governing spacewhich commonly appear vague arbitrary exclusionary fail place human rights core new laws digital interventions seem share lack public consultations stakeholder participation spike publicprivate partnerships across sectors weakening transparency accountability mechanisms window crucial time deep assessment state privacy dignity free speech several constitutional guarantees indian citizens interpretation indian courts need rightsbased legislation digital sphere noted concerns report united nations human rights committee ahead th periodic review india issuewise analysis enlisted committee introduction digital india outset set context report tracing indias push towards digitalisation last five years spanned themes digital divide india suffers gaping digital divide factors low literacy unfamiliarity emerging technological tools impedehttpsstaticinternetfreedominimprovinginternetaccessanexplainer many population groups reaping benefits internet digital technologies recreationally well better quality life especially seen covid pandemic increased digitalisation reliance online tools across sectors like education labour health forced many fall cracks see herehttpswwwleidenlawblognlarticlesadigitalplatformdrivencovidvaccinedriveamidstadigitaldividelessonsfromindiarefstaticinternetfreedomin herehttpsthewireineducationmillionsofindianchildrenaffectedbycovidrelatedschoolclosuresdigitaldividerefstaticinternetfreedomin herehttpswwwepwinengagearticlehowcoviddeepenedgenderfaultlinesindiasrefstaticinternetfreedomin connectivity recent government datahttpswwwtraigovinsitesdefaultfilesqpirpdfrefstaticinternetfreedomin reveals total broadband subscribers wired wireless indian population access internet wireless devices mobiles dongles access smartphones internet lower within women especially rural women see herehttpswwwgsmacomrwpcontentuploadsthemobilegendergapreportpdfutmsourcewebsiteutmmediumdownloadbuttonutmcampaigngendergap herehttpswwwhindustantimescomhtinsightgenderequalitythedigitaldivideandisitholdingbackwomeninindiahtmlrefstaticinternetfreedomin herehttpsindiaunfpaorgennewsstagehasbeensetgenderequitydigitalindiarefstaticinternetfreedomin read iffs connectivity trackerhttpsinternetfreedomintagconnectivitytrackerrefstaticinternetfreedomin analysis issue union governments efforts enhance connectivity namely pmgdisha bharatnet significantly laghttpsinternetfreedominlegislativebriefbudgetrefstaticinternetfreedomin behind fulfilling targets data protection law lack adequate active data protection law big concern digital personal data protection act dpdpa passed notified long winding journey committees consultations yet final version seemed unrecognisable never opened public scrutiny consultation present form act falls shorthttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin many counts digital india digital india programme envisions largescale digitalisation across sectors also means largescale data collection processing programme properly address foundational encumbrances like infrastructural capacity techpreparedness digital divide operates without adequate data protection regime place concerns around programme include socioeconomic exclusion cast welfare sector digitalisation indiastack lack transparency accountability within worrying rollout digital public infrastructures gendered harms internet noted persistent incidents sexual harassment doxxing made social media platforms highly unsafe toxic women last five years may lead disengage social media altogether notably boiz locker room incident targeting schoolgoing girls read analysis herehttpsinternetfreedomintheinternetshouldntbeaboysclubrefstaticinternetfreedomin sulli bulli deals incident targeting muslim women read analysis herehttpsinternetfreedominwomenssafetyontheinternetintersectionalityrefstaticinternetfreedomin point prevalent gendered harms online lack adequate action authorities sometimes even platforms per recent global witness iff investigationhttpsinternetfreedominreportmisogynistichatespeechrefstaticinternetfreedomin content targeted women basis gender including islamophobic racist casteist hate kept live youtube koo us india despite violating companies policies censorship communal speech online noted two significant instances august tweets related videohttpswwwthehinducomnewsnationalmuzaffarnagarslappingcasescdirectlycriticisesuttarpradeshincaseofteachergoadingstudentstoslapmuslimclassmatearticleecerefstaticinternetfreedomin showing school teacher muzaffarnagar uttar pradesh instructing students abuse physically harm fellow muslim student reportedlyhttpstheleafletinthecuriouscaseofcensorshipintheaftermathofmuzaffarnagarviralvideorefstaticinternetfreedomin taken x formerly twitter pursuant orders sent ministry information broadcasting asked ministry denied access blocking orders citing national security exemption different laws analysed depth posthttpsinternetfreedominmuzaffarnagarslappingincidentcensorshiprefstaticinternetfreedomin secondly may x post bharatiya janata partys karnataka unit triggered nationwide outrage due communal attack indian national congress karnataka police directedhttpsindianexpresscomelectionsecbjpkarnatakaxpostmuslimsrefstaticinternetfreedomin election commission india asked x take controversial post state privacy data protection surveillance section summarised issues relation following subthemes pertaining data privacy protection puttaswamy standard underlined significance justice retd k puttaswamy v union india scc puttaswamy judgementwhere ninejudge bench indian supreme court unanimously affirmed right privacy fundamental right guaranteed part iii constitution india prescribed fivepronged puttaswamy standard privacyinfringing measure must meet existence legitimate state interest b suitability rational nexus measure goal c necessity least restrictive way achieving goal proportionality stricto sensu balance extent infringement strength goal e existence procedural safeguards weak foundations aadhaar strong evidence last decade suggest aadhaar linkage instead led exclusion potential citizen surveillance profiling range privacy concerns optional paper aadhaar thrust upon populations made mandatory practice across sectors years section spanned themes aadhaar integration public private sectors lawfulness thereof long list vulnerabilities aadhaar data inadequacy state response thereto inadequate data protection law noted expanded shortcomingshttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin present dpdpa surveillance cms centralised monitoring system cms enables state esurveillance monitoring text messages socialmedia engagement phone calls landlines cell phones among communications severely jeopardises privacy exploredhttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystemrefstaticinternetfreedomin cms meet transparency accountability standards state free speech india right peaceful protests indian citizens fundamental right protest drawing right free speech expression ie article freedom peaceful assembly ie article b constitution right absolute limited reasonable restrictions restrictions must necessary proportionate follow procedures established law noted many instances digital repression censorship internet shutdowns protest surveillance chilling effect right without meeting necessity proportionality standards internet shutdowns india emerged country highest number internet shutdowns trace fiveyear history suspensions exploring statutory basis internet shutdowns india compliance mandate laid anuradha bhasin v union india air sc studied shutdowns play practice focus human rights violations associated cutting access digital resources briefly highlight ongoinghttpsinternetfreedomingauhatihcinternetshutdownrulesupdaterefstaticinternetfreedomin challenge validity legal instrument legitimising internet shutdowns digital censorship last five years seen concerning trends online content blocking website blocking social media account blocking judicial interpretation existing legal provisions giving government powers censor remedy situation vastly also noted existing online censorship practice india falls afoul prevailing legal norms specifically precedent set supreme court shreya singhal v union india air sc reiterated concernshttpsinternetfreedomincommentsonthebroadcastingbillrefstaticinternetfreedomin broadcasting services regulation bill new attacks journalistic expression creative freedom deficiencies rules platforms governed india network laws including three notable amendments information technology act intermediary guidelines digital media ethics code rules amendment rules rules amendment rules rules charted regulatory mechanisms impact free speech online covering arbitrary content blocking takedown powers confer misguided attempt tackle misinformation mandating grievance appellate committees read analysis herehttpsinternetfreedominwewrotetothegacseekinganswersrefstaticinternetfreedomin setting statebacked factcheck units read response herehttpsinternetfreedominstatementonthenotificationoftheitamendmentrulesrefstaticinternetfreedomin threats endtoend encryption indias intent build backdoors endtoend encrypted platforms access law enforcement agencies presents undemocratic unconstitutional framework regulation online content traced mandate rule rules require messaging services whatsapp enable identification first originator message cyber security directions issued indian computer emergency response team require vpns specified entities maintain logs five years new telecommunications act press harassment intimidation noted alarming use spyware threats use spyware state authorities devices journalists researchers opposition leaders reportedly happened least twice five years lax responsehttpsinternetfreedominpegasusmonthsonstillnoinvestigationrefstaticinternetfreedomin indian authorities pegasus allegations planted evidencehttpswwwaccessnoworgindiamalwarerefstaticinternetfreedomin criminal proceedings human rights defenders deafening also seenhttpsinternetfreedominawormintheappleiffwritestocertinasitbeginsprobeintoapplesstatesponsoredattacknotificationrefstaticinternetfreedomin apple inc recently sent threat notifications journalists opposition leaders potential statesponsored attack devices sedition past five years notable misuse section indian penal code criminalises vague offence sedition noted recurrent firs filed provision even supreme court hearing pending challenge constitutional validity section issued historic order suspending pending trials appeals proceedings law reexamined concise summary report unhrc ahead th periodic human rights review india thank committee undertaking significant timely exercise giving civil society organisations like iff opportunity draw work provide diverse perspectives process link full submission httpscontentinternetfreedominapifilesdivcoywedtrpejtepoktagwiffswrittencontributiontounhrcperiodicreviewrwcacyywvpdfhttpscontentinternetfreedominapifilesdivcoywedtrpejtepoktagwiffswrittencontributiontounhrcperiodicreviewrwcacyywvpdf help us watch watchmen donate nowhttpsstaticinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF’s submission to the UN Human Rights Committee ahead of India’s 4th periodic review | Internet Freedom Foundation",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/un-periodic-review\\/](https://preview.redd.it/wcaoo14rx36d1.jpg?width=1600&format=pjpg&auto=webp&s=aa21d0656de8379fdd574382e1bb7647e68841e1) # tl;dr India’s move towards large-scale digitalisation has necessitated a critical look at law and policy instruments governing the space—which commonly appear to be vague, arbitrary, exclusionary, or fail to place human rights at their core. New laws and digital interventions seem to share the lack of public consultations and stakeholder participation. A spike in public-private partnerships across sectors is weakening transparency and accountability mechanisms. The 2019-2024 window is a crucial time for a deep assessment of the state of privacy, dignity, free speech, and several other constitutional guarantees of Indian citizens, their interpretation in Indian courts, and the need for rights-based legislation in the digital sphere. We noted all these concerns and more in our report to the United Nations Human Rights Committee ahead of their 4th periodic review of India. # Issue-wise analysis as enlisted by the Committee # An introduction to “Digital India” At the outset, we set context for the report by tracing India’s push towards digitalisation in the last five years. Here, we spanned a few themes: 1. **The digital divide:** India suffers from a gaping digital divide, where factors of low literacy and unfamiliarity with emerging technological tools [~can impede~](https://static.internetfreedom.in/improving-internet-access-an-explainer/) many population groups from reaping the benefits of the internet and digital technologies recreationally as well as for better quality of life. This was especially seen during the COVID-19 pandemic, where increased digitalisation and reliance on online tools across sectors like education, labour, and health, forced many to fall through the cracks (see [~here~](https://www.leidenlawblog.nl/articles/a-digital-platform-driven-COVID-19-vaccine-drive-amidst-a-digital-divide-lessons-from-india?ref=static.internetfreedom.in), [~here~](https://thewire.in/education/millions-of-indian-children-affected-by-covid-related-school-closures-digital-divide?ref=static.internetfreedom.in), [~here~](https://www.epw.in/engage/article/how-covid-19-deepened-gender-fault-lines-indias?ref=static.internetfreedom.in)). 2. **Connectivity:** Recent [~government data~](https://www.trai.gov.in/sites/default/files/QPIR_23042024_0.pdf?ref=static.internetfreedom.in) reveals that 95.66% of total broadband subscribers (wired and wireless) and \\~60% of the Indian population access the internet through their wireless devices (mobiles and dongles). Access to smartphones and internet is lower within women, especially rural women (see [~here~](https://www.gsma.com/r/wp-content/uploads/2022/06/The-Mobile-Gender-Gap-Report-2022.pdf?utm_source=website&utm_medium=download-button&utm_campaign=gender-gap-2022), [~here~](https://www.hindustantimes.com/ht-insight/gender-equality/the-digital-divide-and-is-it-holding-back-women-in-india-101641971745195.html?ref=static.internetfreedom.in), [~here~](https://india.unfpa.org/en/news/stage-has-been-set-gender-equity-digital-india?ref=static.internetfreedom.in)). Read IFF’s [~Connectivity Tracker~](https://internetfreedom.in/tag/connectivitytracker/?ref=static.internetfreedom.in) for more analysis on this issue. Union government’s efforts to enhance connectivity, namely PMGDISHA and BharatNet, [~significantly lag~](https://internetfreedom.in/legislative-brief-2024-budget/?ref=static.internetfreedom.in) behind in fulfilling their targets. 3. **Data protection law:** The lack of an adequate (or active) data protection law is a big concern. The Digital Personal Data Protection Act (“**DPDPA**”), 2023 was passed and notified in 2023 after a long and winding journey through committees and consultations. Yet, its final version seemed unrecognisable and was never opened up for public scrutiny and consultation. In its present form, the Act [~falls short~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) on many counts. 4. **Digital India:** Our ‘Digital India’ programme envisions large-scale digitalisation across sectors, which also means large-scale data collection and processing. The programme does not properly address foundational encumbrances like infrastructural capacity, tech-preparedness, and digital divide, and operates without an adequate data protection regime in place. Our concerns around the programme include socio-economic exclusion cast by welfare sector digitalisation, ‘IndiaStack’ and the lack of transparency and accountability within it, and a worrying roll-out of digital public infrastructures. # Gendered Harms on the Internet We noted that persistent incidents of sexual harassment and doxxing have made social media platforms highly unsafe and toxic for women in the last five years, which may lead some of them to disengage from social media altogether. Most notably, the ‘Boiz Locker Room’ incident targeting school-going girls in 2020 (read our analysis [~here~](https://internetfreedom.in/the-internet-shouldnt-be-a-boys-club/?ref=static.internetfreedom.in)) and the Sulli and Bulli Deals incident targeting Muslim women in 2021 (read our analysis [~here~](https://internetfreedom.in/womens-safety-on-the-internet-intersectionality/?ref=static.internetfreedom.in)) point to the prevalent gendered harms online, and lack of adequate action by authorities, and sometimes even platforms. As per a recent Global Witness and IFF [~investigation~](https://internetfreedom.in/report-misogynistic-hate-speech/?ref=static.internetfreedom.in), content that targeted women on the basis of gender (including Islamophobic, racist, and casteist hate), was kept live on YouTube and Koo in both the US and India despite violating companies’ own policies. # Censorship of Communal Speech Online We noted two significant instances. In August 2023, tweets related to a [~video~](https://www.thehindu.com/news/national/muzaffarnagar-slapping-case-sc-directly-criticises-uttar-pradesh-in-case-of-teacher-goading-students-to-slap-muslim-classmate/article67733661.ece?ref=static.internetfreedom.in) showing a school teacher in Muzaffarnagar, Uttar Pradesh instructing students to abuse and physically harm a fellow Muslim student, were [~reportedly~](https://theleaflet.in/the-curious-case-of-censorship-in-the-aftermath-of-muzaffarnagar-viral-video/?ref=static.internetfreedom.in) taken down from X (formerly Twitter) pursuant to orders sent by the Ministry of Information and Broadcasting. When asked, the Ministry denied access to blocking orders, citing the national security exemption under different laws, which we have analysed in depth in [~this post~](https://internetfreedom.in/muzaffarnagar-slapping-incident-censorship/?ref=static.internetfreedom.in). Secondly, in May 2024, an X post by the Bharatiya Janata Party’s Karnataka unit triggered nationwide outrage due to its communal attack on the Indian National Congress. The Karnataka Police, after being [~directed~](https://indianexpress.com/elections/ec-bjp-karnataka-x-post-muslims-9314058/?ref=static.internetfreedom.in) to do so by the Election Commission of India, asked X to take down the controversial post. # State of Privacy, Data Protection, and Surveillance In this section, we summarised issues in relation to the following sub-themes pertaining to data privacy and protection: 1. **The Puttaswamy standard:** We underlined the significance of *Justice (Retd.) K. S. Puttaswamy v. Union of India \\[(2017) 10 SCC 1\\],* or the Puttaswamy judgement—where a nine-judge bench of the Indian Supreme Court unanimously affirmed that the right to privacy is a fundamental right guaranteed under Part III of the Constitution of India, and prescribed the five-pronged Puttaswamy standard that any privacy-infringing measure must meet: (a) existence of a legitimate state interest; (b) suitability (rational nexus between the measure and goal); (c) necessity (least restrictive way of achieving the goal); (d) proportionality *stricto sensu* (balance between the extent of infringement and strength of the goal); (e) the existence of procedural safeguards. 2. **Weak foundations of Aadhaar:** There is strong evidence from the last decade to suggest that Aadhaar linkage has instead led to exclusion, potential citizen surveillance and profiling, and a range of privacy concerns. While optional on paper, Aadhaar has been thrust upon populations and made mandatory in practice across sectors through the years. In this section, we spanned themes of Aadhaar integration in public and private sectors and lawfulness thereof, and the long list of vulnerabilities of Aadhaar data and inadequacy of state response thereto. 3. **An inadequate data protection law:** As noted above, we expanded on the [~shortcomings~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) of the present DPDPA, 2023. 4. **Surveillance through CMS:** The Centralised Monitoring System (“**CMS**”) enables state e-surveillance and monitoring of text messages, social-media engagement, and phone calls on landlines and cell phones, among other communications, which severely jeopardises privacy. We [~explored~](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/?ref=static.internetfreedom.in) how CMS does not meet transparency and accountability standards. # State of Free Speech in India 1. **The right to peaceful protests:** Indian citizens have the fundamental right to protest, drawing from the right to free speech and expression i.e. Article 19(1)(a) and freedom of peaceful assembly i.e. Article 19(1)(b) of the constitution. While this right is not absolute and can be limited by reasonable restrictions, such restrictions must be necessary, proportionate, and follow procedures established by law. We noted many instances of digital repression (by censorship and internet shutdowns) and protest surveillance, which have a chilling effect on this right without meeting necessity or proportionality standards. 2. **Internet shutdowns:** As India emerged as the country with the highest number of internet shutdowns in 2023, we trace our five-year history of such suspensions, exploring the statutory basis for internet shutdowns in India and the compliance mandate laid down in *Anuradha Bhasin v. Union of India \\[AIR 2020 SC 1308\\].* We studied how shutdowns play out in practice with a focus on human rights violations associated with cutting off access to digital resources and briefly highlight an [~ongoing~](https://internetfreedom.in/gauhati-hc-internet-shutdown-rules-update?ref=static.internetfreedom.in) challenge to the validity of the legal instrument legitimising internet shutdowns. 3. **Digital censorship:** Over the last five years, we have seen concerning trends in online content blocking, website blocking, and social media account blocking, and how judicial interpretation of existing legal provisions giving the government powers to censor do not remedy the situation vastly. We also noted that existing online censorship practice in India falls afoul of prevailing legal norms, specifically the precedent set by the Supreme Court in *Shreya Singhal v. Union Of India, \\[AIR 2015 SC 1523\\].* We reiterated our [~concerns~](https://internetfreedom.in/comments-on-the-broadcasting-bill-2023/?ref=static.internetfreedom.in) on the Broadcasting Services (Regulation) Bill, 2023 and new attacks on journalistic expression and creative freedom. 4. **Deficiencies in the IT Rules:** Platforms are governed in India through a network of laws, including three notable amendments to the Information Technology (“**IT**”) Act, 2000. These are the IT (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, Amendment Rules, 2022 to the IT Rules, 2021, and Amendment Rules, 2023 to the IT Rules, 2021. We charted their regulatory mechanisms and impact on free speech online, covering the arbitrary content blocking and takedown powers they confer and their misguided attempt to tackle “misinformation” by mandating Grievance Appellate Committees (read our analysis [~here~](https://internetfreedom.in/we-wrote-to-the-gac-seeking-answers/?ref=static.internetfreedom.in)) or setting up state-backed Fact-Check Units (read our response [~here~](https://internetfreedom.in/statement-on-the-notification-of-the-it-amendment-rules-2023/?ref=static.internetfreedom.in)). 5. **Threats to end-to-end encryption:** India’s intent to build backdoors to end-to-end encrypted platforms for access to law enforcement agencies presents an undemocratic and unconstitutional framework for the regulation of online content. We traced the mandate of Rule 4(2) of the IT Rules, 2021, which can require messaging services (such as WhatsApp) to enable identification of the “first originator” of a message, the Cyber Security Directions issued by Indian Computer Emergency Response Team which can require VPNs and other specified entities to maintain logs for up to five years, and the new Telecommunications Act, 2023. 6. **Press harassment and intimidation:** We noted the alarming use of spyware or threats of use of spyware by state authorities on the devices of journalists, researchers and opposition leaders, which reportedly happened at least twice in these five years. The [~lax response~](https://internetfreedom.in/pegasus-2-months-on-still-no-investigation/?ref=static.internetfreedom.in) of Indian authorities to Pegasus and allegations of [~planted evidence~](https://www.accessnow.org/india-malware/?ref=static.internetfreedom.in) during criminal proceedings against human rights defenders was deafening, but [~was also seen~](https://internetfreedom.in/a-worm-in-the-apple-iff-writes-to-cert-in-as-it-begins-probe-into-apples-state-sponsored-attack-notification/?ref=static.internetfreedom.in) when Apple, Inc. recently sent threat notifications to journalists and opposition leaders about potential state-sponsored attack on their devices. 7. **Sedition:** In the past five years, there has been a notable misuse of Section 124-A of the Indian Penal Code, 1860 which criminalises the vague offence of ‘sedition.’ We noted the recurrent FIRs filed under the provision even as the Supreme Court, while hearing a pending challenge to the constitutional validity of Section 124-A, has issued a historic order suspending all pending trials, appeals, and proceedings under it until the law is re-examined. This is a (very) concise summary of our report to the UNHRC ahead of their 4th periodic human rights review of India. We thank the Committee for undertaking this significant and timely exercise and giving civil society organisations like IFF the opportunity to draw from their work and provide diverse perspectives to the process. Link to our full submission: [https://content.internetfreedom.in/api/files/divco3ywedt9rpe/jtep0okt85ag03w/iff\\_s\\_written\\_contribution\\_to\\_unhrc\\_periodic\\_review\\_rWcAcYyWv6.pdf](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/jtep0okt85ag03w/iff_s_written_contribution_to_unhrc_periodic_review_rWcAcYyWv6.pdf) Help us watch the watchmen: [Donate Now](https://static.internetfreedom.in/donate).",
    "light_cleaned_comments": ""
}