{
    "id": "1bxm3d2",
    "title": "Monkey Man by Dev Patel - A rant ",
    "url": "https://www.reddit.com/r/india/comments/1bxm3d2/monkey_man_by_dev_patel_a_rant/",
    "selftext": "https://www.indiewire.com/news/analysis/monkey-man-india-censorship-battle-1234971356/\n\nI was excited to watch this movie since the trailer came out and I'd been counting down days until it was released only to find out that it's been delayed. Whats worse is it may not even be shown in the big screens at all.\n\nAm I the only one who's frustrated? This was supposed to be our representation in Hollywood. A chance to finally be someone other than the nerdy tech support guy or the comic relief who's only purpose is to be called 'samosa' or 'curry'. Dev Patel made this movie for us. He wrote, directed, produced and starred in a movie which has been his passion project for ten years only for the very people who he made it for, to rebuke it. Oh the irony. This man broke his bones making this movie for us. He could've chosen anything else but he wanted it show our culture. He wanted for people like us to be seen on the big screen. And now that may not even happen at all.\n\nIt's just cinema. It's a form of art. Nothing about it is meant to be offensive/ 'too violent.' We know what this movie is about. And it's R rated for a reason. No one's going to be surprised by the violence or gore. We expect it. Whats the point of the movie without it? And will there be anything left in it at all for us to watch, if they censor every element that makes it what it is? \n\nDev himself has spoken proudly about his culture, the inspiration from Lord Hanuman, the beauty of Indian cinema etc in all his interviews. A lot of people were learning about us through his interviews and he had nothing but praise and love for our culture. This was not made to offend anyone. It was meant to represent us and make way for more indian heroes for the world to see. And instead of encouraging and appreciating it we're throwing it away. \n\nHonestly I'm just annoyed man. Idek sigh. And I mean this with a good heart. I love good Indian rep in cinema. I was just excited for this only to be let down😭. I hope the board will just allow us to see this. The movie has gotten nothing but praise and we deserve to experience this on the big screen.",
    "flair": "Rant / Vent",
    "score": 10,
    "num_comments": 5,
    "created_utc": 1712437157.0,
    "convurl": "https://external-preview.redd.it/tVVOTff03pVFSFVl0rZEOtbyZ2H-GVgzUDdNPBOFUZU.jpg?auto=webp&s=72f0277ac39d9ce691c1761e9b6ffbd5e2d3364c",
    "comments": [
        "That is really unfortunate. I just got home from watching this and I had a great time. I really liked it, I loved the background score choice. Dev Patel did an incredible job and if this is what his directorial debut looks like, I cant wait to see what his future projects are going to look like. \n\nWithout giving away too much, I just want to say that I'm SO HAPPY about some the casting choices made in this movie.",
        "I dont think he made this movie for \"us\". There have been multiple movies and series where indians have more meaty role than what they get(tech support and shit)  especially in a last few years. But nothing changed, what makes you think this movie would change?\n\nPeople watch Movies to be entertained i dont think that a stereotype over a race could be eradicated with a film.\n\nAlso it is R rated, so if it releases anyhow it would get chopped left right and centre. So better wait for ott release.",
        "ayyy good for you, glad the movie is living up to its hype \nhopefully we get to see it soon",
        "maybe but it's definitely to represent us better don't you think? he's clearly stated that he wants to see Indians as heroes in films with much more character depth to them \n\nand yeah ofc it's not gonna be some revolutionary difference, but as an Indian it's just nice to see have like our own john wick-ish film and you feel more connected to it as opposed to just watching white people \n\nyeah tru that though😭sad might just have to wait another two months for OTT release",
        "Netflix shit itself as well. \n\nhttps://www.yahoo.com/entertainment/monkey-man-went-netflix-roadkill-130000609.htm\n\nThe independent feature was bought for $30 million during production by Netflix, which then dropped the film without giving a clear reason why. People familiar with the film say its political undertones may have spooked the streamer. Suddenly orphaned, “Monkey Man” was headed to festivals to seek a buyer when director Jordan Peele saw it and convinced Universal Pictures to buy and distribute the movie.\n\n“Monkey Man” is now getting the large theatrical exhibition that it probably should have always had in the first place. Universal estimates it will take in $12 million this weekend headed for a “John Wick”-style audience, more than the $9 million it paid for the film."
    ],
    "cleaned_text": "monkey man dev patel rant excited watch movie since trailer came id counting days released find delayed whats worse may even shown big screens one whos frustrated supposed representation hollywood chance finally someone nerdy tech support guy comic relief whos purpose called samosa curry dev patel made movie us wrote directed produced starred movie passion project ten years people made rebuke oh irony man broke bones making movie us couldve chosen anything else wanted show culture wanted people like us seen big screen may even happen cinema form art nothing meant offensive violent know movie r rated reason ones going surprised violence gore expect whats point movie without anything left us watch censor every element makes dev spoken proudly culture inspiration lord hanuman beauty indian cinema etc interviews lot people learning us interviews nothing praise love culture made offend anyone meant represent us make way indian heroes world see instead encouraging appreciating throwing away honestly im annoyed man idek sigh mean good heart love good indian rep cinema excited let hope board allow us see movie gotten nothing praise deserve experience big screen ",
    "cleaned_title": "monkey man dev patel rant",
    "cleaned_selftext": "excited watch movie since trailer came id counting days released find delayed whats worse may even shown big screens one whos frustrated supposed representation hollywood chance finally someone nerdy tech support guy comic relief whos purpose called samosa curry dev patel made movie us wrote directed produced starred movie passion project ten years people made rebuke oh irony man broke bones making movie us couldve chosen anything else wanted show culture wanted people like us seen big screen may even happen cinema form art nothing meant offensive violent know movie r rated reason ones going surprised violence gore expect whats point movie without anything left us watch censor every element makes dev spoken proudly culture inspiration lord hanuman beauty indian cinema etc interviews lot people learning us interviews nothing praise love culture made offend anyone meant represent us make way indian heroes world see instead encouraging appreciating throwing away honestly im annoyed man idek sigh mean good heart love good indian rep cinema excited let hope board allow us see movie gotten nothing praise deserve experience big screen",
    "cleaned_comments": "really unfortunate got home watching great time really liked loved background score choice dev patel incredible job directorial debut looks like cant wait see future projects going look like without giving away much want say im happy casting choices made movie dont think made movie us multiple movies series indians meaty role gettech support shit especially last years nothing changed makes think movie would change people watch movies entertained dont think stereotype race could eradicated film also r rated releases anyhow would get chopped left right centre better wait ott release ayyy good glad movie living hype hopefully get see soon maybe definitely represent us better dont think hes clearly stated wants see indians heroes films much character depth yeah ofc gon na revolutionary difference indian nice see like john wickish film feel connected opposed watching white people yeah tru thoughsad might wait another two months ott release netflix shit well independent feature bought million production netflix dropped film without giving clear reason people familiar film say political undertones may spooked streamer suddenly orphaned monkey man headed festivals seek buyer director jordan peele saw convinced universal pictures buy distribute movie monkey man getting large theatrical exhibition probably always first place universal estimates take million weekend headed john wickstyle audience million paid film",
    "light_cleaned_title": "Monkey Man by Dev Patel - A rant",
    "light_cleaned_selftext": "I was excited to watch this movie since the trailer came out and I'd been counting down days until it was released only to find out that it's been delayed. Whats worse is it may not even be shown in the big screens at all. Am I the only one who's frustrated? This was supposed to be our representation in Hollywood. A chance to finally be someone other than the nerdy tech support guy or the comic relief who's only purpose is to be called 'samosa' or 'curry'. Dev Patel made this movie for us. He wrote, directed, produced and starred in a movie which has been his passion project for ten years only for the very people who he made it for, to rebuke it. Oh the irony. This man broke his bones making this movie for us. He could've chosen anything else but he wanted it show our culture. He wanted for people like us to be seen on the big screen. And now that may not even happen at all. It's just cinema. It's a form of art. Nothing about it is meant to be offensive/ 'too violent.' We know what this movie is about. And it's R rated for a reason. No one's going to be surprised by the violence or gore. We expect it. Whats the point of the movie without it? And will there be anything left in it at all for us to watch, if they censor every element that makes it what it is? Dev himself has spoken proudly about his culture, the inspiration from Lord Hanuman, the beauty of Indian cinema etc in all his interviews. A lot of people were learning about us through his interviews and he had nothing but praise and love for our culture. This was not made to offend anyone. It was meant to represent us and make way for more indian heroes for the world to see. And instead of encouraging and appreciating it we're throwing it away. Honestly I'm just annoyed man. Idek sigh. And I mean this with a good heart. I love good Indian rep in cinema. I was just excited for this only to be let down😭. I hope the board will just allow us to see this. The movie has gotten nothing but praise and we deserve to experience this on the big screen.",
    "light_cleaned_comments": "That is really unfortunate. I just got home from watching this and I had a great time. I really liked it, I loved the background score choice. Dev Patel did an incredible job and if this is what his directorial debut looks like, I cant wait to see what his future projects are going to look like. Without giving away too much, I just want to say that I'm SO HAPPY about some the casting choices made in this movie. I dont think he made this movie for \"us\". There have been multiple movies and series where indians have more meaty role than what they get(tech support and shit) especially in a last few years. But nothing changed, what makes you think this movie would change? People watch Movies to be entertained i dont think that a stereotype over a race could be eradicated with a film. Also it is R rated, so if it releases anyhow it would get chopped left right and centre. So better wait for ott release. ayyy good for you, glad the movie is living up to its hype hopefully we get to see it soon maybe but it's definitely to represent us better don't you think? he's clearly stated that he wants to see Indians as heroes in films with much more character depth to them and yeah ofc it's not gonna be some revolutionary difference, but as an Indian it's just nice to see have like our own john wick-ish film and you feel more connected to it as opposed to just watching white people yeah tru that though😭sad might just have to wait another two months for OTT release Netflix shit itself as well. The independent feature was bought for $30 million during production by Netflix, which then dropped the film without giving a clear reason why. People familiar with the film say its political undertones may have spooked the streamer. Suddenly orphaned, “Monkey Man” was headed to festivals to seek a buyer when director Jordan Peele saw it and convinced Universal Pictures to buy and distribute the movie. “Monkey Man” is now getting the large theatrical exhibition that it probably should have always had in the first place. Universal estimates it will take in $12 million this weekend headed for a “John Wick”-style audience, more than the $9 million it paid for the film."
}