{
    "id": "15okg8c",
    "title": "Should we start taxing agricultural income like every other income?",
    "url": "https://www.reddit.com/r/india/comments/15okg8c/should_we_start_taxing_agricultural_income_like/",
    "selftext": "https://timesofindia.indiatimes.com/readersblog/freeview/why-agricultural-income-is-tax-free-in-india-without-any-limit-4810/\n\nAgricultural income earned by a taxpayer in India is exempt under Section 10(1) of the Income Tax Act,1961. What is more shocking and surprising is that this so-called agricultural income is tax-free without any limit. You can have an unlimited amount of agricultural income without paying even a single rupee towards income tax.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691787363.0,
    "convurl": "https://external-preview.redd.it/dmCbZGuUb6XxGth8fWKDFRcVZUFAeVC-zbJh81tCuVo.jpg",
    "comments": [
        "Do it for those where agriculture income is based on big farmlands under big corporates. Surely they make big incomes with it.\n\nOther than that I think it's not a good idea. Already people are leaving agriculture as occupation and selling their lands resulting in concretization. Instead agriculture should be promoted, better agriculture equipment should be made available for everyone with affordable subsidies.",
        "You as an individual don't pay IT if you're earning less than 7lpa. Beyond that just tax them, no need to create special laws or check for commercial farms vs individual farms",
        "Agreed, but my only concern is the narrative that it sets. We have farmers suicides, farmers not getting price for their crop, not being able to buy required equipments even after the subsidies. All these parameters don't make it suitable for a person to keep farming, they will prefer to sell their land or set up some other profitable business on those lands. And adding tax narrative only adds woes to the current mindset of farming as a profession. \n\nIt's just like NRC CAA no matter how much you claim it doesn't affect or discriminate Indian Muslims, but the environment that you have created for them in your regime is not helping them to take your words for it. \n\nSo upliftment of the weaker section should be the first priority.",
        ">And adding tax narrative only adds woes to the current mindset of farming as a profession. \n\nAgreed. But it's just a narrative in reality they wouldn't be paying taxes if they're poor.   \n  \n\n\n>It's just like NRC CAA no matter how much you claim it doesn't affect or discriminate Indian Muslims, but the environment that you have created for them in your regime is not helping them to take your words for it.\n\nYeah thats a good comparison"
    ],
    "cleaned_text": "start taxing agricultural income like every income agricultural income earned taxpayer india exempt section income tax act shocking surprising socalled agricultural income taxfree without limit unlimited amount agricultural income without paying even single rupee towards income tax ",
    "cleaned_title": "start taxing agricultural income like every income",
    "cleaned_selftext": "agricultural income earned taxpayer india exempt section income tax act shocking surprising socalled agricultural income taxfree without limit unlimited amount agricultural income without paying even single rupee towards income tax",
    "cleaned_comments": "agriculture income based big farmlands big corporates surely make big incomes think good idea already people leaving agriculture occupation selling lands resulting concretization instead agriculture promoted better agriculture equipment made available everyone affordable subsidies individual dont pay youre earning less lpa beyond tax need create special laws check commercial farms vs individual farms agreed concern narrative sets farmers suicides farmers getting price crop able buy required equipments even subsidies parameters dont make suitable person keep farming prefer sell land set profitable business lands adding tax narrative adds woes current mindset farming profession like nrc caa matter much claim doesnt affect discriminate indian muslims environment created regime helping take words upliftment weaker section first priority adding tax narrative adds woes current mindset farming profession agreed narrative reality wouldnt paying taxes theyre poor like nrc caa matter much claim doesnt affect discriminate indian muslims environment created regime helping take words yeah thats good comparison",
    "light_cleaned_title": "Should we start taxing agricultural income like every other income?",
    "light_cleaned_selftext": "Agricultural income earned by a taxpayer in India is exempt under Section 10(1) of the Income Tax Act,1961. What is more shocking and surprising is that this so-called agricultural income is tax-free without any limit. You can have an unlimited amount of agricultural income without paying even a single rupee towards income tax.",
    "light_cleaned_comments": "Do it for those where agriculture income is based on big farmlands under big corporates. Surely they make big incomes with it. Other than that I think it's not a good idea. Already people are leaving agriculture as occupation and selling their lands resulting in concretization. Instead agriculture should be promoted, better agriculture equipment should be made available for everyone with affordable subsidies. You as an individual don't pay IT if you're earning less than 7lpa. Beyond that just tax them, no need to create special laws or check for commercial farms vs individual farms Agreed, but my only concern is the narrative that it sets. We have farmers suicides, farmers not getting price for their crop, not being able to buy required equipments even after the subsidies. All these parameters don't make it suitable for a person to keep farming, they will prefer to sell their land or set up some other profitable business on those lands. And adding tax narrative only adds woes to the current mindset of farming as a profession. It's just like NRC CAA no matter how much you claim it doesn't affect or discriminate Indian Muslims, but the environment that you have created for them in your regime is not helping them to take your words for it. So upliftment of the weaker section should be the first priority. >And adding tax narrative only adds woes to the current mindset of farming as a profession. Agreed. But it's just a narrative in reality they wouldn't be paying taxes if they're poor. >It's just like NRC CAA no matter how much you claim it doesn't affect or discriminate Indian Muslims, but the environment that you have created for them in your regime is not helping them to take your words for it. Yeah thats a good comparison"
}