{
    "id": "152k7o6",
    "title": "Advice about higher education: which course to join?",
    "url": "https://www.reddit.com/r/india/comments/152k7o6/advice_about_higher_education_which_course_to_join/",
    "selftext": "Hi everyone, \n\nI am a working professional from India. I applied to multiple master's program a few months back and have received admits from a couple of programs. These are:\n\n1. MS in Data Science and AI from Saarland University, Germany (https://saarland-informatics-campus.de/en/studium-studies/data-science-and-artificial-intelligence-master/) \n\n2. M.Eng in AI from University of Bologna, Italy (https://corsi.unibo.it/2cycle/artificial-intelligence)\n\nFor people who have some idea about these courses: Could you rate the above mentioned courses in the following areas:\n\n1. Research Opportunities\n2. Employer Reputation (Quality of Placements) \n3. The quality of the teaching faculty. \n4. Life in Germany vs Italy considering I'm a non-EU student who doesn't know both the languages. \n5. Course and University reputation around the world. \n6. Which program will be better for a lot of AI research? \n\nThanks for your time and efforts. Appreciate it.\n\nmy_qualifications : I'm already accepted to both these universities and done documentation for both. Just need to finally apply for Visa.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689643270.0,
    "convurl": "https://external-preview.redd.it/u3W4xSkby1DxoTyQQpmH18tHoYTAD0nnjdGLr7mXCp8.jpg?auto=webp&s=59a98c0d61754648320eceaed68732c0a5042d64",
    "comments": [
        "> For people who have some idea about these courses: Could you rate the above mentioned courses in the following areas:\n\nI'm not very knowledgeable about European universities, as I studies in the States, but a good way to rate courses is to look at the faculty and funding\n\nSee how much funding these depts get, what kind of research the faculty have been doing. There are also websites where you can find student feedback for professors.\n\nAs for quality of placements, look up former students of these courses on LinkedIn, see where they work. You can even try PM-ing them for their experience and advice.\n\nI would presume Germany is more immigrant friendly. No matter which course you end up choosing, I would strongly suggest learning the language before you get there.\n\nI learned German in college and dabbled a bit in Italian otherwise. I would say German is much easier to learn, as it just feels like reskinned English.",
        "Thanks, great points, will do my research before taking a decision."
    ],
    "cleaned_text": "advice higher education course join hi everyone working professional india applied multiple masters program months back received admits couple programs ms data science ai saarland university germany httpssaarlandinformaticscampusdeenstudiumstudiesdatascienceandartificialintelligencemaster meng ai university bologna italy httpscorsiuniboitcycleartificialintelligence people idea courses could rate mentioned courses following areas research opportunities employer reputation quality placements quality teaching faculty life germany vs italy considering im noneu student doesnt know languages course university reputation around world program better lot ai research thanks time efforts appreciate myqualifications im already accepted universities done documentation need finally apply visa ",
    "cleaned_title": "advice higher education course join",
    "cleaned_selftext": "hi everyone working professional india applied multiple masters program months back received admits couple programs ms data science ai saarland university germany httpssaarlandinformaticscampusdeenstudiumstudiesdatascienceandartificialintelligencemaster meng ai university bologna italy httpscorsiuniboitcycleartificialintelligence people idea courses could rate mentioned courses following areas research opportunities employer reputation quality placements quality teaching faculty life germany vs italy considering im noneu student doesnt know languages course university reputation around world program better lot ai research thanks time efforts appreciate myqualifications im already accepted universities done documentation need finally apply visa",
    "cleaned_comments": "people idea courses could rate mentioned courses following areas im knowledgeable european universities studies states good way rate courses look faculty funding see much funding depts get kind research faculty also websites find student feedback professors quality placements look former students courses linkedin see work even try pming experience advice would presume germany immigrant friendly matter course end choosing would strongly suggest learning language get learned german college dabbled bit italian otherwise would say german much easier learn feels like reskinned english thanks great points research taking decision",
    "light_cleaned_title": "Advice about higher education: which course to join?",
    "light_cleaned_selftext": "Hi everyone, I am a working professional from India. I applied to multiple master's program a few months back and have received admits from a couple of programs. These are: 1. MS in Data Science and AI from Saarland University, Germany (https://saarland-informatics-campus.de/en/studium-studies/data-science-and-artificial-intelligence-master/) 2. M.Eng in AI from University of Bologna, Italy (https://corsi.unibo.it/2cycle/artificial-intelligence) For people who have some idea about these courses: Could you rate the above mentioned courses in the following areas: 1. Research Opportunities 2. Employer Reputation (Quality of Placements) 3. The quality of the teaching faculty. 4. Life in Germany vs Italy considering I'm a non-EU student who doesn't know both the languages. 5. Course and University reputation around the world. 6. Which program will be better for a lot of AI research? Thanks for your time and efforts. Appreciate it. my_qualifications : I'm already accepted to both these universities and done documentation for both. Just need to finally apply for Visa.",
    "light_cleaned_comments": "> For people who have some idea about these courses: Could you rate the above mentioned courses in the following areas: I'm not very knowledgeable about European universities, as I studies in the States, but a good way to rate courses is to look at the faculty and funding See how much funding these depts get, what kind of research the faculty have been doing. There are also websites where you can find student feedback for professors. As for quality of placements, look up former students of these courses on LinkedIn, see where they work. You can even try PM-ing them for their experience and advice. I would presume Germany is more immigrant friendly. No matter which course you end up choosing, I would strongly suggest learning the language before you get there. I learned German in college and dabbled a bit in Italian otherwise. I would say German is much easier to learn, as it just feels like reskinned English. Thanks, great points, will do my research before taking a decision."
}