{
    "id": "13sc5j5",
    "title": "NDTV: Two UPSC Candidates, One Rank, One Roll Number: A Madhya Pradesh Mystery",
    "url": "https://www.ndtv.com/india-news/two-upsc-candidates-one-rank-one-roll-number-a-madhya-pradesh-mystery-4066088",
    "selftext": "Another Vyapam in the making?",
    "flair": "Politics",
    "score": 101,
    "num_comments": 16,
    "created_utc": 1685104855.0,
    "convurl": "https://external-preview.redd.it/dAzEk06PGFbUn6unfmw__Cb3PjhqZ59t1v4zvx3tWfM.jpg?auto=webp&v=enabled&s=fa3166e79a37a11f6fdbdf7550843232c30c552c",
    "comments": [
        "What d f?",
        "They named the file pressrelease.pdf?",
        "Govt job hai bhai.",
        "What's wrong there, my fellow Antarctican?",
        "What's wrong?",
        "Don't tell me they figured out a way to fudge even the UPSC exams.",
        "how will they keep track of their press releases lol.",
        "From the press release\n\n  \n\n\nMs. Aysha Makrani d/o Shri Salimmuddin Makrani, who is claiming her final recommendation by the UPSC, is found to have forged the documents in her favour. Her actual Roll Number is 7805064. She appeared in the Preliminary Examination held on 5th June, 2022 and scored only 22.22 marks in General Studies Paper-I and 21.09 marks in General Studies Paper-II. As per the requirement of Examination Rules, she was required to score at least 66 marks in Paper-II. She has not only failed to qualify in Paper-II but scored far less marks than the cut-off marks of Paper-I, which were 88.22 for unreserved category for the Preliminary Examination of the year 2022. Hence, Ms. Aysha Makrani has failed at the stage of the Preliminary Examination itself and could not move further in next stages of the Examination. On the other hand, Ms. Ayasha Fatima d/o Shri Naziruddin, bearing Roll Number 7811744, is the genuine candidate, who has been recommended by the UPSC, securing 184th rank in the final result of the Civil Services Examination, 2022.",
        "Nope. The girl forged her documents. She hadn't even qualified the preliminary exam.",
        "Date of press release.",
        "How did it even escalate to this level lol. \n\n>Moreover, Ms Fatima's card has a watermark of UPSC with a QR code, while Ms Makrani's card resembles a printout on plain paper without any QR code.\n\nSo just a rando scammer. If I make a farzi printout I can get some 10minutes of fame on newspapers and social media, and can pester UPSC to waste time on me? Even without raising this drama Makrani wasn't going to be allowed past the gate, so she raised a fuss entirely for fame.\n\n>Sources in the UPSC told NDTV that they had made the necessary corrections and that Ms Fatima was the correct candidate. They also said that they would investigate how such an error occurred.\n\nwtf is to correct, what error lmao.(This paragraph in article is wrong, see bottom)\n\nFrom the UPSC press release:\n\n>The  system  of  the  UPSC  is  robust  as  well  as  foolproof  and  such  errors  are not  possible.\n\nwhat a statement from UPSC to be proven wrong one day.\n\n>By  doing  so  both  Ms.  Aysha  Makrani  and  Shri  Tushar  have  acted  in contravention  of  the  provisions  of  the  Rules  of  the  Civil  Services Examination,  2022 ***...*** the  UPSC  is  contemplating  both  criminal  as  well  as disciplinary  penal  action  against  both  candidates  for  their  fraudulent  acts. \n\nFk around and find out.\n\n>The  above  cases  have  been  reported  in  the  electronic/print  media  widely. One  of  such  media  channels  has  irresponsibly  reported  that  the  UPSC  has corrected  its  mistake  in  one  of  the  above  two  cases  and  investigating  the matter  as  to  how  such  error  has  happened.  Many  other  media  channels  and social  media  portals  have  also  carried  the  news  without  any  verification. This  is  unprofessional  on  the  part  of  the  said  media  channel. It  is  expected  of  the  media  channels  that  they  verify  the genuineness  of  such  claims  from  the  UPSC  before  broadcasting/publishing news  of  such  fake  claims  through  their  print/media  channels. \n\nActually nice call out on the state of Dalli media.",
        "The file is named press release.pdf. Next they upload a press release, it will overwrite this one.",
        "I was wondering how anyone could be stupid enough to try to lie their way into UPSC. Then I read this:\n\n>\tHe appeared in the Preliminary Examination and scored minus 22.89 (i.e. -22.89) marks in General Studies Paper-I and 44.73 marks in General Studies Paper-II.",
        "Well I was expecting pdfs to be named with their date and probably the file number or something."
    ],
    "cleaned_text": "ndtv two upsc candidates one rank one roll number madhya pradesh mystery another vyapam making ",
    "cleaned_title": "ndtv two upsc candidates one rank one roll number madhya pradesh mystery",
    "cleaned_selftext": "another vyapam making",
    "cleaned_comments": "f named file pressreleasepdf govt job hai bhai whats wrong fellow antarctican whats wrong dont tell figured way fudge even upsc exams keep track press releases lol press release ms aysha makrani shri salimmuddin makrani claiming final recommendation upsc found forged documents favour actual roll number appeared preliminary examination held th june scored marks general studies paperi marks general studies paperii per requirement examination rules required score least marks paperii failed qualify paperii scored far less marks cutoff marks paperi unreserved category preliminary examination year hence ms aysha makrani failed stage preliminary examination could move next stages examination hand ms ayasha fatima shri naziruddin bearing roll number genuine candidate recommended upsc securing th rank final result civil services examination nope girl forged documents hadnt even qualified preliminary exam date press release even escalate level lol moreover ms fatimas card watermark upsc qr code ms makranis card resembles printout plain paper without qr code rando scammer make farzi printout get minutes fame newspapers social media pester upsc waste time even without raising drama makrani wasnt going allowed past gate raised fuss entirely fame sources upsc told ndtv made necessary corrections ms fatima correct candidate also said would investigate error occurred wtf correct error lmaothis paragraph article wrong see bottom upsc press release system upsc robust well foolproof errors possible statement upsc proven wrong one day ms aysha makrani shri tushar acted contravention provisions rules civil services examination upsc contemplating criminal well disciplinary penal action candidates fraudulent acts fk around find cases reported electronicprint media widely one media channels irresponsibly reported upsc corrected mistake one two cases investigating matter error happened many media channels social media portals also carried news without verification unprofessional part said media channel expected media channels verify genuineness claims upsc broadcastingpublishing news fake claims printmedia channels actually nice call state dalli media file named press releasepdf next upload press release overwrite one wondering anyone could stupid enough try lie way upsc read appeared preliminary examination scored minus ie marks general studies paperi marks general studies paperii well expecting pdfs named date probably file number something",
    "light_cleaned_title": "NDTV: Two UPSC Candidates, One Rank, One Roll Number: A Madhya Pradesh Mystery",
    "light_cleaned_selftext": "Another Vyapam in the making?",
    "light_cleaned_comments": "What d f? They named the file pressrelease.pdf? Govt job hai bhai. What's wrong there, my fellow Antarctican? What's wrong? Don't tell me they figured out a way to fudge even the UPSC exams. how will they keep track of their press releases lol. From the press release Ms. Aysha Makrani d/o Shri Salimmuddin Makrani, who is claiming her final recommendation by the UPSC, is found to have forged the documents in her favour. Her actual Roll Number is 7805064. She appeared in the Preliminary Examination held on 5th June, 2022 and scored only 22.22 marks in General Studies Paper-I and 21.09 marks in General Studies Paper-II. As per the requirement of Examination Rules, she was required to score at least 66 marks in Paper-II. She has not only failed to qualify in Paper-II but scored far less marks than the cut-off marks of Paper-I, which were 88.22 for unreserved category for the Preliminary Examination of the year 2022. Hence, Ms. Aysha Makrani has failed at the stage of the Preliminary Examination itself and could not move further in next stages of the Examination. On the other hand, Ms. Ayasha Fatima d/o Shri Naziruddin, bearing Roll Number 7811744, is the genuine candidate, who has been recommended by the UPSC, securing 184th rank in the final result of the Civil Services Examination, 2022. Nope. The girl forged her documents. She hadn't even qualified the preliminary exam. Date of press release. How did it even escalate to this level lol. >Moreover, Ms Fatima's card has a watermark of UPSC with a QR code, while Ms Makrani's card resembles a printout on plain paper without any QR code. So just a rando scammer. If I make a farzi printout I can get some 10minutes of fame on newspapers and social media, and can pester UPSC to waste time on me? Even without raising this drama Makrani wasn't going to be allowed past the gate, so she raised a fuss entirely for fame. >Sources in the UPSC told NDTV that they had made the necessary corrections and that Ms Fatima was the correct candidate. They also said that they would investigate how such an error occurred. wtf is to correct, what error lmao.(This paragraph in article is wrong, see bottom) From the UPSC press release: >The system of the UPSC is robust as well as foolproof and such errors are not possible. what a statement from UPSC to be proven wrong one day. >By doing so both Ms. Aysha Makrani and Shri Tushar have acted in contravention of the provisions of the Rules of the Civil Services Examination, 2022 ***...*** the UPSC is contemplating both criminal as well as disciplinary penal action against both candidates for their fraudulent acts. Fk around and find out. >The above cases have been reported in the electronic/print media widely. One of such media channels has irresponsibly reported that the UPSC has corrected its mistake in one of the above two cases and investigating the matter as to how such error has happened. Many other media channels and social media portals have also carried the news without any verification. This is unprofessional on the part of the said media channel. It is expected of the media channels that they verify the genuineness of such claims from the UPSC before broadcasting/publishing news of such fake claims through their print/media channels. Actually nice call out on the state of Dalli media. The file is named press release.pdf. Next they upload a press release, it will overwrite this one. I was wondering how anyone could be stupid enough to try to lie their way into UPSC. Then I read this: > He appeared in the Preliminary Examination and scored minus 22.89 (i.e. -22.89) marks in General Studies Paper-I and 44.73 marks in General Studies Paper-II. Well I was expecting pdfs to be named with their date and probably the file number or something."
}