{
    "id": "1h51nb7",
    "title": "Urgent Donation Appeal: A Life in Crisis",
    "url": "https://www.reddit.com/gallery/1h51nb7",
    "selftext": "Hi everyone, I see this community is helping a lot of people. I work in a village called Sagroli and there’s a primary school teacher whose wife is suffering from Leukaemia. She’s admitted in Tata Memorial Hospital and needs a bone marrow transplant to stay alive. This teacher is still here working hard so he can make some money. He has exhausted all his savings on the treatment till now. They have two small children: Krushna is 7th grade and Gayatri is 9th grade. I met both the children as well. Please help this family if you can. The patient is still 38 years of age and it’s horrible what has happened to her. I got their fundraiser verified on Ketto and he now has some hopes from it. \nDonate whatever little you can: https://www.ketto.org/fundraiser/my-wife-is-fighting-for-her-life-and-we-need-your-support-to-save-her-964970?utm_source=external_Ketto&utm_medium=google-search&utm_campaign=S14_1000_SALE_Brand_KY_ALL_CLK_IND&utm_term=e_ketto&utm_content=medical_resp_ad2&utm_placement=KT01_AG_1865_BrandSeed_Pure",
    "flair": "Rant / Vent",
    "score": 438,
    "num_comments": 68,
    "created_utc": 1733163500.0,
    "convurl": "https://i.redd.it/1y7s9mel8h4e1.jpg",
    "comments": [
        "He seems to be the most needy, donated.",
        "He really is, he has got nothing to fall back to.",
        "Tried to help with my capacity. ❤️",
        "Thank you so much friend. God really bless you!",
        "Nothing much but a duty as human.",
        "I hope you get the help nice work as always 👍",
        "Thank you so much friend. 🙏",
        "cfbr",
        "Thank you friend. 🙏",
        "My mother is battling cancer too and I see patients related to bone marrow and blood cancer every day. It’s heartbreaking and costly. Donated with whatever I can afford at the moment. We are able to afford her treatment and I can only imagine to have financial stress too amongst others during this time.",
        "Ive heard ketto charges huge amount in the form of fees. Will you even get the 100% of donations?",
        "Exactly. Thank you so much. I am so glad you understand this. I really hope your mother gets well soon. ❤️",
        "No, for medical expenses, they don’t charge anything. I had a proper word with Ketto team. Just don’t give any tips at the checkout.",
        "donated :)",
        "Thank you so much friend! I love how we as a nation are helping people. I love this :)",
        "OP, is there any way to directly transfer money to her? Have heard Ketto doesn't give you the money and only reimburses your bills, also for which they take too long.",
        "Following",
        "Yes there is:\nChandrakant Sambhaji Panchal \nSBI Biloli IFSC code SBIN0020053\nAccount number 52175607496\nGoogle pay number 9403660606",
        "Yes there is:\n*Bank Account Details for Donations:*\n- *Account Holder:* Chandrakant Sambhaji Panchal  \n- *Bank:* State Bank of India (SBI), Biloli Branch  \n- *IFSC Code:* SBIN0020053  \n- *Account Number:* 52175607496  \n- *Google Pay Number:* 9403660606",
        "Could contribute a little. I hope she recovers soon.",
        "Thank you friend, I hope that too. 🙏",
        "Is this safe to put all the details here, you could have DM them",
        "I had put out the details when my mom was fighting cancer, nothing happened to us. I think in such cases, people don’t have mal intentions.",
        "This being here will help others too who wish to donate directly.",
        "Can i have your Gpay No?",
        "9403660606",
        "9403660606",
        "Did my part. Praying for his wife's good health. She will get through this. I believe in god.",
        "Thank you so much friend! Hopefully ❤️🙏",
        "Donated ♥️",
        "To the incoming \"commenting for better reach\"ers, UPVOTE instead please. \n\nReddit works on upvotes, not comments",
        "Thank you friend, god bless you!",
        "absolutely. this is the least i could do",
        "Donated a small amount. Pls let him know that many people are praying for his wife's recovery and thank you as well.",
        "I have donated hope their family recovers and find peace and happiness 👨‍👩‍👧‍👦. Anyone who's probably reading this usually I am not the person who donated online due to a lot of scams but this seems genuine. Wishing the best to the family.",
        "please update this on donatekart as well",
        "RemindMe! 12 hours",
        "I will be messaging you in 12 hours on [**2024-12-03 10:53:50 UTC**](http://www.wolframalpha.com/input/?i=2024-12-03%2010:53:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1h51nb7/urgent_donation_appeal_a_life_in_crisis/m0414y9/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1h51nb7%2Furgent_donation_appeal_a_life_in_crisis%2Fm0414y9%2F%5D%0A%0ARemindMe%21%202024-12-03%2010%3A53%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201h51nb7)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "Donated ♥️",
        "Donated with the hope of seeing happiness return to her family.♥️\nMay God bless us all with Strength, Health, and Countless Blessings.🙏",
        "Ara how is she now ?",
        "She’s fine now! :))",
        "I will definitely let him know!!",
        "Fine fine 😊",
        "Thank you so much, god bless you!!",
        "Sure, I’ll do that!",
        "Thank you so much for trusting. 🙏 God bless your soul. 🤍",
        "Did what I could. Stay strong.",
        "Thank you so much, god bless you!!",
        "Government employees and their spouses are insured",
        "These recent rise in messages on reddit of people needing help and asking for money is surprising. With the prevalence of digital fraud in India, it makes me wonder. I just hope all this is genuine, but I have my doubts.",
        "He isn’t a government employee. And even govt employees don’t get ensured for more than 15 lac. He has already used up 15 lac in her 6 chemotherapies. She has been hospitalised since months now.",
        "I don’t know about others. But I assure you this is genuine. I am trying to help their family since I have seen the condition. But I am also vary of increase in such posts.",
        "Maybe Reddit is the only place where you can reach out without having any follower count etc that is why people are preferring this.",
        "Speed Recovery and Many prayers for her 🥹🙏",
        "Fair point",
        "Thank you so much. 🙏",
        "Can we not directly transfer to patients or his care take account. I dont give money to Ketto.",
        "Yes these are the details : Bank Account Details for Donations:\n\n•\t⁠Account Holder: Chandrakant Sambhaji Panchal\n•\t⁠Bank: State Bank of India (SBI), Biloli Branch\n•\t⁠IFSC Code: SBIN0020053\n•\t⁠Account Number: 52175607496\n•\t⁠Google Pay Number: 9403660606",
        "Can you post UPI directly. Ketto is utter trash. One donation and they will cling on you for eternity, even passing all your info to other pushy orgs.",
        "Yes yes. Yes there is: Bank Account Details for Donations:\n\n•\t⁠Account Holder: Chandrakant Sambhaji Panchal\n•\t⁠Bank: State Bank of India (SBI), Biloli Branch\n•\t⁠IFSC Code: SBIN0020053\n•\t⁠Account Number: 52175607496\n•\t⁠Google Pay Number: 9403660606",
        "Done my bit. Praying for her and the family !!",
        "Just donate FFS guys, charity loses it's value bit by bit  the moment you speak of it. \n\nTry to understand that this loss of value has nothing to do with the receiver. \n\nIt loses value for YOU and your growth as a human. Just do it and don't talk about it. \n\nSaala har jagah validation chaiye sabko.",
        "Thank you so much friend, god bless you!",
        "I hope her wife recovers soon 🤞 That sir looks so kind!"
    ],
    "cleaned_text": "urgent donation appeal life crisis hi everyone see community helping lot people work village called sagroli theres primary school teacher whose wife suffering leukaemia shes admitted tata memorial hospital needs bone marrow transplant stay alive teacher still working hard make money exhausted savings treatment till two small children krushna th grade gayatri th grade met children well please help family patient still years age horrible happened got fundraiser verified ketto hopes donate whatever little ",
    "cleaned_title": "urgent donation appeal life crisis",
    "cleaned_selftext": "hi everyone see community helping lot people work village called sagroli theres primary school teacher whose wife suffering leukaemia shes admitted tata memorial hospital needs bone marrow transplant stay alive teacher still working hard make money exhausted savings treatment till two small children krushna th grade gayatri th grade met children well please help family patient still years age horrible happened got fundraiser verified ketto hopes donate whatever little",
    "cleaned_comments": "seems needy donated really got nothing fall back tried help capacity thank much friend god really bless nothing much duty human hope get help nice work always thank much friend cfbr thank friend mother battling cancer see patients related bone marrow blood cancer every day heartbreaking costly donated whatever afford moment able afford treatment imagine financial stress amongst others time ive heard ketto charges huge amount form fees even get donations exactly thank much glad understand really hope mother gets well soon medical expenses dont charge anything proper word ketto team dont give tips checkout donated thank much friend love nation helping people love op way directly transfer money heard ketto doesnt give money reimburses bills also take long following yes chandrakant sambhaji panchal sbi biloli ifsc code sbin account number google pay number yes bank account details donations account holder chandrakant sambhaji panchal bank state bank india sbi biloli branch ifsc code sbin account number google pay number could contribute little hope recovers soon thank friend hope safe put details could dm put details mom fighting cancer nothing happened us think cases people dont mal intentions help others wish donate directly gpay part praying wifes good health get believe god thank much friend hopefully donated incoming commenting better reachers upvote instead please reddit works upvotes comments thank friend god bless absolutely least could donated small amount pls let know many people praying wifes recovery thank well donated hope family recovers find peace happiness anyone whos probably reading usually person donated online due lot scams seems genuine wishing best family please update donatekart well remindme hours messaging hours utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentshnburgentdonationappealalifeincrisismycontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfhnbfurgentdonationappealalifeincrisisfmyfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletehnb infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback donated donated hope seeing happiness return family may god bless us strength health countless blessings ara shes fine definitely let know fine fine thank much god bless sure ill thank much trusting god bless soul could stay strong thank much god bless government employees spouses insured recent rise messages reddit people needing help asking money surprising prevalence digital fraud india makes wonder hope genuine doubts isnt government employee even govt employees dont get ensured lac already used lac chemotherapies hospitalised since months dont know others assure genuine trying help family since seen condition also vary increase posts maybe reddit place reach without follower count etc people preferring speed recovery many prayers fair point thank much directly transfer patients care take account dont give money ketto yes details bank account details donations account holder chandrakant sambhaji panchal bank state bank india sbi biloli branch ifsc code sbin account number google pay number post upi directly ketto utter trash one donation cling eternity even passing info pushy orgs yes yes yes bank account details donations account holder chandrakant sambhaji panchal bank state bank india sbi biloli branch ifsc code sbin account number google pay number done bit praying family donate ffs guys charity loses value bit bit moment speak try understand loss value nothing receiver loses value growth human dont talk saala har jagah validation chaiye sabko thank much friend god bless hope wife recovers soon sir looks kind",
    "light_cleaned_title": "Urgent Donation Appeal: A Life in Crisis",
    "light_cleaned_selftext": "Hi everyone, I see this community is helping a lot of people. I work in a village called Sagroli and there’s a primary school teacher whose wife is suffering from Leukaemia. She’s admitted in Tata Memorial Hospital and needs a bone marrow transplant to stay alive. This teacher is still here working hard so he can make some money. He has exhausted all his savings on the treatment till now. They have two small children: Krushna is 7th grade and Gayatri is 9th grade. I met both the children as well. Please help this family if you can. The patient is still 38 years of age and it’s horrible what has happened to her. I got their fundraiser verified on Ketto and he now has some hopes from it. Donate whatever little you can:",
    "light_cleaned_comments": "He seems to be the most needy, donated. He really is, he has got nothing to fall back to. Tried to help with my capacity. ❤️ Thank you so much friend. God really bless you! Nothing much but a duty as human. I hope you get the help nice work as always 👍 Thank you so much friend. 🙏 cfbr Thank you friend. 🙏 My mother is battling cancer too and I see patients related to bone marrow and blood cancer every day. It’s heartbreaking and costly. Donated with whatever I can afford at the moment. We are able to afford her treatment and I can only imagine to have financial stress too amongst others during this time. Ive heard ketto charges huge amount in the form of fees. Will you even get the 100% of donations? Exactly. Thank you so much. I am so glad you understand this. I really hope your mother gets well soon. ❤️ No, for medical expenses, they don’t charge anything. I had a proper word with Ketto team. Just don’t give any tips at the checkout. donated :) Thank you so much friend! I love how we as a nation are helping people. I love this :) OP, is there any way to directly transfer money to her? Have heard Ketto doesn't give you the money and only reimburses your bills, also for which they take too long. Following Yes there is: Chandrakant Sambhaji Panchal SBI Biloli IFSC code SBIN0020053 Account number 52175607496 Google pay number 9403660606 Yes there is: *Bank Account Details for Donations:* - *Account Holder:* Chandrakant Sambhaji Panchal - *Bank:* State Bank of India (SBI), Biloli Branch - *IFSC Code:* SBIN0020053 - *Account Number:* 52175607496 - *Google Pay Number:* 9403660606 Could contribute a little. I hope she recovers soon. Thank you friend, I hope that too. 🙏 Is this safe to put all the details here, you could have DM them I had put out the details when my mom was fighting cancer, nothing happened to us. I think in such cases, people don’t have mal intentions. This being here will help others too who wish to donate directly. Can i have your Gpay No? 9403660606 9403660606 Did my part. Praying for his wife's good health. She will get through this. I believe in god. Thank you so much friend! Hopefully ❤️🙏 Donated ♥️ To the incoming \"commenting for better reach\"ers, UPVOTE instead please. Reddit works on upvotes, not comments Thank you friend, god bless you! absolutely. this is the least i could do Donated a small amount. Pls let him know that many people are praying for his wife's recovery and thank you as well. I have donated hope their family recovers and find peace and happiness 👨‍👩‍👧‍👦. Anyone who's probably reading this usually I am not the person who donated online due to a lot of scams but this seems genuine. Wishing the best to the family. please update this on donatekart as well RemindMe! 12 hours I will be messaging you in 12 hours on [**2024-12-03 10:53:50 UTC**](http://www.wolframalpha.com/input/?i=2024-12-03%2010:53:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1h51nb7/urgent_donation_appeal_a_life_in_crisis/m0414y9/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1h51nb7%2Furgent_donation_appeal_a_life_in_crisis%2Fm0414y9%2F%5D%0A%0ARemindMe%21%202024-12-03%2010%3A53%3A50%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201h51nb7) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| Donated ♥️ Donated with the hope of seeing happiness return to her family.♥️ May God bless us all with Strength, Health, and Countless Blessings.🙏 Ara how is she now ? She’s fine now! :)) I will definitely let him know!! Fine fine 😊 Thank you so much, god bless you!! Sure, I’ll do that! Thank you so much for trusting. 🙏 God bless your soul. 🤍 Did what I could. Stay strong. Thank you so much, god bless you!! Government employees and their spouses are insured These recent rise in messages on reddit of people needing help and asking for money is surprising. With the prevalence of digital fraud in India, it makes me wonder. I just hope all this is genuine, but I have my doubts. He isn’t a government employee. And even govt employees don’t get ensured for more than 15 lac. He has already used up 15 lac in her 6 chemotherapies. She has been hospitalised since months now. I don’t know about others. But I assure you this is genuine. I am trying to help their family since I have seen the condition. But I am also vary of increase in such posts. Maybe Reddit is the only place where you can reach out without having any follower count etc that is why people are preferring this. Speed Recovery and Many prayers for her 🥹🙏 Fair point Thank you so much. 🙏 Can we not directly transfer to patients or his care take account. I dont give money to Ketto. Yes these are the details : Bank Account Details for Donations: • ⁠Account Holder: Chandrakant Sambhaji Panchal • ⁠Bank: State Bank of India (SBI), Biloli Branch • ⁠IFSC Code: SBIN0020053 • ⁠Account Number: 52175607496 • ⁠Google Pay Number: 9403660606 Can you post UPI directly. Ketto is utter trash. One donation and they will cling on you for eternity, even passing all your info to other pushy orgs. Yes yes. Yes there is: Bank Account Details for Donations: • ⁠Account Holder: Chandrakant Sambhaji Panchal • ⁠Bank: State Bank of India (SBI), Biloli Branch • ⁠IFSC Code: SBIN0020053 • ⁠Account Number: 52175607496 • ⁠Google Pay Number: 9403660606 Done my bit. Praying for her and the family !! Just donate FFS guys, charity loses it's value bit by bit the moment you speak of it. Try to understand that this loss of value has nothing to do with the receiver. It loses value for YOU and your growth as a human. Just do it and don't talk about it. Saala har jagah validation chaiye sabko. Thank you so much friend, god bless you! I hope her wife recovers soon 🤞 That sir looks so kind!"
}