{
    "id": "1dlsxvr",
    "title": "ST. BROSEPH AND FEMALE SOCIAL WORKER WERE ASSAULTED TODAY (22nd June, 2024)",
    "url": "https://www.reddit.com/r/india/comments/1dlsxvr/st_broseph_and_female_social_worker_were/",
    "selftext": "Recently, [u/St\\_Broseph](https://www.reddit.com/user/St_Broseph/), Dushyant had rescued a 23-year-old girl from Tiruvannamalai, a town in Tamil Nadu. He had saved her from a tyrannical family which was trying to control her and get her married off. Before leaving Tamil Nadu, the girl had recorded a video message of her from her own house stating that she is leaving home at her own accord and that she does not intend on coming back to her family. She then shared this video with all her family members, friends and relevant police authorities in Tiruvannamalai. She had also, upon reaching Bangalore, called the police control room and informed them that she is alive and well and had left at her own will. Yesterday, upon receiving information that a missing persons complaint was being lodged for the girl, the girl herself had contacted the Tiruvannamalai police and informed them that she has left out of her own will and even offered to video call them to show them she is okay. Dushyant had called the DSP and other police officers of Tiruvannamalai who didn’t receive his calls. He had then texted him to inform him that no missing person’s complaint should be taken because the girl was alive, well and safe. Broseph had even tweeted out to the Police authorities there telling them that he is not able to reach them. (Link to tweet below)  \n[https://x.com/St\\_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19](https://x.com/St_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19)\n\nAt around 2:30 AM today, 3 Tamil Nadu cops in civilian clothes along with the rescued girl’s parents, in a civilian car showed up at Dushyant’s doorstep. They did not show any identification apart from a picture of one of them in a policeman vardi. They asked him about the whereabouts of the girl and then attempted to drag him outside. He accompanied them to the main road where they proceeded to be abusive and aggressive. Then, still accompanied by these Tamil Nadu cops, he went to the Indiranagar police chowki nearby, where the cops were asleep.\n\nThe cops even after being awakened, were helpless and kept asking Dushyant to comply with the unreasonable Tamil Nadu cops. The Indiranagar cops along with the Tamil Nadu Cops and Dushyant went to the SBA Headquarters and started knocking on the door and ringing the bell. The Tamil Nadu Cops were still being extremely aggressive and by now had begun pushing and manhandling him when the people at Headquarters  weren’t opening the door because it was 4:30 AM ish in the morning by now. Frustrated by these things, these monsters tried to drag Dushyant towards the main road and put him into their civilian car. They used force and ganged up on him when he resisted this blatant abuse of power. They tried dragging him into a car and god knows what would’ve happened if he were to go with them.\n\nBy this time Janhavi, got here and tried to support Dushyant. The HQ people had woken up by now and opened the door because of all the commotion. Seeing the HQ open, the girl’s parents lunged inside. Janhavi ran to stop the girl’s parents from trespassing into the HQ and possibly making things worse. She tried to stop the girl’s father. This animal of a person, enraged by being stopped by Janhavi began to hit and punch her. This whole thing was further horrid because Cops from TWO JURISDICTIONS WERE PRESENT THERE AND DID NOTHING TO STOP JANHAVI FROM THIS ANIMAL EVEN AFTER THEY WERE ASKED TO. HE HURT HER SHOULDER, FACE AND KEPT GOING. Dushyant was near the main road and as soon as Janhavi pushed her head out of the door and screamed for help, he ran to her rescue while cops were still trying to restrain him physically. Dushyant had to physically move the assailant away from Janhavi to stop him from hitting her further. The Sub-Inspector of Indiranagar then got to the scene and asked everyone to head to the police station.\n\nEven after so much had transpired and such blatant disregard for law and order had been displayed, the cops at Indiranagar Police Station still tried to TAKE THE TAMIL NADU COPS’ SIDE instead of treating this case on its facts. They were asking Dushyant to not escalate this legally and to comply with them. This whole incident shows how disgustingly entitled cops can get in Tamil Nadu and the height of incompetence shown by Indiranagar Police.\n\nDushyant has decided to pursue this legally. They have gotten medical attention and have medico legal cases. We will hold these abusive cops accountable for their lack of responsibility and blatant violation of procedure. These cops need to be SUSPENDED and the man who hit a FEMALE SOCIAL WORKER MERCILESSLY NEEDS TO BE PUT BEHIND BARS FOR HIS ACTIONS. We will do whatever it takes to bring these cops down because if cops turn a blind eye to crimes, refuse to follow procedure and act in such a brutal and disrespectful manner, are they even cops? Are these shameless scoundrels charged with our safety and protection? Imagine being in this situation instead of a resourceful person such as Broseph, anyone else would have been further assaulted, beaten and persecuted. We cannot rest until the perpetrators are arrested and the cops responsible for this are suspended and for this, we need your help. Follow and amplify St. Broseph posts on this incident across social media, call your journalist friends and inform them about what’s happened, AMPLIFY THIS VOICE so that the law and order situation may improve and the next time a cop even considers doing something like this, they are reminded that **PEOPLE OF BANGALORE WILL NOT STAY SILENT.**\n\ntl;dr\n\nDushyant, a social worker, rescued a girl from a controlling family. Tamil Nadu police and the girl's parents showed up at his doorstep at 2:30 AM to take her back. They assaulted Dushyant and another social worker, Janhavi, when they resisted. Bangalore police did nothing to help. Dushyant is calling for legal action against the police and the girl's father.",
    "flair": "Law & Courts",
    "score": 2346,
    "num_comments": 61,
    "created_utc": 1719053253.0,
    "convurl": "https://external-preview.redd.it/rSi5MtlLCB_coxPqJLvcvP1ZPOIWk0aBqlYrIi9CeyE.jpg?auto=webp&s=6033ee82a99deece6de6fc0ef988a35926cf09d6",
    "comments": [
        "Keep fighting the good fight, guys!",
        "More power to Broseph and his team.",
        "If you could make and link posts from more conventionally relevant social media accounts of u/st_broseph or related accounts, it would also help. \nAs there are a lot of people who do not really use reddit. \n\nReddit or Instagram posts maybe?",
        "Is there anything that someone who’s not living in Bangalore can do to help ?",
        "Not OP, nor know Broseph personally. You may share the tagged social media posts for better reach.",
        "Spread awareness on other platforms",
        "They've done it in Twitter, link added to the post now, ig",
        "Shameful, Can't believe this doesn't have more traction already. I don't post much, but I have heard of STBrosephs always helping out people when and where they need it, and to have something like this happen to them is just sad.\n\nHoping something gets done and those fuckers get what they deserve.\n\nhave posted on twitter/ X",
        "The fate of being a woman in India. Can't trust a single male - not the father that is supposed to protect you or the cops who are supposed to help you when you're assaulted. Not allowed to take a single decision for themselves without elders with fragile egos losing their shit to control your life.  Pathetic.",
        "How are they? I hope they are ok.",
        "A few good people fighting this horrid system.... We must support them as much as possible.",
        "Commenting for Visibility.",
        "I am sorry to say this but nothing will happen to the cops no matter how much you try.",
        "Yup cops should start being punished for abusing their power. Stories like this makes me feel like we are still in the colonial era.",
        "Hope you all go forward with this and file the case. I have read a lot about Broseph and how selfless he is. Hope this incident doesnt make him stop in his endeavours which have helpes so many people",
        "How can I help???",
        "If you get justice, and by justice I mean court Justice.\n\nTHEN I WILL TOuCH yOUR FEET. \n\nThis is India, *lawlessness* prevails here. \n\nPune Porsche wala is almost free, Judges told to consider boy's TrAuMa. W Judges. 🙃\n\nhttps://www.indiatoday.in/law/story/pune-porsche-crash-bombay-high-court-teen-accused-2556242-2024-06-21",
        "And people say UP cops are trash\n\nLaw is fucked in this country\nBe it any state\n\nAnd those cops should be suspended immediately with a Investigation on thier behavior",
        "Sleeping in thana? What the fuck? St broseph and that social worker should get justice!\n\nHe helps people in the time of need when authorities and govt just discards them after taxes. Please everyone share this!!",
        "By resharing their twitter post. I guess higher the traction more the visibility and more the impact",
        "They say this as UP is always under scrutiny. But from what I've read about TN police they are law onto themselves",
        "Is there a place to contribute financially?",
        "Question is how can cops who have no jurisdiction in our state come and assault an individual? This is a matter that has to be taken to court.",
        "Raise your voice, social media has power ",
        "Man what the fuck how did TN cops in civillian uniform were able to do such a commotion and the BLR cops just standing and watching?!!\n\nAll the cops involved should be suspended no questions asked",
        "Fuck those people. This jungle raaj is unacceptable. More power to people like broseph who are fighting it. ",
        "Tag CM Stalin on twitter. It usually works. Most people from that side of the districts are a bit casteist and the police could have been from the same caste as the girl's family. This happens a lot over there and nearby districts. If there's any foto or video evidence upload that too.",
        "Fuck those worthless abusive parents. Also those plain clothes people might not be cops, could be some political guys or goondas.",
        "Gunda police works for them. Don't expect anything from DMK",
        "Nah situations like these they do work on it. Even a week ago something like this happened in the southernmost district. So it's better to put it on twitter tagging CM Stalin.",
        "The incompetence of the police is the result of incompetence filtration of the candidates for the posts that they are more suitable.",
        "Let's try it then. I hope it works.",
        "Except Kerala and some specific NE areas, police forces are shit in all parts of the country.\n\nAnd hell, even in such \"good\" areas you'll find state government bootlickers amongst the police.\n\nPolice reforms are the need of the hour, since the hour India got independence.",
        "Nobody seems to ask why TN people are so control freaks. People here love to whine about UP, Bihar but TN is as regressive as these states, if not more. More people marry outside their caste in Bihar than TN. \n\n\nThe state has curfew timings for college girls as early as 4 PM, factories are forced to restrict their female employees from going out because their parents will riot on the streets, Dalits are forced to drink stool contaminated water. \n\n\n\nAnd the Bangalodu cops being themselves as usual. Fuckers were sleeping in the police station.  ",
        "I hope he’s safe",
        "dushya@okhdfcbank is his upi id. I’ve been contributing on this. I believe providing monitoring support is a huge factor too if it helps run the broseph headquarters better and help in providing better resources.",
        "Can you post a link of the tweet that should be reshared? I’m new to it and ain’t able to navigate. Thanks",
        "Mumbai police is quite friendly and helpful, but like all places they're corrupt and will put on a mujra if you throw enough money.",
        "every cop technically has jurisdiction in the entire country, it's the karnataka cops who failed to enforce L&O in their state. But tbh a cop is never gonna arrest or restrain another cop",
        "I have read that Mumbai police improved after their operations against the Bombay Underworld, as well as post-26/11 revamps. But still, the corruption and bowing down to politicians remains the same.",
        "yes, but as long as you know Hindi or Marathi they tend to be pretty helpful in most cases, it's one of the reasons why Mumbai is safe while being very liberal, no goon in Mumbai can harrass people then cry \" Saar I'm a local speak Marathi saar\", the cops while whack him while abusing him in Marathi",
        "He's not free. They are fighting against the bail modification and the police had followed the wrong procedure that's why they are being grilled by the court now. The court just wants to move him away from confinement to his relatives home as he's still a minor.",
        "And from relatives home, he will become gayab, brother......when the judges say to consider the trauma of a murderer, you know they are sold people. \n\nIt wrenchea my heart to say this but the Indian judiciary is corrupt and available to the highest bidder..... If the Porsche fellow gets justice and by justice I mean life imprisonment.... Then I will touch your feet too.",
        "It was an accident. He did not pre-plan this to kill those two people. You make him sound like a psychopath. He's still 17, why can't he be traumatized for it? Be rational, don't be emotional. He will get the punishment he deserves even if it gets delayed. If the police wants him remanded, then let them file a plea for cancellation of bail.",
        "Imagine the horrors he can inflict behind closed doors. Kudos to team broseph and please get justice for your team mate. This monster needs to be behind bars & get some good old jail treatment.",
        "Why did those two people die? What was their fault? A guy is drunk, driving the car before even the name plate is printed and also under the age of 17. \n\n>> He's still 17, why can't he be traumatized for it?\n\nSuch people have a history of bullying people and throwing their weight around. \n\nFr the guy's grandfather is underworld. \nWhole family ia gunda. \n\nWhat about the families? What about the driver who was kidnapped and ordered to take blame for the child? \n\n>> Be rational, don't be emotional.\n\nThis is the Indian justice system, if people had been rational here and left everything to the \"capable hands of the LaW\" ,the guy would be out and on his way for round 2.\n\nAnd trust me, he will be out for round 2, but this time I hope he offs some very high profile people. \n\nThe only reason the police discovered the compromised doctor, blood samples changed from son to mother is because of...... Ding ding..... EmOtiOn of the public. \n\nYou fr sound like a paid fellow speaking on the behalf of such people. \n\n>> He will get the punishment he deserves even if it gets delayed.\n\nDoubt it, \n\nBastion rape, the guy got scott free\n\nSalman khan is free despite killing peoplle on footpath\n\nGoa Benastrim killer lady is free dealite causing multiple lives to end\n\ncM biren singh son killed someone is road rage, he is scott free. \n\nLaw is only for muddle class my friend. \n\nHope they won't make you their target next.",
        "Biggest achievement of TN police was shoving sticks up the ass of a father son shopkeeper duo, ultimately killing them during COVID.",
        "Full support in whatever manner possible. Police in this country needs to be taught a lesson by civic personal and bodies. They consider themselves above the law.",
        "Yeah they got medical treatment and also got a medicine legal report do eon all the harrasment marks and  scars.",
        "This is one reason, I do not engage in any local activities in Bangalore, even if someone scratches or bumps my car, I just mind my own business. No point doing anything, they will go to police station and say speak \"Kannada\" or you are guilty.",
        "What the fuck..I hope they get justice against the goons",
        "The only way is learning to defend yourself and fighting back. Can't let these uneducated goons push us around anymore.",
        ">Follow and amplify St. Broseph posts on this incident across social media, call your journalist friends and inform them about what’s happened, AMPLIFY THIS VOICE\n\nPlease post the relevant links, I could not find anything on twitter",
        "I mean yeah not surprised the cops were useless. They're not here to protect you, they're here to protect the state.",
        "Cops are trash everywhere. I can't say the extent of violence the general public should subject every single cop to without getting banned or ruining pork products for readers.",
        "I don't live in Bangalore. But for all of us who are like me, tell us what to do and we will do it. Enough is enough for these entitled people.",
        "Wow, such audacity",
        "A\n\nC\n\nA\n\nB",
        "Cops abusing their power is nothing new in India. They still function on rules and laws established during colonial era. Police might just be reduced to a tool of oppression if no reforms are introduced."
    ],
    "cleaned_text": "st broseph female social worker assaulted today nd june recently ustbrosephhttpswwwredditcomuserstbroseph dushyant rescued yearold girl tiruvannamalai town tamil nadu saved tyrannical family trying control get married leaving tamil nadu girl recorded video message house stating leaving home accord intend coming back family shared video family members friends relevant police authorities tiruvannamalai also upon reaching bangalore called police control room informed alive well left yesterday upon receiving information missing persons complaint lodged girl girl contacted tiruvannamalai police informed left even offered video call show okay dushyant called dsp police officers tiruvannamalai didnt receive calls texted inform missing persons complaint taken girl alive well safe broseph even tweeted police authorities telling able reach link tweet httpsxcomstbrosephsstatustkrcqqvivjnajoadcoqshttpsxcomstbrosephsstatustkrcqqvivjnajoadcoqs around today tamil nadu cops civilian clothes along rescued girls parents civilian car showed dushyants doorstep show identification apart picture one policeman vardi asked whereabouts girl attempted drag outside accompanied main road proceeded abusive aggressive still accompanied tamil nadu cops went indiranagar police chowki nearby cops asleep cops even awakened helpless kept asking dushyant comply unreasonable tamil nadu cops indiranagar cops along tamil nadu cops dushyant went sba headquarters started knocking door ringing bell tamil nadu cops still extremely aggressive begun pushing manhandling people headquarters werent opening door ish morning frustrated things monsters tried drag dushyant towards main road put civilian car used force ganged resisted blatant abuse power tried dragging car god knows wouldve happened go time janhavi got tried support dushyant hq people woken opened door commotion seeing hq open girls parents lunged inside janhavi ran stop girls parents trespassing hq possibly making things worse tried stop girls father animal person enraged stopped janhavi began hit punch whole thing horrid cops two jurisdictions present nothing stop janhavi animal even asked hurt shoulder face kept going dushyant near main road soon janhavi pushed head door screamed help ran rescue cops still trying restrain physically dushyant physically move assailant away janhavi stop hitting subinspector indiranagar got scene asked everyone head police station even much transpired blatant disregard law order displayed cops indiranagar police station still tried take tamil nadu cops side instead treating case facts asking dushyant escalate legally comply whole incident shows disgustingly entitled cops get tamil nadu height incompetence shown indiranagar police dushyant decided pursue legally gotten medical attention medico legal cases hold abusive cops accountable lack responsibility blatant violation procedure cops need suspended man hit female social worker mercilessly needs put behind bars actions whatever takes bring cops cops turn blind eye crimes refuse follow procedure act brutal disrespectful manner even cops shameless scoundrels charged safety protection imagine situation instead resourceful person broseph anyone else would assaulted beaten persecuted rest perpetrators arrested cops responsible suspended need help follow amplify st broseph posts incident across social media call journalist friends inform whats happened amplify voice law order situation may improve next time cop even considers something like reminded people bangalore stay silent tldr dushyant social worker rescued girl controlling family tamil nadu police girls parents showed doorstep take back assaulted dushyant another social worker janhavi resisted bangalore police nothing help dushyant calling legal action police girls father ",
    "cleaned_title": "st broseph female social worker assaulted today nd june",
    "cleaned_selftext": "recently ustbrosephhttpswwwredditcomuserstbroseph dushyant rescued yearold girl tiruvannamalai town tamil nadu saved tyrannical family trying control get married leaving tamil nadu girl recorded video message house stating leaving home accord intend coming back family shared video family members friends relevant police authorities tiruvannamalai also upon reaching bangalore called police control room informed alive well left yesterday upon receiving information missing persons complaint lodged girl girl contacted tiruvannamalai police informed left even offered video call show okay dushyant called dsp police officers tiruvannamalai didnt receive calls texted inform missing persons complaint taken girl alive well safe broseph even tweeted police authorities telling able reach link tweet httpsxcomstbrosephsstatustkrcqqvivjnajoadcoqshttpsxcomstbrosephsstatustkrcqqvivjnajoadcoqs around today tamil nadu cops civilian clothes along rescued girls parents civilian car showed dushyants doorstep show identification apart picture one policeman vardi asked whereabouts girl attempted drag outside accompanied main road proceeded abusive aggressive still accompanied tamil nadu cops went indiranagar police chowki nearby cops asleep cops even awakened helpless kept asking dushyant comply unreasonable tamil nadu cops indiranagar cops along tamil nadu cops dushyant went sba headquarters started knocking door ringing bell tamil nadu cops still extremely aggressive begun pushing manhandling people headquarters werent opening door ish morning frustrated things monsters tried drag dushyant towards main road put civilian car used force ganged resisted blatant abuse power tried dragging car god knows wouldve happened go time janhavi got tried support dushyant hq people woken opened door commotion seeing hq open girls parents lunged inside janhavi ran stop girls parents trespassing hq possibly making things worse tried stop girls father animal person enraged stopped janhavi began hit punch whole thing horrid cops two jurisdictions present nothing stop janhavi animal even asked hurt shoulder face kept going dushyant near main road soon janhavi pushed head door screamed help ran rescue cops still trying restrain physically dushyant physically move assailant away janhavi stop hitting subinspector indiranagar got scene asked everyone head police station even much transpired blatant disregard law order displayed cops indiranagar police station still tried take tamil nadu cops side instead treating case facts asking dushyant escalate legally comply whole incident shows disgustingly entitled cops get tamil nadu height incompetence shown indiranagar police dushyant decided pursue legally gotten medical attention medico legal cases hold abusive cops accountable lack responsibility blatant violation procedure cops need suspended man hit female social worker mercilessly needs put behind bars actions whatever takes bring cops cops turn blind eye crimes refuse follow procedure act brutal disrespectful manner even cops shameless scoundrels charged safety protection imagine situation instead resourceful person broseph anyone else would assaulted beaten persecuted rest perpetrators arrested cops responsible suspended need help follow amplify st broseph posts incident across social media call journalist friends inform whats happened amplify voice law order situation may improve next time cop even considers something like reminded people bangalore stay silent tldr dushyant social worker rescued girl controlling family tamil nadu police girls parents showed doorstep take back assaulted dushyant another social worker janhavi resisted bangalore police nothing help dushyant calling legal action police girls father",
    "cleaned_comments": "keep fighting good fight guys power broseph team could make link posts conventionally relevant social media accounts ustbroseph related accounts would also help lot people really use reddit reddit instagram posts maybe anything someone whos living bangalore help op know broseph personally may share tagged social media posts better reach spread awareness platforms theyve done twitter link added post ig shameful cant believe doesnt traction already dont post much heard stbrosephs always helping people need something like happen sad hoping something gets done fuckers get deserve posted twitter x fate woman india cant trust single male father supposed protect cops supposed help youre assaulted allowed take single decision without elders fragile egos losing shit control life pathetic hope ok good people fighting horrid system must support much possible commenting visibility sorry say nothing happen cops matter much try yup cops start punished abusing power stories like makes feel like still colonial era hope go forward file case read lot broseph selfless hope incident doesnt make stop endeavours helpes many people help get justice justice mean court justice touch feet india lawlessness prevails pune porsche wala almost free judges told consider boys trauma w judges people say cops trash law fucked country state cops suspended immediately investigation thier behavior sleeping thana fuck st broseph social worker get justice helps people time need authorities govt discards taxes please everyone share resharing twitter post guess higher traction visibility impact say always scrutiny ive read tn police law onto place contribute financially question cops jurisdiction state come assault individual matter taken court raise voice social media power man fuck tn cops civillian uniform able commotion blr cops standing watching cops involved suspended questions asked fuck people jungle raaj unacceptable power people like broseph fighting tag cm stalin twitter usually works people side districts bit casteist police could caste girls family happens lot nearby districts theres foto video evidence upload fuck worthless abusive parents also plain clothes people might cops could political guys goondas gunda police works dont expect anything dmk nah situations like work even week ago something like happened southernmost district better put twitter tagging cm stalin incompetence police result incompetence filtration candidates posts suitable lets try hope works except kerala specific ne areas police forces shit parts country hell even good areas youll find state government bootlickers amongst police police reforms need hour since hour india got independence nobody seems ask tn people control freaks people love whine bihar tn regressive states people marry outside caste bihar tn state curfew timings college girls early pm factories forced restrict female employees going parents riot streets dalits forced drink stool contaminated water bangalodu cops usual fuckers sleeping police station hope hes safe dushyaokhdfcbank upi id ive contributing believe providing monitoring support huge factor helps run broseph headquarters better help providing better resources post link tweet reshared im new aint able navigate thanks mumbai police quite friendly helpful like places theyre corrupt put mujra throw enough money every cop technically jurisdiction entire country karnataka cops failed enforce lo state tbh cop never gon na arrest restrain another cop read mumbai police improved operations bombay underworld well post revamps still corruption bowing politicians remains yes long know hindi marathi tend pretty helpful cases one reasons mumbai safe liberal goon mumbai harrass people cry saar im local speak marathi saar cops whack abusing marathi hes free fighting bail modification police followed wrong procedure thats grilled court court wants move away confinement relatives home hes still minor relatives home become gayab brotherwhen judges say consider trauma murderer know sold people wrenchea heart say indian judiciary corrupt available highest bidder porsche fellow gets justice justice mean life imprisonment touch feet accident preplan kill two people make sound like psychopath hes still cant traumatized rational dont emotional get punishment deserves even gets delayed police wants remanded let file plea cancellation bail imagine horrors inflict behind closed doors kudos team broseph please get justice team mate monster needs behind bars get good old jail treatment two people die fault guy drunk driving car even name plate printed also age hes still cant traumatized people history bullying people throwing weight around fr guys grandfather underworld whole family ia gunda families driver kidnapped ordered take blame child rational dont emotional indian justice system people rational left everything capable hands law guy would way round trust round time hope offs high profile people reason police discovered compromised doctor blood samples changed son mother ding ding emotion public fr sound like paid fellow speaking behalf people get punishment deserves even gets delayed doubt bastion rape guy got scott free salman khan free despite killing peoplle footpath goa benastrim killer lady free dealite causing multiple lives end cm biren singh son killed someone road rage scott free law muddle class friend hope wont make target next biggest achievement tn police shoving sticks ass father son shopkeeper duo ultimately killing covid full support whatever manner possible police country needs taught lesson civic personal bodies consider law yeah got medical treatment also got medicine legal report eon harrasment marks scars one reason engage local activities bangalore even someone scratches bumps car mind business point anything go police station say speak kannada guilty fucki hope get justice goons way learning defend fighting back cant let uneducated goons push us around anymore follow amplify st broseph posts incident across social media call journalist friends inform whats happened amplify voice please post relevant links could find anything twitter mean yeah surprised cops useless theyre protect theyre protect state cops trash everywhere cant say extent violence general public subject every single cop without getting banned ruining pork products readers dont live bangalore us like tell us enough enough entitled people wow audacity c b cops abusing power nothing new india still function rules laws established colonial era police might reduced tool oppression reforms introduced",
    "light_cleaned_title": "ST. BROSEPH AND FEMALE SOCIAL WORKER WERE ASSAULTED TODAY (22nd June, 2024)",
    "light_cleaned_selftext": "Recently, [u/St\\_Broseph](https://www.reddit.com/user/St_Broseph/), Dushyant had rescued a 23-year-old girl from Tiruvannamalai, a town in Tamil Nadu. He had saved her from a tyrannical family which was trying to control her and get her married off. Before leaving Tamil Nadu, the girl had recorded a video message of her from her own house stating that she is leaving home at her own accord and that she does not intend on coming back to her family. She then shared this video with all her family members, friends and relevant police authorities in Tiruvannamalai. She had also, upon reaching Bangalore, called the police control room and informed them that she is alive and well and had left at her own will. Yesterday, upon receiving information that a missing persons complaint was being lodged for the girl, the girl herself had contacted the Tiruvannamalai police and informed them that she has left out of her own will and even offered to video call them to show them she is okay. Dushyant had called the DSP and other police officers of Tiruvannamalai who didn’t receive his calls. He had then texted him to inform him that no missing person’s complaint should be taken because the girl was alive, well and safe. Broseph had even tweeted out to the Police authorities there telling them that he is not able to reach them. (Link to tweet below) [https://x.com/St\\_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19](https://x.com/St_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19) At around 2:30 AM today, 3 Tamil Nadu cops in civilian clothes along with the rescued girl’s parents, in a civilian car showed up at Dushyant’s doorstep. They did not show any identification apart from a picture of one of them in a policeman vardi. They asked him about the whereabouts of the girl and then attempted to drag him outside. He accompanied them to the main road where they proceeded to be abusive and aggressive. Then, still accompanied by these Tamil Nadu cops, he went to the Indiranagar police chowki nearby, where the cops were asleep. The cops even after being awakened, were helpless and kept asking Dushyant to comply with the unreasonable Tamil Nadu cops. The Indiranagar cops along with the Tamil Nadu Cops and Dushyant went to the SBA Headquarters and started knocking on the door and ringing the bell. The Tamil Nadu Cops were still being extremely aggressive and by now had begun pushing and manhandling him when the people at Headquarters weren’t opening the door because it was 4:30 AM ish in the morning by now. Frustrated by these things, these monsters tried to drag Dushyant towards the main road and put him into their civilian car. They used force and ganged up on him when he resisted this blatant abuse of power. They tried dragging him into a car and god knows what would’ve happened if he were to go with them. By this time Janhavi, got here and tried to support Dushyant. The HQ people had woken up by now and opened the door because of all the commotion. Seeing the HQ open, the girl’s parents lunged inside. Janhavi ran to stop the girl’s parents from trespassing into the HQ and possibly making things worse. She tried to stop the girl’s father. This animal of a person, enraged by being stopped by Janhavi began to hit and punch her. This whole thing was further horrid because Cops from TWO JURISDICTIONS WERE PRESENT THERE AND DID NOTHING TO STOP JANHAVI FROM THIS ANIMAL EVEN AFTER THEY WERE ASKED TO. HE HURT HER SHOULDER, FACE AND KEPT GOING. Dushyant was near the main road and as soon as Janhavi pushed her head out of the door and screamed for help, he ran to her rescue while cops were still trying to restrain him physically. Dushyant had to physically move the assailant away from Janhavi to stop him from hitting her further. The Sub-Inspector of Indiranagar then got to the scene and asked everyone to head to the police station. Even after so much had transpired and such blatant disregard for law and order had been displayed, the cops at Indiranagar Police Station still tried to TAKE THE TAMIL NADU COPS’ SIDE instead of treating this case on its facts. They were asking Dushyant to not escalate this legally and to comply with them. This whole incident shows how disgustingly entitled cops can get in Tamil Nadu and the height of incompetence shown by Indiranagar Police. Dushyant has decided to pursue this legally. They have gotten medical attention and have medico legal cases. We will hold these abusive cops accountable for their lack of responsibility and blatant violation of procedure. These cops need to be SUSPENDED and the man who hit a FEMALE SOCIAL WORKER MERCILESSLY NEEDS TO BE PUT BEHIND BARS FOR HIS ACTIONS. We will do whatever it takes to bring these cops down because if cops turn a blind eye to crimes, refuse to follow procedure and act in such a brutal and disrespectful manner, are they even cops? Are these shameless scoundrels charged with our safety and protection? Imagine being in this situation instead of a resourceful person such as Broseph, anyone else would have been further assaulted, beaten and persecuted. We cannot rest until the perpetrators are arrested and the cops responsible for this are suspended and for this, we need your help. Follow and amplify St. Broseph posts on this incident across social media, call your journalist friends and inform them about what’s happened, AMPLIFY THIS VOICE so that the law and order situation may improve and the next time a cop even considers doing something like this, they are reminded that **PEOPLE OF BANGALORE WILL NOT STAY SILENT.** tl;dr Dushyant, a social worker, rescued a girl from a controlling family. Tamil Nadu police and the girl's parents showed up at his doorstep at 2:30 AM to take her back. They assaulted Dushyant and another social worker, Janhavi, when they resisted. Bangalore police did nothing to help. Dushyant is calling for legal action against the police and the girl's father.",
    "light_cleaned_comments": "Keep fighting the good fight, guys! More power to Broseph and his team. If you could make and link posts from more conventionally relevant social media accounts of u/st_broseph or related accounts, it would also help. As there are a lot of people who do not really use reddit. Reddit or Instagram posts maybe? Is there anything that someone who’s not living in Bangalore can do to help ? Not OP, nor know Broseph personally. You may share the tagged social media posts for better reach. Spread awareness on other platforms They've done it in Twitter, link added to the post now, ig Shameful, Can't believe this doesn't have more traction already. I don't post much, but I have heard of STBrosephs always helping out people when and where they need it, and to have something like this happen to them is just sad. Hoping something gets done and those fuckers get what they deserve. have posted on twitter/ X The fate of being a woman in India. Can't trust a single male - not the father that is supposed to protect you or the cops who are supposed to help you when you're assaulted. Not allowed to take a single decision for themselves without elders with fragile egos losing their shit to control your life. Pathetic. How are they? I hope they are ok. A few good people fighting this horrid system.... We must support them as much as possible. Commenting for Visibility. I am sorry to say this but nothing will happen to the cops no matter how much you try. Yup cops should start being punished for abusing their power. Stories like this makes me feel like we are still in the colonial era. Hope you all go forward with this and file the case. I have read a lot about Broseph and how selfless he is. Hope this incident doesnt make him stop in his endeavours which have helpes so many people How can I help??? If you get justice, and by justice I mean court Justice. THEN I WILL TOuCH yOUR FEET. This is India, *lawlessness* prevails here. Pune Porsche wala is almost free, Judges told to consider boy's TrAuMa. W Judges. 🙃 And people say UP cops are trash Law is fucked in this country Be it any state And those cops should be suspended immediately with a Investigation on thier behavior Sleeping in thana? What the fuck? St broseph and that social worker should get justice! He helps people in the time of need when authorities and govt just discards them after taxes. Please everyone share this!! By resharing their twitter post. I guess higher the traction more the visibility and more the impact They say this as UP is always under scrutiny. But from what I've read about TN police they are law onto themselves Is there a place to contribute financially? Question is how can cops who have no jurisdiction in our state come and assault an individual? This is a matter that has to be taken to court. Raise your voice, social media has power Man what the fuck how did TN cops in civillian uniform were able to do such a commotion and the BLR cops just standing and watching?!! All the cops involved should be suspended no questions asked Fuck those people. This jungle raaj is unacceptable. More power to people like broseph who are fighting it. Tag CM Stalin on twitter. It usually works. Most people from that side of the districts are a bit casteist and the police could have been from the same caste as the girl's family. This happens a lot over there and nearby districts. If there's any foto or video evidence upload that too. Fuck those worthless abusive parents. Also those plain clothes people might not be cops, could be some political guys or goondas. Gunda police works for them. Don't expect anything from DMK Nah situations like these they do work on it. Even a week ago something like this happened in the southernmost district. So it's better to put it on twitter tagging CM Stalin. The incompetence of the police is the result of incompetence filtration of the candidates for the posts that they are more suitable. Let's try it then. I hope it works. Except Kerala and some specific NE areas, police forces are shit in all parts of the country. And hell, even in such \"good\" areas you'll find state government bootlickers amongst the police. Police reforms are the need of the hour, since the hour India got independence. Nobody seems to ask why TN people are so control freaks. People here love to whine about UP, Bihar but TN is as regressive as these states, if not more. More people marry outside their caste in Bihar than TN. The state has curfew timings for college girls as early as 4 PM, factories are forced to restrict their female employees from going out because their parents will riot on the streets, Dalits are forced to drink stool contaminated water. And the Bangalodu cops being themselves as usual. Fuckers were sleeping in the police station. I hope he’s safe dushya@okhdfcbank is his upi id. I’ve been contributing on this. I believe providing monitoring support is a huge factor too if it helps run the broseph headquarters better and help in providing better resources. Can you post a link of the tweet that should be reshared? I’m new to it and ain’t able to navigate. Thanks Mumbai police is quite friendly and helpful, but like all places they're corrupt and will put on a mujra if you throw enough money. every cop technically has jurisdiction in the entire country, it's the karnataka cops who failed to enforce L&O in their state. But tbh a cop is never gonna arrest or restrain another cop I have read that Mumbai police improved after their operations against the Bombay Underworld, as well as post-26/11 revamps. But still, the corruption and bowing down to politicians remains the same. yes, but as long as you know Hindi or Marathi they tend to be pretty helpful in most cases, it's one of the reasons why Mumbai is safe while being very liberal, no goon in Mumbai can harrass people then cry \" Saar I'm a local speak Marathi saar\", the cops while whack him while abusing him in Marathi He's not free. They are fighting against the bail modification and the police had followed the wrong procedure that's why they are being grilled by the court now. The court just wants to move him away from confinement to his relatives home as he's still a minor. And from relatives home, he will become gayab, brother......when the judges say to consider the trauma of a murderer, you know they are sold people. It wrenchea my heart to say this but the Indian judiciary is corrupt and available to the highest bidder..... If the Porsche fellow gets justice and by justice I mean life imprisonment.... Then I will touch your feet too. It was an accident. He did not pre-plan this to kill those two people. You make him sound like a psychopath. He's still 17, why can't he be traumatized for it? Be rational, don't be emotional. He will get the punishment he deserves even if it gets delayed. If the police wants him remanded, then let them file a plea for cancellation of bail. Imagine the horrors he can inflict behind closed doors. Kudos to team broseph and please get justice for your team mate. This monster needs to be behind bars & get some good old jail treatment. Why did those two people die? What was their fault? A guy is drunk, driving the car before even the name plate is printed and also under the age of 17. >> He's still 17, why can't he be traumatized for it? Such people have a history of bullying people and throwing their weight around. Fr the guy's grandfather is underworld. Whole family ia gunda. What about the families? What about the driver who was kidnapped and ordered to take blame for the child? >> Be rational, don't be emotional. This is the Indian justice system, if people had been rational here and left everything to the \"capable hands of the LaW\" ,the guy would be out and on his way for round 2. And trust me, he will be out for round 2, but this time I hope he offs some very high profile people. The only reason the police discovered the compromised doctor, blood samples changed from son to mother is because of...... Ding ding..... EmOtiOn of the public. You fr sound like a paid fellow speaking on the behalf of such people. >> He will get the punishment he deserves even if it gets delayed. Doubt it, Bastion rape, the guy got scott free Salman khan is free despite killing peoplle on footpath Goa Benastrim killer lady is free dealite causing multiple lives to end cM biren singh son killed someone is road rage, he is scott free. Law is only for muddle class my friend. Hope they won't make you their target next. Biggest achievement of TN police was shoving sticks up the ass of a father son shopkeeper duo, ultimately killing them during COVID. Full support in whatever manner possible. Police in this country needs to be taught a lesson by civic personal and bodies. They consider themselves above the law. Yeah they got medical treatment and also got a medicine legal report do eon all the harrasment marks and scars. This is one reason, I do not engage in any local activities in Bangalore, even if someone scratches or bumps my car, I just mind my own business. No point doing anything, they will go to police station and say speak \"Kannada\" or you are guilty. What the fuck..I hope they get justice against the goons The only way is learning to defend yourself and fighting back. Can't let these uneducated goons push us around anymore. >Follow and amplify St. Broseph posts on this incident across social media, call your journalist friends and inform them about what’s happened, AMPLIFY THIS VOICE Please post the relevant links, I could not find anything on twitter I mean yeah not surprised the cops were useless. They're not here to protect you, they're here to protect the state. Cops are trash everywhere. I can't say the extent of violence the general public should subject every single cop to without getting banned or ruining pork products for readers. I don't live in Bangalore. But for all of us who are like me, tell us what to do and we will do it. Enough is enough for these entitled people. Wow, such audacity A C A B Cops abusing their power is nothing new in India. They still function on rules and laws established during colonial era. Police might just be reduced to a tool of oppression if no reforms are introduced."
}