{
    "id": "161pvv6",
    "title": "Need gift suggestion for my Dadi",
    "url": "https://www.reddit.com/r/india/comments/161pvv6/need_gift_suggestion_for_my_dadi/",
    "selftext": "Hi,   \nI recently received my first salary and want to gift something to my grandmother, who is in her late 70s. Need suggestions.   \nCurrently, the Saregama caravan seems like a good option but I'm not sure.  \n [Saregama Carvaan Mini Shrimad Bhagavad Gita - Music player with Krishna Bhajans](https://www.saregama.com/carvaanmini/shrimadbhagavadgita)   \nAlso, if any of you have used this can you please give a review?  \nThanks!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1693040098,
    "convurl": "https://external-preview.redd.it/DJtBdMUmW799wf46ypFu32hus6m2zi0w9eQ-jj9EgM8.jpg?auto=webp&s=79de549aff27d79a7a92aec7c14633c78115c152",
    "comments": [
        "what did you get for her? I am planning something similar for my mom"
    ],
    "cleaned_text": "need gift suggestion dadi hi recently received first salary want gift something grandmother late need suggestions currently saregama caravan seems like good option im sure saregama carvaan mini shrimad bhagavad gita music player krishna bhajanshttpswwwsaregamacomcarvaanminishrimadbhagavadgita also used please give review thanks ",
    "cleaned_title": "need gift suggestion dadi",
    "cleaned_selftext": "hi recently received first salary want gift something grandmother late need suggestions currently saregama caravan seems like good option im sure saregama carvaan mini shrimad bhagavad gita music player krishna bhajanshttpswwwsaregamacomcarvaanminishrimadbhagavadgita also used please give review thanks",
    "cleaned_comments": "get planning something similar mom",
    "light_cleaned_title": "Need gift suggestion for my Dadi",
    "light_cleaned_selftext": "Hi, I recently received my first salary and want to gift something to my grandmother, who is in her late 70s. Need suggestions. Currently, the Saregama caravan seems like a good option but I'm not sure. [Saregama Carvaan Mini Shrimad Bhagavad Gita - Music player with Krishna Bhajans](https://www.saregama.com/carvaanmini/shrimadbhagavadgita) Also, if any of you have used this can you please give a review? Thanks!",
    "light_cleaned_comments": "what did you get for her? I am planning something similar for my mom"
}