{
    "id": "18lavk7",
    "title": "Misleading offer on PhonePe",
    "url": "https://i.redd.it/ndtoqeooj27c1.png",
    "selftext": "Most of the offers on the payments apps are anyway useless, and the ones that may be interesting like above have scammy deals. \n\nThe maximum discount you can avail is 20%, not upto 40% + 10%, as at minimum you need to pay ₹1000 and max discount you get is ₹200.",
    "flair": "Rant / Vent",
    "score": 47,
    "num_comments": 14,
    "created_utc": 1702912004.0,
    "convurl": "https://i.redd.it/ndtoqeooj27c1.png",
    "comments": [
        "Read it as flat 200rs off on purchase above 999",
        "Dominos also does this shit they be like 50% off upto 100rs.",
        "It's not like you can order below 999 . So it's just a flat 200 discount. No percentage involved.",
        "The guy who made this offer may be bad at math or maybe good at meth?",
        "I got audible free credits offer once. It really worked.",
        "# FREE \n^(up to 10 rupees)\n\nis not far off.",
        "Look it's effectively 20%off at a purchase of 1000. That's what they wanted to give. Through this, they provide an illusion of higher discount.",
        "I thought it means that the muscleblaze site has upto 40% discount and this code/app gives you a further 10% off if you are spending more than 999 with the discount being capped at 200 max (if you spend 2000)",
        "Smart marketing does make it an illusion of higher discount…. This one is just *DUMB*",
        "Walter white yo",
        "The 40% off is on the price of the product. Many companies do this misleading thing where they show some high price as original, and then tell you the price they are actually selling to you for, to show it as some huge 35% discount or some nonsense.\n\nYou can see this on mdcomputers for example.\n\nProbably the same thing here, they're just making some huge discount claim based on MRP while Muscleblaze already sells at that 40% off price.",
        "Yeah, I believe I’ve only ever paid full amount for audible once. Its offers on gpay, cred, phonepe, all work. Mostly only once per account, but once in a while you can get the offer even with older accounts.",
        "https://youtube.com/shorts/X9g2eN6hHWs?feature=shared"
    ],
    "cleaned_text": "misleading offer phonepe offers payments apps anyway useless ones may interesting like scammy deals maximum discount avail upto minimum need pay max discount get ",
    "cleaned_title": "misleading offer phonepe",
    "cleaned_selftext": "offers payments apps anyway useless ones may interesting like scammy deals maximum discount avail upto minimum need pay max discount get",
    "cleaned_comments": "read flat rs purchase dominos also shit like upto rs like order flat discount percentage involved guy made offer may bad math maybe good meth got audible free credits offer really worked free rupees far look effectively purchase thats wanted give provide illusion higher discount thought means muscleblaze site upto discount codeapp gives spending discount capped max spend smart marketing make illusion higher discount one dumb walter white yo price product many companies misleading thing show high price original tell price actually selling show huge discount nonsense see mdcomputers example probably thing theyre making huge discount claim based mrp muscleblaze already sells price yeah believe ive ever paid full amount audible offers gpay cred phonepe work mostly per account get offer even older accounts",
    "light_cleaned_title": "Misleading offer on PhonePe",
    "light_cleaned_selftext": "Most of the offers on the payments apps are anyway useless, and the ones that may be interesting like above have scammy deals. The maximum discount you can avail is 20%, not upto 40% + 10%, as at minimum you need to pay ₹1000 and max discount you get is ₹200.",
    "light_cleaned_comments": "Read it as flat 200rs off on purchase above 999 Dominos also does this shit they be like 50% off upto 100rs. It's not like you can order below 999 . So it's just a flat 200 discount. No percentage involved. The guy who made this offer may be bad at math or maybe good at meth? I got audible free credits offer once. It really worked. # FREE ^(up to 10 rupees) is not far off. Look it's effectively 20%off at a purchase of 1000. That's what they wanted to give. Through this, they provide an illusion of higher discount. I thought it means that the muscleblaze site has upto 40% discount and this code/app gives you a further 10% off if you are spending more than 999 with the discount being capped at 200 max (if you spend 2000) Smart marketing does make it an illusion of higher discount…. This one is just *DUMB* Walter white yo The 40% off is on the price of the product. Many companies do this misleading thing where they show some high price as original, and then tell you the price they are actually selling to you for, to show it as some huge 35% discount or some nonsense. You can see this on mdcomputers for example. Probably the same thing here, they're just making some huge discount claim based on MRP while Muscleblaze already sells at that 40% off price. Yeah, I believe I’ve only ever paid full amount for audible once. Its offers on gpay, cred, phonepe, all work. Mostly only once per account, but once in a while you can get the offer even with older accounts."
}