{
    "id": "16nlqjm",
    "title": "Your thoughts on the new icc cwc anthem",
    "url": "https://x.com/cricketworldcup/status/1704387404411584835?s=46&t=Nf7MF4NkPbYaV6aDKbYW8g",
    "selftext": "Here’s the link just in case you didn’t hear it already!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1695217622.0,
    "convurl": "https://external-preview.redd.it/F4OBjlr8nb0GXWrBRN63OXsyv-CHnrKFuBgwH1L-0fY.jpg?auto=webp&s=389abca24d47828eb44b4a11f2b5ef2450e7bac1",
    "comments": [
        "As always the tradition of awful anthem continues. This new anthem makes the shit de ghuma feel like a gem.",
        "This sucks   big time feels like some bollywood  item number song instead of a big sporting event related Anthem 😕.",
        "Yeah and the way these people are showcasing influencers in every god damn thing is very irritating!",
        "Ikr!!! I’d rather listen to ’jiyo khiladi wahe wahe’ 100 times in a song than this garbage😭"
    ],
    "cleaned_text": "thoughts new icc cwc anthem heres link case didnt hear already ",
    "cleaned_title": "thoughts new icc cwc anthem",
    "cleaned_selftext": "heres link case didnt hear already",
    "cleaned_comments": "always tradition awful anthem continues new anthem makes shit de ghuma feel like gem sucks big time feels like bollywood item number song instead big sporting event related anthem yeah way people showcasing influencers every god damn thing irritating ikr id rather listen jiyo khiladi wahe wahe times song garbage",
    "light_cleaned_title": "Your thoughts on the new icc cwc anthem",
    "light_cleaned_selftext": "Here’s the link just in case you didn’t hear it already!",
    "light_cleaned_comments": "As always the tradition of awful anthem continues. This new anthem makes the shit de ghuma feel like a gem. This sucks big time feels like some bollywood item number song instead of a big sporting event related Anthem 😕. Yeah and the way these people are showcasing influencers in every god damn thing is very irritating! Ikr!!! I’d rather listen to ’jiyo khiladi wahe wahe’ 100 times in a song than this garbage😭"
}