{
    "id": "1653ack",
    "title": "Woman guard dies after being gang-raped, thrashed in Ghaziabad housing society",
    "url": "https://www.indiatoday.in/india/story/female-guard-dies-beaten-up-gang-raped-by-3-in-ghaziabad-housing-society-2427960-2023-08-29",
    "selftext": "A 19-year-old woman security guard working at a housing society in Ghaziabad died on Monday after she was allegedly assaulted and gang raped by the supervisor (Ajay) and two other guards.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 76,
    "created_utc": 1693365341.0,
    "convurl": "https://external-preview.redd.it/aLLSM8Olhqf-ynt2uJf2JgD698LMBnWe4qRNSml0zGw.jpg?auto=webp&s=26c42b4e40cca9e5f12b1eebdf37a2e1e6e7713d",
    "comments": [
        "Everyday it’s another rape case, what can we do as a country to handle this?",
        "Housing society meaning flats or bungalows?",
        "But can't rent to bachelor",
        "19yo guard wtf! Ganges belt is no place for a woman to work.",
        "Capital punishment is one of the things. Need to set an example.",
        "Pathetic Bastards.",
        "Hmmm guess the purity of the river has reached the people's minds there too.",
        "And then men questions why there are less women doing these kind of jobs whenever gender equality is the topic and when they do they face this. Pathetic condition of this country.",
        "And these are the same housing societies which wouldn't rent out to Bachelors/Umamrried men but would employ Rapists.",
        "Of course now they'll definitely kill the victim to eliminate any sort of evidence. \nConvictions for rape cases are so low in our country. Any solution therefore has to be reformative instead of retributive. \nThere is no better solution than educating and raising better young men in society.",
        "Every day I'm reminded why this place is infamous",
        "UP being UP",
        "Lkin vaha to Amrit kaal chal raha hai na ?",
        "On paper this sounds so good. But have a look at real education which is being provided in school. Do you really believe it can be done via our current education system? Biggest sex offenders usually sit in government or have full government support. What is education going to do to such people? We need to deal with these bloody rapists as harshly as possible so that they can have at least some fear of law.",
        "Harsher and long lasting punishment, swifter justice. Less focus on what other political parties are saying/not saying doing/not doing.",
        "Put too much religion anywhere you get the same result",
        "Just India being India. Sorry I meant Bharat being Bharat! 🤷🏻‍♂️",
        "What has been the verdict in so many rape cases that keep popping up? Does the victim ever get justice in India?",
        "First thing needed is sex ed for public",
        ">Capital punishment is one of the things\n\nNope. It doesn't do any good it's already there in many countries including ours. Detterant theory has been used and failed.\n\n\n\nWhat we need is more education and less sex deprived society.",
        "At this point we need the equivalent of putting “heads on spikes” to make sure these things, they don’t happen again",
        "Do you know the conviction rate for rape cases? It's less than 2%. Do a search on the average time for trail completion and sentencing also. Capital punishment will do no good, untill the conviction rate is brought up to better levels. The process of trial is punishment for victim as of now.",
        "The rapists were Hindu so this isn’t a religious crime. If they were Muslims they would said, Muslim men raped and killed Hindu security guard.\n\nThis country is no place for women anymore.",
        "Total change in mindset. Stop treating women as an object, stop glorifying eve teasing, stop thinking no means yes , speak up when you see someone eve teasing, do your part. Don't pretend you didn't hear or see it . Have been in situations so many times where men just stay mute. Don't stand up to the bullies.",
        "Yeah, let's scare the people of punishment so they kill the evidence. How about teaching women aren't less than men.",
        "Capital punishment has time and again proved to not work. All that happens is that more rape victims are killed so they cannot provide evidence.",
        "Tbf. I've seen even educated people doing some whacked stuff. Lack of proper parenting is the issue here.",
        "The poor are hurting. With unemployment, rising prices and what not. They’ll have to take whatever jobs they get.",
        "No one's denying that. Women should ideally be in any workforce. Even traditional families with missing husbands would obviously make a woman having to work to make ends meet. It is the lack of women safety, and the predators like her boss in NCR and Ganges belt which is problematic.",
        "every fucking week we have a rape case , how long is India gonna overlook whats happening in the streets rather than the moon",
        "not education necessarily but empowering the police and giving them some sort of independence so that they are not dependent on politicians. \n\nPolice reforms are badly needed. Also, while we have unemployment in the country the police are understaffed, which is ironic. \n\nBut there's a clear conflict of interest here because we are ruled by criminals.",
        "There is never gng to be an capital punishment in an country where some politicians are rapist as well.",
        "you will get hanged for rape, you will get hanged for murder. may as well do both to destroy evidence while at it.",
        "Another day and another rape in UP, it's disgusting to even call it a part of India. Better split it into 3 smaller states that's easier to govern.",
        "Foreigner here:\n\nBy giving women free guns and gun training. And only women allowed to carry guns in India will make India safe for women. \n\nWomen tend to be smaller and have less muscles. \n\nEither women increase muscle mass (through steroids) and train for combat\n\nOr give them gun. All women should carry a pocket knife minimum and pepper spray.",
        "Capital punishment only motivates the rapist to become a murderer.",
        "What can you expect when most people are more concerned about fake rape and dowry cases? :D\n\n(Not saying they’re any less pathetic - but i’m tired of defending why women equality is still needed in india.)",
        "Note how the article mentions Ghaziabad is “close to Delhi” but never mentions UP or Uttar Pradesh. I mean this literally, I did a Ctrl+F.\n\nThis is media, mitron!",
        "raising better young men is too much of a dream rn when social media is full of fucked up podcast bros and not-so-dank dank memers.",
        "Vikings method of craving an eagle out of torso is necessary here",
        "Worked in China though. One more thing increase able police force. Chinese police force is amazing without being rude.",
        "She's a guard, a guard should have the strength to defend him/herself as they are getting paid to guard others. She's literally getting paid for this.",
        "Lets see how you defend yourself while being assaulted by 3 grown men",
        "Flats, a couple or lots of buildings with lots of flats.",
        "Okay thanks 🤝",
        "Disown U.P.?",
        "Wow a rape apologist.",
        "Let’s make it equal , I doubt this guy could defend himself against 3 grown women either",
        "Check out Bilkis Bano...",
        "Have you looked at data ? Just because a country has less rape/crime and strict punishment doesn't mean strict punishment lead to lower crime.",
        "Looked at the subs he is most active in he will probably need 3 people to help him get up from his bed.",
        "In UP the rapists are the victims so they almost never get punishment fit for the crime they committed",
        "Elect govt that doesnt welcome rapists with garlands. That would be a good start",
        "And where do we get such notional party?",
        "By voting out the ones that do this shithousery and giving a message that this doesnt fly",
        "He'll probably piss himself",
        "Ram rajya??",
        "These north indians are sick people man!!! \n\nBcoz of these uncultured bastards even we civilized south indians get bad name abroad",
        "I talked with some of them, they all think it's the reason.",
        "Rapes aren't exclusive to \"North\" India. Rapists regardless of the geography, class, caste and any other classification are sick people.",
        "Legal system is overwhelmed and corrupt. Takes a long time even in the fast record courts.",
        "Why does a crime like rape always have to be divided by geography religion ,caste .why can't we unite against it rather than shitting on each other .",
        "Just like how if the rapists would be uc and guard lc .it would write uc men raped lc security guard",
        "Nope and this is exactly what this country voted for",
        "the only sensible comment I saw so far baaki ke chutiyon ko lagta hai hard punishment dene se rape rukenga",
        "Ik, hard punishment se kam hota hai but rukta nahi hai. Agar public ko educate Kiya iss sabke baare mein, and good touch and bad touch kya hota hai, and more sex ed, then rape rates will drastically fall.",
        "Unfortunately not much. Majority of crime happens due to lack of consequences combined with opportunity. Opportunity to some degree can be curtailed but then the freedom to walk, talk, dress whatever however whenever wherever because constitution!! folks start coming out of the woodwork.\nLack of consequences might be a start. I would imagine everyone gets taught not to tell lies but how effective is that? So all those just teach boys/men to be better is useless without the stick to ensure consequences. But then again the human rights, children rights because constitution!! folks will start with their spiel. \nSo doubt much can happen without 24/7 surveillance everywhere and severe consequences that everyone knows about. At the very least that would put a seed of hesitancy in those that are sane and have unimpeded mental faculties.",
        "A lot of this is or at least was bollywood and other woods basic formula to make a movie for mass entertainment. \nNo mindset change going to happen anywhere in the near future",
        "THEY ARE ALREADY KILLING VICTIMS RIGHT NOW MAN. YOU'RE POINT IS VERY MOOT!",
        "Onnu poda cheruka",
        "I have seen women cab, toto, rickshaw drivers in Bengal, I've seen women guards, bus conductors, bus drivers in South. Ain't no chance these professions would work in North.",
        "In reality, a rape incident is actually happening every 24minutes in the country, with a sizeable percentage victims being minors, and most of these cases go unreported",
        "Yes I am realistic so yes I agree that no mindset change will happen soon .",
        "No idea what you said",
        "Hey that's exactly what I felt about your moot comment too!",
        "So you can't read English like i can't read your comment. Ok",
        "Kindergarten called. They want your insults back.",
        "Another brick in the wall of shame!!!",
        "Tbh, our condition is still better than a lot of countries in Europe",
        "Rape isn't a problem just in India. It is everywhere and happening every second. Many of the so called western developed countries are even more unsafe for women than India",
        "It is very stereotypical of you to just assume that North Indians are always bad. Marital rape and domestic abuse is a prominent issue in Kerala as well.",
        "You do realise you're talking to the same kind of people who probably have been brainwashed to believe that the Tiananmen Square massacre never took place.",
        "They called you since you started the whole thing.",
        "Hmmm do we have the standard of living, HDI, purchasing power or GDP per capita or even one of these to even compare these two?",
        "That's not my job, if you can't do a job don't apply for it. No one has forced her to become a guard.\n\nIf a guard can't defend himself how's he going to gaurd others.\n\nYou people can't digest the fact that she's bad at her job.",
        "No solo guard can protect themselves against multiple attackers. This isnt a movie that the hero will fight off the whole village single handedly",
        "In terms of crime I meant to say",
        "But our currency is not as strong, plus you can live for a week with 200 rupees",
        "Just shut up and save up some dignity for yourself",
        "She was literally raped by two other guards and her supervisor and you're calling HER bad at her job????",
        "I'll give a very unpopular opinion. I don't think Capital Punishment is correct. It's like cutting grass, without taking out it's seed/roots. \n\nNo one borns a rapist. There must be something that happened in their life that made them like that. We need to work on those issues more. We need to sit these rapists with country-class psychologists and ask them question. From as far as they can remember till the incident. There we will be able to learn what went wrong in their life, that made them do such things. \n\nIf we can work on those issues as a whole society. We won't just cut the grass by hanging someone. But we will address the main problem, and cut of the root once and for all.",
        "My point was about rapists, not what professions are available to women.",
        "“ Agar public ko educate Kiya iss sabke baare mein, and good touch and bad touch kya hota hai, and more sex ed, then rape rates will drastically fall.” \n\nCan you elaborate how rape cases will fall drastically ? \nA murdered knows what he is doing is wrong but he is evil so he will do it anyway \nHere she was raped and murdered \nI’m sure they knew that and touch is wrong \nRape is about power",
        "It is more like hidden desires come out, and those people have been fed by Bollywood that no means yes. So educating about this might just lay the foundation for more safety for women, if not reduce the rates"
    ],
    "cleaned_text": "woman guard dies gangraped thrashed ghaziabad housing society yearold woman security guard working housing society ghaziabad died monday allegedly assaulted gang raped supervisor ajay two guards ",
    "cleaned_title": "woman guard dies gangraped thrashed ghaziabad housing society",
    "cleaned_selftext": "yearold woman security guard working housing society ghaziabad died monday allegedly assaulted gang raped supervisor ajay two guards",
    "cleaned_comments": "everyday another rape case country handle housing society meaning flats bungalows cant rent bachelor yo guard wtf ganges belt place woman work capital punishment one things need set example pathetic bastards hmmm guess purity river reached peoples minds men questions less women kind jobs whenever gender equality topic face pathetic condition country housing societies wouldnt rent bachelorsumamrried men would employ rapists course theyll definitely kill victim eliminate sort evidence convictions rape cases low country solution therefore reformative instead retributive better solution educating raising better young men society every day im reminded place infamous lkin vaha amrit kaal chal raha hai na paper sounds good look real education provided school really believe done via current education system biggest sex offenders usually sit government full government support education going people need deal bloody rapists harshly possible least fear law harsher long lasting punishment swifter justice less focus political parties sayingnot saying doingnot put much religion anywhere get result india india sorry meant bharat bharat verdict many rape cases keep popping victim ever get justice india first thing needed sex ed public capital punishment one things nope doesnt good already many countries including detterant theory used failed need education less sex deprived society point need equivalent putting heads spikes make sure things dont happen know conviction rate rape cases less search average time trail completion sentencing also capital punishment good untill conviction rate brought better levels process trial punishment victim rapists hindu isnt religious crime muslims would said muslim men raped killed hindu security guard country place women anymore total change mindset stop treating women object stop glorifying eve teasing stop thinking means yes speak see someone eve teasing part dont pretend didnt hear see situations many times men stay mute dont stand bullies yeah lets scare people punishment kill evidence teaching women arent less men capital punishment time proved work happens rape victims killed provide evidence tbf ive seen even educated people whacked stuff lack proper parenting issue poor hurting unemployment rising prices theyll take whatever jobs get ones denying women ideally workforce even traditional families missing husbands would obviously make woman work make ends meet lack women safety predators like boss ncr ganges belt problematic every fucking week rape case long india gon na overlook whats happening streets rather moon education necessarily empowering police giving sort independence dependent politicians police reforms badly needed also unemployment country police understaffed ironic theres clear conflict interest ruled criminals never gng capital punishment country politicians rapist well get hanged rape get hanged murder may well destroy evidence another day another rape disgusting even call part india better split smaller states thats easier govern foreigner giving women free guns gun training women allowed carry guns india make india safe women women tend smaller less muscles either women increase muscle mass steroids train combat give gun women carry pocket knife minimum pepper spray capital punishment motivates rapist become murderer expect people concerned fake rape dowry cases saying theyre less pathetic im tired defending women equality still needed india note article mentions ghaziabad close delhi never mentions uttar pradesh mean literally ctrlf media mitron raising better young men much dream rn social media full fucked podcast bros notsodank dank memers vikings method craving eagle torso necessary worked china though one thing increase able police force chinese police force amazing without rude shes guard guard strength defend himherself getting paid guard others shes literally getting paid lets see defend assaulted grown men flats couple lots buildings lots flats okay thanks disown wow rape apologist lets make equal doubt guy could defend grown women either check bilkis bano looked data country less rapecrime strict punishment doesnt mean strict punishment lead lower crime looked subs active probably need people help get bed rapists victims almost never get punishment fit crime committed elect govt doesnt welcome rapists garlands would good start get notional party voting ones shithousery giving message doesnt fly hell probably piss ram rajya north indians sick people man bcoz uncultured bastards even civilized south indians get bad name abroad talked think reason rapes arent exclusive north india rapists regardless geography class caste classification sick people legal system overwhelmed corrupt takes long time even fast record courts crime like rape always divided geography religion caste cant unite rather shitting like rapists would uc guard lc would write uc men raped lc security guard nope exactly country voted sensible comment saw far baaki ke chutiyon ko lagta hai hard punishment dene se rape rukenga ik hard punishment se kam hota hai rukta nahi hai agar public ko educate kiya iss sabke baare mein good touch bad touch kya hota hai sex ed rape rates drastically fall unfortunately much majority crime happens due lack consequences combined opportunity opportunity degree curtailed freedom walk talk dress whatever however whenever wherever constitution folks start coming woodwork lack consequences might start would imagine everyone gets taught tell lies effective teach boysmen better useless without stick ensure consequences human rights children rights constitution folks start spiel doubt much happen without surveillance everywhere severe consequences everyone knows least would put seed hesitancy sane unimpeded mental faculties lot least bollywood woods basic formula make movie mass entertainment mindset change going happen anywhere near future already killing victims right man youre point moot onnu poda cheruka seen women cab toto rickshaw drivers bengal ive seen women guards bus conductors bus drivers south aint chance professions would work north reality rape incident actually happening every minutes country sizeable percentage victims minors cases go unreported yes realistic yes agree mindset change happen soon idea said hey thats exactly felt moot comment cant read english like cant read comment ok kindergarten called want insults back another brick wall shame tbh condition still better lot countries europe rape isnt problem india everywhere happening every second many called western developed countries even unsafe women india stereotypical assume north indians always bad marital rape domestic abuse prominent issue kerala well realise youre talking kind people probably brainwashed believe tiananmen square massacre never took place called since started whole thing hmmm standard living hdi purchasing power gdp per capita even one even compare two thats job cant job dont apply one forced become guard guard cant defend hows going gaurd others people cant digest fact shes bad job solo guard protect multiple attackers isnt movie hero fight whole village single handedly terms crime meant say currency strong plus live week rupees shut save dignity literally raped two guards supervisor youre calling bad job ill give unpopular opinion dont think capital punishment correct like cutting grass without taking seedroots one borns rapist must something happened life made like need work issues need sit rapists countryclass psychologists ask question far remember till incident able learn went wrong life made things work issues whole society wont cut grass hanging someone address main problem cut root point rapists professions available women agar public ko educate kiya iss sabke baare mein good touch bad touch kya hota hai sex ed rape rates drastically fall elaborate rape cases fall drastically murdered knows wrong evil anyway raped murdered im sure knew touch wrong rape power like hidden desires come people fed bollywood means yes educating might lay foundation safety women reduce rates",
    "light_cleaned_title": "Woman guard dies after being gang-raped, thrashed in Ghaziabad housing society",
    "light_cleaned_selftext": "A 19-year-old woman security guard working at a housing society in Ghaziabad died on Monday after she was allegedly assaulted and gang raped by the supervisor (Ajay) and two other guards.",
    "light_cleaned_comments": "Everyday it’s another rape case, what can we do as a country to handle this? Housing society meaning flats or bungalows? But can't rent to bachelor 19yo guard wtf! Ganges belt is no place for a woman to work. Capital punishment is one of the things. Need to set an example. Pathetic Bastards. Hmmm guess the purity of the river has reached the people's minds there too. And then men questions why there are less women doing these kind of jobs whenever gender equality is the topic and when they do they face this. Pathetic condition of this country. And these are the same housing societies which wouldn't rent out to Bachelors/Umamrried men but would employ Rapists. Of course now they'll definitely kill the victim to eliminate any sort of evidence. Convictions for rape cases are so low in our country. Any solution therefore has to be reformative instead of retributive. There is no better solution than educating and raising better young men in society. Every day I'm reminded why this place is infamous UP being UP Lkin vaha to Amrit kaal chal raha hai na ? On paper this sounds so good. But have a look at real education which is being provided in school. Do you really believe it can be done via our current education system? Biggest sex offenders usually sit in government or have full government support. What is education going to do to such people? We need to deal with these bloody rapists as harshly as possible so that they can have at least some fear of law. Harsher and long lasting punishment, swifter justice. Less focus on what other political parties are saying/not saying doing/not doing. Put too much religion anywhere you get the same result Just India being India. Sorry I meant Bharat being Bharat! 🤷🏻‍♂️ What has been the verdict in so many rape cases that keep popping up? Does the victim ever get justice in India? First thing needed is sex ed for public >Capital punishment is one of the things Nope. It doesn't do any good it's already there in many countries including ours. Detterant theory has been used and failed. What we need is more education and less sex deprived society. At this point we need the equivalent of putting “heads on spikes” to make sure these things, they don’t happen again Do you know the conviction rate for rape cases? It's less than 2%. Do a search on the average time for trail completion and sentencing also. Capital punishment will do no good, untill the conviction rate is brought up to better levels. The process of trial is punishment for victim as of now. The rapists were Hindu so this isn’t a religious crime. If they were Muslims they would said, Muslim men raped and killed Hindu security guard. This country is no place for women anymore. Total change in mindset. Stop treating women as an object, stop glorifying eve teasing, stop thinking no means yes , speak up when you see someone eve teasing, do your part. Don't pretend you didn't hear or see it . Have been in situations so many times where men just stay mute. Don't stand up to the bullies. Yeah, let's scare the people of punishment so they kill the evidence. How about teaching women aren't less than men. Capital punishment has time and again proved to not work. All that happens is that more rape victims are killed so they cannot provide evidence. Tbf. I've seen even educated people doing some whacked stuff. Lack of proper parenting is the issue here. The poor are hurting. With unemployment, rising prices and what not. They’ll have to take whatever jobs they get. No one's denying that. Women should ideally be in any workforce. Even traditional families with missing husbands would obviously make a woman having to work to make ends meet. It is the lack of women safety, and the predators like her boss in NCR and Ganges belt which is problematic. every fucking week we have a rape case , how long is India gonna overlook whats happening in the streets rather than the moon not education necessarily but empowering the police and giving them some sort of independence so that they are not dependent on politicians. Police reforms are badly needed. Also, while we have unemployment in the country the police are understaffed, which is ironic. But there's a clear conflict of interest here because we are ruled by criminals. There is never gng to be an capital punishment in an country where some politicians are rapist as well. you will get hanged for rape, you will get hanged for murder. may as well do both to destroy evidence while at it. Another day and another rape in UP, it's disgusting to even call it a part of India. Better split it into 3 smaller states that's easier to govern. Foreigner here: By giving women free guns and gun training. And only women allowed to carry guns in India will make India safe for women. Women tend to be smaller and have less muscles. Either women increase muscle mass (through steroids) and train for combat Or give them gun. All women should carry a pocket knife minimum and pepper spray. Capital punishment only motivates the rapist to become a murderer. What can you expect when most people are more concerned about fake rape and dowry cases? :D (Not saying they’re any less pathetic - but i’m tired of defending why women equality is still needed in india.) Note how the article mentions Ghaziabad is “close to Delhi” but never mentions UP or Uttar Pradesh. I mean this literally, I did a Ctrl+F. This is media, mitron! raising better young men is too much of a dream rn when social media is full of fucked up podcast bros and not-so-dank dank memers. Vikings method of craving an eagle out of torso is necessary here Worked in China though. One more thing increase able police force. Chinese police force is amazing without being rude. She's a guard, a guard should have the strength to defend him/herself as they are getting paid to guard others. She's literally getting paid for this. Lets see how you defend yourself while being assaulted by 3 grown men Flats, a couple or lots of buildings with lots of flats. Okay thanks 🤝 Disown U.P.? Wow a rape apologist. Let’s make it equal , I doubt this guy could defend himself against 3 grown women either Check out Bilkis Bano... Have you looked at data ? Just because a country has less rape/crime and strict punishment doesn't mean strict punishment lead to lower crime. Looked at the subs he is most active in he will probably need 3 people to help him get up from his bed. In UP the rapists are the victims so they almost never get punishment fit for the crime they committed Elect govt that doesnt welcome rapists with garlands. That would be a good start And where do we get such notional party? By voting out the ones that do this shithousery and giving a message that this doesnt fly He'll probably piss himself Ram rajya?? These north indians are sick people man!!! Bcoz of these uncultured bastards even we civilized south indians get bad name abroad I talked with some of them, they all think it's the reason. Rapes aren't exclusive to \"North\" India. Rapists regardless of the geography, class, caste and any other classification are sick people. Legal system is overwhelmed and corrupt. Takes a long time even in the fast record courts. Why does a crime like rape always have to be divided by geography religion ,caste .why can't we unite against it rather than shitting on each other . Just like how if the rapists would be uc and guard lc .it would write uc men raped lc security guard Nope and this is exactly what this country voted for the only sensible comment I saw so far baaki ke chutiyon ko lagta hai hard punishment dene se rape rukenga Ik, hard punishment se kam hota hai but rukta nahi hai. Agar public ko educate Kiya iss sabke baare mein, and good touch and bad touch kya hota hai, and more sex ed, then rape rates will drastically fall. Unfortunately not much. Majority of crime happens due to lack of consequences combined with opportunity. Opportunity to some degree can be curtailed but then the freedom to walk, talk, dress whatever however whenever wherever because constitution!! folks start coming out of the woodwork. Lack of consequences might be a start. I would imagine everyone gets taught not to tell lies but how effective is that? So all those just teach boys/men to be better is useless without the stick to ensure consequences. But then again the human rights, children rights because constitution!! folks will start with their spiel. So doubt much can happen without 24/7 surveillance everywhere and severe consequences that everyone knows about. At the very least that would put a seed of hesitancy in those that are sane and have unimpeded mental faculties. A lot of this is or at least was bollywood and other woods basic formula to make a movie for mass entertainment. No mindset change going to happen anywhere in the near future THEY ARE ALREADY KILLING VICTIMS RIGHT NOW MAN. YOU'RE POINT IS VERY MOOT! Onnu poda cheruka I have seen women cab, toto, rickshaw drivers in Bengal, I've seen women guards, bus conductors, bus drivers in South. Ain't no chance these professions would work in North. In reality, a rape incident is actually happening every 24minutes in the country, with a sizeable percentage victims being minors, and most of these cases go unreported Yes I am realistic so yes I agree that no mindset change will happen soon . No idea what you said Hey that's exactly what I felt about your moot comment too! So you can't read English like i can't read your comment. Ok Kindergarten called. They want your insults back. Another brick in the wall of shame!!! Tbh, our condition is still better than a lot of countries in Europe Rape isn't a problem just in India. It is everywhere and happening every second. Many of the so called western developed countries are even more unsafe for women than India It is very stereotypical of you to just assume that North Indians are always bad. Marital rape and domestic abuse is a prominent issue in Kerala as well. You do realise you're talking to the same kind of people who probably have been brainwashed to believe that the Tiananmen Square massacre never took place. They called you since you started the whole thing. Hmmm do we have the standard of living, HDI, purchasing power or GDP per capita or even one of these to even compare these two? That's not my job, if you can't do a job don't apply for it. No one has forced her to become a guard. If a guard can't defend himself how's he going to gaurd others. You people can't digest the fact that she's bad at her job. No solo guard can protect themselves against multiple attackers. This isnt a movie that the hero will fight off the whole village single handedly In terms of crime I meant to say But our currency is not as strong, plus you can live for a week with 200 rupees Just shut up and save up some dignity for yourself She was literally raped by two other guards and her supervisor and you're calling HER bad at her job???? I'll give a very unpopular opinion. I don't think Capital Punishment is correct. It's like cutting grass, without taking out it's seed/roots. No one borns a rapist. There must be something that happened in their life that made them like that. We need to work on those issues more. We need to sit these rapists with country-class psychologists and ask them question. From as far as they can remember till the incident. There we will be able to learn what went wrong in their life, that made them do such things. If we can work on those issues as a whole society. We won't just cut the grass by hanging someone. But we will address the main problem, and cut of the root once and for all. My point was about rapists, not what professions are available to women. “ Agar public ko educate Kiya iss sabke baare mein, and good touch and bad touch kya hota hai, and more sex ed, then rape rates will drastically fall.” Can you elaborate how rape cases will fall drastically ? A murdered knows what he is doing is wrong but he is evil so he will do it anyway Here she was raped and murdered I’m sure they knew that and touch is wrong Rape is about power It is more like hidden desires come out, and those people have been fed by Bollywood that no means yes. So educating about this might just lay the foundation for more safety for women, if not reduce the rates"
}