{
    "id": "185mrjs",
    "title": "When whatsapp university experts meet real historian !!",
    "url": "https://twitter.com/SupriyaShrinate/status/1729045315171528960?t=CmPWwBX-KDrNW9swbqrLpg&s=19",
    "selftext": "On aajtak discussion... godi media at its best..",
    "flair": "Politics",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1701143157.0,
    "convurl": "https://external-preview.redd.it/qI-chaz5WUIw1yOxZz9IOB0JEFRtnVgIjWb2oZ899ZQ.jpg?auto=webp&s=17de516c6549a567f22e96f3ded080f1cbe188cb",
    "comments": [
        "And  sadly that WhatsApp  university  expert is a news anchor \"heading \" a debate 🙄",
        "Earlier they atleast used to try to look impartial,  nowadays,  they bat fully for BJP with tacit consent from management...",
        "I'd appreciate if someone can explain me what they are discussing.",
        "Please tell us what the hell they are discussing...",
        "When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ...  anchor and all right wingers are caught red handed...  \n\nAfterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!!",
        "When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ...  anchor and all right wingers are caught red handed...  \n\nAfterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!!",
        "When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ...  anchor and all right wingers are caught red handed...  \n\nAfterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!!"
    ],
    "cleaned_text": "whatsapp university experts meet real historian aajtak discussion godi media best ",
    "cleaned_title": "whatsapp university experts meet real historian",
    "cleaned_selftext": "aajtak discussion godi media best",
    "cleaned_comments": "sadly whatsapp university expert news anchor heading debate earlier atleast used try look impartial nowadays bat fully bjp tacit consent management id appreciate someone explain discussing please tell us hell discussing cornered savarkars mercy petitions right wingers pointed nehru also signed mercy petition get nabha jail even anchor quoting whatsapp forward cell historian asked mercy petition asking last years nobody could show none lie propagated cell anchor right wingers caught red handed afterwards anchor trying defend fake document proof twitter becoming joke cornered savarkars mercy petitions right wingers pointed nehru also signed mercy petition get nabha jail even anchor quoting whatsapp forward cell historian asked mercy petition asking last years nobody could show none lie propagated cell anchor right wingers caught red handed afterwards anchor trying defend fake document proof twitter becoming joke cornered savarkars mercy petitions right wingers pointed nehru also signed mercy petition get nabha jail even anchor quoting whatsapp forward cell historian asked mercy petition asking last years nobody could show none lie propagated cell anchor right wingers caught red handed afterwards anchor trying defend fake document proof twitter becoming joke",
    "light_cleaned_title": "When whatsapp university experts meet real historian !!",
    "light_cleaned_selftext": "On aajtak discussion... godi media at its best..",
    "light_cleaned_comments": "And sadly that WhatsApp university expert is a news anchor \"heading \" a debate 🙄 Earlier they atleast used to try to look impartial, nowadays, they bat fully for BJP with tacit consent from management... I'd appreciate if someone can explain me what they are discussing. Please tell us what the hell they are discussing... When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ... anchor and all right wingers are caught red handed... Afterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!! When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ... anchor and all right wingers are caught red handed... Afterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!! When cornered on Savarkar's mercy petitions, right wingers pointed out that Nehru also signed mercy petition to get out of Nabha jail... even anchor is quoting some whatsapp forward from IT cell. Then, historian asked where is that mercy petition? i am asking from last 10 years but nobody could show it because there is none . Its a lie propagated by IT cell ... anchor and all right wingers are caught red handed... Afterwards, anchor trying to defend her fake document proof on twitter and becoming a joke herself!!"
}