{
    "id": "17050fp",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/17050fp/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696469411.0,
    "convurl": "https://b.thumbs.redditmedia.com/uSjsYgLoiXp3O3r3Ax_DISyC5RTVLOV016HHBbnewto.jpg",
    "comments": [
        "I'm a student who needs to make some money to afford buying textbooks and such.\n\nI don't have any qualifications but I make advertisements for social media.\n\nPlease hire me if you require an advertisement. DM and we can discuss prices.\n\nHere's my work, more in comment replies—\n\nhttps://preview.redd.it/v4qrhh7aibsb1.jpeg?width=1080&format=pjpg&auto=webp&s=da174bdd573a83253638ce8b57019006f368d316",
        "https://preview.redd.it/kg8jmp0cibsb1.jpeg?width=1080&format=pjpg&auto=webp&s=b9ad9afedc6dde04ee1e22ab248118a25d611037",
        "https://preview.redd.it/4g1drkreibsb1.jpeg?width=1080&format=pjpg&auto=webp&s=77850358062ce51dc88f2c85039065a802881ae3",
        "Flipkart is not working",
        "I have a bachelors degree in Transportation Design, have worked as a freelancer to design logos, created on paintings on commission, have good 3D modelling skills in Maya and Alias. Good Photoshop and illustrator skills. \n\nhttps://www.behance.net/gallery/155751619/Design-Portfolio-2022\n\nTurin, Italy. But my hometown is New Delhi, India.\n\nPersonal message, thank you!",
        "Content/News writer with expertise in entertainment and sports niche. Have been working as a movie reviewer for 5 years - freelancing.\n3 month full time job at DNP India as a sports news writer.\nLocation - Noida/NCR. Can relocate as well \nPreffered way to contact - DM\n\n\nhttps://www.dnpindia.in/sports/asian-games-2023-indian-womens-team-thrashes-bangladesh-to-qualify-for-the-finals-pakistan-challenge-ahead-read-here/308601/?amp=1",
        "Hey everyone… I just found this Indian online university called “Amity University online” \n\nAnd was wondering if they’re legit, they asked for the tution before I even applied or uploaded my documents, felt kinda sus… \n\nThanx",
        "Try upwork",
        "Is this sarcasm?",
        "Is this sarcasm?",
        "No",
        " \n\n### \"Hunger in India: What the Numbers Say and What the Government Claims\"\n\n[https://gpamultimedia.blogspot.com/2023/10/hunger-in-india-what-numbers-say-and.html](https://gpamultimedia.blogspot.com/2023/10/hunger-in-india-what-numbers-say-and.html)",
        "Profile: Sales CRM Executive\nCompany: Smartcoach Technologies Inc\nLocation: Mumbai\nWebsite: www.smartcoach.tech\nRnR:\n\n1. Responsible for researching, producing and implementing a successful sales strategy\n2. Identifying sales leads and potential new clients, & \n3. facilitating top-notch communication and coordination with existing and potential clients.\n\nPls DM or send in your resume at support@smartcoach.tech"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "im student needs make money afford buying textbooks dont qualifications make advertisements social media please hire require advertisement dm discuss prices heres work comment replies flipkart working bachelors degree transportation design worked freelancer design logos created paintings commission good modelling skills maya alias good photoshop illustrator skills turin italy hometown new delhi india personal message thank contentnews writer expertise entertainment sports niche working movie reviewer years freelancing month full time job dnp india sports news writer location noidancr relocate well preffered way contact dm hey everyone found indian online university called amity university online wondering theyre legit asked tution even applied uploaded documents felt kinda sus thanx try upwork sarcasm sarcasm hunger india numbers say government claims httpsgpamultimediablogspotcomhungerinindiawhatnumberssayandhtmlhttpsgpamultimediablogspotcomhungerinindiawhatnumberssayandhtml profile sales crm executive company smartcoach technologies inc location mumbai website rnr responsible researching producing implementing successful sales strategy identifying sales leads potential new clients facilitating topnotch communication coordination existing potential clients pls dm send resume supportsmartcoachtech",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I'm a student who needs to make some money to afford buying textbooks and such. I don't have any qualifications but I make advertisements for social media. Please hire me if you require an advertisement. DM and we can discuss prices. Here's my work, more in comment replies— Flipkart is not working I have a bachelors degree in Transportation Design, have worked as a freelancer to design logos, created on paintings on commission, have good 3D modelling skills in Maya and Alias. Good Photoshop and illustrator skills. Turin, Italy. But my hometown is New Delhi, India. Personal message, thank you! Content/News writer with expertise in entertainment and sports niche. Have been working as a movie reviewer for 5 years - freelancing. 3 month full time job at DNP India as a sports news writer. Location - Noida/NCR. Can relocate as well Preffered way to contact - DM Hey everyone… I just found this Indian online university called “Amity University online” And was wondering if they’re legit, they asked for the tution before I even applied or uploaded my documents, felt kinda sus… Thanx Try upwork Is this sarcasm? Is this sarcasm? No ### \"Hunger in India: What the Numbers Say and What the Government Claims\" [https://gpamultimedia.blogspot.com/2023/10/hunger-in-india-what-numbers-say-and.html](https://gpamultimedia.blogspot.com/2023/10/hunger-in-india-what-numbers-say-and.html) Profile: Sales CRM Executive Company: Smartcoach Technologies Inc Location: Mumbai Website: RnR: 1. Responsible for researching, producing and implementing a successful sales strategy 2. Identifying sales leads and potential new clients, & 3. facilitating top-notch communication and coordination with existing and potential clients. Pls DM or send in your resume at support@smartcoach.tech"
}