{
    "id": "1asgymq",
    "title": "Pizza hut is a goddamn scam.....will never order from pizza hut",
    "url": "https://www.reddit.com/gallery/1asgymq",
    "selftext": "Tl;dr - The pizza i ordered from pizza hut (pic 3) looks nothing like the picture (pic 1 and pic 2), not even 20% close to the advertised pic\n\nNow i'd like to rant about my experience\n\nHi, I am really upset and would like to share my shitty pizza hut experience.\n\nYes I know that a lot of you must be thinking that im an idiot that i ordered from PIZZA HUT when are are multiple better alternatives, but just hear me out please!\n\nI was really hungry today and wanted to fill my stomach, but I wanted to eat something good. Now initially, I thought I can just order 2 subways and call it a day. But my dumb ass wanted to have something else coz i just recently had subway. Then it came across my mind that I haven't eaten pizza in a while. I could've fucking eaten anything but PIZZA, but no I had to eat pizza. I opened zomato and saw that Pizza F-ing Hut is offering some valentines day combo that serves 2 people. I would like to remind y'all that i was really damn hungry, so I looked at the combo which served 2 people. I knew that I could finish that shit easily coz I know my apetite. So i ordered Chicken Sausage Valentines special combo viz. Chicken Sausage medium pizza, EXOTICA VEGGIE GARLIC BREAD and pepsi. Not just that, Zomato even gave me some free EXOTICA KHEEMA GARLIC BREAD.\n\nNow the food looked really good in those pictures. I was so excited to see that I was getting a lot to eat @ just 470rs that I even used zomato's augmented reality (pic 2) to see how my food's going to look. I know that it would not going to look the same, but I didnt expect pizza hut to pack shit and some mayo on top and deliver it to me. The pizza was terrible, but those Garlic Bread, they looked f-ing horrendous. If you look at the pics that i've shared, you can see the first picture which is from the zomato menu and the second picture is from the augmented reality feature from zomato. The third picture is the reality, the shit i got from pizza hut. The garlic bread was literally a piece of bread, a little squeeze of mayo and some sad-ass veggies. The Kheema Garlic Bread also was shitty (did not click pictures of that), but it was just as horrible as this veggie garlic bread. \n\nI am extremely disappointed and it instantly killed my hunger, but i had to stuff this inside me because I did not want to waste food. But pizza hut is f-ing shit and i would recommend everyone to stop ordering from Pizza Hut",
    "flair": "Rant / Vent",
    "score": 751,
    "num_comments": 162,
    "created_utc": 1708111010.0,
    "convurl": "https://i.redd.it/w319h5hzyzic1.jpg",
    "comments": [
        "damn 💀 that's tough \n\njokes aside you should contact Zomato support and put the above description in there they *might*  refund you",
        "It looks so bad. 😭😭😭",
        "it's awful",
        "Pizaa Hut be like :- gotcha bitch,                             Loot liya Bhai ko ",
        "I reported to zomato, i got 120rs coupon thanks",
        "bhai isse ganda aaj tak kn khaaya",
        "120 rupees mein kaunsa pizza aata hai woh bhi pizza hut ka",
        "Brooo no way I just had this for dinner but mine was proper lmao sorry for you",
        "The storytelling makes this post. Bravo, OP.",
        "Lmfaooooo",
        "Unlike dominos, pizza hut does have a problem woth consistency.  A branch would be way better than another. So while I like thier pizzas more, i tend to skip it if it is an untried branch. \n\nThey are losing out a great deal of business because  of this. Esp now that even normal cafes are churning out really good pizzas",
        "wow\npizza hut is shit honestly",
        "lmao i just wanted to vent",
        "kuch to mil gya bhai 🤧",
        "Why would you order from pizza hut for good pizza?",
        "bro read my story, you'll know\nbut ok i'll tell you irrespective\nI was FUCKING HUNGRY AND I GOT A GOOD DEAL FOR JUST 470RS\nlittle did i know that I bought shit for 470rs",
        "Reality is often disappointing🥲",
        "No man, ask for the full refund. They know people fall for \"kuch to mila\" trap. You were cheated and you deserve the full refund. Food prices on zomato and pizza hut are already hiked, they charge packaging and taxes and add 70-100 rupees like this.",
        "Kisko puchu bhai? udhr kuch baat karne ke liye option hi nhi h",
        "To be honest, most western style foods are over rated and overpriced.",
        "TF is that??? Looks like someone pooped white shit with some decorations on pizza base. Bruhhh i need Eyebleach please",
        "Order history mein jaa karke report karo",
        "udhr hi to 120rs mila, ab udhr aur kuch option nahi aaray\nek toh waha vo bot hi rehtay, koi human nahi hai",
        "Hey I am sry pic 1 and 2 also looks bad how can you order that.",
        "I like it more than dominos ngl. To each their own ig",
        "Bro that's not pizza. That's garlic bread. Plain and simple.",
        "Bro i was damn hungry, and they dont look as bad as the food i've received",
        "You call this pizza?",
        "Were you scammed like domino pizza, the pizza hut pizzas I order are great.",
        "This is pizza hut dude",
        "It's different for every branch lol, the one where you got yours is probably shit lol",
        "Lmfao",
        "open a new ticket bro and start a new claim process if you email them also they will look into it and give u a full refund",
        "Pizza Hut used to be golden back when I was 12 - 15 for reference I'm 22 now so around a decade ago, I eat shit food a lot and have ordered from every place including pizza Hut a bunch of times and by a bunch I mean a lot and I've seen the quality slowly decline I'm pretty sure they're going to run out of business and close shop in india. The cheese in their garlic breads and breadsticks got replaced with mayo and the amount of cheese you get on the pizzas is like the 3 kishmish I receive from the pundit during pujas. (Plus mayo in pasta). Don't order from their anymore. Rather let the business shut than tolerate shit business especialy in the fast food industry.",
        "There’s plenty that’s good. Ordering from a fast food place is not gonna get you the good stuff.",
        "Pizza Hut is the bottom of the barrel in the United States. As for the pictured, I'm not even sure what that is. \"Texas toast\" with a few squirts of cheese and minced veggies I guess.",
        "there is no option to start a new ticket",
        "bhai yaar yeh to kya ka kya nikla. Thank god i don't order from pizza hut.",
        "Lmao... I wouldn't order that shit advertised on 1 and 2",
        "No way",
        "Wo pizza nahi hai bread hai",
        "This is the same thing you experience when you order from AliExpress/ temu/ shein lol",
        "Thats hilarious lmao i feel bad for you op",
        "I was thinking the same. It is the same shit better put together. OP walk down and get street food lol.",
        "Damn 💀",
        "Ffs can't believe pizza hut is being stingy with cheese but a street sandwich vendor goes crazy with it",
        "we have the same issues with pizza hut in the states. I dunno what happened to pizza hut over the last 20-30 years but the brand is ruined everywhere it seems :/",
        "You've ordered Garlic Bread dude. Pic 2 clearly says it's Garlic Bread.",
        "Bruschetta Hut",
        "I really feel sad for Pizza Hut. It was really far better than dominos and other brands in early to mid 2000s.",
        "Most western style food tastes nothing like western style food in India. Almost every western fast food restaurant I tried in India was disappointing.",
        "Garlic bread, I've ordered from swiggy last month, the bread only cost me around 150 with some coupon and got 4 pieces as shown in the first pic..",
        "You didn’t order a pizza lol you ordered garlic bread with some toppings on it.",
        "Pizza hut tastes like cardboard",
        "Pizza Hut is shit, ordered their pizza and it almost had no sausein it and the cheese was burned . But in the middle east it’s amazing . Choose local shops over pizza hut",
        "Complaint on Twitter",
        "That ain’t a pizza tho?",
        "Vent about something that isn’t pizza.",
        "r/ExpectationVsReality",
        "“Aa bail mujhe maar” type beat\nPizza Hut is known for being trash. You learnt why the hard way.",
        "I write all the restaurants name in notes you remind not to order from this place",
        "You guys put mayo on garlic bread? 🤔 That aside the first 2 pics are diced veg, you got chopped and not enough because workers weren't skilled or didn't care. This was enjoyable to read tho.",
        "My family sat on the pavement by the road while we waited for a table when Pizza Hut first came to India. Sad to hear quality is so bad today.",
        "Sorry for this... Same is for oven story. Worst is they sent the pizza cold every damn time i ordered. I had to reheat it. Does anyone  have any idea is that normal",
        "Lost my shit when I opened pic 3 lmaoooo",
        "They will die soon. Quality is none",
        "Who orders from pizza hut?\nThere are plenty of other options. PH is dead.",
        "Ideally, if they didn't refund you the whole amount, you could have followed the proper procedures of approaching a consumer forum. You can even post it on the online consumer forum. They actually do followup.\n\nSecondly, I'm very serious about what I'm saying: Please stop ordering pizzas from anywhere. I stopped ordering bread and pizzas a year ago because they caused me stomach pain. When I started making it at home, I realized how unbelievably easy it is to make it. Bread turns out really tasty. Pizzas are even more tasty. They never cause stomach issues, and I can add as much of toppings as I want and can even add real cheese. Some conflicting info about cheese [here](https://edtimes.in/dominos-using-a-lot-of-synthetic-cheese-and-chemicals-but-indian-media-doesnt-cover-it/) and [here](https://www.jubilantfoodworks.com/Uploads/Files/126akmfile-Offical-Statement.pdf). Just buy a good oven and bake! You are in full control of the quality of the ingredients. Long back someone posted the \"realities\" of working in their industry, and said that he saw a bakery worker drop a whole batch of bread on the floor and he just picked it up without even dusting it, and it was sold to the customer.",
        "Man pizza Hut is the worst! I don't know how they are still running. Last time I went there only because Domino's was shut. The pizza was so bad and hard plus toppings were bland.",
        "Crust looks like huge loaf of bread was sliced to make the crust. So pizza Hut doesn't make the crust from scratch for each pizza?\n\nI personally hate any online delivered food they are most of the time shitty and expensive.",
        "What's the second picture? Is it AR?",
        "Last time I ordered 2 Pizzas from Pizza Hut, they literally just had their disgusting pizza like white sauce on it, which nothing but mayonnaise!\n\n\nThere was NO real cheese in sight. Even the other toppings like capsicum, olives, onion etc were very little in quantity.\n\n\nSo basically the pizza was just the circular pizza bread base, tomato sauce and the disgusting mayonnaise in place of cheese and some miniscule topping.",
        "Pizza hut is really bad. Once I ordered some pizza from there and what I got was some spongy bread base with mayo and some vegetables on top. It tasted like regular bread.\nEven Domino's is not good and value for money.\nIts better to order from a local pizza shop or cafe.",
        "Why does the cheese looks like Godzilla c*m on 3rd pic ?",
        "Lodge a complaint on Pizza hut website/customer care number. I used to order a lot from Pizza hut before covid, and I remember their service being nice. Upon raising a complaint, they would get the manager of said branch to call and usually offered a meal replacement free of cost.",
        "Bro.. That's not even Pizza, look like toasted bread with some toppings on it.",
        "Twitter pe daal refund milega",
        "I once ordered garlic bread from Pizza Hut long back. Never ordered it again. \nI used to order Dominos until an year ago but found them lacking in quality recently so switched to Pizza Hut. I think quality is dependent on the outlet you order from. There is one just opposite to my house and it serves yummy hot pizzas with fluffy base and delicious toppings. I always go for their Schezwan corn capsicum and capsicum Onion. Costs around 150-200 depending on offer and app. Worth!",
        "I happened to go to a Pizza Hut after 15+ years and they dished out a crappy pizza (375rs) which nobody would eat. Unevenly cooked base. Not enough topping, mediocre liquid cheese!!  \n\nI think street side vendors provide top quality pizza for rs 100 instead of this Pizza Hut. \n\nSeriously Dominos is way better than them, even though I find Domino's pizzas very bland & dry! \n\nHave decided I will never go to any of these pizza chains ever from now on!",
        "Lol 😂😂😂",
        "The abruptness of the last picture made this post lol\n\nHaving said that, there is a reason why they add that disclaimer 'Photos of the product are only for representational purpose' because more than often, this is what happens. And if someone tries to sue them for it, they will say we warned you.",
        "What you received actually looks BETTER than the menu pics.  Still gross, though.",
        "doesnt change the fact that it was shit",
        "that's mayo lmao\nit's not even cheese",
        "i was hungry and i was getting plenty of food for under 500rs\nbut i would never order again from PH",
        "At this rate OP, next time if you were to order from here, you'll only get the toppings minus the bread.",
        "yes",
        "Talk to zomato/food app customer care, they'll get your refund.",
        "no way",
        "Always tweet in such cases. Did it multiple times and always works",
        "Bro, that looks straight ass. No way would I accept this. Showed it to my wife as well she had to do a double take after I explained the sequence of photos.",
        "🤣",
        "i have tweeted",
        "exactly that last picture looks like shit",
        "That explains why I never liked their pizza, I have only ever been to a single branch",
        "yes Street food is much better than these scamsters",
        "https://twitter.com/ThepaChaap/status/1758587119206035481?t=G3PC67ZB0VU-_4XZQThOow&s=19",
        "https://twitter.com/ThepaChaap/status/1758587119206035481?t=G3PC67ZB0VU-_4XZQThOow&s=19",
        "they should shut shop in India",
        "Damn, that's dough",
        "pls dont order from pizza hut",
        "https://twitter.com/ThepaChaap/status/1758587119206035481?t=G3PC67ZB0VU-_4XZQThOow&s=19\n\nalready done",
        "yes no problem you can laugh about it\nthat's exactly why I even wrote this post so people can laugh about it,but at the same time they'll know pizza hut's standards",
        "Domino's>>>>>>>>>>>>>>>>>>>>pizza hut",
        "both are trash\ndominos is less trash",
        "Where do you order pizza from then? Recommend some",
        "This is what happens when u franchise...",
        "Mojo Pizza, Oven Story",
        "exactly",
        "But they have no cheese crust right?",
        "Orders a thing, receives the exact same thing; Pizza Hut is a Scam 🗿",
        "Where in the app do I get this option?",
        "It was there somewhere below",
        "I really liked their pizza about 8 years ago I think when I went with my friends. I remembered that and went 1 year ago to the same branch. It was shit. Total bullshit. Never going back there ever again",
        "They have",
        "dude look at those pictures\nthey do not look the same",
        "Apart from the mayo not being spread all the way, literally everything is the same\nThe bread was toasted and had those veggie toppings",
        "Mayo is the whole point....it's about how you make it, if you cannot fucking make it properly, then that's obviously a problem.",
        "On their website/helpline",
        "yes I have emailed them thank you",
        "First of all, thats garlic bread",
        "always order from your local stores",
        "Bro I laughed way too hard😂",
        "Whats you expect in rs 160 😂",
        "2-3 things in pizza Hut's defence come to mind.\n\n- Pizzas taste best when they come out of the oven straight to your table. That is to say that dining there in the restaurant, the food is hot and fresh and tastes better.\n\n- If you have to order home delivery then I would prefer ordering directly from Domino's or Pizza Hut. That is, not through Zomato or Swiggy. Zomato Swiggy take their own sweet time to deliver and many times food isn't handled properly and the pizza sticks to the box and in general you get a mess. The Domino's or pizza Hut guys deliver faster and better in my opinion as they have a single order to cater to and better thermal bags etc.\n\n- To impress upon point 1, I've also seen restaurants do a better job when the customer is there, sitting in front of them as compared to when they have to hand it over to a delivery guy, where they do a \"casual\" job. I think you were a victim of this. They think customer is not there to complain and there are so many other factors to blame, if they do complain, that they do a poor job as can be seen in the difference between what they advertise and what they actually give to Zomato delivery guy.\n\n- Lastly the cold weather spoils the food. I know cold weather doesn't reduce the garlic bread topping quantity and amount is cheese used, agreed, but whatever they put, that can also be enjoyed if served fresh and hot. And that is not possible in cold weather. \n\n- Final last point - the food you get and the food in the photos is never the same. It's advertising. Accordingly you should not even expect the same. I know this is frustrating, but that's the way it is. I'm India people don't take quality and standards seriously and therefore they save costs by producing poor quality products. This happens everywhere, not just the food industry. The few people who complain and fight it in consumer courts get 3000₹ or so in compensation but for most people it's not worth the effort. It's just easier to lower expectations and at least stay happy. \n\nI'm not condoning the action of pizza Hut. They should have done better. They are exploiting us in a way because we don't raise our voice. Surely. If it really means that much to you, you should sue them in court. But otherwise just let it go. Choose your battles wisely.",
        "Isn't it the same thing? Bruh.... the difference is that the cheese is not evenly spread out and the vegetables are more roughly cut.\n\nBut yeah, they could've made it better. Although i doubt the taste will change much though",
        "Slap on tomato ketchup for everything. Western food in India sucks.",
        "bhai tera to ganda waala kaata",
        "I stopped ordering from Pizza hut, the day I realized that they used Mayo and Cream cheese on Pizza. The taste was disgusting, thankfully it was a personal size, so I didn't have to suffer for long.\n\nI really wanted to vomit at every bite.",
        "The 3rd one is from Jizza Hut.",
        "Unlike dominos? Bro Dominos have the same issue. Some of their outlets are decent while some utter shit.\n\nGood thing is that local pizzeria game is now really good. It's been 4-5 years since I ordered from Dominos or Pizza hut",
        "I've had the (mis)fortune of trying Pizza Hut in multiple different countries, and from my experience i can confidently gather one thing : Pizza Hut is really consistent. I've never really come across a chain that's nearly as consistent.\n\nConsistently dogshit, that is.",
        "Bro does Pizza Hut do this in every city? It happened with me every time I ordered online. (Sometimes offline too). Totally bad. Domino's is better imo.",
        "Try mozo pizza next time",
        "What you received is from cloud kitchen of pizza hut. Untrained, no professional people cook in unhygienic conditions and dont follow steps in cloud kitchens as compared to proper restaurants.",
        "also because pizza hut operates half of its business from cloud kitchens. You really dont want to see who, in what conditions and how cooks food in these cloud kitchens. ",
        "Are you sure mayo? Usually, they use liquid cheese (still cheap, but not mayo).",
        "It's the same with all the companies under yum brands which includes KFC and Taco Bell. In my city we had two KFCs. One is way better than the other.",
        "I still remember once ordering a singer burger from KFC for 180+rs. I was shocked to see the size of the chicken. I took my weight scale to check its weight, it weighed just 80g. Bhai I can get 400g chicken pakoda for this price. Stopped buying from new branches after that. Stuck to the branches I know have good standards and quality control.",
        "🤣🤣🤣",
        "Veg mayonnaise is one of the worst things to put on pizzas and garlic breads. It's cheaper than cheese, tastes awful, and feels worse in the stomach since it is almost all refined oil.",
        "I only eat Domino’s because of Cheese Burst",
        "Rich people problems be like",
        "But it's not pizza, the item in the menu is clearly stated as Garlic bread? ",
        "I don't know why OP called it pizza because in the menu pic, it's listed as Garlic bread..",
        "Yeah i had it confused.",
        "ik it's garlic bread, but that shit just looks so bad",
        "r/shittyfoodporn",
        "Dude that’s how they’re supposed to look, and me and my friends love the taste, what are you yapping about man",
        "/s?",
        "its not a /s, ive never had a bad experience with them, and ive eaten in 5 different branches of theirs",
        "good for you?",
        "Chuthya katgai ..",
        "Every big foreign chain in India is a scam",
        "This coupon will also expire in 3-4 days. I had a hundred rupees coupon I got for late delivery, it expired as I forgot about it.",
        "Indeed",
        "People are getting scammed by scammers using names like domino pizza, dominos pizza instead of the original Domino's pizza. So suggested to check if it was a genuine place you ordered."
    ],
    "cleaned_text": "pizza hut goddamn scamwill never order pizza hut tldr pizza ordered pizza hut pic looks nothing like picture pic pic even close advertised pic id like rant experience hi really upset would like share shitty pizza hut experience yes know lot must thinking im idiot ordered pizza hut multiple better alternatives hear please really hungry today wanted fill stomach wanted eat something good initially thought order subways call day dumb ass wanted something else coz recently subway came across mind havent eaten pizza couldve fucking eaten anything pizza eat pizza opened zomato saw pizza fing hut offering valentines day combo serves people would like remind yall really damn hungry looked combo served people knew could finish shit easily coz know apetite ordered chicken sausage valentines special combo viz chicken sausage medium pizza exotica veggie garlic bread pepsi zomato even gave free exotica kheema garlic bread food looked really good pictures excited see getting lot eat rs even used zomatos augmented reality pic see foods going look know would going look didnt expect pizza hut pack shit mayo top deliver pizza terrible garlic bread looked fing horrendous look pics ive shared see first picture zomato menu second picture augmented reality feature zomato third picture reality shit got pizza hut garlic bread literally piece bread little squeeze mayo sadass veggies kheema garlic bread also shitty click pictures horrible veggie garlic bread extremely disappointed instantly killed hunger stuff inside want waste food pizza hut fing shit would recommend everyone stop ordering pizza hut ",
    "cleaned_title": "pizza hut goddamn scamwill never order pizza hut",
    "cleaned_selftext": "tldr pizza ordered pizza hut pic looks nothing like picture pic pic even close advertised pic id like rant experience hi really upset would like share shitty pizza hut experience yes know lot must thinking im idiot ordered pizza hut multiple better alternatives hear please really hungry today wanted fill stomach wanted eat something good initially thought order subways call day dumb ass wanted something else coz recently subway came across mind havent eaten pizza couldve fucking eaten anything pizza eat pizza opened zomato saw pizza fing hut offering valentines day combo serves people would like remind yall really damn hungry looked combo served people knew could finish shit easily coz know apetite ordered chicken sausage valentines special combo viz chicken sausage medium pizza exotica veggie garlic bread pepsi zomato even gave free exotica kheema garlic bread food looked really good pictures excited see getting lot eat rs even used zomatos augmented reality pic see foods going look know would going look didnt expect pizza hut pack shit mayo top deliver pizza terrible garlic bread looked fing horrendous look pics ive shared see first picture zomato menu second picture augmented reality feature zomato third picture reality shit got pizza hut garlic bread literally piece bread little squeeze mayo sadass veggies kheema garlic bread also shitty click pictures horrible veggie garlic bread extremely disappointed instantly killed hunger stuff inside want waste food pizza hut fing shit would recommend everyone stop ordering pizza hut",
    "cleaned_comments": "damn thats tough jokes aside contact zomato support put description might refund looks bad awful pizaa hut like gotcha bitch loot liya bhai ko reported zomato got rs coupon thanks bhai isse ganda aaj tak kn khaaya rupees mein kaunsa pizza aata hai woh bhi pizza hut ka brooo way dinner mine proper lmao sorry storytelling makes post bravo op lmfaooooo unlike dominos pizza hut problem woth consistency branch would way better another like thier pizzas tend skip untried branch losing great deal business esp even normal cafes churning really good pizzas wow pizza hut shit honestly lmao wanted vent kuch mil gya bhai would order pizza hut good pizza bro read story youll know ok ill tell irrespective fucking hungry got good deal rs little know bought shit rs reality often disappointing man ask full refund know people fall kuch mila trap cheated deserve full refund food prices zomato pizza hut already hiked charge packaging taxes add rupees like kisko puchu bhai udhr kuch baat karne ke liye option hi nhi h honest western style foods rated overpriced tf looks like someone pooped white shit decorations pizza base bruhhh need eyebleach please order history mein jaa karke report karo udhr hi rs mila ab udhr aur kuch option nahi aaray ek toh waha vo bot hi rehtay koi human nahi hai hey sry pic also looks bad order like dominos ngl ig bro thats pizza thats garlic bread plain simple bro damn hungry dont look bad food ive received call pizza scammed like domino pizza pizza hut pizzas order great pizza hut dude different every branch lol one got probably shit lol lmfao open new ticket bro start new claim process email also look give u full refund pizza hut used golden back reference im around decade ago eat shit food lot ordered every place including pizza hut bunch times bunch mean lot ive seen quality slowly decline im pretty sure theyre going run business close shop india cheese garlic breads breadsticks got replaced mayo amount cheese get pizzas like kishmish receive pundit pujas plus mayo pasta dont order anymore rather let business shut tolerate shit business especialy fast food industry theres plenty thats good ordering fast food place gon na get good stuff pizza hut bottom barrel united states pictured im even sure texas toast squirts cheese minced veggies guess option start new ticket bhai yaar yeh kya ka kya nikla thank god dont order pizza hut lmao wouldnt order shit advertised way wo pizza nahi hai bread hai thing experience order aliexpress temu shein lol thats hilarious lmao feel bad op thinking shit better put together op walk get street food lol damn ffs cant believe pizza hut stingy cheese street sandwich vendor goes crazy issues pizza hut states dunno happened pizza hut last years brand ruined everywhere seems youve ordered garlic bread dude pic clearly says garlic bread bruschetta hut really feel sad pizza hut really far better dominos brands early mid western style food tastes nothing like western style food india almost every western fast food restaurant tried india disappointing garlic bread ive ordered swiggy last month bread cost around coupon got pieces shown first pic didnt order pizza lol ordered garlic bread toppings pizza hut tastes like cardboard pizza hut shit ordered pizza almost sausein cheese burned middle east amazing choose local shops pizza hut complaint twitter aint pizza tho vent something isnt pizza rexpectationvsreality aa bail mujhe maar type beat pizza hut known trash learnt hard way write restaurants name notes remind order place guys put mayo garlic bread aside first pics diced veg got chopped enough workers werent skilled didnt care enjoyable read tho family sat pavement road waited table pizza hut first came india sad hear quality bad today sorry oven story worst sent pizza cold every damn time ordered reheat anyone idea normal lost shit opened pic lmaoooo die soon quality none orders pizza hut plenty options ph dead ideally didnt refund whole amount could followed proper procedures approaching consumer forum even post online consumer forum actually followup secondly im serious im saying please stop ordering pizzas anywhere stopped ordering bread pizzas year ago caused stomach pain started making home realized unbelievably easy make bread turns really tasty pizzas even tasty never cause stomach issues add much toppings want even add real cheese conflicting info cheese herehttpsedtimesindominosusingalotofsyntheticcheeseandchemicalsbutindianmediadoesntcoverit herehttpswwwjubilantfoodworkscomuploadsfilesakmfileofficalstatementpdf buy good oven bake full control quality ingredients long back someone posted realities working industry said saw bakery worker drop whole batch bread floor picked without even dusting sold customer man pizza hut worst dont know still running last time went dominos shut pizza bad hard plus toppings bland crust looks like huge loaf bread sliced make crust pizza hut doesnt make crust scratch pizza personally hate online delivered food time shitty expensive whats second picture ar last time ordered pizzas pizza hut literally disgusting pizza like white sauce nothing mayonnaise real cheese sight even toppings like capsicum olives onion etc little quantity basically pizza circular pizza bread base tomato sauce disgusting mayonnaise place cheese miniscule topping pizza hut really bad ordered pizza got spongy bread base mayo vegetables top tasted like regular bread even dominos good value money better order local pizza shop cafe cheese looks like godzilla cm rd pic lodge complaint pizza hut websitecustomer care number used order lot pizza hut covid remember service nice upon raising complaint would get manager said branch call usually offered meal replacement free cost bro thats even pizza look like toasted bread toppings twitter pe daal refund milega ordered garlic bread pizza hut long back never ordered used order dominos year ago found lacking quality recently switched pizza hut think quality dependent outlet order one opposite house serves yummy hot pizzas fluffy base delicious toppings always go schezwan corn capsicum capsicum onion costs around depending offer app worth happened go pizza hut years dished crappy pizza rs nobody would eat unevenly cooked base enough topping mediocre liquid cheese think street side vendors provide top quality pizza rs instead pizza hut seriously dominos way better even though find dominos pizzas bland dry decided never go pizza chains ever lol abruptness last picture made post lol said reason add disclaimer photos product representational purpose often happens someone tries sue say warned received actually looks better menu pics still gross though doesnt change fact shit thats mayo lmao even cheese hungry getting plenty food rs would never order ph rate op next time order youll get toppings minus bread yes talk zomatofood app customer care theyll get refund way always tweet cases multiple times always works bro looks straight ass way would accept showed wife well double take explained sequence photos tweeted exactly last picture looks like shit explains never liked pizza ever single branch yes street food much better scamsters shut shop india damn thats dough pls dont order pizza hut already done yes problem laugh thats exactly even wrote post people laugh itbut time theyll know pizza huts standards dominospizza hut trash dominos less trash order pizza recommend happens u franchise mojo pizza oven story exactly cheese crust right orders thing receives exact thing pizza hut scam app get option somewhere really liked pizza years ago think went friends remembered went year ago branch shit total bullshit never going back ever dude look pictures look apart mayo spread way literally everything bread toasted veggie toppings mayo whole pointits make fucking make properly thats obviously problem websitehelpline yes emailed thank first thats garlic bread always order local stores bro laughed way hard whats expect rs things pizza huts defence come mind pizzas taste best come oven straight table say dining restaurant food hot fresh tastes better order home delivery would prefer ordering directly dominos pizza hut zomato swiggy zomato swiggy take sweet time deliver many times food isnt handled properly pizza sticks box general get mess dominos pizza hut guys deliver faster better opinion single order cater better thermal bags etc impress upon point ive also seen restaurants better job customer sitting front compared hand delivery guy casual job think victim think customer complain many factors blame complain poor job seen difference advertise actually give zomato delivery guy lastly cold weather spoils food know cold weather doesnt reduce garlic bread topping quantity amount cheese used agreed whatever put also enjoyed served fresh hot possible cold weather final last point food get food photos never advertising accordingly even expect know frustrating thats way im india people dont take quality standards seriously therefore save costs producing poor quality products happens everywhere food industry people complain fight consumer courts get compensation people worth effort easier lower expectations least stay happy im condoning action pizza hut done better exploiting us way dont raise voice surely really means much sue court otherwise let go choose battles wisely isnt thing bruh difference cheese evenly spread vegetables roughly cut yeah couldve made better although doubt taste change much though slap tomato ketchup everything western food india sucks bhai tera ganda waala kaata stopped ordering pizza hut day realized used mayo cream cheese pizza taste disgusting thankfully personal size didnt suffer long really wanted vomit every bite rd one jizza hut unlike dominos bro dominos issue outlets decent utter shit good thing local pizzeria game really good years since ordered dominos pizza hut ive misfortune trying pizza hut multiple different countries experience confidently gather one thing pizza hut really consistent ive never really come across chain thats nearly consistent consistently dogshit bro pizza hut every city happened every time ordered online sometimes offline totally bad dominos better imo try mozo pizza next time received cloud kitchen pizza hut untrained professional people cook unhygienic conditions dont follow steps cloud kitchens compared proper restaurants also pizza hut operates half business cloud kitchens really dont want see conditions cooks food cloud kitchens sure mayo usually use liquid cheese still cheap mayo companies yum brands includes kfc taco bell city two kfcs one way better still remember ordering singer burger kfc rs shocked see size chicken took weight scale check weight weighed g bhai get g chicken pakoda price stopped buying new branches stuck branches know good standards quality control veg mayonnaise one worst things put pizzas garlic breads cheaper cheese tastes awful feels worse stomach since almost refined oil eat dominos cheese burst rich people problems like pizza item menu clearly stated garlic bread dont know op called pizza menu pic listed garlic bread yeah confused ik garlic bread shit looks bad rshittyfoodporn dude thats theyre supposed look friends love taste yapping man ive never bad experience ive eaten different branches good chuthya katgai every big foreign chain india scam coupon also expire days hundred rupees coupon got late delivery expired forgot indeed people getting scammed scammers using names like domino pizza dominos pizza instead original dominos pizza suggested check genuine place ordered",
    "light_cleaned_title": "Pizza hut is a goddamn scam.....will never order from pizza hut",
    "light_cleaned_selftext": "Tl;dr - The pizza i ordered from pizza hut (pic 3) looks nothing like the picture (pic 1 and pic 2), not even 20% close to the advertised pic Now i'd like to rant about my experience Hi, I am really upset and would like to share my shitty pizza hut experience. Yes I know that a lot of you must be thinking that im an idiot that i ordered from PIZZA HUT when are are multiple better alternatives, but just hear me out please! I was really hungry today and wanted to fill my stomach, but I wanted to eat something good. Now initially, I thought I can just order 2 subways and call it a day. But my dumb ass wanted to have something else coz i just recently had subway. Then it came across my mind that I haven't eaten pizza in a while. I could've fucking eaten anything but PIZZA, but no I had to eat pizza. I opened zomato and saw that Pizza F-ing Hut is offering some valentines day combo that serves 2 people. I would like to remind y'all that i was really damn hungry, so I looked at the combo which served 2 people. I knew that I could finish that shit easily coz I know my apetite. So i ordered Chicken Sausage Valentines special combo viz. Chicken Sausage medium pizza, EXOTICA VEGGIE GARLIC BREAD and pepsi. Not just that, Zomato even gave me some free EXOTICA KHEEMA GARLIC BREAD. Now the food looked really good in those pictures. I was so excited to see that I was getting a lot to eat @ just 470rs that I even used zomato's augmented reality (pic 2) to see how my food's going to look. I know that it would not going to look the same, but I didnt expect pizza hut to pack shit and some mayo on top and deliver it to me. The pizza was terrible, but those Garlic Bread, they looked f-ing horrendous. If you look at the pics that i've shared, you can see the first picture which is from the zomato menu and the second picture is from the augmented reality feature from zomato. The third picture is the reality, the shit i got from pizza hut. The garlic bread was literally a piece of bread, a little squeeze of mayo and some sad-ass veggies. The Kheema Garlic Bread also was shitty (did not click pictures of that), but it was just as horrible as this veggie garlic bread. I am extremely disappointed and it instantly killed my hunger, but i had to stuff this inside me because I did not want to waste food. But pizza hut is f-ing shit and i would recommend everyone to stop ordering from Pizza Hut",
    "light_cleaned_comments": "damn 💀 that's tough jokes aside you should contact Zomato support and put the above description in there they *might* refund you It looks so bad. 😭😭😭 it's awful Pizaa Hut be like :- gotcha bitch, Loot liya Bhai ko I reported to zomato, i got 120rs coupon thanks bhai isse ganda aaj tak kn khaaya 120 rupees mein kaunsa pizza aata hai woh bhi pizza hut ka Brooo no way I just had this for dinner but mine was proper lmao sorry for you The storytelling makes this post. Bravo, OP. Lmfaooooo Unlike dominos, pizza hut does have a problem woth consistency. A branch would be way better than another. So while I like thier pizzas more, i tend to skip it if it is an untried branch. They are losing out a great deal of business because of this. Esp now that even normal cafes are churning out really good pizzas wow pizza hut is shit honestly lmao i just wanted to vent kuch to mil gya bhai 🤧 Why would you order from pizza hut for good pizza? bro read my story, you'll know but ok i'll tell you irrespective I was FUCKING HUNGRY AND I GOT A GOOD DEAL FOR JUST 470RS little did i know that I bought shit for 470rs Reality is often disappointing🥲 No man, ask for the full refund. They know people fall for \"kuch to mila\" trap. You were cheated and you deserve the full refund. Food prices on zomato and pizza hut are already hiked, they charge packaging and taxes and add 70-100 rupees like this. Kisko puchu bhai? udhr kuch baat karne ke liye option hi nhi h To be honest, most western style foods are over rated and overpriced. TF is that??? Looks like someone pooped white shit with some decorations on pizza base. Bruhhh i need Eyebleach please Order history mein jaa karke report karo udhr hi to 120rs mila, ab udhr aur kuch option nahi aaray ek toh waha vo bot hi rehtay, koi human nahi hai Hey I am sry pic 1 and 2 also looks bad how can you order that. I like it more than dominos ngl. To each their own ig Bro that's not pizza. That's garlic bread. Plain and simple. Bro i was damn hungry, and they dont look as bad as the food i've received You call this pizza? Were you scammed like domino pizza, the pizza hut pizzas I order are great. This is pizza hut dude It's different for every branch lol, the one where you got yours is probably shit lol Lmfao open a new ticket bro and start a new claim process if you email them also they will look into it and give u a full refund Pizza Hut used to be golden back when I was 12 - 15 for reference I'm 22 now so around a decade ago, I eat shit food a lot and have ordered from every place including pizza Hut a bunch of times and by a bunch I mean a lot and I've seen the quality slowly decline I'm pretty sure they're going to run out of business and close shop in india. The cheese in their garlic breads and breadsticks got replaced with mayo and the amount of cheese you get on the pizzas is like the 3 kishmish I receive from the pundit during pujas. (Plus mayo in pasta). Don't order from their anymore. Rather let the business shut than tolerate shit business especialy in the fast food industry. There’s plenty that’s good. Ordering from a fast food place is not gonna get you the good stuff. Pizza Hut is the bottom of the barrel in the United States. As for the pictured, I'm not even sure what that is. \"Texas toast\" with a few squirts of cheese and minced veggies I guess. there is no option to start a new ticket bhai yaar yeh to kya ka kya nikla. Thank god i don't order from pizza hut. Lmao... I wouldn't order that shit advertised on 1 and 2 No way Wo pizza nahi hai bread hai This is the same thing you experience when you order from AliExpress/ temu/ shein lol Thats hilarious lmao i feel bad for you op I was thinking the same. It is the same shit better put together. OP walk down and get street food lol. Damn 💀 Ffs can't believe pizza hut is being stingy with cheese but a street sandwich vendor goes crazy with it we have the same issues with pizza hut in the states. I dunno what happened to pizza hut over the last 20-30 years but the brand is ruined everywhere it seems :/ You've ordered Garlic Bread dude. Pic 2 clearly says it's Garlic Bread. Bruschetta Hut I really feel sad for Pizza Hut. It was really far better than dominos and other brands in early to mid 2000s. Most western style food tastes nothing like western style food in India. Almost every western fast food restaurant I tried in India was disappointing. Garlic bread, I've ordered from swiggy last month, the bread only cost me around 150 with some coupon and got 4 pieces as shown in the first pic.. You didn’t order a pizza lol you ordered garlic bread with some toppings on it. Pizza hut tastes like cardboard Pizza Hut is shit, ordered their pizza and it almost had no sausein it and the cheese was burned . But in the middle east it’s amazing . Choose local shops over pizza hut Complaint on Twitter That ain’t a pizza tho? Vent about something that isn’t pizza. r/ExpectationVsReality “Aa bail mujhe maar” type beat Pizza Hut is known for being trash. You learnt why the hard way. I write all the restaurants name in notes you remind not to order from this place You guys put mayo on garlic bread? 🤔 That aside the first 2 pics are diced veg, you got chopped and not enough because workers weren't skilled or didn't care. This was enjoyable to read tho. My family sat on the pavement by the road while we waited for a table when Pizza Hut first came to India. Sad to hear quality is so bad today. Sorry for this... Same is for oven story. Worst is they sent the pizza cold every damn time i ordered. I had to reheat it. Does anyone have any idea is that normal Lost my shit when I opened pic 3 lmaoooo They will die soon. Quality is none Who orders from pizza hut? There are plenty of other options. PH is dead. Ideally, if they didn't refund you the whole amount, you could have followed the proper procedures of approaching a consumer forum. You can even post it on the online consumer forum. They actually do followup. Secondly, I'm very serious about what I'm saying: Please stop ordering pizzas from anywhere. I stopped ordering bread and pizzas a year ago because they caused me stomach pain. When I started making it at home, I realized how unbelievably easy it is to make it. Bread turns out really tasty. Pizzas are even more tasty. They never cause stomach issues, and I can add as much of toppings as I want and can even add real cheese. Some conflicting info about cheese [here](https://edtimes.in/dominos-using-a-lot-of-synthetic-cheese-and-chemicals-but-indian-media-doesnt-cover-it/) and [here](https://www.jubilantfoodworks.com/Uploads/Files/126akmfile-Offical-Statement.pdf). Just buy a good oven and bake! You are in full control of the quality of the ingredients. Long back someone posted the \"realities\" of working in their industry, and said that he saw a bakery worker drop a whole batch of bread on the floor and he just picked it up without even dusting it, and it was sold to the customer. Man pizza Hut is the worst! I don't know how they are still running. Last time I went there only because Domino's was shut. The pizza was so bad and hard plus toppings were bland. Crust looks like huge loaf of bread was sliced to make the crust. So pizza Hut doesn't make the crust from scratch for each pizza? I personally hate any online delivered food they are most of the time shitty and expensive. What's the second picture? Is it AR? Last time I ordered 2 Pizzas from Pizza Hut, they literally just had their disgusting pizza like white sauce on it, which nothing but mayonnaise! There was NO real cheese in sight. Even the other toppings like capsicum, olives, onion etc were very little in quantity. So basically the pizza was just the circular pizza bread base, tomato sauce and the disgusting mayonnaise in place of cheese and some miniscule topping. Pizza hut is really bad. Once I ordered some pizza from there and what I got was some spongy bread base with mayo and some vegetables on top. It tasted like regular bread. Even Domino's is not good and value for money. Its better to order from a local pizza shop or cafe. Why does the cheese looks like Godzilla c*m on 3rd pic ? Lodge a complaint on Pizza hut website/customer care number. I used to order a lot from Pizza hut before covid, and I remember their service being nice. Upon raising a complaint, they would get the manager of said branch to call and usually offered a meal replacement free of cost. Bro.. That's not even Pizza, look like toasted bread with some toppings on it. Twitter pe daal refund milega I once ordered garlic bread from Pizza Hut long back. Never ordered it again. I used to order Dominos until an year ago but found them lacking in quality recently so switched to Pizza Hut. I think quality is dependent on the outlet you order from. There is one just opposite to my house and it serves yummy hot pizzas with fluffy base and delicious toppings. I always go for their Schezwan corn capsicum and capsicum Onion. Costs around 150-200 depending on offer and app. Worth! I happened to go to a Pizza Hut after 15+ years and they dished out a crappy pizza (375rs) which nobody would eat. Unevenly cooked base. Not enough topping, mediocre liquid cheese!! I think street side vendors provide top quality pizza for rs 100 instead of this Pizza Hut. Seriously Dominos is way better than them, even though I find Domino's pizzas very bland & dry! Have decided I will never go to any of these pizza chains ever from now on! Lol 😂😂😂 The abruptness of the last picture made this post lol Having said that, there is a reason why they add that disclaimer 'Photos of the product are only for representational purpose' because more than often, this is what happens. And if someone tries to sue them for it, they will say we warned you. What you received actually looks BETTER than the menu pics. Still gross, though. doesnt change the fact that it was shit that's mayo lmao it's not even cheese i was hungry and i was getting plenty of food for under 500rs but i would never order again from PH At this rate OP, next time if you were to order from here, you'll only get the toppings minus the bread. yes Talk to zomato/food app customer care, they'll get your refund. no way Always tweet in such cases. Did it multiple times and always works Bro, that looks straight ass. No way would I accept this. Showed it to my wife as well she had to do a double take after I explained the sequence of photos. 🤣 i have tweeted exactly that last picture looks like shit That explains why I never liked their pizza, I have only ever been to a single branch yes Street food is much better than these scamsters they should shut shop in India Damn, that's dough pls dont order from pizza hut already done yes no problem you can laugh about it that's exactly why I even wrote this post so people can laugh about it,but at the same time they'll know pizza hut's standards Domino's>>>>>>>>>>>>>>>>>>>>pizza hut both are trash dominos is less trash Where do you order pizza from then? Recommend some This is what happens when u franchise... Mojo Pizza, Oven Story exactly But they have no cheese crust right? Orders a thing, receives the exact same thing; Pizza Hut is a Scam 🗿 Where in the app do I get this option? It was there somewhere below I really liked their pizza about 8 years ago I think when I went with my friends. I remembered that and went 1 year ago to the same branch. It was shit. Total bullshit. Never going back there ever again They have dude look at those pictures they do not look the same Apart from the mayo not being spread all the way, literally everything is the same The bread was toasted and had those veggie toppings Mayo is the whole point....it's about how you make it, if you cannot fucking make it properly, then that's obviously a problem. On their website/helpline yes I have emailed them thank you First of all, thats garlic bread always order from your local stores Bro I laughed way too hard😂 Whats you expect in rs 160 😂 2-3 things in pizza Hut's defence come to mind. - Pizzas taste best when they come out of the oven straight to your table. That is to say that dining there in the restaurant, the food is hot and fresh and tastes better. - If you have to order home delivery then I would prefer ordering directly from Domino's or Pizza Hut. That is, not through Zomato or Swiggy. Zomato Swiggy take their own sweet time to deliver and many times food isn't handled properly and the pizza sticks to the box and in general you get a mess. The Domino's or pizza Hut guys deliver faster and better in my opinion as they have a single order to cater to and better thermal bags etc. - To impress upon point 1, I've also seen restaurants do a better job when the customer is there, sitting in front of them as compared to when they have to hand it over to a delivery guy, where they do a \"casual\" job. I think you were a victim of this. They think customer is not there to complain and there are so many other factors to blame, if they do complain, that they do a poor job as can be seen in the difference between what they advertise and what they actually give to Zomato delivery guy. - Lastly the cold weather spoils the food. I know cold weather doesn't reduce the garlic bread topping quantity and amount is cheese used, agreed, but whatever they put, that can also be enjoyed if served fresh and hot. And that is not possible in cold weather. - Final last point - the food you get and the food in the photos is never the same. It's advertising. Accordingly you should not even expect the same. I know this is frustrating, but that's the way it is. I'm India people don't take quality and standards seriously and therefore they save costs by producing poor quality products. This happens everywhere, not just the food industry. The few people who complain and fight it in consumer courts get 3000₹ or so in compensation but for most people it's not worth the effort. It's just easier to lower expectations and at least stay happy. I'm not condoning the action of pizza Hut. They should have done better. They are exploiting us in a way because we don't raise our voice. Surely. If it really means that much to you, you should sue them in court. But otherwise just let it go. Choose your battles wisely. Isn't it the same thing? Bruh.... the difference is that the cheese is not evenly spread out and the vegetables are more roughly cut. But yeah, they could've made it better. Although i doubt the taste will change much though Slap on tomato ketchup for everything. Western food in India sucks. bhai tera to ganda waala kaata I stopped ordering from Pizza hut, the day I realized that they used Mayo and Cream cheese on Pizza. The taste was disgusting, thankfully it was a personal size, so I didn't have to suffer for long. I really wanted to vomit at every bite. The 3rd one is from Jizza Hut. Unlike dominos? Bro Dominos have the same issue. Some of their outlets are decent while some utter shit. Good thing is that local pizzeria game is now really good. It's been 4-5 years since I ordered from Dominos or Pizza hut I've had the (mis)fortune of trying Pizza Hut in multiple different countries, and from my experience i can confidently gather one thing : Pizza Hut is really consistent. I've never really come across a chain that's nearly as consistent. Consistently dogshit, that is. Bro does Pizza Hut do this in every city? It happened with me every time I ordered online. (Sometimes offline too). Totally bad. Domino's is better imo. Try mozo pizza next time What you received is from cloud kitchen of pizza hut. Untrained, no professional people cook in unhygienic conditions and dont follow steps in cloud kitchens as compared to proper restaurants. also because pizza hut operates half of its business from cloud kitchens. You really dont want to see who, in what conditions and how cooks food in these cloud kitchens. Are you sure mayo? Usually, they use liquid cheese (still cheap, but not mayo). It's the same with all the companies under yum brands which includes KFC and Taco Bell. In my city we had two KFCs. One is way better than the other. I still remember once ordering a singer burger from KFC for 180+rs. I was shocked to see the size of the chicken. I took my weight scale to check its weight, it weighed just 80g. Bhai I can get 400g chicken pakoda for this price. Stopped buying from new branches after that. Stuck to the branches I know have good standards and quality control. 🤣🤣🤣 Veg mayonnaise is one of the worst things to put on pizzas and garlic breads. It's cheaper than cheese, tastes awful, and feels worse in the stomach since it is almost all refined oil. I only eat Domino’s because of Cheese Burst Rich people problems be like But it's not pizza, the item in the menu is clearly stated as Garlic bread? I don't know why OP called it pizza because in the menu pic, it's listed as Garlic bread.. Yeah i had it confused. ik it's garlic bread, but that shit just looks so bad r/shittyfoodporn Dude that’s how they’re supposed to look, and me and my friends love the taste, what are you yapping about man /s? its not a /s, ive never had a bad experience with them, and ive eaten in 5 different branches of theirs good for you? Chuthya katgai .. Every big foreign chain in India is a scam This coupon will also expire in 3-4 days. I had a hundred rupees coupon I got for late delivery, it expired as I forgot about it. Indeed People are getting scammed by scammers using names like domino pizza, dominos pizza instead of the original Domino's pizza. So suggested to check if it was a genuine place you ordered."
}