{
    "id": "17zgpvg",
    "title": "Dry State for the Poor Only",
    "url": "https://www.reddit.com/r/india/comments/17zgpvg/dry_state_for_the_poor_only/",
    "selftext": "How did they get the beer in Gujarat?\n\nhttps://preview.redd.it/slfpln9oof1c1.jpg?width=640&format=pjpg&auto=webp&s=71b6eea65fd413c4446526674b3055c7d7f50684",
    "flair": "Politics",
    "score": 6,
    "num_comments": 7,
    "created_utc": 1700456050.0,
    "convurl": "https://b.thumbs.redditmedia.com/FfVVNIHFOwRpFTb9M5SEFqgikJdcs9Z9xufpy4vR1qY.jpg",
    "comments": [
        "Five star hotels catering to tourists are allowed to sell booze with some conditions attached.",
        "Even as a Gujarati you can get beer/other alcohol, in limited quantities. You need to get a permit made. As a tourist, it's the same, there are quite a few Liquor stores in Ahmedabad. And you can apply for the permit online.",
        "Do reddit a favor? Delete your account and never come back in here again.",
        "these two players aren't gujaratis :D",
        "Something that the Gujjus really share with \nPakistan. No wonder they often ask the detractors to go tonPakistan."
    ],
    "cleaned_text": "dry state poor get beer gujarat ",
    "cleaned_title": "dry state poor",
    "cleaned_selftext": "get beer gujarat",
    "cleaned_comments": "five star hotels catering tourists allowed sell booze conditions attached even gujarati get beerother alcohol limited quantities need get permit made tourist quite liquor stores ahmedabad apply permit online reddit favor delete account never come back two players arent gujaratis something gujjus really share pakistan wonder often ask detractors go tonpakistan",
    "light_cleaned_title": "Dry State for the Poor Only",
    "light_cleaned_selftext": "How did they get the beer in Gujarat?",
    "light_cleaned_comments": "Five star hotels catering to tourists are allowed to sell booze with some conditions attached. Even as a Gujarati you can get beer/other alcohol, in limited quantities. You need to get a permit made. As a tourist, it's the same, there are quite a few Liquor stores in Ahmedabad. And you can apply for the permit online. Do reddit a favor? Delete your account and never come back in here again. these two players aren't gujaratis :D Something that the Gujjus really share with Pakistan. No wonder they often ask the detractors to go tonPakistan."
}