{
    "id": "15psmf2",
    "title": "New way of fooling people into buying fake/inferior products on Amazon",
    "url": "https://www.reddit.com/r/india/comments/15psmf2/new_way_of_fooling_people_into_buying/",
    "selftext": "I just noticed this trend recently. New or shady sellers are listing their fake/inferior products on existing highly rated product listings as a variant. So, when someone will search for the product, he will see it as 5 stars rated with thousands of awesome ratings but in fact that particular product has been listed as a variant of a non-related product and has no rating and/or have bad review.\n\n&nbsp;\n\nFor example, I was searching for memory form pillows. Caught my eyes on [first two listings](https://i.imgur.com/gqaNjfh.png). First one has 4.3 star with 4661 reviews and second one has 4.6 star with 20,518 reviews. Looks like an amazing product. Right? Wrong.\n\n&nbsp;\n\n1st product ([Swiffer Memory Foam Pillow](https://www.amazon.in/Swiffer-Orthopedic-Cervical-Cleaning-Standard/dp/B0CBKR7HYQ/)) is listed as a variant of a mopping cloth (check other variants/styles) and when I checked the reviews only for pillow, many people are complaining about bad quality and fake product. The best part is, Swiffer doesn’t even make memory pillows.\n\n&nbsp;\n\n2nd [pillow is from Holikme](https://www.amazon.in/Holikme-Cervical-Contour-Sleeping-Orthopedic/dp/B0CDM6BLR6/) which is listed as a variant of storage organizer tool. Out of 20.5k ratings, there is 0 rating for pillow. Seller ([LOOK BOX](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A2EQAAJP2GJ1ZJ)) is new with no reviews. I could not find more details about the brand but I am pretty sure this brand also doesn’t make memory pillows.\n\n&nbsp;\n\nThere is one listing from [Black & Decker](https://www.amazon.in/Black-Decker-Orthopedic-Cervical-Cleaning/dp/B0CCNQLRF4/) too which doesn’t make any kind of memory form pillows. But this particular seller ([SHIV.ENTERPRISE](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A3QZQV3A47M2AB), shady seller) has listed it as a variant of Black & Decker hedge trimmer which has 4.7 star with 6.5k ratings. How many ratings does this pillow have? Only 2 and one of the reviewers claiming fake product.\n\n&nbsp;\n\nI am sure some of you may know about it already but many people don’t. That’s why I thought I should share this here. It may save a few people from ordering shitty products thinking they are buying from reputed brand. Olx, Quikr etc used to be the home for scammers but these days, Amazon/Flipkart is down the same path. Support is not always helpful in many of these cases, although they so help in some but majority of such cases are not even reported.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691912311.0,
    "convurl": "https://external-preview.redd.it/TW4S59_b0h4m8_uNpHU607H-YAcZBh5Jguihyw7NHRk.png?auto=webp&s=cc5b9b634136bdac9573bef4ca708f1134b480d9",
    "comments": [
        "You should watch [THIS](https://youtube.com/watch?v=SrYkrsBzbOQ)\n\nProbably answers everything about fake reviews and listing",
        "Good video. This guy is also talking about the same issue I noticed in last week.\n\nI knew sellers buy reviews from my BHW days so I don't really trust well formatted reviews. I usually read what 2-3 star rated reviewers are saying or what people are saying about a product on reddit.",
        "Yes I also came across this. Bought cat litter and seller used reputed company as main seller from Canada and reviews are 4.5 Star and when the product came it’s from UP no connection between 2 companies. I have reviewed in Amazon but they didn’t show my reviews strange otherwise my other reviews come up.",
        "So the scammer was definitely bengali right?",
        "> I have reviewed in Amazon but they didn’t show my reviews strange otherwise my other reviews come up.\n\nHappened with me too. A few times, Amazon removed and disqualified my genuine reviews, yet these review sellers get their reviews approved without any issue and that too in bulk.",
        "sellers can claim reviews as inappropriate to remove them and amazon doesn't check. You can click on the seller and see some of the reviews have strikethrough text",
        "Everything is made in China. It's just rebranded generic products. Even you can purchase something similar in bulk from China, set up your own brand and sell it. There is no \"original\" brand.",
        "how to see reviews just as pillow?",
        "With names like Holikme and Swiffer,I will be super cautious. Whenever a listing has multiple variants,I check review of that particular product only. Genuine reviews generally do not sugar coat words. Also most fake reviews are made almost at same time period with generic names like Stuart,Bob or Kevin😉",
        "On any product page, go to reviews and click to see all reviews. On reviews page, there will be [dropdown selects boxes](https://i.imgur.com/ZjNEHT0.png) to filter reviews. One of them is labeled a \"All format\". Select the variant name from the dropdown to see reviews for that particular product.",
        "It's funny how random people like us find out scammers on Amazon but Amazon themselves can't🤡",
        "Their incentive lies with their commission, good or bad product both yields profit for them !! That's the horror of Monopoly.",
        "The online shopping experience is so bad here. Have to be super careful, do extra research look up the seller and brand and see if they actually make the product, official site, reviews, etc,.",
        "What ? Why ?",
        "Your biological dad was though /S",
        "It sounded like it.",
        "Never saw this for products I have been buying on Amazon, but worth keeping an eye out for this shady tactic.\n\nThanks OP!",
        "Counterfeit product are rampant on Amazon. Especially Chinese goods, same is also happening to Flipkart.",
        "Amazon sucks and is full of scammers since they are more focused on making life hell for legitimate sellers that give them good business",
        "I have seen thousands of positive reviews under product A, but they were actually reviews of product B.  \n\n\nProduct A was NOT even remotely related to product B!  \n\n\nMaybe product B was good, but Product A was certainly rubbish.  \n\n\nI don't know how the scammers did it.",
        "Not me watching this post days after buying a foam pillow 😭😂 \nNew pillow works good though",
        "I think once they list themselves as a seller of the B product then I think they can also add a variant (product A) of product B and add images and all. Amazon doesn't really check in such cases I think otherwise it should not have happened in the first place.\n\nOnce they add product A as a variant of product B, product A will get the ratings of product B also. This is my understanding.",
        "> With names like Holikme and Swiffer,I will be super cautious.\n\nThese are genuine western brands creating some of the best products in their field.",
        "Hahaha. That's true. It's not simple as it used to be. Search the product and check the rating/review. Now, full on investigation is required.",
        "Thought it was generic Chinese brands. Thanks for the info.",
        "I am sure, they must know these issues from many months because they have all the data and it's easier to spot the pattern for them but the difficult part is to counter these problems with an automated system and if they have to manually review every change then they may have to employ million more people and it will cost them money.\n\nAll their hot shot MBAs do is bring cost benefit analysis. Would it be cheaper for them to ignore the issue and invite a group of volunteers who they can send hot products for free for their authentic reviews or to employ a manual review process by employing 100k new staff. Choice is clear.",
        "That's astonishing!  \n\n\nI had searched for a pillow and found one with a rating of 4.8 out of 5 stars. The total number of ratings was 3,350.  \n\n\nMost of the reviews were on the lines of \"Good,\" \"Excellent product. I love it,\" etc.  \n\n\nHowever, a closer look at the reviews revealed that the people were actually reviewing a \"Marvel Venomized Pop Figures\" Toy and some of the customers had purchased it from Amazon USA (and not from Amazon India).  \n\n\nIs it possible to create a \"variant\" of a Marvel toy and list a pillow?!"
    ],
    "cleaned_text": "new way fooling people buying fakeinferior products amazon noticed trend recently new shady sellers listing fakeinferior products existing highly rated product listings variant someone search product see stars rated thousands awesome ratings fact particular product listed variant nonrelated product rating andor bad review nbsp example searching memory form pillows caught eyes first two listingshttpsiimgurcomgqanjfhpng first one star reviews second one star reviews looks like amazing product right wrong nbsp st product swiffer memory foam pillowhttpswwwamazoninswifferorthopediccervicalcleaningstandarddpbcbkrhyq listed variant mopping cloth check variantsstyles checked reviews pillow many people complaining bad quality fake product best part swiffer doesnt even make memory pillows nbsp nd pillow holikmehttpswwwamazoninholikmecervicalcontoursleepingorthopedicdpbcdmblr listed variant storage organizer tool k ratings rating pillow seller look boxhttpswwwamazoninspmarketplaceidatjruunkgvselleraeqaajpgjzj new reviews could find details brand pretty sure brand also doesnt make memory pillows nbsp one listing black deckerhttpswwwamazoninblackdeckerorthopediccervicalcleaningdpbccnqlrf doesnt make kind memory form pillows particular seller shiventerprisehttpswwwamazoninspmarketplaceidatjruunkgvselleraqzqvamab shady seller listed variant black decker hedge trimmer star k ratings many ratings pillow one reviewers claiming fake product nbsp sure may know already many people dont thats thought share may save people ordering shitty products thinking buying reputed brand olx quikr etc used home scammers days amazonflipkart path support always helpful many cases although help majority cases even reported ",
    "cleaned_title": "new way fooling people buying fakeinferior products amazon",
    "cleaned_selftext": "noticed trend recently new shady sellers listing fakeinferior products existing highly rated product listings variant someone search product see stars rated thousands awesome ratings fact particular product listed variant nonrelated product rating andor bad review nbsp example searching memory form pillows caught eyes first two listingshttpsiimgurcomgqanjfhpng first one star reviews second one star reviews looks like amazing product right wrong nbsp st product swiffer memory foam pillowhttpswwwamazoninswifferorthopediccervicalcleaningstandarddpbcbkrhyq listed variant mopping cloth check variantsstyles checked reviews pillow many people complaining bad quality fake product best part swiffer doesnt even make memory pillows nbsp nd pillow holikmehttpswwwamazoninholikmecervicalcontoursleepingorthopedicdpbcdmblr listed variant storage organizer tool k ratings rating pillow seller look boxhttpswwwamazoninspmarketplaceidatjruunkgvselleraeqaajpgjzj new reviews could find details brand pretty sure brand also doesnt make memory pillows nbsp one listing black deckerhttpswwwamazoninblackdeckerorthopediccervicalcleaningdpbccnqlrf doesnt make kind memory form pillows particular seller shiventerprisehttpswwwamazoninspmarketplaceidatjruunkgvselleraqzqvamab shady seller listed variant black decker hedge trimmer star k ratings many ratings pillow one reviewers claiming fake product nbsp sure may know already many people dont thats thought share may save people ordering shitty products thinking buying reputed brand olx quikr etc used home scammers days amazonflipkart path support always helpful many cases although help majority cases even reported",
    "cleaned_comments": "watch thishttpsyoutubecomwatchvsrykrsbzboq probably answers everything fake reviews listing good video guy also talking issue noticed last week knew sellers buy reviews bhw days dont really trust well formatted reviews usually read star rated reviewers saying people saying product reddit yes also came across bought cat litter seller used reputed company main seller canada reviews star product came connection companies reviewed amazon didnt show reviews strange otherwise reviews come scammer definitely bengali right reviewed amazon didnt show reviews strange otherwise reviews come happened times amazon removed disqualified genuine reviews yet review sellers get reviews approved without issue bulk sellers claim reviews inappropriate remove amazon doesnt check click seller see reviews strikethrough text everything made china rebranded generic products even purchase something similar bulk china set brand sell original brand see reviews pillow names like holikme swifferi super cautious whenever listing multiple variantsi check review particular product genuine reviews generally sugar coat words also fake reviews made almost time period generic names like stuartbob kevin product page go reviews click see reviews reviews page dropdown selects boxeshttpsiimgurcomzjnehtpng filter reviews one labeled format select variant name dropdown see reviews particular product funny random people like us find scammers amazon amazon cant incentive lies commission good bad product yields profit thats horror monopoly online shopping experience bad super careful extra research look seller brand see actually make product official site reviews etc biological dad though sounded like never saw products buying amazon worth keeping eye shady tactic thanks op counterfeit product rampant amazon especially chinese goods also happening flipkart amazon sucks full scammers since focused making life hell legitimate sellers give good business seen thousands positive reviews product actually reviews product b product even remotely related product b maybe product b good product certainly rubbish dont know scammers watching post days buying foam pillow new pillow works good though think list seller b product think also add variant product product b add images amazon doesnt really check cases think otherwise happened first place add product variant product b product get ratings product b also understanding names like holikme swifferi super cautious genuine western brands creating best products field hahaha thats true simple used search product check ratingreview full investigation required thought generic chinese brands thanks info sure must know issues many months data easier spot pattern difficult part counter problems automated system manually review every change may employ million people cost money hot shot mbas bring cost benefit analysis would cheaper ignore issue invite group volunteers send hot products free authentic reviews employ manual review process employing k new staff choice clear thats astonishing searched pillow found one rating stars total number ratings reviews lines good excellent product love etc however closer look reviews revealed people actually reviewing marvel venomized pop figures toy customers purchased amazon usa amazon india possible create variant marvel toy list pillow",
    "light_cleaned_title": "New way of fooling people into buying fake/inferior products on Amazon",
    "light_cleaned_selftext": "I just noticed this trend recently. New or shady sellers are listing their fake/inferior products on existing highly rated product listings as a variant. So, when someone will search for the product, he will see it as 5 stars rated with thousands of awesome ratings but in fact that particular product has been listed as a variant of a non-related product and has no rating and/or have bad review. &nbsp; For example, I was searching for memory form pillows. Caught my eyes on [first two listings](https://i.imgur.com/gqaNjfh.png). First one has 4.3 star with 4661 reviews and second one has 4.6 star with 20,518 reviews. Looks like an amazing product. Right? Wrong. &nbsp; 1st product ([Swiffer Memory Foam Pillow](https://www.amazon.in/Swiffer-Orthopedic-Cervical-Cleaning-Standard/dp/B0CBKR7HYQ/)) is listed as a variant of a mopping cloth (check other variants/styles) and when I checked the reviews only for pillow, many people are complaining about bad quality and fake product. The best part is, Swiffer doesn’t even make memory pillows. &nbsp; 2nd [pillow is from Holikme](https://www.amazon.in/Holikme-Cervical-Contour-Sleeping-Orthopedic/dp/B0CDM6BLR6/) which is listed as a variant of storage organizer tool. Out of 20.5k ratings, there is 0 rating for pillow. Seller ([LOOK BOX](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A2EQAAJP2GJ1ZJ)) is new with no reviews. I could not find more details about the brand but I am pretty sure this brand also doesn’t make memory pillows. &nbsp; There is one listing from [Black & Decker](https://www.amazon.in/Black-Decker-Orthopedic-Cervical-Cleaning/dp/B0CCNQLRF4/) too which doesn’t make any kind of memory form pillows. But this particular seller ([SHIV.ENTERPRISE](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A3QZQV3A47M2AB), shady seller) has listed it as a variant of Black & Decker hedge trimmer which has 4.7 star with 6.5k ratings. How many ratings does this pillow have? Only 2 and one of the reviewers claiming fake product. &nbsp; I am sure some of you may know about it already but many people don’t. That’s why I thought I should share this here. It may save a few people from ordering shitty products thinking they are buying from reputed brand. Olx, Quikr etc used to be the home for scammers but these days, Amazon/Flipkart is down the same path. Support is not always helpful in many of these cases, although they so help in some but majority of such cases are not even reported.",
    "light_cleaned_comments": "You should watch [THIS](https://youtube.com/watch?v=SrYkrsBzbOQ) Probably answers everything about fake reviews and listing Good video. This guy is also talking about the same issue I noticed in last week. I knew sellers buy reviews from my BHW days so I don't really trust well formatted reviews. I usually read what 2-3 star rated reviewers are saying or what people are saying about a product on reddit. Yes I also came across this. Bought cat litter and seller used reputed company as main seller from Canada and reviews are 4.5 Star and when the product came it’s from UP no connection between 2 companies. I have reviewed in Amazon but they didn’t show my reviews strange otherwise my other reviews come up. So the scammer was definitely bengali right? > I have reviewed in Amazon but they didn’t show my reviews strange otherwise my other reviews come up. Happened with me too. A few times, Amazon removed and disqualified my genuine reviews, yet these review sellers get their reviews approved without any issue and that too in bulk. sellers can claim reviews as inappropriate to remove them and amazon doesn't check. You can click on the seller and see some of the reviews have strikethrough text Everything is made in China. It's just rebranded generic products. Even you can purchase something similar in bulk from China, set up your own brand and sell it. There is no \"original\" brand. how to see reviews just as pillow? With names like Holikme and Swiffer,I will be super cautious. Whenever a listing has multiple variants,I check review of that particular product only. Genuine reviews generally do not sugar coat words. Also most fake reviews are made almost at same time period with generic names like Stuart,Bob or Kevin😉 On any product page, go to reviews and click to see all reviews. On reviews page, there will be [dropdown selects boxes](https://i.imgur.com/ZjNEHT0.png) to filter reviews. One of them is labeled a \"All format\". Select the variant name from the dropdown to see reviews for that particular product. It's funny how random people like us find out scammers on Amazon but Amazon themselves can't🤡 Their incentive lies with their commission, good or bad product both yields profit for them !! That's the horror of Monopoly. The online shopping experience is so bad here. Have to be super careful, do extra research look up the seller and brand and see if they actually make the product, official site, reviews, etc,. What ? Why ? Your biological dad was though /S It sounded like it. Never saw this for products I have been buying on Amazon, but worth keeping an eye out for this shady tactic. Thanks OP! Counterfeit product are rampant on Amazon. Especially Chinese goods, same is also happening to Flipkart. Amazon sucks and is full of scammers since they are more focused on making life hell for legitimate sellers that give them good business I have seen thousands of positive reviews under product A, but they were actually reviews of product B. Product A was NOT even remotely related to product B! Maybe product B was good, but Product A was certainly rubbish. I don't know how the scammers did it. Not me watching this post days after buying a foam pillow 😭😂 New pillow works good though I think once they list themselves as a seller of the B product then I think they can also add a variant (product A) of product B and add images and all. Amazon doesn't really check in such cases I think otherwise it should not have happened in the first place. Once they add product A as a variant of product B, product A will get the ratings of product B also. This is my understanding. > With names like Holikme and Swiffer,I will be super cautious. These are genuine western brands creating some of the best products in their field. Hahaha. That's true. It's not simple as it used to be. Search the product and check the rating/review. Now, full on investigation is required. Thought it was generic Chinese brands. Thanks for the info. I am sure, they must know these issues from many months because they have all the data and it's easier to spot the pattern for them but the difficult part is to counter these problems with an automated system and if they have to manually review every change then they may have to employ million more people and it will cost them money. All their hot shot MBAs do is bring cost benefit analysis. Would it be cheaper for them to ignore the issue and invite a group of volunteers who they can send hot products for free for their authentic reviews or to employ a manual review process by employing 100k new staff. Choice is clear. That's astonishing! I had searched for a pillow and found one with a rating of 4.8 out of 5 stars. The total number of ratings was 3,350. Most of the reviews were on the lines of \"Good,\" \"Excellent product. I love it,\" etc. However, a closer look at the reviews revealed that the people were actually reviewing a \"Marvel Venomized Pop Figures\" Toy and some of the customers had purchased it from Amazon USA (and not from Amazon India). Is it possible to create a \"variant\" of a Marvel toy and list a pillow?!"
}