{
    "id": "16rsp5l",
    "title": "10 Reasons Why India is NOT the Next China",
    "url": "https://youtu.be/7ld1iljMRDE?si=R72jNuaKTmAns3-z",
    "selftext": "What are your thoughts on this? Do you think India will ever catch up to China in terms of economic development?",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 10,
    "created_utc": 1695649878.0,
    "convurl": "https://external-preview.redd.it/D0ldMOI-kuQaoJOsT9KJ7QgP4a0dTDtsI5dwAFZ5e2g.jpg?auto=webp&s=ae70696f118f1e23e9af04cb4ef5c878a69c5b8d",
    "comments": [
        "The only thing this video is talking about. China has a bigger economy than India, India has less export, less manufacturing, not good infrastructure. But nowhere it gave the point to prove india can't overtake China. This video is simply saying China has a bigger economy than India, nothing else.",
        "Thank you",
        "True we can't enslave a whole Muslim community to slave work like in  Xinjiang detention centres or we would be a dictatorship. Also we can't harvest organs at a large scale without consent of a community.",
        "You are the one peddling debunked propaganda",
        "So you think that Xinjiang detention centres are a lie?"
    ],
    "cleaned_text": "reasons india next china thoughts think india ever catch china terms economic development ",
    "cleaned_title": "reasons india next china",
    "cleaned_selftext": "thoughts think india ever catch china terms economic development",
    "cleaned_comments": "thing video talking china bigger economy india india less export less manufacturing good infrastructure nowhere gave point prove india cant overtake china video simply saying china bigger economy india nothing else thank true cant enslave whole muslim community slave work like xinjiang detention centres would dictatorship also cant harvest organs large scale without consent community one peddling debunked propaganda think xinjiang detention centres lie",
    "light_cleaned_title": "10 Reasons Why India is NOT the Next China",
    "light_cleaned_selftext": "What are your thoughts on this? Do you think India will ever catch up to China in terms of economic development?",
    "light_cleaned_comments": "The only thing this video is talking about. China has a bigger economy than India, India has less export, less manufacturing, not good infrastructure. But nowhere it gave the point to prove india can't overtake China. This video is simply saying China has a bigger economy than India, nothing else. Thank you True we can't enslave a whole Muslim community to slave work like in Xinjiang detention centres or we would be a dictatorship. Also we can't harvest organs at a large scale without consent of a community. You are the one peddling debunked propaganda So you think that Xinjiang detention centres are a lie?"
}