{
    "id": "15dglvg",
    "title": "Indian Railways is working round-the-clock to connect the remotest part of the country with its network. Here's the list of Top Five achievements:",
    "url": "https://www.financialexpress.com/business/railways-empowering-northeast-how-indian-railways-strengthened-rail-connectivity-in-last-nine-years-3190507/",
    "selftext": "Indian Railways is working round-the-clock to connect the remotest part of the country with its network. Here's the list of Top Five achievements:\n\n1. Nagaland has received the second railway station on Dhansari–Shokhuvi railway line after a gap of more than 100 years. \n\n2. Arrival of first passenger train between Nagaland-Arunachal Pradesh.\n\n3. First passenger train between Meghalaya–Dudhnoi\n\n4. The first Jan Shatabdi Express for the northeastern region connecting Agartala – Jiribam.\n\n5. Launch of Vande Bharat Express:\nNortheast India’s first semi-high speed train connects Guwahati and New Jalpaiguri.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690706869.0,
    "convurl": "https://external-preview.redd.it/2s_v64g27Ir1xPetxA9lLCXggP3zHzzbM796kUZt-6U.jpg?auto=webp&s=23e215dad912b5c9f10105a54d5be5de66824ce2",
    "comments": [],
    "cleaned_text": "indian railways working roundtheclock connect remotest part country network heres list top five achievements indian railways working roundtheclock connect remotest part country network heres list top five achievements nagaland received second railway station dhansarishokhuvi railway line gap years arrival first passenger train nagalandarunachal pradesh first passenger train meghalayadudhnoi first jan shatabdi express northeastern region connecting agartala jiribam launch vande bharat express northeast indias first semihigh speed train connects guwahati new jalpaiguri ",
    "cleaned_title": "indian railways working roundtheclock connect remotest part country network heres list top five achievements",
    "cleaned_selftext": "indian railways working roundtheclock connect remotest part country network heres list top five achievements nagaland received second railway station dhansarishokhuvi railway line gap years arrival first passenger train nagalandarunachal pradesh first passenger train meghalayadudhnoi first jan shatabdi express northeastern region connecting agartala jiribam launch vande bharat express northeast indias first semihigh speed train connects guwahati new jalpaiguri",
    "cleaned_comments": "",
    "light_cleaned_title": "Indian Railways is working round-the-clock to connect the remotest part of the country with its network. Here's the list of Top Five achievements:",
    "light_cleaned_selftext": "Indian Railways is working round-the-clock to connect the remotest part of the country with its network. Here's the list of Top Five achievements: 1. Nagaland has received the second railway station on Dhansari–Shokhuvi railway line after a gap of more than 100 years. 2. Arrival of first passenger train between Nagaland-Arunachal Pradesh. 3. First passenger train between Meghalaya–Dudhnoi 4. The first Jan Shatabdi Express for the northeastern region connecting Agartala – Jiribam. 5. Launch of Vande Bharat Express: Northeast India’s first semi-high speed train connects Guwahati and New Jalpaiguri.",
    "light_cleaned_comments": ""
}