{
    "id": "154dq69",
    "title": "When the BJP say \"Beti Bachao!\" (Save the daughters!) and \"Hindu Khatre Mein Hein\" (Hindus are in danger), what they actually mean is \"Save your daughters from us\" and \"Hindus are in danger from us\"",
    "url": "https://www.reddit.com/r/india/comments/154dq69/when_the_bjp_say_beti_bachao_save_the_daughters/",
    "selftext": "When the BJP say \"Beti Bachao!\" (Save the daughters!) and \"Hindu Khatre Mein Hein\" (Hindus are in danger), what they actually mean is \"Save your daughters from us\" and \"Hindus are in danger from us\"\n\n&#x200B;\n\nTime and time again, it has been painfully evident that 'Beti Bachao Beti Padhao' is merely a facade for 'Protect your daughters from BJP leaders.'\n\n&#x200B;\n\nThe sheer audacity of BJP's actions is infuriating! Garlanding rapists, rallying around criminals, protecting molesters and murderers – the list of atrocities seems endless.\n\n&#x200B;\n\nTalking about \"Hindu Khatre Mein Hein\", the motto of the modern Indian state, printed on every note and coin, is Satyameva Jayate, meaning “Truth Alone Triumphs.” But Modi came to power on a dangerous lie that he sold to India’s Hindus: that in a country where they make up 80 percent of the population, Hinduism is under threat—and will only prosper if they support the ideology of Hindutva. \n\n&#x200B;\n\nCan anyone point to a single instance where BJP's policies genuinely benefited Hindus? Instead, their communal radicalization has plunged the entire nation into chaos.\n\n&#x200B;\n\nBJP's modus operandi is clear: fuel communal violence, keep the pot boiling, and exploit voters' emotions for their political gains. All the while, diverting attention from their own failures and shortcomings. \n\n&#x200B;\n\nLook around! The country is burning, and we cannot remain silent witnesses. We must break free from the shackles of this propaganda and face the truth – Hindus survived long before BJP, and they will thrive long after. Our strength lies in unity, not in the divisive politics of these opportunistic leaders! \n\n&#x200B;\n\nThe Manipur video of those women being paraded naked and assaulted is an absolute outrage! It's sickening, infuriating, and soul-crushing all at once! What the hell is happening in that state? How can such unspeakably heinous crimes be carried out with such brazenness? Why the hell aren't mainstream media screaming about this gut-wrenching barbarity? Where are we even headed as a nation?\n\n&#x200B;\n\nWe all know why. The question is, what are we going to do about it? Are we going to sit with our dicks in our hands and wait for it to happen to us or are we going to vote these mf's out? \n\n&#x200B;\n\nWe must protect our citizens, our women, and our nation's dignity with unyielding fury and resolve! No more silence, no more excuses – it's time to roar with rage and demand change!\n\n&#x200B;",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689818161.0,
    "convurl": "https://external-preview.redd.it/BVDmAb5zt2dHobhQYQRcQajUpN2ySDGbQaeFlOzVogk.jpg?auto=webp&s=6b55479958d080ecfb42a93d041c72aa1cfff417",
    "comments": [
        "People voted them into power to spread hatred for Muslims. The point that they miss is that when you unleash a hate machine, it is very likely that it will have unintended consequences and one day, will turn against you.",
        "It's a given, but the success of any idea is it's own demise, which occurs just after reaching perfection, and perfection is reached at the point of collapse. BJP was great at tactics but it's agenda was never going to be sustainable, ultimately a strategy that will fail.",
        "Well said. \n\nWe need to act, and act now. Get out. Protest. Demand justice, democracy, and the rule of law. Do not wait till the elections. That is too little, too late.",
        "Yet again, he is silent. I don't understand how getting some award in a foreign country is a matter of pride for his followers but his silence on grave injustices doesn't spark deep shame and anger. We have lost our sense of self as a nation, each day we descend further into the consequences of harbouring such poisonous ideologies for nearly a decade.",
        "First they came for the socialists, and I did not speak out—because I was not a socialist.\n\nThen they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\n\nThen they came for the Jews, and I did not speak out—because I was not a Jew.\n\nThen they came for me—and there was no one left to speak for me.\n\n—Martin Niemöller",
        "You have to speak the language he speaks . His CM openly argues with Kuki groups and call them outsiders on Twitter so why will this be commented on?",
        "I made many valid points about Manipur issue in my post but the bots took it down to suppress my message.",
        "But the main question is what is the main reason for this violence. This is going on for more than 3 months.",
        ">But the main question is what is the main reason for this violence. \n\n#Incompetence of state and central governments.",
        "That slogan was a warning to all betiyas",
        "Kukis accused of manufacturing drugs. Meiteis want to get reservation as st. Kukis feel meiteis will take away all their opportunities and buy their land from them (rn their land is protected and can only be owned by tribals) iirc this is the gist of it.",
        "OMG! YOU ARE AUNTY NATTIONUL!!!!",
        "This!!",
        "It is not just incompetence it is intentional abetting of them in allowing the offenders to satisfy their bestial instincts. Precisely they are *Partners in Crime*."
    ],
    "cleaned_text": "bjp say beti bachao save daughters hindu khatre mein hein hindus danger actually mean save daughters us hindus danger us bjp say beti bachao save daughters hindu khatre mein hein hindus danger actually mean save daughters us hindus danger us xb time time painfully evident beti bachao beti padhao merely facade protect daughters bjp leaders xb sheer audacity bjps actions infuriating garlanding rapists rallying around criminals protecting molesters murderers list atrocities seems endless xb talking hindu khatre mein hein motto modern indian state printed every note coin satyameva jayate meaning truth alone triumphs modi came power dangerous lie sold indias hindus country make percent population hinduism threatand prosper support ideology hindutva xb anyone point single instance bjps policies genuinely benefited hindus instead communal radicalization plunged entire nation chaos xb bjps modus operandi clear fuel communal violence keep pot boiling exploit voters emotions political gains diverting attention failures shortcomings xb look around country burning remain silent witnesses must break free shackles propaganda face truth hindus survived long bjp thrive long strength lies unity divisive politics opportunistic leaders xb manipur video women paraded naked assaulted absolute outrage sickening infuriating soulcrushing hell happening state unspeakably heinous crimes carried brazenness hell arent mainstream media screaming gutwrenching barbarity even headed nation xb know question going going sit dicks hands wait happen us going vote mfs xb must protect citizens women nations dignity unyielding fury resolve silence excuses time roar rage demand change xb ",
    "cleaned_title": "bjp say beti bachao save daughters hindu khatre mein hein hindus danger actually mean save daughters us hindus danger us",
    "cleaned_selftext": "bjp say beti bachao save daughters hindu khatre mein hein hindus danger actually mean save daughters us hindus danger us xb time time painfully evident beti bachao beti padhao merely facade protect daughters bjp leaders xb sheer audacity bjps actions infuriating garlanding rapists rallying around criminals protecting molesters murderers list atrocities seems endless xb talking hindu khatre mein hein motto modern indian state printed every note coin satyameva jayate meaning truth alone triumphs modi came power dangerous lie sold indias hindus country make percent population hinduism threatand prosper support ideology hindutva xb anyone point single instance bjps policies genuinely benefited hindus instead communal radicalization plunged entire nation chaos xb bjps modus operandi clear fuel communal violence keep pot boiling exploit voters emotions political gains diverting attention failures shortcomings xb look around country burning remain silent witnesses must break free shackles propaganda face truth hindus survived long bjp thrive long strength lies unity divisive politics opportunistic leaders xb manipur video women paraded naked assaulted absolute outrage sickening infuriating soulcrushing hell happening state unspeakably heinous crimes carried brazenness hell arent mainstream media screaming gutwrenching barbarity even headed nation xb know question going going sit dicks hands wait happen us going vote mfs xb must protect citizens women nations dignity unyielding fury resolve silence excuses time roar rage demand change xb",
    "cleaned_comments": "people voted power spread hatred muslims point miss unleash hate machine likely unintended consequences one day turn given success idea demise occurs reaching perfection perfection reached point collapse bjp great tactics agenda never going sustainable ultimately strategy fail well said need act act get protest demand justice democracy rule law wait till elections little late yet silent dont understand getting award foreign country matter pride followers silence grave injustices doesnt spark deep shame anger lost sense self nation day descend consequences harbouring poisonous ideologies nearly decade first came socialists speak outbecause socialist came trade unionists speak outbecause trade unionist came jews speak outbecause jew came meand one left speak martin niemller speak language speaks cm openly argues kuki groups call outsiders twitter commented made many valid points manipur issue post bots took suppress message main question main reason violence going months main question main reason violence incompetence state central governments slogan warning betiyas kukis accused manufacturing drugs meiteis want get reservation st kukis feel meiteis take away opportunities buy land rn land protected owned tribals iirc gist omg aunty nattionul incompetence intentional abetting allowing offenders satisfy bestial instincts precisely partners crime",
    "light_cleaned_title": "When the BJP say \"Beti Bachao!\" (Save the daughters!) and \"Hindu Khatre Mein Hein\" (Hindus are in danger), what they actually mean is \"Save your daughters from us\" and \"Hindus are in danger from us\"",
    "light_cleaned_selftext": "When the BJP say \"Beti Bachao!\" (Save the daughters!) and \"Hindu Khatre Mein Hein\" (Hindus are in danger), what they actually mean is \"Save your daughters from us\" and \"Hindus are in danger from us\" &#x200B; Time and time again, it has been painfully evident that 'Beti Bachao Beti Padhao' is merely a facade for 'Protect your daughters from BJP leaders.' &#x200B; The sheer audacity of BJP's actions is infuriating! Garlanding rapists, rallying around criminals, protecting molesters and murderers – the list of atrocities seems endless. &#x200B; Talking about \"Hindu Khatre Mein Hein\", the motto of the modern Indian state, printed on every note and coin, is Satyameva Jayate, meaning “Truth Alone Triumphs.” But Modi came to power on a dangerous lie that he sold to India’s Hindus: that in a country where they make up 80 percent of the population, Hinduism is under threat—and will only prosper if they support the ideology of Hindutva. &#x200B; Can anyone point to a single instance where BJP's policies genuinely benefited Hindus? Instead, their communal radicalization has plunged the entire nation into chaos. &#x200B; BJP's modus operandi is clear: fuel communal violence, keep the pot boiling, and exploit voters' emotions for their political gains. All the while, diverting attention from their own failures and shortcomings. &#x200B; Look around! The country is burning, and we cannot remain silent witnesses. We must break free from the shackles of this propaganda and face the truth – Hindus survived long before BJP, and they will thrive long after. Our strength lies in unity, not in the divisive politics of these opportunistic leaders! &#x200B; The Manipur video of those women being paraded naked and assaulted is an absolute outrage! It's sickening, infuriating, and soul-crushing all at once! What the hell is happening in that state? How can such unspeakably heinous crimes be carried out with such brazenness? Why the hell aren't mainstream media screaming about this gut-wrenching barbarity? Where are we even headed as a nation? &#x200B; We all know why. The question is, what are we going to do about it? Are we going to sit with our dicks in our hands and wait for it to happen to us or are we going to vote these mf's out? &#x200B; We must protect our citizens, our women, and our nation's dignity with unyielding fury and resolve! No more silence, no more excuses – it's time to roar with rage and demand change! &#x200B;",
    "light_cleaned_comments": "People voted them into power to spread hatred for Muslims. The point that they miss is that when you unleash a hate machine, it is very likely that it will have unintended consequences and one day, will turn against you. It's a given, but the success of any idea is it's own demise, which occurs just after reaching perfection, and perfection is reached at the point of collapse. BJP was great at tactics but it's agenda was never going to be sustainable, ultimately a strategy that will fail. Well said. We need to act, and act now. Get out. Protest. Demand justice, democracy, and the rule of law. Do not wait till the elections. That is too little, too late. Yet again, he is silent. I don't understand how getting some award in a foreign country is a matter of pride for his followers but his silence on grave injustices doesn't spark deep shame and anger. We have lost our sense of self as a nation, each day we descend further into the consequences of harbouring such poisonous ideologies for nearly a decade. First they came for the socialists, and I did not speak out—because I was not a socialist. Then they came for the trade unionists, and I did not speak out—because I was not a trade unionist. Then they came for the Jews, and I did not speak out—because I was not a Jew. Then they came for me—and there was no one left to speak for me. —Martin Niemöller You have to speak the language he speaks . His CM openly argues with Kuki groups and call them outsiders on Twitter so why will this be commented on? I made many valid points about Manipur issue in my post but the bots took it down to suppress my message. But the main question is what is the main reason for this violence. This is going on for more than 3 months. >But the main question is what is the main reason for this violence. #Incompetence of state and central governments. That slogan was a warning to all betiyas Kukis accused of manufacturing drugs. Meiteis want to get reservation as st. Kukis feel meiteis will take away all their opportunities and buy their land from them (rn their land is protected and can only be owned by tribals) iirc this is the gist of it. OMG! YOU ARE AUNTY NATTIONUL!!!! This!! It is not just incompetence it is intentional abetting of them in allowing the offenders to satisfy their bestial instincts. Precisely they are *Partners in Crime*."
}