{
    "id": "175ceql",
    "title": "Inside the deadly instant loan app scam that blackmails with nudes",
    "url": "https://www.bbc.co.uk/news/world-asia-india-66964510",
    "selftext": "BBC News - Inside the deadly instant loan app scam that blackmails with nudes\nSauce: https://www.bbc.co.uk/news/world-asia-india-66964510",
    "flair": "Crime",
    "score": 1,
    "num_comments": 58,
    "created_utc": 1697025928.0,
    "convurl": "https://external-preview.redd.it/faCIJGBSGNoCFjrxKTYQZkdTzZxm7fETlFKWQTzTVe4.jpg?auto=webp&s=6f89811b23e7169a2ec9f3b02dca69f88575c08e",
    "comments": [
        "Quite a popular scam this one since 2020. Nudes I guess are from some unfortunate people but they get all your contact info and contacts from your phone to whom they call, harass putting your name into the mud and dragging through it. IMHO people fear the most is public perception of them no matter how anonymous their life is.",
        "What if you buy a cheap android and don't hook it up to any of your social profiles..\nPut all fake contacts in the contact list..and give them all fake details (I don't know if they give loans without verification)\n\nTake the money and disappear..how will they get you?  \n\nUnless you have to provide proof of address to them or something.",
        "If the loan is of any significant amount, they will do KYC and get proof of address",
        "Yes… they’re running this elaborate scheme and they haven’t thought about that!\nNot to mention even with a money trail even police is often helpless.",
        "11549 rs?",
        "I mean if they're going to get my nudes, they'll probably send it back to me after throwing up",
        "Modern day loan gundas",
        "Exhibitionists: scammers are doing the heavy lifting......win win....",
        "Bro how do you take a loan for 50k and turn it into a 20 lakh loan? It's madness.",
        "Old timey gundas too had values. They wouldn’t harass someone who has paid off the loan.",
        "Heavy interest gets levied that compounds daily.\n\nLike on 20000, 30% per day. Now calculate interest value on day 30.",
        "When you download apps, you give them a lot of them access to your contacts and photos, does this mean they can do this without you ever having taken a loan or sell this info to these call centres? If they’re harassing people who repaid loans, what’s to say they won’t harass people who never took a loan?",
        "Let's be honest stop caring \n\nWorld has moving very fast in internet \n\nThey probably lots of indency in social media on purpose for views\n\nWhy do any one will care after few days",
        "They won't approve your loan if you have few contacts in your phone and no photos. Thats the first access they take. Contacts and gallery.",
        "It's not about your nudees, they get access to your phone data and will make nudes of anyone from those images, Teri nudes to tu khud na dekhe.",
        "Sweet..then I'll download and keep a few pics of sunny ji (both Leonne and deol), maybe Tammanah, Shakti Kapoor and can't forget Pandey ji (the chunky one)",
        "I'm pretty sure it's not very difficult to download few pics and contacts off of the internet.",
        "How are you going to get contacts of a particular person off the net? You can get names maybe but phone numbers?",
        "everything mentioned except name of the app that one needs to stay away from 🤡",
        "Itnii maths aati toh loan lene ki zaruurat nahi hoti",
        "It is mentioned. Asan loan",
        "random numbers?",
        "hmmmm thats not how it works, at all. maybe you wouldn’t care about a third person’s nudes, but people really do give a shit when it comes to nudes of a person they know. a nude scandal can destroy someone’s life especially if its a woman.",
        "Bro go to school",
        "As I was reading the article I recieved a message from Airtel about quick loan apps\n\nhttps://preview.redd.it/m3ipkoh6sltb1.png?width=1080&format=pjpg&auto=webp&s=8e35d3356196abe99e1663fc44da18fc38955bfe",
        "Yup, but that's just one. There are dozens out there.",
        ">When a customer takes out a loan... they give the app access to the contacts on their phone\n\nIf you're going to get a loan through a phone app, try to get a cheap burner phone first and use that instead.  But if you need a loan you prob can't afford that, either.  Whatever, hide your contact however you can.  Delete them all and keep them on paper until after you finish with the loan.\n\nOr, delete the contacts, get the loan, then delete the app.  Do something, don't let them get your contact.  Oh, and if they blackmail you with nudes tell your people first and hold your head up.   Don't kill yourself over this shit",
        ">  a nude scandal can destroy someone’s life especially if its a woman\n\nWhich is a serious problem!  There's no reason for that backwards shit to be going on in 2023.",
        "I agree with you.  Don't use a phone with your own contact in it",
        "Currently I am scamming these MOFOs who contact me to do fake reviews and them do prepaid task. In last month 2 of them have contacted me to do fake reviews and earn around 650 rs in 1 or 2 days then later they ask me to do prepaid task. At that point I just take my money amd leave. Not bad earning 1300 in 2 days. Easy money.",
        "30% daily pe loan kaun leta hai but?",
        "Your bank account could get flagged",
        "I have give my secondary account both the time. It has 0 rs now",
        "true but it is the reality, so better safe than sorry.",
        "Desperate people. During covid a lot of people went into loss, and even now during recession it’s affecting crores of people",
        "I understand why a woman would be scared.",
        "Nice",
        "Modu ji wallpaper",
        "Not a bad idea...maybe then they will go after the PM cares fund.",
        "You know, the BBC has some serious issues and biases within it. That being said, it's times and articles like these that reminds me of their good side as well. Just finished reading the article. Really good display of investigative journalism. Kudos to both the reporter and the whistleblower that agreed to go undercover to expose this. \n\nThere's not a single rag in this country that can equal this feat.",
        "The smarter ones have done this.\n\nGot a new phone number from jio in chennai and after a week started getting calls from a number saying my emi payments are due. They said someone's name and I clarified I got this number last month and there is no relation to the previous owner. Finally after a few months started getting calls from another number who started to threaten me by stating all of my supposed address and relation. None of them linked to me in any shape or form. So I said go ahead. The incessant calling made me cancel that number.\n\nSo people have successfully applied this before.",
        "Why not just take advantage of the AI hoolah and completely disarm the idea of nudes altogether. Society mein yeh phaila do ki AI se nudes banake blackmail hota hai. bas ab sabke pas valid excuse hai, ki humara nahin hai. kisi ne banaya hai.",
        "Except ndtv. they still trying, bruh.",
        "They would send eunuchs to the non payees house. Some danced, some stripped while the others abused while clapping loudly.\n\nMy uncle had done it. His wife sold her gold n was able to get rid of them.",
        " A friend of mine took loans from this app, they blackmailed him with his nudes and abused him. My friend abused him so much and said that he will not give any money now and he can share the nudes as much as he wants. They didn't share any photos when he showed he has no shame as he sent his dick pic to him XD.",
        "> so better safe than sorry\n\nHow is shame causing suicide the \"safe\" path?",
        "It happened in Pakistan a few months back. One of the man committed suicide as he was unable to pay and the scammers were calling his relatives.",
        "No not NDTV lol. What RepublicTV is to the right, NDTV is to the left. I don't trust either. No Indian network is unbiased.",
        "Wait how do they get our nudes",
        "Kya karoge itne saare paise ka?",
        "--escort-- SIP bhar sakta hoon",
        "i think these apps are sideloaded, not from app store.app store has protections and will ban ill-behaved apps.",
        "they morph fake ones."
    ],
    "cleaned_text": "inside deadly instant loan app scam blackmails nudes bbc news inside deadly instant loan app scam blackmails nudes sauce ",
    "cleaned_title": "inside deadly instant loan app scam blackmails nudes",
    "cleaned_selftext": "bbc news inside deadly instant loan app scam blackmails nudes sauce",
    "cleaned_comments": "quite popular scam one since nudes guess unfortunate people get contact info contacts phone call harass putting name mud dragging imho people fear public perception matter anonymous life buy cheap android dont hook social profiles put fake contacts contact listand give fake details dont know give loans without verification take money disappearhow get unless provide proof address something loan significant amount kyc get proof address yes theyre running elaborate scheme havent thought mention even money trail even police often helpless rs mean theyre going get nudes theyll probably send back throwing modern day loan gundas exhibitionists scammers heavy liftingwin win bro take loan k turn lakh loan madness old timey gundas values wouldnt harass someone paid loan heavy interest gets levied compounds daily like per day calculate interest value day download apps give lot access contacts photos mean without ever taken loan sell info call centres theyre harassing people repaid loans whats say wont harass people never took loan lets honest stop caring world moving fast internet probably lots indency social media purpose views one care days wont approve loan contacts phone photos thats first access take contacts gallery nudees get access phone data make nudes anyone images teri nudes tu khud na dekhe sweetthen ill download keep pics sunny ji leonne deol maybe tammanah shakti kapoor cant forget pandey ji chunky one im pretty sure difficult download pics contacts internet going get contacts particular person net get names maybe phone numbers everything mentioned except name app one needs stay away itnii maths aati toh loan lene ki zaruurat nahi hoti mentioned asan loan random numbers hmmmm thats works maybe wouldnt care third persons nudes people really give shit comes nudes person know nude scandal destroy someones life especially woman bro go school reading article recieved message airtel quick loan apps yup thats one dozens customer takes loan give app access contacts phone youre going get loan phone app try get cheap burner phone first use instead need loan prob cant afford either whatever hide contact however delete keep paper finish loan delete contacts get loan delete app something dont let get contact oh blackmail nudes tell people first hold head dont kill shit nude scandal destroy someones life especially woman serious problem theres reason backwards shit going agree dont use phone contact currently scamming mofos contact fake reviews prepaid task last month contacted fake reviews earn around rs days later ask prepaid task point take money amd leave bad earning days easy money daily pe loan kaun leta hai bank account could get flagged give secondary account time rs true reality better safe sorry desperate people covid lot people went loss even recession affecting crores people understand woman would scared nice modu ji wallpaper bad ideamaybe go pm cares fund know bbc serious issues biases within said times articles like reminds good side well finished reading article really good display investigative journalism kudos reporter whistleblower agreed go undercover expose theres single rag country equal feat smarter ones done got new phone number jio chennai week started getting calls number saying emi payments due said someones name clarified got number last month relation previous owner finally months started getting calls another number started threaten stating supposed address relation none linked shape form said go ahead incessant calling made cancel number people successfully applied take advantage ai hoolah completely disarm idea nudes altogether society mein yeh phaila ki ai se nudes banake blackmail hota hai bas ab sabke pas valid excuse hai ki humara nahin hai kisi ne banaya hai except ndtv still trying bruh would send eunuchs non payees house danced stripped others abused clapping loudly uncle done wife sold gold n able get rid friend mine took loans app blackmailed nudes abused friend abused much said give money share nudes much wants didnt share photos showed shame sent dick pic xd better safe sorry shame causing suicide safe path happened pakistan months back one man committed suicide unable pay scammers calling relatives ndtv lol republictv right ndtv left dont trust either indian network unbiased wait get nudes kya karoge itne saare paise ka escort sip bhar sakta hoon think apps sideloaded app storeapp store protections ban illbehaved apps morph fake ones",
    "light_cleaned_title": "Inside the deadly instant loan app scam that blackmails with nudes",
    "light_cleaned_selftext": "BBC News - Inside the deadly instant loan app scam that blackmails with nudes Sauce:",
    "light_cleaned_comments": "Quite a popular scam this one since 2020. Nudes I guess are from some unfortunate people but they get all your contact info and contacts from your phone to whom they call, harass putting your name into the mud and dragging through it. IMHO people fear the most is public perception of them no matter how anonymous their life is. What if you buy a cheap android and don't hook it up to any of your social profiles.. Put all fake contacts in the contact list..and give them all fake details (I don't know if they give loans without verification) Take the money and disappear..how will they get you? Unless you have to provide proof of address to them or something. If the loan is of any significant amount, they will do KYC and get proof of address Yes… they’re running this elaborate scheme and they haven’t thought about that! Not to mention even with a money trail even police is often helpless. 11549 rs? I mean if they're going to get my nudes, they'll probably send it back to me after throwing up Modern day loan gundas Exhibitionists: scammers are doing the heavy lifting......win win.... Bro how do you take a loan for 50k and turn it into a 20 lakh loan? It's madness. Old timey gundas too had values. They wouldn’t harass someone who has paid off the loan. Heavy interest gets levied that compounds daily. Like on 20000, 30% per day. Now calculate interest value on day 30. When you download apps, you give them a lot of them access to your contacts and photos, does this mean they can do this without you ever having taken a loan or sell this info to these call centres? If they’re harassing people who repaid loans, what’s to say they won’t harass people who never took a loan? Let's be honest stop caring World has moving very fast in internet They probably lots of indency in social media on purpose for views Why do any one will care after few days They won't approve your loan if you have few contacts in your phone and no photos. Thats the first access they take. Contacts and gallery. It's not about your nudees, they get access to your phone data and will make nudes of anyone from those images, Teri nudes to tu khud na dekhe. Sweet..then I'll download and keep a few pics of sunny ji (both Leonne and deol), maybe Tammanah, Shakti Kapoor and can't forget Pandey ji (the chunky one) I'm pretty sure it's not very difficult to download few pics and contacts off of the internet. How are you going to get contacts of a particular person off the net? You can get names maybe but phone numbers? everything mentioned except name of the app that one needs to stay away from 🤡 Itnii maths aati toh loan lene ki zaruurat nahi hoti It is mentioned. Asan loan random numbers? hmmmm thats not how it works, at all. maybe you wouldn’t care about a third person’s nudes, but people really do give a shit when it comes to nudes of a person they know. a nude scandal can destroy someone’s life especially if its a woman. Bro go to school As I was reading the article I recieved a message from Airtel about quick loan apps Yup, but that's just one. There are dozens out there. >When a customer takes out a loan... they give the app access to the contacts on their phone If you're going to get a loan through a phone app, try to get a cheap burner phone first and use that instead. But if you need a loan you prob can't afford that, either. Whatever, hide your contact however you can. Delete them all and keep them on paper until after you finish with the loan. Or, delete the contacts, get the loan, then delete the app. Do something, don't let them get your contact. Oh, and if they blackmail you with nudes tell your people first and hold your head up. Don't kill yourself over this shit > a nude scandal can destroy someone’s life especially if its a woman Which is a serious problem! There's no reason for that backwards shit to be going on in 2023. I agree with you. Don't use a phone with your own contact in it Currently I am scamming these MOFOs who contact me to do fake reviews and them do prepaid task. In last month 2 of them have contacted me to do fake reviews and earn around 650 rs in 1 or 2 days then later they ask me to do prepaid task. At that point I just take my money amd leave. Not bad earning 1300 in 2 days. Easy money. 30% daily pe loan kaun leta hai but? Your bank account could get flagged I have give my secondary account both the time. It has 0 rs now true but it is the reality, so better safe than sorry. Desperate people. During covid a lot of people went into loss, and even now during recession it’s affecting crores of people I understand why a woman would be scared. Nice Modu ji wallpaper Not a bad idea...maybe then they will go after the PM cares fund. You know, the BBC has some serious issues and biases within it. That being said, it's times and articles like these that reminds me of their good side as well. Just finished reading the article. Really good display of investigative journalism. Kudos to both the reporter and the whistleblower that agreed to go undercover to expose this. There's not a single rag in this country that can equal this feat. The smarter ones have done this. Got a new phone number from jio in chennai and after a week started getting calls from a number saying my emi payments are due. They said someone's name and I clarified I got this number last month and there is no relation to the previous owner. Finally after a few months started getting calls from another number who started to threaten me by stating all of my supposed address and relation. None of them linked to me in any shape or form. So I said go ahead. The incessant calling made me cancel that number. So people have successfully applied this before. Why not just take advantage of the AI hoolah and completely disarm the idea of nudes altogether. Society mein yeh phaila do ki AI se nudes banake blackmail hota hai. bas ab sabke pas valid excuse hai, ki humara nahin hai. kisi ne banaya hai. Except ndtv. they still trying, bruh. They would send eunuchs to the non payees house. Some danced, some stripped while the others abused while clapping loudly. My uncle had done it. His wife sold her gold n was able to get rid of them. A friend of mine took loans from this app, they blackmailed him with his nudes and abused him. My friend abused him so much and said that he will not give any money now and he can share the nudes as much as he wants. They didn't share any photos when he showed he has no shame as he sent his dick pic to him XD. > so better safe than sorry How is shame causing suicide the \"safe\" path? It happened in Pakistan a few months back. One of the man committed suicide as he was unable to pay and the scammers were calling his relatives. No not NDTV lol. What RepublicTV is to the right, NDTV is to the left. I don't trust either. No Indian network is unbiased. Wait how do they get our nudes Kya karoge itne saare paise ka? --escort-- SIP bhar sakta hoon i think these apps are sideloaded, not from app store.app store has protections and will ban ill-behaved apps. they morph fake ones."
}