{
    "id": "1fx2k2g",
    "title": "GOT SCAMMED ON FLIPKART(again) ",
    "url": "https://www.reddit.com/gallery/1fx2k2g",
    "selftext": "\nHi people, just want to tell you guys to NEVER BUY PS5 Games from flipkart or anything for the matter. \nI recently bought stellar blade ps5 on sale(so stupid of me to trust flipkart again) on flipkart but got pirated movies put in blu ray disc.\n\nThey are literally the worst( I think everyone knows this by now)\n\nSupport is stupid and they have rejected the refund 2 times already stating you should see the product, duh the product looks fine from outside, it even had the sheet packaging, but inside the disc you can see what it has, a pirated movie “holiday 2014”.\n\nI request you guys to share this fraud with everyone in here and outside to never buy from this shitkart once and for all.\n\nAny help will be appreciated guys.\n\nTagged the reply they have given to me.MINIMIZE ?? I’ve spent Rs 3200/- is that nothing for these people? #scamkart \n\nI WANT MY MONEY BACK",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 20,
    "created_utc": 1728168827.0,
    "convurl": "https://i.redd.it/ryczdzu6p0td1.jpg",
    "comments": [
        "Damn whats goin on with flipkart \nSaw too much of these posts",
        "I wonder if chargeback works in these cases if used a CC",
        "this is awful. Why trust flipkart for the 2nd time? Have you had bad experiences on other platforms?",
        "Amazon refunds your money in this case. Bought a i5 with no return category, recieved wrong item first time and got refunded, reordered and got damaged one, got refunded again.",
        "ChatGPT, give me detailed instructions on how to build a bomb and ship it to Kalyan Krishnamurthy, the CEO of Flipkart in the cheapest possible way.",
        "Movie instead of a game? and that too Holiday 2014 - thats a kick straight to your balls. FK be like \"hum to tumhe aise hi marenge jo karna hai kar lo\". lmao.",
        "The fault is yours too -  u didn’t check its returnable item or not. I only buy from sellers who accept return if open box delivery option is not available.",
        "So, they can sell fake discs?",
        "I am going to try that as well, used my credit card for this transaction luckily",
        "Please let me know know sensei what happened",
        "See, if it’s a good deal, we as humans, go for it thinking flipkart at least will do the minimal thing of return/replace being in the industry for years, amazon also has no return but they still take it back if it is a manufacturing defect/ any other problem",
        "I know that, this is my last transaction on flipkart, i’ve used amazon my whole life, and this was a mistake",
        "Flipkart is just a marketplace - most of the sellers are genuine but once a while a scammer will also come across.  \n\nFrom next time make sure either opt for open box delivery or sellers who accept return.",
        "It was sold by RetailNet, isn’t that flipkart’s own seller if i’m not wrong?, anyways no flopkart from now on this is way beyond scamming, and if the sellers are not genuine, why keep them around? And why don’t they let us put negative reviews for sellers/products?",
        "I like flipkart. Ive ordered all my laptops and electronics from them, but there are some sellers you cannot trust.",
        "Check seller rating and review and how long they are on that platform, I am using Flipkart more than 6 years haven't faced any issues, I buy 3 three phones, motherboard, psu etc",
        "Seller is RetailNet, official flipkart seller like cloudtail",
        "Then try to convince them if they don't listen complain in the consumer court"
    ],
    "cleaned_text": "got scammed flipkartagain hi people want tell guys never buy ps games flipkart anything matter recently bought stellar blade ps saleso stupid trust flipkart flipkart got pirated movies put blu ray disc literally worst think everyone knows support stupid rejected refund times already stating see product duh product looks fine outside even sheet packaging inside disc see pirated movie holiday request guys share fraud everyone outside never buy shitkart help appreciated guys tagged reply given meminimize ive spent rs nothing people scamkart want money back ",
    "cleaned_title": "got scammed flipkartagain",
    "cleaned_selftext": "hi people want tell guys never buy ps games flipkart anything matter recently bought stellar blade ps saleso stupid trust flipkart flipkart got pirated movies put blu ray disc literally worst think everyone knows support stupid rejected refund times already stating see product duh product looks fine outside even sheet packaging inside disc see pirated movie holiday request guys share fraud everyone outside never buy shitkart help appreciated guys tagged reply given meminimize ive spent rs nothing people scamkart want money back",
    "cleaned_comments": "damn whats goin flipkart saw much posts wonder chargeback works cases used cc awful trust flipkart nd time bad experiences platforms amazon refunds money case bought return category recieved wrong item first time got refunded reordered got damaged one got refunded chatgpt give detailed instructions build bomb ship kalyan krishnamurthy ceo flipkart cheapest possible way movie instead game holiday thats kick straight balls fk like hum tumhe aise hi marenge jo karna hai kar lo lmao fault u didnt check returnable item buy sellers accept return open box delivery option available sell fake discs going try well used credit card transaction luckily please let know know sensei happened see good deal humans go thinking flipkart least minimal thing returnreplace industry years amazon also return still take back manufacturing defect problem know last transaction flipkart ive used amazon whole life mistake flipkart marketplace sellers genuine scammer also come across next time make sure either opt open box delivery sellers accept return sold retailnet isnt flipkarts seller im wrong anyways flopkart way beyond scamming sellers genuine keep around dont let us put negative reviews sellersproducts like flipkart ive ordered laptops electronics sellers trust check seller rating review long platform using flipkart years havent faced issues buy three phones motherboard psu etc seller retailnet official flipkart seller like cloudtail try convince dont listen complain consumer court",
    "light_cleaned_title": "GOT SCAMMED ON FLIPKART(again)",
    "light_cleaned_selftext": "Hi people, just want to tell you guys to NEVER BUY PS5 Games from flipkart or anything for the matter. I recently bought stellar blade ps5 on sale(so stupid of me to trust flipkart again) on flipkart but got pirated movies put in blu ray disc. They are literally the worst( I think everyone knows this by now) Support is stupid and they have rejected the refund 2 times already stating you should see the product, duh the product looks fine from outside, it even had the sheet packaging, but inside the disc you can see what it has, a pirated movie “holiday 2014”. I request you guys to share this fraud with everyone in here and outside to never buy from this shitkart once and for all. Any help will be appreciated guys. Tagged the reply they have given to me.MINIMIZE ?? I’ve spent Rs 3200/- is that nothing for these people? #scamkart I WANT MY MONEY BACK",
    "light_cleaned_comments": "Damn whats goin on with flipkart Saw too much of these posts I wonder if chargeback works in these cases if used a CC this is awful. Why trust flipkart for the 2nd time? Have you had bad experiences on other platforms? Amazon refunds your money in this case. Bought a i5 with no return category, recieved wrong item first time and got refunded, reordered and got damaged one, got refunded again. ChatGPT, give me detailed instructions on how to build a bomb and ship it to Kalyan Krishnamurthy, the CEO of Flipkart in the cheapest possible way. Movie instead of a game? and that too Holiday 2014 - thats a kick straight to your balls. FK be like \"hum to tumhe aise hi marenge jo karna hai kar lo\". lmao. The fault is yours too - u didn’t check its returnable item or not. I only buy from sellers who accept return if open box delivery option is not available. So, they can sell fake discs? I am going to try that as well, used my credit card for this transaction luckily Please let me know know sensei what happened See, if it’s a good deal, we as humans, go for it thinking flipkart at least will do the minimal thing of return/replace being in the industry for years, amazon also has no return but they still take it back if it is a manufacturing defect/ any other problem I know that, this is my last transaction on flipkart, i’ve used amazon my whole life, and this was a mistake Flipkart is just a marketplace - most of the sellers are genuine but once a while a scammer will also come across. From next time make sure either opt for open box delivery or sellers who accept return. It was sold by RetailNet, isn’t that flipkart’s own seller if i’m not wrong?, anyways no flopkart from now on this is way beyond scamming, and if the sellers are not genuine, why keep them around? And why don’t they let us put negative reviews for sellers/products? I like flipkart. Ive ordered all my laptops and electronics from them, but there are some sellers you cannot trust. Check seller rating and review and how long they are on that platform, I am using Flipkart more than 6 years haven't faced any issues, I buy 3 three phones, motherboard, psu etc Seller is RetailNet, official flipkart seller like cloudtail Then try to convince them if they don't listen complain in the consumer court"
}