{
    "id": "ws0sy9",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/ws0sy9/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1660872610,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Tried this Mediterranean recipe recently and loved it: https://www.themediterraneandish.com/foul-mudammas-recipe/#tasty-recipes-33099\n\nIt's pretty quick and easy to make. If you can't find Fava beans easily, you can even substitute cannellini beans. Can substitute Pita bread for khakra or roasted/kadak roti.\n\nThe dish itself is easy to follow through, good taste, and nutritious!",
        "Add spice ( maggi masala) to water. Then add Maggi noodles. Wait for 5-10 minutes and enjoy your Maggi"
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "tried mediterranean recipe recently loved pretty quick easy make cant find fava beans easily even substitute cannellini beans substitute pita bread khakra roastedkadak roti dish easy follow good taste nutritious add spice maggi masala water add maggi noodles wait minutes enjoy maggi",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Tried this Mediterranean recipe recently and loved it: It's pretty quick and easy to make. If you can't find Fava beans easily, you can even substitute cannellini beans. Can substitute Pita bread for khakra or roasted/kadak roti. The dish itself is easy to follow through, good taste, and nutritious! Add spice ( maggi masala) to water. Then add Maggi noodles. Wait for 5-10 minutes and enjoy your Maggi"
}