{
    "id": "16pdd81",
    "title": "Need your genuine feedback India",
    "url": "https://www.reddit.com/r/india/comments/16pdd81/need_your_genuine_feedback_india/",
    "selftext": "I'm 24 years old and preparing for UPSC. As for now I do nothing apart from a YouTube channel that I started a few months ago. Main sirf itna chahta hu ki aap thoda sa time nikaalkar mujhe mere video par feed de ske to achha hoga\n\nVideo achha nahi lge to aage mat dekhna don't worry... \n\nhttps://youtu.be/4oDr0UJ3vwA?si=QXMEGS0TKK1jEPlu\n\nYou can subscribe if you like it",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695396753.0,
    "convurl": "https://external-preview.redd.it/a8gy61pIaCOeVgIlf-1c59_diizeSo6om1LYugkPn54.jpg?auto=webp&s=2aba0c8769fe1e7d6fce431db2f6bb7c24b4d0f8",
    "comments": [
        "The youtubing has become a curse for indian youth. When they realize it is shortlived it will be too late",
        "So youmean YouTube cannot be a career"
    ],
    "cleaned_text": "need genuine feedback india im years old preparing upsc nothing apart youtube channel started months ago main sirf itna chahta hu ki aap thoda sa time nikaalkar mujhe mere video par feed de ske achha hoga video achha nahi lge aage mat dekhna dont worry subscribe like ",
    "cleaned_title": "need genuine feedback india",
    "cleaned_selftext": "im years old preparing upsc nothing apart youtube channel started months ago main sirf itna chahta hu ki aap thoda sa time nikaalkar mujhe mere video par feed de ske achha hoga video achha nahi lge aage mat dekhna dont worry subscribe like",
    "cleaned_comments": "youtubing become curse indian youth realize shortlived late youmean youtube career",
    "light_cleaned_title": "Need your genuine feedback India",
    "light_cleaned_selftext": "I'm 24 years old and preparing for UPSC. As for now I do nothing apart from a YouTube channel that I started a few months ago. Main sirf itna chahta hu ki aap thoda sa time nikaalkar mujhe mere video par feed de ske to achha hoga Video achha nahi lge to aage mat dekhna don't worry... You can subscribe if you like it",
    "light_cleaned_comments": "The youtubing has become a curse for indian youth. When they realize it is shortlived it will be too late So youmean YouTube cannot be a career"
}