{
    "id": "131rn9i",
    "title": "Help find home for Barfi",
    "url": "https://www.reddit.com/gallery/131rn9i",
    "selftext": "Hey Folks,\n\nOur gorgeous doggo Barfi is looking for her home. \n\nBarfi has been abandoned by her previous owners who neglected her for so long. And yet she is a force of energy. We are fostering her at our place in Noida. Within just three weeks of love and care, her true personality has blossomed. She loves to SING and runs as fast as a horse lol. We got to see her loving side too. If one wants to know what it is to love fiercely, they should meet Barfi. For she would make you feel so loved. \n\nThis girl is a unique beautiful mix of Spitz and himalayan dog. There is no other like Barfi. She has been spayed and her vaccinations are up to date. We would prefer a home in Delhi/NCR but her adoption is open pan India for the right family.\n\nReddit doesn't allow sharing contact info. So please dm in case of any leads and I would get back in no time",
    "flair": "AskIndia",
    "score": 173,
    "num_comments": 17,
    "created_utc": 1682688223.0,
    "convurl": "https://i.redd.it/2nitfargmmwa1.jpg",
    "comments": [
        "I hope she gets a home. I sincerely do hope that she gets the comfort of her bed again. Indie dogs have such a tough time getting adopted. For Barfi🌻",
        "reminds me of movie hachiko",
        "Loosen the collar, holy shit",
        "It looks tight. It's actually very loose.",
        "Mountain dogs have a lot of fur. Like a lot, its loose. The fur gives an illusion",
        "We hope that too. Please help in spreading the word.",
        "Barfi’s ears have my heart ❤️",
        "She is beautiful! Hope she finds home soon",
        "Hahah yes!",
        "Please help spread the message.",
        "The ears 🥺❤️",
        "What a cutu yaaar!! Commenting so that this post gets reach :') and please share the details in dm na? I will try posting this on my insta as well.",
        "Hey sure thing. Will dm you the details.",
        "Why don't you take of the dog?",
        "Me and my partner have full time jobs. We travel a lot for work as well. We are currently not ready for 10-15 years commitment to a dog.",
        "Seems plausible, all the best."
    ],
    "cleaned_text": "help find home barfi hey folks gorgeous doggo barfi looking home barfi abandoned previous owners neglected long yet force energy fostering place noida within three weeks love care true personality blossomed loves sing runs fast horse lol got see loving side one wants know love fiercely meet barfi would make feel loved girl unique beautiful mix spitz himalayan dog like barfi spayed vaccinations date would prefer home delhincr adoption open pan india right family reddit doesnt allow sharing contact info please dm case leads would get back time ",
    "cleaned_title": "help find home barfi",
    "cleaned_selftext": "hey folks gorgeous doggo barfi looking home barfi abandoned previous owners neglected long yet force energy fostering place noida within three weeks love care true personality blossomed loves sing runs fast horse lol got see loving side one wants know love fiercely meet barfi would make feel loved girl unique beautiful mix spitz himalayan dog like barfi spayed vaccinations date would prefer home delhincr adoption open pan india right family reddit doesnt allow sharing contact info please dm case leads would get back time",
    "cleaned_comments": "hope gets home sincerely hope gets comfort bed indie dogs tough time getting adopted barfi reminds movie hachiko loosen collar holy shit looks tight actually loose mountain dogs lot fur like lot loose fur gives illusion hope please help spreading word barfis ears heart beautiful hope finds home soon hahah yes please help spread message ears cutu yaaar commenting post gets reach please share details dm na try posting insta well hey sure thing dm details dont take dog partner full time jobs travel lot work well currently ready years commitment dog seems plausible best",
    "light_cleaned_title": "Help find home for Barfi",
    "light_cleaned_selftext": "Hey Folks, Our gorgeous doggo Barfi is looking for her home. Barfi has been abandoned by her previous owners who neglected her for so long. And yet she is a force of energy. We are fostering her at our place in Noida. Within just three weeks of love and care, her true personality has blossomed. She loves to SING and runs as fast as a horse lol. We got to see her loving side too. If one wants to know what it is to love fiercely, they should meet Barfi. For she would make you feel so loved. This girl is a unique beautiful mix of Spitz and himalayan dog. There is no other like Barfi. She has been spayed and her vaccinations are up to date. We would prefer a home in Delhi/NCR but her adoption is open pan India for the right family. Reddit doesn't allow sharing contact info. So please dm in case of any leads and I would get back in no time",
    "light_cleaned_comments": "I hope she gets a home. I sincerely do hope that she gets the comfort of her bed again. Indie dogs have such a tough time getting adopted. For Barfi🌻 reminds me of movie hachiko Loosen the collar, holy shit It looks tight. It's actually very loose. Mountain dogs have a lot of fur. Like a lot, its loose. The fur gives an illusion We hope that too. Please help in spreading the word. Barfi’s ears have my heart ❤️ She is beautiful! Hope she finds home soon Hahah yes! Please help spread the message. The ears 🥺❤️ What a cutu yaaar!! Commenting so that this post gets reach :') and please share the details in dm na? I will try posting this on my insta as well. Hey sure thing. Will dm you the details. Why don't you take of the dog? Me and my partner have full time jobs. We travel a lot for work as well. We are currently not ready for 10-15 years commitment to a dog. Seems plausible, all the best."
}