{
    "id": "14gaka5",
    "title": "Hindutva supporters' boycott of Adipurush over the portrayal of Ram And Hanuman is hypocritic.",
    "url": "https://www.reddit.com/r/india/comments/14gaka5/hindutva_supporters_boycott_of_adipurush_over_the/",
    "selftext": "Hindutva supporters' boycott of Adipurush over the portrayal of Lord Ram And Hanuman is hypocritic, considering how Lord Hanuman was caricatured as an angry figure by these groups, and the name of Ram was associated with mob lynchings. Even recently, Modi tried to associate Bajrang Bali with Bajrang Dal, a terrorist organization.\n\nThis Surprised Pikachu act is comical.\n\n[The viral Angry Hanuman praised by Modi symbolises the aggressive India of today](https://scroll.in/article/879108/angry-hanuman-this-viral-image-that-won-modis-praise-symbolises-todays-aggressive-macho-india)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1687457603.0,
    "convurl": "https://external-preview.redd.it/8qpLqoDGfdmc_pt8tca6sEk7MO6G3-E1yc52aR3JRds.jpg?auto=webp&v=enabled&s=616f6064447a82455214a734c7c7630c84aa1d8c",
    "comments": [
        "you know the Rw empowered boycott culture in India against every small thing like a bikini to stand up comedians to random advertisements. They have trained attack dogs to attack everyone and they are surprised when the dogs are attacking them as well now."
    ],
    "cleaned_text": "hindutva supporters boycott adipurush portrayal ram hanuman hypocritic hindutva supporters boycott adipurush portrayal lord ram hanuman hypocritic considering lord hanuman caricatured angry figure groups name ram associated mob lynchings even recently modi tried associate bajrang bali bajrang dal terrorist organization surprised pikachu act comical viral angry hanuman praised modi symbolises aggressive india todayhttpsscrollinarticleangryhanumanthisviralimagethatwonmodispraisesymbolisestodaysaggressivemachoindia ",
    "cleaned_title": "hindutva supporters boycott adipurush portrayal ram hanuman hypocritic",
    "cleaned_selftext": "hindutva supporters boycott adipurush portrayal lord ram hanuman hypocritic considering lord hanuman caricatured angry figure groups name ram associated mob lynchings even recently modi tried associate bajrang bali bajrang dal terrorist organization surprised pikachu act comical viral angry hanuman praised modi symbolises aggressive india todayhttpsscrollinarticleangryhanumanthisviralimagethatwonmodispraisesymbolisestodaysaggressivemachoindia",
    "cleaned_comments": "know rw empowered boycott culture india every small thing like bikini stand comedians random advertisements trained attack dogs attack everyone surprised dogs attacking well",
    "light_cleaned_title": "Hindutva supporters' boycott of Adipurush over the portrayal of Ram And Hanuman is hypocritic.",
    "light_cleaned_selftext": "Hindutva supporters' boycott of Adipurush over the portrayal of Lord Ram And Hanuman is hypocritic, considering how Lord Hanuman was caricatured as an angry figure by these groups, and the name of Ram was associated with mob lynchings. Even recently, Modi tried to associate Bajrang Bali with Bajrang Dal, a terrorist organization. This Surprised Pikachu act is comical. [The viral Angry Hanuman praised by Modi symbolises the aggressive India of today](https://scroll.in/article/879108/angry-hanuman-this-viral-image-that-won-modis-praise-symbolises-todays-aggressive-macho-india)",
    "light_cleaned_comments": "you know the Rw empowered boycott culture in India against every small thing like a bikini to stand up comedians to random advertisements. They have trained attack dogs to attack everyone and they are surprised when the dogs are attacking them as well now."
}