{
    "id": "166urf1",
    "title": "Parliament special session: Caught by surprise, Opp in Mumbai steps on the gas on Plan 2024",
    "url": "https://indianexpress.com/article/political-pulse/parliament-special-session-caught-by-surprise-opp-in-mumbai-steps-on-the-gas-on-plan-2024-8918482/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fpolitical-pulse%2Fparliament-special-session-caught-by-surprise-opp-in-mumbai-steps-on-the-gas-on-plan-2024-8918482%2F",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693535220.0,
    "convurl": "https://external-preview.redd.it/CwveM0tBJF1LsLTXEFKelq7pUvaOGfO7HZEsbmlBaUY.jpg?auto=webp&s=cfe70f6c69df8e14aa137220f66805197a558531",
    "comments": [
        ">The move set off speculation in the Opposition camp with some leaders wondering whether this was a trial balloon – in line with the BJP’s ‘One Nation, One election’ idea – on advancing Lok Sabha elections due in April-May next year.\n\n\n>Asked about the speculation that the session could see contentious Bills on synchronized elections, uniform civil code and providing 33 percent reservation for women in Parliament and legislatures, a senior Congress MP said. “We don’t know whether they will advance elections…but they can surely say that ‘we tried our best to bring synchronized elections and UCC but the opposition stalled’. They may try to make it an issue in the election.”\n\n>“There was no need to convene a special session. They have to overcome the Constitutional requirement that the maximum gap between two sessions of Parliament cannot be more than six months. I think they may be planning to dispense with the Winter Session… We are staring at a drought in most of the states. Food inflation is already 11.5 per cent. I think the September numbers will be 12 plus. So, we may be looking at the highest ever food inflation at the time of elections which no government can afford,” the leader said.\n\n>A senior JD(U) leader speculated that the BJP could even explore getting the Maharashtra and Haryana Assemblies dissolved where elections are due in October next year, months after the Lok Sabha elections. There is already buzz in Odisha that Chief Minister Naveen Patnaik could advance the Assembly elections. Polls in the state were held along with Lok Sabha elections in 2019. In 2019, Assembly elections in Andhra Pradesh, Sikkim and Arunachal Pradesh too were held along with Lok Sabha. While the BJP is in power in Arunachal, Sikkim and Andhra Pradesh are governed by friendly parties."
    ],
    "cleaned_text": "parliament special session caught surprise opp mumbai steps gas plan  ",
    "cleaned_title": "parliament special session caught surprise opp mumbai steps gas plan",
    "cleaned_selftext": "",
    "cleaned_comments": "move set speculation opposition camp leaders wondering whether trial balloon line bjps one nation one election idea advancing lok sabha elections due aprilmay next year asked speculation session could see contentious bills synchronized elections uniform civil code providing percent reservation women parliament legislatures senior congress mp said dont know whether advance electionsbut surely say tried best bring synchronized elections ucc opposition stalled may try make issue election need convene special session overcome constitutional requirement maximum gap two sessions parliament six months think may planning dispense winter session staring drought states food inflation already per cent think september numbers plus may looking highest ever food inflation time elections government afford leader said senior jdu leader speculated bjp could even explore getting maharashtra haryana assemblies dissolved elections due october next year months lok sabha elections already buzz odisha chief minister naveen patnaik could advance assembly elections polls state held along lok sabha elections assembly elections andhra pradesh sikkim arunachal pradesh held along lok sabha bjp power arunachal sikkim andhra pradesh governed friendly parties",
    "light_cleaned_title": "Parliament special session: Caught by surprise, Opp in Mumbai steps on the gas on Plan 2024",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">The move set off speculation in the Opposition camp with some leaders wondering whether this was a trial balloon – in line with the BJP’s ‘One Nation, One election’ idea – on advancing Lok Sabha elections due in April-May next year. >Asked about the speculation that the session could see contentious Bills on synchronized elections, uniform civil code and providing 33 percent reservation for women in Parliament and legislatures, a senior Congress MP said. “We don’t know whether they will advance elections…but they can surely say that ‘we tried our best to bring synchronized elections and UCC but the opposition stalled’. They may try to make it an issue in the election.” >“There was no need to convene a special session. They have to overcome the Constitutional requirement that the maximum gap between two sessions of Parliament cannot be more than six months. I think they may be planning to dispense with the Winter Session… We are staring at a drought in most of the states. Food inflation is already 11.5 per cent. I think the September numbers will be 12 plus. So, we may be looking at the highest ever food inflation at the time of elections which no government can afford,” the leader said. >A senior JD(U) leader speculated that the BJP could even explore getting the Maharashtra and Haryana Assemblies dissolved where elections are due in October next year, months after the Lok Sabha elections. There is already buzz in Odisha that Chief Minister Naveen Patnaik could advance the Assembly elections. Polls in the state were held along with Lok Sabha elections in 2019. In 2019, Assembly elections in Andhra Pradesh, Sikkim and Arunachal Pradesh too were held along with Lok Sabha. While the BJP is in power in Arunachal, Sikkim and Andhra Pradesh are governed by friendly parties."
}