{
    "id": "17oyw42",
    "title": "Cop probing Elvish Yadav's role in snake venom case transferred to police lines",
    "url": "https://www.deccanherald.com/amp/story/india%2Futtar-pradesh%2Fcop-probing-elvish-yadavs-role-in-snake-venom-case-transferred-to-police-lines-2758153",
    "selftext": "\"The station in-charge Sector-49, Noida, has been transferred to the Reserve Police Line due to his inability to effectively control crime within the police station area,\" a police spokesperson said on Sunday night.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1699262398.0,
    "convurl": "https://external-preview.redd.it/sJYqStkYOkfiYoMo0OwBnPB_bYCxKGiz5Hl7VFD8j6E.jpg?auto=webp&s=6b3959b1f3c45419282d4a1adef0bd462e704ca3",
    "comments": [
        "Of course. (Ch)Uttar Pradesh living up to its reputation.",
        "Haha",
        "Who loves discussing conspiracy theories? I do and I have one.\n\nLveesh gained huge popularity over time, but with BB it propelled to greater heights by Jupiter’s escape velocity. Now PJB honoured him and brought him onto political stage. They thought they’ll give him soft power and in turn he’ll make sure his fans vote for them.\n\nBut seems like Lveesh turned this alliance into one sided alliance. He must have declined more than one request. Also his modern day supporters definitely must be more powerful than conventional supporters of existing politicians. So to break him and keep him on leash, they took the opportunity.",
        "Or maybe that BJP bigwigs are scared Lvish would eat up their children's future political career so already making sure to curb that and destroy him and his image.\n\nOh, and I think he's involved for sure, he's not innocent. I mean the audio clips don't look doctored at all, maybe the allegations are over the top but he is definitely shady and has some involvement with snakes and snake charmers, as you can analyse from the audio, that Rahul guys knows Elvish for sure.\n\nMy point is that why Elvish is not being protected and even put on as a suspect by the BJP guys themselves, because of the above reason, they want to cut his wings and keep him in check.\n\nAnyways, atleast it gives him deserved karma, so good for me.",
        "No worries! we will make another sigham movie",
        "I wonder [kiski](https://www.hindustantimes.com/entertainment/web-series/elvish-yadav-meets-haryana-cm-manohar-lal-after-bigg-boss-ott-2-101692351925423.html) pahuch lagi hogi ismein...",
        "lmco",
        "People of this country give way too much importance to fools that should just be ignored",
        "Lol"
    ],
    "cleaned_text": "cop probing elvish yadavs role snake venom case transferred police lines station incharge sector noida transferred reserve police line due inability effectively control crime within police station area police spokesperson said sunday night ",
    "cleaned_title": "cop probing elvish yadavs role snake venom case transferred police lines",
    "cleaned_selftext": "station incharge sector noida transferred reserve police line due inability effectively control crime within police station area police spokesperson said sunday night",
    "cleaned_comments": "course chuttar pradesh living reputation haha loves discussing conspiracy theories one lveesh gained huge popularity time bb propelled greater heights jupiters escape velocity pjb honoured brought onto political stage thought theyll give soft power turn hell make sure fans vote seems like lveesh turned alliance one sided alliance must declined one request also modern day supporters definitely must powerful conventional supporters existing politicians break keep leash took opportunity maybe bjp bigwigs scared lvish would eat childrens future political career already making sure curb destroy image oh think hes involved sure hes innocent mean audio clips dont look doctored maybe allegations top definitely shady involvement snakes snake charmers analyse audio rahul guys knows elvish sure point elvish protected even put suspect bjp guys reason want cut wings keep check anyways atleast gives deserved karma good worries make another sigham movie wonder kiskihttpswwwhindustantimescomentertainmentwebserieselvishyadavmeetsharyanacmmanoharlalafterbiggbossotthtml pahuch lagi hogi ismein lmco people country give way much importance fools ignored lol",
    "light_cleaned_title": "Cop probing Elvish Yadav's role in snake venom case transferred to police lines",
    "light_cleaned_selftext": "\"The station in-charge Sector-49, Noida, has been transferred to the Reserve Police Line due to his inability to effectively control crime within the police station area,\" a police spokesperson said on Sunday night.",
    "light_cleaned_comments": "Of course. (Ch)Uttar Pradesh living up to its reputation. Haha Who loves discussing conspiracy theories? I do and I have one. Lveesh gained huge popularity over time, but with BB it propelled to greater heights by Jupiter’s escape velocity. Now PJB honoured him and brought him onto political stage. They thought they’ll give him soft power and in turn he’ll make sure his fans vote for them. But seems like Lveesh turned this alliance into one sided alliance. He must have declined more than one request. Also his modern day supporters definitely must be more powerful than conventional supporters of existing politicians. So to break him and keep him on leash, they took the opportunity. Or maybe that BJP bigwigs are scared Lvish would eat up their children's future political career so already making sure to curb that and destroy him and his image. Oh, and I think he's involved for sure, he's not innocent. I mean the audio clips don't look doctored at all, maybe the allegations are over the top but he is definitely shady and has some involvement with snakes and snake charmers, as you can analyse from the audio, that Rahul guys knows Elvish for sure. My point is that why Elvish is not being protected and even put on as a suspect by the BJP guys themselves, because of the above reason, they want to cut his wings and keep him in check. Anyways, atleast it gives him deserved karma, so good for me. No worries! we will make another sigham movie I wonder [kiski](https://www.hindustantimes.com/entertainment/web-series/elvish-yadav-meets-haryana-cm-manohar-lal-after-bigg-boss-ott-2-101692351925423.html) pahuch lagi hogi ismein... lmco People of this country give way too much importance to fools that should just be ignored Lol"
}