{
    "id": "1b4th4v",
    "title": "The Truth Behind the Government’s Claim That Poverty Has Fallen to Just 5%",
    "url": "https://m.thewire.in/article/economy/the-truth-behind-the-governments-claim-that-poverty-has-fallen-to-just-5",
    "selftext": "It is prudent to understand that the 27-pager HCES says nothing about the poverty decline in 2022-23 as compared to 2011-12. Rather it goes ahead and cautions readers about the change in methodology in the current HCES as compared to earlier ones. The factsheet lists various “Issues related to Comparability”.\n\nNevertheless, the Niti Aayog CEO, who also knows this surely, went ahead and compared the current survey with earlier ones in claiming poverty reduction. Bear inn mind that the Niti Aayog has no current poverty line by – unlike the erstwhile Planning Commission – by which to measure the current level of poverty. Additionally, it would be curious to argue that consumption expenditure is rising when real wages have been stagnating in recent years; yet that is exactly what representatives of the government have used HCES 2023 data to argue.",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 1,
    "created_utc": 1709400221.0,
    "convurl": "https://external-preview.redd.it/Nl0CcxLR--TJUlwISZ2tjKszSyvyQb2D1AKbSXmm2EA.jpg?auto=webp&s=5bf6335785b9bb126ea5785a7671ea7d86d51967",
    "comments": [
        "Unfortunately, we don't need a report to confirm that we as a nation have gone numb to the lies... \n\nLucky for us, looks like there a few people who continue to work on shedding light on the truth."
    ],
    "cleaned_text": "truth behind governments claim poverty fallen prudent understand pager hces says nothing poverty decline compared rather goes ahead cautions readers change methodology current hces compared earlier ones factsheet lists various issues related comparability nevertheless niti aayog ceo also knows surely went ahead compared current survey earlier ones claiming poverty reduction bear inn mind niti aayog current poverty line unlike erstwhile planning commission measure current level poverty additionally would curious argue consumption expenditure rising real wages stagnating recent years yet exactly representatives government used hces data argue ",
    "cleaned_title": "truth behind governments claim poverty fallen",
    "cleaned_selftext": "prudent understand pager hces says nothing poverty decline compared rather goes ahead cautions readers change methodology current hces compared earlier ones factsheet lists various issues related comparability nevertheless niti aayog ceo also knows surely went ahead compared current survey earlier ones claiming poverty reduction bear inn mind niti aayog current poverty line unlike erstwhile planning commission measure current level poverty additionally would curious argue consumption expenditure rising real wages stagnating recent years yet exactly representatives government used hces data argue",
    "cleaned_comments": "unfortunately dont need report confirm nation gone numb lies lucky us looks like people continue work shedding light truth",
    "light_cleaned_title": "The Truth Behind the Government’s Claim That Poverty Has Fallen to Just 5%",
    "light_cleaned_selftext": "It is prudent to understand that the 27-pager HCES says nothing about the poverty decline in 2022-23 as compared to 2011-12. Rather it goes ahead and cautions readers about the change in methodology in the current HCES as compared to earlier ones. The factsheet lists various “Issues related to Comparability”. Nevertheless, the Niti Aayog CEO, who also knows this surely, went ahead and compared the current survey with earlier ones in claiming poverty reduction. Bear inn mind that the Niti Aayog has no current poverty line by – unlike the erstwhile Planning Commission – by which to measure the current level of poverty. Additionally, it would be curious to argue that consumption expenditure is rising when real wages have been stagnating in recent years; yet that is exactly what representatives of the government have used HCES 2023 data to argue.",
    "light_cleaned_comments": "Unfortunately, we don't need a report to confirm that we as a nation have gone numb to the lies... Lucky for us, looks like there a few people who continue to work on shedding light on the truth."
}