{
    "id": "18xfw50",
    "title": "Men are really bigggg Predators.",
    "url": "https://www.firstpost.com/explainers/now-a-gang-rape-in-metaverse-how-sexual-predators-roam-free-in-the-virtual-world-13570602.html?utm_medium=social&utm_source=whatsapp",
    "selftext": "Any comments? So technically girls are not safe even in virtual world?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 21,
    "created_utc": 1704276129.0,
    "convurl": "https://external-preview.redd.it/6dW_onUTuL4Xb-h_HcIdllrOgxOkcACHE-pyoUTs-Jo.jpg?auto=webp&s=9ee76983a89f76b5e3b4fb2469063975c77ff92a",
    "comments": [
        "The average Reddit comment section will tell you how far people will go under the garb of anonymity. It strips you of the ability to see another as a human being.",
        "So when I am playing COD and someone's kills me is it count as virtual murder",
        "Lol digital rape what a joke and comparing someone who has been digitally raped to someone who has been physically raped is like a slap to the face to the one who has been physically raped . Its insulting and demeaning.  People call anything rape nowadays",
        "this is very stupid. no teenager should experience this but calling it gang rape is an insult to real victims. Also controlling these kinds of things should be the company's responsibility.",
        "You should consider finishing a race",
        "Are you talking about Asphalt?",
        "Remove the goggles? Turn off?",
        "Yeah and some lose their IQ, can't the user remove the goggles? Why would anyone not remove the goggles when it gets violent?",
        "Ah, we can't escape victim blaming even in the virtual world it seems.",
        "Then don't be in the virtual world lol",
        "Victim blaming is badI agree.. But I'm talking to the person who commented.. Especially in virtual world where by definition it's designed to be unplugged.. Logical discussion?",
        "I think the real conversation should be about why the men are audacious enough to do such things virtually.",
        "Don't do identity politics.. It's an individual Tom and Harry.. Not Men.. If some woman steals from me, should I label all women as thieves? How absurd that is? \nBtw still expecting your response for why not just remove the goggles?",
        "Men = man ka plural\nSince it was more than one man involved the word being used is men. I never made a general statement for all men lol.\n\n\n>Btw still expecting your response for why not just remove the goggles?\n\nBecause there is an obvious disconnect in today's generation. People perceive online interactions as real. Which is why there is even a case in the first place. \n\nWe don't know when she took the headset off but that doesn't mean what she faced is any less heinous.",
        "Ok in that case woman of today should realize technology has it's sides and learn to use it. Sometimes the person you interact with can be a bot or even the opposite gender. Some encounters maybe where the other person hits you or shoots you graphically. But the simple power to you statement is - Some gadgets can be removed without any damage and can even be turned off. You can control it.",
        ">Some gadgets can be removed without any damage and can even be turned off. You can control it. You can remove it! You can! Power to you!\n\nAgain, why are we not having the conversation of why people think it's okay to do this to someone.\n\nIt's somehow always a woman's responsibility to not be a victim of sexual crimes - real or virtual but never the attacker's responsibility to not sexually harass someone.\n\nBTW the headline is clickbait. The real crime is how easy it is to subject minors to sexually illicit material in the virtual space. That's what the cops are probing into.",
        "Yes great it's better to expect responsibility from a criminal than escaping. Even better, it's better to not change things under your control and instead try to change things that aren't under your control. \n\n*insert Serenity prayer here* x 3\n\nPs: I'm sure you'll say it's reasonable to lock your safe or home at night and not expect responsible behavior from whoever to not rob you.",
        "Lol like I said we aren't even free from victim blaming in the virtual world.\n\nY'all won't call out the weirdos who think it's okay to sexually harass someone, regardless of it being online or offline but sure it's her fault. Victim blaming will definitely not add to the mental disturbance of being harassed as a child. \n\nPs: I'm sure you'll say \"Well, just don't go outside! More power to you!\" When a girl tells you she's been SA'd or harassed in real life."
    ],
    "cleaned_text": "men really bigggg predators comments technically girls safe even virtual world ",
    "cleaned_title": "men really bigggg predators",
    "cleaned_selftext": "comments technically girls safe even virtual world",
    "cleaned_comments": "average reddit comment section tell far people go garb anonymity strips ability see another human playing cod someones kills count virtual murder lol digital rape joke comparing someone digitally raped someone physically raped like slap face one physically raped insulting demeaning people call anything rape nowadays stupid teenager experience calling gang rape insult real victims also controlling kinds things companys responsibility consider finishing race talking asphalt remove goggles turn yeah lose iq cant user remove goggles would anyone remove goggles gets violent ah cant escape victim blaming even virtual world seems dont virtual world lol victim blaming badi agree im talking person commented especially virtual world definition designed unplugged logical discussion think real conversation men audacious enough things virtually dont identity politics individual tom harry men woman steals label women thieves absurd btw still expecting response remove goggles men man ka plural since one man involved word used men never made general statement men lol btw still expecting response remove goggles obvious disconnect todays generation people perceive online interactions real even case first place dont know took headset doesnt mean faced less heinous ok case woman today realize technology sides learn use sometimes person interact bot even opposite gender encounters maybe person hits shoots graphically simple power statement gadgets removed without damage even turned control gadgets removed without damage even turned control remove power conversation people think okay someone somehow always womans responsibility victim sexual crimes real virtual never attackers responsibility sexually harass someone btw headline clickbait real crime easy subject minors sexually illicit material virtual space thats cops probing yes great better expect responsibility criminal escaping even better better change things control instead try change things arent control insert serenity prayer x ps im sure youll say reasonable lock safe home night expect responsible behavior whoever rob lol like said arent even free victim blaming virtual world yall wont call weirdos think okay sexually harass someone regardless online offline sure fault victim blaming definitely add mental disturbance harassed child ps im sure youll say well dont go outside power girl tells shes sad harassed real life",
    "light_cleaned_title": "Men are really bigggg Predators.",
    "light_cleaned_selftext": "Any comments? So technically girls are not safe even in virtual world?",
    "light_cleaned_comments": "The average Reddit comment section will tell you how far people will go under the garb of anonymity. It strips you of the ability to see another as a human being. So when I am playing COD and someone's kills me is it count as virtual murder Lol digital rape what a joke and comparing someone who has been digitally raped to someone who has been physically raped is like a slap to the face to the one who has been physically raped . Its insulting and demeaning. People call anything rape nowadays this is very stupid. no teenager should experience this but calling it gang rape is an insult to real victims. Also controlling these kinds of things should be the company's responsibility. You should consider finishing a race Are you talking about Asphalt? Remove the goggles? Turn off? Yeah and some lose their IQ, can't the user remove the goggles? Why would anyone not remove the goggles when it gets violent? Ah, we can't escape victim blaming even in the virtual world it seems. Then don't be in the virtual world lol Victim blaming is badI agree.. But I'm talking to the person who commented.. Especially in virtual world where by definition it's designed to be unplugged.. Logical discussion? I think the real conversation should be about why the men are audacious enough to do such things virtually. Don't do identity politics.. It's an individual Tom and Harry.. Not Men.. If some woman steals from me, should I label all women as thieves? How absurd that is? Btw still expecting your response for why not just remove the goggles? Men = man ka plural Since it was more than one man involved the word being used is men. I never made a general statement for all men lol. >Btw still expecting your response for why not just remove the goggles? Because there is an obvious disconnect in today's generation. People perceive online interactions as real. Which is why there is even a case in the first place. We don't know when she took the headset off but that doesn't mean what she faced is any less heinous. Ok in that case woman of today should realize technology has it's sides and learn to use it. Sometimes the person you interact with can be a bot or even the opposite gender. Some encounters maybe where the other person hits you or shoots you graphically. But the simple power to you statement is - Some gadgets can be removed without any damage and can even be turned off. You can control it. >Some gadgets can be removed without any damage and can even be turned off. You can control it. You can remove it! You can! Power to you! Again, why are we not having the conversation of why people think it's okay to do this to someone. It's somehow always a woman's responsibility to not be a victim of sexual crimes - real or virtual but never the attacker's responsibility to not sexually harass someone. BTW the headline is clickbait. The real crime is how easy it is to subject minors to sexually illicit material in the virtual space. That's what the cops are probing into. Yes great it's better to expect responsibility from a criminal than escaping. Even better, it's better to not change things under your control and instead try to change things that aren't under your control. *insert Serenity prayer here* x 3 Ps: I'm sure you'll say it's reasonable to lock your safe or home at night and not expect responsible behavior from whoever to not rob you. Lol like I said we aren't even free from victim blaming in the virtual world. Y'all won't call out the weirdos who think it's okay to sexually harass someone, regardless of it being online or offline but sure it's her fault. Victim blaming will definitely not add to the mental disturbance of being harassed as a child. Ps: I'm sure you'll say \"Well, just don't go outside! More power to you!\" When a girl tells you she's been SA'd or harassed in real life."
}