{
    "id": "156wwez",
    "title": "Jaya Bachchan says 'I am ashamed, couldn't watch the entire clip' | Manipur Video | News - Times of India Videos",
    "url": "https://timesofindia.indiatimes.com/videos/news/manipur-video-jaya-bachchan-says-i-am-ashamed-couldnt-watch-the-entire-clip/videoshow/102009811.cms",
    "selftext": "Maybe next stop for ED is Jaya Bachchan. Most channels didn’t show or mention Jaya talking about UP.\n\nMaybe the threat of ED raid is the reason Amitabh would rather sit in the corner of his house and practice praises for Modi for when he is called upon next time…",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1690063900.0,
    "convurl": "https://external-preview.redd.it/Aw3TcZolif7LaAiUVPe52qc2EbI8vU2Lkfn-1Uqt-vI.jpg?auto=webp&s=d060b5ebd677959790e41bc725ae2c603e3deedb",
    "comments": [
        "Republic TV very conveniently removed any mention of UP from their coverage.\n\nAmitabh must be real proud that there’s someone with real balls in the house.",
        "Amitabh's black money was found in some leaks many years back. How can he speak!\n\nNo one even care about that today, no one even mentions it now."
    ],
    "cleaned_text": "jaya bachchan says ashamed couldnt watch entire clip manipur video news times india videos maybe next stop ed jaya bachchan channels didnt show mention jaya talking maybe threat ed raid reason amitabh would rather sit corner house practice praises modi called upon next time ",
    "cleaned_title": "jaya bachchan says ashamed couldnt watch entire clip manipur video news times india videos",
    "cleaned_selftext": "maybe next stop ed jaya bachchan channels didnt show mention jaya talking maybe threat ed raid reason amitabh would rather sit corner house practice praises modi called upon next time",
    "cleaned_comments": "republic tv conveniently removed mention coverage amitabh must real proud theres someone real balls house amitabhs black money found leaks many years back speak one even care today one even mentions",
    "light_cleaned_title": "Jaya Bachchan says 'I am ashamed, couldn't watch the entire clip' | Manipur Video | News - Times of India Videos",
    "light_cleaned_selftext": "Maybe next stop for ED is Jaya Bachchan. Most channels didn’t show or mention Jaya talking about UP. Maybe the threat of ED raid is the reason Amitabh would rather sit in the corner of his house and practice praises for Modi for when he is called upon next time…",
    "light_cleaned_comments": "Republic TV very conveniently removed any mention of UP from their coverage. Amitabh must be real proud that there’s someone with real balls in the house. Amitabh's black money was found in some leaks many years back. How can he speak! No one even care about that today, no one even mentions it now."
}