{
    "id": "1ely4ph",
    "title": "Sweeping terms in draft broadcast Bill raise red flags on free speech",
    "url": "https://indianexpress.com/article/india/broadcast-bill-free-speech-ott-platforms-ib-ministry-1995-cable-television-networks-regulation-act-social-media-accounts-9499327/?ref=hometop_hp",
    "selftext": "Expanding its remit from OTT content and digital news to include social media accounts and online video creators; defining a “digital news broadcaster” in sweeping terms; requiring prior registration with government to prescribing standards for content evaluation, the latest draft of the Broadcasting Services (Regulation) Bill, 2024, raises several questions on the freedom of speech and expression and the government’s powers to regulate it.\n\nThis has been discussed before but it's important to keep in the spotlight. ",
    "flair": "Law & Courts",
    "score": 35,
    "num_comments": 2,
    "created_utc": 1722990974.0,
    "convurl": "https://external-preview.redd.it/u1-zrftOKghAM2P9N5mkqxTQQBcCwadLexzECywaWOY.jpg?auto=webp&s=8556507ac648002b578102c18838aac11c8470e2",
    "comments": [
        "If it passes, I am convinced the opposition is dead, the law and order are dead and democracy is on the death bed.",
        "We will be a democracy like Russia 🇷🇺"
    ],
    "cleaned_text": "sweeping terms draft broadcast bill raise red flags free speech expanding remit ott content digital news include social media accounts online video creators defining digital news broadcaster sweeping terms requiring prior registration government prescribing standards content evaluation latest draft broadcasting services regulation bill raises several questions freedom speech expression governments powers regulate discussed important keep spotlight ",
    "cleaned_title": "sweeping terms draft broadcast bill raise red flags free speech",
    "cleaned_selftext": "expanding remit ott content digital news include social media accounts online video creators defining digital news broadcaster sweeping terms requiring prior registration government prescribing standards content evaluation latest draft broadcasting services regulation bill raises several questions freedom speech expression governments powers regulate discussed important keep spotlight",
    "cleaned_comments": "passes convinced opposition dead law order dead democracy death bed democracy like russia",
    "light_cleaned_title": "Sweeping terms in draft broadcast Bill raise red flags on free speech",
    "light_cleaned_selftext": "Expanding its remit from OTT content and digital news to include social media accounts and online video creators; defining a “digital news broadcaster” in sweeping terms; requiring prior registration with government to prescribing standards for content evaluation, the latest draft of the Broadcasting Services (Regulation) Bill, 2024, raises several questions on the freedom of speech and expression and the government’s powers to regulate it. This has been discussed before but it's important to keep in the spotlight.",
    "light_cleaned_comments": "If it passes, I am convinced the opposition is dead, the law and order are dead and democracy is on the death bed. We will be a democracy like Russia 🇷🇺"
}