{
    "id": "15txskk",
    "title": "Seriously I have to pay GST 2 times? If I order food online",
    "url": "https://www.reddit.com/gallery/15txskk",
    "selftext": "So I wanted to order a waffle cake from Belgian waffle.\nI check prices online on zomato, dude's charging Rs. 75 more. All of its GST, restaurant packing charges and delivery fee seemed so bs to me. That I felt, I should actually lift my lazy arse up, go out buy it directly from the outlet (less than 500 meters away). I go in, order the same thing. They just charge me Rs. 360 INCLUDING GST, INCLUDING RSTRNT PACKAGING (i told to do a parcel) (see last pic of the bill).\nNow my qn to zomato is, why the heck are you charging gst on Rs 360 which is already a gst inclusive price?\nForget the restaurant packaging (wo maine maaf kiya tum logo k liye) (besharmo, restaurant packing charges pe bhi 1 rupya gst maar rahe ho)\n\n\n\nIdk maybe i don't understand the latest law that the gvt imposed on food delivery companies.\n\nIf they charge gst on the delivery price they are taking then it seem understandable. (but yaha toh vo nai dekhne mila)\n\nThey are charging gst on the gst inclusive price of the item which is being delivered, which seem so unfair.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692302037.0,
    "convurl": "https://i.redd.it/szttm4ys6qib1.png",
    "comments": [
        "\"I do not use food delivery apps\"\n\n/S",
        "जब हस्तमैथुन करते हैं तो भी आखिरी के चार बूंद GST के नाम जाती हैं। तुम तो ज़ालिम खाना मंगवा रहे हो।",
        ">  That I felt, I should actually lift my lazy arse up, go out buy it directly from the outlet (less than 500 meters away).\n\n\"Works as designed\"\n\n> Now my qn to zomato is, why the heck are you charging gst on Rs 360 which is already a gst inclusive price?\n\nFirstly, the prices are set by restaurant, not Zomato. Typically restaurants inflate the prices on delivery platforms to account for commission they have to pay.\n\nSecondly, this could be a side effect of how the restaurants [can't claim input tax credit](https://www.businesstoday.in/latest/economy-politics/story/restaurants-gst-5-percent-ac-non-hotels-tax-restaurant-bill-cheaper-89777-2017-11-15) on 5% GST rated items.",
        "So when will you be ordering from them next?"
    ],
    "cleaned_text": "seriously pay gst times order food online wanted order waffle cake belgian waffle check prices online zomato dudes charging rs gst restaurant packing charges delivery fee seemed bs felt actually lift lazy arse go buy directly outlet less meters away go order thing charge rs including gst including rstrnt packaging told parcel see last pic bill qn zomato heck charging gst rs already gst inclusive price forget restaurant packaging wo maine maaf kiya tum logo k liye besharmo restaurant packing charges pe bhi rupya gst maar rahe ho idk maybe dont understand latest law gvt imposed food delivery companies charge gst delivery price taking seem understandable yaha toh vo nai dekhne mila charging gst gst inclusive price item delivered seem unfair ",
    "cleaned_title": "seriously pay gst times order food online",
    "cleaned_selftext": "wanted order waffle cake belgian waffle check prices online zomato dudes charging rs gst restaurant packing charges delivery fee seemed bs felt actually lift lazy arse go buy directly outlet less meters away go order thing charge rs including gst including rstrnt packaging told parcel see last pic bill qn zomato heck charging gst rs already gst inclusive price forget restaurant packaging wo maine maaf kiya tum logo k liye besharmo restaurant packing charges pe bhi rupya gst maar rahe ho idk maybe dont understand latest law gvt imposed food delivery companies charge gst delivery price taking seem understandable yaha toh vo nai dekhne mila charging gst gst inclusive price item delivered seem unfair",
    "cleaned_comments": "use food delivery apps gst felt actually lift lazy arse go buy directly outlet less meters away works designed qn zomato heck charging gst rs already gst inclusive price firstly prices set restaurant zomato typically restaurants inflate prices delivery platforms account commission pay secondly could side effect restaurants cant claim input tax credithttpswwwbusinesstodayinlatesteconomypoliticsstoryrestaurantsgstpercentacnonhotelstaxrestaurantbillcheaper gst rated items ordering next",
    "light_cleaned_title": "Seriously I have to pay GST 2 times? If I order food online",
    "light_cleaned_selftext": "So I wanted to order a waffle cake from Belgian waffle. I check prices online on zomato, dude's charging Rs. 75 more. All of its GST, restaurant packing charges and delivery fee seemed so bs to me. That I felt, I should actually lift my lazy arse up, go out buy it directly from the outlet (less than 500 meters away). I go in, order the same thing. They just charge me Rs. 360 INCLUDING GST, INCLUDING RSTRNT PACKAGING (i told to do a parcel) (see last pic of the bill). Now my qn to zomato is, why the heck are you charging gst on Rs 360 which is already a gst inclusive price? Forget the restaurant packaging (wo maine maaf kiya tum logo k liye) (besharmo, restaurant packing charges pe bhi 1 rupya gst maar rahe ho) Idk maybe i don't understand the latest law that the gvt imposed on food delivery companies. If they charge gst on the delivery price they are taking then it seem understandable. (but yaha toh vo nai dekhne mila) They are charging gst on the gst inclusive price of the item which is being delivered, which seem so unfair.",
    "light_cleaned_comments": "\"I do not use food delivery apps\" /S जब हस्तमैथुन करते हैं तो भी आखिरी के चार बूंद GST के नाम जाती हैं। तुम तो ज़ालिम खाना मंगवा रहे हो। > That I felt, I should actually lift my lazy arse up, go out buy it directly from the outlet (less than 500 meters away). \"Works as designed\" > Now my qn to zomato is, why the heck are you charging gst on Rs 360 which is already a gst inclusive price? Firstly, the prices are set by restaurant, not Zomato. Typically restaurants inflate the prices on delivery platforms to account for commission they have to pay. Secondly, this could be a side effect of how the restaurants [can't claim input tax credit](https://www.businesstoday.in/latest/economy-politics/story/restaurants-gst-5-percent-ac-non-hotels-tax-restaurant-bill-cheaper-89777-2017-11-15) on 5% GST rated items. So when will you be ordering from them next?"
}