{
    "id": "15g4wx2",
    "title": "Trouble with people in Guwahati",
    "url": "https://www.reddit.com/r/india/comments/15g4wx2/trouble_with_people_in_guwahati/",
    "selftext": "I'm currently staying with my parents in Guwahati till college starts and they told me about these residents that live in the house next to our building. Before I came here, they had this huge argument with my parents (they're old, in their late 50s) and were insanely rude to them. My parents are extremely docile people and they just shut up and agreed to their highly inconsiderate demands. \n\nNow, the demand in question is the dumbest fucking thing and it infuriated me. The thing is, this apartment is highly shitty and there's no balcony here. My parents have to hang their wet clothes on the window instead. It's far from ideal but it's the only way. We don't have a washing machine so the clothes aren't spun and therefore when we hang the clothes some water drips down to the road below. And it's not even a lot of water, it's literally just [slight numbness](https://ibb.co/ct3DPfp). On top of that, you can just walk slightly to either side and it wouldn't even be an issue. The people who live in the next house are saying that they do not like the fact that there's water on the road. They refuse to walk to slightly to the left because \"why should [they]?\". \n\nFor this, they harassed my old parents. Yelled at them and literally used abusive language towards them. So when I got here today and learned that this has been happening I felt terrible. I cannot be with them all the time and I can't live with knowing they're constantly being harrassed like that. There is a roof but it's like 5 storeys up and there's no elevator, my parents can't do that everyday. So instead of hanging the clothes inside their congested apartment, I asked them to hang it on the window and we'll see what happens.\n\nThis morning, my mother did that and immediately the man started yelling. It's not even speaking loudly, he was MAD mad. I was downstairs so I asked the man what's the issue. He was so immediately aggressive that he made the slapping gesture and began advancing towards me. I announced that if he ever so slightly touches me I'll call the police. He stopped but continued his yelling. I wasn't really reciprocating the energy just recording everything in case of assault. My mother came downstairs to see what was happening and this man called her a whore (in hindi ofc). I'm from Lucknow so I don't really know any Assamese but he was speaking to us in whatever Hindi he knew. This was honestly a breaking point for me because I can't take that kind of disrespect against my mother. I called the police. This got them even more infuriated and said \"ab toh mara mari hogi\". I remind you that all this bullshit is because the PUBLIC ROAD in front of their house got slightly wet. \n\nThe guy who owns the building was called and he tried defusing the whole thing. He told me that police here isn't very lawful and seeing that most of us are Muslim they wouldn't be very kind to either side in case things get heated up. (This bit is irrelevant to my main concern so please do not argue why Islamophobia isn't real or why it is valid). The guy managed to convince them to not be assholes about it and they agreed so I called off the police, told them the matter is resolved. Our clothes are still drying outside but this whole thing has annoyed me so much. Even more, I am concerned for my parents safety. If it wasn't for the fact that we're financially in ruins they'd be living in a safer community. I hope this argument is the end of everything and they let us hang the clothes. But idk what I'll do if they start this shit again.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690971033.0,
    "convurl": "https://external-preview.redd.it/of9mlvbKf6ZTirszsNCReORDPW4pkkJ6p74YLVMvEi8.jpg?auto=webp&s=06f519b2b2d5419b48729da71c64c45b3e2ac6b3",
    "comments": [
        "Just call the cops next time. The owner is wrong about the cops. I'm from Guwahati. And they are not that bad. DM me if you need any help. BTW is this Hatigaon you are talking about?"
    ],
    "cleaned_text": "trouble people guwahati im currently staying parents guwahati till college starts told residents live house next building came huge argument parents theyre old late insanely rude parents extremely docile people shut agreed highly inconsiderate demands demand question dumbest fucking thing infuriated thing apartment highly shitty theres balcony parents hang wet clothes window instead far ideal way dont washing machine clothes arent spun therefore hang clothes water drips road even lot water literally slight numbnesshttpsibbcoctdpfp top walk slightly either side wouldnt even issue people live next house saying like fact theres water road refuse walk slightly left harassed old parents yelled literally used abusive language towards got today learned happening felt terrible time cant live knowing theyre constantly harrassed like roof like storeys theres elevator parents cant everyday instead hanging clothes inside congested apartment asked hang window well see happens morning mother immediately man started yelling even speaking loudly mad mad downstairs asked man whats issue immediately aggressive made slapping gesture began advancing towards announced ever slightly touches ill call police stopped continued yelling wasnt really reciprocating energy recording everything case assault mother came downstairs see happening man called whore hindi ofc im lucknow dont really know assamese speaking us whatever hindi knew honestly breaking point cant take kind disrespect mother called police got even infuriated said ab toh mara mari hogi remind bullshit public road front house got slightly wet guy owns building called tried defusing whole thing told police isnt lawful seeing us muslim wouldnt kind either side case things get heated bit irrelevant main concern please argue islamophobia isnt real valid guy managed convince assholes agreed called police told matter resolved clothes still drying outside whole thing annoyed much even concerned parents safety wasnt fact financially ruins theyd living safer community hope argument end everything let us hang clothes idk ill start shit ",
    "cleaned_title": "trouble people guwahati",
    "cleaned_selftext": "im currently staying parents guwahati till college starts told residents live house next building came huge argument parents theyre old late insanely rude parents extremely docile people shut agreed highly inconsiderate demands demand question dumbest fucking thing infuriated thing apartment highly shitty theres balcony parents hang wet clothes window instead far ideal way dont washing machine clothes arent spun therefore hang clothes water drips road even lot water literally slight numbnesshttpsibbcoctdpfp top walk slightly either side wouldnt even issue people live next house saying like fact theres water road refuse walk slightly left harassed old parents yelled literally used abusive language towards got today learned happening felt terrible time cant live knowing theyre constantly harrassed like roof like storeys theres elevator parents cant everyday instead hanging clothes inside congested apartment asked hang window well see happens morning mother immediately man started yelling even speaking loudly mad mad downstairs asked man whats issue immediately aggressive made slapping gesture began advancing towards announced ever slightly touches ill call police stopped continued yelling wasnt really reciprocating energy recording everything case assault mother came downstairs see happening man called whore hindi ofc im lucknow dont really know assamese speaking us whatever hindi knew honestly breaking point cant take kind disrespect mother called police got even infuriated said ab toh mara mari hogi remind bullshit public road front house got slightly wet guy owns building called tried defusing whole thing told police isnt lawful seeing us muslim wouldnt kind either side case things get heated bit irrelevant main concern please argue islamophobia isnt real valid guy managed convince assholes agreed called police told matter resolved clothes still drying outside whole thing annoyed much even concerned parents safety wasnt fact financially ruins theyd living safer community hope argument end everything let us hang clothes idk ill start shit",
    "cleaned_comments": "call cops next time owner wrong cops im guwahati bad dm need help btw hatigaon talking",
    "light_cleaned_title": "Trouble with people in Guwahati",
    "light_cleaned_selftext": "I'm currently staying with my parents in Guwahati till college starts and they told me about these residents that live in the house next to our building. Before I came here, they had this huge argument with my parents (they're old, in their late 50s) and were insanely rude to them. My parents are extremely docile people and they just shut up and agreed to their highly inconsiderate demands. Now, the demand in question is the dumbest fucking thing and it infuriated me. The thing is, this apartment is highly shitty and there's no balcony here. My parents have to hang their wet clothes on the window instead. It's far from ideal but it's the only way. We don't have a washing machine so the clothes aren't spun and therefore when we hang the clothes some water drips down to the road below. And it's not even a lot of water, it's literally just [slight numbness](https://ibb.co/ct3DPfp). On top of that, you can just walk slightly to either side and it wouldn't even be an issue. The people who live in the next house are saying that they do not like the fact that there's water on the road. They refuse to walk to slightly to the left because \"why should [they]?\". For this, they harassed my old parents. Yelled at them and literally used abusive language towards them. So when I got here today and learned that this has been happening I felt terrible. I cannot be with them all the time and I can't live with knowing they're constantly being harrassed like that. There is a roof but it's like 5 storeys up and there's no elevator, my parents can't do that everyday. So instead of hanging the clothes inside their congested apartment, I asked them to hang it on the window and we'll see what happens. This morning, my mother did that and immediately the man started yelling. It's not even speaking loudly, he was MAD mad. I was downstairs so I asked the man what's the issue. He was so immediately aggressive that he made the slapping gesture and began advancing towards me. I announced that if he ever so slightly touches me I'll call the police. He stopped but continued his yelling. I wasn't really reciprocating the energy just recording everything in case of assault. My mother came downstairs to see what was happening and this man called her a whore (in hindi ofc). I'm from Lucknow so I don't really know any Assamese but he was speaking to us in whatever Hindi he knew. This was honestly a breaking point for me because I can't take that kind of disrespect against my mother. I called the police. This got them even more infuriated and said \"ab toh mara mari hogi\". I remind you that all this bullshit is because the PUBLIC ROAD in front of their house got slightly wet. The guy who owns the building was called and he tried defusing the whole thing. He told me that police here isn't very lawful and seeing that most of us are Muslim they wouldn't be very kind to either side in case things get heated up. (This bit is irrelevant to my main concern so please do not argue why Islamophobia isn't real or why it is valid). The guy managed to convince them to not be assholes about it and they agreed so I called off the police, told them the matter is resolved. Our clothes are still drying outside but this whole thing has annoyed me so much. Even more, I am concerned for my parents safety. If it wasn't for the fact that we're financially in ruins they'd be living in a safer community. I hope this argument is the end of everything and they let us hang the clothes. But idk what I'll do if they start this shit again.",
    "light_cleaned_comments": "Just call the cops next time. The owner is wrong about the cops. I'm from Guwahati. And they are not that bad. DM me if you need any help. BTW is this Hatigaon you are talking about?"
}