{
    "id": "14h1fwr",
    "title": "Not selling but Seeking Honest Feedback on My Unique Pet ID Tag Prototype!",
    "url": "https://www.reddit.com/r/india/comments/14h1fwr/not_selling_but_seeking_honest_feedback_on_my/",
    "selftext": " [https://imgur.com/a/TrxQqt7](https://imgur.com/a/TrxQqt7)\n\nI'm super excited to share my latest project with all of you - a unique pet ID tag that I've been working on. As a pet owner myself, I understand the importance of ensuring our furry friends' safety and well-being. That's why I've put my heart and soul into designing this unique pet ID tag. But before I move forward with manufacturing, I would greatly appreciate your valuable feedback and suggestions.\n\n*Please take a moment to check out the attached images of the prototype. Your valuable feedback will help refine the product and make it even better. Additionally, I would like to know what price range you would consider reasonable for a pet ID tag like this.*",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687533942.0,
    "convurl": "https://external-preview.redd.it/wXDMLHIVGQKg1xALKFiTExSgTGNC4H2-38Y80LJP2qQ.jpg?auto=webp&v=enabled&s=f90d5dba424aa86b7aaffeb152af5879783c830b",
    "comments": [],
    "cleaned_text": "selling seeking honest feedback unique pet id tag prototype httpsimgurcomatrxqqthttpsimgurcomatrxqqt im super excited share latest project unique pet id tag ive working pet owner understand importance ensuring furry friends safety wellbeing thats ive put heart soul designing unique pet id tag move forward manufacturing would greatly appreciate valuable feedback suggestions please take moment check attached images prototype valuable feedback help refine product make even better additionally would like know price range would consider reasonable pet id tag like ",
    "cleaned_title": "selling seeking honest feedback unique pet id tag prototype",
    "cleaned_selftext": "httpsimgurcomatrxqqthttpsimgurcomatrxqqt im super excited share latest project unique pet id tag ive working pet owner understand importance ensuring furry friends safety wellbeing thats ive put heart soul designing unique pet id tag move forward manufacturing would greatly appreciate valuable feedback suggestions please take moment check attached images prototype valuable feedback help refine product make even better additionally would like know price range would consider reasonable pet id tag like",
    "cleaned_comments": "",
    "light_cleaned_title": "Not selling but Seeking Honest Feedback on My Unique Pet ID Tag Prototype!",
    "light_cleaned_selftext": "[https://imgur.com/a/TrxQqt7](https://imgur.com/a/TrxQqt7) I'm super excited to share my latest project with all of you - a unique pet ID tag that I've been working on. As a pet owner myself, I understand the importance of ensuring our furry friends' safety and well-being. That's why I've put my heart and soul into designing this unique pet ID tag. But before I move forward with manufacturing, I would greatly appreciate your valuable feedback and suggestions. *Please take a moment to check out the attached images of the prototype. Your valuable feedback will help refine the product and make it even better. Additionally, I would like to know what price range you would consider reasonable for a pet ID tag like this.*",
    "light_cleaned_comments": ""
}