{
    "id": "155xfv8",
    "title": "The incident in Manipur is horrendous and the perpetrators will face the full wrath of law. Unfortunately, there is a clear pattern among the so called liberals. The outrage is limited to the North East, while they will simply ignore equally brutal crimes elsewhere",
    "url": "https://i.redd.it/uonhzbuhcddb1.jpg",
    "selftext": "Tweet by Hemanta Biswa Sharma\n-CM of Assam\n\nSource:https://twitter.com/himantabiswa/status/1682424438627913728?s=20",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689967320.0,
    "convurl": "https://i.redd.it/uonhzbuhcddb1.jpg",
    "comments": [
        "Whaboutism at its BJP best",
        "Blind eye to the rest at its best",
        "Yeah because it's not comparable. This is the official BJP narrative you're peddling and it's pathetic and shameful.",
        "I was watching Money Heist season 3 today. In one of its episode the professor and his team gets inside a safe in the gold vault, in that safe contained all the secrets of the government. \n\nSo to counter that leverage, the government started publishing fake news through news channels so that the public won't be able to know what were the real secrets. And the professors team lost their leverage.",
        "https://preview.redd.it/sicrml9u7edb1.jpeg?width=1080&format=pjpg&auto=webp&s=8a942af545a3707d2d2015e6fd7d245896247230\n\nLook loool they're posting the fake news.",
        "https://preview.redd.it/wnlp4euk8edb1.jpeg?width=1080&format=pjpg&auto=webp&s=656fad3377fc44444184477cfbe0a6ed2b94d5bb",
        "Himanta competing for the next pm position. Niceee",
        "Classic whataboutism. The only retort by BJP to an issue in a state governed by the BJP is \"look at other states, we're equally just as bad so pick on them first\". Fucking idiots. If that's your only retort then who the fuck is going to govern your double engine state? People didn't elect you to come up with really \"smart\" comebacks. Do your fucking job",
        "Now that Biren has become a candidate. Himanta has to fight harder",
        "1 genocide to go in Assam, please.",
        "Bharat Jalao IS their job! Their voters also vote for them to do exactly that.",
        "Do you really think these morons are capable of that much planning...to me they are bunch of illiterate buffoons.",
        "Paise deke kuch bhi ho jata hai"
    ],
    "cleaned_text": "incident manipur horrendous perpetrators face full wrath law unfortunately clear pattern among called liberals outrage limited north east simply ignore equally brutal crimes elsewhere tweet hemanta biswa sharma cm assam sourcehttpstwittercomhimantabiswastatuss ",
    "cleaned_title": "incident manipur horrendous perpetrators face full wrath law unfortunately clear pattern among called liberals outrage limited north east simply ignore equally brutal crimes elsewhere",
    "cleaned_selftext": "tweet hemanta biswa sharma cm assam sourcehttpstwittercomhimantabiswastatuss",
    "cleaned_comments": "whaboutism bjp best blind eye rest best yeah comparable official bjp narrative youre peddling pathetic shameful watching money heist season today one episode professor team gets inside safe gold vault safe contained secrets government counter leverage government started publishing fake news news channels public wont able know real secrets professors team lost leverage look loool theyre posting fake news himanta competing next pm position niceee classic whataboutism retort bjp issue state governed bjp look states equally bad pick first fucking idiots thats retort fuck going govern double engine state people didnt elect come really smart comebacks fucking job biren become candidate himanta fight harder genocide go assam please bharat jalao job voters also vote exactly really think morons capable much planningto bunch illiterate buffoons paise deke kuch bhi ho jata hai",
    "light_cleaned_title": "The incident in Manipur is horrendous and the perpetrators will face the full wrath of law. Unfortunately, there is a clear pattern among the so called liberals. The outrage is limited to the North East, while they will simply ignore equally brutal crimes elsewhere",
    "light_cleaned_selftext": "Tweet by Hemanta Biswa Sharma -CM of Assam Source:https://twitter.com/himantabiswa/status/1682424438627913728?s=20",
    "light_cleaned_comments": "Whaboutism at its BJP best Blind eye to the rest at its best Yeah because it's not comparable. This is the official BJP narrative you're peddling and it's pathetic and shameful. I was watching Money Heist season 3 today. In one of its episode the professor and his team gets inside a safe in the gold vault, in that safe contained all the secrets of the government. So to counter that leverage, the government started publishing fake news through news channels so that the public won't be able to know what were the real secrets. And the professors team lost their leverage. Look loool they're posting the fake news. Himanta competing for the next pm position. Niceee Classic whataboutism. The only retort by BJP to an issue in a state governed by the BJP is \"look at other states, we're equally just as bad so pick on them first\". Fucking idiots. If that's your only retort then who the fuck is going to govern your double engine state? People didn't elect you to come up with really \"smart\" comebacks. Do your fucking job Now that Biren has become a candidate. Himanta has to fight harder 1 genocide to go in Assam, please. Bharat Jalao IS their job! Their voters also vote for them to do exactly that. Do you really think these morons are capable of that much planning...to me they are bunch of illiterate buffoons. Paise deke kuch bhi ho jata hai"
}