{
    "id": "1b4envv",
    "title": "Careful while taking pics with mascots in malls",
    "url": "https://i.redd.it/2c22o9ckeulc1.jpeg",
    "selftext": "We went to RCity mall(Ghatkopar, Mumbai) yesterday and there were two beautiful mascots. One of my teenage contact went and posed besides them for photograph. \n\nTo my notice, there was a guy in the hidden sight, was taking photograph of all people posing with these mascots. When i went there and asked him to delete photo, to my surpise, his galery was full of such pictures!\n\nThere are in creasing cases of taking photograps of people without their knowledge. \n\nThere will be some peoope still want to challenge saying all these is correct!! There will be definitely some who will make fun of the post. My post is for some people who dont like being photographed by unknowns!\n\nBeware!!!\n",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1709351146.0,
    "convurl": "https://i.redd.it/2c22o9ckeulc1.jpeg",
    "comments": [
        "Even if you feel uncomfortable or are not okay with being photographed there is nothing legally you can do as photography in public is legal. So all you can pretty much do is ask them and hope they delete it else no chance.",
        "Yes, i did that."
    ],
    "cleaned_text": "careful taking pics mascots malls went rcity mallghatkopar mumbai yesterday two beautiful mascots one teenage contact went posed besides photograph notice guy hidden sight taking photograph people posing mascots went asked delete photo surpise galery full pictures creasing cases taking photograps people without knowledge peoope still want challenge saying correct definitely make fun post post people dont like photographed unknowns beware ",
    "cleaned_title": "careful taking pics mascots malls",
    "cleaned_selftext": "went rcity mallghatkopar mumbai yesterday two beautiful mascots one teenage contact went posed besides photograph notice guy hidden sight taking photograph people posing mascots went asked delete photo surpise galery full pictures creasing cases taking photograps people without knowledge peoope still want challenge saying correct definitely make fun post post people dont like photographed unknowns beware",
    "cleaned_comments": "even feel uncomfortable okay photographed nothing legally photography public legal pretty much ask hope delete else chance yes",
    "light_cleaned_title": "Careful while taking pics with mascots in malls",
    "light_cleaned_selftext": "We went to RCity mall(Ghatkopar, Mumbai) yesterday and there were two beautiful mascots. One of my teenage contact went and posed besides them for photograph. To my notice, there was a guy in the hidden sight, was taking photograph of all people posing with these mascots. When i went there and asked him to delete photo, to my surpise, his galery was full of such pictures! There are in creasing cases of taking photograps of people without their knowledge. There will be some peoope still want to challenge saying all these is correct!! There will be definitely some who will make fun of the post. My post is for some people who dont like being photographed by unknowns! Beware!!!",
    "light_cleaned_comments": "Even if you feel uncomfortable or are not okay with being photographed there is nothing legally you can do as photography in public is legal. So all you can pretty much do is ask them and hope they delete it else no chance. Yes, i did that."
}