{
    "id": "1dm8sq1",
    "title": "Crony Capitalists Escaping India",
    "url": "https://www.reddit.com/r/india/comments/1dm8sq1/crony_capitalists_escaping_india/",
    "selftext": "We all know how easy it is to business in India, you have to be friends with people who have power in the government. This is the dictionary definition of 'Crony Capitalism' [https://www.merriam-webster.com/dictionary/crony%20capitalism](https://www.merriam-webster.com/dictionary/crony%20capitalism)\n\nIn India, the crony capitalists often outright steal from the government. So, they take advantage of their connections, exploit loopholes and steal tax money for themselves and their friends. some examples here,\n\nravish kumar's video on awas yojana  [https://www.youtube.com/watch?v=5E1ir1S63y0](https://www.youtube.com/watch?v=5E1ir1S63y0)\n\nayushman bharat scam: [https://www.livemint.com/politics/news/ayushman-bharat-scheme-cag-report-exposes-dummy-numbers-aadhar-irregularities-11691998961683.html](https://www.livemint.com/politics/news/ayushman-bharat-scheme-cag-report-exposes-dummy-numbers-aadhar-irregularities-11691998961683.html)\n\nNow, I don't have any proof (but some articles which suggest it) for this, these people often \n\n1. leave the country and build comfortable lives abroad. \n\n2. go for vacations and trips abroad in the summers when it's too warm.\n\nSo, it's the common tax payer's money funding their luxury escapes. Why is it such a bad thing? A single  family vacation to switzerland can pay enough to build multiple Sulabh Shauchalaya toilets [https://www.tenderdetail.com/Indian-Tenders/TenderNotice/41795714/d4447db6498e83e9de5b1300527a7051](https://www.tenderdetail.com/Indian-Tenders/TenderNotice/41795714/d4447db6498e83e9de5b1300527a7051)\n\n[https://www.business-standard.com/finance/personal-finance/millionaires-on-the-move-where-are-the-world-s-rich-migrating-to-in-2024-124062100122\\_1.html](https://www.business-standard.com/finance/personal-finance/millionaires-on-the-move-where-are-the-world-s-rich-migrating-to-in-2024-124062100122_1.html)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1719099582.0,
    "convurl": "https://external-preview.redd.it/cz93mEeXi0Smr51S4qXqy2DP4Y-XyAS2pqidVIzvvNs.jpg?auto=webp&s=4987a303be0a0132d9502b548b2a9dd35b49295e",
    "comments": [],
    "cleaned_text": "crony capitalists escaping india know easy business india friends people power government dictionary definition crony capitalism httpswwwmerriamwebstercomdictionarycronycapitalismhttpswwwmerriamwebstercomdictionarycronycapitalism india crony capitalists often outright steal government take advantage connections exploit loopholes steal tax money friends examples ravish kumars video awas yojana httpswwwyoutubecomwatchveirsyhttpswwwyoutubecomwatchveirsy ayushman bharat scam httpswwwlivemintcompoliticsnewsayushmanbharatschemecagreportexposesdummynumbersaadharirregularitieshtmlhttpswwwlivemintcompoliticsnewsayushmanbharatschemecagreportexposesdummynumbersaadharirregularitieshtml dont proof articles suggest people often leave country build comfortable lives abroad go vacations trips abroad summers warm common tax payers money funding luxury escapes bad thing single family vacation switzerland pay enough build multiple sulabh shauchalaya toilets httpswwwtenderdetailcomindiantenderstendernoticeddbeedebahttpswwwtenderdetailcomindiantenderstendernoticeddbeedeba httpswwwbusinessstandardcomfinancepersonalfinancemillionairesonthemovewherearetheworldsrichmigratingtoinhtmlhttpswwwbusinessstandardcomfinancepersonalfinancemillionairesonthemovewherearetheworldsrichmigratingtoinhtml ",
    "cleaned_title": "crony capitalists escaping india",
    "cleaned_selftext": "know easy business india friends people power government dictionary definition crony capitalism httpswwwmerriamwebstercomdictionarycronycapitalismhttpswwwmerriamwebstercomdictionarycronycapitalism india crony capitalists often outright steal government take advantage connections exploit loopholes steal tax money friends examples ravish kumars video awas yojana httpswwwyoutubecomwatchveirsyhttpswwwyoutubecomwatchveirsy ayushman bharat scam httpswwwlivemintcompoliticsnewsayushmanbharatschemecagreportexposesdummynumbersaadharirregularitieshtmlhttpswwwlivemintcompoliticsnewsayushmanbharatschemecagreportexposesdummynumbersaadharirregularitieshtml dont proof articles suggest people often leave country build comfortable lives abroad go vacations trips abroad summers warm common tax payers money funding luxury escapes bad thing single family vacation switzerland pay enough build multiple sulabh shauchalaya toilets httpswwwtenderdetailcomindiantenderstendernoticeddbeedebahttpswwwtenderdetailcomindiantenderstendernoticeddbeedeba httpswwwbusinessstandardcomfinancepersonalfinancemillionairesonthemovewherearetheworldsrichmigratingtoinhtmlhttpswwwbusinessstandardcomfinancepersonalfinancemillionairesonthemovewherearetheworldsrichmigratingtoinhtml",
    "cleaned_comments": "",
    "light_cleaned_title": "Crony Capitalists Escaping India",
    "light_cleaned_selftext": "We all know how easy it is to business in India, you have to be friends with people who have power in the government. This is the dictionary definition of 'Crony Capitalism' [https://www.merriam-webster.com/dictionary/crony%20capitalism](https://www.merriam-webster.com/dictionary/crony%20capitalism) In India, the crony capitalists often outright steal from the government. So, they take advantage of their connections, exploit loopholes and steal tax money for themselves and their friends. some examples here, ravish kumar's video on awas yojana [https://www.youtube.com/watch?v=5E1ir1S63y0](https://www.youtube.com/watch?v=5E1ir1S63y0) ayushman bharat scam: [https://www.livemint.com/politics/news/ayushman-bharat-scheme-cag-report-exposes-dummy-numbers-aadhar-irregularities-11691998961683.html](https://www.livemint.com/politics/news/ayushman-bharat-scheme-cag-report-exposes-dummy-numbers-aadhar-irregularities-11691998961683.html) Now, I don't have any proof (but some articles which suggest it) for this, these people often 1. leave the country and build comfortable lives abroad. 2. go for vacations and trips abroad in the summers when it's too warm. So, it's the common tax payer's money funding their luxury escapes. Why is it such a bad thing? A single family vacation to switzerland can pay enough to build multiple Sulabh Shauchalaya toilets [https://www.tenderdetail.com/Indian-Tenders/TenderNotice/41795714/d4447db6498e83e9de5b1300527a7051](https://www.tenderdetail.com/Indian-Tenders/TenderNotice/41795714/d4447db6498e83e9de5b1300527a7051) [https://www.business-standard.com/finance/personal-finance/millionaires-on-the-move-where-are-the-world-s-rich-migrating-to-in-2024-124062100122\\_1.html](https://www.business-standard.com/finance/personal-finance/millionaires-on-the-move-where-are-the-world-s-rich-migrating-to-in-2024-124062100122_1.html)",
    "light_cleaned_comments": ""
}