{
    "id": "160sm6p",
    "title": "Any special educators here? Need a questionnaire filled",
    "url": "https://www.reddit.com/r/india/comments/160sm6p/any_special_educators_here_need_a_questionnaire/",
    "selftext": "Hi guys, my friend is doing research on disability and education and need some responses for her questionnaire regarding it.\n\nIf any of you are special educators for intellectual disability, can you take a few minutes to answer a few questions? The study is qualitative in nature and the questions might be a little descriptive in nature.\n\n I am attaching a google form's link on my post.\n\n[Here's the link](https://docs.google.com/forms/d/e/1FAIpQLSeptx6jMArasQZYUXsb1pW96YAezQ_y4n2pU2OTlkK3Veuhmw/viewform?usp=sf_link)\n\nYour help is greatly appreciated",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692950158,
    "convurl": "https://external-preview.redd.it/8ISKmC-AgwNe-xNpzz4ZA8yI-RdN26yYALC5mWvHvcc.jpg?auto=webp&s=6f19b45910f6af1d4fdbf6ccc2ca46df79112aad",
    "comments": [],
    "cleaned_text": "special educators need questionnaire filled hi guys friend research disability education need responses questionnaire regarding special educators intellectual disability take minutes answer questions study qualitative nature questions might little descriptive nature attaching google forms link post heres linkhttpsdocsgooglecomformsdefaipqlseptxjmarasqzyuxsbpwyaezqynpuotlkkveuhmwviewformuspsflink help greatly appreciated ",
    "cleaned_title": "special educators need questionnaire filled",
    "cleaned_selftext": "hi guys friend research disability education need responses questionnaire regarding special educators intellectual disability take minutes answer questions study qualitative nature questions might little descriptive nature attaching google forms link post heres linkhttpsdocsgooglecomformsdefaipqlseptxjmarasqzyuxsbpwyaezqynpuotlkkveuhmwviewformuspsflink help greatly appreciated",
    "cleaned_comments": "",
    "light_cleaned_title": "Any special educators here? Need a questionnaire filled",
    "light_cleaned_selftext": "Hi guys, my friend is doing research on disability and education and need some responses for her questionnaire regarding it. If any of you are special educators for intellectual disability, can you take a few minutes to answer a few questions? The study is qualitative in nature and the questions might be a little descriptive in nature. I am attaching a google form's link on my post. [Here's the link](https://docs.google.com/forms/d/e/1FAIpQLSeptx6jMArasQZYUXsb1pW96YAezQ_y4n2pU2OTlkK3Veuhmw/viewform?usp=sf_link) Your help is greatly appreciated",
    "light_cleaned_comments": ""
}