{
    "id": "nxve7b",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/nxve7b/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 21,
    "num_comments": 39,
    "created_utc": 1623461413,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watched Raya and the Last Dragon and I'd say it's a pretty good watch. Also binged the ATLA again and Freaks and Geeks, I never knew that many of Hollywood actors were child stars in just one single series.",
        "Read/listened Spin by Robert Charls Wilson as recommended on this thread sometime back. Amazing sci-fi novel. It won a well deserved Hugo award for best novel in 2006.",
        "I binged watched all the episodes of Would I Lie to You.\n\nAlmost all the episodes are available on YouTube.\n\nThe banter between Lee Mack and David is epic.",
        "Watched Tamasha the 420863th time",
        "Started the Cipher audio podcast yesterday. The immersive sounds and voice acting is brilliant. Yet to see more about the story, but the first episode was pretty interesting.",
        "Watched this series a couple of weeks back - Warrior on Hotstar. It’s pretty good. Action sequences are awesome. It’s written by Bruce Lee!!",
        "Watched The Mauritanian on Prime video and Milestone, Dheepan, Bombay Begums, The guns of Navarone and Midnight's Children on Netflix",
        "A bit late, but loved Palm Springs :)",
        "How’s guns of macaroni?",
        "Going to watch The Wailing.",
        "cool cool cool, no doubt no doubt no doubt",
        "Late bloomer but watched Kimetsu no Yaiba. Fucking loved it.",
        "Watched Silicon Valley. One of the best written comedy.",
        "My 4th favorite loop movie after source code, edge of tomorrow and groundhog day",
        "Isnt Lee dead",
        "Watched \n\nWrath Of Man- 7.5-8.5/10\n\nJessica Jones Season 1 : 20/10\n\nCurrently watching Castlevania season 3 : ITS HORRIBLE compared to 1 and 2\n\nLoki episode 1: 8.5/10\n\nMegalo Box Nomad(all the episodes released yet) :10000/10 . I love Megalo Box . I'm gonna watch Ashita No Joe now",
        "Watched Sweet Tooth. Wasn't expecting to like it, but I did.\n\nWatched Infinite (movie) too. If you don't watch it, you would not miss much. The concept could have been done SO much better!",
        "This was written when he was alive. There are a lot of stories he wrote that never got made into movies or TV. His daughter is the one behind getting this show made!!",
        "I see. I will watch it. It has action right?",
        "Yep, pretty hardcore action!!",
        "Any fans of The Expanse here? Just finished S05.",
        "Watching Seinfeld and series with Aziz Ansari second time.",
        "Binge watching republic bharat arnab's debates. One of the best entertaining things",
        "Last two season became a bit boring for me but still very enjoyable",
        "Now watch the movie. The finale is so good",
        "Recommendations for movies about hope. Something like Shawshank or massan",
        "Classic remix:https://www.youtube.com/watch?v=VN5noY1cpIY",
        "Seaspiracy on Netflix. Must watch documentary on repercussions of commercial fishing.",
        "Watched Patriot by steve conrad on prime video and now I just cant stop being sad not because it ended but because I cant find anything that even comes close to this series.\n\nAlso watching an anime called tokyo revengeance. After which Ill probably watch jojo or berserk again.",
        "Its very good. Try Chaser and oldboy after it.",
        "Go watch Children of Men , if you haven't yet.",
        "Yes, Great Sci-fi show.\n\nWas close to firefly.",
        "Watched Mare of Easttown. Damn, that ending.",
        "\"I think you should leave\" on Netflix has weird insane humour. One of the best series I've seen in a while.",
        "Seriously!!! Shell shocked..",
        "Underrated Imtiaz Ali movie.",
        "Secret Life Of Walter Mitty is very uplifting. My go to when I am feeling blue.",
        "Seriously, I know documentaries on factory farming and fishing are hard to watch and preachy as hell, but everyone should know the ethical cost of whatever meat they are consuming.",
        "Dead Poets Society.\n\nGoodwill Hunting",
        "Watch Schitt's Creek on this sub's recommendation. Loved it.\n\nIs there any thing similar - nice &amp; warm comedy? Have already watched Friends, Seinfeld, The Good Place, Silicon Valley, etc.",
        "Seen both. Great movies",
        "Thanks... I'll check it out",
        "Very nice show! Any other recommendations related to it?",
        "sharp objects",
        "Defending Jacob. Not seen it yet, but is highly recommended.",
        "Watched it. Amy Adams was sublime",
        "Downloading it. Ty for suggestion",
        "How I met your mother",
        "You are the worst.",
        "One of the best series on prime.",
        "If you're feeling low, Taste of Cherry (Persian) is a must watch. For the unaware, it's directed by Abbas Kiraostami, world known director.\n\nFor thriller, Forgotten(Korean) is probably the best story you'll ever find in a film, also it's available on Netflix.\n\nIf you're looking for something unique in Hindi, Ankhon Dekhi could be a great start.",
        "Columbus 2017 with John Cho.",
        "Mare of Easttown. Must watch",
        "Try Archer. Love Death Robots(recommended after you're high)",
        "Get high and watch - Love Death &amp; Robots\n\n(Don't forget to thank me)",
        "season 2 was kinda underwhelming, still good though",
        "bingeing Sword Art Online currently, it's good (but not really my taste)\n\nanyone who wants a good and short slice of life anime- watch Silver Spoon",
        "Titli.\n\nalso try 127 hours, maybe",
        "have you tried Third Eye of Nirmal Baba? It's more entertaining imo (but it is in hindi fyi)",
        "the villian is great. His name was Al Dente I think",
        "Watched both. Liked Titli a lot",
        "well then try Udaan , though I expect that you have watched that as well\n\nsorry I do not have good recommendations, I do not watch hope themed movies.",
        "Man that show is something else, i thot i was the only indian watching that",
        "Rewatching it now.",
        "ted lasso is probably the most wholesome comedy series i have ever seen second season is also about to drop next month",
        "[](#s \"They already made it so sad. With Joe and Chief. \")",
        "Its actually 5-screens, so pay accordingly",
        "Lol...looks like you're being misunderstood and downvoted. Will try that series out.\n\nAlso, Kroos control ftw!",
        "Thanks for the suggestion. I had tried it but after Friends &amp; Seinfeld, it didn't feel up to the mark.",
        "Kiarostami's Koker trilogy is simply top tier.",
        "Fritz Lang's Die Nibelungen (1924)\n\nOne of the best epics I've ever seen. An incredible achievement for its time.",
        "Watched Invincible. It's good but nothing amazing. I found the main character as interesting as a bag of rocks.",
        "Watching Pakistani drama kasa e dil",
        "I found the 5th season a little underwhelming, compared to the previous ones. It was still pretty great, but the plot didn't really have the mind boggling elements if the previous season.\n\nAlso is Firefly worth starting, since it's a cancelled show?",
        "All creatures great and small.",
        "&gt;Also is Firefly worth starting, since it's a cancelled show?\n\nDefinitely, there's a reason its cult classic.",
        "Definitely Brooklyn Nine-Nine. Parks and Recreation is super funny and nice but the first 10-15 episodes are quite a drag sadly.",
        "Fucking unwatchable trash.",
        "Derry girls, on Netflix",
        "too few an episodes! Season 1 was better.",
        "Help me remember a tv series I used to watch couple years ago.\nA middle aged man is a lawyer and bussiness partner with south indian bald guy...That man has a son who is lawyer too and trying to make into that company.\nSouth indian guy has daughter who came from america and was friend of that young lawyer....south indian guy allegedly murdered the man. Thats all I remember",
        "30 Rock."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "watched raya last dragon id say pretty good watch also binged atla freaks geeks never knew many hollywood actors child stars one single series readlistened spin robert charls wilson recommended thread sometime back amazing scifi novel well deserved hugo award best novel binged watched episodes would lie almost episodes available youtube banter lee mack david epic watched tamasha th time started cipher audio podcast yesterday immersive sounds voice acting brilliant yet see story first episode pretty interesting watched series couple weeks back warrior hotstar pretty good action sequences awesome written bruce lee watched mauritanian prime video milestone dheepan bombay begums guns navarone midnights children netflix bit late loved palm springs hows guns macaroni going watch wailing cool cool cool doubt doubt doubt late bloomer watched kimetsu yaiba fucking loved watched silicon valley one best written comedy th favorite loop movie source code edge tomorrow groundhog day isnt lee dead watched wrath man jessica jones season currently watching castlevania season horrible compared loki episode megalo box nomadall episodes released yet love megalo box im gon na watch ashita joe watched sweet tooth wasnt expecting like watched infinite movie dont watch would miss much concept could done much better written alive lot stories wrote never got made movies tv daughter one behind getting show made see watch action right yep pretty hardcore action fans expanse finished watching seinfeld series aziz ansari second time binge watching republic bharat arnabs debates one best entertaining things last two season became bit boring still enjoyable watch movie finale good recommendations movies hope something like shawshank massan classic remixhttpswwwyoutubecomwatchvvnnoycpiy seaspiracy netflix must watch documentary repercussions commercial fishing watched patriot steve conrad prime video cant stop sad ended cant find anything even comes close series also watching anime called tokyo revengeance ill probably watch jojo berserk good try chaser oldboy go watch children men havent yet yes great scifi show close firefly watched mare easttown damn ending think leave netflix weird insane humour one best series ive seen seriously shell shocked underrated imtiaz ali movie secret life walter mitty uplifting go feeling blue seriously know documentaries factory farming fishing hard watch preachy hell everyone know ethical cost whatever meat consuming dead poets society goodwill hunting watch schitts creek subs recommendation loved thing similar nice amp warm comedy already watched friends seinfeld good place silicon valley etc seen great movies thanks ill check nice show recommendations related sharp objects defending jacob seen yet highly recommended watched amy adams sublime downloading ty suggestion met mother worst one best series prime youre feeling low taste cherry persian must watch unaware directed abbas kiraostami world known director thriller forgottenkorean probably best story youll ever find film also available netflix youre looking something unique hindi ankhon dekhi could great start columbus john cho mare easttown must watch try archer love death robotsrecommended youre high get high watch love death amp robots dont forget thank season kinda underwhelming still good though bingeing sword art online currently good really taste anyone wants good short slice life anime watch silver spoon titli also try hours maybe tried third eye nirmal baba entertaining imo hindi fyi villian great name al dente think watched liked titli lot well try udaan though expect watched well sorry good recommendations watch hope themed movies man show something else thot indian watching rewatching ted lasso probably wholesome comedy series ever seen second season also drop next month already made sad joe chief actually screens pay accordingly lollooks like youre misunderstood downvoted try series also kroos control ftw thanks suggestion tried friends amp seinfeld didnt feel mark kiarostamis koker trilogy simply top tier fritz langs die nibelungen one best epics ive ever seen incredible achievement time watched invincible good nothing amazing found main character interesting bag rocks watching pakistani drama kasa e dil found th season little underwhelming compared previous ones still pretty great plot didnt really mind boggling elements previous season also firefly worth starting since cancelled show creatures great small gtalso firefly worth starting since cancelled show definitely theres reason cult classic definitely brooklyn ninenine parks recreation super funny nice first episodes quite drag sadly fucking unwatchable trash derry girls netflix episodes season better help remember tv series used watch couple years ago middle aged man lawyer bussiness partner south indian bald guythat man son lawyer trying make company south indian guy daughter came america friend young lawyersouth indian guy allegedly murdered man thats remember rock",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Watched Raya and the Last Dragon and I'd say it's a pretty good watch. Also binged the ATLA again and Freaks and Geeks, I never knew that many of Hollywood actors were child stars in just one single series. Read/listened Spin by Robert Charls Wilson as recommended on this thread sometime back. Amazing sci-fi novel. It won a well deserved Hugo award for best novel in 2006. I binged watched all the episodes of Would I Lie to You. Almost all the episodes are available on YouTube. The banter between Lee Mack and David is epic. Watched Tamasha the 420863th time Started the Cipher audio podcast yesterday. The immersive sounds and voice acting is brilliant. Yet to see more about the story, but the first episode was pretty interesting. Watched this series a couple of weeks back - Warrior on Hotstar. It’s pretty good. Action sequences are awesome. It’s written by Bruce Lee!! Watched The Mauritanian on Prime video and Milestone, Dheepan, Bombay Begums, The guns of Navarone and Midnight's Children on Netflix A bit late, but loved Palm Springs :) How’s guns of macaroni? Going to watch The Wailing. cool cool cool, no doubt no doubt no doubt Late bloomer but watched Kimetsu no Yaiba. Fucking loved it. Watched Silicon Valley. One of the best written comedy. My 4th favorite loop movie after source code, edge of tomorrow and groundhog day Isnt Lee dead Watched Wrath Of Man- 7.5-8.5/10 Jessica Jones Season 1 : 20/10 Currently watching Castlevania season 3 : ITS HORRIBLE compared to 1 and 2 Loki episode 1: 8.5/10 Megalo Box Nomad(all the episodes released yet) :10000/10 . I love Megalo Box . I'm gonna watch Ashita No Joe now Watched Sweet Tooth. Wasn't expecting to like it, but I did. Watched Infinite (movie) too. If you don't watch it, you would not miss much. The concept could have been done SO much better! This was written when he was alive. There are a lot of stories he wrote that never got made into movies or TV. His daughter is the one behind getting this show made!! I see. I will watch it. It has action right? Yep, pretty hardcore action!! Any fans of The Expanse here? Just finished S05. Watching Seinfeld and series with Aziz Ansari second time. Binge watching republic bharat arnab's debates. One of the best entertaining things Last two season became a bit boring for me but still very enjoyable Now watch the movie. The finale is so good Recommendations for movies about hope. Something like Shawshank or massan Classic remix:https://www.youtube.com/watch?v=VN5noY1cpIY Seaspiracy on Netflix. Must watch documentary on repercussions of commercial fishing. Watched Patriot by steve conrad on prime video and now I just cant stop being sad not because it ended but because I cant find anything that even comes close to this series. Also watching an anime called tokyo revengeance. After which Ill probably watch jojo or berserk again. Its very good. Try Chaser and oldboy after it. Go watch Children of Men , if you haven't yet. Yes, Great Sci-fi show. Was close to firefly. Watched Mare of Easttown. Damn, that ending. \"I think you should leave\" on Netflix has weird insane humour. One of the best series I've seen in a while. Seriously!!! Shell shocked.. Underrated Imtiaz Ali movie. Secret Life Of Walter Mitty is very uplifting. My go to when I am feeling blue. Seriously, I know documentaries on factory farming and fishing are hard to watch and preachy as hell, but everyone should know the ethical cost of whatever meat they are consuming. Dead Poets Society. Goodwill Hunting Watch Schitt's Creek on this sub's recommendation. Loved it. Is there any thing similar - nice &amp; warm comedy? Have already watched Friends, Seinfeld, The Good Place, Silicon Valley, etc. Seen both. Great movies Thanks... I'll check it out Very nice show! Any other recommendations related to it? sharp objects Defending Jacob. Not seen it yet, but is highly recommended. Watched it. Amy Adams was sublime Downloading it. Ty for suggestion How I met your mother You are the worst. One of the best series on prime. If you're feeling low, Taste of Cherry (Persian) is a must watch. For the unaware, it's directed by Abbas Kiraostami, world known director. For thriller, Forgotten(Korean) is probably the best story you'll ever find in a film, also it's available on Netflix. If you're looking for something unique in Hindi, Ankhon Dekhi could be a great start. Columbus 2017 with John Cho. Mare of Easttown. Must watch Try Archer. Love Death Robots(recommended after you're high) Get high and watch - Love Death &amp; Robots (Don't forget to thank me) season 2 was kinda underwhelming, still good though bingeing Sword Art Online currently, it's good (but not really my taste) anyone who wants a good and short slice of life anime- watch Silver Spoon Titli. also try 127 hours, maybe have you tried Third Eye of Nirmal Baba? It's more entertaining imo (but it is in hindi fyi) the villian is great. His name was Al Dente I think Watched both. Liked Titli a lot well then try Udaan , though I expect that you have watched that as well sorry I do not have good recommendations, I do not watch hope themed movies. Man that show is something else, i thot i was the only indian watching that Rewatching it now. ted lasso is probably the most wholesome comedy series i have ever seen second season is also about to drop next month [](#s \"They already made it so sad. With Joe and Chief. \") Its actually 5-screens, so pay accordingly Lol...looks like you're being misunderstood and downvoted. Will try that series out. Also, Kroos control ftw! Thanks for the suggestion. I had tried it but after Friends &amp; Seinfeld, it didn't feel up to the mark. Kiarostami's Koker trilogy is simply top tier. Fritz Lang's Die Nibelungen (1924) One of the best epics I've ever seen. An incredible achievement for its time. Watched Invincible. It's good but nothing amazing. I found the main character as interesting as a bag of rocks. Watching Pakistani drama kasa e dil I found the 5th season a little underwhelming, compared to the previous ones. It was still pretty great, but the plot didn't really have the mind boggling elements if the previous season. Also is Firefly worth starting, since it's a cancelled show? All creatures great and small. &gt;Also is Firefly worth starting, since it's a cancelled show? Definitely, there's a reason its cult classic. Definitely Brooklyn Nine-Nine. Parks and Recreation is super funny and nice but the first 10-15 episodes are quite a drag sadly. Fucking unwatchable trash. Derry girls, on Netflix too few an episodes! Season 1 was better. Help me remember a tv series I used to watch couple years ago. A middle aged man is a lawyer and bussiness partner with south indian bald guy...That man has a son who is lawyer too and trying to make into that company. South indian guy has daughter who came from america and was friend of that young lawyer....south indian guy allegedly murdered the man. Thats all I remember 30 Rock."
}