{
    "id": "rwhxfv",
    "title": "How can people be so rude for a service they probably like and are availing for free?",
    "url": "https://www.reddit.com/r/india/comments/rwhxfv/how_can_people_be_so_rude_for_a_service_they/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/9zupilmvvt981.jpg?width=971&amp;format=pjpg&amp;auto=webp&amp;s=4739778152a8a44e5297daf4c9fdf41734928c11\n\nI am an indie developer working on developing a privacy focussed wealth tracker without ads, and without selling any user data.\n\nThe user may/may not like the app, and can rate the app according to their experience, but when has this become a criteria for rating the app? How can they be rude for a service they are availing for free as if they own it? For someone, who does not spend much on marketing, every 1 star takes a dump on the organic reach for the app.\n\nBut more importantly, makes me sad as an indie developer. Reddit is my primary organic user stream, so hopefully the post will reach the person! ",
    "flair": "Rant / Vent",
    "score": 519,
    "num_comments": 102,
    "created_utc": 1641370855,
    "convurl": "https://b.thumbs.redditmedia.com/UHXpjV1pKHU7_sVNh0wADQ0MCtwDLQNaf_-tDxbZsOE.jpg",
    "comments": [
        "Would like to help you out on this app if required",
        "Hey! Thanks a lot! How would you like to contribute? Please feel free to DM me and we can chat!",
        "Indians as a culture are extremely entitled.",
        "If you need contributors, you should think about making it open source. /s",
        "Hey could you provide the link for the application i can't seem to find it on the Play Store.\nMay i also ask how do you acquire the data, what measures do you take to ensure the safety of the acquired data?",
        "Unless it's not compatible with older android version, that would explain its unappearance",
        "I agree, that if I preferred more contributors over other things, i should consider making the project open source. I'm also okay with people suggesting this to me which they do.\n\nBut, I'm more venting about the tone and entitlement here, and when people don't care how much effort goes into building a product.",
        "Yes. I think it's only supported for Android 7 and above. But here's the link: https://play.google.com/store/apps/details?id=com.rekisha.geld&amp;hl=en_US&amp;gl=IN",
        "apps ui is nice",
        "man do a browser",
        "Hey OP. You are doing great work with the app. Have been using it for around 6 months now and it has really helped me manage my finances. \n\nI was halfway on building something similar on Excel but this saved me loads of time. \n\nDo you work on it full time or do you have other full time emplyment as well?",
        "Thanks! Hoping to start web by the end of this year. :)",
        "Aaah understand your paid op. A friend of mine spends lakhs on new phone every year but won't pay for a 200 Rs one time app.\n\nFuck greedy shit heads like these. And the audacity of that commentator telling you not to be greedy!",
        "Simple answer: 1.4 billion dicks and not rising.",
        "If you're good at something, never do it for free.",
        "Hey! Great to hear that! Do reach out to me if you face any issues with the app.\n\nI have another full time employment, but i hope someday this will be it. :)",
        "Please pardon the off topic question - which APIs are you using?",
        "I use Yahoo Finance extensively, other free APIs, and sometime have to resort to scraping too. It's dirty work at times. :(",
        "Looks nice, will probably use it once i start investing",
        "Thanks! Do reach out to me if you have any issues!",
        "Irrelevant to the post but how are you making money through this app if there are no ads and you said you're not selling users data also?",
        "The app doesn't make much right now. I rely on user donations mostly, and slowly I'm adding some premium features that the average user does not need, but people can pay for them.",
        "I never thought about this angle. I do not plan to open source the project as long as I'm actively working on it.",
        "Not using your app, but just wanted to say tum lage raho yaar, ignore the haters, make it the best app around! 👍",
        "Thank you. Trying my best to! :)",
        "Is there a way that the developer can context these shitty reviews?",
        "I do not know of one.",
        "If you put a paywall without adding your  own features  who is going to buy it ? Given the upstream is available freely ? \nIt is  pertinent to go with the open source license you are comfortable with. If you want no holds barred access to public  then go with a permissive licence like BSD. If you want  to  get the changes from your forks back to upstream than a copyleft license ensures that. And If someone violates the terms of the licence than one can approach SFLC (link -&gt; https://sflc.in/about-us). They will fight for your case.\nYou can  follow their founder  on twitter - Mishi Choudhary (link :-  https://twitter.com/MishiChoudhary?s=20 )",
        "There are some people (including me),  who sees closed source apps with sus. And given it's a financial app,  sus only increases.\n But it is \nVery wrong to demand someone to open-source their apps.\nThe decision to open source a project should be entirely on the owner of the project.",
        "I whole heartedly agree with your sentiments, and I myself started this project because I could not find a privacy focused alternative.\n\nAlso, I do not mind people asking me to open source my work because I understand their perspective too.",
        "&gt;There are some people (including me), who sees closed source apps with sus. And given its a financial app, and sus only increases.\n\nDo you expect Bank Apps to be open source?",
        "They think its a simple work to develop apps man, just ignore it. Though 1 star will definitely hurt your reach in playstore",
        "You can only reply I guess, otherwise shady apps can abuse the system",
        "\"No good deed ever goes unpunished\". I have seen this especially in terms of software. Ignore these people and keep doing good - release on iOS if not done already.",
        "Could help you with the scraping part, I am a third year college student though. (If you need any help with it, that is)",
        "&gt;Do you expect Bank Apps to be open source?\n\nYes, if possible. There's the Open banking API project : working towards that end : \n https://www.openbankproject.com/openbankingmiddleware/\n\nI know not many  banks would want to implement such third party  projects.\nBut main sus raises from closed source indie projects",
        "I couldn't go through the link completely. But reimplementing banks existing IT system to work with this would be a major undertaking. I doubt they would be really ready to do so unless there is some business requirements which demands it.",
        "You're doing great work. Love your app. Keep at it.",
        "Hey u/cynical_bibliophile, great app!\n\nAbsolutely love it and use it regularly. Will definitely support once I start earning. Kudos!",
        "AFAIK, they fight pro bono for small indie projects",
        "I plan to release web first hopefully starting end of this year. iOS development is a little costly, so want to set up a revenue stream and mature the android version before diving in.",
        "Yeah, every 1 star lowers the organic reach and if it goes below 4.5, it does not show up on the chip filter.",
        "That will be great. Will DM you. Thanks!",
        "Thank you! :)",
        "Thank you! It means a lot!",
        "They can be, but even closed source bank systems are audited and certified by third parties. Ex: PCI DSS compliance etc. which is the next best thing.",
        "Are we talking  GPL  violation or something else ? If GPL violation than it can be  easily resorted. You won't  have to go to court. They would be rejected by the community itself.",
        "Yes i don't think most banks would do it either if they don't see any benefit. Large corps either open source for image makeover and  for sake of the community but not everyone is onboard with that idea.",
        "Don’t be disheartened, we need more people like you to spearhead good software and good ideologies.",
        "Wow, that was a very smart ad. You got a download from me.",
        "I hope it would be worth your while. \n\nBut to be honest, i wanted the post to reach the person, and hopefully he'd reconsider the rating since every 1 star affects my store rating drastically. Although, few people here have been really generous to rate the app on the store to help.",
        "Bhai tu link de de. I'll give your app 5 stars from all of my family's accounts.",
        "DMed. Thanks!",
        "Don't take this to heart. As a PM, I can surely assure you, you'll get more such people in future. Chill out.",
        "Hey what is the app?",
        "It's called Artos. \nhttps://play.google.com/store/apps/details?id=com.rekisha.geld&amp;hl=en_US&amp;gl=IN",
        "Gave 5 stars xD",
        "Reported the two recent 1 stars for being spam.",
        "Thank you so much!",
        "I think in the heat of the moment, I was disheartened.",
        "I have been trying to understand this but haven't been able to. Do you know how to get access to these APIs?",
        "You look into GitHub organization and private repos. I used it once, at that time I saw you can fine tune who you invite inthe organization and how much access he has on each repo.",
        "I don't know much about Open Source licenses, but if and when you do decide to open source your app, go for a GPL license - it mandates that if someone uses your code and adds something to it, they have to make it available in the public domain.",
        "Thank you for your kind words! Means a lot!",
        "Never knew there is something called Investment Tracker to track all the the investments etc. 😁\nThanks, I'll give it a try and definitely leave a good review.",
        "Thanks! Feel free to reach out to me if you face any issues or have a feature request!",
        "Sure! Thank you.",
        "Tbh, how is someone supposed to believe that you are not collecting any data",
        "Same for patients at government hospital",
        "As a user of your app, and as a developer, I can appreciate all the hard work that goes into this. Giving a 1 star rating on grounds of not making it open source is ridiculous, but what can you do? To open source or not, is entirely your call.\n\n\"Greedy\" is uncalled for. You just work on donations, right? I'd encourage all users to donate, this app does what many paid apps don't do as well.",
        "Others can't verify if your app does exactly what it claims if it isn't open-sourced.\n\nThat being said, he way of putting it was most certainly wrong.",
        "Yes. I'm not saying what he intended to convey was wrong, but the way to put it across was.\n\nBy the way, i think folks can do some network monitoring to validate some of the claims.",
        "Yes. My plan is to not open source as long as I'm actively working on it. If I plan to give it up, I'd happily open source it to keep the product alive and just help in regular release.\n\nThe app currently does work on donations, but I'm also adding premium features for the advanced users to establish long term monetory feasibility.",
        "You can use traffic monitors to validate what end points the app call and what data is sent out of the app. I think that would validate some of the claims.",
        "Black box is gonna a black box and even network monitoring can never give the full picture.\n\nIf you don't plan on making money form the app, please consider making it open-source and publishing it on F-Droid under GPL-3 license (IIRC, it forces its forks to be open-source as well). \n\nFOSS community has helped a lot of under-privileged people, like me, to grow eg- VLC, Blender, Krita etc. and needs talented people like you.",
        "I can help you with UI/UX given that i will receive credits. But beyond that, if you wanted help with developing a revenue model etc. then i would want to be compensated for the work and share in revenue.",
        "Hey! I am completely fine with giving you credits for your work.\n\nWe currently don't make enough revenue, so my current goal is to make the product monetary feasible and invest in the product, but if you plan to stay with the product long term, we can look onto revenue sharing. Feel free to DM me!",
        "Wait! I can monitor what data is sent out? Aren't these calls encrypted?  If not, then that is a serious issue irrespective of the content that is  being transferred.",
        "I just installed your app a while ago. Love it, though yet to migrate everything to it. Yes, I found some bugs but you are doing it free and as a developer I know how hard that is and I appreciate it. \n\nI support open source too, but it's your app and it's up to you if you want to make it open source or not. No one should demand like this. \n\nSo for every rude person like this, please know that there are people downloading and appreciating.",
        "I think there are licenses to prevent that, but yeah, people may not respect it",
        "Thank you for trying it out. Do reach out to me via DM or on email, and let me know, if possible, what bugs you're facing and I can look into them. \n\nLots of new features and improvements coming this year! :)",
        "Happy to hear the future monetization plan. Could you add this plan somewhere on app site?. When I installed, I was bit worried what was the plan and whether you might in future resort to selling data, but then I decided to trust merely because you seemed genuine here. I wondered how someone could build all this ( all those imports from shitty government excels, you are a saint! ) and not charge money. Having a statement of who you are, why you do this and what are the monetization plans would help reassure potential users.",
        "&gt; I don't know much about Open Source licenses, \n\nSo why are you advising people about which licence to use?",
        "How do you even compare the two? Patients are paying tax (income tax, gst, etc) which goes toward funding public institutions such as government offices and hospitals.",
        "I will work on a web landing page soon, and incorporate this suggestion there. Thank you for putting this out here.",
        "You can intercept api calls from an app before they are encrypted.",
        "If you are going to open source it, use a license like GPL so they must also open source their work",
        "Most patients who come to government hospitals don’t pay income tax",
        "I will keep this in mind, thank you!",
        "There are other kinds of tax too. If you purchase anything, you're paying gst.\n\n&gt; Most patients who come to government hospitals don’t pay income tax\n\nDo you have a source for this claim?",
        "This is the deal with an offer that’s open to the world. The laws of statistics require that you will have some jerks to deal with. Hopefully this one has done his worst and will leave you in peace. I trust you will find more reasonable users as well.",
        "Great stuff, what did you make it with? I mean the techstack.",
        "It's native Java. Mostly client side, with some firebase components.",
        "man i want to use it, but playstore doesnt let me install it on my google pixel 4a in germany. you got an idea?\n\nInstall button is there, but white-greenish and cant click it",
        "Nice nice, I am currently doing ReactJS but want to do mobile development, Do you think React Native is a good idea?",
        "Hey! Personally I'm a bit biased towards native development, so I'm not the right person to ask. \n\nBut, I've heard good things about React. You could also check out Flutter.",
        "Could you check your Android version?",
        "Android 12",
        "That seems weird. The app is marked as available in Germany. Is there a specific error that you get? Can you share a screenshot?",
        "Mmmh didn't work from desktop browser.\nBut works on phone itself :) \n\nThe app looks really good!!!\nBut it's looks focused on to the Indian market... Any chance to change currency? And have more indices?",
        "We are already working on allowing multi currency. Will be available in beta this week, and on the stable version early next month. \n\nWe'll add more indices and markets this year starting with the US in a couple of months. What indices are you interested in?",
        "No particular indexes. Thank you"
    ],
    "cleaned_text": "people rude service probably like availing free ampxb indie developer working developing privacy focussed wealth tracker without ads without selling user data user maymay like app rate app according experience become criteria rating app rude service availing free someone spend much marketing every star takes dump organic reach app importantly makes sad indie developer reddit primary organic user stream hopefully post reach person ",
    "cleaned_title": "people rude service probably like availing free",
    "cleaned_selftext": "ampxb indie developer working developing privacy focussed wealth tracker without ads without selling user data user maymay like app rate app according experience become criteria rating app rude service availing free someone spend much marketing every star takes dump organic reach app importantly makes sad indie developer reddit primary organic user stream hopefully post reach person",
    "cleaned_comments": "would like help app required hey thanks lot would like contribute please feel free dm chat indians culture extremely entitled need contributors think making open source hey could provide link application cant seem find play store may also ask acquire data measures take ensure safety acquired data unless compatible older android version would explain unappearance agree preferred contributors things consider making project open source im also okay people suggesting im venting tone entitlement people dont care much effort goes building product yes think supported android heres link apps ui nice man browser hey op great work app using around months really helped manage finances halfway building something similar excel saved loads time work full time full time emplyment well thanks hoping start web end year aaah understand paid op friend mine spends lakhs new phone every year wont pay rs one time app fuck greedy shit heads like audacity commentator telling greedy simple answer billion dicks rising youre good something never free hey great hear reach face issues app another full time employment hope someday please pardon topic question apis using use yahoo finance extensively free apis sometime resort scraping dirty work times looks nice probably use start investing thanks reach issues irrelevant post making money app ads said youre selling users data also app doesnt make much right rely user donations mostly slowly im adding premium features average user need people pay never thought angle plan open source project long im actively working using app wanted say tum lage raho yaar ignore haters make best app around thank trying best way developer context shitty reviews know one put paywall without adding features going buy given upstream available freely pertinent go open source license comfortable want holds barred access public go permissive licence like bsd want get changes forks back upstream copyleft license ensures someone violates terms licence one approach sflc link gt fight case follow founder twitter mishi choudhary link people including sees closed source apps sus given financial app sus increases wrong demand someone opensource apps decision open source project entirely owner project whole heartedly agree sentiments started project could find privacy focused alternative also mind people asking open source work understand perspective gtthere people including sees closed source apps sus given financial app sus increases expect bank apps open source think simple work develop apps man ignore though star definitely hurt reach playstore reply guess otherwise shady apps abuse system good deed ever goes unpunished seen especially terms software ignore people keep good release ios done already could help scraping part third year college student though need help gtdo expect bank apps open source yes possible theres open banking api project working towards end know many banks would want implement third party projects main sus raises closed source indie projects couldnt go link completely reimplementing banks existing system work would major undertaking doubt would really ready unless business requirements demands youre great work love app keep hey ucynicalbibliophile great app absolutely love use regularly definitely support start earning kudos afaik fight pro bono small indie projects plan release web first hopefully starting end year ios development little costly want set revenue stream mature android version diving yeah every star lowers organic reach goes show chip filter great dm thanks thank thank means lot even closed source bank systems audited certified third parties ex pci dss compliance etc next best thing talking gpl violation something else gpl violation easily resorted wont go court would rejected community yes dont think banks would either dont see benefit large corps either open source image makeover sake community everyone onboard idea dont disheartened need people like spearhead good software good ideologies wow smart ad got download hope would worth honest wanted post reach person hopefully hed reconsider rating since every star affects store rating drastically although people really generous rate app store help bhai tu link de de ill give app stars familys accounts dmed thanks dont take heart pm surely assure youll get people future chill hey app called artos gave stars xd reported two recent stars spam thank much think heat moment disheartened trying understand havent able know get access apis look github organization private repos used time saw fine tune invite inthe organization much access repo dont know much open source licenses decide open source app go gpl license mandates someone uses code adds something make available public domain thank kind words means lot never knew something called investment tracker track investments etc thanks ill give try definitely leave good review thanks feel free reach face issues feature request sure thank tbh someone supposed believe collecting data patients government hospital user app developer appreciate hard work goes giving star rating grounds making open source ridiculous open source entirely call greedy uncalled work donations right id encourage users donate app many paid apps dont well others cant verify app exactly claims isnt opensourced said way putting certainly wrong yes im saying intended convey wrong way put across way think folks network monitoring validate claims yes plan open source long im actively working plan give id happily open source keep product alive help regular release app currently work donations im also adding premium features advanced users establish long term monetory feasibility use traffic monitors validate end points app call data sent app think would validate claims black box gon na black box even network monitoring never give full picture dont plan making money form app please consider making opensource publishing fdroid gpl license iirc forces forks opensource well foss community helped lot underprivileged people like grow eg vlc blender krita etc needs talented people like help uiux given receive credits beyond wanted help developing revenue model etc would want compensated work share revenue hey completely fine giving credits work currently dont make enough revenue current goal make product monetary feasible invest product plan stay product long term look onto revenue sharing feel free dm wait monitor data sent arent calls encrypted serious issue irrespective content transferred installed app ago love though yet migrate everything yes found bugs free developer know hard appreciate support open source app want make open source one demand like every rude person like please know people downloading appreciating think licenses prevent yeah people may respect thank trying reach via dm email let know possible bugs youre facing look lots new features improvements coming year happy hear future monetization plan could add plan somewhere app site installed bit worried plan whether might future resort selling data decided trust merely seemed genuine wondered someone could build imports shitty government excels saint charge money statement monetization plans would help reassure potential users gt dont know much open source licenses advising people licence use even compare two patients paying tax income tax gst etc goes toward funding public institutions government offices hospitals work web landing page soon incorporate suggestion thank putting intercept api calls app encrypted going open source use license like gpl must also open source work patients come government hospitals dont pay income tax keep mind thank kinds tax purchase anything youre paying gst gt patients come government hospitals dont pay income tax source claim deal offer thats open world laws statistics require jerks deal hopefully one done worst leave peace trust find reasonable users well great stuff make mean techstack native java mostly client side firebase components man want use playstore doesnt let install google pixel germany got idea install button whitegreenish cant click nice nice currently reactjs want mobile development think react native good idea hey personally im bit biased towards native development im right person ask ive heard good things react could also check flutter could check android version android seems weird app marked available germany specific error get share screenshot mmmh didnt work desktop browser works phone app looks really good looks focused indian market chance change currency indices already working allowing multi currency available beta week stable version early next month well add indices markets year starting us couple months indices interested particular indexes thank",
    "light_cleaned_title": "How can people be so rude for a service they probably like and are availing for free?",
    "light_cleaned_selftext": "I am an indie developer working on developing a privacy focussed wealth tracker without ads, and without selling any user data. The user may/may not like the app, and can rate the app according to their experience, but when has this become a criteria for rating the app? How can they be rude for a service they are availing for free as if they own it? For someone, who does not spend much on marketing, every 1 star takes a dump on the organic reach for the app. But more importantly, makes me sad as an indie developer. Reddit is my primary organic user stream, so hopefully the post will reach the person!",
    "light_cleaned_comments": "Would like to help you out on this app if required Hey! Thanks a lot! How would you like to contribute? Please feel free to DM me and we can chat! Indians as a culture are extremely entitled. If you need contributors, you should think about making it open source. /s Hey could you provide the link for the application i can't seem to find it on the Play Store. May i also ask how do you acquire the data, what measures do you take to ensure the safety of the acquired data? Unless it's not compatible with older android version, that would explain its unappearance I agree, that if I preferred more contributors over other things, i should consider making the project open source. I'm also okay with people suggesting this to me which they do. But, I'm more venting about the tone and entitlement here, and when people don't care how much effort goes into building a product. Yes. I think it's only supported for Android 7 and above. But here's the link: apps ui is nice man do a browser Hey OP. You are doing great work with the app. Have been using it for around 6 months now and it has really helped me manage my finances. I was halfway on building something similar on Excel but this saved me loads of time. Do you work on it full time or do you have other full time emplyment as well? Thanks! Hoping to start web by the end of this year. :) Aaah understand your paid op. A friend of mine spends lakhs on new phone every year but won't pay for a 200 Rs one time app. Fuck greedy shit heads like these. And the audacity of that commentator telling you not to be greedy! Simple answer: 1.4 billion dicks and not rising. If you're good at something, never do it for free. Hey! Great to hear that! Do reach out to me if you face any issues with the app. I have another full time employment, but i hope someday this will be it. :) Please pardon the off topic question - which APIs are you using? I use Yahoo Finance extensively, other free APIs, and sometime have to resort to scraping too. It's dirty work at times. :( Looks nice, will probably use it once i start investing Thanks! Do reach out to me if you have any issues! Irrelevant to the post but how are you making money through this app if there are no ads and you said you're not selling users data also? The app doesn't make much right now. I rely on user donations mostly, and slowly I'm adding some premium features that the average user does not need, but people can pay for them. I never thought about this angle. I do not plan to open source the project as long as I'm actively working on it. Not using your app, but just wanted to say tum lage raho yaar, ignore the haters, make it the best app around! 👍 Thank you. Trying my best to! :) Is there a way that the developer can context these shitty reviews? I do not know of one. If you put a paywall without adding your own features who is going to buy it ? Given the upstream is available freely ? It is pertinent to go with the open source license you are comfortable with. If you want no holds barred access to public then go with a permissive licence like BSD. If you want to get the changes from your forks back to upstream than a copyleft license ensures that. And If someone violates the terms of the licence than one can approach SFLC (link -&gt; They will fight for your case. You can follow their founder on twitter - Mishi Choudhary (link :- ) There are some people (including me), who sees closed source apps with sus. And given it's a financial app, sus only increases. But it is Very wrong to demand someone to open-source their apps. The decision to open source a project should be entirely on the owner of the project. I whole heartedly agree with your sentiments, and I myself started this project because I could not find a privacy focused alternative. Also, I do not mind people asking me to open source my work because I understand their perspective too. &gt;There are some people (including me), who sees closed source apps with sus. And given its a financial app, and sus only increases. Do you expect Bank Apps to be open source? They think its a simple work to develop apps man, just ignore it. Though 1 star will definitely hurt your reach in playstore You can only reply I guess, otherwise shady apps can abuse the system \"No good deed ever goes unpunished\". I have seen this especially in terms of software. Ignore these people and keep doing good - release on iOS if not done already. Could help you with the scraping part, I am a third year college student though. (If you need any help with it, that is) &gt;Do you expect Bank Apps to be open source? Yes, if possible. There's the Open banking API project : working towards that end : I know not many banks would want to implement such third party projects. But main sus raises from closed source indie projects I couldn't go through the link completely. But reimplementing banks existing IT system to work with this would be a major undertaking. I doubt they would be really ready to do so unless there is some business requirements which demands it. You're doing great work. Love your app. Keep at it. Hey u/cynical_bibliophile, great app! Absolutely love it and use it regularly. Will definitely support once I start earning. Kudos! AFAIK, they fight pro bono for small indie projects I plan to release web first hopefully starting end of this year. iOS development is a little costly, so want to set up a revenue stream and mature the android version before diving in. Yeah, every 1 star lowers the organic reach and if it goes below 4.5, it does not show up on the chip filter. That will be great. Will DM you. Thanks! Thank you! :) Thank you! It means a lot! They can be, but even closed source bank systems are audited and certified by third parties. Ex: PCI DSS compliance etc. which is the next best thing. Are we talking GPL violation or something else ? If GPL violation than it can be easily resorted. You won't have to go to court. They would be rejected by the community itself. Yes i don't think most banks would do it either if they don't see any benefit. Large corps either open source for image makeover and for sake of the community but not everyone is onboard with that idea. Don’t be disheartened, we need more people like you to spearhead good software and good ideologies. Wow, that was a very smart ad. You got a download from me. I hope it would be worth your while. But to be honest, i wanted the post to reach the person, and hopefully he'd reconsider the rating since every 1 star affects my store rating drastically. Although, few people here have been really generous to rate the app on the store to help. Bhai tu link de de. I'll give your app 5 stars from all of my family's accounts. DMed. Thanks! Don't take this to heart. As a PM, I can surely assure you, you'll get more such people in future. Chill out. Hey what is the app? It's called Artos. Gave 5 stars xD Reported the two recent 1 stars for being spam. Thank you so much! I think in the heat of the moment, I was disheartened. I have been trying to understand this but haven't been able to. Do you know how to get access to these APIs? You look into GitHub organization and private repos. I used it once, at that time I saw you can fine tune who you invite inthe organization and how much access he has on each repo. I don't know much about Open Source licenses, but if and when you do decide to open source your app, go for a GPL license - it mandates that if someone uses your code and adds something to it, they have to make it available in the public domain. Thank you for your kind words! Means a lot! Never knew there is something called Investment Tracker to track all the the investments etc. 😁 Thanks, I'll give it a try and definitely leave a good review. Thanks! Feel free to reach out to me if you face any issues or have a feature request! Sure! Thank you. Tbh, how is someone supposed to believe that you are not collecting any data Same for patients at government hospital As a user of your app, and as a developer, I can appreciate all the hard work that goes into this. Giving a 1 star rating on grounds of not making it open source is ridiculous, but what can you do? To open source or not, is entirely your call. \"Greedy\" is uncalled for. You just work on donations, right? I'd encourage all users to donate, this app does what many paid apps don't do as well. Others can't verify if your app does exactly what it claims if it isn't open-sourced. That being said, he way of putting it was most certainly wrong. Yes. I'm not saying what he intended to convey was wrong, but the way to put it across was. By the way, i think folks can do some network monitoring to validate some of the claims. Yes. My plan is to not open source as long as I'm actively working on it. If I plan to give it up, I'd happily open source it to keep the product alive and just help in regular release. The app currently does work on donations, but I'm also adding premium features for the advanced users to establish long term monetory feasibility. You can use traffic monitors to validate what end points the app call and what data is sent out of the app. I think that would validate some of the claims. Black box is gonna a black box and even network monitoring can never give the full picture. If you don't plan on making money form the app, please consider making it open-source and publishing it on F-Droid under GPL-3 license (IIRC, it forces its forks to be open-source as well). FOSS community has helped a lot of under-privileged people, like me, to grow eg- VLC, Blender, Krita etc. and needs talented people like you. I can help you with UI/UX given that i will receive credits. But beyond that, if you wanted help with developing a revenue model etc. then i would want to be compensated for the work and share in revenue. Hey! I am completely fine with giving you credits for your work. We currently don't make enough revenue, so my current goal is to make the product monetary feasible and invest in the product, but if you plan to stay with the product long term, we can look onto revenue sharing. Feel free to DM me! Wait! I can monitor what data is sent out? Aren't these calls encrypted? If not, then that is a serious issue irrespective of the content that is being transferred. I just installed your app a while ago. Love it, though yet to migrate everything to it. Yes, I found some bugs but you are doing it free and as a developer I know how hard that is and I appreciate it. I support open source too, but it's your app and it's up to you if you want to make it open source or not. No one should demand like this. So for every rude person like this, please know that there are people downloading and appreciating. I think there are licenses to prevent that, but yeah, people may not respect it Thank you for trying it out. Do reach out to me via DM or on email, and let me know, if possible, what bugs you're facing and I can look into them. Lots of new features and improvements coming this year! :) Happy to hear the future monetization plan. Could you add this plan somewhere on app site?. When I installed, I was bit worried what was the plan and whether you might in future resort to selling data, but then I decided to trust merely because you seemed genuine here. I wondered how someone could build all this ( all those imports from shitty government excels, you are a saint! ) and not charge money. Having a statement of who you are, why you do this and what are the monetization plans would help reassure potential users. &gt; I don't know much about Open Source licenses, So why are you advising people about which licence to use? How do you even compare the two? Patients are paying tax (income tax, gst, etc) which goes toward funding public institutions such as government offices and hospitals. I will work on a web landing page soon, and incorporate this suggestion there. Thank you for putting this out here. You can intercept api calls from an app before they are encrypted. If you are going to open source it, use a license like GPL so they must also open source their work Most patients who come to government hospitals don’t pay income tax I will keep this in mind, thank you! There are other kinds of tax too. If you purchase anything, you're paying gst. &gt; Most patients who come to government hospitals don’t pay income tax Do you have a source for this claim? This is the deal with an offer that’s open to the world. The laws of statistics require that you will have some jerks to deal with. Hopefully this one has done his worst and will leave you in peace. I trust you will find more reasonable users as well. Great stuff, what did you make it with? I mean the techstack. It's native Java. Mostly client side, with some firebase components. man i want to use it, but playstore doesnt let me install it on my google pixel 4a in germany. you got an idea? Install button is there, but white-greenish and cant click it Nice nice, I am currently doing ReactJS but want to do mobile development, Do you think React Native is a good idea? Hey! Personally I'm a bit biased towards native development, so I'm not the right person to ask. But, I've heard good things about React. You could also check out Flutter. Could you check your Android version? Android 12 That seems weird. The app is marked as available in Germany. Is there a specific error that you get? Can you share a screenshot? Mmmh didn't work from desktop browser. But works on phone itself :) The app looks really good!!! But it's looks focused on to the Indian market... Any chance to change currency? And have more indices? We are already working on allowing multi currency. Will be available in beta this week, and on the stable version early next month. We'll add more indices and markets this year starting with the US in a couple of months. What indices are you interested in? No particular indexes. Thank you"
}