{
    "id": "1dsppyr",
    "title": "TMC should take action on this.",
    "url": "https://www.reddit.com/gallery/1dsppyr",
    "selftext": "India is a secular Nation , not any hindu/Muslim rashtra ",
    "flair": "Crime",
    "score": 166,
    "num_comments": 38,
    "created_utc": 1719829855.0,
    "convurl": "https://i.redd.it/537tnzv4xv9d1.jpg",
    "comments": [
        "Wtf",
        "The presence of TMC in INDIA bloc makes me very uncomfortable. She should be kicked out of alliance.",
        "Jab sabka common enemy ek hi hai (bjp) toh Congress TMC ko nahi hata sakti 😢 Varna unka seat share gir jayega",
        "Man what is wrong with tmc?! We badly need congress revival in Bengal as an opposition.",
        "Shameful",
        "Ye video ka link hai kya jisme iss gadhe ne ye bola",
        "You are talking as if TMC doesn't get Hindu votes in WB itself. \n\nAnd INDIA alliance has more to do with defeating a common enemy than having a similar ideology. In WB, INC has been an ally of CPM for quite some time and CPM considers TMC its main rival.",
        "If congress wants to get deep into upper caste and obc vote bank all over India, it can’t be seen with such parties who are full of Muslims appeasement to a level where they justify violence against women and call Wb a Muslim rashtra. Nah man this is too much.",
        "2024 and they still think they OWN womankind",
        "Ah yes, \"full of muslim appeasement\", said it like a sanghi. \n\nOne leader saying it doesn't mean the entire party is justifying it or shares the same view. \n\nI know TMC has its own share of problems but you're blowing it way out of proportion. Go and check how much Hindu votes TMC gets instead of using this Sanghi argument of \"appeasement\". \n\nYou all criticise BJP for being pro-UC and stuff like that and now you also want INC to follow the same path and cut alliance with a party because of \"Muslim appeasement\". I mean, I won't be surprised if you are a BJP voter given the kind of argument you're using here.",
        "No shame",
        "...\n\n\n\n\nThese idiots brought our India down....",
        "Why were they beating up that woman? Also TMC is a scum party and Bengal is doomed. I'm starting to think maybe bjp might actually be good for them.",
        "Tatti mool congress!",
        "Fuk the sangh, and fuk your false dichotomy. I fully believe in secularism and to me Mamta isn’t at all behaving like one. Aap ki trh andhbhakti hamse Kisi ke liye nahi hogi, sorry 🙏 I am not a voter of any party lol. I have my own believes and will vote for whoever party I believe is close to my beliefs. Stop this tribalism of yours, we are not a voter bank but responsible citizens first. I liked how raga described Hinduism today, that’s how I want Hinduism to be. And I want him to convince uc people of the same as well. What’s wrong with it? Congress has Gandhiji and Sardar Vallabhbhai Patel who both had strong congress ideology within them but were deeply religious. So what?",
        "The new bhartiya nyay sanahita what ever adds that bribing for votes is criminal offence then whole TMC should be in jail",
        "Tmc is worse than BJP in West Bengal, they are a joke, thieves party",
        "I'm sorry, andhbhakti? LOL. You just assumed I'm some fan of TMC. I don't root for any political party, that's all. I just hate one and that's BJP. \n\nAnd dude, when did I say anything about religion????? Or Hinduism????? I just called out your argument of appeasement that is mostly used by Sanghis to attack political parties. \n\nZabardasti ka you brought Gandhi and Sardar Patel and religious and congress ideology lol when I wasn't talking about that at all. \n\nAnd I'm a secular too and also an Agnostic, who isn't blinded by religion.\n\nRegardless, my original comment was about you saying INDIA will lose Hindu votes because of TMC. I was saying it's an incredibly flawed argument because Hindus vote for TMC in large numbers in WB. You can check the numbers. BJP has long tried to paint it as an anti-Hindu party but it has failed. \n\nAnd I also mentioned that TMC has its own share of problems, I wasn't praising them lol. And you also know why Muslims vote for TMC in large numbers because you also know what will happen in WB if BJP comes to power. TMC is a problematic party but is clearly the lesser evil when compared to BJP.",
        "Their seat share will rise if they stand up for principles instead of just being not-BJP. This was a one time strategy that worked , I doubt that this coalition would earn more seats in the next election with the same strategy.",
        ".",
        "That’s why I said na in my original comment I want revival of congress. Yes bjp is the biggest evil but I don’t want to have another evil in place of bjp. Don’t get blinded by your hate so much that you aren’t able to see the reality. Muslims are quite backward both economically and socially, and both bjp and tmc will lead to their further detriment albeit by different means. We need strong pro reform Muslim leader not talibani styled one. We need frontier Gandhi!",
        "They're the same party in different flavors",
        "I'm glad all sides of the political spectrum actually agree on how bad tmc is and should be gone.",
        "Haan toh bhai I'm not against a revival of INC in WB. I never said anything about it, did I? I just mentioned the TMC and losing Hindu votes part. \n\nHate?  Kis cheez ka hate? BJP? Well yeah. I hate them and I'd pick TMC over them anyday and everyday. \n\nAnd I come from a Muslim family myself, so I know what our condition is economically and socially. It's bad. \n\nBut again, the thing is, at the moment, in WB it's only TMC vs BJP. Until and unless, a formidable third party arises, people, especially Muslims will vote for TMC and you know the reason why. \n\nAlso, this leader will get arrested and also suspended by the party. Had it been BJP, you know instead of getting demoted, they'd have promoted such people. That's the difference. Again, I ain't a fan of TMC or Mamata but them over the Sangh anyday.",
        "I think you will also agree that tmc is turning a blind eye towards the violence against Muslim women in West Bengal when we should be fighting for their rights. Imo that’s full on Muslim appeasement. That’s all. And as a secular guy I am against it. If congress does the same I will be against them too. Because bjp is playing politics on religion, I am against them too. We have to rise above religion and vote banks and that will start by us being responsible voters. If we criticise tmc, maybe Mamta will learn a lesson and improve. She has to know that the politics of her will have consequences and that INDIA won’t support such politics, that is how she will improve.",
        "Ya the narada and sarada scammers who ran to the BJP are better because ryzenofintel things so . Wtf logic 😂 both are the same party and that's the worst of the situation",
        "Got deleted already lol as expected",
        "Yeah , idk why",
        "Link kaha hai video ya article ka?",
        "Agar tum adharam kaa saath chalogae toh kaise chalegaa.Aagae jaakae tmc hii sabsae baada reason ban jayegii congress kii haar kaa.vahaa sae itnae sarrae illegal imagrants yaha aa rahae haii.\nJaise united kindom kii aaj halat hogi vaisee halat india kii bhii hojayegii aagae chal kae.",
        "I too apologize if I was rude, I just want upliftment of muslims and it will not happen via what tmc or bjp is doing. I am in no place to say anything about you guys but as an indian I too want every Indian to get up lifted regardless of any religion. May all of us stand together and make a better india. :)",
        "LOL. Nice username."
    ],
    "cleaned_text": "tmc take action india secular nation hindumuslim rashtra ",
    "cleaned_title": "tmc take action",
    "cleaned_selftext": "india secular nation hindumuslim rashtra",
    "cleaned_comments": "wtf presence tmc india bloc makes uncomfortable kicked alliance jab sabka common enemy ek hi hai bjp toh congress tmc ko nahi hata sakti varna unka seat share gir jayega man wrong tmc badly need congress revival bengal opposition shameful ye video ka link hai kya jisme iss gadhe ne ye bola talking tmc doesnt get hindu votes wb india alliance defeating common enemy similar ideology wb inc ally cpm quite time cpm considers tmc main rival congress wants get deep upper caste obc vote bank india cant seen parties full muslims appeasement level justify violence women call wb muslim rashtra nah man much still think womankind ah yes full muslim appeasement said like sanghi one leader saying doesnt mean entire party justifying shares view know tmc share problems youre blowing way proportion go check much hindu votes tmc gets instead using sanghi argument appeasement criticise bjp prouc stuff like also want inc follow path cut alliance party muslim appeasement mean wont surprised bjp voter given kind argument youre using shame idiots brought india beating woman also tmc scum party bengal doomed im starting think maybe bjp might actually good tatti mool congress fuk sangh fuk false dichotomy fully believe secularism mamta isnt behaving like one aap ki trh andhbhakti hamse kisi ke liye nahi hogi sorry voter party lol believes vote whoever party believe close beliefs stop tribalism voter bank responsible citizens first liked raga described hinduism today thats want hinduism want convince uc people well whats wrong congress gandhiji sardar vallabhbhai patel strong congress ideology within deeply religious new bhartiya nyay sanahita ever adds bribing votes criminal offence whole tmc jail tmc worse bjp west bengal joke thieves party im sorry andhbhakti lol assumed im fan tmc dont root political party thats hate one thats bjp dude say anything religion hinduism called argument appeasement mostly used sanghis attack political parties zabardasti ka brought gandhi sardar patel religious congress ideology lol wasnt talking im secular also agnostic isnt blinded religion regardless original comment saying india lose hindu votes tmc saying incredibly flawed argument hindus vote tmc large numbers wb check numbers bjp long tried paint antihindu party failed also mentioned tmc share problems wasnt praising lol also know muslims vote tmc large numbers also know happen wb bjp comes power tmc problematic party clearly lesser evil compared bjp seat share rise stand principles instead notbjp one time strategy worked doubt coalition would earn seats next election strategy thats said na original comment want revival congress yes bjp biggest evil dont want another evil place bjp dont get blinded hate much arent able see reality muslims quite backward economically socially bjp tmc lead detriment albeit different means need strong pro reform muslim leader talibani styled one need frontier gandhi theyre party different flavors im glad sides political spectrum actually agree bad tmc gone haan toh bhai im revival inc wb never said anything mentioned tmc losing hindu votes part hate kis cheez ka hate bjp well yeah hate id pick tmc anyday everyday come muslim family know condition economically socially bad thing moment wb tmc vs bjp unless formidable third party arises people especially muslims vote tmc know reason also leader get arrested also suspended party bjp know instead getting demoted theyd promoted people thats difference aint fan tmc mamata sangh anyday think also agree tmc turning blind eye towards violence muslim women west bengal fighting rights imo thats full muslim appeasement thats secular guy congress bjp playing politics religion rise religion vote banks start us responsible voters criticise tmc maybe mamta learn lesson improve know politics consequences india wont support politics improve ya narada sarada scammers ran bjp better ryzenofintel things wtf logic party thats worst situation got deleted already lol expected yeah idk link kaha hai video ya article ka agar tum adharam kaa saath chalogae toh kaise chalegaaaagae jaakae tmc hii sabsae baada reason ban jayegii congress kii haar kaavahaa sae itnae sarrae illegal imagrants yaha aa rahae haii jaise united kindom kii aaj halat hogi vaisee halat india kii bhii hojayegii aagae chal kae apologize rude want upliftment muslims happen via tmc bjp place say anything guys indian want every indian get lifted regardless religion may us stand together make better india lol nice username",
    "light_cleaned_title": "TMC should take action on this.",
    "light_cleaned_selftext": "India is a secular Nation , not any hindu/Muslim rashtra",
    "light_cleaned_comments": "Wtf The presence of TMC in INDIA bloc makes me very uncomfortable. She should be kicked out of alliance. Jab sabka common enemy ek hi hai (bjp) toh Congress TMC ko nahi hata sakti 😢 Varna unka seat share gir jayega Man what is wrong with tmc?! We badly need congress revival in Bengal as an opposition. Shameful Ye video ka link hai kya jisme iss gadhe ne ye bola You are talking as if TMC doesn't get Hindu votes in WB itself. And INDIA alliance has more to do with defeating a common enemy than having a similar ideology. In WB, INC has been an ally of CPM for quite some time and CPM considers TMC its main rival. If congress wants to get deep into upper caste and obc vote bank all over India, it can’t be seen with such parties who are full of Muslims appeasement to a level where they justify violence against women and call Wb a Muslim rashtra. Nah man this is too much. 2024 and they still think they OWN womankind Ah yes, \"full of muslim appeasement\", said it like a sanghi. One leader saying it doesn't mean the entire party is justifying it or shares the same view. I know TMC has its own share of problems but you're blowing it way out of proportion. Go and check how much Hindu votes TMC gets instead of using this Sanghi argument of \"appeasement\". You all criticise BJP for being pro-UC and stuff like that and now you also want INC to follow the same path and cut alliance with a party because of \"Muslim appeasement\". I mean, I won't be surprised if you are a BJP voter given the kind of argument you're using here. No shame ... These idiots brought our India down.... Why were they beating up that woman? Also TMC is a scum party and Bengal is doomed. I'm starting to think maybe bjp might actually be good for them. Tatti mool congress! Fuk the sangh, and fuk your false dichotomy. I fully believe in secularism and to me Mamta isn’t at all behaving like one. Aap ki trh andhbhakti hamse Kisi ke liye nahi hogi, sorry 🙏 I am not a voter of any party lol. I have my own believes and will vote for whoever party I believe is close to my beliefs. Stop this tribalism of yours, we are not a voter bank but responsible citizens first. I liked how raga described Hinduism today, that’s how I want Hinduism to be. And I want him to convince uc people of the same as well. What’s wrong with it? Congress has Gandhiji and Sardar Vallabhbhai Patel who both had strong congress ideology within them but were deeply religious. So what? The new bhartiya nyay sanahita what ever adds that bribing for votes is criminal offence then whole TMC should be in jail Tmc is worse than BJP in West Bengal, they are a joke, thieves party I'm sorry, andhbhakti? LOL. You just assumed I'm some fan of TMC. I don't root for any political party, that's all. I just hate one and that's BJP. And dude, when did I say anything about religion????? Or Hinduism????? I just called out your argument of appeasement that is mostly used by Sanghis to attack political parties. Zabardasti ka you brought Gandhi and Sardar Patel and religious and congress ideology lol when I wasn't talking about that at all. And I'm a secular too and also an Agnostic, who isn't blinded by religion. Regardless, my original comment was about you saying INDIA will lose Hindu votes because of TMC. I was saying it's an incredibly flawed argument because Hindus vote for TMC in large numbers in WB. You can check the numbers. BJP has long tried to paint it as an anti-Hindu party but it has failed. And I also mentioned that TMC has its own share of problems, I wasn't praising them lol. And you also know why Muslims vote for TMC in large numbers because you also know what will happen in WB if BJP comes to power. TMC is a problematic party but is clearly the lesser evil when compared to BJP. Their seat share will rise if they stand up for principles instead of just being not-BJP. This was a one time strategy that worked , I doubt that this coalition would earn more seats in the next election with the same strategy. . That’s why I said na in my original comment I want revival of congress. Yes bjp is the biggest evil but I don’t want to have another evil in place of bjp. Don’t get blinded by your hate so much that you aren’t able to see the reality. Muslims are quite backward both economically and socially, and both bjp and tmc will lead to their further detriment albeit by different means. We need strong pro reform Muslim leader not talibani styled one. We need frontier Gandhi! They're the same party in different flavors I'm glad all sides of the political spectrum actually agree on how bad tmc is and should be gone. Haan toh bhai I'm not against a revival of INC in WB. I never said anything about it, did I? I just mentioned the TMC and losing Hindu votes part. Hate? Kis cheez ka hate? BJP? Well yeah. I hate them and I'd pick TMC over them anyday and everyday. And I come from a Muslim family myself, so I know what our condition is economically and socially. It's bad. But again, the thing is, at the moment, in WB it's only TMC vs BJP. Until and unless, a formidable third party arises, people, especially Muslims will vote for TMC and you know the reason why. Also, this leader will get arrested and also suspended by the party. Had it been BJP, you know instead of getting demoted, they'd have promoted such people. That's the difference. Again, I ain't a fan of TMC or Mamata but them over the Sangh anyday. I think you will also agree that tmc is turning a blind eye towards the violence against Muslim women in West Bengal when we should be fighting for their rights. Imo that’s full on Muslim appeasement. That’s all. And as a secular guy I am against it. If congress does the same I will be against them too. Because bjp is playing politics on religion, I am against them too. We have to rise above religion and vote banks and that will start by us being responsible voters. If we criticise tmc, maybe Mamta will learn a lesson and improve. She has to know that the politics of her will have consequences and that INDIA won’t support such politics, that is how she will improve. Ya the narada and sarada scammers who ran to the BJP are better because ryzenofintel things so . Wtf logic 😂 both are the same party and that's the worst of the situation Got deleted already lol as expected Yeah , idk why Link kaha hai video ya article ka? Agar tum adharam kaa saath chalogae toh kaise chalegaa.Aagae jaakae tmc hii sabsae baada reason ban jayegii congress kii haar kaa.vahaa sae itnae sarrae illegal imagrants yaha aa rahae haii. Jaise united kindom kii aaj halat hogi vaisee halat india kii bhii hojayegii aagae chal kae. I too apologize if I was rude, I just want upliftment of muslims and it will not happen via what tmc or bjp is doing. I am in no place to say anything about you guys but as an indian I too want every Indian to get up lifted regardless of any religion. May all of us stand together and make a better india. :) LOL. Nice username."
}