{
    "id": "129bcix",
    "title": "Muslim cattle trader in Karnataka murdered by Hindutva men, told to 'go back to Pakistan'",
    "url": "https://maktoobmedia.com/india/muslim-cattle-trader-in-karnataka-murdered-by-hindutva-men-told-to-go-back-to-pakistan/",
    "selftext": "In a shocking incident, a cattle trader named Idrees Pasha was brutally murdered by a group of Hindutva men in Ramanagara district of Karnataka on Saturday. The incident has caused widespread outrage among the local residents and family members of the deceased, who have demanded swift action against the perpetrators.",
    "flair": "Crime",
    "score": 161,
    "num_comments": 43,
    "created_utc": 1680413642.0,
    "convurl": "https://external-preview.redd.it/OFldRgkjOIzk5POJiZpzME5NygUZCA4QaRSFqICrk08.jpg?auto=webp&v=enabled&s=94c2dff9fde62151c63dca8568dca0bdff6d925f",
    "comments": [
        "Kya chal raha hai desh me samajh hi nai aata!",
        "\"minor\" incidents according to BJP supporters.",
        "recent days? its been this since long long time, not a week passes by when a repeat of it happens.  \n\n\n> Are we Going to be terrorist now\n\nConsidering how you will rarely find a society where a support is from majority of people towards such groups which in case there is from hindus, and was in case of nazis, yeah.",
        ">nobody ever gave me a religious lecture, nobody told me I’ll go to hell if I don’t believe or forced me in anything.\n\nI don’t think it’s because it’s such “free\nAnd beautiful religion”\nBut it’s because people around you were not religious. \nThis bullshit has existed in this country since thousands of years it’s just before the Muslims, targets of this kinds of attacks were lower caste Hindus and tribals.",
        "If it causes them so much trouble they should go to UP and volunteer for working in cow Safari.\n\nhttps://youtu.be/9ndLmyeIYTQ",
        "Just feel sick reading this happened in Ramangara. It's pretty close to Bangalore and a weekend get-away of sorts. I did my internship in the silk-market there and people were kind enough to listen to all my survey inquiries and help with my project. The movie Sholay was shot there. Every part of this state that I hold dear is going to hell.",
        "I'm so glad I left the country for good. No matter how well off you are, if you are a Muslim, you are a second class citizen. There are a lot of good people but the situation overall is pretty bad. The only regret is that my family and other innocents have to live that hell hole. India is heaven for a certain group and a nightmare for the other.",
        "\"Moderate\" BJP Supporters.",
        "Every day there is a murder by these goons in name of cattle trade wth",
        "Elections is coming polarisation is good bjp to play hindutva card …most of these murders by so called cow vigilantes takes place in BJP ruled states from the full support of the govt . If muslims get killed bjp can say to its base that see we are the saviors and we are treating them a lesson bur if muslims retaliate and kill someone in return they will say “ hindu khatre main hai “ so it’s a win win situation for them either way",
        "first time I heard of a man gettimg lyncjed fot religious reasons was when I watched a video of a young Pakistani guy who was beaten to death in early 2010s. I remember thinking to myself \"ah, this will never happen in India. We are so much but better\" How naive I was back then.\n\nBut none of these lynchings surprises me anymore. it's the new normal. as a society, we have failed and it will continue to get word\nse because these goons enjoy govt.'s protection. \nmoreover, all I see on social media these days is people justifying these actions and a lot of thode are younger Indians and that make me pessimistic towards the country's future. I dont see it improving for the next 20-30 years. \n\nThe narrative that Hinduism is in danger is too strong right now and we don't have a counter narrative and I am not even sure what counter narrative can be built to curtail this hate.",
        "And its also because there is no concept of divine retribution. People feel they can do whatever they want and there will never ever be any consequences.",
        "But I would have to believe in Hinduism if I don’t want to be born as insect in next life, If I don’t believe in Hinduism in this life my other life’s would be hell. And that cycle would never end until I believe in hinduism. \nSo there is a concept of devine retribution in hinduism.",
        "Would you know that you were born as an insect because of your sins ? Would you remember the misdeeds from your past life ? If not then how would you even know that you are being punished.",
        "What ? How does the soul ever learn then ?",
        "I don’t know man, I don’t know how it works.",
        "Thats ok. Be at peace.",
        "Which country did you shift to?",
        "As if it wasn't toxic before. It is a very toxic religion. You can ask the Dalits about how toxic Hinduism is.",
        "Pakistan was a North and East india phenomena for the most part, how can South indians latch on to it ?",
        "What?",
        "If you are really a Dalit, follow Ambedkar, not the saffron idiot named Vivekananda. Vivekananda was not against caste. He found caste system praiseworthy. He also believed that we should stick to caste system. Not related, but Vivekananda also believed that if sperm remains inside our body, it become grey matter. I don't like that idiot and his superfluous take on Hinduism. I am an Ambedkarite and I am proud to be so.",
        "Dalits believing in Vivekananda is as good as Jews believing in Alfred Rosenberg. Now go ahead and google the name.",
        "That's why you are a fan of Hinduism and Vivekananda. Vivekananda hocche ashikkhita Bangalider mahapurush. Obosshyo jara Bamakhepa, Tailanga Swamider moto khepturiusder mahapurush mone kore taader kaache Vivekananda obossoi taalkhir.",
        "Doesn't invalidate others being discriminated either tho, might as well praise Savarkar. \n\nCaste system has been as discriminatory as it is since ages before the Mughal or British rule, it is literally mentioned in the Vedas. Do not believe any savarn bullshit that they propagate and blame the Varna system onto Muslims/Christians. You need to open up your eyes man",
        "I am attacking the prevalent Bengali Hindu mindset. You do not matter to me. I have no reason to attack you. I am free to express my opinion. If it hurts you, know that you are facing the truth.",
        "I am a Bengali and I am criticizing my own community. I have every right to do so. If you have problem, it is yours. Bengalis are not a race. You have zero idea what is racism, Mr. Kupmandook. I will offend. I have the right to offend. You also have the right to be offended. It's still a democracy, even if it is so just on a paper.",
        "&#x200B;\n\nhttps://preview.redd.it/2qrotr395ira1.jpeg?width=1170&format=pjpg&auto=webp&v=enabled&s=43f0db2cadafbe915428f9e7019b245977bf632d",
        "From now on we need to eat 2X beef ....Don't let this f6ckers win",
        "You clearly have been cherry-picking the good parts of your religion your whole life. Now you are seeing the full extent of it.",
        "\"isolated\" incident",
        "Let's see what happens when Gulf countries start to fire & deport Indians back to BJP-ruled states in retaliation. Watch how Modi will make comments about showing restraint and respecting other faiths. Probably shed a few crocodile tears too on camera.",
        "Good ol' Karnataka. South India's UP"
    ],
    "cleaned_text": "muslim cattle trader karnataka murdered hindutva men told go back pakistan shocking incident cattle trader named idrees pasha brutally murdered group hindutva men ramanagara district karnataka saturday incident caused widespread outrage among local residents family members deceased demanded swift action perpetrators ",
    "cleaned_title": "muslim cattle trader karnataka murdered hindutva men told go back pakistan",
    "cleaned_selftext": "shocking incident cattle trader named idrees pasha brutally murdered group hindutva men ramanagara district karnataka saturday incident caused widespread outrage among local residents family members deceased demanded swift action perpetrators",
    "cleaned_comments": "kya chal raha hai desh samajh hi nai aata minor incidents according bjp supporters recent days since long long time week passes repeat happens going terrorist considering rarely find society support majority people towards groups case hindus case nazis yeah nobody ever gave religious lecture nobody told ill go hell dont believe forced anything dont think free beautiful religion people around religious bullshit existed country since thousands years muslims targets kinds attacks lower caste hindus tribals causes much trouble go volunteer working cow safari feel sick reading happened ramangara pretty close bangalore weekend getaway sorts internship silkmarket people kind enough listen survey inquiries help project movie sholay shot every part state hold dear going hell im glad left country good matter well muslim second class citizen lot good people situation overall pretty bad regret family innocents live hell hole india heaven certain group nightmare moderate bjp supporters every day murder goons name cattle trade wth elections coming polarisation good bjp play hindutva card murders called cow vigilantes takes place bjp ruled states full support govt muslims get killed bjp say base see saviors treating lesson bur muslims retaliate kill someone return say hindu khatre main hai win win situation either way first time heard man gettimg lyncjed fot religious reasons watched video young pakistani guy beaten death early remember thinking ah never happen india much better naive back none lynchings surprises anymore new normal society failed continue get word se goons enjoy govts protection moreover see social media days people justifying actions lot thode younger indians make pessimistic towards countrys future dont see improving next years narrative hinduism danger strong right dont counter narrative even sure counter narrative built curtail hate also concept divine retribution people feel whatever want never ever consequences would believe hinduism dont want born insect next life dont believe hinduism life lifes would hell cycle would never end believe hinduism concept devine retribution hinduism would know born insect sins would remember misdeeds past life would even know punished soul ever learn dont know man dont know works thats ok peace country shift wasnt toxic toxic religion ask dalits toxic hinduism pakistan north east india phenomena part south indians latch really dalit follow ambedkar saffron idiot named vivekananda vivekananda caste found caste system praiseworthy also believed stick caste system related vivekananda also believed sperm remains inside body become grey matter dont like idiot superfluous take hinduism ambedkarite proud dalits believing vivekananda good jews believing alfred rosenberg go ahead google name thats fan hinduism vivekananda vivekananda hocche ashikkhita bangalider mahapurush obosshyo jara bamakhepa tailanga swamider moto khepturiusder mahapurush mone kore taader kaache vivekananda obossoi taalkhir doesnt invalidate others discriminated either tho might well praise savarkar caste system discriminatory since ages mughal british rule literally mentioned vedas believe savarn bullshit propagate blame varna system onto muslimschristians need open eyes man attacking prevalent bengali hindu mindset matter reason attack free express opinion hurts know facing truth bengali criticizing community every right problem bengalis race zero idea racism mr kupmandook offend right offend also right offended still democracy even paper xb need eat x beef dont let fckers win clearly cherrypicking good parts religion whole life seeing full extent isolated incident lets see happens gulf countries start fire deport indians back bjpruled states retaliation watch modi make comments showing restraint respecting faiths probably shed crocodile tears camera good ol karnataka south indias",
    "light_cleaned_title": "Muslim cattle trader in Karnataka murdered by Hindutva men, told to 'go back to Pakistan'",
    "light_cleaned_selftext": "In a shocking incident, a cattle trader named Idrees Pasha was brutally murdered by a group of Hindutva men in Ramanagara district of Karnataka on Saturday. The incident has caused widespread outrage among the local residents and family members of the deceased, who have demanded swift action against the perpetrators.",
    "light_cleaned_comments": "Kya chal raha hai desh me samajh hi nai aata! \"minor\" incidents according to BJP supporters. recent days? its been this since long long time, not a week passes by when a repeat of it happens. > Are we Going to be terrorist now Considering how you will rarely find a society where a support is from majority of people towards such groups which in case there is from hindus, and was in case of nazis, yeah. >nobody ever gave me a religious lecture, nobody told me I’ll go to hell if I don’t believe or forced me in anything. I don’t think it’s because it’s such “free And beautiful religion” But it’s because people around you were not religious. This bullshit has existed in this country since thousands of years it’s just before the Muslims, targets of this kinds of attacks were lower caste Hindus and tribals. If it causes them so much trouble they should go to UP and volunteer for working in cow Safari. Just feel sick reading this happened in Ramangara. It's pretty close to Bangalore and a weekend get-away of sorts. I did my internship in the silk-market there and people were kind enough to listen to all my survey inquiries and help with my project. The movie Sholay was shot there. Every part of this state that I hold dear is going to hell. I'm so glad I left the country for good. No matter how well off you are, if you are a Muslim, you are a second class citizen. There are a lot of good people but the situation overall is pretty bad. The only regret is that my family and other innocents have to live that hell hole. India is heaven for a certain group and a nightmare for the other. \"Moderate\" BJP Supporters. Every day there is a murder by these goons in name of cattle trade wth Elections is coming polarisation is good bjp to play hindutva card …most of these murders by so called cow vigilantes takes place in BJP ruled states from the full support of the govt . If muslims get killed bjp can say to its base that see we are the saviors and we are treating them a lesson bur if muslims retaliate and kill someone in return they will say “ hindu khatre main hai “ so it’s a win win situation for them either way first time I heard of a man gettimg lyncjed fot religious reasons was when I watched a video of a young Pakistani guy who was beaten to death in early 2010s. I remember thinking to myself \"ah, this will never happen in India. We are so much but better\" How naive I was back then. But none of these lynchings surprises me anymore. it's the new normal. as a society, we have failed and it will continue to get word se because these goons enjoy govt.'s protection. moreover, all I see on social media these days is people justifying these actions and a lot of thode are younger Indians and that make me pessimistic towards the country's future. I dont see it improving for the next 20-30 years. The narrative that Hinduism is in danger is too strong right now and we don't have a counter narrative and I am not even sure what counter narrative can be built to curtail this hate. And its also because there is no concept of divine retribution. People feel they can do whatever they want and there will never ever be any consequences. But I would have to believe in Hinduism if I don’t want to be born as insect in next life, If I don’t believe in Hinduism in this life my other life’s would be hell. And that cycle would never end until I believe in hinduism. So there is a concept of devine retribution in hinduism. Would you know that you were born as an insect because of your sins ? Would you remember the misdeeds from your past life ? If not then how would you even know that you are being punished. What ? How does the soul ever learn then ? I don’t know man, I don’t know how it works. Thats ok. Be at peace. Which country did you shift to? As if it wasn't toxic before. It is a very toxic religion. You can ask the Dalits about how toxic Hinduism is. Pakistan was a North and East india phenomena for the most part, how can South indians latch on to it ? What? If you are really a Dalit, follow Ambedkar, not the saffron idiot named Vivekananda. Vivekananda was not against caste. He found caste system praiseworthy. He also believed that we should stick to caste system. Not related, but Vivekananda also believed that if sperm remains inside our body, it become grey matter. I don't like that idiot and his superfluous take on Hinduism. I am an Ambedkarite and I am proud to be so. Dalits believing in Vivekananda is as good as Jews believing in Alfred Rosenberg. Now go ahead and google the name. That's why you are a fan of Hinduism and Vivekananda. Vivekananda hocche ashikkhita Bangalider mahapurush. Obosshyo jara Bamakhepa, Tailanga Swamider moto khepturiusder mahapurush mone kore taader kaache Vivekananda obossoi taalkhir. Doesn't invalidate others being discriminated either tho, might as well praise Savarkar. Caste system has been as discriminatory as it is since ages before the Mughal or British rule, it is literally mentioned in the Vedas. Do not believe any savarn bullshit that they propagate and blame the Varna system onto Muslims/Christians. You need to open up your eyes man I am attacking the prevalent Bengali Hindu mindset. You do not matter to me. I have no reason to attack you. I am free to express my opinion. If it hurts you, know that you are facing the truth. I am a Bengali and I am criticizing my own community. I have every right to do so. If you have problem, it is yours. Bengalis are not a race. You have zero idea what is racism, Mr. Kupmandook. I will offend. I have the right to offend. You also have the right to be offended. It's still a democracy, even if it is so just on a paper. &#x200B; From now on we need to eat 2X beef ....Don't let this f6ckers win You clearly have been cherry-picking the good parts of your religion your whole life. Now you are seeing the full extent of it. \"isolated\" incident Let's see what happens when Gulf countries start to fire & deport Indians back to BJP-ruled states in retaliation. Watch how Modi will make comments about showing restraint and respecting other faiths. Probably shed a few crocodile tears too on camera. Good ol' Karnataka. South India's UP"
}