{
    "id": "15ipnkb",
    "title": "Amrit Bharat Station Scheme: PM Modi likely to lay foundation stone of 500 railway stations next week, check key details",
    "url": "https://www.cnbctv18.com/india/amrit-bharat-station-scheme-pm-likely-to-lay-stone-of-500-railway-stations-next-week-17414681.htm/amp",
    "selftext": "What exactly happened to 100 smart cities? Grand and ambitious projects are announced to sway voters but implementation isn’t visible",
    "flair": "Politics",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1691222583.0,
    "convurl": "https://external-preview.redd.it/oZkw01ZPcqiVKNfjVi-BLRvq6jxsDQB4jOOWRiGMr9I.jpg?auto=webp&s=7f3b9f73c255f20e103fbf7e5c9b302f3785df43",
    "comments": [
        "Likely 🤣🤣 ,Modiji kha yahi toh kaam hein ..",
        "He just wants his name on everything... surprised he hasn't proposed changing India to NaMindia  (excuse the PJ)",
        "LOL.",
        "Indian version of Trump",
        "I didn't know that he actually created three events from new parliament building too . Event management module Modi"
    ],
    "cleaned_text": "amrit bharat station scheme pm modi likely lay foundation stone railway stations next week check key details exactly happened smart cities grand ambitious projects announced sway voters implementation isnt visible ",
    "cleaned_title": "amrit bharat station scheme pm modi likely lay foundation stone railway stations next week check key details",
    "cleaned_selftext": "exactly happened smart cities grand ambitious projects announced sway voters implementation isnt visible",
    "cleaned_comments": "likely modiji kha yahi toh kaam hein wants name everything surprised hasnt proposed changing india namindia excuse pj lol indian version trump didnt know actually created three events new parliament building event management module modi",
    "light_cleaned_title": "Amrit Bharat Station Scheme: PM Modi likely to lay foundation stone of 500 railway stations next week, check key details",
    "light_cleaned_selftext": "What exactly happened to 100 smart cities? Grand and ambitious projects are announced to sway voters but implementation isn’t visible",
    "light_cleaned_comments": "Likely 🤣🤣 ,Modiji kha yahi toh kaam hein .. He just wants his name on everything... surprised he hasn't proposed changing India to NaMindia (excuse the PJ) LOL. Indian version of Trump I didn't know that he actually created three events from new parliament building too . Event management module Modi"
}