{
    "id": "13m736m",
    "title": "I am scared for what happened",
    "url": "https://www.reddit.com/r/india/comments/13m736m/i_am_scared_for_what_happened/",
    "selftext": "\n\nHey there,\n\nI feel compelled to share an unsettling experience I recently had at the Bank of Baroda branch in Garotia, Bhagalpur, Bihar\n\n\nDuring a visit to the bank with my  mother, an urgent phone call interrupted our wait. To our utter shock, a security guard approached my mother in an aggressive manner, subjecting her to a barrage of derogatory language. The incident unfolded within the bank premises, in full view of other customers, leaving us both deeply humiliated and disturbed.\n\nDespite the distress caused, we maintained composure and decided to address the issue after completing our banking tasks. Approaching the security guard calmly and respectfully, I requested his name and urged him to refrain from using offensive language, especially when dealing with elderly customers. To this he stood up from his seat and charged at me with his baton - I couldn't believe that he would do such thing just bcz I asked for his name !  He threatened me with \"I will put you in jail\" (for what ? Asking for good behaviour ? )\n\nEven when I went out of the bank, he followed me outside with his baton, and kept saying - \"tell me your name, where you are from\". \n\nI'm kind of scared to even visit my own bank, I have already sent complaint to bank manager in mail, have complained on Bank of Baroda Grievance cell.\n\nTbh I being most of my life out of this state - I think Bank won't do anything about this issue. Regardless I'd love to have your opinions and suggestions on what should I do.\n\nUPDATE \n\nI'm going step by step, rather than jumping to police station. \n\n1. I've emailed branch manager a detailed complaint\n\n2. I've registered my complaint on Bank of Baroda Grievance cell (have attached my grievance number to the mail to manager)\n\n3. Filed a consumer complaint against Bank of Baroda on CPGRAMS portal. (Centralised Public Grievance Redress and Monitoring System (CPGRAMS) is an online platform available to the citizens 24x7 to lodge their grievances to the public authorities on any subject related to service delivery.)\n\nHave attached complaint number received from CPGRAMS in mail to Manager too. \n\n4. I tried to call customer care of Bank of Baroda too ( +91 1800 5700) - it says number is invalid. \n\n5. I am trying to get hold of personal number of Branch Manager to call him specifically. \n\n\nWill keep you all updated. I'm not gonna give this one up.\n\nUpdate - A lot of people in comments are saying that I should have used my hands for faster settlement 🙂. Well that guard must be around 50+ years old and me hitting him brings me down to his level. I'd prefer any day to avoid unnecessary violence. \n\nLink to Twitter thread - https://twitter.com/Single_Seeker/status/1659585859052781568?t=bfIl1tOqL9vDf4Wy4_H1Lg&s=19\n\nPlease help me with this issue - retweet/like  ✨",
    "flair": "Rant / Vent",
    "score": 365,
    "num_comments": 113,
    "created_utc": 1684528759.0,
    "convurl": "https://external-preview.redd.it/dTQkRWqfFAeUEawdbqEq8-PUuDLfD8Cwpff6dCM8R-A.jpg?auto=webp&v=enabled&s=90d9e8089d374301db5528c4aaaea0fd065f000e",
    "comments": [
        "So much text ….so little detail on what actually happened!",
        "Bro’s preparing for one of those complaint letters we had to write in school lol.",
        "Went to a local branch of bank of baroda in Bihar (Bhagalpur). Mum got a call, she had to pick up. Security guard saw her and shouted at her being extremely rude, she was embarassed, while I felt angry. After I was done - I went to the guard - \"please watch your tongue, she is as old as you\". To which he said - \"tu hota kaun hai mujhe bolne wala\". I said \"I'd like to lodge a complaint, please tell me your name\". To this - he took out his baton and ran towards me and threatened me with jail. I was alone with my mother, I left without any more argument and just wanted to share this. Tbh I'm scared - not used to living in Bihar - this was first time I saw something like this. \n\nI am sorry for lengthy post.  This is the gist of the matter.",
        "Well this is what you need to tell the branch manager. Not an essay!\n\nSay how his behaviour has been demeaning to your mother and threatening to you. Keep it simple and keep it tight. No more than three 2-3 line paragraphs. Email it first to the branch manager saying that you’d need a reply/apology within x days otherwise you’ll be compelled to escalate.",
        "Am really sorry, this was my first post, I have shortened the post.",
        "Thank you. I hope I get one",
        "Give us more details as well. What was the security guard actually saying? Do you have any idea why he was saying those things specifically to you?",
        "I'll try to transcribe the whole thing - \n\n1st part \n\nHe charged at my mum saying - \"kya samajhti ho tum, mana kiay hai na baat krne se, bahar niklo abhi ke abhi\" while he was with his baton in his hand - literally ordering her like a peasant while everyone was watching.\n\nMy mum said nothing, Ia sked her to go out and not talk on phone.\n\nAfter we were done in bank - I went to the security guard - \n\n2nd part ---\n\nMe - Aapka name kya hai \n\nGuard - Kya karoge name Jaan kar \n\nMe - Sir, ye meri maa hain, aapke age ki Hain, aapko aise baat nahi karni chaiye inse \n\nGuard - (Got angry, stood up) Tu mujhe sikhayega kaise baat krte Hain, bahar nikal \n\nMe - Sir, main is bank ka customer hoon, as security it's your job to treat people gentle\n\nGuard - Zyada bol mat, sidhe jail le ke jaunga, tu hai kaun\n\nMe - Sir, please give me your name, I'd like to file a complaint\n\nGuard - Got angry and jumped at me while I was outside bank, on my bike, my mother had to get between us to stop him from hitting me. \n\nMe - Aap customer ko maroge ? Aap khud ko security bula rahe ho ! \n\nGuard - Zyada bol mat, warna sidhe jail le ke jaunga. \n\nTo this point - I being alone and with my mum shaking, I felt it was better to talk to someone with some sense than arguing more with him.",
        "Write a detailed email to the head branch",
        "TLDR: OP mother standing in queue in bank, answered a phone call, security guard got angry that she is talking on phone (?), guard used unparliamentary language while being aggressive, OP confronted politely but wants to report it.",
        "The guard sounds unhinged.",
        "He’s just a low life security guard. Ensure you complain to the manager and your local ombudsman. Ensure he loses his job too.",
        "Complaint but don’t pressurise for anyone to be kicked out of a job. It’s hard for everyone",
        "Exactly, it's hard for everyone.\n\nSo we should kick such undeserving people to make way for others.",
        "Nah he needs to be kicked out of his job. He's clearly not suitable for it. Deserves every bit of the bad outcomes.",
        "Well I hope you never make a mistake in your professional life then!",
        ">I am scared for what happened\n\nDon't be scared. It seems that the guard was both abusive to your mum and yourself. If there was a problem with taking a phone call on-premises, all it would take is a gentle reminder to turn off your phone, not vulgar language. \n\nFor the sake of yourself, your mum and everyone else, file a complaint with the bank manager and escalate, if necessary. Also post on Twitter and social media while tagging the bank. \n\nAt the very least, your mom deserves an apology. And the bank deserves better people.",
        "So much of absolutely nothing",
        "It’s uncivilised not unparliamentary. Our parliamentarians are much more crass.",
        "Write to regional/zonal officer, their email should be available online. Also file a complaint over phone (although that isn't easy to do for PSU banks)",
        "Is it not allowed to take a phone call inside a bank in India ?  \nIs there a RBI circular which prohibits this ?",
        "File a police complaint",
        "Bro are u pussy \nKnock the fuck out of him simple",
        "Yep! Anyone can have a bad day especially in customer facing roles. But try and put that argument through and everyone becomes a god who has done nothing wrong! Thanks for being the voice of sanity here",
        "Wo guard tumhari maa se badtameezi se baat kar ke gaya aur tum uske pass gaye respectfully uska naam puchhne ?\n\nbade patient ho bhai",
        "![gif](giphy|l0HUbtILos6CdAtxu|downsized)",
        "Was probably drunk. Visit the bank again to meet the manager and say he was drunk and was smelling of alcohol. See how tables will turn",
        "Should have made scene there and called the police.",
        "I understand it, and you’re correct, but this does not verify anybody’s rude behavior. Like if that woman would have defied her and continued to do something than he should’ve done something. Still abusing and violence is not correct. He could’ve made them to leave the bank and cone later or made them stand at the end of the line, or anything. I personally don’t feel abusing and hitting others should be approach to anything.",
        "Wtf! Why do Indian banks have such absurd rules like no talking on phone inside the branch?!",
        "You should do a police complaint. Not just mail to bank manager.",
        "Someone will beat u nd ur loved ones by mistake someday. Remember to forgive them for that!",
        "I don't think fighting like kids is a good approach. He can handle it properly and get the mf fired",
        ">> He charged at my mum saying - \"kya samajhti ho tum, mana kiay hai na baat krne se, bahar niklo abhi ke abhi\"\n\nWhat do you mean by that?Did he warn your mom beforehand because according to you he says that he warned your mom to not talk on the phone previously.",
        "Yes. Go to police and depending on state either file a complaint or pay them to sort the guy out.",
        "Complain to the regional office directly. The guard is mostly on contract. They will definitely take some action against him.",
        "Do it the Bihar way, catch that chooth on his way home after work and take him to the fields.",
        "What the actual fuck are you saying??? How the fuckkk is he or his mother at fault??? If talking on phone is not allowed (thats a big if) the guard should inform them.. not charge at them. \n\nOP all the banks have a list of numbers you can contact to file complaints..call all the numbers till someone pick up and raise your complaint.. i can assure you they will take action. At the very least they will reprimand the asshole.",
        "That's exactly why I went to him \"asked politely\" to say whatever he wants in \"polite manner\". Imagine being on a job which requires patience and then charging on to customer because they asked you to ask nicely? I wanted just a better treatment of behaviour. I don't think that's much of an ask.",
        "If you’d have read the actual incident then you’d never comment the nonsense that you did.",
        "Go to the gym. Use the anger the right way.\n\nAfter a few months, Intentionally start a fight with him. F##k him up there. \n\nYou complaining to him to his own people would lead to nowhere.\n\nPolice complaint, approaching women NGOs are too much of a mess.",
        "Your sentence makes as much sense as Java with Javascript",
        "Haha made me chuckle",
        "Jump on this MF with your gang, go old school in Bihar, nothing else will work",
        "You need to write 2 letters. One to the bank manager and one to the banking ombudsman. Similar thing happened to me a few years back in a PNB branch. After informing the bank manager that I'm going to file a complaint with the ombudsman, I got a call from the chief circle manager who expressed his regrets.",
        "wait a minute .......\n\nCute of you to even assume I will fight like Kids after somebody abuse/disrespect my mother .\n\nMai guarantee se keh rha hu agar uss time guard ko tameez se samjha diya hota , uski ya kisi aur ki himmat nahi hoti bolne ki . Tum ek baar aggressive aur dominant banke to dekho . Abey guard hai wo sirf ek",
        "Sahi baat kahi 👏I agree 101%",
        "OP conveniently leaving the important details and answering specific questions only when asked. Sus",
        "It is prohibited but not strictly enforced.",
        "Write to the banking ombudsman , also vist the branch with someone who cant be bullied and stand up for their self then request a meeting with the branch manager and file a complaint in the banks complaint box/book. Demand an aplology from the guard and then anyways proceed to chase the complaint with the ombudsman .  If you feel the bank employees will use a condesending tone with you record the conversation for proof let the bank managers senior and the ombudsman know about the recording.",
        "There is good chance he is an ex serviceman (ex army)",
        "Please allow me to answer whatever doubts/questions you may have.",
        "This is why app banks are the future",
        "Write complaints  (to police (are they at all helpful in your place?)and bank authorities) also raise this across social media. These kind of banking (where customer's money is all they have) need to learn lessons and train staff. \n\nI am really sorry to hear this, hope you will get over this soon.",
        "Why did the guard shout on you? What did you do?",
        "Bank of Baroda is one of the shittiest banks.\n\nMove the account.",
        "I'm going step by step, rather than jumping to police station. \n\n1. I've emailed branch manager a detailed complaint\n\n2. I've registered my complaint on Bank of Baroda Grievance cell (have attached my grievance number to the mail to manager)\n\n3. Filed a consumer complaint against Bank of Baroda on CPGRAMS portal. (Centralised Public Grievance Redress and Monitoring System (CPGRAMS) is an online platform available to the citizens 24x7 to lodge their grievances to the public authorities on any subject related to service delivery.)\n\nHave attached complaint number received from CPGRAMS in mail to Manager too. \n\n4. I tried to call customer care of Bank of Baroda too ( +91 1800 5700) - it says number is invalid. \n\n5. I am trying to get hold of personal number of Branch Manager to call him specifically. \n\n\nWill keep you all updated. I'm not gonna give this one up.",
        "How can you write so much and explain nothing? Are you Tania Sachdev?",
        "As per guard - \n\n1. How can I (a kid for him)  teach him \"how to talk\"\n\n2. How can I complain against him ? (What is my aukat)\n\nThat's what I could make of his anger\n\nThis is contradictory in itself - He wants me to talk to him politely at the same time he refuses to do so. 👁️",
        "Really sorry, this is my first time on reddit posting something. I've changed my post/ have done necessary edits/omitted bogus things. \n\nI've explained issue pointwise in comments also. I apologise for any issue.",
        "It is not a mistake to threaten violence. He is not fit for the job, his qualifications are better suited to dog catching.",
        "Lol just saw the Twitter thread and bank says the issue is resolved without actually doing anything.\n\nOP advice you to tag a hell lot of govt officials here as well as Bihar police and your city police if they go a Twitter account\nTag govt and ask are women and elderly not safe",
        "Also close the account. Bank with someone civil.\nIt's ur money. You should not have to deal with this.\nNo banks here have a problem with anyone talking on the phone.",
        "hmmm",
        "hmmmm",
        "By listening to his side of the story, and the problem is not who did wrong FIRST but whoever did THE WRONG. Hitting or abusing First or Second JUST NOT JUSTIFY RUDE BEHAVIOR.",
        "Sounds fair",
        "Is there a rule against not talking on the phone in the bank? I've never heard of this before.",
        "Security guard seems to be a maniac and have anger issues … such people end up murdering others if their anger gets the best of them.. try to get CCTV footage of the incident from the manager and take that to your local police station.",
        "Leave Bihar if possible. It has become a cesspool, I wonder why you even came back",
        "Yeah beat up a bank security man. Great idea.",
        "Why the hell did you call him “Sir” , this automatically gave him the position of power . You should have approached the bank manager then and there citing feeling threatened by the guard.",
        "Agreed. There are certain things where it’s completely okay to go berserk. These fuckers should be taught a lesson.",
        "Lost my dad 6 months ago, she lives alone,.every now and then I visit her, buy ration and groceries, do bank related works and go back. I hate people and here, cheap mentality and will never talk rationally. I'm sick of all these things tbh.",
        "Being disrespectful and cussing someone is not a mistake.",
        "are u male or female? if u are a female be extra careful and avoid that bank",
        "I would have beaten him up left n right",
        ">NCT of Delhi\n\nWhy dont you file police complaint? It's harassment and safety of life case.",
        "File a complain with rbi ombudsman",
        "Katte se uda de usko bro",
        "I find all government banks to be roughly same tbh.",
        "you are breraking rule bruhhh",
        "must have worked in a library before and now getting confused with the rules",
        "Stop using govt Banks",
        "Because Indians go out of control and will start talking loudly on the phone or playing loud music, especially in north and east India, that's why we have such absurd rules.",
        "Are you for real and who hurt you dude🤣",
        "If mistake is blasting off  & thrashing someone I hope so no one does it lol",
        "Close your bank account. I have seen this behaviour enough and society enough to finally understand that unless you are a badass and want to make revenge the sole purpose of your life it's better to abandon those who trouble you. Abandoning is possible because we are in a capitalistic economy. Vote with your wallets. Close account. If they behave this way with others too, then everyone will close their accounts and the branch will close. But it doesn't matter for you. You just abandon that bank",
        "That doesnt mean he can talk to others like that.",
        "Take to LinkedIn and Twitter. Back it with cctv footages from premises if possible",
        "Phones are not allowed in bank? I have heard this for the 1st time. Is this a new rule/law? Couldn't find much on quick google search. Can you please elaborate?",
        "I am surprised You took Rent-a-cop so seriously. I wouldn't have deigned to speak to him. Just tell the branch manager politely that you have no problem banking elsewhere.",
        "Oh! Okay! Never saw or noticed that yet. Thanks!",
        "Great to hear. One step at a time, we will ask for the respect we deserve. Strength to you !",
        "Ghanta bc kaisa lodu bank hai ye. Dhang k bank mai jao koi kuch ni bolta. Bada udhar cancer research chal rahi hai na, kya chutiyap promote Kiya ja raha hai.",
        "Same. First time hearing about this nonsense.",
        "Toh kya uske baap ka raaj chalega ab agar ex army hai toh. Army walo ka entitlement ki limit ni.",
        "Wait, wtf kind of a ass backwards rule is that? Why can’t you talk on a phone in a bank? I understand not using a phone in locker room but what’s the point of this rule? \n\nRegardless, no one has the right to be rude or aggressive. At best, the security guy can politely ask people breaking rules to step outside. There’s no world in which him getting loud or handsy is okay",
        "You could have called the police or a Gunda if you knew anyone. You don't let such people bully you. As a man you should have fought till the bank removed that idiot from his job. All are private folks, not employees. Create a scene such that bank manager would fallin your feet for forgiveness. This post says you are crying for help instead of fighting for your own rights.",
        "Sounds very fake, tbh",
        "Please let me know what made you come to this conclusion. I'd be happy to have your support on this issue. Unless a person is insane, would go to this length to gain what ?",
        "1st mistake don’t talk in English(use the language they used )  .2nd mistake don’t be friendly .3rd mistake don’t be a dom and call him sir . Since I have started following no one has ever talked to me like that . You had a full on confrontation and he saw you back out so he pounced on you more and start ignoring age fight is fight whether it’s a guy your age or person your grandparents age don’t back out especially in front of people like guards and worker who have code of conduct upon their head . Bank manager complaint or a full blown fight at the moment his job should have gone the minute he crossed the line when he tried to intimidate you .",
        "Hey, I am here for an update on this.",
        "Any update to this? Did CPGRAMS help at all",
        "Yes ! Surprisingly I received a prompt call back and email  from the  regional head office and branch manager respectively. The manager promised to get the guard changed. Nevertheless I chose to close all my accounts with that branch.",
        "Great to hear. All the best to you."
    ],
    "cleaned_text": "scared happened hey feel compelled share unsettling experience recently bank baroda branch garotia bhagalpur bihar visit bank mother urgent phone call interrupted wait utter shock security guard approached mother aggressive manner subjecting barrage derogatory language incident unfolded within bank premises full view customers leaving us deeply humiliated disturbed despite distress caused maintained composure decided address issue completing banking tasks approaching security guard calmly respectfully requested name urged refrain using offensive language especially dealing elderly customers stood seat charged baton couldnt believe would thing bcz asked name threatened put jail asking good behaviour even went bank followed outside baton kept saying tell name im kind scared even visit bank already sent complaint bank manager mail complained bank baroda grievance cell tbh life state think bank wont anything issue regardless id love opinions suggestions update im going step step rather jumping police station ive emailed branch manager detailed complaint ive registered complaint bank baroda grievance cell attached grievance number mail manager filed consumer complaint bank baroda cpgrams portal centralised public grievance redress monitoring system cpgrams online platform available citizens x lodge grievances public authorities subject related service delivery attached complaint number received cpgrams mail manager tried call customer care bank baroda says number invalid trying get hold personal number branch manager call specifically keep updated im gon na give one update lot people comments saying used hands faster settlement well guard must around years old hitting brings level id prefer day avoid unnecessary violence link twitter thread please help issue retweetlike ",
    "cleaned_title": "scared happened",
    "cleaned_selftext": "hey feel compelled share unsettling experience recently bank baroda branch garotia bhagalpur bihar visit bank mother urgent phone call interrupted wait utter shock security guard approached mother aggressive manner subjecting barrage derogatory language incident unfolded within bank premises full view customers leaving us deeply humiliated disturbed despite distress caused maintained composure decided address issue completing banking tasks approaching security guard calmly respectfully requested name urged refrain using offensive language especially dealing elderly customers stood seat charged baton couldnt believe would thing bcz asked name threatened put jail asking good behaviour even went bank followed outside baton kept saying tell name im kind scared even visit bank already sent complaint bank manager mail complained bank baroda grievance cell tbh life state think bank wont anything issue regardless id love opinions suggestions update im going step step rather jumping police station ive emailed branch manager detailed complaint ive registered complaint bank baroda grievance cell attached grievance number mail manager filed consumer complaint bank baroda cpgrams portal centralised public grievance redress monitoring system cpgrams online platform available citizens x lodge grievances public authorities subject related service delivery attached complaint number received cpgrams mail manager tried call customer care bank baroda says number invalid trying get hold personal number branch manager call specifically keep updated im gon na give one update lot people comments saying used hands faster settlement well guard must around years old hitting brings level id prefer day avoid unnecessary violence link twitter thread please help issue retweetlike",
    "cleaned_comments": "much text little detail actually happened bros preparing one complaint letters write school lol went local branch bank baroda bihar bhagalpur mum got call pick security guard saw shouted extremely rude embarassed felt angry done went guard please watch tongue old said tu hota kaun hai mujhe bolne wala said id like lodge complaint please tell name took baton ran towards threatened jail alone mother left without argument wanted share tbh im scared used living bihar first time saw something like sorry lengthy post gist matter well need tell branch manager essay say behaviour demeaning mother threatening keep simple keep tight three line paragraphs email first branch manager saying youd need replyapology within x days otherwise youll compelled escalate really sorry first post shortened post thank hope get one give us details well security guard actually saying idea saying things specifically ill try transcribe whole thing st part charged mum saying kya samajhti ho tum mana kiay hai na baat krne se bahar niklo abhi ke abhi baton hand literally ordering like peasant everyone watching mum said nothing ia sked go talk phone done bank went security guard nd part aapka name kya hai guard kya karoge name jaan kar sir ye meri maa hain aapke age ki hain aapko aise baat nahi karni chaiye inse guard got angry stood tu mujhe sikhayega kaise baat krte hain bahar nikal sir main bank ka customer hoon security job treat people gentle guard zyada bol mat sidhe jail le ke jaunga tu hai kaun sir please give name id like file complaint guard got angry jumped outside bank bike mother get us stop hitting aap customer ko maroge aap khud ko security bula rahe ho guard zyada bol mat warna sidhe jail le ke jaunga point alone mum shaking felt better talk someone sense arguing write detailed email head branch tldr op mother standing queue bank answered phone call security guard got angry talking phone guard used unparliamentary language aggressive op confronted politely wants report guard sounds unhinged hes low life security guard ensure complain manager local ombudsman ensure loses job complaint dont pressurise anyone kicked job hard everyone exactly hard everyone kick undeserving people make way others nah needs kicked job hes clearly suitable deserves every bit bad outcomes well hope never make mistake professional life scared happened dont scared seems guard abusive mum problem taking phone call onpremises would take gentle reminder turn phone vulgar language sake mum everyone else file complaint bank manager escalate necessary also post twitter social media tagging bank least mom deserves apology bank deserves better people much absolutely nothing uncivilised unparliamentary parliamentarians much crass write regionalzonal officer email available online also file complaint phone although isnt easy psu banks allowed take phone call inside bank india rbi circular prohibits file police complaint bro u pussy knock fuck simple yep anyone bad day especially customer facing roles try put argument everyone becomes god done nothing wrong thanks voice sanity wo guard tumhari maa se badtameezi se baat kar ke gaya aur tum uske pass gaye respectfully uska naam puchhne bade patient ho bhai gifgiphylhubtiloscdatxudownsized probably drunk visit bank meet manager say drunk smelling alcohol see tables turn made scene called police understand youre correct verify anybodys rude behavior like woman would defied continued something shouldve done something still abusing violence correct couldve made leave bank cone later made stand end line anything personally dont feel abusing hitting others approach anything wtf indian banks absurd rules like talking phone inside branch police complaint mail bank manager someone beat u nd ur loved ones mistake someday remember forgive dont think fighting like kids good approach handle properly get mf fired charged mum saying kya samajhti ho tum mana kiay hai na baat krne se bahar niklo abhi ke abhi mean thatdid warn mom beforehand according says warned mom talk phone previously yes go police depending state either file complaint pay sort guy complain regional office directly guard mostly contract definitely take action bihar way catch chooth way home work take fields actual fuck saying fuckkk mother fault talking phone allowed thats big guard inform charge op banks list numbers contact file complaintscall numbers till someone pick raise complaint assure take action least reprimand asshole thats exactly went asked politely say whatever wants polite manner imagine job requires patience charging customer asked ask nicely wanted better treatment behaviour dont think thats much ask youd read actual incident youd never comment nonsense go gym use anger right way months intentionally start fight fk complaining people would lead nowhere police complaint approaching women ngos much mess sentence makes much sense java javascript haha made chuckle jump mf gang go old school bihar nothing else work need write letters one bank manager one banking ombudsman similar thing happened years back pnb branch informing bank manager im going file complaint ombudsman got call chief circle manager expressed regrets wait minute cute even assume fight like kids somebody abusedisrespect mother mai guarantee se keh rha hu agar uss time guard ko tameez se samjha diya hota uski ya kisi aur ki himmat nahi hoti bolne ki tum ek baar aggressive aur dominant banke dekho abey guard hai wo sirf ek sahi baat kahi agree op conveniently leaving important details answering specific questions asked sus prohibited strictly enforced write banking ombudsman also vist branch someone cant bullied stand self request meeting branch manager file complaint banks complaint boxbook demand aplology guard anyways proceed chase complaint ombudsman feel bank employees use condesending tone record conversation proof let bank managers senior ombudsman know recording good chance ex serviceman ex army please allow answer whatever doubtsquestions may app banks future write complaints police helpful placeand bank authorities also raise across social media kind banking customers money need learn lessons train staff really sorry hear hope get soon guard shout bank baroda one shittiest banks move account im going step step rather jumping police station ive emailed branch manager detailed complaint ive registered complaint bank baroda grievance cell attached grievance number mail manager filed consumer complaint bank baroda cpgrams portal centralised public grievance redress monitoring system cpgrams online platform available citizens x lodge grievances public authorities subject related service delivery attached complaint number received cpgrams mail manager tried call customer care bank baroda says number invalid trying get hold personal number branch manager call specifically keep updated im gon na give one write much explain nothing tania sachdev per guard kid teach talk complain aukat thats could make anger contradictory wants talk politely time refuses really sorry first time reddit posting something ive changed post done necessary editsomitted bogus things ive explained issue pointwise comments also apologise issue mistake threaten violence fit job qualifications better suited dog catching lol saw twitter thread bank says issue resolved without actually anything op advice tag hell lot govt officials well bihar police city police go twitter account tag govt ask women elderly safe also close account bank someone civil ur money deal banks problem anyone talking phone hmmm hmmmm listening side story problem wrong first whoever wrong hitting abusing first second justify rude behavior sounds fair rule talking phone bank ive never heard security guard seems maniac anger issues people end murdering others anger gets best try get cctv footage incident manager take local police station leave bihar possible become cesspool wonder even came back yeah beat bank security man great idea hell call sir automatically gave position power approached bank manager citing feeling threatened guard agreed certain things completely okay go berserk fuckers taught lesson lost dad months ago lives aloneevery visit buy ration groceries bank related works go back hate people cheap mentality never talk rationally im sick things tbh disrespectful cussing someone mistake u male female u female extra careful avoid bank would beaten left n right nct delhi dont file police complaint harassment safety life case file complain rbi ombudsman katte se uda de usko bro find government banks roughly tbh breraking rule bruhhh must worked library getting confused rules stop using govt banks indians go control start talking loudly phone playing loud music especially north east india thats absurd rules real hurt dude mistake blasting thrashing someone hope one lol close bank account seen behaviour enough society enough finally understand unless badass want make revenge sole purpose life better abandon trouble abandoning possible capitalistic economy vote wallets close account behave way others everyone close accounts branch close doesnt matter abandon bank doesnt mean talk others like take linkedin twitter back cctv footages premises possible phones allowed bank heard st time new rulelaw couldnt find much quick google search please elaborate surprised took rentacop seriously wouldnt deigned speak tell branch manager politely problem banking elsewhere oh okay never saw noticed yet thanks great hear one step time ask respect deserve strength ghanta bc kaisa lodu bank hai ye dhang k bank mai jao koi kuch ni bolta bada udhar cancer research chal rahi hai na kya chutiyap promote kiya ja raha hai first time hearing nonsense toh kya uske baap ka raaj chalega ab agar ex army hai toh army walo ka entitlement ki limit ni wait wtf kind ass backwards rule cant talk phone bank understand using phone locker room whats point rule regardless one right rude aggressive best security guy politely ask people breaking rules step outside theres world getting loud handsy okay could called police gunda knew anyone dont let people bully man fought till bank removed idiot job private folks employees create scene bank manager would fallin feet forgiveness post says crying help instead fighting rights sounds fake tbh please let know made come conclusion id happy support issue unless person insane would go length gain st mistake dont talk englishuse language used nd mistake dont friendly rd mistake dont dom call sir since started following one ever talked like full confrontation saw back pounced start ignoring age fight fight whether guy age person grandparents age dont back especially front people like guards worker code conduct upon head bank manager complaint full blown fight moment job gone minute crossed line tried intimidate hey update update cpgrams help yes surprisingly received prompt call back email regional head office branch manager respectively manager promised get guard changed nevertheless chose close accounts branch great hear best",
    "light_cleaned_title": "I am scared for what happened",
    "light_cleaned_selftext": "Hey there, I feel compelled to share an unsettling experience I recently had at the Bank of Baroda branch in Garotia, Bhagalpur, Bihar During a visit to the bank with my mother, an urgent phone call interrupted our wait. To our utter shock, a security guard approached my mother in an aggressive manner, subjecting her to a barrage of derogatory language. The incident unfolded within the bank premises, in full view of other customers, leaving us both deeply humiliated and disturbed. Despite the distress caused, we maintained composure and decided to address the issue after completing our banking tasks. Approaching the security guard calmly and respectfully, I requested his name and urged him to refrain from using offensive language, especially when dealing with elderly customers. To this he stood up from his seat and charged at me with his baton - I couldn't believe that he would do such thing just bcz I asked for his name ! He threatened me with \"I will put you in jail\" (for what ? Asking for good behaviour ? ) Even when I went out of the bank, he followed me outside with his baton, and kept saying - \"tell me your name, where you are from\". I'm kind of scared to even visit my own bank, I have already sent complaint to bank manager in mail, have complained on Bank of Baroda Grievance cell. Tbh I being most of my life out of this state - I think Bank won't do anything about this issue. Regardless I'd love to have your opinions and suggestions on what should I do. UPDATE I'm going step by step, rather than jumping to police station. 1. I've emailed branch manager a detailed complaint 2. I've registered my complaint on Bank of Baroda Grievance cell (have attached my grievance number to the mail to manager) 3. Filed a consumer complaint against Bank of Baroda on CPGRAMS portal. (Centralised Public Grievance Redress and Monitoring System (CPGRAMS) is an online platform available to the citizens 24x7 to lodge their grievances to the public authorities on any subject related to service delivery.) Have attached complaint number received from CPGRAMS in mail to Manager too. 4. I tried to call customer care of Bank of Baroda too ( +91 1800 5700) - it says number is invalid. 5. I am trying to get hold of personal number of Branch Manager to call him specifically. Will keep you all updated. I'm not gonna give this one up. Update - A lot of people in comments are saying that I should have used my hands for faster settlement 🙂. Well that guard must be around 50+ years old and me hitting him brings me down to his level. I'd prefer any day to avoid unnecessary violence. Link to Twitter thread - Please help me with this issue - retweet/like ✨",
    "light_cleaned_comments": "So much text ….so little detail on what actually happened! Bro’s preparing for one of those complaint letters we had to write in school lol. Went to a local branch of bank of baroda in Bihar (Bhagalpur). Mum got a call, she had to pick up. Security guard saw her and shouted at her being extremely rude, she was embarassed, while I felt angry. After I was done - I went to the guard - \"please watch your tongue, she is as old as you\". To which he said - \"tu hota kaun hai mujhe bolne wala\". I said \"I'd like to lodge a complaint, please tell me your name\". To this - he took out his baton and ran towards me and threatened me with jail. I was alone with my mother, I left without any more argument and just wanted to share this. Tbh I'm scared - not used to living in Bihar - this was first time I saw something like this. I am sorry for lengthy post. This is the gist of the matter. Well this is what you need to tell the branch manager. Not an essay! Say how his behaviour has been demeaning to your mother and threatening to you. Keep it simple and keep it tight. No more than three 2-3 line paragraphs. Email it first to the branch manager saying that you’d need a reply/apology within x days otherwise you’ll be compelled to escalate. Am really sorry, this was my first post, I have shortened the post. Thank you. I hope I get one Give us more details as well. What was the security guard actually saying? Do you have any idea why he was saying those things specifically to you? I'll try to transcribe the whole thing - 1st part He charged at my mum saying - \"kya samajhti ho tum, mana kiay hai na baat krne se, bahar niklo abhi ke abhi\" while he was with his baton in his hand - literally ordering her like a peasant while everyone was watching. My mum said nothing, Ia sked her to go out and not talk on phone. After we were done in bank - I went to the security guard - 2nd part --- Me - Aapka name kya hai Guard - Kya karoge name Jaan kar Me - Sir, ye meri maa hain, aapke age ki Hain, aapko aise baat nahi karni chaiye inse Guard - (Got angry, stood up) Tu mujhe sikhayega kaise baat krte Hain, bahar nikal Me - Sir, main is bank ka customer hoon, as security it's your job to treat people gentle Guard - Zyada bol mat, sidhe jail le ke jaunga, tu hai kaun Me - Sir, please give me your name, I'd like to file a complaint Guard - Got angry and jumped at me while I was outside bank, on my bike, my mother had to get between us to stop him from hitting me. Me - Aap customer ko maroge ? Aap khud ko security bula rahe ho ! Guard - Zyada bol mat, warna sidhe jail le ke jaunga. To this point - I being alone and with my mum shaking, I felt it was better to talk to someone with some sense than arguing more with him. Write a detailed email to the head branch TLDR: OP mother standing in queue in bank, answered a phone call, security guard got angry that she is talking on phone (?), guard used unparliamentary language while being aggressive, OP confronted politely but wants to report it. The guard sounds unhinged. He’s just a low life security guard. Ensure you complain to the manager and your local ombudsman. Ensure he loses his job too. Complaint but don’t pressurise for anyone to be kicked out of a job. It’s hard for everyone Exactly, it's hard for everyone. So we should kick such undeserving people to make way for others. Nah he needs to be kicked out of his job. He's clearly not suitable for it. Deserves every bit of the bad outcomes. Well I hope you never make a mistake in your professional life then! >I am scared for what happened Don't be scared. It seems that the guard was both abusive to your mum and yourself. If there was a problem with taking a phone call on-premises, all it would take is a gentle reminder to turn off your phone, not vulgar language. For the sake of yourself, your mum and everyone else, file a complaint with the bank manager and escalate, if necessary. Also post on Twitter and social media while tagging the bank. At the very least, your mom deserves an apology. And the bank deserves better people. So much of absolutely nothing It’s uncivilised not unparliamentary. Our parliamentarians are much more crass. Write to regional/zonal officer, their email should be available online. Also file a complaint over phone (although that isn't easy to do for PSU banks) Is it not allowed to take a phone call inside a bank in India ? Is there a RBI circular which prohibits this ? File a police complaint Bro are u pussy Knock the fuck out of him simple Yep! Anyone can have a bad day especially in customer facing roles. But try and put that argument through and everyone becomes a god who has done nothing wrong! Thanks for being the voice of sanity here Wo guard tumhari maa se badtameezi se baat kar ke gaya aur tum uske pass gaye respectfully uska naam puchhne ? bade patient ho bhai ![gif](giphy|l0HUbtILos6CdAtxu|downsized) Was probably drunk. Visit the bank again to meet the manager and say he was drunk and was smelling of alcohol. See how tables will turn Should have made scene there and called the police. I understand it, and you’re correct, but this does not verify anybody’s rude behavior. Like if that woman would have defied her and continued to do something than he should’ve done something. Still abusing and violence is not correct. He could’ve made them to leave the bank and cone later or made them stand at the end of the line, or anything. I personally don’t feel abusing and hitting others should be approach to anything. Wtf! Why do Indian banks have such absurd rules like no talking on phone inside the branch?! You should do a police complaint. Not just mail to bank manager. Someone will beat u nd ur loved ones by mistake someday. Remember to forgive them for that! I don't think fighting like kids is a good approach. He can handle it properly and get the mf fired >> He charged at my mum saying - \"kya samajhti ho tum, mana kiay hai na baat krne se, bahar niklo abhi ke abhi\" What do you mean by that?Did he warn your mom beforehand because according to you he says that he warned your mom to not talk on the phone previously. Yes. Go to police and depending on state either file a complaint or pay them to sort the guy out. Complain to the regional office directly. The guard is mostly on contract. They will definitely take some action against him. Do it the Bihar way, catch that chooth on his way home after work and take him to the fields. What the actual fuck are you saying??? How the fuckkk is he or his mother at fault??? If talking on phone is not allowed (thats a big if) the guard should inform them.. not charge at them. OP all the banks have a list of numbers you can contact to file complaints..call all the numbers till someone pick up and raise your complaint.. i can assure you they will take action. At the very least they will reprimand the asshole. That's exactly why I went to him \"asked politely\" to say whatever he wants in \"polite manner\". Imagine being on a job which requires patience and then charging on to customer because they asked you to ask nicely? I wanted just a better treatment of behaviour. I don't think that's much of an ask. If you’d have read the actual incident then you’d never comment the nonsense that you did. Go to the gym. Use the anger the right way. After a few months, Intentionally start a fight with him. F##k him up there. You complaining to him to his own people would lead to nowhere. Police complaint, approaching women NGOs are too much of a mess. Your sentence makes as much sense as Java with Javascript Haha made me chuckle Jump on this MF with your gang, go old school in Bihar, nothing else will work You need to write 2 letters. One to the bank manager and one to the banking ombudsman. Similar thing happened to me a few years back in a PNB branch. After informing the bank manager that I'm going to file a complaint with the ombudsman, I got a call from the chief circle manager who expressed his regrets. wait a minute ....... Cute of you to even assume I will fight like Kids after somebody abuse/disrespect my mother . Mai guarantee se keh rha hu agar uss time guard ko tameez se samjha diya hota , uski ya kisi aur ki himmat nahi hoti bolne ki . Tum ek baar aggressive aur dominant banke to dekho . Abey guard hai wo sirf ek Sahi baat kahi 👏I agree 101% OP conveniently leaving the important details and answering specific questions only when asked. Sus It is prohibited but not strictly enforced. Write to the banking ombudsman , also vist the branch with someone who cant be bullied and stand up for their self then request a meeting with the branch manager and file a complaint in the banks complaint box/book. Demand an aplology from the guard and then anyways proceed to chase the complaint with the ombudsman . If you feel the bank employees will use a condesending tone with you record the conversation for proof let the bank managers senior and the ombudsman know about the recording. There is good chance he is an ex serviceman (ex army) Please allow me to answer whatever doubts/questions you may have. This is why app banks are the future Write complaints (to police (are they at all helpful in your place?)and bank authorities) also raise this across social media. These kind of banking (where customer's money is all they have) need to learn lessons and train staff. I am really sorry to hear this, hope you will get over this soon. Why did the guard shout on you? What did you do? Bank of Baroda is one of the shittiest banks. Move the account. I'm going step by step, rather than jumping to police station. 1. I've emailed branch manager a detailed complaint 2. I've registered my complaint on Bank of Baroda Grievance cell (have attached my grievance number to the mail to manager) 3. Filed a consumer complaint against Bank of Baroda on CPGRAMS portal. (Centralised Public Grievance Redress and Monitoring System (CPGRAMS) is an online platform available to the citizens 24x7 to lodge their grievances to the public authorities on any subject related to service delivery.) Have attached complaint number received from CPGRAMS in mail to Manager too. 4. I tried to call customer care of Bank of Baroda too ( +91 1800 5700) - it says number is invalid. 5. I am trying to get hold of personal number of Branch Manager to call him specifically. Will keep you all updated. I'm not gonna give this one up. How can you write so much and explain nothing? Are you Tania Sachdev? As per guard - 1. How can I (a kid for him) teach him \"how to talk\" 2. How can I complain against him ? (What is my aukat) That's what I could make of his anger This is contradictory in itself - He wants me to talk to him politely at the same time he refuses to do so. 👁️ Really sorry, this is my first time on reddit posting something. I've changed my post/ have done necessary edits/omitted bogus things. I've explained issue pointwise in comments also. I apologise for any issue. It is not a mistake to threaten violence. He is not fit for the job, his qualifications are better suited to dog catching. Lol just saw the Twitter thread and bank says the issue is resolved without actually doing anything. OP advice you to tag a hell lot of govt officials here as well as Bihar police and your city police if they go a Twitter account Tag govt and ask are women and elderly not safe Also close the account. Bank with someone civil. It's ur money. You should not have to deal with this. No banks here have a problem with anyone talking on the phone. hmmm hmmmm By listening to his side of the story, and the problem is not who did wrong FIRST but whoever did THE WRONG. Hitting or abusing First or Second JUST NOT JUSTIFY RUDE BEHAVIOR. Sounds fair Is there a rule against not talking on the phone in the bank? I've never heard of this before. Security guard seems to be a maniac and have anger issues … such people end up murdering others if their anger gets the best of them.. try to get CCTV footage of the incident from the manager and take that to your local police station. Leave Bihar if possible. It has become a cesspool, I wonder why you even came back Yeah beat up a bank security man. Great idea. Why the hell did you call him “Sir” , this automatically gave him the position of power . You should have approached the bank manager then and there citing feeling threatened by the guard. Agreed. There are certain things where it’s completely okay to go berserk. These fuckers should be taught a lesson. Lost my dad 6 months ago, she lives alone,.every now and then I visit her, buy ration and groceries, do bank related works and go back. I hate people and here, cheap mentality and will never talk rationally. I'm sick of all these things tbh. Being disrespectful and cussing someone is not a mistake. are u male or female? if u are a female be extra careful and avoid that bank I would have beaten him up left n right >NCT of Delhi Why dont you file police complaint? It's harassment and safety of life case. File a complain with rbi ombudsman Katte se uda de usko bro I find all government banks to be roughly same tbh. you are breraking rule bruhhh must have worked in a library before and now getting confused with the rules Stop using govt Banks Because Indians go out of control and will start talking loudly on the phone or playing loud music, especially in north and east India, that's why we have such absurd rules. Are you for real and who hurt you dude🤣 If mistake is blasting off & thrashing someone I hope so no one does it lol Close your bank account. I have seen this behaviour enough and society enough to finally understand that unless you are a badass and want to make revenge the sole purpose of your life it's better to abandon those who trouble you. Abandoning is possible because we are in a capitalistic economy. Vote with your wallets. Close account. If they behave this way with others too, then everyone will close their accounts and the branch will close. But it doesn't matter for you. You just abandon that bank That doesnt mean he can talk to others like that. Take to LinkedIn and Twitter. Back it with cctv footages from premises if possible Phones are not allowed in bank? I have heard this for the 1st time. Is this a new rule/law? Couldn't find much on quick google search. Can you please elaborate? I am surprised You took Rent-a-cop so seriously. I wouldn't have deigned to speak to him. Just tell the branch manager politely that you have no problem banking elsewhere. Oh! Okay! Never saw or noticed that yet. Thanks! Great to hear. One step at a time, we will ask for the respect we deserve. Strength to you ! Ghanta bc kaisa lodu bank hai ye. Dhang k bank mai jao koi kuch ni bolta. Bada udhar cancer research chal rahi hai na, kya chutiyap promote Kiya ja raha hai. Same. First time hearing about this nonsense. Toh kya uske baap ka raaj chalega ab agar ex army hai toh. Army walo ka entitlement ki limit ni. Wait, wtf kind of a ass backwards rule is that? Why can’t you talk on a phone in a bank? I understand not using a phone in locker room but what’s the point of this rule? Regardless, no one has the right to be rude or aggressive. At best, the security guy can politely ask people breaking rules to step outside. There’s no world in which him getting loud or handsy is okay You could have called the police or a Gunda if you knew anyone. You don't let such people bully you. As a man you should have fought till the bank removed that idiot from his job. All are private folks, not employees. Create a scene such that bank manager would fallin your feet for forgiveness. This post says you are crying for help instead of fighting for your own rights. Sounds very fake, tbh Please let me know what made you come to this conclusion. I'd be happy to have your support on this issue. Unless a person is insane, would go to this length to gain what ? 1st mistake don’t talk in English(use the language they used ) .2nd mistake don’t be friendly .3rd mistake don’t be a dom and call him sir . Since I have started following no one has ever talked to me like that . You had a full on confrontation and he saw you back out so he pounced on you more and start ignoring age fight is fight whether it’s a guy your age or person your grandparents age don’t back out especially in front of people like guards and worker who have code of conduct upon their head . Bank manager complaint or a full blown fight at the moment his job should have gone the minute he crossed the line when he tried to intimidate you . Hey, I am here for an update on this. Any update to this? Did CPGRAMS help at all Yes ! Surprisingly I received a prompt call back and email from the regional head office and branch manager respectively. The manager promised to get the guard changed. Nevertheless I chose to close all my accounts with that branch. Great to hear. All the best to you."
}