{
    "id": "16kqea1",
    "title": "Recent updates regarding Aadhaar",
    "url": "https://www.reddit.com/r/india/comments/16kqea1/recent_updates_regarding_aadhaar/",
    "selftext": "***Latest on top***\n\n#Indian Today\n##Sep 14, 2023\n###[Birth certificate can soon be used to apply for Aadhaar, driving license, more}(https://www.indiatoday.in/india/story/birth-certificate-to-be-single-document-for-various-services-from-october-1-after-registration-of-births-and-deaths-amendment-act-2023-2435771-2023-09-14)\n>A new amended law will facilitate the use of a birth certificate as a single document for a host of works and services like admission to educational institutes, issuance of driving licences, applying for an Aadhaar Card or a passport and registration of marriage and will come into effect from October 1.\n\n\n#Indian Express\n##August 8, 2023\n###[Registration of Births & Deaths (Amendment) Bill passed in RS](https://indianexpress.com/article/india/registration-of-births-deaths-amendment-bill-passed-in-rs-8881518/)\n>Rajya Sabha on Monday passed a Bill that allows the use of a birth certificate as a single document for admission to an educational institution, issuance of a driving licence, preparation of voter list, Aadhaar number, registration of marriage or appointment to a government job.\n\n#Indian Express\n##August 1, 2023\n###[Lok Sabha passes Registration of Births and Deaths Bill by voice vote amid Oppn din](https://indianexpress.com/article/india/lok-sabha-passes-registration-of-births-and-deaths-bill-voice-vote-8871344/)\n>The Registration of Births and Deaths (Amendment) Bill makes provisions for digital registration and electronic delivery of certificates of births and deaths for the benefit of public at large.\n\n>It also aims to create a national and state-level database of registered births and deaths, which would help in updating other databases resulting in efficient and transparent delivery of public services and social benefits. It also makes provisions for collection of Aadhaar numbers of parents and informants, if available, in case of birth registration.\n\n#PRS Legislative Research\n## July 26, 2023\n[Bill Summary - \nThe Registration of Births and Deaths (Amendment) Bill,\n2023](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bill_Summary_Registration_of_Births_and_Deaths_(Amendment)_Bill_2023.pdf)\n>Connecting database: The Bill states that the \nnational database may be made available to other \nauthorities preparing or maintaining other \ndatabases. Such databases include: (i) population \nregister, (ii) electoral rolls, (iii) ration card, and \n(iv) any other national databases as notified. The \nuse of the national database must be approved by \nthe central government. Similarly, the state \ndatabase may be made available to authorities \ndealing with other state databases, subject to. \nstate government’s approval.\n\n>Use of birth certificate: The Bill requires the use \nof birth and death certificates to prove the date \nand place of birth for persons born on or after this\nBill comes into effect. The information will be \nused for purposes including: (i) admission to an \neducational institution, (ii) preparation of voter \nlist, (iii) appointment to a government post, and \n(iv) any other purpose determined by the central \ngovernment.\n\n#Economic Times\n##Apr 26, 2023\n[Aadhaar vetting by private entities against Supreme Court ruling: Experts](https://economictimes.indiatimes.com/tech/technology/aadhaar-vetting-by-private-entities-against-supreme-court-ruling-experts/articleshow/99769150.cms)\n>Former Supreme Court judge BN Srikrishna told ET: “The Supreme Court has already examined this aspect. It says it should not be done (allowing private entities to perform Aadhaar authentication). Now the government cannot issue a rule and overcome the Supreme Court judgement. Supreme Court judgement can only be overcome in a proper parliamentary enactment, if passed.”\n\n>The government cannot overcome the Supreme Court judgement by amending the IT rules, said Srikrishna, who headed a ten-member committee that released the first draft of the Personal Data Protection Bill in 2018.\n\n>“The SC has said private entities cannot perform Aadhaar authentication. No number of amendments to the IT Rules will help it. They will have to pass a special Act or amend the IT Act itself. That is the only way it can be done, otherwise it cannot be done,” he explained.\n\n#Indian Express\n##September 26, 2018\n###[Full text: Supreme Court Aadhaar judgment](https://indianexpress.com/article/india/aadhaar-verdict-full-text-judgment-supreme-court-order-5374794/)\nRead [full judgement](https://www.scribd.com/document/389491704/Supreme-Court-Aadhaar-Verdict) on Scribd",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694921495.0,
    "convurl": "https://external-preview.redd.it/nRMO53YXGwOlUQJzTrf3HIm0ZppCxW4f52KoHufGUpo.jpg",
    "comments": [],
    "cleaned_text": "recent updates regarding aadhaar latest top indian today sep birth certificate soon used apply aadhaar driving license morehttpswwwindiatodayinindiastorybirthcertificatetobesingledocumentforvariousservicesfromoctoberafterregistrationofbirthsanddeathsamendmentact new amended law facilitate use birth certificate single document host works services like admission educational institutes issuance driving licences applying aadhaar card passport registration marriage come effect october indian express august registration births deaths amendment bill passed rshttpsindianexpresscomarticleindiaregistrationofbirthsdeathsamendmentbillpassedinrs rajya sabha monday passed bill allows use birth certificate single document admission educational institution issuance driving licence preparation voter list aadhaar number registration marriage appointment government job indian express august lok sabha passes registration births deaths bill voice vote amid oppn dinhttpsindianexpresscomarticleindialoksabhapassesregistrationofbirthsanddeathsbillvoicevote registration births deaths amendment bill makes provisions digital registration electronic delivery certificates births deaths benefit public large also aims create national statelevel database registered births deaths would help updating databases resulting efficient transparent delivery public services social benefits also makes provisions collection aadhaar numbers parents informants available case birth registration prs legislative research july bill summary registration births deaths amendment bill httpsprsindiaorgfilesbillsactsbillsparliamentbillsummaryregistrationofbirthsanddeathsamendmentbillpdf connecting database bill states national database may made available authorities preparing maintaining databases databases include population register ii electoral rolls iii ration card iv national databases notified use national database must approved central government similarly state database may made available authorities dealing state databases subject state governments approval use birth certificate bill requires use birth death certificates prove date place birth persons born bill comes effect information used purposes including admission educational institution ii preparation voter list iii appointment government post iv purpose determined central government economic times apr aadhaar vetting private entities supreme court ruling expertshttpseconomictimesindiatimescomtechtechnologyaadhaarvettingbyprivateentitiesagainstsupremecourtrulingexpertsarticleshowcms former supreme court judge bn srikrishna told et supreme court already examined aspect says done allowing private entities perform aadhaar authentication government issue rule overcome supreme court judgement supreme court judgement overcome proper parliamentary enactment passed government overcome supreme court judgement amending rules said srikrishna headed tenmember committee released first draft personal data protection bill sc said private entities perform aadhaar authentication number amendments rules help pass special act amend act way done otherwise done explained indian express september full text supreme court aadhaar judgmenthttpsindianexpresscomarticleindiaaadhaarverdictfulltextjudgmentsupremecourtorder read full judgementhttpswwwscribdcomdocumentsupremecourtaadhaarverdict scribd ",
    "cleaned_title": "recent updates regarding aadhaar",
    "cleaned_selftext": "latest top indian today sep birth certificate soon used apply aadhaar driving license morehttpswwwindiatodayinindiastorybirthcertificatetobesingledocumentforvariousservicesfromoctoberafterregistrationofbirthsanddeathsamendmentact new amended law facilitate use birth certificate single document host works services like admission educational institutes issuance driving licences applying aadhaar card passport registration marriage come effect october indian express august registration births deaths amendment bill passed rshttpsindianexpresscomarticleindiaregistrationofbirthsdeathsamendmentbillpassedinrs rajya sabha monday passed bill allows use birth certificate single document admission educational institution issuance driving licence preparation voter list aadhaar number registration marriage appointment government job indian express august lok sabha passes registration births deaths bill voice vote amid oppn dinhttpsindianexpresscomarticleindialoksabhapassesregistrationofbirthsanddeathsbillvoicevote registration births deaths amendment bill makes provisions digital registration electronic delivery certificates births deaths benefit public large also aims create national statelevel database registered births deaths would help updating databases resulting efficient transparent delivery public services social benefits also makes provisions collection aadhaar numbers parents informants available case birth registration prs legislative research july bill summary registration births deaths amendment bill httpsprsindiaorgfilesbillsactsbillsparliamentbillsummaryregistrationofbirthsanddeathsamendmentbillpdf connecting database bill states national database may made available authorities preparing maintaining databases databases include population register ii electoral rolls iii ration card iv national databases notified use national database must approved central government similarly state database may made available authorities dealing state databases subject state governments approval use birth certificate bill requires use birth death certificates prove date place birth persons born bill comes effect information used purposes including admission educational institution ii preparation voter list iii appointment government post iv purpose determined central government economic times apr aadhaar vetting private entities supreme court ruling expertshttpseconomictimesindiatimescomtechtechnologyaadhaarvettingbyprivateentitiesagainstsupremecourtrulingexpertsarticleshowcms former supreme court judge bn srikrishna told et supreme court already examined aspect says done allowing private entities perform aadhaar authentication government issue rule overcome supreme court judgement supreme court judgement overcome proper parliamentary enactment passed government overcome supreme court judgement amending rules said srikrishna headed tenmember committee released first draft personal data protection bill sc said private entities perform aadhaar authentication number amendments rules help pass special act amend act way done otherwise done explained indian express september full text supreme court aadhaar judgmenthttpsindianexpresscomarticleindiaaadhaarverdictfulltextjudgmentsupremecourtorder read full judgementhttpswwwscribdcomdocumentsupremecourtaadhaarverdict scribd",
    "cleaned_comments": "",
    "light_cleaned_title": "Recent updates regarding Aadhaar",
    "light_cleaned_selftext": "***Latest on top*** #Indian Today ##Sep 14, 2023 ###[Birth certificate can soon be used to apply for Aadhaar, driving license, more}(https://www.indiatoday.in/india/story/birth-certificate-to-be-single-document-for-various-services-from-october-1-after-registration-of-births-and-deaths-amendment-act-2023-2435771-2023-09-14) >A new amended law will facilitate the use of a birth certificate as a single document for a host of works and services like admission to educational institutes, issuance of driving licences, applying for an Aadhaar Card or a passport and registration of marriage and will come into effect from October 1. #Indian Express ##August 8, 2023 ###[Registration of Births & Deaths (Amendment) Bill passed in RS](https://indianexpress.com/article/india/registration-of-births-deaths-amendment-bill-passed-in-rs-8881518/) >Rajya Sabha on Monday passed a Bill that allows the use of a birth certificate as a single document for admission to an educational institution, issuance of a driving licence, preparation of voter list, Aadhaar number, registration of marriage or appointment to a government job. #Indian Express ##August 1, 2023 ###[Lok Sabha passes Registration of Births and Deaths Bill by voice vote amid Oppn din](https://indianexpress.com/article/india/lok-sabha-passes-registration-of-births-and-deaths-bill-voice-vote-8871344/) >The Registration of Births and Deaths (Amendment) Bill makes provisions for digital registration and electronic delivery of certificates of births and deaths for the benefit of public at large. >It also aims to create a national and state-level database of registered births and deaths, which would help in updating other databases resulting in efficient and transparent delivery of public services and social benefits. It also makes provisions for collection of Aadhaar numbers of parents and informants, if available, in case of birth registration. #PRS Legislative Research ## July 26, 2023 [Bill Summary - The Registration of Births and Deaths (Amendment) Bill, 2023](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bill_Summary_Registration_of_Births_and_Deaths_(Amendment)_Bill_2023.pdf) >Connecting database: The Bill states that the national database may be made available to other authorities preparing or maintaining other databases. Such databases include: (i) population register, (ii) electoral rolls, (iii) ration card, and (iv) any other national databases as notified. The use of the national database must be approved by the central government. Similarly, the state database may be made available to authorities dealing with other state databases, subject to. state government’s approval. >Use of birth certificate: The Bill requires the use of birth and death certificates to prove the date and place of birth for persons born on or after this Bill comes into effect. The information will be used for purposes including: (i) admission to an educational institution, (ii) preparation of voter list, (iii) appointment to a government post, and (iv) any other purpose determined by the central government. #Economic Times ##Apr 26, 2023 [Aadhaar vetting by private entities against Supreme Court ruling: Experts](https://economictimes.indiatimes.com/tech/technology/aadhaar-vetting-by-private-entities-against-supreme-court-ruling-experts/articleshow/99769150.cms) >Former Supreme Court judge BN Srikrishna told ET: “The Supreme Court has already examined this aspect. It says it should not be done (allowing private entities to perform Aadhaar authentication). Now the government cannot issue a rule and overcome the Supreme Court judgement. Supreme Court judgement can only be overcome in a proper parliamentary enactment, if passed.” >The government cannot overcome the Supreme Court judgement by amending the IT rules, said Srikrishna, who headed a ten-member committee that released the first draft of the Personal Data Protection Bill in 2018. >“The SC has said private entities cannot perform Aadhaar authentication. No number of amendments to the IT Rules will help it. They will have to pass a special Act or amend the IT Act itself. That is the only way it can be done, otherwise it cannot be done,” he explained. #Indian Express ##September 26, 2018 ###[Full text: Supreme Court Aadhaar judgment](https://indianexpress.com/article/india/aadhaar-verdict-full-text-judgment-supreme-court-order-5374794/) Read [full judgement](https://www.scribd.com/document/389491704/Supreme-Court-Aadhaar-Verdict) on Scribd",
    "light_cleaned_comments": ""
}