{
    "id": "14hgrld",
    "title": "Patna Oppn meeting off to a good start, parties resolve to contest together, set date for next talks",
    "url": "https://indianexpress.com/article/political-pulse/patna-oppn-meeting-good-start-parties-resolve-to-contest-together-8682787/",
    "selftext": "AAP's pressure on Congress over ordinance only blip; Nitish Kumar says seat-sharing to be taken up at Shimla meeting in July",
    "flair": "Politics",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1687573084.0,
    "convurl": "https://external-preview.redd.it/GZ4Tg79eH-PVf4nS4MkNo5IOilE0EsRhZnnoI_yvtTs.jpg?auto=webp&v=enabled&s=e1c2ba7165b875f4e5aa06ae635ecbaf8d57eec9",
    "comments": [
        ">The one sour note in the cordial exchange was a tiff between Congress president Mallikarjun Kharge and Aam Aadmi Party supremo Arvind Kejriwal over the latter’s insistence that the Congress clarify its stand on a Delhi ordinance passed by the Centre. Sources said Kharge stuck to his guns, and had the support of most parties on the matter.\n\n>All the 32 leaders from the 15 parties present backed unity to take on the BJP in the 2024 Lok Sabha elections. Sources said JD(U) supremo and Bihar Chief Minister Nitish, who put together the meeting, told the leaders that many more smaller parties — at least 10 in his estimation — will join the Opposition camp closer to the 2024 elections.\n\n>During the talks, sources said, Pawar suggested a joint statement before the media, but the AAP-Congress tiff perhaps prompted the leaders to shelve the idea. The Left parties suggested drawing up a common minimum programme, but there were not many takers.\n\n>The elephant in the room was clearly the issue of seat-sharing and seat adjustments. Sources said RJD chief Lalu Prasad told the Congress that it should show large heartedness, and that the biggest party in every state should lead the fight in that state, with the others extending support and cooperation. Mamata agreed with this, adding that the Congress could count on the support of other parties in states where it is formidable.\n\n>Sources said Congress leaders Kharge and Rahul sought to set the right tone by letting other leaders speak first. “Nitish spoke first. When the Congress was asked to speak… Kharge said since the Congress is the largest party, it will speak last and listen to everybody first,” a leader said.Lalu appreciated the Congress’s gesture.\n\n>There was consensus that issues like a policy document and seat adjustments can be taken up in subsequent meetings.\n\n>While he lost no time distancing himself from the gathering as soon as it got over, during the talks, Kejriwal suggested that parties “nurture a bond of unity” and strive to ensure one-on-one contests against the BJP. He is learnt to have also suggested that parties put on hold plans for expansion in newer territories till the Lok Sabha elections.\n\n>He (Kharge) said while the party would not support anything that is “anti-Constitutional”, it would take a position after internal discussions, and in time for the next Parliament session, where the ordinance will come up for ratification\n\n>As Kejriwal pressed on, PDP chief Mehbooba Mufti reminded the AAP of its vociferous support to the Centre’s move to abrogate Article 370 and bifurcate J&K into two Union territories, unlike the other Opposition parties.\n\n>DMK chief and Tamil Nadu CM M K Stalin favoured different tactics and strategies for different states, when it comes to seat-sharing. He said ideas like common candidates can be explored."
    ],
    "cleaned_text": "patna oppn meeting good start parties resolve contest together set date next talks aaps pressure congress ordinance blip nitish kumar says seatsharing taken shimla meeting july ",
    "cleaned_title": "patna oppn meeting good start parties resolve contest together set date next talks",
    "cleaned_selftext": "aaps pressure congress ordinance blip nitish kumar says seatsharing taken shimla meeting july",
    "cleaned_comments": "one sour note cordial exchange tiff congress president mallikarjun kharge aam aadmi party supremo arvind kejriwal latters insistence congress clarify stand delhi ordinance passed centre sources said kharge stuck guns support parties matter leaders parties present backed unity take bjp lok sabha elections sources said jdu supremo bihar chief minister nitish put together meeting told leaders many smaller parties least estimation join opposition camp closer elections talks sources said pawar suggested joint statement media aapcongress tiff perhaps prompted leaders shelve idea left parties suggested drawing common minimum programme many takers elephant room clearly issue seatsharing seat adjustments sources said rjd chief lalu prasad told congress show large heartedness biggest party every state lead fight state others extending support cooperation mamata agreed adding congress could count support parties states formidable sources said congress leaders kharge rahul sought set right tone letting leaders speak first nitish spoke first congress asked speak kharge said since congress largest party speak last listen everybody first leader saidlalu appreciated congresss gesture consensus issues like policy document seat adjustments taken subsequent meetings lost time distancing gathering soon got talks kejriwal suggested parties nurture bond unity strive ensure oneonone contests bjp learnt also suggested parties put hold plans expansion newer territories till lok sabha elections kharge said party would support anything anticonstitutional would take position internal discussions time next parliament session ordinance come ratification kejriwal pressed pdp chief mehbooba mufti reminded aap vociferous support centres move abrogate article bifurcate jk two union territories unlike opposition parties dmk chief tamil nadu cm k stalin favoured different tactics strategies different states comes seatsharing said ideas like common candidates explored",
    "light_cleaned_title": "Patna Oppn meeting off to a good start, parties resolve to contest together, set date for next talks",
    "light_cleaned_selftext": "AAP's pressure on Congress over ordinance only blip; Nitish Kumar says seat-sharing to be taken up at Shimla meeting in July",
    "light_cleaned_comments": ">The one sour note in the cordial exchange was a tiff between Congress president Mallikarjun Kharge and Aam Aadmi Party supremo Arvind Kejriwal over the latter’s insistence that the Congress clarify its stand on a Delhi ordinance passed by the Centre. Sources said Kharge stuck to his guns, and had the support of most parties on the matter. >All the 32 leaders from the 15 parties present backed unity to take on the BJP in the 2024 Lok Sabha elections. Sources said JD(U) supremo and Bihar Chief Minister Nitish, who put together the meeting, told the leaders that many more smaller parties — at least 10 in his estimation — will join the Opposition camp closer to the 2024 elections. >During the talks, sources said, Pawar suggested a joint statement before the media, but the AAP-Congress tiff perhaps prompted the leaders to shelve the idea. The Left parties suggested drawing up a common minimum programme, but there were not many takers. >The elephant in the room was clearly the issue of seat-sharing and seat adjustments. Sources said RJD chief Lalu Prasad told the Congress that it should show large heartedness, and that the biggest party in every state should lead the fight in that state, with the others extending support and cooperation. Mamata agreed with this, adding that the Congress could count on the support of other parties in states where it is formidable. >Sources said Congress leaders Kharge and Rahul sought to set the right tone by letting other leaders speak first. “Nitish spoke first. When the Congress was asked to speak… Kharge said since the Congress is the largest party, it will speak last and listen to everybody first,” a leader said.Lalu appreciated the Congress’s gesture. >There was consensus that issues like a policy document and seat adjustments can be taken up in subsequent meetings. >While he lost no time distancing himself from the gathering as soon as it got over, during the talks, Kejriwal suggested that parties “nurture a bond of unity” and strive to ensure one-on-one contests against the BJP. He is learnt to have also suggested that parties put on hold plans for expansion in newer territories till the Lok Sabha elections. >He (Kharge) said while the party would not support anything that is “anti-Constitutional”, it would take a position after internal discussions, and in time for the next Parliament session, where the ordinance will come up for ratification >As Kejriwal pressed on, PDP chief Mehbooba Mufti reminded the AAP of its vociferous support to the Centre’s move to abrogate Article 370 and bifurcate J&K into two Union territories, unlike the other Opposition parties. >DMK chief and Tamil Nadu CM M K Stalin favoured different tactics and strategies for different states, when it comes to seat-sharing. He said ideas like common candidates can be explored."
}