{
    "id": "14nsq96",
    "title": "dental braces for underbite",
    "url": "https://www.reddit.com/r/india/comments/14nsq96/dental_braces_for_underbite/",
    "selftext": "Hi guys. I(24 M) have underbite problem(mild where both teeths just touch top down) or class 3. I am not able to find any orthodontist who could fix it without teeth removal or surgery. The people I found locally were not good. They just want to earn money by doing big surgery on me in which they'll cut my jaw bone to make it smaller bone.\n\nResearching online and watching some videos of foreign dentists on youtube(https://youtu.be/Q98IvGErZiQ), its very easy to take lower teeths backwards by using rubberbands/elastics which no dentist told me even an option cause it will not make them money.\n\nIf you have gone through underbite braces, please let me know what was your experience and which doctor you went to(u can dm me if cant say in here)\n\nI want some genuine advice from genuine doctor. Please help me, I feel very insecure because of these. Been searching for good orthodontist for last 4 years or 5 maybe or even longer.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1688210778.0,
    "convurl": "https://external-preview.redd.it/4lug2lKwsw-gAyOEVvqWPVVQtnl8f27_77tU5VkgzWY.jpg?auto=webp&s=2a399e00ac2ff2de24587101d8d73a9c82d3839f",
    "comments": [
        "Not gone through for this particular case but for Deepbite.\nThe rubber band thing I believe is possible when your jaw is developing below 16 yr, rather than relying on my comment, take multiple opinions from dentist and surgeons.",
        "I am also 24, i have crossbite not underbite i too felt same with doctors here, I saw foreign doctors giving non surgerical treatments with palate expander in my type cases, don't know what to do searching for best orthodontist in India did not found someone who could treat my type cases",
        "Hi. One of the thing I did was try out Dezy. Somebody from reddit came to my dm to recommend. Turned out they're good guys. Just so my case was complex(my jaw itself is a bit forward and am trying mewing these + Henry Schein(exploring)), I did not go with their treatment plan, but you should try though.",
        "Any heads?",
        "In my case, I've consulted 7-8 orthodontists but no avail. Everyone says surgical option for full correction, and 2 premolar removal for front teeth correction but my jaw would remain the same they said. I've decided I'll wait for advances in dental sciences and by then, I'll use my hairs(yes) in a way it makes my face symmetrical and thus more aesthetic(I've read whole book on aesthetic for this, found out balance, harmony, and proportions can make something look aesthetically pleasing and not teeths/jaw, so with hairs you can hack the overall aesthetics of my face. I've actually done this, long hairs(like pomade) balances my underbite jaw and the result has been positive, people willfully hold their eyes on me with certain ease which was not the case earlier, and I'm happy with that.\n\nStill, will wait for dental advances as technology is improving at exponential pace due to coming of AI. Hopefully we soon see better less invasive solutions for underbite.",
        "How is that possible. I consulted many orthodontist as well and they all said it’s possible with braces (average expense 50k) in a matter of a year. I’m keeping it on hold cause I might change my city this year so I don’t want to pay double once I shift. Your underbite is almost the same as mine and it’s not that severe. I think there is still chance to correct it.",
        "It’s very hard to find people with an underbite cause it’s not as common and many dentist fix teeth and jaws are another thing again. But with braces it’s possible too if we get it tightened every month. I’m really scared of jaw surgery and there isn’t much equipment’s or qualified doctors in India for that so that’ll be very expensive if I consider to do it outside. But jaw surgery will always be the first choice for me if I get the chance. Have watched way too many videos on YouTube."
    ],
    "cleaned_text": "dental braces underbite hi guys underbite problemmild teeths touch top class able find orthodontist could fix without teeth removal surgery people found locally good want earn money big surgery theyll cut jaw bone make smaller bone researching online watching videos foreign dentists youtubehttpsyoutubeqivgerziq easy take lower teeths backwards using rubberbandselastics dentist told even option cause make money gone underbite braces please let know experience doctor went tou dm cant say want genuine advice genuine doctor please help feel insecure searching good orthodontist last years maybe even longer ",
    "cleaned_title": "dental braces underbite",
    "cleaned_selftext": "hi guys underbite problemmild teeths touch top class able find orthodontist could fix without teeth removal surgery people found locally good want earn money big surgery theyll cut jaw bone make smaller bone researching online watching videos foreign dentists youtubehttpsyoutubeqivgerziq easy take lower teeths backwards using rubberbandselastics dentist told even option cause make money gone underbite braces please let know experience doctor went tou dm cant say want genuine advice genuine doctor please help feel insecure searching good orthodontist last years maybe even longer",
    "cleaned_comments": "gone particular case deepbite rubber band thing believe possible jaw developing yr rather relying comment take multiple opinions dentist surgeons also crossbite underbite felt doctors saw foreign doctors giving non surgerical treatments palate expander type cases dont know searching best orthodontist india found someone could treat type cases hi one thing try dezy somebody reddit came dm recommend turned theyre good guys case complexmy jaw bit forward trying mewing henry scheinexploring go treatment plan try though heads case ive consulted orthodontists avail everyone says surgical option full correction premolar removal front teeth correction jaw would remain said ive decided ill wait advances dental sciences ill use hairsyes way makes face symmetrical thus aestheticive read whole book aesthetic found balance harmony proportions make something look aesthetically pleasing teethsjaw hairs hack overall aesthetics face ive actually done long hairslike pomade balances underbite jaw result positive people willfully hold eyes certain ease case earlier im happy still wait dental advances technology improving exponential pace due coming ai hopefully soon see better less invasive solutions underbite possible consulted many orthodontist well said possible braces average expense k matter year im keeping hold cause might change city year dont want pay double shift underbite almost mine severe think still chance correct hard find people underbite cause common many dentist fix teeth jaws another thing braces possible get tightened every month im really scared jaw surgery isnt much equipments qualified doctors india thatll expensive consider outside jaw surgery always first choice get chance watched way many videos youtube",
    "light_cleaned_title": "dental braces for underbite",
    "light_cleaned_selftext": "Hi guys. I(24 M) have underbite problem(mild where both teeths just touch top down) or class 3. I am not able to find any orthodontist who could fix it without teeth removal or surgery. The people I found locally were not good. They just want to earn money by doing big surgery on me in which they'll cut my jaw bone to make it smaller bone. Researching online and watching some videos of foreign dentists on youtube(https://youtu.be/Q98IvGErZiQ), its very easy to take lower teeths backwards by using rubberbands/elastics which no dentist told me even an option cause it will not make them money. If you have gone through underbite braces, please let me know what was your experience and which doctor you went to(u can dm me if cant say in here) I want some genuine advice from genuine doctor. Please help me, I feel very insecure because of these. Been searching for good orthodontist for last 4 years or 5 maybe or even longer.",
    "light_cleaned_comments": "Not gone through for this particular case but for Deepbite. The rubber band thing I believe is possible when your jaw is developing below 16 yr, rather than relying on my comment, take multiple opinions from dentist and surgeons. I am also 24, i have crossbite not underbite i too felt same with doctors here, I saw foreign doctors giving non surgerical treatments with palate expander in my type cases, don't know what to do searching for best orthodontist in India did not found someone who could treat my type cases Hi. One of the thing I did was try out Dezy. Somebody from reddit came to my dm to recommend. Turned out they're good guys. Just so my case was complex(my jaw itself is a bit forward and am trying mewing these + Henry Schein(exploring)), I did not go with their treatment plan, but you should try though. Any heads? In my case, I've consulted 7-8 orthodontists but no avail. Everyone says surgical option for full correction, and 2 premolar removal for front teeth correction but my jaw would remain the same they said. I've decided I'll wait for advances in dental sciences and by then, I'll use my hairs(yes) in a way it makes my face symmetrical and thus more aesthetic(I've read whole book on aesthetic for this, found out balance, harmony, and proportions can make something look aesthetically pleasing and not teeths/jaw, so with hairs you can hack the overall aesthetics of my face. I've actually done this, long hairs(like pomade) balances my underbite jaw and the result has been positive, people willfully hold their eyes on me with certain ease which was not the case earlier, and I'm happy with that. Still, will wait for dental advances as technology is improving at exponential pace due to coming of AI. Hopefully we soon see better less invasive solutions for underbite. How is that possible. I consulted many orthodontist as well and they all said it’s possible with braces (average expense 50k) in a matter of a year. I’m keeping it on hold cause I might change my city this year so I don’t want to pay double once I shift. Your underbite is almost the same as mine and it’s not that severe. I think there is still chance to correct it. It’s very hard to find people with an underbite cause it’s not as common and many dentist fix teeth and jaws are another thing again. But with braces it’s possible too if we get it tightened every month. I’m really scared of jaw surgery and there isn’t much equipment’s or qualified doctors in India for that so that’ll be very expensive if I consider to do it outside. But jaw surgery will always be the first choice for me if I get the chance. Have watched way too many videos on YouTube."
}