{
    "id": "1hd6vuw",
    "title": "Civil Courts Can't Run A Race With Supreme Court, There Is A Judgment Upholding Places Of Worship Act : SC",
    "url": "https://www.livelaw.in/amp/top-stories/civil-courts-cant-run-a-race-with-supreme-court-there-is-a-judgment-upholding-places-of-worship-act-sc-278190",
    "selftext": "During the hearing, the Court was informed that a total of 18 suits is pending across different Court in the country with regard to 10 different places of worship.\n\nThe Court passed the following order :\n\n*\"As the matter is sub-judice before this Court, we deem it appropriate to direct that while suits may be filed, no suits would be registered and proceedings undertaken till further orders of this Court. We also direct that in the pending suits, the Courts would not pass any effective interim orders or final orders, including orders of survey till the next date of hearing.\"*",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1734073829.0,
    "convurl": "https://external-preview.redd.it/wJCNxe37GxonpyASyRwQZA1_ag0goum_rxz2h_U9nLI.jpg?auto=webp&s=3fcc1881be384b5e648d8eceba144bea7df3b6c7",
    "comments": [],
    "cleaned_text": "civil courts cant run race supreme court judgment upholding places worship act sc hearing court informed total suits pending across different court country regard different places worship court passed following order matter subjudice court deem appropriate direct suits may filed suits would registered proceedings undertaken till orders court also direct pending suits courts would pass effective interim orders final orders including orders survey till next date hearing ",
    "cleaned_title": "civil courts cant run race supreme court judgment upholding places worship act sc",
    "cleaned_selftext": "hearing court informed total suits pending across different court country regard different places worship court passed following order matter subjudice court deem appropriate direct suits may filed suits would registered proceedings undertaken till orders court also direct pending suits courts would pass effective interim orders final orders including orders survey till next date hearing",
    "cleaned_comments": "",
    "light_cleaned_title": "Civil Courts Can't Run A Race With Supreme Court, There Is A Judgment Upholding Places Of Worship Act : SC",
    "light_cleaned_selftext": "During the hearing, the Court was informed that a total of 18 suits is pending across different Court in the country with regard to 10 different places of worship. The Court passed the following order : *\"As the matter is sub-judice before this Court, we deem it appropriate to direct that while suits may be filed, no suits would be registered and proceedings undertaken till further orders of this Court. We also direct that in the pending suits, the Courts would not pass any effective interim orders or final orders, including orders of survey till the next date of hearing.\"*",
    "light_cleaned_comments": ""
}