{
    "id": "nx421w",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/nx421w/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 13,
    "num_comments": 15,
    "created_utc": 1623375019,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Which oil do you guys use for cooking and why?",
        "mustard or soy, it's cheaper when i buy 15L tin\n\ni am trying something these days, i make some makhan everyday to replace the cooking oil.\n\nI am a cheapskate for certain things, i enjoy it, so i buy 1.5 L of milk everyday when i am by myself, 500 ml of it is full cream and other is double skimmed and costs me 68 rs .\n\nI get around almost half a small katori of Makhan from it daily which is enough for me.",
        "Did you cook or eat any interesting vegetable dishes (sukkas, curries, saag, etc.) recently? \n\nRecently in Belgaum (North Karnataka) I ate some incredible sprouted moong. It was really simple, just sprouts in some water, but for some reason it was better than any moong dish I’ve ever had. \n\nI don’t know what else they put in it, but it had me licking the plate",
        "Always olive oil except for frying.",
        "15l tin of soy oil? How much cost? From where? More details please.",
        "There is hafed manufacturing plant near mu house, they sell it 15 l tins of musturd, refined soy bean oil, etc.\n\nI bought musturd tin last year for around 1800 something",
        "Cocoa and cacao Powder is adulterated by adding sand, online local unknown brand sellers use this shitty technique a lot, bastards.\n\nI stick with Hersey now",
        "Sesame or olive oil. Soy or rice bran for deep frying.",
        "Has anyone here had Birria (pork/ beef/ lamb) taco before? Because it's amazing and so in sync with Indian palate",
        "Protip for eating more veggies. Don’t be elaborate . Chop &amp; assemble veggies you want to eat . Add copious amount of chopped greens as well . Olive oil, grated garlic , pepper , salt . Microwave . If done correctly, it takes 8/10 minutes end to end .",
        "sunflower when cooking, olive oil for dressing",
        "All plants seemingly have a ‘Scientific name’. The Sunflower is no different. They’re called Helianthus. Helia meaning sun and Anthus meaning Flower. Contrary to popular belief, this doesn’t refer to the look of the sunflower, but the solar tracking it displays every dayy during most of its growth period.",
        "I am a super lazy bastard that has been cooking his own meal for the past year. and managed to lose 18 kgs of weight in that time. \n\nLentil salads and boiled eggs ftw. also replaced wheat/rice with oats/quinoa",
        "toh main kya karu, job chhod du?"
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "oil guys use cooking mustard soy cheaper buy l tin trying something days make makhan everyday replace cooking oil cheapskate certain things enjoy buy l milk everyday ml full cream double skimmed costs rs get around almost half small katori makhan daily enough cook eat interesting vegetable dishes sukkas curries saag etc recently recently belgaum north karnataka ate incredible sprouted moong really simple sprouts water reason better moong dish ive ever dont know else put licking plate always olive oil except frying l tin soy oil much cost details please hafed manufacturing plant near mu house sell l tins musturd refined soy bean oil etc bought musturd tin last year around something cocoa cacao powder adulterated adding sand online local unknown brand sellers use shitty technique lot bastards stick hersey sesame olive oil soy rice bran deep frying anyone birria pork beef lamb taco amazing sync indian palate protip eating veggies dont elaborate chop amp assemble veggies want eat add copious amount chopped greens well olive oil grated garlic pepper salt microwave done correctly takes minutes end end sunflower cooking olive oil dressing plants seemingly scientific name sunflower different theyre called helianthus helia meaning sun anthus meaning flower contrary popular belief doesnt refer look sunflower solar tracking displays every dayy growth period super lazy bastard cooking meal past year managed lose kgs weight time lentil salads boiled eggs ftw also replaced wheatrice oatsquinoa toh main kya karu job chhod du",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "Which oil do you guys use for cooking and why? mustard or soy, it's cheaper when i buy 15L tin i am trying something these days, i make some makhan everyday to replace the cooking oil. I am a cheapskate for certain things, i enjoy it, so i buy 1.5 L of milk everyday when i am by myself, 500 ml of it is full cream and other is double skimmed and costs me 68 rs . I get around almost half a small katori of Makhan from it daily which is enough for me. Did you cook or eat any interesting vegetable dishes (sukkas, curries, saag, etc.) recently? Recently in Belgaum (North Karnataka) I ate some incredible sprouted moong. It was really simple, just sprouts in some water, but for some reason it was better than any moong dish I’ve ever had. I don’t know what else they put in it, but it had me licking the plate Always olive oil except for frying. 15l tin of soy oil? How much cost? From where? More details please. There is hafed manufacturing plant near mu house, they sell it 15 l tins of musturd, refined soy bean oil, etc. I bought musturd tin last year for around 1800 something Cocoa and cacao Powder is adulterated by adding sand, online local unknown brand sellers use this shitty technique a lot, bastards. I stick with Hersey now Sesame or olive oil. Soy or rice bran for deep frying. Has anyone here had Birria (pork/ beef/ lamb) taco before? Because it's amazing and so in sync with Indian palate Protip for eating more veggies. Don’t be elaborate . Chop &amp; assemble veggies you want to eat . Add copious amount of chopped greens as well . Olive oil, grated garlic , pepper , salt . Microwave . If done correctly, it takes 8/10 minutes end to end . sunflower when cooking, olive oil for dressing All plants seemingly have a ‘Scientific name’. The Sunflower is no different. They’re called Helianthus. Helia meaning sun and Anthus meaning Flower. Contrary to popular belief, this doesn’t refer to the look of the sunflower, but the solar tracking it displays every dayy during most of its growth period. I am a super lazy bastard that has been cooking his own meal for the past year. and managed to lose 18 kgs of weight in that time. Lentil salads and boiled eggs ftw. also replaced wheat/rice with oats/quinoa toh main kya karu, job chhod du?"
}