{
    "id": "17ia565",
    "title": "Terrorism a 'malignancy', knows no borders: India tells UNGA on Israel war",
    "url": "https://www.business-standard.com/world-news/terrorism-a-malignancy-knows-no-borders-india-tells-unga-on-israel-war-123102800130_1.html",
    "selftext": "As an American, props to India. I always admired y’all.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 11,
    "created_utc": 1698485548.0,
    "convurl": "https://external-preview.redd.it/EfNqCfcK5pq4tSlkVYaIzBuTn0ZQysJ66FgS8pLSM2o.jpg?auto=webp&s=a4ea025267fd477fdfb08fbd8628dba7022e811e",
    "comments": [
        "Personally, I hate Americans on the topic of terrorism. You are no different than the Pakistani who breed and host Terror camps.",
        "Did Destiny talk about this? If yes can you provide a link?",
        "Well it's the government who funds terrorists in Pakistan.",
        "Let me guess, killing foreign civilians in their own country does not count as \"terrorism\" - as long as your govt. has said the victims themselves are terrorists. Right?",
        ">As an american\n\nFunnily enough, when I tell my fellow Indians that the CIA is probably the world’s largest terrorist organisation, a lot of them nod in agreement with me.\n\n[The CIA is a terrorist organisation](https://youtu.be/_2khAmMTAjI?si=PIFYLqUrC516FMSl)",
        "No they don’t",
        "You can watch the video and then nod. No hurry.",
        "America is more of terrorism sponsor than anything else imao..."
    ],
    "cleaned_text": "terrorism malignancy knows borders india tells unga israel war american props india always admired yall ",
    "cleaned_title": "terrorism malignancy knows borders india tells unga israel war",
    "cleaned_selftext": "american props india always admired yall",
    "cleaned_comments": "personally hate americans topic terrorism different pakistani breed host terror camps destiny talk yes provide link well government funds terrorists pakistan let guess killing foreign civilians country count terrorism long govt said victims terrorists right american funnily enough tell fellow indians cia probably worlds largest terrorist organisation lot nod agreement cia terrorist organisationhttpsyoutubekhammtajisipifylqurcfmsl dont watch video nod hurry america terrorism sponsor anything else imao",
    "light_cleaned_title": "Terrorism a 'malignancy', knows no borders: India tells UNGA on Israel war",
    "light_cleaned_selftext": "As an American, props to India. I always admired y’all.",
    "light_cleaned_comments": "Personally, I hate Americans on the topic of terrorism. You are no different than the Pakistani who breed and host Terror camps. Did Destiny talk about this? If yes can you provide a link? Well it's the government who funds terrorists in Pakistan. Let me guess, killing foreign civilians in their own country does not count as \"terrorism\" - as long as your govt. has said the victims themselves are terrorists. Right? >As an american Funnily enough, when I tell my fellow Indians that the CIA is probably the world’s largest terrorist organisation, a lot of them nod in agreement with me. [The CIA is a terrorist organisation](https://youtu.be/_2khAmMTAjI?si=PIFYLqUrC516FMSl) No they don’t You can watch the video and then nod. No hurry. America is more of terrorism sponsor than anything else imao..."
}