{
    "id": "195b1sl",
    "title": "Swiggy pissed me off really bad.",
    "url": "https://www.reddit.com/gallery/195b1sl",
    "selftext": "I switched to Swiggy from Zomato recently seeing the discounts they were offering. I definitely won't recommend this to anyone. I even bought their one lite plan which is shit too(not to mention its Zomato counterpart called Zomato Gold which is shittier). Look at the screenshots of my chat with their customer support to know why. \n\nAlso, in a previous order I had received maida roti instead of chicken roll, veg noodles with over boiled cabbage instead of Schezwan noodles(was acceptable because I was stoned) and burger with sweet buns(the ones with jelly bean). And in one other order I had received boiled-black-burnt(alliteration?) dough in place of choco lava cake(SERIOUSLY??). It was so hard that I couldn't even cut through that shit with a knife. For the maida roti order, I asked them for a refund and after many tickets closed without resolution I posted to twitter tagging consumer forum etc. After that they refunded a 100rs coupon which couldn't be clubbed with other offers making it totally useless as most restaurants have already different offers going on. Totally done with Swiggy for now.\n\nTldr; Received incorrect items(read inedible) multiple times, got another order cancelled as the restaurant was closed. All that while being stoned. Don't use Swiggy.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 22,
    "created_utc": 1705106996.0,
    "convurl": "https://i.redd.it/0mx0zduhu3cc1.jpg",
    "comments": [
        "OP, please read this \n\nThe people you interact with are not the stakeholders of the organisation they are representing. They are given a set of instructions to follow similar to a if else loops, there is no point in mocking the person who is just helping you through the situation. \n\nIt’s not like it’s in there control to either refund you or not, there are rules they have to follow. They can’t loose their monthly salary just to go out of the way and refund your 250-500 bucks. So stop being rude to them and simply switch the platform\n\n\nPs: if you are ok if customers of your employer to treat you like shit then you can justify yourself",
        "Subah ke 5 baje bhi dukaane khuli rheti h ky",
        "Entitled OP expects people to prepare and deliver food at 5am",
        "At least Swiggy lets you talk to customer service. Zomato simply says drop a mail and we will revert back in 72 hours.",
        "I understand your point. But don't you think this is the whole modus operandi of such companies? You can't blame the representative because he's just following instructions. You escalate the issue to seniors but they've to follow company policies too. And you can't escalate your issue to these policy creaters. Basically you've no one whom you can blame. The policy creaters have to keep the stakes of shareholders in mind and so and so. You always end up with unfair resolutions because the executive tells you that it's somehow someone else's fault and they will make sure it doesn't happen again. \n\nI understand it's not correct to be rude to someone who's just following instructions but if you read the whole post you'll see how the executives were marking issues as resolved without any resolution. What do you think were my options? Accepting a 100% cancellation fees because the restaurant was closed?",
        "Also, I tried to be as less aggressive as I could be throughout the chat. My point was to mock swiggy and its policies and not the customer support executive.",
        "What to say 😅😅",
        "Station ke samne ki dukane 24*7 khuli rehti hai. Rapido drivers part time swiggy, zomato bhi chalate hai.",
        "Wahh shi hai.. Yaha to 10 11 bje ke baad swiggy zomato kuch kaam nhi krta",
        "Is it really entitlement? Restaurants near railway stations are open 24*7.",
        "If Swiggy fails to find an assign delivery partner they show order status as ‘Food being prepared’ at the restaurant. I order from this restaurant near my place and they’re one call away in case of any issue. Got to know about this shit practice by Swiggy when I ordered a pizza and restaurant called me that food is ready and they will have to close in next 10-15 minutes but Swiggy app shows food being prepared.\n\n\nNow imagine these companies having the same approach for orders across country, the food that goes waste for not being picked up. Rather than spending money into marketing these companies should put some money into the cheap ass chatbot with irrelevant replies and delayed communication",
        "Dude you sound like an entitled prick.",
        "He is expecting the service providers to provide the service they promised. If they can't provide at that time(which is absolutely okay given the time), 'unserviceable at the moment' response would work.",
        "What a stupid comment. The restaurant was open at 5am. Why didn't they close if they cannot deliver?",
        "- yes i have seen many restaurants which will get open/start accepting orders after only 10 am, i believe this particular restaurant had no habit of changing status in swiggy as they  never got any orders during strange timings like this.\n\n- I have never seen a hustler who needs breakfast delivered to his doorstep at 5am  even in metro cities, I would probably plan before i sleep like saving part of the night's dinner or some bread and butter.....\n\n- also swiggy delivery partners don't work in any shifts, usually make most of their money during the day, imagine getting up at 4:30 am and standing near some restaurant hoping he will get some delivery assigned and in which he will make 30rs, which only happens once in a blue moon......",
        "> yes i have seen many restaurants which will get open/start accepting orders only after 10 am, i believe this particular restaurant had no habit of changing status in swiggy as they never got any orders during strange timings like this.\n\nThat's completely the restaurant's fault then.\n\n> I have never seen a hustler who needs breakfast delivered to his doorstep at 5am even in metro cities, I would probably plan before i sleep like saving part of the night's dinner or some bread and butter.....\n\n> also swiggy delivery partners don't work in any shifts, usually make most of their money during the day, imagine getting up at 4:30 am and standing near some restaurant hoping he will get some delivery assigned and in which he will make 30rs, which only happens once in a blue moon......\n\nWhere are you getting all this from? That is some complete bullshit. I have regularly ordered late at 4-5am and there never has been any problem of delivery partners. No extra wait time as well and they happily deliver the order as they are working at that time on their own will. I honestly don't know what you're even talking about.",
        "It's not entitlement to order food at 4-5am. Ignore all these people. They are no one to judge your life's schedule.\n\nThere are people who work night shifts who regularly order food at night.",
        "OP, I have faced similar screw-ups with both Swiggy and Zomato at times, such as orders running late or misplaced/spilled items. However, almost always they have resolved the issue promptly and provided a 100% refund.  \nNow, it's important to remember that they are not going to compensate you for more than what you have paid for, no matter how justified it may seem when you have been waiting hungrily for your order.  \n\n\nConsidering the convenience that these services bring to your life, it's important to acknowledge that the delivery people are some of the hardest working individuals, enduring harsh conditions to serve us (I am in Delhi, so I am speaking from that point of view).  \nSince you placed your order at around 5am, there will always be a chance of screw-ups at that hour.  \n\n\nTry to approach it with the mindset that sometimes things will not work the way they are supposed to, and just let it go.  \nThere is no point in getting angry or frustrated over it.",
        "I think after few times they're reluctant to refund money. Earlier they used to refund without asking many questions but after few wrong orders they rejected refund requests. In my case I was only asking for refund for incorrect items but they were asking to contact on email. On email, they were marking issues as resolved without providing refund. I emailed them multiple times.\n\nI definitely appreciate the delivery partners and make sure to tip them whenever I can. But in my area some restaurants are running a scam like operation where they list items that they can't make. For example, there are dhabas near station which have multi cuisine listing. And they are never able to deliver. They have listed 10 types of noodles at various price points and no matter which you order, you'll always get veg noodles. Also, these restaurants have multiple listings under different names with same menu and addresses. I think this definitely can be called a scam. You rate them bad once and a new listing will pop up under same name. So Swiggy and Zomato being unable to take action against such restaurants is what was really frustrating.\n\nBut you're right that there's no point in getting frustrated over that. I'm just not a big fan of capitalism.",
        ">I think after few times they're reluctant to refund money. Earlier they used to refund without asking many questions but after few wrong orders they rejected refund requests. In my case I was only asking for refund for incorrect items but they were asking to contact on email. \n\nI think it just depends on how often you order, and how often you request refunds. \n\nMy wife and I used to order from Swiggy and Swiggy Instamart almost every day. I have no idea how much we spent, but likely between Rs. 40,000 and Rs. 50,000 per month. Most orders went off fairly well--aside from drivers incessantly calling for directions before even reaching our neighborhood--but there'd be occasional mistakes, too. \n\nSwiggy very rarely hesitated in granting refund requests. And, when they did, I'd tell them to check how much we spent every month, and to compare that number with the value of the requested refund. \n\nZomato is another story. They really don't give a shit. Quintessential Indian customer service: extorting as much money as possible from a single transaction, without any consideration to customer loyalty. The last time I ordered from Zomato was *the last time* I ordered from Zomato--our order was royally fucked up, and they told me to contact the restaurant for a refund, lol."
    ],
    "cleaned_text": "swiggy pissed really bad switched swiggy zomato recently seeing discounts offering definitely wont recommend anyone even bought one lite plan shit toonot mention zomato counterpart called zomato gold shittier look screenshots chat customer support know also previous order received maida roti instead chicken roll veg noodles boiled cabbage instead schezwan noodleswas acceptable stoned burger sweet bunsthe ones jelly bean one order received boiledblackburntalliteration dough place choco lava cakeseriously hard couldnt even cut shit knife maida roti order asked refund many tickets closed without resolution posted twitter tagging consumer forum etc refunded rs coupon couldnt clubbed offers making totally useless restaurants already different offers going totally done swiggy tldr received incorrect itemsread inedible multiple times got another order cancelled restaurant closed stoned dont use swiggy ",
    "cleaned_title": "swiggy pissed really bad",
    "cleaned_selftext": "switched swiggy zomato recently seeing discounts offering definitely wont recommend anyone even bought one lite plan shit toonot mention zomato counterpart called zomato gold shittier look screenshots chat customer support know also previous order received maida roti instead chicken roll veg noodles boiled cabbage instead schezwan noodleswas acceptable stoned burger sweet bunsthe ones jelly bean one order received boiledblackburntalliteration dough place choco lava cakeseriously hard couldnt even cut shit knife maida roti order asked refund many tickets closed without resolution posted twitter tagging consumer forum etc refunded rs coupon couldnt clubbed offers making totally useless restaurants already different offers going totally done swiggy tldr received incorrect itemsread inedible multiple times got another order cancelled restaurant closed stoned dont use swiggy",
    "cleaned_comments": "op please read people interact stakeholders organisation representing given set instructions follow similar else loops point mocking person helping situation like control either refund rules follow cant loose monthly salary go way refund bucks stop rude simply switch platform ps ok customers employer treat like shit justify subah ke baje bhi dukaane khuli rheti h ky entitled op expects people prepare deliver food least swiggy lets talk customer service zomato simply says drop mail revert back hours understand point dont think whole modus operandi companies cant blame representative hes following instructions escalate issue seniors theyve follow company policies cant escalate issue policy creaters basically youve one blame policy creaters keep stakes shareholders mind always end unfair resolutions executive tells somehow someone elses fault make sure doesnt happen understand correct rude someone whos following instructions read whole post youll see executives marking issues resolved without resolution think options accepting cancellation fees restaurant closed also tried less aggressive could throughout chat point mock swiggy policies customer support executive say station ke samne ki dukane khuli rehti hai rapido drivers part time swiggy zomato bhi chalate hai wahh shi hai yaha bje ke baad swiggy zomato kuch kaam nhi krta really entitlement restaurants near railway stations open swiggy fails find assign delivery partner show order status food prepared restaurant order restaurant near place theyre one call away case issue got know shit practice swiggy ordered pizza restaurant called food ready close next minutes swiggy app shows food prepared imagine companies approach orders across country food goes waste picked rather spending money marketing companies put money cheap ass chatbot irrelevant replies delayed communication dude sound like entitled prick expecting service providers provide service promised cant provide timewhich absolutely okay given time unserviceable moment response would work stupid comment restaurant open didnt close deliver yes seen many restaurants get openstart accepting orders believe particular restaurant habit changing status swiggy never got orders strange timings like never seen hustler needs breakfast delivered doorstep even metro cities would probably plan sleep like saving part nights dinner bread butter also swiggy delivery partners dont work shifts usually make money day imagine getting standing near restaurant hoping get delivery assigned make rs happens blue moon yes seen many restaurants get openstart accepting orders believe particular restaurant habit changing status swiggy never got orders strange timings like thats completely restaurants fault never seen hustler needs breakfast delivered doorstep even metro cities would probably plan sleep like saving part nights dinner bread butter also swiggy delivery partners dont work shifts usually make money day imagine getting standing near restaurant hoping get delivery assigned make rs happens blue moon getting complete bullshit regularly ordered late never problem delivery partners extra wait time well happily deliver order working time honestly dont know youre even talking entitlement order food ignore people one judge lifes schedule people work night shifts regularly order food night op faced similar screwups swiggy zomato times orders running late misplacedspilled items however almost always resolved issue promptly provided refund important remember going compensate paid matter justified may seem waiting hungrily order considering convenience services bring life important acknowledge delivery people hardest working individuals enduring harsh conditions serve us delhi speaking point view since placed order around always chance screwups hour try approach mindset sometimes things work way supposed let go point getting angry frustrated think times theyre reluctant refund money earlier used refund without asking many questions wrong orders rejected refund requests case asking refund incorrect items asking contact email email marking issues resolved without providing refund emailed multiple times definitely appreciate delivery partners make sure tip whenever area restaurants running scam like operation list items cant make example dhabas near station multi cuisine listing never able deliver listed types noodles various price points matter order youll always get veg noodles also restaurants multiple listings different names menu addresses think definitely called scam rate bad new listing pop name swiggy zomato unable take action restaurants really frustrating youre right theres point getting frustrated im big fan capitalism think times theyre reluctant refund money earlier used refund without asking many questions wrong orders rejected refund requests case asking refund incorrect items asking contact email think depends often order often request refunds wife used order swiggy swiggy instamart almost every day idea much spent likely rs rs per month orders went fairly wellaside drivers incessantly calling directions even reaching neighborhoodbut thered occasional mistakes swiggy rarely hesitated granting refund requests id tell check much spent every month compare number value requested refund zomato another story really dont give shit quintessential indian customer service extorting much money possible single transaction without consideration customer loyalty last time ordered zomato last time ordered zomatoour order royally fucked told contact restaurant refund lol",
    "light_cleaned_title": "Swiggy pissed me off really bad.",
    "light_cleaned_selftext": "I switched to Swiggy from Zomato recently seeing the discounts they were offering. I definitely won't recommend this to anyone. I even bought their one lite plan which is shit too(not to mention its Zomato counterpart called Zomato Gold which is shittier). Look at the screenshots of my chat with their customer support to know why. Also, in a previous order I had received maida roti instead of chicken roll, veg noodles with over boiled cabbage instead of Schezwan noodles(was acceptable because I was stoned) and burger with sweet buns(the ones with jelly bean). And in one other order I had received boiled-black-burnt(alliteration?) dough in place of choco lava cake(SERIOUSLY??). It was so hard that I couldn't even cut through that shit with a knife. For the maida roti order, I asked them for a refund and after many tickets closed without resolution I posted to twitter tagging consumer forum etc. After that they refunded a 100rs coupon which couldn't be clubbed with other offers making it totally useless as most restaurants have already different offers going on. Totally done with Swiggy for now. Tldr; Received incorrect items(read inedible) multiple times, got another order cancelled as the restaurant was closed. All that while being stoned. Don't use Swiggy.",
    "light_cleaned_comments": "OP, please read this The people you interact with are not the stakeholders of the organisation they are representing. They are given a set of instructions to follow similar to a if else loops, there is no point in mocking the person who is just helping you through the situation. It’s not like it’s in there control to either refund you or not, there are rules they have to follow. They can’t loose their monthly salary just to go out of the way and refund your 250-500 bucks. So stop being rude to them and simply switch the platform Ps: if you are ok if customers of your employer to treat you like shit then you can justify yourself Subah ke 5 baje bhi dukaane khuli rheti h ky Entitled OP expects people to prepare and deliver food at 5am At least Swiggy lets you talk to customer service. Zomato simply says drop a mail and we will revert back in 72 hours. I understand your point. But don't you think this is the whole modus operandi of such companies? You can't blame the representative because he's just following instructions. You escalate the issue to seniors but they've to follow company policies too. And you can't escalate your issue to these policy creaters. Basically you've no one whom you can blame. The policy creaters have to keep the stakes of shareholders in mind and so and so. You always end up with unfair resolutions because the executive tells you that it's somehow someone else's fault and they will make sure it doesn't happen again. I understand it's not correct to be rude to someone who's just following instructions but if you read the whole post you'll see how the executives were marking issues as resolved without any resolution. What do you think were my options? Accepting a 100% cancellation fees because the restaurant was closed? Also, I tried to be as less aggressive as I could be throughout the chat. My point was to mock swiggy and its policies and not the customer support executive. What to say 😅😅 Station ke samne ki dukane 24*7 khuli rehti hai. Rapido drivers part time swiggy, zomato bhi chalate hai. Wahh shi hai.. Yaha to 10 11 bje ke baad swiggy zomato kuch kaam nhi krta Is it really entitlement? Restaurants near railway stations are open 24*7. If Swiggy fails to find an assign delivery partner they show order status as ‘Food being prepared’ at the restaurant. I order from this restaurant near my place and they’re one call away in case of any issue. Got to know about this shit practice by Swiggy when I ordered a pizza and restaurant called me that food is ready and they will have to close in next 10-15 minutes but Swiggy app shows food being prepared. Now imagine these companies having the same approach for orders across country, the food that goes waste for not being picked up. Rather than spending money into marketing these companies should put some money into the cheap ass chatbot with irrelevant replies and delayed communication Dude you sound like an entitled prick. He is expecting the service providers to provide the service they promised. If they can't provide at that time(which is absolutely okay given the time), 'unserviceable at the moment' response would work. What a stupid comment. The restaurant was open at 5am. Why didn't they close if they cannot deliver? - yes i have seen many restaurants which will get open/start accepting orders after only 10 am, i believe this particular restaurant had no habit of changing status in swiggy as they never got any orders during strange timings like this. - I have never seen a hustler who needs breakfast delivered to his doorstep at 5am even in metro cities, I would probably plan before i sleep like saving part of the night's dinner or some bread and butter..... - also swiggy delivery partners don't work in any shifts, usually make most of their money during the day, imagine getting up at 4:30 am and standing near some restaurant hoping he will get some delivery assigned and in which he will make 30rs, which only happens once in a blue moon...... > yes i have seen many restaurants which will get open/start accepting orders only after 10 am, i believe this particular restaurant had no habit of changing status in swiggy as they never got any orders during strange timings like this. That's completely the restaurant's fault then. > I have never seen a hustler who needs breakfast delivered to his doorstep at 5am even in metro cities, I would probably plan before i sleep like saving part of the night's dinner or some bread and butter..... > also swiggy delivery partners don't work in any shifts, usually make most of their money during the day, imagine getting up at 4:30 am and standing near some restaurant hoping he will get some delivery assigned and in which he will make 30rs, which only happens once in a blue moon...... Where are you getting all this from? That is some complete bullshit. I have regularly ordered late at 4-5am and there never has been any problem of delivery partners. No extra wait time as well and they happily deliver the order as they are working at that time on their own will. I honestly don't know what you're even talking about. It's not entitlement to order food at 4-5am. Ignore all these people. They are no one to judge your life's schedule. There are people who work night shifts who regularly order food at night. OP, I have faced similar screw-ups with both Swiggy and Zomato at times, such as orders running late or misplaced/spilled items. However, almost always they have resolved the issue promptly and provided a 100% refund. Now, it's important to remember that they are not going to compensate you for more than what you have paid for, no matter how justified it may seem when you have been waiting hungrily for your order. Considering the convenience that these services bring to your life, it's important to acknowledge that the delivery people are some of the hardest working individuals, enduring harsh conditions to serve us (I am in Delhi, so I am speaking from that point of view). Since you placed your order at around 5am, there will always be a chance of screw-ups at that hour. Try to approach it with the mindset that sometimes things will not work the way they are supposed to, and just let it go. There is no point in getting angry or frustrated over it. I think after few times they're reluctant to refund money. Earlier they used to refund without asking many questions but after few wrong orders they rejected refund requests. In my case I was only asking for refund for incorrect items but they were asking to contact on email. On email, they were marking issues as resolved without providing refund. I emailed them multiple times. I definitely appreciate the delivery partners and make sure to tip them whenever I can. But in my area some restaurants are running a scam like operation where they list items that they can't make. For example, there are dhabas near station which have multi cuisine listing. And they are never able to deliver. They have listed 10 types of noodles at various price points and no matter which you order, you'll always get veg noodles. Also, these restaurants have multiple listings under different names with same menu and addresses. I think this definitely can be called a scam. You rate them bad once and a new listing will pop up under same name. So Swiggy and Zomato being unable to take action against such restaurants is what was really frustrating. But you're right that there's no point in getting frustrated over that. I'm just not a big fan of capitalism. >I think after few times they're reluctant to refund money. Earlier they used to refund without asking many questions but after few wrong orders they rejected refund requests. In my case I was only asking for refund for incorrect items but they were asking to contact on email. I think it just depends on how often you order, and how often you request refunds. My wife and I used to order from Swiggy and Swiggy Instamart almost every day. I have no idea how much we spent, but likely between Rs. 40,000 and Rs. 50,000 per month. Most orders went off fairly well--aside from drivers incessantly calling for directions before even reaching our neighborhood--but there'd be occasional mistakes, too. Swiggy very rarely hesitated in granting refund requests. And, when they did, I'd tell them to check how much we spent every month, and to compare that number with the value of the requested refund. Zomato is another story. They really don't give a shit. Quintessential Indian customer service: extorting as much money as possible from a single transaction, without any consideration to customer loyalty. The last time I ordered from Zomato was *the last time* I ordered from Zomato--our order was royally fucked up, and they told me to contact the restaurant for a refund, lol."
}