{
    "id": "15g60gy",
    "title": "[OLD] BJP gains in polls after every riot, says Yale study",
    "url": "https://m.economictimes.com/news/politics-and-nation/bjp-gains-in-polls-after-every-riot-says-yale-study/articleshow/45378840.cms",
    "selftext": "The title is self-explanatory",
    "flair": "Politics",
    "score": 1,
    "num_comments": 29,
    "created_utc": 1690974547.0,
    "convurl": "https://external-preview.redd.it/MqQBztEe1oW0VLnlx5GtlxoNLiMgLXZj92KGD1aRT9g.jpg?auto=webp&amp;s=abb7ef5d8badf56ad1f35c4639a4f3d174a3e4d1",
    "comments": [
        "Fixed link: https://economictimes.indiatimes.com/news/politics-and-nation/bjp-gains-in-polls-after-every-riot-says-yale-study/articleshow/45378840.cms\n\nLink OP posted wasn't working for me on desktop.",
        "In other news, water is wet\n\nRiots are the only way bjp can garner support. Not because of their policies that benefit the country.\n\n~~East~~ Gujju India company. Divide and conquer",
        "And with a riot almost everyday now  God knows what's in store for 2024 😕",
        "BJP might be on the back foot this time. CM, Dy CM, Gurgaon MP are all blaming VHP which you wouldn't generally expect",
        "Which is why bjp engineers riots every time it feels the need.",
        "They're only blaming. Doing nothing.",
        "Haryana is not a typical Hindu state. They are not Muslim friendly but they won’t easily fall for Hindu Muslim thing either. There are some fault lines among Hindus too. Rioting may not consolidate Hindu votes here - other caste factors will also play.",
        "Hence proved, we are really dumb. We have Stockholm syndrome",
        "Basic rule: polarization benefits right-wing parties.",
        "yes, the voting pattern of rajasthan and haryana are very similar",
        "Wish they loose each n every loved one in the riots they incite, live with the regret that they killed the ones that meant everything to them for power.\n\nThese arsonists have proved again and again that they don't care about the nation but just want to watch the world burn and smell burnt corpses.",
        "Bhesturn Propogenduh /s",
        "Guys wasn't this obvious? Gujrat model?",
        "But only a matter of time when the PM and Home Minister will absolve the Hindu rioters of all blame, give them election tickets and garlands while moving the Muslim victims.",
        "The real reason why he doesn't have a child"
    ],
    "cleaned_text": "old bjp gains polls every riot says yale study title selfexplanatory ",
    "cleaned_title": "old bjp gains polls every riot says yale study",
    "cleaned_selftext": "title selfexplanatory",
    "cleaned_comments": "fixed link link op posted wasnt working desktop news water wet riots way bjp garner support policies benefit country east gujju india company divide conquer riot almost everyday god knows whats store bjp might back foot time cm dy cm gurgaon mp blaming vhp wouldnt generally expect bjp engineers riots every time feels need theyre blaming nothing haryana typical hindu state muslim friendly wont easily fall hindu muslim thing either fault lines among hindus rioting may consolidate hindu votes caste factors also play hence proved really dumb stockholm syndrome basic rule polarization benefits rightwing parties yes voting pattern rajasthan haryana similar wish loose n every loved one riots incite live regret killed ones meant everything power arsonists proved dont care nation want watch world burn smell burnt corpses bhesturn propogenduh guys wasnt obvious gujrat model matter time pm home minister absolve hindu rioters blame give election tickets garlands moving muslim victims real reason doesnt child",
    "light_cleaned_title": "[OLD] BJP gains in polls after every riot, says Yale study",
    "light_cleaned_selftext": "The title is self-explanatory",
    "light_cleaned_comments": "Fixed link: Link OP posted wasn't working for me on desktop. In other news, water is wet Riots are the only way bjp can garner support. Not because of their policies that benefit the country. ~~East~~ Gujju India company. Divide and conquer And with a riot almost everyday now God knows what's in store for 2024 😕 BJP might be on the back foot this time. CM, Dy CM, Gurgaon MP are all blaming VHP which you wouldn't generally expect Which is why bjp engineers riots every time it feels the need. They're only blaming. Doing nothing. Haryana is not a typical Hindu state. They are not Muslim friendly but they won’t easily fall for Hindu Muslim thing either. There are some fault lines among Hindus too. Rioting may not consolidate Hindu votes here - other caste factors will also play. Hence proved, we are really dumb. We have Stockholm syndrome Basic rule: polarization benefits right-wing parties. yes, the voting pattern of rajasthan and haryana are very similar Wish they loose each n every loved one in the riots they incite, live with the regret that they killed the ones that meant everything to them for power. These arsonists have proved again and again that they don't care about the nation but just want to watch the world burn and smell burnt corpses. Bhesturn Propogenduh /s Guys wasn't this obvious? Gujrat model? But only a matter of time when the PM and Home Minister will absolve the Hindu rioters of all blame, give them election tickets and garlands while moving the Muslim victims. The real reason why he doesn't have a child"
}