{
    "id": "1ep072e",
    "title": "Whistleblower Documents Reveal SEBI’s Chairperson Had Stake In Obscure Offshore Entities Used In Adani Money Siphoning Scandal",
    "url": "https://www.reddit.com/gallery/1ep072e",
    "selftext": "Source : https://hindenburgresearch.com/sebi-chairperson/",
    "flair": "Crime",
    "score": 83,
    "num_comments": 5,
    "created_utc": 1723315275.0,
    "convurl": "https://i.redd.it/xkiczj63tvhd1.jpg",
    "comments": [
        "Unilever should probably  check if this guy has been eating funds in his role.",
        "Thank you for the explanation. The other shareholder of Agora Advisory Pvt. Ltd., the Indian company, is listed as Kavita Shah. Is that the [daughter](https://capitalvia.beehiiv.com/p/intimate-profile-adani-family-powerful-indian-business-dynasties) of Vinod Adani or another person with the same name? What are the implications?",
        "#5 key allegations from Hindenburg report on SEBI chairperson Madhabi Buch, husband's offshore stakes\n\nThe report alleges that Blackstone has significant stakes in REITs in India\n\nHere are five allegations highlighted against SEBI chief  Madhabi Puri Buch in the latest document released by Hindenburg Research:\n\n1. The Supreme Court said that SEBI had \"Drawn a blank” in its investigations into who funded Adani's offshore shareholders. If SEBI really wanted to find the offshore fund holders, perhaps the SEBI chairperson could have started by looking in the mirror. We find it unsurprising that SEBI was reluctant to follow a trail that may have led to its own chairperson.\n\n2. **From April 2017 to March 2022, while Madhabi Buch was a whole time member and chairperson at SEBI, she had a 100% interest in an offshore Singaporean consulting firm, called Agora Partners... On March 16th, 2022, two weeks after her appointment as SEBI chairperson, she quietly transferred the shares to her husband**\n\n3. **During Madhabi Buch's tenure as a whole time member at SEBI, her husband was appointed as a senior advisor to Blackstone in 2019 He had not worked for a fund, in real estate or capital markets before, per his LinkedIn profile**\n\n4. **During Dhaval Buch's time as advisor to Blackstone, SEBI has proposed, approved and facilitated major reit regulations changes...These include 7 consultation papers, 3 consolidated updates, 2 new regulatory frameworks and nomination rights for units, specifically benefiting private equity firms like Blackstone... During industry conferences, SEBI chairperson Madhabi Buch has touted REITS as her \"Favourite products for the future\" and urged investors to look \"Positively\" upon the asset class... While making those statements, she omitted to mention that Blackstone, who her husband advises, stands to gain significantly from the asset class**\n\n5. Madhabi Buch currently has a 99% stake in an Indian consulting business called Agora Advisory, where her husband is a director\n\nhttps://www.theweek.in/news/biz-tech/2024/08/11/hindenburg-report-on-sebi-chairperson-madhabi-buch-husband-s-offshore-stakes-5-key-allegations.html\n\nInmates run the Asylum,the madhouse that is India"
    ],
    "cleaned_text": "whistleblower documents reveal sebis chairperson stake obscure offshore entities used adani money siphoning scandal source ",
    "cleaned_title": "whistleblower documents reveal sebis chairperson stake obscure offshore entities used adani money siphoning scandal",
    "cleaned_selftext": "source",
    "cleaned_comments": "unilever probably check guy eating funds role thank explanation shareholder agora advisory pvt ltd indian company listed kavita shah daughterhttpscapitalviabeehiivcompintimateprofileadanifamilypowerfulindianbusinessdynasties vinod adani another person name implications key allegations hindenburg report sebi chairperson madhabi buch husbands offshore stakes report alleges blackstone significant stakes reits india five allegations highlighted sebi chief madhabi puri buch latest document released hindenburg research supreme court said sebi drawn blank investigations funded adanis offshore shareholders sebi really wanted find offshore fund holders perhaps sebi chairperson could started looking mirror find unsurprising sebi reluctant follow trail may led chairperson april march madhabi buch whole time member chairperson sebi interest offshore singaporean consulting firm called agora partners march th two weeks appointment sebi chairperson quietly transferred shares husband madhabi buchs tenure whole time member sebi husband appointed senior advisor blackstone worked fund real estate capital markets per linkedin profile dhaval buchs time advisor blackstone sebi proposed approved facilitated major reit regulations changesthese include consultation papers consolidated updates new regulatory frameworks nomination rights units specifically benefiting private equity firms like blackstone industry conferences sebi chairperson madhabi buch touted reits favourite products future urged investors look positively upon asset class making statements omitted mention blackstone husband advises stands gain significantly asset class madhabi buch currently stake indian consulting business called agora advisory husband director inmates run asylumthe madhouse india",
    "light_cleaned_title": "Whistleblower Documents Reveal SEBI’s Chairperson Had Stake In Obscure Offshore Entities Used In Adani Money Siphoning Scandal",
    "light_cleaned_selftext": "Source :",
    "light_cleaned_comments": "Unilever should probably check if this guy has been eating funds in his role. Thank you for the explanation. The other shareholder of Agora Advisory Pvt. Ltd., the Indian company, is listed as Kavita Shah. Is that the [daughter](https://capitalvia.beehiiv.com/p/intimate-profile-adani-family-powerful-indian-business-dynasties) of Vinod Adani or another person with the same name? What are the implications? #5 key allegations from Hindenburg report on SEBI chairperson Madhabi Buch, husband's offshore stakes The report alleges that Blackstone has significant stakes in REITs in India Here are five allegations highlighted against SEBI chief Madhabi Puri Buch in the latest document released by Hindenburg Research: 1. The Supreme Court said that SEBI had \"Drawn a blank” in its investigations into who funded Adani's offshore shareholders. If SEBI really wanted to find the offshore fund holders, perhaps the SEBI chairperson could have started by looking in the mirror. We find it unsurprising that SEBI was reluctant to follow a trail that may have led to its own chairperson. 2. **From April 2017 to March 2022, while Madhabi Buch was a whole time member and chairperson at SEBI, she had a 100% interest in an offshore Singaporean consulting firm, called Agora Partners... On March 16th, 2022, two weeks after her appointment as SEBI chairperson, she quietly transferred the shares to her husband** 3. **During Madhabi Buch's tenure as a whole time member at SEBI, her husband was appointed as a senior advisor to Blackstone in 2019 He had not worked for a fund, in real estate or capital markets before, per his LinkedIn profile** 4. **During Dhaval Buch's time as advisor to Blackstone, SEBI has proposed, approved and facilitated major reit regulations changes...These include 7 consultation papers, 3 consolidated updates, 2 new regulatory frameworks and nomination rights for units, specifically benefiting private equity firms like Blackstone... During industry conferences, SEBI chairperson Madhabi Buch has touted REITS as her \"Favourite products for the future\" and urged investors to look \"Positively\" upon the asset class... While making those statements, she omitted to mention that Blackstone, who her husband advises, stands to gain significantly from the asset class** 5. Madhabi Buch currently has a 99% stake in an Indian consulting business called Agora Advisory, where her husband is a director Inmates run the Asylum,the madhouse that is India"
}