{
    "id": "1crmst6",
    "title": "If anyone is curious, this is the hoarding before it fell",
    "url": "https://i.redd.it/nxomlii2nc0d1.jpeg",
    "selftext": "Dekhke hi pata chalta hai it's a safety risk. \n\nAlso, ek hoarding enough nahi tha. There are 2 hoardings here, one at front, one at back.\n\n",
    "flair": "Rant / Vent",
    "score": 323,
    "num_comments": 39,
    "created_utc": 1715673803.0,
    "convurl": "https://i.redd.it/nxomlii2nc0d1.jpeg",
    "comments": [
        "oh okay, now I get some context. Did it fall to the front on the gas station? or towards the back?",
        "Right on the Bharat Petroleum gas station.",
        "Man when the storm was happening yesterday, I was certain some would die, I am honestly surprised there was not more such incidents across the city.",
        "Others might have happened too, but this incident had a video and the death toll is high with 14 people dead, hence it is more in talks.",
        "Even the comparatively tiny hoardings I have seen have holes in them. Why the fuck did the owners not think that this massive vertical rectangle needed holes?! And why was it allowed to be erect that way?",
        "Because government officials and Netas know that common man ko apni Roz ki zindagi se time nahi milega public safety related activism ke liye. \n\nAnd wese bhi \"activism\" shabd to gaali ban chuki hai Aaj kal.",
        "There was one more incident. The metal tower one",
        "PAN-POT 🫶",
        "Activism and criticism have become gaalis. You do either of them and you will be labelled as anti-national.",
        "Exactly.",
        "Structural engineering, wind loading etc sounds like alien concepts",
        "Don't big hoardings usually have holes in them to let air flow thru?",
        "It IS Mumbai. Someone is always dying because of bad city planning and infrastructure.",
        "I have never seen the bill board which is being used with holes. I have seen these big ones having holes only when they are blank.",
        "too much on books too less regulation",
        "If the proud Marathi Manoos is ok with it, who are we to say anything.",
        "I'm just surprised no one has come out and mentioned \"Spirit of Mumbai\", it keeps moving sorta thing....",
        "Why",
        "Well, looks like this will go to the list of fallen buildings",
        "ROFL.",
        "Prolly both unfortunately :(",
        "A hoarding this big was created and cops and bmc were sleeping? \nEveryone took their hafta, they are the real culprits here.",
        "I hope everyone gets their fair share of penalties",
        "Latest news about the owner of the hoarding- \n\nhttps://indianexpress.com/article/cities/mumbai/mumbai-hoarding-owner-booked-in-rape-case-fined-at-least-21-times-for-illegal-billboards-in-past-9327704/",
        "Holder goes down\n\n\nhttps://bestmediainfo.com/mediainfo/advertising/ego-to-create-limca-book-of-records-with-largest-hoarding-claims-14-lives-4572744",
        "WTF is this shit. It permitted upto 40*40 but the fucking thing was 120*120. The piece of shit govt employees are definitely colluding.",
        "Because in India educated people are mocked as jokers.  Anyone with knowledge questions anything is made fun of. You can see it in so many movies and ads.",
        "I have never seen hoarding that big in Delhi. That thing is huge and does not look safe at all",
        "Yep. And it is difficult to just understand the size of it from that one video. That's why I thought of sharing this pic here. \n\nBy the way, the owner of that hoarding was trying to get into the Limca book of records for the biggest hoarding even though it is not legal. \n\nGazab fakiri",
        "This needs to be a national issue and everyone behind the bar also should be charged 302 not 304",
        "Wadala mein bhi hua sunne mein aaya",
        ":( sad. I wonder where did all this dust suddenly come from, all of it was from within the city? Like was that all construction dunst?",
        "Tbh Mumbai is a shithole filled with dust and dirt, it's evident from the Billboard accident the wind was enough to cause that dust storm",
        "The Hoarding guy will be booked whereas real culprits will do it again tomorrow.",
        "How could it not fall?",
        "I just found out that this wasn't just one more than necessarily large hoarding on that road. There were at least three more of similarly large size, just a few meters apart than this one that could have led to even more casualties.",
        "https://indianexpress.com/article/cities/mumbai/mumbai-hoarding-owner-booked-in-rape-case-fined-at-least-21-times-for-illegal-billboards-in-past-9327704/\n\nHe was no saint himself",
        "My cousins bullied me for being educated lol",
        "Crazy to think that this random hoarding would end up killing so many",
        "Looks small and innocuous,  easy to miss.",
        "They'll probably arrest the  poor sucker who painted it or find some randon muslim to blame.",
        "disconnect Internet and arrest the person who shot video.\nthat is expected to happen instead of protest or arrest of culprit."
    ],
    "cleaned_text": "anyone curious hoarding fell dekhke hi pata chalta hai safety risk also ek hoarding enough nahi tha hoardings one front one back ",
    "cleaned_title": "anyone curious hoarding fell",
    "cleaned_selftext": "dekhke hi pata chalta hai safety risk also ek hoarding enough nahi tha hoardings one front one back",
    "cleaned_comments": "oh okay get context fall front gas station towards back right bharat petroleum gas station man storm happening yesterday certain would die honestly surprised incidents across city others might happened incident video death toll high people dead hence talks even comparatively tiny hoardings seen holes fuck owners think massive vertical rectangle needed holes allowed erect way government officials netas know common man ko apni roz ki zindagi se time nahi milega public safety related activism ke liye wese bhi activism shabd gaali ban chuki hai aaj kal one incident metal tower one panpot activism criticism become gaalis either labelled antinational exactly structural engineering wind loading etc sounds like alien concepts dont big hoardings usually holes let air flow thru mumbai someone always dying bad city planning infrastructure never seen bill board used holes seen big ones holes blank much books less regulation proud marathi manoos ok say anything im surprised one come mentioned spirit mumbai keeps moving sorta thing well looks like go list fallen buildings rofl prolly unfortunately hoarding big created cops bmc sleeping everyone took hafta real culprits hope everyone gets fair share penalties latest news owner hoarding holder goes wtf shit permitted upto fucking thing piece shit govt employees definitely colluding india educated people mocked jokers anyone knowledge questions anything made fun see many movies ads never seen hoarding big delhi thing huge look safe yep difficult understand size one video thats thought sharing pic way owner hoarding trying get limca book records biggest hoarding even though legal gazab fakiri needs national issue everyone behind bar also charged wadala mein bhi hua sunne mein aaya sad wonder dust suddenly come within city like construction dunst tbh mumbai shithole filled dust dirt evident billboard accident wind enough cause dust storm hoarding guy booked whereas real culprits tomorrow could fall found wasnt one necessarily large hoarding road least three similarly large size meters apart one could led even casualties saint cousins bullied educated lol crazy think random hoarding would end killing many looks small innocuous easy miss theyll probably arrest poor sucker painted find randon muslim blame disconnect internet arrest person shot video expected happen instead protest arrest culprit",
    "light_cleaned_title": "If anyone is curious, this is the hoarding before it fell",
    "light_cleaned_selftext": "Dekhke hi pata chalta hai it's a safety risk. Also, ek hoarding enough nahi tha. There are 2 hoardings here, one at front, one at back.",
    "light_cleaned_comments": "oh okay, now I get some context. Did it fall to the front on the gas station? or towards the back? Right on the Bharat Petroleum gas station. Man when the storm was happening yesterday, I was certain some would die, I am honestly surprised there was not more such incidents across the city. Others might have happened too, but this incident had a video and the death toll is high with 14 people dead, hence it is more in talks. Even the comparatively tiny hoardings I have seen have holes in them. Why the fuck did the owners not think that this massive vertical rectangle needed holes?! And why was it allowed to be erect that way? Because government officials and Netas know that common man ko apni Roz ki zindagi se time nahi milega public safety related activism ke liye. And wese bhi \"activism\" shabd to gaali ban chuki hai Aaj kal. There was one more incident. The metal tower one PAN-POT 🫶 Activism and criticism have become gaalis. You do either of them and you will be labelled as anti-national. Exactly. Structural engineering, wind loading etc sounds like alien concepts Don't big hoardings usually have holes in them to let air flow thru? It IS Mumbai. Someone is always dying because of bad city planning and infrastructure. I have never seen the bill board which is being used with holes. I have seen these big ones having holes only when they are blank. too much on books too less regulation If the proud Marathi Manoos is ok with it, who are we to say anything. I'm just surprised no one has come out and mentioned \"Spirit of Mumbai\", it keeps moving sorta thing.... Why Well, looks like this will go to the list of fallen buildings ROFL. Prolly both unfortunately :( A hoarding this big was created and cops and bmc were sleeping? Everyone took their hafta, they are the real culprits here. I hope everyone gets their fair share of penalties Latest news about the owner of the hoarding- Holder goes down WTF is this shit. It permitted upto 40*40 but the fucking thing was 120*120. The piece of shit govt employees are definitely colluding. Because in India educated people are mocked as jokers. Anyone with knowledge questions anything is made fun of. You can see it in so many movies and ads. I have never seen hoarding that big in Delhi. That thing is huge and does not look safe at all Yep. And it is difficult to just understand the size of it from that one video. That's why I thought of sharing this pic here. By the way, the owner of that hoarding was trying to get into the Limca book of records for the biggest hoarding even though it is not legal. Gazab fakiri This needs to be a national issue and everyone behind the bar also should be charged 302 not 304 Wadala mein bhi hua sunne mein aaya :( sad. I wonder where did all this dust suddenly come from, all of it was from within the city? Like was that all construction dunst? Tbh Mumbai is a shithole filled with dust and dirt, it's evident from the Billboard accident the wind was enough to cause that dust storm The Hoarding guy will be booked whereas real culprits will do it again tomorrow. How could it not fall? I just found out that this wasn't just one more than necessarily large hoarding on that road. There were at least three more of similarly large size, just a few meters apart than this one that could have led to even more casualties. He was no saint himself My cousins bullied me for being educated lol Crazy to think that this random hoarding would end up killing so many Looks small and innocuous, easy to miss. They'll probably arrest the poor sucker who painted it or find some randon muslim to blame. disconnect Internet and arrest the person who shot video. that is expected to happen instead of protest or arrest of culprit."
}