{
    "id": "16mohmh",
    "title": "Govt brings in women’s reservation Bill: One-third of seats to be reserved, also in SC/ST quota",
    "url": "https://indianexpress.com/article/political-pulse/govt-brings-in-womens-reservation-bill-one-third-of-seats-reserved-also-in-sc-st-quota-parliament-8946943/",
    "selftext": "First seats to be reserved for women after delimitation following Census; rotation to happen only after next delimitation",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1695123091.0,
    "convurl": "https://external-preview.redd.it/A_NWOWgkevQ-g5gnonDgls6kskVM8Z9VnO1xCIZfG14.jpg?auto=webp&s=691990bd9b2e59e30fe9e0948d42e3eee56540aa",
    "comments": [
        ">The Bill, which seeks to insert clause (1) in Article 330 A to reserve seats for women, says by another clause that one-third of the seats reserved for SCs and STs in the Lok Sabha be reserved for women from these categories, and a third clause on keeping aside, as nearly as possible, one-third of the total seats filled by direct election to the Lok Sabha for women.\n\n>Extending the same principle, the Bill seeks to amend Article 332 A to mandate women’s reservation in Legislative Assemblies, plus other amendments in the Article to keep one-third of SC/ST seats for women in the category, and, 33% of all seats – as nearly as possible – filled by direct election for women.\n\n>",
        "When 2028 ?",
        "Delimitation exercise will give more power to North India. The progressive politics of gender equality will never remain diluted.",
        "2029ish"
    ],
    "cleaned_text": "govt brings womens reservation bill onethird seats reserved also scst quota first seats reserved women delimitation following census rotation happen next delimitation ",
    "cleaned_title": "govt brings womens reservation bill onethird seats reserved also scst quota",
    "cleaned_selftext": "first seats reserved women delimitation following census rotation happen next delimitation",
    "cleaned_comments": "bill seeks insert clause article reserve seats women says another clause onethird seats reserved scs sts lok sabha reserved women categories third clause keeping aside nearly possible onethird total seats filled direct election lok sabha women extending principle bill seeks amend article mandate womens reservation legislative assemblies plus amendments article keep onethird scst seats women category seats nearly possible filled direct election women delimitation exercise give power north india progressive politics gender equality never remain diluted ish",
    "light_cleaned_title": "Govt brings in women’s reservation Bill: One-third of seats to be reserved, also in SC/ST quota",
    "light_cleaned_selftext": "First seats to be reserved for women after delimitation following Census; rotation to happen only after next delimitation",
    "light_cleaned_comments": ">The Bill, which seeks to insert clause (1) in Article 330 A to reserve seats for women, says by another clause that one-third of the seats reserved for SCs and STs in the Lok Sabha be reserved for women from these categories, and a third clause on keeping aside, as nearly as possible, one-third of the total seats filled by direct election to the Lok Sabha for women. >Extending the same principle, the Bill seeks to amend Article 332 A to mandate women’s reservation in Legislative Assemblies, plus other amendments in the Article to keep one-third of SC/ST seats for women in the category, and, 33% of all seats – as nearly as possible – filled by direct election for women. > When 2028 ? Delimitation exercise will give more power to North India. The progressive politics of gender equality will never remain diluted. 2029ish"
}