{
    "id": "16iat6o",
    "title": "Influencer Sarah sarosh irresponsible driver",
    "url": "https://www.reddit.com/r/india/comments/16iat6o/influencer_sarah_sarosh_irresponsible_driver/",
    "selftext": "This women has been vlogging, doing her makeup while driving making the roads unsafe for others. She is a youtuber n this is how she is influencing. Please retweet the video and tag Mumbai police and Mumbai traffic police.\n\nhttps://x.com/rubz1010/status/1701653094638182846?s=46&t=Aa5oH_4SdKNj2CV9n67IlA",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694672994.0,
    "convurl": "https://external-preview.redd.it/Oj0v58RcQioqrT97XqQocAPhTF1l9cjUPMzuJVd6IG4.jpg?auto=webp&s=22d03267f289563f5398da17693e2e997477fa02",
    "comments": [
        "I hope she gets booked these people are a menace on the road.\n\n>Influencer\nShe's not an influencer she's influenza.\n\nInfluenza : A virus that promotes products and services on Instagram and tries to take viral photos as a marketing gimmick in exchange for being transmitted between humans. \n\nExample: Sarah Sarosh \n\nInfluencer : one who exerts influence : a person who inspires or guides the actions of others\n\nExample: Noel Deyzel",
        "YouTube\n\nSee Indian channel with gaming content and stupid brain-dead shit\n\nLong tap\n\nDon't recommend channel",
        "Wrong sub dude .Post in instacelebgossip. \n\nAlso idk file online complaint or tag twitter mumbai police if you are so infuriated by it .Would like to see if any action will be taken",
        "Already posted it on that sub.",
        "Ya saw the Twitter thread but Mumbai police isnt responding very weird"
    ],
    "cleaned_text": "influencer sarah sarosh irresponsible driver women vlogging makeup driving making roads unsafe others youtuber n influencing please retweet video tag mumbai police mumbai traffic police ",
    "cleaned_title": "influencer sarah sarosh irresponsible driver",
    "cleaned_selftext": "women vlogging makeup driving making roads unsafe others youtuber n influencing please retweet video tag mumbai police mumbai traffic police",
    "cleaned_comments": "hope gets booked people menace road influencer shes influencer shes influenza influenza virus promotes products services instagram tries take viral photos marketing gimmick exchange transmitted humans example sarah sarosh influencer one exerts influence person inspires guides actions others example noel deyzel youtube see indian channel gaming content stupid braindead shit long tap dont recommend channel wrong sub dude post instacelebgossip also idk file online complaint tag twitter mumbai police infuriated would like see action taken already posted sub ya saw twitter thread mumbai police isnt responding weird",
    "light_cleaned_title": "Influencer Sarah sarosh irresponsible driver",
    "light_cleaned_selftext": "This women has been vlogging, doing her makeup while driving making the roads unsafe for others. She is a youtuber n this is how she is influencing. Please retweet the video and tag Mumbai police and Mumbai traffic police.",
    "light_cleaned_comments": "I hope she gets booked these people are a menace on the road. >Influencer She's not an influencer she's influenza. Influenza : A virus that promotes products and services on Instagram and tries to take viral photos as a marketing gimmick in exchange for being transmitted between humans. Example: Sarah Sarosh Influencer : one who exerts influence : a person who inspires or guides the actions of others Example: Noel Deyzel YouTube See Indian channel with gaming content and stupid brain-dead shit Long tap Don't recommend channel Wrong sub dude .Post in instacelebgossip. Also idk file online complaint or tag twitter mumbai police if you are so infuriated by it .Would like to see if any action will be taken Already posted it on that sub. Ya saw the Twitter thread but Mumbai police isnt responding very weird"
}