{
    "id": "1esbi6h",
    "title": "Midnight Rally Kolkata ",
    "url": "https://www.reddit.com/gallery/1esbi6h",
    "selftext": "A mass protest was conducted across Bengal today  after the rape and murder of a post graduate medical trainee at RG Kar Medical College.\n\n\nWhen Nirbhaya incident happened, victim Dr Moumita was approximately 19years old. She must've thought India will change for better. After 12years, same horrendous incident is repeated. \n\nDisgusting",
    "flair": "Law & Courts",
    "score": 36,
    "num_comments": 12,
    "created_utc": 1723666520.0,
    "convurl": "https://i.redd.it/y64l1cbitoid1.jpg",
    "comments": [
        "Isn't there a attack happened on them?",
        "Yrs bto just saw the video it's terrifying",
        "TMC mobs are attacking rg kar to destroy evidence I think",
        "I tried posting the video here. It was getting removed again and again",
        "Wtf",
        "It's Still under attack",
        "I also heard someone saying that they are attacking the hostels now!",
        "They are trying to demolish the entire crime scene and blame it on the protestors, and terrorising the students so that they quit this protest.",
        "[Goons trying to enter the girls hostel!](https://www.reddit.com/r/indianmedschool/s/d0NmRpTy5x)",
        " saari neend uda di, ab poori raat ese hi nikalegi tension me",
        "Yes, students were sitting with pepper spray and sticks @ 3am"
    ],
    "cleaned_text": "midnight rally kolkata mass protest conducted across bengal today rape murder post graduate medical trainee rg kar medical college nirbhaya incident happened victim dr moumita approximately years old mustve thought india change better years horrendous incident repeated disgusting ",
    "cleaned_title": "midnight rally kolkata",
    "cleaned_selftext": "mass protest conducted across bengal today rape murder post graduate medical trainee rg kar medical college nirbhaya incident happened victim dr moumita approximately years old mustve thought india change better years horrendous incident repeated disgusting",
    "cleaned_comments": "isnt attack happened yrs bto saw video terrifying tmc mobs attacking rg kar destroy evidence think tried posting video getting removed wtf still attack also heard someone saying attacking hostels trying demolish entire crime scene blame protestors terrorising students quit protest goons trying enter girls hostelhttpswwwredditcomrindianmedschoolsdnmrptyx saari neend uda di ab poori raat ese hi nikalegi tension yes students sitting pepper spray sticks",
    "light_cleaned_title": "Midnight Rally Kolkata",
    "light_cleaned_selftext": "A mass protest was conducted across Bengal today after the rape and murder of a post graduate medical trainee at RG Kar Medical College. When Nirbhaya incident happened, victim Dr Moumita was approximately 19years old. She must've thought India will change for better. After 12years, same horrendous incident is repeated. Disgusting",
    "light_cleaned_comments": "Isn't there a attack happened on them? Yrs bto just saw the video it's terrifying TMC mobs are attacking rg kar to destroy evidence I think I tried posting the video here. It was getting removed again and again Wtf It's Still under attack I also heard someone saying that they are attacking the hostels now! They are trying to demolish the entire crime scene and blame it on the protestors, and terrorising the students so that they quit this protest. [Goons trying to enter the girls hostel!](https://www.reddit.com/r/indianmedschool/s/d0NmRpTy5x) saari neend uda di, ab poori raat ese hi nikalegi tension me Yes, students were sitting with pepper spray and sticks @ 3am"
}