{
    "id": "1bigxdn",
    "title": "What is the punishment for counterfeiting currency? ",
    "url": "https://www.reddit.com/r/india/comments/1bigxdn/what_is_the_punishment_for_counterfeiting_currency/",
    "selftext": "A guy from our area was arrested in Jan 2021 carrying large sum of counterfeit currency notes. This guy and his Co conspirators were found with total of 35L+ of fake notes. I have the misfortune of knowing this bastard personally as he used to work for us. Swindled us out of some money and lodged a false assault complaint against us (which was dismissed by the police after some interrogation and some witness testimony) then we kept hearing from the grapevine how this guy tried a lot of businesses conning a lot of people and got beaten up badly, twice. During demonetisation, he was offering to 'clean' the money for a 20% cut. Then my dad sent me a newspaper clipping with his photo for being arrested in the fake money matter.\n\nThis guy is actually very talented. He can sweet talk anyone out of their money. I have seen this guy easily selling a 10k thing for 16k. If he had done business cleanly then he would have been a millionaire by now. But no. He wanted to do everything the wrong way only. \n\nExample: \n\n1)  he would promise builders with vacant commercial property that he can sell the shops within a few months and obtained keys for the shops. (The builders generally stay far away so they can not pay attention to these 2-3 vacant shops as they have bigger fish to fry somewhere else). Then he would open his makeshift shops of wholesale goods (which does not need any more furniture than a table and a chair.). Run his shops till the builder noticed which could take 4 to 6 months. \n\n2) Open shop near to another business with a very similar name dealing similar goods. And similar sign/logo. Like for a real example : Legitimate business name: Star Enterprise. His fake shop name: Stars Enterprise. Then run the shop for a couple of months taking lot of goods on credit/take money from prospective customers against delivery of goods. And then abscond. The creditors would then come and hound the other guy as they see a similar name and signboard. \n\n\nBack to my question. I saw this guy shopping at a grocery store a few weeks ago. HOW THE HELL IS THIS GUY OUT OF JAIL? Isn't counterfeiting one of the most serious crimes?\n\nHere is a link to the news article of his arrest: \n\n\nhttps://www.hindustantimes.com/cities/mumbai-news/mumbai-police-bust-fake-currency-racket-4-held-with-35-54-lakh-in-counterfeit-notes-101611776823145.html",
    "flair": "Crime",
    "score": 8,
    "num_comments": 9,
    "created_utc": 1710843698.0,
    "convurl": "https://external-preview.redd.it/4YMq4Fa_KirbzDPLxp4RuUJPoEF4X6bAoz3FipmtGwY.jpg?auto=webp&s=db8805ed4ece3874e56da724b98871ff096c4f81",
    "comments": [
        "In a country where real criminals who committed heinous crimes, get bail and parole citing good behavior or attending some marriage, this isn't surprising.",
        "The irony of this is that his brother is extremely respected member of his society. The brother kicked him out long time ago and cut ties.",
        ">If he had done business cleanly then he would have been a millionaire by now.\n\nAmbani and Adani begs to differ.",
        "> Whoever counterfeits, or knowingly performs any part of the process of counterfeiting, any currency-note or bank-note, shall be punished with (imprisonment for life), or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.\n\nThe courts may not give the highest penalty in all cases. Moreover, this is a bailable offense.",
        "Yeah but still being out in 3 years is very concerning.",
        "Well, they did it cleverly. Not leaving too many crumbs behind. This guy had the intent, the drive to commit crimes. Just not clever enough in that department. He failed every time. If he had stayed honest, he would have become a good merchant/insurance agent/mutual fund consultant etc. He could convince people easily.",
        ">If he had stayed honest, he would have become a good merchant/insurance agent/mutual fund consultant etc.\n\nYes, but not rich.",
        "Sounds like typical Akshay Kumar characters in movies.",
        "Lol."
    ],
    "cleaned_text": "punishment counterfeiting currency guy area arrested jan carrying large sum counterfeit currency notes guy co conspirators found total l fake notes misfortune knowing bastard personally used work us swindled us money lodged false assault complaint us dismissed police interrogation witness testimony kept hearing grapevine guy tried lot businesses conning lot people got beaten badly twice demonetisation offering clean money cut dad sent newspaper clipping photo arrested fake money matter guy actually talented sweet talk anyone money seen guy easily selling k thing k done business cleanly would millionaire wanted everything wrong way example would promise builders vacant commercial property sell shops within months obtained keys shops builders generally stay far away pay attention vacant shops bigger fish fry somewhere else would open makeshift shops wholesale goods need furniture table chair run shops till builder noticed could take months open shop near another business similar name dealing similar goods similar signlogo like real example legitimate business name star enterprise fake shop name stars enterprise run shop couple months taking lot goods credittake money prospective customers delivery goods abscond creditors would come hound guy see similar name signboard back question saw guy shopping grocery store weeks ago hell guy jail isnt counterfeiting one serious crimes link news article arrest ",
    "cleaned_title": "punishment counterfeiting currency",
    "cleaned_selftext": "guy area arrested jan carrying large sum counterfeit currency notes guy co conspirators found total l fake notes misfortune knowing bastard personally used work us swindled us money lodged false assault complaint us dismissed police interrogation witness testimony kept hearing grapevine guy tried lot businesses conning lot people got beaten badly twice demonetisation offering clean money cut dad sent newspaper clipping photo arrested fake money matter guy actually talented sweet talk anyone money seen guy easily selling k thing k done business cleanly would millionaire wanted everything wrong way example would promise builders vacant commercial property sell shops within months obtained keys shops builders generally stay far away pay attention vacant shops bigger fish fry somewhere else would open makeshift shops wholesale goods need furniture table chair run shops till builder noticed could take months open shop near another business similar name dealing similar goods similar signlogo like real example legitimate business name star enterprise fake shop name stars enterprise run shop couple months taking lot goods credittake money prospective customers delivery goods abscond creditors would come hound guy see similar name signboard back question saw guy shopping grocery store weeks ago hell guy jail isnt counterfeiting one serious crimes link news article arrest",
    "cleaned_comments": "country real criminals committed heinous crimes get bail parole citing good behavior attending marriage isnt surprising irony brother extremely respected member society brother kicked long time ago cut ties done business cleanly would millionaire ambani adani begs differ whoever counterfeits knowingly performs part process counterfeiting currencynote banknote shall punished imprisonment life imprisonment either description term may extend ten years shall also liable fine courts may give highest penalty cases moreover bailable offense yeah still years concerning well cleverly leaving many crumbs behind guy intent drive commit crimes clever enough department failed every time stayed honest would become good merchantinsurance agentmutual fund consultant etc could convince people easily stayed honest would become good merchantinsurance agentmutual fund consultant etc yes rich sounds like typical akshay kumar characters movies lol",
    "light_cleaned_title": "What is the punishment for counterfeiting currency?",
    "light_cleaned_selftext": "A guy from our area was arrested in Jan 2021 carrying large sum of counterfeit currency notes. This guy and his Co conspirators were found with total of 35L+ of fake notes. I have the misfortune of knowing this bastard personally as he used to work for us. Swindled us out of some money and lodged a false assault complaint against us (which was dismissed by the police after some interrogation and some witness testimony) then we kept hearing from the grapevine how this guy tried a lot of businesses conning a lot of people and got beaten up badly, twice. During demonetisation, he was offering to 'clean' the money for a 20% cut. Then my dad sent me a newspaper clipping with his photo for being arrested in the fake money matter. This guy is actually very talented. He can sweet talk anyone out of their money. I have seen this guy easily selling a 10k thing for 16k. If he had done business cleanly then he would have been a millionaire by now. But no. He wanted to do everything the wrong way only. Example: 1) he would promise builders with vacant commercial property that he can sell the shops within a few months and obtained keys for the shops. (The builders generally stay far away so they can not pay attention to these 2-3 vacant shops as they have bigger fish to fry somewhere else). Then he would open his makeshift shops of wholesale goods (which does not need any more furniture than a table and a chair.). Run his shops till the builder noticed which could take 4 to 6 months. 2) Open shop near to another business with a very similar name dealing similar goods. And similar sign/logo. Like for a real example : Legitimate business name: Star Enterprise. His fake shop name: Stars Enterprise. Then run the shop for a couple of months taking lot of goods on credit/take money from prospective customers against delivery of goods. And then abscond. The creditors would then come and hound the other guy as they see a similar name and signboard. Back to my question. I saw this guy shopping at a grocery store a few weeks ago. HOW THE HELL IS THIS GUY OUT OF JAIL? Isn't counterfeiting one of the most serious crimes? Here is a link to the news article of his arrest:",
    "light_cleaned_comments": "In a country where real criminals who committed heinous crimes, get bail and parole citing good behavior or attending some marriage, this isn't surprising. The irony of this is that his brother is extremely respected member of his society. The brother kicked him out long time ago and cut ties. >If he had done business cleanly then he would have been a millionaire by now. Ambani and Adani begs to differ. > Whoever counterfeits, or knowingly performs any part of the process of counterfeiting, any currency-note or bank-note, shall be punished with (imprisonment for life), or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine. The courts may not give the highest penalty in all cases. Moreover, this is a bailable offense. Yeah but still being out in 3 years is very concerning. Well, they did it cleverly. Not leaving too many crumbs behind. This guy had the intent, the drive to commit crimes. Just not clever enough in that department. He failed every time. If he had stayed honest, he would have become a good merchant/insurance agent/mutual fund consultant etc. He could convince people easily. >If he had stayed honest, he would have become a good merchant/insurance agent/mutual fund consultant etc. Yes, but not rich. Sounds like typical Akshay Kumar characters in movies. Lol."
}