{
    "id": "1ckq197",
    "title": "High-paying IIT jobs a myth? Top grads settle for as low as Rs 6 lakh as placements dry up",
    "url": "https://m.economictimes.com/jobs/hr-policies-trends/iit-graduates-struggle-with-limited-placement-opportunities-and-lower-salary-packages/articleshow/109490427.cms",
    "selftext": "\n",
    "flair": "Policy/Economy",
    "score": 395,
    "num_comments": 68,
    "created_utc": 1714911702.0,
    "convurl": "https://external-preview.redd.it/0JC_e828oHsWRR_LtMXrF-QK1Q8_s8gNQsedq7SEcyo.jpg?auto=webp&s=9ae3dc09abc347cc57a57cb0a4615a5f48ee4a00",
    "comments": [
        "> An IIT-Kharagpur student said that Spectrum Technologies offered Rs 3.6 LPA for trainee engineers, Rs 6L for trainee design engineers \n\nNot sure what is store for next 4 years.",
        "As someone too familiar with placements at IITs(I was part of one in 2017), it’s quite obvious what the root cause is. IITs aren’t really that good at placing people in non-software companies. Until recently, the demand for software jobs was very high and that reflected in the high number of placements. But, now, software industry is in a downturn and also, there has been a deluge of CS graduates, including non IITians. An IIT non-CS student isn’t much better than a CS student from a tier-2 university. So, that advantage is gone.\n\nWhat we are seeing is a market correction of inflated IIT placement numbers. And, it will sustain in the future too.",
        "How bad is situation for non computer jobs? My daughter is preparing for jee advanced but may choose private college ( Manipal /BITS/VIT etc) to stay in CS. \n\nHow good are NITs or IIITs ( Indian institutes of information technology) for non CS branches",
        "This was pretty common previous years too, median hovered around 15-20 lpa in old iits and lowest was around 4 lpa. The thing that is different this year is that the companies that used to hire 8 people now hire 3, due to recession.",
        "The technology cycle has taken a downturn it will take few years to recover, every generation has to face the music",
        "Totally depends on the branch and the college, some top IIITs had pretty normal placements this year but NITs [suffered](https://np.reddit.com/r/JEENEETards/comments/1cdx8i2/placement_of_nit_allahabad_prayagraj/) a lot.\n\nAlso BITS > Manipal > VIT generally.",
        "This is so true. In good time Highest package makes headlines, in bad its the lowest.\n\n\nPeople forget medians at an annual level (no 1cr package with 70% ESOPs vesting over 5 years).",
        "We're all fucked. The government only knows how to do Hindu Muslim. If something goes wrong in the economy they'll blame Muslims. They always have some stupid oversmart answer ready instead of coming up with solutions.",
        "IITs are stuck in the 90s. They still claim there isn’t enough talent to fill jobs. The faculty are extremely average now and it’s just stuck in the past. IIT tags really don’t mean much anymore.",
        "Keep working hard for life even after hair turns grey (my random nose hair sometimes comes out as grey (≧∀≦)\n\nMatric karlo beta, phir mauj hi mauj hai…\\\nBoards karlo beta, phir mauj hi mauj hai…\\\nYe bhi karlo, uske baad mauj hi mauj...\n\nDon't work hard expecting to punish yourself only upto some point in life, this is a scam.\n\nOf course one needs to work hard but not because of \"uske baad aish hi aish hai\" - work hard like an artist and only if you're into it, maybe as a chef or as a CA or as a politician but don't jump into IIT and engineering from conformist mindset.",
        "Yes and back in 2015 there were quite a few IIM grads who did not find any placements, period.\n\nThe headline numbers you hear is always the cream of the crop. As in everything there are students who study at the top institutions who are not really employable after graduation and they  do get paid less.",
        "The Modi effect ... wait to watch what happens if he wins a third term.",
        "Dude do you even use common sense? The whole world is going through a recession. Most tech companies are laying off people to downsize and are hiring less too. \n\nNot every problem is political, so maybe go out of reddit once in a while to understand this basic fact.",
        "When the \"as low as\" amount is a lot more than your current salary :(",
        "Dude, sorry to break the news to you, the whole world is not going through a recession. Did you learn that from WhatsApp university? It is only the IT sector that is in pressure, the manufacturing is doing very well in most countries. You probably equate IIT to IT? Don't make that mistake! The EU just had [a good rebound](https://english.news.cn/20240501/fbaadecb6da04229847bf7e0b9632652/c.html) and is doing well overall; the U.S. is doing [fantastically well](https://www.ft.com/content/90b70efb-b0e6-4054-a650-132401b1b975) under Biden.\n\nIndia's problems are only partially forced upon by the global events, most are its own. But bhakts won't learn.",
        "Or just move abroad after a 2-3 years of experience. The easiest route.",
        "Galti kiski hey?",
        "No, going abroad is getting very difficult in general . But with IIT tag going abroad may be easier ( than from other colleges)",
        "And it's natural that with the given tremendous amount of youth population it is natural to have a recession, the political problem is that the government isn't even willing to recognise this problem.",
        "thats very true",
        "Nah the hiring managers still love that tag.",
        "Don't know about whole world but USA is is bad shape from the last 6 months a\nAbout 85% reduction in IT hiring.",
        "Downturn definitely. But we don't know if the it jobs we have now will go back up. Because profits of companies are all time high and even their operating leverage. In downturn profits become low and so does operating leverage. \n\nSo the current downcycle can also mean the it jobs we had till now might be replaced with something new.",
        "Yes, as I said, IT hiring is not doing well recently, but IIT does not teach IT only. Jobs are doing very well, otherwise, across the world, but not in India: cue Modi.",
        "The government is busy building \"smart\" everything, rather than building smart people (investing in education). At a time when AI is at your doorstep or even has already entered the home, a government that keeps reducing the budget on education and wants just factory slaves and Hindu-Muslim rioters ... how self-destructive this is! And the people who vote for them? Gosh, they are on a highway to hell!",
        "Casteist fucks who vote for idiots who open doors of moving aircrafts \"by mistake\" and create mutual funds of mutual funds,  because \"merit\".",
        "Exactly. People claiming ai is not getting rid of jobs are forgetting automation is reducing jobs even without ai.",
        "Exactly this. My development team without ai would be double in size but now we pay for many ai services which has improved productivity.",
        "Which college in India is better then? Let’s say we discuss CS .\n\nAnything better than Old IIT CS branches in India? And if this is the case - do Google or Meta or MIT or Stanford agree with your ranking ? \n\nDon’t think so .",
        "Bhai kuch bhi. If anything the IITs are now having a resurgence.",
        "I will kill to get one of these so called low paying jobs 😭",
        "Yeah faculty are extremely average now ~ says someone who never went to IIT",
        "This is actually good. The fad that have been going around IITs have produced one of the lowest skilled generation of graduates in India. No fundamental understanding only problem solving. IIT fad should die so govt can take a look at this problem and improve standardized testing.",
        "> iversity? It is only the IT sector that is in pressure, the manufacturing is doing very well in most countries. You probably equate IIT to IT? Don't ma\n\nGovernment published growth rate of 8.x %, that is not recession. That's massive growth.",
        "Nah... This is a fundamental misunderstanding of what IIT or other top universities are. It's not the training you receive there that employers value. \n\nIt's a signaling device that you are a highly intelligent person. That's the sole reason that some companies only hire fro Harvard, or IIT, or xyz.",
        "Umm….like most faculty at IITs.",
        "Old IITs CS are a different game altogether. They’re great because of the quality of students. But I reckon CS salaries from other colleges are catching up for Indian grads. \n\nPersonally, I don’t rate IIT masters or PhDs (even CS) and it gets worse at faculty level. Have you seen the kind of science published these days?",
        "Absolutely agree. The market reflects this. For technical jobs I get why old IIT btechs from specific branches are amazing. I’m referring to the job market in India that requires increasingly diverse  set of skills",
        "I agree to your second point that IIT graduate students are probably not that great.",
        "Lmao nobody gives a flying fuck what college you are from, when you go abroad.\n\nFirst off, getting hired as a fresher is almost never going to happen. The only way to get hired abroad is via your actual work experience and job credentials.",
        "Companies have mostly stopped moving people abroad nowadays. Even the big FAANG companies are now eliminating roles in US and opening them in India, and actively blocking out of country transfers from LCOL areas to HCOL areas.",
        "I thought it was the global tech slowdown",
        "It’s a common misconception that most premier education institute students end up with high paying jobs right out the gate. I’m sure there are many (at least 20% or so of old IITs, top NITs etc) who start at 3-8LPA. What differentiates them is their growth path/switching after that first job. Network effects and brand value play a huge role. Many jobs advertise as ordinary college + MBA or IIT + 2 years experience. Know many guys who started at 3-5LPA and doing 50-75LPA within 6-8 years with several avenues for further growth still open. One of the key things I guess they did is they switched their line of work whenever it was necessary/more financially sensible.",
        "This reminds me of Subramaniam Swamy's recent statement that India's GDP number are false, real value is at around 4% and we will be seeing repercussions of this clearly in the next few years.",
        "apni!.... 100% TRUTH!..par koi maane ke liye tayar nahin hai!",
        "Absolutely!",
        "going to be tough\n\nAI will keep eating into lower tier tech and support jobs\n\nBe in the top 5% of talent or be prepared for poverty wages",
        "As a person who knows the difference between your private college and an IIT, I highly recommend you to start educating yourself and talking to industry professionals. ",
        "Which private college did I go to? Sharma Institute of Technology?",
        "r/usernamechecksout",
        "Whats the difference between design engineers vs designers ? I am pursuing design, does this mean the future is good for us ?",
        "that's why I didn't get troubled by not being able to get in IIT or NIT, because IT is a field where if you put enough hardwork you can get a lovely job, doesn't matter how shit college you have.",
        "It's all bogeyman tactics trying to say the hiring is not happening because of AI and whatnot. The reality is that due to monetary tightening with the fed in the US, VC money has dried up and hence the outrageous pay packages as well.\n\nThings are returning back to pre-Covid levels and lower and at the same time firms are hiring less because they want to become profitable at the cost of work-life balance of the employees and making employees work overtime without pay as is usual in India.",
        "Things are turning harder. Canada is awful, Australia is about to reach it's limits. UK is in a bad condition, Europe is not as easy as people think.  \nIt is only people here who haven't stepped abroad think it is easy. Once, you move abroad, it is way harder than anyone can imagine.",
        "Just a question will it recover and greaty improve if Rahul papu gets elected ?  \nWhat kind of idiotic attitude is this?  \nThere is slower hiring in Europe since last year. It will take sometime to rebound.",
        "It is bloody 0.3 % and it started this Quarter. Europe was in slumber last year.  \n[https://edition.cnn.com/2024/01/30/economy/europe-dodges-recession-2023/index.html](https://edition.cnn.com/2024/01/30/economy/europe-dodges-recession-2023/index.html)",
        "Sorry, jobs are doing well in Europe too, and doing fantastically well in the U.S.: do not source your information from WhatsApp university. And, of course, India's ills were brought about by a completely incompetent PM who rules currently, and if he goes, things would look up to some extent, but the incompetent PM has already wrought too much damage to India, some of it irreversible.",
        "Dear oh dear, the logic of those who are supposedly educated. 0.3% growth for a country already developed like Germany and slow growth for a country like India who is far behind even China (another developing country) are very different things.",
        "For a smart guy like you who knows that developed economies grow slowly, you didn't know that they should also have lower unemployment rates lol!  \nBut all you want to engage is shaming people who oppose you okay.  \nBTW the graph is at 5.5 in the x-axis if you didn't see it.",
        "Being a developed economy has no correlation with unemployment rate! I think I am done now talking with a WhatsApp university graduate."
    ],
    "cleaned_text": "highpaying iit jobs myth top grads settle low rs lakh placements dry  ",
    "cleaned_title": "highpaying iit jobs myth top grads settle low rs lakh placements dry",
    "cleaned_selftext": "",
    "cleaned_comments": "iitkharagpur student said spectrum technologies offered rs lpa trainee engineers rs l trainee design engineers sure store next years someone familiar placements iitsi part one quite obvious root cause iits arent really good placing people nonsoftware companies recently demand software jobs high reflected high number placements software industry downturn also deluge cs graduates including non iitians iit noncs student isnt much better cs student tier university advantage gone seeing market correction inflated iit placement numbers sustain future bad situation non computer jobs daughter preparing jee advanced may choose private college manipal bitsvit etc stay cs good nits iiits indian institutes information technology non cs branches pretty common previous years median hovered around lpa old iits lowest around lpa thing different year companies used hire people hire due recession technology cycle taken downturn take years recover every generation face music totally depends branch college top iiits pretty normal placements year nits sufferedhttpsnpredditcomrjeeneetardscommentscdxiplacementofnitallahabadprayagraj lot also bits manipal vit generally true good time highest package makes headlines bad lowest people forget medians annual level cr package esops vesting years fucked government knows hindu muslim something goes wrong economy theyll blame muslims always stupid oversmart answer ready instead coming solutions iits stuck still claim isnt enough talent fill jobs faculty extremely average stuck past iit tags really dont mean much anymore keep working hard life even hair turns grey random nose hair sometimes comes grey matric karlo beta phir mauj hi mauj hai boards karlo beta phir mauj hi mauj hai ye bhi karlo uske baad mauj hi mauj dont work hard expecting punish upto point life scam course one needs work hard uske baad aish hi aish hai work hard like artist youre maybe chef ca politician dont jump iit engineering conformist mindset yes back quite iim grads find placements period headline numbers hear always cream crop everything students study top institutions really employable graduation get paid less modi effect wait watch happens wins third term dude even use common sense whole world going recession tech companies laying people downsize hiring less every problem political maybe go reddit understand basic fact low amount lot current salary dude sorry break news whole world going recession learn whatsapp university sector pressure manufacturing well countries probably equate iit dont make mistake eu good reboundhttpsenglishnewscnfbaadecbdabfebchtml well overall us fantastically wellhttpswwwftcomcontentbefbbeabb biden indias problems partially forced upon global events bhakts wont learn move abroad years experience easiest route galti kiski hey going abroad getting difficult general iit tag going abroad may easier colleges natural given tremendous amount youth population natural recession political problem government isnt even willing recognise problem thats true nah hiring managers still love tag dont know whole world usa bad shape last months reduction hiring downturn definitely dont know jobs go back profits companies time high even operating leverage downturn profits become low operating leverage current downcycle also mean jobs till might replaced something new yes said hiring well recently iit teach jobs well otherwise across world india cue modi government busy building smart everything rather building smart people investing education time ai doorstep even already entered home government keeps reducing budget education wants factory slaves hindumuslim rioters selfdestructive people vote gosh highway hell casteist fucks vote idiots open doors moving aircrafts mistake create mutual funds mutual funds merit exactly people claiming ai getting rid jobs forgetting automation reducing jobs even without ai exactly development team without ai would double size pay many ai services improved productivity college india better lets say discuss cs anything better old iit cs branches india case google meta mit stanford agree ranking dont think bhai kuch bhi anything iits resurgence kill get one called low paying jobs yeah faculty extremely average says someone never went iit actually good fad going around iits produced one lowest skilled generation graduates india fundamental understanding problem solving iit fad die govt take look problem improve standardized testing iversity sector pressure manufacturing well countries probably equate iit dont government published growth rate x recession thats massive growth nah fundamental misunderstanding iit top universities training receive employers value signaling device highly intelligent person thats sole reason companies hire fro harvard iit xyz ummlike faculty iits old iits cs different game altogether theyre great quality students reckon cs salaries colleges catching indian grads personally dont rate iit masters phds even cs gets worse faculty level seen kind science published days absolutely agree market reflects technical jobs get old iit btechs specific branches amazing im referring job market india requires increasingly diverse set skills agree second point iit graduate students probably great lmao nobody gives flying fuck college go abroad first getting hired fresher almost never going happen way get hired abroad via actual work experience job credentials companies mostly stopped moving people abroad nowadays even big faang companies eliminating roles us opening india actively blocking country transfers lcol areas hcol areas thought global tech slowdown common misconception premier education institute students end high paying jobs right gate im sure many least old iits top nits etc start lpa differentiates growth pathswitching first job network effects brand value play huge role many jobs advertise ordinary college mba iit years experience know many guys started lpa lpa within years several avenues growth still open one key things guess switched line work whenever necessarymore financially sensible reminds subramaniam swamys recent statement indias gdp number false real value around seeing repercussions clearly next years apni truthpar koi maane ke liye tayar nahin hai absolutely going tough ai keep eating lower tier tech support jobs top talent prepared poverty wages person knows difference private college iit highly recommend start educating talking industry professionals private college go sharma institute technology rusernamechecksout whats difference design engineers vs designers pursuing design mean future good us thats didnt get troubled able get iit nit field put enough hardwork get lovely job doesnt matter shit college bogeyman tactics trying say hiring happening ai whatnot reality due monetary tightening fed us vc money dried hence outrageous pay packages well things returning back precovid levels lower time firms hiring less want become profitable cost worklife balance employees making employees work overtime without pay usual india things turning harder canada awful australia reach limits uk bad condition europe easy people think people havent stepped abroad think easy move abroad way harder anyone imagine question recover greaty improve rahul papu gets elected kind idiotic attitude slower hiring europe since last year take sometime rebound bloody started quarter europe slumber last year httpseditioncnncomeconomyeuropedodgesrecessionindexhtmlhttpseditioncnncomeconomyeuropedodgesrecessionindexhtml sorry jobs well europe fantastically well us source information whatsapp university course indias ills brought completely incompetent pm rules currently goes things would look extent incompetent pm already wrought much damage india irreversible dear oh dear logic supposedly educated growth country already developed like germany slow growth country like india far behind even china another developing country different things smart guy like knows developed economies grow slowly didnt know also lower unemployment rates lol want engage shaming people oppose okay btw graph xaxis didnt see developed economy correlation unemployment rate think done talking whatsapp university graduate",
    "light_cleaned_title": "High-paying IIT jobs a myth? Top grads settle for as low as Rs 6 lakh as placements dry up",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "> An IIT-Kharagpur student said that Spectrum Technologies offered Rs 3.6 LPA for trainee engineers, Rs 6L for trainee design engineers Not sure what is store for next 4 years. As someone too familiar with placements at IITs(I was part of one in 2017), it’s quite obvious what the root cause is. IITs aren’t really that good at placing people in non-software companies. Until recently, the demand for software jobs was very high and that reflected in the high number of placements. But, now, software industry is in a downturn and also, there has been a deluge of CS graduates, including non IITians. An IIT non-CS student isn’t much better than a CS student from a tier-2 university. So, that advantage is gone. What we are seeing is a market correction of inflated IIT placement numbers. And, it will sustain in the future too. How bad is situation for non computer jobs? My daughter is preparing for jee advanced but may choose private college ( Manipal /BITS/VIT etc) to stay in CS. How good are NITs or IIITs ( Indian institutes of information technology) for non CS branches This was pretty common previous years too, median hovered around 15-20 lpa in old iits and lowest was around 4 lpa. The thing that is different this year is that the companies that used to hire 8 people now hire 3, due to recession. The technology cycle has taken a downturn it will take few years to recover, every generation has to face the music Totally depends on the branch and the college, some top IIITs had pretty normal placements this year but NITs [suffered](https://np.reddit.com/r/JEENEETards/comments/1cdx8i2/placement_of_nit_allahabad_prayagraj/) a lot. Also BITS > Manipal > VIT generally. This is so true. In good time Highest package makes headlines, in bad its the lowest. People forget medians at an annual level (no 1cr package with 70% ESOPs vesting over 5 years). We're all fucked. The government only knows how to do Hindu Muslim. If something goes wrong in the economy they'll blame Muslims. They always have some stupid oversmart answer ready instead of coming up with solutions. IITs are stuck in the 90s. They still claim there isn’t enough talent to fill jobs. The faculty are extremely average now and it’s just stuck in the past. IIT tags really don’t mean much anymore. Keep working hard for life even after hair turns grey (my random nose hair sometimes comes out as grey (≧∀≦) Matric karlo beta, phir mauj hi mauj hai…\\ Boards karlo beta, phir mauj hi mauj hai…\\ Ye bhi karlo, uske baad mauj hi mauj... Don't work hard expecting to punish yourself only upto some point in life, this is a scam. Of course one needs to work hard but not because of \"uske baad aish hi aish hai\" - work hard like an artist and only if you're into it, maybe as a chef or as a CA or as a politician but don't jump into IIT and engineering from conformist mindset. Yes and back in 2015 there were quite a few IIM grads who did not find any placements, period. The headline numbers you hear is always the cream of the crop. As in everything there are students who study at the top institutions who are not really employable after graduation and they do get paid less. The Modi effect ... wait to watch what happens if he wins a third term. Dude do you even use common sense? The whole world is going through a recession. Most tech companies are laying off people to downsize and are hiring less too. Not every problem is political, so maybe go out of reddit once in a while to understand this basic fact. When the \"as low as\" amount is a lot more than your current salary :( Dude, sorry to break the news to you, the whole world is not going through a recession. Did you learn that from WhatsApp university? It is only the IT sector that is in pressure, the manufacturing is doing very well in most countries. You probably equate IIT to IT? Don't make that mistake! The EU just had [a good rebound](https://english.news.cn/20240501/fbaadecb6da04229847bf7e0b9632652/c.html) and is doing well overall; the U.S. is doing [fantastically well](https://www.ft.com/content/90b70efb-b0e6-4054-a650-132401b1b975) under Biden. India's problems are only partially forced upon by the global events, most are its own. But bhakts won't learn. Or just move abroad after a 2-3 years of experience. The easiest route. Galti kiski hey? No, going abroad is getting very difficult in general . But with IIT tag going abroad may be easier ( than from other colleges) And it's natural that with the given tremendous amount of youth population it is natural to have a recession, the political problem is that the government isn't even willing to recognise this problem. thats very true Nah the hiring managers still love that tag. Don't know about whole world but USA is is bad shape from the last 6 months a About 85% reduction in IT hiring. Downturn definitely. But we don't know if the it jobs we have now will go back up. Because profits of companies are all time high and even their operating leverage. In downturn profits become low and so does operating leverage. So the current downcycle can also mean the it jobs we had till now might be replaced with something new. Yes, as I said, IT hiring is not doing well recently, but IIT does not teach IT only. Jobs are doing very well, otherwise, across the world, but not in India: cue Modi. The government is busy building \"smart\" everything, rather than building smart people (investing in education). At a time when AI is at your doorstep or even has already entered the home, a government that keeps reducing the budget on education and wants just factory slaves and Hindu-Muslim rioters ... how self-destructive this is! And the people who vote for them? Gosh, they are on a highway to hell! Casteist fucks who vote for idiots who open doors of moving aircrafts \"by mistake\" and create mutual funds of mutual funds, because \"merit\". Exactly. People claiming ai is not getting rid of jobs are forgetting automation is reducing jobs even without ai. Exactly this. My development team without ai would be double in size but now we pay for many ai services which has improved productivity. Which college in India is better then? Let’s say we discuss CS . Anything better than Old IIT CS branches in India? And if this is the case - do Google or Meta or MIT or Stanford agree with your ranking ? Don’t think so . Bhai kuch bhi. If anything the IITs are now having a resurgence. I will kill to get one of these so called low paying jobs 😭 Yeah faculty are extremely average now ~ says someone who never went to IIT This is actually good. The fad that have been going around IITs have produced one of the lowest skilled generation of graduates in India. No fundamental understanding only problem solving. IIT fad should die so govt can take a look at this problem and improve standardized testing. > iversity? It is only the IT sector that is in pressure, the manufacturing is doing very well in most countries. You probably equate IIT to IT? Don't ma Government published growth rate of 8.x %, that is not recession. That's massive growth. Nah... This is a fundamental misunderstanding of what IIT or other top universities are. It's not the training you receive there that employers value. It's a signaling device that you are a highly intelligent person. That's the sole reason that some companies only hire fro Harvard, or IIT, or xyz. Umm….like most faculty at IITs. Old IITs CS are a different game altogether. They’re great because of the quality of students. But I reckon CS salaries from other colleges are catching up for Indian grads. Personally, I don’t rate IIT masters or PhDs (even CS) and it gets worse at faculty level. Have you seen the kind of science published these days? Absolutely agree. The market reflects this. For technical jobs I get why old IIT btechs from specific branches are amazing. I’m referring to the job market in India that requires increasingly diverse set of skills I agree to your second point that IIT graduate students are probably not that great. Lmao nobody gives a flying fuck what college you are from, when you go abroad. First off, getting hired as a fresher is almost never going to happen. The only way to get hired abroad is via your actual work experience and job credentials. Companies have mostly stopped moving people abroad nowadays. Even the big FAANG companies are now eliminating roles in US and opening them in India, and actively blocking out of country transfers from LCOL areas to HCOL areas. I thought it was the global tech slowdown It’s a common misconception that most premier education institute students end up with high paying jobs right out the gate. I’m sure there are many (at least 20% or so of old IITs, top NITs etc) who start at 3-8LPA. What differentiates them is their growth path/switching after that first job. Network effects and brand value play a huge role. Many jobs advertise as ordinary college + MBA or IIT + 2 years experience. Know many guys who started at 3-5LPA and doing 50-75LPA within 6-8 years with several avenues for further growth still open. One of the key things I guess they did is they switched their line of work whenever it was necessary/more financially sensible. This reminds me of Subramaniam Swamy's recent statement that India's GDP number are false, real value is at around 4% and we will be seeing repercussions of this clearly in the next few years. apni!.... 100% TRUTH!..par koi maane ke liye tayar nahin hai! Absolutely! going to be tough AI will keep eating into lower tier tech and support jobs Be in the top 5% of talent or be prepared for poverty wages As a person who knows the difference between your private college and an IIT, I highly recommend you to start educating yourself and talking to industry professionals. Which private college did I go to? Sharma Institute of Technology? r/usernamechecksout Whats the difference between design engineers vs designers ? I am pursuing design, does this mean the future is good for us ? that's why I didn't get troubled by not being able to get in IIT or NIT, because IT is a field where if you put enough hardwork you can get a lovely job, doesn't matter how shit college you have. It's all bogeyman tactics trying to say the hiring is not happening because of AI and whatnot. The reality is that due to monetary tightening with the fed in the US, VC money has dried up and hence the outrageous pay packages as well. Things are returning back to pre-Covid levels and lower and at the same time firms are hiring less because they want to become profitable at the cost of work-life balance of the employees and making employees work overtime without pay as is usual in India. Things are turning harder. Canada is awful, Australia is about to reach it's limits. UK is in a bad condition, Europe is not as easy as people think. It is only people here who haven't stepped abroad think it is easy. Once, you move abroad, it is way harder than anyone can imagine. Just a question will it recover and greaty improve if Rahul papu gets elected ? What kind of idiotic attitude is this? There is slower hiring in Europe since last year. It will take sometime to rebound. It is bloody 0.3 % and it started this Quarter. Europe was in slumber last year. [https://edition.cnn.com/2024/01/30/economy/europe-dodges-recession-2023/index.html](https://edition.cnn.com/2024/01/30/economy/europe-dodges-recession-2023/index.html) Sorry, jobs are doing well in Europe too, and doing fantastically well in the U.S.: do not source your information from WhatsApp university. And, of course, India's ills were brought about by a completely incompetent PM who rules currently, and if he goes, things would look up to some extent, but the incompetent PM has already wrought too much damage to India, some of it irreversible. Dear oh dear, the logic of those who are supposedly educated. 0.3% growth for a country already developed like Germany and slow growth for a country like India who is far behind even China (another developing country) are very different things. For a smart guy like you who knows that developed economies grow slowly, you didn't know that they should also have lower unemployment rates lol! But all you want to engage is shaming people who oppose you okay. BTW the graph is at 5.5 in the x-axis if you didn't see it. Being a developed economy has no correlation with unemployment rate! I think I am done now talking with a WhatsApp university graduate."
}