{
    "id": "14ll3mm",
    "title": "Vistara Scam",
    "url": "https://www.reddit.com/r/india/comments/14ll3mm/vistara_scam/",
    "selftext": "Hi all -\n\nSaw this online and couldn't believe it's actually true. The summary is:\n\nVistara claims to offer students **\"complimentary additional baggage\"** on **international** flights.  \n[https://www.airvistara.com/in/en/vistara-exclusives/vistara-student-discount](https://www.airvistara.com/in/en/vistara-exclusives/vistara-student-discount)\n\nHowever, in reality, instead of a \"Normal\" ticket, if you select \"Students\" on their website ([https://www.airvistara.com/in/en](https://www.airvistara.com/in/en)) and search for an international flight, the following happens:\n\n1. Economy Value ticket **disappears**!!! This is their most economical ticket, and **they actually HIDE it from STUDENTS!!!**\n2. The price of the **Economy Standard ticket increases by 70% to 90%, only for Students!!!**\n\nScreenshots attached. This has been tested at the exact same time for normal vs student fares, for the exact same flight. Also tested over many days, same results.\n\nImagine that they claim to be voted Best Airline in South Asia and 16th Best in the World, but they are actually SCAMMING STUDENTS!! Students are typically the category that need the value/money the most, and they are actively CHARGING THEM MORE and running this SCAM.\n\nThis is highly unethical and false advertising, likely a breach of regulations and possible grounds for a class action lawsuit, given the number of tickets they have sold at highly inflated prices.\n\n***They should immediately rectify their Student pricing to be the same as Normal pricing, and with the complimentary additional baggage that they promise on their website.***\n\nhttps://preview.redd.it/310148jspt8b1.png?width=4224&format=png&auto=webp&v=enabled&s=b6ce248a2425f56f2fa72b074121c4788be42809",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1687986246.0,
    "convurl": "https://b.thumbs.redditmedia.com/aiNq3ZQQn-PgIdUXH-QVLGQqoqwweXlSuJN6JVetNwQ.jpg",
    "comments": [
        "This is not a scam like you are portraying it to be.\n\nThere are no free lunches & this is pretty common across any sphere of the service industry.\n\nBtw, they also state they do not offer any discount on the base fare when traveling outside India under the student incentive of additional baggage allowance.",
        "Not referring to the discount on base fare, that's only for domestic flights - this is actually an *increase* of 70-90% on the ticket price for international flights, just for students.\n\nAlso, sorry, but that's a really poor justification. While no free lunches is ok, **specifically advertising as a free/complimentary offer** and then charging **70-90% more, and also hiding the cheaper ticket level**, is a complete rip-off and scam. And on top of all this they are targeting students, who tend to be budget-conscious and may have student debt/low income."
    ],
    "cleaned_text": "vistara scam hi saw online couldnt believe actually true summary vistara claims offer students complimentary additional baggage international flights httpswwwairvistaracominenvistaraexclusivesvistarastudentdiscounthttpswwwairvistaracominenvistaraexclusivesvistarastudentdiscount however reality instead normal ticket select students website httpswwwairvistaracominenhttpswwwairvistaracominen search international flight following happens economy value ticket disappears economical ticket actually hide students price economy standard ticket increases students screenshots attached tested exact time normal vs student fares exact flight also tested many days results imagine claim voted best airline south asia th best world actually scamming students students typically category need valuemoney actively charging running scam highly unethical false advertising likely breach regulations possible grounds class action lawsuit given number tickets sold highly inflated prices immediately rectify student pricing normal pricing complimentary additional baggage promise website ",
    "cleaned_title": "vistara scam",
    "cleaned_selftext": "hi saw online couldnt believe actually true summary vistara claims offer students complimentary additional baggage international flights httpswwwairvistaracominenvistaraexclusivesvistarastudentdiscounthttpswwwairvistaracominenvistaraexclusivesvistarastudentdiscount however reality instead normal ticket select students website httpswwwairvistaracominenhttpswwwairvistaracominen search international flight following happens economy value ticket disappears economical ticket actually hide students price economy standard ticket increases students screenshots attached tested exact time normal vs student fares exact flight also tested many days results imagine claim voted best airline south asia th best world actually scamming students students typically category need valuemoney actively charging running scam highly unethical false advertising likely breach regulations possible grounds class action lawsuit given number tickets sold highly inflated prices immediately rectify student pricing normal pricing complimentary additional baggage promise website",
    "cleaned_comments": "scam like portraying free lunches pretty common across sphere service industry btw also state offer discount base fare traveling outside india student incentive additional baggage allowance referring discount base fare thats domestic flights actually increase ticket price international flights students also sorry thats really poor justification free lunches ok specifically advertising freecomplimentary offer charging also hiding cheaper ticket level complete ripoff scam top targeting students tend budgetconscious may student debtlow income",
    "light_cleaned_title": "Vistara Scam",
    "light_cleaned_selftext": "Hi all - Saw this online and couldn't believe it's actually true. The summary is: Vistara claims to offer students **\"complimentary additional baggage\"** on **international** flights. [https://www.airvistara.com/in/en/vistara-exclusives/vistara-student-discount](https://www.airvistara.com/in/en/vistara-exclusives/vistara-student-discount) However, in reality, instead of a \"Normal\" ticket, if you select \"Students\" on their website ([https://www.airvistara.com/in/en](https://www.airvistara.com/in/en)) and search for an international flight, the following happens: 1. Economy Value ticket **disappears**!!! This is their most economical ticket, and **they actually HIDE it from STUDENTS!!!** 2. The price of the **Economy Standard ticket increases by 70% to 90%, only for Students!!!** Screenshots attached. This has been tested at the exact same time for normal vs student fares, for the exact same flight. Also tested over many days, same results. Imagine that they claim to be voted Best Airline in South Asia and 16th Best in the World, but they are actually SCAMMING STUDENTS!! Students are typically the category that need the value/money the most, and they are actively CHARGING THEM MORE and running this SCAM. This is highly unethical and false advertising, likely a breach of regulations and possible grounds for a class action lawsuit, given the number of tickets they have sold at highly inflated prices. ***They should immediately rectify their Student pricing to be the same as Normal pricing, and with the complimentary additional baggage that they promise on their website.***",
    "light_cleaned_comments": "This is not a scam like you are portraying it to be. There are no free lunches & this is pretty common across any sphere of the service industry. Btw, they also state they do not offer any discount on the base fare when traveling outside India under the student incentive of additional baggage allowance. Not referring to the discount on base fare, that's only for domestic flights - this is actually an *increase* of 70-90% on the ticket price for international flights, just for students. Also, sorry, but that's a really poor justification. While no free lunches is ok, **specifically advertising as a free/complimentary offer** and then charging **70-90% more, and also hiding the cheaper ticket level**, is a complete rip-off and scam. And on top of all this they are targeting students, who tend to be budget-conscious and may have student debt/low income."
}