{
    "id": "qpsk7d",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/qpsk7d/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 24,
    "num_comments": 88,
    "created_utc": 1636421414,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Ys VIII - Lacrimosa of Dana, my first Ys game, didn't expect it to be this good. Looking forward to play Monstrum Nox",
        "tried 'the isle' it was a pretty good game",
        "Been playing AOE 4, honestly it's amazing. Woul recommend it to anyone!",
        "Suggest me some open world adventure game to play on my 2015 pc without external graphic card. The pc was surprisingly able to play gta v at low setting so any game with equal or lower graphic would be fine. I haven't played much titles apart from skyrim and few fps games so most games will be new for me. Open to suggestion.",
        "You can try Ys series, I'm playing VIII and it's quite fun",
        "Thanks for the recommendation but I prefer some realistic games with real people, weapons and places, like gta series, assassin creed or hitman.\n\n I should have added this in the post. I haven't played these above titles apart from gta and one version of hitman which I played way before 2010 probably as a child.",
        "Saints Row, Mafia series, Sleeping Dogs, Watch dogs should work too.",
        "Going through Kingdoms of Amalur ReReckoning",
        "Thank you, I'll check them out. I don't know why suddenly I have got a urge to play some games, maybe these will help me with that.",
        "These are all open world with real people lol. Saints Row series is a bit goofy though.",
        "how much Is it? I wanted to buy long time ago but slowly forgot about it.",
        "2.5k",
        "there's a fit girl who gives it to you for free.",
        "Also checkout farcry 3, one of the best antagonist in video games",
        "Will it run without an external graphic card?",
        "Anyone got a good recommendation for Android? Anything which has a good plot and not just mindless screen smashing.",
        "Try Genshin Impact..",
        "Been playing a game called Rusty Lake. A point and click game with quite a creepy atmosphere and bsckstory",
        "To the moon",
        "When did it release?",
        "When did it release?",
        "When did it release?",
        "When did it release?",
        "When did it release?",
        "Try *2 cars*. Its a very casual game of the type which could be played for few minutes in the small breaks. Its take a few attempts to get used to it. Might be not something which you are looking for but nevertheless some others might enjoy it.",
        "Last week",
        "Looking for a decent gaming laptop between 90k-120k INR. Preferably with RTX 3060 and 16 Gigs of RAM and an Octa Core Processor.",
        " target the ps2-ps3 era games and indie titles. If it's 2015 then there should be quite a few games. Here are some -\n\n\nMass effect 2,3; Hollow Knight (kinda open world but 2d);\n older Assassin's creed games should work fine up until AC 3 or black flag; batman arkham asylum and arkham city; bully; far cry 3, sleeping dogs, deus ex human revolution, dishonored, saint's row 3 or 4, LA noire\n\n\nYou might have to tweak the graphics settings a bit but i bet most of them should be fine on low-medium and and possibly high in some cases",
        "Second this.",
        "Bought an Acer Predator a week ago during the FlipKart sale. RTX3060, 16GB RAM(single channel I think) and an octa core i7 10th gen. Cost me around 99k.",
        "I’m actually looking at the 11th Gen, 3060 with QHD Display. It was on sale for 109000, but now it’s at its full price or 1.4 lakhs :( not sure if it’s gonna come in stock again. \n\nBut, what do you think about your laptop? What are the biggest cons? Thanks",
        "Tried to find the same spec as you but could only find a 11th gen predator with a 3050ti for 99k. \n\nI have only been using my laptop for a couple of days so can't really list out any major cons. \n\nBut would highly suggest on upgrading to 32gigs dual channel in case you get a 16GB RAM card with yours (heard some models get a 8+8 setup). Apparently this will sort out any future throttling issues.\n\nLaptops thermals are pretty fine except for the area below the arrow keys/numpad being slight more warm that the rest of the body but shouldnt be that much of a problem as your hands will rest on the wasd keys and mouse mostly.\n\nMine had a 1TB HDD and 256GB SSD but I figured I can upgrade it in the future as it has 1HDD slot and 2SSD slots.\n\nAt 99k the only laptops I could find with a 3060 were the Predator and an MSI. And the only 2 laptops I can suggest that are definitely better than this ,with the same specs, are in a different price category entirely like the i7 11th gen you were talking about or something like the Legion 5 pro which is considered best in class apparently.",
        "Thank you. \n\nThis is the one I was talking about https://dl.flipkart.com/s/XjP5IDNNNN\n\nI’ll just wait for the stock to arrive. Not planning to more than 1.2 Lakhs for this configuration. So Legion with 3060 and QHD is out of my budget now.",
        "Yup couldn't get it during the Big Billion Sale or the Diwali one so I guess Christmas maybe?",
        "I just started looking for a new laptop after my current laptop died couple of days ago. Do you think there will be a sale during Christmas?",
        "No clue man. I too couldn't wait and got my laptop because of the same doubt.",
        "I just wanna buy a decent one right now so that I don’t have to buy again for the next 4-6 years. So hoping to get 3060 with QHD display :)",
        "How’s the game? I’m guessing you got it from ps+",
        "Playing a way out with my bro, online coop. It’s a good game!",
        "Played it on last gen. Now trying to get the platinum. Fun gameplay and amazing voice acting. Apart from that it's very bland. Like a single player mmo. Loads of boring fetch quests, and a loading screen everytime you enter any door. Play it for the fun combat system. And yes got it on ps plus. You on playstation too?",
        "Waiting for cloud gaming like PS Now, Google stadia, or Xbox Game pass. Looks like it's going to be a long wait.",
        "Ahh that’s interesting. Maybe I’ll get into this game after I finish my huge backlog. Ya bro. Gaming on PS5 now.",
        "I second this. I missed out on it during the steam sale. Maybe next time",
        "Definitely pick it up and if you want to play with someone else online, they don’t have to own a copy.",
        "My favourite is NFS most wanted",
        "Prototype 1 and 2",
        "forza horizon 5 + fifa 22 UT whenever i get time \nwill start rdr2 this weekend hopefully.",
        "You can get xbox game pass for one dollar for one month to check out Aoe4. If you like it you can buy, there is aoe2 if your laptop can't run 4.",
        "Ace attorney apollo justice",
        "How the HELL is GI not mindless screensmashing. That is literally all there is to it. Hard grinding and looping",
        "I don't know how this works so asking- then how will they be able to play if they don't own the game? How will they download it at the first place?",
        "Geometry Dash",
        "Dota 2",
        "You can go to the respective platform store page. There will be an option to download a trail version which works only when someone send you a play invite. That’s how I’m playing with my brother",
        "Ever since I built my new PC a couple of months back, I've got way too many games to play now. \n\nI CAN FINALLY PLAY APEX LEGENDS. This game just blew my mind when I played it for the first time during Christmas 2019 when I was out with friends at a cyber cafe. I only played for an hour but I was blown away by it. Then came the pandemic, I lost my job, and my plans of building a PC by March 2020. T\\_T But now I can finally play it and boi its fun!!!\n\nSo all the games I got for free on Epic Gay Store finally came to use :) GTA 5 was literally the first game I installed after setting up the PC. And I finished playing it yesterday. I found the story to be eh tbh :\\\\ Everything else was amazing though.\n\nThe Witcher 3, my god I wanted to play it for so long. I speedran through Witcher 2 since my old saves got deleted. I am still playing it. =w=\n\nDark Souls 3, finally got to play the 3rd game. I played through the first 2 multiple times. 3 doesn't disappoint, its amazing. After 3 I start Sekiro &gt;.&lt; And then I wait for Bloodborne to come on PC which should be coming soon \\^=\\^\n\nThen there are other games I've been wanting to play like Batman Arkham Knight, Bayonetta, Catherine, Shadow of Mordor, oof the list is too big and I've got too much shit to play now.\n\nA game I am looking forward to is Elden Ring. And its relatively cheap as well at 2.5k :O",
        "Dragon Age, Dragon's Dogma, Shadow of Mordor.",
        "Phipha baaees",
        "Super Smash Bros Ultimate! We've got a lovely community, you're never short of people to play with",
        "Trying AC Unity. Its quite shit so far.",
        "Welcome to the world of sub par games by the underpaying and horrible work environment studio, Ubisoft..",
        "When I was young, it was my dream to work at Ubisoft thanks to Sands of Time series. How the turntables.",
        "Ahh Prince of Persia was a goddamn gem",
        "In My Shadows - game developed by an Indian indie game developer is OUT NOW on iOS\n\n[https://apple.co/3ohYTNt](https://apple.co/3ohYTNt)\n\nPlease do check it out and if it intrigues you then do get it and leave a review on the store",
        "Beholder - Steam\n\n\nYou play an apartment manager working for a despotic government.",
        "Escape from tarkov : aka Cock and balls torture :p",
        "If y'all ever figure out how to use Netplay so those of us with emulators can join like-minded Smash fans for Brawl/Melee, let know. Really want to play!",
        "We've got an SSB India Discord for all kinds of matchmaking! Melee, P+, Brawl, and even other platform fighters like Rivals of Aether and Slap City",
        "Bro.....link! link!",
        "Here you go! https://discord.gg/8cFuZUeW we've actually got a 200+ person WhatsApp chat too",
        "CTR, Metro last light, Watch Dogs, Greedfall, Just Cause 4",
        "Deep Rock Galactic!\n\nWell trying to play it, but my internet has been really bad lately. \n\nAllows for 1-4 player co-op. If you are looking for something casual to play with friends this is it. The fun begins when you work your way down to real deep dives. \n\nAlso it's on sale on steam right now going for only ₹ 349",
        "Stop playing pubg or other mobile br games there’s way better options to waste ur time on plus it’s so cringe how everyone plays it",
        "Play Skyrim!",
        "Asus TUF is a popular option for your budget, also there is the HP Victus in the same budget bracket. MSI options are great although the service in india sucks. If you can increase your budget to 140k The Lenovo Legion is a no brainier. Been a happy owner of a Victus for 3 months now",
        "Thanks. I heard some terrible things about the screen quality on TUF laptops. That’s why I’m leaning towards acer or strix.",
        "You’ll get the same quality in Strix and gets even worse with acer nitro. All laptops In this price range use IPS like displays with varying amounts of sRGB (go for 100% if you really care about color accuracy) and frame rates. 144Hz panels usually have good quality. Make sure to test out your panel during the return window extensively for any manufacturing defects",
        "That’s why I wanted to go with QHD displays. But I’m unsure how the gaming performance would be with the 3060.",
        "I am not sure about custom configuring QHD screens in india with laptops (usually is an option in US and Canada ) but that’s not always an option in india, you can realistically look for QHD versions of ROG zephyrus/Strix or the Dell G15(will be above budget for 3060 I think)\n3060 should be able to handle QHD depending on TGP (85-100) should give you good 60+ FPS in high graphic games and easy 250-300 fps in E sports",
        "Have played skyrim. Mentioned in the post.",
        "Hi😀☺️",
        "The older ones are so much better. Also, imo, AC Origins is one of the best in the series.",
        "To me, the best was Brotherhood.  Ezio time were the best ones, the story, game play as well as Jasper Kyd's soundtrack.",
        "Ac Odyssey. Such a lengthy game 🙃",
        "Ngl then you play return to Arkham collection.",
        "Yep absolutely. One problem I had with Brotherhood though was that the map was too rural, if that makes sense? So I sorta liked 2 and Revelations a bit more, but of course Brotherhood is still one of the best games in the series."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "ys viii lacrimosa dana first ys game didnt expect good looking forward play monstrum nox tried isle pretty good game playing aoe honestly amazing woul recommend anyone suggest open world adventure game play pc without external graphic card pc surprisingly able play gta v low setting game equal lower graphic would fine havent played much titles apart skyrim fps games games new open suggestion try ys series im playing viii quite fun thanks recommendation prefer realistic games real people weapons places like gta series assassin creed hitman added post havent played titles apart gta one version hitman played way probably child saints row mafia series sleeping dogs watch dogs work going kingdoms amalur rereckoning thank ill check dont know suddenly got urge play games maybe help open world real people lol saints row series bit goofy though much wanted buy long time ago slowly forgot k theres fit girl gives free also checkout farcry one best antagonist video games run without external graphic card anyone got good recommendation android anything good plot mindless screen smashing try genshin impact playing game called rusty lake point click game quite creepy atmosphere bsckstory moon release release release release release try cars casual game type could played minutes small breaks take attempts get used might something looking nevertheless others might enjoy last week looking decent gaming laptop kk inr preferably rtx gigs ram octa core processor target psps era games indie titles quite games mass effect hollow knight kinda open world older assassins creed games work fine ac black flag batman arkham asylum arkham city bully far cry sleeping dogs deus ex human revolution dishonored saints row la noire might tweak graphics settings bit bet fine lowmedium possibly high cases second bought acer predator week ago flipkart sale rtx gb ramsingle channel think octa core th gen cost around k im actually looking th gen qhd display sale full price lakhs sure gon na come stock think laptop biggest cons thanks tried find spec could find th gen predator ti k using laptop couple days cant really list major cons would highly suggest upgrading gigs dual channel case get gb ram card heard models get setup apparently sort future throttling issues laptops thermals pretty fine except area arrow keysnumpad slight warm rest body shouldnt much problem hands rest wasd keys mouse mostly mine tb hdd gb ssd figured upgrade future hdd slot ssd slots k laptops could find predator msi laptops suggest definitely better specs different price category entirely like th gen talking something like legion pro considered best class apparently thank one talking ill wait stock arrive planning lakhs configuration legion qhd budget yup couldnt get big billion sale diwali one guess christmas maybe started looking new laptop current laptop died couple days ago think sale christmas clue man couldnt wait got laptop doubt wan na buy decent one right dont buy next years hoping get qhd display hows game im guessing got ps playing way bro online coop good game played last gen trying get platinum fun gameplay amazing voice acting apart bland like single player mmo loads boring fetch quests loading screen everytime enter door play fun combat system yes got ps plus playstation waiting cloud gaming like ps google stadia xbox game pass looks like going long wait ahh thats interesting maybe ill get game finish huge backlog ya bro gaming ps second missed steam sale maybe next time definitely pick want play someone else online dont copy favourite nfs wanted prototype forza horizon fifa ut whenever get time start rdr weekend hopefully get xbox game pass one dollar one month check aoe like buy aoe laptop cant run ace attorney apollo justice hell gi mindless screensmashing literally hard grinding looping dont know works asking able play dont game download first place geometry dash dota go respective platform store page option download trail version works someone send play invite thats im playing brother ever since built new pc couple months back ive got way many games play finally play apex legends game blew mind played first time christmas friends cyber cafe played hour blown away came pandemic lost job plans building pc march tt finally play boi fun games got free epic gay store finally came use gta literally first game installed setting pc finished playing yesterday found story eh tbh everything else amazing though witcher god wanted play long speedran witcher since old saves got deleted still playing w dark souls finally got play rd game played first multiple times doesnt disappoint amazing start sekiro gtlt wait bloodborne come pc coming soon games ive wanting play like batman arkham knight bayonetta catherine shadow mordor oof list big ive got much shit play game looking forward elden ring relatively cheap well k dragon age dragons dogma shadow mordor phipha baaees super smash bros ultimate weve got lovely community youre never short people play trying ac unity quite shit far welcome world sub par games underpaying horrible work environment studio ubisoft young dream work ubisoft thanks sands time series turntables ahh prince persia goddamn gem shadows game developed indian indie game developer ios httpsapplecoohytnthttpsapplecoohytnt please check intrigues get leave review store beholder steam play apartment manager working despotic government escape tarkov aka cock balls torture p yall ever figure use netplay us emulators join likeminded smash fans brawlmelee let know really want play weve got ssb india discord kinds matchmaking melee p brawl even platform fighters like rivals aether slap city brolink link go weve actually got person whatsapp chat ctr metro last light watch dogs greedfall cause deep rock galactic well trying play internet really bad lately allows player coop looking something casual play friends fun begins work way real deep dives also sale steam right going stop playing pubg mobile br games theres way better options waste ur time plus cringe everyone plays play skyrim asus tuf popular option budget also hp victus budget bracket msi options great although service india sucks increase budget k lenovo legion brainier happy owner victus months thanks heard terrible things screen quality tuf laptops thats im leaning towards acer strix youll get quality strix gets even worse acer nitro laptops price range use ips like displays varying amounts srgb go really care color accuracy frame rates hz panels usually good quality make sure test panel return window extensively manufacturing defects thats wanted go qhd displays im unsure gaming performance would sure custom configuring qhd screens india laptops usually option us canada thats always option india realistically look qhd versions rog zephyrusstrix dell gwill budget think able handle qhd depending tgp give good fps high graphic games easy fps e sports played skyrim mentioned post hi older ones much better also imo ac origins one best series best brotherhood ezio time best ones story game play well jasper kyds soundtrack ac odyssey lengthy game ngl play return arkham collection yep absolutely one problem brotherhood though map rural makes sense sorta liked revelations bit course brotherhood still one best games series",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Ys VIII - Lacrimosa of Dana, my first Ys game, didn't expect it to be this good. Looking forward to play Monstrum Nox tried 'the isle' it was a pretty good game Been playing AOE 4, honestly it's amazing. Woul recommend it to anyone! Suggest me some open world adventure game to play on my 2015 pc without external graphic card. The pc was surprisingly able to play gta v at low setting so any game with equal or lower graphic would be fine. I haven't played much titles apart from skyrim and few fps games so most games will be new for me. Open to suggestion. You can try Ys series, I'm playing VIII and it's quite fun Thanks for the recommendation but I prefer some realistic games with real people, weapons and places, like gta series, assassin creed or hitman. I should have added this in the post. I haven't played these above titles apart from gta and one version of hitman which I played way before 2010 probably as a child. Saints Row, Mafia series, Sleeping Dogs, Watch dogs should work too. Going through Kingdoms of Amalur ReReckoning Thank you, I'll check them out. I don't know why suddenly I have got a urge to play some games, maybe these will help me with that. These are all open world with real people lol. Saints Row series is a bit goofy though. how much Is it? I wanted to buy long time ago but slowly forgot about it. 2.5k there's a fit girl who gives it to you for free. Also checkout farcry 3, one of the best antagonist in video games Will it run without an external graphic card? Anyone got a good recommendation for Android? Anything which has a good plot and not just mindless screen smashing. Try Genshin Impact.. Been playing a game called Rusty Lake. A point and click game with quite a creepy atmosphere and bsckstory To the moon When did it release? When did it release? When did it release? When did it release? When did it release? Try *2 cars*. Its a very casual game of the type which could be played for few minutes in the small breaks. Its take a few attempts to get used to it. Might be not something which you are looking for but nevertheless some others might enjoy it. Last week Looking for a decent gaming laptop between 90k-120k INR. Preferably with RTX 3060 and 16 Gigs of RAM and an Octa Core Processor. target the ps2-ps3 era games and indie titles. If it's 2015 then there should be quite a few games. Here are some - Mass effect 2,3; Hollow Knight (kinda open world but 2d); older Assassin's creed games should work fine up until AC 3 or black flag; batman arkham asylum and arkham city; bully; far cry 3, sleeping dogs, deus ex human revolution, dishonored, saint's row 3 or 4, LA noire You might have to tweak the graphics settings a bit but i bet most of them should be fine on low-medium and and possibly high in some cases Second this. Bought an Acer Predator a week ago during the FlipKart sale. RTX3060, 16GB RAM(single channel I think) and an octa core i7 10th gen. Cost me around 99k. I’m actually looking at the 11th Gen, 3060 with QHD Display. It was on sale for 109000, but now it’s at its full price or 1.4 lakhs :( not sure if it’s gonna come in stock again. But, what do you think about your laptop? What are the biggest cons? Thanks Tried to find the same spec as you but could only find a 11th gen predator with a 3050ti for 99k. I have only been using my laptop for a couple of days so can't really list out any major cons. But would highly suggest on upgrading to 32gigs dual channel in case you get a 16GB RAM card with yours (heard some models get a 8+8 setup). Apparently this will sort out any future throttling issues. Laptops thermals are pretty fine except for the area below the arrow keys/numpad being slight more warm that the rest of the body but shouldnt be that much of a problem as your hands will rest on the wasd keys and mouse mostly. Mine had a 1TB HDD and 256GB SSD but I figured I can upgrade it in the future as it has 1HDD slot and 2SSD slots. At 99k the only laptops I could find with a 3060 were the Predator and an MSI. And the only 2 laptops I can suggest that are definitely better than this ,with the same specs, are in a different price category entirely like the i7 11th gen you were talking about or something like the Legion 5 pro which is considered best in class apparently. Thank you. This is the one I was talking about I’ll just wait for the stock to arrive. Not planning to more than 1.2 Lakhs for this configuration. So Legion with 3060 and QHD is out of my budget now. Yup couldn't get it during the Big Billion Sale or the Diwali one so I guess Christmas maybe? I just started looking for a new laptop after my current laptop died couple of days ago. Do you think there will be a sale during Christmas? No clue man. I too couldn't wait and got my laptop because of the same doubt. I just wanna buy a decent one right now so that I don’t have to buy again for the next 4-6 years. So hoping to get 3060 with QHD display :) How’s the game? I’m guessing you got it from ps+ Playing a way out with my bro, online coop. It’s a good game! Played it on last gen. Now trying to get the platinum. Fun gameplay and amazing voice acting. Apart from that it's very bland. Like a single player mmo. Loads of boring fetch quests, and a loading screen everytime you enter any door. Play it for the fun combat system. And yes got it on ps plus. You on playstation too? Waiting for cloud gaming like PS Now, Google stadia, or Xbox Game pass. Looks like it's going to be a long wait. Ahh that’s interesting. Maybe I’ll get into this game after I finish my huge backlog. Ya bro. Gaming on PS5 now. I second this. I missed out on it during the steam sale. Maybe next time Definitely pick it up and if you want to play with someone else online, they don’t have to own a copy. My favourite is NFS most wanted Prototype 1 and 2 forza horizon 5 + fifa 22 UT whenever i get time will start rdr2 this weekend hopefully. You can get xbox game pass for one dollar for one month to check out Aoe4. If you like it you can buy, there is aoe2 if your laptop can't run 4. Ace attorney apollo justice How the HELL is GI not mindless screensmashing. That is literally all there is to it. Hard grinding and looping I don't know how this works so asking- then how will they be able to play if they don't own the game? How will they download it at the first place? Geometry Dash Dota 2 You can go to the respective platform store page. There will be an option to download a trail version which works only when someone send you a play invite. That’s how I’m playing with my brother Ever since I built my new PC a couple of months back, I've got way too many games to play now. I CAN FINALLY PLAY APEX LEGENDS. This game just blew my mind when I played it for the first time during Christmas 2019 when I was out with friends at a cyber cafe. I only played for an hour but I was blown away by it. Then came the pandemic, I lost my job, and my plans of building a PC by March 2020. T\\_T But now I can finally play it and boi its fun!!! So all the games I got for free on Epic Gay Store finally came to use :) GTA 5 was literally the first game I installed after setting up the PC. And I finished playing it yesterday. I found the story to be eh tbh :\\\\ Everything else was amazing though. The Witcher 3, my god I wanted to play it for so long. I speedran through Witcher 2 since my old saves got deleted. I am still playing it. =w= Dark Souls 3, finally got to play the 3rd game. I played through the first 2 multiple times. 3 doesn't disappoint, its amazing. After 3 I start Sekiro &gt;.&lt; And then I wait for Bloodborne to come on PC which should be coming soon \\^=\\^ Then there are other games I've been wanting to play like Batman Arkham Knight, Bayonetta, Catherine, Shadow of Mordor, oof the list is too big and I've got too much shit to play now. A game I am looking forward to is Elden Ring. And its relatively cheap as well at 2.5k :O Dragon Age, Dragon's Dogma, Shadow of Mordor. Phipha baaees Super Smash Bros Ultimate! We've got a lovely community, you're never short of people to play with Trying AC Unity. Its quite shit so far. Welcome to the world of sub par games by the underpaying and horrible work environment studio, Ubisoft.. When I was young, it was my dream to work at Ubisoft thanks to Sands of Time series. How the turntables. Ahh Prince of Persia was a goddamn gem In My Shadows - game developed by an Indian indie game developer is OUT NOW on iOS [https://apple.co/3ohYTNt](https://apple.co/3ohYTNt) Please do check it out and if it intrigues you then do get it and leave a review on the store Beholder - Steam You play an apartment manager working for a despotic government. Escape from tarkov : aka Cock and balls torture :p If y'all ever figure out how to use Netplay so those of us with emulators can join like-minded Smash fans for Brawl/Melee, let know. Really want to play! We've got an SSB India Discord for all kinds of matchmaking! Melee, P+, Brawl, and even other platform fighters like Rivals of Aether and Slap City Bro.....link! link! Here you go! we've actually got a 200+ person WhatsApp chat too CTR, Metro last light, Watch Dogs, Greedfall, Just Cause 4 Deep Rock Galactic! Well trying to play it, but my internet has been really bad lately. Allows for 1-4 player co-op. If you are looking for something casual to play with friends this is it. The fun begins when you work your way down to real deep dives. Also it's on sale on steam right now going for only ₹ 349 Stop playing pubg or other mobile br games there’s way better options to waste ur time on plus it’s so cringe how everyone plays it Play Skyrim! Asus TUF is a popular option for your budget, also there is the HP Victus in the same budget bracket. MSI options are great although the service in india sucks. If you can increase your budget to 140k The Lenovo Legion is a no brainier. Been a happy owner of a Victus for 3 months now Thanks. I heard some terrible things about the screen quality on TUF laptops. That’s why I’m leaning towards acer or strix. You’ll get the same quality in Strix and gets even worse with acer nitro. All laptops In this price range use IPS like displays with varying amounts of sRGB (go for 100% if you really care about color accuracy) and frame rates. 144Hz panels usually have good quality. Make sure to test out your panel during the return window extensively for any manufacturing defects That’s why I wanted to go with QHD displays. But I’m unsure how the gaming performance would be with the 3060. I am not sure about custom configuring QHD screens in india with laptops (usually is an option in US and Canada ) but that’s not always an option in india, you can realistically look for QHD versions of ROG zephyrus/Strix or the Dell G15(will be above budget for 3060 I think) 3060 should be able to handle QHD depending on TGP (85-100) should give you good 60+ FPS in high graphic games and easy 250-300 fps in E sports Have played skyrim. Mentioned in the post. Hi😀☺️ The older ones are so much better. Also, imo, AC Origins is one of the best in the series. To me, the best was Brotherhood. Ezio time were the best ones, the story, game play as well as Jasper Kyd's soundtrack. Ac Odyssey. Such a lengthy game 🙃 Ngl then you play return to Arkham collection. Yep absolutely. One problem I had with Brotherhood though was that the map was too rural, if that makes sense? So I sorta liked 2 and Revelations a bit more, but of course Brotherhood is still one of the best games in the series."
}