{
    "id": "18b8grs",
    "title": "I can't believe this is due to lack of sex education or sexual depravity.",
    "url": "https://i.redd.it/unwcamjt5g4c1.png",
    "selftext": "Why the fuck would someone do something like this? What humanly reason could there exist for someone to fuck a deadbody, that too of their mother???\n\n[Source](https://www.timesnownews.com/mirror-now/crime/indore-man-booked-for-having-sex-with-mothers-dead-body-police-article-105735080/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts)",
    "flair": "Crime",
    "score": 47,
    "num_comments": 28,
    "created_utc": 1701769294.0,
    "convurl": "https://i.redd.it/unwcamjt5g4c1.png",
    "comments": [
        "Why did I read this disturbing post 🤢🤮",
        "Ikr it's fucked up to the extreme",
        "I have read and watched many fked up documentaries and shows about crimes like Dahmer, cannibals etc. but this one hits close to home and seriously disturbing",
        "That's just depravity.\n\n1 out of a billion ain't too bad.",
        "mental diseases. Cutoff from the understanding of social pressures.",
        "Wth",
        "A single post ruined my whole day",
        "My eyes my eyes....",
        "Could be mental health issues",
        "#WTF, this is one of the most disgusting and disturbing news I ever heard",
        "r/noahgettheboat",
        "Wish I could just unread it. 😥😞",
        "Enough reddit for today",
        "I believe him to be mentally ill. No normally functioning human would behave this way!",
        "I hope isnt let out into the society without a proper pysch evaluation.. he cd prove to be dangerous to other ppl.. repeat offence is highly likely",
        "I just opened reddit today and this. Enough now, I'm going to play mini golf.",
        "This world is sick 🤢",
        "What a great day to have eyes🫠",
        "'Animal' insticts",
        "Ok..that's enough internet for today.",
        "At some point, I actually respect the law enforcement folks who deal with such shit! Cleaning up the mess of society and directing them to better life.",
        "This guy got \"caught\" doing this. Imagine how many people aren't getting caught.",
        "OP add the link to this disgusting news.",
        "Kyonki teri society khokhli ho chuki yha vidhayk ki gadi jisme vidhayak he bhi nahi use rasta mil jat he par ambulance jaye ma judwane",
        "All the people you can imagine, every single one, are all imaginary.\n\nTrust that your worst fears exist in your mind, not in the world."
    ],
    "cleaned_text": "cant believe due lack sex education sexual depravity fuck would someone something like humanly reason could exist someone fuck deadbody mother sourcehttpswwwtimesnownewscommirrornowcrimeindoremanbookedforhavingsexwithmothersdeadbodypolicearticleamputmcampaignfullarticleutmmediumreferralutmsourceinshorts ",
    "cleaned_title": "cant believe due lack sex education sexual depravity",
    "cleaned_selftext": "fuck would someone something like humanly reason could exist someone fuck deadbody mother sourcehttpswwwtimesnownewscommirrornowcrimeindoremanbookedforhavingsexwithmothersdeadbodypolicearticleamputmcampaignfullarticleutmmediumreferralutmsourceinshorts",
    "cleaned_comments": "read disturbing post ikr fucked extreme read watched many fked documentaries shows crimes like dahmer cannibals etc one hits close home seriously disturbing thats depravity billion aint bad mental diseases cutoff understanding social pressures wth single post ruined whole day eyes eyes could mental health issues wtf one disgusting disturbing news ever heard rnoahgettheboat wish could unread enough reddit today believe mentally ill normally functioning human would behave way hope isnt let society without proper pysch evaluation cd prove dangerous ppl repeat offence highly likely opened reddit today enough im going play mini golf world sick great day eyes animal insticts okthats enough internet today point actually respect law enforcement folks deal shit cleaning mess society directing better life guy got caught imagine many people arent getting caught op add link disgusting news kyonki teri society khokhli ho chuki yha vidhayk ki gadi jisme vidhayak bhi nahi use rasta mil jat par ambulance jaye judwane people imagine every single one imaginary trust worst fears exist mind world",
    "light_cleaned_title": "I can't believe this is due to lack of sex education or sexual depravity.",
    "light_cleaned_selftext": "Why the fuck would someone do something like this? What humanly reason could there exist for someone to fuck a deadbody, that too of their mother??? [Source](https://www.timesnownews.com/mirror-now/crime/indore-man-booked-for-having-sex-with-mothers-dead-body-police-article-105735080/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts)",
    "light_cleaned_comments": "Why did I read this disturbing post 🤢🤮 Ikr it's fucked up to the extreme I have read and watched many fked up documentaries and shows about crimes like Dahmer, cannibals etc. but this one hits close to home and seriously disturbing That's just depravity. 1 out of a billion ain't too bad. mental diseases. Cutoff from the understanding of social pressures. Wth A single post ruined my whole day My eyes my eyes.... Could be mental health issues #WTF, this is one of the most disgusting and disturbing news I ever heard r/noahgettheboat Wish I could just unread it. 😥😞 Enough reddit for today I believe him to be mentally ill. No normally functioning human would behave this way! I hope isnt let out into the society without a proper pysch evaluation.. he cd prove to be dangerous to other ppl.. repeat offence is highly likely I just opened reddit today and this. Enough now, I'm going to play mini golf. This world is sick 🤢 What a great day to have eyes🫠 'Animal' insticts Ok..that's enough internet for today. At some point, I actually respect the law enforcement folks who deal with such shit! Cleaning up the mess of society and directing them to better life. This guy got \"caught\" doing this. Imagine how many people aren't getting caught. OP add the link to this disgusting news. Kyonki teri society khokhli ho chuki yha vidhayk ki gadi jisme vidhayak he bhi nahi use rasta mil jat he par ambulance jaye ma judwane All the people you can imagine, every single one, are all imaginary. Trust that your worst fears exist in your mind, not in the world."
}