{
    "id": "16w7wg2",
    "title": "Carpooling is illegal; Rs 10,000 challan implemented",
    "url": "https://www.cartoq.com/carpooling-is-illegal-rs-10000-challan-implemented/",
    "selftext": "Solving problems...",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1696083225.0,
    "convurl": "https://external-preview.redd.it/mhV1XfUaHZpql_qQnsgqHgfAZlqWfZaciiR1NLTwy70.jpg?auto=webp&s=8506a68221e7d667a728169225077adf4b35a538",
    "comments": [
        "The news report’s headline is misleading. \nCarpooling apps who use private vehicles as taxis is illegal. \n\nHere’s the extract from the article \nAccording to the circular issued by the transport department of Bengaluru, modern-day carpooling apps are breaking the law, as private vehicles cannot be used for commercial purposes, including the basic practice of carpooling. The action has been taken by the transport department of Bengaluru following repetitive complaints by taxi driver unions. As a result, the Regional Transport Offices (RTOs) of Bengaluru, including Electronic City, HSR Layout, Devenahalli, KR Pura, Jayanagar, and Yelahanka, have been directed to take action against the use of private vehicles for carpooling.\n\nIn addition to the circular issued by the transport department of Bengaluru, a member of the Karnataka Rajya Sabha has also commented on the functioning of carpooling apps without any license. He added that instead of using private vehicles for carpooling, vehicle owners should register their vehicles as taxis to obtain a permit for commercial purposes.",
        "I think we can find a balance in between.\n\nPeople who can carpool occasionally and people who do it daily.\n\nIf the driver/user is often accepting rides everyday the app company can force him to get a commercial licence something like that",
        "No. I'd rather say anyone who wishes to carpool should get a commercial license. It's not a hobby. \nMany people make a living out of driving taxis and autos.",
        "Well i ll just carpool for free.",
        "What about someone who just wants to carpool to and from work? Clearly it’s not his full time job, so he won’t be earning so much from that. The fewer barriers to entry there are, the more people will be incentivized to carpool, which means fewer cars on the roads, less pollution, reduced parking demand…",
        "Taxis and autos aren't the only stakeholders in this debate. It's not right for the government to cower down to them.\n\nMore people carpooling is a net positive for the city. It leads to less vehicles on the roads. Which means less stress on the road infrastructure, less pollution, and better traffic management.\n\nI think a much better way to go around it is:\n1. Make the apps/drivers pay some sort of cess/tax. This would make their profits lesser, which in turn makes it fairer for commercial taxis.\n2. Make carpooling legal for Uber/Ola/Autos too. Like it used to be.\n\nA combination of the above two would mean that people who are looking to profit from carpooling would only be using option two. The people who have extra space in their personal vehicles, and not primarily looking to make money, can continue using option 1.",
        ">Make carpooling legal for Uber/Ola/Autos too. Like it used to be.\n\nIts legal even now but with the name of covid they removed it",
        "LOL. I swear sometimes governments are their own worst enemy. Bangalore is jammed already, WFO is now compulsory fo rmany and these jams are never ending. Dominos now delivers their pizzas in a jam as well!",
        "Yup, absolutely. Taxis and autos pay higher taxes and go through myriad processes to purchase the licence.",
        "Get a license. It's as simple as that. You cannot disturb the public and private transport system just because you feel like carpooling. They're people who make a living out of it. Someone rich enough to have their own car can't just disturb the existing system just cuz they feel like it. \n\nIt might hurt for you people. But that's the only source of income for them. They have to pay for their unions, for their commercial license, pay the due for their loaned cars. \n\nIf you really wanna carpool, get a fucking license.",
        "Yup, absolutely. Taxis and autos pay higher taxes and go through myriad processes to purchase the licence."
    ],
    "cleaned_text": "carpooling illegal rs challan implemented solving problems ",
    "cleaned_title": "carpooling illegal rs challan implemented",
    "cleaned_selftext": "solving problems",
    "cleaned_comments": "news reports headline misleading carpooling apps use private vehicles taxis illegal heres extract article according circular issued transport department bengaluru modernday carpooling apps breaking law private vehicles used commercial purposes including basic practice carpooling action taken transport department bengaluru following repetitive complaints taxi driver unions result regional transport offices rtos bengaluru including electronic city hsr layout devenahalli kr pura jayanagar yelahanka directed take action use private vehicles carpooling addition circular issued transport department bengaluru member karnataka rajya sabha also commented functioning carpooling apps without license added instead using private vehicles carpooling vehicle owners register vehicles taxis obtain permit commercial purposes think find balance people carpool occasionally people daily driveruser often accepting rides everyday app company force get commercial licence something like id rather say anyone wishes carpool get commercial license hobby many people make living driving taxis autos well carpool free someone wants carpool work clearly full time job wont earning much fewer barriers entry people incentivized carpool means fewer cars roads less pollution reduced parking demand taxis autos arent stakeholders debate right government cower people carpooling net positive city leads less vehicles roads means less stress road infrastructure less pollution better traffic management think much better way go around make appsdrivers pay sort cesstax would make profits lesser turn makes fairer commercial taxis make carpooling legal uberolaautos like used combination two would mean people looking profit carpooling would using option two people extra space personal vehicles primarily looking make money continue using option make carpooling legal uberolaautos like used legal even name covid removed lol swear sometimes governments worst enemy bangalore jammed already wfo compulsory fo rmany jams never ending dominos delivers pizzas jam well yup absolutely taxis autos pay higher taxes go myriad processes purchase licence get license simple disturb public private transport system feel like carpooling theyre people make living someone rich enough car cant disturb existing system cuz feel like might hurt people thats source income pay unions commercial license pay due loaned cars really wan na carpool get fucking license yup absolutely taxis autos pay higher taxes go myriad processes purchase licence",
    "light_cleaned_title": "Carpooling is illegal; Rs 10,000 challan implemented",
    "light_cleaned_selftext": "Solving problems...",
    "light_cleaned_comments": "The news report’s headline is misleading. Carpooling apps who use private vehicles as taxis is illegal. Here’s the extract from the article According to the circular issued by the transport department of Bengaluru, modern-day carpooling apps are breaking the law, as private vehicles cannot be used for commercial purposes, including the basic practice of carpooling. The action has been taken by the transport department of Bengaluru following repetitive complaints by taxi driver unions. As a result, the Regional Transport Offices (RTOs) of Bengaluru, including Electronic City, HSR Layout, Devenahalli, KR Pura, Jayanagar, and Yelahanka, have been directed to take action against the use of private vehicles for carpooling. In addition to the circular issued by the transport department of Bengaluru, a member of the Karnataka Rajya Sabha has also commented on the functioning of carpooling apps without any license. He added that instead of using private vehicles for carpooling, vehicle owners should register their vehicles as taxis to obtain a permit for commercial purposes. I think we can find a balance in between. People who can carpool occasionally and people who do it daily. If the driver/user is often accepting rides everyday the app company can force him to get a commercial licence something like that No. I'd rather say anyone who wishes to carpool should get a commercial license. It's not a hobby. Many people make a living out of driving taxis and autos. Well i ll just carpool for free. What about someone who just wants to carpool to and from work? Clearly it’s not his full time job, so he won’t be earning so much from that. The fewer barriers to entry there are, the more people will be incentivized to carpool, which means fewer cars on the roads, less pollution, reduced parking demand… Taxis and autos aren't the only stakeholders in this debate. It's not right for the government to cower down to them. More people carpooling is a net positive for the city. It leads to less vehicles on the roads. Which means less stress on the road infrastructure, less pollution, and better traffic management. I think a much better way to go around it is: 1. Make the apps/drivers pay some sort of cess/tax. This would make their profits lesser, which in turn makes it fairer for commercial taxis. 2. Make carpooling legal for Uber/Ola/Autos too. Like it used to be. A combination of the above two would mean that people who are looking to profit from carpooling would only be using option two. The people who have extra space in their personal vehicles, and not primarily looking to make money, can continue using option 1. >Make carpooling legal for Uber/Ola/Autos too. Like it used to be. Its legal even now but with the name of covid they removed it LOL. I swear sometimes governments are their own worst enemy. Bangalore is jammed already, WFO is now compulsory fo rmany and these jams are never ending. Dominos now delivers their pizzas in a jam as well! Yup, absolutely. Taxis and autos pay higher taxes and go through myriad processes to purchase the licence. Get a license. It's as simple as that. You cannot disturb the public and private transport system just because you feel like carpooling. They're people who make a living out of it. Someone rich enough to have their own car can't just disturb the existing system just cuz they feel like it. It might hurt for you people. But that's the only source of income for them. They have to pay for their unions, for their commercial license, pay the due for their loaned cars. If you really wanna carpool, get a fucking license. Yup, absolutely. Taxis and autos pay higher taxes and go through myriad processes to purchase the licence."
}