{
    "id": "14or91c",
    "title": "Looking for an IEM around budget of inr 2k/25 usd.",
    "url": "https://www.reddit.com/gallery/14or91c",
    "selftext": "These are the ones that I've come across so far\n\nKz edx pro\nMoondrop chu \nBlon bl03 \n7hz salnotes zero \nCca cra plus\nMeze 12 classics v2\nKz zs10 pro\nKz zs10 pro x \ntangzu wan'er s.g\nQkz hbb khan\nMoondrop jiu\nSound magic e11 c\nCca cra\nFinal audio e1000\nKz zex\nKz zst x\nKz zsn pro x \nKz dq 6\nRha ma390\nTruthhear hola\n\n\nAmong these I'm leaning most towards salnotes zero as they seem to be well balanced while also having good lows (also best word of mouth). Although I'm really confused between those and Hola, as Hola seems to fall under the same description, while also excelling it to some extent.\n\nSoundwise, i do prefer more balanced sound which is true to what the artist intended, but sometimes I also like good bass (which i understand i can handle with my eq settings). \n\nMy music taste is kinda all over the place but attaching a ss of it has been so far this year to give yall a better idea of what would be suitable.\n\nAlso, i can increase the budget by a lil if the suggested product is way too good to miss out on.",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 38,
    "created_utc": 1688312186.0,
    "convurl": "https://i.redd.it/x2vgd4twmk9b1.jpg",
    "comments": [
        "QKZ x HBB Khan is ₹4k I think u were talking about the QKZ x HBB\n\nI think from looking at ur library (not heard the Indian artists outside of Prabh Deep n Seedhe Maut, everything else is covered) I'd say Tangzu Wa'ner would be a great choice; QKZ x HBB would be good too but is a bit more warmer.\n\nSalnotes Zero isn't good at lows it's just neutral bright. The Hola is way more smoother than the Salnotes. IMO Tangzu Wa'ner still beats both of them.",
        "OP, I've been using Soundmagic E11 C for nearly 6 months now, and you should consider them. \n\nGreat build quality, well balanced sound with great mids and lows. However, you could also check out r/headphoneadvice too.",
        "Have you personally used wa'ner? If so, how has your experience been?",
        "Yeah, i heard great things bout em too. Will definitely check some in depth reviews now",
        "I currently use the Wan'Er. They're pretty good across all genres (minus very vocal heavy tracks).",
        "Hey ,\n\nI currently have -  \n\n* 7Hz zero \n* BLON BL 03\n* RHA MA 390\n*  Moondrop Chu\n\nYou can skip RHA as that is very old now\n\nAcross all these \n\n**Bass** \\- BLON > CHU > Zero\n\nZero has the least bass and that is difficult to fix with an eq as increasing the bass leads to  bleed into the mids. Blon has the most quantity of sub bass. Chu i think strikes the right balance, it responds well to eq as well.\n\n**Mids** \\- Zero > CHU > Blon\n\nZero is great for vocals and instruments they sound very real and natural. Blon has its mids recessed a little bit.\n\n**Highs** \\- Zero > CHU > Blon\n\nZero is great here too. Chu and blon are average\n\n**Soundstage** \\- Zero > Blon > CHU\n\nOne weakness of CHU in that the sound stage is very small when compared to these two\n\n**Imaging** \\- CHU > Zero > Blon\n\nCHU is good with imaging, I listen to ASMR videos and they sound the best on it\n\nNotes - \n\n1. Some people have fit issues with BLONs, your milage will vary\n2. CHU doesn't have detachable cables, but it includes a mic\n\nFor Hola you can watch this video to listen to the differences in its sound - [Video](https://www.youtube.com/watch?v=WUI0r_nuQfQ&t=1549s)\n\nIf you want a mix of ZERO and BLON you can also look at TinHifi T3 plus, but that is costly at 5,700. [Link](https://www.headphonezone.in/products/tin-hifi-t3-plus). In the above video the reviewer has added its comparision as well.\n\nI am currently using T3+ and find it to be really good across all genre of songs\n\nHope this helps your decision making :)",
        "Ohh, now that would be a problem for me cuz most of my fav bands have very vocal heavy tracks with very lo-fi bedroom production",
        "Hey, thanks for the detailed write up man. Yk, i was already leaning towards zero, nd ur writeup jst made me more interested in em. Tell me, is the bass too low to hinder my ability to enjoy songs, or it's jst the right amount so that unless I'm craving for heavy bass, it wouldn't mess w my experience of listening to music. Also, t3+ are way out of budget for me rn. Plus these are my first iems so don't wanna spend too much before gettin the first hand experience.",
        "Yeah I used it for a short time, have a group of friends who exchange these IEMs for giving it a listen. I've tried both Salnotes Zero and the Tangzu Wa'ner and own the QKZ x HBB (and Truthear x Crinacle Zero and a few others).      \nIf you live in Lko n wanna give the QKZ or the Truthears a listen, then do DM. \n\nI had recommended the QKZ x HBB earlier coz ur library looked mostly Hip and Pop but since u insisted on getting a neutral-ish signature I said Tangzu Wa'ner. \n\nI read the other replies too and three  IEMs I don't want u to go for are soundmagic, final or blon one's all three are outdated n outclassed and KZ is a weird company so try at ur own risk. Also listening to how an IEM sounds is one of the dumest thing I've seen here - just ignore that, it cannot, by any way, give u an idea of how the IEM will sound. \n\nThe cable on the Wa'ner was ok but will get yellow soon (it's that plastic thingy where transparent stuff gets yellow, UV or oxygen idk which). The cables are modular and can be replaced cheaply. \n\n\nThe Hola is great! It's a bit weird why I didn't focus much on it in the previous comment. It is the most v shape out of the top 3 reccs by most commenters on ur post, and the mid range is a bit \"ajeeb\" I found it unnatural but im really nitpicking here. But the bass and soundstage are better on Hola compared to Tangzu Wa'ner, and the cable is better and a more widely accepted pin type compared to Tangzu although I like the looks on the Wa'ner more. But the Tangzu is more neutral tuned and sounds more natural than Hola but that's not always better. Sry for the long reply but I'd say it's a coin toss b/w these two. \n\n[here's a vid to confuse u a bit more](https://youtu.be/SP3kZ5gbrfI)",
        "No need to apologise, u've been incredibly helpful with ur answers. I'll watch that video later nd maybe a few more comparisons between we'ner nd hola. Bt i gotta tell u, I'm still somewhat hung up on zero, maybe cuz the amount of ppl that had suggested it has been a lot. Also, most ppl are raving bout their highs and mids which is very important for the indie rock stuff that i mostly fw. As u've used zero, i wanna know one thing, is the bass quality so disappointing that it would hinder my ability to enjoy music normally, or it's jst that it doens't have that punch bt isn't bad or average enough to affect my listening. Like i jst wanna enjoy the music in it's purest form lol, is zero good enough for that?",
        "So the bass is enough to enjoy, Bass will be present there but it won't have the punch.  Focus is on instruments and vocals. \n\nIf you like heavy bass then you wont like these. If you have used boat or Sony XB earphones then bass is way lesser.\n\nSo in Maina song my Seedhe Maut, You get the bass at 0:20, In that song, you'll have more focus on the vocals and instruments rather than the bass. \n\nBelow is the EQ i apply to make bass more prominent\n\nhttps://preview.redd.it/zdyvszjogm9b1.png?width=798&format=png&auto=webp&v=enabled&s=a5bba147ee54914e062554f6266bead1ff24eba4\n\nHere are some some comparison videos that you can listen and compare on your own - \n\n* [7Hz vs WAN'ER](https://youtube.com/shorts/mClatbQLV98?feature=share)\n* [HBB Khan Vs 7Hz](https://youtu.be/swejkFpZfBM)\n* [7Hz Audio Demo](https://youtu.be/QvjU8A4eBPs)\n\nThanks!",
        "I think i did a shitty job at putting across wht i wanted to ask despite using a lot of words, so I'll try again, bear with me! \nSo the bass too low to hinder my ability to enjoy songs, or it's jst the right amount so that unless I'm craving for heavy bass, it wouldn't mess w my experience of listening to music?",
        "Sure, ill go thru em. Ek aur baat batana doe, ill be coming off one plus bullets z2 neckband, nd oppo enco air 2 pro, so did u happen to use any of em? If yes, then ig u'd have an idea of the bass that I'm used to. Now as long as the bass on zero is better than that, they're cool for me.",
        "The zero was good when it launched but it soon became outclassed by these two - as a point of reference, a month in the current iem world is equal to six months of mobile launch months or one year of laptop/PC world.     \nTo add to that the overall zero package is also not very inspiring, the build is plastic (imo looks cheap) and then we have others who have shone in both tuning and looks, the Hola looks premium and Wa'ner is unique. \n\nI'd say ask around in ur friend circles if they have these IEMs, give them a listen and see what you like. To me it sounded really flat but I regularly pick up the bassy IEMs so I'm biased in that way. To me it sounded really lacking, tbh all of these sounded lacking but the least of them were the Wa'ner and Hola(coz I'm used to bassier IEMs like the TZero/HBB.\n\nIf you get the Zero then it's great, your next purchase would be perfect in every way, since the Zeros are the closest you get to neutral sound: you can learn what you like n dislike and choose these accordingly. Zero is also good in a way that it uses 0.78mm cables - these are easily found and replaced like the Hola.      \nThe faceplate is metal so I think it could survive a step or two.          \nI remember a friend who crushed their DQ6 in one go lol.",
        "no, I have not used them.",
        "MDR EX255 AP",
        "Ahh, fellow wolf.cryman enjoyer",
        "Thanks for the detailed write up man. Reduced my confusion nd bias towards Zero by a lot. Along with the videos u suggested, I'll go nd watch some comparisons between We'ner nd Hola as they seem pretty even.",
        "Okay, thanks for the help man!",
        "I suppose you've used em yourselves. How has ur experience been nd how's the sound signature?",
        "Guilty as charged ;)",
        "If you reply to ur own comment I don't get notified. \n\nAt the price point you are looking, there aren't IEMs that can easily produce clear sound without affecting the other parts of the mix. For example my Truthear x Crinacle Zero (or HBB Khan) has a lot of bass but since it uses dual dynamic drivers(that use a crossover+ are of relatively good quality) the bass is loud but won't affect the other parts.      \nMost IEMs u are looking at are single DD's, in those, if you elevate one part it really clouds other stuff. This mostly happens in bad IEMs (example older KZ's) and TWS. \nThe ones we are talking about here ie Salnotes Zero, Tangzu Wa'ner or Truthear Hola do not have this as they are already flat. Even tho we are saying that Hola is slightly more v shape then Zero; in absolute terms it's not that much. \n\nI'd say you should look at the graphs of these compared to normal IEMs or tws that you have owned. Subjective opinions can only get you that far. \n\nComparisons:        \n\n [Hola vs Waner](https://i.imgur.com/REGygAZ.png)       \n[Zero vs Wa'ner vs Hola](https://i.imgur.com/YHAPt1S.png)",
        "you're right. the difference doesn't seem to be all that much. Maybe I wouldn't even notice it as they are my first pair of items (coming off my enco air 2 pro). I think I'm gonna go for zero, as they seem to be perfect my indie rock stuff listening. Will rely on eqing for my experimental hip hop listening phases. Anyways, thanks man. Although I'm not going w ur recommendation, u've been really helpful.",
        "No I don't mind if you buy the exact one I recc, just wanted to steer you away from the bad stuff that people were recommending.    \nAll three were great and yeah eq would help. Don't expect a lot though, these are cheaper IEMs but they'll defo sound really high quality compared to normal earphones from the likes of boat or cheap Sony etc.     \nI dunno how the Oppo sounds, might even be good (but I think otherwise). I'm sayin this coz oppo is a really hi-end audio manufacturer too. Their cheapest offerings start from 40k and go up to a few lakhs.\n\nDo check out other accessories for the zero or even TWS adapters. I've saving money for the Fiio UTWS5 so that I can convert mine to tws.",
        "Ended up ordering Zero. To tell u the truth, I think I might have made up my mind about buying em just off all the videos that I saw on yt raving bout em, and now I was just looking for people to validate my pick by posting on all these subreddits lol, nd dude... did I get all the validation that I needed!! Anyways, they will be my first pair of iems so I hope they turn out to be good, so that I don't mind buying an expansive pair later. Btw do you have any accessories in mind that might improve my experience with Zero?",
        "To look back at ur decision, tbh I thought u were caught by the \"gurus\" at HeadphoneZone coz u repeated about the artist intention part. \nThat's mostly their shtick. \nLuckily u didn't buy the Soundmagic IEMs so I guess they failed lol. \n\nBy accessories I meant if the tips don't fit you could buy extra sets and maybe a better wire, I generally like black color wire or something that contrasts well with my IEMs so it's usually a Tripowin Zombur or Jcally JC 8S. And yeah maybe a DAC AMP combo like the Apple DAC for USB/Lightning imo it's the best for IEMs (if you don't have a headphone jack)",
        "If i do have a headphone jack, should i still get a dac? I heard somewhere that dac can provide a better quality than the in-built jack in our cellphones, is there some truth to that or it's jst bs?",
        "Bro i also want to buy iem through youur post in r/IndianHipHopHeads pls help me",
        "Sure, hit u on the chat!",
        "If you can't hear any buzz/static or artefacts in the sound + if your earphones get loud enough on the in built DAC then yeah u don't need expensive DACs. \n\nIf you do use \"hard to drive\" headsets then maybe more powerful DACs are required but generally phone DACs can easily power IEMs. \n\nI don't reply on that other subreddit u were talking on but don't waste money on a DAC/Amp\n\nIf you don't trust me trust [this guy: Crinacle](https://youtu.be/a3moaaOpYZM), He tuned the 7hz Salnotes Zero & Dioko, Truthear Zero & Red, Moondrop Blessing 2 Dusk etc. \n\n***\n\nThat other accessory I said [was this](https://www.headphonezone.in/products/fiio-utws5), it's a universal tws adapter. I am currently saving up for this.",
        "Yeah, ig I'll be going with jst my 3.5 mm jack for now, dac maybe later down the line. Hopefully for a better headset. Thanks for the heads up doe, nd let me know when u do end up gettin that tws adapter. Like I'm gonna need a proper detailed review from you lol",
        "You'll be hard pressed to find these hard to drive headphones I've seen less than 15 even mentioned on reddit/elsewhere, they were mostly older inefficient planars and a few Sennheisers here and there. \n\nThe UTWS5 is great and the only tws adapter in the mkt that has good codec support, repair-ability is what's making not buy them rn (as u know tws battery cannot be replaced easily, most are glued in) coz they die in 3-4 yrs. I don't wanna spend 10-13k every two yrs on an adapter. \n\nYou can check reviews here: https://www.head-fi.org/showcase/fiio-utws5.25657/reviews (do take the subjective parts with a grain of salt coz most of it is wrong, the tws has a flat response) \n\nThe only complaint I read was the lack of LDAC but since I own a chinese brand phone and generally stick to bbk brands(OnePlus, Oppo, Realme) I can still easily use LHDC and get great audio.",
        "hi , saw you are based in lko , i am currently based there , any chance i can get to use the iems as i am also looking to try for first time and there is no such shops as to try these , can only try via in person.",
        "I just own a QKZ x HBB and a Truthear x Crinacle Zero, if you wanna try those then DM.\nMy QKZ x HBB will be free by 15th (brother is using it for online exams).        \nWhat IEMs are you looking to buy? \n\nMy friends would prolly say no for loaning theirs since u ain't an IRL friend + they don't live in LKO\n\nEdit: I looked at ur older post on headphone advice and I'd say go for the 7hz Salnotes Zero or the Tangzu Wa'ner because the one's I have are actually \"dhichik dhichik\", especially the Truthear x Crinacle Zero. But both are great for gaming. They don't have that much bass as compared to mainstream brands like Sony, Boat, Realme, etc but when compared to IEMs it's a lot. \n\nIf you are into gaming then blindly go for the Truthear x Crinacle Zero you won't find any IEM or headphones better than this under 10k.",
        "actually i don't have enough knowledge on those charts and often gets confused , according to people into it , they have told to try cca cra if you like a bass boosted thing , salnotes zero is pretty lack luster at sub bass region and flat in general like balanced , i have also saw the moondrop jiu at 2.2k and they have told it is perfect according to my needs . \n\nthe thing is there are already hundred of models/ variations available to try and purchasing each and trying/experiencing them personally is quite a  task , like i want to try atleast 4-5 of em (like cra , salnotes , waner , jiu ) but couldn't that is why i am relying on the people experiences",
        "Sry for replying late I didn't see ur comment\n\nI wouldn't recommend the Jiu because it's not modular. Aka the cable is permanent. Also the Type C cable needing makes it a bit less universal than ur usual IEMs. This makes it a bad choice as replaceable cables are a norm in the iem mkt, choosing something outside is technically buying e-waste. \n\nTo address the 3nd part I'd say check out reviews by the reviewer WhatsNew. He likes the balanced genre but since his audience is mostly bass listeners he will give out reccs related to that too.       \n I mean he doesn't ignore the bass region like a few reviewers do. If u want a more suitable basshead reviewer then HBB (aka bad guy good audio reviews) is the person to look at.       \nI personally go with HBB's reccs because his graphs are similar to what I like in sound (ie more of the fun elements)       \nAnd also Crinacle is the most famous and maybe the best IEM reviews obviously his reccs are great but videos are infrequent so you wouldn't get the exact best at the moment kinda reviews.        \nAudio Science review is good if you like reading/not youtube content.       \nThere's also Super* Reviews and GizAudio that you can look at. Lastly Fresh Reviews is the goat for gaming related content. \n\nHmm maybe we should make an exchange group for r/lucknow for us IEM people. But since most people leave or are trying to leave lucknow so idk if it'll work or not. \n\nFor ur recc u can list out what you want maybe I'll be able to come up with something. Also max budget at hand",
        ">For ur recc u can list out what you want maybe I'll be able to come up with something. Also max budget at hand\n\ni have got the 4k max budget , i'm sharing the playlist ,hope this helps [https://open.spotify.com/playlist/4hUJfj7X4ibglzi7hr0zlv?si=8e8cae51739c4c8c&nd=1](https://open.spotify.com/playlist/4hUJfj7X4ibglzi7hr0zlv?si=8e8cae51739c4c8c&nd=1)",
        "So the list looks like fun music, and mostly pop but vocals are imp too. \n\nSo this might be quite controversial but if you live fun sounds but enjoy bass too then pls do check out reviews of QKZ x HBB Khan. It has two drivers, a dedicated one for bass so the bass distortion or bass overpowering the mids is lower than most, although the correct recommendation would've been the Truthear x Crinacle Zero Red (₹4.9k) but hard cap on the budget wouldn't allow that. \n\nSince this would be ur first IEM I'd say don't splurge that much on the iem, see what you like and what u don't like. The best thing about these is their modular design so their longevity is higher than ur usual earbuds and wayy higher than a TWS. \n\nThe top three in the cheaper segment as I've said in lots of comments above are \n\n* Truthear Hola\n\n* Tangzu Wa'ner\n\n* 7hz Salnotes Zero\n\nCheck out comparisons between these three and make a purchase, these are all good. No other iem released before this at that price range (or even a bit higher) has been able to compete with these three. All of them are winners in their own style. Since audio is really subjective you'll have to make a decision on what parts u like. \n\nYoutubers like Crinacle, Bad Guy Good Audio Reviews, GizAudio, Super* Review, Super Chonk, WhatsNew have done reviews of all these, you can see what they say and even look at reviews on HeadFi, I've given all of my thoughts above in the comments"
    ],
    "cleaned_text": "looking iem around budget inr k usd ones ive come across far kz edx pro moondrop chu blon bl hz salnotes zero cca cra plus meze classics v kz zs pro kz zs pro x tangzu waner sg qkz hbb khan moondrop jiu sound magic e c cca cra final audio e kz zex kz zst x kz zsn pro x kz dq rha truthhear hola among im leaning towards salnotes zero seem well balanced also good lows also best word mouth although im really confused hola hola seems fall description also excelling extent soundwise prefer balanced sound true artist intended sometimes also like good bass understand handle eq settings music taste kinda place attaching ss far year give yall better idea would suitable also increase budget lil suggested product way good miss ",
    "cleaned_title": "looking iem around budget inr k usd",
    "cleaned_selftext": "ones ive come across far kz edx pro moondrop chu blon bl hz salnotes zero cca cra plus meze classics v kz zs pro kz zs pro x tangzu waner sg qkz hbb khan moondrop jiu sound magic e c cca cra final audio e kz zex kz zst x kz zsn pro x kz dq rha truthhear hola among im leaning towards salnotes zero seem well balanced also good lows also best word mouth although im really confused hola hola seems fall description also excelling extent soundwise prefer balanced sound true artist intended sometimes also like good bass understand handle eq settings music taste kinda place attaching ss far year give yall better idea would suitable also increase budget lil suggested product way good miss",
    "cleaned_comments": "qkz x hbb khan k think u talking qkz x hbb think looking ur library heard indian artists outside prabh deep n seedhe maut everything else covered id say tangzu waner would great choice qkz x hbb would good bit warmer salnotes zero isnt good lows neutral bright hola way smoother salnotes imo tangzu waner still beats op ive using soundmagic e c nearly months consider great build quality well balanced sound great mids lows however could also check rheadphoneadvice personally used waner experience yeah heard great things bout em definitely check depth reviews currently use waner theyre pretty good across genres minus vocal heavy tracks hey currently hz zero blon bl rha moondrop chu skip rha old across bass blon chu zero zero least bass difficult fix eq increasing bass leads bleed mids blon quantity sub bass chu think strikes right balance responds well eq well mids zero chu blon zero great vocals instruments sound real natural blon mids recessed little bit highs zero chu blon zero great chu blon average soundstage zero blon chu one weakness chu sound stage small compared two imaging chu zero blon chu good imaging listen asmr videos sound best notes people fit issues blons milage vary chu doesnt detachable cables includes mic hola watch video listen differences sound videohttpswwwyoutubecomwatchvwuirnuqfqts want mix zero blon also look tinhifi plus costly linkhttpswwwheadphonezoneinproductstinhifitplus video reviewer added comparision well currently using find really good across genre songs hope helps decision making ohh would problem cuz fav bands vocal heavy tracks lofi bedroom production hey thanks detailed write man yk already leaning towards zero nd ur writeup jst made interested em tell bass low hinder ability enjoy songs jst right amount unless im craving heavy bass wouldnt mess w experience listening music also way budget rn plus first iems dont wan na spend much gettin first hand experience yeah used short time group friends exchange iems giving listen ive tried salnotes zero tangzu waner qkz x hbb truthear x crinacle zero others live lko n wan na give qkz truthears listen dm recommended qkz x hbb earlier coz ur library looked mostly hip pop since u insisted getting neutralish signature said tangzu waner read replies three iems dont want u go soundmagic final blon ones three outdated n outclassed kz weird company try ur risk also listening iem sounds one dumest thing ive seen ignore way give u idea iem sound cable waner ok get yellow soon plastic thingy transparent stuff gets yellow uv oxygen idk cables modular replaced cheaply hola great bit weird didnt focus much previous comment v shape top reccs commenters ur post mid range bit ajeeb found unnatural im really nitpicking bass soundstage better hola compared tangzu waner cable better widely accepted pin type compared tangzu although like looks waner tangzu neutral tuned sounds natural hola thats always better sry long reply id say coin toss bw two heres vid confuse u bit morehttpsyoutubespkzgbrfi need apologise uve incredibly helpful ur answers ill watch video later nd maybe comparisons wener nd hola bt got ta tell u im still somewhat hung zero maybe cuz amount ppl suggested lot also ppl raving bout highs mids important indie rock stuff mostly fw uve used zero wan na know one thing bass quality disappointing would hinder ability enjoy music normally jst doenst punch bt isnt bad average enough affect listening like jst wan na enjoy music purest form lol zero good enough bass enough enjoy bass present wont punch focus instruments vocals like heavy bass wont like used boat sony xb earphones bass way lesser maina song seedhe maut get bass song youll focus vocals instruments rather bass eq apply make bass prominent comparison videos listen compare hz vs wanerhttpsyoutubecomshortsmclatbqlvfeatureshare hbb khan vs hzhttpsyoutubeswejkfpzfbm hz audio demohttpsyoutubeqvjuaebps thanks think shitty job putting across wht wanted ask despite using lot words ill try bear bass low hinder ability enjoy songs jst right amount unless im craving heavy bass wouldnt mess w experience listening music sure ill go thru em ek aur baat batana doe ill coming one plus bullets z neckband nd oppo enco air pro u happen use em yes ig ud idea bass im used long bass zero better theyre cool zero good launched soon became outclassed two point reference month current iem world equal six months mobile launch months one year laptoppc world add overall zero package also inspiring build plastic imo looks cheap others shone tuning looks hola looks premium waner unique id say ask around ur friend circles iems give listen see like sounded really flat regularly pick bassy iems im biased way sounded really lacking tbh sounded lacking least waner holacoz im used bassier iems like tzerohbb get zero great next purchase would perfect every way since zeros closest get neutral sound learn like n dislike choose accordingly zero also good way uses mm cables easily found replaced like hola faceplate metal think could survive step two remember friend crushed dq one go lol used mdr ex ap ahh fellow wolfcryman enjoyer thanks detailed write man reduced confusion nd bias towards zero lot along videos u suggested ill go nd watch comparisons wener nd hola seem pretty even okay thanks help man suppose youve used em ur experience nd hows sound signature guilty charged reply ur comment dont get notified price point looking arent iems easily produce clear sound without affecting parts mix example truthear x crinacle zero hbb khan lot bass since uses dual dynamic driversthat use crossover relatively good quality bass loud wont affect parts iems u looking single dds elevate one part really clouds stuff mostly happens bad iems example older kzs tws ones talking ie salnotes zero tangzu waner truthear hola already flat even tho saying hola slightly v shape zero absolute terms much id say look graphs compared normal iems tws owned subjective opinions get far comparisons hola vs wanerhttpsiimgurcomregygazpng zero vs waner vs holahttpsiimgurcomyhaptspng youre right difference doesnt seem much maybe wouldnt even notice first pair items coming enco air pro think im gon na go zero seem perfect indie rock stuff listening rely eqing experimental hip hop listening phases anyways thanks man although im going w ur recommendation uve really helpful dont mind buy exact one recc wanted steer away bad stuff people recommending three great yeah eq would help dont expect lot though cheaper iems theyll defo sound really high quality compared normal earphones likes boat cheap sony etc dunno oppo sounds might even good think otherwise im sayin coz oppo really hiend audio manufacturer cheapest offerings start k go lakhs check accessories zero even tws adapters ive saving money fiio utws convert mine tws ended ordering zero tell u truth think might made mind buying em videos saw yt raving bout em looking people validate pick posting subreddits lol nd dude get validation needed anyways first pair iems hope turn good dont mind buying expansive pair later btw accessories mind might improve experience zero look back ur decision tbh thought u caught gurus headphonezone coz u repeated artist intention part thats mostly shtick luckily u didnt buy soundmagic iems guess failed lol accessories meant tips dont fit could buy extra sets maybe better wire generally like black color wire something contrasts well iems usually tripowin zombur jcally jc yeah maybe dac amp combo like apple dac usblightning imo best iems dont headphone jack headphone jack still get dac heard somewhere dac provide better quality inbuilt jack cellphones truth jst bs bro also want buy iem youur post rindianhiphopheads pls help sure hit u chat cant hear buzzstatic artefacts sound earphones get loud enough built dac yeah u dont need expensive dacs use hard drive headsets maybe powerful dacs required generally phone dacs easily power iems dont reply subreddit u talking dont waste money dacamp dont trust trust guy crinaclehttpsyoutubeamoaaopyzm tuned hz salnotes zero dioko truthear zero red moondrop blessing dusk etc accessory said thishttpswwwheadphonezoneinproductsfiioutws universal tws adapter currently saving yeah ig ill going jst mm jack dac maybe later line hopefully better headset thanks heads doe nd let know u end gettin tws adapter like im gon na need proper detailed review lol youll hard pressed find hard drive headphones ive seen less even mentioned redditelsewhere mostly older inefficient planars sennheisers utws great tws adapter mkt good codec support repairability whats making buy rn u know tws battery replaced easily glued coz die yrs dont wan na spend k every two yrs adapter check reviews take subjective parts grain salt coz wrong tws flat response complaint read lack ldac since chinese brand phone generally stick bbk brandsoneplus oppo realme still easily use lhdc get great audio hi saw based lko currently based chance get use iems also looking try first time shops try try via person qkz x hbb truthear x crinacle zero wan na try dm qkz x hbb free th brother using online exams iems looking buy friends would prolly say loaning since u aint irl friend dont live lko edit looked ur older post headphone advice id say go hz salnotes zero tangzu waner ones actually dhichik dhichik especially truthear x crinacle zero great gaming dont much bass compared mainstream brands like sony boat realme etc compared iems lot gaming blindly go truthear x crinacle zero wont find iem headphones better k actually dont enough knowledge charts often gets confused according people told try cca cra like bass boosted thing salnotes zero pretty lack luster sub bass region flat general like balanced also saw moondrop jiu k told perfect according needs thing already hundred models variations available try purchasing tryingexperiencing personally quite task like want try atleast em like cra salnotes waner jiu couldnt relying people experiences sry replying late didnt see ur comment wouldnt recommend jiu modular aka cable permanent also type c cable needing makes bit less universal ur usual iems makes bad choice replaceable cables norm iem mkt choosing something outside technically buying ewaste address nd part id say check reviews reviewer whatsnew likes balanced genre since audience mostly bass listeners give reccs related mean doesnt ignore bass region like reviewers u want suitable basshead reviewer hbb aka bad guy good audio reviews person look personally go hbbs reccs graphs similar like sound ie fun elements also crinacle famous maybe best iem reviews obviously reccs great videos infrequent wouldnt get exact best moment kinda reviews audio science review good like readingnot youtube content theres also super reviews gizaudio look lastly fresh reviews goat gaming related content hmm maybe make exchange group rlucknow us iem people since people leave trying leave lucknow idk itll work ur recc u list want maybe ill able come something also max budget hand ur recc u list want maybe ill able come something also max budget hand got k max budget im sharing playlist hope helps httpsopenspotifycomplaylisthujfjxibglzihrzlvsiecaecccndhttpsopenspotifycomplaylisthujfjxibglzihrzlvsiecaecccnd list looks like fun music mostly pop vocals imp might quite controversial live fun sounds enjoy bass pls check reviews qkz x hbb khan two drivers dedicated one bass bass distortion bass overpowering mids lower although correct recommendation wouldve truthear x crinacle zero red k hard cap budget wouldnt allow since would ur first iem id say dont splurge much iem see like u dont like best thing modular design longevity higher ur usual earbuds wayy higher tws top three cheaper segment ive said lots comments truthear hola tangzu waner hz salnotes zero check comparisons three make purchase good iem released price range even bit higher able compete three winners style since audio really subjective youll make decision parts u like youtubers like crinacle bad guy good audio reviews gizaudio super review super chonk whatsnew done reviews see say even look reviews headfi ive given thoughts comments",
    "light_cleaned_title": "Looking for an IEM around budget of inr 2k/25 usd.",
    "light_cleaned_selftext": "These are the ones that I've come across so far Kz edx pro Moondrop chu Blon bl03 7hz salnotes zero Cca cra plus Meze 12 classics v2 Kz zs10 pro Kz zs10 pro x tangzu wan'er s.g Qkz hbb khan Moondrop jiu Sound magic e11 c Cca cra Final audio e1000 Kz zex Kz zst x Kz zsn pro x Kz dq 6 Rha ma390 Truthhear hola Among these I'm leaning most towards salnotes zero as they seem to be well balanced while also having good lows (also best word of mouth). Although I'm really confused between those and Hola, as Hola seems to fall under the same description, while also excelling it to some extent. Soundwise, i do prefer more balanced sound which is true to what the artist intended, but sometimes I also like good bass (which i understand i can handle with my eq settings). My music taste is kinda all over the place but attaching a ss of it has been so far this year to give yall a better idea of what would be suitable. Also, i can increase the budget by a lil if the suggested product is way too good to miss out on.",
    "light_cleaned_comments": "QKZ x HBB Khan is ₹4k I think u were talking about the QKZ x HBB I think from looking at ur library (not heard the Indian artists outside of Prabh Deep n Seedhe Maut, everything else is covered) I'd say Tangzu Wa'ner would be a great choice; QKZ x HBB would be good too but is a bit more warmer. Salnotes Zero isn't good at lows it's just neutral bright. The Hola is way more smoother than the Salnotes. IMO Tangzu Wa'ner still beats both of them. OP, I've been using Soundmagic E11 C for nearly 6 months now, and you should consider them. Great build quality, well balanced sound with great mids and lows. However, you could also check out r/headphoneadvice too. Have you personally used wa'ner? If so, how has your experience been? Yeah, i heard great things bout em too. Will definitely check some in depth reviews now I currently use the Wan'Er. They're pretty good across all genres (minus very vocal heavy tracks). Hey , I currently have - * 7Hz zero * BLON BL 03 * RHA MA 390 * Moondrop Chu You can skip RHA as that is very old now Across all these **Bass** \\- BLON > CHU > Zero Zero has the least bass and that is difficult to fix with an eq as increasing the bass leads to bleed into the mids. Blon has the most quantity of sub bass. Chu i think strikes the right balance, it responds well to eq as well. **Mids** \\- Zero > CHU > Blon Zero is great for vocals and instruments they sound very real and natural. Blon has its mids recessed a little bit. **Highs** \\- Zero > CHU > Blon Zero is great here too. Chu and blon are average **Soundstage** \\- Zero > Blon > CHU One weakness of CHU in that the sound stage is very small when compared to these two **Imaging** \\- CHU > Zero > Blon CHU is good with imaging, I listen to ASMR videos and they sound the best on it Notes - 1. Some people have fit issues with BLONs, your milage will vary 2. CHU doesn't have detachable cables, but it includes a mic For Hola you can watch this video to listen to the differences in its sound - [Video](https://www.youtube.com/watch?v=WUI0r_nuQfQ&t=1549s) If you want a mix of ZERO and BLON you can also look at TinHifi T3 plus, but that is costly at 5,700. [Link](https://www.headphonezone.in/products/tin-hifi-t3-plus). In the above video the reviewer has added its comparision as well. I am currently using T3+ and find it to be really good across all genre of songs Hope this helps your decision making :) Ohh, now that would be a problem for me cuz most of my fav bands have very vocal heavy tracks with very lo-fi bedroom production Hey, thanks for the detailed write up man. Yk, i was already leaning towards zero, nd ur writeup jst made me more interested in em. Tell me, is the bass too low to hinder my ability to enjoy songs, or it's jst the right amount so that unless I'm craving for heavy bass, it wouldn't mess w my experience of listening to music. Also, t3+ are way out of budget for me rn. Plus these are my first iems so don't wanna spend too much before gettin the first hand experience. Yeah I used it for a short time, have a group of friends who exchange these IEMs for giving it a listen. I've tried both Salnotes Zero and the Tangzu Wa'ner and own the QKZ x HBB (and Truthear x Crinacle Zero and a few others). If you live in Lko n wanna give the QKZ or the Truthears a listen, then do DM. I had recommended the QKZ x HBB earlier coz ur library looked mostly Hip and Pop but since u insisted on getting a neutral-ish signature I said Tangzu Wa'ner. I read the other replies too and three IEMs I don't want u to go for are soundmagic, final or blon one's all three are outdated n outclassed and KZ is a weird company so try at ur own risk. Also listening to how an IEM sounds is one of the dumest thing I've seen here - just ignore that, it cannot, by any way, give u an idea of how the IEM will sound. The cable on the Wa'ner was ok but will get yellow soon (it's that plastic thingy where transparent stuff gets yellow, UV or oxygen idk which). The cables are modular and can be replaced cheaply. The Hola is great! It's a bit weird why I didn't focus much on it in the previous comment. It is the most v shape out of the top 3 reccs by most commenters on ur post, and the mid range is a bit \"ajeeb\" I found it unnatural but im really nitpicking here. But the bass and soundstage are better on Hola compared to Tangzu Wa'ner, and the cable is better and a more widely accepted pin type compared to Tangzu although I like the looks on the Wa'ner more. But the Tangzu is more neutral tuned and sounds more natural than Hola but that's not always better. Sry for the long reply but I'd say it's a coin toss b/w these two. [here's a vid to confuse u a bit more](https://youtu.be/SP3kZ5gbrfI) No need to apologise, u've been incredibly helpful with ur answers. I'll watch that video later nd maybe a few more comparisons between we'ner nd hola. Bt i gotta tell u, I'm still somewhat hung up on zero, maybe cuz the amount of ppl that had suggested it has been a lot. Also, most ppl are raving bout their highs and mids which is very important for the indie rock stuff that i mostly fw. As u've used zero, i wanna know one thing, is the bass quality so disappointing that it would hinder my ability to enjoy music normally, or it's jst that it doens't have that punch bt isn't bad or average enough to affect my listening. Like i jst wanna enjoy the music in it's purest form lol, is zero good enough for that? So the bass is enough to enjoy, Bass will be present there but it won't have the punch. Focus is on instruments and vocals. If you like heavy bass then you wont like these. If you have used boat or Sony XB earphones then bass is way lesser. So in Maina song my Seedhe Maut, You get the bass at 0:20, In that song, you'll have more focus on the vocals and instruments rather than the bass. Below is the EQ i apply to make bass more prominent Here are some some comparison videos that you can listen and compare on your own - * [7Hz vs WAN'ER](https://youtube.com/shorts/mClatbQLV98?feature=share) * [HBB Khan Vs 7Hz](https://youtu.be/swejkFpZfBM) * [7Hz Audio Demo](https://youtu.be/QvjU8A4eBPs) Thanks! I think i did a shitty job at putting across wht i wanted to ask despite using a lot of words, so I'll try again, bear with me! So the bass too low to hinder my ability to enjoy songs, or it's jst the right amount so that unless I'm craving for heavy bass, it wouldn't mess w my experience of listening to music? Sure, ill go thru em. Ek aur baat batana doe, ill be coming off one plus bullets z2 neckband, nd oppo enco air 2 pro, so did u happen to use any of em? If yes, then ig u'd have an idea of the bass that I'm used to. Now as long as the bass on zero is better than that, they're cool for me. The zero was good when it launched but it soon became outclassed by these two - as a point of reference, a month in the current iem world is equal to six months of mobile launch months or one year of laptop/PC world. To add to that the overall zero package is also not very inspiring, the build is plastic (imo looks cheap) and then we have others who have shone in both tuning and looks, the Hola looks premium and Wa'ner is unique. I'd say ask around in ur friend circles if they have these IEMs, give them a listen and see what you like. To me it sounded really flat but I regularly pick up the bassy IEMs so I'm biased in that way. To me it sounded really lacking, tbh all of these sounded lacking but the least of them were the Wa'ner and Hola(coz I'm used to bassier IEMs like the TZero/HBB. If you get the Zero then it's great, your next purchase would be perfect in every way, since the Zeros are the closest you get to neutral sound: you can learn what you like n dislike and choose these accordingly. Zero is also good in a way that it uses 0.78mm cables - these are easily found and replaced like the Hola. The faceplate is metal so I think it could survive a step or two. I remember a friend who crushed their DQ6 in one go lol. no, I have not used them. MDR EX255 AP Ahh, fellow wolf.cryman enjoyer Thanks for the detailed write up man. Reduced my confusion nd bias towards Zero by a lot. Along with the videos u suggested, I'll go nd watch some comparisons between We'ner nd Hola as they seem pretty even. Okay, thanks for the help man! I suppose you've used em yourselves. How has ur experience been nd how's the sound signature? Guilty as charged ;) If you reply to ur own comment I don't get notified. At the price point you are looking, there aren't IEMs that can easily produce clear sound without affecting the other parts of the mix. For example my Truthear x Crinacle Zero (or HBB Khan) has a lot of bass but since it uses dual dynamic drivers(that use a crossover+ are of relatively good quality) the bass is loud but won't affect the other parts. Most IEMs u are looking at are single DD's, in those, if you elevate one part it really clouds other stuff. This mostly happens in bad IEMs (example older KZ's) and TWS. The ones we are talking about here ie Salnotes Zero, Tangzu Wa'ner or Truthear Hola do not have this as they are already flat. Even tho we are saying that Hola is slightly more v shape then Zero; in absolute terms it's not that much. I'd say you should look at the graphs of these compared to normal IEMs or tws that you have owned. Subjective opinions can only get you that far. Comparisons: [Hola vs Waner](https://i.imgur.com/REGygAZ.png) [Zero vs Wa'ner vs Hola](https://i.imgur.com/YHAPt1S.png) you're right. the difference doesn't seem to be all that much. Maybe I wouldn't even notice it as they are my first pair of items (coming off my enco air 2 pro). I think I'm gonna go for zero, as they seem to be perfect my indie rock stuff listening. Will rely on eqing for my experimental hip hop listening phases. Anyways, thanks man. Although I'm not going w ur recommendation, u've been really helpful. No I don't mind if you buy the exact one I recc, just wanted to steer you away from the bad stuff that people were recommending. All three were great and yeah eq would help. Don't expect a lot though, these are cheaper IEMs but they'll defo sound really high quality compared to normal earphones from the likes of boat or cheap Sony etc. I dunno how the Oppo sounds, might even be good (but I think otherwise). I'm sayin this coz oppo is a really hi-end audio manufacturer too. Their cheapest offerings start from 40k and go up to a few lakhs. Do check out other accessories for the zero or even TWS adapters. I've saving money for the Fiio UTWS5 so that I can convert mine to tws. Ended up ordering Zero. To tell u the truth, I think I might have made up my mind about buying em just off all the videos that I saw on yt raving bout em, and now I was just looking for people to validate my pick by posting on all these subreddits lol, nd dude... did I get all the validation that I needed!! Anyways, they will be my first pair of iems so I hope they turn out to be good, so that I don't mind buying an expansive pair later. Btw do you have any accessories in mind that might improve my experience with Zero? To look back at ur decision, tbh I thought u were caught by the \"gurus\" at HeadphoneZone coz u repeated about the artist intention part. That's mostly their shtick. Luckily u didn't buy the Soundmagic IEMs so I guess they failed lol. By accessories I meant if the tips don't fit you could buy extra sets and maybe a better wire, I generally like black color wire or something that contrasts well with my IEMs so it's usually a Tripowin Zombur or Jcally JC 8S. And yeah maybe a DAC AMP combo like the Apple DAC for USB/Lightning imo it's the best for IEMs (if you don't have a headphone jack) If i do have a headphone jack, should i still get a dac? I heard somewhere that dac can provide a better quality than the in-built jack in our cellphones, is there some truth to that or it's jst bs? Bro i also want to buy iem through youur post in r/IndianHipHopHeads pls help me Sure, hit u on the chat! If you can't hear any buzz/static or artefacts in the sound + if your earphones get loud enough on the in built DAC then yeah u don't need expensive DACs. If you do use \"hard to drive\" headsets then maybe more powerful DACs are required but generally phone DACs can easily power IEMs. I don't reply on that other subreddit u were talking on but don't waste money on a DAC/Amp If you don't trust me trust [this guy: Crinacle](https://youtu.be/a3moaaOpYZM), He tuned the 7hz Salnotes Zero & Dioko, Truthear Zero & Red, Moondrop Blessing 2 Dusk etc. *** That other accessory I said [was this](https://www.headphonezone.in/products/fiio-utws5), it's a universal tws adapter. I am currently saving up for this. Yeah, ig I'll be going with jst my 3.5 mm jack for now, dac maybe later down the line. Hopefully for a better headset. Thanks for the heads up doe, nd let me know when u do end up gettin that tws adapter. Like I'm gonna need a proper detailed review from you lol You'll be hard pressed to find these hard to drive headphones I've seen less than 15 even mentioned on reddit/elsewhere, they were mostly older inefficient planars and a few Sennheisers here and there. The UTWS5 is great and the only tws adapter in the mkt that has good codec support, repair-ability is what's making not buy them rn (as u know tws battery cannot be replaced easily, most are glued in) coz they die in 3-4 yrs. I don't wanna spend 10-13k every two yrs on an adapter. You can check reviews here: (do take the subjective parts with a grain of salt coz most of it is wrong, the tws has a flat response) The only complaint I read was the lack of LDAC but since I own a chinese brand phone and generally stick to bbk brands(OnePlus, Oppo, Realme) I can still easily use LHDC and get great audio. hi , saw you are based in lko , i am currently based there , any chance i can get to use the iems as i am also looking to try for first time and there is no such shops as to try these , can only try via in person. I just own a QKZ x HBB and a Truthear x Crinacle Zero, if you wanna try those then DM. My QKZ x HBB will be free by 15th (brother is using it for online exams). What IEMs are you looking to buy? My friends would prolly say no for loaning theirs since u ain't an IRL friend + they don't live in LKO Edit: I looked at ur older post on headphone advice and I'd say go for the 7hz Salnotes Zero or the Tangzu Wa'ner because the one's I have are actually \"dhichik dhichik\", especially the Truthear x Crinacle Zero. But both are great for gaming. They don't have that much bass as compared to mainstream brands like Sony, Boat, Realme, etc but when compared to IEMs it's a lot. If you are into gaming then blindly go for the Truthear x Crinacle Zero you won't find any IEM or headphones better than this under 10k. actually i don't have enough knowledge on those charts and often gets confused , according to people into it , they have told to try cca cra if you like a bass boosted thing , salnotes zero is pretty lack luster at sub bass region and flat in general like balanced , i have also saw the moondrop jiu at 2.2k and they have told it is perfect according to my needs . the thing is there are already hundred of models/ variations available to try and purchasing each and trying/experiencing them personally is quite a task , like i want to try atleast 4-5 of em (like cra , salnotes , waner , jiu ) but couldn't that is why i am relying on the people experiences Sry for replying late I didn't see ur comment I wouldn't recommend the Jiu because it's not modular. Aka the cable is permanent. Also the Type C cable needing makes it a bit less universal than ur usual IEMs. This makes it a bad choice as replaceable cables are a norm in the iem mkt, choosing something outside is technically buying e-waste. To address the 3nd part I'd say check out reviews by the reviewer WhatsNew. He likes the balanced genre but since his audience is mostly bass listeners he will give out reccs related to that too. I mean he doesn't ignore the bass region like a few reviewers do. If u want a more suitable basshead reviewer then HBB (aka bad guy good audio reviews) is the person to look at. I personally go with HBB's reccs because his graphs are similar to what I like in sound (ie more of the fun elements) And also Crinacle is the most famous and maybe the best IEM reviews obviously his reccs are great but videos are infrequent so you wouldn't get the exact best at the moment kinda reviews. Audio Science review is good if you like reading/not youtube content. There's also Super* Reviews and GizAudio that you can look at. Lastly Fresh Reviews is the goat for gaming related content. Hmm maybe we should make an exchange group for r/lucknow for us IEM people. But since most people leave or are trying to leave lucknow so idk if it'll work or not. For ur recc u can list out what you want maybe I'll be able to come up with something. Also max budget at hand >For ur recc u can list out what you want maybe I'll be able to come up with something. Also max budget at hand i have got the 4k max budget , i'm sharing the playlist ,hope this helps [https://open.spotify.com/playlist/4hUJfj7X4ibglzi7hr0zlv?si=8e8cae51739c4c8c&nd=1](https://open.spotify.com/playlist/4hUJfj7X4ibglzi7hr0zlv?si=8e8cae51739c4c8c&nd=1) So the list looks like fun music, and mostly pop but vocals are imp too. So this might be quite controversial but if you live fun sounds but enjoy bass too then pls do check out reviews of QKZ x HBB Khan. It has two drivers, a dedicated one for bass so the bass distortion or bass overpowering the mids is lower than most, although the correct recommendation would've been the Truthear x Crinacle Zero Red (₹4.9k) but hard cap on the budget wouldn't allow that. Since this would be ur first IEM I'd say don't splurge that much on the iem, see what you like and what u don't like. The best thing about these is their modular design so their longevity is higher than ur usual earbuds and wayy higher than a TWS. The top three in the cheaper segment as I've said in lots of comments above are * Truthear Hola * Tangzu Wa'ner * 7hz Salnotes Zero Check out comparisons between these three and make a purchase, these are all good. No other iem released before this at that price range (or even a bit higher) has been able to compete with these three. All of them are winners in their own style. Since audio is really subjective you'll have to make a decision on what parts u like. Youtubers like Crinacle, Bad Guy Good Audio Reviews, GizAudio, Super* Review, Super Chonk, WhatsNew have done reviews of all these, you can see what they say and even look at reviews on HeadFi, I've given all of my thoughts above in the comments"
}