{
    "id": "14wqrke",
    "title": "Happening in Delhi | The Glass Room: Misinformation Edition",
    "url": "https://www.reddit.com/r/india/comments/14wqrke/happening_in_delhi_the_glass_room_misinformation/",
    "selftext": "https://preview.redd.it/cw45af153cbb1.png?width=1600&format=png&auto=webp&s=c0a96498a3070934c617c0fce827f1284680708c\n\nIFF, Khoj Studios & Tactical Tech are thrilled to announce that \"The Glass Room: Misinformation Edition\" is \\*finally\\* coming to Delhi✨\n\nJoin us for the launch of the 10-day exhibition on July 20, 2023, at Khoj Studio, Khirkee Extension, New Delhi.\n\nThe Glass Room is for you if you’ve ever thought:  \n❓Did the Pope really wear that oversized white puffer?\n\n❓How much time do I \\*actually\\* spend on my phone?  \n❓Can I even tell what’s “fake” online anymore?   \n❓How much did Google really know about us?  \n❓How do I tackle misinformation & protect my privacy online?  \n❓I like having a good time and learning new things 3/5\n\nThe Glass Room is an award-winning exhibition by Tactical Tech that has been featured by top-tier media houses & hosted in 61 countries 🌏It is designed to prompt reflection on how misinformation spreads in the digital age & impacts our culture, politics, & society. \n\nFor a fascinating journey through how the gatekeepers of technology influence our behaviour and opinions, join us for the launch on July 20 at Khoj or visit the self-learning installation anytime from July 20-30, 2023! \n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689080469.0,
    "convurl": "https://b.thumbs.redditmedia.com/RhulAUnhU815QjIFtlsCg9hZqti9EjPeac5KB0eF4OY.jpg",
    "comments": [],
    "cleaned_text": "happening delhi glass room misinformation edition iff khoj studios tactical tech thrilled announce glass room misinformation edition finally coming delhi join us launch day exhibition july khoj studio khirkee extension new delhi glass room youve ever thought pope really wear oversized white puffer much time actually spend phone even tell whats fake online anymore much google really know us tackle misinformation protect privacy online like good time learning new things glass room awardwinning exhibition tactical tech featured toptier media houses hosted countries designed prompt reflection misinformation spreads digital age impacts culture politics society fascinating journey gatekeepers technology influence behaviour opinions join us launch july khoj visit selflearning installation anytime july xb ",
    "cleaned_title": "happening delhi glass room misinformation edition",
    "cleaned_selftext": "iff khoj studios tactical tech thrilled announce glass room misinformation edition finally coming delhi join us launch day exhibition july khoj studio khirkee extension new delhi glass room youve ever thought pope really wear oversized white puffer much time actually spend phone even tell whats fake online anymore much google really know us tackle misinformation protect privacy online like good time learning new things glass room awardwinning exhibition tactical tech featured toptier media houses hosted countries designed prompt reflection misinformation spreads digital age impacts culture politics society fascinating journey gatekeepers technology influence behaviour opinions join us launch july khoj visit selflearning installation anytime july xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Happening in Delhi | The Glass Room: Misinformation Edition",
    "light_cleaned_selftext": "IFF, Khoj Studios & Tactical Tech are thrilled to announce that \"The Glass Room: Misinformation Edition\" is \\*finally\\* coming to Delhi✨ Join us for the launch of the 10-day exhibition on July 20, 2023, at Khoj Studio, Khirkee Extension, New Delhi. The Glass Room is for you if you’ve ever thought: ❓Did the Pope really wear that oversized white puffer? ❓How much time do I \\*actually\\* spend on my phone? ❓Can I even tell what’s “fake” online anymore? ❓How much did Google really know about us? ❓How do I tackle misinformation & protect my privacy online? ❓I like having a good time and learning new things 3/5 The Glass Room is an award-winning exhibition by Tactical Tech that has been featured by top-tier media houses & hosted in 61 countries 🌏It is designed to prompt reflection on how misinformation spreads in the digital age & impacts our culture, politics, & society. For a fascinating journey through how the gatekeepers of technology influence our behaviour and opinions, join us for the launch on July 20 at Khoj or visit the self-learning installation anytime from July 20-30, 2023! &#x200B;",
    "light_cleaned_comments": ""
}