{
    "id": "1b51ydi",
    "title": "India Has Eliminated Extreme Poverty, Says US Think Tank Brookings",
    "url": "https://www.ndtv.com/india-news/india-has-eliminated-extreme-poverty-says-us-think-tank-brookings-5162867/amp/1",
    "selftext": "The household consumption has increased, substantial decline in headcount poverty, lower number of impoverished in India, even lower as estimated by the World Bank. Looks like good times ahead.\n",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 4,
    "created_utc": 1709421708.0,
    "convurl": "https://external-preview.redd.it/qrMLksUPMcB1RNv_k31AK5-9V6MKN-BHC730mRd-bYM.jpg?auto=webp&s=e90ebfd3630a602002babb00e46e3291c9ede5d2",
    "comments": [
        "Is it?",
        ">Authored by economists **Surjit Bhalla** and **Karan Bhasin**, the report attributes the achievement to the Indian government's robust policy initiatives focused on redistribution, fostering inclusive growth throughout the past decade.\n\nLMAO. Aren't these authors BJP bootlickers ?",
        "Economically yes.",
        "From the article: “ Authored by economists Surjit Bhalla and Karan Bhasin, the report attributes the achievement to the Indian government's robust policy initiatives focused on redistribution, fostering inclusive growth throughout the past decade.”\nThis is a PR exercise. You can co sponsor publications and report and craft the narrative by putting folks like Mr. Bhalla who are not academics but professional cheerleaders. ",
        "Surjit Bhalla is a prominent economist, boasting credentials like working as economic consultant to organisations like World Bank, Goldman Sachs, etc. Also being an academician having completed his Ph.D in economics from Princeton University. This proves that he is knowledgeable in the field. The accusations of him being just a professional cheerleader might be right, but we have to accept facts when they are right. \n\nYou would say whataboutery and all, but Raghuram Rajan is another prominent economist and he had very pessimistic outlook on India’s growth calling it Hindu rate of growth. Now he was wrong there. Calling Surjit Bhalla as Professional cheerleader would be same as calling Raghuram Rajan as professional gloomleader. Now these accusations can be made and might be true as well, but it does not mean their credentials, knowledge, and in general facts cannot be discounted.",
        "p c mohanan, Deepanshu Mohan, Amit basole and R nagaraj and Pronab sen give correct analysis with data"
    ],
    "cleaned_text": "india eliminated extreme poverty says us think tank brookings household consumption increased substantial decline headcount poverty lower number impoverished india even lower estimated world bank looks like good times ahead ",
    "cleaned_title": "india eliminated extreme poverty says us think tank brookings",
    "cleaned_selftext": "household consumption increased substantial decline headcount poverty lower number impoverished india even lower estimated world bank looks like good times ahead",
    "cleaned_comments": "authored economists surjit bhalla karan bhasin report attributes achievement indian governments robust policy initiatives focused redistribution fostering inclusive growth throughout past decade lmao arent authors bjp bootlickers economically yes article authored economists surjit bhalla karan bhasin report attributes achievement indian governments robust policy initiatives focused redistribution fostering inclusive growth throughout past decade pr exercise co sponsor publications report craft narrative putting folks like mr bhalla academics professional cheerleaders surjit bhalla prominent economist boasting credentials like working economic consultant organisations like world bank goldman sachs etc also academician completed phd economics princeton university proves knowledgeable field accusations professional cheerleader might right accept facts right would say whataboutery raghuram rajan another prominent economist pessimistic outlook indias growth calling hindu rate growth wrong calling surjit bhalla professional cheerleader would calling raghuram rajan professional gloomleader accusations made might true well mean credentials knowledge general facts discounted p c mohanan deepanshu mohan amit basole r nagaraj pronab sen give correct analysis data",
    "light_cleaned_title": "India Has Eliminated Extreme Poverty, Says US Think Tank Brookings",
    "light_cleaned_selftext": "The household consumption has increased, substantial decline in headcount poverty, lower number of impoverished in India, even lower as estimated by the World Bank. Looks like good times ahead.",
    "light_cleaned_comments": "Is it? >Authored by economists **Surjit Bhalla** and **Karan Bhasin**, the report attributes the achievement to the Indian government's robust policy initiatives focused on redistribution, fostering inclusive growth throughout the past decade. LMAO. Aren't these authors BJP bootlickers ? Economically yes. From the article: “ Authored by economists Surjit Bhalla and Karan Bhasin, the report attributes the achievement to the Indian government's robust policy initiatives focused on redistribution, fostering inclusive growth throughout the past decade.” This is a PR exercise. You can co sponsor publications and report and craft the narrative by putting folks like Mr. Bhalla who are not academics but professional cheerleaders. Surjit Bhalla is a prominent economist, boasting credentials like working as economic consultant to organisations like World Bank, Goldman Sachs, etc. Also being an academician having completed his Ph.D in economics from Princeton University. This proves that he is knowledgeable in the field. The accusations of him being just a professional cheerleader might be right, but we have to accept facts when they are right. You would say whataboutery and all, but Raghuram Rajan is another prominent economist and he had very pessimistic outlook on India’s growth calling it Hindu rate of growth. Now he was wrong there. Calling Surjit Bhalla as Professional cheerleader would be same as calling Raghuram Rajan as professional gloomleader. Now these accusations can be made and might be true as well, but it does not mean their credentials, knowledge, and in general facts cannot be discounted. p c mohanan, Deepanshu Mohan, Amit basole and R nagaraj and Pronab sen give correct analysis with data"
}