{
    "id": "12xi11x",
    "title": "[Serious] ELI5: How are politicians able to postpone any lawsuits against them indefinitely, unlike the common man/woman?",
    "url": "https://www.reddit.com/r/india/comments/12xi11x/serious_eli5_how_are_politicians_able_to_postpone/",
    "selftext": "The title basically says it all. For example, today the Supreme Court [adjourned the hearing of a case](https://www.thehindu.com/news/national/supreme-court-adjourns-hearing-on-snc-lavalin-case-again/article66035260.ece) against Pinarayi Vijayan, the current CM of Kerala, for the 33rd time — keep in mind that the case has been going on for more than two decades.\n\n---\nEDIT: Grammar.",
    "flair": "AskIndia",
    "score": 294,
    "num_comments": 28,
    "created_utc": 1682347236.0,
    "convurl": "https://external-preview.redd.it/G9LTZ3G3J4iXO8O_W7wFIR011gXOabhtI5_FKAIyjgM.jpg",
    "comments": [
        "You scratch my back, I shall scratch yours...",
        "[Dirty Sexy Money](https://youtube.com/clip/Ugkxk71L2Nb1CNIajMU34XiQUke4pIS14Nuj)",
        "Because the judiciary is corrupt from top to bottom.",
        "I don't get it why do posts like these get no fucking traction, but when someone posts about the supreme leader taking a shit in the most alluring manner, it suddenly gets thousands of upvotes what the fuck.",
        "Ya I'd love to known why as well. Is there no lawyer or activist in this forum who could enlighten us.",
        "CM got immunity maybe.",
        "* Firstly, English common law (i.e. what every modern country follows in some form) is a slow and deliberate system. Lady Justice balances the weight of two sides of facts carefully and metes out exactly appropriate punishment and ideally every criminal who has done the same crime should get the same punishment. The decisions made in every case become precedent, so, in a way you are also writing the effective laws of the land while you do your job as a judge. It's a rigorous process.\n* On top of that, the implementation of English common law that we have comes from the British who were a colonial power at the time and the system was built in a way to keep poor and uneducated Indians under the thumb. While on the surface it may look like what Britain had long ago, the ground reality is different. They introduced features for India such as a system of bribery for clerks and civil servants so that the Indians in charge of the system stayed faithful to the British. Note that if it was Japan that colonized us, we'd have a very different implementation of English common law, probably one where justice is faster. Japan has a nearly 100% conviction rate. \n* Our usual corruption, overpopulation, and laziness combines with the two problems above  makes things even worse. \n* The police system is built like a colonial occupation army. They have absolute power and lots of room to abuse it. On top of that, because of our low resources and incompetence, the police is not the best at properly following its procedures and building a proper chain of evidence and testimony which is essential for getting criminals declared guilty in court. A lot of times, judges are dealing with evidence that is inadmissible in court due to errors and lot of other edge cases.\n* Judges aren't legally required to maintain a certain pace or clear backlogs. They just deal with the cases on their own whims. Corruption is rampant with judges too, although it's not like police officers because they have a much higher standard to uphold and can easily be debarred. \n* Our laws and constitution were written by a bunch of rich kids who went to Oxbridge and tried to copy great ideas from every system and apply it on top of what the British left us with. The result is that we have some amazing laws and procedures that have lots of checks and balances, but they are so idealistic that they are hard to implement correctly in real life. The checks and balances translate in real life to just a list of people to bribe and red tape to cross to get things done. \n* Accountability norms are terribly low in all spheres of national activity, and the court isn't immune to that. Citizenry is also highly corrupt and duplicitous. After all who is it that pays the bribes? We are very comfortable with lying to each other.",
        "Read this Twitter thread by Indian express editor Kumar Sambhav Srivastava to see how things work:\n\nhttps://twitter.com/Kum_Sambhav/status/1183302261092405248?t=QknwBPtehbIp7PmE-UvjxA&s=19",
        "well written",
        "Bribes. \n\nI'm a final year law intern and im just starting to understand how much corruption there is on our legal system. \n\nThe rate for MM in Delhi is 20 Lakh, 40 lakh for CMM and 60 lakh for Session Judge. Rate for Public Prosecutor is 20 40 and 60K respectively. Police is much cheaper with 20-25K for a lot of things, you can also get post Mortem altered for 2 Lakhs. Even the court staff plays Office-office with you till you hand them a 500. \n\nI frankly feel lucky i got this internship and got to learn so much about criminal courts and practices. I'm not sure if The senior I'm under is a good person or not, we help poor people all the time for free but have like 3-4 cases a month of people that are for sure guilty. And intentionally so , \n\nI know it's a strech, but I'm thinking I'll join politics later. That's where the real money is at plus indirect immunity from laws as well.",
        "but i think judges have real power right ? Even more than politician. Then why dont u  want to become judge?",
        "they have power but no money",
        "[Wrong link](https://www.youtube.com/watch?v=AenmqoozqoA)",
        "There was one case where Bribe was delivered to the wrong judge(Nirmaljit) and the investigation found that it was for a different Judge(Nirmal Yadav) who took the same amount of bribe few days later even when the first bribe was caught.\nThe judge is still not convicted and recently a court stayed the pronouncement of the judgement against him till May 23.\n\nhttps://www.barandbench.com/columns/the-cash-at-judges-door-case-a-chronological-revisit",
        "Oh no no, the power that Judges have is when you get caught and have to go to court. Surely as a judge you can take bribes, but if you are smart enough as a politician you can make 100 times the money and that too legally. \n\nPlus Being a Judge is really hard and it can be a tiring job. Politicians however just need money and connections, dedicated drunkards too can become CM of a state",
        "Bots and narrative builder",
        "Because Kerala numba 1",
        "India has a civil law system, not common law.",
        "There is no justice for the common man.\n\nEverything to do with the legal system makes sense once you understand this little nugget of truth.",
        "Can this comment be considered contempt of court? I remember someone in Tamil Nadu making a similar comment and getting charged with this.",
        "Well i haven't named which court so it's fair game.",
        "Not really, maybe. One of the ways the court exerts its power on the people, apart from the use of state institutions such as the police, is through soft power and legitimacy. Implying that corruption exists is a direct assault on the legitimacy of the courts, and by extension, any orders that those courts may pass.",
        "it would be contempt if i allege that this Particular Mr ABC, a Judge in Xyz Court at xyz post takes bribes. \n\nCorruption does exist in judiciary, it is a factually correct statement and hence cannot be contempt of court.",
        "One of the reasons is the parliament sessions. A mp/MLA cannot be arrested for \"civil cases only\" , 40 days even before the session starts, ofc you can't arrest during the session, and guess what even after 40 days of session being over  .",
        "Oh, I didn't know that. Thanks for the info!"
    ],
    "cleaned_text": "serious eli politicians able postpone lawsuits indefinitely unlike common manwoman title basically says example today supreme court adjourned hearing casehttpswwwthehinducomnewsnationalsupremecourtadjournshearingonsnclavalincaseagainarticleece pinarayi vijayan current cm kerala rd time keep mind case going two decades edit grammar ",
    "cleaned_title": "serious eli politicians able postpone lawsuits indefinitely unlike common manwoman",
    "cleaned_selftext": "title basically says example today supreme court adjourned hearing casehttpswwwthehinducomnewsnationalsupremecourtadjournshearingonsnclavalincaseagainarticleece pinarayi vijayan current cm kerala rd time keep mind case going two decades edit grammar",
    "cleaned_comments": "scratch back shall scratch dirty sexy moneyhttpsyoutubecomclipugkxklnbcniajmuxiqukepisnuj judiciary corrupt top bottom dont get posts like get fucking traction someone posts supreme leader taking shit alluring manner suddenly gets thousands upvotes fuck ya id love known well lawyer activist forum could enlighten us cm got immunity maybe firstly english common law ie every modern country follows form slow deliberate system lady justice balances weight two sides facts carefully metes exactly appropriate punishment ideally every criminal done crime get punishment decisions made every case become precedent way also writing effective laws land job judge rigorous process top implementation english common law comes british colonial power time system built way keep poor uneducated indians thumb surface may look like britain long ago ground reality different introduced features india system bribery clerks civil servants indians charge system stayed faithful british note japan colonized us wed different implementation english common law probably one justice faster japan nearly conviction rate usual corruption overpopulation laziness combines two problems makes things even worse police system built like colonial occupation army absolute power lots room abuse top low resources incompetence police best properly following procedures building proper chain evidence testimony essential getting criminals declared guilty court lot times judges dealing evidence inadmissible court due errors lot edge cases judges arent legally required maintain certain pace clear backlogs deal cases whims corruption rampant judges although like police officers much higher standard uphold easily debarred laws constitution written bunch rich kids went oxbridge tried copy great ideas every system apply top british left us result amazing laws procedures lots checks balances idealistic hard implement correctly real life checks balances translate real life list people bribe red tape cross get things done accountability norms terribly low spheres national activity court isnt immune citizenry also highly corrupt duplicitous pays bribes comfortable lying read twitter thread indian express editor kumar sambhav srivastava see things work well written bribes im final year law intern im starting understand much corruption legal system rate mm delhi lakh lakh cmm lakh session judge rate public prosecutor k respectively police much cheaper k lot things also get post mortem altered lakhs even court staff plays officeoffice till hand frankly feel lucky got internship got learn much criminal courts practices im sure senior im good person help poor people time free like cases month people sure guilty intentionally know strech im thinking ill join politics later thats real money plus indirect immunity laws well think judges real power right even politician dont u want become judge power money wrong linkhttpswwwyoutubecomwatchvaenmqoozqoa one case bribe delivered wrong judgenirmaljit investigation found different judgenirmal yadav took amount bribe days later even first bribe caught judge still convicted recently court stayed pronouncement judgement till may oh power judges get caught go court surely judge take bribes smart enough politician make times money legally plus judge really hard tiring job politicians however need money connections dedicated drunkards become cm state bots narrative builder kerala numba india civil law system common law justice common man everything legal system makes sense understand little nugget truth comment considered contempt court remember someone tamil nadu making similar comment getting charged well havent named court fair game really maybe one ways court exerts power people apart use state institutions police soft power legitimacy implying corruption exists direct assault legitimacy courts extension orders courts may pass would contempt allege particular mr abc judge xyz court xyz post takes bribes corruption exist judiciary factually correct statement hence contempt court one reasons parliament sessions mpmla arrested civil cases days even session starts ofc cant arrest session guess even days session oh didnt know thanks info",
    "light_cleaned_title": "[Serious] ELI5: How are politicians able to postpone any lawsuits against them indefinitely, unlike the common man/woman?",
    "light_cleaned_selftext": "The title basically says it all. For example, today the Supreme Court [adjourned the hearing of a case](https://www.thehindu.com/news/national/supreme-court-adjourns-hearing-on-snc-lavalin-case-again/article66035260.ece) against Pinarayi Vijayan, the current CM of Kerala, for the 33rd time — keep in mind that the case has been going on for more than two decades. --- EDIT: Grammar.",
    "light_cleaned_comments": "You scratch my back, I shall scratch yours... [Dirty Sexy Money](https://youtube.com/clip/Ugkxk71L2Nb1CNIajMU34XiQUke4pIS14Nuj) Because the judiciary is corrupt from top to bottom. I don't get it why do posts like these get no fucking traction, but when someone posts about the supreme leader taking a shit in the most alluring manner, it suddenly gets thousands of upvotes what the fuck. Ya I'd love to known why as well. Is there no lawyer or activist in this forum who could enlighten us. CM got immunity maybe. * Firstly, English common law (i.e. what every modern country follows in some form) is a slow and deliberate system. Lady Justice balances the weight of two sides of facts carefully and metes out exactly appropriate punishment and ideally every criminal who has done the same crime should get the same punishment. The decisions made in every case become precedent, so, in a way you are also writing the effective laws of the land while you do your job as a judge. It's a rigorous process. * On top of that, the implementation of English common law that we have comes from the British who were a colonial power at the time and the system was built in a way to keep poor and uneducated Indians under the thumb. While on the surface it may look like what Britain had long ago, the ground reality is different. They introduced features for India such as a system of bribery for clerks and civil servants so that the Indians in charge of the system stayed faithful to the British. Note that if it was Japan that colonized us, we'd have a very different implementation of English common law, probably one where justice is faster. Japan has a nearly 100% conviction rate. * Our usual corruption, overpopulation, and laziness combines with the two problems above makes things even worse. * The police system is built like a colonial occupation army. They have absolute power and lots of room to abuse it. On top of that, because of our low resources and incompetence, the police is not the best at properly following its procedures and building a proper chain of evidence and testimony which is essential for getting criminals declared guilty in court. A lot of times, judges are dealing with evidence that is inadmissible in court due to errors and lot of other edge cases. * Judges aren't legally required to maintain a certain pace or clear backlogs. They just deal with the cases on their own whims. Corruption is rampant with judges too, although it's not like police officers because they have a much higher standard to uphold and can easily be debarred. * Our laws and constitution were written by a bunch of rich kids who went to Oxbridge and tried to copy great ideas from every system and apply it on top of what the British left us with. The result is that we have some amazing laws and procedures that have lots of checks and balances, but they are so idealistic that they are hard to implement correctly in real life. The checks and balances translate in real life to just a list of people to bribe and red tape to cross to get things done. * Accountability norms are terribly low in all spheres of national activity, and the court isn't immune to that. Citizenry is also highly corrupt and duplicitous. After all who is it that pays the bribes? We are very comfortable with lying to each other. Read this Twitter thread by Indian express editor Kumar Sambhav Srivastava to see how things work: well written Bribes. I'm a final year law intern and im just starting to understand how much corruption there is on our legal system. The rate for MM in Delhi is 20 Lakh, 40 lakh for CMM and 60 lakh for Session Judge. Rate for Public Prosecutor is 20 40 and 60K respectively. Police is much cheaper with 20-25K for a lot of things, you can also get post Mortem altered for 2 Lakhs. Even the court staff plays Office-office with you till you hand them a 500. I frankly feel lucky i got this internship and got to learn so much about criminal courts and practices. I'm not sure if The senior I'm under is a good person or not, we help poor people all the time for free but have like 3-4 cases a month of people that are for sure guilty. And intentionally so , I know it's a strech, but I'm thinking I'll join politics later. That's where the real money is at plus indirect immunity from laws as well. but i think judges have real power right ? Even more than politician. Then why dont u want to become judge? they have power but no money [Wrong link](https://www.youtube.com/watch?v=AenmqoozqoA) There was one case where Bribe was delivered to the wrong judge(Nirmaljit) and the investigation found that it was for a different Judge(Nirmal Yadav) who took the same amount of bribe few days later even when the first bribe was caught. The judge is still not convicted and recently a court stayed the pronouncement of the judgement against him till May 23. Oh no no, the power that Judges have is when you get caught and have to go to court. Surely as a judge you can take bribes, but if you are smart enough as a politician you can make 100 times the money and that too legally. Plus Being a Judge is really hard and it can be a tiring job. Politicians however just need money and connections, dedicated drunkards too can become CM of a state Bots and narrative builder Because Kerala numba 1 India has a civil law system, not common law. There is no justice for the common man. Everything to do with the legal system makes sense once you understand this little nugget of truth. Can this comment be considered contempt of court? I remember someone in Tamil Nadu making a similar comment and getting charged with this. Well i haven't named which court so it's fair game. Not really, maybe. One of the ways the court exerts its power on the people, apart from the use of state institutions such as the police, is through soft power and legitimacy. Implying that corruption exists is a direct assault on the legitimacy of the courts, and by extension, any orders that those courts may pass. it would be contempt if i allege that this Particular Mr ABC, a Judge in Xyz Court at xyz post takes bribes. Corruption does exist in judiciary, it is a factually correct statement and hence cannot be contempt of court. One of the reasons is the parliament sessions. A mp/MLA cannot be arrested for \"civil cases only\" , 40 days even before the session starts, ofc you can't arrest during the session, and guess what even after 40 days of session being over . Oh, I didn't know that. Thanks for the info!"
}