{
    "id": "1975y07",
    "title": "Zomato has the worst customer service",
    "url": "https://www.reddit.com/gallery/1975y07",
    "selftext": "So I gifted a hot chocolate to my friend from McDonalds and then he said that the whole hot chocolate has spilled and he received less than even half a glass. I paid nearly Rs300 for this and all Zomato has to say is sorry for the inconvenience. It’s like I’m paying money to just deal with their customer care and not for food. Horrible experience . I even mailed them\nBut still there was no point. Is there anyway to get back at them ?",
    "flair": "Rant / Vent",
    "score": 1096,
    "num_comments": 240,
    "created_utc": 1705315673.0,
    "convurl": "https://i.redd.it/6ujusy113lcc1.jpg",
    "comments": [
        "This is what they replied to the mail\n\nhttps://preview.redd.it/9n2o9s7f3lcc1.jpeg?width=1284&format=pjpg&auto=webp&s=ca23283dcf91427cf0e51a1653c2af53169e2330",
        "tbf it looks like an empty cup, where did everything spill? i think they need more evidence of that",
        "Trueee, Swiggy is the all time OG! I never had such complaints with Swiggy’s customer care. They’re never getting back I guess! Had a similar issue, sent more than 10 mails no response whatsoever.",
        "Wow",
        "Hey, I used to work at Zomato customer support few years back. I can tell you that it depends on your rating there are rating for every customers like gold, silver browns. If you like silver or bronze customer, you will get the same exact exact bot Chat over and over again. All you can do is just email them that’s it.",
        "How to get good ratings ?",
        "I don't blame them for this though. I could order and drink it and provide them this image that it was spilt. You/Your friend did not provide an appropriate image of the packaging showing it was spilt inside.",
        "You should also post photos of spilled. It gives impression that you drink completely then ask refund",
        "why are these subs turning into customer rant platforms ffs",
        "Even I would not have gave you a refund if you provide me this type of picture\n\nprovide a good picture where it shows that it has spilled... otherwise no one would believe you",
        "Dealt with zomato customer service a lot. Tell them you’re unsatisfied and have a human talk to/chat with you. They’re usually better at helping. As a last resort you can also tell em that you’ll be escalating this over social media and Twitter. That usually gets the refund",
        "Be a good customer. Be polite to riders. Don't fret over small issues like 5 mins delay or too many calls to find location. Your delivery executives and customer complaint history determines you ratings, be nice to riders, polite to customer care and make an issue of something when only there is an issue. When I order things like coffee or cake, I call my rider before he picks up the order and tell them \"drive carefully, take your time, I am in no rush, I'll tip you later to make up for lost time\". They mostly listen and appreciate that.",
        "Hmm , one of my friend girl always used to take refund. Maybe her rating got 0 now",
        "Show the delivery bag with the spillage and show the half empty cup. Show the crime scene.\n\nAnyone could enjoy the drink and show a empty cup with a disgusted way of holding the cup",
        "It was your mistake. The spillage should be reported within 5 minutes of your delivery. If there was spillage, the photo should be not of an empty glass, but the photo of the bag in which everything was spilled. There should be other food along with it or else it becomes very difficult for Zomato to get you the compensation. \n\nFood leakage is not a new thing and as far as I have experienced, Zomato does compensate for genuine cases. Once due to a leakage issue, Zomato had once reversed a pizza worth 800 for me. Milkshakes, juices several times and numerous times I had my money for rolls reversed due to leakages. It should be a genuine issue and should look like a genuine issue. Whilst I believe in your story, the evidence was not enough to give you compensation. Had you sent the cup half empty and a photo of its contents spilled all over your food, you would have gotten the full compensation",
        "Depends on how many times you have went for the chat and asked for refund or coupon code. Less refunds and any coupon codes they have given you, you are in gold or silver. If you have went to chat more then 3 to 5 times for refunds, you will be on bronze or iron.",
        "I ordered Dosa and from Zomato and they sent me dosa without sambar or chutney.\n\nContacted them on customer support and they said the restaurant closed and after arguing on the phone call for 20 mins they have me 70rs coupon code.\nHad to eat dosa with water 🫠😔",
        "Truly does!! Swiggy is even worse. Was back home in Delhi a few weeks ago, and they screwed up my order, it was 1+ hour delayed for a waiting time of 35-40 mins. Contacted their chat service where they gave basic corporate speak. Made me so angry. \n\nWhen it finally came, the Zomato delivery driver was inexcusably rude!!",
        "Is it same in Amazon ? Some people even got refund for MacBook here on reditt but not everyone gets it.",
        "not sure they follow it now,   \nnever in 100s of orders have asked a refund or complained. I didn't get an item in an order, CS straight away refused they can't do anything. Had to contact hotel, got the item though.\n\nAs Zomato's customer was pissed, vowed never to order again from them.   \nBut Swiggy is always costlier than Zomato for me, shamelessly order now and hope it comes correctly",
        "https://preview.redd.it/avoad3rndlcc1.jpeg?width=1080&format=pjpg&auto=webp&s=8859d6150cddbf6d5b813eda5f864c3496ad56b6",
        "It's not the first time this happened to someone. I think sometime ago I saw a comment from someone claiming to be zomato employee, and he told how people try to get refunds even though there were no faults with orders. In the op case, it's extremely unclear if she drank it and showed an empty cup and asked for a refund or she's genuinely saying the truth. It's hard to believe us Indians. Also it feels stupid to order Hot chocolate for delivery. It would get cold by the time it reaches you, and the probability of spillage is extremely high and 300rs for a hot chocolate, that too from McDonald's??? I can't believe they are charging such ridiculous prices.",
        "Welcome to “post funding boom” era and thanks for choosing Zomato.\n\nAs a next step and for more aggressive headaches, I would recommend trying Myntra. \n\n\nFor more advanced level, you can also choose Flipkart if you want a significantly more difficult challenge.",
        "Prove that you didn't empty it into your stomach.",
        "Lodu hai Swiggy. Things have changed. The days their payments failed last month and people got multiple deliveries, they did nothing to refund it. Absolutely nothing.",
        "I ordered a chicken sandwich from Subway and the fuckers sent me a sandwich without chicken in it. When I asked for a refund they said they will refund 25 rs for a 350 rs sandwich. I said keep that 25 rs also and switched to swiggy.",
        "I don't know man but it doesn't look spilled to me.",
        "Swiggy is best. They always compensate instantly for late delivery/spillage issues.",
        "Honestly, subscriptions don't elevate your status in the system. It all depends on behaviour and value. High-value refunds are often blocked by the system because of the loss factor. Used to work in a similar system and many times had to tell people about this without really telling them this.",
        "Yeah they should have taken the picture along with packing not just pick empty glass and show it. My experience with Zomato support has been pretty good, they refund within minutes once they get a decent photo as evidence",
        "Tbh I don't see wrong in their response. The photo shows no spillage but just an empty glass.",
        "This. It wasn't Zomato for me, but I regularly order milk from Swiggy Instamart as it takes like what, extra ₹4 to get it delivered in 12-13 minutes if I buy in bulk.\n\nFew times in succession I got delivered puffed/badly damaged packs and I ask for a refund for those. They always refund 100% of the amount. It went from uploading pictures, to uploading and describing, to uploading, describing and no refunds, to just straight up being ghosted as in the screenshot, asking to drop a mail. I even asked them if it is possible to select what warehouse or whatever the fuck it is called (there are two near me, according to maps) because it looked like the person who packed it was doing it in a way that fucks it up.\n\nI've been nice to all delivery kids. Wishing them if there's a festival, asking if they'd like to have a snack/water, \"Koi baat nahi bhai tu araamse aana koi ghai nai hai\", tipping them if it rains, and I got fucked because of something beyond my control.\n\nMy orders finally started arriving fine and so I stopped complaining, but pretty sure those fucks think \"Haha, he ain't taking the long way of emailing us, which proves the refunds were fake\" or something like that.\n\nAnd don't get me started on Uber Eats.",
        "Too much reliance on e-commerce and ultra \"customer is king\" mindset. Open the page of any e-commerce on social media and every comment is like this, asking for a refund and asking others to never use that platform again.",
        "This shit happens with me everytime and I have a rating of 4.83",
        "Just tap the missing items section and claim a refund !",
        "true I agree, I wanted to highlight I never complained or asked for refund before for around 5 years.   \nWhen the item didn't get delivered, I didn't ask for refund just was asking what they can do for it?   \nCS could only say contact the restaurant, which is a shitty response.",
        "How can we check our rating",
        "Always do COD. Verify the food and accept it or just return it right away.",
        "Sachin awasthi ki video yaad aa gyi zomato customer complain wali.. OP please see that reel you will have a good laugh 😝",
        "Bahot purana hai wo video.",
        "Because technically they are not employees, they are partners. Hence it's difficult to take that kind of action against them",
        "haan but OP ne nhi dkhi hogi",
        "Wo video k baad Maine swiggy zomato ko complaint karna band Kar diya 💀",
        "They used to much better, now i've got my order wrong multiple times or had spillage issues and even with evidence all they'll do is apologize. Definitely would start reconsidering using these apps if this becomes a pattern.",
        "That picture inspires no confidence",
        "wo meri first video thi sachin ki phr maine use follow kr diya 😌",
        "Mai to starting se hi dekh rha hu jab uske 3k follower the",
        "Tbf, Good customer services like amazon's get taken advantage of by asshats.",
        "Tbf, Good customer services like amazon's get taken advantage of by asshats.",
        "Just start using words like deficiency in service, deceptive marketting and see how their response changes",
        "I'm fairly certain you didn't even talk to any customer support \"executives\". They're all chat bots.",
        "Like others have pointed out, you can’t see a spill. All you see is an empty glass. Any one can send a photo of an empty glass and claim it spilled. User error here. \n\nBut also, I would recommend ordering McDonalds off their official app. They’re a lot more swift. My usual McDonald’s order on Swiggy was 638 or something but the exact same thing on the mcd app was under 550. Plus, they have me options to customize my sauce options. I still use Swiggy but not for mcd.",
        "True but multiple complaints?? I mean, come on, at some point that’s just bad for business. Swiggy & Zomato also have extremely rude riders.",
        "It honestly doesn't matter for them.\n\nI don't know, but there was a news sometime late last year about a delivery guy stealing someone's shoes. Inspite of having video evidence, nothing major came out of it(atleast publicly).",
        "Ya I know it doesn’t. That’s whats most annoying. They just don’t CARE!!",
        "Feels good that my 4.72 rating is not useless.",
        "Yeah yesterday I ordered some jalebis they were burnt, instant refund was given",
        "Lmfao my rating is 4.28 and 4.15 in both of my accounts 😭",
        "I agree but these all are pics which I received from my friend and at the moment I really didn’t know what to do cause I was just upset that I gifted someone a drink and this is how it ended up",
        "I have a rating of 4.75",
        "Even I doubt you Now",
        "Zomato is shite!",
        "I had a similar incident recently. I ordered from a usual nearby restaurant it takes 30 mins max to deliver to my home. The delivery guy was an hour late. I contacted support and they said the delivery guy is late due to \"personal issues\". I told him okay but I want my food to be hot and fresh and they assured me it will be. When it was delivered as expected it was cold and soggy af. I complained. I explained the situation and they just said sorry please accept the order this time and it won't happen again lol. I mean i should just accept whatever they give me just because they apologized lmfao it was ridiculous.",
        "Zomato is Flipkart of food delivery",
        "I have a rating of 4.6* currently but I have been denied a refund a couple of times, that was mostly when I received completely different food item than what I ordered, maybe they feel we will still have that item, so giving a refund makes them look like a loser, lol\n\nSometimes they don't refund if there is just minor spillage or if they can't verify the authenticity of your issue.",
        "If it was spilled op then whole bag and the items along side must have been affected too that was required as proof",
        "Swiggy is far better at customer service. They have an instant gratification policy. They pay the customer the refund first and then retrieve it from the restaurant instead of getting it from the restaurant and then refunding it.",
        "Yes they do. I ordered delivery and two items were missing. I reported it with the pics that was all the recourse they offered. They didn’t even refund me for the items",
        "Maybe the glass is half full",
        "You are dumb to take a photo like that as evidence 😂\nWait I didn't get my burger I'll post an empty burger wrapper as evidence that I didn't receive the burger .\nROFL.",
        "Very common with Indian service providers. They take customers for granted for sure. Though I haven't had such an experience with zomato, have faced such issues with Flipkart, Motorola and Swiggy. Here once you have bought something from them, they consider you done! Move to acquire the next customer. To hell with the existing one.",
        "Bro over here is scamming zomato💀, imagine if they find out...",
        "Sounds like a costumer issue... its a cup, move tf on",
        "The first one was actual and got refunded in seconds. That's why I tried the second time, also done in seconds.",
        "Thats great dude",
        "🤖",
        "Serves you right. Next time order a can of chocolate and a packet of milk for delivery via zomato 😁\nMix chocolate powder with warm milk in a nice glass. Mix well. Enjoy with entire family. Costs less Than Rs:300/- and no paper cups. 🤣🤣🤣😝. Thank me later.",
        "https://preview.redd.it/lta4fri7ulcc1.jpeg?width=900&format=pjpg&auto=webp&s=ae73cc71cb568598726f87fd80ab06cb27a56511\n\nCan see some spillage on the packaging",
        "<<<<<Swiggy",
        "I have a good rating and usually I only claim refund with strong proofs so I always get them processed but when theres a bulk order and only one or few items are missing they make it hell, one time I got forced to get refund only for one item when I order the item like multiple times and I asked her for almost an hour to transfer me to someone else if you can't handle this because the claim is legitimate and she was forcing me to not escalate this and kept blabbing company policy. Honestly after that I've cut down 90 percent of my ordering from apps. Worse was that the order was for my mom and I felt like shit, I did it on her and mailed them as i was at home at the time but my maa never followed up with it so the refund never happened fully probably",
        "They tend to instantly refund post 12 at night ive noticed. If it were working hours, theyd call the restaurant to double check before",
        "This didnt happen w me lmao, i got back my 240 rs for the spilled butter chicken I ordered, even though it was much less spillage",
        "You are paying ₹300 for a hot chocolate .\nYou deserve this.",
        "Zomato is ridiculous. They turn a blind eye for the kist genuine cases after resolving 1 case per month. Shit app. Shit services. Never become a gold member. Utter waste of money",
        "Never talk to them on chat, they never listen to you and hardly solve your problem, ask them to call you and then resolve the problem, this works 99% of the time for me",
        "I hated swiggy. They always messed up delivery locations for months after coming out. The delivery guy would often stop at the wrong place - rarely near our actual house, and on the off chance that it was close-by, he would demand that we come to him, or \"we would be blacklisted as customers\" or some shit. This was early off the pandemic, late 2021 and early 2022, so my parents just told me to go get the package. And get this - most of the times that he didn't come close to our house? Yeah he'd be in a completely different location, to the point that it would be just as far (or in one particularly bad case, farther) than just going to the restaurant. Part of this was the arrogance of delivery drivers who had confusingly been brought from another city (why couldn't they just hire people from this city?) and wouldn't learn the paths, and part was that swiggy charged way too much for this experience. A lot of restaurants straight up broke their deals with Swiggy in our city because people started putting the blame on them.\n\nI've  only had one arrogant ass delivery guy with zomato, who sent his 14 year old brother to do the delivery because \"he was smoking\", but generally the delivery personnel have been much better. I had a pizza delivered poorly once and the delivery guy returned me 25% of the money (I was using cash) on the spot becuase he knew he had botched the delivery.",
        "Zomato is ridiculous. They turn a blind eye for the most genuine cases after resolving 1 case per month. Shit app. Shit services. Never become a gold member. Utter waste of money. Zomato has become unbearable",
        "Lol due to lot of fake complaints, genuine guys have to suffer.\n\nJust provide a screenshot with cup and packaging showing spillage. They would proceed with refund.",
        "More like 300 for a no longer hot chocolate.",
        "Keep the 25 Rs also 😂 You're savage, lol. What was their reaction after this?",
        "Idk why you are being downvoted but I would also be mad if I get a drink half spilt. And there seems to be enough evidence that the drink was spilt cos no package would look like that with just condensation.",
        "Ghar par pakao. Khao. Swiggy Zomato ke chakkar me na pado. Ya khud restaurant Jaa kar le aao.\n\nI've realised that if I went to a restaurant that is 5 kms away I can reach the restaurant, order, get my food then get home before swiggy or Zomato can deliver my food on multiple occasions. Doesn't work on bakery goods since their preparation phase is very short to no preparation at all. After comparing the results I found out  that I was saving at least INR 40 to 50 on every order that I made. Sometimes the savings went as high as INR 200.\n\nI stopped ordering food after that. It's been a year and a half now.",
        "They indeed have worst customer service. Pizza hut cancelled the order and didn't even give the whole refund. Zomato kept his side of the amount. When I tried contacting them, it went nowhere. \n\nWhy shouldn't I get entire refund when I didn't cancel the order?",
        "Bhoomi just made a Cameo 💀",
        "Showed this to one of my friends She said it's a wrong thing to do. I don't think stealing from a billion dollar corporation is that bad 🫡",
        "You have to wait for 72 hrs after completing the first 72 hrs and so on. Can't you understand a simple thing sir? This is a company policy.",
        "In the app menu",
        "Flipkart was a pain. They sent me defective earphones and it was a nightmare trying to get a replacement.",
        "Exactly. You can make at least 10 hot chocolates at home for 300",
        "Once, I found a small stone in my biryani, I removed it and kept it just beside the biryani, I complained to Swiggy, and executive said that stone is beside the biryani and not inside it so we cannot provide you refund!!",
        "I always get refunded by chat bots.",
        "I once sent zomato customer support a pic of hair inside food, they fully refunded the amount and even gave some extra coupons within 2 hours.\n\nAdidas on the other hand are yet to to refund me 2500 Rs",
        "Oh, rating customers as “browns” sounds a tad racist? ;-)",
        "yes, 1 time there was 1 of the items was missing. upon contacting them, they connected with the restaurant and said that the restaurant informed them that no item was missed. so they could not do anything.",
        "sorry it is bronze ",
        "I second that!",
        "So do you get refund coupons if your delivery is delayed? I've had a Gold membership for a while and I remember it used to be a thing and I only claimed it like a couple of times but now my orders get delayed half the time lately but don't receive any of the coupons. My rating is 4.4.",
        "If I was the customer support, I wouldn’t help you either. That doesn’t looked spilled at all, it just looks completely empty. You should’ve taken photo when you received it to show how you received it. This is completely your fault.",
        "Why not go with your friend to McDonalds and the whole hot chocolate with him? He is in another city?\n\nThink how much effort needs to be taken to prevent spillage for Rs. 300 item.",
        "i have ordered from wendys at night and some of the packaging was missing and they advertised glazed buns, that was also missing so when i talked to customer service they instantly refunded in their own wallet, i had ordered like 600rs worth of burgers iirc",
        "I hate zomato for this. Happened with me 5-6 times. I have switched to swiggy. It’s just swiggy has less restaurants. \n\nBut man zomato is shit, It doesn’t matter what you do, they don’t give a shit. \nI once had wrong item delivered and didn’t get refund. Plus the delivery guys if zomato are mostly crooks. \n\nI wish some boycott trends starts and zomato gets shitted so bad even worse than what happened to snapdeal.",
        "His scamming that why getting downvoted. Typical scammer",
        "Zomato is shit. I hate it from bottom of my heart. \n\nYou don’t know how hunger can drive you crazy and zomato makes you crazier. Bunch of crooks at zomato.",
        "Yea. They changes the policy long ago. The thing is people started to misuse the privilege of getting refund on spilled ,  wrong order etc and now they did this . Not only ZOMATO even Swiggy .",
        "Who the heck buys only a hot chocolate 🤡🤡",
        "Personally I always have a very smooth experience with Zomato.",
        "Bro you should have sent the pic of the spillage also not only of the empty glass. Empty glass pic looks like you have gobbled the drink yourself. You should have sent a complete pic of the glass with all the spillage. Zomato doesnt take time to refund your money or issue u a coupon if the evidence (pic) is perfect.",
        "Ya. I had similar experiences with Zomato back in the day. So, permanently moved to Swiggy as my default food ordering app. \nCustomer experience has been good.",
        "It’s pathetic, and Zomato gold is useless. They have stopped giving o time delivery guarantee - my order was 35 min late (so effectively it took 45+35=1 hour 20 min for the order to deliver) and they did nothing despite gold membership.\n\nI’ve also seen that if I book a table using zomato gold, the restaurant treats very differently. The most pathetic table is allowed even if the restaurant is empty. Service is bad too.",
        "I even have zomato gold and order almost everyday, once in maybe 7-10 days I have to report the issue and they do not refund. I work night shifts and i get hungry around 2-3 in the morning. But oh God the customer service drives me crazy",
        "You sneaky bastard you ate it and if you want a refund or return, just think about the delivery guy",
        "I once received a completely wrong order from Zomato. After raising a complaint, all the executive assistant could tell was that he was sorry for the inconvenience and there's nothing they could do because the outlet wasn't picking his calls. No refund, no nothing.l",
        "These pics don't really prove the scenario, if the cup spilled the whole cup on the outside would have chocolate marks, and there must be the plastic where it all spilled, why didn't you click the pic of that? \n\nThese pics will not help.",
        "I have good experience with zomato customer service. They always either give refund or add credits to account. Maybe it’s because I have good rating like the other dude said in comments.",
        "I used to order alot from MCD and always got the extra value meal or smth. NEVER take the open drinks it will always be spilled because common sense, always buy a can which they provide. Its not zomato’s fault completely MCD has shit packing and too expensive for bs. Report it to MCD not zomato.",
        "Lol seems like I'm a good customer cause my issues are always resolved",
        "That's why swigggy is superior",
        "If you have gold and if you're orders are delayed you should have the claim coupon button in the maps page itself I think, you don't have to reach out to support directly",
        "And this is not good.\n\nThey literally say on rating page that one of the factor is tipping the delivery guy.\n\nIf they hand over our rating to delivery guy then how can the trust happen.\n\nA customer should be the one giving rating.\n\nIf any issue arises from delivery guy, why can't he call to customer and and let Zomato decide the rating.\n\nhttps://preview.redd.it/4kjx6ymztmcc1.png?width=1080&format=pjpg&auto=webp&s=fb651d5f4931625b5373315f2abb6f4247ef105a",
        "Wait till you need zepto support. Atleast someone from zomato responded",
        "In these kinds of things, just put not received. Better response.",
        "I never had the problem at all. When i received a partial wrong order, they gave me a full refund.",
        "I was a Zomato gold user.. After few incidents I stopped using Zomato.",
        "Yep, swiggy delivery is not good. They show 40 minutes for delivery and it will still show 40 minutes for delivery after half hour. And then I see the delivery guy take a longer route and deays again. I prefer zomato if I have no time to wait like super hungry. Atleast they deliver on time or is more accountable than swiggy.",
        "You're probably blacklisted for taking too many refunds by doing shady stuff. That's why they're not giving you anything.",
        "I’ve never asked for a refund this is my first",
        "Gali gali me shor hai\nZomato wale ch.. hain.",
        "The entitlement here. How do you know it spilled from that picture? Also, do you expect a hot chocolate to remain hot after 60 minutes of January weather? Have realistic expectations and you will find that these food delivery apps and especially the workers are doing a great job of keeping us fed.",
        "Swiggy recently pissed me off. I ordered for bread - 450g bread on Saturday and they gave me bread which expires on sunday. I raised complaint asking for replacement. They were ready to refund but now replace. I kept tellin them it's for 1 person, so replacement will be better, so I don't have to waste the food, but they weren't ready for replacement.",
        "Then no clue bro. My friend was working in Zomato, he told me this.",
        "I wouldn’t scam for a mere 300 rs . I just wanted to raise an issue that I faced",
        "Opt for cod.. their balls will be in ur court",
        "Bro I’m from Kerala , what weather are you talking about ? Its always hot here",
        "Edit : \n\nI have recieved a refund for the hot chocolate after talking to a customer representative.",
        "300 is not really a small amount either. It's a valid concern OP.. Don't have to feel bad to raise such concerns.",
        "Yeah no you drank it fo sho my bro",
        "16 year old teen with parents money. Now bro gonna post on legal advice",
        "Abey Kerala has such nice food. Why order from some McD? Could have gone for that nadan kozhi with parotta, unbeatable in any weather.",
        "Like I mentioned it was for a friend who wanted hot chocolate hence",
        "It's pathetic. I've faced too many issues. Their staff is rude and unhelpful. Stopped using it entirely after they refused to refund my money when I only got 1 item out of 8 that I had ordered. The staff told me there's nothing they can do and denied any refund",
        "UberEats used to refund money, that’s such a good food app🔥",
        "I hate these bots. Feel so helpless. Can't even talk to a person and explain the issue. Again a win for corporate and customer can f**k off.",
        "Order direct",
        "Hate to admit it...but...this is the reason I am getting richer quarter by quarter...",
        "they figured they're a duopoly so they're doing whatever the fuck the want",
        "How much did you originally order, a teaspoon?",
        "I wasn't aware zomato had sales representative bots on reddit lol...whats with the downvotes🤣",
        "I know where it is, you can also access it by opening the order summary. But it doesn't give me that option anymore.",
        "I agree something similar happened with me I order a meal from burger king with a whopper fries and coke.. Biggest mistake I made the coke was leaking. Half the bag was soked in coke the entire burger, fries and half spilled coke. When I complained all the bot said was we're sorry but this isn't our fault but restaurants fault we can't do anything for u",
        "U guys are ordering still online!? 😂\n\nStupid ppl.\n\nDelete account live peacefully😊",
        "never buy any drinks from mcdonalds on the takeaway. stupid paper cups are not even capable of handling the milk.",
        "my experience with customer service has been better since i bought gold",
        "Dude you fucking drank the whole thing",
        "But they instantly provided me the whole refund in my case , no questions asked as well",
        "Stop blaming him for not sending the spillage photos properly. I had the exact same issue and I did send the photos including the spillage all over the carrier bag yet the stupid chat spat out the same reply.",
        "bhai papa mummy ko ek jagah ke chilli potato pasand hain to kal humne wohi mangaye. usne saale ne namak hi ni dala aur mene complaint raise ki toh saale kehte ki next time se ni hoga aur koi support se baat nhi, koi refund ni. ulta bolte email krdo. email pe kehte ye resolve nhi ho sakta. mai gold user hu. ab kabhi paisa waste ni krunga is ghatiya app pe.",
        "OP fraud kar raha hain",
        "Click pics immediately on receiving and send it to them. I have got refunds more often than not for genuine cases.",
        "deliver cold food",
        "Tweet about this",
        "Zomato is a joke",
        "https://preview.redd.it/h9p07rfbjncc1.jpeg?width=1080&format=pjpg&auto=webp&s=473536b59a004fd3e0c1ca6c79441d7173bfef76",
        "Even i cannot find it now. Earlier it would appear on the order tracking screen as well that the refund would be issued after order is delivered.",
        "Zomato doesn't usually refund money but they give discount coupons for your next order.",
        "I agree. Once they sent over spoilt chicken wings from Pizza Hut and I raised the objection saying spoilt food delivered. The response ? Sorry for the inconvenience, we'll let the restaurant know. Motherf*** didn't even refund the amount. I paid for something that I had to throw away! Never trust these delivery aggregators. Bloody loots.",
        "Dosa with water, Brother that's some sad shit.",
        "Yeah I had the same issue. I used to order from the same place for breakfast every Sunday for almost 6 months and this delivery partner decided to drop the package and spill the entire curry one day. I got my delivery super late, like an hour late and the whole thing spilled all over my apartment and dining table. I showed them video of the whole thing and still they said they’ll be careful next time. And I said good bye to Zomato forever. I’m quite happy with Swiggy for now.",
        "So true, also like hot chocolate is so easy to make.",
        "I reported my issue immediately. Like within one minute with video and multiple pictures. And I have a good rating. Still they refused. The plastic can was pretty beat up, dirt on the packaging. Clearly the delivery man dropped it. The spillage was all over the place. In the lobby, in the lift. 🤦. Still no refund and they were pretty rude about the whole thing. I just deleted the app.",
        "They likely transfer the costs over to the restaurant",
        "Here’s the thing OP. Shit happens and drinks spill. Even if I suppose that what you’re saying is true, stop choking up all the social platforms with these reviews. Drink spilled, you didn’t get a refund, game over. If 300 Rs doesn’t matter to you, why are you ranting about it everywhere. These reviews won’t even pose a cent of loss for them. Stop wasting time and chill up.",
        "Nothing happens. Same with swiggy",
        "From the pic it looks like ur friend drank it lol",
        "Hello I've brought your indian street food that some dirty indian mixed with his hand.. make sure and shit in the street when you're done",
        "I got food poisoning. I ordered this chicken 65 from a restaurant last month (December) and felt like having it again, i ordered it on 14th January. Got severe food poisoning because of it, when i raised a complaint, all i got was a ₹98 coupon🤡",
        "OMG SAME HAPPENED AND I WROTE AN EMAIL AS WELL SAME SHITTY RESPONSE",
        "I can understand your situation ,From my similar experience. \n\nThey will for sure get back to you on mail.\n\nMost probably they will provide you the coupon of same amount to be ordered from same restro.\n\nAtleast this is what happened with me.",
        "Zomato has lost it completely. They don't have the ops to support their offerings. And now they have even gone full AI mode, making the experience even worse when things go wrong.",
        "Is it just me, or does it take a special type of idiot who orders prepared beverages online and expect to get them as they'd in a restaurant? like does it really make sense to order Chai, Coffee, Hot Chocolate, Shakes online?  \n\n\nHave you seen the condition of our roads and how traffic moves? What's the delivery personnels fault if liquid spills over?",
        "How would the customer know about the location of the spillage?\n\nThe benefit of doubt in such cases should always go in favour of the customer (in light of the exorbitantly bloated prices that Zomato charges).",
        "Itna to packet pe haath saaf karunga to gila ho jaayega.. a hot chocolate half spilt on the burger packet would be way more soggy than this",
        "Zomato is the worst. One time I ordered food worth 1600 and rotis weren't delivered. When I complained they said no the restaurant has said they have given we can't do anything. The customer executive female was so rude  and just implied that I was lying.Imagine at 11 clock I had to make 20 rotis as we were so hungry that we couldn't order rotis from some other place. When I talked to the person at Zomato they just straight away denied my claims. For mere 200 rs why would I have lied? Then for just rs 200 I took it on my ego🤣🤣 complained on Twitter and Instagram and within 3 days the social media support of Zomato called me and refunded it. It was not a matter of 200 but just that they feel we are fools and will just give up .",
        "Agreed, they've always refunded money anytime I reported an issue",
        "If there's spillage, there'd be more than an empty cup. Like in the packaging",
        "Many such similar experiences they dont  are about customization or request. Even when i paid extra for wheat bun they sent maida one and refused to even acknowledge the problem.\n\n\n The restaurant couldn't deliver the order coz they couldn't find a rider late at night and the zomato guy kept insisting that delivery was attempted but i refused , the restaurant was super nice though they delivered the next day.",
        "As i order more and more my rating could do down so only step is to stop usinh zomato for six months right?",
        "Cant with sodexo",
        "I can tell you from experience, most of the time the people behind the customer support chat on the Zomato app, do this by using the excuse that the picture/video isn't clear.\n\nI remember once I had to threaten the person that I was recording the entire chat for the public to see, which is when she escalated my case and my issue was resolved. \n\nI have my guesses on why they do that, but what I would like you to do is to immediately fire an email to order@zomato.com without any hesitation, clearly stating your order id along with the issue you've faced and the proof and they'll respond and/or take action.",
        "That cup rather drunk than spilled 🤨🤨",
        "swiggy is better, restaurant sent me a different order (which was actually more expensive tbh), they refunded me, let me keep the order AND then delivered my og order",
        "Use Twitter. Complaint redressal will be much faster that way.",
        "Zomato service is really the worst",
        "Use your brain. You sent them a picture of an empty cup\n\n\n\n\nAnyone can drink all of it then send the same pictures as you\n\n\n\n\n\nIf you wanted to make a case for spilling, maybe include the bag in which it spilled",
        "Had similar experience with Zomato at various complaints. They are simply rejecting on further investigation on complaints",
        "Always call them \n++ BE RESPECTFUL!!!\nWorks best.",
        "My criticism is who **orders** (instead of making at home) hot chocolate for delivery 300 Rs and then complains that it spilled ???  It's a liquid.  It sloshed.  Unreal.   \n\nFucking hell.  Just make it at home or at your friends home for a fraction of the price, you nit.",
        "Make chocolate shake at home for 50 rupees and save 250 and your health.",
        "Hot chocolate looks full in this pic. How is this any proof?",
        "I did same but they do nothing",
        "I think they need an evidence that you didn't emptied on your stomach.",
        "This seems at the level of customer service groww has been providing me.",
        "Serves you right for supporting a garbage company like McDonalds",
        "i mean they aint wrong tho, it looks like a used empty glass. shouldve taken a picture before finishing the drink",
        "I agree.",
        "Swiggy wale bhi saale same he",
        "tbh don’t order hot chocolate online",
        "More foolish behaviour on your behalf lmao. Even I wouldn't believe this post if you don't post the pic as immediately as you receive the packet. Let me tell you how it's done. Many months back I ordered Biryani from Behrouz w/ 150ml coke and the order came without the latter. I talked to the chat assistant providing the pic of the box with items closed to make sure I ain't lying. They refunded me the money.",
        "Man ,I have had the similar experience as well. One of the items was missing from the delivery and I tried contacting cs but it’s always responded by stupid bot. Then I mailed them but they straight away send a generic response with no resolution.\n\nhttps://preview.redd.it/oiivgj9kdqcc1.jpeg?width=1170&format=pjpg&auto=webp&s=770098472b1908ff351a92dba80dd23410ff6b4e\n\nThis is the mail they send me every time\n\n“,\n\nHope you are doing well.\n\nThis email is regarding Order ID -549\\*\\*\\*\\*\\* from KFC Restaurant.\n\nWe understand the hassle you had to face as you have received an incomplete order. We are dedicated to swiftly resolving this issue and assuring your satisfaction.\n\nWe tried calling you but you were unresponsive.\n\nWe understand the importance of your satisfaction. Unfortunately, we are not able to connect with the restaurant at this moment to validate your claim and without validation from the restaurant, we wouldn’t be able to process a refund.\n\nRest assured that we constantly work towards providing you with a good experience.\n\nBest regards, Team Zomato”\n\nAt this stage I have given up on the refund because their Support is PATHETIC",
        "Yea their customer care is dogshit. Had a terrible experience dealing with them in Dubai.",
        "Spilled into the stomach.",
        "\"But unfortunately in reality the scenario is not achievable for even the big players in the market. Like *Talabat, Zomato and Delivery Hero* are unable to earn profit in reality.\"\n\nUnfortunately, the food delivery business model doesn't work in India as well as in other countries. Hence, they try to automate everything and don't pay their delivery agents, their customer care workers, their other employees, just so that the investors can make the majority of the profits...\n\n&#x200B;\n\nHere's a supporting article:\n\n[why do food delivery businesses fail](https://www.octalsoftware.com/blog/why-do-food-delivery-businesses-fail)",
        "It used to be very good. I remember they always compensated me when there was an issue. But the last time I had an issue, where wrong items were delivered then were not co-operative at all.",
        "You don't complain after eating your shit",
        "Maybe the delivery boy drank it",
        "Yea , in recent months i cannot speak to any humans. It is just chat bots with different names. I guess they laid off people",
        "mujhe toh hamesha refund mil jaata hai",
        "bhai mene bhot missuse kra hai, mere vjah se band kra inhone refund dena huehue",
        "This happened to me last time, but then in my case i got my refund and also got a coupon for the inconvenience like some 150/- off",
        "Try showing the packaging? That's looks like you could be trying a scam so a bit understdable.",
        "Hard Luck, but you have to understand Zomato gets such refund requests all the time(most of the time it's fake) and the photo is not at all convincing, agar spill hogaya tha to pata chal jata pehle hi, record kar Lena chaiye tha. It's on you.",
        "can't you just go get the stuff from the place itself, lazyass 😹",
        "You are not stealing from a billion dollar company in this case. You're stealing from the person who actually needed a refund.",
        "Yede you should have gone outside to eat foe this kind of beverage.",
        "Just uninstall zomato. You should show photo with packaging but why you want order from app that have low quality of service. i have ordered from zomato, 2 bottle of pepsi was missing. How can i prove in photo? Ofcourse, they don't refund me, they said you can rate resturant low for their service.",
        "Sometimes it's not laziness. I stay in hostel & I don't have bike in hostel. Going through rickshaw, cost more money & time but it gives satisfaction to go outside to eat food. During exam time, no option left.",
        "300 mai toh meri 3 veg thali aa jati full on punjab se...120 discount laga ke",
        "It should have been spilled in the package not inside your mouth.",
        "More like lukewarm Bournvita",
        "Zomato has always refunded me as soon as I faced issues - sorry you had to face this.",
        "Mf you drank half of it and then realized it's not worth money and now you want refund lmfao",
        "The place where I live in Mumbai zomata has the best service.\nI have never experienced such sort of things from then or anyone in your city has.",
        "Naughty boy wants Zomato credits 😂😂",
        "And thats your evidence of spillage?an empty cup?? Man you gotta be kidding. You are the problem not Zomato.",
        "Nice trick for free food",
        "So just out back inside biryani and claim refund 😜",
        "Same happened with me on Swiggy - Instamart sent me an expired box of sweets. When I complained I got a similar response saying they can't validate my claim and can't process a refund. I hadn't even asked for a refund, just a replacement. They even took 6 hours to respond.  Guess they are cost cutting in the customer service department.",
        "swiggy>>>>",
        "@op swiggy is also same...just slightly better than zomato..i am going to try foodcourt app for mcd, domino etc franchised items. Good luck to us.",
        "You probably got a history of asking for refunds/returns (no offence) I only got a Paneer sabji instead of a Paneer dosa and they straight up refunded the entire amount + an additional 50 Rs to me without asking for pics.",
        "Yeah once I ordered something from zomato, the guy from the restaurant delivered it and then took cash payment. Then on the app he marked it as customer not found, so zomato put the charge of the order against me which was added to the bill next time I ordered. Stopped using zomato after that.",
        "Zomato has a great refund policy. Please take a picture with half filled glass instead you are taking a picture of an empty glass. Imagine you are the owner of zomato and then check the picture you've shared as evidence of spilled chocolate 😂",
        "Much worse, an item I had ordered was missing. They wanted a photo or video that it was missing. I placed a plain A4 sheet, took a picture and uploaded.",
        "To file a complaint zomato you can follow these steps:\n1. Contact zomato Customer Support:06372-293-165 The first step is to reach out to zomato's customer support team.you can do this  through their app or website.Look for the \"Help\"or \"contact Us\"section, which usually include options to chat with a support representative or submit a complaint.\n2. Provide Relevant Details: when contacting customer support, provide them with all the necessary details related to your complaint. This may include the oder number,date and time of the incident, the resistant involved, and a clear description of the issue you faced.",
        "# BEWARE! This could happen to you!\n\nZOMATO HAS BECOME A LIAR AND A THIEF!!! I ordered food from Zomato as a Gold member on April 21, 2024 and then set my phone aside to charge. 45 minutes later, when I checked to see where my order was, I saw a missed call from the delivery partner timed two minutes before. I tried to call back, but the Zomato App informed me that they had cancelled my order as the delivery partner could not contact me and they would be keeping the entire amount I paid for the order as a cancellation charge. Repeated chats with their customer service team proved useless; they told me that they had followed their policy, done nothing wrong and I was not entitled to any refund. I angrily requested to speak to someone in charge and, after a callback from Zomato the next day, was told by a supervisor that even though Zomato was not at fault, they could give me a discretionary INR 500 discount, which was less than half what the food had cost. However, one month later, there is no sign of the INR 500 in my account.BEWARE! This could happen to you!",
        "I agree. Look how they steal customers' money.   \n[https://x.com/TushaarKuthiala/status/1782318037171093865?t=BDCU2aVpnjTOjMhCcDDgGA&s=08](https://x.com/TushaarKuthiala/status/1782318037171093865?t=BDCU2aVpnjTOjMhCcDDgGA&s=08)",
        "To complain on Zomato, you can follow these steps:\n\n\n1. Contact Zomato Support:0939-0072-307 visit the Zomato website.\n2. Log in to your Zomato account or create a new account if you don't have one.\n3. Search for the restaurant you want to complain about using the search bar.\n4. Open the restaurant's page and scroll down to find the \"Reviews\" section.\n5. Click on the \"Write a Review\" button.\n6. Describe your complaint in detail, clearly explaining the issue you faced and how it negatively impacted your experience.\n7. Be specific and provide any necessary details such as order number, date, time, and any relevant screenshots or pictures.\n8. Make sure to remain polite and professional while expressing your complaint.\n9. Submit your complaint by clicking on the \"Submit\" or \"Post\" button.\n10. Zomato will review your complaint and may reach out to you for further information or clarification if needed.\n11. Be patient and check for any updates or responses from Zomato regarding your complaint.\n12. If you don't receive a satisfactory resolution, you can try reaching out to Zomato's customer support through their app or website for further assistance. Look for the \"Help\" or \"Support\" section and find the appropriate contact options such as live chat, email, or phone number.\n\n\nRemember, it is important to provide accurate and factual information while complaining and to remain respectful and patient throughout the process.",
        "To complain on Zomato, you can follow these steps:\n\n1. Contact Zomato Support:07257-948-548 visit the Zomato website.\n2. Log in to your Zomato account or create a new account if you don't have one.\n3. Search for the restaurant you want to complain about using the search bar.\n4. Open the restaurant's page and scroll down to find the \"Reviews\" section.\n5. Click on the \"Write a Review\" button.\n6. Describe your complaint in detail, clearly explaining the issue you faced and how it negatively impacted your experience.\n7. Be specific and provide any necessary details such as order number, date, time, and any relevant screenshots or pictures.\n8. Make sure to remain polite and professional while expressing your complaint.\n9. Submit your complaint by clicking on the \"Submit\" or \"Post\" button.\n10. Zomato will review your complaint and may reach out to you for further information or clarification if needed.\n11. Be patient and check for any updates or responses from Zomato regarding your complaint.\n12. If you don't receive a satisfactory resolution, you can try reaching out to Zomato's customer support through their app or website for further assistance. Look for the \"Help\" or \"Support\" section and find the appropriate contact options such as live chat, email, or phone number.\n\nRemember, it is important to provide accurate and factual information while complaining and to remain respectful and patient throughout the process jdm..",
        "To complain on Zomato, you can follow these steps: Contact Zomato Customer 06372293165)Support:06372-293-165 visit the Zomato website. Log in to your Zomato account or create a new account if you don't have one. Search for the restaurant you want to complain about using the search bar.",
        "To get a refund in zomato, you can follow these steps:\n\nContact zomato Customer Support:0637-2935-213 visit the zomato website.\n\nLog in to your account using your registered email ID and password.\n\nGo to the \"My Orders\" section.\n\nSelect the order for which you want a refund.\n\nClick on the \"Support\" or \"Help\" option associated with the order.\n\nChoose the appropriate reason for requesting a refund from the available options.\n\nProvide additional details about the issue you faced with the order.\n\nSubmit your refund request. Zomato customer support team will review your request and may contact you for further information if needed.\n\nIf your refund request is approved, the refund amount will be initiated to your original payment method, such as your bank account or wallet.\n\nThe refund process may take a few business days to reflect in your account.\n\nIt's important to note that Swiggy's refund policy may vary based on the specific circumstances and their terms and conditions. Providing accurate and detailed information about the issue will help expedite the refund process.",
        "To raise a complaint with zomato, you can follow these steps:\n\nContact zomato Support:06372-293-165 The first step is to reach out to zomato customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint.\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively.\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to zomato official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\nRemember to remain polite and provide accurate information throughout the process zomato customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution.",
        "To file a complaint with Zomato you can follow these steps:\n\nContact Swiggy Customer Support: 06372-293-165.The first step is to reach out to zomato customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint.\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively.\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\nRemember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.",
        "To talk to an Zomoto executive helpline, you can try the following steps:\n\nDial 0798-0595-213 from your Zomato mobile phone. This is the customer care helpline number for zomato in India.\n\nListen to the automated voice prompts carefully. The menu options may have changed, so follow the instructions provided.\n\nIn some cases, you may need to press a specific number or stay on the line without selecting any option to connect to a customer care executive. Listen to the available options carefully to find the one that allows you to speak with a representative.\n\nBe prepared to wait on hold as there may be a queue of callers ahead of you. Customer care lines can sometimes be busy, so patience will be necessary.\n\nOnce connected to a customer care executive, clearly explain the reason for your call and provide any necessary details or account information they may ask for. This will help them understand your query or concern better and provide you with the appropriate assistance.\n\nIf you are unable to reach an executive through the 198 helpline or if the process has changed, I recommend visiting Zomato official website or contacting their customer support through their official channels to inquire about the best way to speak with an executive order to get. ",
        "Thanks",
        "Here are the steps to complain on Zomato via their chat feature:\n\n\n1. Open the Zomato app on your device.06372-293-165\n\n\n2. Go to the \"Account\" section, usually located in the bottom navigation menu or the side menu.\n\n\n3. Tap on the \"Your Orders\" option.\n\n\n4. Find the order you want to complain about and tap on the \"View Order Summary\" button.\n\n\n5. Look for the \"Support\" button, usually located in the top right corner of the order summary screen.\n\n\n6. Tap on the \"Support\" button, and you should see an option to \"Chat with us\" or a similar option to initiate a chat with Zomato customer care.\n\n\n7. In the chat, clearly explain the reason for your complaint, such as issues with the order, delivery, or overall experience.\n\n\n8. Provide any relevant details, such as the order number, date, and a description of the problem.\n\n\n9. The Zomato customer care representative will then assist you with resolving your complaint.\n\n\nLet me know if you have any other questions!",
        "How can l steps to complain on Zomato via their chat feature:\n\n\n1. Open the Zomato app on your device.06372-293-165\n\n\n2. Go to the \"Account\" section, usually located in the bottom navigation menu or the side menu.\n\n\n3. Tap on the \"Your Orders\" option.\n\n\n4. Find the order you want to complain about and tap on the \"View Order Summary\" button.\n\n\n5. Look for the \"Support\" button, usually located in the top right corner of the order summary screen.\n\n\n6. Tap on the \"Support\" button, and you should see an option to \"Chat with us\" or a similar option to initiate a chat with Zomato customer care.\n\n\n7. In the chat, clearly explain the reason for your complaint, such as issues with the order, delivery, or overall experience.\n\n\n8. Provide any relevant details, such as the order number, date, and a description of the problem.\n\n\n9. The Zomato customer care representative will then assist you with resolving your complaint.\n\n\nLet me know if you have any other questions!",
        "To file a complaint with Swiggy, you can follow these steps:\n\n\nContact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint.\n\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively.\n\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\n\nRemember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.",
        "To file a complaint with Swiggy, you can follow these steps:\n\n\nContact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint.\n\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively.\n\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\n\nRemember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.hcfhhc",
        "To file a complaint with Swiggy, you can follow these steps:\n\n\nContact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint.\n\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively.\n\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\n\nRemember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.bcch",
        "Bruh, Zia is a bot dude. What do you expect",
        "To file a complaint against Zomato, you can follow these steps:\n\nContact Zomato Customer Support:(06370-523-572) Visit the Swiggy website or open the Zomato app on your mobile device.\n\nLook for the \"Help\" or \"Support\" section. You can usually find it in the app menu or at the bottom of the website.\n\nIn the Help/Support section, browse through the available options or use the search bar to find relevant information related to your complaint.\n\nIf you find a relevant topic or question, click on it to view more details. Look for an option to contact Zomato ....customer support or file a complaint.\n\nClick on the \"Contact Us\" or \"Raise a Complaint\" option, and you will be presented with different ways to get in touch with Myntra customer support team.\n\nYou may have options such as a chat interface, an email form, or a phone number to call. Choose the method that you prefer or that is available.\n\nIf there is a chat interface, describe your complaint in detail to the customer support representative. Provide necessary details such as your order number, date of order, and specific information about the issue you are facing. Engage in a conversation to discuss your complaint.\n\nIf there is an email form, fill it out with accurate information. Include your order number, date of order, and a clear description of your complaint. Provide all relevant details and any supporting evidence if available.\n\nIf there is a phone number provided, call the customer support number and explain your complaint to the representative. Provide all necessary information and be clear about the issue you are facing. Take note of any reference numbers or details provided during the call for future reference.\n\nSwiggy's customer support team will review your complaint and work to resolve the issue. They may contact you via email, phone, or through the chat interface to provide updates or seek additional information.\n\nRemember to remain calm and polite while filing your complaint. Clear and accurate information will help Swiggy's customer support team understand and address your concern effectively...====hgff",
        "From getting on call at 4am and resolving the issue, to asking photos of the order i dint receive, zomato is losing brand value"
    ],
    "cleaned_text": "zomato worst customer service gifted hot chocolate friend mcdonalds said whole hot chocolate spilled received less even half glass paid nearly rs zomato say sorry inconvenience like im paying money deal customer care food horrible experience even mailed still point anyway get back ",
    "cleaned_title": "zomato worst customer service",
    "cleaned_selftext": "gifted hot chocolate friend mcdonalds said whole hot chocolate spilled received less even half glass paid nearly rs zomato say sorry inconvenience like im paying money deal customer care food horrible experience even mailed still point anyway get back",
    "cleaned_comments": "replied mail tbf looks like empty cup everything spill think need evidence trueee swiggy time og never complaints swiggys customer care theyre never getting back guess similar issue sent mails response whatsoever wow hey used work zomato customer support years back tell depends rating rating every customers like gold silver browns like silver bronze customer get exact exact bot chat email thats get good ratings dont blame though could order drink provide image spilt youyour friend provide appropriate image packaging showing spilt inside also post photos spilled gives impression drink completely ask refund subs turning customer rant platforms ffs even would gave refund provide type picture provide good picture shows spilled otherwise one would believe dealt zomato customer service lot tell youre unsatisfied human talk tochat theyre usually better helping last resort also tell em youll escalating social media twitter usually gets refund good customer polite riders dont fret small issues like mins delay many calls find location delivery executives customer complaint history determines ratings nice riders polite customer care make issue something issue order things like coffee cake call rider picks order tell drive carefully take time rush ill tip later make lost time mostly listen appreciate hmm one friend girl always used take refund maybe rating got show delivery bag spillage show half empty cup show crime scene anyone could enjoy drink show empty cup disgusted way holding cup mistake spillage reported within minutes delivery spillage photo empty glass photo bag everything spilled food along else becomes difficult zomato get compensation food leakage new thing far experienced zomato compensate genuine cases due leakage issue zomato reversed pizza worth milkshakes juices several times numerous times money rolls reversed due leakages genuine issue look like genuine issue whilst believe story evidence enough give compensation sent cup half empty photo contents spilled food would gotten full compensation depends many times went chat asked refund coupon code less refunds coupon codes given gold silver went chat times refunds bronze iron ordered dosa zomato sent dosa without sambar chutney contacted customer support said restaurant closed arguing phone call mins rs coupon code eat dosa water truly swiggy even worse back home delhi weeks ago screwed order hour delayed waiting time mins contacted chat service gave basic corporate speak made angry finally came zomato delivery driver inexcusably rude amazon people even got refund macbook reditt everyone gets sure follow never orders asked refund complained didnt get item order cs straight away refused cant anything contact hotel got item though zomatos customer pissed vowed never order swiggy always costlier zomato shamelessly order hope comes correctly first time happened someone think sometime ago saw comment someone claiming zomato employee told people try get refunds even though faults orders op case extremely unclear drank showed empty cup asked refund shes genuinely saying truth hard believe us indians also feels stupid order hot chocolate delivery would get cold time reaches probability spillage extremely high rs hot chocolate mcdonalds cant believe charging ridiculous prices welcome post funding boom era thanks choosing zomato next step aggressive headaches would recommend trying myntra advanced level also choose flipkart want significantly difficult challenge prove didnt empty stomach lodu hai swiggy things changed days payments failed last month people got multiple deliveries nothing refund absolutely nothing ordered chicken sandwich subway fuckers sent sandwich without chicken asked refund said refund rs rs sandwich said keep rs also switched swiggy dont know man doesnt look spilled swiggy best always compensate instantly late deliveryspillage issues honestly subscriptions dont elevate status system depends behaviour value highvalue refunds often blocked system loss factor used work similar system many times tell people without really telling yeah taken picture along packing pick empty glass show experience zomato support pretty good refund within minutes get decent photo evidence tbh dont see wrong response photo shows spillage empty glass wasnt zomato regularly order milk swiggy instamart takes like extra get delivered minutes buy bulk times succession got delivered puffedbadly damaged packs ask refund always refund amount went uploading pictures uploading describing uploading describing refunds straight ghosted screenshot asking drop mail even asked possible select warehouse whatever fuck called two near according maps looked like person packed way fucks ive nice delivery kids wishing theres festival asking theyd like snackwater koi baat nahi bhai tu araamse aana koi ghai nai hai tipping rains got fucked something beyond control orders finally started arriving fine stopped complaining pretty sure fucks think haha aint taking long way emailing us proves refunds fake something like dont get started uber eats much reliance ecommerce ultra customer king mindset open page ecommerce social media every comment like asking refund asking others never use platform shit happens everytime rating tap missing items section claim refund true agree wanted highlight never complained asked refund around years item didnt get delivered didnt ask refund asking cs could say contact restaurant shitty response check rating always cod verify food accept return right away sachin awasthi ki video yaad aa gyi zomato customer complain wali op please see reel good laugh bahot purana hai wo video technically employees partners hence difficult take kind action haan op ne nhi dkhi hogi wo video k baad maine swiggy zomato ko complaint karna band kar diya used much better ive got order wrong multiple times spillage issues even evidence theyll apologize definitely would start reconsidering using apps becomes pattern picture inspires confidence wo meri first video thi sachin ki phr maine use follow kr diya mai starting se hi dekh rha hu jab uske k follower tbf good customer services like amazons get taken advantage asshats tbf good customer services like amazons get taken advantage asshats start using words like deficiency service deceptive marketting see response changes im fairly certain didnt even talk customer support executives theyre chat bots like others pointed cant see spill see empty glass one send photo empty glass claim spilled user error also would recommend ordering mcdonalds official app theyre lot swift usual mcdonalds order swiggy something exact thing mcd app plus options customize sauce options still use swiggy mcd true multiple complaints mean come point thats bad business swiggy zomato also extremely rude riders honestly doesnt matter dont know news sometime late last year delivery guy stealing someones shoes inspite video evidence nothing major came itatleast publicly ya know doesnt thats whats annoying dont care feels good rating useless yeah yesterday ordered jalebis burnt instant refund given lmfao rating accounts agree pics received friend moment really didnt know cause upset gifted someone drink ended rating even doubt zomato shite similar incident recently ordered usual nearby restaurant takes mins max deliver home delivery guy hour late contacted support said delivery guy late due personal issues told okay want food hot fresh assured delivered expected cold soggy af complained explained situation said sorry please accept order time wont happen lol mean accept whatever give apologized lmfao ridiculous zomato flipkart food delivery rating currently denied refund couple times mostly received completely different food item ordered maybe feel still item giving refund makes look like loser lol sometimes dont refund minor spillage cant verify authenticity issue spilled op whole bag items along side must affected required proof swiggy far better customer service instant gratification policy pay customer refund first retrieve restaurant instead getting restaurant refunding yes ordered delivery two items missing reported pics recourse offered didnt even refund items maybe glass half full dumb take photo like evidence wait didnt get burger ill post empty burger wrapper evidence didnt receive burger rofl common indian service providers take customers granted sure though havent experience zomato faced issues flipkart motorola swiggy bought something consider done move acquire next customer hell existing one bro scamming zomato imagine find sounds like costumer issue cup move tf first one actual got refunded seconds thats tried second time also done seconds thats great dude serves right next time order chocolate packet milk delivery via zomato mix chocolate powder warm milk nice glass mix well enjoy entire family costs less rs paper cups thank later see spillage packaging swiggy good rating usually claim refund strong proofs always get processed theres bulk order one items missing make hell one time got forced get refund one item order item like multiple times asked almost hour transfer someone else cant handle claim legitimate forcing escalate kept blabbing company policy honestly ive cut percent ordering apps worse order mom felt like shit mailed home time maa never followed refund never happened fully probably tend instantly refund post night ive noticed working hours theyd call restaurant double check didnt happen w lmao got back rs spilled butter chicken ordered even though much less spillage paying hot chocolate deserve zomato ridiculous turn blind eye kist genuine cases resolving case per month shit app shit services never become gold member utter waste money never talk chat never listen hardly solve problem ask call resolve problem works time hated swiggy always messed delivery locations months coming delivery guy would often stop wrong place rarely near actual house chance closeby would demand come would blacklisted customers shit early pandemic late early parents told go get package get times didnt come close house yeah hed completely different location point would far one particularly bad case farther going restaurant part arrogance delivery drivers confusingly brought another city couldnt hire people city wouldnt learn paths part swiggy charged way much experience lot restaurants straight broke deals swiggy city people started putting blame ive one arrogant ass delivery guy zomato sent year old brother delivery smoking generally delivery personnel much better pizza delivered poorly delivery guy returned money using cash spot becuase knew botched delivery zomato ridiculous turn blind eye genuine cases resolving case per month shit app shit services never become gold member utter waste money zomato become unbearable lol due lot fake complaints genuine guys suffer provide screenshot cup packaging showing spillage would proceed refund like longer hot chocolate keep rs also youre savage lol reaction idk downvoted would also mad get drink half spilt seems enough evidence drink spilt cos package would look like condensation ghar par pakao khao swiggy zomato ke chakkar na pado ya khud restaurant jaa kar le aao ive realised went restaurant kms away reach restaurant order get food get home swiggy zomato deliver food multiple occasions doesnt work bakery goods since preparation phase short preparation comparing results found saving least inr every order made sometimes savings went high inr stopped ordering food year half indeed worst customer service pizza hut cancelled order didnt even give whole refund zomato kept side amount tried contacting went nowhere shouldnt get entire refund didnt cancel order bhoomi made cameo showed one friends said wrong thing dont think stealing billion dollar corporation bad wait hrs completing first hrs cant understand simple thing sir company policy app menu flipkart pain sent defective earphones nightmare trying get replacement exactly make least hot chocolates home found small stone biryani removed kept beside biryani complained swiggy executive said stone beside biryani inside provide refund always get refunded chat bots sent zomato customer support pic hair inside food fully refunded amount even gave extra coupons within hours adidas hand yet refund rs oh rating customers browns sounds tad racist yes time items missing upon contacting connected restaurant said restaurant informed item missed could anything sorry bronze second get refund coupons delivery delayed ive gold membership remember used thing claimed like couple times orders get delayed half time lately dont receive coupons rating customer support wouldnt help either doesnt looked spilled looks completely empty shouldve taken photo received show received completely fault go friend mcdonalds whole hot chocolate another city think much effort needs taken prevent spillage rs item ordered wendys night packaging missing advertised glazed buns also missing talked customer service instantly refunded wallet ordered like rs worth burgers iirc hate zomato happened times switched swiggy swiggy less restaurants man zomato shit doesnt matter dont give shit wrong item delivered didnt get refund plus delivery guys zomato mostly crooks wish boycott trends starts zomato gets shitted bad even worse happened snapdeal scamming getting downvoted typical scammer zomato shit hate bottom heart dont know hunger drive crazy zomato makes crazier bunch crooks zomato yea changes policy long ago thing people started misuse privilege getting refund spilled wrong order etc zomato even swiggy heck buys hot chocolate personally always smooth experience zomato bro sent pic spillage also empty glass empty glass pic looks like gobbled drink sent complete pic glass spillage zomato doesnt take time refund money issue u coupon evidence pic perfect ya similar experiences zomato back day permanently moved swiggy default food ordering app customer experience good pathetic zomato gold useless stopped giving time delivery guarantee order min late effectively took hour min order deliver nothing despite gold membership ive also seen book table using zomato gold restaurant treats differently pathetic table allowed even restaurant empty service bad even zomato gold order almost everyday maybe days report issue refund work night shifts get hungry around morning oh god customer service drives crazy sneaky bastard ate want refund return think delivery guy received completely wrong order zomato raising complaint executive assistant could tell sorry inconvenience theres nothing could outlet wasnt picking calls refund nothingl pics dont really prove scenario cup spilled whole cup outside would chocolate marks must plastic spilled didnt click pic pics help good experience zomato customer service always either give refund add credits account maybe good rating like dude said comments used order alot mcd always got extra value meal smth never take open drinks always spilled common sense always buy provide zomatos fault completely mcd shit packing expensive bs report mcd zomato lol seems like im good customer cause issues always resolved thats swigggy superior gold youre orders delayed claim coupon button maps page think dont reach support directly good literally say rating page one factor tipping delivery guy hand rating delivery guy trust happen customer one giving rating issue arises delivery guy cant call customer let zomato decide rating wait till need zepto support atleast someone zomato responded kinds things put received better response never problem received partial wrong order gave full refund zomato gold user incidents stopped using zomato yep swiggy delivery good show minutes delivery still show minutes delivery half hour see delivery guy take longer route deays prefer zomato time wait like super hungry atleast deliver time accountable swiggy youre probably blacklisted taking many refunds shady stuff thats theyre giving anything ive never asked refund first gali gali shor hai zomato wale ch hain entitlement know spilled picture also expect hot chocolate remain hot minutes january weather realistic expectations find food delivery apps especially workers great job keeping us fed swiggy recently pissed ordered bread g bread saturday gave bread expires sunday raised complaint asking replacement ready refund replace kept tellin person replacement better dont waste food werent ready replacement clue bro friend working zomato told wouldnt scam mere rs wanted raise issue faced opt cod balls ur court bro im kerala weather talking always hot edit recieved refund hot chocolate talking customer representative really small amount either valid concern op dont feel bad raise concerns yeah drank fo sho bro year old teen parents money bro gon na post legal advice abey kerala nice food order mcd could gone nadan kozhi parotta unbeatable weather like mentioned friend wanted hot chocolate hence pathetic ive faced many issues staff rude unhelpful stopped using entirely refused refund money got item ordered staff told theres nothing denied refund ubereats used refund money thats good food app hate bots feel helpless cant even talk person explain issue win corporate customer fk order direct hate admit itbutthis reason getting richer quarter quarter figured theyre duopoly theyre whatever fuck want much originally order teaspoon wasnt aware zomato sales representative bots reddit lolwhats downvotes know also access opening order summary doesnt give option anymore agree something similar happened order meal burger king whopper fries coke biggest mistake made coke leaking half bag soked coke entire burger fries half spilled coke complained bot said sorry isnt fault restaurants fault cant anything u u guys ordering still online stupid ppl delete account live peacefully never buy drinks mcdonalds takeaway stupid paper cups even capable handling milk experience customer service better since bought gold dude fucking drank whole thing instantly provided whole refund case questions asked well stop blaming sending spillage photos properly exact issue send photos including spillage carrier bag yet stupid chat spat reply bhai papa mummy ko ek jagah ke chilli potato pasand hain kal humne wohi mangaye usne saale ne namak hi ni dala aur mene complaint raise ki toh saale kehte ki next time se ni hoga aur koi support se baat nhi koi refund ni ulta bolte email krdo email pe kehte ye resolve nhi ho sakta mai gold user hu ab kabhi paisa waste ni krunga ghatiya app pe op fraud kar raha hain click pics immediately receiving send got refunds often genuine cases deliver cold food tweet zomato joke even find earlier would appear order tracking screen well refund would issued order delivered zomato doesnt usually refund money give discount coupons next order agree sent spoilt chicken wings pizza hut raised objection saying spoilt food delivered response sorry inconvenience well let restaurant know motherf didnt even refund amount paid something throw away never trust delivery aggregators bloody loots dosa water brother thats sad shit yeah issue used order place breakfast every sunday almost months delivery partner decided drop package spill entire curry one day got delivery super late like hour late whole thing spilled apartment dining table showed video whole thing still said theyll careful next time said good bye zomato forever im quite happy swiggy true also like hot chocolate easy make reported issue immediately like within one minute video multiple pictures good rating still refused plastic pretty beat dirt packaging clearly delivery man dropped spillage place lobby lift still refund pretty rude whole thing deleted app likely transfer costs restaurant heres thing op shit happens drinks spill even suppose youre saying true stop choking social platforms reviews drink spilled didnt get refund game rs doesnt matter ranting everywhere reviews wont even pose cent loss stop wasting time chill nothing happens swiggy pic looks like ur friend drank lol hello ive brought indian street food dirty indian mixed hand make sure shit street youre done got food poisoning ordered chicken restaurant last month december felt like ordered th january got severe food poisoning raised complaint got coupon omg happened wrote email well shitty response understand situation similar experience sure get back mail probably provide coupon amount ordered restro atleast happened zomato lost completely dont ops support offerings even gone full ai mode making experience even worse things go wrong take special type idiot orders prepared beverages online expect get theyd restaurant like really make sense order chai coffee hot chocolate shakes online seen condition roads traffic moves whats delivery personnels fault liquid spills would customer know location spillage benefit doubt cases always go favour customer light exorbitantly bloated prices zomato charges itna packet pe haath saaf karunga gila ho jaayega hot chocolate half spilt burger packet would way soggy zomato worst one time ordered food worth rotis werent delivered complained said restaurant said given cant anything customer executive female rude implied lyingimagine clock make rotis hungry couldnt order rotis place talked person zomato straight away denied claims mere rs would lied rs took ego complained twitter instagram within days social media support zomato called refunded matter feel fools give agreed theyve always refunded money anytime reported issue theres spillage thered empty cup like packaging many similar experiences dont customization request even paid extra wheat bun sent maida one refused even acknowledge problem restaurant couldnt deliver order coz couldnt find rider late night zomato guy kept insisting delivery attempted refused restaurant super nice though delivered next day order rating could step stop usinh zomato six months right cant sodexo tell experience time people behind customer support chat zomato app using excuse picturevideo isnt clear remember threaten person recording entire chat public see escalated case issue resolved guesses would like immediately fire email orderzomatocom without hesitation clearly stating order id along issue youve faced proof theyll respond andor take action cup rather drunk spilled swiggy better restaurant sent different order actually expensive tbh refunded let keep order delivered og order use twitter complaint redressal much faster way zomato service really worst use brain sent picture empty cup anyone drink send pictures wanted make case spilling maybe include bag spilled similar experience zomato various complaints simply rejecting investigation complaints always call respectful works best criticism orders instead making home hot chocolate delivery rs complains spilled liquid sloshed unreal fucking hell make home friends home fraction price nit make chocolate shake home rupees save health hot chocolate looks full pic proof nothing think need evidence didnt emptied stomach seems level customer service groww providing serves right supporting garbage company like mcdonalds mean aint wrong tho looks like used empty glass shouldve taken picture finishing drink agree swiggy wale bhi saale tbh dont order hot chocolate online foolish behaviour behalf lmao even wouldnt believe post dont post pic immediately receive packet let tell done many months back ordered biryani behrouz w ml coke order came without latter talked chat assistant providing pic box items closed make sure aint lying refunded money man similar experience well one items missing delivery tried contacting cs always responded stupid bot mailed straight away send generic response resolution mail send every time hope well email regarding order id kfc restaurant understand hassle face received incomplete order dedicated swiftly resolving issue assuring satisfaction tried calling unresponsive understand importance satisfaction unfortunately able connect restaurant moment validate claim without validation restaurant wouldnt able process refund rest assured constantly work towards providing good experience best regards team zomato stage given refund support pathetic yea customer care dogshit terrible experience dealing dubai spilled stomach unfortunately reality scenario achievable even big players market like talabat zomato delivery hero unable earn profit reality unfortunately food delivery business model doesnt work india well countries hence try automate everything dont pay delivery agents customer care workers employees investors make majority profits xb heres supporting article food delivery businesses failhttpswwwoctalsoftwarecomblogwhydofooddeliverybusinessesfail used good remember always compensated issue last time issue wrong items delivered cooperative dont complain eating shit maybe delivery boy drank yea recent months speak humans chat bots different names guess laid people mujhe toh hamesha refund mil jaata hai bhai mene bhot missuse kra hai mere vjah se band kra inhone refund dena huehue happened last time case got refund also got coupon inconvenience like try showing packaging thats looks like could trying scam bit understdable hard luck understand zomato gets refund requests timemost time fake photo convincing agar spill hogaya tha pata chal jata pehle hi record kar lena chaiye tha cant go get stuff place lazyass stealing billion dollar company case youre stealing person actually needed refund yede gone outside eat foe kind beverage uninstall zomato show photo packaging want order app low quality service ordered zomato bottle pepsi missing prove photo ofcourse dont refund said rate resturant low service sometimes laziness stay hostel dont bike hostel going rickshaw cost money time gives satisfaction go outside eat food exam time option left mai toh meri veg thali aa jati full punjab se discount laga ke spilled package inside mouth like lukewarm bournvita zomato always refunded soon faced issues sorry face mf drank half realized worth money want refund lmfao place live mumbai zomata best service never experienced sort things anyone city naughty boy wants zomato credits thats evidence spillagean empty cup man got ta kidding problem zomato nice trick free food back inside biryani claim refund happened swiggy instamart sent expired box sweets complained got similar response saying cant validate claim cant process refund hadnt even asked refund replacement even took hours respond guess cost cutting customer service department swiggy op swiggy also samejust slightly better zomatoi going try foodcourt app mcd domino etc franchised items good luck us probably got history asking refundsreturns offence got paneer sabji instead paneer dosa straight refunded entire amount additional rs without asking pics yeah ordered something zomato guy restaurant delivered took cash payment app marked customer found zomato put charge order added bill next time ordered stopped using zomato zomato great refund policy please take picture half filled glass instead taking picture empty glass imagine owner zomato check picture youve shared evidence spilled chocolate much worse item ordered missing wanted photo video missing placed plain sheet took picture uploaded file complaint zomato follow steps contact zomato customer support first step reach zomatos customer support teamyou app websitelook helpor contact ussection usually include options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include oder numberdate time incident resistant involved clear description issue faced beware could happen zomato become liar thief ordered food zomato gold member april set phone aside charge minutes later checked see order saw missed call delivery partner timed two minutes tried call back zomato app informed cancelled order delivery partner could contact would keeping entire amount paid order cancellation charge repeated chats customer service team proved useless told followed policy done nothing wrong entitled refund angrily requested speak someone charge callback zomato next day told supervisor even though zomato fault could give discretionary inr discount less half food cost however one month later sign inr accountbeware could happen agree look steal customers money httpsxcomtushaarkuthialastatustbdcuavpnjtojmhccddggashttpsxcomtushaarkuthialastatustbdcuavpnjtojmhccddggas complain zomato follow steps contact zomato support visit zomato website log zomato account create new account dont one search restaurant want complain using search bar open restaurants page scroll find reviews section click write review button describe complaint detail clearly explaining issue faced negatively impacted experience specific provide necessary details order number date time relevant screenshots pictures make sure remain polite professional expressing complaint submit complaint clicking submit post button zomato review complaint may reach information clarification needed patient check updates responses zomato regarding complaint dont receive satisfactory resolution try reaching zomatos customer support app website assistance look help support section find appropriate contact options live chat email phone number remember important provide accurate factual information complaining remain respectful patient throughout process complain zomato follow steps contact zomato support visit zomato website log zomato account create new account dont one search restaurant want complain using search bar open restaurants page scroll find reviews section click write review button describe complaint detail clearly explaining issue faced negatively impacted experience specific provide necessary details order number date time relevant screenshots pictures make sure remain polite professional expressing complaint submit complaint clicking submit post button zomato review complaint may reach information clarification needed patient check updates responses zomato regarding complaint dont receive satisfactory resolution try reaching zomatos customer support app website assistance look help support section find appropriate contact options live chat email phone number remember important provide accurate factual information complaining remain respectful patient throughout process jdm complain zomato follow steps contact zomato customer support visit zomato website log zomato account create new account dont one search restaurant want complain using search bar get refund zomato follow steps contact zomato customer support visit zomato website log account using registered email id password go orders section select order want refund click support help option associated order choose appropriate reason requesting refund available options provide additional details issue faced order submit refund request zomato customer support team review request may contact information needed refund request approved refund amount initiated original payment method bank account wallet refund process may take business days reflect account important note swiggys refund policy may vary based specific circumstances terms conditions providing accurate detailed information issue help expedite refund process raise complaint zomato follow steps contact zomato support first step reach zomato customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced swiggy order service provide specific information went wrong affected experience details provide better help swiggy understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help swiggy investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching zomato official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process zomato customer support team assist clearly communicating complaint increase chances satisfactory resolution file complaint zomato follow steps contact swiggy customer support first step reach zomato customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced swiggy order service provide specific information went wrong affected experience details provide better help swiggy understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help swiggy investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching swiggys official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process swiggys customer support team assist clearly communicating complaint increase chances satisfactory resolution talk zomoto executive helpline try following steps dial zomato mobile phone customer care helpline number zomato india listen automated voice prompts carefully menu options may changed follow instructions provided cases may need press specific number stay line without selecting option connect customer care executive listen available options carefully find one allows speak representative prepared wait hold may queue callers ahead customer care lines sometimes busy patience necessary connected customer care executive clearly explain reason call provide necessary details account information may ask help understand query concern better provide appropriate assistance unable reach executive helpline process changed recommend visiting zomato official website contacting customer support official channels inquire best way speak executive order get thanks steps complain zomato via chat feature open zomato app device go account section usually located bottom navigation menu side menu tap orders option find order want complain tap view order summary button look support button usually located top right corner order summary screen tap support button see option chat us similar option initiate chat zomato customer care chat clearly explain reason complaint issues order delivery overall experience provide relevant details order number date description problem zomato customer care representative assist resolving complaint let know questions l steps complain zomato via chat feature open zomato app device go account section usually located bottom navigation menu side menu tap orders option find order want complain tap view order summary button look support button usually located top right corner order summary screen tap support button see option chat us similar option initiate chat zomato customer care chat clearly explain reason complaint issues order delivery overall experience provide relevant details order number date description problem zomato customer care representative assist resolving complaint let know questions file complaint swiggy follow steps contact swiggy customer support first step reach swiggys customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced swiggy order service provide specific information went wrong affected experience details provide better help swiggy understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help swiggy investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching swiggys official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process swiggys customer support team assist clearly communicating complaint increase chances satisfactory resolution file complaint swiggy follow steps contact swiggy customer support first step reach swiggys customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced swiggy order service provide specific information went wrong affected experience details provide better help swiggy understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help swiggy investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching swiggys official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process swiggys customer support team assist clearly communicating complaint increase chances satisfactory resolution ahcfhhc file complaint swiggy follow steps contact swiggy customer support first step reach swiggys customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced swiggy order service provide specific information went wrong affected experience details provide better help swiggy understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help swiggy investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching swiggys official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process swiggys customer support team assist clearly communicating complaint increase chances satisfactory resolution abcch bruh zia bot dude expect file complaint zomato follow steps contact zomato customer support visit swiggy website open zomato app mobile device look help support section usually find app menu bottom website helpsupport section browse available options use search bar find relevant information related complaint find relevant topic question click view details look option contact zomato customer support file complaint click contact us raise complaint option presented different ways get touch myntra customer support team may options chat interface email form phone number call choose method prefer available chat interface describe complaint detail customer support representative provide necessary details order number date order specific information issue facing engage conversation discuss complaint email form fill accurate information include order number date order clear description complaint provide relevant details supporting evidence available phone number provided call customer support number explain complaint representative provide necessary information clear issue facing take note reference numbers details provided call future reference swiggys customer support team review complaint work resolve issue may contact via email phone chat interface provide updates seek additional information remember remain calm polite filing complaint clear accurate information help swiggys customer support team understand address concern effectivelyhgff getting call resolving issue asking photos order dint receive zomato losing brand value",
    "light_cleaned_title": "Zomato has the worst customer service",
    "light_cleaned_selftext": "So I gifted a hot chocolate to my friend from McDonalds and then he said that the whole hot chocolate has spilled and he received less than even half a glass. I paid nearly Rs300 for this and all Zomato has to say is sorry for the inconvenience. It’s like I’m paying money to just deal with their customer care and not for food. Horrible experience . I even mailed them But still there was no point. Is there anyway to get back at them ?",
    "light_cleaned_comments": "This is what they replied to the mail tbf it looks like an empty cup, where did everything spill? i think they need more evidence of that Trueee, Swiggy is the all time OG! I never had such complaints with Swiggy’s customer care. They’re never getting back I guess! Had a similar issue, sent more than 10 mails no response whatsoever. Wow Hey, I used to work at Zomato customer support few years back. I can tell you that it depends on your rating there are rating for every customers like gold, silver browns. If you like silver or bronze customer, you will get the same exact exact bot Chat over and over again. All you can do is just email them that’s it. How to get good ratings ? I don't blame them for this though. I could order and drink it and provide them this image that it was spilt. You/Your friend did not provide an appropriate image of the packaging showing it was spilt inside. You should also post photos of spilled. It gives impression that you drink completely then ask refund why are these subs turning into customer rant platforms ffs Even I would not have gave you a refund if you provide me this type of picture provide a good picture where it shows that it has spilled... otherwise no one would believe you Dealt with zomato customer service a lot. Tell them you’re unsatisfied and have a human talk to/chat with you. They’re usually better at helping. As a last resort you can also tell em that you’ll be escalating this over social media and Twitter. That usually gets the refund Be a good customer. Be polite to riders. Don't fret over small issues like 5 mins delay or too many calls to find location. Your delivery executives and customer complaint history determines you ratings, be nice to riders, polite to customer care and make an issue of something when only there is an issue. When I order things like coffee or cake, I call my rider before he picks up the order and tell them \"drive carefully, take your time, I am in no rush, I'll tip you later to make up for lost time\". They mostly listen and appreciate that. Hmm , one of my friend girl always used to take refund. Maybe her rating got 0 now Show the delivery bag with the spillage and show the half empty cup. Show the crime scene. Anyone could enjoy the drink and show a empty cup with a disgusted way of holding the cup It was your mistake. The spillage should be reported within 5 minutes of your delivery. If there was spillage, the photo should be not of an empty glass, but the photo of the bag in which everything was spilled. There should be other food along with it or else it becomes very difficult for Zomato to get you the compensation. Food leakage is not a new thing and as far as I have experienced, Zomato does compensate for genuine cases. Once due to a leakage issue, Zomato had once reversed a pizza worth 800 for me. Milkshakes, juices several times and numerous times I had my money for rolls reversed due to leakages. It should be a genuine issue and should look like a genuine issue. Whilst I believe in your story, the evidence was not enough to give you compensation. Had you sent the cup half empty and a photo of its contents spilled all over your food, you would have gotten the full compensation Depends on how many times you have went for the chat and asked for refund or coupon code. Less refunds and any coupon codes they have given you, you are in gold or silver. If you have went to chat more then 3 to 5 times for refunds, you will be on bronze or iron. I ordered Dosa and from Zomato and they sent me dosa without sambar or chutney. Contacted them on customer support and they said the restaurant closed and after arguing on the phone call for 20 mins they have me 70rs coupon code. Had to eat dosa with water 🫠😔 Truly does!! Swiggy is even worse. Was back home in Delhi a few weeks ago, and they screwed up my order, it was 1+ hour delayed for a waiting time of 35-40 mins. Contacted their chat service where they gave basic corporate speak. Made me so angry. When it finally came, the Zomato delivery driver was inexcusably rude!! Is it same in Amazon ? Some people even got refund for MacBook here on reditt but not everyone gets it. not sure they follow it now, never in 100s of orders have asked a refund or complained. I didn't get an item in an order, CS straight away refused they can't do anything. Had to contact hotel, got the item though. As Zomato's customer was pissed, vowed never to order again from them. But Swiggy is always costlier than Zomato for me, shamelessly order now and hope it comes correctly It's not the first time this happened to someone. I think sometime ago I saw a comment from someone claiming to be zomato employee, and he told how people try to get refunds even though there were no faults with orders. In the op case, it's extremely unclear if she drank it and showed an empty cup and asked for a refund or she's genuinely saying the truth. It's hard to believe us Indians. Also it feels stupid to order Hot chocolate for delivery. It would get cold by the time it reaches you, and the probability of spillage is extremely high and 300rs for a hot chocolate, that too from McDonald's??? I can't believe they are charging such ridiculous prices. Welcome to “post funding boom” era and thanks for choosing Zomato. As a next step and for more aggressive headaches, I would recommend trying Myntra. For more advanced level, you can also choose Flipkart if you want a significantly more difficult challenge. Prove that you didn't empty it into your stomach. Lodu hai Swiggy. Things have changed. The days their payments failed last month and people got multiple deliveries, they did nothing to refund it. Absolutely nothing. I ordered a chicken sandwich from Subway and the fuckers sent me a sandwich without chicken in it. When I asked for a refund they said they will refund 25 rs for a 350 rs sandwich. I said keep that 25 rs also and switched to swiggy. I don't know man but it doesn't look spilled to me. Swiggy is best. They always compensate instantly for late delivery/spillage issues. Honestly, subscriptions don't elevate your status in the system. It all depends on behaviour and value. High-value refunds are often blocked by the system because of the loss factor. Used to work in a similar system and many times had to tell people about this without really telling them this. Yeah they should have taken the picture along with packing not just pick empty glass and show it. My experience with Zomato support has been pretty good, they refund within minutes once they get a decent photo as evidence Tbh I don't see wrong in their response. The photo shows no spillage but just an empty glass. This. It wasn't Zomato for me, but I regularly order milk from Swiggy Instamart as it takes like what, extra ₹4 to get it delivered in 12-13 minutes if I buy in bulk. Few times in succession I got delivered puffed/badly damaged packs and I ask for a refund for those. They always refund 100% of the amount. It went from uploading pictures, to uploading and describing, to uploading, describing and no refunds, to just straight up being ghosted as in the screenshot, asking to drop a mail. I even asked them if it is possible to select what warehouse or whatever the fuck it is called (there are two near me, according to maps) because it looked like the person who packed it was doing it in a way that fucks it up. I've been nice to all delivery kids. Wishing them if there's a festival, asking if they'd like to have a snack/water, \"Koi baat nahi bhai tu araamse aana koi ghai nai hai\", tipping them if it rains, and I got fucked because of something beyond my control. My orders finally started arriving fine and so I stopped complaining, but pretty sure those fucks think \"Haha, he ain't taking the long way of emailing us, which proves the refunds were fake\" or something like that. And don't get me started on Uber Eats. Too much reliance on e-commerce and ultra \"customer is king\" mindset. Open the page of any e-commerce on social media and every comment is like this, asking for a refund and asking others to never use that platform again. This shit happens with me everytime and I have a rating of 4.83 Just tap the missing items section and claim a refund ! true I agree, I wanted to highlight I never complained or asked for refund before for around 5 years. When the item didn't get delivered, I didn't ask for refund just was asking what they can do for it? CS could only say contact the restaurant, which is a shitty response. How can we check our rating Always do COD. Verify the food and accept it or just return it right away. Sachin awasthi ki video yaad aa gyi zomato customer complain wali.. OP please see that reel you will have a good laugh 😝 Bahot purana hai wo video. Because technically they are not employees, they are partners. Hence it's difficult to take that kind of action against them haan but OP ne nhi dkhi hogi Wo video k baad Maine swiggy zomato ko complaint karna band Kar diya 💀 They used to much better, now i've got my order wrong multiple times or had spillage issues and even with evidence all they'll do is apologize. Definitely would start reconsidering using these apps if this becomes a pattern. That picture inspires no confidence wo meri first video thi sachin ki phr maine use follow kr diya 😌 Mai to starting se hi dekh rha hu jab uske 3k follower the Tbf, Good customer services like amazon's get taken advantage of by asshats. Tbf, Good customer services like amazon's get taken advantage of by asshats. Just start using words like deficiency in service, deceptive marketting and see how their response changes I'm fairly certain you didn't even talk to any customer support \"executives\". They're all chat bots. Like others have pointed out, you can’t see a spill. All you see is an empty glass. Any one can send a photo of an empty glass and claim it spilled. User error here. But also, I would recommend ordering McDonalds off their official app. They’re a lot more swift. My usual McDonald’s order on Swiggy was 638 or something but the exact same thing on the mcd app was under 550. Plus, they have me options to customize my sauce options. I still use Swiggy but not for mcd. True but multiple complaints?? I mean, come on, at some point that’s just bad for business. Swiggy & Zomato also have extremely rude riders. It honestly doesn't matter for them. I don't know, but there was a news sometime late last year about a delivery guy stealing someone's shoes. Inspite of having video evidence, nothing major came out of it(atleast publicly). Ya I know it doesn’t. That’s whats most annoying. They just don’t CARE!! Feels good that my 4.72 rating is not useless. Yeah yesterday I ordered some jalebis they were burnt, instant refund was given Lmfao my rating is 4.28 and 4.15 in both of my accounts 😭 I agree but these all are pics which I received from my friend and at the moment I really didn’t know what to do cause I was just upset that I gifted someone a drink and this is how it ended up I have a rating of 4.75 Even I doubt you Now Zomato is shite! I had a similar incident recently. I ordered from a usual nearby restaurant it takes 30 mins max to deliver to my home. The delivery guy was an hour late. I contacted support and they said the delivery guy is late due to \"personal issues\". I told him okay but I want my food to be hot and fresh and they assured me it will be. When it was delivered as expected it was cold and soggy af. I complained. I explained the situation and they just said sorry please accept the order this time and it won't happen again lol. I mean i should just accept whatever they give me just because they apologized lmfao it was ridiculous. Zomato is Flipkart of food delivery I have a rating of 4.6* currently but I have been denied a refund a couple of times, that was mostly when I received completely different food item than what I ordered, maybe they feel we will still have that item, so giving a refund makes them look like a loser, lol Sometimes they don't refund if there is just minor spillage or if they can't verify the authenticity of your issue. If it was spilled op then whole bag and the items along side must have been affected too that was required as proof Swiggy is far better at customer service. They have an instant gratification policy. They pay the customer the refund first and then retrieve it from the restaurant instead of getting it from the restaurant and then refunding it. Yes they do. I ordered delivery and two items were missing. I reported it with the pics that was all the recourse they offered. They didn’t even refund me for the items Maybe the glass is half full You are dumb to take a photo like that as evidence 😂 Wait I didn't get my burger I'll post an empty burger wrapper as evidence that I didn't receive the burger . ROFL. Very common with Indian service providers. They take customers for granted for sure. Though I haven't had such an experience with zomato, have faced such issues with Flipkart, Motorola and Swiggy. Here once you have bought something from them, they consider you done! Move to acquire the next customer. To hell with the existing one. Bro over here is scamming zomato💀, imagine if they find out... Sounds like a costumer issue... its a cup, move tf on The first one was actual and got refunded in seconds. That's why I tried the second time, also done in seconds. Thats great dude 🤖 Serves you right. Next time order a can of chocolate and a packet of milk for delivery via zomato 😁 Mix chocolate powder with warm milk in a nice glass. Mix well. Enjoy with entire family. Costs less Than Rs:300/- and no paper cups. 🤣🤣🤣😝. Thank me later. Can see some spillage on the packaging <<<<<Swiggy I have a good rating and usually I only claim refund with strong proofs so I always get them processed but when theres a bulk order and only one or few items are missing they make it hell, one time I got forced to get refund only for one item when I order the item like multiple times and I asked her for almost an hour to transfer me to someone else if you can't handle this because the claim is legitimate and she was forcing me to not escalate this and kept blabbing company policy. Honestly after that I've cut down 90 percent of my ordering from apps. Worse was that the order was for my mom and I felt like shit, I did it on her and mailed them as i was at home at the time but my maa never followed up with it so the refund never happened fully probably They tend to instantly refund post 12 at night ive noticed. If it were working hours, theyd call the restaurant to double check before This didnt happen w me lmao, i got back my 240 rs for the spilled butter chicken I ordered, even though it was much less spillage You are paying ₹300 for a hot chocolate . You deserve this. Zomato is ridiculous. They turn a blind eye for the kist genuine cases after resolving 1 case per month. Shit app. Shit services. Never become a gold member. Utter waste of money Never talk to them on chat, they never listen to you and hardly solve your problem, ask them to call you and then resolve the problem, this works 99% of the time for me I hated swiggy. They always messed up delivery locations for months after coming out. The delivery guy would often stop at the wrong place - rarely near our actual house, and on the off chance that it was close-by, he would demand that we come to him, or \"we would be blacklisted as customers\" or some shit. This was early off the pandemic, late 2021 and early 2022, so my parents just told me to go get the package. And get this - most of the times that he didn't come close to our house? Yeah he'd be in a completely different location, to the point that it would be just as far (or in one particularly bad case, farther) than just going to the restaurant. Part of this was the arrogance of delivery drivers who had confusingly been brought from another city (why couldn't they just hire people from this city?) and wouldn't learn the paths, and part was that swiggy charged way too much for this experience. A lot of restaurants straight up broke their deals with Swiggy in our city because people started putting the blame on them. I've only had one arrogant ass delivery guy with zomato, who sent his 14 year old brother to do the delivery because \"he was smoking\", but generally the delivery personnel have been much better. I had a pizza delivered poorly once and the delivery guy returned me 25% of the money (I was using cash) on the spot becuase he knew he had botched the delivery. Zomato is ridiculous. They turn a blind eye for the most genuine cases after resolving 1 case per month. Shit app. Shit services. Never become a gold member. Utter waste of money. Zomato has become unbearable Lol due to lot of fake complaints, genuine guys have to suffer. Just provide a screenshot with cup and packaging showing spillage. They would proceed with refund. More like 300 for a no longer hot chocolate. Keep the 25 Rs also 😂 You're savage, lol. What was their reaction after this? Idk why you are being downvoted but I would also be mad if I get a drink half spilt. And there seems to be enough evidence that the drink was spilt cos no package would look like that with just condensation. Ghar par pakao. Khao. Swiggy Zomato ke chakkar me na pado. Ya khud restaurant Jaa kar le aao. I've realised that if I went to a restaurant that is 5 kms away I can reach the restaurant, order, get my food then get home before swiggy or Zomato can deliver my food on multiple occasions. Doesn't work on bakery goods since their preparation phase is very short to no preparation at all. After comparing the results I found out that I was saving at least INR 40 to 50 on every order that I made. Sometimes the savings went as high as INR 200. I stopped ordering food after that. It's been a year and a half now. They indeed have worst customer service. Pizza hut cancelled the order and didn't even give the whole refund. Zomato kept his side of the amount. When I tried contacting them, it went nowhere. Why shouldn't I get entire refund when I didn't cancel the order? Bhoomi just made a Cameo 💀 Showed this to one of my friends She said it's a wrong thing to do. I don't think stealing from a billion dollar corporation is that bad 🫡 You have to wait for 72 hrs after completing the first 72 hrs and so on. Can't you understand a simple thing sir? This is a company policy. In the app menu Flipkart was a pain. They sent me defective earphones and it was a nightmare trying to get a replacement. Exactly. You can make at least 10 hot chocolates at home for 300 Once, I found a small stone in my biryani, I removed it and kept it just beside the biryani, I complained to Swiggy, and executive said that stone is beside the biryani and not inside it so we cannot provide you refund!! I always get refunded by chat bots. I once sent zomato customer support a pic of hair inside food, they fully refunded the amount and even gave some extra coupons within 2 hours. Adidas on the other hand are yet to to refund me 2500 Rs Oh, rating customers as “browns” sounds a tad racist? ;-) yes, 1 time there was 1 of the items was missing. upon contacting them, they connected with the restaurant and said that the restaurant informed them that no item was missed. so they could not do anything. sorry it is bronze I second that! So do you get refund coupons if your delivery is delayed? I've had a Gold membership for a while and I remember it used to be a thing and I only claimed it like a couple of times but now my orders get delayed half the time lately but don't receive any of the coupons. My rating is 4.4. If I was the customer support, I wouldn’t help you either. That doesn’t looked spilled at all, it just looks completely empty. You should’ve taken photo when you received it to show how you received it. This is completely your fault. Why not go with your friend to McDonalds and the whole hot chocolate with him? He is in another city? Think how much effort needs to be taken to prevent spillage for Rs. 300 item. i have ordered from wendys at night and some of the packaging was missing and they advertised glazed buns, that was also missing so when i talked to customer service they instantly refunded in their own wallet, i had ordered like 600rs worth of burgers iirc I hate zomato for this. Happened with me 5-6 times. I have switched to swiggy. It’s just swiggy has less restaurants. But man zomato is shit, It doesn’t matter what you do, they don’t give a shit. I once had wrong item delivered and didn’t get refund. Plus the delivery guys if zomato are mostly crooks. I wish some boycott trends starts and zomato gets shitted so bad even worse than what happened to snapdeal. His scamming that why getting downvoted. Typical scammer Zomato is shit. I hate it from bottom of my heart. You don’t know how hunger can drive you crazy and zomato makes you crazier. Bunch of crooks at zomato. Yea. They changes the policy long ago. The thing is people started to misuse the privilege of getting refund on spilled , wrong order etc and now they did this . Not only ZOMATO even Swiggy . Who the heck buys only a hot chocolate 🤡🤡 Personally I always have a very smooth experience with Zomato. Bro you should have sent the pic of the spillage also not only of the empty glass. Empty glass pic looks like you have gobbled the drink yourself. You should have sent a complete pic of the glass with all the spillage. Zomato doesnt take time to refund your money or issue u a coupon if the evidence (pic) is perfect. Ya. I had similar experiences with Zomato back in the day. So, permanently moved to Swiggy as my default food ordering app. Customer experience has been good. It’s pathetic, and Zomato gold is useless. They have stopped giving o time delivery guarantee - my order was 35 min late (so effectively it took 45+35=1 hour 20 min for the order to deliver) and they did nothing despite gold membership. I’ve also seen that if I book a table using zomato gold, the restaurant treats very differently. The most pathetic table is allowed even if the restaurant is empty. Service is bad too. I even have zomato gold and order almost everyday, once in maybe 7-10 days I have to report the issue and they do not refund. I work night shifts and i get hungry around 2-3 in the morning. But oh God the customer service drives me crazy You sneaky bastard you ate it and if you want a refund or return, just think about the delivery guy I once received a completely wrong order from Zomato. After raising a complaint, all the executive assistant could tell was that he was sorry for the inconvenience and there's nothing they could do because the outlet wasn't picking his calls. No refund, no nothing.l These pics don't really prove the scenario, if the cup spilled the whole cup on the outside would have chocolate marks, and there must be the plastic where it all spilled, why didn't you click the pic of that? These pics will not help. I have good experience with zomato customer service. They always either give refund or add credits to account. Maybe it’s because I have good rating like the other dude said in comments. I used to order alot from MCD and always got the extra value meal or smth. NEVER take the open drinks it will always be spilled because common sense, always buy a can which they provide. Its not zomato’s fault completely MCD has shit packing and too expensive for bs. Report it to MCD not zomato. Lol seems like I'm a good customer cause my issues are always resolved That's why swigggy is superior If you have gold and if you're orders are delayed you should have the claim coupon button in the maps page itself I think, you don't have to reach out to support directly And this is not good. They literally say on rating page that one of the factor is tipping the delivery guy. If they hand over our rating to delivery guy then how can the trust happen. A customer should be the one giving rating. If any issue arises from delivery guy, why can't he call to customer and and let Zomato decide the rating. Wait till you need zepto support. Atleast someone from zomato responded In these kinds of things, just put not received. Better response. I never had the problem at all. When i received a partial wrong order, they gave me a full refund. I was a Zomato gold user.. After few incidents I stopped using Zomato. Yep, swiggy delivery is not good. They show 40 minutes for delivery and it will still show 40 minutes for delivery after half hour. And then I see the delivery guy take a longer route and deays again. I prefer zomato if I have no time to wait like super hungry. Atleast they deliver on time or is more accountable than swiggy. You're probably blacklisted for taking too many refunds by doing shady stuff. That's why they're not giving you anything. I’ve never asked for a refund this is my first Gali gali me shor hai Zomato wale ch.. hain. The entitlement here. How do you know it spilled from that picture? Also, do you expect a hot chocolate to remain hot after 60 minutes of January weather? Have realistic expectations and you will find that these food delivery apps and especially the workers are doing a great job of keeping us fed. Swiggy recently pissed me off. I ordered for bread - 450g bread on Saturday and they gave me bread which expires on sunday. I raised complaint asking for replacement. They were ready to refund but now replace. I kept tellin them it's for 1 person, so replacement will be better, so I don't have to waste the food, but they weren't ready for replacement. Then no clue bro. My friend was working in Zomato, he told me this. I wouldn’t scam for a mere 300 rs . I just wanted to raise an issue that I faced Opt for cod.. their balls will be in ur court Bro I’m from Kerala , what weather are you talking about ? Its always hot here Edit : I have recieved a refund for the hot chocolate after talking to a customer representative. 300 is not really a small amount either. It's a valid concern OP.. Don't have to feel bad to raise such concerns. Yeah no you drank it fo sho my bro 16 year old teen with parents money. Now bro gonna post on legal advice Abey Kerala has such nice food. Why order from some McD? Could have gone for that nadan kozhi with parotta, unbeatable in any weather. Like I mentioned it was for a friend who wanted hot chocolate hence It's pathetic. I've faced too many issues. Their staff is rude and unhelpful. Stopped using it entirely after they refused to refund my money when I only got 1 item out of 8 that I had ordered. The staff told me there's nothing they can do and denied any refund UberEats used to refund money, that’s such a good food app🔥 I hate these bots. Feel so helpless. Can't even talk to a person and explain the issue. Again a win for corporate and customer can f**k off. Order direct Hate to admit it...but...this is the reason I am getting richer quarter by quarter... they figured they're a duopoly so they're doing whatever the fuck the want How much did you originally order, a teaspoon? I wasn't aware zomato had sales representative bots on reddit lol...whats with the downvotes🤣 I know where it is, you can also access it by opening the order summary. But it doesn't give me that option anymore. I agree something similar happened with me I order a meal from burger king with a whopper fries and coke.. Biggest mistake I made the coke was leaking. Half the bag was soked in coke the entire burger, fries and half spilled coke. When I complained all the bot said was we're sorry but this isn't our fault but restaurants fault we can't do anything for u U guys are ordering still online!? 😂 Stupid ppl. Delete account live peacefully😊 never buy any drinks from mcdonalds on the takeaway. stupid paper cups are not even capable of handling the milk. my experience with customer service has been better since i bought gold Dude you fucking drank the whole thing But they instantly provided me the whole refund in my case , no questions asked as well Stop blaming him for not sending the spillage photos properly. I had the exact same issue and I did send the photos including the spillage all over the carrier bag yet the stupid chat spat out the same reply. bhai papa mummy ko ek jagah ke chilli potato pasand hain to kal humne wohi mangaye. usne saale ne namak hi ni dala aur mene complaint raise ki toh saale kehte ki next time se ni hoga aur koi support se baat nhi, koi refund ni. ulta bolte email krdo. email pe kehte ye resolve nhi ho sakta. mai gold user hu. ab kabhi paisa waste ni krunga is ghatiya app pe. OP fraud kar raha hain Click pics immediately on receiving and send it to them. I have got refunds more often than not for genuine cases. deliver cold food Tweet about this Zomato is a joke Even i cannot find it now. Earlier it would appear on the order tracking screen as well that the refund would be issued after order is delivered. Zomato doesn't usually refund money but they give discount coupons for your next order. I agree. Once they sent over spoilt chicken wings from Pizza Hut and I raised the objection saying spoilt food delivered. The response ? Sorry for the inconvenience, we'll let the restaurant know. Motherf*** didn't even refund the amount. I paid for something that I had to throw away! Never trust these delivery aggregators. Bloody loots. Dosa with water, Brother that's some sad shit. Yeah I had the same issue. I used to order from the same place for breakfast every Sunday for almost 6 months and this delivery partner decided to drop the package and spill the entire curry one day. I got my delivery super late, like an hour late and the whole thing spilled all over my apartment and dining table. I showed them video of the whole thing and still they said they’ll be careful next time. And I said good bye to Zomato forever. I’m quite happy with Swiggy for now. So true, also like hot chocolate is so easy to make. I reported my issue immediately. Like within one minute with video and multiple pictures. And I have a good rating. Still they refused. The plastic can was pretty beat up, dirt on the packaging. Clearly the delivery man dropped it. The spillage was all over the place. In the lobby, in the lift. 🤦. Still no refund and they were pretty rude about the whole thing. I just deleted the app. They likely transfer the costs over to the restaurant Here’s the thing OP. Shit happens and drinks spill. Even if I suppose that what you’re saying is true, stop choking up all the social platforms with these reviews. Drink spilled, you didn’t get a refund, game over. If 300 Rs doesn’t matter to you, why are you ranting about it everywhere. These reviews won’t even pose a cent of loss for them. Stop wasting time and chill up. Nothing happens. Same with swiggy From the pic it looks like ur friend drank it lol Hello I've brought your indian street food that some dirty indian mixed with his hand.. make sure and shit in the street when you're done I got food poisoning. I ordered this chicken 65 from a restaurant last month (December) and felt like having it again, i ordered it on 14th January. Got severe food poisoning because of it, when i raised a complaint, all i got was a ₹98 coupon🤡 OMG SAME HAPPENED AND I WROTE AN EMAIL AS WELL SAME SHITTY RESPONSE I can understand your situation ,From my similar experience. They will for sure get back to you on mail. Most probably they will provide you the coupon of same amount to be ordered from same restro. Atleast this is what happened with me. Zomato has lost it completely. They don't have the ops to support their offerings. And now they have even gone full AI mode, making the experience even worse when things go wrong. Is it just me, or does it take a special type of idiot who orders prepared beverages online and expect to get them as they'd in a restaurant? like does it really make sense to order Chai, Coffee, Hot Chocolate, Shakes online? Have you seen the condition of our roads and how traffic moves? What's the delivery personnels fault if liquid spills over? How would the customer know about the location of the spillage? The benefit of doubt in such cases should always go in favour of the customer (in light of the exorbitantly bloated prices that Zomato charges). Itna to packet pe haath saaf karunga to gila ho jaayega.. a hot chocolate half spilt on the burger packet would be way more soggy than this Zomato is the worst. One time I ordered food worth 1600 and rotis weren't delivered. When I complained they said no the restaurant has said they have given we can't do anything. The customer executive female was so rude and just implied that I was lying.Imagine at 11 clock I had to make 20 rotis as we were so hungry that we couldn't order rotis from some other place. When I talked to the person at Zomato they just straight away denied my claims. For mere 200 rs why would I have lied? Then for just rs 200 I took it on my ego🤣🤣 complained on Twitter and Instagram and within 3 days the social media support of Zomato called me and refunded it. It was not a matter of 200 but just that they feel we are fools and will just give up . Agreed, they've always refunded money anytime I reported an issue If there's spillage, there'd be more than an empty cup. Like in the packaging Many such similar experiences they dont are about customization or request. Even when i paid extra for wheat bun they sent maida one and refused to even acknowledge the problem. The restaurant couldn't deliver the order coz they couldn't find a rider late at night and the zomato guy kept insisting that delivery was attempted but i refused , the restaurant was super nice though they delivered the next day. As i order more and more my rating could do down so only step is to stop usinh zomato for six months right? Cant with sodexo I can tell you from experience, most of the time the people behind the customer support chat on the Zomato app, do this by using the excuse that the picture/video isn't clear. I remember once I had to threaten the person that I was recording the entire chat for the public to see, which is when she escalated my case and my issue was resolved. I have my guesses on why they do that, but what I would like you to do is to immediately fire an email to order@zomato.com without any hesitation, clearly stating your order id along with the issue you've faced and the proof and they'll respond and/or take action. That cup rather drunk than spilled 🤨🤨 swiggy is better, restaurant sent me a different order (which was actually more expensive tbh), they refunded me, let me keep the order AND then delivered my og order Use Twitter. Complaint redressal will be much faster that way. Zomato service is really the worst Use your brain. You sent them a picture of an empty cup Anyone can drink all of it then send the same pictures as you If you wanted to make a case for spilling, maybe include the bag in which it spilled Had similar experience with Zomato at various complaints. They are simply rejecting on further investigation on complaints Always call them ++ BE RESPECTFUL!!! Works best. My criticism is who **orders** (instead of making at home) hot chocolate for delivery 300 Rs and then complains that it spilled ??? It's a liquid. It sloshed. Unreal. Fucking hell. Just make it at home or at your friends home for a fraction of the price, you nit. Make chocolate shake at home for 50 rupees and save 250 and your health. Hot chocolate looks full in this pic. How is this any proof? I did same but they do nothing I think they need an evidence that you didn't emptied on your stomach. This seems at the level of customer service groww has been providing me. Serves you right for supporting a garbage company like McDonalds i mean they aint wrong tho, it looks like a used empty glass. shouldve taken a picture before finishing the drink I agree. Swiggy wale bhi saale same he tbh don’t order hot chocolate online More foolish behaviour on your behalf lmao. Even I wouldn't believe this post if you don't post the pic as immediately as you receive the packet. Let me tell you how it's done. Many months back I ordered Biryani from Behrouz w/ 150ml coke and the order came without the latter. I talked to the chat assistant providing the pic of the box with items closed to make sure I ain't lying. They refunded me the money. Man ,I have had the similar experience as well. One of the items was missing from the delivery and I tried contacting cs but it’s always responded by stupid bot. Then I mailed them but they straight away send a generic response with no resolution. This is the mail they send me every time “, Hope you are doing well. This email is regarding Order ID -549\\*\\*\\*\\*\\* from KFC Restaurant. We understand the hassle you had to face as you have received an incomplete order. We are dedicated to swiftly resolving this issue and assuring your satisfaction. We tried calling you but you were unresponsive. We understand the importance of your satisfaction. Unfortunately, we are not able to connect with the restaurant at this moment to validate your claim and without validation from the restaurant, we wouldn’t be able to process a refund. Rest assured that we constantly work towards providing you with a good experience. Best regards, Team Zomato” At this stage I have given up on the refund because their Support is PATHETIC Yea their customer care is dogshit. Had a terrible experience dealing with them in Dubai. Spilled into the stomach. \"But unfortunately in reality the scenario is not achievable for even the big players in the market. Like *Talabat, Zomato and Delivery Hero* are unable to earn profit in reality.\" Unfortunately, the food delivery business model doesn't work in India as well as in other countries. Hence, they try to automate everything and don't pay their delivery agents, their customer care workers, their other employees, just so that the investors can make the majority of the profits... &#x200B; Here's a supporting article: [why do food delivery businesses fail](https://www.octalsoftware.com/blog/why-do-food-delivery-businesses-fail) It used to be very good. I remember they always compensated me when there was an issue. But the last time I had an issue, where wrong items were delivered then were not co-operative at all. You don't complain after eating your shit Maybe the delivery boy drank it Yea , in recent months i cannot speak to any humans. It is just chat bots with different names. I guess they laid off people mujhe toh hamesha refund mil jaata hai bhai mene bhot missuse kra hai, mere vjah se band kra inhone refund dena huehue This happened to me last time, but then in my case i got my refund and also got a coupon for the inconvenience like some 150/- off Try showing the packaging? That's looks like you could be trying a scam so a bit understdable. Hard Luck, but you have to understand Zomato gets such refund requests all the time(most of the time it's fake) and the photo is not at all convincing, agar spill hogaya tha to pata chal jata pehle hi, record kar Lena chaiye tha. It's on you. can't you just go get the stuff from the place itself, lazyass 😹 You are not stealing from a billion dollar company in this case. You're stealing from the person who actually needed a refund. Yede you should have gone outside to eat foe this kind of beverage. Just uninstall zomato. You should show photo with packaging but why you want order from app that have low quality of service. i have ordered from zomato, 2 bottle of pepsi was missing. How can i prove in photo? Ofcourse, they don't refund me, they said you can rate resturant low for their service. Sometimes it's not laziness. I stay in hostel & I don't have bike in hostel. Going through rickshaw, cost more money & time but it gives satisfaction to go outside to eat food. During exam time, no option left. 300 mai toh meri 3 veg thali aa jati full on punjab se...120 discount laga ke It should have been spilled in the package not inside your mouth. More like lukewarm Bournvita Zomato has always refunded me as soon as I faced issues - sorry you had to face this. Mf you drank half of it and then realized it's not worth money and now you want refund lmfao The place where I live in Mumbai zomata has the best service. I have never experienced such sort of things from then or anyone in your city has. Naughty boy wants Zomato credits 😂😂 And thats your evidence of spillage?an empty cup?? Man you gotta be kidding. You are the problem not Zomato. Nice trick for free food So just out back inside biryani and claim refund 😜 Same happened with me on Swiggy - Instamart sent me an expired box of sweets. When I complained I got a similar response saying they can't validate my claim and can't process a refund. I hadn't even asked for a refund, just a replacement. They even took 6 hours to respond. Guess they are cost cutting in the customer service department. swiggy>>>> @op swiggy is also same...just slightly better than zomato..i am going to try foodcourt app for mcd, domino etc franchised items. Good luck to us. You probably got a history of asking for refunds/returns (no offence) I only got a Paneer sabji instead of a Paneer dosa and they straight up refunded the entire amount + an additional 50 Rs to me without asking for pics. Yeah once I ordered something from zomato, the guy from the restaurant delivered it and then took cash payment. Then on the app he marked it as customer not found, so zomato put the charge of the order against me which was added to the bill next time I ordered. Stopped using zomato after that. Zomato has a great refund policy. Please take a picture with half filled glass instead you are taking a picture of an empty glass. Imagine you are the owner of zomato and then check the picture you've shared as evidence of spilled chocolate 😂 Much worse, an item I had ordered was missing. They wanted a photo or video that it was missing. I placed a plain A4 sheet, took a picture and uploaded. To file a complaint zomato you can follow these steps: 1. Contact zomato Customer Support:06372-293-165 The first step is to reach out to zomato's customer support team.you can do this through their app or website.Look for the \"Help\"or \"contact Us\"section, which usually include options to chat with a support representative or submit a complaint. 2. Provide Relevant Details: when contacting customer support, provide them with all the necessary details related to your complaint. This may include the oder number,date and time of the incident, the resistant involved, and a clear description of the issue you faced. # BEWARE! This could happen to you! ZOMATO HAS BECOME A LIAR AND A THIEF!!! I ordered food from Zomato as a Gold member on April 21, 2024 and then set my phone aside to charge. 45 minutes later, when I checked to see where my order was, I saw a missed call from the delivery partner timed two minutes before. I tried to call back, but the Zomato App informed me that they had cancelled my order as the delivery partner could not contact me and they would be keeping the entire amount I paid for the order as a cancellation charge. Repeated chats with their customer service team proved useless; they told me that they had followed their policy, done nothing wrong and I was not entitled to any refund. I angrily requested to speak to someone in charge and, after a callback from Zomato the next day, was told by a supervisor that even though Zomato was not at fault, they could give me a discretionary INR 500 discount, which was less than half what the food had cost. However, one month later, there is no sign of the INR 500 in my account.BEWARE! This could happen to you! I agree. Look how they steal customers' money. [https://x.com/TushaarKuthiala/status/1782318037171093865?t=BDCU2aVpnjTOjMhCcDDgGA&s=08](https://x.com/TushaarKuthiala/status/1782318037171093865?t=BDCU2aVpnjTOjMhCcDDgGA&s=08) To complain on Zomato, you can follow these steps: 1. Contact Zomato Support:0939-0072-307 visit the Zomato website. 2. Log in to your Zomato account or create a new account if you don't have one. 3. Search for the restaurant you want to complain about using the search bar. 4. Open the restaurant's page and scroll down to find the \"Reviews\" section. 5. Click on the \"Write a Review\" button. 6. Describe your complaint in detail, clearly explaining the issue you faced and how it negatively impacted your experience. 7. Be specific and provide any necessary details such as order number, date, time, and any relevant screenshots or pictures. 8. Make sure to remain polite and professional while expressing your complaint. 9. Submit your complaint by clicking on the \"Submit\" or \"Post\" button. 10. Zomato will review your complaint and may reach out to you for further information or clarification if needed. 11. Be patient and check for any updates or responses from Zomato regarding your complaint. 12. If you don't receive a satisfactory resolution, you can try reaching out to Zomato's customer support through their app or website for further assistance. Look for the \"Help\" or \"Support\" section and find the appropriate contact options such as live chat, email, or phone number. Remember, it is important to provide accurate and factual information while complaining and to remain respectful and patient throughout the process. To complain on Zomato, you can follow these steps: 1. Contact Zomato Support:07257-948-548 visit the Zomato website. 2. Log in to your Zomato account or create a new account if you don't have one. 3. Search for the restaurant you want to complain about using the search bar. 4. Open the restaurant's page and scroll down to find the \"Reviews\" section. 5. Click on the \"Write a Review\" button. 6. Describe your complaint in detail, clearly explaining the issue you faced and how it negatively impacted your experience. 7. Be specific and provide any necessary details such as order number, date, time, and any relevant screenshots or pictures. 8. Make sure to remain polite and professional while expressing your complaint. 9. Submit your complaint by clicking on the \"Submit\" or \"Post\" button. 10. Zomato will review your complaint and may reach out to you for further information or clarification if needed. 11. Be patient and check for any updates or responses from Zomato regarding your complaint. 12. If you don't receive a satisfactory resolution, you can try reaching out to Zomato's customer support through their app or website for further assistance. Look for the \"Help\" or \"Support\" section and find the appropriate contact options such as live chat, email, or phone number. Remember, it is important to provide accurate and factual information while complaining and to remain respectful and patient throughout the process jdm.. To complain on Zomato, you can follow these steps: Contact Zomato Customer 06372293165)Support:06372-293-165 visit the Zomato website. Log in to your Zomato account or create a new account if you don't have one. Search for the restaurant you want to complain about using the search bar. To get a refund in zomato, you can follow these steps: Contact zomato Customer Support:0637-2935-213 visit the zomato website. Log in to your account using your registered email ID and password. Go to the \"My Orders\" section. Select the order for which you want a refund. Click on the \"Support\" or \"Help\" option associated with the order. Choose the appropriate reason for requesting a refund from the available options. Provide additional details about the issue you faced with the order. Submit your refund request. Zomato customer support team will review your request and may contact you for further information if needed. If your refund request is approved, the refund amount will be initiated to your original payment method, such as your bank account or wallet. The refund process may take a few business days to reflect in your account. It's important to note that Swiggy's refund policy may vary based on the specific circumstances and their terms and conditions. Providing accurate and detailed information about the issue will help expedite the refund process. To raise a complaint with zomato, you can follow these steps: Contact zomato Support:06372-293-165 The first step is to reach out to zomato customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to zomato official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process zomato customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution. To file a complaint with Zomato you can follow these steps: Contact Swiggy Customer Support: 06372-293-165.The first step is to reach out to zomato customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a. To talk to an Zomoto executive helpline, you can try the following steps: Dial 0798-0595-213 from your Zomato mobile phone. This is the customer care helpline number for zomato in India. Listen to the automated voice prompts carefully. The menu options may have changed, so follow the instructions provided. In some cases, you may need to press a specific number or stay on the line without selecting any option to connect to a customer care executive. Listen to the available options carefully to find the one that allows you to speak with a representative. Be prepared to wait on hold as there may be a queue of callers ahead of you. Customer care lines can sometimes be busy, so patience will be necessary. Once connected to a customer care executive, clearly explain the reason for your call and provide any necessary details or account information they may ask for. This will help them understand your query or concern better and provide you with the appropriate assistance. If you are unable to reach an executive through the 198 helpline or if the process has changed, I recommend visiting Zomato official website or contacting their customer support through their official channels to inquire about the best way to speak with an executive order to get. Thanks Here are the steps to complain on Zomato via their chat feature: 1. Open the Zomato app on your device.06372-293-165 2. Go to the \"Account\" section, usually located in the bottom navigation menu or the side menu. 3. Tap on the \"Your Orders\" option. 4. Find the order you want to complain about and tap on the \"View Order Summary\" button. 5. Look for the \"Support\" button, usually located in the top right corner of the order summary screen. 6. Tap on the \"Support\" button, and you should see an option to \"Chat with us\" or a similar option to initiate a chat with Zomato customer care. 7. In the chat, clearly explain the reason for your complaint, such as issues with the order, delivery, or overall experience. 8. Provide any relevant details, such as the order number, date, and a description of the problem. 9. The Zomato customer care representative will then assist you with resolving your complaint. Let me know if you have any other questions! How can l steps to complain on Zomato via their chat feature: 1. Open the Zomato app on your device.06372-293-165 2. Go to the \"Account\" section, usually located in the bottom navigation menu or the side menu. 3. Tap on the \"Your Orders\" option. 4. Find the order you want to complain about and tap on the \"View Order Summary\" button. 5. Look for the \"Support\" button, usually located in the top right corner of the order summary screen. 6. Tap on the \"Support\" button, and you should see an option to \"Chat with us\" or a similar option to initiate a chat with Zomato customer care. 7. In the chat, clearly explain the reason for your complaint, such as issues with the order, delivery, or overall experience. 8. Provide any relevant details, such as the order number, date, and a description of the problem. 9. The Zomato customer care representative will then assist you with resolving your complaint. Let me know if you have any other questions! To file a complaint with Swiggy, you can follow these steps: Contact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a. To file a complaint with Swiggy, you can follow these steps: Contact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.hcfhhc To file a complaint with Swiggy, you can follow these steps: Contact Swiggy Customer Support: 06372-293-165.The first step is to reach out to Swiggy's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Swiggy order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Swiggy understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Swiggy investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Swiggy's official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Swiggy's customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.bcch Bruh, Zia is a bot dude. What do you expect To file a complaint against Zomato, you can follow these steps: Contact Zomato Customer Support:(06370-523-572) Visit the Swiggy website or open the Zomato app on your mobile device. Look for the \"Help\" or \"Support\" section. You can usually find it in the app menu or at the bottom of the website. In the Help/Support section, browse through the available options or use the search bar to find relevant information related to your complaint. If you find a relevant topic or question, click on it to view more details. Look for an option to contact Zomato ....customer support or file a complaint. Click on the \"Contact Us\" or \"Raise a Complaint\" option, and you will be presented with different ways to get in touch with Myntra customer support team. You may have options such as a chat interface, an email form, or a phone number to call. Choose the method that you prefer or that is available. If there is a chat interface, describe your complaint in detail to the customer support representative. Provide necessary details such as your order number, date of order, and specific information about the issue you are facing. Engage in a conversation to discuss your complaint. If there is an email form, fill it out with accurate information. Include your order number, date of order, and a clear description of your complaint. Provide all relevant details and any supporting evidence if available. If there is a phone number provided, call the customer support number and explain your complaint to the representative. Provide all necessary information and be clear about the issue you are facing. Take note of any reference numbers or details provided during the call for future reference. Swiggy's customer support team will review your complaint and work to resolve the issue. They may contact you via email, phone, or through the chat interface to provide updates or seek additional information. Remember to remain calm and polite while filing your complaint. Clear and accurate information will help Swiggy's customer support team understand and address your concern effectively...====hgff From getting on call at 4am and resolving the issue, to asking photos of the order i dint receive, zomato is losing brand value"
}