{
    "id": "15qyvft",
    "title": "My College can't provide placements but wants akhand bharat (msg sent by the dean)",
    "url": "https://i.redd.it/brqc9iafn3ib1.png",
    "selftext": "This isn't a private tier 69 college  it's  one of the most prestigious colleges in Maharashtra .",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692029168.0,
    "convurl": "https://i.redd.it/brqc9iafn3ib1.png",
    "comments": [
        "What kind of power move is that? Lol this is hilarious.",
        "Translation : united india resolution day\n\nThe day is not far when we will make the divided India unbroken again. Independence Day will be celebrated from Gilgit to Garo mountain.\n\nOur country became independent 76 years ago, but the scars of its partition still haunt every Indian. Now we have to realize the resolution of Akhand Bharat. Come on then..\n\nLet us unite so that we always remember the integrity of Mother India.",
        "Bitches be wilding !! LMAO",
        "Marathi manus UP walo ko ane nahi dete....ani tyana akhanda Bharat mangta aahe.",
        "🤣🤣🤣\n\nLosers.",
        "Akhand does not mean united, it means \"undivided,\" which itself is a stupidity because india was never United, to begin with, except of course in the wet dreams of chaddis.",
        "Why doesn't he paint the whole earth orange",
        "You parents collectively should voice it up. This isn’t appropriate.",
        "India has been culturally united since the Aryan migration.",
        "Is Aksai Chin not part of akand bharat anymore?",
        "But this isn't cultural unity that they are talking about rather they are talking about political unity.",
        "You are right. I apologise for misunderstanding the context. 🙏",
        "I think your Dean wants a Rajya Sabha Ticket after his retirement.",
        "Poetic that even in their wildest masturbatory fantasies Kashmir is still divided",
        "Name and shame ofcourse from a nameless account.. twitter pe bhi daaldo",
        "Ridiculous...when you see the education system being indoctrinated, then there's a problem. \n\nAlso this fantasy of akhand Bharat and it's desire is even more concerning.",
        "They already have.",
        "Why don't they add Australia? Are they stupid?",
        "If people are justifying unacademy then this is also justified",
        "I really wish to know how come so many languages are spoken in India itself if it was culturally united. Scientifically speaking, it takes quite a long time for a whole language to develop, the population speaking it needs to be isolated and flourishing properly for such a complicated thing as language to fully take form in writing and speaking. Indian languages are not just spoken differently but written differently too. How come such numerous complex languages developed in India if the people were united culturally for a very long time. They must have been living isolated from each other for a long time, like hundreds of years. The different language regions are so close by too. It's not just different dialects, these are completely different languages. We all know major parts of china and parts of southeast asia have been united for long and were culturally similar, so they have  various dialects of same language. But not in India.  And till few years back most people didn't even understand each other's languages at all, only after communication and traveling has been made easy in recent times that we understand a bit of other state's languages. Till few years back most regions/states even celebrated their own festivals alone, the festivals were celebrated exclusively by the people of that state speaking that language only. It's only now since recent past that most Indian festivals are celebrated across the Country.\nThe only common language which was there between various states was English because English influenced and imposed their culture on everyone, Like all the other colonies of English. When i Look at any other regions of the world, people who had been unified since prehistoric times , they speak same language or similar dialects.",
        "ये लोग तो मुझसे भी बड़े शिटपोस्टर निकले!",
        "Ask him how to make Afghanistan and Pakistan included in akhand bharat and you'll get some amazing answer",
        "This is just sad coming from a Dean of a university. Religion will duck us over big time.",
        "How do you think the Dean got the position?\n\nSame thing in my college, I know for a fact that the Dean is not qualified - based on requirements, she's never been any HOD, not even a professor, and several more qualified and better faculty members were passed over and she was chosen. She's really into all this BJP and RSS stuff, openly tells that all students must attend these events etc.",
        "lol the India in treir \"Akhand Bharat\" doesnt even have POK",
        "Division of languages is due a long period of time and does not necessarily indicate isolation. \n\nFor example, when the Yamanaya tribes in Central Asia existed there was a single language called Indo European. But with enough time this language evolved in different forms and now they are so different that one cannot even understand the other. Likewise, if we study Indian languages from a linguistic standpoint we can easily link languages like Sanskrit to the later developed Prakrit languages. The Dravidian languages also have a common ancestor. This is evident from the fact that even in the times of the Guptas, we could se the study of the Vedas from the valleys of Kashmir to the shores of the South.",
        "Yes u r right he is rss member .",
        "I am also from ,sy student 😂",
        "When I was in school, Akhand Bharat was South Asia + Afghanistan and Myanmar. Now I see they're including all of SE Asia too. Soon enough they'll claim all of Asia lol.",
        "Walchand college h kya Sangli wala?",
        "Yes",
        "You really think anybody will revolt against this ? It's a lost cause",
        "Wait for them to add China in this and thats when the fun will begin!",
        "Jhanda vandan tommorow 🫡",
        "It does include POK...",
        "Tum students log ne kabhi kuch bola nahi on the group or at least to the teachers?",
        "OP act indignant and bring this up on whatsapp",
        "That explains a lot!",
        "Bole toh bole kya ? Aur mai akela kaise jau , aadhe Stufents support krte bache aadhe neutral hai jinko politics mai kuch interest nai sif cgpa badhane Sai matlab hai inhe",
        "Astralaya",
        ">then this is also justified\n\nBloody conquest is justified?",
        "Hmmm.\nLol an sinister idea would to report such msgs. Tere class neutral bacche yeh toh hi sakte hai.",
        "Forget about POK it has whole afganistan and tibet",
        "Astra-laya?",
        "Capturing Myanmar, Malaysia, Thailand, Singapore, and Indonesia. Mazaak chal raha hai kya bhai, though we have superior army, these countries are backed by China, USA and Russia, kya sooch kar logo me joomla faila rhe hai. \n\nPehle apne city to fiz karo, then state ko aur fir desh ko... uske baad chale jaana game of thrones khelne...",
        "Maybe bcoz its the independence day,stupid??",
        "But they won't include the part that China is taking from us",
        ">l Asia existed there was a single language called Indo European. But with enough time this language evolved in different forms and now they are so different that one cannot even understand the other. Likewise, if we study Indian languages from a linguistic standpoint we can easily link languages like Sanskrit to the later developed Prakrit languages. The Dravidian languages also have a common ancestor. This is evident from the fact that even in the times of the Guptas, we could se the study of \n\nReligion does not mean culture. Christianity and Islam is almost everywhere in the world. Bible is studied both in Nepal and Chile does not mean Nepalese and Chilean share same culture.",
        "Do these people realise that Akhanda Bharat will have 700 million Muslims and an open border with Afghanistan?",
        "Yeah you can't handle Muslims here but want to take over Muslim countries lmaooooo.",
        "r/2vikramaditya4u",
        "But I was not talking about culture I was talking about language.",
        "That dude satyapal did talk about something like that in his interview with thapar...",
        "**Theocratism Aint Great My Man**",
        "Moon ko bhi orange paint karke dikhado BC  make akhand solar system",
        "Not if they have their way. \n\nIsn’t the imagery of DurgaMa and the color saffron a dog whistle for hindu domination? 🤷‍♂️",
        "Good luck invading Vietnam, lol",
        "Which one? Coep, Walchand, Pict?",
        "Unemployment leads to people focusing more on things that they can use to show other they are better for example religion, caste, nationalism, language, etc. So that they can benefit from entitlement rather than hard work.\n\nDean is probably not capable of doing anything that's why he is seeking entitlements.",
        "Jobs are temporary,The Indian empire is forever",
        "Get a better clg 🙄",
        "Bhai ye next update mein japan bhi add krdena, I'll feel desi hentai dekh rha hun",
        "Ye saala ladaakh sambhala nahi Jaa Raha. Philippines pe kabja karne chale hain.",
        "Thoda or chalte to Australia bhi akhand bharat mein hi aa jata🤣🤣(/s)",
        "I am not sure, but it could be very likely that that admin is paid...",
        "Lagta hai bhai ne Galt grp pe send krr diya tha",
        "The answer will be - kill everyone there and take the land.",
        "Walchand",
        "He is just expressing his opinions like unacademy teacher.",
        "Irony",
        "when did Maharashtra get partitioned ?",
        "Ane nahi dete ?aur chahiye tereko  local train me teri gand marvane ke liye",
        "Ask your Dean China already took some parts in Leh Ladaku but our Pm unable to show them Laal aankh instead we have increased import of chinese goods.🥲🥲",
        "Is it Walchand?",
        "Where is Thanos when we want him?",
        "Everyone is patriotic until it’s free and fun.\n\nask him to donate 20% annual salary to Center or ask him to send his son to army, he will show his true colour.",
        "Brother understand that, placement will be on  newly added  Akhand Bharat area.",
        "Let them first protect our official border lands from China.",
        "Bhai walchand?? M not at all surprised, when i was there, subtle casteism was prevalent there",
        "Bhai kuch mat kr, walchand me badla lete teacher log, i have been victim of that college casteism , mere samay autonomy ka bhot misuse hota tha, i don't know it currently",
        "Is this Walchand college of engineering? If it is, it's really shameful to promote a political agenda on college groups....",
        "Kone ahe re dean?",
        "That's 'Straya for ya",
        "I’d love to put your dean in a room with a Khalistani supporter and see what happens.",
        "बेरोज़गारी और दक्षिणपंत, name a better duo.",
        "What scars of partition some of these ultra nationalist are talking about? Never seen them discussing the Bengal famine and riots, or helping the families who actually suffered the partition or even study the actual history, culture, geography, demography etc of the people who they intend will soon be part of their United India or is it Just colonialism 2.0?",
        "honestly why the hell people are focusing on this kind of shit and even if all the countries merge and form akhand bharat it will be too unstable to handle",
        "Good luck dominating afghans .The chaddis will have a giant hole in the back of their chaddis",
        "Yes. We are ready to shed war. We are ok with people, soldiers getting killed. But no Sir, I won't go to fight, I will also not send my son's to fight and die. No, I will not shed my blood.\n\nThese people should be forced to see the movie All Quiet on The Western Front.",
        "Why you need college placements ??\n\nAre you not skilled enough to get a job on your own ??",
        "'educated people'",
        "It's easy given the population. The major thing is how will they the Pakistanis and Bangladeshis.",
        "More like Paakhand Bharat",
        "Looks like a recipe for disaster and bloodshed. Irresponsible and dangerous to even propose this idea. It’s mind boggling. Didn’t they put something like this up in the parliament and got scolded by other countries.",
        "They already seem to be claiming the Chinese province Yunnan, apart from Tibet of course.",
        "How can one of the most prestigious colleges in Maharashtra not provide any placements? Is that how bad things have gotten now?",
        "If it's a prestigious college why can't they provide placements?",
        "If akhand bharat is existed today..Muslims will be in majority..ask professor is that ok for him?",
        "chup hoja akhand brahmand bhi exist karta hai",
        "What clg is this lmao, I'm marathi and I wanna know",
        "Interesting that his akhand bharat has separate West Bengal and Bangladesh.",
        "Lebensraum 2023",
        "College is supposed to spoon feed you the placements? Don't you need to be employable to be actually employed.\n\nAlthough the Akhand Bharat thing is wrong.",
        "He might be urban naxal that’s how he became sean and sitting in that chair for last 30 years",
        "All funds are being eaten by appeasement and reservation where is funds for R&D , science and inventions and then jobs . For last 65 years + all money is going to appear 1 sect and their unparalleled breeding and freebies",
        "Even I though so, walchand college of engg😓",
        "Don’t know where he disappeared and calling him to come back daily isn’t it imaginary ?",
        "Jldi visa lelo mitro.",
        "Bro, I studied in WCE ! Kya haal ho gya bhai , ye kya chal rha h !",
        "I wonder what they want to do with akhand bharath",
        "It’s not easy, the soviets, british, Americans all failed to get Afghanistan, so it’s definitely not easy.",
        "I wish they claim they found Shiv Ling on Mars and they can all just fuck off this planet",
        "Because in the post apocalyptic world after mutual assured destruction, the cockroaches that inherit the planet shall name it akhand bharat.",
        "Apart from all the irrational stuff, Why Don't they place bharat mata in the centre of Akhand Bharat? \n\nSaid this because I never saw anyone noticing this except me.",
        "They want the land not the people. In their world view they should either convert, be subservient to a Hinditvavadi government, voluntarily leave... or worse...",
        "Lol The Americans succeeded in their mission which was to wage a non-sense for the profit of elites. And India has many times successfully conquered Afghanistan. I never said conquering Afgajnsitan is easy but it's a child plat compared to controlling Pakistan and Bangladesh given their population.",
        "The two are totally seperate things.",
        "Thats a lot of muslim majority areas 😊\nFor people who hate muslims , they sure do want more muslims in the country.\n\nMaybe they ll send them to Pakistan",
        "Including Indonesia, Pakistan and Bangladesh would make the resulting country muslim majority",
        "It means hum china pe attack krege or baki sb pe b or Jeet b jaege or innocent people maare jaege.Andhbhakto ka brain wash bot ache se kia gaya h",
        "Shut up pumpkin",
        "suraj ko Hanuman ji kha gae they wo to already hai",
        "Its some propaganda by sone party…. Got posted in my home society group as well.",
        "Claim the whole world has bharat",
        "Kya hota tha bhai batao hame",
        "WCE sangli",
        "Walchand College of Engineering?",
        "If only Indians would spend less time fantasizing about imaginary borders and more time cleaning the poop off their streets.",
        "an easy excuse when you couldn't do your job.",
        "I just wonder what the map would look like if the UK started an akhand Britain campaign.",
        "Akhand bharat - Deluison of the highest order. People who want it don't even realise that they won't remain a majority if it actually comes into existence.",
        "And the UK at this rate since Sunak is PM. In fact some have done already",
        "They should try adding some parts of China as well lol",
        "It's was not easy because it was difficult to distinguish b/w civilians and gurrila groups, it's a different case if the goal is total annihilation of all civilian lives.",
        "Har saal placements Kam horhe aur RW propoganda badh rha",
        "The way things are going, we will soon become part of Akhand China.",
        "Where's awrd",
        "Want still more people to wallow in poverty.",
        "Don’t you think actual duty of education institutes is to inculcate thoughts into its students and nothing to do with directly providing job. There are couple of institutes like JNU etc which inculcate thoughts and also provide job opportunities take admission there",
        "त्या डीनला सांग, \"येडझवा आहे तो, असल्या चुत्यांना देशात स्थान नाही.\"",
        "We do not want or need an imperialist India.\n\nDoesn't jive with the idea of vasudhaiva kutumbakam.",
        "No maggi ji have a top secret plan.... You can see his plan on your family whatsapp Group!!",
        "No. Muslim percentage will increase. But still there will be hindu majority",
        "50-50 will be there..consider pakistan + bangladesh",
        "Is it Walchand college ?",
        "Expecting to streach to Australia and Canada soon due to number of Indian students.",
        "No brother.\nHindus alone in India are 112 crore.\nPakistan muslim 23cr, Bangladesh muslims 16cr, Indonesia muslims 27cr. Even if you consider whole population of these countries they don't match alone hindu population of India.",
        "Initially, it used to Mauryan empire + present day India, then it became Mauryan Empire + British India, then Mauryan Empire + British India + Chola Empire. Now it looks like they added Tibet into it as well. Akhand Bharat keeps getting more akhand every year.",
        "Bhau, mera ek internal + external milake 3.5 ghante hua tha with a group of 3 students only. What we all did was protest against a teacher of applied thermo who purposefully failed 3 good students in the last attempt by setting the paper way too hard for graduation students to pass .\nMechanical dept ke protest ke bare me puch liyo kisi se, suicide attempt case tha ek bande ka in 2017,  bach gya fortunately woh mera classmate tha",
        "Akhand Chu*",
        "Its the geography of Afghanistan that makes it so difficult to conquer and the Soviets did try to wipe out the population which just made the resistance more fierce \n\nEven Shah jahan and arungzeb failed despite trying and preparing for a whole decade and having the support of locals",
        "Your dean is a fruitcake.",
        "Ja re photographer",
        "Thailand bhi? kya baat hai sir kya baat waah",
        "Can you share your experiences",
        "While geography does play a huge role that's still not the entire picture, also we shouldn't compare old empires to the nations modern day's military might, soviets while killed more than 2m people there they still were mostly targetting areas where terrors groups were receiving support and civilian casualties by the US which had much stronger military are 10times as less than soviets, US lost because of guerrilla warfare, if we only count capturing capital state as victory than any top 10 military powers will be able to achieve that and hold ground for decades. And with robotic warfare defeating primitive militaries only becomes easier.",
        "Some even include Afghanistan as part of Akhand Bharat",
        "Now they have added Phillipines and Indonesia too.",
        "Could you please point to the timestamps of the referred video?",
        "How is a Dean of a College unemployed?",
        "Walchand?",
        "Its his son's choice if he wants to go in army or not.",
        "/s lagaya kar comment me",
        "So as per these morons, people living east of the Garo Hills (Meghalaya) are not part of Akhand Bharat, contradicting their own stupid kindergarten map.",
        "But by that logic, India shouldn't even be a thing now? Each state should be its own sovereign state (country).\n\nIndia (the subcontinent) was always a united/related entity, whether it be culturally, linguistically, etc.\n\nOf course, we can't go into alternative histories and be fantasizing about invading other countries just to reinstate a glorious past, but there's nothing wrong with per se wanting a united India.",
        "you just arent capable of having a placement, if you could ,you wouldn't be in such clg",
        "\\*Thora aur",
        "Chad dean 🗿",
        "Are you aware that Afghanistan is called the graveyard of empires?",
        "Wow, delusional.",
        "Its fascism \n\nNazi also fantasized like this\n\nTheir was not such thing akhand bharat..\nIndian subcontinent was  ruled by kings and Britishers before independence...\n\n\nAkhand bharat was theory and imagination of savarkar before independence.",
        "What do they think? what year is this?? 1923??",
        "Your dean has acute symptoms of BJP fobia. Keep yourself away from him. \n😁😁",
        "Kaunse college ka dean WhatsApp group pe hai bhai. It’s actually my first time seeing this",
        "Or you can get placement in Bajrang Dal/Gaurakshaks",
        "Group nahi , college ka official announcement channel hai",
        "Going the US way, but reverse, there Indians were killed for land here opposite",
        "Australia as well 😂😂",
        "You forgot 20cr in India, that will make it 86cr, then it will be 112cr H-86cr M.",
        "Which batch you were in?",
        "Which college?",
        "You wouldn't be crying for placements if you deserved them..There's a reason why you are on reddit whining, Always babbling whenever a attempt is made for our cultural heritage..",
        "/s ki kya jarurat hai...\n\nPlacement is just about gaming the system and giving excuses...\n\nYou have to become skilled enough so that you can join whichever company you want, irrrespective of it comes to your college placement or not.",
        "Imposition huh?",
        "Bhagwa dekhte se aag lagjati h...Good enough💀",
        "Just like it was in the earlier times?..",
        "I want what you smoke...\nAkhand Bharat was indeed a reality but not so as shown in the post..Maybe try reading actual history instead of the colonial fuckery u so love",
        "Nah, Pakistan aint theirs either",
        "\"imaginary\" just the word everyone would pick for you",
        "That's a great point in support, studying of same scriptures and following same religion, i agree. But i feel this cant be a sure evidence, because a lot of different cultures around the world have followed same religion and studied same scriptures, even though they are culturally different. Religion spreads like wildfire across the regions and cultures, take for example any part of the world and any religion. And when it comes to origin of languages then all the semitic languages have a common ancestor, yet people speaking them have been culturally different. Same goes with Indo-aryan languages like sanskrit, they are spoken by completely different cultural groups of asia and Europe. I am not a linguistic, haven't studied comparative language sciences, but i have studied Sanskrit and Arabic and i would like to say that they have such similar grammar! Like very very similar grammar rules and word forms, like none other languages i know. Yet the 2 regions haven't been culturally similar. This also begs the question what do you mean by \"culture\", if by culture you mean it's just the Gods they worship then quite possibly most of the world has been culturally same at some point of time, even arabs were polytheistic and had idols, most world worshipped multiple gods and had idols before christianity. But if by \"culture\" we mean the way people lived day to day, clothes they wore, food they ate, festivals they celebrated, marriage and kinship rules, languages they spoke, their architecture, their likes and dislikes, then it's not hard to say who have been culturally United and who have been culturally dissimilar for long.\nAlso, dont you feel isolation is important for a language to develop because if there is no isolation and population has access to an already spoken language which people understand easily then which person would spend unnecessary time learning something such complex thing as a new language? . And we are speaking about old times when people lived day to day, each daylight hour was important and nightly productive activities were minimal because of lack of facilities. Even today people from developed countries dont care to learn a new language because the alternative mother tongue is available to them and they don't care about other languages, eg in Japan, US, UK, Europe. The various different languages from indo-european languages developed as you said exactly because different population groups got isolated from each other. Of course it's natural given how inter-tribe and inter-population wars were so common. Resources were limited, wars were the go-to means for acquiring more land and resources.\nSorry if it's all jumbled up, i wrote hastily but i hope you get what am trying to say. Let me know what do you think about my train of thought....",
        "CHAD CLG! TRYING TO BRING PLACEMENTS BY EXPANDING AREA!",
        "Dude that's not a prestigious college. Chapri OP enginner thinks he's studying at a world class institution lol.",
        "Maybe after a while it would be akhand duniya lol",
        "Cholas influenced the Malays and Indonesia is influenced a lot by the Malays... Duh. \n\nThe modern Indonesia and its independence was in many ways influenced by Nippon (Japan) and since Japan tried to free Indonesia it means they are nationalists just like us. Japan belongs to Akhand Bharat too.",
        "lol",
        "I want what u smoke. \n\nAnd i not readed any fucking colonial history...\n\nBefore Britishers Indian subcontinent and whole of the world was ruled by kings as kingdom..\nInfact Kingdom was just like countries\n\nCountry means sovereign state...\nSo They were also like sovereign state bcz they were independent in everything and in all affairs...\n\nBut when Britishers came they United kingdoms and removed kings form most of the kings and  administered whole of subcontinent as a single country\nBut later broken in many pieces like burma etc.\n\nSo even if u consider india was a single country...\n\nIndia cannot become akhand bharat just by your wish...\n\nNo neighbour country wants to join india..\n\nAnd india has no right over them..\n\nAnd also india will never force them\n\nIts not gone happen even in 100 years\n\n.. so keep dreaming fantasizing and fapping to akhand bharat map..",
        "Dean is unable to provide employment thus he is using this strategy to satiate the unemployed students with false pride. Choti bachhi ho kya?",
        "\"One of the most prestigious colleges of Maharashtra\"\n- IIT Bombay ?",
        "\"One of the most prestigious colleges of Maharashtra\"\n- IIT Bombay ?",
        "Khud bhale hi placement ke liye eligible na ho thikra college walo pe hi fodna hai, nalayak",
        "Tere sath kar diya kya pakhand Bharat ne?",
        "Walchand College of Engineering?",
        "Yes",
        "In the earliest times, all human life originated from Africa.  So paint everything in African colors?",
        "1400years before, There was no existence of the cult Islam...Yet they claim to have ownership of  lands and temples much ancient and make divisions among poeple believers and non-believers..Make sense?\nHow about we accept the fact that hindus have been the most persecuted community and yet are labelled as intolerant if they speak for their own rights...\nAlso, South Africa has a major tribe named khusites..They consider themselves to be descendants of Kush (Son of Ram bhagwan)",
        "I can already see the sense of respect you have towards the nation with what u said abt akhand bharat..\nAnyways, You still are gloryfing the fact that Britishers were the one to unite india..Bharat didn't need anyone to unite it..It was already culturally and ethically united..\nYou think as if Akhand Bharat was a moment started by savarkar? wtf..\nYou talk about kings, yet wont be able to name 5 prominent names..Kings did rule and they ruled with harmony..\nChattarapati Shivaji Maharaj went down south when they needed help..Maharana Pratap sent forces in different \"kingdoms\" for aid..Raja Raja Chola, Rajendra Chola, Bappa Rawal, Prithiviraj Singh Chouhan..\nGoodLuck with the \"United Kingdoms\" theory, Bangladesh, Afghanistan and Pakistan, belonged to bharat and still do...\nBharat has seen mass invasions and suffered for more than 2000 years, Yet we have our cultural heritage and if my scriptures and history straightly indicate the land from Himlaya to Hindu Mahasagar is rightly bharat...Then It is..",
        "Phillipines!! Wow!",
        "Jitna hai utna to sambhalta nahi aur chahiye lakhand bharat",
        "अखंड भारत is the sum of all 7 continents.",
        "What about Madagascar",
        "Can we imagine the outrage if the British wanted all their East India Co. territory back? People who spread messages like this one need to rot in dark cells",
        "It is only called graveyard in modern times I bet lot of kingdoms ruled Afghanistan before modern times.",
        "Din is a real future maker😊",
        "Depending upon the skill level, Even that wouldn't be suitable for y'all..\nProtecting aint something you can do",
        "What majority of students think about this msg?",
        "Just what muslims did in kashmir, what they have been doing in muslim majority areas? Right?",
        "I don't understand. Does any of the public want Akhand Bharat? If any political power is advertising it for votes, then, they're banking on a lot of people wanting it. But why do so many people want Akhand Bharat?",
        "Ironic as it is, that's what Mughal invaders did. Though they didn't kill everyone.",
        "My Dream at 3AM",
        "🤣🤣",
        "14-15 country aur jod dete, waise bhi imagination hai, apni fantasy ko restrict kyun kar rahe hain?",
        "if I was invited, I will attend it and laugh out loud non-stop at whoever is organising this",
        "> Change is the law of life. And those who look only to the past or the present are certain to miss the future\n> --JFK\n[Fun video of the same...](https://youtu.be/8Zv61MWfg20)",
        "Why do akhand bharat people want Afghanistan and Pakistan bruh that would make our country 100x worse, imagine the infighting",
        "Is that WALCHAND COLLEGE OF ENGINEERING?",
        "Maybe he is focusing on Akhand bharat to distract you from his failure to provide jobs. \n\nAt least that’s the case for his overlords.",
        "I haven't advocated for a lynch, my statement was to refute the M majority even if Akhand Bharat happens.",
        "Let me check which times we're in.\n\nYup, we're in modern times. At least I am.",
        "couldn't even enter into south and northeast India and dreaming of conquering SEA and Aussie 💀. USA will invade and kill Modi for his dictatorship.",
        "First get some skills 😂\nNearly every worthy student is placed in a good company even in the time of recession.\n\nAnd the highest package goes up to 20?62 LPA in a city like Sangli\n\nWhat a hypocrisy...\nAlso he ain't the dean 😂😂 😂\n(tip: know about yourself and your college)",
        "Average marathi☝🏻🤣( I am gujarati and I have seen my various marathi friends doing extremist shit on insta and WhatsApp)",
        "Ask him how will they manage extra muslim population?",
        ">GoodLuck with the \"United Kingdoms\" theory, Bangladesh, Afghanistan and Pakistan, belonged to bharat and still do...\n\nThis is why this theory of akhand Bharat sounds out of ordinary. You said they were culturally (not politically ) similar 2000 years ago (lol...might as well return current European nations back to Rome). \n\nIndividuals believing in this theory want Afghanistan, Bangladesh and other nations \"back\" because they were culturally similar 2000 years ago. That means if they they got the chance, they will want it back politically by actually invading and \"reclaiming\" lost land. \n\nThe kings you have selected have all fought against each to spread their influence. Sure they had their harmonic days, but they surely had their war days too. \n\nRaja Raja chola: fought against Chalukya dynasty (another empire within present day India) to implement his empire. \n\nRajendra chola: fought against Western Chalukya Empire and helped reached his father's (above) ambitions to it's Zenith. \n\nBappa Rawal: a vassal of the Mori ruler Manuraja decided to set his differences aside and joined the anti Arab confederacy to fend of Arabs invasion from north. \n\nPrithviraj Singh Chouhan: Noted for defeating Chandelas (small kingdom of its own). Also set apart his differences and joined the rajput princes to take on the Ghurid army. \n\nAnd finally, Sivaji: he was one king you can credit by spending most of his time fending off \"foreign\" invaders despite having conflicts and later defeating his half brother (and his army). \n\nSo yes...all these kings you listed had their empires/kingdoms which did get  into conflicts with other smaller regional empires/kingdoms within the akhand Bharat borders who shared common cultural values.\n\nThey became \"united\" time to time when it came to foreign invaders. Some of them even sided with foreign invaders as well to have an upper hand over their regional rivals (who btw shared those common cultural/religious values). \n\nConflicts between those kings/rulers/princes remained. Bharat was in conflict despite having its moments of harmony too. Empires came, and vanished and then came again and vanished...until the foreign forces showed up. And when they showed up, Bharat (the landscape) still fought among itself, sometimes even partnering with foreign forces. \n\nIt was all about power no matter where these kings came from (Afghanistan or core India). \n\nThe only thing that you can stand on about akhand Bharat map is the fact that Hinduism (that too forms of it) spread throughout that region.  \n\nAnd the other thing I can agree on is that British weren't here to unite India, but rather seek division (divide and conquer).",
        "I think everyone has their own priorities \nLike you need job and your dean Aakhand Bharat\nNothing wrong in that just make efforts to reach close to your goals",
        "Bhosdika",
        "Can I ask a question? Agar india jaisa koi desh  tha hi nahi toh Nehru and gandhi ji ne kisko Britishers se ajaad karaya?",
        "We called most of north eastern Chinese .",
        "I agree with most of what you said..\nBut if we look poltically, Even today india is not politically united. Look whats happening in bengal, karnataka and tamil nadu..A nation can never be politically united when there's a element in society which still wants further division or partition..The situation in bengal is so bad that presidential rule must be implemented..\n\nIndia has already done away with 1/3rd of its land through partition, All of them which are now currently islamic. And yet, In the name of secularism we still are repeating the same mistakes...\n\nWith the idea of akhand bharat, which seems impossible to many.. Atleast the woke shitheads will realise their true history and heritage and potentially change their mindsets about single sided \"brotherhood\" which they call secularism..\n\nFor fk's sake, Hindus have are fighting in their own nation in  courts for the land that belongs to them and then we have WAQF board claiming entire villages to be theirs..\nWe have had enough of the europeans, britishers and terrorists (islam)..\n\nEuropeans wiped almost half the population off the planet and now speak of \"human rights\"..I dont even want to talk about the things cult-islam has done..\n\nIt's about time people know whay \"actually\" happened and is happening..The notion of akhand bharat was true, and still stands today if it encourages the upcoming generation to stand their ground without giving upto anyone's demands any longer and rightfully claim whats ours...\n\nCountless lives have been sacrificed (currently, too) for protecting our motherland and it surely wasnt for us to preach love about the same people who perpetrated the entire scheme and still wish to do the same given the chance...Just look at muslim majority areas",
        "Is it Walchand college?",
        "I have seen some photos extending it up to even west Europe lol",
        ">which still wants further division or partition..\n\nWell currently people are too focused on religious divide, rather than talking about unity over INDIA. \n\n>India has already done away with 1/3rd of its land through partition, All of them which are now currently islamic. And yet, In the name of secularism we still are repeating the same mistakes...\n\nPakistan and Bangladesh if that is what you mean. Afghanistan does not see Indians eye to eye. They consider themselves a Steppe people. Matter of fact, Turks occasionally try to claim Afghanistan...turks also have a andh Baharat concept of their own. So do Persians. So do Russians, Israelis, so did Nazi Germany..now it's India. \n\nAnd yes secularism is crucial for India's success. India is made up of various large tribes of people (like always). People argue what about the Hindus of Pakistan? That doesn't mean we start treating minorities like shit too. That's an illogical argument. It will take India back to terrible turmoil actually. So we have to follow through with this. \n\nMy problem is with the nationalist religiously driven individuals of India. If they get the opportunity, they will rip the constitution apart. \n\n\n>With the idea of akhand bharat, which seems impossible to many.. Atleast the woke shitheads will realise their true history and heritage and potentially change their mindsets about single sided \"brotherhood\" which they call secularism..\n\nIt will remain impossible if followers of akhand Bharat start discriminating towards people who don't agree with them. Sorry man, I see a stroke of Nationalism in your comment as well. You are looking for an India that doesn't have any minorities, that's a stretch. Commit a mass genocide maybe? Is that what will make it work? That's messed up too. So through secularism, removing religion from government level is a start. Practice the culture and religion at home. There's many examples where religion and politics hasn't worked for many nations. India can't follow that path. \n\n\n\n>For fk's sake, Hindus have are fighting in their own nation in courts for the land that belongs to them and then we have WAQF board claiming entire villages to be theirs.. We have had enough of the europeans, britishers and terrorists (islam)..\n\n>Europeans wiped almost half the population off the planet and now speak of \"human rights\"..I dont even want to talk about the things cult-islam has done..\n\nSeeing some hate here. Hindus are doing just fine. There are some regions in India where they are facing their challenges. So are minorities...I can make the same argument for them too. They are losing housing, can't find work, being beaten up or lynched by mobs. 🤷🏽‍♂️. \n\nAnd Hindus are doing just fine overseas as well. Including in places like middle East where they are minting dealing with these \"cults\" and sending the rewards of their fruit back to homeland. \n\nYour entire argument so far is, get rid of these cult Muslims/minorities and remove any sort of European influence. That's impossible because rn we speak their language, we dress like them, we act like them, we enjoy their food, we have bunch of Indians willing to give up their nationality and willing to work in these Muslim dominant areas too. \n\nThe woke individuals you are angry at don't want bloodshed because India's history is full of it. It's like repeating history, repeating the same mistakes that were made before. Actually we will be playing by the British game book, divide and conquer. \n\nI understand your frustration towards these groups. But your frustration is leading to hate. And that hate is what some of these Muslims or extremist groups cultivate as well. Driven by national and religious pride leading to violence later. We can't go down their level. I can already see that happening in India  slowly along with justifying abuse/blood towards them. That's a little sick if you ask me. \n\nPeople have been conquered all throughout history. There isn't one place in this world that hasn't gone through abuse of sorts. Abuse by its own people too (which my initial argument was and you agreed). So we can't like say oh...2000 years ago we had peace. Did we really? \n\nI suggest working hard, doing good for your people vs taking arms against another group. You may might as well put on an orange shirt and join Bajrang dal at this point if hate/dislike for others blinds you. Not worth it if you ask me.",
        "wtf",
        "So they want approximate 80 corores of Muslims too !\nIs it practical?",
        "If you really think india is more capable of power projection in Afghanistan then the soviet Union who was neighbouring Afghanistan at that time then i am sorry but you are stupid,indian forces are defensive and its extremely expensive to supply an army in foreign lands something india can't afford",
        "Kay? Walchand cha kissa aahe ha? 🤦‍♂️",
        "Ya",
        "bhai mere college ke group mein bhi placements nahi ati but aise chutiyappe nahi karte college wale",
        "We want such dean in every college in India!",
        "desh badal raha hai has a new meaning!",
        "Blud I also go the same clg.....😂😂😂",
        "Dean ko bolo:\n\nBharat bnega akhand,\nAap lelo mere L**d",
        "Who asked you to go to such a college in the first place?",
        "I really don't understand this RW fantasy wet dream of \"Akhand Bhaarat\". I mean, you already hate the Muslims of India, not to mention all the others who dare disagree with you, what do you think would happen exactly when you combine add Bangladesh, Pakistan and Afghanistan into mix. I mean, why on earth would you want the Taliban or the barren Afghanistan be a part of your country.",
        "Dean Missed Japan",
        "Yeah modi ki Tarah pehle me bharat ke liye ye kar dunga woh kar dunga phir election ke baad Bharat walo ko kuch aata hi nahi kuch nahi ho sakta unka",
        "Bcz Britishers were ruling here and running their govt by force...\n\nAlso people kingdoms (princely states) were also hating thier kings bcz they used to take heavy taxes and exploit people...\n\nWhen Britishers came here due to nationalism we become United ...",
        "They already did. There's video on YouTube in which an idiot says Russia and China bhi hai akhand Bharat me.",
        "Without the necessary change and development in the country all this patriotism is just waste piece of shit!",
        "US spent about 67% of Indias entire GDP on afghanistan and still got dog piled by them, what makes you think we'll be able to take them out? Afghanistan is an empirical grave, no one can take them.",
        "He's right. Job milegi to tum apni life me aage badhoge.. fir Akhand Bharat ke lie kaam ni kr paaoge. Ye KARTAVYAKAAL hai bandhu, tumhe apne Hindu hone ka praman dena hoga ek kar sevak, gobar rakshak bnke🔥",
        "seems inappropriate for a nonpolitical position person to preach on political issues. Akhand Bharat is an eventuality even tough people may think its an election gimmick. Akhand Bharat might not be visible for a considerable amount of time but we'll reach that milestone down the line. Have faith.",
        "Lol college will surely provide placement to Bjp IT cell. And all students will becomeb their bots abusing and harassing anyone who tries to give them some logic.",
        "If your dean's Akhand Bharat Dream is true, please let me know as well. Will try international placements",
        "Do they know that there are more small islands in Polynesia?",
        "You can't even say anything to these people, maybe even as management because it's clear the dean got into the position through outside power",
        "Even if they want to do it, why do they want so many muslims in their Akhan or maybe they have a way to not include them xD",
        "Deeply traumatized xD. They can't handle ladakh, they want the whole subcontinent.",
        "Hopefully but these people get an erection by showing off their fanatasies",
        "He believes in akhand Bharat during Ram times where there were supposedly monsters too. No point arguing with these people.",
        "Won't do anything. They do this publicly cause no one dares to say anything.",
        "I'm from this college and one day the Dean of our college in his was flexing on the amount of work he did for RSS and also taunted people who were anti rss",
        "WHEN and who",
        "Last time Germany and Japan tried that and well....",
        "The map shows captured j and k with Pakistan/Afghanistan and china.. kudos to akhand bharat",
        "Why does it look like \"Akhand Bharat\" is growing in size?\n\nI remember when it would include Burma but nothing East of it",
        "DHARAVI MAANUSH",
        "Yaa college groups ko only assignment & imp  notices ke liye hota hai yeh kab se shuru hua hai ..vro....",
        "Itna sach mat bol Bhai",
        "What a TPO??",
        "Hello fellow walchandite..feels bad to see such downfall of prestigious institution... once upon a time we were pride of pachim maharashtra\n\nDo people still study under trees surrounding football pitch ??"
    ],
    "cleaned_text": "college cant provide placements wants akhand bharat msg sent dean isnt private tier college one prestigious colleges maharashtra ",
    "cleaned_title": "college cant provide placements wants akhand bharat msg sent dean",
    "cleaned_selftext": "isnt private tier college one prestigious colleges maharashtra",
    "cleaned_comments": "kind power move lol hilarious translation united india resolution day day far make divided india unbroken independence day celebrated gilgit garo mountain country became independent years ago scars partition still haunt every indian realize resolution akhand bharat come let us unite always remember integrity mother india bitches wilding lmao marathi manus walo ko ane nahi deteani tyana akhanda bharat mangta aahe losers akhand mean united means undivided stupidity india never united begin except course wet dreams chaddis doesnt paint whole earth orange parents collectively voice isnt appropriate india culturally united since aryan migration aksai chin part akand bharat anymore isnt cultural unity talking rather talking political unity right apologise misunderstanding context think dean wants rajya sabha ticket retirement poetic even wildest masturbatory fantasies kashmir still divided name shame ofcourse nameless account twitter pe bhi daaldo ridiculouswhen see education system indoctrinated theres problem also fantasy akhand bharat desire even concerning already dont add australia stupid people justifying unacademy also justified really wish know come many languages spoken india culturally united scientifically speaking takes quite long time whole language develop population speaking needs isolated flourishing properly complicated thing language fully take form writing speaking indian languages spoken differently written differently come numerous complex languages developed india people united culturally long time must living isolated long time like hundreds years different language regions close different dialects completely different languages know major parts china parts southeast asia united long culturally similar various dialects language india till years back people didnt even understand others languages communication traveling made easy recent times understand bit states languages till years back regionsstates even celebrated festivals alone festivals celebrated exclusively people state speaking language since recent past indian festivals celebrated across country common language various states english english influenced imposed culture everyone like colonies english look regions world people unified since prehistoric times speak language similar dialects ask make afghanistan pakistan included akhand bharat youll get amazing answer sad coming dean university religion duck us big time think dean got position thing college know fact dean qualified based requirements shes never hod even professor several qualified better faculty members passed chosen shes really bjp rss stuff openly tells students must attend events etc lol india treir akhand bharat doesnt even pok division languages due long period time necessarily indicate isolation example yamanaya tribes central asia existed single language called indo european enough time language evolved different forms different one even understand likewise study indian languages linguistic standpoint easily link languages like sanskrit later developed prakrit languages dravidian languages also common ancestor evident fact even times guptas could se study vedas valleys kashmir shores south yes u r right rss member also sy student school akhand bharat south asia afghanistan myanmar see theyre including se asia soon enough theyll claim asia lol walchand college h kya sangli wala yes really think anybody revolt lost cause wait add china thats fun begin jhanda vandan tommorow include pok tum students log ne kabhi kuch bola nahi group least teachers op act indignant bring whatsapp explains lot bole toh bole kya aur mai akela kaise jau aadhe stufents support krte bache aadhe neutral hai jinko politics mai kuch interest nai sif cgpa badhane sai matlab hai inhe astralaya also justified bloody conquest justified hmmm lol sinister idea would report msgs tere class neutral bacche yeh toh hi sakte hai forget pok whole afganistan tibet astralaya capturing myanmar malaysia thailand singapore indonesia mazaak chal raha hai kya bhai though superior army countries backed china usa russia kya sooch kar logo joomla faila rhe hai pehle apne city fiz karo state ko aur fir desh ko uske baad chale jaana game thrones khelne maybe bcoz independence daystupid wont include part china taking us l asia existed single language called indo european enough time language evolved different forms different one even understand likewise study indian languages linguistic standpoint easily link languages like sanskrit later developed prakrit languages dravidian languages also common ancestor evident fact even times guptas could se study religion mean culture christianity islam almost everywhere world bible studied nepal chile mean nepalese chilean share culture people realise akhanda bharat million muslims open border afghanistan yeah cant handle muslims want take muslim countries lmaooooo rvikramadityau talking culture talking language dude satyapal talk something like interview thapar theocratism aint great man moon ko bhi orange paint karke dikhado bc make akhand solar system way isnt imagery durgama color saffron dog whistle hindu domination good luck invading vietnam lol one coep walchand pict unemployment leads people focusing things use show better example religion caste nationalism language etc benefit entitlement rather hard work dean probably capable anything thats seeking entitlements jobs temporarythe indian empire forever get better clg bhai ye next update mein japan bhi add krdena ill feel desi hentai dekh rha hun ye saala ladaakh sambhala nahi jaa raha philippines pe kabja karne chale hain thoda chalte australia bhi akhand bharat mein hi aa jatas sure could likely admin paid lagta hai bhai ne galt grp pe send krr diya tha answer kill everyone take land walchand expressing opinions like unacademy teacher irony maharashtra get partitioned ane nahi dete aur chahiye tereko local train teri gand marvane ke liye ask dean china already took parts leh ladaku pm unable show laal aankh instead increased import chinese goods walchand thanos want everyone patriotic free fun ask donate annual salary center ask send son army show true colour brother understand placement newly added akhand bharat area let first protect official border lands china bhai walchand surprised subtle casteism prevalent bhai kuch mat kr walchand badla lete teacher log victim college casteism mere samay autonomy ka bhot misuse hota tha dont know currently walchand college engineering really shameful promote political agenda college groups kone ahe dean thats straya ya id love put dean room khalistani supporter see happens name better duo scars partition ultra nationalist talking never seen discussing bengal famine riots helping families actually suffered partition even study actual history culture geography demography etc people intend soon part united india colonialism honestly hell people focusing kind shit even countries merge form akhand bharat unstable handle good luck dominating afghans chaddis giant hole back chaddis yes ready shed war ok people soldiers getting killed sir wont go fight also send sons fight die shed blood people forced see movie quiet western front need college placements skilled enough get job educated people easy given population major thing pakistanis bangladeshis like paakhand bharat looks like recipe disaster bloodshed irresponsible dangerous even propose idea mind boggling didnt put something like parliament got scolded countries already seem claiming chinese province yunnan apart tibet course one prestigious colleges maharashtra provide placements bad things gotten prestigious college cant provide placements akhand bharat existed todaymuslims majorityask professor ok chup hoja akhand brahmand bhi exist karta hai clg lmao im marathi wan na know interesting akhand bharat separate west bengal bangladesh lebensraum college supposed spoon feed placements dont need employable actually employed although akhand bharat thing wrong might urban naxal thats became sean sitting chair last years funds eaten appeasement reservation funds rd science inventions jobs last years money going appear sect unparalleled breeding freebies even though walchand college engg dont know disappeared calling come back daily isnt imaginary jldi visa lelo mitro bro studied wce kya haal ho gya bhai ye kya chal rha h wonder want akhand bharath easy soviets british americans failed get afghanistan definitely easy wish claim found shiv ling mars fuck planet post apocalyptic world mutual assured destruction cockroaches inherit planet shall name akhand bharat apart irrational stuff dont place bharat mata centre akhand bharat said never saw anyone noticing except want land people world view either convert subservient hinditvavadi government voluntarily leave worse lol americans succeeded mission wage nonsense profit elites india many times successfully conquered afghanistan never said conquering afgajnsitan easy child plat compared controlling pakistan bangladesh given population two totally seperate things thats lot muslim majority areas people hate muslims sure want muslims country maybe send pakistan including indonesia pakistan bangladesh would make resulting country muslim majority means hum china pe attack krege baki sb pe b jeet b jaege innocent people maare jaegeandhbhakto ka brain wash bot ache se kia gaya h shut pumpkin suraj ko hanuman ji kha gae wo already hai propaganda sone party got posted home society group well claim whole world bharat kya hota tha bhai batao hame wce sangli walchand college engineering indians would spend less time fantasizing imaginary borders time cleaning poop streets easy excuse couldnt job wonder map would look like uk started akhand britain campaign akhand bharat deluison highest order people want dont even realise wont remain majority actually comes existence uk rate since sunak pm fact done already try adding parts china well lol easy difficult distinguish bw civilians gurrila groups different case goal total annihilation civilian lives har saal placements kam horhe aur rw propoganda badh rha way things going soon become part akhand china wheres awrd want still people wallow poverty dont think actual duty education institutes inculcate thoughts students nothing directly providing job couple institutes like jnu etc inculcate thoughts also provide job opportunities take admission want need imperialist india doesnt jive idea vasudhaiva kutumbakam maggi ji top secret plan see plan family whatsapp group muslim percentage increase still hindu majority thereconsider pakistan bangladesh walchand college expecting streach australia canada soon due number indian students brother hindus alone india crore pakistan muslim cr bangladesh muslims cr indonesia muslims cr even consider whole population countries dont match alone hindu population india initially used mauryan empire present day india became mauryan empire british india mauryan empire british india chola empire looks like added tibet well akhand bharat keeps getting akhand every year bhau mera ek internal external milake ghante hua tha group students protest teacher applied thermo purposefully failed good students last attempt setting paper way hard graduation students pass mechanical dept ke protest ke bare puch liyo kisi se suicide attempt case tha ek bande ka bach gya fortunately woh mera classmate tha akhand chu geography afghanistan makes difficult conquer soviets try wipe population made resistance fierce even shah jahan arungzeb failed despite trying preparing whole decade support locals dean fruitcake ja photographer thailand bhi kya baat hai sir kya baat waah share experiences geography play huge role thats still entire picture also shouldnt compare old empires nations modern days military might soviets killed people still mostly targetting areas terrors groups receiving support civilian casualties us much stronger military times less soviets us lost guerrilla warfare count capturing capital state victory top military powers able achieve hold ground decades robotic warfare defeating primitive militaries becomes easier even include afghanistan part akhand bharat added phillipines indonesia could please point timestamps referred video dean college unemployed walchand sons choice wants go army lagaya kar comment per morons people living east garo hills meghalaya part akhand bharat contradicting stupid kindergarten map logic india shouldnt even thing state sovereign state country india subcontinent always unitedrelated entity whether culturally linguistically etc course cant go alternative histories fantasizing invading countries reinstate glorious past theres nothing wrong per se wanting united india arent capable placement could wouldnt clg thora aur chad dean aware afghanistan called graveyard empires wow delusional fascism nazi also fantasized like thing akhand bharat indian subcontinent ruled kings britishers independence akhand bharat theory imagination savarkar independence think year dean acute symptoms bjp fobia keep away kaunse college ka dean whatsapp group pe hai bhai actually first time seeing get placement bajrang dalgaurakshaks group nahi college ka official announcement channel hai going us way reverse indians killed land opposite australia well forgot cr india make cr cr hcr batch college wouldnt crying placements deserved themtheres reason reddit whining always babbling whenever attempt made cultural heritage ki kya jarurat hai placement gaming system giving excuses become skilled enough join whichever company want irrrespective comes college placement imposition huh bhagwa dekhte se aag lagjati hgood enough like earlier times want smoke akhand bharat indeed reality shown postmaybe try reading actual history instead colonial fuckery u love nah pakistan aint either imaginary word everyone would pick thats great point support studying scriptures following religion agree feel cant sure evidence lot different cultures around world followed religion studied scriptures even though culturally different religion spreads like wildfire across regions cultures take example part world religion comes origin languages semitic languages common ancestor yet people speaking culturally different goes indoaryan languages like sanskrit spoken completely different cultural groups asia europe linguistic havent studied comparative language sciences studied sanskrit arabic would like say similar grammar like similar grammar rules word forms like none languages know yet regions havent culturally similar also begs question mean culture culture mean gods worship quite possibly world culturally point time even arabs polytheistic idols world worshipped multiple gods idols christianity culture mean way people lived day day clothes wore food ate festivals celebrated marriage kinship rules languages spoke architecture likes dislikes hard say culturally united culturally dissimilar long also dont feel isolation important language develop isolation population access already spoken language people understand easily person would spend unnecessary time learning something complex thing new language speaking old times people lived day day daylight hour important nightly productive activities minimal lack facilities even today people developed countries dont care learn new language alternative mother tongue available dont care languages eg japan us uk europe various different languages indoeuropean languages developed said exactly different population groups got isolated course natural given intertribe interpopulation wars common resources limited wars goto means acquiring land resources sorry jumbled wrote hastily hope get trying say let know think train thought chad clg trying bring placements expanding area dude thats prestigious college chapri op enginner thinks hes studying world class institution lol maybe would akhand duniya lol cholas influenced malays indonesia influenced lot malays duh modern indonesia independence many ways influenced nippon japan since japan tried free indonesia means nationalists like us japan belongs akhand bharat lol want u smoke readed fucking colonial history britishers indian subcontinent whole world ruled kings kingdom infact kingdom like countries country means sovereign state also like sovereign state bcz independent everything affairs britishers came united kingdoms removed kings form kings administered whole subcontinent single country later broken many pieces like burma etc even u consider india single country india become akhand bharat wish neighbour country wants join india india right also india never force gone happen even years keep dreaming fantasizing fapping akhand bharat map dean unable provide employment thus using strategy satiate unemployed students false pride choti bachhi ho kya one prestigious colleges maharashtra iit bombay one prestigious colleges maharashtra iit bombay khud bhale hi placement ke liye eligible na ho thikra college walo pe hi fodna hai nalayak tere sath kar diya kya pakhand bharat ne walchand college engineering yes earliest times human life originated africa paint everything african colors years existence cult islamyet claim ownership lands temples much ancient make divisions among poeple believers nonbelieversmake sense accept fact hindus persecuted community yet labelled intolerant speak rights also south africa major tribe named khusitesthey consider descendants kush son ram bhagwan already see sense respect towards nation u said abt akhand bharat anyways still gloryfing fact britishers one unite indiabharat didnt need anyone unite itit already culturally ethically united think akhand bharat moment started savarkar wtf talk kings yet wont able name prominent nameskings rule ruled harmony chattarapati shivaji maharaj went south needed helpmaharana pratap sent forces different kingdoms aidraja raja chola rajendra chola bappa rawal prithiviraj singh chouhan goodluck united kingdoms theory bangladesh afghanistan pakistan belonged bharat still bharat seen mass invasions suffered years yet cultural heritage scriptures history straightly indicate land himlaya hindu mahasagar rightly bharatthen phillipines wow jitna hai utna sambhalta nahi aur chahiye lakhand bharat sum continents madagascar imagine outrage british wanted east india co territory back people spread messages like one need rot dark cells called graveyard modern times bet lot kingdoms ruled afghanistan modern times din real future maker depending upon skill level even wouldnt suitable yall protecting aint something majority students think msg muslims kashmir muslim majority areas right dont understand public want akhand bharat political power advertising votes theyre banking lot people wanting many people want akhand bharat ironic thats mughal invaders though didnt kill everyone dream country aur jod dete waise bhi imagination hai apni fantasy ko restrict kyun kar rahe hain invited attend laugh loud nonstop whoever organising change law life look past present certain miss future jfk fun video samehttpsyoutubezvmwfg akhand bharat people want afghanistan pakistan bruh would make country x worse imagine infighting walchand college engineering maybe focusing akhand bharat distract failure provide jobs least thats case overlords havent advocated lynch statement refute majority even akhand bharat happens let check times yup modern times least couldnt even enter south northeast india dreaming conquering sea aussie usa invade kill modi dictatorship first get skills nearly every worthy student placed good company even time recession highest package goes lpa city like sangli hypocrisy also aint dean tip know college average marathi gujarati seen various marathi friends extremist shit insta whatsapp ask manage extra muslim population goodluck united kingdoms theory bangladesh afghanistan pakistan belonged bharat still theory akhand bharat sounds ordinary said culturally politically similar years ago lolmight well return current european nations back rome individuals believing theory want afghanistan bangladesh nations back culturally similar years ago means got chance want back politically actually invading reclaiming lost land kings selected fought spread influence sure harmonic days surely war days raja raja chola fought chalukya dynasty another empire within present day india implement empire rajendra chola fought western chalukya empire helped reached fathers ambitions zenith bappa rawal vassal mori ruler manuraja decided set differences aside joined anti arab confederacy fend arabs invasion north prithviraj singh chouhan noted defeating chandelas small kingdom also set apart differences joined rajput princes take ghurid army finally sivaji one king credit spending time fending foreign invaders despite conflicts later defeating half brother army yesall kings listed empireskingdoms get conflicts smaller regional empireskingdoms within akhand bharat borders shared common cultural values became united time time came foreign invaders even sided foreign invaders well upper hand regional rivals btw shared common culturalreligious values conflicts kingsrulersprinces remained bharat conflict despite moments harmony empires came vanished came vanisheduntil foreign forces showed showed bharat landscape still fought among sometimes even partnering foreign forces power matter kings came afghanistan core india thing stand akhand bharat map fact hinduism forms spread throughout region thing agree british werent unite india rather seek division divide conquer think everyone priorities like need job dean aakhand bharat nothing wrong make efforts reach close goals bhosdika ask question agar india jaisa koi desh tha hi nahi toh nehru gandhi ji ne kisko britishers se ajaad karaya called north eastern chinese agree said look poltically even today india politically united look whats happening bengal karnataka tamil nadua nation never politically united theres element society still wants division partitionthe situation bengal bad presidential rule must implemented india already done away rd land partition currently islamic yet name secularism still repeating mistakes idea akhand bharat seems impossible many atleast woke shitheads realise true history heritage potentially change mindsets single sided brotherhood call secularism fks sake hindus fighting nation courts land belongs waqf board claiming entire villages enough europeans britishers terrorists islam europeans wiped almost half population planet speak human rightsi dont even want talk things cultislam done time people know whay actually happened happeningthe notion akhand bharat true still stands today encourages upcoming generation stand ground without giving upto anyones demands longer rightfully claim whats countless lives sacrificed currently protecting motherland surely wasnt us preach love people perpetrated entire scheme still wish given chancejust look muslim majority areas walchand college seen photos extending even west europe lol still wants division partition well currently people focused religious divide rather talking unity india india already done away rd land partition currently islamic yet name secularism still repeating mistakes pakistan bangladesh mean afghanistan see indians eye eye consider steppe people matter fact turks occasionally try claim afghanistanturks also andh baharat concept persians russians israelis nazi germanynow india yes secularism crucial indias success india made various large tribes people like always people argue hindus pakistan doesnt mean start treating minorities like shit thats illogical argument take india back terrible turmoil actually follow problem nationalist religiously driven individuals india get opportunity rip constitution apart idea akhand bharat seems impossible many atleast woke shitheads realise true history heritage potentially change mindsets single sided brotherhood call secularism remain impossible followers akhand bharat start discriminating towards people dont agree sorry man see stroke nationalism comment well looking india doesnt minorities thats stretch commit mass genocide maybe make work thats messed secularism removing religion government level start practice culture religion home theres many examples religion politics hasnt worked many nations india cant follow path fks sake hindus fighting nation courts land belongs waqf board claiming entire villages enough europeans britishers terrorists islam europeans wiped almost half population planet speak human rightsi dont even want talk things cultislam done seeing hate hindus fine regions india facing challenges minoritiesi make argument losing housing cant find work beaten lynched mobs hindus fine overseas well including places like middle east minting dealing cults sending rewards fruit back homeland entire argument far get rid cult muslimsminorities remove sort european influence thats impossible rn speak language dress like act like enjoy food bunch indians willing give nationality willing work muslim dominant areas woke individuals angry dont want bloodshed indias history full like repeating history repeating mistakes made actually playing british game book divide conquer understand frustration towards groups frustration leading hate hate muslims extremist groups cultivate well driven national religious pride leading violence later cant go level already see happening india slowly along justifying abuseblood towards thats little sick ask people conquered throughout history isnt one place world hasnt gone abuse sorts abuse people initial argument agreed cant like say oh years ago peace really suggest working hard good people vs taking arms another group may might well put orange shirt join bajrang dal point hatedislike others blinds worth ask wtf want approximate corores muslims practical really think india capable power projection afghanistan soviet union neighbouring afghanistan time sorry stupidindian forces defensive extremely expensive supply army foreign lands something india cant afford kay walchand cha kissa aahe ha ya bhai mere college ke group mein bhi placements nahi ati aise chutiyappe nahi karte college wale want dean every college india desh badal raha hai new meaning blud also go clg dean ko bolo bharat bnega akhand aap lelo mere ld asked go college first place really dont understand rw fantasy wet dream akhand bhaarat mean already hate muslims india mention others dare disagree think would happen exactly combine add bangladesh pakistan afghanistan mix mean earth would want taliban barren afghanistan part country dean missed japan yeah modi ki tarah pehle bharat ke liye ye kar dunga woh kar dunga phir election ke baad bharat walo ko kuch aata hi nahi kuch nahi ho sakta unka bcz britishers ruling running govt force also people kingdoms princely states also hating thier kings bcz used take heavy taxes exploit people britishers came due nationalism become united already theres video youtube idiot says russia china bhi hai akhand bharat without necessary change development country patriotism waste piece shit us spent indias entire gdp afghanistan still got dog piled makes think well able take afghanistan empirical grave one take hes right job milegi tum apni life aage badhoge fir akhand bharat ke lie kaam ni kr paaoge ye kartavyakaal hai bandhu tumhe apne hindu hone ka praman dena hoga ek kar sevak gobar rakshak bnke seems inappropriate nonpolitical position person preach political issues akhand bharat eventuality even tough people may think election gimmick akhand bharat might visible considerable amount time well reach milestone line faith lol college surely provide placement bjp cell students becomeb bots abusing harassing anyone tries give logic deans akhand bharat dream true please let know well try international placements know small islands polynesia cant even say anything people maybe even management clear dean got position outside power even want want many muslims akhan maybe way include xd deeply traumatized xd cant handle ladakh want whole subcontinent hopefully people get erection showing fanatasies believes akhand bharat ram times supposedly monsters point arguing people wont anything publicly cause one dares say anything im college one day dean college flexing amount work rss also taunted people anti rss last time germany japan tried well map shows captured j k pakistanafghanistan china kudos akhand bharat look like akhand bharat growing size remember would include burma nothing east dharavi maanush yaa college groups ko assignment imp notices ke liye hota hai yeh kab se shuru hua hai vro itna sach mat bol bhai tpo hello fellow walchanditefeels bad see downfall prestigious institution upon time pride pachim maharashtra people still study trees surrounding football pitch",
    "light_cleaned_title": "My College can't provide placements but wants akhand bharat (msg sent by the dean)",
    "light_cleaned_selftext": "This isn't a private tier 69 college it's one of the most prestigious colleges in Maharashtra .",
    "light_cleaned_comments": "What kind of power move is that? Lol this is hilarious. Translation : united india resolution day The day is not far when we will make the divided India unbroken again. Independence Day will be celebrated from Gilgit to Garo mountain. Our country became independent 76 years ago, but the scars of its partition still haunt every Indian. Now we have to realize the resolution of Akhand Bharat. Come on then.. Let us unite so that we always remember the integrity of Mother India. Bitches be wilding !! LMAO Marathi manus UP walo ko ane nahi dete....ani tyana akhanda Bharat mangta aahe. 🤣🤣🤣 Losers. Akhand does not mean united, it means \"undivided,\" which itself is a stupidity because india was never United, to begin with, except of course in the wet dreams of chaddis. Why doesn't he paint the whole earth orange You parents collectively should voice it up. This isn’t appropriate. India has been culturally united since the Aryan migration. Is Aksai Chin not part of akand bharat anymore? But this isn't cultural unity that they are talking about rather they are talking about political unity. You are right. I apologise for misunderstanding the context. 🙏 I think your Dean wants a Rajya Sabha Ticket after his retirement. Poetic that even in their wildest masturbatory fantasies Kashmir is still divided Name and shame ofcourse from a nameless account.. twitter pe bhi daaldo Ridiculous...when you see the education system being indoctrinated, then there's a problem. Also this fantasy of akhand Bharat and it's desire is even more concerning. They already have. Why don't they add Australia? Are they stupid? If people are justifying unacademy then this is also justified I really wish to know how come so many languages are spoken in India itself if it was culturally united. Scientifically speaking, it takes quite a long time for a whole language to develop, the population speaking it needs to be isolated and flourishing properly for such a complicated thing as language to fully take form in writing and speaking. Indian languages are not just spoken differently but written differently too. How come such numerous complex languages developed in India if the people were united culturally for a very long time. They must have been living isolated from each other for a long time, like hundreds of years. The different language regions are so close by too. It's not just different dialects, these are completely different languages. We all know major parts of china and parts of southeast asia have been united for long and were culturally similar, so they have various dialects of same language. But not in India. And till few years back most people didn't even understand each other's languages at all, only after communication and traveling has been made easy in recent times that we understand a bit of other state's languages. Till few years back most regions/states even celebrated their own festivals alone, the festivals were celebrated exclusively by the people of that state speaking that language only. It's only now since recent past that most Indian festivals are celebrated across the Country. The only common language which was there between various states was English because English influenced and imposed their culture on everyone, Like all the other colonies of English. When i Look at any other regions of the world, people who had been unified since prehistoric times , they speak same language or similar dialects. ये लोग तो मुझसे भी बड़े शिटपोस्टर निकले! Ask him how to make Afghanistan and Pakistan included in akhand bharat and you'll get some amazing answer This is just sad coming from a Dean of a university. Religion will duck us over big time. How do you think the Dean got the position? Same thing in my college, I know for a fact that the Dean is not qualified - based on requirements, she's never been any HOD, not even a professor, and several more qualified and better faculty members were passed over and she was chosen. She's really into all this BJP and RSS stuff, openly tells that all students must attend these events etc. lol the India in treir \"Akhand Bharat\" doesnt even have POK Division of languages is due a long period of time and does not necessarily indicate isolation. For example, when the Yamanaya tribes in Central Asia existed there was a single language called Indo European. But with enough time this language evolved in different forms and now they are so different that one cannot even understand the other. Likewise, if we study Indian languages from a linguistic standpoint we can easily link languages like Sanskrit to the later developed Prakrit languages. The Dravidian languages also have a common ancestor. This is evident from the fact that even in the times of the Guptas, we could se the study of the Vedas from the valleys of Kashmir to the shores of the South. Yes u r right he is rss member . I am also from ,sy student 😂 When I was in school, Akhand Bharat was South Asia + Afghanistan and Myanmar. Now I see they're including all of SE Asia too. Soon enough they'll claim all of Asia lol. Walchand college h kya Sangli wala? Yes You really think anybody will revolt against this ? It's a lost cause Wait for them to add China in this and thats when the fun will begin! Jhanda vandan tommorow 🫡 It does include POK... Tum students log ne kabhi kuch bola nahi on the group or at least to the teachers? OP act indignant and bring this up on whatsapp That explains a lot! Bole toh bole kya ? Aur mai akela kaise jau , aadhe Stufents support krte bache aadhe neutral hai jinko politics mai kuch interest nai sif cgpa badhane Sai matlab hai inhe Astralaya >then this is also justified Bloody conquest is justified? Hmmm. Lol an sinister idea would to report such msgs. Tere class neutral bacche yeh toh hi sakte hai. Forget about POK it has whole afganistan and tibet Astra-laya? Capturing Myanmar, Malaysia, Thailand, Singapore, and Indonesia. Mazaak chal raha hai kya bhai, though we have superior army, these countries are backed by China, USA and Russia, kya sooch kar logo me joomla faila rhe hai. Pehle apne city to fiz karo, then state ko aur fir desh ko... uske baad chale jaana game of thrones khelne... Maybe bcoz its the independence day,stupid?? But they won't include the part that China is taking from us >l Asia existed there was a single language called Indo European. But with enough time this language evolved in different forms and now they are so different that one cannot even understand the other. Likewise, if we study Indian languages from a linguistic standpoint we can easily link languages like Sanskrit to the later developed Prakrit languages. The Dravidian languages also have a common ancestor. This is evident from the fact that even in the times of the Guptas, we could se the study of Religion does not mean culture. Christianity and Islam is almost everywhere in the world. Bible is studied both in Nepal and Chile does not mean Nepalese and Chilean share same culture. Do these people realise that Akhanda Bharat will have 700 million Muslims and an open border with Afghanistan? Yeah you can't handle Muslims here but want to take over Muslim countries lmaooooo. r/2vikramaditya4u But I was not talking about culture I was talking about language. That dude satyapal did talk about something like that in his interview with thapar... **Theocratism Aint Great My Man** Moon ko bhi orange paint karke dikhado BC make akhand solar system Not if they have their way. Isn’t the imagery of DurgaMa and the color saffron a dog whistle for hindu domination? 🤷‍♂️ Good luck invading Vietnam, lol Which one? Coep, Walchand, Pict? Unemployment leads to people focusing more on things that they can use to show other they are better for example religion, caste, nationalism, language, etc. So that they can benefit from entitlement rather than hard work. Dean is probably not capable of doing anything that's why he is seeking entitlements. Jobs are temporary,The Indian empire is forever Get a better clg 🙄 Bhai ye next update mein japan bhi add krdena, I'll feel desi hentai dekh rha hun Ye saala ladaakh sambhala nahi Jaa Raha. Philippines pe kabja karne chale hain. Thoda or chalte to Australia bhi akhand bharat mein hi aa jata🤣🤣(/s) I am not sure, but it could be very likely that that admin is paid... Lagta hai bhai ne Galt grp pe send krr diya tha The answer will be - kill everyone there and take the land. Walchand He is just expressing his opinions like unacademy teacher. Irony when did Maharashtra get partitioned ? Ane nahi dete ?aur chahiye tereko local train me teri gand marvane ke liye Ask your Dean China already took some parts in Leh Ladaku but our Pm unable to show them Laal aankh instead we have increased import of chinese goods.🥲🥲 Is it Walchand? Where is Thanos when we want him? Everyone is patriotic until it’s free and fun. ask him to donate 20% annual salary to Center or ask him to send his son to army, he will show his true colour. Brother understand that, placement will be on newly added Akhand Bharat area. Let them first protect our official border lands from China. Bhai walchand?? M not at all surprised, when i was there, subtle casteism was prevalent there Bhai kuch mat kr, walchand me badla lete teacher log, i have been victim of that college casteism , mere samay autonomy ka bhot misuse hota tha, i don't know it currently Is this Walchand college of engineering? If it is, it's really shameful to promote a political agenda on college groups.... Kone ahe re dean? That's 'Straya for ya I’d love to put your dean in a room with a Khalistani supporter and see what happens. बेरोज़गारी और दक्षिणपंत, name a better duo. What scars of partition some of these ultra nationalist are talking about? Never seen them discussing the Bengal famine and riots, or helping the families who actually suffered the partition or even study the actual history, culture, geography, demography etc of the people who they intend will soon be part of their United India or is it Just colonialism 2.0? honestly why the hell people are focusing on this kind of shit and even if all the countries merge and form akhand bharat it will be too unstable to handle Good luck dominating afghans .The chaddis will have a giant hole in the back of their chaddis Yes. We are ready to shed war. We are ok with people, soldiers getting killed. But no Sir, I won't go to fight, I will also not send my son's to fight and die. No, I will not shed my blood. These people should be forced to see the movie All Quiet on The Western Front. Why you need college placements ?? Are you not skilled enough to get a job on your own ?? 'educated people' It's easy given the population. The major thing is how will they the Pakistanis and Bangladeshis. More like Paakhand Bharat Looks like a recipe for disaster and bloodshed. Irresponsible and dangerous to even propose this idea. It’s mind boggling. Didn’t they put something like this up in the parliament and got scolded by other countries. They already seem to be claiming the Chinese province Yunnan, apart from Tibet of course. How can one of the most prestigious colleges in Maharashtra not provide any placements? Is that how bad things have gotten now? If it's a prestigious college why can't they provide placements? If akhand bharat is existed today..Muslims will be in majority..ask professor is that ok for him? chup hoja akhand brahmand bhi exist karta hai What clg is this lmao, I'm marathi and I wanna know Interesting that his akhand bharat has separate West Bengal and Bangladesh. Lebensraum 2023 College is supposed to spoon feed you the placements? Don't you need to be employable to be actually employed. Although the Akhand Bharat thing is wrong. He might be urban naxal that’s how he became sean and sitting in that chair for last 30 years All funds are being eaten by appeasement and reservation where is funds for R&D , science and inventions and then jobs . For last 65 years + all money is going to appear 1 sect and their unparalleled breeding and freebies Even I though so, walchand college of engg😓 Don’t know where he disappeared and calling him to come back daily isn’t it imaginary ? Jldi visa lelo mitro. Bro, I studied in WCE ! Kya haal ho gya bhai , ye kya chal rha h ! I wonder what they want to do with akhand bharath It’s not easy, the soviets, british, Americans all failed to get Afghanistan, so it’s definitely not easy. I wish they claim they found Shiv Ling on Mars and they can all just fuck off this planet Because in the post apocalyptic world after mutual assured destruction, the cockroaches that inherit the planet shall name it akhand bharat. Apart from all the irrational stuff, Why Don't they place bharat mata in the centre of Akhand Bharat? Said this because I never saw anyone noticing this except me. They want the land not the people. In their world view they should either convert, be subservient to a Hinditvavadi government, voluntarily leave... or worse... Lol The Americans succeeded in their mission which was to wage a non-sense for the profit of elites. And India has many times successfully conquered Afghanistan. I never said conquering Afgajnsitan is easy but it's a child plat compared to controlling Pakistan and Bangladesh given their population. The two are totally seperate things. Thats a lot of muslim majority areas 😊 For people who hate muslims , they sure do want more muslims in the country. Maybe they ll send them to Pakistan Including Indonesia, Pakistan and Bangladesh would make the resulting country muslim majority It means hum china pe attack krege or baki sb pe b or Jeet b jaege or innocent people maare jaege.Andhbhakto ka brain wash bot ache se kia gaya h Shut up pumpkin suraj ko Hanuman ji kha gae they wo to already hai Its some propaganda by sone party…. Got posted in my home society group as well. Claim the whole world has bharat Kya hota tha bhai batao hame WCE sangli Walchand College of Engineering? If only Indians would spend less time fantasizing about imaginary borders and more time cleaning the poop off their streets. an easy excuse when you couldn't do your job. I just wonder what the map would look like if the UK started an akhand Britain campaign. Akhand bharat - Deluison of the highest order. People who want it don't even realise that they won't remain a majority if it actually comes into existence. And the UK at this rate since Sunak is PM. In fact some have done already They should try adding some parts of China as well lol It's was not easy because it was difficult to distinguish b/w civilians and gurrila groups, it's a different case if the goal is total annihilation of all civilian lives. Har saal placements Kam horhe aur RW propoganda badh rha The way things are going, we will soon become part of Akhand China. Where's awrd Want still more people to wallow in poverty. Don’t you think actual duty of education institutes is to inculcate thoughts into its students and nothing to do with directly providing job. There are couple of institutes like JNU etc which inculcate thoughts and also provide job opportunities take admission there त्या डीनला सांग, \"येडझवा आहे तो, असल्या चुत्यांना देशात स्थान नाही.\" We do not want or need an imperialist India. Doesn't jive with the idea of vasudhaiva kutumbakam. No maggi ji have a top secret plan.... You can see his plan on your family whatsapp Group!! No. Muslim percentage will increase. But still there will be hindu majority 50-50 will be there..consider pakistan + bangladesh Is it Walchand college ? Expecting to streach to Australia and Canada soon due to number of Indian students. No brother. Hindus alone in India are 112 crore. Pakistan muslim 23cr, Bangladesh muslims 16cr, Indonesia muslims 27cr. Even if you consider whole population of these countries they don't match alone hindu population of India. Initially, it used to Mauryan empire + present day India, then it became Mauryan Empire + British India, then Mauryan Empire + British India + Chola Empire. Now it looks like they added Tibet into it as well. Akhand Bharat keeps getting more akhand every year. Bhau, mera ek internal + external milake 3.5 ghante hua tha with a group of 3 students only. What we all did was protest against a teacher of applied thermo who purposefully failed 3 good students in the last attempt by setting the paper way too hard for graduation students to pass . Mechanical dept ke protest ke bare me puch liyo kisi se, suicide attempt case tha ek bande ka in 2017, bach gya fortunately woh mera classmate tha Akhand Chu* Its the geography of Afghanistan that makes it so difficult to conquer and the Soviets did try to wipe out the population which just made the resistance more fierce Even Shah jahan and arungzeb failed despite trying and preparing for a whole decade and having the support of locals Your dean is a fruitcake. Ja re photographer Thailand bhi? kya baat hai sir kya baat waah Can you share your experiences While geography does play a huge role that's still not the entire picture, also we shouldn't compare old empires to the nations modern day's military might, soviets while killed more than 2m people there they still were mostly targetting areas where terrors groups were receiving support and civilian casualties by the US which had much stronger military are 10times as less than soviets, US lost because of guerrilla warfare, if we only count capturing capital state as victory than any top 10 military powers will be able to achieve that and hold ground for decades. And with robotic warfare defeating primitive militaries only becomes easier. Some even include Afghanistan as part of Akhand Bharat Now they have added Phillipines and Indonesia too. Could you please point to the timestamps of the referred video? How is a Dean of a College unemployed? Walchand? Its his son's choice if he wants to go in army or not. /s lagaya kar comment me So as per these morons, people living east of the Garo Hills (Meghalaya) are not part of Akhand Bharat, contradicting their own stupid kindergarten map. But by that logic, India shouldn't even be a thing now? Each state should be its own sovereign state (country). India (the subcontinent) was always a united/related entity, whether it be culturally, linguistically, etc. Of course, we can't go into alternative histories and be fantasizing about invading other countries just to reinstate a glorious past, but there's nothing wrong with per se wanting a united India. you just arent capable of having a placement, if you could ,you wouldn't be in such clg \\*Thora aur Chad dean 🗿 Are you aware that Afghanistan is called the graveyard of empires? Wow, delusional. Its fascism Nazi also fantasized like this Their was not such thing akhand bharat.. Indian subcontinent was ruled by kings and Britishers before independence... Akhand bharat was theory and imagination of savarkar before independence. What do they think? what year is this?? 1923?? Your dean has acute symptoms of BJP fobia. Keep yourself away from him. 😁😁 Kaunse college ka dean WhatsApp group pe hai bhai. It’s actually my first time seeing this Or you can get placement in Bajrang Dal/Gaurakshaks Group nahi , college ka official announcement channel hai Going the US way, but reverse, there Indians were killed for land here opposite Australia as well 😂😂 You forgot 20cr in India, that will make it 86cr, then it will be 112cr H-86cr M. Which batch you were in? Which college? You wouldn't be crying for placements if you deserved them..There's a reason why you are on reddit whining, Always babbling whenever a attempt is made for our cultural heritage.. /s ki kya jarurat hai... Placement is just about gaming the system and giving excuses... You have to become skilled enough so that you can join whichever company you want, irrrespective of it comes to your college placement or not. Imposition huh? Bhagwa dekhte se aag lagjati h...Good enough💀 Just like it was in the earlier times?.. I want what you smoke... Akhand Bharat was indeed a reality but not so as shown in the post..Maybe try reading actual history instead of the colonial fuckery u so love Nah, Pakistan aint theirs either \"imaginary\" just the word everyone would pick for you That's a great point in support, studying of same scriptures and following same religion, i agree. But i feel this cant be a sure evidence, because a lot of different cultures around the world have followed same religion and studied same scriptures, even though they are culturally different. Religion spreads like wildfire across the regions and cultures, take for example any part of the world and any religion. And when it comes to origin of languages then all the semitic languages have a common ancestor, yet people speaking them have been culturally different. Same goes with Indo-aryan languages like sanskrit, they are spoken by completely different cultural groups of asia and Europe. I am not a linguistic, haven't studied comparative language sciences, but i have studied Sanskrit and Arabic and i would like to say that they have such similar grammar! Like very very similar grammar rules and word forms, like none other languages i know. Yet the 2 regions haven't been culturally similar. This also begs the question what do you mean by \"culture\", if by culture you mean it's just the Gods they worship then quite possibly most of the world has been culturally same at some point of time, even arabs were polytheistic and had idols, most world worshipped multiple gods and had idols before christianity. But if by \"culture\" we mean the way people lived day to day, clothes they wore, food they ate, festivals they celebrated, marriage and kinship rules, languages they spoke, their architecture, their likes and dislikes, then it's not hard to say who have been culturally United and who have been culturally dissimilar for long. Also, dont you feel isolation is important for a language to develop because if there is no isolation and population has access to an already spoken language which people understand easily then which person would spend unnecessary time learning something such complex thing as a new language? . And we are speaking about old times when people lived day to day, each daylight hour was important and nightly productive activities were minimal because of lack of facilities. Even today people from developed countries dont care to learn a new language because the alternative mother tongue is available to them and they don't care about other languages, eg in Japan, US, UK, Europe. The various different languages from indo-european languages developed as you said exactly because different population groups got isolated from each other. Of course it's natural given how inter-tribe and inter-population wars were so common. Resources were limited, wars were the go-to means for acquiring more land and resources. Sorry if it's all jumbled up, i wrote hastily but i hope you get what am trying to say. Let me know what do you think about my train of thought.... CHAD CLG! TRYING TO BRING PLACEMENTS BY EXPANDING AREA! Dude that's not a prestigious college. Chapri OP enginner thinks he's studying at a world class institution lol. Maybe after a while it would be akhand duniya lol Cholas influenced the Malays and Indonesia is influenced a lot by the Malays... Duh. The modern Indonesia and its independence was in many ways influenced by Nippon (Japan) and since Japan tried to free Indonesia it means they are nationalists just like us. Japan belongs to Akhand Bharat too. lol I want what u smoke. And i not readed any fucking colonial history... Before Britishers Indian subcontinent and whole of the world was ruled by kings as kingdom.. Infact Kingdom was just like countries Country means sovereign state... So They were also like sovereign state bcz they were independent in everything and in all affairs... But when Britishers came they United kingdoms and removed kings form most of the kings and administered whole of subcontinent as a single country But later broken in many pieces like burma etc. So even if u consider india was a single country... India cannot become akhand bharat just by your wish... No neighbour country wants to join india.. And india has no right over them.. And also india will never force them Its not gone happen even in 100 years .. so keep dreaming fantasizing and fapping to akhand bharat map.. Dean is unable to provide employment thus he is using this strategy to satiate the unemployed students with false pride. Choti bachhi ho kya? \"One of the most prestigious colleges of Maharashtra\" - IIT Bombay ? \"One of the most prestigious colleges of Maharashtra\" - IIT Bombay ? Khud bhale hi placement ke liye eligible na ho thikra college walo pe hi fodna hai, nalayak Tere sath kar diya kya pakhand Bharat ne? Walchand College of Engineering? Yes In the earliest times, all human life originated from Africa. So paint everything in African colors? 1400years before, There was no existence of the cult Islam...Yet they claim to have ownership of lands and temples much ancient and make divisions among poeple believers and non-believers..Make sense? How about we accept the fact that hindus have been the most persecuted community and yet are labelled as intolerant if they speak for their own rights... Also, South Africa has a major tribe named khusites..They consider themselves to be descendants of Kush (Son of Ram bhagwan) I can already see the sense of respect you have towards the nation with what u said abt akhand bharat.. Anyways, You still are gloryfing the fact that Britishers were the one to unite india..Bharat didn't need anyone to unite it..It was already culturally and ethically united.. You think as if Akhand Bharat was a moment started by savarkar? wtf.. You talk about kings, yet wont be able to name 5 prominent names..Kings did rule and they ruled with harmony.. Chattarapati Shivaji Maharaj went down south when they needed help..Maharana Pratap sent forces in different \"kingdoms\" for aid..Raja Raja Chola, Rajendra Chola, Bappa Rawal, Prithiviraj Singh Chouhan.. GoodLuck with the \"United Kingdoms\" theory, Bangladesh, Afghanistan and Pakistan, belonged to bharat and still do... Bharat has seen mass invasions and suffered for more than 2000 years, Yet we have our cultural heritage and if my scriptures and history straightly indicate the land from Himlaya to Hindu Mahasagar is rightly bharat...Then It is.. Phillipines!! Wow! Jitna hai utna to sambhalta nahi aur chahiye lakhand bharat अखंड भारत is the sum of all 7 continents. What about Madagascar Can we imagine the outrage if the British wanted all their East India Co. territory back? People who spread messages like this one need to rot in dark cells It is only called graveyard in modern times I bet lot of kingdoms ruled Afghanistan before modern times. Din is a real future maker😊 Depending upon the skill level, Even that wouldn't be suitable for y'all.. Protecting aint something you can do What majority of students think about this msg? Just what muslims did in kashmir, what they have been doing in muslim majority areas? Right? I don't understand. Does any of the public want Akhand Bharat? If any political power is advertising it for votes, then, they're banking on a lot of people wanting it. But why do so many people want Akhand Bharat? Ironic as it is, that's what Mughal invaders did. Though they didn't kill everyone. My Dream at 3AM 🤣🤣 14-15 country aur jod dete, waise bhi imagination hai, apni fantasy ko restrict kyun kar rahe hain? if I was invited, I will attend it and laugh out loud non-stop at whoever is organising this > Change is the law of life. And those who look only to the past or the present are certain to miss the future > --JFK [Fun video of the same...](https://youtu.be/8Zv61MWfg20) Why do akhand bharat people want Afghanistan and Pakistan bruh that would make our country 100x worse, imagine the infighting Is that WALCHAND COLLEGE OF ENGINEERING? Maybe he is focusing on Akhand bharat to distract you from his failure to provide jobs. At least that’s the case for his overlords. I haven't advocated for a lynch, my statement was to refute the M majority even if Akhand Bharat happens. Let me check which times we're in. Yup, we're in modern times. At least I am. couldn't even enter into south and northeast India and dreaming of conquering SEA and Aussie 💀. USA will invade and kill Modi for his dictatorship. First get some skills 😂 Nearly every worthy student is placed in a good company even in the time of recession. And the highest package goes up to 20?62 LPA in a city like Sangli What a hypocrisy... Also he ain't the dean 😂😂 😂 (tip: know about yourself and your college) Average marathi☝🏻🤣( I am gujarati and I have seen my various marathi friends doing extremist shit on insta and WhatsApp) Ask him how will they manage extra muslim population? >GoodLuck with the \"United Kingdoms\" theory, Bangladesh, Afghanistan and Pakistan, belonged to bharat and still do... This is why this theory of akhand Bharat sounds out of ordinary. You said they were culturally (not politically ) similar 2000 years ago (lol...might as well return current European nations back to Rome). Individuals believing in this theory want Afghanistan, Bangladesh and other nations \"back\" because they were culturally similar 2000 years ago. That means if they they got the chance, they will want it back politically by actually invading and \"reclaiming\" lost land. The kings you have selected have all fought against each to spread their influence. Sure they had their harmonic days, but they surely had their war days too. Raja Raja chola: fought against Chalukya dynasty (another empire within present day India) to implement his empire. Rajendra chola: fought against Western Chalukya Empire and helped reached his father's (above) ambitions to it's Zenith. Bappa Rawal: a vassal of the Mori ruler Manuraja decided to set his differences aside and joined the anti Arab confederacy to fend of Arabs invasion from north. Prithviraj Singh Chouhan: Noted for defeating Chandelas (small kingdom of its own). Also set apart his differences and joined the rajput princes to take on the Ghurid army. And finally, Sivaji: he was one king you can credit by spending most of his time fending off \"foreign\" invaders despite having conflicts and later defeating his half brother (and his army). So yes...all these kings you listed had their empires/kingdoms which did get into conflicts with other smaller regional empires/kingdoms within the akhand Bharat borders who shared common cultural values. They became \"united\" time to time when it came to foreign invaders. Some of them even sided with foreign invaders as well to have an upper hand over their regional rivals (who btw shared those common cultural/religious values). Conflicts between those kings/rulers/princes remained. Bharat was in conflict despite having its moments of harmony too. Empires came, and vanished and then came again and vanished...until the foreign forces showed up. And when they showed up, Bharat (the landscape) still fought among itself, sometimes even partnering with foreign forces. It was all about power no matter where these kings came from (Afghanistan or core India). The only thing that you can stand on about akhand Bharat map is the fact that Hinduism (that too forms of it) spread throughout that region. And the other thing I can agree on is that British weren't here to unite India, but rather seek division (divide and conquer). I think everyone has their own priorities Like you need job and your dean Aakhand Bharat Nothing wrong in that just make efforts to reach close to your goals Bhosdika Can I ask a question? Agar india jaisa koi desh tha hi nahi toh Nehru and gandhi ji ne kisko Britishers se ajaad karaya? We called most of north eastern Chinese . I agree with most of what you said.. But if we look poltically, Even today india is not politically united. Look whats happening in bengal, karnataka and tamil nadu..A nation can never be politically united when there's a element in society which still wants further division or partition..The situation in bengal is so bad that presidential rule must be implemented.. India has already done away with 1/3rd of its land through partition, All of them which are now currently islamic. And yet, In the name of secularism we still are repeating the same mistakes... With the idea of akhand bharat, which seems impossible to many.. Atleast the woke shitheads will realise their true history and heritage and potentially change their mindsets about single sided \"brotherhood\" which they call secularism.. For fk's sake, Hindus have are fighting in their own nation in courts for the land that belongs to them and then we have WAQF board claiming entire villages to be theirs.. We have had enough of the europeans, britishers and terrorists (islam).. Europeans wiped almost half the population off the planet and now speak of \"human rights\"..I dont even want to talk about the things cult-islam has done.. It's about time people know whay \"actually\" happened and is happening..The notion of akhand bharat was true, and still stands today if it encourages the upcoming generation to stand their ground without giving upto anyone's demands any longer and rightfully claim whats ours... Countless lives have been sacrificed (currently, too) for protecting our motherland and it surely wasnt for us to preach love about the same people who perpetrated the entire scheme and still wish to do the same given the chance...Just look at muslim majority areas Is it Walchand college? I have seen some photos extending it up to even west Europe lol >which still wants further division or partition.. Well currently people are too focused on religious divide, rather than talking about unity over INDIA. >India has already done away with 1/3rd of its land through partition, All of them which are now currently islamic. And yet, In the name of secularism we still are repeating the same mistakes... Pakistan and Bangladesh if that is what you mean. Afghanistan does not see Indians eye to eye. They consider themselves a Steppe people. Matter of fact, Turks occasionally try to claim Afghanistan...turks also have a andh Baharat concept of their own. So do Persians. So do Russians, Israelis, so did Nazi Germany..now it's India. And yes secularism is crucial for India's success. India is made up of various large tribes of people (like always). People argue what about the Hindus of Pakistan? That doesn't mean we start treating minorities like shit too. That's an illogical argument. It will take India back to terrible turmoil actually. So we have to follow through with this. My problem is with the nationalist religiously driven individuals of India. If they get the opportunity, they will rip the constitution apart. >With the idea of akhand bharat, which seems impossible to many.. Atleast the woke shitheads will realise their true history and heritage and potentially change their mindsets about single sided \"brotherhood\" which they call secularism.. It will remain impossible if followers of akhand Bharat start discriminating towards people who don't agree with them. Sorry man, I see a stroke of Nationalism in your comment as well. You are looking for an India that doesn't have any minorities, that's a stretch. Commit a mass genocide maybe? Is that what will make it work? That's messed up too. So through secularism, removing religion from government level is a start. Practice the culture and religion at home. There's many examples where religion and politics hasn't worked for many nations. India can't follow that path. >For fk's sake, Hindus have are fighting in their own nation in courts for the land that belongs to them and then we have WAQF board claiming entire villages to be theirs.. We have had enough of the europeans, britishers and terrorists (islam).. >Europeans wiped almost half the population off the planet and now speak of \"human rights\"..I dont even want to talk about the things cult-islam has done.. Seeing some hate here. Hindus are doing just fine. There are some regions in India where they are facing their challenges. So are minorities...I can make the same argument for them too. They are losing housing, can't find work, being beaten up or lynched by mobs. 🤷🏽‍♂️. And Hindus are doing just fine overseas as well. Including in places like middle East where they are minting dealing with these \"cults\" and sending the rewards of their fruit back to homeland. Your entire argument so far is, get rid of these cult Muslims/minorities and remove any sort of European influence. That's impossible because rn we speak their language, we dress like them, we act like them, we enjoy their food, we have bunch of Indians willing to give up their nationality and willing to work in these Muslim dominant areas too. The woke individuals you are angry at don't want bloodshed because India's history is full of it. It's like repeating history, repeating the same mistakes that were made before. Actually we will be playing by the British game book, divide and conquer. I understand your frustration towards these groups. But your frustration is leading to hate. And that hate is what some of these Muslims or extremist groups cultivate as well. Driven by national and religious pride leading to violence later. We can't go down their level. I can already see that happening in India slowly along with justifying abuse/blood towards them. That's a little sick if you ask me. People have been conquered all throughout history. There isn't one place in this world that hasn't gone through abuse of sorts. Abuse by its own people too (which my initial argument was and you agreed). So we can't like say oh...2000 years ago we had peace. Did we really? I suggest working hard, doing good for your people vs taking arms against another group. You may might as well put on an orange shirt and join Bajrang dal at this point if hate/dislike for others blinds you. Not worth it if you ask me. wtf So they want approximate 80 corores of Muslims too ! Is it practical? If you really think india is more capable of power projection in Afghanistan then the soviet Union who was neighbouring Afghanistan at that time then i am sorry but you are stupid,indian forces are defensive and its extremely expensive to supply an army in foreign lands something india can't afford Kay? Walchand cha kissa aahe ha? 🤦‍♂️ Ya bhai mere college ke group mein bhi placements nahi ati but aise chutiyappe nahi karte college wale We want such dean in every college in India! desh badal raha hai has a new meaning! Blud I also go the same clg.....😂😂😂 Dean ko bolo: Bharat bnega akhand, Aap lelo mere L**d Who asked you to go to such a college in the first place? I really don't understand this RW fantasy wet dream of \"Akhand Bhaarat\". I mean, you already hate the Muslims of India, not to mention all the others who dare disagree with you, what do you think would happen exactly when you combine add Bangladesh, Pakistan and Afghanistan into mix. I mean, why on earth would you want the Taliban or the barren Afghanistan be a part of your country. Dean Missed Japan Yeah modi ki Tarah pehle me bharat ke liye ye kar dunga woh kar dunga phir election ke baad Bharat walo ko kuch aata hi nahi kuch nahi ho sakta unka Bcz Britishers were ruling here and running their govt by force... Also people kingdoms (princely states) were also hating thier kings bcz they used to take heavy taxes and exploit people... When Britishers came here due to nationalism we become United ... They already did. There's video on YouTube in which an idiot says Russia and China bhi hai akhand Bharat me. Without the necessary change and development in the country all this patriotism is just waste piece of shit! US spent about 67% of Indias entire GDP on afghanistan and still got dog piled by them, what makes you think we'll be able to take them out? Afghanistan is an empirical grave, no one can take them. He's right. Job milegi to tum apni life me aage badhoge.. fir Akhand Bharat ke lie kaam ni kr paaoge. Ye KARTAVYAKAAL hai bandhu, tumhe apne Hindu hone ka praman dena hoga ek kar sevak, gobar rakshak bnke🔥 seems inappropriate for a nonpolitical position person to preach on political issues. Akhand Bharat is an eventuality even tough people may think its an election gimmick. Akhand Bharat might not be visible for a considerable amount of time but we'll reach that milestone down the line. Have faith. Lol college will surely provide placement to Bjp IT cell. And all students will becomeb their bots abusing and harassing anyone who tries to give them some logic. If your dean's Akhand Bharat Dream is true, please let me know as well. Will try international placements Do they know that there are more small islands in Polynesia? You can't even say anything to these people, maybe even as management because it's clear the dean got into the position through outside power Even if they want to do it, why do they want so many muslims in their Akhan or maybe they have a way to not include them xD Deeply traumatized xD. They can't handle ladakh, they want the whole subcontinent. Hopefully but these people get an erection by showing off their fanatasies He believes in akhand Bharat during Ram times where there were supposedly monsters too. No point arguing with these people. Won't do anything. They do this publicly cause no one dares to say anything. I'm from this college and one day the Dean of our college in his was flexing on the amount of work he did for RSS and also taunted people who were anti rss WHEN and who Last time Germany and Japan tried that and well.... The map shows captured j and k with Pakistan/Afghanistan and china.. kudos to akhand bharat Why does it look like \"Akhand Bharat\" is growing in size? I remember when it would include Burma but nothing East of it DHARAVI MAANUSH Yaa college groups ko only assignment & imp notices ke liye hota hai yeh kab se shuru hua hai ..vro.... Itna sach mat bol Bhai What a TPO?? Hello fellow walchandite..feels bad to see such downfall of prestigious institution... once upon a time we were pride of pachim maharashtra Do people still study under trees surrounding football pitch ??"
}