{
    "id": "1h0ce6f",
    "title": "India's middle-class is having a meltdown: Report reveals 3 key threats to its survival ",
    "url": "https://www.businesstoday.in/personal-finance/investment/story/indias-middle-class-is-having-a-meltdown-marcellus-report-reveals-3-key-threats-to-its-survival-455118-2024-11-26",
    "selftext": "Elevated food inflation, high interest rates, and shrinking discretionary income have made it harder for this segment to maintain previous spending levels.",
    "flair": "Policy/Economy",
    "score": 16,
    "num_comments": 12,
    "created_utc": 1732629241.0,
    "convurl": "https://external-preview.redd.it/X-JkPIni0EJvgn0uo4WOLL1CmsXDpKL6OgHLLUGfqkw.jpg?auto=webp&s=eee9069356e4af75e8dce35815bd7a9729a246ca",
    "comments": [
        "According to a report by Marcellus Investment Managers, the slowdown is rooted in three primary factors: technological disruptions, a cyclical economic downturn, and deteriorating household balance sheets.",
        "The No 1 threat to Middle Class survival is Nirmala Sitharaman and her finance ministry think thank.",
        "most people dont even understand the meaning of middle class everyone from my maid whom i pay 2k a month to my boss (who makes 70 lpa) calls themselves middle class, the lifestyles of both extremes haven't changed much so they dont care and the middle of the graph is too small for their opinion to matter.",
        "True. Can't agree more.",
        "karma ✨✨",
        "Reduce the population",
        "Yeah start with urself........ Jump from that bridge...",
        "Right! Nirmala tai makes economic policy. \n\nDear leader has made a brilliant move here and diverted all middle class angst to Nirmala.",
        "It’s the finance ministry think thank/bureaucrats who are fucking it up in terms of actual policy being written - no one in this govt has the intellectual capacity to frame a policy including Modi. But the bureaucracy specializes in making life living hell for the citizens.",
        "Every single policy decision in this administration comes from the PMO. The ministries just implement it.",
        "See who the cabinet secretary was before he became the cabinet secretary and read his views on capital gains tax & indexation.",
        "Achha hai. It is the communal middle class that empowers these sabghi idiots."
    ],
    "cleaned_text": "indias middleclass meltdown report reveals key threats survival elevated food inflation high interest rates shrinking discretionary income made harder segment maintain previous spending levels ",
    "cleaned_title": "indias middleclass meltdown report reveals key threats survival",
    "cleaned_selftext": "elevated food inflation high interest rates shrinking discretionary income made harder segment maintain previous spending levels",
    "cleaned_comments": "according report marcellus investment managers slowdown rooted three primary factors technological disruptions cyclical economic downturn deteriorating household balance sheets threat middle class survival nirmala sitharaman finance ministry think thank people dont even understand meaning middle class everyone maid pay k month boss makes lpa calls middle class lifestyles extremes havent changed much dont care middle graph small opinion matter true cant agree karma reduce population yeah start urself jump bridge right nirmala tai makes economic policy dear leader made brilliant move diverted middle class angst nirmala finance ministry think thankbureaucrats fucking terms actual policy written one govt intellectual capacity frame policy including modi bureaucracy specializes making life living hell citizens every single policy decision administration comes pmo ministries implement see cabinet secretary became cabinet secretary read views capital gains tax indexation achha hai communal middle class empowers sabghi idiots",
    "light_cleaned_title": "India's middle-class is having a meltdown: Report reveals 3 key threats to its survival",
    "light_cleaned_selftext": "Elevated food inflation, high interest rates, and shrinking discretionary income have made it harder for this segment to maintain previous spending levels.",
    "light_cleaned_comments": "According to a report by Marcellus Investment Managers, the slowdown is rooted in three primary factors: technological disruptions, a cyclical economic downturn, and deteriorating household balance sheets. The No 1 threat to Middle Class survival is Nirmala Sitharaman and her finance ministry think thank. most people dont even understand the meaning of middle class everyone from my maid whom i pay 2k a month to my boss (who makes 70 lpa) calls themselves middle class, the lifestyles of both extremes haven't changed much so they dont care and the middle of the graph is too small for their opinion to matter. True. Can't agree more. karma ✨✨ Reduce the population Yeah start with urself........ Jump from that bridge... Right! Nirmala tai makes economic policy. Dear leader has made a brilliant move here and diverted all middle class angst to Nirmala. It’s the finance ministry think thank/bureaucrats who are fucking it up in terms of actual policy being written - no one in this govt has the intellectual capacity to frame a policy including Modi. But the bureaucracy specializes in making life living hell for the citizens. Every single policy decision in this administration comes from the PMO. The ministries just implement it. See who the cabinet secretary was before he became the cabinet secretary and read his views on capital gains tax & indexation. Achha hai. It is the communal middle class that empowers these sabghi idiots."
}