{
    "id": "15dm89w",
    "title": "'Vegetarians only': IIT Bombay students complain of food discrimination at hostel canteen",
    "url": "https://www.indiatoday.in/amp/india/story/iit-bombay-students-only-vegetarians-allowed-to-sit-complain-hostel-canteen-2413790-2023-07-30",
    "selftext": "Honestly speaking, when does this constant saga of discrimination end? One religion is pitted against another, one caste tries to oppress another, and now it’s vegetarians now reserving separate space for themselves in IIT-B mess. When will India become inclusive again and start respecting each other’s differences instead of imposing themselves and their views on others?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 219,
    "created_utc": 1690725326.0,
    "convurl": "https://external-preview.redd.it/fbqS0PUeOLHCBZQoAVVMWzLApmyOO2Z3FenbPuJKHcg.jpg?auto=webp&s=2e11b4beb329ac680b2af3b1543ab04a7bd4e3f6",
    "comments": [
        "“Vegetarian only are allowed to sit here”\n\nExcellent command of English displayed by a freaking IIT student.",
        "> When will India become inclusive again\n\nNever was.",
        "This only",
        "Probably true, but it used to be much more tolerant.",
        "Nope. I'm old enough to remember a time when we were quite tolerant. Wasn't a utopia by any means, but we definitely used to be better (at least here in NE. It's all shit now obviously)",
        "Hey, they made a Vegetarian quarantine zone, the sentence implies they're not allowed to sit anywhere else. should ban them from everywhere else and lock them there.",
        "Forcing people to accept the dietary choices of others is also another opposite form of discrimination. If a group of students want to restrict their social group that is a free exercise of assembly and speech. \n\nMuslims are not forced to accommodate non halal choices, neither are devout Hindus. This is a constitutional right.",
        "This is why you should always mock people who call themselves 'pure veg' (literally a castiest term, just say you're veg) or think it's just 'personal choice'. They don't just keep it personal, do they? It's not a matter of dietary preferences but discrimination.",
        "Umm but they were not being forced to accept the dietary choices of others...\n\n The article mentions that the students\n 1) declared certain areas for vegetarians only (rather than making the personal decision to sit with fellow vegetarians)\n\n 2) declared this on their own, in the hostel canteen. It's not their dad's place, the hostel can decide vegetarian zones, not some random students!",
        "People are free to eat what they want. Not free to lambast others over what they eat. Or forbid them from sitting in the canteen of the college they attend.",
        "\n\nFir shuru ho gya. Angrezi bolno se bade hojate hai?",
        "🥩",
        "sahi kia, hum bhi yahi karte the . kutto ko unki jagah pr hi hona chahiye",
        "Exactly! op is talking about inclusivity and respecting each others differences and then have a problem with people who prefer their own personal space while eating. Its not that they are forcing anyone to eat veg with them rather its the opposite in most of the cases. I have many friends who always force me to eat non veg and often even try to feed me non veg without me knowing.  \n\n\nCan we not except people's personal choice even while eating?",
        "Pretty sure the canteen staff types and sticks those up",
        "I’m going by the article. \n\nSome students had put up posters proclaiming “Vegetarian only are allowed to sit here” on the canteen walls",
        "Asking for halal food and insisting on pure vegetarian food, never mind the practices associated with the latter, are not comparable at all.",
        "It's a good thing right? Let them segregate themselves so you can eat in peace.",
        "Lol why would a student print that? It must be written by the canteen staff.\n\nAlso, when did English start relating to intelligence",
        "Someone should just put chicken on their table lolololol",
        "How are they gonna check like anyone can pretend",
        "How is being pure veg castiest?",
        "How is it different from being vegetarian? What's pure about being vegetarian? Maybe ask your parents, the ones who taught you the term.",
        "The entire concept of non-vegetarian being impure is completely casteist.",
        "This is actually quite common in many colleges. College mess/canteens don't allow non vegetarian food and this has been for a very long time. In many schools also. It's quite common.",
        "Yes. These dogs know exactly where they should sit. Which is why they wrote that only they can sit there. Let the regular humans sit far away from them for fear of getting bit.",
        "I think pure veg is when they don't eat egg also",
        "There is nothing wrong in being vegetarian but the purpose is to be not harm other in any manner intentionally. Drawback outweighs moral benefits (if there are any) when you develop a sense of superiority or feeling of disgust/discomfort towards others who are not vegetarian.",
        "Some people adhere to strict vegetarian diet.\n\n\nCooking any sort of non vegetarian items would just go against their belief systems.\n\nGood that IITB managed to be inclusive and accommodate such people.\n\nIt's not like other messes don't serve non vegetarian food. The meat eaters can always eat there.",
        "Why are we going backwards… what is happening in all over India??? When was someone’s food choice were so much of anyone else’s concern… This Gujaratification… of India is shocking and this is spreading really fast…",
        "Colleges mostly use this level of english, such notices are made by ordinary labor folks",
        "चाईला.. जातीभेद, वर्णभेद, वर्गभेद, लिंगभेद आणि आता अन्नभेद.. कुठे चाललोय आपण?",
        "Vegetarian is worst diet.... These casteist vegetarian will make india nutrients deficient... Do u know Pakistani has more IQ and height on average... Wonder why? Yeah it's meat 🍖🍖",
        "well, people of other religions are fucked",
        "I was thinking about this while taking a bath today, we have never been inclusive. Earlier (pre modi era) we would just think for potential reasons before blaming it on the outgroup but now we just skip that step.\n\nWe always had scapegoats, it's nothing new nor will it change anytime soon.",
        "I think a lot of people whom I know use the term \"Pure Veg\" to tell that they are strictly vegetarian and do not consume non veg at all. My mother for instance would also call herself a \"pure veg\" meaning that she does not eat non veg at all yet she would often cook us omelette  at breakfast, would you call her \"castiest\", before as far as I know my mother she is not. I for instance like to use the term \"predominantly vegetarian\" because I am not a strictly vegetarian guy and I do eat chicken though it's very less.\n\nNow I would not call myself non-veg eater because I eat very very less but then I can't call myself veg either because I do eat non veg sometimes. Hence the differentiation \"pure veg\" and \"predominantly veg\".\n\nA lot of people use the term \"pure veg\" simply to tell that they are strict vegetarians unlike me. Is that castiest...?",
        "We have a magician here he pulls  facts straight out of his ass .",
        "Pure vegetarian means that they don't eat anything even remotely considered non-veg. It's like saying a solution is pure  solution. Or how people say that this is pure marble or pure gold.",
        "It's not impure in that sense, lmao. It's like saying this marble is pure or this necklace is pure gold that, meaning it solely consists of that thing and impurities are everything that are not 'it' in its context.",
        "Hello I'm a Marathi person but I never was able to find the meaning chaila can you explain its meaning ik it's pretty random to ask lmao",
        "i have met a lot of people who say veg to mean they egg, but pure veg to mean no egg.",
        "If it was merely the verbiage then that would be fine, but the fact that vegetarians do shit like refuse to eat from an utensil that's also been used to serve non-veg is proof that it _does_ mean impure in that sense as well.",
        "Similar scene at one of Reliance Jio’s office at Bengaluru. One cannot eat food anywhere in the office except at the food court. The food court however prohibits non veg food even if it is brought from outside.",
        "Next hindu only \nNext upper caste only",
        "Being a vegetarian, I can say one thing that smell of non-veg is very nauseating.\nI used to eat non-veg when I was very young, at that time I used to salivate now quite the opposite.",
        "you/they can’t make up definitions of things.\nveg is veg .. there is nothing like pure veg.",
        "Yes, but pure veg is not used for that. They add different adjectives for that. \n\nIn real life, people use veg for all plant based stuff + milk + egg, while pure veg for plant based stuff + milk.",
        "You are welcome to think that there is no correlation whatsoever between the term \"pure veg\" existing only in India and this particular sort of vegetarian casteism also existing only in India. But you should really not be surprised if so many people consider it more than a coincidence.",
        "Except that soon it would be 90% of the tables exclusively for “Pure Sanatan Vegetarians”",
        "So why are vegetarians, who also eat egg, implied to to be impure?",
        "Same can be said for some of the Indian vegetarian good. 🤷🏻‍♂️ \n\nJust ask the white people who complain about Indian IT workers heating up Indian curries in shared microwave ovens at office. We only think it’s discrimination when it happens against us!",
        "I am not denying that vegetarianism is not used as a way to differentiate against people of oppressed castes and muslims, it definitely is and very commonly, but I was talking about usage of terms in real world.\n\nIt's the sub section of \"pure veg\" people who do that.\n\nIf it makes you think that I saying this cause I am pure veg or even veg, then no, I am not.",
        ">> Cooking any sort of non vegetarian items would just go against their belief systems.\n\nWhy do the tables need to be reserved? You think IITians run Korean bbq on the table?!",
        "This shit has been going on in campuses under the radar. Not surprised here.\n\nMy friend can't even make chicken Maggi in the hostel because the other Brahmins and UC pure veg gang keeps complaining about the smell when they use all the fucking masalas in the world to cook their own foods.",
        "Being a rational human, I can say that there is nothing more nauseating than a person showing pride in declaring themselves as \"pure-veg\"",
        "An old lady scientist (tamil) refused to shake my hand because i was non veg and gleefully told me about how she wouldn't visit my region because the plates we eat from probably already touched meat so they were not clean to eat from.\n\nLots of weirdos out there",
        "Yeh gujjutification nahi hai. Lots of youths Today are more radicalised than we know.",
        "Man I can't stand the strong fucking smell of masalas. Only people who don't eat typical Indian curry will understand my plight.",
        "damn you got it wrong lol, saying pure silver doesntly imply gold is impure, if this doesnt get in your head maybe you should start focusing on your classes",
        "Lol...\n\nSo vegetarians are pure.... vegetarians who eat egg are also pure... and vegetarians who also consume non-veg once a while are also pure...\n\nWhy overload the term \"pure\"? What is the need to declare some as pure?",
        "DONT KNOW WHY THESE IDIOTS ARE MAKING THIS A RELIGION ISSUE. A few kids doing stupid stuff do not represent the whole religion like Muslims don't represent terrorism. You hear veg and you start attacking hindus and santanis or muslims or what not.\n\nIn my IIT we had a whole floor for only veg people and 2 floors for non vegetarians, it doesn't make it wrong and benefits both sides. Also it has been going on for years now, there hasn't been any problems.\nIt was done to handle the huge volume of non veg eaters, nothing to do with religion or caste.",
        "Negative cutoff wala hoga",
        "Well, caste based reservation makes india inclusive but 1 seat reserved for vegetarians make it exclusive.",
        "You are OK with caste based reservation but this is not ok",
        "Not all. Some do. Painting people with the same brush based on the religion or caste which they were born into is silly, unfair and dangerous. This is why the hate politics works wonderfully well. We are so eager to get into us vs them, be it based on race, language, living habits, customs, caste and religion, that politicians regularly use this to make people fight against us.",
        "These kind of nonsensical acts can be dealt easily by the college admins. It is the duty of the govt to make sure that college admins do act.",
        "https://preview.redd.it/3ky6yxixe5fb1.jpeg?width=3072&format=pjpg&auto=webp&s=168a8152199c611a967644145b7982d83243cec5\n\ncheck this out",
        "only shld have nool",
        "What's wrong with that?",
        "But previously people were not this much openly bigot. There was some shame. Modi and his Dalal media changed everything",
        "You are okay with caste based discrimination but not okay with reservation",
        "I guess they are trying to say that you can only eat vegetarian food there .",
        "Hanji... Ho jate he. Considering these are future engineers whose knowledge and engineering career is useless without command over English language",
        "Beat them up, them pure veg muscles are probably not developed",
        "Chicken maggi doesn't even smell or taste like chicken.. is doesn't taste like meat at all.. wtf are they on about?\n\nGlad Im not living  among these kind of retards",
        "Sounds like your being facetious but China, Japan, Korea, Europe consume a lot of meat and they are highly developed. While India is extremely backwards",
        "No one is forcing them to eat non veg or cook non veg",
        "Ok.\n\nKarlo downvote. Koi self respect thodi chahiye. Meri bhi pehli bhasha angrezi hi hai kyuki Mai English medium se padha hu, parantu samajhne ki baat hai ki angrezi kavel ek madhyam hai. Koi teer nhi maar liya angrezi jhaad ke. Agar itni hi zarurat lgti sarkar ko to science ki pareeksha me angrezi dal dete.\n\nBhasha seekhi ja skti hai kisi bhi vakt par, in bacho ne saalo mehnat science me ki hai na ki angrezi me",
        "i eat non veg and i love that, if you want to discriminate over food choices than f you , go f yourself",
        "I have multiple vegetarian friends few of them are baniya, Jaina and pandit sometimes when we all go out for lunch or dinner when us non vegetarian friends order chicken or mutton they simply shift to another table next to us or as waiters to join separate table beside us they don't like waiters to serve their paaner dish with same serving spoon use to serve chicken and also some of them feels uneasy but they don't discrimination us and we also respect their boundaries, it's about morales they don't like Animals to slaughter or in their religion its prohibited to hurt other living organism so as a democracy we have to respect their choices also, like I don't eat beef because cow is worshipped in my religion but if someone Sit beside me starts eating beef I would simply leave I can't force him to stop eating so being rational I would leave my seat go to another table",
        "Angrezi keval ek madhyam hi nahi ek bhasha bhi he. Har bhasha ke apne niyam hote he , angrezi me ham use \"grammar\" kehte he. Dainik upayog me ye niyam bohot mahatvapurn he . \n\nTumhari pehli bhasha he angreji, meri doosri bhasha he, aur Hindi meri teesri bhasha..\n\nTo ha, achi angrezi bolne vale ne teer hi mara he, \n\nTumhara comment padhke mujhe lomde aur khatte angoor ki kahani yaad AA Rahi he",
        "There is nothing wrong in 'not beating your wife' but the purpose is, not harming wives (or other women) in any manner intentionally.\n\nDrawback outweighs moral benefits (if there are any) when you develop a sense of superiority or feeling of disgust/discomfort towards others who beat their wives.",
        "Height:- https://twitter.com/stats_feed/status/1660269671776649217?t=HA8aOGg_7RVK4Is3N3cX_Q&s=19\n\nIQ:-https://www.worlddata.info/iq-by-country.php\n\nIk u r ignorant piece of shit can't even do a google search...",
        "Btw avg height and Iq of Japan , Korea and china is more than India... It's all nutrients rich diet my friend this pure veg fanatics  ( not just Brahmin can be found irrespective of the caste) has ruined us...",
        "It's like  tichya aaila said in a faster way which sounds like chaila.",
        "You are overthinking it. It is a short form of purely vegetarian.\n\nSee below\n\nPurely\n\nin a pure manner.\n\n\"act nobly, speak purely, and think charitably\"\n\nentirely; exclusively.\n\n\"the purpose of the meeting was purely to give information\"\n\n\nThis is using the 2nd definition.  There's so many issues with people forcing their food choices on others. This isn't one of them. Like if in a sentence someone asks. Are you vegetarian. And the other person says yes. And then they go, but you eat egg? No no. Pure vegetarian.",
        "Vegetarians always come up with some stupid comparison",
        "?? - no thats what words are - made up shit with definitions. also thats how language works.",
        "^Vegeterian. IIT-Bombay 😎",
        "I’m an Indian-American, so may be missing something, but most even orthodox Indian vegetarians here are accustomed to eating around and in the presence of meat? Seems like the complaints of discomfort/smell/etc go out the window when they reach America. I myself am a staunch vegan and the strict food segregation in India makes absolutely no sense.",
        "^ VegetErian. IIT-Bombay 💀",
        "I am just a non-vegetarian. I dont go around and introduce myself as a pure non-vegetarian. But the so called self-declared pure vegetarians, keep going around and introduce themselves as \"pure vegetarians\", even when no one bothers about their food habits. Why? Why are they so insecure and need someone else to validate them? Why do they take so much pride in emphasing that fact, even though it was mostly not even their choice?",
        "They are always so aggressive lol, can't apply proper reasoning at times",
        "How will you pretend eating a veg meal when you have a non-veg meal?",
        "By this definition, someone who is pure non vegetarian would be someone who only eats meat. Your issue is with people, that doesn't change definition of the word. Pure can mean more than one thing. You can replace pure with lacto vegetarian and it's the same thing. Would you be OK with that. I am vegetarian.  But I have literally never told anyone unless asked in context of what I would like to eat.",
        "Pure as in purely vegetarian. Some vegetarians eat egg, some are only casual meat eaters... It's a spectrum. Purely vegetarian is used for non egg eating vegetarian.",
        "Correlation is not causation. Simple statistics bro.",
        "have you watched “The dictator”.",
        "Vitamin B12 deficiency can do that to people!! Or maybe they were just misunderstood!! They meant that meat esters can both sit n stand there",
        "You will have to be a carnivore to call yourself a pure-non vegetarian. Pure-vegetarian makes sense.",
        "The purpose of college and school is to have no discrimination but here it’s totally opposite. Thats why we wear school uniform so that everyone looks same. No rich and poor difference either. But iit are run by a bunch of upper caste racist people so u can expect like this in every iit. Go to IIT madras and u can see it for urself.",
        "He can't, they stopped him from eating meat and his muscles have also deteriorated.",
        "You're being downvoted by their guilty conscience.",
        "?Make your own choice hurting noone===Beat your wife?\n\nMakes sense.",
        "Lolw",
        "I went to an IIT almost 30 years ago. Vegetarians and non-vegetarians ate together in the same mess in that IIT. Some vegetarians may choose to go to a different table, but without making any fuss about not eating with non-vegetarians! What you describe must be new",
        "It's the mood of the nation for the last 9 years... \n\nno surprise in the attitude of these students who, unfortunately, are going to expect similar exclusivity in their future.",
        "Demand and supply buddy . It's cause people prefer to dine at pure veg for relligioua reasons . Just like Halall dominates the meat industry .",
        "Don't see anything wrong here!",
        "A lot of vegetarian people find the smell of meat to be nauseating. Also they believe in non violence and the thought of animals being killed and served at the same table makes you feels awful. \n\nWould you be okay to sit on a table that serves food that smells awful to you? Also how about dogs and cats being served ? Would that make you uncomfortable?",
        "Wasn’t that bad before, whatever justification you keep on by minimizing the Modi era shit.",
        "So why do a lot of vegetarian people  not like to eat in a non vegetarian environment? \n\n1. The smell of meat is awful to people who have never eaten mean in their life. It is nauseating and makes you want to puke. \n2. A lot of vegetarian people adhere to non violence. So meat being served on the same table makes you feel anxious and helpless for the animals killed. \n3. A lot of vegetarian people do not like to eat in the same utensils used for non vegetarian food. They do not want to use plates and bowls in which meat was served or prepared. \n\nNon vegetarian people ... would you feel equally comfortable eating on the same table where cats, dogs, rabbits, silkworms, deer, elephant, cockroaches, ant flies, tarantula, snakes, human fetus, octopus etc are served?",
        "I'll have to advocate the vegetarians today, yaar. I don't get it. I eat everything, but if someone has a problem with meat, why can't they have a special place to sit and eat? I have talked to many vegetarians most people associate meat with trauma and animal killing, I think everyone deserves a safe space to practice what they want to. After all we're in a democracy. Why is it that you're making someone uncomfortable for following their faith? This unreasonable attack against vegetarians has to stop. In fact it's the only diet in the long run which is really going to reduce the carbon foot print on this planet. \n\nIn another argument, I had someone brought up caste into this, it's despicable saying that vegetarians are upper-caste people, looking for a special place to eat, and start discriminating on them, there's no difference when you're a racist, if you attack a man based on his caste/faith you're despicable. These people did not say lower-caste are not allowed, this is a place for people to eat their diet, due to whatever reasons they want to, this has to be accommodated. Please  stop and focus on better things. Protesting every small thing will only make us look dumb.\n\nedit: downvoting without an explanation, thanks.",
        "I can't believe you think practicing a diet is castiest what a fing non-sense, few of friends who are SC/ST have gone completely vegan and strongly oppose non-vegetarian food. I have also seen brahms drinking and eating meat, food is a personal choice, I just can't understand what goes into your mind, when you say \"pure veg\" is a castiest term.",
        "At risk of revealing my caste because these so called intellectuals make me do so. I'm a non-vegetarian I never had a problem with a vegetarian having special requirements. due to whatever reasons they chose to be one. this needs to end. \n\n\nIt's not like there are no mixed eateries at IITB. This is just plain non-sensical to be pissed at someone just doing what they're doing because that's what they like to do.",
        "Isn't this discrimination...",
        "Imagine studying your ass off sacrificing your youth and then finding out you don't even have basic rights",
        "Why are you acting like people bring in live animal and slaughter it in the canteen.😂\n\nUnless you are fixated on it, you really cant make out what kinda meat you are eating. Half the time I have to ask 'mumma ye chicken hai ki mutton hai?' 'Beef hai? Ok'\n\nHow does meat being served, of an animal which is long dead make you feel anxious? I understand the moral highground, but if you are so easily anxious you should consult a therapist. I have had and even now have so many veg friends, in college and even now in the office. We eat on the same table. Never once have I had someone move away or getting anxious. \n\nIf I was so uncomfortable I would move away to another seat instead of marking territory. Its cultural difference. If I have the one who has a problem I need to adjust and accomodate, instead of earmarking seats and shit.",
        "Why not ?",
        "At NMIMS they don't even allow you to get non veg from your own home. The audacity of some colleges.",
        "Bro, when was India inclusive? Are you from a parallel dimension",
        "Shhhhhhhhh !!! 🤫 \n\nYou can't make sensible comments here. This subeddit is only for irrational hatred, especially towards Hindus and upper castes. You have been warned. Making sensible comments here might get you banned.",
        "Halal is simply what is permissible in Islam, and as far as food practices go, halal food is just food that has been sourced and prepared according to Islamic tenets.\n\nNothing in Hinduism explicitly forbids something when it comes to food. \n\nEating Halal food or having such food on sale doesn't go against the beliefs of a Hindu; anyone who claims otherwise is nothing but a Hindunat prick.",
        "There are sects of Hinduism that demand a pure vegetarian diet. \n\nOh shit, sorry, I forgot Hindus are not allowed to have rights in this country.",
        "Demanding a pure vegetarian diet is not the same as having food habits explicitly encoded in religion. I bet those same Hindus would have a problem with Jews and their kosher food.",
        "Coaching centres and coaching oriented colleges have been coaxing students to ignore languages for a long time now, so it makes sense.",
        "Vegetarians believe in non violence? 😂😂 Are you kidding me?",
        "Woahh! Upper Castes (so oppressed) are facing a backlash for being dickrots for decades, colour me surprised 🤯.",
        "As a vegetarian I see nothing wrong with this, most of the vegetarians don't even like the smell of meat, fish etc. When I'm eating with my friends, we usually sit in a group but with the vegetarians on one side and the non vegetarians on one side and no one has a problem with that \nThis is not related to religion or anything",
        "Lol, a shit-speaking budha.",
        ">Vegetarians believe in non violence\nSubah subah naya naya joke sunne ko mila 😂🤣",
        "And no one is forcing to eat veg food exclusively either.\n\n\nIt's better to keep them separate and accommodate the faith system of people who don't eat meat.",
        "Most of the hate here is unwarranted and, frankly, just reverse racism. \nI can't color you surprised, but I can color you a racist.",
        "By saying it's plant based meat/soya chaap and if they don't believe they can eat to check 🤣",
        "They are not being forced to eat meat. I don't eat fish and hate the smell, but I recognise that in public places I can not demand people stay away from me when eating fish. \n\nIf a Muslim demands that certain seats in a public canteen are reserved only for those who eat halal food (or Jewish demand that certain seats in a public canteen are reserved for those who eat kosher food) they are also wrong.",
        "Maybe the backlash has something to do with people who use religion as an excuse to demand ban on shops selling certain types of (or all) meat shops? Just a thought.",
        "It's not about casteism, they say pure veg because there are vegetarians who eat eggs sometimes, there are also vegetarians by religion but still like to eat meat. Pure veg only means strictly veggies and dairy products afaik and vegan is not even eating dairy products or anything animal related",
        "Then find your own spaces away from non-vegetarian spaces? There are many food smells people hate - I can't stand the smell of fish, some people hate the smell of durian. Many people in the West have a problem with the smell of our spices. Doesn't mean you as a student get to demand certain people can't use seats in a public canteen. \n\nI do get the other points though. Appropriate reaction might be to petition the uni for a separate section for vegetarians, not hanging up notices on your own. \n\nAlso, nice job slipping in that human fetus in there. Very comparable to everything else.",
        "A certain group of people give jobs only within that community and that is forced world wide through certificates. That's the highest level of discrimination there!",
        "If it is a corner of 10-20 percent of chairs. I am fine with it. It is not discrimination. Just a private space.",
        "He's being downvoted for stupidity",
        "let them sit there what's the issue? You should understand that they're not comfortable with meat smell, few feel cringe looking at meat... did you talk to them why they've put that post before posting over here? Irony is talking about inclusivity and creating division by posting here instead of working together with them!",
        ">A lot of vegetarian people adhere to non-violence.\n\nLike beating a fellow human to death being under the suspicion that they ate meat?",
        "honestly, i get it. as a vegetarian, i do not want to see people around me. i never sit around people who are eating nonveg. but hey, thats just me, im not forcing anyone else to move",
        "These canteens are a public space. Not anybody's home. If you can't learn how to live socially with other people having different food habits, you are better of staying in your room and eating there. \n\nOr at the very least, just try to find out a corner somewhere to eat your food. No reason at all to designate a space with a specific condition and claiming that as your own.",
        "Their pet cow ate the English lessons book.",
        "Fuck you and your state.",
        "Maybe, they meant only Vegetarian food is allowed. If so, I'm still wondering, is there any place in the campus/canteen where the Non veg food can be consumed.",
        "Everyone in here complaining about reserving a few seats, probably a few tables at maximum for those who prefer to eat with no meat on their table.\n\nI'm guessing the entire mess isn't restricted to vegetarians only.\n\nBig deal, let a man eat in peace. Nobody is forcing anyone to do anything. Nobody is disallowing vegetarians to share a tabel with non vegetarians either.\n\nWhat's the harm if you are able to create a safe space for those who are genuinely uncomfortable about having meat besides them where they eat.\n\nInclusivity means being able to create a safe space for everyone 🤷\n\n\nTo clarify, being a vegetarian, I don't have a problem sharing my table with those eating non veg. Though I can understand what some other vegetarians feel like. I see no harm in just letting someone eat on peace comfortably. Gosh",
        "It's like ayoo, waw",
        "That’s the point isn’t it- is it any more nauseating in India than the West? Meat is meat anywhere, I thought? How is it possible for folks to find the smell of meat so nauseating they cannot even sit next to certain people in India, but then when the cross the seas they have no problem being in such close proximity to meat and meat eaters? My parents have had to go to company office dinners or neighbors birthday parties in steak houses. But they will never step within a non-veg restaurant in India.",
        "The entire nation should adopt this. India a vegetarian country.",
        "Lmaoooo as if he can",
        "In India, vegetarianism is just another form of casteism.",
        "Try home schooling",
        ">Human fetus\n\nBe for real. I can't stand the smell of ripe jackfruit or cooked karela. It makes me want to puke. Abb?\n\n\nLike another commenter has said below me, no one is slaughtering the animals on the spot. A). B) \"Anxious and helpless\"? Do you drink milk, eat curd/yoghurt etc? Because cows are under immense stress then and us meat-eaters don't pretend it's some sort of superiority. \n\nHow are you enjoying your morning of mental gymnastics?",
        "Go and tell Modi Ji to remove caste based reservation",
        "This. And one's command of English is often reflective of  one's caste-class privelige. It is very much possible for people in good institutes to be good at their technical fields while not having a very good command of English. Ironic that a thread calling out casteism has a comment of this nature.",
        "Ambedkar Periyar circle busy doing this, instead of studying \nNo wonder 25000 SC/ST students dropped out of IIT's in the last 5 year's",
        "I think this is not discrimination. It's like the issue with the third gender bathrooms. The gender is not comfortable using the other gender's washroom. In the similar way these vegetarians are not comfortable sitting beside a person eating non vegetarian...idk... couldn't relate.",
        "Is it that only vegetarian have acess to canteen or it is seperate space for vegans and non-vegans? Please explain.",
        "Yet these future engineers will have  salaries more than almost any other Batchelors degree in India. In light of that I think most employers find their 'engineering skills' sufficient.",
        "Maybe this is the rarest case where the minority suppress the majority, because the closet non-vegetarians are too much of a coward to accept it in public.",
        "What a lot of doodoo",
        "I don't think it means impure. You can be pure veg or pure non-veg or pure *I eat anything that moves.*",
        "I don't understand why people are becoming so hateful. Ethical reason is one big part in why some people choose to be vegetarian. And it follows that some can't bear people eating slaughtered life right next to them.",
        "Care to explain what is stupid about this? \nMy point is that one person's morality is another person's lifestyle. To the person who it is moral, the idea that it's just a lifestyle choice may be vile. Of course to the lifestyle person, imposing morality is immoral :-D. Neither side is wrong because they feel superior to the other? Or are they both wrong?",
        " 🖕 🖕 🖕",
        "They got the spelling wrong, so not to worry.",
        "Besides, plants are living creatures, right? Or did that change? I don't eat meat but I don't understand the moral high ground that vegetarians hold when their food is also sourced from living beings.",
        "I wonder how shit would hit the fan if it was the other way around...\n\n\"No vegetarians allowed\" lol..",
        "OP is lacking some knowledge of what is happening around him.\n\nThis question is not about religion and should not be treated as a question about Modi.\n\nThere are non-vegetarians in Hinduism.\nAnd vegetarians in every caste. Only Jainism has a taboo for non-vegetarian food.\n\nI get four or five wedding invitations from my Muslim business friends every year. In every wedding feast there is a SEPARATE PLACE for vegetarian food and more than half of the guests in that row are muslims.\n\nEquating food culture with religion is not correct.",
        "Lol reddit users with their downvotes. What's the point of discussion if you can't make arguments.",
        "So what's the main reason they don't eat meat ? If you care to ask around they don't eat meat because they don't like killing animals for food. Please enlighten me more the most learned one.",
        "Moral relativism is full of paradoxes. Suggesting that all moral views are equal leads to chaos and inconsistencies raises questions over protection of vulnerable individuals in such societies by justifying immoral actions. Universal moral truth transcends cultural boundaries . For example, most societies consider murder, theft, and lying as immoral actions, regardless of their cultural background. These principles are often based on the well-being of individuals, empathy, and the avoidance of unnecessary harm. \n\nPlato(Socrates) argued vehemently in opposing sophists when they said ,justice is beneficial of stronger or high minded foolishness. He rightly pointed out that it’s a function of internal harmony of soul, when reason govern the soul over appetite justice prevails.\n\nUnder moral relativism , it becomes challenging to make moral progress as a society. Moral relativism can hinder efforts to improve ethical standards and promote a more just and compassionate world.",
        "So your parents and grand parents are uncomfortable right ? Whenever they can they try to avoid being in the proximity of meat. That's how it is for a lot of people. But in situations where it is impossible to avoid most Indians will suck it up too and probably eat it too. And welcome to the world if you think most people are not hypocrites according to what serves them best.",
        "I just started from the perspective of vegetarians. Some better arguments would be welcomed instead of a lot of doodoos. I mean you seem like a very smart person.",
        "I mean if that's your personal experience. If you eat meat how are you even alive? Don't you have vegetarian neighbours ? You seem like an extremely smart and well learned person capable of making better arguments.",
        "So this is a discussion forum people argue here. I am just stating reasons why a lot of vegetarians avoid meat. Just ask  them if the like the smell or feel anxious. \n\nI mean if an introvert feels anxious while clubbing and dancing most of reddit users will advice to stay away from such places. It depends on person to person. \n\nI am pretty sure you stay away from ripe jack fruit and I would not cut open a jack fruit in your presence. \n\nAlso human fetus is a delicacy served in some places. \n\nYes I like mental gymnastics as much as you.",
        "Every one had a hard limit to the moral high ground. I am pretty sure even if you eat meat you wouldn't eat meat of certain animals. Why though it's just meat.",
        "Oppressor caste believe meat is impure for whatever made up reason they have and use it as a tool to discriminate against the dalit, bahujan and adivasi community. They call people impure, untouchable etc.",
        "I am just stating reasons for why vegetarian people in India avoid non vegetarian eateries. If you are Indian and have met vegetarians a lot of them avoid even eating in the same utensils. If both veg and meat are being served the utensils will most likely be the same. \n\nYou are stating your experiences of how your fellow batchmates don't mind it ... I am telling you about people who do.",
        "That's not what moral high ground means. I have a problem with vegetarians claiming they are better people for having a plant and dairy based diet. \n\nAlso the average person who consumes meat consumes animals that are bred specifically for that purpose. Personally, I don't see anything immoral with that.",
        "Umm. I am sorry for your life experiences. On similar argument basic. Oppressor religion folks belive non believers shouldn't have the right to live. Oppressor white folks believe black people are beneath them and should be slaves. Oppressor country believes the whole world needs democracy and bombs them to oblivion. .... Yada yada ... And a thousand more oppressor arguments.",
        "No am Dodo!",
        "> Universal moral truth transcends cultural boundaries.\n\nWho made you the arbitrer of universal moral truth? Most societies didn't consider racism to be immoral. Just because now it's in vogue to consider it immoral, doesn't mean it just started being immoral. It always was.",
        "I don't think most vegetarians claim they are better people or morally superior people. They just impose it on themselves that they won't kill animals for their own food or breed animals for the sole purpose of killing them for their food.",
        "Whataboutism will get you nowhere. This is an Indian sub talking about indian problems. In India majority are hindus, and the majority religion practices oppression against the dba community and that's a fact with empirical evidence. Racism, imperialism is also bad but it's irrelevant to this conversation and tries to diminish the oppressor caste hindus' cruelty and viciousness towards the minorities.",
        "bade gadhe insaan ho bhai",
        "Whataboutism will get us nowhere. Atleast we are on the same page on something. I stated reasons why vegetarian people do what they do. A lot of Brahmins eat meat too and a lot of Dalits are vegetarians. I am retarded so I couldn't understand your argument better in the context of what I was talking about. Explain like I am five.",
        "There are pure veg housing societies here",
        "Discrimination and hate has always been immoral (it lead to insecurity, violence and harmful to any society). Racism isn’t moral value of every culture, every enlightened being knew that it was wrong. It was slavery, racism, casteism was forced from one dominant group on other it wasn’t moral value and accepted by everyone.\nFor example theft, even a thief knows that stealing things is wrong and consequence is fear of being caught, a thief never wants his children to be thief as well (and would happily want out by some mean)..",
        "How many gencat students dropped?",
        "\"Well killing innocent animals is also immoral. Every enlightened person knew it and did not want to associate with people who indulge in that.\"\n\nYou see the problem with making such blanket statements? And for the record across our history most people who induldged in discrimination didn't think it was wrong. The perpretartor of an immoral act doesn't get to decide if it's wrong or not. If they know it's wrong all it makes them is a hypocrite. But the morality of an act is independent of whether the thief knows if its wrong or not.",
        "Yes it’s immoral to harm intentionally",
        "It wasn’t like that before, some fringe stuff here and there but modi and his hindutva brigade are doing this nonsense on an industrial level.",
        "Guess we know where to find Sudha Murthy when she visits IIT Bombay campus.",
        "What so now just because your state indulges in caste discrimination, you can't think it's disgusting or reprehensible?",
        "Ah yes 2cm taller and can you see that average height of indonesian men is lower than Indian men . Last time i checked they have a very meat rich diet . \n\nIf eating meat makes you smart then why do we have more medals in intenrational olympiads ? Why are we much  ahead in terms of research from Pakistan ? \n\nSomeone said the most sensible thing in comments \"correlation is not causation \" and that comment has 3 downvotes for some reason. \n\nAnd about the  'casteist diet ' thing . Do you think there are no sc/st who are vegetarian?",
        "They don't eat meat not because of the goodness of their heart, because handling of meat and dead animal and animal products were lower caste activities back in the day. \n\nI believe if you are doing it for ethical reasons then you should be vegan. Vegetarian doesn't cut it. You are still using dairy which is pretty much the only reason in some places certain  animals are bred.",
        "Discomfort is not a good enough justification for state/school/institution mandated segregation though. I’m really allergic to peanuts, as in I will have a reaction if I accidentally swallow a peanut product. Do I tell my friends with peanut butter to not sit with me? No. I carry my epipen and live with it, because the act of eating is a right that everyone has and it is my responsibility to manage that discomfort.",
        "When did IIT become good english speakers ?",
        "what does iit have to do with english ? It aint a NLU bruh",
        "The Aztecs were the minority, but they oppressed all the other tribes in the surrounding area.  \n\n\nThe Spanish were the minority, but they oppressed all the other tribes in the area, (including The Aztecs now).  \n\n\nThe Mongols were the minority in the greater region, but they oppressed ...  \n\n\nBritish...  \n\n\nRomans...  \n\n\nMy point being, suppression and oppression is not a function of majority minority, but of perception of raw power.  \n\n\nVegetarianism, like the English language and the color of a fair skin is ***perceived*** to be superior, and thus the power is projected hence-way",
        "Looks like propaganda. Sometimes Ambedkarite groups do this to instigate an uproar. Surely there are CCTVcams to check \"which\" student did this.",
        "It's not like non vegetarian people don't have a place to eat. Vegetarians are a minority in most places. Only about 15-20% of Indians are vegetarians. There will likely be 15-20 messes and another 8-10 restaurants in school / institutions which is being talked about ... Only 1 or at Max 2 will be purely vegetarian where they don't use utensils which has been used to cook eat meat. Some might not even use onions and garlic in their food for certain months of the year. \n\nThere is no mandated segregation which is meant to be evil against non vegetarians. It is economics ... Where do these 20% vegetarians go to eat if there is no place where purely vegetarian food is served ? \n\nEvery city or place you visit in India you will see about 4-5 purely vegetarian restaurants for every 300-400 restaurants which serve both veg and meat.",
        "Must be the guy who runs the Mess, it's not a Students' job.",
        "Authorities said that the culprit is unknown and all the posters have been removed... idk the rest",
        "What's the point of sitting separately, let's assume you got offer in Google head quarters in California, you are going to sit next to a beef eating pork eating crowd in that cafeteria.",
        "I believe that’s the case with all of Reliance offices.",
        "So they are okay with raping a cow and stealing it’s child’s milk, using leather, eating capsules or gelatin or wearing silk?",
        "No because I’m not an adult intolerant bitch. You fuckers sound just like the British who did not want to sit next to “darkies who smell like curry.” \nIf we want to be clear a lot of the Vedic diets render the water with nauseating body odor. One neighbor in LA did the Hanuman diet and between the restricted food and bathing that couple smelled horrible. If he had not worked from home I wonder if there would have been HR complaints. \nBut they were cool, so we would arrange things out doors like hikes, picnics, etc. And when they invited us for Diwali we just handled it like when we invited them for Eid, they just handled it and we all go along great. \nSimple answer: don’t be a bitch, be kind, handle differences that are purely sensory but don’t matter otherwise.\nAlso, our Philipino neighbor patriarch regularly invited us over for pork and dog roasts. No big deal! We at the salad and had an extra beer.",
        "Same here. People, Indians are as racist and intolerant as anyone they complain about anywhere else. One reason I’ve refused all the opportunities to “return home.” Bitch, I love my Ribeye and red wine. The Hindus will kill me for the first and my own family will hate me for the latter. \n\nBetter off in a real liberal open society.",
        "and never will",
        "No one has to eat veg food, but they have no right to say you can't sit here..\n\nIf you don't want meat, don't eat meat..",
        "By your logic most non vegetarians are okay with raping cows and whatever animals they breed for meat, leather and other animal by products?",
        "Sure, but I’m not convinced vegetarians need a separate place to eat. That’s my contention.",
        "Ahh I see, I was thinking canteen = dining hall, I think the decision of having a vegetarian canteen should be left to the campus majority not make it a political issue on reddit though",
        "Yeah bro idgi how people are unable to manage sensory discomforts so much so that they are willing to prevent certain people based on personal background and preferences to sit with them. Kicking out a peer from my group college dining table - an equal to me — because of what they choose to eat? Nah homie that to me is as morally wrong as eating meat is. Where they line is drawn is pretty telling. What if someone hates the smell of garlic or Indian spices? What if someone finds it morally objectionable that a vegetarian eats dairy products that are the result of raping a cow (fyi, I think vegetarianism is immoral just as much as meat eating is. But I don’t enforce my beliefs on others because food is extremely personal). Also, what about the discomfort the other group of people might feel for being excluded from a table - why are we prioritizing one persons discomfort over another?",
        "Also, if you’re pure veg or veg or a carnivore or gluten free or whatever, no one is obligated to cater specifically to you in a public space. You’re food is your responsibility. Nothing wrong with vegetarian restaurants or bringing your own utensils to a table and sitting across from someone eating a chicken curry - it’s not going to kill you or send you to Hell. It is however wrong to tell the person across from you to move because *you* do not like what they are eating. What gives you the authority to do that?",
        "> Some **students had put up posters proclaiming “Vegetarian only are allowed to sit here” on the canteen walls** and they would even force those who prefer non-vegetarian food to vacate the place, the student said.",
        "You missed the point where some vegetarians don't prefer to use utensils where meat is being cooked. This is the main reason there are pure vegetarian places. Dining in the same environment will mean that the plates and the cutlery and the   cooking equipments are interchangeably used for both meat and vegetarian. \n\nNo one has the authority to tell people to fuck off from the table hence they have pure vegetarian restaurants so that people know before hand what they are getting into. \n\nJust like how you feel that non vegetarian people are forced to fuck off because some vegetarians don't like the smell or sharing utensils...  likewise vegetarians feel that you have already asked them to fuck off or deal with the smell and share utensils. \n\nIt's not like both of these people don't have options. Like I said for 1 mess for purely vegetarian people there are 10 more places where both kinds of food are being served.",
        "We were never forward.",
        "My point missed you. There’s nothing wrong with having vegetarian restaurants or seperate lines for vegetarian food. But why is IIT Bombay having or enforcing a policy where vegetarians have a specific table or section of tables to eat? You are conflating to separate issues - the preparation of food in kitchens (fine should not touch meat and should be segregated), vs the consumption of food, which should not be segregated.",
        "https://preview.redd.it/tyc7qnbsdbfb1.jpeg?width=810&format=pjpg&auto=webp&s=7e8e9002420c209ba32b9c8593b3bf0211b977f7\n\nvery progressive india becoming a beyond developed nation... /s... not expected from an elite institute like iit b...",
        "You should visit IIT Mumbai and ask the people there if they mind. So where does the plates go after the food has been consumed ? In the same dishwasher ? \n\nIt might be just one small place for about 20 people. There are 18 messes in IiT Mumbai where both veg and non veg food are served together. Also there are about 20 restaurants within campus which serve both kind of food together. \n\nThere are 6000 people living within the campus. 5880 people have places to go where they can have chicken and paneer together on the same table.",
        "Also the issue in the article is some students reserving a few tables. It's not mandated by the institute. You could say it is an issue of bullying maybe. Also each mess has about 40 tables for students to sit and eat. Maybe some students thought of reserving one table for themselves.",
        "Nope, they are entitled to have a zone for themselves.\n\nIt's about accommodation of someone's belief systems.",
        "Their belief system is not eating meat.. no one is forcing them, their belief system doesn't and shouldn't interfere with a person's freedom to sit where they want.",
        "It's all about creating a space.\nAnd such spaces will be created if there is sufficient demand.\n\nBaap ki jagah nhi h Jahan marzi baithne k liye.",
        ">Baap ki jagah nhi h Jahan marzi baithne k liye.\n\nDefenition of public space is it can be equally used by everyone .. maybe you lost the idea of a public space..\n\n>It's all about creating a space. And such spaces will be created if there is sufficient demand.\n\nIt's not required. Your food habits must not interfere with others freedom. It should be limited to you.",
        "Here's the tricky part.\n\n\nCanteen and messes which are a service do not have to be public space as such. They have their own exclusive criteria.\n\nAnd yes, such services are provided after tender is floated for a contract with cooking services. \n\nAnd they are funded from the students' fees. So, they are entitled and should be thoroughly honoured.",
        "Here is the non tricky obvious part.. mess works on fees paid by all students , not just vegetarian students. Tenders are floated to include vegetarian food.. and non veg food as preference, tenders are not floated to restrict someone from sitting in a place \n\nAnd here is another fun fact, since it's paid by all students equally, it becomes a public place for students where any student can use it irregardless of his caste, creed, race, or dietary preference..\n\nSo it's not paid by veg people alone, hence they don't deserve special preferences ... \n\nIf they don't want non veg people occupying seats, make your own personal thing with your own personal money..\n\nTrain also runs on your money, will you board a train and say no one should sit beside me because it runs on my tax money? \n\nWhat a stupid arguement you have made here",
        "Pussy asses who reported my comment",
        "Agree. Lol parents love to say “india is such a vibrant country of different traditions.” That they mean to say is “India WAS beautiful when it was all vibrant Hindu traditions.”",
        "Your obvious point is wrong in qualifying messes and canteen as public space when it is clearly run by a private entity.\n\nTrains is not even the same example as this.",
        "Messes and canteens are run by students for all students.. not just vegetarians.. that's the obvious point.\n\nVegetarians are not and should not be entitled for shit like this \n\nThey pay the canteen or mess to provide food . That's it \n\nThe mess and canteen space is ultimately run by college and the food preparation is only the one which is given out on contract basis . \n\nTrain is just an example, you can apply this in any case..",
        "Your words, not bine - you are the hypocrite, afterall",
        "What ? Doesn't even makes sense. You are the one who implied breeding animals is raping them for your own use.",
        "Yes, you breed them, get them raped, even boil them alive for your needs. Then preach hate in social media.",
        "That is not casteist but that is ignorant. Not understanding that usage of such terms can cause harm in the form of division in the society. Not putting effort in changing your usage after knowing this is definitely being casteist.",
        "What about LPU then they are fully vegetarian, would you call them casteist too, stupid indians in the comments. Non vegetarians indians don't even respect vegetarians and you think it's vice-versa."
    ],
    "cleaned_text": "vegetarians iit bombay students complain food discrimination hostel canteen honestly speaking constant saga discrimination end one religion pitted another one caste tries oppress another vegetarians reserving separate space iitb mess india become inclusive start respecting others differences instead imposing views others ",
    "cleaned_title": "vegetarians iit bombay students complain food discrimination hostel canteen",
    "cleaned_selftext": "honestly speaking constant saga discrimination end one religion pitted another one caste tries oppress another vegetarians reserving separate space iitb mess india become inclusive start respecting others differences instead imposing views others",
    "cleaned_comments": "vegetarian allowed sit excellent command english displayed freaking iit student india become inclusive never probably true used much tolerant nope im old enough remember time quite tolerant wasnt utopia means definitely used better least ne shit obviously hey made vegetarian quarantine zone sentence implies theyre allowed sit anywhere else ban everywhere else lock forcing people accept dietary choices others also another opposite form discrimination group students want restrict social group free exercise assembly speech muslims forced accommodate non halal choices neither devout hindus constitutional right always mock people call pure veg literally castiest term say youre veg think personal choice dont keep personal matter dietary preferences discrimination umm forced accept dietary choices others article mentions students declared certain areas vegetarians rather making personal decision sit fellow vegetarians declared hostel canteen dads place hostel decide vegetarian zones random students people free eat want free lambast others eat forbid sitting canteen college attend fir shuru ho gya angrezi bolno se bade hojate hai sahi kia hum bhi yahi karte kutto ko unki jagah pr hi hona chahiye exactly op talking inclusivity respecting others differences problem people prefer personal space eating forcing anyone eat veg rather opposite cases many friends always force eat non veg often even try feed non veg without knowing except peoples personal choice even eating pretty sure canteen staff types sticks im going article students put posters proclaiming vegetarian allowed sit canteen walls asking halal food insisting pure vegetarian food never mind practices associated latter comparable good thing right let segregate eat peace lol would student print must written canteen staff also english start relating intelligence someone put chicken table lolololol gon na check like anyone pretend pure veg castiest different vegetarian whats pure vegetarian maybe ask parents ones taught term entire concept nonvegetarian impure completely casteist actually quite common many colleges college messcanteens dont allow non vegetarian food long time many schools also quite common yes dogs know exactly sit wrote sit let regular humans sit far away fear getting bit think pure veg dont eat egg also nothing wrong vegetarian purpose harm manner intentionally drawback outweighs moral benefits develop sense superiority feeling disgustdiscomfort towards others vegetarian people adhere strict vegetarian diet cooking sort non vegetarian items would go belief systems good iitb managed inclusive accommodate people like messes dont serve non vegetarian food meat eaters always eat going backwards happening india someones food choice much anyone elses concern gujaratification india shocking spreading really fast colleges mostly use level english notices made ordinary labor folks vegetarian worst diet casteist vegetarian make india nutrients deficient u know pakistani iq height average wonder yeah meat well people religions fucked thinking taking bath today never inclusive earlier pre modi era would think potential reasons blaming outgroup skip step always scapegoats nothing new change anytime soon think lot people know use term pure veg tell strictly vegetarian consume non veg mother instance would also call pure veg meaning eat non veg yet would often cook us omelette breakfast would call castiest far know mother instance like use term predominantly vegetarian strictly vegetarian guy eat chicken though less would call nonveg eater eat less cant call veg either eat non veg sometimes hence differentiation pure veg predominantly veg lot people use term pure veg simply tell strict vegetarians unlike castiest magician pulls facts straight ass pure vegetarian means dont eat anything even remotely considered nonveg like saying solution pure solution people say pure marble pure gold impure sense lmao like saying marble pure necklace pure gold meaning solely consists thing impurities everything context hello im marathi person never able find meaning chaila explain meaning ik pretty random ask lmao met lot people say veg mean egg pure veg mean egg merely verbiage would fine fact vegetarians shit like refuse eat utensil thats also used serve nonveg proof mean impure sense well similar scene one reliance jios office bengaluru one eat food anywhere office except food court food court however prohibits non veg food even brought outside next hindu next upper caste vegetarian say one thing smell nonveg nauseating used eat nonveg young time used salivate quite opposite youthey cant make definitions things veg veg nothing like pure veg yes pure veg used add different adjectives real life people use veg plant based stuff milk egg pure veg plant based stuff milk welcome think correlation whatsoever term pure veg existing india particular sort vegetarian casteism also existing india really surprised many people consider coincidence except soon would tables exclusively pure sanatan vegetarians vegetarians also eat egg implied impure said indian vegetarian good ask white people complain indian workers heating indian curries shared microwave ovens office think discrimination happens us denying vegetarianism used way differentiate people oppressed castes muslims definitely commonly talking usage terms real world sub section pure veg people makes think saying cause pure veg even veg cooking sort non vegetarian items would go belief systems tables need reserved think iitians run korean bbq table shit going campuses radar surprised friend cant even make chicken maggi hostel brahmins uc pure veg gang keeps complaining smell use fucking masalas world cook foods rational human say nothing nauseating person showing pride declaring pureveg old lady scientist tamil refused shake hand non veg gleefully told wouldnt visit region plates eat probably already touched meat clean eat lots weirdos yeh gujjutification nahi hai lots youths today radicalised know man cant stand strong fucking smell masalas people dont eat typical indian curry understand plight damn got wrong lol saying pure silver doesntly imply gold impure doesnt get head maybe start focusing classes lol vegetarians pure vegetarians eat egg also pure vegetarians also consume nonveg also pure overload term pure need declare pure dont know idiots making religion issue kids stupid stuff represent whole religion like muslims dont represent terrorism hear veg start attacking hindus santanis muslims iit whole floor veg people floors non vegetarians doesnt make wrong benefits sides also going years hasnt problems done handle huge volume non veg eaters nothing religion caste negative cutoff wala hoga well caste based reservation makes india inclusive seat reserved vegetarians make exclusive ok caste based reservation ok painting people brush based religion caste born silly unfair dangerous hate politics works wonderfully well eager get us vs based race language living habits customs caste religion politicians regularly use make people fight us kind nonsensical acts dealt easily college admins duty govt make sure college admins act check shld nool whats wrong previously people much openly bigot shame modi dalal media changed everything okay caste based discrimination okay reservation guess trying say eat vegetarian food hanji ho jate considering future engineers whose knowledge engineering career useless without command english language beat pure veg muscles probably developed chicken maggi doesnt even smell taste like chicken doesnt taste like meat wtf glad im living among kind retards sounds like facetious china japan korea europe consume lot meat highly developed india extremely backwards one forcing eat non veg cook non veg ok karlo downvote koi self respect thodi chahiye meri bhi pehli bhasha angrezi hi hai kyuki mai english medium se padha hu parantu samajhne ki baat hai ki angrezi kavel ek madhyam hai koi teer nhi maar liya angrezi jhaad ke agar itni hi zarurat lgti sarkar ko science ki pareeksha angrezi dal dete bhasha seekhi ja skti hai kisi bhi vakt par bacho ne saalo mehnat science ki hai na ki angrezi eat non veg love want discriminate food choices f go f multiple vegetarian friends baniya jaina pandit sometimes go lunch dinner us non vegetarian friends order chicken mutton simply shift another table next us waiters join separate table beside us dont like waiters serve paaner dish serving spoon use serve chicken also feels uneasy dont discrimination us also respect boundaries morales dont like animals slaughter religion prohibited hurt living organism democracy respect choices also like dont eat beef cow worshipped religion someone sit beside starts eating beef would simply leave cant force stop eating rational would leave seat go another table angrezi keval ek madhyam hi nahi ek bhasha bhi har bhasha ke apne niyam hote angrezi ham use grammar kehte dainik upayog ye niyam bohot mahatvapurn tumhari pehli bhasha angreji meri doosri bhasha aur hindi meri teesri bhasha ha achi angrezi bolne vale ne teer hi mara tumhara comment padhke mujhe lomde aur khatte angoor ki kahani yaad aa rahi nothing wrong beating wife purpose harming wives women manner intentionally drawback outweighs moral benefits develop sense superiority feeling disgustdiscomfort towards others beat wives height iqhttpswwwworlddatainfoiqbycountryphp ik u r ignorant piece shit cant even google search btw avg height iq japan korea china india nutrients rich diet friend pure veg fanatics brahmin found irrespective caste ruined us like tichya aaila said faster way sounds like chaila overthinking short form purely vegetarian see purely pure manner act nobly speak purely think charitably entirely exclusively purpose meeting purely give information using nd definition theres many issues people forcing food choices others isnt one like sentence someone asks vegetarian person says yes go eat egg pure vegetarian vegetarians always come stupid comparison thats words made shit definitions also thats language works vegeterian iitbombay im indianamerican may missing something even orthodox indian vegetarians accustomed eating around presence meat seems like complaints discomfortsmelletc go window reach america staunch vegan strict food segregation india makes absolutely sense vegeterian iitbombay nonvegetarian dont go around introduce pure nonvegetarian called selfdeclared pure vegetarians keep going around introduce pure vegetarians even one bothers food habits insecure need someone else validate take much pride emphasing fact even though mostly even choice always aggressive lol cant apply proper reasoning times pretend eating veg meal nonveg meal definition someone pure non vegetarian would someone eats meat issue people doesnt change definition word pure mean one thing replace pure lacto vegetarian thing would ok vegetarian literally never told anyone unless asked context would like eat pure purely vegetarian vegetarians eat egg casual meat eaters spectrum purely vegetarian used non egg eating vegetarian correlation causation simple statistics bro watched dictator vitamin b deficiency people maybe misunderstood meant meat esters sit n stand carnivore call purenon vegetarian purevegetarian makes sense purpose college school discrimination totally opposite thats wear school uniform everyone looks rich poor difference either iit run bunch upper caste racist people u expect like every iit go iit madras u see urself cant stopped eating meat muscles also deteriorated youre downvoted guilty conscience make choice hurting noonebeat wife makes sense lolw went iit almost years ago vegetarians nonvegetarians ate together mess iit vegetarians may choose go different table without making fuss eating nonvegetarians describe must new mood nation last years surprise attitude students unfortunately going expect similar exclusivity future demand supply buddy cause people prefer dine pure veg relligioua reasons like halall dominates meat industry dont see anything wrong lot vegetarian people find smell meat nauseating also believe non violence thought animals killed served table makes feels awful would okay sit table serves food smells awful also dogs cats served would make uncomfortable wasnt bad whatever justification keep minimizing modi era shit lot vegetarian people like eat non vegetarian environment smell meat awful people never eaten mean life nauseating makes want puke lot vegetarian people adhere non violence meat served table makes feel anxious helpless animals killed lot vegetarian people like eat utensils used non vegetarian food want use plates bowls meat served prepared non vegetarian people would feel equally comfortable eating table cats dogs rabbits silkworms deer elephant cockroaches ant flies tarantula snakes human fetus octopus etc served ill advocate vegetarians today yaar dont get eat everything someone problem meat cant special place sit eat talked many vegetarians people associate meat trauma animal killing think everyone deserves safe space practice want democracy youre making someone uncomfortable following faith unreasonable attack vegetarians stop fact diet long run really going reduce carbon foot print planet another argument someone brought caste despicable saying vegetarians uppercaste people looking special place eat start discriminating theres difference youre racist attack man based castefaith youre despicable people say lowercaste allowed place people eat diet due whatever reasons want accommodated please stop focus better things protesting every small thing make us look dumb edit downvoting without explanation thanks cant believe think practicing diet castiest fing nonsense friends scst gone completely vegan strongly oppose nonvegetarian food also seen brahms drinking eating meat food personal choice cant understand goes mind say pure veg castiest term risk revealing caste called intellectuals make im nonvegetarian never problem vegetarian special requirements due whatever reasons chose one needs end like mixed eateries iitb plain nonsensical pissed someone theyre thats like isnt discrimination imagine studying ass sacrificing youth finding dont even basic rights acting like people bring live animal slaughter canteen unless fixated really cant make kinda meat eating half time ask mumma ye chicken hai ki mutton hai beef hai ok meat served animal long dead make feel anxious understand moral highground easily anxious consult therapist even many veg friends college even office eat table never someone move away getting anxious uncomfortable would move away another seat instead marking territory cultural difference one problem need adjust accomodate instead earmarking seats shit nmims dont even allow get non veg home audacity colleges bro india inclusive parallel dimension shhhhhhhhh cant make sensible comments subeddit irrational hatred especially towards hindus upper castes warned making sensible comments might get banned halal simply permissible islam far food practices go halal food food sourced prepared according islamic tenets nothing hinduism explicitly forbids something comes food eating halal food food sale doesnt go beliefs hindu anyone claims otherwise nothing hindunat prick sects hinduism demand pure vegetarian diet oh shit sorry forgot hindus allowed rights country demanding pure vegetarian diet food habits explicitly encoded religion bet hindus would problem jews kosher food coaching centres coaching oriented colleges coaxing students ignore languages long time makes sense vegetarians believe non violence kidding woahh upper castes oppressed facing backlash dickrots decades colour surprised vegetarian see nothing wrong vegetarians dont even like smell meat fish etc im eating friends usually sit group vegetarians one side non vegetarians one side one problem related religion anything lol shitspeaking budha vegetarians believe non violence subah subah naya naya joke sunne ko mila one forcing eat veg food exclusively either better keep separate accommodate faith system people dont eat meat hate unwarranted frankly reverse racism cant color surprised color racist saying plant based meatsoya chaap dont believe eat check forced eat meat dont eat fish hate smell recognise public places demand people stay away eating fish muslim demands certain seats public canteen reserved eat halal food jewish demand certain seats public canteen reserved eat kosher food also wrong maybe backlash something people use religion excuse demand ban shops selling certain types meat shops thought casteism say pure veg vegetarians eat eggs sometimes also vegetarians religion still like eat meat pure veg means strictly veggies dairy products afaik vegan even eating dairy products anything animal related find spaces away nonvegetarian spaces many food smells people hate cant stand smell fish people hate smell durian many people west problem smell spices doesnt mean student get demand certain people cant use seats public canteen get points though appropriate reaction might petition uni separate section vegetarians hanging notices also nice job slipping human fetus comparable everything else certain group people give jobs within community forced world wide certificates thats highest level discrimination corner percent chairs fine discrimination private space hes downvoted stupidity let sit whats issue understand theyre comfortable meat smell feel cringe looking meat talk theyve put post posting irony talking inclusivity creating division posting instead working together lot vegetarian people adhere nonviolence like beating fellow human death suspicion ate meat honestly get vegetarian want see people around never sit around people eating nonveg hey thats im forcing anyone else move canteens public space anybodys home cant learn live socially people different food habits better staying room eating least try find corner somewhere eat food reason designate space specific condition claiming pet cow ate english lessons book fuck state maybe meant vegetarian food allowed im still wondering place campuscanteen non veg food consumed everyone complaining reserving seats probably tables maximum prefer eat meat table im guessing entire mess isnt restricted vegetarians big deal let man eat peace nobody forcing anyone anything nobody disallowing vegetarians share tabel non vegetarians either whats harm able create safe space genuinely uncomfortable meat besides eat inclusivity means able create safe space everyone clarify vegetarian dont problem sharing table eating non veg though understand vegetarians feel like see harm letting someone eat peace comfortably gosh like ayoo waw thats point isnt nauseating india west meat meat anywhere thought possible folks find smell meat nauseating even sit next certain people india cross seas problem close proximity meat meat eaters parents go company office dinners neighbors birthday parties steak houses never step within nonveg restaurant india entire nation adopt india vegetarian country lmaoooo india vegetarianism another form casteism try home schooling human fetus real cant stand smell ripe jackfruit cooked karela makes want puke abb like another commenter said one slaughtering animals spot b anxious helpless drink milk eat curdyoghurt etc cows immense stress us meateaters dont pretend sort superiority enjoying morning mental gymnastics go tell modi ji remove caste based reservation ones command english often reflective ones casteclass privelige much possible people good institutes good technical fields good command english ironic thread calling casteism comment nature ambedkar periyar circle busy instead studying wonder scst students dropped iits last years think discrimination like issue third gender bathrooms gender comfortable using genders washroom similar way vegetarians comfortable sitting beside person eating non vegetarianidk couldnt relate vegetarian acess canteen seperate space vegans nonvegans please explain yet future engineers salaries almost batchelors degree india light think employers find engineering skills sufficient maybe rarest case minority suppress majority closet nonvegetarians much coward accept public lot doodoo dont think means impure pure veg pure nonveg pure eat anything moves dont understand people becoming hateful ethical reason one big part people choose vegetarian follows cant bear people eating slaughtered life right next care explain stupid point one persons morality another persons lifestyle person moral idea lifestyle choice may vile course lifestyle person imposing morality immoral neither side wrong feel superior wrong got spelling wrong worry besides plants living creatures right change dont eat meat dont understand moral high ground vegetarians hold food also sourced living beings wonder shit would hit fan way around vegetarians allowed lol op lacking knowledge happening around question religion treated question modi nonvegetarians hinduism vegetarians every caste jainism taboo nonvegetarian food get four five wedding invitations muslim business friends every year every wedding feast separate place vegetarian food half guests row muslims equating food culture religion correct lol reddit users downvotes whats point discussion cant make arguments whats main reason dont eat meat care ask around dont eat meat dont like killing animals food please enlighten learned one moral relativism full paradoxes suggesting moral views equal leads chaos inconsistencies raises questions protection vulnerable individuals societies justifying immoral actions universal moral truth transcends cultural boundaries example societies consider murder theft lying immoral actions regardless cultural background principles often based wellbeing individuals empathy avoidance unnecessary harm platosocrates argued vehemently opposing sophists said justice beneficial stronger high minded foolishness rightly pointed function internal harmony soul reason govern soul appetite justice prevails moral relativism becomes challenging make moral progress society moral relativism hinder efforts improve ethical standards promote compassionate world parents grand parents uncomfortable right whenever try avoid proximity meat thats lot people situations impossible avoid indians suck probably eat welcome world think people hypocrites according serves best started perspective vegetarians better arguments would welcomed instead lot doodoos mean seem like smart person mean thats personal experience eat meat even alive dont vegetarian neighbours seem like extremely smart well learned person capable making better arguments discussion forum people argue stating reasons lot vegetarians avoid meat ask like smell feel anxious mean introvert feels anxious clubbing dancing reddit users advice stay away places depends person person pretty sure stay away ripe jack fruit would cut open jack fruit presence also human fetus delicacy served places yes like mental gymnastics much every one hard limit moral high ground pretty sure even eat meat wouldnt eat meat certain animals though meat oppressor caste believe meat impure whatever made reason use tool discriminate dalit bahujan adivasi community call people impure untouchable etc stating reasons vegetarian people india avoid non vegetarian eateries indian met vegetarians lot avoid even eating utensils veg meat served utensils likely stating experiences fellow batchmates dont mind telling people thats moral high ground means problem vegetarians claiming better people plant dairy based diet also average person consumes meat consumes animals bred specifically purpose personally dont see anything immoral umm sorry life experiences similar argument basic oppressor religion folks belive non believers shouldnt right live oppressor white folks believe black people beneath slaves oppressor country believes whole world needs democracy bombs oblivion yada yada thousand oppressor arguments dodo universal moral truth transcends cultural boundaries made arbitrer universal moral truth societies didnt consider racism immoral vogue consider immoral doesnt mean started immoral always dont think vegetarians claim better people morally superior people impose wont kill animals food breed animals sole purpose killing food whataboutism get nowhere indian sub talking indian problems india majority hindus majority religion practices oppression dba community thats fact empirical evidence racism imperialism also bad irrelevant conversation tries diminish oppressor caste hindus cruelty viciousness towards minorities bade gadhe insaan ho bhai whataboutism get us nowhere atleast page something stated reasons vegetarian people lot brahmins eat meat lot dalits vegetarians retarded couldnt understand argument better context talking explain like five pure veg housing societies discrimination hate always immoral lead insecurity violence harmful society racism isnt moral value every culture every enlightened knew wrong slavery racism casteism forced one dominant group wasnt moral value accepted everyone example theft even thief knows stealing things wrong consequence fear caught thief never wants children thief well would happily want mean many gencat students dropped well killing innocent animals also immoral every enlightened person knew want associate people indulge see problem making blanket statements record across history people induldged discrimination didnt think wrong perpretartor immoral act doesnt get decide wrong know wrong makes hypocrite morality act independent whether thief knows wrong yes immoral harm intentionally wasnt like fringe stuff modi hindutva brigade nonsense industrial level guess know find sudha murthy visits iit bombay campus state indulges caste discrimination cant think disgusting reprehensible ah yes cm taller see average height indonesian men lower indian men last time checked meat rich diet eating meat makes smart medals intenrational olympiads much ahead terms research pakistan someone said sensible thing comments correlation causation comment downvotes reason casteist diet thing think scst vegetarian dont eat meat goodness heart handling meat dead animal animal products lower caste activities back day believe ethical reasons vegan vegetarian doesnt cut still using dairy pretty much reason places certain animals bred discomfort good enough justification stateschoolinstitution mandated segregation though im really allergic peanuts reaction accidentally swallow peanut product tell friends peanut butter sit carry epipen live act eating right everyone responsibility manage discomfort iit become good english speakers iit english aint nlu bruh aztecs minority oppressed tribes surrounding area spanish minority oppressed tribes area including aztecs mongols minority greater region oppressed british romans point suppression oppression function majority minority perception raw power vegetarianism like english language color fair skin perceived superior thus power projected henceway looks like propaganda sometimes ambedkarite groups instigate uproar surely cctvcams check student like non vegetarian people dont place eat vegetarians minority places indians vegetarians likely messes another restaurants school institutions talked max purely vegetarian dont use utensils used cook eat meat might even use onions garlic food certain months year mandated segregation meant evil non vegetarians economics vegetarians go eat place purely vegetarian food served every city place visit india see purely vegetarian restaurants every restaurants serve veg meat must guy runs mess students job authorities said culprit unknown posters removed idk rest whats point sitting separately lets assume got offer google head quarters california going sit next beef eating pork eating crowd cafeteria believe thats case reliance offices okay raping cow stealing childs milk using leather eating capsules gelatin wearing silk im adult intolerant bitch fuckers sound like british want sit next darkies smell like curry want clear lot vedic diets render water nauseating body odor one neighbor la hanuman diet restricted food bathing couple smelled horrible worked home wonder would hr complaints cool would arrange things doors like hikes picnics etc invited us diwali handled like invited eid handled go along great simple answer dont bitch kind handle differences purely sensory dont matter otherwise also philipino neighbor patriarch regularly invited us pork dog roasts big deal salad extra beer people indians racist intolerant anyone complain anywhere else one reason ive refused opportunities return home bitch love ribeye red wine hindus kill first family hate latter better real liberal open society never one eat veg food right say cant sit dont want meat dont eat meat logic non vegetarians okay raping cows whatever animals breed meat leather animal products sure im convinced vegetarians need separate place eat thats contention ahh see thinking canteen dining hall think decision vegetarian canteen left campus majority make political issue reddit though yeah bro idgi people unable manage sensory discomforts much willing prevent certain people based personal background preferences sit kicking peer group college dining table equal choose eat nah homie morally wrong eating meat line drawn pretty telling someone hates smell garlic indian spices someone finds morally objectionable vegetarian eats dairy products result raping cow fyi think vegetarianism immoral much meat eating dont enforce beliefs others food extremely personal also discomfort group people might feel excluded table prioritizing one persons discomfort another also youre pure veg veg carnivore gluten free whatever one obligated cater specifically public space youre food responsibility nothing wrong vegetarian restaurants bringing utensils table sitting across someone eating chicken curry going kill send hell however wrong tell person across move like eating gives authority students put posters proclaiming vegetarian allowed sit canteen walls would even force prefer nonvegetarian food vacate place student said missed point vegetarians dont prefer use utensils meat cooked main reason pure vegetarian places dining environment mean plates cutlery cooking equipments interchangeably used meat vegetarian one authority tell people fuck table hence pure vegetarian restaurants people know hand getting like feel non vegetarian people forced fuck vegetarians dont like smell sharing utensils likewise vegetarians feel already asked fuck deal smell share utensils like people dont options like said mess purely vegetarian people places kinds food served never forward point missed theres nothing wrong vegetarian restaurants seperate lines vegetarian food iit bombay enforcing policy vegetarians specific table section tables eat conflating separate issues preparation food kitchens fine touch meat segregated vs consumption food segregated progressive india becoming beyond developed nation expected elite institute like iit b visit iit mumbai ask people mind plates go food consumed dishwasher might one small place people messes iit mumbai veg non veg food served together also restaurants within campus serve kind food together people living within campus people places go chicken paneer together table also issue article students reserving tables mandated institute could say issue bullying maybe also mess tables students sit eat maybe students thought reserving one table nope entitled zone accommodation someones belief systems belief system eating meat one forcing belief system doesnt shouldnt interfere persons freedom sit want creating space spaces created sufficient demand baap ki jagah nhi h jahan marzi baithne k liye baap ki jagah nhi h jahan marzi baithne k liye defenition public space equally used everyone maybe lost idea public space creating space spaces created sufficient demand required food habits must interfere others freedom limited heres tricky part canteen messes service public space exclusive criteria yes services provided tender floated contract cooking services funded students fees entitled thoroughly honoured non tricky obvious part mess works fees paid students vegetarian students tenders floated include vegetarian food non veg food preference tenders floated restrict someone sitting place another fun fact since paid students equally becomes public place students student use irregardless caste creed race dietary preference paid veg people alone hence dont deserve special preferences dont want non veg people occupying seats make personal thing personal money train also runs money board train say one sit beside runs tax money stupid arguement made pussy asses reported comment agree lol parents love say india vibrant country different traditions mean say india beautiful vibrant hindu traditions obvious point wrong qualifying messes canteen public space clearly run private entity trains even example messes canteens run students students vegetarians thats obvious point vegetarians entitled shit like pay canteen mess provide food thats mess canteen space ultimately run college food preparation one given contract basis train example apply case words bine hypocrite afterall doesnt even makes sense one implied breeding animals raping use yes breed get raped even boil alive needs preach hate social media casteist ignorant understanding usage terms cause harm form division society putting effort changing usage knowing definitely casteist lpu fully vegetarian would call casteist stupid indians comments non vegetarians indians dont even respect vegetarians think viceversa",
    "light_cleaned_title": "'Vegetarians only': IIT Bombay students complain of food discrimination at hostel canteen",
    "light_cleaned_selftext": "Honestly speaking, when does this constant saga of discrimination end? One religion is pitted against another, one caste tries to oppress another, and now it’s vegetarians now reserving separate space for themselves in IIT-B mess. When will India become inclusive again and start respecting each other’s differences instead of imposing themselves and their views on others?",
    "light_cleaned_comments": "“Vegetarian only are allowed to sit here” Excellent command of English displayed by a freaking IIT student. > When will India become inclusive again Never was. This only Probably true, but it used to be much more tolerant. Nope. I'm old enough to remember a time when we were quite tolerant. Wasn't a utopia by any means, but we definitely used to be better (at least here in NE. It's all shit now obviously) Hey, they made a Vegetarian quarantine zone, the sentence implies they're not allowed to sit anywhere else. should ban them from everywhere else and lock them there. Forcing people to accept the dietary choices of others is also another opposite form of discrimination. If a group of students want to restrict their social group that is a free exercise of assembly and speech. Muslims are not forced to accommodate non halal choices, neither are devout Hindus. This is a constitutional right. This is why you should always mock people who call themselves 'pure veg' (literally a castiest term, just say you're veg) or think it's just 'personal choice'. They don't just keep it personal, do they? It's not a matter of dietary preferences but discrimination. Umm but they were not being forced to accept the dietary choices of others... The article mentions that the students 1) declared certain areas for vegetarians only (rather than making the personal decision to sit with fellow vegetarians) 2) declared this on their own, in the hostel canteen. It's not their dad's place, the hostel can decide vegetarian zones, not some random students! People are free to eat what they want. Not free to lambast others over what they eat. Or forbid them from sitting in the canteen of the college they attend. Fir shuru ho gya. Angrezi bolno se bade hojate hai? 🥩 sahi kia, hum bhi yahi karte the . kutto ko unki jagah pr hi hona chahiye Exactly! op is talking about inclusivity and respecting each others differences and then have a problem with people who prefer their own personal space while eating. Its not that they are forcing anyone to eat veg with them rather its the opposite in most of the cases. I have many friends who always force me to eat non veg and often even try to feed me non veg without me knowing. Can we not except people's personal choice even while eating? Pretty sure the canteen staff types and sticks those up I’m going by the article. Some students had put up posters proclaiming “Vegetarian only are allowed to sit here” on the canteen walls Asking for halal food and insisting on pure vegetarian food, never mind the practices associated with the latter, are not comparable at all. It's a good thing right? Let them segregate themselves so you can eat in peace. Lol why would a student print that? It must be written by the canteen staff. Also, when did English start relating to intelligence Someone should just put chicken on their table lolololol How are they gonna check like anyone can pretend How is being pure veg castiest? How is it different from being vegetarian? What's pure about being vegetarian? Maybe ask your parents, the ones who taught you the term. The entire concept of non-vegetarian being impure is completely casteist. This is actually quite common in many colleges. College mess/canteens don't allow non vegetarian food and this has been for a very long time. In many schools also. It's quite common. Yes. These dogs know exactly where they should sit. Which is why they wrote that only they can sit there. Let the regular humans sit far away from them for fear of getting bit. I think pure veg is when they don't eat egg also There is nothing wrong in being vegetarian but the purpose is to be not harm other in any manner intentionally. Drawback outweighs moral benefits (if there are any) when you develop a sense of superiority or feeling of disgust/discomfort towards others who are not vegetarian. Some people adhere to strict vegetarian diet. Cooking any sort of non vegetarian items would just go against their belief systems. Good that IITB managed to be inclusive and accommodate such people. It's not like other messes don't serve non vegetarian food. The meat eaters can always eat there. Why are we going backwards… what is happening in all over India??? When was someone’s food choice were so much of anyone else’s concern… This Gujaratification… of India is shocking and this is spreading really fast… Colleges mostly use this level of english, such notices are made by ordinary labor folks चाईला.. जातीभेद, वर्णभेद, वर्गभेद, लिंगभेद आणि आता अन्नभेद.. कुठे चाललोय आपण? Vegetarian is worst diet.... These casteist vegetarian will make india nutrients deficient... Do u know Pakistani has more IQ and height on average... Wonder why? Yeah it's meat 🍖🍖 well, people of other religions are fucked I was thinking about this while taking a bath today, we have never been inclusive. Earlier (pre modi era) we would just think for potential reasons before blaming it on the outgroup but now we just skip that step. We always had scapegoats, it's nothing new nor will it change anytime soon. I think a lot of people whom I know use the term \"Pure Veg\" to tell that they are strictly vegetarian and do not consume non veg at all. My mother for instance would also call herself a \"pure veg\" meaning that she does not eat non veg at all yet she would often cook us omelette at breakfast, would you call her \"castiest\", before as far as I know my mother she is not. I for instance like to use the term \"predominantly vegetarian\" because I am not a strictly vegetarian guy and I do eat chicken though it's very less. Now I would not call myself non-veg eater because I eat very very less but then I can't call myself veg either because I do eat non veg sometimes. Hence the differentiation \"pure veg\" and \"predominantly veg\". A lot of people use the term \"pure veg\" simply to tell that they are strict vegetarians unlike me. Is that castiest...? We have a magician here he pulls facts straight out of his ass . Pure vegetarian means that they don't eat anything even remotely considered non-veg. It's like saying a solution is pure solution. Or how people say that this is pure marble or pure gold. It's not impure in that sense, lmao. It's like saying this marble is pure or this necklace is pure gold that, meaning it solely consists of that thing and impurities are everything that are not 'it' in its context. Hello I'm a Marathi person but I never was able to find the meaning chaila can you explain its meaning ik it's pretty random to ask lmao i have met a lot of people who say veg to mean they egg, but pure veg to mean no egg. If it was merely the verbiage then that would be fine, but the fact that vegetarians do shit like refuse to eat from an utensil that's also been used to serve non-veg is proof that it _does_ mean impure in that sense as well. Similar scene at one of Reliance Jio’s office at Bengaluru. One cannot eat food anywhere in the office except at the food court. The food court however prohibits non veg food even if it is brought from outside. Next hindu only Next upper caste only Being a vegetarian, I can say one thing that smell of non-veg is very nauseating. I used to eat non-veg when I was very young, at that time I used to salivate now quite the opposite. you/they can’t make up definitions of things. veg is veg .. there is nothing like pure veg. Yes, but pure veg is not used for that. They add different adjectives for that. In real life, people use veg for all plant based stuff + milk + egg, while pure veg for plant based stuff + milk. You are welcome to think that there is no correlation whatsoever between the term \"pure veg\" existing only in India and this particular sort of vegetarian casteism also existing only in India. But you should really not be surprised if so many people consider it more than a coincidence. Except that soon it would be 90% of the tables exclusively for “Pure Sanatan Vegetarians” So why are vegetarians, who also eat egg, implied to to be impure? Same can be said for some of the Indian vegetarian good. 🤷🏻‍♂️ Just ask the white people who complain about Indian IT workers heating up Indian curries in shared microwave ovens at office. We only think it’s discrimination when it happens against us! I am not denying that vegetarianism is not used as a way to differentiate against people of oppressed castes and muslims, it definitely is and very commonly, but I was talking about usage of terms in real world. It's the sub section of \"pure veg\" people who do that. If it makes you think that I saying this cause I am pure veg or even veg, then no, I am not. >> Cooking any sort of non vegetarian items would just go against their belief systems. Why do the tables need to be reserved? You think IITians run Korean bbq on the table?! This shit has been going on in campuses under the radar. Not surprised here. My friend can't even make chicken Maggi in the hostel because the other Brahmins and UC pure veg gang keeps complaining about the smell when they use all the fucking masalas in the world to cook their own foods. Being a rational human, I can say that there is nothing more nauseating than a person showing pride in declaring themselves as \"pure-veg\" An old lady scientist (tamil) refused to shake my hand because i was non veg and gleefully told me about how she wouldn't visit my region because the plates we eat from probably already touched meat so they were not clean to eat from. Lots of weirdos out there Yeh gujjutification nahi hai. Lots of youths Today are more radicalised than we know. Man I can't stand the strong fucking smell of masalas. Only people who don't eat typical Indian curry will understand my plight. damn you got it wrong lol, saying pure silver doesntly imply gold is impure, if this doesnt get in your head maybe you should start focusing on your classes Lol... So vegetarians are pure.... vegetarians who eat egg are also pure... and vegetarians who also consume non-veg once a while are also pure... Why overload the term \"pure\"? What is the need to declare some as pure? DONT KNOW WHY THESE IDIOTS ARE MAKING THIS A RELIGION ISSUE. A few kids doing stupid stuff do not represent the whole religion like Muslims don't represent terrorism. You hear veg and you start attacking hindus and santanis or muslims or what not. In my IIT we had a whole floor for only veg people and 2 floors for non vegetarians, it doesn't make it wrong and benefits both sides. Also it has been going on for years now, there hasn't been any problems. It was done to handle the huge volume of non veg eaters, nothing to do with religion or caste. Negative cutoff wala hoga Well, caste based reservation makes india inclusive but 1 seat reserved for vegetarians make it exclusive. You are OK with caste based reservation but this is not ok Not all. Some do. Painting people with the same brush based on the religion or caste which they were born into is silly, unfair and dangerous. This is why the hate politics works wonderfully well. We are so eager to get into us vs them, be it based on race, language, living habits, customs, caste and religion, that politicians regularly use this to make people fight against us. These kind of nonsensical acts can be dealt easily by the college admins. It is the duty of the govt to make sure that college admins do act. check this out only shld have nool What's wrong with that? But previously people were not this much openly bigot. There was some shame. Modi and his Dalal media changed everything You are okay with caste based discrimination but not okay with reservation I guess they are trying to say that you can only eat vegetarian food there . Hanji... Ho jate he. Considering these are future engineers whose knowledge and engineering career is useless without command over English language Beat them up, them pure veg muscles are probably not developed Chicken maggi doesn't even smell or taste like chicken.. is doesn't taste like meat at all.. wtf are they on about? Glad Im not living among these kind of retards Sounds like your being facetious but China, Japan, Korea, Europe consume a lot of meat and they are highly developed. While India is extremely backwards No one is forcing them to eat non veg or cook non veg Ok. Karlo downvote. Koi self respect thodi chahiye. Meri bhi pehli bhasha angrezi hi hai kyuki Mai English medium se padha hu, parantu samajhne ki baat hai ki angrezi kavel ek madhyam hai. Koi teer nhi maar liya angrezi jhaad ke. Agar itni hi zarurat lgti sarkar ko to science ki pareeksha me angrezi dal dete. Bhasha seekhi ja skti hai kisi bhi vakt par, in bacho ne saalo mehnat science me ki hai na ki angrezi me i eat non veg and i love that, if you want to discriminate over food choices than f you , go f yourself I have multiple vegetarian friends few of them are baniya, Jaina and pandit sometimes when we all go out for lunch or dinner when us non vegetarian friends order chicken or mutton they simply shift to another table next to us or as waiters to join separate table beside us they don't like waiters to serve their paaner dish with same serving spoon use to serve chicken and also some of them feels uneasy but they don't discrimination us and we also respect their boundaries, it's about morales they don't like Animals to slaughter or in their religion its prohibited to hurt other living organism so as a democracy we have to respect their choices also, like I don't eat beef because cow is worshipped in my religion but if someone Sit beside me starts eating beef I would simply leave I can't force him to stop eating so being rational I would leave my seat go to another table Angrezi keval ek madhyam hi nahi ek bhasha bhi he. Har bhasha ke apne niyam hote he , angrezi me ham use \"grammar\" kehte he. Dainik upayog me ye niyam bohot mahatvapurn he . Tumhari pehli bhasha he angreji, meri doosri bhasha he, aur Hindi meri teesri bhasha.. To ha, achi angrezi bolne vale ne teer hi mara he, Tumhara comment padhke mujhe lomde aur khatte angoor ki kahani yaad AA Rahi he There is nothing wrong in 'not beating your wife' but the purpose is, not harming wives (or other women) in any manner intentionally. Drawback outweighs moral benefits (if there are any) when you develop a sense of superiority or feeling of disgust/discomfort towards others who beat their wives. Height:- IQ:-https://www.worlddata.info/iq-by-country.php Ik u r ignorant piece of shit can't even do a google search... Btw avg height and Iq of Japan , Korea and china is more than India... It's all nutrients rich diet my friend this pure veg fanatics ( not just Brahmin can be found irrespective of the caste) has ruined us... It's like tichya aaila said in a faster way which sounds like chaila. You are overthinking it. It is a short form of purely vegetarian. See below Purely in a pure manner. \"act nobly, speak purely, and think charitably\" entirely; exclusively. \"the purpose of the meeting was purely to give information\" This is using the 2nd definition. There's so many issues with people forcing their food choices on others. This isn't one of them. Like if in a sentence someone asks. Are you vegetarian. And the other person says yes. And then they go, but you eat egg? No no. Pure vegetarian. Vegetarians always come up with some stupid comparison ?? - no thats what words are - made up shit with definitions. also thats how language works. ^Vegeterian. IIT-Bombay 😎 I’m an Indian-American, so may be missing something, but most even orthodox Indian vegetarians here are accustomed to eating around and in the presence of meat? Seems like the complaints of discomfort/smell/etc go out the window when they reach America. I myself am a staunch vegan and the strict food segregation in India makes absolutely no sense. ^ VegetErian. IIT-Bombay 💀 I am just a non-vegetarian. I dont go around and introduce myself as a pure non-vegetarian. But the so called self-declared pure vegetarians, keep going around and introduce themselves as \"pure vegetarians\", even when no one bothers about their food habits. Why? Why are they so insecure and need someone else to validate them? Why do they take so much pride in emphasing that fact, even though it was mostly not even their choice? They are always so aggressive lol, can't apply proper reasoning at times How will you pretend eating a veg meal when you have a non-veg meal? By this definition, someone who is pure non vegetarian would be someone who only eats meat. Your issue is with people, that doesn't change definition of the word. Pure can mean more than one thing. You can replace pure with lacto vegetarian and it's the same thing. Would you be OK with that. I am vegetarian. But I have literally never told anyone unless asked in context of what I would like to eat. Pure as in purely vegetarian. Some vegetarians eat egg, some are only casual meat eaters... It's a spectrum. Purely vegetarian is used for non egg eating vegetarian. Correlation is not causation. Simple statistics bro. have you watched “The dictator”. Vitamin B12 deficiency can do that to people!! Or maybe they were just misunderstood!! They meant that meat esters can both sit n stand there You will have to be a carnivore to call yourself a pure-non vegetarian. Pure-vegetarian makes sense. The purpose of college and school is to have no discrimination but here it’s totally opposite. Thats why we wear school uniform so that everyone looks same. No rich and poor difference either. But iit are run by a bunch of upper caste racist people so u can expect like this in every iit. Go to IIT madras and u can see it for urself. He can't, they stopped him from eating meat and his muscles have also deteriorated. You're being downvoted by their guilty conscience. ?Make your own choice hurting noone===Beat your wife? Makes sense. Lolw I went to an IIT almost 30 years ago. Vegetarians and non-vegetarians ate together in the same mess in that IIT. Some vegetarians may choose to go to a different table, but without making any fuss about not eating with non-vegetarians! What you describe must be new It's the mood of the nation for the last 9 years... no surprise in the attitude of these students who, unfortunately, are going to expect similar exclusivity in their future. Demand and supply buddy . It's cause people prefer to dine at pure veg for relligioua reasons . Just like Halall dominates the meat industry . Don't see anything wrong here! A lot of vegetarian people find the smell of meat to be nauseating. Also they believe in non violence and the thought of animals being killed and served at the same table makes you feels awful. Would you be okay to sit on a table that serves food that smells awful to you? Also how about dogs and cats being served ? Would that make you uncomfortable? Wasn’t that bad before, whatever justification you keep on by minimizing the Modi era shit. So why do a lot of vegetarian people not like to eat in a non vegetarian environment? 1. The smell of meat is awful to people who have never eaten mean in their life. It is nauseating and makes you want to puke. 2. A lot of vegetarian people adhere to non violence. So meat being served on the same table makes you feel anxious and helpless for the animals killed. 3. A lot of vegetarian people do not like to eat in the same utensils used for non vegetarian food. They do not want to use plates and bowls in which meat was served or prepared. Non vegetarian people ... would you feel equally comfortable eating on the same table where cats, dogs, rabbits, silkworms, deer, elephant, cockroaches, ant flies, tarantula, snakes, human fetus, octopus etc are served? I'll have to advocate the vegetarians today, yaar. I don't get it. I eat everything, but if someone has a problem with meat, why can't they have a special place to sit and eat? I have talked to many vegetarians most people associate meat with trauma and animal killing, I think everyone deserves a safe space to practice what they want to. After all we're in a democracy. Why is it that you're making someone uncomfortable for following their faith? This unreasonable attack against vegetarians has to stop. In fact it's the only diet in the long run which is really going to reduce the carbon foot print on this planet. In another argument, I had someone brought up caste into this, it's despicable saying that vegetarians are upper-caste people, looking for a special place to eat, and start discriminating on them, there's no difference when you're a racist, if you attack a man based on his caste/faith you're despicable. These people did not say lower-caste are not allowed, this is a place for people to eat their diet, due to whatever reasons they want to, this has to be accommodated. Please stop and focus on better things. Protesting every small thing will only make us look dumb. edit: downvoting without an explanation, thanks. I can't believe you think practicing a diet is castiest what a fing non-sense, few of friends who are SC/ST have gone completely vegan and strongly oppose non-vegetarian food. I have also seen brahms drinking and eating meat, food is a personal choice, I just can't understand what goes into your mind, when you say \"pure veg\" is a castiest term. At risk of revealing my caste because these so called intellectuals make me do so. I'm a non-vegetarian I never had a problem with a vegetarian having special requirements. due to whatever reasons they chose to be one. this needs to end. It's not like there are no mixed eateries at IITB. This is just plain non-sensical to be pissed at someone just doing what they're doing because that's what they like to do. Isn't this discrimination... Imagine studying your ass off sacrificing your youth and then finding out you don't even have basic rights Why are you acting like people bring in live animal and slaughter it in the canteen.😂 Unless you are fixated on it, you really cant make out what kinda meat you are eating. Half the time I have to ask 'mumma ye chicken hai ki mutton hai?' 'Beef hai? Ok' How does meat being served, of an animal which is long dead make you feel anxious? I understand the moral highground, but if you are so easily anxious you should consult a therapist. I have had and even now have so many veg friends, in college and even now in the office. We eat on the same table. Never once have I had someone move away or getting anxious. If I was so uncomfortable I would move away to another seat instead of marking territory. Its cultural difference. If I have the one who has a problem I need to adjust and accomodate, instead of earmarking seats and shit. Why not ? At NMIMS they don't even allow you to get non veg from your own home. The audacity of some colleges. Bro, when was India inclusive? Are you from a parallel dimension Shhhhhhhhh !!! 🤫 You can't make sensible comments here. This subeddit is only for irrational hatred, especially towards Hindus and upper castes. You have been warned. Making sensible comments here might get you banned. Halal is simply what is permissible in Islam, and as far as food practices go, halal food is just food that has been sourced and prepared according to Islamic tenets. Nothing in Hinduism explicitly forbids something when it comes to food. Eating Halal food or having such food on sale doesn't go against the beliefs of a Hindu; anyone who claims otherwise is nothing but a Hindunat prick. There are sects of Hinduism that demand a pure vegetarian diet. Oh shit, sorry, I forgot Hindus are not allowed to have rights in this country. Demanding a pure vegetarian diet is not the same as having food habits explicitly encoded in religion. I bet those same Hindus would have a problem with Jews and their kosher food. Coaching centres and coaching oriented colleges have been coaxing students to ignore languages for a long time now, so it makes sense. Vegetarians believe in non violence? 😂😂 Are you kidding me? Woahh! Upper Castes (so oppressed) are facing a backlash for being dickrots for decades, colour me surprised 🤯. As a vegetarian I see nothing wrong with this, most of the vegetarians don't even like the smell of meat, fish etc. When I'm eating with my friends, we usually sit in a group but with the vegetarians on one side and the non vegetarians on one side and no one has a problem with that This is not related to religion or anything Lol, a shit-speaking budha. >Vegetarians believe in non violence Subah subah naya naya joke sunne ko mila 😂🤣 And no one is forcing to eat veg food exclusively either. It's better to keep them separate and accommodate the faith system of people who don't eat meat. Most of the hate here is unwarranted and, frankly, just reverse racism. I can't color you surprised, but I can color you a racist. By saying it's plant based meat/soya chaap and if they don't believe they can eat to check 🤣 They are not being forced to eat meat. I don't eat fish and hate the smell, but I recognise that in public places I can not demand people stay away from me when eating fish. If a Muslim demands that certain seats in a public canteen are reserved only for those who eat halal food (or Jewish demand that certain seats in a public canteen are reserved for those who eat kosher food) they are also wrong. Maybe the backlash has something to do with people who use religion as an excuse to demand ban on shops selling certain types of (or all) meat shops? Just a thought. It's not about casteism, they say pure veg because there are vegetarians who eat eggs sometimes, there are also vegetarians by religion but still like to eat meat. Pure veg only means strictly veggies and dairy products afaik and vegan is not even eating dairy products or anything animal related Then find your own spaces away from non-vegetarian spaces? There are many food smells people hate - I can't stand the smell of fish, some people hate the smell of durian. Many people in the West have a problem with the smell of our spices. Doesn't mean you as a student get to demand certain people can't use seats in a public canteen. I do get the other points though. Appropriate reaction might be to petition the uni for a separate section for vegetarians, not hanging up notices on your own. Also, nice job slipping in that human fetus in there. Very comparable to everything else. A certain group of people give jobs only within that community and that is forced world wide through certificates. That's the highest level of discrimination there! If it is a corner of 10-20 percent of chairs. I am fine with it. It is not discrimination. Just a private space. He's being downvoted for stupidity let them sit there what's the issue? You should understand that they're not comfortable with meat smell, few feel cringe looking at meat... did you talk to them why they've put that post before posting over here? Irony is talking about inclusivity and creating division by posting here instead of working together with them! >A lot of vegetarian people adhere to non-violence. Like beating a fellow human to death being under the suspicion that they ate meat? honestly, i get it. as a vegetarian, i do not want to see people around me. i never sit around people who are eating nonveg. but hey, thats just me, im not forcing anyone else to move These canteens are a public space. Not anybody's home. If you can't learn how to live socially with other people having different food habits, you are better of staying in your room and eating there. Or at the very least, just try to find out a corner somewhere to eat your food. No reason at all to designate a space with a specific condition and claiming that as your own. Their pet cow ate the English lessons book. Fuck you and your state. Maybe, they meant only Vegetarian food is allowed. If so, I'm still wondering, is there any place in the campus/canteen where the Non veg food can be consumed. Everyone in here complaining about reserving a few seats, probably a few tables at maximum for those who prefer to eat with no meat on their table. I'm guessing the entire mess isn't restricted to vegetarians only. Big deal, let a man eat in peace. Nobody is forcing anyone to do anything. Nobody is disallowing vegetarians to share a tabel with non vegetarians either. What's the harm if you are able to create a safe space for those who are genuinely uncomfortable about having meat besides them where they eat. Inclusivity means being able to create a safe space for everyone 🤷 To clarify, being a vegetarian, I don't have a problem sharing my table with those eating non veg. Though I can understand what some other vegetarians feel like. I see no harm in just letting someone eat on peace comfortably. Gosh It's like ayoo, waw That’s the point isn’t it- is it any more nauseating in India than the West? Meat is meat anywhere, I thought? How is it possible for folks to find the smell of meat so nauseating they cannot even sit next to certain people in India, but then when the cross the seas they have no problem being in such close proximity to meat and meat eaters? My parents have had to go to company office dinners or neighbors birthday parties in steak houses. But they will never step within a non-veg restaurant in India. The entire nation should adopt this. India a vegetarian country. Lmaoooo as if he can In India, vegetarianism is just another form of casteism. Try home schooling >Human fetus Be for real. I can't stand the smell of ripe jackfruit or cooked karela. It makes me want to puke. Abb? Like another commenter has said below me, no one is slaughtering the animals on the spot. A). B) \"Anxious and helpless\"? Do you drink milk, eat curd/yoghurt etc? Because cows are under immense stress then and us meat-eaters don't pretend it's some sort of superiority. How are you enjoying your morning of mental gymnastics? Go and tell Modi Ji to remove caste based reservation This. And one's command of English is often reflective of one's caste-class privelige. It is very much possible for people in good institutes to be good at their technical fields while not having a very good command of English. Ironic that a thread calling out casteism has a comment of this nature. Ambedkar Periyar circle busy doing this, instead of studying No wonder 25000 SC/ST students dropped out of IIT's in the last 5 year's I think this is not discrimination. It's like the issue with the third gender bathrooms. The gender is not comfortable using the other gender's washroom. In the similar way these vegetarians are not comfortable sitting beside a person eating non vegetarian...idk... couldn't relate. Is it that only vegetarian have acess to canteen or it is seperate space for vegans and non-vegans? Please explain. Yet these future engineers will have salaries more than almost any other Batchelors degree in India. In light of that I think most employers find their 'engineering skills' sufficient. Maybe this is the rarest case where the minority suppress the majority, because the closet non-vegetarians are too much of a coward to accept it in public. What a lot of doodoo I don't think it means impure. You can be pure veg or pure non-veg or pure *I eat anything that moves.* I don't understand why people are becoming so hateful. Ethical reason is one big part in why some people choose to be vegetarian. And it follows that some can't bear people eating slaughtered life right next to them. Care to explain what is stupid about this? My point is that one person's morality is another person's lifestyle. To the person who it is moral, the idea that it's just a lifestyle choice may be vile. Of course to the lifestyle person, imposing morality is immoral :-D. Neither side is wrong because they feel superior to the other? Or are they both wrong? 🖕 🖕 🖕 They got the spelling wrong, so not to worry. Besides, plants are living creatures, right? Or did that change? I don't eat meat but I don't understand the moral high ground that vegetarians hold when their food is also sourced from living beings. I wonder how shit would hit the fan if it was the other way around... \"No vegetarians allowed\" lol.. OP is lacking some knowledge of what is happening around him. This question is not about religion and should not be treated as a question about Modi. There are non-vegetarians in Hinduism. And vegetarians in every caste. Only Jainism has a taboo for non-vegetarian food. I get four or five wedding invitations from my Muslim business friends every year. In every wedding feast there is a SEPARATE PLACE for vegetarian food and more than half of the guests in that row are muslims. Equating food culture with religion is not correct. Lol reddit users with their downvotes. What's the point of discussion if you can't make arguments. So what's the main reason they don't eat meat ? If you care to ask around they don't eat meat because they don't like killing animals for food. Please enlighten me more the most learned one. Moral relativism is full of paradoxes. Suggesting that all moral views are equal leads to chaos and inconsistencies raises questions over protection of vulnerable individuals in such societies by justifying immoral actions. Universal moral truth transcends cultural boundaries . For example, most societies consider murder, theft, and lying as immoral actions, regardless of their cultural background. These principles are often based on the well-being of individuals, empathy, and the avoidance of unnecessary harm. Plato(Socrates) argued vehemently in opposing sophists when they said ,justice is beneficial of stronger or high minded foolishness. He rightly pointed out that it’s a function of internal harmony of soul, when reason govern the soul over appetite justice prevails. Under moral relativism , it becomes challenging to make moral progress as a society. Moral relativism can hinder efforts to improve ethical standards and promote a more just and compassionate world. So your parents and grand parents are uncomfortable right ? Whenever they can they try to avoid being in the proximity of meat. That's how it is for a lot of people. But in situations where it is impossible to avoid most Indians will suck it up too and probably eat it too. And welcome to the world if you think most people are not hypocrites according to what serves them best. I just started from the perspective of vegetarians. Some better arguments would be welcomed instead of a lot of doodoos. I mean you seem like a very smart person. I mean if that's your personal experience. If you eat meat how are you even alive? Don't you have vegetarian neighbours ? You seem like an extremely smart and well learned person capable of making better arguments. So this is a discussion forum people argue here. I am just stating reasons why a lot of vegetarians avoid meat. Just ask them if the like the smell or feel anxious. I mean if an introvert feels anxious while clubbing and dancing most of reddit users will advice to stay away from such places. It depends on person to person. I am pretty sure you stay away from ripe jack fruit and I would not cut open a jack fruit in your presence. Also human fetus is a delicacy served in some places. Yes I like mental gymnastics as much as you. Every one had a hard limit to the moral high ground. I am pretty sure even if you eat meat you wouldn't eat meat of certain animals. Why though it's just meat. Oppressor caste believe meat is impure for whatever made up reason they have and use it as a tool to discriminate against the dalit, bahujan and adivasi community. They call people impure, untouchable etc. I am just stating reasons for why vegetarian people in India avoid non vegetarian eateries. If you are Indian and have met vegetarians a lot of them avoid even eating in the same utensils. If both veg and meat are being served the utensils will most likely be the same. You are stating your experiences of how your fellow batchmates don't mind it ... I am telling you about people who do. That's not what moral high ground means. I have a problem with vegetarians claiming they are better people for having a plant and dairy based diet. Also the average person who consumes meat consumes animals that are bred specifically for that purpose. Personally, I don't see anything immoral with that. Umm. I am sorry for your life experiences. On similar argument basic. Oppressor religion folks belive non believers shouldn't have the right to live. Oppressor white folks believe black people are beneath them and should be slaves. Oppressor country believes the whole world needs democracy and bombs them to oblivion. .... Yada yada ... And a thousand more oppressor arguments. No am Dodo! > Universal moral truth transcends cultural boundaries. Who made you the arbitrer of universal moral truth? Most societies didn't consider racism to be immoral. Just because now it's in vogue to consider it immoral, doesn't mean it just started being immoral. It always was. I don't think most vegetarians claim they are better people or morally superior people. They just impose it on themselves that they won't kill animals for their own food or breed animals for the sole purpose of killing them for their food. Whataboutism will get you nowhere. This is an Indian sub talking about indian problems. In India majority are hindus, and the majority religion practices oppression against the dba community and that's a fact with empirical evidence. Racism, imperialism is also bad but it's irrelevant to this conversation and tries to diminish the oppressor caste hindus' cruelty and viciousness towards the minorities. bade gadhe insaan ho bhai Whataboutism will get us nowhere. Atleast we are on the same page on something. I stated reasons why vegetarian people do what they do. A lot of Brahmins eat meat too and a lot of Dalits are vegetarians. I am retarded so I couldn't understand your argument better in the context of what I was talking about. Explain like I am five. There are pure veg housing societies here Discrimination and hate has always been immoral (it lead to insecurity, violence and harmful to any society). Racism isn’t moral value of every culture, every enlightened being knew that it was wrong. It was slavery, racism, casteism was forced from one dominant group on other it wasn’t moral value and accepted by everyone. For example theft, even a thief knows that stealing things is wrong and consequence is fear of being caught, a thief never wants his children to be thief as well (and would happily want out by some mean).. How many gencat students dropped? \"Well killing innocent animals is also immoral. Every enlightened person knew it and did not want to associate with people who indulge in that.\" You see the problem with making such blanket statements? And for the record across our history most people who induldged in discrimination didn't think it was wrong. The perpretartor of an immoral act doesn't get to decide if it's wrong or not. If they know it's wrong all it makes them is a hypocrite. But the morality of an act is independent of whether the thief knows if its wrong or not. Yes it’s immoral to harm intentionally It wasn’t like that before, some fringe stuff here and there but modi and his hindutva brigade are doing this nonsense on an industrial level. Guess we know where to find Sudha Murthy when she visits IIT Bombay campus. What so now just because your state indulges in caste discrimination, you can't think it's disgusting or reprehensible? Ah yes 2cm taller and can you see that average height of indonesian men is lower than Indian men . Last time i checked they have a very meat rich diet . If eating meat makes you smart then why do we have more medals in intenrational olympiads ? Why are we much ahead in terms of research from Pakistan ? Someone said the most sensible thing in comments \"correlation is not causation \" and that comment has 3 downvotes for some reason. And about the 'casteist diet ' thing . Do you think there are no sc/st who are vegetarian? They don't eat meat not because of the goodness of their heart, because handling of meat and dead animal and animal products were lower caste activities back in the day. I believe if you are doing it for ethical reasons then you should be vegan. Vegetarian doesn't cut it. You are still using dairy which is pretty much the only reason in some places certain animals are bred. Discomfort is not a good enough justification for state/school/institution mandated segregation though. I’m really allergic to peanuts, as in I will have a reaction if I accidentally swallow a peanut product. Do I tell my friends with peanut butter to not sit with me? No. I carry my epipen and live with it, because the act of eating is a right that everyone has and it is my responsibility to manage that discomfort. When did IIT become good english speakers ? what does iit have to do with english ? It aint a NLU bruh The Aztecs were the minority, but they oppressed all the other tribes in the surrounding area. The Spanish were the minority, but they oppressed all the other tribes in the area, (including The Aztecs now). The Mongols were the minority in the greater region, but they oppressed ... British... Romans... My point being, suppression and oppression is not a function of majority minority, but of perception of raw power. Vegetarianism, like the English language and the color of a fair skin is ***perceived*** to be superior, and thus the power is projected hence-way Looks like propaganda. Sometimes Ambedkarite groups do this to instigate an uproar. Surely there are CCTVcams to check \"which\" student did this. It's not like non vegetarian people don't have a place to eat. Vegetarians are a minority in most places. Only about 15-20% of Indians are vegetarians. There will likely be 15-20 messes and another 8-10 restaurants in school / institutions which is being talked about ... Only 1 or at Max 2 will be purely vegetarian where they don't use utensils which has been used to cook eat meat. Some might not even use onions and garlic in their food for certain months of the year. There is no mandated segregation which is meant to be evil against non vegetarians. It is economics ... Where do these 20% vegetarians go to eat if there is no place where purely vegetarian food is served ? Every city or place you visit in India you will see about 4-5 purely vegetarian restaurants for every 300-400 restaurants which serve both veg and meat. Must be the guy who runs the Mess, it's not a Students' job. Authorities said that the culprit is unknown and all the posters have been removed... idk the rest What's the point of sitting separately, let's assume you got offer in Google head quarters in California, you are going to sit next to a beef eating pork eating crowd in that cafeteria. I believe that’s the case with all of Reliance offices. So they are okay with raping a cow and stealing it’s child’s milk, using leather, eating capsules or gelatin or wearing silk? No because I’m not an adult intolerant bitch. You fuckers sound just like the British who did not want to sit next to “darkies who smell like curry.” If we want to be clear a lot of the Vedic diets render the water with nauseating body odor. One neighbor in LA did the Hanuman diet and between the restricted food and bathing that couple smelled horrible. If he had not worked from home I wonder if there would have been HR complaints. But they were cool, so we would arrange things out doors like hikes, picnics, etc. And when they invited us for Diwali we just handled it like when we invited them for Eid, they just handled it and we all go along great. Simple answer: don’t be a bitch, be kind, handle differences that are purely sensory but don’t matter otherwise. Also, our Philipino neighbor patriarch regularly invited us over for pork and dog roasts. No big deal! We at the salad and had an extra beer. Same here. People, Indians are as racist and intolerant as anyone they complain about anywhere else. One reason I’ve refused all the opportunities to “return home.” Bitch, I love my Ribeye and red wine. The Hindus will kill me for the first and my own family will hate me for the latter. Better off in a real liberal open society. and never will No one has to eat veg food, but they have no right to say you can't sit here.. If you don't want meat, don't eat meat.. By your logic most non vegetarians are okay with raping cows and whatever animals they breed for meat, leather and other animal by products? Sure, but I’m not convinced vegetarians need a separate place to eat. That’s my contention. Ahh I see, I was thinking canteen = dining hall, I think the decision of having a vegetarian canteen should be left to the campus majority not make it a political issue on reddit though Yeah bro idgi how people are unable to manage sensory discomforts so much so that they are willing to prevent certain people based on personal background and preferences to sit with them. Kicking out a peer from my group college dining table - an equal to me — because of what they choose to eat? Nah homie that to me is as morally wrong as eating meat is. Where they line is drawn is pretty telling. What if someone hates the smell of garlic or Indian spices? What if someone finds it morally objectionable that a vegetarian eats dairy products that are the result of raping a cow (fyi, I think vegetarianism is immoral just as much as meat eating is. But I don’t enforce my beliefs on others because food is extremely personal). Also, what about the discomfort the other group of people might feel for being excluded from a table - why are we prioritizing one persons discomfort over another? Also, if you’re pure veg or veg or a carnivore or gluten free or whatever, no one is obligated to cater specifically to you in a public space. You’re food is your responsibility. Nothing wrong with vegetarian restaurants or bringing your own utensils to a table and sitting across from someone eating a chicken curry - it’s not going to kill you or send you to Hell. It is however wrong to tell the person across from you to move because *you* do not like what they are eating. What gives you the authority to do that? > Some **students had put up posters proclaiming “Vegetarian only are allowed to sit here” on the canteen walls** and they would even force those who prefer non-vegetarian food to vacate the place, the student said. You missed the point where some vegetarians don't prefer to use utensils where meat is being cooked. This is the main reason there are pure vegetarian places. Dining in the same environment will mean that the plates and the cutlery and the cooking equipments are interchangeably used for both meat and vegetarian. No one has the authority to tell people to fuck off from the table hence they have pure vegetarian restaurants so that people know before hand what they are getting into. Just like how you feel that non vegetarian people are forced to fuck off because some vegetarians don't like the smell or sharing utensils... likewise vegetarians feel that you have already asked them to fuck off or deal with the smell and share utensils. It's not like both of these people don't have options. Like I said for 1 mess for purely vegetarian people there are 10 more places where both kinds of food are being served. We were never forward. My point missed you. There’s nothing wrong with having vegetarian restaurants or seperate lines for vegetarian food. But why is IIT Bombay having or enforcing a policy where vegetarians have a specific table or section of tables to eat? You are conflating to separate issues - the preparation of food in kitchens (fine should not touch meat and should be segregated), vs the consumption of food, which should not be segregated. very progressive india becoming a beyond developed nation... /s... not expected from an elite institute like iit b... You should visit IIT Mumbai and ask the people there if they mind. So where does the plates go after the food has been consumed ? In the same dishwasher ? It might be just one small place for about 20 people. There are 18 messes in IiT Mumbai where both veg and non veg food are served together. Also there are about 20 restaurants within campus which serve both kind of food together. There are 6000 people living within the campus. 5880 people have places to go where they can have chicken and paneer together on the same table. Also the issue in the article is some students reserving a few tables. It's not mandated by the institute. You could say it is an issue of bullying maybe. Also each mess has about 40 tables for students to sit and eat. Maybe some students thought of reserving one table for themselves. Nope, they are entitled to have a zone for themselves. It's about accommodation of someone's belief systems. Their belief system is not eating meat.. no one is forcing them, their belief system doesn't and shouldn't interfere with a person's freedom to sit where they want. It's all about creating a space. And such spaces will be created if there is sufficient demand. Baap ki jagah nhi h Jahan marzi baithne k liye. >Baap ki jagah nhi h Jahan marzi baithne k liye. Defenition of public space is it can be equally used by everyone .. maybe you lost the idea of a public space.. >It's all about creating a space. And such spaces will be created if there is sufficient demand. It's not required. Your food habits must not interfere with others freedom. It should be limited to you. Here's the tricky part. Canteen and messes which are a service do not have to be public space as such. They have their own exclusive criteria. And yes, such services are provided after tender is floated for a contract with cooking services. And they are funded from the students' fees. So, they are entitled and should be thoroughly honoured. Here is the non tricky obvious part.. mess works on fees paid by all students , not just vegetarian students. Tenders are floated to include vegetarian food.. and non veg food as preference, tenders are not floated to restrict someone from sitting in a place And here is another fun fact, since it's paid by all students equally, it becomes a public place for students where any student can use it irregardless of his caste, creed, race, or dietary preference.. So it's not paid by veg people alone, hence they don't deserve special preferences ... If they don't want non veg people occupying seats, make your own personal thing with your own personal money.. Train also runs on your money, will you board a train and say no one should sit beside me because it runs on my tax money? What a stupid arguement you have made here Pussy asses who reported my comment Agree. Lol parents love to say “india is such a vibrant country of different traditions.” That they mean to say is “India WAS beautiful when it was all vibrant Hindu traditions.” Your obvious point is wrong in qualifying messes and canteen as public space when it is clearly run by a private entity. Trains is not even the same example as this. Messes and canteens are run by students for all students.. not just vegetarians.. that's the obvious point. Vegetarians are not and should not be entitled for shit like this They pay the canteen or mess to provide food . That's it The mess and canteen space is ultimately run by college and the food preparation is only the one which is given out on contract basis . Train is just an example, you can apply this in any case.. Your words, not bine - you are the hypocrite, afterall What ? Doesn't even makes sense. You are the one who implied breeding animals is raping them for your own use. Yes, you breed them, get them raped, even boil them alive for your needs. Then preach hate in social media. That is not casteist but that is ignorant. Not understanding that usage of such terms can cause harm in the form of division in the society. Not putting effort in changing your usage after knowing this is definitely being casteist. What about LPU then they are fully vegetarian, would you call them casteist too, stupid indians in the comments. Non vegetarians indians don't even respect vegetarians and you think it's vice-versa."
}