{
    "id": "1abzw80",
    "title": "Israel-bound Indian workers | Risking life for a living",
    "url": "https://www.thehindu.com/news/national/risking-life-for-a-living/article67780046.ece,",
    "selftext": "Non paywalled link: www.12ft.io/https://www.thehindu.com/news/national/risking-life-for-a-living/article67780046.ece,",
    "flair": "Policy/Economy",
    "score": 37,
    "num_comments": 5,
    "created_utc": 1706321932.0,
    "convurl": "https://external-preview.redd.it/RjDZ-h3FQKbX9tT1SxbfdF5JMqal-9zZgvtZ2RpADWc.jpg?auto=webp&s=699d1c111034d413080cfe7a4e8c2550b72ee795",
    "comments": [
        "At this point I can’t feel anything anymore. \n\nAccess to food, water, shelter and job opportunities are some of the most basic things human beings are ENTITLED! \n\nWhy don’t we feel that entitlement towards the most basic things and fight against Governments who deny these things? What will it take for people to start demanding that from the Governments?",
        ">What will it take for people to start demanding that from the Governments?\n\nPeople are still drunk on Ram Ras, I don't think they will demand anything from the present Modi govt. In any case there may be riots targeting minorities as they will be shown as the reason India is in this position.",
        "Oh man, I saw the video from Deutsche Welle I think. On one side, the people celebrate the biggest event in the country - a temple. On the other side you’ve exodus of people either they are leaving for education/ work irrespective of their social class. That normal distribution post I just saw on the sub is so on point",
        "This must be a pre \"pran prathisthan\" news. Post that hunger/unemployment does not exist anymore.",
        "I don't get it, if they can make it in a war torn country, why can't they make it here in India?"
    ],
    "cleaned_text": "israelbound indian workers risking life living non paywalled link ",
    "cleaned_title": "israelbound indian workers risking life living",
    "cleaned_selftext": "non paywalled link",
    "cleaned_comments": "point cant feel anything anymore access food water shelter job opportunities basic things human beings entitled dont feel entitlement towards basic things fight governments deny things take people start demanding governments take people start demanding governments people still drunk ram ras dont think demand anything present modi govt case may riots targeting minorities shown reason india position oh man saw video deutsche welle think one side people celebrate biggest event country temple side youve exodus people either leaving education work irrespective social class normal distribution post saw sub point must pre pran prathisthan news post hungerunemployment exist anymore dont get make war torn country cant make india",
    "light_cleaned_title": "Israel-bound Indian workers | Risking life for a living",
    "light_cleaned_selftext": "Non paywalled link:",
    "light_cleaned_comments": "At this point I can’t feel anything anymore. Access to food, water, shelter and job opportunities are some of the most basic things human beings are ENTITLED! Why don’t we feel that entitlement towards the most basic things and fight against Governments who deny these things? What will it take for people to start demanding that from the Governments? >What will it take for people to start demanding that from the Governments? People are still drunk on Ram Ras, I don't think they will demand anything from the present Modi govt. In any case there may be riots targeting minorities as they will be shown as the reason India is in this position. Oh man, I saw the video from Deutsche Welle I think. On one side, the people celebrate the biggest event in the country - a temple. On the other side you’ve exodus of people either they are leaving for education/ work irrespective of their social class. That normal distribution post I just saw on the sub is so on point This must be a pre \"pran prathisthan\" news. Post that hunger/unemployment does not exist anymore. I don't get it, if they can make it in a war torn country, why can't they make it here in India?"
}