{
    "id": "15a6enn",
    "title": "Hi I am Zareen Khan. I’ve starred in movies like Veer, Ready and Houseful 2. Ask me anything about films, characters, acting, life, my journey, and social topics. Ask away!!",
    "url": "https://www.reddit.com/r/india/comments/15a6enn/hi_i_am_zareen_khan_ive_starred_in_movies_like/",
    "selftext": "EDIT - 'THAT'S ALL FOR NOW .... THANK YOU ALL FOR MAKING THIS SESSION SO INTERESTING .... SEE YOU SOON' ❤️\n\nhttps://preview.redd.it/48wtnx4cdbeb1.jpg?width=1244&format=pjpg&auto=webp&s=2a77b0a2e2aa63771412c668e5b28406d73843b6",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 686,
    "created_utc": 1690379378.0,
    "convurl": "https://b.thumbs.redditmedia.com/IuWMBANZ6lgSOKhw208HswO0aFPS1BGuRP4j5Dm5-aE.jpg",
    "comments": [
        "I just loved you for you good looks and also as an actor since my childhood (veer days) I just hope you make more such good movies and continue working",
        "What do you dislike the most about Bollywood industry?",
        "I'm still confused between her and Katrina Kaif",
        "Hi Zareen, which movie you regretted refusing and why?",
        "How was it like to work with Bhai? (Honest Review Please)",
        "Hi Zareen, good to see you. What is keeping you busy these days ? Any upcoming projects ?",
        "How hard do you think it is to make it in the industry as an outsider?",
        "How difficult was it to enter the film industry being an outsider? What tips would you give an upcoming actor/model? I tend to get hit on a lot by big producers and I run away from supposedly big opportunities",
        "Hi Zareen, People compared you a lot with Katrina Kaif in your early days in Bollywood. How did it make you feel and did it have any impact on your career?",
        "Hi Zareen, would you like to explore OTT platform?",
        "Hi Zareen! What are your upcoming projects?",
        "Which has been the most challenging role you have taken and why?",
        "Is Salman a good co-star?? Who was your favourite person to work with in movies?? When can we see you again in a movie???",
        "Among all the Bollywood films you've been a part of, which one holds the fondest memories for you, and why?",
        "Hi Zareen what do you do for spirituality? Are you spiritual?",
        "Hi there beautiful person!\n\nOn a scale of 0 to 10, 10 being the best, How much would you rate Bollywood based on your personal experience?",
        "Your fitness journey is awe-inspiring. What kept you motivated?\nBtw, I love you so much <3",
        "Hi Zareen Are you enjoying the trolls about you",
        "Sometimes my friends and I talk about how similar your and Katrina's genes are! Did you receive any similar compliments before for your looks and resemblance with Katrina?\n\nMuch Loved your first movie Veer and Ready🙏",
        "you could collaborate with any actor or director in the world, who would be your dream collaboration, and what kind of project would you love to work on together?",
        "Hi Zareen who is your favourite actor and actress",
        "Any misconceptions people have about being an actor or influencer?",
        "Hi Zareen what's the one advice you you would like to  give to an outsider in Bollywood",
        "If you could play any iconic historical or fictional character, who would it be and why?",
        "Hi, Zareen how do you deal with the constant comparison with Katrina Kaif still?",
        "Thank you ... keep the love and support coming ❤️",
        "How do you grow thick skin... people talk so much shit about you and influencers in general....how do you not get affected by all the negative comments",
        "I always thought she was Katrina kaif when I was a kid😭",
        "Who would you love to co-star with?",
        "Are u having any upcoming projects",
        "Can you share a fun or unexpected experience while shooting a film set that we might not have heard before?",
        "Hi Zareen any plans to do contents in south",
        "Do u have any upcoming projects",
        "Tell us the juciest thing you know about the industry without taking name",
        "People working on the basis of friendship rather than talent.",
        "Aap aur Katrina Kaif dono alag-alag ho kya? 😌",
        "Gawk gawk",
        "Has body shaming reduced in the industry?",
        "Favorite show this year and favorite music? Also are you dating?",
        "Intimidating !",
        "How did you land your first role?? How was the overall experience and is the industry as bad as they say for the outsiders??",
        "Hi Zareen, What is one thing you appreciate about Saman Khan and what is one thing you absolutely hated",
        "Haven’t seen you in last few years in any movies, what are you upto now?",
        "Don’t let the Illuminati get to you, Zareen. \n\nYour life is precious, remember that.",
        "Why is that Jin actress ko Salman bhaijaan launch krte hai unko kaam milna thodi mushkil ho jaata hai",
        "Since you are a foodie, I'm curious, which is the best food you have *ever* tried? Please give one answer that you can eat for less than 100 rupees and another for like 5,000 rupees.",
        "Hi Zareen screat of your fitness",
        "Love from pak I saw this AMA what's one thing we don't know about you so far that u'd like to share",
        "Do you have any plans to do roles  in South Indian films?",
        "That is what salman wants and why he introduced her. Just like he did with Sneha",
        "How's Bhoi on set? Please honest answer",
        "What are the real criteria to become an actor in Bollywood?",
        "I think you are fake",
        "Hey,\n\nQuite a few things actually... working on developing few things which I'll let you all know in due time 😊",
        "have you ever given auditions for a hollywood movie ?",
        "Hey Zareen, which actor you feel you had the best on-screen chemistry with!!?",
        "Hey zareen can you answer this question \n\nBillo Bagge Billeyan Da Ki Karengi,\nBagge- Bagge Billeyan Da Ki Karengi,\nBillo Bagge Billeyan Da Ki Karengi,",
        "Waise aap ho kon. Na kabhi dekha na kabhi suna. Aaj first time hai",
        "Which city around the world left a lasting impression?",
        "Ever plan to visit Pakistan for some project?",
        "Your favourite co star in Bollywood !",
        "What's on your bucket list?",
        "Hi, I hope you’re well!\nIf you had an opportunity to work in any film industry (Indian or otherwise), which one would it be and why?",
        "What's the Dark side of Bollywood which very few know",
        "Share your best and worst experience while shooting a movie",
        "Hello ma’am, I loved your character in Veer. I would like to ask you from all of the characters that you have played, which has been the most relatable to you?  \n\nI Wish you well <3",
        "Amazing how you managed to to transform. What type of fitness regimen and mental strength did it require? Any sacrifices you had to make?",
        "Do you feel like main stream Bollywood can't make good comedy movies anymore for the theatres without being downright offensive or idiotic? Say, movies like Housefull 4 we're full of ableist jokes, while intelligently made films like Kathal/Monica O My Darling choose OTT releases because they think they wouldn't find an audience in theatres. As someone who's been in so many commercial movies, what's your take on this? Should more heavyweight actors lend their starpower to such niche projects?",
        "Hi Zareen! Hope you are doing fine. Which was the last movie you saw that moved you?",
        "Hey zareen! I loved you when I saw you in veer and bole bina mera nam aya song..\n\nI want to know what do you wanna say to all girls out there struggling to accept and love their bodies",
        "How do you feel about salman seeking out lookalikes of his exes?",
        "Is any ott webseries or movie coming?? And you are really gorgeous 😍",
        "Which is your favourite movie?",
        "Casting couch experience?",
        "Love or support to ma'am aata rhega aap bus movies aane do",
        "Right now.... Quite hard esp. if you aren't an A\\*\\* licker !",
        "your bio says \"much more than an actress\". what are you?",
        "I saw you in chanakya movie where you were an agent.\n\nBtw is nepotism a big thing in Bollywood as many say.",
        "Rehnde bhayii tumlog se kuch nai puchna",
        "How much your nose job and lip job costed? And who did the surgery?",
        "You look awesome what's the secret?",
        "Kis hero ke saath kaam krna is dream for you ?",
        "Your fitness journey has been an inspiration for many, who has been your inspiration?",
        "Is there a club or cult for people who are immensely rich or famous ? \nAlso would you prefer a person from your industry for your better half or from some other buisness/job/ceos? (Explain your answer for 5 marks XD)",
        "Your take on the Sushant Singh Rajput fiasco? \n\nMurder or suicide?",
        "What movie you wanted to star in but didn't get the chance?",
        "Without naming the actor - can you give an example of a star tantrum which surprised you ?",
        "Hi Zareen! Thanks for doing this :) As you've done movies in both North and South, can you tell us more about any major differences between the production experiences?",
        "Hey, how did you feel after acting in hate story? Did you think it will pull into the big league or stay the same?\nBy the way, any new movies coming in ott or big screen?",
        "I didn't even knew who are you until I saw your name imo you're one of those people who people might know about but no one really knows your name",
        "Barbie or openheimer ?",
        "What's your all time favourite movie?",
        "You did quite a few movies in the industry 😏\n\n/s",
        "First of all Big fan of you n your acting. Why you do very less projects?? We need more of you n also you're my crush since veer love you ❤️❤️",
        "How's akshay and John as co stars? Love their chemistry",
        "One of the most beautiful actress I've come across! Been a huge fan.. Hope you're doing well ❤",
        "Oh my God, I can't believe I watched you in ready it was your best performance of all time for me i hope you keep growing wishing the best life ahead",
        "What was your experience while working on Jatt James Bond and Punjabi film industry as whole ?",
        "What are your favorite movies in hindi english n from other indian languages movies. Also what are you watching these days",
        "What other jobs would've you been interested in if not acting?",
        "What's the meaning of your name?",
        "Heyy Zareen. What do you feel about the remake of Character Dheela? You and Bhai had immortalized the song in our brains.",
        "I don't have any questions for you but I want to tell you that I have always liked you as a person. I hope you're doing well and continue to do so in the future.",
        "Hey zareen, what's your taste in music like?",
        "How did you got your first break?",
        "Just want to say you are amazing and so gorgeous! 😍",
        "Apart from movies, what are the things you enjoy doing which people won't necessarily know about?",
        "Is casting couch a real thing in Bollywood? And did you faced any such incidents?",
        "Hi! What was your favourite movie you took part in?",
        "Hi ,\n\nSo when I entered this industry , I was literally like a lost child since I don't come from a filmy background so it made me feel really happy being compared to Katrina as I was her fan too and found her really pretty. But it backfired on my career as the people of this industry din't give me a chance to prove my individuality.",
        "Hi, nice to see you here on reddit. Which one of your work one should watch first if one is yet to see any of your movies.",
        "bhoi has a type",
        "Hi Zareen. Do you put curd in your maggie?",
        "Hi zareen. Simple question how are you doing? How's life?",
        "Is there any moment when you decided to give up?\n\nIf so, then how did you recover?",
        " You are damn beautiful.. always keep that in your mind :) :)",
        "Just want to say you are extremely beautiful and I love your Youtube Videos. They are wholesome💗 I watched your makeup collection video and I was so happy that you use drugstore makeup just like me. Kinda \"aww\" moment for me.\n\nOn that note, keep shining✨️",
        "Barbie or Oppenheimer?",
        "You've been part of many mass masala movies where the actor, director, or producers have been known to be eccentric and/or not concerned about conventional film making. Yet, somehow, these movies still make money due to an ardent fan following for the leads. When you are on these sets, is it hard for your to get your voice heard as an artist? Or do you just approach them as a way of making easy money, since you don't have to use your brain so much owing to the one-dimensional nature of the characters?",
        "How tough it is to be an influencer and deal with all the negativity? how do you cope with the social media pressure?",
        "Hi ZK..! \nIt's always a pleasure to watch your movies. \nWhat's the most interesting project u working on nowadays and when will we see u in action in ott Or silver screen.? \nAlso have u seen \"white lotus\" and do u think anything like that show is ever possible in bwood not now like ever ?",
        "Hello Zareen, nothing to ask, just going to ask, how are you? How's life?",
        "Definitely !\n\nHave you watched 'HUM BHI AKELE, TUM BHI AKELE !' on Disney Hotstar?",
        "Thoughts on Barbieheimer?",
        "ok so are you like in touch with the gen z lingo and all the trends and stuff that you contribute to pop culture, like all the stuff. idk this dont seem like a question but something?",
        "Hi Zareen! Would love to see you in a psychological thriller on the lines of Se7en.",
        "Honest answer please .... Are we getting replies from you or someone in your team ?",
        "You should start a vlog channel :D would love to see it",
        "Reddit pe kaise aana hua?",
        "Nice to have you here,  I missed you!",
        "who is your favourite actress amongst thess kareena deepika priyanka alia",
        "Now last Salman related question. Does he plan his look in his films himself? Because most of them don't look like they're done by professional makeup artists.",
        "Next/upcoming movies?",
        "Hi, hows your journey so far? Do you ever feel like switch career or try something more different ? :)",
        "Hi Zareen, did u try venturing to other movie industries in India, did u get such offers from outside Bollywood",
        "What's the biggest movie you have ever rejected?",
        "yeah enjoyed that.",
        "Do you use reddit generally?",
        "What are some toxic Bollywood standards that you would like to call out?",
        "I will have to say - Princess Yashodhara from VEER !\n\nBecause I've been a complete tomboy all my life , and playing a princess was like a complete 360 degree turn.",
        "Nepotism is common across many industries in India… raw talent isn’t enough in many cases, sad as that may be.",
        "Yes I saw the trailer I will try to watch",
        "Thanks for detailed response, good luck for your career and life ahead!",
        "Have you ever come close to working with Shah Rukh Khan? If yes, then why didn't it happen?",
        "What role do you feel has the been the most iconic for you\nAnd also the most iconic for the audience?",
        "Why do you think you need a Reddit AMA atm?",
        "What was the difference you felt between the Punjabi Movie industry and Hindi Film Industry? I always wondered how lesser known the punjabi industry is, admired your work there. Be honest with the answer",
        "Is casting couch real?",
        "✌️",
        "Marketing team me intern ki post h toh refer kar dena baaki kaisa sab chai-paani ?",
        "Is casting couch real? For everyone?",
        "How is Salman Khan really? Like real life behind the stage?",
        "\nAnd do you think nepotism is stymieing our ability to make good and meaningful movies and also music- not the cringe stuff that is being served currently? \n\nOR awe are just not able to make good and creative stuff (knowing fully well even movies like Sholay was copied and renowned music producer or the past copied shit straight - not ignoring the recent ones)\n\nOR is it something else",
        "Have you tried to work in any film industry in India other than Bollywood and Tamil/telegu?",
        "Hello, what's your take on casting couch and is it a real thing.\nHave you ever been approached to take on a role in consideration of other favours ?",
        "Hi Zareen, can we expect any projects in the near future",
        "Hi Zareen, big fan. Had a question for you. \nWhat’s your fondest memory or moment while filming?",
        "With whom you don't wanna work again? And why? ( specific name )",
        "enjoyed that",
        "Scary Bhai",
        "Cosmetic surgeries for better aesthetics? Any?",
        "Hi Zareen\n\nIf dostana 2 had a sex change, who'd you want opposite you?\n\n(#KWKseChuraya)",
        "Can you share your weight loss journey and how do you keep yourself so fit?",
        "Hi zareen, hope you are doing good.\n\nHow bad is the scene of casting couch and sexual exploitation withing the industry? Is it prevalent among big production houses also?",
        "I really wished you would do good in Bollywood",
        "How bad was your accident in Goa?",
        "Hi zareen,\n\nI wanna know about the casting couch, if it exists.",
        "Hi ZK, if you could have just ONE super power, what would it be and why?",
        "Yeah it's almost uncanny",
        "Kadi which pawaya ayi?",
        "360 degree actually takes to the same point. It means you’re at the exact same point as when you started . You probably mean 180 degrees.",
        "Hi,\n\nI don't think one has to force spirituality... its something that should come naturally .\n\nI see and know of a lot of people who burn candles and give long talks about spirituality but in their reality , they are far away from practising what they preach. \n\nI feel spirituality is about doing good deeds and being a good human irrespective of any race and religion.",
        "Hi Zareen!!! I had a huge crush on you as a 10 year old when I watched \"Veer\". How was it like working with Salman Khan? Do you have any upcoming projects? Are you religious? If yes, how do you manage your religion with the industry you're working in?",
        "What's your skin care routine?",
        "Ever feel guilty of always posting photos with a lot of make-up and heavy airbrushing/photoshopping applied and thus promoting unrealistic expectations for BOTH men and women?",
        "Hi Zareen, why didnt do any movies down South??",
        "What prompted you to do an AMA on reddit? I don't see many official bollywood/hollywood celebs around.",
        "Are you a bot?",
        "Kinda unrelated but does the industry not treat it's musicians well? I have thought about it for some time now.",
        "What music you listening nowadays?",
        "So I get to work with you if I lick your ass? Damnit, I'm in /s\n\nHave you ever had to say that? /s\n\nS for serious/sarcasm (a trick you can use to reveal the truth too)",
        "Did you like doing Jatt James Bond lmao?",
        "Welcome to Reddit, Are you active in movies or switched to entrepreneurship? How would you rate u r life before and after getting into movies?\nHow bad is the casting couch for people from outside the industry?",
        "Your favourite all time movies?",
        "Hi Zareen! What has been the worst experience for you in Bollywood?",
        "Hi Zarine, i have had a massive crush on you since I've seen you on the big screens. \n\nSeeing as this is a platform that brings one closer to talking to you, my question to you is what are certain interests you have outside of the world of glamour and the movie biz. Do you have any vested interests in topics like Pop-culture, art, etc;",
        "Hey zarin, even I come from the college (Rizvi College Bandra) from where you were, so I wanted to know how was your college life how would you experienced those day's!",
        "Now… aap aam chuske khate ho ya chhilke?",
        "Hi Zareen, \nThank you for your hard work we got to see enteraining career of you. Can you follow me on instagram 🫣",
        "Hey Zareen!\n\nWhat are your thoughts on the non Hindi movie industries in India? Do you plan on venturing into them anytime soon?",
        "Hi, Who's your favourite actor in the current generation ?",
        "Hi Zareen i wanted to ask as somebody who has worked in so many movies, what are personally your top 3 favourite movies of all time? hollywood and bollywood both included",
        "Awwww lots of love to you too.\n\nWell , my fitness journey started way back in my teens bcoz I was an obese teenager .... and I started that journey bcoz I wanted to and not bcoz some1 told me to or bullied me .... and I loved every bit of the benefits I got out of it so now I have incorporated it as my lifestyle.\n\nI don't aim at being size 0 .... I aim at being physically fit and strong and away from chronic diseases.",
        "She looks like lovechild of Katrina Kaif and Sunny Leone",
        "Your current WhatsApp dp?",
        "tu footpath pe mil",
        "Hi Zareen, what are some things you are passionate about, other than acting?",
        "Oh I love it ! 😂",
        "Hey, who convinced you for AMA on reddit?",
        "Hi Zareen!!! Who do you think is the most real person amongst all the celebrities you've known",
        "I think she meant the role was polar opposite of what she is like actually in real life",
        "Is it just me or she looks AI generated ?",
        "I have 3 questions , but I am not sure I should ask my third question or not …\nBut just for my curiosity…\n1-: how should we go for auditions like how would we get to know which auditions is going on for new movie or series or show etc .???\n\n2-: is Bollywood really toxic?? And how was you experience with Salman khan ??\n\n3-: you are a Muslim , and these movies and musics and all are haram according to Islam then how come you are doing this till now and what about your religious beliefs if u r following this movie life ??(just for sake of curiosity because sana khan, dangal actress etc have left movies for Islam ) …",
        "Hey Zareen, in which films remake would you love to do leading role ?",
        "Hi zareen any upcoming movies or shows haven't seen you in a while in the main stream what have you been upto during the break",
        "Are there any upcoming movies you are looking forward to watching?",
        "Hi Zareen! According to your experience, could you name an actor n actress who's genuinely very kind n nice in Bollywood?",
        "Hi Zareen,\n\nWhat do you think the impact of OTT has been on the film industry in general, and do you think the movie theatre industry will go extinct? \nDo you make a choice between movies and OTT series? Do you have any preference?\n\nAlso, do you see the southern movie industries and hindi film industries merge in terms of actors jumping from one industry to another, and casts representing all regions? \n\nThanks! \nPs: would like to see you in more movies/series, good luck.",
        "There are so many .... the list is endless ....\n\nIMITIAZ ALI \n\nANURAG KASHYAP \n\nSANJAY LEELA BHANSALI \n\nRAJKUMAR HIRANI",
        "Hello, hope you’re having a good day.\n\nDo you think nepotism is getting better as compared to earlier?",
        "Hi Zareen, \nBig fan of your tig bits. How do you maintain your body - diet & workout plans ?",
        "Are u from a good family background as surviving in the industry is very tough monetary wise",
        "Who is your favourite co-star, Zareen ji?",
        "You are an amazing actress zareen .....Hope to see you in a superhero movie someday",
        "If you dont like it move on na. Let the fans comment.",
        "Does body shaming affect you? And was constant comparison w Katrina annoying?",
        "Hi Zareen, good to see you. Had a major crush on you when the character dheela song released.\n\nWhat are you working on these days? How has the pandemic changed your life as an actor?",
        "Hi Zareen, was there a script which you thought was bad and it became a hit ??",
        "Hii Zareen! Just wanted to know that is bollywood a safe place to be in? and are actors/actresses actually humble/kind compared to their on screen persona.",
        "No one in Hollywood?",
        "Zareen why are we not seeing more of you on the big screen? (PS: I really loved your acting in all of the movies and felt you were here to stay)",
        "Is this QnA still going on?",
        "Did you ever lost a role to a Nepo actor????",
        "What are the qualities that make a man attractive for you?",
        "What are the major differences you find between Bollywood and Hollywood? (Excluding the language difference)",
        "Hi, how have felt when you have got good attention and bad attention for the first time from all kinds of people?",
        "If you could restart your entire life, while retaining all your knowledge, would you pick a different career path?",
        "Hello Zareen Mam why do people still think that you are a Pakistani actress do you know about this?",
        "do you think people from bollywood are quite scared of rise of south indian cinema?? from outside they behave like they don't care",
        "Do celebs do well with normal people as partners or with other celebs/high profile business people according to you?\n\nAlso, what was your motivation to get into acting?",
        "How can tech (computers, Web etc.) assist / help the movie industry ?",
        "Can you tell the story of how u got your 1st film",
        "Don't think u wud hv gone much ahead in bollywood had u been a star kid!!??the main reason why bollywood sucks right now is bcoz of the overflow of starkids and it doesn't seem to be stopping anytime soon.i really wud like to see more of u in mainstream movies",
        "I know this might sound cliched but I try to live life not too seriously .",
        "Looking at your past works, which role do you think that you could do better now??",
        "What’s your biggest regret?",
        "She was made by xerox cause she's spitting fax",
        "Hey Zareen! I really had a crush on you for quite long! What do you usually apart from movies and actings? What are your other aspirations?",
        "Love your honesty 😂😂😂",
        "Hey Zareen, is it true that in order to succeed, the actors/actresses (especially new ones) have to believe/accept the idea that “sexual infidelity is not infidelity”?",
        "Hi Zareena. My surname is khan too.. Lets marry.",
        "Hi Zareen, I hope you are in good health. We'd like to know about your hobbies and side hustles.",
        "Hi Zareen, \n\nDo you like travelling? What are your favourite sightseeing spots in India?",
        "Thanks for replying love you",
        "there are lot of speculations around that what happens inside big bollywood parties but no one knows exactly, can you throw some lights on that??",
        "What would it take to date and eventually marry you? Honestly, you are the most complete woman I have ever seen.",
        "Hi Zareen!! What is the most challenging role you have done in your career?",
        "have you watched Barbie? did you like it? what are your thoughts on barbie?",
        "Hi Zareen,\nI first saw you when you acted in a Punjabi film called 'Jatt James Bond'. I would like to know your experience about working in a different language. Would you consider roles in other languages too??",
        "Hey zareen  \nSo imma ask you like a common question... how do you get into the character like fully?? did you use to be a drama actor when you were young? does that help? i really want to get into the acting field....so what my question is how did you prepare your mind for acting?",
        "It's refreshing to see honest replies! Good luck 😄",
        "Do you hang out by yourself for movies etc? Do you think one can be happy alone ?",
        "Haven't you seen my picture where I was trolled for showing off my stretch marks???\n\nI have never promoted anything unreal ... I have always embraced my flaws as much as my achievements .",
        "Reading comprehension = nil",
        "I remember you from main karun to sala. Good moves. Nice to see you here.",
        "Which will you rate as your hottest kiss 💋💋?  The only reason I watched hate story 3 is bc of u",
        "Thank you ... Lots of love ❤️",
        " Hi Zareen what’s something about the process of film making that came as a shock to you when you made your debut ?",
        "Aa gaye Gyan Dene Wale mahapurush",
        "Nah I don't have time to keep up with celebrity drama.\n\nBut I'll take your word for it.",
        "Who do you look up to as an actor?",
        "Hi zareen. What's your favourite behind-the-scenes moment?",
        "Hi Zareen you have worked in multiple film industries what’s the unique thing about every industry",
        "Do you think Veer as your debut movie was the right choice? I'd reckon being with someone as popular as Salman Khan in the first movie is going to be difficult for a lot of reasons. Thanks!",
        "Zareen, how do you handle criticism on social media ?",
        "What’s your height?",
        "What r ur upcoming movies??",
        "Hi Zareen,   \n\\-I was legit vibing to \"character dheela\" song like 5 minutes ago!   \nMe and my family always liked you as a female lead in all the flim we've watched in the past (when I was small).  \n\\-I really wanted to ask you about your take on Bollywood movies being turned to a commercial angle with lesser effort and gradual increase between the age gaps of male and female lead in recent films?",
        "When will u debut in Hollywood??",
        "she was actually trolled heavily for that, she said the online bullying she received for that was a traumatizing experience for her",
        "Hi zareen 🧚",
        "How was your experience working in Punjabi industry? Which is the one thing you liked & disliked working there?",
        "Hey Zareen. How challenging was it for you to do Hate Story 3?",
        "How does it feel to be the most beautiful girl on the planet?",
        "Hi Zareen , honestly how do you feel industry impacted your mental health?",
        "Hi Zareen, \nWanted to ask about what the biggest misconception about Bollywood is and what you think is the biggest problem with the current filming scene in India\n\n (in your opinion)",
        "Hi Zareen so any film you regret doing in your career??",
        "Hi Zareen Ma'am, do bollywood actors, directors, writers... use reddit regularly. And do they read about themselves on subs related to Bollywood?",
        "What's your favorite Bollywood movie that you weren't a part of?",
        "Hello zareen \n\n1) Which movie you most enjoyed while shooting ?\n\n2) Who is most punctual co star ?\n\n3) Fav movie name ?\n\n4) Will you dare to speak about Manipur ?",
        "Tooooo many things ....\n\nfew to mention - \n\nTaking flying lessons.\n\nVisiting the pyramids.\n\nHaving a pet snake and a pet tiger.",
        "Seriously dude 😒",
        "Spitting faxxxxx!!",
        "lmao what!?",
        "I think she proved her individuality really well in houseful movie. In a good way.",
        "Hi Zareen, first off I wanna say, you are really pretty! \n\nMy question: what has been your best and worst experience of working on a movie?",
        "As someone who had a different body type than what is expected from actors in bollywood did you find it challenging? I feel you are an inspiration to many who realise that being fit is more important than being skinny",
        "Hi Zareen, I just wanna say you look gorgeous and you're ageing like fine wine. Hoping to see more of you, best wishes!",
        "What's the reality of casting couch, have you ever faced something like that ?",
        "Hi Zareen, whats the idealistic character anyone from the history that you would like to play?",
        "Hi Zareen , \n\nHow do you generally prepare for a role or a shot , do you have to get in a certain mindset for a particular role , people always talk about emotional scenes but how do you go about doing a romantic scene or a happy scene if you are feeling down. Cheers.",
        "How was she an outsider when she was literally known to Salman Khan’s family?",
        "Are you the one who took part in character deelah hai?\n\nYou look like sister of Katrina kaif",
        "Hi zareen, what’re some crazy things people do to get attention in the industry?",
        "Bollywood often stereotypes, the way you were presented in Veer movie and then you break the stereotype by signing Hate Story 3. \n\nWhile we like you in both the films.... How hard would it be to you for saying yes to Hate Story 3?",
        "loved your film with karan kundra , and ur song sun le zara was beautiful indeed",
        "Always felt you have a lot of potential. Hope to see you in some individual projects soon. Good luck Zareen.",
        "***Hello!***  u/zareenkhanofficial",
        "Hello zareen ma'am, \nHow do you manage stress be it work or life? \nAlso are u a chai person or coffee?",
        "Your fav actors (pan indian)",
        "That's not nepotism, that's cronyism. \n\nIt's prevalent everywhere. Even the precious Nolan.",
        "Why is answering random redittors important to you?",
        "How was your experience working in Punjabi movies?",
        "Hi Zareen! Any unwanted gossip that you've been associated with, on which you've laughed out the loudest",
        "Hey, Do you think nepotism is making it hard for new talents to set foot in Bollywood?",
        "Were you always interested in acting?  \nDoes it come naturally to you, or did you take training?\n\nDo you think someone can become good at acting just by training?",
        "What are your top 5 favourite movies?",
        "What kind of movies you like to watch and what kind of movies you like to act in?",
        "I feel that you bear resemblance to Elnaaz Norouzi too and she's doing good in foreign films. So how about Hollywood!\n\n Also wouldn't it make a really confusing movie if all of you star in a movie that includes Mandana Karimi! 🤷",
        "Who are you? Not mean to sounding rude but i am literally hearing your name for the first time.",
        "What is your favourite character in films?",
        "I love my mom's cooked food the best more than any restaurants.\n\nBut if I have to tell u options ....\n\nLess than rs100 - BUN MASKA & CHAI  , SAMOSA , MAGGI (esp. in the mountains)\n\nAround 5000 - Don't have such an expensive taste .... I'm a simple person with simple but delicious taste buds 😂",
        "Do you remember coming to SRCC, Delhi University in the early 2010s for a fashion show? I was one of the organizers for that event",
        "Do you select movies because you want to continue acting or do you select movies because you genuinely like the script or the story ?",
        "What would you have been if not an actor? Can you imagine yourself doing anything other than acting? Maybe within the industry or something completely different?",
        "i remeber you were pretty popular. Just curious, where did you go? Why did you stop?\n\nWhat happened?",
        "Please suggest some skin care tips from Bollywood industry, especially any medicated products or supplements common in beauty industry?",
        "Do you watch Anime?\n\nI know it's a weird question!!",
        "Why did u leave the industry?",
        "How's your current life going ?",
        "Lodu bada aaya I don't have time. Lame ass troll.",
        "How do you go about finding new projects?",
        "What did you liked about bollywood that you joined it?",
        "Fuck off. Not everyone cares for \"celebrities\"",
        "How has life changed after being in movies?",
        "How has the industry changed over the years throughout your journey working as an actress\n? \n\nDo you think ageism will remain a factor for actresses  unlike their counterpart in the industry in future?",
        "Hello ma'am, I am a big fan of yours and seen your movies plenty times but I was thinking that you have so many connections in bollywood still you aren't able to get good movies so what's the reason",
        "Yeah so a 180.",
        "AWWW 😊 \n\nThank you for your love ...\n\nI know this might sound crazy esp. bcoz I'm an actress, but I don't really know to do my make up .... what I showed in the video , is what I've learnt in all these years 😂\n\nI don't really have one particular shade that's my fav ... I always mix 2-3 shades.\n\nBut I use this liquid lipstick from MISS CLAIRE in peach pink quite often.",
        "But here you are, asking a \"celebrity\" a question. Replying to comments as soon as they hit your phone. And your taste in wrestlers is trash. Sad lame ass troll.",
        "Were you always wanted to be in film industry or something else?",
        "Zareen - you are absolutely stunning! My question - do you feel like you didn’t get the roles that you would have if you were related to someone in the industry ? Are there a lot of roles that you didn’t get an opportunity to work on?",
        "Since it is month of Muharram...\n\nWhat do you think about the sacrifices of the Husayn , Hassan and Ali? \n\n\nEven from an non-religious political perspective, I find this moment of early muslim history to be very sadful....",
        "Hey! I have no questions. Was just reading your responses on this thread. Rooting for you! 🎉✨❤️ All the best, Zareen!",
        "Hi! Hope you are well.\n\nWhat is your opinion on the need for \"intimacy directors\" on the sets?",
        "Which are your favourite anime shows? If you watch any...",
        "Do you plan do any OTT projects or any projects outside of India?",
        "Where do you see yourself in 5 years? You plan on being in Bollywood Or want to take part in southern film industry?",
        "Do you find Housefull as awful as the rest of us do?",
        "I can't believe you actually replied💗💗💗💗💗💗💗\nHaha it's okay, we all learn and grow. I love Miss Claire lipsticks too❤️ mixing lipsticks is top tier✨️You should try Sephora Cream Lip Stains, they are my favourite, also they have so many beautiful shades and really comfortable and long lasting.",
        "😆",
        "What would be your top three fitness based  advice ? Thanks.",
        "I wanted to be a lot of things but an actress .... But look at the irony ! 😂",
        "Do you think the opportunities for women have gotten better in Bollywood over the years? What do you think can change in the industry?",
        "What sort of movies interest you to explore currently?",
        "Why are you not doing any movies these days ?",
        "Hi, Zareen. Hope you are doing good. How's Savlon Bhoi these days?",
        "How often do you lurk on reddit. I m certain there are only a few celebrities who even know about reddit.",
        "Mam what brought you to the reddit ? Surely enough you are famous on every other platform . I love your movie veer ; you played the role phenomenally .(●'◡'●)",
        "Hi Zareen, \n\nI have been following your acting career since your debut, saw you in some punjabi movies as well.\nCan you tell me a negative point you had to go through there?\nand whats guilty.pleasesure in general? \nDo you play games , take a walk or something different?",
        "Hi Zareen, is your character dhila or tight?",
        "NO ... you are mistaken .... I don't really have a lot of connections in the industry and I also don't really know how to do small talks .",
        "Heyy!! How’s your work experience with daisy shah?",
        "Why don't you work in South Indian movies?",
        "Gyan galat nahi diya gaya hai",
        "You never fail to impress, that all i wish to say, impress with your beauty, talent and fitness.",
        "What do you think about bollywood underutilising you?",
        "Have you ever come face to face with katrina? If yes How was the interaction?",
        "Casting couch is real right ?",
        "Oh I see thank you for clarifying my doubt hope you stay safe and good",
        "I thought Salman Khan was your biggest connection",
        "The dynamics have definitely changed over the years !\n\nI feel with OTT coming in , there is no more ageism or any other 'ism' 😄",
        "Thanks for answering",
        ">a pet tiger.\n\nMike Tyson approves 👍",
        "You were my childhood crush",
        "YEAH..",
        "Lol it's Ama toh reply kyu nahi degi 🤦‍♂️",
        "Did you watch Oppenheimer, if so what are your thoughts on the movie? And would you ever be willing be to act in a Hollywood film?",
        "hi zareen hope you see this comment\n\nyour first film was with salman khan despite being an outsider, how difficult or easy it was for you to land into such a role ???\n\nhave you seen any type of change in the audience taste in last 12-13 years you have been in this industry ???",
        "Hi have you ever felt paparazzi’s dark side ?",
        "Who is the actor with whom you want to become good friends in future and who is the actor you don’t ever wanna see again?",
        "Recently got a flight simulator and can totally understand the flying dream! Now a pet tiger otoh... Count me out sister.",
        "Am I answering this or AI ? 🤔",
        "What's wrong in it though? If you take it positively you learn something new and in a way upgrade yourself.",
        "Hi zareen, thank you for this ama. We don't see you much on the screen, do you go for auditions and screen tests even after being a known face like how they do in the west? Or do you look to pick out the best from what's coming towards you?",
        "Sun lo. If suppose, this is your last day on this earth toh what will be your biggest regret? \n\n\n\nP.S:- Gautam bhai ke joote kaise chori hone dediye aapne.XD.  \n\n\n\nI wish you all the happiness ahead.",
        "what was ur percentage/CGPA in class 10th and 12th ?",
        "Downvote kyun kr rhe yaar usme. Aisa jaruri thodi hai sabko reply degi. Mujhe lga my question will be lost in the sea of so many questions. Itna rude kyun ho rhe, I was so happy she replied 😊 you really didn't need to ruin this 😔",
        "Someone actually did post an AI generated images of her on my sub. Looks a bit like her. I don't know... what do you think Zareen?  \n[https://www.reddit.com/r/IndianArtAI/comments/159aby1/a\\_bollywood\\_actress\\_imagined\\_by\\_ai\\_i\\_think\\_she/](https://www.reddit.com/r/IndianArtAI/comments/159aby1/a_bollywood_actress_imagined_by_ai_i_think_she/)\n\nhttps://preview.redd.it/f7ljw6pnpbeb1.png?width=960&format=png&auto=webp&s=26862a8fe2a8bfd8d629f5a5a39b93c749461338",
        "Hey Zareen, does the mafia (Mr.D) still controls Bollywood like the 1990's??",
        "And STILL you are here... Not meaning to sound rude 😜",
        "How does it feels to be popular and known? Specially when it was never planned or aspired?",
        "Bollywood has a serious nepotism issue as well, the two issues can coexist at once",
        "&#x200B;\n\nhttps://preview.redd.it/dn86dthypbeb1.png?width=960&format=png&auto=webp&s=6a8d0441e6e458ee5a95dd50e5ea5c6c6ffc8a70",
        "YES !!!\n\nJust recently I came across a video claiming that I've been murdered 🤣",
        "Whats your perception of Life in general ?",
        "Hi Zareen, \nIf I may ask, how real is the ignorance from the Main stream personalities in the Bollywood Fraternity true...?? For the newcomers.",
        "Your question could have been phrased so much better. Even after she replied to it, the least you could do was not be an absolute asshat about it. How deprived of attention and delusional are you that this is how you behave on an AMA? What a pathetic person.",
        "Where is your hometown and who introduced you to the industry",
        "Hi ...when  can we see you back in a glam avatar...and on ott.. i loved the india tour series with jeep...",
        "Will we ever get to see you in a character like one in HATE STORY 3?. Among all this character is my fav one.",
        "Hey Zareen, I am quite curious how would a normal day look like for someone in entertainment industry?? Also, how do you spice up normal days ??",
        "Maybe don't engage with celeb worshiping subs/posts then. My god the irony",
        "Any particular cuisine you crave for which you are ready to sort of budge from your fitness schedule?",
        "Ma'am, What kind of man is your man of dreams . 😊",
        "How many of these questions are asked by your pr team ?",
        "What do you think about the Bollywood industry now? Is there a change from when you started to now? Where do you think Bollywood is heading towards?",
        "Maybe she isn't into Hollywood?",
        "Lol celeb worship karte raho didi",
        "What's the most challenging thing you've had to overcome in your career?",
        "Do you mean literally?🤔",
        "Hi Zareen \nWhat are 3 things in life that scare you the most ? Could be anything from animals/people/experiences !",
        "What is your favorite role you've played so far? Why?",
        "I am pretty sure its not just the ass that is being licked",
        "Hi zareen, who is your best friend",
        "Tumko kya problem hai dadaji? I like her. She is very simple and down to earth as I have been noticing her since a long time. Tumhari kyun jal rahi. Dum hai toh khud celebrity bano.",
        "Imma ask you the real questions. What did you think happened to Jiah Khan and Sushant Singh? \n\nI personally think Bollywood is dying due to lack of originality and nepotism. The rise of movies from the south does help either.",
        "Have you ever done modelling?? If yes, then is it really glamorous as it looks from outside or is it something else ??",
        "How is OTT changing Bollywood? What’s your opinion about OTTs in general?",
        "Is bhai as arrogant and obnoxious as people say he is ?",
        "Very !\n\nbcoz I never in my life thought I'd do something like this ... but there was a time in life when there wasn't any work coming in and I had to take care of my family .... so I did the film. \n\nI have no regrets now .... bcoz when I see what's happening in films and OTT now ... it is much more .",
        "This was the wrong sub Zarine. You should have done an ama on r/Bollywood and r/Bollyblindsandgossip",
        "Your PR people 😂",
        "What is your hobby?",
        ">  A** licker\n\nLiterally?",
        "Hii zareen jii I saw your film 1921.I want to ask you if you ever experienced paranormal activity in your life",
        "i read that zaheer khan at first\n\nlol",
        "Tum banjao itna pasand hai celeberity banane wannabe insta influencer 🤡",
        "hi zareen! what are some of your favourite movies?",
        "Has reddit finally gone mainstream in India?",
        "I don't even want to engage in any further conversation as you are clearly a happiness sucking cheap vampire. Go spread sadness.",
        "😄😄",
        "You are so beautiful, how do you maintain it? Also how do u deal with self doubt?",
        "Oof tricky response. Since, you know, casting couch is a thing.",
        "Have you watched jojo’s bizzare adventures?",
        "Hi Zareen, I am curious, what did you want to become when you were a kid?",
        "Pragmatic baat bolne se I am spreading sadness lol get out of your dream world",
        "Hey",
        "Who is tour favorite actor in bollywood?",
        "Hi Zareen, first of all, you are one of the most beautiful people I have ever seen on screen. I have yet to see you off screen.\n\nI love you in comedy roles. Hope you do more comedy films.\n\n**My question is :** Have you ever faced a situation where you almost good a good movie but then at the end some other actress was cast because of nepotism and/or because she had more Bollywood connections? If yes, which movie was it?",
        "Hy",
        "Im always late fckkkkkkkkkkkkk",
        "Well that’s impossible for me😝",
        "Hi Zareen\n\nWill we see you in OTT's ?",
        "Hey. Was reading through your replies and I never really expected you to be so insightful . Which intrigues me to hear your thoughts on the current situation of Bollywood in terms of box office collections.\nWe’re witnessing a rampant increase in nationwide collections for Hollywood and even South Indian movies while Bollywood movies are still a hit or miss. Where do you think all of this stems from and will we see a possible change in these trends soon?",
        "Hey Zareen! How do you feel about the communalism happening in India? Do you feel Bollywood, as a channel reaching to quite remote parts of India, should have a responsibility to educate or instill a feeling that humanity is what will take us forward both economically and societally? Is it possible for like minded artists in bollywood to strive towards this?",
        "Hello zareen i am mirza from Pakistan  i have question regarding your movies which movie shoot you facing a prblm and accident and you feel sad",
        "Hello ma'am",
        "\"Reports of my death have been greatly exaggerated\"",
        "You guys know na, ke PR guys are answering the questions and not actually Zareen.",
        "Tu meri dost hai...",
        "I don't understand this obsession even my friends have to eat the same stuff in mountains on the way maybe i am odd one out",
        "Well idk if I like how civilised this comment section is, I guess people are lot more strict/anti fun on internet these days. But if this post was done during 2010 internet vibes then the comments would be interesting and not sounding so scripted. \n\nAnyway, didn’t know itne hot log bhi Reddit chalate hai😝",
        "Lol",
        "Do you know anyone in bollywood who has never had a plastic surgery? How many have you had?",
        "You were fabulous and graceful in Veer. Made you my childhood crush 🥹.",
        "Are you still there? 😒 I want to know which is your favorite indoor plants at home?",
        "\\>  look at the irony ! \n\nIn your case, its Zairony 😂 😂",
        "Is it bhoi's style to say \"i literally launched someone in bollywood who looks just like you\"",
        "What makes you happy? ❤️",
        "if you had the chance to go back in time and choose a different career... would you still pick acting or try sumn else?",
        "r/Zareenkhan is this your official subReddit?",
        "His claims have been burnt to \"ash\". Let him be",
        "Itna sach bhi nahi bolna tha 😂",
        "It's a good question, why did you get so much dislikes",
        "hows life",
        "Tu gavar aur bewakoof dono hai kya ?",
        " \\>Having a pet snake and a pet tiger. \n\nAap Karan Johar aur Bhoi ko pet rakhna chah rahi ho....\n\nGANDI BAAT!!",
        "Hi Zareen,the last  heard about was about you walking out of a film because the producers were forcing you for more intimate scenes..I just want to say kudos to you..I felt proud of you that day and I’m getting a chance to say this to you jn person.",
        "Haan, tujhe kaise pata chala?",
        "Childhood crush man, used to wait for Surili Akhiyo waale and Salaam aaya to come on tv. I was like 7",
        "Can you describe some funny incident while shooting  ?",
        "Are you happy with the compensation you get in Bollywood ? Do you think there are other professions where people are getting paid way more. Do you have a suggestion for people who need to maintain a finance for running a home while pursuing acting ?",
        "When Did Nolan do it ?",
        "Thanks for doing this AMA Zareen. You answered a lot of questions and seem so kind and genuine. \n\nMy question is, how has your interaction been with other Bollywood celebrities? Did you feel like they’re normal people you can enjoy hanging out with or did you feel a disconnect due to their privileged background in Bollywood families?",
        "Translation?",
        "Would you be interested in doing south Indian movies (Malayalam or Tamil)?",
        "People like you think by being an asshole to everyone, especially a girl, they are being badass. Lol, delusional much?",
        "Seems fake but okay",
        "Holy shit that is dark.",
        "Hi Zareen. Who is your favorite actor in Bollywood in terms of acting abilities?",
        "First time i read as Zaheer Khan lol",
        "I won't be able to do it correctly but the gist is, \"Do you slice your banana before eating or just deep throat it. /s\"",
        "Your presentation on Mahi ve remake was awesome! You remind me of my ex wife, lol.",
        "Ngl you were my childhood crush 🥰",
        "So you read that story.",
        "Tu hi to  meri dost hai 🎈🥰♥️",
        "Hi zareen..........I want to see u again in ROMCOM. Is this possible?",
        "If you are really being honest Tell us about the casting couch and name some shady directors who want to take advantage of a woman in Bollywood. I am pretty sure you won’t answer this !!!",
        "Yea when??",
        "HOW DO I SEND YOU GIFTS? \nHOW DO I CONTACT YOU?",
        "If all the marketing tactics and audience projection shenanigans were not an issue, what kind of movies would you like to try? Like Bollywood is known for a certain genre of movies which are a bit, I don't know how to put it, extra cheesy to appease the masses. But I guess actors themselves would've their own ambitions about, \"Oh I wish I could do an Indian version of Incetion (or Barbie based on the taste, lol).\" Do you have any of these Khayali Pulao like most of us do?",
        "Us bhai us",
        "\"Nothing ever goes as planned in this accursed world.\"",
        "My Cocaine is your answer.\n\nTry saying that in a Cockney accent",
        "Damn! Reddit is getting mainstream. Stop clout chasing here man, get out. Let reddit be. Go back to Insta or twitter or whatever.",
        "can i get ur phone number?🙃 need to do a quick proposal..",
        "I just said she will reply to you because it's ama and you think I am trolling you for saying truth and boom out of nowhere using gender card lol get a grip 😂",
        "I would love to see you playing something like Yashodhara from VEER again sometime",
        "when you need to mention movie names for recognition",
        "Loving your responses.",
        "not at all, it's a reference to the question Akshay Kumar asked Narendra Modi, he didn't mean it in a vulgar way",
        "Hi Zareen any updates on your upcoming projects and also do you intend to branch out into other spectrums of the industry apart from acting",
        "are you real zarin khan?",
        "You are literally trolling me because I post on Instagram (you said influencer in a mocking way) and also people like you have no other work than bringing people down. Consider thinking \"why I hate people so much who I have no business with\" Goodluck with your hate campaign.",
        "Hi zareen, you are one of the most beautiful heroines I have seen in Hindi cinema. Why don't you branch out to South and act in South Indian movies? Money maybe slightly less but they are very professional and movie shooting finishes in 6 months. I think it will add more value and help you strengthen your presence in the Indian film industry. BTW again you are very beautiful 😉",
        "> I don't even want to engage in any further conversation as you are clearly a happiness sucking cheap vampire. \n\nStill you are engaging with me😂 and yourself trolling me and cussing me shows what a hypocrite you're, lol I have not even cussed or abused you anywhere but you are doing it and on top of it playing gender card, good for you..",
        "Do you find it challenging to detach from a character after completing a project, particularly if it was emotionally demanding?",
        "Why you joining reddit?",
        "Worst people to collaborate with with",
        "Are you done? 😴 Because I clearly am. I am sorry you don't have anything substantial to do today🥴",
        "Hi Zareen, hope you're doing great! I'm really loving your honest answers. Just curious but what profession would you have rather chosen if it were not to be an actress?",
        "Han gali do khud aur jab point out karu toh are you done boldo ok 😂🤡",
        "Hello Zareen, I am struggling to lose weight and your journey is very inspiring. Any tips you have is appreciated. Also really admire that you did not play the stereotypical stick thin heroine in your movies. Many of us struggle with weight issues and it’s good to see normal women on screen.",
        "Nice work by you ma'am. I like your role very much in Veer and Housefull 2 and others movies also.",
        "How do you feel about the influence you got after entering the Bollywood vs before Bollywood. I'm sure life is changing but how are you coping up with the changes of not being as active as before?",
        "With writers strike happening in the US as of now, could you shed light on how the Indian film industry views on unionization and do they receive the benefits done by the All Indian Cine Workers Association? Are people even aware of their own rights in the industry?",
        "Surili akhiyon wale, be my friend lolz",
        "Hi Zareen,\n\nWhat are your thoughts on current tide of entertainment industry (especially wrt OTT)",
        "Hi zareen, Why did you become an actor ? Was it your childhood dream?",
        "My sincere apologies in that case",
        "I hate reddit becoming mainstream smh. Let's hope ban na ho jae ya koe kand na nikle idhar se",
        "What made u log into reddit?",
        "Is it true that Bollywood only favors giving jobs to only light-skinned indians or indians that are 5'9 and above for both males and females alike?",
        "Any chance we can see you doing de-glam roles?",
        "Hello Zareen...This is all I wanted to say. Have a nice day.",
        "> esp. if you aren't an A** licker !\n\nDamn !",
        "You know, funny enough, Hollywood is the only industry that doesn't outsource it's jobs when hiring actors in places like India and china and stuff. They only hire those that are mostly within the States already, how ironic is that lol.",
        "How are you aging backwards?",
        "Hi zareen, hope you are doing well. There are ups and downs in everyone’s life, what do you do to keep yourself motivated and get through the bad times life throws at us?",
        "I just love your work; I adore your motivation and I so wish you get more to prove your potential; \n\nLooking forward to seeing you more..  \nBest Wishes, Tons of Love..  \nRock on beautiful!!",
        "How did you get such huge boobs??Is there any chance that I may get to see and touch them??",
        "What are your views on Salman khan?",
        "Hey. Zareen I really love a girl. How should I tell her. Any advice",
        "Hi Zareen ! How long did you  have to practice for Lagdi Lahore Di aa dance with Melvin Louis ? Amazing moves !!",
        "if given an option which role of forgotten woman fighters?  which one you would prefer to play and why?\n\n1. Razia Sultana\n2. Begum Hazrat Mahal\n3. Bi Amma\n4. Asghari Begum",
        "Thank you so muchhhh for the reply. I strive for the same healthy mindset 🤍💫",
        "360 is actually right …the circle meets itself at the other end,.. its the journey to meet the new her is what she meant by 360",
        "https://youtu.be/AiCF1QdyxhM",
        "what is your opinion on nepotism in bollywood?",
        "Man… you just opened my eyes.. maybe Akshay was really asking that.",
        "🌟What would be your take on how to obtain a successful acting career?\n\n 🌟Also is it challenging to get roles in movies? \n\n🌟How to recover from public mistakes such as unknowingly put up political statement or something related to public being furious to you for ur statements.\n\n🌟Does Instagram create opportunity for acting career?",
        "Did you watch Oppenheimer? Why does bollywood not make historical films which are actually accurate and cared for.",
        "Hi Zareen, which outsider/non-star kids do you admire?(Name a few).",
        "Hi Zareen. How r u??. And what are you up to nowadays??",
        "I asked a question I don't know whether you seen or not,here i am asking again. Have you thought that hate story 2 will give a big push or did you know the movie state while it was in shooting stage? Few actors/actress openly confessed when they know they are acting in a bad/flop movie. \nIs there any movie you thought while shooting it is going flop?",
        "No hard feelings here, but you didn't get movies because you can't act! Period!",
        "How does bhai drive car would have been a better question",
        "Why all 3 movies socks?",
        "Pets or zoo ?",
        "Hey zareen, you haven't worked in movies for some time.. any particular reason for that?",
        "Hey Zareen, I have no questions to ask, but I love your acting and like you a lot. Stay the same, more love and joy to you",
        "HI ZAREEN , I AM VIJAY . I ADMIRE YOUR WORK A LOT , I FIRST SAW YOU IN YOUR MOVIE VEER AND IMMEDIATELY FELL FOR YOUR LOOKS AND THEN I LOOKED FORWARD ON MORE FILMS OF YOURS . ACTUALLY I AM FROM IIT BOMBAY AND HERE I HAVE MORE PROBABILITY OF MEETING A CELEBRITY LIKE LAST TIME I SAW VICKY KAUSHAL IN PAWAI. IT'S MY DREAM TO MEET WITH YOU . HOW CAN I MEET YOU? THAT'S ALL I WANTED TO SAY",
        "It depends on the location. You really don't want to experiment with your stomach when you are hiking up. If that's not an issue, eat whatever you want.",
        "Waiting for you to come back with a bang!",
        "So are you going to make a comeback anytime soon??",
        "How to maintain consistency with discipline 😀 e.g.it may be diet, healthy habits or any habits which helps us to grow....how you maintained it....",
        "Well I fear my stomach always  but i cannot understand people craving for this stuff just on mountains so that's why I thought",
        "Reddit moment 🤓🤓",
        "Tigers and Snakes are not pets. Stick to domesticated animals for that. Keep wildlife in the little remaining wild areas. \n\nHowever, if you are interested still, you can adopt a tiger or snake in some Indian zoo or fund some animal rescue center or orphanage. They may let you tend the animals during their routine treatments etc. \n\nSorry to sound pretentious. But please.",
        "What is your take on nepotism in the Bollywood industry ? Doesn't it make you angry to see that a talented and beautiful actress like yourself not get as much opportunities as other star kids ?",
        "How do you address body shaming and other stuff that goes around the media?",
        "Hi zareen ji loved ur all honest replies. I would like to suggest u that suppose if ur not getting roles which u want then You can switch to TV industry to showcase ur talent. One of the best thing I like about u is that to get roles in film You didn't compromise with ur values❤👏",
        "Appreciate your honest replies. To my knowledge only other B-town celebrity that had proper and fun AMA here was [Imran Khan some 9 years back](https://np.reddit.com/r/india/comments/236bpy/hi_reddit_longtime_lurker_first_time_poster_imran/).\n\n[Meanwhile Priyanka Chopra couldn't answer a single question](https://np.reddit.com/r/IAmA/comments/29nr3g/hello_im_priyanka_chopra_im_an_actress_and/).",
        "More power to you, stay strong stay humble 😊",
        "Mai karun toh saala character dheela hai!!",
        "Common people have listened many bad things about bollywood these days like casting couch and stuff. Is that kinda thing like normal or it is just a fud among people?",
        "Hi Zareen , I really like your style and way of acting with so much confidence. Btw i have a pharma company and would like to work with you for ad shoots. So what’s the good place to discuss for that stuff?",
        "Hii zareen ! \n\nCan you describe a hobby or interest that you have outside of your work and public persona?\n\nI absolutely love your song surili akhiyon wale . When it came out ,i was little girl. I used to think u were an indian disney princess 💗 🌸 💗",
        "Favourite Cricketer??",
        "Whats your fav movie of all time and why ?",
        "Hello.. a fan here..\n\nWhat’s your goto cheat meal?\n\n\nAlmost a decade back we met in Kuala Lumpur, I didn’t had good phone back then. But thank you for your time, you were very kind and nice.",
        "No one is nalla like you nihil",
        "Hi Zareen, what do you feel about guys masturbating to you",
        "Do you get envious? If so, how do you overcome it? \n\nI am at a point of this journey where it is difficult for me to overcome envy nature of mine. Its so tough.",
        "Lmao the comments under priyanka’s ama are brutal",
        "Hii Zareen. Do you speak Marathi ?",
        "Hi what's your next project",
        " Wow! You're truly an inspiring actress, Zareen. I've watched many of your films, and truly enjoy the themes and stories you bring to the screen.",
        "Hi Zareen, I have always wanted to confirm one thing. In 2010 when I was in school, one of the school kid (i forgot his name) claimed to be your cousin. He was 4th grader that year and was from Rajasthan. The school was Dawn Academy in Panchgani. Can you confirm this for me please?",
        "Do you feel weird when you go in public and to your surprise nobody recognizes you?",
        "Hi, which musician are you listening to the most these days?",
        "What's going on? we can now communite with celebrities? That's crazy",
        "Hi Zareen, Any question or comment that makes you feel ashamed",
        "Hehe good one zareen 😂",
        "Hi Zareen! Big fan of your work! How has your experience working in the industry been and what part of the craft do you feel like you need to work on the most, as an actor?",
        "How was your actual experience working with salman khan?",
        "Did you ever go driving with bhoi?",
        "Damn! Thanks.",
        "Have you ever faced sexual harassment from Bollywood people?",
        "You got the grace , deserve a slb movie",
        "As far as i know these things also happened earlier",
        "Ma'am do you know pashtun or pashto language how you are connected to it ?",
        "Influencerr ?? She was always an actor",
        "Do actors sleep around with each other?",
        "My Cocaine is an incredible actor, his characters always have depth to them. My Weed on the other hand...",
        "We can definitely cut some angles first tho",
        "What is your name, and what movies have you starred in?",
        "Billo Bagge Billeyan Da Ki Karegi?\n\nBagge Bagge Billeyan Da Ki Karegi?",
        "Hey Zareen, i have no questions, just wanted to say that cant wait for your next movie. Its been 2 years since hum bhi akele tum bhi akele release and that was a really nice movie, excited for the upcoming stuff.",
        "Do you think you have been typecasted in Bollywood and how keen are directors/producers in general to give someone a role different from the typecast in today's landscape?",
        "You remind me of Lana Del Rey a bit. Sending likes of love for your future projects! 🙌",
        "Session khtm ho gya kya?",
        "You mean two right angles??",
        "How do you respond to creeps and perverts on social media?",
        "Has anyone ever told you you look a lot like Alexandra Dadario?",
        "Very hard if your name is not Alia.",
        "I eat at cheap places, so Chai, samosa, maggi etc are all < ₹50 stuff for me.\n\nIf someone asked me about around ₹100, I'd be more likely to say Pav Bhaji, Chole Bhature etc.\n\nI'm probably never gonna buy any single dish for ₹5000 though, so same answer as Zareen.",
        "Ghapa ghap tak tha uska saath bas",
        "Hi zareen how are you so much hot and beautiful are you human ???",
        "Tell me about the things or questions about life or your career that make you anxious...and also what you do when you feel quite low (something that cheers u up)..??",
        "She’s not from a film family though",
        "Hi Zareen, I just wanted to say hi.",
        "Hi Zareen, are you a door?",
        "Did Salman fuck you ?",
        "Haha I was wondering why no one is asking her the obvious question",
        "Yes but she would not have answered that question 💀",
        "Probably because it's default to arrange visas. \n\nWhen the movies are shot in India, they will hire Indian actors. Eg: Extraction",
        "Cillian Murphy has been working with Christopher Nolan since batman begins and has been in almost all of his films ever since",
        "do you pray namaz? since women are ordered to cover themselves, how do u feel having your uncovered body displayed to so many people? Are you not afraid of jahannam?",
        "Hey Zareen, any advice for a 20 year old. Also lots and lots of love to you.",
        "Just look how rude people were and how they downvoted her every comment. No wonder celebs stayed away",
        "You were In Ready ?",
        "Having a big cat as a pet is illegal and saying this as a huge cat lover.",
        "Ain’t matter. If a superstar knows you well and giving you a break then that does count in nepo.",
        "Hey zareen i have seen your jatt james bond in my childhood its my face character for you. How was your experience in Punjabi industry",
        "Omg how do you have links",
        "Are you nude now?",
        "One min silence to all those who thought it's actually her lol",
        "Nomies🤡 bhi reddit pe ane lage, ab reddit chhordna hoga",
        "But she wasn't nearly as successful as katrina (no hate to her ofc) so bhai failed at it, didn't he. It wasn't just her looks that made katrina famous. She had charisma and an it factor. Also she is a really good dancer. So salmonella's whole \"I'm so powerful that i can launch another woman who looks like you because you're THAT replaceable\" schtick failed miserably.",
        "If you are coming to lucknow \nI would love to help you explore the city",
        "Hi Zareen, what's the thing that you love to do in your free time?",
        "Hi zareen, I have seen u in person during a Aldo major brand retail opening at phoenix market city  and was in awe with ur skin.\nJust a question ? Are u really answering all queries urself ? If yes how do u address all",
        "What do you hate the most about Bollywood or noticed that \"this is happening and if it wasn't done, the quality of films could've been at a different level\"? S",
        "If you had to choose one Bollywood movie for an American who has no idea, where would you recommend I start? i.e. not overly stylized, good subtitles/dubbing, relatable story, etc",
        "Hi Zareen Khan! So far I haven't seen any big celebrities create an official account on reddit you did it!!. Kudos to you for also answering all the questions posted here. I'm happy to see this side of yours. Also who is your favorite bollywood celebrity (Male/Female)?",
        "Dave Shutton -- Springfield Daily Shopper. Who are you? Where are you going?",
        "Time to claim the term insurance in keep the money in the safe",
        "Ever heard of Rajpal Yadav...",
        "Any amazing memory with Salman Bhai, ma'am?",
        "Why pet snakes and tigers?",
        "Figuratively speaking....i hope...",
        "will the pet snake be named nagraaj",
        "Who  is answering these questions?   \nI don't think you are",
        "I hope this becomes a trend, Indian celebrities doing AMAs",
        "I didn't know zareen Khan uses reddit 😮",
        "Hi Zareen,\n\nYou debuted and started off in 2010 if my memory serves, back when mainstream cinema and probably Television were the the only viable options to be a part of the show business.\n\nNow with the advent of OTT, there is a plethora of opportunities and a level playing to include talents across all levels.\n\nWhat would be your dream project given the plethora of opportunities we have today to make your mark as an artist with your audience?\n\nHow easy or difficult is it to stay relevant in this age of 24*7 internet connectivity?",
        "How is Bhai in real life?",
        "Personally gaming come in waves I may go months without but other time I’ll find one so good I just sink my life into it, don’t feel bad for loving something as long as it doesn’t effect your responsibilities",
        "Tell me your darkest phase of ur journey you fased",
        "Do gangs influence casting/other decision making in Bollywood?",
        "Haan dikha diya ki tu genius hai. Khush? Chut*iya saala",
        "Imagine the synchronicity! I was just thinking about you today and what have you been upto! Good to see you are doing alright.",
        "How much would could a wouldchuck chuck if a wouldchuck could chuck would?",
        "Good point. I didn't even think this through tbh.",
        "My favorite. But the shorter they are, I get the sense that these ppl get perm type casted unfortunately. Idk.",
        "for a moment I thought it was the cricket wala zaheer khan and got excited 😭",
        "Hii zareen,\n                    How did you started your career and when you thought about acting. Since you are not from filmy background then what kind of problem you faced in your early life before the industry",
        "One of the beautiful actresses in the world Indeed!! ❤️",
        "Does Salman bhai choreograph his songs on his own?",
        "Hi zareen . Keep up the good work",
        "Itni gandi movies me role karke apko kaisa laga",
        "Hi Zareen\nAre you related to Zarine, Sanjay khan s wife?",
        "Arey gyani chodu",
        "Hey Zareen, just wanted to say that I have the biggest crush on you, ever since I saw you as a kid in Veer. Since then I've been madly in love with you, and I loved your performance in housefull 2. You'll always be my one and only favourite actress!♥️♥️♥️",
        "Bhoi of bollywood",
        "After you became a star, how difficult was it you to make friends or personal connections? How were you able to see through individuals who tried to part of your life for the sole reason that you were a star and not you as an individual?",
        "I think  PR Teams should  leave Reddit alone and not try to turn it into Instagram which  it never will. Lol.",
        "Haath Jodta Hu You have Best Lips in Industry don't  screw  their Natural Beauty like others have .",
        "It was identified as a PR activity and treated as such by the audience (fellow redditors)",
        "last time i saw you was in Jspm pune, this was before covid, \nyou looked stunning.",
        "even cbum has strechmarks, those are medals of hard work.",
        "What were your qualifications like in study, if you don't mind telling me",
        "I think you have not fully utilised or explored the industry, you should have been working in more movies or OTT series. Are you very selective or is it because of lack of opportunities ?",
        "Such straightforward and honest replies 🤣",
        "Beerbiceps asli I'd se aao.",
        "A fellow forrest gumper.. 😛",
        "I have fapped to you many times. I hope you didn't mind.",
        "How do you think she got the roles",
        "Took it like a pro",
        "Hey zareen as you're a Muslim if it's not a personal one can you tell me are you a practicing muslim? If it's personal you can choose to skip . Apart from the I am girl from Pakistan I really love your bold looks and pretty smile love from Pakistan\nHave you ever thought working in Pakistan??",
        "Are you still obsessed with shahid afridi?",
        "Do you listen to Pakistani music and do you listen to these tendy punjabi music of sidhu ap and shubh",
        "How director got fund for movies? Can we become a assistant to main director in short year (5 year)",
        " Hello, you look stunning. Have you ever considered trying your luck in Tollywood?",
        "When would we see you again on the big screen? We dying to see you again.",
        "Ever wondered if you were in Hollywood??",
        "Man that Imran Khan AMA looks so fun! Dude seems like a genuinely nice guy to be around.",
        "Real id se aao Ranveer Allahabadia",
        "Do everybody do drugs in Bollywood ? Is it necessary to reach that stage ? Have you been offered? Do these top actors and actresses in the industry also do it ? Without mentioning the name can you please tell us about it",
        "Hi maam, in one of the reply you said you were like tom boy, Im kinda same but some times I do want to look good , so what should be the dress style and simple makeup thing which won't bother my comfort much. 🤓 and still make me look pretty",
        "I used to think that you are a sibling to Katrina Kaif for a really long time. It would be great if we could hear about your journey in the film industry.",
        "I mean she is she at the end right. Just she took whole new turn is not like she changed or something. So yeah I guess 360 is pretty valid",
        "r/Kerala users, you guys pressing X on this given what happened last month?",
        "I have question. If you had an superpower what would it be? \n\nRegards.",
        "How did you end up working in so many Tamil movies as well?",
        "Just wanna ask is the casting coach real or fake.",
        "Hello Zareen Khan, I have been a big fan of yours since your movie \"Veer.\" I fell head over heels for you back then and have loved you ever since. However, I noticed that your last film was \"Housefull 2\" in 2017, and I wonder why you left Bollywood. I sincerely hope that you consider making a comeback, especially through OTT platforms, as they are the next big thing in the entertainment industry. With OTT, you can collaborate with pioneers like TVF, TSP, SonyLiv, Netflix, etc., and reach a wider audience. Your fans, including myself, would be thrilled to see you back on the screen. Please do let us know the reason behind your departure from Bollywood. We miss you and love you, Zareen, and eagerly await your return.",
        "damn rarely have I seen any actor's account on reddit",
        "Will you marry with your boy friend??",
        "Could I message me privately as the question I have might be embarrassing for the subreddit to read?",
        "Yeah it was. But all the comments were too brutal 😂. No wonder rest all stayed away after that",
        "Awesome!!",
        "Nothing to ask , just stay safe and enjoy ... Remember this people respect and give opportunities based on your character and how well you smile ... so keep up your character dont lose it thinking its how people get together .... have fun in moral way ... all the best",
        "top 5 most underrated Bollywood movies acc to you",
        "If not an actress or be in the film industry what other career path would you have pursued and why ?",
        "I love him!",
        "My qus was deleted why I don't know?",
        "Will you make a superhero movie?",
        "I loved 1921, and your performance in it!! :)",
        "Hi Zareen, is the casting couch literally practiced in  Bollywood??  Have u ever faced it ??",
        "Hey zareen do you like to be called sexy or it is offensive for you by any fan",
        "Hi Zareen, which movie and cast have enjoyed working with the most?\n\nThank you,",
        "Hi Zareen are you single? Also you available to do a show in Dallas?",
        "Hi Zareen, I am big fan of yours and i follow you on Instagram and Reddit I saw Your All Movies i tell you true from my thinking you are more beautiful than Katrina",
        "Hi Miss Zareen . I just randomly watched Hate Story 3 during free time and I must say it is an amazing film. Great story and great cast too especially karan singh grover and your performance. You looked really beautiful and i loved your outfits especially that pink flower kind of outfit which you wore during the scene where you congratulated Sharman Joshi and his brother. The songs were my favourite part too especially wajah tum ho song. My rating for the film - ( 4 / 5 ). Worth rewatching\n\n\n\nI would just like to ask did you enjoy watching the film hate story 3 and how much would you rate it?   would you say that it is one of the best films in your career (noting that you did hum bhi akele tum bhi akele which was so good). Omg and i hope you are making a comeback",
        "Hi zarine , let me be true to you, u ve been the most desirable girl for me and i like you as a human too, I'm just here to tell that there are a lot of men like me who would like to see more of you. May be in movies/ series/ channels. \nI would always think of someone makes \" dark desire \" in Hindi none other than you would be a match. \nU r our Mattie perroni and people who disrespect you\" let them go to docks\".\nAll the best for your journey ahead ❤️🙏",
        "@ohsoperfectproposal @katflorence",
        "Will you marry me",
        "are there any destinations in India that you want to travel? How do you see India from your lens.",
        "Hi, zareen how are you?",
        "Gaand dede raand",
        "Hi Zareen , what about your forthcoming movies or series? Just curious",
        "Can we know about it now?"
    ],
    "cleaned_text": "hi zareen khan ive starred movies like veer ready houseful ask anything films characters acting life journey social topics ask away edit thats thank making session interesting see soon ",
    "cleaned_title": "hi zareen khan ive starred movies like veer ready houseful ask anything films characters acting life journey social topics ask away",
    "cleaned_selftext": "edit thats thank making session interesting see soon",
    "cleaned_comments": "loved good looks also actor since childhood veer days hope make good movies continue working dislike bollywood industry im still confused katrina kaif hi zareen movie regretted refusing like work bhai honest review please hi zareen good see keeping busy days upcoming projects hard think make industry outsider difficult enter film industry outsider tips would give upcoming actormodel tend get hit lot big producers run away supposedly big opportunities hi zareen people compared lot katrina kaif early days bollywood make feel impact career hi zareen would like explore ott platform hi zareen upcoming projects challenging role taken salman good costar favourite person work movies see movie among bollywood films youve part one holds fondest memories hi zareen spirituality spiritual hi beautiful person scale best much would rate bollywood based personal experience fitness journey aweinspiring kept motivated btw love much hi zareen enjoying trolls sometimes friends talk similar katrinas genes receive similar compliments looks resemblance katrina much loved first movie veer ready could collaborate actor director world would dream collaboration kind project would love work together hi zareen favourite actor actress misconceptions people actor influencer hi zareen whats one advice would like give outsider bollywood could play iconic historical fictional character would hi zareen deal constant comparison katrina kaif still thank keep love support coming grow thick skin people talk much shit influencers generalhow get affected negative comments always thought katrina kaif kid would love costar u upcoming projects share fun unexpected experience shooting film set might heard hi zareen plans contents south u upcoming projects tell us juciest thing know industry without taking name people working basis friendship rather talent aap aur katrina kaif dono alagalag ho kya gawk gawk body shaming reduced industry favorite show year favorite music also dating intimidating land first role overall experience industry bad say outsiders hi zareen one thing appreciate saman khan one thing absolutely hated havent seen last years movies upto dont let illuminati get zareen life precious remember jin actress ko salman bhaijaan launch krte hai unko kaam milna thodi mushkil ho jaata hai since foodie im curious best food ever tried please give one answer eat less rupees another like rupees hi zareen screat fitness love pak saw ama whats one thing dont know far ud like share plans roles south indian films salman wants introduced like sneha hows bhoi set please honest answer real criteria become actor bollywood think fake hey quite things actually working developing things ill let know due time ever given auditions hollywood movie hey zareen actor feel best onscreen chemistry hey zareen answer question billo bagge billeyan da ki karengi bagge bagge billeyan da ki karengi billo bagge billeyan da ki karengi waise aap ho kon na kabhi dekha na kabhi suna aaj first time hai city around world left lasting impression ever plan visit pakistan project favourite co star bollywood whats bucket list hi hope youre well opportunity work film industry indian otherwise one would whats dark side bollywood know share best worst experience shooting movie hello maam loved character veer would like ask characters played relatable wish well amazing managed transform type fitness regimen mental strength require sacrifices make feel like main stream bollywood cant make good comedy movies anymore theatres without downright offensive idiotic say movies like housefull full ableist jokes intelligently made films like kathalmonica darling choose ott releases think wouldnt find audience theatres someone whos many commercial movies whats take heavyweight actors lend starpower niche projects hi zareen hope fine last movie saw moved hey zareen loved saw veer bole bina mera nam aya song want know wan na say girls struggling accept love bodies feel salman seeking lookalikes exes ott webseries movie coming really gorgeous favourite movie casting couch experience love support maam aata rhega aap bus movies aane right quite hard esp arent licker bio says much actress saw chanakya movie agent btw nepotism big thing bollywood many say rehnde bhayii tumlog se kuch nai puchna much nose job lip job costed surgery look awesome whats secret kis hero ke saath kaam krna dream fitness journey inspiration many inspiration club cult people immensely rich famous also would prefer person industry better half buisnessjobceos explain answer marks xd take sushant singh rajput fiasco murder suicide movie wanted star didnt get chance without naming actor give example star tantrum surprised hi zareen thanks youve done movies north south tell us major differences production experiences hey feel acting hate story think pull big league stay way new movies coming ott big screen didnt even knew saw name imo youre one people people might know one really knows name barbie openheimer whats time favourite movie quite movies industry first big fan n acting less projects need n also youre crush since veer love hows akshay john co stars love chemistry one beautiful actress ive come across huge fan hope youre well oh god cant believe watched ready best performance time hope keep growing wishing best life ahead experience working jatt james bond punjabi film industry whole favorite movies hindi english n indian languages movies also watching days jobs wouldve interested acting whats meaning name heyy zareen feel remake character dheela bhai immortalized song brains dont questions want tell always liked person hope youre well continue future hey zareen whats taste music like got first break want say amazing gorgeous apart movies things enjoy people wont necessarily know casting couch real thing bollywood faced incidents hi favourite movie took part hi entered industry literally like lost child since dont come filmy background made feel really happy compared katrina fan found really pretty backfired career people industry dint give chance prove individuality hi nice see reddit one work one watch first one yet see movies bhoi type hi zareen put curd maggie hi zareen simple question hows life moment decided give recover damn beautiful always keep mind want say extremely beautiful love youtube videos wholesome watched makeup collection video happy use drugstore makeup like kinda aww moment note keep shining barbie oppenheimer youve part many mass masala movies actor director producers known eccentric andor concerned conventional film making yet somehow movies still make money due ardent fan following leads sets hard get voice heard artist approach way making easy money since dont use brain much owing onedimensional nature characters tough influencer deal negativity cope social media pressure hi zk always pleasure watch movies whats interesting project u working nowadays see u action ott silver screen also u seen white lotus u think anything like show ever possible bwood like ever hello zareen nothing ask going ask hows life definitely watched hum bhi akele tum bhi akele disney hotstar thoughts barbieheimer ok like touch gen z lingo trends stuff contribute pop culture like stuff idk dont seem like question something hi zareen would love see psychological thriller lines seen honest answer please getting replies someone team start vlog channel would love see reddit pe kaise aana hua nice missed favourite actress amongst thess kareena deepika priyanka alia last salman related question plan look films dont look like theyre done professional makeup artists nextupcoming movies hi hows journey far ever feel like switch career try something different hi zareen u try venturing movie industries india u get offers outside bollywood whats biggest movie ever rejected yeah enjoyed use reddit generally toxic bollywood standards would like call say princess yashodhara veer ive complete tomboy life playing princess like complete degree turn nepotism common across many industries india raw talent isnt enough many cases sad may yes saw trailer try watch thanks detailed response good luck career life ahead ever come close working shah rukh khan yes didnt happen role feel iconic also iconic audience think need reddit ama atm difference felt punjabi movie industry hindi film industry always wondered lesser known punjabi industry admired work honest answer casting couch real marketing team intern ki post h toh refer kar dena baaki kaisa sab chaipaani casting couch real everyone salman khan really like real life behind stage think nepotism stymieing ability make good meaningful movies also music cringe stuff served currently awe able make good creative stuff knowing fully well even movies like sholay copied renowned music producer past copied shit straight ignoring recent ones something else tried work film industry india bollywood tamiltelegu hello whats take casting couch real thing ever approached take role consideration favours hi zareen expect projects near future hi zareen big fan question whats fondest memory moment filming dont wan na work specific name enjoyed scary bhai cosmetic surgeries better aesthetics hi zareen dostana sex change whod want opposite kwksechuraya share weight loss journey keep fit hi zareen hope good bad scene casting couch sexual exploitation withing industry prevalent among big production houses also really wished would good bollywood bad accident goa hi zareen wan na know casting couch exists hi zk could one super power would yeah almost uncanny kadi pawaya ayi degree actually takes point means youre exact point started probably mean degrees hi dont think one force spirituality something come naturally see know lot people burn candles give long talks spirituality reality far away practising preach feel spirituality good deeds good human irrespective race religion hi zareen huge crush year old watched veer like working salman khan upcoming projects religious yes manage religion industry youre working whats skin care routine ever feel guilty always posting photos lot makeup heavy airbrushingphotoshopping applied thus promoting unrealistic expectations men women hi zareen didnt movies south prompted ama reddit dont see many official bollywoodhollywood celebs around bot kinda unrelated industry treat musicians well thought time music listening nowadays get work lick ass damnit im ever say serioussarcasm trick use reveal truth like jatt james bond lmao welcome reddit active movies switched entrepreneurship would rate u r life getting movies bad casting couch people outside industry favourite time movies hi zareen worst experience bollywood hi zarine massive crush since ive seen big screens seeing platform brings one closer talking question certain interests outside world glamour movie biz vested interests topics like popculture art etc hey zarin even come college rizvi college bandra wanted know college life would experienced days aap aam chuske khate ho ya chhilke hi zareen thank hard work got see enteraining career follow instagram hey zareen thoughts non hindi movie industries india plan venturing anytime soon hi whos favourite actor current generation hi zareen wanted ask somebody worked many movies personally top favourite movies time hollywood bollywood included awwww lots love well fitness journey started way back teens bcoz obese teenager started journey bcoz wanted bcoz told bullied loved every bit benefits got incorporated lifestyle dont aim size aim physically fit strong away chronic diseases looks like lovechild katrina kaif sunny leone current whatsapp dp tu footpath pe mil hi zareen things passionate acting oh love hey convinced ama reddit hi zareen think real person amongst celebrities youve known think meant role polar opposite like actually real life looks ai generated questions sure ask third question curiosity go auditions like would get know auditions going new movie series show etc bollywood really toxic experience salman khan muslim movies musics haram according islam come till religious beliefs u r following movie life sake curiosity sana khan dangal actress etc left movies islam hey zareen films remake would love leading role hi zareen upcoming movies shows havent seen main stream upto break upcoming movies looking forward watching hi zareen according experience could name actor n actress whos genuinely kind n nice bollywood hi zareen think impact ott film industry general think movie theatre industry go extinct make choice movies ott series preference also see southern movie industries hindi film industries merge terms actors jumping one industry another casts representing regions thanks ps would like see moviesseries good luck many list endless imitiaz ali anurag kashyap sanjay leela bhansali rajkumar hirani hello hope youre good day think nepotism getting better compared earlier hi zareen big fan tig bits maintain body diet workout plans u good family background surviving industry tough monetary wise favourite costar zareen ji amazing actress zareen hope see superhero movie someday dont like move na let fans comment body shaming affect constant comparison w katrina annoying hi zareen good see major crush character dheela song released working days pandemic changed life actor hi zareen script thought bad became hit hii zareen wanted know bollywood safe place actorsactresses actually humblekind compared screen persona one hollywood zareen seeing big screen ps really loved acting movies felt stay qna still going ever lost role nepo actor qualities make man attractive major differences find bollywood hollywood excluding language difference hi felt got good attention bad attention first time kinds people could restart entire life retaining knowledge would pick different career path hello zareen mam people still think pakistani actress know think people bollywood quite scared rise south indian cinema outside behave like dont care celebs well normal people partners celebshigh profile business people according also motivation get acting tech computers web etc assist help movie industry tell story u got st film dont think u wud hv gone much ahead bollywood u star kidthe main reason bollywood sucks right bcoz overflow starkids doesnt seem stopping anytime sooni really wud like see u mainstream movies know might sound cliched try live life seriously looking past works role think could better whats biggest regret made xerox cause shes spitting fax hey zareen really crush quite long usually apart movies actings aspirations love honesty hey zareen true order succeed actorsactresses especially new ones believeaccept idea sexual infidelity infidelity hi zareena surname khan lets marry hi zareen hope good health wed like know hobbies side hustles hi zareen like travelling favourite sightseeing spots india thanks replying love lot speculations around happens inside big bollywood parties one knows exactly throw lights would take date eventually marry honestly complete woman ever seen hi zareen challenging role done career watched barbie like thoughts barbie hi zareen first saw acted punjabi film called jatt james bond would like know experience working different language would consider roles languages hey zareen imma ask like common question get character like fully use drama actor young help really want get acting fieldso question prepare mind acting refreshing see honest replies good luck hang movies etc think one happy alone havent seen picture trolled showing stretch marks never promoted anything unreal always embraced flaws much achievements reading comprehension nil remember main karun sala good moves nice see rate hottest kiss reason watched hate story bc u thank lots love hi zareen whats something process film making came shock made debut aa gaye gyan dene wale mahapurush nah dont time keep celebrity drama ill take word look actor hi zareen whats favourite behindthescenes moment hi zareen worked multiple film industries whats unique thing every industry think veer debut movie right choice id reckon someone popular salman khan first movie going difficult lot reasons thanks zareen handle criticism social media whats height r ur upcoming movies hi zareen legit vibing character dheela song like minutes ago family always liked female lead flim weve watched past small really wanted ask take bollywood movies turned commercial angle lesser effort gradual increase age gaps male female lead recent films u debut hollywood actually trolled heavily said online bullying received traumatizing experience hi zareen experience working punjabi industry one thing liked disliked working hey zareen challenging hate story feel beautiful girl planet hi zareen honestly feel industry impacted mental health hi zareen wanted ask biggest misconception bollywood think biggest problem current filming scene india opinion hi zareen film regret career hi zareen maam bollywood actors directors writers use reddit regularly read subs related bollywood whats favorite bollywood movie werent part hello zareen movie enjoyed shooting punctual co star fav movie name dare speak manipur tooooo many things mention taking flying lessons visiting pyramids pet snake pet tiger seriously dude spitting faxxxxx lmao think proved individuality really well houseful movie good way hi zareen first wan na say really pretty question best worst experience working movie someone different body type expected actors bollywood find challenging feel inspiration many realise fit important skinny hi zareen wan na say look gorgeous youre ageing like fine wine hoping see best wishes whats reality casting couch ever faced something like hi zareen whats idealistic character anyone history would like play hi zareen generally prepare role shot get certain mindset particular role people always talk emotional scenes go romantic scene happy scene feeling cheers outsider literally known salman khans family one took part character deelah hai look like sister katrina kaif hi zareen whatre crazy things people get attention industry bollywood often stereotypes way presented veer movie break stereotype signing hate story like films hard would saying yes hate story loved film karan kundra ur song sun le zara beautiful indeed always felt lot potential hope see individual projects soon good luck zareen hello uzareenkhanofficial hello zareen maam manage stress work life also u chai person coffee fav actors pan indian thats nepotism thats cronyism prevalent everywhere even precious nolan answering random redittors important experience working punjabi movies hi zareen unwanted gossip youve associated youve laughed loudest hey think nepotism making hard new talents set foot bollywood always interested acting come naturally take training think someone become good acting training top favourite movies kind movies like watch kind movies like act feel bear resemblance elnaaz norouzi shes good foreign films hollywood also wouldnt make really confusing movie star movie includes mandana karimi mean sounding rude literally hearing name first time favourite character films love moms cooked food best restaurants tell u options less rs bun maska chai samosa maggi esp mountains around dont expensive taste im simple person simple delicious taste buds remember coming srcc delhi university early fashion show one organizers event select movies want continue acting select movies genuinely like script story would actor imagine anything acting maybe within industry something completely different remeber pretty popular curious go stop happened please suggest skin care tips bollywood industry especially medicated products supplements common beauty industry watch anime know weird question u leave industry hows current life going lodu bada aaya dont time lame ass troll go finding new projects liked bollywood joined fuck everyone cares celebrities life changed movies industry changed years throughout journey working actress think ageism remain factor actresses unlike counterpart industry future hello maam big fan seen movies plenty times thinking many connections bollywood still arent able get good movies whats reason yeah awww thank love know might sound crazy esp bcoz im actress dont really know make showed video ive learnt years dont really one particular shade thats fav always mix shades use liquid lipstick miss claire peach pink quite often asking celebrity question replying comments soon hit phone taste wrestlers trash sad lame ass troll always wanted film industry something else zareen absolutely stunning question feel like didnt get roles would related someone industry lot roles didnt get opportunity work since month muharram think sacrifices husayn hassan ali even nonreligious political perspective find moment early muslim history sadful hey questions reading responses thread rooting best zareen hi hope well opinion need intimacy directors sets favourite anime shows watch plan ott projects projects outside india see years plan bollywood want take part southern film industry find housefull awful rest us cant believe actually replied haha okay learn grow love miss claire lipsticks mixing lipsticks top tieryou try sephora cream lip stains favourite also many beautiful shades really comfortable long lasting would top three fitness based advice thanks wanted lot things actress look irony think opportunities women gotten better bollywood years think change industry sort movies interest explore currently movies days hi zareen hope good hows savlon bhoi days often lurk reddit certain celebrities even know reddit mam brought reddit surely enough famous every platform love movie veer played role phenomenally hi zareen following acting career since debut saw punjabi movies well tell negative point go whats guiltypleasesure general play games take walk something different hi zareen character dhila tight mistaken dont really lot connections industry also dont really know small talks heyy hows work experience daisy shah dont work south indian movies gyan galat nahi diya gaya hai never fail impress wish say impress beauty talent fitness think bollywood underutilising ever come face face katrina yes interaction casting couch real right oh see thank clarifying doubt hope stay safe good thought salman khan biggest connection dynamics definitely changed years feel ott coming ageism ism thanks answering pet tiger mike tyson approves childhood crush yeah lol ama toh reply kyu nahi degi watch oppenheimer thoughts movie would ever willing act hollywood film hi zareen hope see comment first film salman khan despite outsider difficult easy land role seen type change audience taste last years industry hi ever felt paparazzis dark side actor want become good friends future actor dont ever wan na see recently got flight simulator totally understand flying dream pet tiger otoh count sister answering ai whats wrong though take positively learn something new way upgrade hi zareen thank ama dont see much screen go auditions screen tests even known face like west look pick best whats coming towards sun lo suppose last day earth toh biggest regret ps gautam bhai ke joote kaise chori hone dediye aapnexd wish happiness ahead ur percentagecgpa class th th downvote kyun kr rhe yaar usme aisa jaruri thodi hai sabko reply degi mujhe lga question lost sea many questions itna rude kyun ho rhe happy replied really didnt need ruin someone actually post ai generated images sub looks bit like dont know think zareen httpswwwredditcomrindianartaicommentsabyabollywoodactressimaginedbyaiithinkshehttpswwwredditcomrindianartaicommentsabyabollywoodactressimaginedbyaiithinkshe hey zareen mafia mrd still controls bollywood like still meaning sound rude feels popular known specially never planned aspired bollywood serious nepotism issue well two issues coexist xb yes recently came across video claiming ive murdered whats perception life general hi zareen may ask real ignorance main stream personalities bollywood fraternity true newcomers question could phrased much better even replied least could absolute asshat deprived attention delusional behave ama pathetic person hometown introduced industry hi see back glam avatarand ott loved india tour series jeep ever get see character like one hate story among character fav one hey zareen quite curious would normal day look like someone entertainment industry also spice normal days maybe dont engage celeb worshiping subsposts god irony particular cuisine crave ready sort budge fitness schedule maam kind man man dreams many questions asked pr team think bollywood industry change started think bollywood heading towards maybe isnt hollywood lol celeb worship karte raho didi whats challenging thing youve overcome career mean literally hi zareen things life scare could anything animalspeopleexperiences favorite role youve played far pretty sure ass licked hi zareen best friend tumko kya problem hai dadaji like simple earth noticing since long time tumhari kyun jal rahi dum hai toh khud celebrity bano imma ask real questions think happened jiah khan sushant singh personally think bollywood dying due lack originality nepotism rise movies south help either ever done modelling yes really glamorous looks outside something else ott changing bollywood whats opinion otts general bhai arrogant obnoxious people say bcoz never life thought id something like time life wasnt work coming take care family film regrets bcoz see whats happening films ott much wrong sub zarine done ama rbollywood rbollyblindsandgossip pr people hobby licker literally hii zareen jii saw film want ask ever experienced paranormal activity life read zaheer khan first lol tum banjao itna pasand hai celeberity banane wannabe insta influencer hi zareen favourite movies reddit finally gone mainstream india dont even want engage conversation clearly happiness sucking cheap vampire go spread sadness beautiful maintain also u deal self doubt oof tricky response since know casting couch thing watched jojos bizzare adventures hi zareen curious want become kid pragmatic baat bolne se spreading sadness lol get dream world hey tour favorite actor bollywood hi zareen first one beautiful people ever seen screen yet see screen love comedy roles hope comedy films question ever faced situation almost good good movie end actress cast nepotism andor bollywood connections yes movie hy im always late fckkkkkkkkkkkkk well thats impossible hi zareen see otts hey reading replies never really expected insightful intrigues hear thoughts current situation bollywood terms box office collections witnessing rampant increase nationwide collections hollywood even south indian movies bollywood movies still hit miss think stems see possible change trends soon hey zareen feel communalism happening india feel bollywood channel reaching quite remote parts india responsibility educate instill feeling humanity take us forward economically societally possible like minded artists bollywood strive towards hello zareen mirza pakistan question regarding movies movie shoot facing prblm accident feel sad hello maam reports death greatly exaggerated guys know na ke pr guys answering questions actually zareen tu meri dost hai dont understand obsession even friends eat stuff mountains way maybe odd one well idk like civilised comment section guess people lot strictanti fun internet days post done internet vibes comments would interesting sounding scripted anyway didnt know itne hot log bhi reddit chalate hai lol know anyone bollywood never plastic surgery many fabulous graceful veer made childhood crush still want know favorite indoor plants home look irony case zairony bhois style say literally launched someone bollywood looks like makes happy chance go back time choose different career would still pick acting try sumn else rzareenkhan official subreddit claims burnt ash let itna sach bhi nahi bolna tha good question get much dislikes hows life tu gavar aur bewakoof dono hai kya pet snake pet tiger aap karan johar aur bhoi ko pet rakhna chah rahi ho gandi baat hi zareenthe last heard walking film producers forcing intimate scenesi want say kudos youi felt proud day im getting chance say jn person haan tujhe kaise pata chala childhood crush man used wait surili akhiyo waale salaam aaya come tv like describe funny incident shooting happy compensation get bollywood think professions people getting paid way suggestion people need maintain finance running home pursuing acting nolan thanks ama zareen answered lot questions seem kind genuine question interaction bollywood celebrities feel like theyre normal people enjoy hanging feel disconnect due privileged background bollywood families translation would interested south indian movies malayalam tamil people like think asshole everyone especially girl badass lol delusional much seems fake okay holy shit dark hi zareen favorite actor bollywood terms acting abilities first time read zaheer khan lol wont able correctly gist slice banana eating deep throat presentation mahi remake awesome remind ex wife lol ngl childhood crush read story tu hi meri dost hai hi zareeni want see u romcom possible really honest tell us casting couch name shady directors want take advantage woman bollywood pretty sure wont answer yea send gifts contact marketing tactics audience projection shenanigans issue kind movies would like try like bollywood known certain genre movies bit dont know put extra cheesy appease masses guess actors wouldve ambitions oh wish could indian version incetion barbie based taste lol khayali pulao like us us bhai us nothing ever goes planned accursed world cocaine answer try saying cockney accent damn reddit getting mainstream stop clout chasing man get let reddit go back insta twitter whatever get ur phone number need quick proposal said reply ama think trolling saying truth boom nowhere using gender card lol get grip would love see playing something like yashodhara veer sometime need mention movie names recognition loving responses reference question akshay kumar asked narendra modi didnt mean vulgar way hi zareen updates upcoming projects also intend branch spectrums industry apart acting real zarin khan literally trolling post instagram said influencer mocking way also people like work bringing people consider thinking hate people much business goodluck hate campaign hi zareen one beautiful heroines seen hindi cinema dont branch south act south indian movies money maybe slightly less professional movie shooting finishes months think add value help strengthen presence indian film industry btw beautiful dont even want engage conversation clearly happiness sucking cheap vampire still engaging trolling cussing shows hypocrite youre lol even cussed abused anywhere top playing gender card good find challenging detach character completing project particularly emotionally demanding joining reddit worst people collaborate done clearly sorry dont anything substantial today hi zareen hope youre great im really loving honest answers curious profession would rather chosen actress han gali khud aur jab point karu toh done boldo ok hello zareen struggling lose weight journey inspiring tips appreciated also really admire play stereotypical stick thin heroine movies many us struggle weight issues good see normal women screen nice work maam like role much veer housefull others movies also feel influence got entering bollywood vs bollywood im sure life changing coping changes active writers strike happening us could shed light indian film industry views unionization receive benefits done indian cine workers association people even aware rights industry surili akhiyon wale friend lolz hi zareen thoughts current tide entertainment industry especially wrt ott hi zareen become actor childhood dream sincere apologies case hate reddit becoming mainstream smh lets hope ban na ho jae ya koe kand na nikle idhar se made u log reddit true bollywood favors giving jobs lightskinned indians indians males females alike chance see deglam roles hello zareenthis wanted say nice day esp arent licker damn know funny enough hollywood industry doesnt outsource jobs hiring actors places like india china stuff hire mostly within states already ironic lol aging backwards hi zareen hope well ups downs everyones life keep motivated get bad times life throws us love work adore motivation wish get prove potential looking forward seeing best wishes tons love rock beautiful get huge boobsis chance may get see touch views salman khan hey zareen really love girl tell advice hi zareen long practice lagdi lahore di aa dance melvin louis amazing moves given option role forgotten woman fighters one would prefer play razia sultana begum hazrat mahal bi amma asghari begum thank muchhhh reply strive healthy mindset actually right circle meets end journey meet new meant opinion nepotism bollywood man opened eyes maybe akshay really asking would take obtain successful acting career also challenging get roles movies recover public mistakes unknowingly put political statement something related public furious ur statements instagram create opportunity acting career watch oppenheimer bollywood make historical films actually accurate cared hi zareen outsidernonstar kids admirename hi zareen r u nowadays asked question dont know whether seen nothere asking thought hate story give big push know movie state shooting stage actorsactress openly confessed know acting badflop movie movie thought shooting going flop hard feelings didnt get movies cant act period bhai drive car would better question movies socks pets zoo hey zareen havent worked movies time particular reason hey zareen questions ask love acting like lot stay love joy hi zareen vijay admire work lot first saw movie veer immediately fell looks looked forward films actually iit bombay probability meeting celebrity like last time saw vicky kaushal pawai dream meet meet thats wanted say depends location really dont want experiment stomach hiking thats issue eat whatever want waiting come back bang going make comeback anytime soon maintain consistency discipline egit may diet healthy habits habits helps us growhow maintained well fear stomach always understand people craving stuff mountains thats thought reddit moment tigers snakes pets stick domesticated animals keep wildlife little remaining wild areas however interested still adopt tiger snake indian zoo fund animal rescue center orphanage may let tend animals routine treatments etc sorry sound pretentious please take nepotism bollywood industry doesnt make angry see talented beautiful actress like get much opportunities star kids address body shaming stuff goes around media hi zareen ji loved ur honest replies would like suggest u suppose ur getting roles u want switch tv industry showcase ur talent one best thing like u get roles film didnt compromise ur values appreciate honest replies knowledge btown celebrity proper fun ama imran khan years backhttpsnpredditcomrindiacommentsbpyhiredditlongtimelurkerfirsttimeposterimran meanwhile priyanka chopra couldnt answer single questionhttpsnpredditcomriamacommentsnrghelloimpriyankachopraimanactressand power stay strong stay humble mai karun toh saala character dheela hai common people listened many bad things bollywood days like casting couch stuff kinda thing like normal fud among people hi zareen really like style way acting much confidence btw pharma company would like work ad shoots whats good place discuss stuff hii zareen describe hobby interest outside work public persona absolutely love song surili akhiyon wale came little girl used think u indian disney princess favourite cricketer whats fav movie time hello fan whats goto cheat meal almost decade back met kuala lumpur didnt good phone back thank time kind nice one nalla like nihil hi zareen feel guys masturbating get envious overcome point journey difficult overcome envy nature mine tough lmao comments priyankas ama brutal hii zareen speak marathi hi whats next project wow youre truly inspiring actress zareen ive watched many films truly enjoy themes stories bring screen hi zareen always wanted confirm one thing school one school kid forgot name claimed cousin th grader year rajasthan school dawn academy panchgani confirm please feel weird go public surprise nobody recognizes hi musician listening days whats going communite celebrities thats crazy hi zareen question comment makes feel ashamed hehe good one zareen hi zareen big fan work experience working industry part craft feel like need work actor actual experience working salman khan ever go driving bhoi damn thanks ever faced sexual harassment bollywood people got grace deserve slb movie far know things also happened earlier maam know pashtun pashto language connected influencerr always actor actors sleep around cocaine incredible actor characters always depth weed hand definitely cut angles first tho name movies starred billo bagge billeyan da ki karegi bagge bagge billeyan da ki karegi hey zareen questions wanted say cant wait next movie years since hum bhi akele tum bhi akele release really nice movie excited upcoming stuff think typecasted bollywood keen directorsproducers general give someone role different typecast todays landscape remind lana del rey bit sending likes love future projects session khtm ho gya kya mean two right angles respond creeps perverts social media anyone ever told look lot like alexandra dadario hard name alia eat cheap places chai samosa maggi etc stuff someone asked around id likely say pav bhaji chole bhature etc im probably never gon na buy single dish though answer zareen ghapa ghap tak tha uska saath bas hi zareen much hot beautiful human tell things questions life career make anxiousand also feel quite low something cheers u shes film family though hi zareen wanted say hi hi zareen door salman fuck haha wondering one asking obvious question yes would answered question probably default arrange visas movies shot india hire indian actors eg extraction cillian murphy working christopher nolan since batman begins almost films ever since pray namaz since women ordered cover u feel uncovered body displayed many people afraid jahannam hey zareen advice year old also lots lots love look rude people downvoted every comment wonder celebs stayed away ready big cat pet illegal saying huge cat lover aint matter superstar knows well giving break count nepo hey zareen seen jatt james bond childhood face character experience punjabi industry omg links nude one min silence thought actually lol nomies bhi reddit pe ane lage ab reddit chhordna hoga wasnt nearly successful katrina hate ofc bhai failed didnt wasnt looks made katrina famous charisma factor also really good dancer salmonellas whole im powerful launch another woman looks like youre replaceable schtick failed miserably coming lucknow would love help explore city hi zareen whats thing love free time hi zareen seen u person aldo major brand retail opening phoenix market city awe ur skin question u really answering queries urself yes u address hate bollywood noticed happening wasnt done quality films couldve different level choose one bollywood movie american idea would recommend start ie overly stylized good subtitlesdubbing relatable story etc hi zareen khan far havent seen big celebrities create official account reddit kudos also answering questions posted im happy see side also favorite bollywood celebrity malefemale dave shutton springfield daily shopper going time claim term insurance keep money safe ever heard rajpal yadav amazing memory salman bhai maam pet snakes tigers figuratively speakingi hope pet snake named nagraaj answering questions dont think hope becomes trend indian celebrities amas didnt know zareen khan uses reddit hi zareen debuted started memory serves back mainstream cinema probably television viable options part show business advent ott plethora opportunities level playing include talents across levels would dream project given plethora opportunities today make mark artist audience easy difficult stay relevant age internet connectivity bhai real life personally gaming come waves may go months without time ill find one good sink life dont feel bad loving something long doesnt effect responsibilities tell darkest phase ur journey fased gangs influence castingother decision making bollywood haan dikha diya ki tu genius hai khush chutiya saala imagine synchronicity thinking today upto good see alright much would could wouldchuck chuck wouldchuck could chuck would good point didnt even think tbh favorite shorter get sense ppl get perm type casted unfortunately idk moment thought cricket wala zaheer khan got excited hii zareen started career thought acting since filmy background kind problem faced early life industry one beautiful actresses world indeed salman bhai choreograph songs hi zareen keep good work itni gandi movies role karke apko kaisa laga hi zareen related zarine sanjay khan wife arey gyani chodu hey zareen wanted say biggest crush ever since saw kid veer since ive madly love loved performance housefull youll always one favourite actress bhoi bollywood became star difficult make friends personal connections able see individuals tried part life sole reason star individual think pr teams leave reddit alone try turn instagram never lol haath jodta hu best lips industry dont screw natural beauty like others identified pr activity treated audience fellow redditors last time saw jspm pune covid looked stunning even cbum strechmarks medals hard work qualifications like study dont mind telling think fully utilised explored industry working movies ott series selective lack opportunities straightforward honest replies beerbiceps asli id se aao fellow forrest gumper fapped many times hope didnt mind think got roles took like pro hey zareen youre muslim personal one tell practicing muslim personal choose skip apart girl pakistan really love bold looks pretty smile love pakistan ever thought working pakistan still obsessed shahid afridi listen pakistani music listen tendy punjabi music sidhu ap shubh director got fund movies become assistant main director short year year hello look stunning ever considered trying luck tollywood would see big screen dying see ever wondered hollywood man imran khan ama looks fun dude seems like genuinely nice guy around real id se aao ranveer allahabadia everybody drugs bollywood necessary reach stage offered top actors actresses industry also without mentioning name please tell us hi maam one reply said like tom boy im kinda times want look good dress style simple makeup thing wont bother comfort much still make look pretty used think sibling katrina kaif really long time would great could hear journey film industry mean end right took whole new turn like changed something yeah guess pretty valid rkerala users guys pressing x given happened last month question superpower would regards end working many tamil movies well wan na ask casting coach real fake hello zareen khan big fan since movie veer fell head heels back loved ever since however noticed last film housefull wonder left bollywood sincerely hope consider making comeback especially ott platforms next big thing entertainment industry ott collaborate pioneers like tvf tsp sonyliv netflix etc reach wider audience fans including would thrilled see back screen please let us know reason behind departure bollywood miss love zareen eagerly await return damn rarely seen actors account reddit marry boy friend could message privately question might embarrassing subreddit read yeah comments brutal wonder rest stayed away awesome nothing ask stay safe enjoy remember people respect give opportunities based character well smile keep character dont lose thinking people get together fun moral way best top underrated bollywood movies acc actress film industry career path would pursued love qus deleted dont know make superhero movie loved performance hi zareen casting couch literally practiced bollywood u ever faced hey zareen like called sexy offensive fan hi zareen movie cast enjoyed working thank hi zareen single also available show dallas hi zareen big fan follow instagram reddit saw movies tell true thinking beautiful katrina hi miss zareen randomly watched hate story free time must say amazing film great story great cast especially karan singh grover performance looked really beautiful loved outfits especially pink flower kind outfit wore scene congratulated sharman joshi brother songs favourite part especially wajah tum ho song rating film worth rewatching would like ask enjoy watching film hate story much would rate would say one best films career noting hum bhi akele tum bhi akele good omg hope making comeback hi zarine let true u desirable girl like human im tell lot men like would like see may movies series channels would always think someone makes dark desire hindi none would match u r mattie perroni people disrespect let go docks best journey ahead ohsoperfectproposal katflorence marry destinations india want travel see india lens hi zareen gaand dede raand hi zareen forthcoming movies series curious know",
    "light_cleaned_title": "Hi I am Zareen Khan. I’ve starred in movies like Veer, Ready and Houseful 2. Ask me anything about films, characters, acting, life, my journey, and social topics. Ask away!!",
    "light_cleaned_selftext": "EDIT - 'THAT'S ALL FOR NOW .... THANK YOU ALL FOR MAKING THIS SESSION SO INTERESTING .... SEE YOU SOON' ❤️",
    "light_cleaned_comments": "I just loved you for you good looks and also as an actor since my childhood (veer days) I just hope you make more such good movies and continue working What do you dislike the most about Bollywood industry? I'm still confused between her and Katrina Kaif Hi Zareen, which movie you regretted refusing and why? How was it like to work with Bhai? (Honest Review Please) Hi Zareen, good to see you. What is keeping you busy these days ? Any upcoming projects ? How hard do you think it is to make it in the industry as an outsider? How difficult was it to enter the film industry being an outsider? What tips would you give an upcoming actor/model? I tend to get hit on a lot by big producers and I run away from supposedly big opportunities Hi Zareen, People compared you a lot with Katrina Kaif in your early days in Bollywood. How did it make you feel and did it have any impact on your career? Hi Zareen, would you like to explore OTT platform? Hi Zareen! What are your upcoming projects? Which has been the most challenging role you have taken and why? Is Salman a good co-star?? Who was your favourite person to work with in movies?? When can we see you again in a movie??? Among all the Bollywood films you've been a part of, which one holds the fondest memories for you, and why? Hi Zareen what do you do for spirituality? Are you spiritual? Hi there beautiful person! On a scale of 0 to 10, 10 being the best, How much would you rate Bollywood based on your personal experience? Your fitness journey is awe-inspiring. What kept you motivated? Btw, I love you so much <3 Hi Zareen Are you enjoying the trolls about you Sometimes my friends and I talk about how similar your and Katrina's genes are! Did you receive any similar compliments before for your looks and resemblance with Katrina? Much Loved your first movie Veer and Ready🙏 you could collaborate with any actor or director in the world, who would be your dream collaboration, and what kind of project would you love to work on together? Hi Zareen who is your favourite actor and actress Any misconceptions people have about being an actor or influencer? Hi Zareen what's the one advice you you would like to give to an outsider in Bollywood If you could play any iconic historical or fictional character, who would it be and why? Hi, Zareen how do you deal with the constant comparison with Katrina Kaif still? Thank you ... keep the love and support coming ❤️ How do you grow thick skin... people talk so much shit about you and influencers in general....how do you not get affected by all the negative comments I always thought she was Katrina kaif when I was a kid😭 Who would you love to co-star with? Are u having any upcoming projects Can you share a fun or unexpected experience while shooting a film set that we might not have heard before? Hi Zareen any plans to do contents in south Do u have any upcoming projects Tell us the juciest thing you know about the industry without taking name People working on the basis of friendship rather than talent. Aap aur Katrina Kaif dono alag-alag ho kya? 😌 Gawk gawk Has body shaming reduced in the industry? Favorite show this year and favorite music? Also are you dating? Intimidating ! How did you land your first role?? How was the overall experience and is the industry as bad as they say for the outsiders?? Hi Zareen, What is one thing you appreciate about Saman Khan and what is one thing you absolutely hated Haven’t seen you in last few years in any movies, what are you upto now? Don’t let the Illuminati get to you, Zareen. Your life is precious, remember that. Why is that Jin actress ko Salman bhaijaan launch krte hai unko kaam milna thodi mushkil ho jaata hai Since you are a foodie, I'm curious, which is the best food you have *ever* tried? Please give one answer that you can eat for less than 100 rupees and another for like 5,000 rupees. Hi Zareen screat of your fitness Love from pak I saw this AMA what's one thing we don't know about you so far that u'd like to share Do you have any plans to do roles in South Indian films? That is what salman wants and why he introduced her. Just like he did with Sneha How's Bhoi on set? Please honest answer What are the real criteria to become an actor in Bollywood? I think you are fake Hey, Quite a few things actually... working on developing few things which I'll let you all know in due time 😊 have you ever given auditions for a hollywood movie ? Hey Zareen, which actor you feel you had the best on-screen chemistry with!!? Hey zareen can you answer this question Billo Bagge Billeyan Da Ki Karengi, Bagge- Bagge Billeyan Da Ki Karengi, Billo Bagge Billeyan Da Ki Karengi, Waise aap ho kon. Na kabhi dekha na kabhi suna. Aaj first time hai Which city around the world left a lasting impression? Ever plan to visit Pakistan for some project? Your favourite co star in Bollywood ! What's on your bucket list? Hi, I hope you’re well! If you had an opportunity to work in any film industry (Indian or otherwise), which one would it be and why? What's the Dark side of Bollywood which very few know Share your best and worst experience while shooting a movie Hello ma’am, I loved your character in Veer. I would like to ask you from all of the characters that you have played, which has been the most relatable to you? I Wish you well <3 Amazing how you managed to to transform. What type of fitness regimen and mental strength did it require? Any sacrifices you had to make? Do you feel like main stream Bollywood can't make good comedy movies anymore for the theatres without being downright offensive or idiotic? Say, movies like Housefull 4 we're full of ableist jokes, while intelligently made films like Kathal/Monica O My Darling choose OTT releases because they think they wouldn't find an audience in theatres. As someone who's been in so many commercial movies, what's your take on this? Should more heavyweight actors lend their starpower to such niche projects? Hi Zareen! Hope you are doing fine. Which was the last movie you saw that moved you? Hey zareen! I loved you when I saw you in veer and bole bina mera nam aya song.. I want to know what do you wanna say to all girls out there struggling to accept and love their bodies How do you feel about salman seeking out lookalikes of his exes? Is any ott webseries or movie coming?? And you are really gorgeous 😍 Which is your favourite movie? Casting couch experience? Love or support to ma'am aata rhega aap bus movies aane do Right now.... Quite hard esp. if you aren't an A\\*\\* licker ! your bio says \"much more than an actress\". what are you? I saw you in chanakya movie where you were an agent. Btw is nepotism a big thing in Bollywood as many say. Rehnde bhayii tumlog se kuch nai puchna How much your nose job and lip job costed? And who did the surgery? You look awesome what's the secret? Kis hero ke saath kaam krna is dream for you ? Your fitness journey has been an inspiration for many, who has been your inspiration? Is there a club or cult for people who are immensely rich or famous ? Also would you prefer a person from your industry for your better half or from some other buisness/job/ceos? (Explain your answer for 5 marks XD) Your take on the Sushant Singh Rajput fiasco? Murder or suicide? What movie you wanted to star in but didn't get the chance? Without naming the actor - can you give an example of a star tantrum which surprised you ? Hi Zareen! Thanks for doing this :) As you've done movies in both North and South, can you tell us more about any major differences between the production experiences? Hey, how did you feel after acting in hate story? Did you think it will pull into the big league or stay the same? By the way, any new movies coming in ott or big screen? I didn't even knew who are you until I saw your name imo you're one of those people who people might know about but no one really knows your name Barbie or openheimer ? What's your all time favourite movie? You did quite a few movies in the industry 😏 /s First of all Big fan of you n your acting. Why you do very less projects?? We need more of you n also you're my crush since veer love you ❤️❤️ How's akshay and John as co stars? Love their chemistry One of the most beautiful actress I've come across! Been a huge fan.. Hope you're doing well ❤ Oh my God, I can't believe I watched you in ready it was your best performance of all time for me i hope you keep growing wishing the best life ahead What was your experience while working on Jatt James Bond and Punjabi film industry as whole ? What are your favorite movies in hindi english n from other indian languages movies. Also what are you watching these days What other jobs would've you been interested in if not acting? What's the meaning of your name? Heyy Zareen. What do you feel about the remake of Character Dheela? You and Bhai had immortalized the song in our brains. I don't have any questions for you but I want to tell you that I have always liked you as a person. I hope you're doing well and continue to do so in the future. Hey zareen, what's your taste in music like? How did you got your first break? Just want to say you are amazing and so gorgeous! 😍 Apart from movies, what are the things you enjoy doing which people won't necessarily know about? Is casting couch a real thing in Bollywood? And did you faced any such incidents? Hi! What was your favourite movie you took part in? Hi , So when I entered this industry , I was literally like a lost child since I don't come from a filmy background so it made me feel really happy being compared to Katrina as I was her fan too and found her really pretty. But it backfired on my career as the people of this industry din't give me a chance to prove my individuality. Hi, nice to see you here on reddit. Which one of your work one should watch first if one is yet to see any of your movies. bhoi has a type Hi Zareen. Do you put curd in your maggie? Hi zareen. Simple question how are you doing? How's life? Is there any moment when you decided to give up? If so, then how did you recover? You are damn beautiful.. always keep that in your mind :) :) Just want to say you are extremely beautiful and I love your Youtube Videos. They are wholesome💗 I watched your makeup collection video and I was so happy that you use drugstore makeup just like me. Kinda \"aww\" moment for me. On that note, keep shining✨️ Barbie or Oppenheimer? You've been part of many mass masala movies where the actor, director, or producers have been known to be eccentric and/or not concerned about conventional film making. Yet, somehow, these movies still make money due to an ardent fan following for the leads. When you are on these sets, is it hard for your to get your voice heard as an artist? Or do you just approach them as a way of making easy money, since you don't have to use your brain so much owing to the one-dimensional nature of the characters? How tough it is to be an influencer and deal with all the negativity? how do you cope with the social media pressure? Hi ZK..! It's always a pleasure to watch your movies. What's the most interesting project u working on nowadays and when will we see u in action in ott Or silver screen.? Also have u seen \"white lotus\" and do u think anything like that show is ever possible in bwood not now like ever ? Hello Zareen, nothing to ask, just going to ask, how are you? How's life? Definitely ! Have you watched 'HUM BHI AKELE, TUM BHI AKELE !' on Disney Hotstar? Thoughts on Barbieheimer? ok so are you like in touch with the gen z lingo and all the trends and stuff that you contribute to pop culture, like all the stuff. idk this dont seem like a question but something? Hi Zareen! Would love to see you in a psychological thriller on the lines of Se7en. Honest answer please .... Are we getting replies from you or someone in your team ? You should start a vlog channel :D would love to see it Reddit pe kaise aana hua? Nice to have you here, I missed you! who is your favourite actress amongst thess kareena deepika priyanka alia Now last Salman related question. Does he plan his look in his films himself? Because most of them don't look like they're done by professional makeup artists. Next/upcoming movies? Hi, hows your journey so far? Do you ever feel like switch career or try something more different ? :) Hi Zareen, did u try venturing to other movie industries in India, did u get such offers from outside Bollywood What's the biggest movie you have ever rejected? yeah enjoyed that. Do you use reddit generally? What are some toxic Bollywood standards that you would like to call out? I will have to say - Princess Yashodhara from VEER ! Because I've been a complete tomboy all my life , and playing a princess was like a complete 360 degree turn. Nepotism is common across many industries in India… raw talent isn’t enough in many cases, sad as that may be. Yes I saw the trailer I will try to watch Thanks for detailed response, good luck for your career and life ahead! Have you ever come close to working with Shah Rukh Khan? If yes, then why didn't it happen? What role do you feel has the been the most iconic for you And also the most iconic for the audience? Why do you think you need a Reddit AMA atm? What was the difference you felt between the Punjabi Movie industry and Hindi Film Industry? I always wondered how lesser known the punjabi industry is, admired your work there. Be honest with the answer Is casting couch real? ✌️ Marketing team me intern ki post h toh refer kar dena baaki kaisa sab chai-paani ? Is casting couch real? For everyone? How is Salman Khan really? Like real life behind the stage? And do you think nepotism is stymieing our ability to make good and meaningful movies and also music- not the cringe stuff that is being served currently? OR awe are just not able to make good and creative stuff (knowing fully well even movies like Sholay was copied and renowned music producer or the past copied shit straight - not ignoring the recent ones) OR is it something else Have you tried to work in any film industry in India other than Bollywood and Tamil/telegu? Hello, what's your take on casting couch and is it a real thing. Have you ever been approached to take on a role in consideration of other favours ? Hi Zareen, can we expect any projects in the near future Hi Zareen, big fan. Had a question for you. What’s your fondest memory or moment while filming? With whom you don't wanna work again? And why? ( specific name ) enjoyed that Scary Bhai Cosmetic surgeries for better aesthetics? Any? Hi Zareen If dostana 2 had a sex change, who'd you want opposite you? (#KWKseChuraya) Can you share your weight loss journey and how do you keep yourself so fit? Hi zareen, hope you are doing good. How bad is the scene of casting couch and sexual exploitation withing the industry? Is it prevalent among big production houses also? I really wished you would do good in Bollywood How bad was your accident in Goa? Hi zareen, I wanna know about the casting couch, if it exists. Hi ZK, if you could have just ONE super power, what would it be and why? Yeah it's almost uncanny Kadi which pawaya ayi? 360 degree actually takes to the same point. It means you’re at the exact same point as when you started . You probably mean 180 degrees. Hi, I don't think one has to force spirituality... its something that should come naturally . I see and know of a lot of people who burn candles and give long talks about spirituality but in their reality , they are far away from practising what they preach. I feel spirituality is about doing good deeds and being a good human irrespective of any race and religion. Hi Zareen!!! I had a huge crush on you as a 10 year old when I watched \"Veer\". How was it like working with Salman Khan? Do you have any upcoming projects? Are you religious? If yes, how do you manage your religion with the industry you're working in? What's your skin care routine? Ever feel guilty of always posting photos with a lot of make-up and heavy airbrushing/photoshopping applied and thus promoting unrealistic expectations for BOTH men and women? Hi Zareen, why didnt do any movies down South?? What prompted you to do an AMA on reddit? I don't see many official bollywood/hollywood celebs around. Are you a bot? Kinda unrelated but does the industry not treat it's musicians well? I have thought about it for some time now. What music you listening nowadays? So I get to work with you if I lick your ass? Damnit, I'm in /s Have you ever had to say that? /s S for serious/sarcasm (a trick you can use to reveal the truth too) Did you like doing Jatt James Bond lmao? Welcome to Reddit, Are you active in movies or switched to entrepreneurship? How would you rate u r life before and after getting into movies? How bad is the casting couch for people from outside the industry? Your favourite all time movies? Hi Zareen! What has been the worst experience for you in Bollywood? Hi Zarine, i have had a massive crush on you since I've seen you on the big screens. Seeing as this is a platform that brings one closer to talking to you, my question to you is what are certain interests you have outside of the world of glamour and the movie biz. Do you have any vested interests in topics like Pop-culture, art, etc; Hey zarin, even I come from the college (Rizvi College Bandra) from where you were, so I wanted to know how was your college life how would you experienced those day's! Now… aap aam chuske khate ho ya chhilke? Hi Zareen, Thank you for your hard work we got to see enteraining career of you. Can you follow me on instagram 🫣 Hey Zareen! What are your thoughts on the non Hindi movie industries in India? Do you plan on venturing into them anytime soon? Hi, Who's your favourite actor in the current generation ? Hi Zareen i wanted to ask as somebody who has worked in so many movies, what are personally your top 3 favourite movies of all time? hollywood and bollywood both included Awwww lots of love to you too. Well , my fitness journey started way back in my teens bcoz I was an obese teenager .... and I started that journey bcoz I wanted to and not bcoz some1 told me to or bullied me .... and I loved every bit of the benefits I got out of it so now I have incorporated it as my lifestyle. I don't aim at being size 0 .... I aim at being physically fit and strong and away from chronic diseases. She looks like lovechild of Katrina Kaif and Sunny Leone Your current WhatsApp dp? tu footpath pe mil Hi Zareen, what are some things you are passionate about, other than acting? Oh I love it ! 😂 Hey, who convinced you for AMA on reddit? Hi Zareen!!! Who do you think is the most real person amongst all the celebrities you've known I think she meant the role was polar opposite of what she is like actually in real life Is it just me or she looks AI generated ? I have 3 questions , but I am not sure I should ask my third question or not … But just for my curiosity… 1-: how should we go for auditions like how would we get to know which auditions is going on for new movie or series or show etc .??? 2-: is Bollywood really toxic?? And how was you experience with Salman khan ?? 3-: you are a Muslim , and these movies and musics and all are haram according to Islam then how come you are doing this till now and what about your religious beliefs if u r following this movie life ??(just for sake of curiosity because sana khan, dangal actress etc have left movies for Islam ) … Hey Zareen, in which films remake would you love to do leading role ? Hi zareen any upcoming movies or shows haven't seen you in a while in the main stream what have you been upto during the break Are there any upcoming movies you are looking forward to watching? Hi Zareen! According to your experience, could you name an actor n actress who's genuinely very kind n nice in Bollywood? Hi Zareen, What do you think the impact of OTT has been on the film industry in general, and do you think the movie theatre industry will go extinct? Do you make a choice between movies and OTT series? Do you have any preference? Also, do you see the southern movie industries and hindi film industries merge in terms of actors jumping from one industry to another, and casts representing all regions? Thanks! Ps: would like to see you in more movies/series, good luck. There are so many .... the list is endless .... IMITIAZ ALI ANURAG KASHYAP SANJAY LEELA BHANSALI RAJKUMAR HIRANI Hello, hope you’re having a good day. Do you think nepotism is getting better as compared to earlier? Hi Zareen, Big fan of your tig bits. How do you maintain your body - diet & workout plans ? Are u from a good family background as surviving in the industry is very tough monetary wise Who is your favourite co-star, Zareen ji? You are an amazing actress zareen .....Hope to see you in a superhero movie someday If you dont like it move on na. Let the fans comment. Does body shaming affect you? And was constant comparison w Katrina annoying? Hi Zareen, good to see you. Had a major crush on you when the character dheela song released. What are you working on these days? How has the pandemic changed your life as an actor? Hi Zareen, was there a script which you thought was bad and it became a hit ?? Hii Zareen! Just wanted to know that is bollywood a safe place to be in? and are actors/actresses actually humble/kind compared to their on screen persona. No one in Hollywood? Zareen why are we not seeing more of you on the big screen? (PS: I really loved your acting in all of the movies and felt you were here to stay) Is this QnA still going on? Did you ever lost a role to a Nepo actor???? What are the qualities that make a man attractive for you? What are the major differences you find between Bollywood and Hollywood? (Excluding the language difference) Hi, how have felt when you have got good attention and bad attention for the first time from all kinds of people? If you could restart your entire life, while retaining all your knowledge, would you pick a different career path? Hello Zareen Mam why do people still think that you are a Pakistani actress do you know about this? do you think people from bollywood are quite scared of rise of south indian cinema?? from outside they behave like they don't care Do celebs do well with normal people as partners or with other celebs/high profile business people according to you? Also, what was your motivation to get into acting? How can tech (computers, Web etc.) assist / help the movie industry ? Can you tell the story of how u got your 1st film Don't think u wud hv gone much ahead in bollywood had u been a star kid!!??the main reason why bollywood sucks right now is bcoz of the overflow of starkids and it doesn't seem to be stopping anytime soon.i really wud like to see more of u in mainstream movies I know this might sound cliched but I try to live life not too seriously . Looking at your past works, which role do you think that you could do better now?? What’s your biggest regret? She was made by xerox cause she's spitting fax Hey Zareen! I really had a crush on you for quite long! What do you usually apart from movies and actings? What are your other aspirations? Love your honesty 😂😂😂 Hey Zareen, is it true that in order to succeed, the actors/actresses (especially new ones) have to believe/accept the idea that “sexual infidelity is not infidelity”? Hi Zareena. My surname is khan too.. Lets marry. Hi Zareen, I hope you are in good health. We'd like to know about your hobbies and side hustles. Hi Zareen, Do you like travelling? What are your favourite sightseeing spots in India? Thanks for replying love you there are lot of speculations around that what happens inside big bollywood parties but no one knows exactly, can you throw some lights on that?? What would it take to date and eventually marry you? Honestly, you are the most complete woman I have ever seen. Hi Zareen!! What is the most challenging role you have done in your career? have you watched Barbie? did you like it? what are your thoughts on barbie? Hi Zareen, I first saw you when you acted in a Punjabi film called 'Jatt James Bond'. I would like to know your experience about working in a different language. Would you consider roles in other languages too?? Hey zareen So imma ask you like a common question... how do you get into the character like fully?? did you use to be a drama actor when you were young? does that help? i really want to get into the acting field....so what my question is how did you prepare your mind for acting? It's refreshing to see honest replies! Good luck 😄 Do you hang out by yourself for movies etc? Do you think one can be happy alone ? Haven't you seen my picture where I was trolled for showing off my stretch marks??? I have never promoted anything unreal ... I have always embraced my flaws as much as my achievements . Reading comprehension = nil I remember you from main karun to sala. Good moves. Nice to see you here. Which will you rate as your hottest kiss 💋💋? The only reason I watched hate story 3 is bc of u Thank you ... Lots of love ❤️ Hi Zareen what’s something about the process of film making that came as a shock to you when you made your debut ? Aa gaye Gyan Dene Wale mahapurush Nah I don't have time to keep up with celebrity drama. But I'll take your word for it. Who do you look up to as an actor? Hi zareen. What's your favourite behind-the-scenes moment? Hi Zareen you have worked in multiple film industries what’s the unique thing about every industry Do you think Veer as your debut movie was the right choice? I'd reckon being with someone as popular as Salman Khan in the first movie is going to be difficult for a lot of reasons. Thanks! Zareen, how do you handle criticism on social media ? What’s your height? What r ur upcoming movies?? Hi Zareen, \\-I was legit vibing to \"character dheela\" song like 5 minutes ago! Me and my family always liked you as a female lead in all the flim we've watched in the past (when I was small). \\-I really wanted to ask you about your take on Bollywood movies being turned to a commercial angle with lesser effort and gradual increase between the age gaps of male and female lead in recent films? When will u debut in Hollywood?? she was actually trolled heavily for that, she said the online bullying she received for that was a traumatizing experience for her Hi zareen 🧚 How was your experience working in Punjabi industry? Which is the one thing you liked & disliked working there? Hey Zareen. How challenging was it for you to do Hate Story 3? How does it feel to be the most beautiful girl on the planet? Hi Zareen , honestly how do you feel industry impacted your mental health? Hi Zareen, Wanted to ask about what the biggest misconception about Bollywood is and what you think is the biggest problem with the current filming scene in India (in your opinion) Hi Zareen so any film you regret doing in your career?? Hi Zareen Ma'am, do bollywood actors, directors, writers... use reddit regularly. And do they read about themselves on subs related to Bollywood? What's your favorite Bollywood movie that you weren't a part of? Hello zareen 1) Which movie you most enjoyed while shooting ? 2) Who is most punctual co star ? 3) Fav movie name ? 4) Will you dare to speak about Manipur ? Tooooo many things .... few to mention - Taking flying lessons. Visiting the pyramids. Having a pet snake and a pet tiger. Seriously dude 😒 Spitting faxxxxx!! lmao what!? I think she proved her individuality really well in houseful movie. In a good way. Hi Zareen, first off I wanna say, you are really pretty! My question: what has been your best and worst experience of working on a movie? As someone who had a different body type than what is expected from actors in bollywood did you find it challenging? I feel you are an inspiration to many who realise that being fit is more important than being skinny Hi Zareen, I just wanna say you look gorgeous and you're ageing like fine wine. Hoping to see more of you, best wishes! What's the reality of casting couch, have you ever faced something like that ? Hi Zareen, whats the idealistic character anyone from the history that you would like to play? Hi Zareen , How do you generally prepare for a role or a shot , do you have to get in a certain mindset for a particular role , people always talk about emotional scenes but how do you go about doing a romantic scene or a happy scene if you are feeling down. Cheers. How was she an outsider when she was literally known to Salman Khan’s family? Are you the one who took part in character deelah hai? You look like sister of Katrina kaif Hi zareen, what’re some crazy things people do to get attention in the industry? Bollywood often stereotypes, the way you were presented in Veer movie and then you break the stereotype by signing Hate Story 3. While we like you in both the films.... How hard would it be to you for saying yes to Hate Story 3? loved your film with karan kundra , and ur song sun le zara was beautiful indeed Always felt you have a lot of potential. Hope to see you in some individual projects soon. Good luck Zareen. ***Hello!*** u/zareenkhanofficial Hello zareen ma'am, How do you manage stress be it work or life? Also are u a chai person or coffee? Your fav actors (pan indian) That's not nepotism, that's cronyism. It's prevalent everywhere. Even the precious Nolan. Why is answering random redittors important to you? How was your experience working in Punjabi movies? Hi Zareen! Any unwanted gossip that you've been associated with, on which you've laughed out the loudest Hey, Do you think nepotism is making it hard for new talents to set foot in Bollywood? Were you always interested in acting? Does it come naturally to you, or did you take training? Do you think someone can become good at acting just by training? What are your top 5 favourite movies? What kind of movies you like to watch and what kind of movies you like to act in? I feel that you bear resemblance to Elnaaz Norouzi too and she's doing good in foreign films. So how about Hollywood! Also wouldn't it make a really confusing movie if all of you star in a movie that includes Mandana Karimi! 🤷 Who are you? Not mean to sounding rude but i am literally hearing your name for the first time. What is your favourite character in films? I love my mom's cooked food the best more than any restaurants. But if I have to tell u options .... Less than rs100 - BUN MASKA & CHAI , SAMOSA , MAGGI (esp. in the mountains) Around 5000 - Don't have such an expensive taste .... I'm a simple person with simple but delicious taste buds 😂 Do you remember coming to SRCC, Delhi University in the early 2010s for a fashion show? I was one of the organizers for that event Do you select movies because you want to continue acting or do you select movies because you genuinely like the script or the story ? What would you have been if not an actor? Can you imagine yourself doing anything other than acting? Maybe within the industry or something completely different? i remeber you were pretty popular. Just curious, where did you go? Why did you stop? What happened? Please suggest some skin care tips from Bollywood industry, especially any medicated products or supplements common in beauty industry? Do you watch Anime? I know it's a weird question!! Why did u leave the industry? How's your current life going ? Lodu bada aaya I don't have time. Lame ass troll. How do you go about finding new projects? What did you liked about bollywood that you joined it? Fuck off. Not everyone cares for \"celebrities\" How has life changed after being in movies? How has the industry changed over the years throughout your journey working as an actress ? Do you think ageism will remain a factor for actresses unlike their counterpart in the industry in future? Hello ma'am, I am a big fan of yours and seen your movies plenty times but I was thinking that you have so many connections in bollywood still you aren't able to get good movies so what's the reason Yeah so a 180. AWWW 😊 Thank you for your love ... I know this might sound crazy esp. bcoz I'm an actress, but I don't really know to do my make up .... what I showed in the video , is what I've learnt in all these years 😂 I don't really have one particular shade that's my fav ... I always mix 2-3 shades. But I use this liquid lipstick from MISS CLAIRE in peach pink quite often. But here you are, asking a \"celebrity\" a question. Replying to comments as soon as they hit your phone. And your taste in wrestlers is trash. Sad lame ass troll. Were you always wanted to be in film industry or something else? Zareen - you are absolutely stunning! My question - do you feel like you didn’t get the roles that you would have if you were related to someone in the industry ? Are there a lot of roles that you didn’t get an opportunity to work on? Since it is month of Muharram... What do you think about the sacrifices of the Husayn , Hassan and Ali? Even from an non-religious political perspective, I find this moment of early muslim history to be very sadful.... Hey! I have no questions. Was just reading your responses on this thread. Rooting for you! 🎉✨❤️ All the best, Zareen! Hi! Hope you are well. What is your opinion on the need for \"intimacy directors\" on the sets? Which are your favourite anime shows? If you watch any... Do you plan do any OTT projects or any projects outside of India? Where do you see yourself in 5 years? You plan on being in Bollywood Or want to take part in southern film industry? Do you find Housefull as awful as the rest of us do? I can't believe you actually replied💗💗💗💗💗💗💗 Haha it's okay, we all learn and grow. I love Miss Claire lipsticks too❤️ mixing lipsticks is top tier✨️You should try Sephora Cream Lip Stains, they are my favourite, also they have so many beautiful shades and really comfortable and long lasting. 😆 What would be your top three fitness based advice ? Thanks. I wanted to be a lot of things but an actress .... But look at the irony ! 😂 Do you think the opportunities for women have gotten better in Bollywood over the years? What do you think can change in the industry? What sort of movies interest you to explore currently? Why are you not doing any movies these days ? Hi, Zareen. Hope you are doing good. How's Savlon Bhoi these days? How often do you lurk on reddit. I m certain there are only a few celebrities who even know about reddit. Mam what brought you to the reddit ? Surely enough you are famous on every other platform . I love your movie veer ; you played the role phenomenally .(●'◡'●) Hi Zareen, I have been following your acting career since your debut, saw you in some punjabi movies as well. Can you tell me a negative point you had to go through there? and whats guilty.pleasesure in general? Do you play games , take a walk or something different? Hi Zareen, is your character dhila or tight? NO ... you are mistaken .... I don't really have a lot of connections in the industry and I also don't really know how to do small talks . Heyy!! How’s your work experience with daisy shah? Why don't you work in South Indian movies? Gyan galat nahi diya gaya hai You never fail to impress, that all i wish to say, impress with your beauty, talent and fitness. What do you think about bollywood underutilising you? Have you ever come face to face with katrina? If yes How was the interaction? Casting couch is real right ? Oh I see thank you for clarifying my doubt hope you stay safe and good I thought Salman Khan was your biggest connection The dynamics have definitely changed over the years ! I feel with OTT coming in , there is no more ageism or any other 'ism' 😄 Thanks for answering >a pet tiger. Mike Tyson approves 👍 You were my childhood crush YEAH.. Lol it's Ama toh reply kyu nahi degi 🤦‍♂️ Did you watch Oppenheimer, if so what are your thoughts on the movie? And would you ever be willing be to act in a Hollywood film? hi zareen hope you see this comment your first film was with salman khan despite being an outsider, how difficult or easy it was for you to land into such a role ??? have you seen any type of change in the audience taste in last 12-13 years you have been in this industry ??? Hi have you ever felt paparazzi’s dark side ? Who is the actor with whom you want to become good friends in future and who is the actor you don’t ever wanna see again? Recently got a flight simulator and can totally understand the flying dream! Now a pet tiger otoh... Count me out sister. Am I answering this or AI ? 🤔 What's wrong in it though? If you take it positively you learn something new and in a way upgrade yourself. Hi zareen, thank you for this ama. We don't see you much on the screen, do you go for auditions and screen tests even after being a known face like how they do in the west? Or do you look to pick out the best from what's coming towards you? Sun lo. If suppose, this is your last day on this earth toh what will be your biggest regret? P.S:- Gautam bhai ke joote kaise chori hone dediye aapne.XD. I wish you all the happiness ahead. what was ur percentage/CGPA in class 10th and 12th ? Downvote kyun kr rhe yaar usme. Aisa jaruri thodi hai sabko reply degi. Mujhe lga my question will be lost in the sea of so many questions. Itna rude kyun ho rhe, I was so happy she replied 😊 you really didn't need to ruin this 😔 Someone actually did post an AI generated images of her on my sub. Looks a bit like her. I don't know... what do you think Zareen? [https://www.reddit.com/r/IndianArtAI/comments/159aby1/a\\_bollywood\\_actress\\_imagined\\_by\\_ai\\_i\\_think\\_she/](https://www.reddit.com/r/IndianArtAI/comments/159aby1/a_bollywood_actress_imagined_by_ai_i_think_she/) Hey Zareen, does the mafia (Mr.D) still controls Bollywood like the 1990's?? And STILL you are here... Not meaning to sound rude 😜 How does it feels to be popular and known? Specially when it was never planned or aspired? Bollywood has a serious nepotism issue as well, the two issues can coexist at once &#x200B; YES !!! Just recently I came across a video claiming that I've been murdered 🤣 Whats your perception of Life in general ? Hi Zareen, If I may ask, how real is the ignorance from the Main stream personalities in the Bollywood Fraternity true...?? For the newcomers. Your question could have been phrased so much better. Even after she replied to it, the least you could do was not be an absolute asshat about it. How deprived of attention and delusional are you that this is how you behave on an AMA? What a pathetic person. Where is your hometown and who introduced you to the industry Hi ...when can we see you back in a glam avatar...and on ott.. i loved the india tour series with jeep... Will we ever get to see you in a character like one in HATE STORY 3?. Among all this character is my fav one. Hey Zareen, I am quite curious how would a normal day look like for someone in entertainment industry?? Also, how do you spice up normal days ?? Maybe don't engage with celeb worshiping subs/posts then. My god the irony Any particular cuisine you crave for which you are ready to sort of budge from your fitness schedule? Ma'am, What kind of man is your man of dreams . 😊 How many of these questions are asked by your pr team ? What do you think about the Bollywood industry now? Is there a change from when you started to now? Where do you think Bollywood is heading towards? Maybe she isn't into Hollywood? Lol celeb worship karte raho didi What's the most challenging thing you've had to overcome in your career? Do you mean literally?🤔 Hi Zareen What are 3 things in life that scare you the most ? Could be anything from animals/people/experiences ! What is your favorite role you've played so far? Why? I am pretty sure its not just the ass that is being licked Hi zareen, who is your best friend Tumko kya problem hai dadaji? I like her. She is very simple and down to earth as I have been noticing her since a long time. Tumhari kyun jal rahi. Dum hai toh khud celebrity bano. Imma ask you the real questions. What did you think happened to Jiah Khan and Sushant Singh? I personally think Bollywood is dying due to lack of originality and nepotism. The rise of movies from the south does help either. Have you ever done modelling?? If yes, then is it really glamorous as it looks from outside or is it something else ?? How is OTT changing Bollywood? What’s your opinion about OTTs in general? Is bhai as arrogant and obnoxious as people say he is ? Very ! bcoz I never in my life thought I'd do something like this ... but there was a time in life when there wasn't any work coming in and I had to take care of my family .... so I did the film. I have no regrets now .... bcoz when I see what's happening in films and OTT now ... it is much more . This was the wrong sub Zarine. You should have done an ama on r/Bollywood and r/Bollyblindsandgossip Your PR people 😂 What is your hobby? > A** licker Literally? Hii zareen jii I saw your film 1921.I want to ask you if you ever experienced paranormal activity in your life i read that zaheer khan at first lol Tum banjao itna pasand hai celeberity banane wannabe insta influencer 🤡 hi zareen! what are some of your favourite movies? Has reddit finally gone mainstream in India? I don't even want to engage in any further conversation as you are clearly a happiness sucking cheap vampire. Go spread sadness. 😄😄 You are so beautiful, how do you maintain it? Also how do u deal with self doubt? Oof tricky response. Since, you know, casting couch is a thing. Have you watched jojo’s bizzare adventures? Hi Zareen, I am curious, what did you want to become when you were a kid? Pragmatic baat bolne se I am spreading sadness lol get out of your dream world Hey Who is tour favorite actor in bollywood? Hi Zareen, first of all, you are one of the most beautiful people I have ever seen on screen. I have yet to see you off screen. I love you in comedy roles. Hope you do more comedy films. **My question is :** Have you ever faced a situation where you almost good a good movie but then at the end some other actress was cast because of nepotism and/or because she had more Bollywood connections? If yes, which movie was it? Hy Im always late fckkkkkkkkkkkkk Well that’s impossible for me😝 Hi Zareen Will we see you in OTT's ? Hey. Was reading through your replies and I never really expected you to be so insightful . Which intrigues me to hear your thoughts on the current situation of Bollywood in terms of box office collections. We’re witnessing a rampant increase in nationwide collections for Hollywood and even South Indian movies while Bollywood movies are still a hit or miss. Where do you think all of this stems from and will we see a possible change in these trends soon? Hey Zareen! How do you feel about the communalism happening in India? Do you feel Bollywood, as a channel reaching to quite remote parts of India, should have a responsibility to educate or instill a feeling that humanity is what will take us forward both economically and societally? Is it possible for like minded artists in bollywood to strive towards this? Hello zareen i am mirza from Pakistan i have question regarding your movies which movie shoot you facing a prblm and accident and you feel sad Hello ma'am \"Reports of my death have been greatly exaggerated\" You guys know na, ke PR guys are answering the questions and not actually Zareen. Tu meri dost hai... I don't understand this obsession even my friends have to eat the same stuff in mountains on the way maybe i am odd one out Well idk if I like how civilised this comment section is, I guess people are lot more strict/anti fun on internet these days. But if this post was done during 2010 internet vibes then the comments would be interesting and not sounding so scripted. Anyway, didn’t know itne hot log bhi Reddit chalate hai😝 Lol Do you know anyone in bollywood who has never had a plastic surgery? How many have you had? You were fabulous and graceful in Veer. Made you my childhood crush 🥹. Are you still there? 😒 I want to know which is your favorite indoor plants at home? \\> look at the irony ! In your case, its Zairony 😂 😂 Is it bhoi's style to say \"i literally launched someone in bollywood who looks just like you\" What makes you happy? ❤️ if you had the chance to go back in time and choose a different career... would you still pick acting or try sumn else? r/Zareenkhan is this your official subReddit? His claims have been burnt to \"ash\". Let him be Itna sach bhi nahi bolna tha 😂 It's a good question, why did you get so much dislikes hows life Tu gavar aur bewakoof dono hai kya ? \\>Having a pet snake and a pet tiger. Aap Karan Johar aur Bhoi ko pet rakhna chah rahi ho.... GANDI BAAT!! Hi Zareen,the last heard about was about you walking out of a film because the producers were forcing you for more intimate scenes..I just want to say kudos to you..I felt proud of you that day and I’m getting a chance to say this to you jn person. Haan, tujhe kaise pata chala? Childhood crush man, used to wait for Surili Akhiyo waale and Salaam aaya to come on tv. I was like 7 Can you describe some funny incident while shooting ? Are you happy with the compensation you get in Bollywood ? Do you think there are other professions where people are getting paid way more. Do you have a suggestion for people who need to maintain a finance for running a home while pursuing acting ? When Did Nolan do it ? Thanks for doing this AMA Zareen. You answered a lot of questions and seem so kind and genuine. My question is, how has your interaction been with other Bollywood celebrities? Did you feel like they’re normal people you can enjoy hanging out with or did you feel a disconnect due to their privileged background in Bollywood families? Translation? Would you be interested in doing south Indian movies (Malayalam or Tamil)? People like you think by being an asshole to everyone, especially a girl, they are being badass. Lol, delusional much? Seems fake but okay Holy shit that is dark. Hi Zareen. Who is your favorite actor in Bollywood in terms of acting abilities? First time i read as Zaheer Khan lol I won't be able to do it correctly but the gist is, \"Do you slice your banana before eating or just deep throat it. /s\" Your presentation on Mahi ve remake was awesome! You remind me of my ex wife, lol. Ngl you were my childhood crush 🥰 So you read that story. Tu hi to meri dost hai 🎈🥰♥️ Hi zareen..........I want to see u again in ROMCOM. Is this possible? If you are really being honest Tell us about the casting couch and name some shady directors who want to take advantage of a woman in Bollywood. I am pretty sure you won’t answer this !!! Yea when?? HOW DO I SEND YOU GIFTS? HOW DO I CONTACT YOU? If all the marketing tactics and audience projection shenanigans were not an issue, what kind of movies would you like to try? Like Bollywood is known for a certain genre of movies which are a bit, I don't know how to put it, extra cheesy to appease the masses. But I guess actors themselves would've their own ambitions about, \"Oh I wish I could do an Indian version of Incetion (or Barbie based on the taste, lol).\" Do you have any of these Khayali Pulao like most of us do? Us bhai us \"Nothing ever goes as planned in this accursed world.\" My Cocaine is your answer. Try saying that in a Cockney accent Damn! Reddit is getting mainstream. Stop clout chasing here man, get out. Let reddit be. Go back to Insta or twitter or whatever. can i get ur phone number?🙃 need to do a quick proposal.. I just said she will reply to you because it's ama and you think I am trolling you for saying truth and boom out of nowhere using gender card lol get a grip 😂 I would love to see you playing something like Yashodhara from VEER again sometime when you need to mention movie names for recognition Loving your responses. not at all, it's a reference to the question Akshay Kumar asked Narendra Modi, he didn't mean it in a vulgar way Hi Zareen any updates on your upcoming projects and also do you intend to branch out into other spectrums of the industry apart from acting are you real zarin khan? You are literally trolling me because I post on Instagram (you said influencer in a mocking way) and also people like you have no other work than bringing people down. Consider thinking \"why I hate people so much who I have no business with\" Goodluck with your hate campaign. Hi zareen, you are one of the most beautiful heroines I have seen in Hindi cinema. Why don't you branch out to South and act in South Indian movies? Money maybe slightly less but they are very professional and movie shooting finishes in 6 months. I think it will add more value and help you strengthen your presence in the Indian film industry. BTW again you are very beautiful 😉 > I don't even want to engage in any further conversation as you are clearly a happiness sucking cheap vampire. Still you are engaging with me😂 and yourself trolling me and cussing me shows what a hypocrite you're, lol I have not even cussed or abused you anywhere but you are doing it and on top of it playing gender card, good for you.. Do you find it challenging to detach from a character after completing a project, particularly if it was emotionally demanding? Why you joining reddit? Worst people to collaborate with with Are you done? 😴 Because I clearly am. I am sorry you don't have anything substantial to do today🥴 Hi Zareen, hope you're doing great! I'm really loving your honest answers. Just curious but what profession would you have rather chosen if it were not to be an actress? Han gali do khud aur jab point out karu toh are you done boldo ok 😂🤡 Hello Zareen, I am struggling to lose weight and your journey is very inspiring. Any tips you have is appreciated. Also really admire that you did not play the stereotypical stick thin heroine in your movies. Many of us struggle with weight issues and it’s good to see normal women on screen. Nice work by you ma'am. I like your role very much in Veer and Housefull 2 and others movies also. How do you feel about the influence you got after entering the Bollywood vs before Bollywood. I'm sure life is changing but how are you coping up with the changes of not being as active as before? With writers strike happening in the US as of now, could you shed light on how the Indian film industry views on unionization and do they receive the benefits done by the All Indian Cine Workers Association? Are people even aware of their own rights in the industry? Surili akhiyon wale, be my friend lolz Hi Zareen, What are your thoughts on current tide of entertainment industry (especially wrt OTT) Hi zareen, Why did you become an actor ? Was it your childhood dream? My sincere apologies in that case I hate reddit becoming mainstream smh. Let's hope ban na ho jae ya koe kand na nikle idhar se What made u log into reddit? Is it true that Bollywood only favors giving jobs to only light-skinned indians or indians that are 5'9 and above for both males and females alike? Any chance we can see you doing de-glam roles? Hello Zareen...This is all I wanted to say. Have a nice day. > esp. if you aren't an A** licker ! Damn ! You know, funny enough, Hollywood is the only industry that doesn't outsource it's jobs when hiring actors in places like India and china and stuff. They only hire those that are mostly within the States already, how ironic is that lol. How are you aging backwards? Hi zareen, hope you are doing well. There are ups and downs in everyone’s life, what do you do to keep yourself motivated and get through the bad times life throws at us? I just love your work; I adore your motivation and I so wish you get more to prove your potential; Looking forward to seeing you more.. Best Wishes, Tons of Love.. Rock on beautiful!! How did you get such huge boobs??Is there any chance that I may get to see and touch them?? What are your views on Salman khan? Hey. Zareen I really love a girl. How should I tell her. Any advice Hi Zareen ! How long did you have to practice for Lagdi Lahore Di aa dance with Melvin Louis ? Amazing moves !! if given an option which role of forgotten woman fighters? which one you would prefer to play and why? 1. Razia Sultana 2. Begum Hazrat Mahal 3. Bi Amma 4. Asghari Begum Thank you so muchhhh for the reply. I strive for the same healthy mindset 🤍💫 360 is actually right …the circle meets itself at the other end,.. its the journey to meet the new her is what she meant by 360 what is your opinion on nepotism in bollywood? Man… you just opened my eyes.. maybe Akshay was really asking that. 🌟What would be your take on how to obtain a successful acting career? 🌟Also is it challenging to get roles in movies? 🌟How to recover from public mistakes such as unknowingly put up political statement or something related to public being furious to you for ur statements. 🌟Does Instagram create opportunity for acting career? Did you watch Oppenheimer? Why does bollywood not make historical films which are actually accurate and cared for. Hi Zareen, which outsider/non-star kids do you admire?(Name a few). Hi Zareen. How r u??. And what are you up to nowadays?? I asked a question I don't know whether you seen or not,here i am asking again. Have you thought that hate story 2 will give a big push or did you know the movie state while it was in shooting stage? Few actors/actress openly confessed when they know they are acting in a bad/flop movie. Is there any movie you thought while shooting it is going flop? No hard feelings here, but you didn't get movies because you can't act! Period! How does bhai drive car would have been a better question Why all 3 movies socks? Pets or zoo ? Hey zareen, you haven't worked in movies for some time.. any particular reason for that? Hey Zareen, I have no questions to ask, but I love your acting and like you a lot. Stay the same, more love and joy to you HI ZAREEN , I AM VIJAY . I ADMIRE YOUR WORK A LOT , I FIRST SAW YOU IN YOUR MOVIE VEER AND IMMEDIATELY FELL FOR YOUR LOOKS AND THEN I LOOKED FORWARD ON MORE FILMS OF YOURS . ACTUALLY I AM FROM IIT BOMBAY AND HERE I HAVE MORE PROBABILITY OF MEETING A CELEBRITY LIKE LAST TIME I SAW VICKY KAUSHAL IN PAWAI. IT'S MY DREAM TO MEET WITH YOU . HOW CAN I MEET YOU? THAT'S ALL I WANTED TO SAY It depends on the location. You really don't want to experiment with your stomach when you are hiking up. If that's not an issue, eat whatever you want. Waiting for you to come back with a bang! So are you going to make a comeback anytime soon?? How to maintain consistency with discipline 😀 e.g.it may be diet, healthy habits or any habits which helps us to grow....how you maintained it.... Well I fear my stomach always but i cannot understand people craving for this stuff just on mountains so that's why I thought Reddit moment 🤓🤓 Tigers and Snakes are not pets. Stick to domesticated animals for that. Keep wildlife in the little remaining wild areas. However, if you are interested still, you can adopt a tiger or snake in some Indian zoo or fund some animal rescue center or orphanage. They may let you tend the animals during their routine treatments etc. Sorry to sound pretentious. But please. What is your take on nepotism in the Bollywood industry ? Doesn't it make you angry to see that a talented and beautiful actress like yourself not get as much opportunities as other star kids ? How do you address body shaming and other stuff that goes around the media? Hi zareen ji loved ur all honest replies. I would like to suggest u that suppose if ur not getting roles which u want then You can switch to TV industry to showcase ur talent. One of the best thing I like about u is that to get roles in film You didn't compromise with ur values❤👏 Appreciate your honest replies. To my knowledge only other B-town celebrity that had proper and fun AMA here was [Imran Khan some 9 years back](https://np.reddit.com/r/india/comments/236bpy/hi_reddit_longtime_lurker_first_time_poster_imran/). [Meanwhile Priyanka Chopra couldn't answer a single question](https://np.reddit.com/r/IAmA/comments/29nr3g/hello_im_priyanka_chopra_im_an_actress_and/). More power to you, stay strong stay humble 😊 Mai karun toh saala character dheela hai!! Common people have listened many bad things about bollywood these days like casting couch and stuff. Is that kinda thing like normal or it is just a fud among people? Hi Zareen , I really like your style and way of acting with so much confidence. Btw i have a pharma company and would like to work with you for ad shoots. So what’s the good place to discuss for that stuff? Hii zareen ! Can you describe a hobby or interest that you have outside of your work and public persona? I absolutely love your song surili akhiyon wale . When it came out ,i was little girl. I used to think u were an indian disney princess 💗 🌸 💗 Favourite Cricketer?? Whats your fav movie of all time and why ? Hello.. a fan here.. What’s your goto cheat meal? Almost a decade back we met in Kuala Lumpur, I didn’t had good phone back then. But thank you for your time, you were very kind and nice. No one is nalla like you nihil Hi Zareen, what do you feel about guys masturbating to you Do you get envious? If so, how do you overcome it? I am at a point of this journey where it is difficult for me to overcome envy nature of mine. Its so tough. Lmao the comments under priyanka’s ama are brutal Hii Zareen. Do you speak Marathi ? Hi what's your next project Wow! You're truly an inspiring actress, Zareen. I've watched many of your films, and truly enjoy the themes and stories you bring to the screen. Hi Zareen, I have always wanted to confirm one thing. In 2010 when I was in school, one of the school kid (i forgot his name) claimed to be your cousin. He was 4th grader that year and was from Rajasthan. The school was Dawn Academy in Panchgani. Can you confirm this for me please? Do you feel weird when you go in public and to your surprise nobody recognizes you? Hi, which musician are you listening to the most these days? What's going on? we can now communite with celebrities? That's crazy Hi Zareen, Any question or comment that makes you feel ashamed Hehe good one zareen 😂 Hi Zareen! Big fan of your work! How has your experience working in the industry been and what part of the craft do you feel like you need to work on the most, as an actor? How was your actual experience working with salman khan? Did you ever go driving with bhoi? Damn! Thanks. Have you ever faced sexual harassment from Bollywood people? You got the grace , deserve a slb movie As far as i know these things also happened earlier Ma'am do you know pashtun or pashto language how you are connected to it ? Influencerr ?? She was always an actor Do actors sleep around with each other? My Cocaine is an incredible actor, his characters always have depth to them. My Weed on the other hand... We can definitely cut some angles first tho What is your name, and what movies have you starred in? Billo Bagge Billeyan Da Ki Karegi? Bagge Bagge Billeyan Da Ki Karegi? Hey Zareen, i have no questions, just wanted to say that cant wait for your next movie. Its been 2 years since hum bhi akele tum bhi akele release and that was a really nice movie, excited for the upcoming stuff. Do you think you have been typecasted in Bollywood and how keen are directors/producers in general to give someone a role different from the typecast in today's landscape? You remind me of Lana Del Rey a bit. Sending likes of love for your future projects! 🙌 Session khtm ho gya kya? You mean two right angles?? How do you respond to creeps and perverts on social media? Has anyone ever told you you look a lot like Alexandra Dadario? Very hard if your name is not Alia. I eat at cheap places, so Chai, samosa, maggi etc are all < ₹50 stuff for me. If someone asked me about around ₹100, I'd be more likely to say Pav Bhaji, Chole Bhature etc. I'm probably never gonna buy any single dish for ₹5000 though, so same answer as Zareen. Ghapa ghap tak tha uska saath bas Hi zareen how are you so much hot and beautiful are you human ??? Tell me about the things or questions about life or your career that make you anxious...and also what you do when you feel quite low (something that cheers u up)..?? She’s not from a film family though Hi Zareen, I just wanted to say hi. Hi Zareen, are you a door? Did Salman fuck you ? Haha I was wondering why no one is asking her the obvious question Yes but she would not have answered that question 💀 Probably because it's default to arrange visas. When the movies are shot in India, they will hire Indian actors. Eg: Extraction Cillian Murphy has been working with Christopher Nolan since batman begins and has been in almost all of his films ever since do you pray namaz? since women are ordered to cover themselves, how do u feel having your uncovered body displayed to so many people? Are you not afraid of jahannam? Hey Zareen, any advice for a 20 year old. Also lots and lots of love to you. Just look how rude people were and how they downvoted her every comment. No wonder celebs stayed away You were In Ready ? Having a big cat as a pet is illegal and saying this as a huge cat lover. Ain’t matter. If a superstar knows you well and giving you a break then that does count in nepo. Hey zareen i have seen your jatt james bond in my childhood its my face character for you. How was your experience in Punjabi industry Omg how do you have links Are you nude now? One min silence to all those who thought it's actually her lol Nomies🤡 bhi reddit pe ane lage, ab reddit chhordna hoga But she wasn't nearly as successful as katrina (no hate to her ofc) so bhai failed at it, didn't he. It wasn't just her looks that made katrina famous. She had charisma and an it factor. Also she is a really good dancer. So salmonella's whole \"I'm so powerful that i can launch another woman who looks like you because you're THAT replaceable\" schtick failed miserably. If you are coming to lucknow I would love to help you explore the city Hi Zareen, what's the thing that you love to do in your free time? Hi zareen, I have seen u in person during a Aldo major brand retail opening at phoenix market city and was in awe with ur skin. Just a question ? Are u really answering all queries urself ? If yes how do u address all What do you hate the most about Bollywood or noticed that \"this is happening and if it wasn't done, the quality of films could've been at a different level\"? S If you had to choose one Bollywood movie for an American who has no idea, where would you recommend I start? i.e. not overly stylized, good subtitles/dubbing, relatable story, etc Hi Zareen Khan! So far I haven't seen any big celebrities create an official account on reddit you did it!!. Kudos to you for also answering all the questions posted here. I'm happy to see this side of yours. Also who is your favorite bollywood celebrity (Male/Female)? Dave Shutton -- Springfield Daily Shopper. Who are you? Where are you going? Time to claim the term insurance in keep the money in the safe Ever heard of Rajpal Yadav... Any amazing memory with Salman Bhai, ma'am? Why pet snakes and tigers? Figuratively speaking....i hope... will the pet snake be named nagraaj Who is answering these questions? I don't think you are I hope this becomes a trend, Indian celebrities doing AMAs I didn't know zareen Khan uses reddit 😮 Hi Zareen, You debuted and started off in 2010 if my memory serves, back when mainstream cinema and probably Television were the the only viable options to be a part of the show business. Now with the advent of OTT, there is a plethora of opportunities and a level playing to include talents across all levels. What would be your dream project given the plethora of opportunities we have today to make your mark as an artist with your audience? How easy or difficult is it to stay relevant in this age of 24*7 internet connectivity? How is Bhai in real life? Personally gaming come in waves I may go months without but other time I’ll find one so good I just sink my life into it, don’t feel bad for loving something as long as it doesn’t effect your responsibilities Tell me your darkest phase of ur journey you fased Do gangs influence casting/other decision making in Bollywood? Haan dikha diya ki tu genius hai. Khush? Chut*iya saala Imagine the synchronicity! I was just thinking about you today and what have you been upto! Good to see you are doing alright. How much would could a wouldchuck chuck if a wouldchuck could chuck would? Good point. I didn't even think this through tbh. My favorite. But the shorter they are, I get the sense that these ppl get perm type casted unfortunately. Idk. for a moment I thought it was the cricket wala zaheer khan and got excited 😭 Hii zareen, How did you started your career and when you thought about acting. Since you are not from filmy background then what kind of problem you faced in your early life before the industry One of the beautiful actresses in the world Indeed!! ❤️ Does Salman bhai choreograph his songs on his own? Hi zareen . Keep up the good work Itni gandi movies me role karke apko kaisa laga Hi Zareen Are you related to Zarine, Sanjay khan s wife? Arey gyani chodu Hey Zareen, just wanted to say that I have the biggest crush on you, ever since I saw you as a kid in Veer. Since then I've been madly in love with you, and I loved your performance in housefull 2. You'll always be my one and only favourite actress!♥️♥️♥️ Bhoi of bollywood After you became a star, how difficult was it you to make friends or personal connections? How were you able to see through individuals who tried to part of your life for the sole reason that you were a star and not you as an individual? I think PR Teams should leave Reddit alone and not try to turn it into Instagram which it never will. Lol. Haath Jodta Hu You have Best Lips in Industry don't screw their Natural Beauty like others have . It was identified as a PR activity and treated as such by the audience (fellow redditors) last time i saw you was in Jspm pune, this was before covid, you looked stunning. even cbum has strechmarks, those are medals of hard work. What were your qualifications like in study, if you don't mind telling me I think you have not fully utilised or explored the industry, you should have been working in more movies or OTT series. Are you very selective or is it because of lack of opportunities ? Such straightforward and honest replies 🤣 Beerbiceps asli I'd se aao. A fellow forrest gumper.. 😛 I have fapped to you many times. I hope you didn't mind. How do you think she got the roles Took it like a pro Hey zareen as you're a Muslim if it's not a personal one can you tell me are you a practicing muslim? If it's personal you can choose to skip . Apart from the I am girl from Pakistan I really love your bold looks and pretty smile love from Pakistan Have you ever thought working in Pakistan?? Are you still obsessed with shahid afridi? Do you listen to Pakistani music and do you listen to these tendy punjabi music of sidhu ap and shubh How director got fund for movies? Can we become a assistant to main director in short year (5 year) Hello, you look stunning. Have you ever considered trying your luck in Tollywood? When would we see you again on the big screen? We dying to see you again. Ever wondered if you were in Hollywood?? Man that Imran Khan AMA looks so fun! Dude seems like a genuinely nice guy to be around. Real id se aao Ranveer Allahabadia Do everybody do drugs in Bollywood ? Is it necessary to reach that stage ? Have you been offered? Do these top actors and actresses in the industry also do it ? Without mentioning the name can you please tell us about it Hi maam, in one of the reply you said you were like tom boy, Im kinda same but some times I do want to look good , so what should be the dress style and simple makeup thing which won't bother my comfort much. 🤓 and still make me look pretty I used to think that you are a sibling to Katrina Kaif for a really long time. It would be great if we could hear about your journey in the film industry. I mean she is she at the end right. Just she took whole new turn is not like she changed or something. So yeah I guess 360 is pretty valid r/Kerala users, you guys pressing X on this given what happened last month? I have question. If you had an superpower what would it be? Regards. How did you end up working in so many Tamil movies as well? Just wanna ask is the casting coach real or fake. Hello Zareen Khan, I have been a big fan of yours since your movie \"Veer.\" I fell head over heels for you back then and have loved you ever since. However, I noticed that your last film was \"Housefull 2\" in 2017, and I wonder why you left Bollywood. I sincerely hope that you consider making a comeback, especially through OTT platforms, as they are the next big thing in the entertainment industry. With OTT, you can collaborate with pioneers like TVF, TSP, SonyLiv, Netflix, etc., and reach a wider audience. Your fans, including myself, would be thrilled to see you back on the screen. Please do let us know the reason behind your departure from Bollywood. We miss you and love you, Zareen, and eagerly await your return. damn rarely have I seen any actor's account on reddit Will you marry with your boy friend?? Could I message me privately as the question I have might be embarrassing for the subreddit to read? Yeah it was. But all the comments were too brutal 😂. No wonder rest all stayed away after that Awesome!! Nothing to ask , just stay safe and enjoy ... Remember this people respect and give opportunities based on your character and how well you smile ... so keep up your character dont lose it thinking its how people get together .... have fun in moral way ... all the best top 5 most underrated Bollywood movies acc to you If not an actress or be in the film industry what other career path would you have pursued and why ? I love him! My qus was deleted why I don't know? Will you make a superhero movie? I loved 1921, and your performance in it!! :) Hi Zareen, is the casting couch literally practiced in Bollywood?? Have u ever faced it ?? Hey zareen do you like to be called sexy or it is offensive for you by any fan Hi Zareen, which movie and cast have enjoyed working with the most? Thank you, Hi Zareen are you single? Also you available to do a show in Dallas? Hi Zareen, I am big fan of yours and i follow you on Instagram and Reddit I saw Your All Movies i tell you true from my thinking you are more beautiful than Katrina Hi Miss Zareen . I just randomly watched Hate Story 3 during free time and I must say it is an amazing film. Great story and great cast too especially karan singh grover and your performance. You looked really beautiful and i loved your outfits especially that pink flower kind of outfit which you wore during the scene where you congratulated Sharman Joshi and his brother. The songs were my favourite part too especially wajah tum ho song. My rating for the film - ( 4 / 5 ). Worth rewatching I would just like to ask did you enjoy watching the film hate story 3 and how much would you rate it? would you say that it is one of the best films in your career (noting that you did hum bhi akele tum bhi akele which was so good). Omg and i hope you are making a comeback Hi zarine , let me be true to you, u ve been the most desirable girl for me and i like you as a human too, I'm just here to tell that there are a lot of men like me who would like to see more of you. May be in movies/ series/ channels. I would always think of someone makes \" dark desire \" in Hindi none other than you would be a match. U r our Mattie perroni and people who disrespect you\" let them go to docks\". All the best for your journey ahead ❤️🙏 @ohsoperfectproposal @katflorence Will you marry me are there any destinations in India that you want to travel? How do you see India from your lens. Hi, zareen how are you? Gaand dede raand Hi Zareen , what about your forthcoming movies or series? Just curious Can we know about it now?"
}