{
    "id": "174j97c",
    "title": "Staying Alert is the only option to be safe from Scammers",
    "url": "https://www.reddit.com/r/india/comments/174j97c/staying_alert_is_the_only_option_to_be_safe_from/",
    "selftext": "A [recent news](https://www.indiatoday.in/cities/chennai/story/jamtaara-style-attack-dmk-mp-dayanidhi-maran-loses-rs-99999-cyber-fraud-2446972-2023-10-10) about spouse of a Member of Parliament who had been a minister of Information Technology was themselves defrauded by phoney scamsters pretending to be from bank. However the most surprising thing is that how were the funds debited without the One Time Passcode being shared to the scammers.\n\nWith increasing bank frauds in most novel and sophisticated ways I guess we citizens need to exercise more vigilance towards our bank accounts and other financial handlings.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696938741.0,
    "convurl": "https://external-preview.redd.it/sNZdIdy1ORrl2QVuCCUBK464V3l7e21JI4DPpPNsk80.jpg?auto=webp&s=41e5e589adf851fb7fd54e6bea6b1508325a0227",
    "comments": [],
    "cleaned_text": "staying alert option safe scammers recent newshttpswwwindiatodayincitieschennaistoryjamtaarastyleattackdmkmpdayanidhimaranlosesrscyberfraud spouse member parliament minister information technology defrauded phoney scamsters pretending bank however surprising thing funds debited without one time passcode shared scammers increasing bank frauds novel sophisticated ways guess citizens need exercise vigilance towards bank accounts financial handlings ",
    "cleaned_title": "staying alert option safe scammers",
    "cleaned_selftext": "recent newshttpswwwindiatodayincitieschennaistoryjamtaarastyleattackdmkmpdayanidhimaranlosesrscyberfraud spouse member parliament minister information technology defrauded phoney scamsters pretending bank however surprising thing funds debited without one time passcode shared scammers increasing bank frauds novel sophisticated ways guess citizens need exercise vigilance towards bank accounts financial handlings",
    "cleaned_comments": "",
    "light_cleaned_title": "Staying Alert is the only option to be safe from Scammers",
    "light_cleaned_selftext": "A [recent news](https://www.indiatoday.in/cities/chennai/story/jamtaara-style-attack-dmk-mp-dayanidhi-maran-loses-rs-99999-cyber-fraud-2446972-2023-10-10) about spouse of a Member of Parliament who had been a minister of Information Technology was themselves defrauded by phoney scamsters pretending to be from bank. However the most surprising thing is that how were the funds debited without the One Time Passcode being shared to the scammers. With increasing bank frauds in most novel and sophisticated ways I guess we citizens need to exercise more vigilance towards our bank accounts and other financial handlings.",
    "light_cleaned_comments": ""
}