{
    "id": "17932aj",
    "title": "Abortion case: Supreme Court rejects woman's plea, says no termination after 26 weeks of pregnancy",
    "url": "https://www.cnbctv18.com/india/supreme-court-rejects-womans-plea-for-termination-of-over-26-week-pregnancy-18064311.htm",
    "selftext": "The kid's going to grow up knowing their mother expressed her concerns about being able to raise them.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1697452926.0,
    "convurl": "https://external-preview.redd.it/DvueOegdjTrb00d3apz5h6R517GYAJEJQX5x-jOSDJk.jpg?auto=webp&s=54301476d5c7312cf4405ee9d649ccee3ac06350",
    "comments": [
        "I’m confused by this story. \n\nNo information on why the woman didn’t/ couldn’t terminate earlier, and no real detail on why she’s seeking termination at all.",
        "There are lots of news items on this in the last 10 days. The gist is\n\n. Accidental pregnancy\n\n. Already has 2 children\n\n. No resources to care for the 3rd child",
        "That answers one question but why wait until nearly 27 weeks to terminate?"
    ],
    "cleaned_text": "abortion case supreme court rejects womans plea says termination weeks pregnancy kids going grow knowing mother expressed concerns able raise ",
    "cleaned_title": "abortion case supreme court rejects womans plea says termination weeks pregnancy",
    "cleaned_selftext": "kids going grow knowing mother expressed concerns able raise",
    "cleaned_comments": "im confused story information woman didnt couldnt terminate earlier real detail shes seeking termination lots news items last days gist accidental pregnancy already children resources care rd child answers one question wait nearly weeks terminate",
    "light_cleaned_title": "Abortion case: Supreme Court rejects woman's plea, says no termination after 26 weeks of pregnancy",
    "light_cleaned_selftext": "The kid's going to grow up knowing their mother expressed her concerns about being able to raise them.",
    "light_cleaned_comments": "I’m confused by this story. No information on why the woman didn’t/ couldn’t terminate earlier, and no real detail on why she’s seeking termination at all. There are lots of news items on this in the last 10 days. The gist is . Accidental pregnancy . Already has 2 children . No resources to care for the 3rd child That answers one question but why wait until nearly 27 weeks to terminate?"
}