{
    "id": "1blpxkl",
    "title": "Aligarh Muslim University students protest, demand quashing of FIR over ‘Holi brawl’ | Lucknow News - The Indian Express",
    "url": "https://indianexpress.com/article/cities/lucknow/amu-students-protest-quashing-of-fir-holi-brawl-9229090/",
    "selftext": "Waah bhe wah. Aurangzeb ke style me jizya start karega to shivaji ke style me swarajya bhi start karna hoga ",
    "flair": "Crime",
    "score": 50,
    "num_comments": 3,
    "created_utc": 1711193075.0,
    "convurl": "https://external-preview.redd.it/vbNOFkN5cA1Q6q150-gig8i4OzzClr35U4JeaUa5bOE.jpg?auto=webp&s=867aa6de6d5698b0dbb97292a66014adf3fbd9cd",
    "comments": [
        "Mob lynching is good but not the POLICE FIR . They should have there name cut off from the university . Seriously whats inside there mind . I wanna know .",
        "seriously disappointed in the students.",
        "The Muslim students are right. If we are banning burqa and namaz in unis, then we should also ban holi and other religion celebrations. \n\nEither accommodate all or eliminate all.",
        "why tf ppl going to study in amu"
    ],
    "cleaned_text": "aligarh muslim university students protest demand quashing fir holi brawl lucknow news indian express waah bhe wah aurangzeb ke style jizya start karega shivaji ke style swarajya bhi start karna hoga ",
    "cleaned_title": "aligarh muslim university students protest demand quashing fir holi brawl lucknow news indian express",
    "cleaned_selftext": "waah bhe wah aurangzeb ke style jizya start karega shivaji ke style swarajya bhi start karna hoga",
    "cleaned_comments": "mob lynching good police fir name cut university seriously whats inside mind wan na know seriously disappointed students muslim students right banning burqa namaz unis also ban holi religion celebrations either accommodate eliminate tf ppl going study amu",
    "light_cleaned_title": "Aligarh Muslim University students protest, demand quashing of FIR over ‘Holi brawl’ | Lucknow News - The Indian Express",
    "light_cleaned_selftext": "Waah bhe wah. Aurangzeb ke style me jizya start karega to shivaji ke style me swarajya bhi start karna hoga",
    "light_cleaned_comments": "Mob lynching is good but not the POLICE FIR . They should have there name cut off from the university . Seriously whats inside there mind . I wanna know . seriously disappointed in the students. The Muslim students are right. If we are banning burqa and namaz in unis, then we should also ban holi and other religion celebrations. Either accommodate all or eliminate all. why tf ppl going to study in amu"
}