{
    "id": "1440gwu",
    "title": "Where can I buy authentic luxury watches online",
    "url": "https://www.reddit.com/r/india/comments/1440gwu/where_can_i_buy_authentic_luxury_watches_online/",
    "selftext": "I am thinking of buying a Tissot watch.\n\nI can find several websites for the watch but I am not sure about the authenticity of the sites.\n\nAfter looking at the previous posts here, people have mentioned [https://www.ethoswatches.com](https://www.ethoswatches.com/) as a reliable website.\n\nThis is the watch to be exact \\[[https://www.tissotwatches.com/en-in/t0639071605800.html](https://www.tissotwatches.com/en-in/t0639071605800.html)\\] the official website also has a link to buy from TATA cliq store. I wanted to know if anyone has any experience shopping from there or would suggest some other places to buy from.\n\nRegarding going to a physical store, I have a Helios store in my city but they only have a single piece which is up for display and has some scratches on it.",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 3,
    "created_utc": 1686202521.0,
    "convurl": "https://external-preview.redd.it/O3YxWRP642xAmR0EJAdrA-MVfVcW8EoiCtjZLizw6S0.jpg?auto=webp&v=enabled&s=530e388cc32168eb0f3bded47d3082a20ff1a54c",
    "comments": [
        "Ethos is as genuine as it gets, in fact it became a listed company on the stock exchange. \nWRT to Tata Cliq, probably it's a deal with Tata Cliq to link to their ecomm platform with the Swatch Group (Tissot is owned by them)",
        "Farfetch."
    ],
    "cleaned_text": "buy authentic luxury watches online thinking buying tissot watch find several websites watch sure authenticity sites looking previous posts people mentioned httpswwwethoswatchescomhttpswwwethoswatchescom reliable website watch exact httpswwwtissotwatchescomeninthtmlhttpswwwtissotwatchescomeninthtml official website also link buy tata cliq store wanted know anyone experience shopping would suggest places buy regarding going physical store helios store city single piece display scratches ",
    "cleaned_title": "buy authentic luxury watches online",
    "cleaned_selftext": "thinking buying tissot watch find several websites watch sure authenticity sites looking previous posts people mentioned httpswwwethoswatchescomhttpswwwethoswatchescom reliable website watch exact httpswwwtissotwatchescomeninthtmlhttpswwwtissotwatchescomeninthtml official website also link buy tata cliq store wanted know anyone experience shopping would suggest places buy regarding going physical store helios store city single piece display scratches",
    "cleaned_comments": "ethos genuine gets fact became listed company stock exchange wrt tata cliq probably deal tata cliq link ecomm platform swatch group tissot owned farfetch",
    "light_cleaned_title": "Where can I buy authentic luxury watches online",
    "light_cleaned_selftext": "I am thinking of buying a Tissot watch. I can find several websites for the watch but I am not sure about the authenticity of the sites. After looking at the previous posts here, people have mentioned [https://www.ethoswatches.com](https://www.ethoswatches.com/) as a reliable website. This is the watch to be exact \\[[https://www.tissotwatches.com/en-in/t0639071605800.html](https://www.tissotwatches.com/en-in/t0639071605800.html)\\] the official website also has a link to buy from TATA cliq store. I wanted to know if anyone has any experience shopping from there or would suggest some other places to buy from. Regarding going to a physical store, I have a Helios store in my city but they only have a single piece which is up for display and has some scratches on it.",
    "light_cleaned_comments": "Ethos is as genuine as it gets, in fact it became a listed company on the stock exchange. WRT to Tata Cliq, probably it's a deal with Tata Cliq to link to their ecomm platform with the Swatch Group (Tissot is owned by them) Farfetch."
}