{
    "id": "14sgzz0",
    "title": "Pune School Principal Assaulted by Mob Raising Hindutva Slogans",
    "url": "https://m.thewire.in/article/communalism/pune-school-principal-assaulted-by-mob-raising-hindutva-slogans",
    "selftext": "Few days back , it was reported that the principal was assaulted because he had installed CCTV in girls toilets and was then blackmailing the girls to convert to Christianity.\n\n\nWELL, THAT WAS A LIE.",
    "flair": "Crime",
    "score": 12,
    "num_comments": 3,
    "created_utc": 1688666793.0,
    "convurl": "https://external-preview.redd.it/mMslwMQX41MvOSJgBIaJZcRZAHrp1uT5Td8w9DmwYh8.jpg?auto=webp&s=b19c652c51a3ec6621effe552f8fd725c6d773a8",
    "comments": [
        "That much anyone with functioning braincells could have guessed. I honestly don't know what's the end goal here for such hardliners.",
        "Bloody cowards attacking an innocent man, when our wives and daughter are harassed where are the people"
    ],
    "cleaned_text": "pune school principal assaulted mob raising hindutva slogans days back reported principal assaulted installed cctv girls toilets blackmailing girls convert christianity well lie ",
    "cleaned_title": "pune school principal assaulted mob raising hindutva slogans",
    "cleaned_selftext": "days back reported principal assaulted installed cctv girls toilets blackmailing girls convert christianity well lie",
    "cleaned_comments": "much anyone functioning braincells could guessed honestly dont know whats end goal hardliners bloody cowards attacking innocent man wives daughter harassed people",
    "light_cleaned_title": "Pune School Principal Assaulted by Mob Raising Hindutva Slogans",
    "light_cleaned_selftext": "Few days back , it was reported that the principal was assaulted because he had installed CCTV in girls toilets and was then blackmailing the girls to convert to Christianity. WELL, THAT WAS A LIE.",
    "light_cleaned_comments": "That much anyone with functioning braincells could have guessed. I honestly don't know what's the end goal here for such hardliners. Bloody cowards attacking an innocent man, when our wives and daughter are harassed where are the people"
}