{
    "id": "pzlp4r",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/pzlp4r/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 33,
    "num_comments": 63,
    "created_utc": 1633138218,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Foundation on Apple TV. Great cinematography and acting. Need to see how the story pans out given that they are taking a lot of creative freedom as compared to the books. \n\nTed Lasso season 2 has been below average, especially after the great season 1.",
        "I don’t know if this counts since it is a short film but I watched battle at big rock, it was pretty cool",
        "Sex Education (On Netflix), 10/10 would recommend.",
        "Squid game.  Available on Netflix.  Very good one",
        "Foundation felt a bit underwhelming in terms of the story. Especially to people who've read the books.",
        "Mind fucked",
        "What a character development, acknowledged all kinds of issues. Great show.",
        "will rewatch Before the Flood (2016)\n\nIt's a great doc, and is more relevant now than ever.",
        "I have read 16 books in the expanded Foundation universe. Yes, the show takes a lot of creative liberties, but, TBH the books don't have enough (in terms of visual descriptions) for a translation to a TV show. \n\nYes, we would've loved a truer show, but we get what we can.",
        "Chehre on Prime. Don't fall for its category as a thriller. It isn't, feels too long and the actual story doesn't even begin untill the interval.",
        "Seinfeld is on Netflix... Started with season 1... hoping it is as good as I heard for so many years..",
        "It is. It doesn't feel a single day old (except for the tech of course lol). I randomly pick any episode every now and then and never get bored.",
        "Anyone watched the Premise by BJ Novak? It's so stupid, I love it",
        "Watched The Paper Tigers\n\nIt was awesome. Made me feel nostalgic for old kung fu movies.",
        "I saw Dog Day Afternoon. What a performance by Al Pacino.",
        "It’s my most rewatched show. Just yesterday night I was browsing Netflix and saw it’s banner, I watched three episodes.",
        "Yeah man the movie was awesome watched a year ago. Still remember, and also john cazale was good too as always.",
        "You wanna go to Algeria? No I want to go to Wyoming.",
        "After the first amazing episode, it honestly just felt like trite but with better sets. Love angles, lackluster dialogues. \n\nI hope it gets better. Haven't read the books, so don't know how good they are. Maybe I will.",
        "Watched Jaguar TV series. Decent one time watch.\n\nBased on the ratings, I watched The Card Counter. Was thoroughly disappointed. There was hardly any storyline.",
        "The many saints of Newark was such a massive disappointment. I can't believe that it's the same guy who made Sopranos.",
        "Over the last 2 weeks, [I've seen](https://letterboxd.com/_romcomzom_/films/diary/):\n\n**The Guilty (2018):**  Danish thriller filmed in one location (kinda similar to Locke in that vibe). 3/5. I could see the \"twist\" coming a ways off, but it's a reasonable time to spend watching a movie.\n\n**First Reformed (2017):**  I usually like Ethan Hawke movies, but this was just trash. 1/5.\n\n**Free Guy (2021):**  Good-enough popcorn flick. 3/5.\n\n**Forgetting Sarah Marshall (2008):**  Rewatch. One of my favourite films that I put on when I'm feeling down and need the motivation to get over myself. Another favourite in the same vein is Yes Man.  4/5.\n\n**Midnight Mass (2021):**  Mike Flannagan's new Netflix show. Binged it and had a good time. For someone who doesn't know him yet, pretty much binge everything he's made starting with The Haunting of Hill House on Netflix. 3/5.\n\n**High Fidelity (2000):**  Movie #2 in the John Cusack gets screamed at by Minne Driver multiverse. I liked this movie a lot. Gonna rewatch it again and write a much longer review. It's a story of a manchild who's too much into music, struggling with his relationship because he doesn't know himself yet and doesn't really want to, either. Hit a little too close to home in that regard. But some of the dialog. *chef's kiss*. Movie tries to do the \"go back and talk to exes\" schtick and it words but I think it was done better in something like Definitely Maybe.  3/5.\n\n**Yellow Cat (2020):**  Off-beat comedy from Kazakhstan that I watched as part of my [100 movies, 100 countries project](https://letterboxd.com/_romcomzom_/list/theflintquill-100-countries-100-movies/). It was alright. 3/5. \n\nAlso watched the latest episodes of Star Trek Lower Decks and Ted Lasso. Hyped for the final episode.",
        "love that show. especially the no-nonsense, financial ruthlessness of abed. he's just streets ahead in this one.",
        "Seinfeld is on my (and a lot of people's) hall-of-famer sitcom list; along with 30 Rock, Arrested Development, Community and (my guilty pleasure) New Girl.",
        "I didn't really enjoy Season 3 as much as I did 1 and 2. (1 &gt; 2 &gt; 3). I wanted to see more Otis and Maeve drama, but maybe that'll happen in S04, I guess.",
        "seriously? it seemed like a by-the-books thriller filled with clichès, couldnt watch after 5 episodes.",
        "Yeah. They should've made a mini series. Rumour is that they're going to drop a sequel, obviously the ending scene hinted that.",
        "Attica! Attica! Attica!",
        "Watched **Signal**(kdrama) this week. A really good show. I have a thing against kdrama a that they are so much over the top, the sets and the costumes are so out of the world it just doesn’t fit well with me.  \nAnyway, signal has ~~good~~ great plot and doesn’t do things too over the top. I don’t think it did anything wrong. 5/5",
        "Got to know about Varun Thakur podcasts and they had been airing for more than and an year, so I'm addicted and have huge backlog to complete.",
        "Both Heat (1995) and Fugitive (1993) are on Netflix. They are two of of the best 90s action thrillers and I'd wholeheartedly recommend them to anyone who is into that genre.",
        "Fury - A movie about WW2 tank nicknamed fury and how it holds off against the SS\n\nThe founder- story about the conception and growth of mcdonalds",
        "Curb your Enthusiasm. \n\nSo good, Larry david's a fucking genius.",
        "Are you okay man?\nAlso would recommend swingers 1996",
        "It is a mass entertainer.",
        "Thanks for sharing. Followed you on letterboxd.",
        "Pretty pretty pretty good!",
        "The chestnut man in Netflix is a good crime thriller",
        "Pls do suggest must watch K-dramas; irrespective of the genre",
        "Actress who played Maeve has opted out, so it's probably Ruby now",
        "that's a shame.",
        "Add move to heaven and movie angel's egg.",
        "In Netflix?",
        "Squid Game, Kingdom, Signal, What's Wrong With Secretary Kim? to name a few.",
        "Yes for first. Second you can look on Lime Torrents or rarbg. Difficult to find. Not promoting torrent or piracy but extreme measures. \n\nAngels.Egg.1985.JAPANESE.720p.BluRay.H264.AAC-VXT",
        "Watched kingdom some time ago. What a show. Any idea when’s the next season coming??",
        "Honestly I haven't watched any of these shows apart from Squid game. These were just the most recommended ones so posted them here. I am planning to watch *Kingdom* after finishing *The chestnut man*.",
        "&gt; High Fidelity\n\nthe book is really good too. The same author wrote another book called Fever Pitch which was also made into a movie",
        "Kim\"s Convenience ..family K comedy show.. Its in English.. Highly recommend.. It juat grows on you..",
        "Searching is finally on Netflix...For those who haven't watched this movie, I can't recommend this enough...",
        "Re-watched these recently since I love them:\n\n&amp;#x200B;\n\nTinker Tailor Soldier Spy (Movie)\n\nMunich (Movie)\n\nScott Pilgrim Vs The World (Movie)\n\nThe Others (Movie)\n\n&amp;#x200B;\n\nThe Spy (Netflix Series)\n\nTrue Detective Season 1 (TV series; not available on any streaming sites, sadly)\n\n\nLike someone in the replies pointed out, True Detective is available on Hotstar.",
        "I liked 'Beyond Evil'  \n\n\nCouldn't complete squids game. Found it boring right after episode 1 for some reason.",
        "The Chestnut Man on Netflix",
        "Was binge watching The Expanse on Prime, its was interesting, but by end of 4th season it got bit boring, taking a break before continuing with 5th season.",
        "It is. True Detective is there on Disney+ Hotstar. Like all the other HBO shows",
        "loved fury",
        "It starts to pick up around S2 ending, S3 starting imo.",
        "How's Scott Pilgrim? I've been meaning to watch it for a long time but just don't for one reason or the other. Is it as sappy as other coming of age movies? Or more Superbad type?",
        "It’s quite different actually.\nIt’s by Edgar Wright - Baby Driver, Shaun of the dead, Hot fuzz; so similar style of comedy.",
        "Oh I did not know that. Thanks for letting me and the others know.",
        "Breakpoint",
        "No problem!",
        "It is not an usual coming of age movie. However it might not be for everyone. I was quite sceptical at first. But I loved it."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "foundation apple tv great cinematography acting need see story pans given taking lot creative freedom compared books ted lasso season average especially great season dont know counts since short film watched battle big rock pretty cool sex education netflix would recommend squid game available netflix good one foundation felt bit underwhelming terms story especially people whove read books mind fucked character development acknowledged kinds issues great show rewatch flood great doc relevant ever read books expanded foundation universe yes show takes lot creative liberties tbh books dont enough terms visual descriptions translation tv show yes wouldve loved truer show get chehre prime dont fall category thriller isnt feels long actual story doesnt even begin untill interval seinfeld netflix started season hoping good heard many years doesnt feel single day old except tech course lol randomly pick episode every never get bored anyone watched premise bj novak stupid love watched paper tigers awesome made feel nostalgic old kung fu movies saw dog day afternoon performance al pacino rewatched show yesterday night browsing netflix saw banner watched three episodes yeah man movie awesome watched year ago still remember also john cazale good always wan na go algeria want go wyoming first amazing episode honestly felt like trite better sets love angles lackluster dialogues hope gets better havent read books dont know good maybe watched jaguar tv series decent one time watch based ratings watched card counter thoroughly disappointed hardly storyline many saints newark massive disappointment cant believe guy made sopranos last weeks ive seenhttpsletterboxdcomromcomzomfilmsdiary guilty danish thriller filmed one location kinda similar locke vibe could see twist coming ways reasonable time spend watching movie first reformed usually like ethan hawke movies trash free guy goodenough popcorn flick forgetting sarah marshall rewatch one favourite films put im feeling need motivation get another favourite vein yes man midnight mass mike flannagans new netflix show binged good time someone doesnt know yet pretty much binge everything hes made starting haunting hill house netflix high fidelity movie john cusack gets screamed minne driver multiverse liked movie lot gon na rewatch write much longer review story manchild whos much music struggling relationship doesnt know yet doesnt really want either hit little close home regard dialog chefs kiss movie tries go back talk exes schtick words think done better something like definitely maybe yellow cat offbeat comedy kazakhstan watched part movies countries projecthttpsletterboxdcomromcomzomlisttheflintquillcountriesmovies alright also watched latest episodes star trek lower decks ted lasso hyped final episode love show especially nononsense financial ruthlessness abed hes streets ahead one seinfeld lot peoples halloffamer sitcom list along rock arrested development community guilty pleasure new girl didnt really enjoy season much gt gt wanted see otis maeve drama maybe thatll happen guess seriously seemed like bythebooks thriller filled clichs couldnt watch episodes yeah shouldve made mini series rumour theyre going drop sequel obviously ending scene hinted attica attica attica watched signalkdrama week really good show thing kdrama much top sets costumes world doesnt fit well anyway signal good great plot doesnt things top dont think anything wrong got know varun thakur podcasts airing year im addicted huge backlog complete heat fugitive netflix two best action thrillers id wholeheartedly recommend anyone genre fury movie ww tank nicknamed fury holds ss founder story conception growth mcdonalds curb enthusiasm good larry davids fucking genius okay man also would recommend swingers mass entertainer thanks sharing followed letterboxd pretty pretty pretty good chestnut man netflix good crime thriller pls suggest must watch kdramas irrespective genre actress played maeve opted probably ruby thats shame add move heaven movie angels egg netflix squid game kingdom signal whats wrong secretary kim name yes first second look lime torrents rarbg difficult find promoting torrent piracy extreme measures angelseggjapanesepblurayhaacvxt watched kingdom time ago show idea whens next season coming honestly havent watched shows apart squid game recommended ones posted planning watch kingdom finishing chestnut man gt high fidelity book really good author wrote another book called fever pitch also made movie kims convenience family k comedy show english highly recommend juat grows searching finally netflixfor havent watched movie cant recommend enough rewatched recently since love ampxb tinker tailor soldier spy movie munich movie scott pilgrim vs world movie others movie ampxb spy netflix series true detective season tv series available streaming sites sadly like someone replies pointed true detective available hotstar liked beyond evil couldnt complete squids game found boring right episode reason chestnut man netflix binge watching expanse prime interesting end th season got bit boring taking break continuing th season true detective disney hotstar like hbo shows loved fury starts pick around ending starting imo hows scott pilgrim ive meaning watch long time dont one reason sappy coming age movies superbad type quite different actually edgar wright baby driver shaun dead hot fuzz similar style comedy oh know thanks letting others know breakpoint problem usual coming age movie however might everyone quite sceptical first loved",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Foundation on Apple TV. Great cinematography and acting. Need to see how the story pans out given that they are taking a lot of creative freedom as compared to the books. Ted Lasso season 2 has been below average, especially after the great season 1. I don’t know if this counts since it is a short film but I watched battle at big rock, it was pretty cool Sex Education (On Netflix), 10/10 would recommend. Squid game. Available on Netflix. Very good one Foundation felt a bit underwhelming in terms of the story. Especially to people who've read the books. Mind fucked What a character development, acknowledged all kinds of issues. Great show. will rewatch Before the Flood (2016) It's a great doc, and is more relevant now than ever. I have read 16 books in the expanded Foundation universe. Yes, the show takes a lot of creative liberties, but, TBH the books don't have enough (in terms of visual descriptions) for a translation to a TV show. Yes, we would've loved a truer show, but we get what we can. Chehre on Prime. Don't fall for its category as a thriller. It isn't, feels too long and the actual story doesn't even begin untill the interval. Seinfeld is on Netflix... Started with season 1... hoping it is as good as I heard for so many years.. It is. It doesn't feel a single day old (except for the tech of course lol). I randomly pick any episode every now and then and never get bored. Anyone watched the Premise by BJ Novak? It's so stupid, I love it Watched The Paper Tigers It was awesome. Made me feel nostalgic for old kung fu movies. I saw Dog Day Afternoon. What a performance by Al Pacino. It’s my most rewatched show. Just yesterday night I was browsing Netflix and saw it’s banner, I watched three episodes. Yeah man the movie was awesome watched a year ago. Still remember, and also john cazale was good too as always. You wanna go to Algeria? No I want to go to Wyoming. After the first amazing episode, it honestly just felt like trite but with better sets. Love angles, lackluster dialogues. I hope it gets better. Haven't read the books, so don't know how good they are. Maybe I will. Watched Jaguar TV series. Decent one time watch. Based on the ratings, I watched The Card Counter. Was thoroughly disappointed. There was hardly any storyline. The many saints of Newark was such a massive disappointment. I can't believe that it's the same guy who made Sopranos. Over the last 2 weeks, [I've seen](https://letterboxd.com/_romcomzom_/films/diary/): **The Guilty (2018):** Danish thriller filmed in one location (kinda similar to Locke in that vibe). 3/5. I could see the \"twist\" coming a ways off, but it's a reasonable time to spend watching a movie. **First Reformed (2017):** I usually like Ethan Hawke movies, but this was just trash. 1/5. **Free Guy (2021):** Good-enough popcorn flick. 3/5. **Forgetting Sarah Marshall (2008):** Rewatch. One of my favourite films that I put on when I'm feeling down and need the motivation to get over myself. Another favourite in the same vein is Yes Man. 4/5. **Midnight Mass (2021):** Mike Flannagan's new Netflix show. Binged it and had a good time. For someone who doesn't know him yet, pretty much binge everything he's made starting with The Haunting of Hill House on Netflix. 3/5. **High Fidelity (2000):** Movie #2 in the John Cusack gets screamed at by Minne Driver multiverse. I liked this movie a lot. Gonna rewatch it again and write a much longer review. It's a story of a manchild who's too much into music, struggling with his relationship because he doesn't know himself yet and doesn't really want to, either. Hit a little too close to home in that regard. But some of the dialog. *chef's kiss*. Movie tries to do the \"go back and talk to exes\" schtick and it words but I think it was done better in something like Definitely Maybe. 3/5. **Yellow Cat (2020):** Off-beat comedy from Kazakhstan that I watched as part of my [100 movies, 100 countries project](https://letterboxd.com/_romcomzom_/list/theflintquill-100-countries-100-movies/). It was alright. 3/5. Also watched the latest episodes of Star Trek Lower Decks and Ted Lasso. Hyped for the final episode. love that show. especially the no-nonsense, financial ruthlessness of abed. he's just streets ahead in this one. Seinfeld is on my (and a lot of people's) hall-of-famer sitcom list; along with 30 Rock, Arrested Development, Community and (my guilty pleasure) New Girl. I didn't really enjoy Season 3 as much as I did 1 and 2. (1 &gt; 2 &gt; 3). I wanted to see more Otis and Maeve drama, but maybe that'll happen in S04, I guess. seriously? it seemed like a by-the-books thriller filled with clichès, couldnt watch after 5 episodes. Yeah. They should've made a mini series. Rumour is that they're going to drop a sequel, obviously the ending scene hinted that. Attica! Attica! Attica! Watched **Signal**(kdrama) this week. A really good show. I have a thing against kdrama a that they are so much over the top, the sets and the costumes are so out of the world it just doesn’t fit well with me. Anyway, signal has ~~good~~ great plot and doesn’t do things too over the top. I don’t think it did anything wrong. 5/5 Got to know about Varun Thakur podcasts and they had been airing for more than and an year, so I'm addicted and have huge backlog to complete. Both Heat (1995) and Fugitive (1993) are on Netflix. They are two of of the best 90s action thrillers and I'd wholeheartedly recommend them to anyone who is into that genre. Fury - A movie about WW2 tank nicknamed fury and how it holds off against the SS The founder- story about the conception and growth of mcdonalds Curb your Enthusiasm. So good, Larry david's a fucking genius. Are you okay man? Also would recommend swingers 1996 It is a mass entertainer. Thanks for sharing. Followed you on letterboxd. Pretty pretty pretty good! The chestnut man in Netflix is a good crime thriller Pls do suggest must watch K-dramas; irrespective of the genre Actress who played Maeve has opted out, so it's probably Ruby now that's a shame. Add move to heaven and movie angel's egg. In Netflix? Squid Game, Kingdom, Signal, What's Wrong With Secretary Kim? to name a few. Yes for first. Second you can look on Lime Torrents or rarbg. Difficult to find. Not promoting torrent or piracy but extreme measures. Angels.Egg.1985.JAPANESE.720p.BluRay.H264.AAC-VXT Watched kingdom some time ago. What a show. Any idea when’s the next season coming?? Honestly I haven't watched any of these shows apart from Squid game. These were just the most recommended ones so posted them here. I am planning to watch *Kingdom* after finishing *The chestnut man*. &gt; High Fidelity the book is really good too. The same author wrote another book called Fever Pitch which was also made into a movie Kim\"s Convenience ..family K comedy show.. Its in English.. Highly recommend.. It juat grows on you.. Searching is finally on Netflix...For those who haven't watched this movie, I can't recommend this enough... Re-watched these recently since I love them:  Tinker Tailor Soldier Spy (Movie) Munich (Movie) Scott Pilgrim Vs The World (Movie) The Others (Movie)  The Spy (Netflix Series) True Detective Season 1 (TV series; not available on any streaming sites, sadly) Like someone in the replies pointed out, True Detective is available on Hotstar. I liked 'Beyond Evil' Couldn't complete squids game. Found it boring right after episode 1 for some reason. The Chestnut Man on Netflix Was binge watching The Expanse on Prime, its was interesting, but by end of 4th season it got bit boring, taking a break before continuing with 5th season. It is. True Detective is there on Disney+ Hotstar. Like all the other HBO shows loved fury It starts to pick up around S2 ending, S3 starting imo. How's Scott Pilgrim? I've been meaning to watch it for a long time but just don't for one reason or the other. Is it as sappy as other coming of age movies? Or more Superbad type? It’s quite different actually. It’s by Edgar Wright - Baby Driver, Shaun of the dead, Hot fuzz; so similar style of comedy. Oh I did not know that. Thanks for letting me and the others know. Breakpoint No problem! It is not an usual coming of age movie. However it might not be for everyone. I was quite sceptical at first. But I loved it."
}