{
    "id": "15e68k7",
    "title": "Name a local government agency in India where not a single file moves without a bribe?*",
    "url": "https://www.reddit.com/r/india/comments/15e68k7/name_a_local_government_agency_in_india_where_not/",
    "selftext": "Name the local government agency in India where not a single file moves without a bribe? - IMO it is the Revenue department. My story is a classic example of how standing one's ground and refusing bribes means work WILL NOT get done FOR YEARS! \n\nTL;DR. My dad acquired the title to a 20 Gunta (half-acre) land in in North Bengaluru in 1995. The registration has been pending for nearly 25 years. Stuck for some technical reason that officials haven't been able to explain. (more in my [Petition](https://www.change.org/p/land-registration-pending-for-25-years-in-karnataka-exserviceman-s-family-requests-help-rashokabjp-cmofkarnataka-bsbommai-dc-burban-dcbangalore-veteran?utm_source=share_petition&utm_medium=custom_url&recruited_by_id=06819eb0-64b3-0130-0bb7-3c764e049b10)  & #mystory in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece).)\n\nI took the matter to High Court several times, and the court passed an order [after reviewing documents (link)](https://np.reddit.com/r/bangalore/comments/15bp3mt/local_government_officials_in_bengaluru_deputy/) As the officials of Bengaluru Deputy Commissioner's office haven't acted on the latest  court order within stipulated 45 days, my lawyer has filed a **Contempt of Court in Karnataka High Court this month**.\n\nThis just goes to show a file WILL NOT be reviewed till palms are greased! \n\nIt seems like my story is not an isolated case.  Even the Karnataka Revenue Minster has admitted [\"Can’t do much against corrupt officials\"](https://timesofindia.indiatimes.com/city/bengaluru/cant-do-much-against-corrupt-officials-karnataka-revenue-minister/articleshow/74556769.cms)\n\nWonder if ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690778445.0,
    "convurl": "https://external-preview.redd.it/NhXebUw5gwSsq25iVbqNn_USzIZzoONTHEnV4IlTlQk.jpg",
    "comments": [
        "Town and Country Planning - quite similar to the Revenue Department.",
        "Land or what you call revenue department. If a patwari is involved. The file is like stucked gears which won't move without Grease.",
        "Literally every govt agency. Gets worse in secluded rural areas but definitely each and every govt officer gets \"gifts\"",
        "Bijli vibhag ie electricity department and the development authorities......utterly worthless for ppl with limited means",
        "RTOs are full of corruption",
        "CEO of district? I want a job in district company",
        "Dunno if you're being sarcastic or genuinely don't know but FYI \n\nhttps://en.m.wikipedia.org/wiki/District_council_(India)\n\n>The chief executive officer (CEO), who is a civil servant under IAS or State Administrative Service cadre, heads the administrative machinery of the Zila Parishad. He is also nominated by the government. He may also be district magistrate in some states. The CEO supervises the divisions of the parishad and executes its development schemes. In some states, like Kerala, the chief executive officer of the District Panchayat is known as Secretary.",
        "Usually called collector and district magistrate in every stare.",
        "Might differ from place to place. But the real legal designation is CEO only. I remember reading CEO in class 8 Civics or smth.",
        "Read my comment again.",
        "> If a patwari is involved. \n\nThis!",
        "> RTOs are full of corruption\n\nYes.. and full of agents who operate right outside the offices",
        "> my aunt is a Sarpanch and I have an uncle who is CEO of a district in MH.\n\nInteresting pairing of a couple?! One is the elected leader and other a career bureaucrat",
        "No no they aren't a couple lol. My bad I worded it that way. 2 different relatives with no connection.",
        "Thanks for clarifying. It would be really surprising to have such a power-couple in a district.\n\n :-)",
        "Passport",
        "Despite being born and brought up in India , you have to pay a bribe to prove you are Indian..",
        "really? i’ve never paid a bribe for my passport ever.",
        "R.T.O",
        "police verification?",
        "Mujhe koi form k 50 Xerox aur 20 pen lane bole the..subtle bribe..I think govt gives them money for this ststionaries..but logo se leke wo Paisa Jeb mai",
        "He tried asking me for money but i didn’t understand him. Why do people say “good luck” here to ask for bribes? if he asked me properly i would’ve given lmao. but no i didn’t pay and my verification was done same week.",
        "I think you should rephrase this to \"Name the  govt agency that moves without a bribe\".",
        "LOL. But it would be funny if not really true!",
        "Because you can get your license without paying bribe ..",
        "Tamil Nadu inspector of factories. Especially for the oragadam industrial area and surrounding areas. Work happens same day, no bribe.",
        "Bro your title should be name anything that involves a some considerable amount if capital to not involve some kind of bribery.",
        "We had a similar issue. My grandpa bought a tractor like 50 years ago and he had a loan. He paid off the loan but t bank never cleared the dues with the land department/gram panchyat. \r\n\r\nWanted to transfer all the land to my dad and his siblings but they won't without noc from bank. Bank won't give noc as they don't have any paper. We were stuck in that for years. Finally, we hired an \"agent\". He got noc from the bank within a week. He helped us to transfer and divide all lands. Cost us almost 10 lakhs",
        "People pay because they can't always afford the *possibility* of a delay, and because most people know someone--or know of someone--whose application disappeared into a dustbin after they refused to pay for an officer's chai-pani.",
        "When I told this to my right wing flatmate, she told me to go out of India as he says that Gobhi has eliminated Corruption completely and that now India has less corruption than some western countries",
        ">  Finally, we hired an \"agent\". He got noc from the bank within a week. He helped us to transfer and divide all lands. Cost us almost 10 lakhs\n\nThis!\n\nBut, finding a 'trustworthy' agent is equally dicey!",
        "Glad to know at least SOME areas are untouched by this malaise",
        "Thats on state police department not passport seva kendra. In my case I got the passport in 7-8 days without giving any bribes. But both my parents are bureaucrats so maybe no one bothered to ask bribes.",
        "Tehsildar's office (Revenue administration)",
        "I think the question should have been name somewhere in Indian where bribes are not taken , that would have been hard",
        "BBMP BANGALORE municipality. Byword for corruption. You could make Jesus Christ,  Buddha or swami Vivekananda as the MD of this org and it would still be the most hated amongst bangalroreans....",
        "India rank 85 [https://www.transparency.org/en/cpi/2022](https://www.transparency.org/en/cpi/2022)",
        "There is no limit for Delusion.",
        "We got it through a referral. He worked with many people that we knew and they vouched for him. \r\n\r\nHe does all the work for the babus/government officials. He literally sits with them and tells them which form to use, and what to write in the affidavit and other documents. \r\n\r\nHe charges a lot, but gets things done.",
        "Every govt. department but we educated folks don't fuck this guys . Unless you are in UP-bihar , just fucking complain about that officer . If nothing happens , the vigilance dept./local journos  will ask for more bribe from that guy :)",
        "This!",
        "LNDO in Delhi"
    ],
    "cleaned_text": "name local government agency india single file moves without bribe name local government agency india single file moves without bribe imo revenue department story classic example standing ones ground refusing bribes means work get done years tldr dad acquired title gunta halfacre land north bengaluru registration pending nearly years stuck technical reason officials havent able explain petitionhttpswwwchangeorgplandregistrationpendingforyearsinkarnatakaexservicemansfamilyrequestshelprashokabjpcmofkarnatakabsbommaidcburbandcbangaloreveteranutmsourcesharepetitionutmmediumcustomurlrecruitedbyidebbbbceb mystory hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece took matter high court several times court passed order reviewing documents linkhttpsnpredditcomrbangalorecommentsbpmtlocalgovernmentofficialsinbengalurudeputy officials bengaluru deputy commissioners office havent acted latest court order within stipulated days lawyer filed contempt court karnataka high court month goes show file reviewed till palms greased seems like story isolated case even karnataka revenue minster admitted cant much corrupt officialshttpstimesofindiaindiatimescomcitybengalurucantdomuchagainstcorruptofficialskarnatakarevenueministerarticleshowcms wonder ",
    "cleaned_title": "name local government agency india single file moves without bribe",
    "cleaned_selftext": "name local government agency india single file moves without bribe imo revenue department story classic example standing ones ground refusing bribes means work get done years tldr dad acquired title gunta halfacre land north bengaluru registration pending nearly years stuck technical reason officials havent able explain petitionhttpswwwchangeorgplandregistrationpendingforyearsinkarnatakaexservicemansfamilyrequestshelprashokabjpcmofkarnatakabsbommaidcburbandcbangaloreveteranutmsourcesharepetitionutmmediumcustomurlrecruitedbyidebbbbceb mystory hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece took matter high court several times court passed order reviewing documents linkhttpsnpredditcomrbangalorecommentsbpmtlocalgovernmentofficialsinbengalurudeputy officials bengaluru deputy commissioners office havent acted latest court order within stipulated days lawyer filed contempt court karnataka high court month goes show file reviewed till palms greased seems like story isolated case even karnataka revenue minster admitted cant much corrupt officialshttpstimesofindiaindiatimescomcitybengalurucantdomuchagainstcorruptofficialskarnatakarevenueministerarticleshowcms wonder",
    "cleaned_comments": "town country planning quite similar revenue department land call revenue department patwari involved file like stucked gears wont move without grease literally every govt agency gets worse secluded rural areas definitely every govt officer gets gifts bijli vibhag ie electricity department development authoritiesutterly worthless ppl limited means rtos full corruption ceo district want job district company dunno youre sarcastic genuinely dont know fyi chief executive officer ceo civil servant ias state administrative service cadre heads administrative machinery zila parishad also nominated government may also district magistrate states ceo supervises divisions parishad executes development schemes states like kerala chief executive officer district panchayat known secretary usually called collector district magistrate every stare might differ place place real legal designation ceo remember reading ceo class civics smth read comment patwari involved rtos full corruption yes full agents operate right outside offices aunt sarpanch uncle ceo district mh interesting pairing couple one elected leader career bureaucrat arent couple lol bad worded way different relatives connection thanks clarifying would really surprising powercouple district passport despite born brought india pay bribe prove indian really ive never paid bribe passport ever rto police verification mujhe koi form k xerox aur pen lane bole thesubtle bribei think govt gives money ststionariesbut logo se leke wo paisa jeb mai tried asking money didnt understand people say good luck ask bribes asked properly wouldve given lmao didnt pay verification done week think rephrase name govt agency moves without bribe lol would funny really true get license without paying bribe tamil nadu inspector factories especially oragadam industrial area surrounding areas work happens day bribe bro title name anything involves considerable amount capital involve kind bribery similar issue grandpa bought tractor like years ago loan paid loan bank never cleared dues land departmentgram panchyat wanted transfer land dad siblings wont without noc bank bank wont give noc dont paper stuck years finally hired agent got noc bank within week helped us transfer divide lands cost us almost lakhs people pay cant always afford possibility delay people know someoneor know someonewhose application disappeared dustbin refused pay officers chaipani told right wing flatmate told go india says gobhi eliminated corruption completely india less corruption western countries finally hired agent got noc bank within week helped us transfer divide lands cost us almost lakhs finding trustworthy agent equally dicey glad know least areas untouched malaise thats state police department passport seva kendra case got passport days without giving bribes parents bureaucrats maybe one bothered ask bribes tehsildars office revenue administration think question name somewhere indian bribes taken would hard bbmp bangalore municipality byword corruption could make jesus christ buddha swami vivekananda md org would still hated amongst bangalroreans india rank httpswwwtransparencyorgencpihttpswwwtransparencyorgencpi limit delusion got referral worked many people knew vouched work babusgovernment officials literally sits tells form use write affidavit documents charges lot gets things done every govt department educated folks dont fuck guys unless upbihar fucking complain officer nothing happens vigilance deptlocal journos ask bribe guy lndo delhi",
    "light_cleaned_title": "Name a local government agency in India where not a single file moves without a bribe?*",
    "light_cleaned_selftext": "Name the local government agency in India where not a single file moves without a bribe? - IMO it is the Revenue department. My story is a classic example of how standing one's ground and refusing bribes means work WILL NOT get done FOR YEARS! TL;DR. My dad acquired the title to a 20 Gunta (half-acre) land in in North Bengaluru in 1995. The registration has been pending for nearly 25 years. Stuck for some technical reason that officials haven't been able to explain. (more in my [Petition](https://www.change.org/p/land-registration-pending-for-25-years-in-karnataka-exserviceman-s-family-requests-help-rashokabjp-cmofkarnataka-bsbommai-dc-burban-dcbangalore-veteran?utm_source=share_petition&utm_medium=custom_url&recruited_by_id=06819eb0-64b3-0130-0bb7-3c764e049b10) & #mystory in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece).) I took the matter to High Court several times, and the court passed an order [after reviewing documents (link)](https://np.reddit.com/r/bangalore/comments/15bp3mt/local_government_officials_in_bengaluru_deputy/) As the officials of Bengaluru Deputy Commissioner's office haven't acted on the latest court order within stipulated 45 days, my lawyer has filed a **Contempt of Court in Karnataka High Court this month**. This just goes to show a file WILL NOT be reviewed till palms are greased! It seems like my story is not an isolated case. Even the Karnataka Revenue Minster has admitted [\"Can’t do much against corrupt officials\"](https://timesofindia.indiatimes.com/city/bengaluru/cant-do-much-against-corrupt-officials-karnataka-revenue-minister/articleshow/74556769.cms) Wonder if",
    "light_cleaned_comments": "Town and Country Planning - quite similar to the Revenue Department. Land or what you call revenue department. If a patwari is involved. The file is like stucked gears which won't move without Grease. Literally every govt agency. Gets worse in secluded rural areas but definitely each and every govt officer gets \"gifts\" Bijli vibhag ie electricity department and the development authorities......utterly worthless for ppl with limited means RTOs are full of corruption CEO of district? I want a job in district company Dunno if you're being sarcastic or genuinely don't know but FYI >The chief executive officer (CEO), who is a civil servant under IAS or State Administrative Service cadre, heads the administrative machinery of the Zila Parishad. He is also nominated by the government. He may also be district magistrate in some states. The CEO supervises the divisions of the parishad and executes its development schemes. In some states, like Kerala, the chief executive officer of the District Panchayat is known as Secretary. Usually called collector and district magistrate in every stare. Might differ from place to place. But the real legal designation is CEO only. I remember reading CEO in class 8 Civics or smth. Read my comment again. > If a patwari is involved. This! > RTOs are full of corruption Yes.. and full of agents who operate right outside the offices > my aunt is a Sarpanch and I have an uncle who is CEO of a district in MH. Interesting pairing of a couple?! One is the elected leader and other a career bureaucrat No no they aren't a couple lol. My bad I worded it that way. 2 different relatives with no connection. Thanks for clarifying. It would be really surprising to have such a power-couple in a district. :-) Passport Despite being born and brought up in India , you have to pay a bribe to prove you are Indian.. really? i’ve never paid a bribe for my passport ever. R.T.O police verification? Mujhe koi form k 50 Xerox aur 20 pen lane bole the..subtle bribe..I think govt gives them money for this ststionaries..but logo se leke wo Paisa Jeb mai He tried asking me for money but i didn’t understand him. Why do people say “good luck” here to ask for bribes? if he asked me properly i would’ve given lmao. but no i didn’t pay and my verification was done same week. I think you should rephrase this to \"Name the govt agency that moves without a bribe\". LOL. But it would be funny if not really true! Because you can get your license without paying bribe .. Tamil Nadu inspector of factories. Especially for the oragadam industrial area and surrounding areas. Work happens same day, no bribe. Bro your title should be name anything that involves a some considerable amount if capital to not involve some kind of bribery. We had a similar issue. My grandpa bought a tractor like 50 years ago and he had a loan. He paid off the loan but t bank never cleared the dues with the land department/gram panchyat. Wanted to transfer all the land to my dad and his siblings but they won't without noc from bank. Bank won't give noc as they don't have any paper. We were stuck in that for years. Finally, we hired an \"agent\". He got noc from the bank within a week. He helped us to transfer and divide all lands. Cost us almost 10 lakhs People pay because they can't always afford the *possibility* of a delay, and because most people know someone--or know of someone--whose application disappeared into a dustbin after they refused to pay for an officer's chai-pani. When I told this to my right wing flatmate, she told me to go out of India as he says that Gobhi has eliminated Corruption completely and that now India has less corruption than some western countries > Finally, we hired an \"agent\". He got noc from the bank within a week. He helped us to transfer and divide all lands. Cost us almost 10 lakhs This! But, finding a 'trustworthy' agent is equally dicey! Glad to know at least SOME areas are untouched by this malaise Thats on state police department not passport seva kendra. In my case I got the passport in 7-8 days without giving any bribes. But both my parents are bureaucrats so maybe no one bothered to ask bribes. Tehsildar's office (Revenue administration) I think the question should have been name somewhere in Indian where bribes are not taken , that would have been hard BBMP BANGALORE municipality. Byword for corruption. You could make Jesus Christ, Buddha or swami Vivekananda as the MD of this org and it would still be the most hated amongst bangalroreans.... India rank 85 [https://www.transparency.org/en/cpi/2022](https://www.transparency.org/en/cpi/2022) There is no limit for Delusion. We got it through a referral. He worked with many people that we knew and they vouched for him. He does all the work for the babus/government officials. He literally sits with them and tells them which form to use, and what to write in the affidavit and other documents. He charges a lot, but gets things done. Every govt. department but we educated folks don't fuck this guys . Unless you are in UP-bihar , just fucking complain about that officer . If nothing happens , the vigilance dept./local journos will ask for more bribe from that guy :) This! LNDO in Delhi"
}