{
    "id": "1diit3k",
    "title": "Recharge Scam Calls and message",
    "url": "https://www.reddit.com/r/india/comments/1diit3k/recharge_scam_calls_and_message/",
    "selftext": "https://preview.redd.it/wr5ujlssj97d1.jpg?width=540&format=pjpg&auto=webp&s=8ef6f2d9b9e1414e4603665739f0977c82171184\n\nI wanted to share an incident that happened to me today while I was traveling by train. I think it might help others be cautious about similar scams.\n\nSo, I received a Jio recharge of Rs 239 on my phone number. A couple of minutes later, I got a call from an unknown number. Being aware of such scams, I didn't pick up. Then, I got another call from a different random number. Truecaller identified the names as Raushan Kumar and Manish Kumar.\n\nhttps://preview.redd.it/jd2dbgayj97d1.jpg?width=540&format=pjpg&auto=webp&s=bd92a33acec0cdc1db1a62f6eb20688115fee496\n\nAfter a while, I received a message from one of these numbers saying they had mistakenly recharged my number and asked me to send the money back. When I didn't respond, the person asked me to recharge another number, 9326657713, instead. Since I continued to ignore the messages and calls, they eventually asked me to respond and then changed the number to recharge again.\n\nhttps://preview.redd.it/jpog8te1k97d1.jpg?width=540&format=pjpg&auto=webp&s=e7b7c95f5267f9669cceb776909b5cee79785a33\n\nThis is clearly a scam. They play on your soft side, hoping you'll feel bad and either send them the money or do the recharge. If you fall for it, here's what can happen:\n\nhttps://preview.redd.it/tprusyo3k97d1.jpg?width=540&format=pjpg&auto=webp&s=0c2bebae58e29ac8b55a412b837ece3ba78b302a\n\n1. **Direct Money Loss:** If you send them money, you’re directly losing your hard-earned cash.\n2. **Future Scams:** They can call someone else using your number, claim they mistakenly sent you money, and try to get money from that person.\n3. **Legal Trouble:** If you do the recharge for the number they give and that person files a complaint, it could trace back to you and cause significant trouble.\n\nSo, don't fall for such scams. If you receive unsolicited recharges or calls asking for money, do not respond via call or message. Block the numbers and report them if necessary.\n\nStay safe, everyone!\n\nHas anyone else encountered a similar scam?",
    "flair": "Crime",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1718687487.0,
    "convurl": "https://b.thumbs.redditmedia.com/yS-wAxTzEMRZ_U8rOXJnUkRNQzO53DJWMINZHBFzZRQ.jpg",
    "comments": [],
    "cleaned_text": "recharge scam calls message wanted share incident happened today traveling train think might help others cautious similar scams received jio recharge rs phone number couple minutes later got call unknown number aware scams didnt pick got another call different random number truecaller identified names raushan kumar manish kumar received message one numbers saying mistakenly recharged number asked send money back didnt respond person asked recharge another number instead since continued ignore messages calls eventually asked respond changed number recharge clearly scam play soft side hoping youll feel bad either send money recharge fall heres happen direct money loss send money youre directly losing hardearned cash future scams call someone else using number claim mistakenly sent money try get money person legal trouble recharge number give person files complaint could trace back cause significant trouble dont fall scams receive unsolicited recharges calls asking money respond via call message block numbers report necessary stay safe everyone anyone else encountered similar scam ",
    "cleaned_title": "recharge scam calls message",
    "cleaned_selftext": "wanted share incident happened today traveling train think might help others cautious similar scams received jio recharge rs phone number couple minutes later got call unknown number aware scams didnt pick got another call different random number truecaller identified names raushan kumar manish kumar received message one numbers saying mistakenly recharged number asked send money back didnt respond person asked recharge another number instead since continued ignore messages calls eventually asked respond changed number recharge clearly scam play soft side hoping youll feel bad either send money recharge fall heres happen direct money loss send money youre directly losing hardearned cash future scams call someone else using number claim mistakenly sent money try get money person legal trouble recharge number give person files complaint could trace back cause significant trouble dont fall scams receive unsolicited recharges calls asking money respond via call message block numbers report necessary stay safe everyone anyone else encountered similar scam",
    "cleaned_comments": "",
    "light_cleaned_title": "Recharge Scam Calls and message",
    "light_cleaned_selftext": "I wanted to share an incident that happened to me today while I was traveling by train. I think it might help others be cautious about similar scams. So, I received a Jio recharge of Rs 239 on my phone number. A couple of minutes later, I got a call from an unknown number. Being aware of such scams, I didn't pick up. Then, I got another call from a different random number. Truecaller identified the names as Raushan Kumar and Manish Kumar. After a while, I received a message from one of these numbers saying they had mistakenly recharged my number and asked me to send the money back. When I didn't respond, the person asked me to recharge another number, 9326657713, instead. Since I continued to ignore the messages and calls, they eventually asked me to respond and then changed the number to recharge again. This is clearly a scam. They play on your soft side, hoping you'll feel bad and either send them the money or do the recharge. If you fall for it, here's what can happen: 1. **Direct Money Loss:** If you send them money, you’re directly losing your hard-earned cash. 2. **Future Scams:** They can call someone else using your number, claim they mistakenly sent you money, and try to get money from that person. 3. **Legal Trouble:** If you do the recharge for the number they give and that person files a complaint, it could trace back to you and cause significant trouble. So, don't fall for such scams. If you receive unsolicited recharges or calls asking for money, do not respond via call or message. Block the numbers and report them if necessary. Stay safe, everyone! Has anyone else encountered a similar scam?",
    "light_cleaned_comments": ""
}