{
    "id": "13s0jg8",
    "title": "Does anyone know what this represents?",
    "url": "https://www.reddit.com/gallery/13s0jg8",
    "selftext": "I do not know what culture this is made to represent or from, I purchased it from eBay a couple years ago. I just liked it because it was interesting and I love things like this. I wish I knew what it was, or meant or anything really. I don’t even know if it’s a newer piece or something older. If anyone knows I’d love to hear from you. I’m going to post it in a few different locations and hopefully someone will recognize it. Thank you!",
    "flair": "AskIndia",
    "score": 208,
    "num_comments": 59,
    "created_utc": 1685067404.0,
    "convurl": "https://i.redd.it/u6p010kim42b1.jpg",
    "comments": [
        "Obviously not this piece but the design that is reminding me of Indus Valley civilization",
        "Thanks I will look into that.",
        "Middle seat is a bad idea😂",
        "The one in the middle is carrying a child on his head. The two wavey things on the top seem like snakes with multiple heads. So this could be vasudev carrying Krishna ? Just guessing",
        "Morning scenes from an Indian village.",
        "Also, the one in the middle is looking like a male and the 2 on the sides are females maybe? I am guessing so because they have circles on their chest and the one in the middle doesn't, maybe that's to represent the breasts?",
        "Looks like middle one is king with a crown",
        "One could be his wife Devki but the presence of 2 figures here is confusing\n\nEdit : the other one should be Yashoda. So basically this is showing his transition from birth mom to the mother who raised him.",
        "This is definitely my friends great grandfather taking a dump with his brothers. Not doubt 100% absolutely sure.",
        "This actually looks like recreation of an Indus valley seal. They were popular a few years ago as decorative items and jewellery pieces.",
        "🤣",
        "Ah yes. I see the demarcations of Batkagrip there - this could be linked with the Aevedya region",
        "This is Vasudev taking baby krishna from one mother to another both were in labor at the time, the left one is Devaki and the right one is Yashoda.",
        "Hastar. Whose name is forbidden to call.",
        "Dad telling stories to kids vibe",
        "Slavery (technically the truth)",
        "Those are wired looking legs for human anatomy",
        "Turn it upside down and see the magic 👍",
        "FMF genre",
        "Monkey business",
        "It's three people squatting on an indian toilet side by side and having a convo with each other.",
        "That twerking was also invented by India?",
        "Sauce : tumbbad\nLol",
        "i am not entirely sure, but this could be a jewellery (Araignan ) for new born girl baby, usually they will tie it to hip.  Boy baby will have different design. \n\nhttps://preview.redd.it/hpkuylsc872b1.jpeg?width=1008&format=pjpg&auto=webp&v=enabled&s=fac97d069b0250d051f08b9b787dfaa40f1b56ec",
        "Family/friendship",
        "Shree Krishna govind hare murari",
        "I like to move it move it",
        "A threesome, obviously?",
        "Let me guess, it's a metal...",
        "Sachin was their God I guess",
        "Oh wow, thank you.",
        "It represents don't sit on my airpods",
        "Polygamy??",
        "Take a shit while squatting",
        "So this is really where the airpods design were stolen from",
        "Didn't see anything, what ?",
        "i dont know what it represents.\n\nbut would you sell it for 1 lakh rupees?",
        "Boss. Thoda adjust...",
        "Indian style",
        "Can someone pin this comment or something, because half the Indian reddit wouldn't believe that this comment is upvoted on r India.",
        "It’s the locket that produces the Alibaba djinn. Try rubbing it",
        "I’ll admit, I have rubbed the tummy a few times 🤭",
        "Threesome i guess!!!!?",
        "Threesome??",
        "Looks like what we call \"Siggubilla\" in Telugu. Used to cover the genitals of toddlers",
        "That is so cute 😊 sorry, normal mom response ☺️",
        "It's typical to South India (maybe other cultures have it as well) but you don't see them often these days. A black thread or one made with silver is tied around the toddlers waist/hip and the \"Siggu Billa\" hangs by it covering the genitals. Quite useful during hot summers when toddlers like to be naked. My 2 year old has one that belonged to my great grand mother.",
        "This is what we call Siggu Billa in Telugu. Not many use it these days though. But every family with a toddler used to have one. It hangs by the black/silver thread that is tied around the waist and covers the genitals of the otherwise naked toddler",
        "Theivame.... Unnaku yaravadhu oru award kudutha nalla irukkum. En kitta like thavira kuduka vera edhuvume illaye",
        "Thank you, I appreciate the information. That’s very cool.",
        "You're welcome. 😊",
        "Jai shree krishna",
        "You right 😂",
        "Sharing Auto this is"
    ],
    "cleaned_text": "anyone know represents know culture made represent purchased ebay couple years ago liked interesting love things like wish knew meant anything really dont even know newer piece something older anyone knows id love hear im going post different locations hopefully someone recognize thank ",
    "cleaned_title": "anyone know represents",
    "cleaned_selftext": "know culture made represent purchased ebay couple years ago liked interesting love things like wish knew meant anything really dont even know newer piece something older anyone knows id love hear im going post different locations hopefully someone recognize thank",
    "cleaned_comments": "obviously piece design reminding indus valley civilization thanks look middle seat bad idea one middle carrying child head two wavey things top seem like snakes multiple heads could vasudev carrying krishna guessing morning scenes indian village also one middle looking like male sides females maybe guessing circles chest one middle doesnt maybe thats represent breasts looks like middle one king crown one could wife devki presence figures confusing edit one yashoda basically showing transition birth mom mother raised definitely friends great grandfather taking dump brothers doubt absolutely sure actually looks like recreation indus valley seal popular years ago decorative items jewellery pieces ah yes see demarcations batkagrip could linked aevedya region vasudev taking baby krishna one mother another labor time left one devaki right one yashoda hastar whose name forbidden call dad telling stories kids vibe slavery technically truth wired looking legs human anatomy turn upside see magic fmf genre monkey business three people squatting indian toilet side side convo twerking also invented india sauce tumbbad lol entirely sure could jewellery araignan new born girl baby usually tie hip boy baby different design familyfriendship shree krishna govind hare murari like move move threesome obviously let guess metal sachin god guess oh wow thank represents dont sit airpods polygamy take shit squatting really airpods design stolen didnt see anything dont know represents would sell lakh rupees boss thoda adjust indian style someone pin comment something half indian reddit wouldnt believe comment upvoted r india locket produces alibaba djinn try rubbing ill admit rubbed tummy times threesome guess threesome looks like call siggubilla telugu used cover genitals toddlers cute sorry normal mom response typical south india maybe cultures well dont see often days black thread one made silver tied around toddlers waisthip siggu billa hangs covering genitals quite useful hot summers toddlers like naked year old one belonged great grand mother call siggu billa telugu many use days though every family toddler used one hangs blacksilver thread tied around waist covers genitals otherwise naked toddler theivame unnaku yaravadhu oru award kudutha nalla irukkum en kitta like thavira kuduka vera edhuvume illaye thank appreciate information thats cool youre welcome jai shree krishna right sharing auto",
    "light_cleaned_title": "Does anyone know what this represents?",
    "light_cleaned_selftext": "I do not know what culture this is made to represent or from, I purchased it from eBay a couple years ago. I just liked it because it was interesting and I love things like this. I wish I knew what it was, or meant or anything really. I don’t even know if it’s a newer piece or something older. If anyone knows I’d love to hear from you. I’m going to post it in a few different locations and hopefully someone will recognize it. Thank you!",
    "light_cleaned_comments": "Obviously not this piece but the design that is reminding me of Indus Valley civilization Thanks I will look into that. Middle seat is a bad idea😂 The one in the middle is carrying a child on his head. The two wavey things on the top seem like snakes with multiple heads. So this could be vasudev carrying Krishna ? Just guessing Morning scenes from an Indian village. Also, the one in the middle is looking like a male and the 2 on the sides are females maybe? I am guessing so because they have circles on their chest and the one in the middle doesn't, maybe that's to represent the breasts? Looks like middle one is king with a crown One could be his wife Devki but the presence of 2 figures here is confusing Edit : the other one should be Yashoda. So basically this is showing his transition from birth mom to the mother who raised him. This is definitely my friends great grandfather taking a dump with his brothers. Not doubt 100% absolutely sure. This actually looks like recreation of an Indus valley seal. They were popular a few years ago as decorative items and jewellery pieces. 🤣 Ah yes. I see the demarcations of Batkagrip there - this could be linked with the Aevedya region This is Vasudev taking baby krishna from one mother to another both were in labor at the time, the left one is Devaki and the right one is Yashoda. Hastar. Whose name is forbidden to call. Dad telling stories to kids vibe Slavery (technically the truth) Those are wired looking legs for human anatomy Turn it upside down and see the magic 👍 FMF genre Monkey business It's three people squatting on an indian toilet side by side and having a convo with each other. That twerking was also invented by India? Sauce : tumbbad Lol i am not entirely sure, but this could be a jewellery (Araignan ) for new born girl baby, usually they will tie it to hip. Boy baby will have different design. Family/friendship Shree Krishna govind hare murari I like to move it move it A threesome, obviously? Let me guess, it's a metal... Sachin was their God I guess Oh wow, thank you. It represents don't sit on my airpods Polygamy?? Take a shit while squatting So this is really where the airpods design were stolen from Didn't see anything, what ? i dont know what it represents. but would you sell it for 1 lakh rupees? Boss. Thoda adjust... Indian style Can someone pin this comment or something, because half the Indian reddit wouldn't believe that this comment is upvoted on r India. It’s the locket that produces the Alibaba djinn. Try rubbing it I’ll admit, I have rubbed the tummy a few times 🤭 Threesome i guess!!!!? Threesome?? Looks like what we call \"Siggubilla\" in Telugu. Used to cover the genitals of toddlers That is so cute 😊 sorry, normal mom response ☺️ It's typical to South India (maybe other cultures have it as well) but you don't see them often these days. A black thread or one made with silver is tied around the toddlers waist/hip and the \"Siggu Billa\" hangs by it covering the genitals. Quite useful during hot summers when toddlers like to be naked. My 2 year old has one that belonged to my great grand mother. This is what we call Siggu Billa in Telugu. Not many use it these days though. But every family with a toddler used to have one. It hangs by the black/silver thread that is tied around the waist and covers the genitals of the otherwise naked toddler Theivame.... Unnaku yaravadhu oru award kudutha nalla irukkum. En kitta like thavira kuduka vera edhuvume illaye Thank you, I appreciate the information. That’s very cool. You're welcome. 😊 Jai shree krishna You right 😂 Sharing Auto this is"
}