{
    "id": "1awqmqs",
    "title": "Shubkaran Singh: ‘A young hard-working farmer, who fought for everyone’s rights’",
    "url": "https://indianexpress.com/article/cities/chandigarh/shubkaran-singh-young-hard-working-farmer-fought-rights-9173838/",
    "selftext": "Shubkaran and his uncle Charanjit Singh cultivated around 20 acres on contract. They also managed livestock, including a bull that the 22-year old took great pride in.",
    "flair": "Law & Courts",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1708557282.0,
    "convurl": "https://external-preview.redd.it/-DnDdMwC_11-dPpasmX5r4s_dKSwQb-EkunRZIiiRJA.jpg?auto=webp&s=d4d722dfa60113903e3f8ea2d8a4f8a6f5bc9caf",
    "comments": [
        "From the article:\n\nIT IS LATE in the evening, and villagers at Balloh, about 15 km from Rampura Phul city in Bhatinda district, await Shubkaran Singh’s body, outside his home.\n\nA hard-working young farmer, engaged in contract farming, and trying to make ends meet, is how close friend Pala describes Shubkaran.\n\nShubkaran and his uncle Charanjit Singh cultivated around 20 acres on contract. They also managed livestock, including a bull that the 22-year old took great pride in. He quit studies before completing his Standard 12, and immersed himself in farming, aspiring to be a successful farmer.\n\nRaised by his grandfather after his parents’ divorce, Shubkaran assumed the responsibility of the family, which included two sisters. His grandmother passed away about six years ago. With no contact with his mother and a father who does not keep well, he took charge.\n\nThough Shubkaran owned only two acres, the most valuable possessions at his home are agricultural implements scattered across the yard. Two manual spray pumps, and a sack of DAP (di-ammonium phosphate) fertiliser, and three bags of rice are kept in the three corners of his room.\n\nAccess to his home, situated outside the village in the fields, is not easy. Comprising three rooms and a traditional village kitchen, the home brings back memories of the Punjab of the 1990s.\n\nPointing to Shubkaran’s room, Pala, who is also a small farmer, says, “This is his room. People speak ill of Punjab’s youth, assuming they are spoiled. This was his life — a hardworking small farmer engaged in contract farming to make ends meet.”\n\nIn Shubkaran’s room, the cot at the centre displays neatly folded bed-clothes beneath a fan suspended from an old-style roof supported by wooden beams. Two pairs of boots, one for the fields, are kept behind.\n\nThe room does not have any pictures of Shubkaran; instead, there are pictures of his sister’s school group and relatives who have passed away. With his younger sister in shock, villagers attend to four buffaloes and five calves in their house.\n\nMahinder Singh, another village friend, said, “Shubkaran always stood at the forefront whenever Bhartiya Kisan Union Sidhupur called for protests or gatherings. He believed it was the responsibility of farmers to actively participate and secure their rights.”\n\nUpon hearing the news on social media, Shubkaran’s uncle Charanjit Singh left for Patiala. Another uncle Baljeet Singh who reached Rajindra Hospital Patiala, said Shubhkaran used to participate in farm agitations and had participated in the protests during the agitation against the now repealed farm laws. Shubkaran’s father Charanjit Singh, Baljeet said, worked as “a conductor in a school van which ferried school children to Pakhoke village”."
    ],
    "cleaned_text": "shubkaran singh young hardworking farmer fought everyones rights shubkaran uncle charanjit singh cultivated around acres contract also managed livestock including bull year old took great pride ",
    "cleaned_title": "shubkaran singh young hardworking farmer fought everyones rights",
    "cleaned_selftext": "shubkaran uncle charanjit singh cultivated around acres contract also managed livestock including bull year old took great pride",
    "cleaned_comments": "article late evening villagers balloh km rampura phul city bhatinda district await shubkaran singhs body outside home hardworking young farmer engaged contract farming trying make ends meet close friend pala describes shubkaran shubkaran uncle charanjit singh cultivated around acres contract also managed livestock including bull year old took great pride quit studies completing standard immersed farming aspiring successful farmer raised grandfather parents divorce shubkaran assumed responsibility family included two sisters grandmother passed away six years ago contact mother father keep well took charge though shubkaran owned two acres valuable possessions home agricultural implements scattered across yard two manual spray pumps sack dap diammonium phosphate fertiliser three bags rice kept three corners room access home situated outside village fields easy comprising three rooms traditional village kitchen home brings back memories punjab pointing shubkarans room pala also small farmer says room people speak ill punjabs youth assuming spoiled life hardworking small farmer engaged contract farming make ends meet shubkarans room cot centre displays neatly folded bedclothes beneath fan suspended oldstyle roof supported wooden beams two pairs boots one fields kept behind room pictures shubkaran instead pictures sisters school group relatives passed away younger sister shock villagers attend four buffaloes five calves house mahinder singh another village friend said shubkaran always stood forefront whenever bhartiya kisan union sidhupur called protests gatherings believed responsibility farmers actively participate secure rights upon hearing news social media shubkarans uncle charanjit singh left patiala another uncle baljeet singh reached rajindra hospital patiala said shubhkaran used participate farm agitations participated protests agitation repealed farm laws shubkarans father charanjit singh baljeet said worked conductor school van ferried school children pakhoke village",
    "light_cleaned_title": "Shubkaran Singh: ‘A young hard-working farmer, who fought for everyone’s rights’",
    "light_cleaned_selftext": "Shubkaran and his uncle Charanjit Singh cultivated around 20 acres on contract. They also managed livestock, including a bull that the 22-year old took great pride in.",
    "light_cleaned_comments": "From the article: IT IS LATE in the evening, and villagers at Balloh, about 15 km from Rampura Phul city in Bhatinda district, await Shubkaran Singh’s body, outside his home. A hard-working young farmer, engaged in contract farming, and trying to make ends meet, is how close friend Pala describes Shubkaran. Shubkaran and his uncle Charanjit Singh cultivated around 20 acres on contract. They also managed livestock, including a bull that the 22-year old took great pride in. He quit studies before completing his Standard 12, and immersed himself in farming, aspiring to be a successful farmer. Raised by his grandfather after his parents’ divorce, Shubkaran assumed the responsibility of the family, which included two sisters. His grandmother passed away about six years ago. With no contact with his mother and a father who does not keep well, he took charge. Though Shubkaran owned only two acres, the most valuable possessions at his home are agricultural implements scattered across the yard. Two manual spray pumps, and a sack of DAP (di-ammonium phosphate) fertiliser, and three bags of rice are kept in the three corners of his room. Access to his home, situated outside the village in the fields, is not easy. Comprising three rooms and a traditional village kitchen, the home brings back memories of the Punjab of the 1990s. Pointing to Shubkaran’s room, Pala, who is also a small farmer, says, “This is his room. People speak ill of Punjab’s youth, assuming they are spoiled. This was his life — a hardworking small farmer engaged in contract farming to make ends meet.” In Shubkaran’s room, the cot at the centre displays neatly folded bed-clothes beneath a fan suspended from an old-style roof supported by wooden beams. Two pairs of boots, one for the fields, are kept behind. The room does not have any pictures of Shubkaran; instead, there are pictures of his sister’s school group and relatives who have passed away. With his younger sister in shock, villagers attend to four buffaloes and five calves in their house. Mahinder Singh, another village friend, said, “Shubkaran always stood at the forefront whenever Bhartiya Kisan Union Sidhupur called for protests or gatherings. He believed it was the responsibility of farmers to actively participate and secure their rights.” Upon hearing the news on social media, Shubkaran’s uncle Charanjit Singh left for Patiala. Another uncle Baljeet Singh who reached Rajindra Hospital Patiala, said Shubhkaran used to participate in farm agitations and had participated in the protests during the agitation against the now repealed farm laws. Shubkaran’s father Charanjit Singh, Baljeet said, worked as “a conductor in a school van which ferried school children to Pakhoke village”."
}