{
    "id": "1egkcp6",
    "title": "Capitalism 101: WazirX trying to socialise losses to even those users whose wallets were not stolen.",
    "url": "https://i.redd.it/1hovx6af6ufd1.png",
    "selftext": "\"fair\" and \"transparent\" to socialize the losses after getting hacked due to their incompetency and losing 230 millions dollars of investors money.",
    "flair": "Crime",
    "score": 68,
    "num_comments": 17,
    "created_utc": 1722423850.0,
    "convurl": "https://i.redd.it/1hovx6af6ufd1.png",
    "comments": [
        "It's popcorn time. I don't think they have the money to fund these losses. Hence we all loose.",
        "While the executives pay themselves enormous amounts when a company earns, they should also be put in jail for failing to refund losses made by their company's mistake.",
        "Crypto is a scam, do not invest in crypto",
        "I do not, that is why it is important to expose these scams when they happen.",
        "https://preview.redd.it/d85ujijghufd1.jpeg?width=1038&format=pjpg&auto=webp&s=9f8daa0a60821d2c69036daf242b759a1896d053",
        "Why not socialise the profits too? If any users make a killing in trading crypto, spread the profit among all users? \n\nThis is just another reason why crypto sucks as of today: no regulation and no rules, apart from it being all just speculatory.",
        "Technically this is an example of Communism 101",
        "Lmao, here we have IQ -101",
        "In Communism, profits and losses both are socialized. In Capitalism, only losses are.",
        "Capitalism for Profits, Socialism for Losses\n\nThat my bois is Capitalism...",
        "Its the exchanges that are scams not crypto itself. Learn something about Blockchain Tech",
        "When it comes to profit everyone is a capitalist. \nWhen it comes to loss everyone is a socialist.",
        "Is there any official owner to WazirX?",
        "They should distribute equity from promoter share",
        "Nischal Shetty, founder and CEO.",
        "While that is true, crypto as a currency is not viable unless those in power i.e. governments implement it which they will never."
    ],
    "cleaned_text": "capitalism wazirx trying socialise losses even users whose wallets stolen fair transparent socialize losses getting hacked due incompetency losing millions dollars investors money ",
    "cleaned_title": "capitalism wazirx trying socialise losses even users whose wallets stolen",
    "cleaned_selftext": "fair transparent socialize losses getting hacked due incompetency losing millions dollars investors money",
    "cleaned_comments": "popcorn time dont think money fund losses hence loose executives pay enormous amounts company earns also put jail failing refund losses made companys mistake crypto scam invest crypto important expose scams happen socialise profits users make killing trading crypto spread profit among users another reason crypto sucks today regulation rules apart speculatory technically example communism lmao iq communism profits losses socialized capitalism losses capitalism profits socialism losses bois capitalism exchanges scams crypto learn something blockchain tech comes profit everyone capitalist comes loss everyone socialist official owner wazirx distribute equity promoter share nischal shetty founder ceo true crypto currency viable unless power ie governments implement never",
    "light_cleaned_title": "Capitalism 101: WazirX trying to socialise losses to even those users whose wallets were not stolen.",
    "light_cleaned_selftext": "\"fair\" and \"transparent\" to socialize the losses after getting hacked due to their incompetency and losing 230 millions dollars of investors money.",
    "light_cleaned_comments": "It's popcorn time. I don't think they have the money to fund these losses. Hence we all loose. While the executives pay themselves enormous amounts when a company earns, they should also be put in jail for failing to refund losses made by their company's mistake. Crypto is a scam, do not invest in crypto I do not, that is why it is important to expose these scams when they happen. Why not socialise the profits too? If any users make a killing in trading crypto, spread the profit among all users? This is just another reason why crypto sucks as of today: no regulation and no rules, apart from it being all just speculatory. Technically this is an example of Communism 101 Lmao, here we have IQ -101 In Communism, profits and losses both are socialized. In Capitalism, only losses are. Capitalism for Profits, Socialism for Losses That my bois is Capitalism... Its the exchanges that are scams not crypto itself. Learn something about Blockchain Tech When it comes to profit everyone is a capitalist. When it comes to loss everyone is a socialist. Is there any official owner to WazirX? They should distribute equity from promoter share Nischal Shetty, founder and CEO. While that is true, crypto as a currency is not viable unless those in power i.e. governments implement it which they will never."
}