{
    "id": "1anmkpq",
    "title": "This twitter account incites mob harrassment and still is running without consequences",
    "url": "https://www.reddit.com/r/india/comments/1anmkpq/this_twitter_account_incites_mob_harrassment_and/",
    "selftext": "[https://twitter.com/randomsena](https://twitter.com/randomsena)\n\nThis twitter account (also with a whatsapp group chat) does mass reporting and mass email-bombing (also known as harrassment) against any minor dissent expressed against RSS or BJP. Some are against people for making fun of gods (which ofc is wrong. But no need to incite harrassment on them na?) But good god why do you need to attack people for speaking against your favourite political party? And they get butthurt for even minor jokes\n\nAn example of how they harrass: [https://twitter.com/randomsena/status/1693865418702884992](https://twitter.com/randomsena/status/1693865418702884992)\n\n[https://twitter.com/randomsena/status/1699828303551689136](https://twitter.com/randomsena/status/1699828303551689136)\n\nJust doing a rabid mob attack on anyone is just not ok. Idk how they've been running for this long.\n\n  \n",
    "flair": "Crime",
    "score": 46,
    "num_comments": 9,
    "created_utc": 1707589017.0,
    "convurl": "https://external-preview.redd.it/ifujEP2B0C9Xk1l5DRHOGqxeNNPVl1BftSIfuoVQhDY.jpg?auto=webp&s=c6dfbe1fa38bf687634de2d96520d779bf3a0b6b",
    "comments": [
        "That's regular Twitter policy to suck up to the govt in power. Because power and money rules.",
        "Chutye wo sirf religion pe bolne walo ko harassment karte hai",
        "Lol. He thinks he can police the internet. He is only going after publicly identifiable a/cs. Someone send him to 4chan.",
        "In the ocean of the internet, chaddi randomsena feels so proud after policing over a drop.",
        "More like randuasena",
        "How's that ok? Chutye",
        "So, basically another one of  your fellow Incel losers with too much free time on their hands and nobody willing to respond to their desperate pleas for sexting.",
        "Many foreigners even some indians talks shit about our country. How many times he have gone behind them?",
        "They harrassed a woman for making a reel saying that she's sunkissed and \"naughty sun\" because soorya dev ki bezatti hui. Bhonduram bolne me Ram ke bezatti hui bhale hi khud Mastram roj rat ko dekhta ho. Agar nam me Ram laga hai to respect dena jaruri hai? Kya ye fir Nathuram ki tareef karega? Jhandu keyboard warrior sala"
    ],
    "cleaned_text": "twitter account incites mob harrassment still running without consequences httpstwittercomrandomsenahttpstwittercomrandomsena twitter account also whatsapp group chat mass reporting mass emailbombing also known harrassment minor dissent expressed rss bjp people making fun gods ofc wrong need incite harrassment na good god need attack people speaking favourite political party get butthurt even minor jokes example harrass httpstwittercomrandomsenastatushttpstwittercomrandomsenastatus httpstwittercomrandomsenastatushttpstwittercomrandomsenastatus rabid mob attack anyone ok idk theyve running long ",
    "cleaned_title": "twitter account incites mob harrassment still running without consequences",
    "cleaned_selftext": "httpstwittercomrandomsenahttpstwittercomrandomsena twitter account also whatsapp group chat mass reporting mass emailbombing also known harrassment minor dissent expressed rss bjp people making fun gods ofc wrong need incite harrassment na good god need attack people speaking favourite political party get butthurt even minor jokes example harrass httpstwittercomrandomsenastatushttpstwittercomrandomsenastatus httpstwittercomrandomsenastatushttpstwittercomrandomsenastatus rabid mob attack anyone ok idk theyve running long",
    "cleaned_comments": "thats regular twitter policy suck govt power power money rules chutye wo sirf religion pe bolne walo ko harassment karte hai lol thinks police internet going publicly identifiable acs someone send chan ocean internet chaddi randomsena feels proud policing drop like randuasena hows ok chutye basically another one fellow incel losers much free time hands nobody willing respond desperate pleas sexting many foreigners even indians talks shit country many times gone behind harrassed woman making reel saying shes sunkissed naughty sun soorya dev ki bezatti hui bhonduram bolne ram ke bezatti hui bhale hi khud mastram roj rat ko dekhta ho agar nam ram laga hai respect dena jaruri hai kya ye fir nathuram ki tareef karega jhandu keyboard warrior sala",
    "light_cleaned_title": "This twitter account incites mob harrassment and still is running without consequences",
    "light_cleaned_selftext": "[https://twitter.com/randomsena](https://twitter.com/randomsena) This twitter account (also with a whatsapp group chat) does mass reporting and mass email-bombing (also known as harrassment) against any minor dissent expressed against RSS or BJP. Some are against people for making fun of gods (which ofc is wrong. But no need to incite harrassment on them na?) But good god why do you need to attack people for speaking against your favourite political party? And they get butthurt for even minor jokes An example of how they harrass: [https://twitter.com/randomsena/status/1693865418702884992](https://twitter.com/randomsena/status/1693865418702884992) [https://twitter.com/randomsena/status/1699828303551689136](https://twitter.com/randomsena/status/1699828303551689136) Just doing a rabid mob attack on anyone is just not ok. Idk how they've been running for this long.",
    "light_cleaned_comments": "That's regular Twitter policy to suck up to the govt in power. Because power and money rules. Chutye wo sirf religion pe bolne walo ko harassment karte hai Lol. He thinks he can police the internet. He is only going after publicly identifiable a/cs. Someone send him to 4chan. In the ocean of the internet, chaddi randomsena feels so proud after policing over a drop. More like randuasena How's that ok? Chutye So, basically another one of your fellow Incel losers with too much free time on their hands and nobody willing to respond to their desperate pleas for sexting. Many foreigners even some indians talks shit about our country. How many times he have gone behind them? They harrassed a woman for making a reel saying that she's sunkissed and \"naughty sun\" because soorya dev ki bezatti hui. Bhonduram bolne me Ram ke bezatti hui bhale hi khud Mastram roj rat ko dekhta ho. Agar nam me Ram laga hai to respect dena jaruri hai? Kya ye fir Nathuram ki tareef karega? Jhandu keyboard warrior sala"
}