{
    "id": "o81353",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/o81353/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 49,
    "num_comments": 91,
    "created_utc": 1624671019,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Has anyone seen Grahan on Hotstar? Will it make a good weekend binge?",
        "Watched 'Winter Sleep', a turkish film, not for everyone because it is mostly Talk, but the Talk😘",
        "what are good podcast on Indian history?",
        "I started watching Batman animated series yesterday.",
        "For me eveery other week is a Robocop Marathon.. nd not the recent one.. The OG trilogy with extreme violence, sell out media and corrupt corporation and government.. Makes me realize damn those movies are relevant...",
        "I liked one called \" Echoes of India\" by Anirudh kanisetty. Doesn't restrict indian history to Delhi history and is passionately narrated. Available on spotify",
        "I am watching RAY in Netflix. They have given really good modern treatment to those Satyajit ray's short stories plus acting of manoj Bajpayee, kay Kay Menon is great.",
        "I finished watching _Paatal Lok_ a few days ago. Thoroughly enjoyed it. What are some similar series or movies? Specifically enjoyed the class/religion/caste/gender commentaries and production quality.\n\n_Sherni_ was also pretty good, though less intense.",
        "I finally started Nichijou yesterday. Saw two episodes and laughed my butt off. Will resume it along with Record of Ragnarok. \n\nPlanning to watch some movies this weekend - my idea is to check out some poorly executed ones like Dinoshark or Sharkanado and have a good laugh. \n\nAlso, I'm absolutely thrilled for Sunday since we're getting either a PV or some more information on the Chainsaw Man anime.",
        "I really enjoyed early Elite seasons. Just can't get myself into the latest season",
        "That is one of the psychologically darkest, dingiest tv shows I have ever watched and I fuckin loved it too. \n\nMade the mistake of watching episode 3 while eating food lol.",
        "Same here",
        "But Troy is rated only 3.8 on IMDB\n\nhttps://www.imdb.com/title/tt5103758/",
        "Watching Sopranos, finished Season 3, will start Season 4 now.\n\nHad put if off for a long time, but it was worth the wait. Everyone must watch this series, atleast once. Great cast, acting, story. Still feels relevant in 2021.\n\nHelpful links for those wanting to watch:\n\n[Imdb link](https://www.imdb.com/title/tt0141842/)\n\n[Hotstar link](https://www.hotstar.com/12250)",
        "[Found the link you been looking for](https://www.youtube.com/watch?v=HPk-VhRjNI8&amp;list=PL3KnTfyhrIlcudeMemKd6rZFGDWyK23vx)",
        "I love Nuri Bilge Ceylan’s work! If you haven’t already, check out “Once Upon A Time in Anatolia” and “The Wild Pear Tree”.",
        "The Little Prince. Animated movie, released a few years ago.",
        "Recently finished 'Bodyguard', now started 'Vagabond'.",
        "I plan to watch 'once upon a time in anatolia' tomorrow, I love this kind of films.",
        "Is it about his movies or his life?",
        "It is based on his 4 short stories.",
        "Watch stranger things and inception",
        "If you like nichijou then try grand blue and dansi kokousei no nichijou.\n\nRecord of Ragnarok is on another level.",
        "Yup. Beautifully shown the story.",
        "_Sherni_ is a great take on the Indian \"system\". The scene where the &gt;!villagers burn the Forest Department jeep!&lt; was a wonderful commentary on the mentality of our public.",
        "World on a Wire (1973) by Rainer Werner Fassbinder\n\nProbably the best German scifi you'll ever see. Personally prefer it over the Matrix.\n\nOliver Twist (1948) by David Lean\n\nIf you ever wanted to know which movie adaptation closely followed its source material, this is it. And it's fantastic.",
        "Ah, a fellow Ceylan fan!",
        "Patriot (2015-18) created by Steve Conrad of Pursuit of Happiness and Walter Mitty fame.\nA show about an undercover intelligence officer working in a piping company..the best dark comedy series I've ever seen. The show rarely has funny lines or such but makes you laugh off situational comedy which more often than not consists people of Just being quiet. One of the best shows I've seen in the comedy genre.",
        "He also does history episodes on ‘All Things Policy’ every Friday. Terrific podcast.",
        "I'm definitely gonna check Grand Blue out. I've seen clips and had a great time with them. Is the other one 'Daily Lives of high school boys'?\n\nAnd yes, RoR is INSANE. I cried so much when &gt;! Heracles died !&lt;",
        "yes daily lives of high school boys. It is a must watch.\n\nIn ROR anime they just went upto 3rd fight.",
        "Watched Aparajito",
        "Yeah, I'm reading the manga for RoR. And thank you for the recommendations. I am so sorry if I spoiled RoR for you. 🙈",
        "I am uptodate with ROR. So not spoiled.\n\nBtw noticed you username. Happy to find another fellow gintama fan.",
        "Ahh, thanks heavens! Haha. I should be up to date with the manga soon as well. And yes, yaay, I'm glad to find a fellow Gintama fan as well. &lt;3",
        "Seinfeld",
        "\"World's Most Wanted\" is an interesting docu- series available on Netflix.",
        "Whart are some must listen / top podcasts mainly focusing on India content? Not specific to any genre. I really link The seen and the unseen hosted by Amit Verma, capitalmind podcast, PCCI podcast. Just added Echoes of India and all things policy.",
        "Watched Grahan on hostar - pretty bold attempt.\n\nRam Prasad ki Tehrvi on Netflix is an amazing movie.",
        "Asur: Welcome to Your Dark Side  is kinda similar .",
        "Watching To Your Eternity (a philosophical look at life from the point of view of an immortal observer). It's existential and thought provoking and beautifully animated.",
        "yeah watched grahan yesterday, it is quite good",
        "Isn't Dark the best German SciFi?",
        "Binge watched Lupin season 2 on Netflix. Doesn't live upto s1 but nevertheless a good watch.",
        "Highly recommend the Swedish film 'Another Round', esp if you've been feeling jaded lately.",
        "Saw Watchmen TV series, Boardwalk Empire, Mare of Easttown and a re-watch of The Wire during covid second wave.\n\nAll highly recommended!\n\nRay on Netflix is a mixed bag. Enjoyed the Ali Fazal and Manoj Bajpayee stories but rest were meh.\n\nJoji on Prime is quite good. So is Pagglait.",
        "Started watching Tehran on apple tv. It's good.",
        "It's Danish.",
        "Lol, not even close. It is way too much overrated",
        "Genre-- Conspiracy theories , mysteries etc. \n\nPlease recommend some good documentaries,podcasts or whatever related to the above.\n\n&gt;!Kisi ney infowars bola toh gand faad dunga bc!&lt;",
        "You're talking about the anime, right?",
        "Yes.",
        "The Seen and the Unseen is clearly the best we have in India. NL Hafta is close second (you need to be subscriber though, but I think it's worth it). If you're a Hindi person, Kahani Suno by Sameer Goswami is also a good one.",
        "For some light hearted fun, I listen to Our Last week on Spotify. Quite nice imo.",
        "Watching Chinese drama Ancient Love Poetry. It has very good visual effect for a web drama and gods fight scenes are well done.",
        "Felt theydragged it towards the end.",
        "Is there English dubbed version?",
        "Hey bro you watch gaming?",
        "I watched Karunesh Talwar's new special on the prime. It was so much fun, I might watch it again next week.",
        "As in?",
        "I don't watch people playing on YT.",
        "Sure",
        "Ray.. Only one episode \"Hungama hai kyun barpa\" with the starcast of Manoj Bajpayee, Giriraj Rao, Manoj Pahwa and Raghubir Yadav is good. Other episodes despite of having good starcast are not so satisfying as this one..",
        "I really tried to get into this podcast with forcing myself to listen multiple episodes because I love Dan Carlin and Mike Duncan't podcasts, but I couldn't get past the background stereotypical sitar music, and cringy dialogues. I wish they would have kept it simple.",
        "watched this really weird anime called BATOOM!\n5 episode in and idk how i feel, its entertaining though",
        "I recommend Barry And Mr In-between which share a lot of similarities with patriot.",
        "Google: Zeitgeist: The Movie (2007)",
        "YouTubers :  \n\\&gt; Lemmino (would suggest starting with his DB Cooper video)  \n\\&gt; Nexpo  \n\\&gt; Barely Sociable  \n\\&gt; Down the Rabbit hole (Fredrik Knudsen)  \n\\&gt; Blameitonjorge  \n\\&gt; Dark Matters  \n\\&gt; ReignBot  \n\\&gt; Kendall Rae\n\nTV Show:  \n\\&gt; X-Files (Fiction)  \n\\&gt; Project Blue Book (fiction)  \n\\&gt; Mr. Robot (Fiction)  \n\\&gt; The wire (fiction)  \n\\&gt; Black Mirror (fiction)  \n\\&gt; Mind Hunter (fiction)  \n\\&gt; People Magazine Investigates (True Crime)  \n\\&gt; Forensic Files (True Crime)\n\nPodcasts:  \n\\&gt; Project Nova  \n\\&gt; BBC Tracks  \n\\&gt; Last podcast on the left  \n\\&gt; Blood Culture  \n\\&gt; Unexplained Mysteries (Parcast)\n\nMovies:  \n\\&gt; The Zodiac  \n\\&gt; Marathon Man  \n\\&gt; The Adjustment Bureau  \n\\&gt; The Parallax View  \n\\&gt; Fight Club  \n\\&gt; V for Vendetta  \n\\&gt; Zeitgeist: The Movie  \n\\&gt; The Truman Show\n\nAnd ofc, the best of them all, Infowars :)",
        "Where did you watch it. I couldn't find it on prime or netflix.",
        "anyone watching/watched Loki :)",
        "Themks 😚😚\n\n&gt;!Gand Faad Dunga!&lt;",
        "Me 👽... The story's really good.",
        "Matribhumi",
        "I've just begun Boardwalk Empire, currently towards end of S1 and have found it a bit slow . I've enjoyed The Wire, Narcos and other crime based series so hoping the same for this.",
        "George likes his chicken spicy 🔥",
        "It is slow paced but definitely worth it. S2 and S3 are excellent.",
        "Insidious is pretty interesting but only the first one after that I feel like it gets boring and repetitive",
        "Blackmirror se zyada emotionally disturbing aur kuch nahi",
        "Watched Raiders of the lost Ark again. Such a perfect movie! Most of today's action movies aren't half as engaging as Raiders",
        "Have seen Barry..will have to watch Mr inbetween.. thankss",
        "Have to say, the opening theme is pretty dope, this was my first battle royale'ish show in any medium when I watched it 5-6 years back, I enjoyed it a lot but sadly it never got adapted further",
        "I was on a roll watching Korean movies once\n\nWatched oldboy, I saw the devil, memories of the murder, few more I think don't remember the names though\n\nStacked weekend I have to say",
        "I would suggest watching\n\nAsobi asobase \n\nHinamatsuri \nAs well, very fun 1 cour shows",
        "I've seen Asobi Asobase. I died laughing watching that as well. I've to check Hinamatsuri out. I'll do that soon.\n\nThanks for the recommendation! :)",
        "I would suggest people to read \n\nMetamorphosis\n\nWarning, not for the faint of the heart though",
        "Nice\n\nYou are welcome\n\nYour username suggests you must have already completed gintama minus the final movie\n\nTOSHIIII!!",
        "If you haven't read it already, I would suggest reading [Samsa falls in love](https://www.newyorker.com/magazine/2013/10/28/samsa-in-love), a short story written by Haruki Murakami and sort-of based on Metamorphosis but reverse where an insect becomes a human being.",
        "Thanks for the suggestion\n\nI'll check it out",
        "Books and Authors)The Pen that Writes\n\nWe are starting our new podcast soon.\nEp 0 and Trailer out.\n\n \n\"The Pen that Writes\" is a podcast full of conversations around the lives of authors, their aspirations, muses, and stories behind the scenes of the books. A comforting space where we'll talk to our heart's content and cherish your work. All this is accompanied by a conversation around interesting insights about lives of authors and their motivation.\n\nSpotify:https://open.spotify.com/show/5JFkVnBDapockCNOfsxhbe?si=FaylRCd4QAiPxpsuWmMP_Q&amp;utm_source=copy-link&amp;dl_branch=1\n\nCheers !"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "anyone seen grahan hotstar make good weekend binge watched winter sleep turkish film everyone mostly talk talk good podcast indian history started watching batman animated series yesterday eveery week robocop marathon nd recent one og trilogy extreme violence sell media corrupt corporation government makes realize damn movies relevant liked one called echoes india anirudh kanisetty doesnt restrict indian history delhi history passionately narrated available spotify watching ray netflix given really good modern treatment satyajit rays short stories plus acting manoj bajpayee kay kay menon great finished watching paatal lok days ago thoroughly enjoyed similar series movies specifically enjoyed classreligioncastegender commentaries production quality sherni also pretty good though less intense finally started nichijou yesterday saw two episodes laughed butt resume along record ragnarok planning watch movies weekend idea check poorly executed ones like dinoshark sharkanado good laugh also im absolutely thrilled sunday since getting either pv information chainsaw man anime really enjoyed early elite seasons cant get latest season one psychologically darkest dingiest tv shows ever watched fuckin loved made mistake watching episode eating food lol troy rated imdb watching sopranos finished season start season put long time worth wait everyone must watch series atleast great cast acting story still feels relevant helpful links wanting watch imdb linkhttpswwwimdbcomtitlett hotstar linkhttpswwwhotstarcom found link looking forhttpswwwyoutubecomwatchvhpkvhrjniamplistplkntfyhrilcudememkdrzfgdwykvx love nuri bilge ceylans work havent already check upon time anatolia wild pear tree little prince animated movie released years ago recently finished bodyguard started vagabond plan watch upon time anatolia tomorrow love kind films movies life based short stories watch stranger things inception like nichijou try grand blue dansi kokousei nichijou record ragnarok another level yup beautifully shown story sherni great take indian system scene gtvillagers burn forest department jeeplt wonderful commentary mentality public world wire rainer werner fassbinder probably best german scifi youll ever see personally prefer matrix oliver twist david lean ever wanted know movie adaptation closely followed source material fantastic ah fellow ceylan fan patriot created steve conrad pursuit happiness walter mitty fame show undercover intelligence officer working piping companythe best dark comedy series ive ever seen show rarely funny lines makes laugh situational comedy often consists people quiet one best shows ive seen comedy genre also history episodes things policy every friday terrific podcast im definitely gon na check grand blue ive seen clips great time one daily lives high school boys yes ror insane cried much gt heracles died lt yes daily lives high school boys must watch ror anime went upto rd fight watched aparajito yeah im reading manga ror thank recommendations sorry spoiled ror uptodate ror spoiled btw noticed username happy find another fellow gintama fan ahh thanks heavens haha date manga soon well yes yaay im glad find fellow gintama fan well lt seinfeld worlds wanted interesting docu series available netflix whart must listen top podcasts mainly focusing india content specific genre really link seen unseen hosted amit verma capitalmind podcast pcci podcast added echoes india things policy watched grahan hostar pretty bold attempt ram prasad ki tehrvi netflix amazing movie asur welcome dark side kinda similar watching eternity philosophical look life point view immortal observer existential thought provoking beautifully animated yeah watched grahan yesterday quite good isnt dark best german scifi binge watched lupin season netflix doesnt live upto nevertheless good watch highly recommend swedish film another round esp youve feeling jaded lately saw watchmen tv series boardwalk empire mare easttown rewatch wire covid second wave highly recommended ray netflix mixed bag enjoyed ali fazal manoj bajpayee stories rest meh joji prime quite good pagglait started watching tehran apple tv good danish lol even close way much overrated genre conspiracy theories mysteries etc please recommend good documentariespodcasts whatever related gtkisi ney infowars bola toh gand faad dunga bclt youre talking anime right yes seen unseen clearly best india nl hafta close second need subscriber though think worth youre hindi person kahani suno sameer goswami also good one light hearted fun listen last week spotify quite nice imo watching chinese drama ancient love poetry good visual effect web drama gods fight scenes well done felt theydragged towards end english dubbed version hey bro watch gaming watched karunesh talwars new special prime much fun might watch next week dont watch people playing yt sure ray one episode hungama hai kyun barpa starcast manoj bajpayee giriraj rao manoj pahwa raghubir yadav good episodes despite good starcast satisfying one really tried get podcast forcing listen multiple episodes love dan carlin mike duncant podcasts couldnt get past background stereotypical sitar music cringy dialogues wish would kept simple watched really weird anime called batoom episode idk feel entertaining though recommend barry mr inbetween share lot similarities patriot google zeitgeist movie youtubers gt lemmino would suggest starting db cooper video gt nexpo gt barely sociable gt rabbit hole fredrik knudsen gt blameitonjorge gt dark matters gt reignbot gt kendall rae tv show gt xfiles fiction gt project blue book fiction gt mr robot fiction gt wire fiction gt black mirror fiction gt mind hunter fiction gt people magazine investigates true crime gt forensic files true crime podcasts gt project nova gt bbc tracks gt last podcast left gt blood culture gt unexplained mysteries parcast movies gt zodiac gt marathon man gt adjustment bureau gt parallax view gt fight club gt v vendetta gt zeitgeist movie gt truman show ofc best infowars watch couldnt find prime netflix anyone watchingwatched loki themks gtgand faad dungalt storys really good matribhumi ive begun boardwalk empire currently towards end found bit slow ive enjoyed wire narcos crime based series hoping george likes chicken spicy slow paced definitely worth excellent insidious pretty interesting first one feel like gets boring repetitive blackmirror se zyada emotionally disturbing aur kuch nahi watched raiders lost ark perfect movie todays action movies arent half engaging raiders seen barrywill watch mr inbetween thankss say opening theme pretty dope first battle royaleish show medium watched years back enjoyed lot sadly never got adapted roll watching korean movies watched oldboy saw devil memories murder think dont remember names though stacked weekend say would suggest watching asobi asobase hinamatsuri well fun cour shows ive seen asobi asobase died laughing watching well ive check hinamatsuri ill soon thanks recommendation would suggest people read metamorphosis warning faint heart though nice welcome username suggests must already completed gintama minus final movie toshiiii havent read already would suggest reading samsa falls lovehttpswwwnewyorkercommagazinesamsainlove short story written haruki murakami sortof based metamorphosis reverse insect becomes human thanks suggestion ill check books authorsthe pen writes starting new podcast soon ep trailer pen writes podcast full conversations around lives authors aspirations muses stories behind scenes books comforting space well talk hearts content cherish work accompanied conversation around interesting insights lives authors motivation spotifyhttpsopenspotifycomshowjfkvnbdapockcnofsxhbesifaylrcdqaipxpsuwmmpqamputmsourcecopylinkampdlbranch cheers",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Has anyone seen Grahan on Hotstar? Will it make a good weekend binge? Watched 'Winter Sleep', a turkish film, not for everyone because it is mostly Talk, but the Talk😘 what are good podcast on Indian history? I started watching Batman animated series yesterday. For me eveery other week is a Robocop Marathon.. nd not the recent one.. The OG trilogy with extreme violence, sell out media and corrupt corporation and government.. Makes me realize damn those movies are relevant... I liked one called \" Echoes of India\" by Anirudh kanisetty. Doesn't restrict indian history to Delhi history and is passionately narrated. Available on spotify I am watching RAY in Netflix. They have given really good modern treatment to those Satyajit ray's short stories plus acting of manoj Bajpayee, kay Kay Menon is great. I finished watching _Paatal Lok_ a few days ago. Thoroughly enjoyed it. What are some similar series or movies? Specifically enjoyed the class/religion/caste/gender commentaries and production quality. _Sherni_ was also pretty good, though less intense. I finally started Nichijou yesterday. Saw two episodes and laughed my butt off. Will resume it along with Record of Ragnarok. Planning to watch some movies this weekend - my idea is to check out some poorly executed ones like Dinoshark or Sharkanado and have a good laugh. Also, I'm absolutely thrilled for Sunday since we're getting either a PV or some more information on the Chainsaw Man anime. I really enjoyed early Elite seasons. Just can't get myself into the latest season That is one of the psychologically darkest, dingiest tv shows I have ever watched and I fuckin loved it too. Made the mistake of watching episode 3 while eating food lol. Same here But Troy is rated only 3.8 on IMDB Watching Sopranos, finished Season 3, will start Season 4 now. Had put if off for a long time, but it was worth the wait. Everyone must watch this series, atleast once. Great cast, acting, story. Still feels relevant in 2021. Helpful links for those wanting to watch: [Imdb link](https://www.imdb.com/title/tt0141842/) [Hotstar link](https://www.hotstar.com/12250) [Found the link you been looking for](https://www.youtube.com/watch?v=HPk-VhRjNI8&amp;list=PL3KnTfyhrIlcudeMemKd6rZFGDWyK23vx) I love Nuri Bilge Ceylan’s work! If you haven’t already, check out “Once Upon A Time in Anatolia” and “The Wild Pear Tree”. The Little Prince. Animated movie, released a few years ago. Recently finished 'Bodyguard', now started 'Vagabond'. I plan to watch 'once upon a time in anatolia' tomorrow, I love this kind of films. Is it about his movies or his life? It is based on his 4 short stories. Watch stranger things and inception If you like nichijou then try grand blue and dansi kokousei no nichijou. Record of Ragnarok is on another level. Yup. Beautifully shown the story. _Sherni_ is a great take on the Indian \"system\". The scene where the &gt;!villagers burn the Forest Department jeep!&lt; was a wonderful commentary on the mentality of our public. World on a Wire (1973) by Rainer Werner Fassbinder Probably the best German scifi you'll ever see. Personally prefer it over the Matrix. Oliver Twist (1948) by David Lean If you ever wanted to know which movie adaptation closely followed its source material, this is it. And it's fantastic. Ah, a fellow Ceylan fan! Patriot (2015-18) created by Steve Conrad of Pursuit of Happiness and Walter Mitty fame. A show about an undercover intelligence officer working in a piping company..the best dark comedy series I've ever seen. The show rarely has funny lines or such but makes you laugh off situational comedy which more often than not consists people of Just being quiet. One of the best shows I've seen in the comedy genre. He also does history episodes on ‘All Things Policy’ every Friday. Terrific podcast. I'm definitely gonna check Grand Blue out. I've seen clips and had a great time with them. Is the other one 'Daily Lives of high school boys'? And yes, RoR is INSANE. I cried so much when &gt;! Heracles died !&lt; yes daily lives of high school boys. It is a must watch. In ROR anime they just went upto 3rd fight. Watched Aparajito Yeah, I'm reading the manga for RoR. And thank you for the recommendations. I am so sorry if I spoiled RoR for you. 🙈 I am uptodate with ROR. So not spoiled. Btw noticed you username. Happy to find another fellow gintama fan. Ahh, thanks heavens! Haha. I should be up to date with the manga soon as well. And yes, yaay, I'm glad to find a fellow Gintama fan as well. &lt;3 Seinfeld \"World's Most Wanted\" is an interesting docu- series available on Netflix. Whart are some must listen / top podcasts mainly focusing on India content? Not specific to any genre. I really link The seen and the unseen hosted by Amit Verma, capitalmind podcast, PCCI podcast. Just added Echoes of India and all things policy. Watched Grahan on hostar - pretty bold attempt. Ram Prasad ki Tehrvi on Netflix is an amazing movie. Asur: Welcome to Your Dark Side is kinda similar . Watching To Your Eternity (a philosophical look at life from the point of view of an immortal observer). It's existential and thought provoking and beautifully animated. yeah watched grahan yesterday, it is quite good Isn't Dark the best German SciFi? Binge watched Lupin season 2 on Netflix. Doesn't live upto s1 but nevertheless a good watch. Highly recommend the Swedish film 'Another Round', esp if you've been feeling jaded lately. Saw Watchmen TV series, Boardwalk Empire, Mare of Easttown and a re-watch of The Wire during covid second wave. All highly recommended! Ray on Netflix is a mixed bag. Enjoyed the Ali Fazal and Manoj Bajpayee stories but rest were meh. Joji on Prime is quite good. So is Pagglait. Started watching Tehran on apple tv. It's good. It's Danish. Lol, not even close. It is way too much overrated Genre-- Conspiracy theories , mysteries etc. Please recommend some good documentaries,podcasts or whatever related to the above. &gt;!Kisi ney infowars bola toh gand faad dunga bc!&lt; You're talking about the anime, right? Yes. The Seen and the Unseen is clearly the best we have in India. NL Hafta is close second (you need to be subscriber though, but I think it's worth it). If you're a Hindi person, Kahani Suno by Sameer Goswami is also a good one. For some light hearted fun, I listen to Our Last week on Spotify. Quite nice imo. Watching Chinese drama Ancient Love Poetry. It has very good visual effect for a web drama and gods fight scenes are well done. Felt theydragged it towards the end. Is there English dubbed version? Hey bro you watch gaming? I watched Karunesh Talwar's new special on the prime. It was so much fun, I might watch it again next week. As in? I don't watch people playing on YT. Sure Ray.. Only one episode \"Hungama hai kyun barpa\" with the starcast of Manoj Bajpayee, Giriraj Rao, Manoj Pahwa and Raghubir Yadav is good. Other episodes despite of having good starcast are not so satisfying as this one.. I really tried to get into this podcast with forcing myself to listen multiple episodes because I love Dan Carlin and Mike Duncan't podcasts, but I couldn't get past the background stereotypical sitar music, and cringy dialogues. I wish they would have kept it simple. watched this really weird anime called BATOOM! 5 episode in and idk how i feel, its entertaining though I recommend Barry And Mr In-between which share a lot of similarities with patriot. Google: Zeitgeist: The Movie (2007) YouTubers : \\&gt; Lemmino (would suggest starting with his DB Cooper video) \\&gt; Nexpo \\&gt; Barely Sociable \\&gt; Down the Rabbit hole (Fredrik Knudsen) \\&gt; Blameitonjorge \\&gt; Dark Matters \\&gt; ReignBot \\&gt; Kendall Rae TV Show: \\&gt; X-Files (Fiction) \\&gt; Project Blue Book (fiction) \\&gt; Mr. Robot (Fiction) \\&gt; The wire (fiction) \\&gt; Black Mirror (fiction) \\&gt; Mind Hunter (fiction) \\&gt; People Magazine Investigates (True Crime) \\&gt; Forensic Files (True Crime) Podcasts: \\&gt; Project Nova \\&gt; BBC Tracks \\&gt; Last podcast on the left \\&gt; Blood Culture \\&gt; Unexplained Mysteries (Parcast) Movies: \\&gt; The Zodiac \\&gt; Marathon Man \\&gt; The Adjustment Bureau \\&gt; The Parallax View \\&gt; Fight Club \\&gt; V for Vendetta \\&gt; Zeitgeist: The Movie \\&gt; The Truman Show And ofc, the best of them all, Infowars :) Where did you watch it. I couldn't find it on prime or netflix. anyone watching/watched Loki :) Themks 😚😚 &gt;!Gand Faad Dunga!&lt; Me 👽... The story's really good. Matribhumi I've just begun Boardwalk Empire, currently towards end of S1 and have found it a bit slow . I've enjoyed The Wire, Narcos and other crime based series so hoping the same for this. George likes his chicken spicy 🔥 It is slow paced but definitely worth it. S2 and S3 are excellent. Insidious is pretty interesting but only the first one after that I feel like it gets boring and repetitive Blackmirror se zyada emotionally disturbing aur kuch nahi Watched Raiders of the lost Ark again. Such a perfect movie! Most of today's action movies aren't half as engaging as Raiders Have seen Barry..will have to watch Mr inbetween.. thankss Have to say, the opening theme is pretty dope, this was my first battle royale'ish show in any medium when I watched it 5-6 years back, I enjoyed it a lot but sadly it never got adapted further I was on a roll watching Korean movies once Watched oldboy, I saw the devil, memories of the murder, few more I think don't remember the names though Stacked weekend I have to say I would suggest watching Asobi asobase Hinamatsuri As well, very fun 1 cour shows I've seen Asobi Asobase. I died laughing watching that as well. I've to check Hinamatsuri out. I'll do that soon. Thanks for the recommendation! :) I would suggest people to read Metamorphosis Warning, not for the faint of the heart though Nice You are welcome Your username suggests you must have already completed gintama minus the final movie TOSHIIII!! If you haven't read it already, I would suggest reading [Samsa falls in love](https://www.newyorker.com/magazine/2013/10/28/samsa-in-love), a short story written by Haruki Murakami and sort-of based on Metamorphosis but reverse where an insect becomes a human being. Thanks for the suggestion I'll check it out Books and Authors)The Pen that Writes We are starting our new podcast soon. Ep 0 and Trailer out. \"The Pen that Writes\" is a podcast full of conversations around the lives of authors, their aspirations, muses, and stories behind the scenes of the books. A comforting space where we'll talk to our heart's content and cherish your work. All this is accompanied by a conversation around interesting insights about lives of authors and their motivation. Spotify:https://open.spotify.com/show/5JFkVnBDapockCNOfsxhbe?si=FaylRCd4QAiPxpsuWmMP_Q&amp;utm_source=copy-link&amp;dl_branch=1 Cheers !"
}