{
    "id": "1c19sry",
    "title": "Hardik Pandya cheated of INR 4.3 crore, stepbrother Vaibhav Pandya gets arrested on account of forgery",
    "url": "https://www.hindustantimes.com/cricket/hardik-pandya-cheated-of-inr-4-3-crore-stepbrother-vaibhav-pandya-gets-arrested-on-account-of-forgery-101712806091122.html",
    "selftext": "EOW arrest Hardik's step brother for increasing his profit share in their polymer business unjustly. ",
    "flair": "Crime",
    "score": 187,
    "num_comments": 10,
    "created_utc": 1712823463.0,
    "convurl": "https://external-preview.redd.it/UM4LJ2Z8o9qR9CS7Im_dMbYHSpt6uDypjdRlBoK_FQI.jpg?auto=webp&s=f99819b16cb47c561d577cf912848db97d3f79e0",
    "comments": [
        "What are you doing step bro?",
        "(step) brooo???",
        "First the booing.. and now this. Hardik is really going through a difficult period. /s",
        "So how was Florida?",
        "Hot and sticky, like my balls.",
        "I promise, just the tip, bro. /s",
        "LOL why the /s? Its true.",
        "Yeah, the Ambanis really did a number on him by making him captain and also by giving him a step bro",
        "You know the wine makes you emotional",
        "Ambanis don't make captains."
    ],
    "cleaned_text": "hardik pandya cheated inr crore stepbrother vaibhav pandya gets arrested account forgery eow arrest hardiks step brother increasing profit share polymer business unjustly ",
    "cleaned_title": "hardik pandya cheated inr crore stepbrother vaibhav pandya gets arrested account forgery",
    "cleaned_selftext": "eow arrest hardiks step brother increasing profit share polymer business unjustly",
    "cleaned_comments": "step bro step brooo first booing hardik really going difficult period florida hot sticky like balls promise tip bro lol true yeah ambanis really number making captain also giving step bro know wine makes emotional ambanis dont make captains",
    "light_cleaned_title": "Hardik Pandya cheated of INR 4.3 crore, stepbrother Vaibhav Pandya gets arrested on account of forgery",
    "light_cleaned_selftext": "EOW arrest Hardik's step brother for increasing his profit share in their polymer business unjustly.",
    "light_cleaned_comments": "What are you doing step bro? (step) brooo??? First the booing.. and now this. Hardik is really going through a difficult period. /s So how was Florida? Hot and sticky, like my balls. I promise, just the tip, bro. /s LOL why the /s? Its true. Yeah, the Ambanis really did a number on him by making him captain and also by giving him a step bro You know the wine makes you emotional Ambanis don't make captains."
}