{
    "id": "15q3sd4",
    "title": "Sridevi's death",
    "url": "https://www.reddit.com/r/india/comments/15q3sd4/sridevis_death/",
    "selftext": "Okay, okay I know this post is going to be very conspiracy-ish and definitely attract some crazies but hear me out. I don't know if its been discussed in this thread already (couldn't find anything on Google) buuut come on !! This is definitely kind of suspicious. \n\nSo for those not in the know, Sridevi was a famous Indian actress ( here's her Wiki : [Sridevi](https://en.wikipedia.org/wiki/Sridevi) ). So in 2018, she died in a hotel bathroom, with the official report declaring death due to accidental drowning caused by a sudden loss of consciousness in her hotel bathroom in Dubai. Her husband, Boney Kapoor was outside the bathroom and found her drowned in the bathtub after she didn't respond to his calls.\n\nAt first glance, there seems to be more than meets the eye. There are a lot of details that cannot be verified ( i.e she was supposedly intoxicated but the Dubai Police have not made the post mortem report public or at least I couldn't find it ), the timeline of when her husband found her and the death being reported to the police is contradictory and literally all of the sources that mention this story are news articles and also these two weird blog posts by Komal Nahta ( [1](https://komalsreviews.wordpress.com/2018/03/03/e-x-c-l-u-s-i-v-e/comment-page-2/#comments) and [2](https://komalsreviews.wordpress.com/2018/03/08/why-aamir-khans-phone-call-from-la-made-boney-kapoor-weep-like-a-child/)) that supposedly detail the husband's version of events.\n\nAll in all, this could all be the figment of an overactive imagination and watching waaay too much true crime documentaries on Youtube ***but*** is it possible that there is a cover-up that literally no one is suspicious about except for lunatics on the Internet like me ? Please let me know if I'm crazy and if you think I'm not crazy, what are your views on this ?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691945304.0,
    "convurl": "https://external-preview.redd.it/Qae9H_L1oZGmJf-H55rn-FSIVK_1cSXGIYPbdGvtYwA.jpg?auto=webp&s=69c4525b92e519b11e3c22fc91e93684eba9486d",
    "comments": [
        "Join the save ssr campaign",
        "Boney is the biggest beneficiary",
        "Don't you have anything better to do??",
        "Once my son in Germany got up  from the bathtub and felt suddenly giddy. He went to the doctor who explained that if you lie in the tub for a long time your blood pressure is lowered sufficiently and you feel giddy and you have to be more careful. Such things are taught to children in those countries, but my son, who had never seen a bathtub, did not know this.\n\nIs it possible that such a thing happened to Sridevi also ?\n\nHer own children have accepted her death as an accident and moved on, but the conspiracy keeps on.",
        "TIL",
        "The more fishy thing was Sanjay Kapoor announcing that Sridevi died of cardiac arrest. And then they changed it to death by drowning!"
    ],
    "cleaned_text": "sridevis death okay okay know post going conspiracyish definitely attract crazies hear dont know discussed thread already couldnt find anything google buuut come definitely kind suspicious know sridevi famous indian actress heres wiki sridevihttpsenwikipediaorgwikisridevi died hotel bathroom official report declaring death due accidental drowning caused sudden loss consciousness hotel bathroom dubai husband boney kapoor outside bathroom found drowned bathtub didnt respond calls first glance seems meets eye lot details verified ie supposedly intoxicated dubai police made post mortem report public least couldnt find timeline husband found death reported police contradictory literally sources mention story news articles also two weird blog posts komal nahta httpskomalsreviewswordpresscomexclusivecommentpagecomments httpskomalsreviewswordpresscomwhyaamirkhansphonecallfromlamadeboneykapoorweeplikeachild supposedly detail husbands version events could figment overactive imagination watching waaay much true crime documentaries youtube possible coverup literally one suspicious except lunatics internet like please let know im crazy think im crazy views ",
    "cleaned_title": "sridevis death",
    "cleaned_selftext": "okay okay know post going conspiracyish definitely attract crazies hear dont know discussed thread already couldnt find anything google buuut come definitely kind suspicious know sridevi famous indian actress heres wiki sridevihttpsenwikipediaorgwikisridevi died hotel bathroom official report declaring death due accidental drowning caused sudden loss consciousness hotel bathroom dubai husband boney kapoor outside bathroom found drowned bathtub didnt respond calls first glance seems meets eye lot details verified ie supposedly intoxicated dubai police made post mortem report public least couldnt find timeline husband found death reported police contradictory literally sources mention story news articles also two weird blog posts komal nahta httpskomalsreviewswordpresscomexclusivecommentpagecomments httpskomalsreviewswordpresscomwhyaamirkhansphonecallfromlamadeboneykapoorweeplikeachild supposedly detail husbands version events could figment overactive imagination watching waaay much true crime documentaries youtube possible coverup literally one suspicious except lunatics internet like please let know im crazy think im crazy views",
    "cleaned_comments": "join save ssr campaign boney biggest beneficiary dont anything better son germany got bathtub felt suddenly giddy went doctor explained lie tub long time blood pressure lowered sufficiently feel giddy careful things taught children countries son never seen bathtub know possible thing happened sridevi also children accepted death accident moved conspiracy keeps til fishy thing sanjay kapoor announcing sridevi died cardiac arrest changed death drowning",
    "light_cleaned_title": "Sridevi's death",
    "light_cleaned_selftext": "Okay, okay I know this post is going to be very conspiracy-ish and definitely attract some crazies but hear me out. I don't know if its been discussed in this thread already (couldn't find anything on Google) buuut come on !! This is definitely kind of suspicious. So for those not in the know, Sridevi was a famous Indian actress ( here's her Wiki : [Sridevi](https://en.wikipedia.org/wiki/Sridevi) ). So in 2018, she died in a hotel bathroom, with the official report declaring death due to accidental drowning caused by a sudden loss of consciousness in her hotel bathroom in Dubai. Her husband, Boney Kapoor was outside the bathroom and found her drowned in the bathtub after she didn't respond to his calls. At first glance, there seems to be more than meets the eye. There are a lot of details that cannot be verified ( i.e she was supposedly intoxicated but the Dubai Police have not made the post mortem report public or at least I couldn't find it ), the timeline of when her husband found her and the death being reported to the police is contradictory and literally all of the sources that mention this story are news articles and also these two weird blog posts by Komal Nahta ( [1](https://komalsreviews.wordpress.com/2018/03/03/e-x-c-l-u-s-i-v-e/comment-page-2/#comments) and [2](https://komalsreviews.wordpress.com/2018/03/08/why-aamir-khans-phone-call-from-la-made-boney-kapoor-weep-like-a-child/)) that supposedly detail the husband's version of events. All in all, this could all be the figment of an overactive imagination and watching waaay too much true crime documentaries on Youtube ***but*** is it possible that there is a cover-up that literally no one is suspicious about except for lunatics on the Internet like me ? Please let me know if I'm crazy and if you think I'm not crazy, what are your views on this ?",
    "light_cleaned_comments": "Join the save ssr campaign Boney is the biggest beneficiary Don't you have anything better to do?? Once my son in Germany got up from the bathtub and felt suddenly giddy. He went to the doctor who explained that if you lie in the tub for a long time your blood pressure is lowered sufficiently and you feel giddy and you have to be more careful. Such things are taught to children in those countries, but my son, who had never seen a bathtub, did not know this. Is it possible that such a thing happened to Sridevi also ? Her own children have accepted her death as an accident and moved on, but the conspiracy keeps on. TIL The more fishy thing was Sanjay Kapoor announcing that Sridevi died of cardiac arrest. And then they changed it to death by drowning!"
}