{
    "id": "1h5i2cb",
    "title": "Countries where false information is posing the biggest threat",
    "url": "https://i.redd.it/yexqg19t5l4e1.jpeg",
    "selftext": "Thank you Mudi Xi",
    "flair": "Policy/Economy",
    "score": 24,
    "num_comments": 8,
    "created_utc": 1733210883.0,
    "convurl": "https://i.redd.it/yexqg19t5l4e1.jpeg",
    "comments": [
        "Ab statista ka soros se connection nikal denge it cell vale",
        "I usually believe these statistics but US being on 11th can't be true.",
        "Who are these 1400 experts",
        "Not defending us at all but how are Russia and China with state controlled media lower than 22??",
        "China ? Russia ? Iran ? These are the biggest misinformation and propaganda countries and in the USA this election was widespread propaganda and misinformation from both the parties and media bies for Kamala Harries \nI am not saying that In India there is no propaganda or misinformation but when u compare to them I don't even think we can have any chances of standing against them in spreading misinformation or any propaganda",
        "11, if you say so.",
        "Number 1 mitron!!!",
        "Apologies. I misread. I have edited the comment."
    ],
    "cleaned_text": "countries false information posing biggest threat thank mudi xi ",
    "cleaned_title": "countries false information posing biggest threat",
    "cleaned_selftext": "thank mudi xi",
    "cleaned_comments": "ab statista ka soros se connection nikal denge cell vale usually believe statistics us th cant true experts defending us russia china state controlled media lower china russia iran biggest misinformation propaganda countries usa election widespread propaganda misinformation parties media bies kamala harries saying india propaganda misinformation u compare dont even think chances standing spreading misinformation propaganda say number mitron apologies misread edited comment",
    "light_cleaned_title": "Countries where false information is posing the biggest threat",
    "light_cleaned_selftext": "Thank you Mudi Xi",
    "light_cleaned_comments": "Ab statista ka soros se connection nikal denge it cell vale I usually believe these statistics but US being on 11th can't be true. Who are these 1400 experts Not defending us at all but how are Russia and China with state controlled media lower than 22?? China ? Russia ? Iran ? These are the biggest misinformation and propaganda countries and in the USA this election was widespread propaganda and misinformation from both the parties and media bies for Kamala Harries I am not saying that In India there is no propaganda or misinformation but when u compare to them I don't even think we can have any chances of standing against them in spreading misinformation or any propaganda 11, if you say so. Number 1 mitron!!! Apologies. I misread. I have edited the comment."
}