{
    "id": "172uc0e",
    "title": "I like Gauahar as an actor but her tweets are absolute shit",
    "url": "https://www.reddit.com/gallery/172uc0e",
    "selftext": "She only supports someone who is from peaceful community. When something wrong is done to them she will tweet so many times at the same time when Hindus or jews are killed or harmed she becomes blind and will not tweet anything. Man I used to love her during BB but now I hate her so much she will always justify anything done by Muslims.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696755000.0,
    "convurl": "https://i.redd.it/h2nevr3qzxsb1.jpg",
    "comments": [
        "Who is she and why are we even giving her space here anyway?",
        "I thought it was pretty normal for every muslim around the world to support the uncivilized warcrime committing lowlives in palestine.",
        "To say that a Muslim supporting Palestine is only about Islam, would be like saying the only reason India fought the British was because they were not Hindus.",
        "Do educate me as to why a muslim support palestine other than being about islam.",
        "Israel has blood on their hands too. Don't patronize them. Condemn the violence of all sorts. \nBefore commenting, why i am supporting hamas, know I am not. But study the history before pointing fingers. Also Fuck Hamas.",
        "Being against apartheid could be a reason.",
        "Palestine is being invaded, for me it is perfectly normal to defend them, especially because they are at war with Israel.",
        "Palestine predates Israel, duh? Palestinians were already living in Palestine when the British decided to create the State of Israel there? Palestine didn't invade a country because \"uwu we are Muslims and this should be our land because of Islam\". \n\nHow does anyone come to the conclusion that Palestine-Israel conflict is about religion is beyond me. If the British had decided to give a part of Maharashtra to some residents of America during their occupation of India, would it mean that the conflict is about Hinduism-Christianity?",
        "The world just saw yesterday how these palestinis deal with jews.",
        "People have been screaming \"free Palestine\" for decades. Maybe read up a bit about what's happening there.",
        "It's not about jews, it's about the Israeli army attacking Palestine all the time and Hamas getting the opportunity to attack Israeli people. It's a war.",
        "https://timesofindia.indiatimes.com/tv/news/hindi/gauahar-khan-slams-twitter-user-for-criticizing-different-family-laws-for-hindus-and-muslims-in-india-says-stop-inciting-hate-in-my-country/articleshow/88850446.cms"
    ],
    "cleaned_text": "like gauahar actor tweets absolute shit supports someone peaceful community something wrong done tweet many times time hindus jews killed harmed becomes blind tweet anything man used love bb hate much always justify anything done muslims ",
    "cleaned_title": "like gauahar actor tweets absolute shit",
    "cleaned_selftext": "supports someone peaceful community something wrong done tweet many times time hindus jews killed harmed becomes blind tweet anything man used love bb hate much always justify anything done muslims",
    "cleaned_comments": "even giving space anyway thought pretty normal every muslim around world support uncivilized warcrime committing lowlives palestine say muslim supporting palestine islam would like saying reason india fought british hindus educate muslim support palestine islam israel blood hands dont patronize condemn violence sorts commenting supporting hamas know study history pointing fingers also fuck hamas apartheid could reason palestine invaded perfectly normal defend especially war israel palestine predates israel duh palestinians already living palestine british decided create state israel palestine didnt invade country uwu muslims land islam anyone come conclusion palestineisrael conflict religion beyond british decided give part maharashtra residents america occupation india would mean conflict hinduismchristianity world saw yesterday palestinis deal jews people screaming free palestine decades maybe read bit whats happening jews israeli army attacking palestine time hamas getting opportunity attack israeli people war",
    "light_cleaned_title": "I like Gauahar as an actor but her tweets are absolute shit",
    "light_cleaned_selftext": "She only supports someone who is from peaceful community. When something wrong is done to them she will tweet so many times at the same time when Hindus or jews are killed or harmed she becomes blind and will not tweet anything. Man I used to love her during BB but now I hate her so much she will always justify anything done by Muslims.",
    "light_cleaned_comments": "Who is she and why are we even giving her space here anyway? I thought it was pretty normal for every muslim around the world to support the uncivilized warcrime committing lowlives in palestine. To say that a Muslim supporting Palestine is only about Islam, would be like saying the only reason India fought the British was because they were not Hindus. Do educate me as to why a muslim support palestine other than being about islam. Israel has blood on their hands too. Don't patronize them. Condemn the violence of all sorts. Before commenting, why i am supporting hamas, know I am not. But study the history before pointing fingers. Also Fuck Hamas. Being against apartheid could be a reason. Palestine is being invaded, for me it is perfectly normal to defend them, especially because they are at war with Israel. Palestine predates Israel, duh? Palestinians were already living in Palestine when the British decided to create the State of Israel there? Palestine didn't invade a country because \"uwu we are Muslims and this should be our land because of Islam\". How does anyone come to the conclusion that Palestine-Israel conflict is about religion is beyond me. If the British had decided to give a part of Maharashtra to some residents of America during their occupation of India, would it mean that the conflict is about Hinduism-Christianity? The world just saw yesterday how these palestinis deal with jews. People have been screaming \"free Palestine\" for decades. Maybe read up a bit about what's happening there. It's not about jews, it's about the Israeli army attacking Palestine all the time and Hamas getting the opportunity to attack Israeli people. It's a war."
}