{
    "id": "1cglx3i",
    "title": "Supreme Court extends stay on trial of BJP chief K Annamalai over alleged hate speech",
    "url": "https://www.newindianexpress.com/states/tamil-nadu/2024/Apr/29/supreme-court-extends-stay-on-trial-of-bjp-chief-k-annamalai-over-alleged-hate-speech",
    "selftext": "SC Bench of Justices Sanjiv Khanna and Dipankar Datta stay trial against Tamil Nadu BJP president for hate speech against a Christian NGO, when clear video evidence exists.\n\nSame bench also refuses to give bail to Arvind Kejriwal and Manish Sisodia for the Delhi Liquor Policy case, where no money trail exists. \n\nSame bench also dismisses petitioning against EVM-VVPAT matching.\n\nEarlier a bench consisting of Justices Sanjiv Khanna, M M Sundresh and Bela Trivedi also refused bail to BRS leader K Kavitha in the same case despite little reliable evidence against her.\n\nhttps://m.economictimes.com/news/politics-and-nation/why-didnt-you-file-for-bail-supreme-court-asks-arvind-kejriwal/articleshow/109704055.cms\n\nhttps://thewire.in/law/manish-sisodia-supreme-court-bail-justice-khanna\n\nhttps://www.business-standard.com/india-news/sc-refuses-bail-to-k-kavitha-in-ed-case-related-to-delhi-excise-policy-scam-124032200265_1.html\n\nhttps://www.livelaw.in/top-stories/-supreme-court-rejects-pleas-seeking-100-evm-vvpat-cross-verification-issues-directions-to-seal-symbol-loading-unit-256174",
    "flair": "Law & Courts",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1714457966.0,
    "convurl": "https://external-preview.redd.it/a511y4JHmnTCdEHLhMZbkIGjtAeO--UKBEtP5yFiL5w.jpg",
    "comments": [],
    "cleaned_text": "supreme court extends stay trial bjp chief k annamalai alleged hate speech sc bench justices sanjiv khanna dipankar datta stay trial tamil nadu bjp president hate speech christian ngo clear video evidence exists bench also refuses give bail arvind kejriwal manish sisodia delhi liquor policy case money trail exists bench also dismisses petitioning evmvvpat matching earlier bench consisting justices sanjiv khanna sundresh bela trivedi also refused bail brs leader k kavitha case despite little reliable evidence ",
    "cleaned_title": "supreme court extends stay trial bjp chief k annamalai alleged hate speech",
    "cleaned_selftext": "sc bench justices sanjiv khanna dipankar datta stay trial tamil nadu bjp president hate speech christian ngo clear video evidence exists bench also refuses give bail arvind kejriwal manish sisodia delhi liquor policy case money trail exists bench also dismisses petitioning evmvvpat matching earlier bench consisting justices sanjiv khanna sundresh bela trivedi also refused bail brs leader k kavitha case despite little reliable evidence",
    "cleaned_comments": "",
    "light_cleaned_title": "Supreme Court extends stay on trial of BJP chief K Annamalai over alleged hate speech",
    "light_cleaned_selftext": "SC Bench of Justices Sanjiv Khanna and Dipankar Datta stay trial against Tamil Nadu BJP president for hate speech against a Christian NGO, when clear video evidence exists. Same bench also refuses to give bail to Arvind Kejriwal and Manish Sisodia for the Delhi Liquor Policy case, where no money trail exists. Same bench also dismisses petitioning against EVM-VVPAT matching. Earlier a bench consisting of Justices Sanjiv Khanna, M M Sundresh and Bela Trivedi also refused bail to BRS leader K Kavitha in the same case despite little reliable evidence against her.",
    "light_cleaned_comments": ""
}