{
    "id": "15fzg7b",
    "title": "Haryana Violence Highlights: 5 Hindus Dead In Communal Clashes In Nuh And Gurugram",
    "url": "https://www.ndtv.com/india-news/nuh-live-updates-gurugram-violence-nuh-violence-haryana-violence-communal-clashes-4257396",
    "selftext": "Hindu Muslim clash in Haryana. Both sides have been attacked. Why is all of this happening so suddenly?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 36,
    "created_utc": 1690952666.0,
    "convurl": "https://external-preview.redd.it/eeKmic4AgknmcGuCMenQC6OE2jH7fqLEjdx_8j9HB9s.jpg?auto=webp&s=be754af48432aff7a1e89e05036f9dd13bd328da",
    "comments": [
        "title has been modified by op",
        "When a Muslim is killed its written in title but not in case of Hindus. Even though 4 of them were killed so",
        "Left wing subs : Muslims were killed\n\nRight wing subs : Hindus were killed\n\nNo subs : People were killed",
        "Genuine question... let's say I stopped associating with any religion ...how exactly they will portray me in news if I get killed in communal violence?",
        "My point is that what we should be concerned about is that ordinary ppl are losing their lives. The magic story they believe should be irrelevant but unfortunately it matters so much to them.\n\nAnd make no mistake, I blame both religions equally for this.",
        "One side is going to other side with guns and sword, raising derogatory slogans against them, other side defends itself with whatever they can find, stones and sticks whatever. Police and military comes in and saves the side which were attacking.\n\nSo no, both sides are not equal.",
        "Please dm me so I can show you all the videos",
        "Defend itself from what , lol. bend the facts in your favour blame the other religion ,cause yours can't do no bad.man even Muslims carry swords and use derogatory slur during Muharram you don't see Hindus killing them and burning down their houses for that.",
        "They literally went to gurgaon in their jeeps and bikes with swords and sticks and burnt multiple Muslim shops, trying to spread the communal violence.\n\nI can send you videos of them with guns and swords.",
        ">Haryana Violence Highlights: 5 Dead In Communal Clashes In Nuh And Gurugram\n\nIs the actual title of the article. Open it.",
        "And you think other side hasn't done but defended? Seriously? Your whole stance is one sided so nothing can convince you from your account",
        "They're literally going to Muslims shops on their jeeps and bikes to burn them. Did you not see the news?",
        ">No subs : People were killed\n\nOP has modified the title. The article's title reads:\n\n>Haryana Violence Highlights: 5 Dead In Communal Clashes In Nuh And Gurugram",
        "Dude they started the violence ,you expect the other side to not retaliate back .",
        "If I come to your home with guns and swords and start abusing you and attacking you and you find a stick or stone to attack me back.\n\nWho's responsible here?",
        "4 hindus ( 2 police guards ) and 1 muslim was killed. So why did u write wrong headline.",
        "But that's not what happened right? You were walking on the road shouting slogans and I decided to throw stones at you and brandish weapons. I cannot expect you to walk away. There are mistakes on both sides.",
        "Are you out of your mind? 4 Hindus and 2 police gets killed where as with gun 1 Muslim is killed? Does it even makes sense?",
        "So now suddenly more people dying from one side means other side is responsible?\n\nDo I need to remind you all the historical riots and who got blamed?",
        "Damn it's about who's being more violent!! Not who killed whom. I'm just telling you there are 2 sides and you clearly one even in your account",
        "There is no mistake, it's all pre-planned.\n\nAnd somehow some jeeps and bikes accidentally stops looking for muslims shops and accidentally burning them down in Gurgaon?",
        "Can anyone please help me explain why this is happening and why it escalated so much ?",
        "ELections coming",
        "I see one side defending itself and other side just mercilessly attacking and even burning down the shops and businesses.",
        "Don't worry someone will claim your identity to be used as a pawn.",
        "I can see who's defensive and who's attacking From the statics and article. Peace out",
        "Yeah all Muslim shops burning down in Gurgaon isn't a coincidence.",
        "2 of them are from police caught in cross fire of VHP and Muslim residents of Nuh. I am genuinely sorry for all dead, especially the two police guards. However it's tragically stupid to partaking in anything sponsored by VHP.",
        "Will check if circumcised or not",
        "OP changed the title to spread misinformation, I guess, on one of the few subs who look at things rationally....",
        "2500 inside temple were inside temple while were attacked by the mob 70 got injured init. 4 Hindus 2 police guards who were also hindus have been killed so what misinformation?",
        "Eat shit op..its life, you're either dead or alive not muslims or hindus."
    ],
    "cleaned_text": "haryana violence highlights hindus dead communal clashes nuh gurugram hindu muslim clash haryana sides attacked happening suddenly ",
    "cleaned_title": "haryana violence highlights hindus dead communal clashes nuh gurugram",
    "cleaned_selftext": "hindu muslim clash haryana sides attacked happening suddenly",
    "cleaned_comments": "title modified op muslim killed written title case hindus even though killed left wing subs muslims killed right wing subs hindus killed subs people killed genuine question lets say stopped associating religion exactly portray news get killed communal violence point concerned ordinary ppl losing lives magic story believe irrelevant unfortunately matters much make mistake blame religions equally one side going side guns sword raising derogatory slogans side defends whatever find stones sticks whatever police military comes saves side attacking sides equal please dm show videos defend lol bend facts favour blame religion cause cant badman even muslims carry swords use derogatory slur muharram dont see hindus killing burning houses literally went gurgaon jeeps bikes swords sticks burnt multiple muslim shops trying spread communal violence send videos guns swords haryana violence highlights dead communal clashes nuh gurugram actual title article open think side hasnt done defended seriously whole stance one sided nothing convince account theyre literally going muslims shops jeeps bikes burn see news subs people killed op modified title articles title reads haryana violence highlights dead communal clashes nuh gurugram dude started violence expect side retaliate back come home guns swords start abusing attacking find stick stone attack back whos responsible hindus police guards muslim killed u write wrong headline thats happened right walking road shouting slogans decided throw stones brandish weapons expect walk away mistakes sides mind hindus police gets killed gun muslim killed even makes sense suddenly people dying one side means side responsible need remind historical riots got blamed damn whos violent killed im telling sides clearly one even account mistake preplanned somehow jeeps bikes accidentally stops looking muslims shops accidentally burning gurgaon anyone please help explain happening escalated much elections coming see one side defending side mercilessly attacking even burning shops businesses dont worry someone claim identity used pawn see whos defensive whos attacking statics article peace yeah muslim shops burning gurgaon isnt coincidence police caught cross fire vhp muslim residents nuh genuinely sorry dead especially two police guards however tragically stupid partaking anything sponsored vhp check circumcised op changed title spread misinformation guess one subs look things rationally inside temple inside temple attacked mob got injured init hindus police guards also hindus killed misinformation eat shit opits life youre either dead alive muslims hindus",
    "light_cleaned_title": "Haryana Violence Highlights: 5 Hindus Dead In Communal Clashes In Nuh And Gurugram",
    "light_cleaned_selftext": "Hindu Muslim clash in Haryana. Both sides have been attacked. Why is all of this happening so suddenly?",
    "light_cleaned_comments": "title has been modified by op When a Muslim is killed its written in title but not in case of Hindus. Even though 4 of them were killed so Left wing subs : Muslims were killed Right wing subs : Hindus were killed No subs : People were killed Genuine question... let's say I stopped associating with any religion ...how exactly they will portray me in news if I get killed in communal violence? My point is that what we should be concerned about is that ordinary ppl are losing their lives. The magic story they believe should be irrelevant but unfortunately it matters so much to them. And make no mistake, I blame both religions equally for this. One side is going to other side with guns and sword, raising derogatory slogans against them, other side defends itself with whatever they can find, stones and sticks whatever. Police and military comes in and saves the side which were attacking. So no, both sides are not equal. Please dm me so I can show you all the videos Defend itself from what , lol. bend the facts in your favour blame the other religion ,cause yours can't do no bad.man even Muslims carry swords and use derogatory slur during Muharram you don't see Hindus killing them and burning down their houses for that. They literally went to gurgaon in their jeeps and bikes with swords and sticks and burnt multiple Muslim shops, trying to spread the communal violence. I can send you videos of them with guns and swords. >Haryana Violence Highlights: 5 Dead In Communal Clashes In Nuh And Gurugram Is the actual title of the article. Open it. And you think other side hasn't done but defended? Seriously? Your whole stance is one sided so nothing can convince you from your account They're literally going to Muslims shops on their jeeps and bikes to burn them. Did you not see the news? >No subs : People were killed OP has modified the title. The article's title reads: >Haryana Violence Highlights: 5 Dead In Communal Clashes In Nuh And Gurugram Dude they started the violence ,you expect the other side to not retaliate back . If I come to your home with guns and swords and start abusing you and attacking you and you find a stick or stone to attack me back. Who's responsible here? 4 hindus ( 2 police guards ) and 1 muslim was killed. So why did u write wrong headline. But that's not what happened right? You were walking on the road shouting slogans and I decided to throw stones at you and brandish weapons. I cannot expect you to walk away. There are mistakes on both sides. Are you out of your mind? 4 Hindus and 2 police gets killed where as with gun 1 Muslim is killed? Does it even makes sense? So now suddenly more people dying from one side means other side is responsible? Do I need to remind you all the historical riots and who got blamed? Damn it's about who's being more violent!! Not who killed whom. I'm just telling you there are 2 sides and you clearly one even in your account There is no mistake, it's all pre-planned. And somehow some jeeps and bikes accidentally stops looking for muslims shops and accidentally burning them down in Gurgaon? Can anyone please help me explain why this is happening and why it escalated so much ? ELections coming I see one side defending itself and other side just mercilessly attacking and even burning down the shops and businesses. Don't worry someone will claim your identity to be used as a pawn. I can see who's defensive and who's attacking From the statics and article. Peace out Yeah all Muslim shops burning down in Gurgaon isn't a coincidence. 2 of them are from police caught in cross fire of VHP and Muslim residents of Nuh. I am genuinely sorry for all dead, especially the two police guards. However it's tragically stupid to partaking in anything sponsored by VHP. Will check if circumcised or not OP changed the title to spread misinformation, I guess, on one of the few subs who look at things rationally.... 2500 inside temple were inside temple while were attacked by the mob 70 got injured init. 4 Hindus 2 police guards who were also hindus have been killed so what misinformation? Eat shit op..its life, you're either dead or alive not muslims or hindus."
}