{
    "id": "w9w7gi",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/w9w7gi/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 6,
    "created_utc": 1658971812,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "What govt jobs should I target as a BTech CSE fresher? (Excluding PSUs which hire based on GATE score)",
        "Graduated in june 2022 (btech,cse) still unemployed. I know dsa as well as familiar with dev, if you have opportunities related to software dev it would be great",
        "Skillset - Graphic Designing, Logo designs, Posters, Business Cards, T-shirt designs, getting into Ui/Ux as well\n\nPortfolio - Instagram @PrimeLogoZ / Behance - [PrimeLogoZ](https://www.behance.net/PrimeLogoZ)\n\nLocation : India\n\nContact - primedesigns3905@gmail.com / Instagram DMs, its easier : )",
        "- i am an Architect with 1 year 2 months experience \n- Looking for job as junior architect \n- preferred location: mumbai\n- Kindly dm me for my portfolio and cv. I'll mail it to you.\n\nCan join on immediate basis!",
        "You can give IES exam but it is not available for CSE branch. You can study content of branches like ECE etc. to give IES. Also you can go for UPSC Civil Services exam or state admin. services exam. If you want that your engineering knowledge should be applied in a govt. job then PSUs are the only high paying jobs where you get placed in GENCO, TRANSCO, and DISCOMs. Other than that there could be railway exams, 2nd/lower grade exams in electricity board companies, bsnl where they hire through some state/central level exam. Do search for them on Google.",
        "Will do. I knew of railways and bank exams. It's kinda difficult to find such stuff on Google for some reason"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "govt jobs target btech cse fresher excluding psus hire based gate score graduated june btechcse still unemployed know dsa well familiar dev opportunities related software dev would great skillset graphic designing logo designs posters business cards tshirt designs getting uiux well portfolio instagram primelogoz behance primelogozhttpswwwbehancenetprimelogoz location india contact primedesignsgmailcom instagram dms easier architect year months experience looking job junior architect preferred location mumbai kindly dm portfolio cv ill mail join immediate basis give ies exam available cse branch study content branches like ece etc give ies also go upsc civil services exam state admin services exam want engineering knowledge applied govt job psus high paying jobs get placed genco transco discoms could railway exams ndlower grade exams electricity board companies bsnl hire statecentral level exam search google knew railways bank exams kinda difficult find stuff google reason",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "What govt jobs should I target as a BTech CSE fresher? (Excluding PSUs which hire based on GATE score) Graduated in june 2022 (btech,cse) still unemployed. I know dsa as well as familiar with dev, if you have opportunities related to software dev it would be great Skillset - Graphic Designing, Logo designs, Posters, Business Cards, T-shirt designs, getting into Ui/Ux as well Portfolio - Instagram @PrimeLogoZ / Behance - [PrimeLogoZ](https://www.behance.net/PrimeLogoZ) Location : India Contact - primedesigns3905@gmail.com / Instagram DMs, its easier : ) - i am an Architect with 1 year 2 months experience - Looking for job as junior architect - preferred location: mumbai - Kindly dm me for my portfolio and cv. I'll mail it to you. Can join on immediate basis! You can give IES exam but it is not available for CSE branch. You can study content of branches like ECE etc. to give IES. Also you can go for UPSC Civil Services exam or state admin. services exam. If you want that your engineering knowledge should be applied in a govt. job then PSUs are the only high paying jobs where you get placed in GENCO, TRANSCO, and DISCOMs. Other than that there could be railway exams, 2nd/lower grade exams in electricity board companies, bsnl where they hire through some state/central level exam. Do search for them on Google. Will do. I knew of railways and bank exams. It's kinda difficult to find such stuff on Google for some reason"
}