{
    "id": "15jlp92",
    "title": "The \"Half Day\" youtube video featuring Navin Polishetty has not aged well",
    "url": "https://www.reddit.com/r/india/comments/15jlp92/the_half_day_youtube_video_featuring_navin/",
    "selftext": " Video link: [https://www.youtube.com/watch?v=9bvcyGyzj7Y](https://www.youtube.com/watch?v=9bvcyGyzj7Y)\n\nThis is just my opinion. Apologies if it offends you.\n\nThe video enforces the idea that working 9 hours with full dedication is best practice and working more than that is \"keyboard ke saath hilaya\". \n\n  \nHowever, this does not apply to the real world for all the employees. Some employees have to work like 12 hours a day to make sure that their job does not end in jeopardy. They are forced to \"work hard\". In these mass layoff times, even having a job is a blessing and that is why employees are forced to be corporate slaves. \n\n  \nI am one of those rare people who disagrees with some parts of the video because it totally makes fun of employees who are genuinely hardworking because they have no other choice. If they raise their voice, there is a chance of getting fired. Nowadays if there is no offer on hand, it is unwise to resign from a company just because your workload is high (9+ hours). I've seen people on LinkedIn who have been jobless from more than 6 months because the job market is that bad.\n\nI wanted to share this opinion because I was on a rough phase of my work life (Manual QA) and saw that clip at the worst time. I have to work 10+ hours because we have resource crunch. The video almost made me give resignation. Before clicking on \"send\" I called one of my best friends and she said, \"Layoffs ka zamana hai, chupchap kaam kar. The company does not need you, you need the company. Tera replacement laane inhe kuch bhi time nahi lagega. Tere jaise job ke liye aaj bhi koi taras raha hoga. \" \n\nThen I thought, how many people are dependant on me and chupchap se resignation mail delete kar diya. Started improving my skillset and will not switch until I have an offer on hand.\n\nJust wanted to tell that the above video can end up influencing you the wrong way. I won't say stay in the same company and work 9+ hours forever. If your company makes you work outside of working hours, just work on improving your skills, get an offer and get the fuck out of there.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691315478.0,
    "convurl": "https://external-preview.redd.it/ggs2SKSJ348thw_HXFrArDp7AZIUa4xVhbSVR-ntZWw.jpg?auto=webp&amp;s=70d0ce36bac52e4c6a230492abe6514029c620b9",
    "comments": [
        "This whole thing of “Tera replacement lena kaafi time lagega” is bullshit if you are actually good at your job. \n\nIt’ll take them easily up to 2-3 months to find a right replacement and another 3-4 months to get that employee to the level where you are at. \n\nOnly a manager who never worked on staffing/recruitment will think you’re a disposable resource.",
        "The fact that \"some\" (if not all) employees have to work 12 hours (or more) is a clear indication that there is sufficient work to hire more employees, but instead of doing that, the company is using the \"these are mass layoff times\" excuse as a garb to exploit existing employees and extract more work from them for free. \n\nI agree that these are hard times to resign, but I hope you realize that they are exploiting you.\n\nMy apologies if it offends people like you, but if you ever become content with or apathetic to getting exploited like this, you are also contributing to joblessness.\n\nWhy will a company pay salary to three employees (say) if they can extract the same amount of work from just two or less employees without paying them an overtime salary? \n\nThis exploitation has to end! By legislation. Right now!"
    ],
    "cleaned_text": "half day youtube video featuring navin polishetty aged well video link httpswwwyoutubecomwatchvbvcygyzjyhttpswwwyoutubecomwatchvbvcygyzjy opinion apologies offends video enforces idea working hours full dedication best practice working keyboard ke saath hilaya however apply real world employees employees work like hours day make sure job end jeopardy forced work hard mass layoff times even job blessing employees forced corporate slaves one rare people disagrees parts video totally makes fun employees genuinely hardworking choice raise voice chance getting fired nowadays offer hand unwise resign company workload high hours ive seen people linkedin jobless months job market bad wanted share opinion rough phase work life manual qa saw clip worst time work hours resource crunch video almost made give resignation clicking send called one best friends said layoffs ka zamana hai chupchap kaam kar company need need company tera replacement laane inhe kuch bhi time nahi lagega tere jaise job ke liye aaj bhi koi taras raha hoga thought many people dependant chupchap se resignation mail delete kar diya started improving skillset switch offer hand wanted tell video end influencing wrong way wont say stay company work hours forever company makes work outside working hours work improving skills get offer get fuck ",
    "cleaned_title": "half day youtube video featuring navin polishetty aged well",
    "cleaned_selftext": "video link httpswwwyoutubecomwatchvbvcygyzjyhttpswwwyoutubecomwatchvbvcygyzjy opinion apologies offends video enforces idea working hours full dedication best practice working keyboard ke saath hilaya however apply real world employees employees work like hours day make sure job end jeopardy forced work hard mass layoff times even job blessing employees forced corporate slaves one rare people disagrees parts video totally makes fun employees genuinely hardworking choice raise voice chance getting fired nowadays offer hand unwise resign company workload high hours ive seen people linkedin jobless months job market bad wanted share opinion rough phase work life manual qa saw clip worst time work hours resource crunch video almost made give resignation clicking send called one best friends said layoffs ka zamana hai chupchap kaam kar company need need company tera replacement laane inhe kuch bhi time nahi lagega tere jaise job ke liye aaj bhi koi taras raha hoga thought many people dependant chupchap se resignation mail delete kar diya started improving skillset switch offer hand wanted tell video end influencing wrong way wont say stay company work hours forever company makes work outside working hours work improving skills get offer get fuck",
    "cleaned_comments": "whole thing tera replacement lena kaafi time lagega bullshit actually good job itll take easily months find right replacement another months get employee level manager never worked staffingrecruitment think youre disposable resource fact employees work hours clear indication sufficient work hire employees instead company using mass layoff times excuse garb exploit existing employees extract work free agree hard times resign hope realize exploiting apologies offends people like ever become content apathetic getting exploited like also contributing joblessness company pay salary three employees say extract amount work two less employees without paying overtime salary exploitation end legislation right",
    "light_cleaned_title": "The \"Half Day\" youtube video featuring Navin Polishetty has not aged well",
    "light_cleaned_selftext": "Video link: [https://www.youtube.com/watch?v=9bvcyGyzj7Y](https://www.youtube.com/watch?v=9bvcyGyzj7Y) This is just my opinion. Apologies if it offends you. The video enforces the idea that working 9 hours with full dedication is best practice and working more than that is \"keyboard ke saath hilaya\". However, this does not apply to the real world for all the employees. Some employees have to work like 12 hours a day to make sure that their job does not end in jeopardy. They are forced to \"work hard\". In these mass layoff times, even having a job is a blessing and that is why employees are forced to be corporate slaves. I am one of those rare people who disagrees with some parts of the video because it totally makes fun of employees who are genuinely hardworking because they have no other choice. If they raise their voice, there is a chance of getting fired. Nowadays if there is no offer on hand, it is unwise to resign from a company just because your workload is high (9+ hours). I've seen people on LinkedIn who have been jobless from more than 6 months because the job market is that bad. I wanted to share this opinion because I was on a rough phase of my work life (Manual QA) and saw that clip at the worst time. I have to work 10+ hours because we have resource crunch. The video almost made me give resignation. Before clicking on \"send\" I called one of my best friends and she said, \"Layoffs ka zamana hai, chupchap kaam kar. The company does not need you, you need the company. Tera replacement laane inhe kuch bhi time nahi lagega. Tere jaise job ke liye aaj bhi koi taras raha hoga. \" Then I thought, how many people are dependant on me and chupchap se resignation mail delete kar diya. Started improving my skillset and will not switch until I have an offer on hand. Just wanted to tell that the above video can end up influencing you the wrong way. I won't say stay in the same company and work 9+ hours forever. If your company makes you work outside of working hours, just work on improving your skills, get an offer and get the fuck out of there.",
    "light_cleaned_comments": "This whole thing of “Tera replacement lena kaafi time lagega” is bullshit if you are actually good at your job. It’ll take them easily up to 2-3 months to find a right replacement and another 3-4 months to get that employee to the level where you are at. Only a manager who never worked on staffing/recruitment will think you’re a disposable resource. The fact that \"some\" (if not all) employees have to work 12 hours (or more) is a clear indication that there is sufficient work to hire more employees, but instead of doing that, the company is using the \"these are mass layoff times\" excuse as a garb to exploit existing employees and extract more work from them for free. I agree that these are hard times to resign, but I hope you realize that they are exploiting you. My apologies if it offends people like you, but if you ever become content with or apathetic to getting exploited like this, you are also contributing to joblessness. Why will a company pay salary to three employees (say) if they can extract the same amount of work from just two or less employees without paying them an overtime salary? This exploitation has to end! By legislation. Right now!"
}