{
    "id": "18c1eot",
    "title": "Lawrence Bhisnoi gang targeting Indians in Surrey, BC Canada",
    "url": "https://www.reddit.com/gallery/18c1eot",
    "selftext": "Just posted on r/surrey . People associated with Lawrence Bhisnoi are targeting Indians in Surrey and Abbotsford in Canada. Surrey has the 2nd largest Indian population in Canada after Brampton, ON",
    "flair": "Politics",
    "score": 79,
    "num_comments": 34,
    "created_utc": 1701859839.0,
    "convurl": "https://i.redd.it/4jdt4ri0nn4c1.jpg",
    "comments": [
        "* r/SurreyBC",
        "also, no way they made it in legally with that proficiency. makes you question how effective their immigration control is",
        "My eyes got hurt reading this",
        "\"Jai Sri Ram\"\n\nLawrence Bishnoi: Confirmed.",
        "*shotting*",
        "Ram ke naam pe kya kya ho ra hai !",
        "Judging by the formatting and spelling errors, its safe to conclude who this is.\n\n(Unless the faker worked hard to write a convincing letter)",
        "I would crowdsource 2 million if he promises never to write letters",
        "How much discount if I send bobs & vegene pics",
        "What filmy way of doing things",
        "Oyy ye tho babba hi ey",
        "I hope Godzilla is okay",
        "🤡",
        "Madarchod India se baahar jaake bhi gundo se azaadi nhi mil rhi",
        "Punjabi Gangs have always been very active in Surrey Area.\nNot a new thing.",
        "Godzilla pulled through, expects no stroke-inducing wordings in the future.",
        "Pqrampujya Sri Gautamdas Panauti Ji projecting soft power.",
        "Who is this? If you know please let the authorities know",
        "Yes they’re common. Like forest fires.",
        "How did these people clear IELTS?",
        "Whether it's fake or real, some Indian or Indian origin person did it. In both cases absolutely psychotic thing to do. This should help narrow it down.",
        "Boy that narrowed it down",
        "I know right? Man said it’s clear who this is then goes on to say it may or may not be India lol…",
        "People emigrating to canada to escape Indian bullshit\n\nBishnoi: Hold my criminal record."
    ],
    "cleaned_text": "lawrence bhisnoi gang targeting indians surrey bc canada posted rsurrey people associated lawrence bhisnoi targeting indians surrey abbotsford canada surrey nd largest indian population canada brampton ",
    "cleaned_title": "lawrence bhisnoi gang targeting indians surrey bc canada",
    "cleaned_selftext": "posted rsurrey people associated lawrence bhisnoi targeting indians surrey abbotsford canada surrey nd largest indian population canada brampton",
    "cleaned_comments": "rsurreybc also way made legally proficiency makes question effective immigration control eyes got hurt reading jai sri ram lawrence bishnoi confirmed shotting ram ke naam pe kya kya ho ra hai judging formatting spelling errors safe conclude unless faker worked hard write convincing letter would crowdsource million promises never write letters much discount send bobs vegene pics filmy way things oyy ye tho babba hi ey hope godzilla okay madarchod india se baahar jaake bhi gundo se azaadi nhi mil rhi punjabi gangs always active surrey area new thing godzilla pulled expects strokeinducing wordings future pqrampujya sri gautamdas panauti ji projecting soft power know please let authorities know yes theyre common like forest fires people clear ielts whether fake real indian indian origin person cases absolutely psychotic thing help narrow boy narrowed know right man said clear goes say may may india lol people emigrating canada escape indian bullshit bishnoi hold criminal record",
    "light_cleaned_title": "Lawrence Bhisnoi gang targeting Indians in Surrey, BC Canada",
    "light_cleaned_selftext": "Just posted on r/surrey . People associated with Lawrence Bhisnoi are targeting Indians in Surrey and Abbotsford in Canada. Surrey has the 2nd largest Indian population in Canada after Brampton, ON",
    "light_cleaned_comments": "* r/SurreyBC also, no way they made it in legally with that proficiency. makes you question how effective their immigration control is My eyes got hurt reading this \"Jai Sri Ram\" Lawrence Bishnoi: Confirmed. *shotting* Ram ke naam pe kya kya ho ra hai ! Judging by the formatting and spelling errors, its safe to conclude who this is. (Unless the faker worked hard to write a convincing letter) I would crowdsource 2 million if he promises never to write letters How much discount if I send bobs & vegene pics What filmy way of doing things Oyy ye tho babba hi ey I hope Godzilla is okay 🤡 Madarchod India se baahar jaake bhi gundo se azaadi nhi mil rhi Punjabi Gangs have always been very active in Surrey Area. Not a new thing. Godzilla pulled through, expects no stroke-inducing wordings in the future. Pqrampujya Sri Gautamdas Panauti Ji projecting soft power. Who is this? If you know please let the authorities know Yes they’re common. Like forest fires. How did these people clear IELTS? Whether it's fake or real, some Indian or Indian origin person did it. In both cases absolutely psychotic thing to do. This should help narrow it down. Boy that narrowed it down I know right? Man said it’s clear who this is then goes on to say it may or may not be India lol… People emigrating to canada to escape Indian bullshit Bishnoi: Hold my criminal record."
}