{
    "id": "1ggylmh",
    "title": "IFF’s cybersecurity report for the third quarter of 2024\n",
    "url": "https://www.reddit.com/r/india/comments/1ggylmh/iffs_cybersecurity_report_for_the_third_quarter/",
    "selftext": "[IFF needs your support, now more than ever.](https://preview.redd.it/jky0011798yd1.png?width=1600&format=png&auto=webp&s=ad138429f3ba7dafdc154ad0115f870e4f9f933f)\n\nThis series lists the various cybersecurity incidents that occurred during this quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience.\n\n# tl;dr \n\nRecent data breaches and leaks have underscored the widespread impact on the data security of millions of users. Grave cybersecurity incidents, like the BSNL and Star Health data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. This series will list the various cybersecurity incidents that occurred during a quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience in an interconnected digital world.\n\n# Important Documents \n\n1. Letter to CERT-In on the BSNL data breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1woWVM0fhN4fgEIVsYKYt0uJGu2Bdgutl/view?usp=sharing))\n2. Letter to CERT-In on Angel One data leak dated July 25, 2024 ([Link](https://drive.google.com/file/d/1GiL_kL0-xjkMmv9vsQdwvwthSCk_HeVv/view?usp=sharing))\n3. Letter to CERT-In on the eMigrate Portal data breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1N2tligkv2OLpkU0NqFj-Vs0tfUtFnCZz/view?usp=sharing))\n4. Letter to CERT-In on the Airtel Database breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1Nt703RPU9KrDu4tXAkth54W2C88nSrqH/view?usp=sharing))\n5. Letter to CERT-In on WazirX data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/13Zfr31NPZYDCFO32-jzc1B1pKvDjcvQF/view?usp=sharing))\n6. Letter to CERT-In on Piramal Group’s data leak dated September 9, 2024 ([Link](https://drive.google.com/file/d/1Ld9jCehBT8iW04aWJx0-eK9DBkuIKG0p/view?usp=sharing))\n7. Letter to CERT-In on Co-operative and regional rural banks data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/1qNZjV-K_98e-4HlXNRKfysoomwuXmgWY/view?usp=sharing))\n8. Letter to CERT-In on the Durex India data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/1GyXwMgB43KrLQxL0O8tQFA91iTdJp0MC/view?usp=sharing))\n9. Letter to CERT-In on the Star Health data breach dated September 20, 2024 ([Link](https://drive.google.com/file/d/1L34AFcjD0mkUTUv9pt79glZBr3s2AtGa/view?usp=sharing))\n10. Letter to CERT-In on vulnerability in smart cards issued by the Telangana Transport Department dated September 24, 2024 ([Link](https://drive.google.com/file/d/12GwhltmuJqrSebtkZO-rf-RWkTnBTJKa/view?usp=sharing))\n11. PlugTheBreach [(Link)](https://plugthebreach.in/)\n\n# The grim state of cybersecurity in India\n\nThe urgent need to operationalise the [Digital Personal Data Protection Act (“DPDPA”), 2023](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/) is underscored by the increasingly pervasive threats to individuals’ digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting data protection legislation is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The [exemption](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/) of the Indian Computer Emergency Response Team (“CERT-In”), the nodal authority assigned to monitor data breaches, in 2023 from the Right to Information (“RTI”) Act, 2005 raises serious concerns about the accountability of an organisation whose actions or inaction is consequential for the status of cyber security and individual privacy in the country. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them.   \n  \n\n\n# Data breaches and vulnerabilities in 2024 Q3\n\n1. **BSNL data leak:** Bharat Sanchar Nigam Ltd (“BSNL”) [reportedly](https://www.business-standard.com/companies/news/bsnl-data-breach-exposes-278-gb-of-sensitive-telecom-info-twice-in-6-mts-124062600314_1.html) suffered a significant data breach, as a result of which sensitive information such as IMSI numbers, SIM card details, home location register data, and critical security keys were accessed by a threat actor. The incident was reported by the digital risk management firm Athenian Technology, according to whom the hacker by the username ‘kiberphant0m’ claims to have taken over 278 GB of data from BSNL’s telecom operations, including server snapshots, and the threat actor was willing to sell the data for $5000. \n\nNotably, this marked the [second](https://telecom.economictimes.indiatimes.com/news/industry/bsnl-suffers-second-data-breach-in-six-months/111265613) data breach the state-owned telecom operator has suffered within six months. We wrote a [letter](https://drive.google.com/file/d/1woWVM0fhN4fgEIVsYKYt0uJGu2Bdgutl/view?usp=sharing) to CERT-In, bringing this breach to their notice and highlighting that such a data breach can put the customers at risk of financial loss as well as data theft. \n\nThe breach was [acknowledged](https://x.com/IFFonParliament/status/1816434690581999903) by the Department of Telecommunications during the 2024 Monsoon session of Parliament in an answer to a question raised by Member of Parliament, Dr. Amar Singh who inquired about the BSNL data breach. The Minister in his reply mentioned that CERT-In reported the breach on May 20, 2024 but he denied the claim regarding a breach in the Home Location Register (HLR) and hence no service outage in BSNL's network.\n\n1. **Angel One data breach:** Angel One, a Mumbai-based stock brokerage firm, [reportedly ](https://economictimes.indiatimes.com/tech/technology/personal-data-of-almost-8-million-angel-one-customers-leaked-online/articleshow/111612380.cms?from=mdr)suffered a data breach which compromised the personal data of approximately 8 million customers. The unidentified threat actor exposed Personally Identifiable Information (“PII”) like customers’ names, addresses, contact numbers, and bank account details on a hacker forum. In response to the breach, the Angel One Authorities [clarified](https://economictimes.indiatimes.com/markets/stocks/news/angel-ones-data-breach-dates-back-to-april-2023-company-clarifies/articleshow/111631505.cms) that the current situation is related to a prior breach from April 2023, which was supposedly reported to the relevant authorities and there has been no additional breach of their systems since the previously reported incident. Read our letter to CERT-In [here](https://drive.google.com/file/d/1GiL_kL0-xjkMmv9vsQdwvwthSCk_HeVv/view?usp=sharing). \n2. **Data Breach of the eMigrate Portal:** A significant data breach [reportedly](https://techcrunch.com/2024/06/26/hacker-claims-data-breach-of-indias-emigrate-labor-portal/) affected the eMigrate Portal, a platform launched by the Ministry of External Affairs (“MEA”) to help Indian labourers emigrate overseas. A pseudonymous hacker [published](https://www.thehindu.com/sci-tech/technology/internet/indian-blue-collar-worker-database-emigrate-in-the-hands-of-hackers/article68343850.ece) data of individuals who signed up to the eMigrate portal on a known cybercrime forum and claims to have at least 2,00,000 internal and registered user entries, containing full names, email addresses, phone numbers, dates of birth, mailing addresses, and passport details. The data breach also disclosed the personal information of a foreign ambassador of the Indian government. However, it is unclear whether the data was obtained directly from the eMigrate servers or through a previous breach. Following this, CERT-In stated that it was “in \\[the\\] process of taking appropriate action with the concerned authority.” However, the MEA did not officially comment on the matter. We wrote a [letter](https://drive.google.com/file/d/1N2tligkv2OLpkU0NqFj-Vs0tfUtFnCZz/view?usp=sharing) to CERT-In highlighting the inadequate cybersecurity measures being taken by the MEA. \n3. **Data leak of the Airtel database:** On July 3, 2024, an 'X' (formerly Twitter) user known as 'Dark Web Informer' [reported](https://www.deccanherald.com/technology/airtel-rubbishes-allegations-of-data-breach-says-user-data-of-customers-safe-3093904) that a hacker using the username 'xenZen' is offering the data of more than 375 million Bharti Airtel (“Airtel”) users for sale on the dark web. Airtel is one of the largest telecom service providers in India and [reportedly](https://techcrunch.com/2024/07/05/indias-airtel-dismisses-data-breach-reports-amid-customer-concerns/) the leaked information included personal details of users such as name, birth date, Aadhaar number, father’s name, local address, permanent residential address, alternate phone number, email ID, gender, nationality, cellular connection type (prepaid/postpaid), SIM activation date, and photo ID proof, and address proof. According to reports, this information was listed on a dark web forum, at the rate of $50,000 (Rs. 41 lakh) to be paid in cryptocurrency. Following this, Airtel India through its ‘X’ account [denied](https://indianexpress.com/article/technology/tech-news-technology/airtel-denies-data-breach-of-personal-details-belonging-to-37-5-crore-indian-customers-9434368/) any breach of its systems and stated that such rumours were a malicious attempt to tarnish its image. Read our letter to CERT-In [here](https://drive.google.com/file/d/1Nt703RPU9KrDu4tXAkth54W2C88nSrqH/view?usp=sharing). \n\nNotably, this is not the first instance of a data breach involving Airtel. In 2021, a cybersecurity researcher [warned](https://economictimes.indiatimes.com/tech/technology/airtel-denies-claims-that-data-of-2-5-million-users-was-leaked/articleshow/80660207.cms) that the data of over 2.5 million Airtel customers had been posted on a threat actor's website called 'Red Rabbit Team,' which was subsequently taken down after three months. Even then Airtel had denied the breach allegations. \n\n1. **WazirX data breach**: A significant data breach [reportedly](https://economictimes.indiatimes.com/tech/technology/wazirx-suffers-security-breach-cybersecurity-firm-pegs-hack-at-234-9-million/articleshow/111831916.cms) affected WazirX, India’s largest cryptocurrency exchange. [Reports](https://www.thehindu.com/sci-tech/technology/wazirx-hacked-halts-withdrawals-as-over-230-million-stolen/article68421190.ece) indicated that the breach involved the theft of more than 200 crypto assets, including $96.7 million worth of Shiba Inu (SHIB) tokens, the most among lost funds, followed by $52 million in Ethereum (ETH), $11 million in Polygon (MATIC), and $7.6million in Pepe (PEPE) with total funds stolen estimated at $235 million, which accounts for nearly 45 per cent of WazirX’s $500-million. The company in a statement on ‘X’ (formerly Twitter) [confirmed](https://wazirx.com/blog/wazirx-announces-bounty/) that its ‘Multisig wallet’ which has been utilising Liminal’s digital asset custody and wallet infrastructure since February 2023, fell victim to a massive data breach. WazirX also reportedly reached out to the Indian police, the Financial Intelligence Unit (FIU) India, CERT-In and other authorities to help tackle the situation. Following this, [investigations](https://www.elliptic.co/blog/235-million-lost-by-wazirx-in-north-korea-linked-breach) by a cyber security firm, ‘Elliptic’ have suggested that the breach was orchestrated by the ‘Lazarus Group', a notorious hacking collective affiliated with North Korea. Read our letter to CERT-In [here](https://drive.google.com/file/d/13Zfr31NPZYDCFO32-jzc1B1pKvDjcvQF/view?usp=sharing).\n2. **Piramal Group’s data leak:** According to [Tech Crunch](https://techcrunch.com/2024/07/24/hacker-claims-theft-of-piramal-groups-employee-data/), Piramal Group, an Indian multinational company that operates across pharma, financial services, and real estate suffered a major data breach. A pseudonymous hacker claimed to have access to the company’s database which included personal details such as names and email addresses of thousands of employees of Piramal group. The hacker published a small portion of the data on a well-known cybercrime forum for sale at an undisclosed rate. The company released a [statement](https://www.business-standard.com/companies/news/piramal-group-refutes-data-breach-claims-terms-dark-web-activity-as-false-124072601227_1.html) to various media outlets that their investigation did not uncover any breach in their systems. According to their investigation, the leaked information supposedly originated from a third-party platform called Mallinator, not from Piramal’s systems. We wrote a [letter](https://drive.google.com/file/d/1Ld9jCehBT8iW04aWJx0-eK9DBkuIKG0p/view?usp=sharing) to CERT-In to look into this instance of the alleged data breach and conduct a forensic analysis to ascertain whether any flaws in Piramal’s systems have been exploited by nefarious entities.\n3. **Co-operative and regional rural banks data breach:** A significant data breach [reportedly](https://www.livemint.com/industry/retail-payments-at-several-co-operative-regional-rural-banks-hit-due-to-ransomware-attack-11722439054284.htm) affected C-Edge Technologies Ltd. (“C-Edge”), a technology service provider primarily catering to co-operative and Regional Rural Banks (“RRBs”). The company was targeted in a ransomware attack, as [confirmed](https://www.thehindu.com/sci-tech/technology/customers-at-several-small-sized-banks-affected-as-tech-provider-c-edge-suffers-ransomware-attack/article68470198.ece) by the National Payments Corporation of India (“NPCI”) on July 31, 2024. The attack resulted in a temporary closure of all retail payments in the affected banks and customers were not able to access the payment systems until restoration was complete. After a security review, it was [stated](https://timesofindia.indiatimes.com/city/surat/co-op-banks-digital-services-restored-after-cyber-attack/articleshow/112209093.cms) that the impact was limited to C-Edge systems hosted in their data centre, and not on any of the cooperative or regional banks’ own infrastructure. We wrote a [letter](https://drive.google.com/file/d/1qNZjV-K_98e-4HlXNRKfysoomwuXmgWY/view?usp=sharing) to CERT-in to investigate further into this breach.\n4. **Durex India data breach:** A massive data breach was [suffered](https://www.indiatoday.in/technology/news/story/addresses-phone-numbers-and-names-of-durex-india-customers-may-have-been-leaked-online-2592300-2024-09-02) by Durex India, the Indian subsidiary of the British condom and personal lubricants brand. The breach [reportedly](https://www.thehindu.com/sci-tech/technology/internet/durex-india-exposed-sensitive-consumer-data-and-order-details-report/article68584904.ece) exposed sensitive user information of customers like names, phone numbers, email addresses, shipping addresses, the products ordered, and the amount paid which was collected by its official website. While the exact number of affected customers remains unclear, a security researcher discovered evidence indicating that sensitive information belonging to hundreds of individuals had been exposed. The breach [allegedly](https://www.financialexpress.com/life/technology-durex-indias-unprotected-data-leak-customers-personal-data-orders-exposed-in-privacy-mishap-3596331/) occurred due to a lack of proper authentication on the company’s order confirmation page. However, the company declined to comment or share its plans to secure its customers’ information. We wrote a [letter](https://drive.google.com/file/d/1GyXwMgB43KrLQxL0O8tQFA91iTdJp0MC/view?usp=sharing) to CERT-In raising our concerns about how the sensitive data could be exploited for identity theft and phishing attacks, and how contact details may result in unwanted harassment and moral policing of the customers.\n5. **Star Health data breach:** A significant data breach recently affected Star Health and Allied Insurance Co. Ltd. (“Star Health’), which is one of India’s biggest health insurers. According to [Reuters](https://www.reuters.com/technology/cybersecurity/hacker-uses-telegram-chatbots-leak-data-top-indian-insurer-star-health-2024-09-20/), stolen data of Star Health customers including full names, phone numbers, addresses, tax details, copies of ID cards, test results and medical diagnoses were publicly accessible via chatbots on Telegram. The unidentified creator of the chatbots informed a security researcher that details of millions of people were available for sale and that samples could be viewed by simply asking the chatbots to divulge. Following this, Star Health on September 20, 2024, released a statement in which it mentioned that it had reported the “alleged unauthorised data access to the local authority.” It also went on to add that an initial assessment by the company showed “no widespread compromise” and that “sensitive customer data remains secure.” However, it did not clarify whether the data was leaked from its own servers or not. We wrote a [letter](https://drive.google.com/file/d/1L34AFcjD0mkUTUv9pt79glZBr3s2AtGa/view?usp=sharing) to CERT-In requesting an enquiry by them to ensure that Star Health provides the appropriate remedy to the affected users as per statutory obligations.\n\nNotably, on October 9, 2024, Star Health [released](https://www.boomlive.in/explainers/explained-who-exposed-data-of-3-crore-star-health-customers-26692) another statement acknowledging that it had been the target of a malicious cyberattack, leading to unauthorised and illegal access to certain data. This statement was in response to a website surfacing which claimed to offer data of over 31 million of the company's customers for sale at $150,000. The hacker, ‘xenZen’ mentioned that Star Health's Chief Information Security Officer, Amarjeet Khanuja sold this data. Additionally, Star Health has filed a lawsuit against Telegram and an unidentified hacker over this data breach and is actively investigating this matter. \n\n1. **Vulnerability in smart cards issued by the Telangana Transport Department:** The smart cards issued by the Telangana Transport Department for vehicle registration certificates and driving licenses faced a significant vulnerability as [reported](https://www.newindianexpress.com/states/telangana/2024/Sep/17/centres-test-reveals-driving-license-smart-cards-in-telangana-vulnerable-to-data-breach-ngo) in September 2024. According to reports, concerns were raised that the chips in these smart cards which are supplied by Colorplast India Private Limited do not comply with the Smart Card Operating System for Transport Application (“SCOSTA”) guidelines and thus, are vulnerable to data breaches in the future. These claims are reportedly based on a test conducted by the National Informatics Centre. The Transport Department did not give any official response to these claims. Read our letter to CERT-In [here](https://drive.google.com/file/d/12GwhltmuJqrSebtkZO-rf-RWkTnBTJKa/view?usp=sharing). \n\n# PlugTheBreach: IFF’s data breach tracker\n\nYou can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. \n\n# Conclusion \n\nThe multitude of [recent data breaches and leaks](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE) underscores the critical importance of robust cybersecurity measures in today's digital landscape. From breaches compromising sensitive personal information to vulnerabilities in major databases and platforms, these incidents highlight the pervasive risks individuals and organisations face. \n\nIn these challenges, organisations must prioritise proactive cybersecurity measures, including regular audits, robust encryption protocols, and swift incident response procedures. Moreover, there's an urgent need for greater transparency and accountability in handling data breaches, as seen in cases where affected companies failed to acknowledge or adequately address the breaches promptly. \n\nPublic awareness and education on cybersecurity best practices also play a vital role in mitigating risks and fostering a culture of cyber resilience. Thus, as we navigate an increasingly interconnected digital world, we must remain vigilant and proactive in safeguarding our digital assets and protecting user privacy. \n\nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)!\n\n# ",
    "flair": "Policy/Economy",
    "score": 26,
    "num_comments": 1,
    "created_utc": 1730439697.0,
    "convurl": "https://a.thumbs.redditmedia.com/afpkD0n-1wBiwo53zMxPSXVzXmNeTAYeH_eDmRM0vu4.jpg",
    "comments": [],
    "cleaned_text": "iffs cybersecurity report third quarter iff needs support everhttpspreviewredditjkyydpngwidthformatpngautowebpsadfbadafdcadfefff series lists various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience tldr recent data breaches leaks underscored widespread impact data security millions users grave cybersecurity incidents like bsnl star health data leak raised concerns detection response capabilities indias cybersecurity authorities series list various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world important documents letter certin bsnl data breach dated july linkhttpsdrivegooglecomfiledwowvmfhnfgeivsykytujgubdgutlviewuspsharing letter certin angel one data leak dated july linkhttpsdrivegooglecomfiledgilklxjkmmvvsqdwvwthsckhevvviewuspsharing letter certin emigrate portal data breach dated july linkhttpsdrivegooglecomfiledntligkvolpkunqfjvstfutfnczzviewuspsharing letter certin airtel database breach dated july linkhttpsdrivegooglecomfiledntrpukrdutxakthwcnsrqhviewuspsharing letter certin wazirx data breach dated september linkhttpsdrivegooglecomfiledzfrnpzydcfojzcbpkvdjcvqfviewuspsharing letter certin piramal groups data leak dated september linkhttpsdrivegooglecomfiledldjcehbtiwawjxekdbkuikgpviewuspsharing letter certin cooperative regional rural banks data breach dated september linkhttpsdrivegooglecomfiledqnzjvkehlxnrkfysoomwuxmgwyviewuspsharing letter certin durex india data breach dated september linkhttpsdrivegooglecomfiledgyxwmgbkrlqxlotqfaitdjpmcviewuspsharing letter certin star health data breach dated september linkhttpsdrivegooglecomfiledlafcjdmkutuvptglzbrsatgaviewuspsharing letter certin vulnerability smart cards issued telangana transport department dated september linkhttpsdrivegooglecomfiledgwhltmujqrsebtkzorfrwktnbtjkaviewuspsharing plugthebreach linkhttpsplugthebreachin grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbill underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiact indian computer emergency response team certin nodal authority assigned monitor data breaches right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q bsnl data leak bharat sanchar nigam ltd bsnl reportedlyhttpswwwbusinessstandardcomcompaniesnewsbsnldatabreachexposesgbofsensitivetelecominfotwiceinmtshtml suffered significant data breach result sensitive information imsi numbers sim card details home location register data critical security keys accessed threat actor incident reported digital risk management firm athenian technology according hacker username kiberphantm claims taken gb data bsnls telecom operations including server snapshots threat actor willing sell data notably marked secondhttpstelecomeconomictimesindiatimescomnewsindustrybsnlsuffersseconddatabreachinsixmonths data breach stateowned telecom operator suffered within six months wrote letterhttpsdrivegooglecomfiledwowvmfhnfgeivsykytujgubdgutlviewuspsharing certin bringing breach notice highlighting data breach put customers risk financial loss well data theft breach acknowledgedhttpsxcomiffonparliamentstatus department telecommunications monsoon session parliament answer question raised member parliament dr amar singh inquired bsnl data breach minister reply mentioned certin reported breach may denied claim regarding breach home location register hlr hence service outage bsnls network angel one data breach angel one mumbaibased stock brokerage firm reportedly httpseconomictimesindiatimescomtechtechnologypersonaldataofalmostmillionangelonecustomersleakedonlinearticleshowcmsfrommdrsuffered data breach compromised personal data approximately million customers unidentified threat actor exposed personally identifiable information pii like customers names addresses contact numbers bank account details hacker forum response breach angel one authorities clarifiedhttpseconomictimesindiatimescommarketsstocksnewsangelonesdatabreachdatesbacktoaprilcompanyclarifiesarticleshowcms current situation related prior breach april supposedly reported relevant authorities additional breach systems since previously reported incident read letter certin herehttpsdrivegooglecomfiledgilklxjkmmvvsqdwvwthsckhevvviewuspsharing data breach emigrate portal significant data breach reportedlyhttpstechcrunchcomhackerclaimsdatabreachofindiasemigratelaborportal affected emigrate portal platform launched ministry external affairs mea help indian labourers emigrate overseas pseudonymous hacker publishedhttpswwwthehinducomscitechtechnologyinternetindianbluecollarworkerdatabaseemigrateinthehandsofhackersarticleece data individuals signed emigrate portal known cybercrime forum claims least internal registered user entries containing full names email addresses phone numbers dates birth mailing addresses passport details data breach also disclosed personal information foreign ambassador indian government however unclear whether data obtained directly emigrate servers previous breach following certin stated process taking appropriate action concerned authority however mea officially comment matter wrote letterhttpsdrivegooglecomfiledntligkvolpkunqfjvstfutfnczzviewuspsharing certin highlighting inadequate cybersecurity measures taken mea data leak airtel database july x formerly twitter user known dark web informer reportedhttpswwwdeccanheraldcomtechnologyairtelrubbishesallegationsofdatabreachsaysuserdataofcustomerssafe hacker using username xenzen offering data million bharti airtel airtel users sale dark web airtel one largest telecom service providers india reportedlyhttpstechcrunchcomindiasairteldismissesdatabreachreportsamidcustomerconcerns leaked information included personal details users name birth date aadhaar number fathers name local address permanent residential address alternate phone number email id gender nationality cellular connection type prepaidpostpaid sim activation date photo id proof address proof according reports information listed dark web forum rate rs lakh paid cryptocurrency following airtel india x account deniedhttpsindianexpresscomarticletechnologytechnewstechnologyairteldeniesdatabreachofpersonaldetailsbelongingtocroreindiancustomers breach systems stated rumours malicious attempt tarnish image read letter certin herehttpsdrivegooglecomfiledntrpukrdutxakthwcnsrqhviewuspsharing notably first instance data breach involving airtel cybersecurity researcher warnedhttpseconomictimesindiatimescomtechtechnologyairteldeniesclaimsthatdataofmillionuserswasleakedarticleshowcms data million airtel customers posted threat actors website called red rabbit team subsequently taken three months even airtel denied breach allegations wazirx data breach significant data breach reportedlyhttpseconomictimesindiatimescomtechtechnologywazirxsufferssecuritybreachcybersecurityfirmpegshackatmillionarticleshowcms affected wazirx indias largest cryptocurrency exchange reportshttpswwwthehinducomscitechtechnologywazirxhackedhaltswithdrawalsasovermillionstolenarticleece indicated breach involved theft crypto assets including million worth shiba inu shib tokens among lost funds followed million ethereum eth million polygon matic million pepe pepe total funds stolen estimated million accounts nearly per cent wazirxs million company statement x formerly twitter confirmedhttpswazirxcomblogwazirxannouncesbounty multisig wallet utilising liminals digital asset custody wallet infrastructure since february fell victim massive data breach wazirx also reportedly reached indian police financial intelligence unit fiu india certin authorities help tackle situation following investigationshttpswwwellipticcoblogmillionlostbywazirxinnorthkorealinkedbreach cyber security firm elliptic suggested breach orchestrated lazarus group notorious hacking collective affiliated north korea read letter certin herehttpsdrivegooglecomfiledzfrnpzydcfojzcbpkvdjcvqfviewuspsharing piramal groups data leak according tech crunchhttpstechcrunchcomhackerclaimstheftofpiramalgroupsemployeedata piramal group indian multinational company operates across pharma financial services real estate suffered major data breach pseudonymous hacker claimed access companys database included personal details names email addresses thousands employees piramal group hacker published small portion data wellknown cybercrime forum sale undisclosed rate company released statementhttpswwwbusinessstandardcomcompaniesnewspiramalgrouprefutesdatabreachclaimstermsdarkwebactivityasfalsehtml various media outlets investigation uncover breach systems according investigation leaked information supposedly originated thirdparty platform called mallinator piramals systems wrote letterhttpsdrivegooglecomfiledldjcehbtiwawjxekdbkuikgpviewuspsharing certin look instance alleged data breach conduct forensic analysis ascertain whether flaws piramals systems exploited nefarious entities cooperative regional rural banks data breach significant data breach reportedlyhttpswwwlivemintcomindustryretailpaymentsatseveralcooperativeregionalruralbankshitduetoransomwareattackhtm affected cedge technologies ltd cedge technology service provider primarily catering cooperative regional rural banks rrbs company targeted ransomware attack confirmedhttpswwwthehinducomscitechtechnologycustomersatseveralsmallsizedbanksaffectedastechprovidercedgesuffersransomwareattackarticleece national payments corporation india npci july attack resulted temporary closure retail payments affected banks customers able access payment systems restoration complete security review statedhttpstimesofindiaindiatimescomcitysuratcoopbanksdigitalservicesrestoredaftercyberattackarticleshowcms impact limited cedge systems hosted data centre cooperative regional banks infrastructure wrote letterhttpsdrivegooglecomfiledqnzjvkehlxnrkfysoomwuxmgwyviewuspsharing certin investigate breach durex india data breach massive data breach sufferedhttpswwwindiatodayintechnologynewsstoryaddressesphonenumbersandnamesofdurexindiacustomersmayhavebeenleakedonline durex india indian subsidiary british condom personal lubricants brand breach reportedlyhttpswwwthehinducomscitechtechnologyinternetdurexindiaexposedsensitiveconsumerdataandorderdetailsreportarticleece exposed sensitive user information customers like names phone numbers email addresses shipping addresses products ordered amount paid collected official website exact number affected customers remains unclear security researcher discovered evidence indicating sensitive information belonging hundreds individuals exposed breach allegedlyhttpswwwfinancialexpresscomlifetechnologydurexindiasunprotecteddataleakcustomerspersonaldataordersexposedinprivacymishap occurred due lack proper authentication companys order confirmation page however company declined comment share plans secure customers information wrote letterhttpsdrivegooglecomfiledgyxwmgbkrlqxlotqfaitdjpmcviewuspsharing certin raising concerns sensitive data could exploited identity theft phishing attacks contact details may result unwanted harassment moral policing customers star health data breach significant data breach recently affected star health allied insurance co ltd star health one indias biggest health insurers according reutershttpswwwreuterscomtechnologycybersecurityhackerusestelegramchatbotsleakdatatopindianinsurerstarhealth stolen data star health customers including full names phone numbers addresses tax details copies id cards test results medical diagnoses publicly accessible via chatbots telegram unidentified creator chatbots informed security researcher details millions people available sale samples could viewed simply asking chatbots divulge following star health september released statement mentioned reported alleged unauthorised data access local authority also went add initial assessment company showed widespread compromise sensitive customer data remains secure however clarify whether data leaked servers wrote letterhttpsdrivegooglecomfiledlafcjdmkutuvptglzbrsatgaviewuspsharing certin requesting enquiry ensure star health provides appropriate remedy affected users per statutory obligations notably october star health releasedhttpswwwboomliveinexplainersexplainedwhoexposeddataofcrorestarhealthcustomers another statement acknowledging target malicious cyberattack leading unauthorised illegal access certain data statement response website surfacing claimed offer data million companys customers sale hacker xenzen mentioned star healths chief information security officer amarjeet khanuja sold data additionally star health filed lawsuit telegram unidentified hacker data breach actively investigating matter vulnerability smart cards issued telangana transport department smart cards issued telangana transport department vehicle registration certificates driving licenses faced significant vulnerability reportedhttpswwwnewindianexpresscomstatestelanganasepcentrestestrevealsdrivinglicensesmartcardsintelanganavulnerabletodatabreachngo september according reports concerns raised chips smart cards supplied colorplast india private limited comply smart card operating system transport application scosta guidelines thus vulnerable data breaches future claims reportedly based test conducted national informatics centre transport department give official response claims read letter certin herehttpsdrivegooglecomfiledgwhltmujqrsebtkzorfrwktnbtjkaviewuspsharing plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive personal information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "iffs cybersecurity report third quarter",
    "cleaned_selftext": "iff needs support everhttpspreviewredditjkyydpngwidthformatpngautowebpsadfbadafdcadfefff series lists various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience tldr recent data breaches leaks underscored widespread impact data security millions users grave cybersecurity incidents like bsnl star health data leak raised concerns detection response capabilities indias cybersecurity authorities series list various cybersecurity incidents occurred quarter country actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world important documents letter certin bsnl data breach dated july linkhttpsdrivegooglecomfiledwowvmfhnfgeivsykytujgubdgutlviewuspsharing letter certin angel one data leak dated july linkhttpsdrivegooglecomfiledgilklxjkmmvvsqdwvwthsckhevvviewuspsharing letter certin emigrate portal data breach dated july linkhttpsdrivegooglecomfiledntligkvolpkunqfjvstfutfnczzviewuspsharing letter certin airtel database breach dated july linkhttpsdrivegooglecomfiledntrpukrdutxakthwcnsrqhviewuspsharing letter certin wazirx data breach dated september linkhttpsdrivegooglecomfiledzfrnpzydcfojzcbpkvdjcvqfviewuspsharing letter certin piramal groups data leak dated september linkhttpsdrivegooglecomfiledldjcehbtiwawjxekdbkuikgpviewuspsharing letter certin cooperative regional rural banks data breach dated september linkhttpsdrivegooglecomfiledqnzjvkehlxnrkfysoomwuxmgwyviewuspsharing letter certin durex india data breach dated september linkhttpsdrivegooglecomfiledgyxwmgbkrlqxlotqfaitdjpmcviewuspsharing letter certin star health data breach dated september linkhttpsdrivegooglecomfiledlafcjdmkutuvptglzbrsatgaviewuspsharing letter certin vulnerability smart cards issued telangana transport department dated september linkhttpsdrivegooglecomfiledgwhltmujqrsebtkzorfrwktnbtjkaviewuspsharing plugthebreach linkhttpsplugthebreachin grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbill underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiact indian computer emergency response team certin nodal authority assigned monitor data breaches right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q bsnl data leak bharat sanchar nigam ltd bsnl reportedlyhttpswwwbusinessstandardcomcompaniesnewsbsnldatabreachexposesgbofsensitivetelecominfotwiceinmtshtml suffered significant data breach result sensitive information imsi numbers sim card details home location register data critical security keys accessed threat actor incident reported digital risk management firm athenian technology according hacker username kiberphantm claims taken gb data bsnls telecom operations including server snapshots threat actor willing sell data notably marked secondhttpstelecomeconomictimesindiatimescomnewsindustrybsnlsuffersseconddatabreachinsixmonths data breach stateowned telecom operator suffered within six months wrote letterhttpsdrivegooglecomfiledwowvmfhnfgeivsykytujgubdgutlviewuspsharing certin bringing breach notice highlighting data breach put customers risk financial loss well data theft breach acknowledgedhttpsxcomiffonparliamentstatus department telecommunications monsoon session parliament answer question raised member parliament dr amar singh inquired bsnl data breach minister reply mentioned certin reported breach may denied claim regarding breach home location register hlr hence service outage bsnls network angel one data breach angel one mumbaibased stock brokerage firm reportedly httpseconomictimesindiatimescomtechtechnologypersonaldataofalmostmillionangelonecustomersleakedonlinearticleshowcmsfrommdrsuffered data breach compromised personal data approximately million customers unidentified threat actor exposed personally identifiable information pii like customers names addresses contact numbers bank account details hacker forum response breach angel one authorities clarifiedhttpseconomictimesindiatimescommarketsstocksnewsangelonesdatabreachdatesbacktoaprilcompanyclarifiesarticleshowcms current situation related prior breach april supposedly reported relevant authorities additional breach systems since previously reported incident read letter certin herehttpsdrivegooglecomfiledgilklxjkmmvvsqdwvwthsckhevvviewuspsharing data breach emigrate portal significant data breach reportedlyhttpstechcrunchcomhackerclaimsdatabreachofindiasemigratelaborportal affected emigrate portal platform launched ministry external affairs mea help indian labourers emigrate overseas pseudonymous hacker publishedhttpswwwthehinducomscitechtechnologyinternetindianbluecollarworkerdatabaseemigrateinthehandsofhackersarticleece data individuals signed emigrate portal known cybercrime forum claims least internal registered user entries containing full names email addresses phone numbers dates birth mailing addresses passport details data breach also disclosed personal information foreign ambassador indian government however unclear whether data obtained directly emigrate servers previous breach following certin stated process taking appropriate action concerned authority however mea officially comment matter wrote letterhttpsdrivegooglecomfiledntligkvolpkunqfjvstfutfnczzviewuspsharing certin highlighting inadequate cybersecurity measures taken mea data leak airtel database july x formerly twitter user known dark web informer reportedhttpswwwdeccanheraldcomtechnologyairtelrubbishesallegationsofdatabreachsaysuserdataofcustomerssafe hacker using username xenzen offering data million bharti airtel airtel users sale dark web airtel one largest telecom service providers india reportedlyhttpstechcrunchcomindiasairteldismissesdatabreachreportsamidcustomerconcerns leaked information included personal details users name birth date aadhaar number fathers name local address permanent residential address alternate phone number email id gender nationality cellular connection type prepaidpostpaid sim activation date photo id proof address proof according reports information listed dark web forum rate rs lakh paid cryptocurrency following airtel india x account deniedhttpsindianexpresscomarticletechnologytechnewstechnologyairteldeniesdatabreachofpersonaldetailsbelongingtocroreindiancustomers breach systems stated rumours malicious attempt tarnish image read letter certin herehttpsdrivegooglecomfiledntrpukrdutxakthwcnsrqhviewuspsharing notably first instance data breach involving airtel cybersecurity researcher warnedhttpseconomictimesindiatimescomtechtechnologyairteldeniesclaimsthatdataofmillionuserswasleakedarticleshowcms data million airtel customers posted threat actors website called red rabbit team subsequently taken three months even airtel denied breach allegations wazirx data breach significant data breach reportedlyhttpseconomictimesindiatimescomtechtechnologywazirxsufferssecuritybreachcybersecurityfirmpegshackatmillionarticleshowcms affected wazirx indias largest cryptocurrency exchange reportshttpswwwthehinducomscitechtechnologywazirxhackedhaltswithdrawalsasovermillionstolenarticleece indicated breach involved theft crypto assets including million worth shiba inu shib tokens among lost funds followed million ethereum eth million polygon matic million pepe pepe total funds stolen estimated million accounts nearly per cent wazirxs million company statement x formerly twitter confirmedhttpswazirxcomblogwazirxannouncesbounty multisig wallet utilising liminals digital asset custody wallet infrastructure since february fell victim massive data breach wazirx also reportedly reached indian police financial intelligence unit fiu india certin authorities help tackle situation following investigationshttpswwwellipticcoblogmillionlostbywazirxinnorthkorealinkedbreach cyber security firm elliptic suggested breach orchestrated lazarus group notorious hacking collective affiliated north korea read letter certin herehttpsdrivegooglecomfiledzfrnpzydcfojzcbpkvdjcvqfviewuspsharing piramal groups data leak according tech crunchhttpstechcrunchcomhackerclaimstheftofpiramalgroupsemployeedata piramal group indian multinational company operates across pharma financial services real estate suffered major data breach pseudonymous hacker claimed access companys database included personal details names email addresses thousands employees piramal group hacker published small portion data wellknown cybercrime forum sale undisclosed rate company released statementhttpswwwbusinessstandardcomcompaniesnewspiramalgrouprefutesdatabreachclaimstermsdarkwebactivityasfalsehtml various media outlets investigation uncover breach systems according investigation leaked information supposedly originated thirdparty platform called mallinator piramals systems wrote letterhttpsdrivegooglecomfiledldjcehbtiwawjxekdbkuikgpviewuspsharing certin look instance alleged data breach conduct forensic analysis ascertain whether flaws piramals systems exploited nefarious entities cooperative regional rural banks data breach significant data breach reportedlyhttpswwwlivemintcomindustryretailpaymentsatseveralcooperativeregionalruralbankshitduetoransomwareattackhtm affected cedge technologies ltd cedge technology service provider primarily catering cooperative regional rural banks rrbs company targeted ransomware attack confirmedhttpswwwthehinducomscitechtechnologycustomersatseveralsmallsizedbanksaffectedastechprovidercedgesuffersransomwareattackarticleece national payments corporation india npci july attack resulted temporary closure retail payments affected banks customers able access payment systems restoration complete security review statedhttpstimesofindiaindiatimescomcitysuratcoopbanksdigitalservicesrestoredaftercyberattackarticleshowcms impact limited cedge systems hosted data centre cooperative regional banks infrastructure wrote letterhttpsdrivegooglecomfiledqnzjvkehlxnrkfysoomwuxmgwyviewuspsharing certin investigate breach durex india data breach massive data breach sufferedhttpswwwindiatodayintechnologynewsstoryaddressesphonenumbersandnamesofdurexindiacustomersmayhavebeenleakedonline durex india indian subsidiary british condom personal lubricants brand breach reportedlyhttpswwwthehinducomscitechtechnologyinternetdurexindiaexposedsensitiveconsumerdataandorderdetailsreportarticleece exposed sensitive user information customers like names phone numbers email addresses shipping addresses products ordered amount paid collected official website exact number affected customers remains unclear security researcher discovered evidence indicating sensitive information belonging hundreds individuals exposed breach allegedlyhttpswwwfinancialexpresscomlifetechnologydurexindiasunprotecteddataleakcustomerspersonaldataordersexposedinprivacymishap occurred due lack proper authentication companys order confirmation page however company declined comment share plans secure customers information wrote letterhttpsdrivegooglecomfiledgyxwmgbkrlqxlotqfaitdjpmcviewuspsharing certin raising concerns sensitive data could exploited identity theft phishing attacks contact details may result unwanted harassment moral policing customers star health data breach significant data breach recently affected star health allied insurance co ltd star health one indias biggest health insurers according reutershttpswwwreuterscomtechnologycybersecurityhackerusestelegramchatbotsleakdatatopindianinsurerstarhealth stolen data star health customers including full names phone numbers addresses tax details copies id cards test results medical diagnoses publicly accessible via chatbots telegram unidentified creator chatbots informed security researcher details millions people available sale samples could viewed simply asking chatbots divulge following star health september released statement mentioned reported alleged unauthorised data access local authority also went add initial assessment company showed widespread compromise sensitive customer data remains secure however clarify whether data leaked servers wrote letterhttpsdrivegooglecomfiledlafcjdmkutuvptglzbrsatgaviewuspsharing certin requesting enquiry ensure star health provides appropriate remedy affected users per statutory obligations notably october star health releasedhttpswwwboomliveinexplainersexplainedwhoexposeddataofcrorestarhealthcustomers another statement acknowledging target malicious cyberattack leading unauthorised illegal access certain data statement response website surfacing claimed offer data million companys customers sale hacker xenzen mentioned star healths chief information security officer amarjeet khanuja sold data additionally star health filed lawsuit telegram unidentified hacker data breach actively investigating matter vulnerability smart cards issued telangana transport department smart cards issued telangana transport department vehicle registration certificates driving licenses faced significant vulnerability reportedhttpswwwnewindianexpresscomstatestelanganasepcentrestestrevealsdrivinglicensesmartcardsintelanganavulnerabletodatabreachngo september according reports concerns raised chips smart cards supplied colorplast india private limited comply smart card operating system transport application scosta guidelines thus vulnerable data breaches future claims reportedly based test conducted national informatics centre transport department give official response claims read letter certin herehttpsdrivegooglecomfiledgwhltmujqrsebtkzorfrwktnbtjkaviewuspsharing plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive personal information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF’s cybersecurity report for the third quarter of 2024",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever.](https://preview.redd.it/jky0011798yd1.png?width=1600&format=png&auto=webp&s=ad138429f3ba7dafdc154ad0115f870e4f9f933f) This series lists the various cybersecurity incidents that occurred during this quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience. # tl;dr Recent data breaches and leaks have underscored the widespread impact on the data security of millions of users. Grave cybersecurity incidents, like the BSNL and Star Health data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. This series will list the various cybersecurity incidents that occurred during a quarter in the country and our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience in an interconnected digital world. # Important Documents 1. Letter to CERT-In on the BSNL data breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1woWVM0fhN4fgEIVsYKYt0uJGu2Bdgutl/view?usp=sharing)) 2. Letter to CERT-In on Angel One data leak dated July 25, 2024 ([Link](https://drive.google.com/file/d/1GiL_kL0-xjkMmv9vsQdwvwthSCk_HeVv/view?usp=sharing)) 3. Letter to CERT-In on the eMigrate Portal data breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1N2tligkv2OLpkU0NqFj-Vs0tfUtFnCZz/view?usp=sharing)) 4. Letter to CERT-In on the Airtel Database breach dated July 25, 2024 ([Link](https://drive.google.com/file/d/1Nt703RPU9KrDu4tXAkth54W2C88nSrqH/view?usp=sharing)) 5. Letter to CERT-In on WazirX data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/13Zfr31NPZYDCFO32-jzc1B1pKvDjcvQF/view?usp=sharing)) 6. Letter to CERT-In on Piramal Group’s data leak dated September 9, 2024 ([Link](https://drive.google.com/file/d/1Ld9jCehBT8iW04aWJx0-eK9DBkuIKG0p/view?usp=sharing)) 7. Letter to CERT-In on Co-operative and regional rural banks data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/1qNZjV-K_98e-4HlXNRKfysoomwuXmgWY/view?usp=sharing)) 8. Letter to CERT-In on the Durex India data breach dated September 9, 2024 ([Link](https://drive.google.com/file/d/1GyXwMgB43KrLQxL0O8tQFA91iTdJp0MC/view?usp=sharing)) 9. Letter to CERT-In on the Star Health data breach dated September 20, 2024 ([Link](https://drive.google.com/file/d/1L34AFcjD0mkUTUv9pt79glZBr3s2AtGa/view?usp=sharing)) 10. Letter to CERT-In on vulnerability in smart cards issued by the Telangana Transport Department dated September 24, 2024 ([Link](https://drive.google.com/file/d/12GwhltmuJqrSebtkZO-rf-RWkTnBTJKa/view?usp=sharing)) 11. PlugTheBreach [(Link)](https://plugthebreach.in/) # The grim state of cybersecurity in India The urgent need to operationalise the [Digital Personal Data Protection Act (“DPDPA”), 2023](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/) is underscored by the increasingly pervasive threats to individuals’ digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting data protection legislation is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The [exemption](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/) of the Indian Computer Emergency Response Team (“CERT-In”), the nodal authority assigned to monitor data breaches, in 2023 from the Right to Information (“RTI”) Act, 2005 raises serious concerns about the accountability of an organisation whose actions or inaction is consequential for the status of cyber security and individual privacy in the country. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them. # Data breaches and vulnerabilities in 2024 Q3 1. **BSNL data leak:** Bharat Sanchar Nigam Ltd (“BSNL”) [reportedly](https://www.business-standard.com/companies/news/bsnl-data-breach-exposes-278-gb-of-sensitive-telecom-info-twice-in-6-mts-124062600314_1.html) suffered a significant data breach, as a result of which sensitive information such as IMSI numbers, SIM card details, home location register data, and critical security keys were accessed by a threat actor. The incident was reported by the digital risk management firm Athenian Technology, according to whom the hacker by the username ‘kiberphant0m’ claims to have taken over 278 GB of data from BSNL’s telecom operations, including server snapshots, and the threat actor was willing to sell the data for $5000. Notably, this marked the [second](https://telecom.economictimes.indiatimes.com/news/industry/bsnl-suffers-second-data-breach-in-six-months/111265613) data breach the state-owned telecom operator has suffered within six months. We wrote a [letter](https://drive.google.com/file/d/1woWVM0fhN4fgEIVsYKYt0uJGu2Bdgutl/view?usp=sharing) to CERT-In, bringing this breach to their notice and highlighting that such a data breach can put the customers at risk of financial loss as well as data theft. The breach was [acknowledged](https://x.com/IFFonParliament/status/1816434690581999903) by the Department of Telecommunications during the 2024 Monsoon session of Parliament in an answer to a question raised by Member of Parliament, Dr. Amar Singh who inquired about the BSNL data breach. The Minister in his reply mentioned that CERT-In reported the breach on May 20, 2024 but he denied the claim regarding a breach in the Home Location Register (HLR) and hence no service outage in BSNL's network. 1. **Angel One data breach:** Angel One, a Mumbai-based stock brokerage firm, [reportedly ](https://economictimes.indiatimes.com/tech/technology/personal-data-of-almost-8-million-angel-one-customers-leaked-online/articleshow/111612380.cms?from=mdr)suffered a data breach which compromised the personal data of approximately 8 million customers. The unidentified threat actor exposed Personally Identifiable Information (“PII”) like customers’ names, addresses, contact numbers, and bank account details on a hacker forum. In response to the breach, the Angel One Authorities [clarified](https://economictimes.indiatimes.com/markets/stocks/news/angel-ones-data-breach-dates-back-to-april-2023-company-clarifies/articleshow/111631505.cms) that the current situation is related to a prior breach from April 2023, which was supposedly reported to the relevant authorities and there has been no additional breach of their systems since the previously reported incident. Read our letter to CERT-In [here](https://drive.google.com/file/d/1GiL_kL0-xjkMmv9vsQdwvwthSCk_HeVv/view?usp=sharing). 2. **Data Breach of the eMigrate Portal:** A significant data breach [reportedly](https://techcrunch.com/2024/06/26/hacker-claims-data-breach-of-indias-emigrate-labor-portal/) affected the eMigrate Portal, a platform launched by the Ministry of External Affairs (“MEA”) to help Indian labourers emigrate overseas. A pseudonymous hacker [published](https://www.thehindu.com/sci-tech/technology/internet/indian-blue-collar-worker-database-emigrate-in-the-hands-of-hackers/article68343850.ece) data of individuals who signed up to the eMigrate portal on a known cybercrime forum and claims to have at least 2,00,000 internal and registered user entries, containing full names, email addresses, phone numbers, dates of birth, mailing addresses, and passport details. The data breach also disclosed the personal information of a foreign ambassador of the Indian government. However, it is unclear whether the data was obtained directly from the eMigrate servers or through a previous breach. Following this, CERT-In stated that it was “in \\[the\\] process of taking appropriate action with the concerned authority.” However, the MEA did not officially comment on the matter. We wrote a [letter](https://drive.google.com/file/d/1N2tligkv2OLpkU0NqFj-Vs0tfUtFnCZz/view?usp=sharing) to CERT-In highlighting the inadequate cybersecurity measures being taken by the MEA. 3. **Data leak of the Airtel database:** On July 3, 2024, an 'X' (formerly Twitter) user known as 'Dark Web Informer' [reported](https://www.deccanherald.com/technology/airtel-rubbishes-allegations-of-data-breach-says-user-data-of-customers-safe-3093904) that a hacker using the username 'xenZen' is offering the data of more than 375 million Bharti Airtel (“Airtel”) users for sale on the dark web. Airtel is one of the largest telecom service providers in India and [reportedly](https://techcrunch.com/2024/07/05/indias-airtel-dismisses-data-breach-reports-amid-customer-concerns/) the leaked information included personal details of users such as name, birth date, Aadhaar number, father’s name, local address, permanent residential address, alternate phone number, email ID, gender, nationality, cellular connection type (prepaid/postpaid), SIM activation date, and photo ID proof, and address proof. According to reports, this information was listed on a dark web forum, at the rate of $50,000 (Rs. 41 lakh) to be paid in cryptocurrency. Following this, Airtel India through its ‘X’ account [denied](https://indianexpress.com/article/technology/tech-news-technology/airtel-denies-data-breach-of-personal-details-belonging-to-37-5-crore-indian-customers-9434368/) any breach of its systems and stated that such rumours were a malicious attempt to tarnish its image. Read our letter to CERT-In [here](https://drive.google.com/file/d/1Nt703RPU9KrDu4tXAkth54W2C88nSrqH/view?usp=sharing). Notably, this is not the first instance of a data breach involving Airtel. In 2021, a cybersecurity researcher [warned](https://economictimes.indiatimes.com/tech/technology/airtel-denies-claims-that-data-of-2-5-million-users-was-leaked/articleshow/80660207.cms) that the data of over 2.5 million Airtel customers had been posted on a threat actor's website called 'Red Rabbit Team,' which was subsequently taken down after three months. Even then Airtel had denied the breach allegations. 1. **WazirX data breach**: A significant data breach [reportedly](https://economictimes.indiatimes.com/tech/technology/wazirx-suffers-security-breach-cybersecurity-firm-pegs-hack-at-234-9-million/articleshow/111831916.cms) affected WazirX, India’s largest cryptocurrency exchange. [Reports](https://www.thehindu.com/sci-tech/technology/wazirx-hacked-halts-withdrawals-as-over-230-million-stolen/article68421190.ece) indicated that the breach involved the theft of more than 200 crypto assets, including $96.7 million worth of Shiba Inu (SHIB) tokens, the most among lost funds, followed by $52 million in Ethereum (ETH), $11 million in Polygon (MATIC), and $7.6million in Pepe (PEPE) with total funds stolen estimated at $235 million, which accounts for nearly 45 per cent of WazirX’s $500-million. The company in a statement on ‘X’ (formerly Twitter) [confirmed](https://wazirx.com/blog/wazirx-announces-bounty/) that its ‘Multisig wallet’ which has been utilising Liminal’s digital asset custody and wallet infrastructure since February 2023, fell victim to a massive data breach. WazirX also reportedly reached out to the Indian police, the Financial Intelligence Unit (FIU) India, CERT-In and other authorities to help tackle the situation. Following this, [investigations](https://www.elliptic.co/blog/235-million-lost-by-wazirx-in-north-korea-linked-breach) by a cyber security firm, ‘Elliptic’ have suggested that the breach was orchestrated by the ‘Lazarus Group', a notorious hacking collective affiliated with North Korea. Read our letter to CERT-In [here](https://drive.google.com/file/d/13Zfr31NPZYDCFO32-jzc1B1pKvDjcvQF/view?usp=sharing). 2. **Piramal Group’s data leak:** According to [Tech Crunch](https://techcrunch.com/2024/07/24/hacker-claims-theft-of-piramal-groups-employee-data/), Piramal Group, an Indian multinational company that operates across pharma, financial services, and real estate suffered a major data breach. A pseudonymous hacker claimed to have access to the company’s database which included personal details such as names and email addresses of thousands of employees of Piramal group. The hacker published a small portion of the data on a well-known cybercrime forum for sale at an undisclosed rate. The company released a [statement](https://www.business-standard.com/companies/news/piramal-group-refutes-data-breach-claims-terms-dark-web-activity-as-false-124072601227_1.html) to various media outlets that their investigation did not uncover any breach in their systems. According to their investigation, the leaked information supposedly originated from a third-party platform called Mallinator, not from Piramal’s systems. We wrote a [letter](https://drive.google.com/file/d/1Ld9jCehBT8iW04aWJx0-eK9DBkuIKG0p/view?usp=sharing) to CERT-In to look into this instance of the alleged data breach and conduct a forensic analysis to ascertain whether any flaws in Piramal’s systems have been exploited by nefarious entities. 3. **Co-operative and regional rural banks data breach:** A significant data breach [reportedly](https://www.livemint.com/industry/retail-payments-at-several-co-operative-regional-rural-banks-hit-due-to-ransomware-attack-11722439054284.htm) affected C-Edge Technologies Ltd. (“C-Edge”), a technology service provider primarily catering to co-operative and Regional Rural Banks (“RRBs”). The company was targeted in a ransomware attack, as [confirmed](https://www.thehindu.com/sci-tech/technology/customers-at-several-small-sized-banks-affected-as-tech-provider-c-edge-suffers-ransomware-attack/article68470198.ece) by the National Payments Corporation of India (“NPCI”) on July 31, 2024. The attack resulted in a temporary closure of all retail payments in the affected banks and customers were not able to access the payment systems until restoration was complete. After a security review, it was [stated](https://timesofindia.indiatimes.com/city/surat/co-op-banks-digital-services-restored-after-cyber-attack/articleshow/112209093.cms) that the impact was limited to C-Edge systems hosted in their data centre, and not on any of the cooperative or regional banks’ own infrastructure. We wrote a [letter](https://drive.google.com/file/d/1qNZjV-K_98e-4HlXNRKfysoomwuXmgWY/view?usp=sharing) to CERT-in to investigate further into this breach. 4. **Durex India data breach:** A massive data breach was [suffered](https://www.indiatoday.in/technology/news/story/addresses-phone-numbers-and-names-of-durex-india-customers-may-have-been-leaked-online-2592300-2024-09-02) by Durex India, the Indian subsidiary of the British condom and personal lubricants brand. The breach [reportedly](https://www.thehindu.com/sci-tech/technology/internet/durex-india-exposed-sensitive-consumer-data-and-order-details-report/article68584904.ece) exposed sensitive user information of customers like names, phone numbers, email addresses, shipping addresses, the products ordered, and the amount paid which was collected by its official website. While the exact number of affected customers remains unclear, a security researcher discovered evidence indicating that sensitive information belonging to hundreds of individuals had been exposed. The breach [allegedly](https://www.financialexpress.com/life/technology-durex-indias-unprotected-data-leak-customers-personal-data-orders-exposed-in-privacy-mishap-3596331/) occurred due to a lack of proper authentication on the company’s order confirmation page. However, the company declined to comment or share its plans to secure its customers’ information. We wrote a [letter](https://drive.google.com/file/d/1GyXwMgB43KrLQxL0O8tQFA91iTdJp0MC/view?usp=sharing) to CERT-In raising our concerns about how the sensitive data could be exploited for identity theft and phishing attacks, and how contact details may result in unwanted harassment and moral policing of the customers. 5. **Star Health data breach:** A significant data breach recently affected Star Health and Allied Insurance Co. Ltd. (“Star Health’), which is one of India’s biggest health insurers. According to [Reuters](https://www.reuters.com/technology/cybersecurity/hacker-uses-telegram-chatbots-leak-data-top-indian-insurer-star-health-2024-09-20/), stolen data of Star Health customers including full names, phone numbers, addresses, tax details, copies of ID cards, test results and medical diagnoses were publicly accessible via chatbots on Telegram. The unidentified creator of the chatbots informed a security researcher that details of millions of people were available for sale and that samples could be viewed by simply asking the chatbots to divulge. Following this, Star Health on September 20, 2024, released a statement in which it mentioned that it had reported the “alleged unauthorised data access to the local authority.” It also went on to add that an initial assessment by the company showed “no widespread compromise” and that “sensitive customer data remains secure.” However, it did not clarify whether the data was leaked from its own servers or not. We wrote a [letter](https://drive.google.com/file/d/1L34AFcjD0mkUTUv9pt79glZBr3s2AtGa/view?usp=sharing) to CERT-In requesting an enquiry by them to ensure that Star Health provides the appropriate remedy to the affected users as per statutory obligations. Notably, on October 9, 2024, Star Health [released](https://www.boomlive.in/explainers/explained-who-exposed-data-of-3-crore-star-health-customers-26692) another statement acknowledging that it had been the target of a malicious cyberattack, leading to unauthorised and illegal access to certain data. This statement was in response to a website surfacing which claimed to offer data of over 31 million of the company's customers for sale at $150,000. The hacker, ‘xenZen’ mentioned that Star Health's Chief Information Security Officer, Amarjeet Khanuja sold this data. Additionally, Star Health has filed a lawsuit against Telegram and an unidentified hacker over this data breach and is actively investigating this matter. 1. **Vulnerability in smart cards issued by the Telangana Transport Department:** The smart cards issued by the Telangana Transport Department for vehicle registration certificates and driving licenses faced a significant vulnerability as [reported](https://www.newindianexpress.com/states/telangana/2024/Sep/17/centres-test-reveals-driving-license-smart-cards-in-telangana-vulnerable-to-data-breach-ngo) in September 2024. According to reports, concerns were raised that the chips in these smart cards which are supplied by Colorplast India Private Limited do not comply with the Smart Card Operating System for Transport Application (“SCOSTA”) guidelines and thus, are vulnerable to data breaches in the future. These claims are reportedly based on a test conducted by the National Informatics Centre. The Transport Department did not give any official response to these claims. Read our letter to CERT-In [here](https://drive.google.com/file/d/12GwhltmuJqrSebtkZO-rf-RWkTnBTJKa/view?usp=sharing). # PlugTheBreach: IFF’s data breach tracker You can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. # Conclusion The multitude of [recent data breaches and leaks](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE) underscores the critical importance of robust cybersecurity measures in today's digital landscape. From breaches compromising sensitive personal information to vulnerabilities in major databases and platforms, these incidents highlight the pervasive risks individuals and organisations face. In these challenges, organisations must prioritise proactive cybersecurity measures, including regular audits, robust encryption protocols, and swift incident response procedures. Moreover, there's an urgent need for greater transparency and accountability in handling data breaches, as seen in cases where affected companies failed to acknowledge or adequately address the breaches promptly. Public awareness and education on cybersecurity best practices also play a vital role in mitigating risks and fostering a culture of cyber resilience. Thus, as we navigate an increasingly interconnected digital world, we must remain vigilant and proactive in safeguarding our digital assets and protecting user privacy. Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)! #",
    "light_cleaned_comments": ""
}