{
    "id": "1cg3l5p",
    "title": "How is this acceptable",
    "url": "https://www.reddit.com/gallery/1cg3l5p",
    "selftext": "Same has been happening in other countries. These companies used covid to boost their profits. There have been multiple reports about young people suddenly dying of a heart attack in India.(last news was literally yesterday about an 18yo dying while dancing due to a heart attack)But everyone blamed it on study pressure and indian genetics being more suseptible to heart attacks. Nothing will ever happen to these companies",
    "flair": "Crime",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1714408438,
    "convurl": "https://i.redd.it/5mxg308h4gxc1.png",
    "comments": [
        "These drugs were forced upon citizens by the government without any thorough trials.",
        "कोपिड से सदी का सबसे बड़ा घोटाला है।",
        "There is no proof linking the death to vaccines.",
        "Rare, probability of dying from Covid was probably higher compared to the side-effect. Cost-benefit analysis.",
        "Ah, the tangled web of skepticism and suspicion we weave. Let's address this notion that pharmaceutical companies are somehow nefarious overlords profiting from the pandemic.\n\nYes, pharmaceutical companies are profit-driven, but let's not overlook the fact that vaccines have saved millions of lives. Yes, millions. Thrombosis, while a potential side effect, isn't exclusive to the AstraZeneca vaccine. It's a known risk with many medications and vaccines, and weighing pros and cons is crucial. The overall incidence of any thrombitic event is weighed against potential pneumonia and rapid deterioration and death, along with chronic side effects for the COVID vaccines. A metric TON of drugs go on to the market and then have side-effects in populations that were documented in lower numbers and black-box warnings sometimes issued. The pandemic heightened the general populace's awareness of medication and research science, yes, and it helps if people are educated, but there is plenty of incomplete info and pseudo-sci/conspiracy claims to go around. \n\nMoreover, the pandemic catalyzed RNA research, a breakthrough with implications beyond COVID-19. This technology holds promise in battling diseases like cancer. So, while skepticism has its place, let's not discard the remarkable strides science has made in the face of adversity."
    ],
    "cleaned_text": "acceptable happening countries companies used covid boost profits multiple reports young people suddenly dying heart attack indialast news literally yesterday yo dying dancing due heart attackbut everyone blamed study pressure indian genetics suseptible heart attacks nothing ever happen companies ",
    "cleaned_title": "acceptable",
    "cleaned_selftext": "happening countries companies used covid boost profits multiple reports young people suddenly dying heart attack indialast news literally yesterday yo dying dancing due heart attackbut everyone blamed study pressure indian genetics suseptible heart attacks nothing ever happen companies",
    "cleaned_comments": "drugs forced upon citizens government without thorough trials proof linking death vaccines rare probability dying covid probably higher compared sideeffect costbenefit analysis ah tangled web skepticism suspicion weave lets address notion pharmaceutical companies somehow nefarious overlords profiting pandemic yes pharmaceutical companies profitdriven lets overlook fact vaccines saved millions lives yes millions thrombosis potential side effect isnt exclusive astrazeneca vaccine known risk many medications vaccines weighing pros cons crucial overall incidence thrombitic event weighed potential pneumonia rapid deterioration death along chronic side effects covid vaccines metric ton drugs go market sideeffects populations documented lower numbers blackbox warnings sometimes issued pandemic heightened general populaces awareness medication research science yes helps people educated plenty incomplete info pseudosciconspiracy claims go around moreover pandemic catalyzed rna research breakthrough implications beyond covid technology holds promise battling diseases like cancer skepticism place lets discard remarkable strides science made face adversity",
    "light_cleaned_title": "How is this acceptable",
    "light_cleaned_selftext": "Same has been happening in other countries. These companies used covid to boost their profits. There have been multiple reports about young people suddenly dying of a heart attack in India.(last news was literally yesterday about an 18yo dying while dancing due to a heart attack)But everyone blamed it on study pressure and indian genetics being more suseptible to heart attacks. Nothing will ever happen to these companies",
    "light_cleaned_comments": "These drugs were forced upon citizens by the government without any thorough trials. कोपिड से सदी का सबसे बड़ा घोटाला है। There is no proof linking the death to vaccines. Rare, probability of dying from Covid was probably higher compared to the side-effect. Cost-benefit analysis. Ah, the tangled web of skepticism and suspicion we weave. Let's address this notion that pharmaceutical companies are somehow nefarious overlords profiting from the pandemic. Yes, pharmaceutical companies are profit-driven, but let's not overlook the fact that vaccines have saved millions of lives. Yes, millions. Thrombosis, while a potential side effect, isn't exclusive to the AstraZeneca vaccine. It's a known risk with many medications and vaccines, and weighing pros and cons is crucial. The overall incidence of any thrombitic event is weighed against potential pneumonia and rapid deterioration and death, along with chronic side effects for the COVID vaccines. A metric TON of drugs go on to the market and then have side-effects in populations that were documented in lower numbers and black-box warnings sometimes issued. The pandemic heightened the general populace's awareness of medication and research science, yes, and it helps if people are educated, but there is plenty of incomplete info and pseudo-sci/conspiracy claims to go around. Moreover, the pandemic catalyzed RNA research, a breakthrough with implications beyond COVID-19. This technology holds promise in battling diseases like cancer. So, while skepticism has its place, let's not discard the remarkable strides science has made in the face of adversity."
}