{
    "id": "15eupty",
    "title": "This is absolutely shocking (or maybe not). Have a look at this tweet https://twitter.com/sharanidli/status/1685926778161029120?s=20. Manipulation of 2019 election results was proved using rigorous statistical methods. Simply remove names from the voter roll!! To add to that, mainly Muslim names",
    "url": "https://www.reddit.com/r/india/comments/15eupty/this_is_absolutely_shocking_or_maybe_not_have_a/",
    "selftext": "The author looks at the discrepancy between votes counted across candidates and votes counted across constituencies in India. The discrepancy between the two different votes polled lists becomes more pronounced in constituencies where the race is close. Have a look at this tweet. For people that are not so well versed with Statistics, let me tell you the methodology used is very often used in political economy. There were two lists released by the EC after the 2019 elections - one of the final EVM votes across candidates for all constituencies and one that is votes polled for all constituencies. You'd expect them to match but they didn't. [The quint reported it, but after the report the EC took one of the lists down](https://www.thequint.com/news/india/lok-sabha-election-results-2019-mismatch-in-votes-polled-and-counted-in-evm-on-multiple-seats). McCrary test is a test that was first propounded in 2008 and the test detects manipulation in data, so to say. The author finds some interesting results. The test rarely fails, meaning there was manipulation of some kind, otherwise, you'd see a continuation of the voting density. All this is a little more technical, but the point is there are other checks done by the author including checking if the voting share can be explained by increasing effort put by the BJP in these close margin wins.  The answer is NO. The discrepancy between the two lists is only explained by manipulation in the voter roll. There are many interesting figures from this paper - \n\nhttps://preview.redd.it/17r62v8rqdfb1.png?width=336&format=png&auto=webp&s=7049f62e8afb7123b433a2d9183880efdff32b1b",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690843830.0,
    "convurl": "https://external-preview.redd.it/Zc0p81x1mQyHN-iBa9VbKo-dsq4OkXdK7cq6fk4KSfQ.jpg?auto=webp&s=d1a40b9812abd588e6b422748d76fe56b7fff46d",
    "comments": [],
    "cleaned_text": "absolutely shocking maybe look tweet manipulation election results proved using rigorous statistical methods simply remove names voter roll add mainly muslim names author looks discrepancy votes counted across candidates votes counted across constituencies india discrepancy two different votes polled lists becomes pronounced constituencies race close look tweet people well versed statistics let tell methodology used often used political economy two lists released ec elections one final evm votes across candidates constituencies one votes polled constituencies youd expect match didnt quint reported report ec took one lists downhttpswwwthequintcomnewsindialoksabhaelectionresultsmismatchinvotespolledandcountedinevmonmultipleseats mccrary test test first propounded test detects manipulation data say author finds interesting results test rarely fails meaning manipulation kind otherwise youd see continuation voting density little technical point checks done author including checking voting share explained increasing effort put bjp close margin wins answer discrepancy two lists explained manipulation voter roll many interesting figures paper ",
    "cleaned_title": "absolutely shocking maybe look tweet manipulation election results proved using rigorous statistical methods simply remove names voter roll add mainly muslim names",
    "cleaned_selftext": "author looks discrepancy votes counted across candidates votes counted across constituencies india discrepancy two different votes polled lists becomes pronounced constituencies race close look tweet people well versed statistics let tell methodology used often used political economy two lists released ec elections one final evm votes across candidates constituencies one votes polled constituencies youd expect match didnt quint reported report ec took one lists downhttpswwwthequintcomnewsindialoksabhaelectionresultsmismatchinvotespolledandcountedinevmonmultipleseats mccrary test test first propounded test detects manipulation data say author finds interesting results test rarely fails meaning manipulation kind otherwise youd see continuation voting density little technical point checks done author including checking voting share explained increasing effort put bjp close margin wins answer discrepancy two lists explained manipulation voter roll many interesting figures paper",
    "cleaned_comments": "",
    "light_cleaned_title": "This is absolutely shocking (or maybe not). Have a look at this tweet Manipulation of 2019 election results was proved using rigorous statistical methods. Simply remove names from the voter roll!! To add to that, mainly Muslim names",
    "light_cleaned_selftext": "The author looks at the discrepancy between votes counted across candidates and votes counted across constituencies in India. The discrepancy between the two different votes polled lists becomes more pronounced in constituencies where the race is close. Have a look at this tweet. For people that are not so well versed with Statistics, let me tell you the methodology used is very often used in political economy. There were two lists released by the EC after the 2019 elections - one of the final EVM votes across candidates for all constituencies and one that is votes polled for all constituencies. You'd expect them to match but they didn't. [The quint reported it, but after the report the EC took one of the lists down](https://www.thequint.com/news/india/lok-sabha-election-results-2019-mismatch-in-votes-polled-and-counted-in-evm-on-multiple-seats). McCrary test is a test that was first propounded in 2008 and the test detects manipulation in data, so to say. The author finds some interesting results. The test rarely fails, meaning there was manipulation of some kind, otherwise, you'd see a continuation of the voting density. All this is a little more technical, but the point is there are other checks done by the author including checking if the voting share can be explained by increasing effort put by the BJP in these close margin wins. The answer is NO. The discrepancy between the two lists is only explained by manipulation in the voter roll. There are many interesting figures from this paper -",
    "light_cleaned_comments": ""
}