{
    "id": "18209vt",
    "title": "Boy, 16, stabs 17-year-old over 60 times in brutal Delhi murder",
    "url": "https://i.redd.it/xhwfuxq2e32c1.jpeg",
    "selftext": "What the hell is happening to India!!??",
    "flair": "Crime",
    "score": 438,
    "num_comments": 152,
    "created_utc": 1700742983.0,
    "convurl": "https://i.redd.it/xhwfuxq2e32c1.jpeg",
    "comments": [
        "Life has  become that cheap",
        ">what the hell is happening to india?\n\nas sad as it is, i think it's the fact that these acts of utter cruelty are just being reported and there are more platforms to latch on to these horrific bits of news... doesn't make it any less harrowing",
        "he is a minor. nothing is going to happen to him. will spend two years in juvenile and then roam free",
        "iska video dekha, bhenchod pura psycho hai",
        "Link",
        "True. \nAnd he was drunk too! Sadly he will be roaming free in sometime, makes me feel scared tbh.",
        "A thief is. A thief but its brutal",
        "Bro is watching too much anime.",
        "Twitter",
        "North Indians are different breed.",
        "Link",
        "Knife kill and then Emote",
        "Tf you mean by thief is a thief. 350rs ain't worth dying. He didn't rob a bank, heck the govt is robbing us and ducking us in the ass, they ain't getting murdered",
        "Parents and high schoolers need sessions on mental well being, so that people can spot some deviant behaviours and assist the concern person in seeking help. As a country we have too few qualified Psychiatrists for our population.\nOm Shanti.",
        "Nothing, just the justice system has gone missing.",
        "Anyone above 15 should not be considered minor. Indian lawmakers should have learned this post Nirbhaya 2012.",
        "Fact!",
        "Agreed! Indian law needs serious update!",
        "Killed boy was a Muslim btw",
        "Yes. And any minor who commits heinous crime should be sentenced for minimum 10yrs of jail time! For death, even 25yrs! Even this is not enough for the crimes we are hearing.\n\nAnd the laws in general should be modified",
        "Twitter pe kaha?",
        "Bro saw the opportunity (juvenile punishment compared to adult punishment), took it and completed the sidequest as well.",
        "Naah, we are only interested if the killer is Muslim. /s",
        "sadly they never learn. Even in cases where the criminal was 2 months short of turning 18, they did not charge him and sent to juvenile. 🤦‍♀️",
        "Search 'Kishore stabs yusuf'",
        "Bro emoted after getting the kill 💀",
        "🤡",
        "Sadly yeah. Like, in this post, it doesn’t even mention this fact but just reverse the positions and see what happens….",
        "Whats that song again, \"ye dilli hai mere yaaar\" Ok bye",
        "Btw happy cake day🎉",
        "Delhi culture💀💀",
        "Here's the link \nhttps://twitter.com/ItsKhan_Saba/status/1727594577518014841?t=Tf48_7BW2DUHA2OclPJj-Q&s=19",
        "Very true Endian kanstitution at its finest.",
        "Breaking news - **Hindutva guy brutally murders an innocent muslim in fascist bjp ruled state**",
        "This is scary",
        "This is typical",
        "Minir who is drunk is definitely more the parents fault than himself.",
        "So they can vote from 15 ?",
        "tf are you guys saying?? Common sense is achieved at the age of 7!! Granted many children develop slow but most should have developed common sense by the age of 9. Anybody who kills somebody for no good reason should be imprisoned for atleast 20 years. You literally ruined a life and affected many lives such as the lives of the victim's family members. They dont really deserve to live now do they?",
        "What happened?",
        "Only real solution to this is that ike in the US, a minor who commits murder/rape/aggravated assault leading to grievous bodily harm of the age 15 to 17 will be tried as an adult and not as a minor and will be given the same sentence as that given to an adult.\n\nKids these days watch all kinda crap online and then try to enact it.\n\nAlso how and where does a 16 year old get drunk from ?",
        "Bro pressed the emote button",
        "Anybody above the age of 12 should be held accountable for such crimes. You should meet a 12 year old kid they have very developed brains!! Being a kid does not give you the right to ruin a life and then face limited consequences. I mean even if it is a 12 year old kid he ruined many people's lives the little shit doesnt even deserve to live giving a 20 year sentence should be the minimum he gets.",
        "Killer bhi muslim tha",
        "This is the real fucking horror not ghosts. People like him. \n\nNo way he is getting out he a psycho. A murderer, killer with no remorse. \n\nNo way he is getting out... right?",
        "🤡",
        "Delhi sub folks are going to say ‘Not all men’ however such aggressive behaviour is common there.",
        "Children dont get to choose which parents they are born from. Instead of trying to hurt the minors, it would be more effective to find ways to punish the parents of the child for the acts.",
        "Probably not given that he didn't stab once and back off or appear startled.\nHe did it again and again and again, shows lack of remorse. \n\nA normal sane person doing it in a fit of rage would back off after stabbing once, throw away the knife and run away in shock/fear.\n\nThis kid is a psychopath in making or already one. \nTime to lock him and throw away the key. \n\nThe judge should set aside his age, try him as an adult given the intensity of the crime committed like in the US. \n\nDefinitely the prosecution will take into note that he stabbed not once or twice but 60 times.\nAlso increases chance to merit insanity please.\n\nThis will be a fucking miscarriage of justice for the victim's family.",
        "I saw this video reposted many times and people keep saying that the killer was a Muslim and the victim was Hindu like bruh their propaganda is like everywhere which is disgusting",
        "yeah. if i recall correctly one of the accused in the Nirbhaya incident was a minor and is roaming free after spending a year or two in juvenile.",
        "Bhai merse 500rs le leta",
        "I wonder if there is provision under Indian law to try him as an adult. The crime is a serious enough crime for that.",
        "The police says accused was earlier involved in a murder case with the intention of robbery in 2022.\n\nSo, why the fuck is someone involved in murder case from the previous year roaming around freely ? \n\nHe strangled the 18 year old guy, dragged him to an alley, stabbed him multiple times, walked away, came bafk and continued stabbing on his face and eyes and ears and cut his neck.\n\nAnd then he danced. \n\nThis is not a normal 16 year old.\n\nThis boy doesn't deserve to ever step out into society again. \nNo rehabilitation. Nothing. \nLock him away and throw the keys.",
        "Human life has always been cheap. This is why billionaires want us to keep having children and living in poverty.",
        "Egotism and Vengeance is all time high in our youth. They forget about the consequences of their actions and the responsibility they hold in this society. It’s dreadful and painful to hear about such incidents taking place in our nation. And then instead of working out on the root cause of the problems our political parties, doesn’t matter left wing or right wing politicise it on the basis of religion.",
        "We probably have too much of that in India, the value of life has decreased",
        "Calling india a country will be shameful at this point...it has became a fish market",
        "Indian should amend laws as per changes in society.\n\n[US LAW](https://www.legalmatch.com/law-library/article/juvenile-tried-as-an-adult.html)\n\n\nThe following is a list of examples of state laws that concern the transferring of juvenile criminal defendants to an adult criminal court:\n\nFlorida: Florida considers any minor who is under the age of 18 to be a juvenile. However, if other factors are present in a particular juvenile’s case, they can be tried as an adult as early as at 14 years of age. Florida law also leaves the decision up to the discretion of the attorney who is prosecuting the case, as opposed to judges like the laws in some other states.\n\nIllinois: Illinois defines any individual who is under the age of 17 as a minor child. However, if a juvenile is a repeat offender or if they committed a serious crime, then they can be tried as an adult as early as the age of 13. Minors between the ages of 15 and 17 can be statutorily excluded and tried as an adult if they commit violent crimes, such as first-degree murder, armed robbery, or rape.\n\nCalifornia: The state of California considers anyone who is under the age of 18 to be a minor, but juveniles can be tried as adults as early as by the age of 14 when they commit a serious or violent crime like murder or aggravated sexual assault. A minor can also be tried as an adult if they were previously tried as an adult in the past for a different crime.\n\n. Some examples of crimes that may result in a juvenile being charged and tried as an adult criminal defendant include:\n\nSerious felony offenses or violent crimes, such as first-degree murder, rape, armed robbery, drug trafficking, and so forth;\n\nCriminal acts that are classified as wobbler crimes under a particular state criminal statute; and\n\nCriminal offenses that a minor repeatedly commits and for which rehabilitation programs or a juvenile detention center has failed to prevent from recurring.",
        "bro its not the parents fault most of the times. no parent will teach their kid to murder someone or do anything bad to anyone.",
        "Bro literally emoted on his body. Severe skill issue\n\nThat was a joke, I am sorry",
        "Huh ? The f you are talking about ?\nParents don't need to teach their kids to murder someone. They failed to teach the kids not to murder someone. It was their job, they failed. Their fault.",
        "i need that unknown shooter back in the game",
        "\"Kishore\" Ha Muslim naam hi hai sahi bola",
        "minor used to be 16 until the 90s, then it was changed to 18. So it was updated 'recently'.\n\nHowever a ray of hope is court can decide to treat a minor as an adult.",
        "Welcome to Delhi",
        "He'll probably get out in 3 years",
        "People commenting but he was thief, give 25 years of prison, may be someone will suggest hand the minor. If next day, a 12 year will do the same, they will say the same. 1 person is saying that he did this because punishment is just 2 years and not life.\n\nAnd this is so called educated people of India.\n\nThis is what's wrong with India. \nViloence, lack of empathy, complete disregard to stop the crime but aggressive to punish the criminal and no depth to search/read for roots of problem but want quick revenge.\n\nThis and other heinous crimes are failure of society and system.\nChildren learning and becoming insensitive to violence from social media, news channel. \nChildren getting violated: physically, emotionally by their parents and others.\n\n\nEven people in this comment section wants to see the video. Watch enough video and it will become a norm. Homophobic/misogynistic slurs, photos of accidents, news of rape, violence is so common that it doesn't even affect us.\n\nWe can only stop these by grabbing the problem with its roots, not by punishing a minor. \n\nJustice is not revenge. Justice system is to stop future crimes by punishing a criminal.\nEvery new crime is failure of our current system and we can do nothing about that instead of preventing future ones. Punishing this person won't undo the harm he has caused. We send people to prison to isolate them from us, not to torture them.\n\nBut even educated people in India seems like they will be happy if every criminal gets harsh punishment even if number of crimes does not reduce.",
        "A lot of soul searching is hidden in the 'right?' you wrote.\n\nThis is sickening how he feels no remorse and to add to it is dancing maniacly over someone's dead body.",
        "What’s the guys name?",
        "Bro teens these days are turning sadistic. Ever hear what's happening in sweden these days?",
        "he's 16 so probably 1 hafte me bhi nikal skta hai aur court case me years lagenge isliye rhne hi do",
        "He is a psychopath",
        "does anyone's parents explicitly say to **not** murder someone? mine haven't. i just learned that myself. don't know or remember how but just did",
        "🍻🍻 absolute best from Delhi",
        "He should be killed, not eligible to be a part of any society",
        "I am honestly tired of such outrageous statements on the sub. If humanity knew how to create a utopian society, it would have done it by now. Criminals will exist as long as humanity exists. We can create systems to reduce the frequencies but it would never go away completely.",
        "It does not take common sense to know murder is wrong. He clearly is just wrong in the head",
        "I hope they did teach you not to hurt others. Otherwise, they are absolute pieces of shit that need to be kept away from any kid at all costs.",
        "mindlessly defensive clowns like you will be the end of us",
        "Cause 18 means 18 minimum. You cannot vote when you are 17 and 10 months. So you should not be treated as an adult when you commit a crime as well.",
        "Then anybody over the age of 12 should also have voting rights.",
        "Nahh this does not happen in anime and those who watch anime are pretty calm in personality",
        "That Boy is a psycho",
        "Delhi is such a shithole. And the people there are such cowards, no one must have intervened for sure. No wonder every race in the world came to rape and rule them.",
        "I agree with you . Most of the killers use that as an advantage to kill people .",
        "Following Nirbhaya’s case, the updated Juvenile Justice act sees to it that people between the ages of 16-18 could be tried as adults after an evaluation to see if they had the mental capacity (or something along those lines) to commit the act. So we need to see what will happen.",
        "JJ act 2015 allows for juveniles aged 16 or above to be tried as an adult in heinous crimes.. I guess media attention would decide the pace of judgement",
        "He should be killed. \n\nFck your emotions if you are against capital punishment.",
        "my class teacher from 2nd grade?",
        "Even my class teachers often used to say \"fish market\"",
        "India had amended juvenile justice Act in 2015, post nirbhaya, dropping juvenile age to 16 for those involved in heinous crimes.",
        "Did you saw the video that was kinda fked up",
        "I hope it never happens to the people you care about. It’s very easy to make such statements from the perspective that you have. It feels completely crappy when people we know fall victim because something that could have been avoided, wasn’t. \n\nAgain, only well wishes to you. I hope you understand the point I tried to make.",
        "10-12 murders happened in my city in August . One murderer even confessed to the murder on ig live . He said on ig live that I am not ashamed of murdering him.  I will come out in 1-2 years .",
        "True",
        "Needs to be put in jail for a good ole time. Nothing less than 40 years.",
        "OP said they must be held accountable which does not imply reduction in voting age. There are laws in the west where people of age can vote, drive, join the army but not drink until 21.",
        "India",
        "Isme bhi log Hindu Muslim karrahe hai bhai, pata nahi kya hoga iss desh ka",
        "could you please read my comment again? i understand your point, but i don't think you understood mine.",
        "bro you learn some things inherently. you have a sense of what is good what is bad. Parents dont have to teach some things explicitly. example- my parents always taught me ki mahilao ki humesha izzat kia karo, but they never told me ki beta kabhi kisika murder mat karna, because that i'm supposed to know inherently. Then again there are things which despite their parents' reprimanding, kids do, like exam me cheating my dad always told me mat karna kabhi bhi, but i did it anyways, tell me who is at fault here?",
        "Your dad for failing to teach you properly. What you have described is your dad ATTEMPTING to teach you. He obviously failed if what you say is true.",
        "If you wanna hold someone accountable equal to an adult, then it is logical to accept that they get the rights of an adult. you cannot say on one side that 'we acknowledge that you have the responsibility of an adult' but then 'you do not have the rights of an adult because you arent mature enough'. Thats illogical. If you want to see accountability of an adult, then give them the rights of an adult. \n\nAs for drinking, its related to the human body and its growth rate. Hence, the drinking age is different from adult age.",
        "So, you want this boy to roam free after committing such a heinous crime? There are provisions in several countries to prosecute in case of such crimes by recognizing the minor an adult.",
        "Are you mentally specially-abled or something to even suggest this?",
        "I want him to go to a correction/reformation center, away from his failure parents, to get that criminality out of him and make him a good citizen for the country.",
        "What are you trying to say.",
        "You very well know! If you don't then ask your self my question again!",
        "This boy will never be one. He stabbed someone 60 times and was enjoying it.",
        "you underestimate human beings too much.",
        "Still didnt make sense.",
        "Once or twice, I could have given it a second thought. 60 times? Nah, dude. This boy is done for.",
        "Probably wont in that current mental state! Cheerio!\n\nProbably won't in that current mental state! Cheerio!",
        "Human beings aint that simple.",
        "I get what you mean, but it isn't like that in all cases. And there are many minors who are born to bad parents and didn't commit crimes as well. And What about victims pain? What about victims family? You are talking as if I suggested death sentence. I only suggested a longer jail time. It's not even some eye to eye thing.",
        "Victim's family need a safer environment to live in and help process the trauma. Mental health assistance. \n\nAs for those born to bad parents and did not do wrong, usually there are some positive forces in their surroundings that help them process it. \n\nAnd 'bad parents' that I feel you think is not the same as what I see. Bad parents mean -\n\n1) Parents that do not care about the kids at all and essentially commit child abuse. \n\nOR\n\n2) Parents who are simply unskilled at parenting. Good intentions, but not fit for the job.\n\nI think you and many others just assumed it to be just (1). I am counting (2) in it as well.\n\nWhat you need to be a good parent is both - intention + skill. Mostly the intention part is not the problem.\n\nParenting is a really difficult task. Your child will see all kinds of things, meet all kinds of people. You have to make them capable of living in the world without taking the wrong side of morality. If you failed, then you failed. How hard you tried does not matter. If your child got into bad company and got ruined, its your fault because you did not prepare them for the world. \n\nAt the end, trying doesnt matter if you fail since the victim is the one suffering from your actions. If you arent 100% dead sure to get it right, do not have a kid. If you fail, others will suffer.",
        "Man , this chills the hell out of me....",
        "Again I get what you are trying to say. \nHowever, sometimes even if there is 5% positive in life, some only see 95% negative and get influenced by it. And those who work hard for light will take that 5% positive as hope and work for good in life. \n\nAnd parent 1 and 2 categories are not same at all, how can they be considered same? Those who abuse child in many ways, physically, mentally are not same as those parents who don't express their good intentions softly. Both are very different.\n\nThe environment the child grows up plays a big role, that's why during growing age, they can't judge good or bad with straight thinking. However, if they think stabbing someone is not bad, if they think raping someone while the victim cries with agony is not bad, then they need to be taught a lot. All kids in classroom are taught in similar manner, so why those some kids choose this wrong evil path?? While they don't know any better and aren't mentally grown yet, doesn't mean they shouldn't face the consequences of their horrible actions. \nIt also may teach the kid about being responsible for what they do, at the same time, if the kid doesn't change even after the jail sentence. Then there is nothing anyone can do to help. \n\nFor example, \nIndian one: some 7-8yrs old young boy raped 5yrs old girl and killed her. You can't blame 7yrs old here, doesn't he know to let someone go when the person is crying? so what about 5yrs old girl who died? She didn't do anything as well. \nIndian one: the rapists who spent jail time came out after few years only to target the victim and rape her again. Some 20s old man in this case. \nKorean one: the rapist who spent 10 or so years in jail for raping a 7yrs kid till her intestines came out while drunk got out only to get a house near the victims surroundings area, middle aged man here in this case. \nThese are all only sexual assaults cases I used for example because I don't have much information on others. So don't mind it. \n\nAt the end, the problem lies in the way society is going. We aren't being taught what's needed and that's causing more harm in the form of humans who are not even understanding basic humanity. The issue we are discussing about has bigger problem than we think and isn't in out hands to do anything about it.",
        "im pretty sure you're supposed to infer that yourself and the parents teach you after you've gotten into fights to not hurt somebody. i on the other hand was the most calm kid of my grade and never got into a fight until 10th grade. so yeah, they never really had to teach it to me as the probability of me getting into a fight when i was young was near zero",
        "Wow. The justice system needs to feel ashamed!",
        "No, but I read the details about what all he did. I'm not sure I have the courage to watch the video...",
        "Since he's a \"minor\", they dint mention it in the article.",
        "Facts brother.",
        "Welcome to India*",
        "Ofcourse. They only care about their agendas and votes.",
        "That is the issue, the law is so weak and shit that no one is scared anymore.",
        "How about we stop focusing on the religion?\nDon't fall gor these stupid politicians agendas maybe??\nA drunk minor murdered another minor just over 350Rs. That's the main topic. That's all!",
        "I downloaded it cuz i know it would be removed will post in some archive sub to keep it on the surface",
        "He just wants to engage in India’s national pastime of checking names of victim and culprit to see if it fits their political agenda.",
        "💀💀Oooh"
    ],
    "cleaned_text": "boy stabs yearold times brutal delhi murder hell happening india ",
    "cleaned_title": "boy stabs yearold times brutal delhi murder",
    "cleaned_selftext": "hell happening india",
    "cleaned_comments": "life become cheap hell happening india sad think fact acts utter cruelty reported platforms latch horrific bits news doesnt make less harrowing minor nothing going happen spend two years juvenile roam free iska video dekha bhenchod pura psycho hai link true drunk sadly roaming free sometime makes feel scared tbh thief thief brutal bro watching much anime twitter north indians different breed link knife kill emote tf mean thief thief rs aint worth dying didnt rob bank heck govt robbing us ducking us ass aint getting murdered parents high schoolers need sessions mental well people spot deviant behaviours assist concern person seeking help country qualified psychiatrists population om shanti nothing justice system gone missing anyone considered minor indian lawmakers learned post nirbhaya fact agreed indian law needs serious update killed boy muslim btw yes minor commits heinous crime sentenced minimum yrs jail time death even yrs even enough crimes hearing laws general modified twitter pe kaha bro saw opportunity juvenile punishment compared adult punishment took completed sidequest well naah interested killer muslim sadly never learn even cases criminal months short turning charge sent juvenile search kishore stabs yusuf bro emoted getting kill sadly yeah like post doesnt even mention fact reverse positions see happens whats song ye dilli hai mere yaaar ok bye btw happy cake day delhi culture heres link true endian kanstitution finest breaking news hindutva guy brutally murders innocent muslim fascist bjp ruled state scary typical minir drunk definitely parents fault vote tf guys saying common sense achieved age granted many children develop slow developed common sense age anybody kills somebody good reason imprisoned atleast years literally ruined life affected many lives lives victims family members dont really deserve live happened real solution ike us minor commits murderrapeaggravated assault leading grievous bodily harm age tried adult minor given sentence given adult kids days watch kinda crap online try enact also year old get drunk bro pressed emote button anybody age held accountable crimes meet year old kid developed brains kid give right ruin life face limited consequences mean even year old kid ruined many peoples lives little shit doesnt even deserve live giving year sentence minimum gets killer bhi muslim tha real fucking horror ghosts people like way getting psycho murderer killer remorse way getting right delhi sub folks going say men however aggressive behaviour common children dont get choose parents born instead trying hurt minors would effective find ways punish parents child acts probably given didnt stab back appear startled shows lack remorse normal sane person fit rage would back stabbing throw away knife run away shockfear kid psychopath making already one time lock throw away key judge set aside age try adult given intensity crime committed like us definitely prosecution take note stabbed twice times also increases chance merit insanity please fucking miscarriage justice victims family saw video reposted many times people keep saying killer muslim victim hindu like bruh propaganda like everywhere disgusting yeah recall correctly one accused nirbhaya incident minor roaming free spending year two juvenile bhai merse rs le leta wonder provision indian law try adult crime serious enough crime police says accused earlier involved murder case intention robbery fuck someone involved murder case previous year roaming around freely strangled year old guy dragged alley stabbed multiple times walked away came bafk continued stabbing face eyes ears cut neck danced normal year old boy doesnt deserve ever step society rehabilitation nothing lock away throw keys human life always cheap billionaires want us keep children living poverty egotism vengeance time high youth forget consequences actions responsibility hold society dreadful painful hear incidents taking place nation instead working root cause problems political parties doesnt matter left wing right wing politicise basis religion probably much india value life decreased calling india country shameful pointit became fish market indian amend laws per changes society us lawhttpswwwlegalmatchcomlawlibraryarticlejuveniletriedasanadulthtml following list examples state laws concern transferring juvenile criminal defendants adult criminal court florida florida considers minor age juvenile however factors present particular juveniles case tried adult early years age florida law also leaves decision discretion attorney prosecuting case opposed judges like laws states illinois illinois defines individual age minor child however juvenile repeat offender committed serious crime tried adult early age minors ages statutorily excluded tried adult commit violent crimes firstdegree murder armed robbery rape california state california considers anyone age minor juveniles tried adults early age commit serious violent crime like murder aggravated sexual assault minor also tried adult previously tried adult past different crime examples crimes may result juvenile charged tried adult criminal defendant include serious felony offenses violent crimes firstdegree murder rape armed robbery drug trafficking forth criminal acts classified wobbler crimes particular state criminal statute criminal offenses minor repeatedly commits rehabilitation programs juvenile detention center failed prevent recurring bro parents fault times parent teach kid murder someone anything bad anyone bro literally emoted body severe skill issue joke sorry huh f talking parents dont need teach kids murder someone failed teach kids murder someone job failed fault need unknown shooter back game kishore ha muslim naam hi hai sahi bola minor used changed updated recently however ray hope court decide treat minor adult welcome delhi hell probably get years people commenting thief give years prison may someone suggest hand minor next day year say person saying punishment years life called educated people india whats wrong india viloence lack empathy complete disregard stop crime aggressive punish criminal depth searchread roots problem want quick revenge heinous crimes failure society system children learning becoming insensitive violence social media news channel children getting violated physically emotionally parents others even people comment section wants see video watch enough video become norm homophobicmisogynistic slurs photos accidents news rape violence common doesnt even affect us stop grabbing problem roots punishing minor justice revenge justice system stop future crimes punishing criminal every new crime failure current system nothing instead preventing future ones punishing person wont undo harm caused send people prison isolate us torture even educated people india seems like happy every criminal gets harsh punishment even number crimes reduce lot soul searching hidden right wrote sickening feels remorse add dancing maniacly someones dead body whats guys name bro teens days turning sadistic ever hear whats happening sweden days hes probably hafte bhi nikal skta hai aur court case years lagenge isliye rhne hi psychopath anyones parents explicitly say murder someone mine havent learned dont know remember absolute best delhi killed eligible part society honestly tired outrageous statements sub humanity knew create utopian society would done criminals exist long humanity exists create systems reduce frequencies would never go away completely take common sense know murder wrong clearly wrong head hope teach hurt others otherwise absolute pieces shit need kept away kid costs mindlessly defensive clowns like end us cause means minimum vote months treated adult commit crime well anybody age also voting rights nahh happen anime watch anime pretty calm personality boy psycho delhi shithole people cowards one must intervened sure wonder every race world came rape rule agree killers use advantage kill people following nirbhayas case updated juvenile justice act sees people ages could tried adults evaluation see mental capacity something along lines commit act need see happen jj act allows juveniles aged tried adult heinous crimes guess media attention would decide pace judgement killed fck emotions capital punishment class teacher nd grade even class teachers often used say fish market india amended juvenile justice act post nirbhaya dropping juvenile age involved heinous crimes saw video kinda fked hope never happens people care easy make statements perspective feels completely crappy people know fall victim something could avoided wasnt well wishes hope understand point tried make murders happened city august one murderer even confessed murder ig live said ig live ashamed murdering come years true needs put jail good ole time nothing less years op said must held accountable imply reduction voting age laws west people age vote drive join army drink india isme bhi log hindu muslim karrahe hai bhai pata nahi kya hoga iss desh ka could please read comment understand point dont think understood mine bro learn things inherently sense good bad parents dont teach things explicitly example parents always taught ki mahilao ki humesha izzat kia karo never told ki beta kabhi kisika murder mat karna im supposed know inherently things despite parents reprimanding kids like exam cheating dad always told mat karna kabhi bhi anyways tell fault dad failing teach properly described dad attempting teach obviously failed say true wan na hold someone accountable equal adult logical accept get rights adult say one side acknowledge responsibility adult rights adult arent mature enough thats illogical want see accountability adult give rights adult drinking related human body growth rate hence drinking age different adult age want boy roam free committing heinous crime provisions several countries prosecute case crimes recognizing minor adult mentally speciallyabled something even suggest want go correctionreformation center away failure parents get criminality make good citizen country trying say well know dont ask self question boy never one stabbed someone times enjoying underestimate human beings much still didnt make sense twice could given second thought times nah dude boy done probably wont current mental state cheerio probably wont current mental state cheerio human beings aint simple get mean isnt like cases many minors born bad parents didnt commit crimes well victims pain victims family talking suggested death sentence suggested longer jail time even eye eye thing victims family need safer environment live help process trauma mental health assistance born bad parents wrong usually positive forces surroundings help process bad parents feel think see bad parents mean parents care kids essentially commit child abuse parents simply unskilled parenting good intentions fit job think many others assumed counting well need good parent intention skill mostly intention part problem parenting really difficult task child see kinds things meet kinds people make capable living world without taking wrong side morality failed failed hard tried matter child got bad company got ruined fault prepare world end trying doesnt matter fail since victim one suffering actions arent dead sure get right kid fail others suffer man chills hell get trying say however sometimes even positive life see negative get influenced work hard light take positive hope work good life parent categories considered abuse child many ways physically mentally parents dont express good intentions softly different environment child grows plays big role thats growing age cant judge good bad straight thinking however think stabbing someone bad think raping someone victim cries agony bad need taught lot kids classroom taught similar manner kids choose wrong evil path dont know better arent mentally grown yet doesnt mean shouldnt face consequences horrible actions also may teach kid responsible time kid doesnt change even jail sentence nothing anyone help example indian one yrs old young boy raped yrs old girl killed cant blame yrs old doesnt know let someone go person crying yrs old girl died didnt anything well indian one rapists spent jail time came years target victim rape old man case korean one rapist spent years jail raping yrs kid till intestines came drunk got get house near victims surroundings area middle aged man case sexual assaults cases used example dont much information others dont mind end problem lies way society going arent taught whats needed thats causing harm form humans even understanding basic humanity issue discussing bigger problem think isnt hands anything im pretty sure youre supposed infer parents teach youve gotten fights hurt somebody hand calm kid grade never got fight th grade yeah never really teach probability getting fight young near zero wow justice system needs feel ashamed read details im sure courage watch video since hes minor dint mention article facts brother welcome india ofcourse care agendas votes issue law weak shit one scared anymore stop focusing religion dont fall gor stupid politicians agendas maybe drunk minor murdered another minor rs thats main topic thats downloaded cuz know would removed post archive sub keep surface wants engage indias national pastime checking names victim culprit see fits political agenda oooh",
    "light_cleaned_title": "Boy, 16, stabs 17-year-old over 60 times in brutal Delhi murder",
    "light_cleaned_selftext": "What the hell is happening to India!!??",
    "light_cleaned_comments": "Life has become that cheap >what the hell is happening to india? as sad as it is, i think it's the fact that these acts of utter cruelty are just being reported and there are more platforms to latch on to these horrific bits of news... doesn't make it any less harrowing he is a minor. nothing is going to happen to him. will spend two years in juvenile and then roam free iska video dekha, bhenchod pura psycho hai Link True. And he was drunk too! Sadly he will be roaming free in sometime, makes me feel scared tbh. A thief is. A thief but its brutal Bro is watching too much anime. Twitter North Indians are different breed. Link Knife kill and then Emote Tf you mean by thief is a thief. 350rs ain't worth dying. He didn't rob a bank, heck the govt is robbing us and ducking us in the ass, they ain't getting murdered Parents and high schoolers need sessions on mental well being, so that people can spot some deviant behaviours and assist the concern person in seeking help. As a country we have too few qualified Psychiatrists for our population. Om Shanti. Nothing, just the justice system has gone missing. Anyone above 15 should not be considered minor. Indian lawmakers should have learned this post Nirbhaya 2012. Fact! Agreed! Indian law needs serious update! Killed boy was a Muslim btw Yes. And any minor who commits heinous crime should be sentenced for minimum 10yrs of jail time! For death, even 25yrs! Even this is not enough for the crimes we are hearing. And the laws in general should be modified Twitter pe kaha? Bro saw the opportunity (juvenile punishment compared to adult punishment), took it and completed the sidequest as well. Naah, we are only interested if the killer is Muslim. /s sadly they never learn. Even in cases where the criminal was 2 months short of turning 18, they did not charge him and sent to juvenile. 🤦‍♀️ Search 'Kishore stabs yusuf' Bro emoted after getting the kill 💀 🤡 Sadly yeah. Like, in this post, it doesn’t even mention this fact but just reverse the positions and see what happens…. Whats that song again, \"ye dilli hai mere yaaar\" Ok bye Btw happy cake day🎉 Delhi culture💀💀 Here's the link Very true Endian kanstitution at its finest. Breaking news - **Hindutva guy brutally murders an innocent muslim in fascist bjp ruled state** This is scary This is typical Minir who is drunk is definitely more the parents fault than himself. So they can vote from 15 ? tf are you guys saying?? Common sense is achieved at the age of 7!! Granted many children develop slow but most should have developed common sense by the age of 9. Anybody who kills somebody for no good reason should be imprisoned for atleast 20 years. You literally ruined a life and affected many lives such as the lives of the victim's family members. They dont really deserve to live now do they? What happened? Only real solution to this is that ike in the US, a minor who commits murder/rape/aggravated assault leading to grievous bodily harm of the age 15 to 17 will be tried as an adult and not as a minor and will be given the same sentence as that given to an adult. Kids these days watch all kinda crap online and then try to enact it. Also how and where does a 16 year old get drunk from ? Bro pressed the emote button Anybody above the age of 12 should be held accountable for such crimes. You should meet a 12 year old kid they have very developed brains!! Being a kid does not give you the right to ruin a life and then face limited consequences. I mean even if it is a 12 year old kid he ruined many people's lives the little shit doesnt even deserve to live giving a 20 year sentence should be the minimum he gets. Killer bhi muslim tha This is the real fucking horror not ghosts. People like him. No way he is getting out he a psycho. A murderer, killer with no remorse. No way he is getting out... right? 🤡 Delhi sub folks are going to say ‘Not all men’ however such aggressive behaviour is common there. Children dont get to choose which parents they are born from. Instead of trying to hurt the minors, it would be more effective to find ways to punish the parents of the child for the acts. Probably not given that he didn't stab once and back off or appear startled. He did it again and again and again, shows lack of remorse. A normal sane person doing it in a fit of rage would back off after stabbing once, throw away the knife and run away in shock/fear. This kid is a psychopath in making or already one. Time to lock him and throw away the key. The judge should set aside his age, try him as an adult given the intensity of the crime committed like in the US. Definitely the prosecution will take into note that he stabbed not once or twice but 60 times. Also increases chance to merit insanity please. This will be a fucking miscarriage of justice for the victim's family. I saw this video reposted many times and people keep saying that the killer was a Muslim and the victim was Hindu like bruh their propaganda is like everywhere which is disgusting yeah. if i recall correctly one of the accused in the Nirbhaya incident was a minor and is roaming free after spending a year or two in juvenile. Bhai merse 500rs le leta I wonder if there is provision under Indian law to try him as an adult. The crime is a serious enough crime for that. The police says accused was earlier involved in a murder case with the intention of robbery in 2022. So, why the fuck is someone involved in murder case from the previous year roaming around freely ? He strangled the 18 year old guy, dragged him to an alley, stabbed him multiple times, walked away, came bafk and continued stabbing on his face and eyes and ears and cut his neck. And then he danced. This is not a normal 16 year old. This boy doesn't deserve to ever step out into society again. No rehabilitation. Nothing. Lock him away and throw the keys. Human life has always been cheap. This is why billionaires want us to keep having children and living in poverty. Egotism and Vengeance is all time high in our youth. They forget about the consequences of their actions and the responsibility they hold in this society. It’s dreadful and painful to hear about such incidents taking place in our nation. And then instead of working out on the root cause of the problems our political parties, doesn’t matter left wing or right wing politicise it on the basis of religion. We probably have too much of that in India, the value of life has decreased Calling india a country will be shameful at this point...it has became a fish market Indian should amend laws as per changes in society. [US LAW](https://www.legalmatch.com/law-library/article/juvenile-tried-as-an-adult.html) The following is a list of examples of state laws that concern the transferring of juvenile criminal defendants to an adult criminal court: Florida: Florida considers any minor who is under the age of 18 to be a juvenile. However, if other factors are present in a particular juvenile’s case, they can be tried as an adult as early as at 14 years of age. Florida law also leaves the decision up to the discretion of the attorney who is prosecuting the case, as opposed to judges like the laws in some other states. Illinois: Illinois defines any individual who is under the age of 17 as a minor child. However, if a juvenile is a repeat offender or if they committed a serious crime, then they can be tried as an adult as early as the age of 13. Minors between the ages of 15 and 17 can be statutorily excluded and tried as an adult if they commit violent crimes, such as first-degree murder, armed robbery, or rape. California: The state of California considers anyone who is under the age of 18 to be a minor, but juveniles can be tried as adults as early as by the age of 14 when they commit a serious or violent crime like murder or aggravated sexual assault. A minor can also be tried as an adult if they were previously tried as an adult in the past for a different crime. . Some examples of crimes that may result in a juvenile being charged and tried as an adult criminal defendant include: Serious felony offenses or violent crimes, such as first-degree murder, rape, armed robbery, drug trafficking, and so forth; Criminal acts that are classified as wobbler crimes under a particular state criminal statute; and Criminal offenses that a minor repeatedly commits and for which rehabilitation programs or a juvenile detention center has failed to prevent from recurring. bro its not the parents fault most of the times. no parent will teach their kid to murder someone or do anything bad to anyone. Bro literally emoted on his body. Severe skill issue That was a joke, I am sorry Huh ? The f you are talking about ? Parents don't need to teach their kids to murder someone. They failed to teach the kids not to murder someone. It was their job, they failed. Their fault. i need that unknown shooter back in the game \"Kishore\" Ha Muslim naam hi hai sahi bola minor used to be 16 until the 90s, then it was changed to 18. So it was updated 'recently'. However a ray of hope is court can decide to treat a minor as an adult. Welcome to Delhi He'll probably get out in 3 years People commenting but he was thief, give 25 years of prison, may be someone will suggest hand the minor. If next day, a 12 year will do the same, they will say the same. 1 person is saying that he did this because punishment is just 2 years and not life. And this is so called educated people of India. This is what's wrong with India. Viloence, lack of empathy, complete disregard to stop the crime but aggressive to punish the criminal and no depth to search/read for roots of problem but want quick revenge. This and other heinous crimes are failure of society and system. Children learning and becoming insensitive to violence from social media, news channel. Children getting violated: physically, emotionally by their parents and others. Even people in this comment section wants to see the video. Watch enough video and it will become a norm. Homophobic/misogynistic slurs, photos of accidents, news of rape, violence is so common that it doesn't even affect us. We can only stop these by grabbing the problem with its roots, not by punishing a minor. Justice is not revenge. Justice system is to stop future crimes by punishing a criminal. Every new crime is failure of our current system and we can do nothing about that instead of preventing future ones. Punishing this person won't undo the harm he has caused. We send people to prison to isolate them from us, not to torture them. But even educated people in India seems like they will be happy if every criminal gets harsh punishment even if number of crimes does not reduce. A lot of soul searching is hidden in the 'right?' you wrote. This is sickening how he feels no remorse and to add to it is dancing maniacly over someone's dead body. What’s the guys name? Bro teens these days are turning sadistic. Ever hear what's happening in sweden these days? he's 16 so probably 1 hafte me bhi nikal skta hai aur court case me years lagenge isliye rhne hi do He is a psychopath does anyone's parents explicitly say to **not** murder someone? mine haven't. i just learned that myself. don't know or remember how but just did 🍻🍻 absolute best from Delhi He should be killed, not eligible to be a part of any society I am honestly tired of such outrageous statements on the sub. If humanity knew how to create a utopian society, it would have done it by now. Criminals will exist as long as humanity exists. We can create systems to reduce the frequencies but it would never go away completely. It does not take common sense to know murder is wrong. He clearly is just wrong in the head I hope they did teach you not to hurt others. Otherwise, they are absolute pieces of shit that need to be kept away from any kid at all costs. mindlessly defensive clowns like you will be the end of us Cause 18 means 18 minimum. You cannot vote when you are 17 and 10 months. So you should not be treated as an adult when you commit a crime as well. Then anybody over the age of 12 should also have voting rights. Nahh this does not happen in anime and those who watch anime are pretty calm in personality That Boy is a psycho Delhi is such a shithole. And the people there are such cowards, no one must have intervened for sure. No wonder every race in the world came to rape and rule them. I agree with you . Most of the killers use that as an advantage to kill people . Following Nirbhaya’s case, the updated Juvenile Justice act sees to it that people between the ages of 16-18 could be tried as adults after an evaluation to see if they had the mental capacity (or something along those lines) to commit the act. So we need to see what will happen. JJ act 2015 allows for juveniles aged 16 or above to be tried as an adult in heinous crimes.. I guess media attention would decide the pace of judgement He should be killed. Fck your emotions if you are against capital punishment. my class teacher from 2nd grade? Even my class teachers often used to say \"fish market\" India had amended juvenile justice Act in 2015, post nirbhaya, dropping juvenile age to 16 for those involved in heinous crimes. Did you saw the video that was kinda fked up I hope it never happens to the people you care about. It’s very easy to make such statements from the perspective that you have. It feels completely crappy when people we know fall victim because something that could have been avoided, wasn’t. Again, only well wishes to you. I hope you understand the point I tried to make. 10-12 murders happened in my city in August . One murderer even confessed to the murder on ig live . He said on ig live that I am not ashamed of murdering him. I will come out in 1-2 years . True Needs to be put in jail for a good ole time. Nothing less than 40 years. OP said they must be held accountable which does not imply reduction in voting age. There are laws in the west where people of age can vote, drive, join the army but not drink until 21. India Isme bhi log Hindu Muslim karrahe hai bhai, pata nahi kya hoga iss desh ka could you please read my comment again? i understand your point, but i don't think you understood mine. bro you learn some things inherently. you have a sense of what is good what is bad. Parents dont have to teach some things explicitly. example- my parents always taught me ki mahilao ki humesha izzat kia karo, but they never told me ki beta kabhi kisika murder mat karna, because that i'm supposed to know inherently. Then again there are things which despite their parents' reprimanding, kids do, like exam me cheating my dad always told me mat karna kabhi bhi, but i did it anyways, tell me who is at fault here? Your dad for failing to teach you properly. What you have described is your dad ATTEMPTING to teach you. He obviously failed if what you say is true. If you wanna hold someone accountable equal to an adult, then it is logical to accept that they get the rights of an adult. you cannot say on one side that 'we acknowledge that you have the responsibility of an adult' but then 'you do not have the rights of an adult because you arent mature enough'. Thats illogical. If you want to see accountability of an adult, then give them the rights of an adult. As for drinking, its related to the human body and its growth rate. Hence, the drinking age is different from adult age. So, you want this boy to roam free after committing such a heinous crime? There are provisions in several countries to prosecute in case of such crimes by recognizing the minor an adult. Are you mentally specially-abled or something to even suggest this? I want him to go to a correction/reformation center, away from his failure parents, to get that criminality out of him and make him a good citizen for the country. What are you trying to say. You very well know! If you don't then ask your self my question again! This boy will never be one. He stabbed someone 60 times and was enjoying it. you underestimate human beings too much. Still didnt make sense. Once or twice, I could have given it a second thought. 60 times? Nah, dude. This boy is done for. Probably wont in that current mental state! Cheerio! Probably won't in that current mental state! Cheerio! Human beings aint that simple. I get what you mean, but it isn't like that in all cases. And there are many minors who are born to bad parents and didn't commit crimes as well. And What about victims pain? What about victims family? You are talking as if I suggested death sentence. I only suggested a longer jail time. It's not even some eye to eye thing. Victim's family need a safer environment to live in and help process the trauma. Mental health assistance. As for those born to bad parents and did not do wrong, usually there are some positive forces in their surroundings that help them process it. And 'bad parents' that I feel you think is not the same as what I see. Bad parents mean - 1) Parents that do not care about the kids at all and essentially commit child abuse. OR 2) Parents who are simply unskilled at parenting. Good intentions, but not fit for the job. I think you and many others just assumed it to be just (1). I am counting (2) in it as well. What you need to be a good parent is both - intention + skill. Mostly the intention part is not the problem. Parenting is a really difficult task. Your child will see all kinds of things, meet all kinds of people. You have to make them capable of living in the world without taking the wrong side of morality. If you failed, then you failed. How hard you tried does not matter. If your child got into bad company and got ruined, its your fault because you did not prepare them for the world. At the end, trying doesnt matter if you fail since the victim is the one suffering from your actions. If you arent 100% dead sure to get it right, do not have a kid. If you fail, others will suffer. Man , this chills the hell out of me.... Again I get what you are trying to say. However, sometimes even if there is 5% positive in life, some only see 95% negative and get influenced by it. And those who work hard for light will take that 5% positive as hope and work for good in life. And parent 1 and 2 categories are not same at all, how can they be considered same? Those who abuse child in many ways, physically, mentally are not same as those parents who don't express their good intentions softly. Both are very different. The environment the child grows up plays a big role, that's why during growing age, they can't judge good or bad with straight thinking. However, if they think stabbing someone is not bad, if they think raping someone while the victim cries with agony is not bad, then they need to be taught a lot. All kids in classroom are taught in similar manner, so why those some kids choose this wrong evil path?? While they don't know any better and aren't mentally grown yet, doesn't mean they shouldn't face the consequences of their horrible actions. It also may teach the kid about being responsible for what they do, at the same time, if the kid doesn't change even after the jail sentence. Then there is nothing anyone can do to help. For example, Indian one: some 7-8yrs old young boy raped 5yrs old girl and killed her. You can't blame 7yrs old here, doesn't he know to let someone go when the person is crying? so what about 5yrs old girl who died? She didn't do anything as well. Indian one: the rapists who spent jail time came out after few years only to target the victim and rape her again. Some 20s old man in this case. Korean one: the rapist who spent 10 or so years in jail for raping a 7yrs kid till her intestines came out while drunk got out only to get a house near the victims surroundings area, middle aged man here in this case. These are all only sexual assaults cases I used for example because I don't have much information on others. So don't mind it. At the end, the problem lies in the way society is going. We aren't being taught what's needed and that's causing more harm in the form of humans who are not even understanding basic humanity. The issue we are discussing about has bigger problem than we think and isn't in out hands to do anything about it. im pretty sure you're supposed to infer that yourself and the parents teach you after you've gotten into fights to not hurt somebody. i on the other hand was the most calm kid of my grade and never got into a fight until 10th grade. so yeah, they never really had to teach it to me as the probability of me getting into a fight when i was young was near zero Wow. The justice system needs to feel ashamed! No, but I read the details about what all he did. I'm not sure I have the courage to watch the video... Since he's a \"minor\", they dint mention it in the article. Facts brother. Welcome to India* Ofcourse. They only care about their agendas and votes. That is the issue, the law is so weak and shit that no one is scared anymore. How about we stop focusing on the religion? Don't fall gor these stupid politicians agendas maybe?? A drunk minor murdered another minor just over 350Rs. That's the main topic. That's all! I downloaded it cuz i know it would be removed will post in some archive sub to keep it on the surface He just wants to engage in India’s national pastime of checking names of victim and culprit to see if it fits their political agenda. 💀💀Oooh"
}