{
    "id": "15sop23",
    "title": "Met a proud Sanatani",
    "url": "https://www.reddit.com/gallery/15sop23",
    "selftext": "So i totally understand my mistake making a bad joke under a serious video. So this guy tabb999 made a new account I don't know for what reason but he commented me under a video in r/inidanostalgia about that he wants to talk I asked him many questions before accepting his chat request and so he started that he is a sanatani and he like edgy humour but after he send me(3rd photo 1st chat) so i didn't reply to him just hide him(I should have blocked him) because don't want to talk about hindu vs muslim or women hating, but that shit made him angry and u can ur self see that last comment in the third photo. \nP. S. I don't hate any muslim just don't like some islamic ideologies + I am very sorry for that comment and sorry for being an idiot edgy teen",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692189314.0,
    "convurl": "https://i.redd.it/7ceqxpfmvgib1.jpg",
    "comments": [
        "Naali ka keeda has a life worth than yours.",
        "Well, this isn't a lone wolf incident when it comes to that sub. It's filled with hate mongering right wingers.",
        "So is he k2wa larping as hindu right"
    ],
    "cleaned_text": "met proud sanatani totally understand mistake making bad joke serious video guy tabb made new account dont know reason commented video rinidanostalgia wants talk asked many questions accepting chat request started sanatani like edgy humour send merd photo st chat didnt reply hide himi blocked dont want talk hindu vs muslim women hating shit made angry u ur self see last comment third photo p dont hate muslim dont like islamic ideologies sorry comment sorry idiot edgy teen ",
    "cleaned_title": "met proud sanatani",
    "cleaned_selftext": "totally understand mistake making bad joke serious video guy tabb made new account dont know reason commented video rinidanostalgia wants talk asked many questions accepting chat request started sanatani like edgy humour send merd photo st chat didnt reply hide himi blocked dont want talk hindu vs muslim women hating shit made angry u ur self see last comment third photo p dont hate muslim dont like islamic ideologies sorry comment sorry idiot edgy teen",
    "cleaned_comments": "naali ka keeda life worth well isnt lone wolf incident comes sub filled hate mongering right wingers kwa larping hindu right",
    "light_cleaned_title": "Met a proud Sanatani",
    "light_cleaned_selftext": "So i totally understand my mistake making a bad joke under a serious video. So this guy tabb999 made a new account I don't know for what reason but he commented me under a video in r/inidanostalgia about that he wants to talk I asked him many questions before accepting his chat request and so he started that he is a sanatani and he like edgy humour but after he send me(3rd photo 1st chat) so i didn't reply to him just hide him(I should have blocked him) because don't want to talk about hindu vs muslim or women hating, but that shit made him angry and u can ur self see that last comment in the third photo. P. S. I don't hate any muslim just don't like some islamic ideologies + I am very sorry for that comment and sorry for being an idiot edgy teen",
    "light_cleaned_comments": "Naali ka keeda has a life worth than yours. Well, this isn't a lone wolf incident when it comes to that sub. It's filled with hate mongering right wingers. So is he k2wa larping as hindu right"
}