{
    "id": "1hazell",
    "title": "I'm truly shaken to my core (Atual Subhash's suicide)",
    "url": "https://www.reddit.com/r/india/comments/1hazell/im_truly_shaken_to_my_core_atual_subhashs_suicide/",
    "selftext": "I had been following their case for about a month, and finally saw it all end today.\n\n[https://x.com/peepoye\\_/status/1866347116647301619](https://x.com/peepoye_/status/1866347116647301619)  \n[https://thelogicalindian.com/wp-content/uploads/2024/12/Suicide-Note.pdf](https://thelogicalindian.com/wp-content/uploads/2024/12/Suicide-Note.pdf)\n\nI read as well as watched all that was there to, and I am in grave shock as to how is this even possible? I have no words for this. My hands feel a little shaky and my legs slightly numb as a type this. Is this where we're going? Everyday I see a new (and many-a-times false) case filed against someone's boyfriend / ex-boyfriend / husband / ex-husband, and the accusers get away with this as easily as breathing. I hope there is something we can do, some petition of sorts? This man, if not brought to justice, will stand as \"motivation\" for further exploitations and false cases to happen.\n\nI sincerely hope he gets the justice he deserves. Rest in peace, Atul. We can't blame you for leaving this cruel world.",
    "flair": "Law & Courts",
    "score": 74,
    "num_comments": 22,
    "created_utc": 1733828918.0,
    "convurl": "https://external-preview.redd.it/URbOTV9Py5qP0lYijxeA6hZG2Lgg1cgTvbms2NxXcPQ.jpg?auto=webp&s=f7b5e91da0e7ec67d45d6e65cd8bf0d96669a8d3",
    "comments": [
        "there is nothing to be shocked about , the thing is that this news got highlighted and just see the amount of married men suicide",
        "Yes, I have been seeing them as I investigated into this case. It's shocking for me, at least, because it's something relatively new to me.",
        "most people dont know about this too",
        "I will be honest men life doesn't matter in front of our judicial system",
        "Exactly why I made this post.",
        "I can assure you that this won't be picked up by mainstream media, just because it doesn't have the \"typical\" victim. Like vile and evil people have some particular gender. I hope his death wasn't in vain but deep down I know nothing will change. Our death doesn't matter....just another percentage or statistic",
        "Some men don't deserve life, but the measures taken to punish them are being misused by such cruel people. In the end, they often turn out to be much worse than the type of man for whom such measures were made in the first place.\n\n(I tried to word it properly, but it's a bit confusing, sorry! I hope you understood what I'm saying.)",
        "Why was the original post on the subreddit removed ?",
        "Mine has been removed as well. Reason- already discussed in another sub. Well I guess one discussion is enough for something like this 😔",
        "Exactly. But I'll never stop hoping and praying he gets justice. He deserves it so much.",
        "Thats sad",
        "The hour long video and his elaborative suicide letter is gut wrenching. Judiciary in our country is a fuckin joke, forget about rights there is not an iota of humanity in these people at power. And those evil scumbags who misuse these laws and power for their benefits. The system is far from repair. \n\nMay Atul rest in peace. And all those bastards be held responsible.",
        "qualify it with 'ordinary men' please. \n\nThere are men who get their wives free IPL team stocks and then kill them - both when it suits them and then nothing happens.",
        "Yes, that's what we mean here. Not trying to generalize all men or women alike. As I mentioned in my previous comment, **some** men don't deserve life, and the innocent ones have it snatched from them one way or the other, by misusing the laws made to keep the **some** men under control.",
        "Some men don't deserve life? You can phrase it as some people as it should include everyone right?.... because you are doing same as the screwd up system right?",
        "I mean it in the sense that there are special provisions for r\\*pe or domestic abuse cases, to hold the man accountable and punish him.\n\nCrime has no gender, I know that, but the special provisions are made against men only, as far as I've seen. Logically men can't be r\\*ped by women! I meant my comment in this sense.",
        "Please read the whole comment. \"Some men don't deserve life\" isn't an independent statement I'm making.",
        "I hope laws should be gender neutral may be atleast not judge every man as guilty as soon as someone accuses them....\n\nI am willing to accept there are evil men who deserve punishment worse than death....but can we agree we should atleast acknowledge that not every woman that accuses a man is not always does it in good faith",
        "Yes I understand your sentiment ...there is no question about that ...I'm only saying you could have phrased it differently I did not mean any disrespect I completely understand your stand wording could have been different is what I meant",
        "It has been taken up by text media. Not sure about TV folks. But no massive outrage enough to bring government attention to it, sadly.\n\nCouldn't the mfer screaming \"mujhe drug do\" take this up? Atleast his shouting will be for a valid cause",
        "Agreed. But as you see in this case, the laws played less of a role than the corruption. The judge, knowing the complete truth, was fed money from the woman (the money she unrightfully extorted from Mr. Atul). She could have stopped it, she could have saved his life and brought justice but she chose money over and over.\n\nBut yes, gender neutral laws are very much needed, as well as strict action against corruption. How ironic though, those who enforce policies against corruption are corrupt themselves. It's a vicious cycle."
    ],
    "cleaned_text": "im truly shaken core atual subhashs suicide following case month finally saw end today httpsxcompeepoyestatushttpsxcompeepoyestatus httpsthelogicalindiancomwpcontentuploadssuicidenotepdfhttpsthelogicalindiancomwpcontentuploadssuicidenotepdf read well watched grave shock even possible words hands feel little shaky legs slightly numb type going everyday see new manyatimes false case filed someones boyfriend exboyfriend husband exhusband accusers get away easily breathing hope something petition sorts man brought justice stand motivation exploitations false cases happen sincerely hope gets justice deserves rest peace atul cant blame leaving cruel world ",
    "cleaned_title": "im truly shaken core atual subhashs suicide",
    "cleaned_selftext": "following case month finally saw end today httpsxcompeepoyestatushttpsxcompeepoyestatus httpsthelogicalindiancomwpcontentuploadssuicidenotepdfhttpsthelogicalindiancomwpcontentuploadssuicidenotepdf read well watched grave shock even possible words hands feel little shaky legs slightly numb type going everyday see new manyatimes false case filed someones boyfriend exboyfriend husband exhusband accusers get away easily breathing hope something petition sorts man brought justice stand motivation exploitations false cases happen sincerely hope gets justice deserves rest peace atul cant blame leaving cruel world",
    "cleaned_comments": "nothing shocked thing news got highlighted see amount married men suicide yes seeing investigated case shocking least something relatively new people dont know honest men life doesnt matter front judicial system exactly made post assure wont picked mainstream media doesnt typical victim like vile evil people particular gender hope death wasnt vain deep know nothing change death doesnt matterjust another percentage statistic men dont deserve life measures taken punish misused cruel people end often turn much worse type man measures made first place tried word properly bit confusing sorry hope understood im saying original post subreddit removed mine removed well reason already discussed another sub well guess one discussion enough something like exactly ill never stop hoping praying gets justice deserves much thats sad hour long video elaborative suicide letter gut wrenching judiciary country fuckin joke forget rights iota humanity people power evil scumbags misuse laws power benefits system far repair may atul rest peace bastards held responsible qualify ordinary men please men get wives free ipl team stocks kill suits nothing happens yes thats mean trying generalize men women alike mentioned previous comment men dont deserve life innocent ones snatched one way misusing laws made keep men control men dont deserve life phrase people include everyone right screwd system right mean sense special provisions rpe domestic abuse cases hold man accountable punish crime gender know special provisions made men far ive seen logically men cant rped women meant comment sense please read whole comment men dont deserve life isnt independent statement im making hope laws gender neutral may atleast judge every man guilty soon someone accuses willing accept evil men deserve punishment worse deathbut agree atleast acknowledge every woman accuses man always good faith yes understand sentiment question im saying could phrased differently mean disrespect completely understand stand wording could different meant taken text media sure tv folks massive outrage enough bring government attention sadly couldnt mfer screaming mujhe drug take atleast shouting valid cause agreed see case laws played less role corruption judge knowing complete truth fed money woman money unrightfully extorted mr atul could stopped could saved life brought justice chose money yes gender neutral laws much needed well strict action corruption ironic though enforce policies corruption corrupt vicious cycle",
    "light_cleaned_title": "I'm truly shaken to my core (Atual Subhash's suicide)",
    "light_cleaned_selftext": "I had been following their case for about a month, and finally saw it all end today. [https://x.com/peepoye\\_/status/1866347116647301619](https://x.com/peepoye_/status/1866347116647301619) [https://thelogicalindian.com/wp-content/uploads/2024/12/Suicide-Note.pdf](https://thelogicalindian.com/wp-content/uploads/2024/12/Suicide-Note.pdf) I read as well as watched all that was there to, and I am in grave shock as to how is this even possible? I have no words for this. My hands feel a little shaky and my legs slightly numb as a type this. Is this where we're going? Everyday I see a new (and many-a-times false) case filed against someone's boyfriend / ex-boyfriend / husband / ex-husband, and the accusers get away with this as easily as breathing. I hope there is something we can do, some petition of sorts? This man, if not brought to justice, will stand as \"motivation\" for further exploitations and false cases to happen. I sincerely hope he gets the justice he deserves. Rest in peace, Atul. We can't blame you for leaving this cruel world.",
    "light_cleaned_comments": "there is nothing to be shocked about , the thing is that this news got highlighted and just see the amount of married men suicide Yes, I have been seeing them as I investigated into this case. It's shocking for me, at least, because it's something relatively new to me. most people dont know about this too I will be honest men life doesn't matter in front of our judicial system Exactly why I made this post. I can assure you that this won't be picked up by mainstream media, just because it doesn't have the \"typical\" victim. Like vile and evil people have some particular gender. I hope his death wasn't in vain but deep down I know nothing will change. Our death doesn't matter....just another percentage or statistic Some men don't deserve life, but the measures taken to punish them are being misused by such cruel people. In the end, they often turn out to be much worse than the type of man for whom such measures were made in the first place. (I tried to word it properly, but it's a bit confusing, sorry! I hope you understood what I'm saying.) Why was the original post on the subreddit removed ? Mine has been removed as well. Reason- already discussed in another sub. Well I guess one discussion is enough for something like this 😔 Exactly. But I'll never stop hoping and praying he gets justice. He deserves it so much. Thats sad The hour long video and his elaborative suicide letter is gut wrenching. Judiciary in our country is a fuckin joke, forget about rights there is not an iota of humanity in these people at power. And those evil scumbags who misuse these laws and power for their benefits. The system is far from repair. May Atul rest in peace. And all those bastards be held responsible. qualify it with 'ordinary men' please. There are men who get their wives free IPL team stocks and then kill them - both when it suits them and then nothing happens. Yes, that's what we mean here. Not trying to generalize all men or women alike. As I mentioned in my previous comment, **some** men don't deserve life, and the innocent ones have it snatched from them one way or the other, by misusing the laws made to keep the **some** men under control. Some men don't deserve life? You can phrase it as some people as it should include everyone right?.... because you are doing same as the screwd up system right? I mean it in the sense that there are special provisions for r\\*pe or domestic abuse cases, to hold the man accountable and punish him. Crime has no gender, I know that, but the special provisions are made against men only, as far as I've seen. Logically men can't be r\\*ped by women! I meant my comment in this sense. Please read the whole comment. \"Some men don't deserve life\" isn't an independent statement I'm making. I hope laws should be gender neutral may be atleast not judge every man as guilty as soon as someone accuses them.... I am willing to accept there are evil men who deserve punishment worse than death....but can we agree we should atleast acknowledge that not every woman that accuses a man is not always does it in good faith Yes I understand your sentiment ...there is no question about that ...I'm only saying you could have phrased it differently I did not mean any disrespect I completely understand your stand wording could have been different is what I meant It has been taken up by text media. Not sure about TV folks. But no massive outrage enough to bring government attention to it, sadly. Couldn't the mfer screaming \"mujhe drug do\" take this up? Atleast his shouting will be for a valid cause Agreed. But as you see in this case, the laws played less of a role than the corruption. The judge, knowing the complete truth, was fed money from the woman (the money she unrightfully extorted from Mr. Atul). She could have stopped it, she could have saved his life and brought justice but she chose money over and over. But yes, gender neutral laws are very much needed, as well as strict action against corruption. How ironic though, those who enforce policies against corruption are corrupt themselves. It's a vicious cycle."
}