{
    "id": "1575yd9",
    "title": "Does anyone know which app could be triggering this ?",
    "url": "https://www.reddit.com/gallery/1575yd9",
    "selftext": "I have been getting this popup in icici and hdfc app and have Uninstalled a lot of apps since then to figure out what could be causing this. Has anyone else faced this issue ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690089977.0,
    "convurl": "https://i.redd.it/eokt3ww7hndb1.jpg",
    "comments": [
        "Go to the permissions in the settings and see which apps has screen recording/sharing permissions and then remove it.",
        "None of the apps has this permission, checked a few times already :-o",
        "Uninstall and reinstall the app. If the issue still persists, turn off Developer Mode and check if any application has administrator privileges.",
        "Install m kabach 2 app its a government app to find malicious apps and software.scan it using it",
        "Go to permissions and turn off permission to run apps in the background.",
        "Check all background apps and permissions. If you find nothing be very careful. Download an antivirus and if needed go to a store.",
        "Lauda mai kisi sarkari app pe trust karra",
        "I think it's because some app has the permission to display over other apps.",
        "Hdfc app is a bug itself they are launching a new one 🔜",
        "This right here.  I think you can find it under accessibility features too",
        "Go in settings and manage app in sub menu select list all apps and look for an app with no name. \nThere are some malwares that get installed as an app with blank logo and blank name.",
        "Disable all of your accessibility features... Because some of this services can read your screen all the time...",
        "U should break the screen right now, it's really dangerous",
        "Any desk.",
        "TeamViewer",
        "Try resetting app preferences",
        "I used to get the same alert while sharing my screen on Discord.",
        "Makes sense, lemme check this out, thanks",
        "It's the same with icici as well so not an app specific thing",
        "Thanks, found 1 matching this description. Uninstalled!",
        "Crazy number of apps had this option enabled, disabled for all.",
        "seems like ether you have anydesk or teamviewer installed on your mobile phone."
    ],
    "cleaned_text": "anyone know app could triggering getting popup icici hdfc app uninstalled lot apps since figure could causing anyone else faced issue ",
    "cleaned_title": "anyone know app could triggering",
    "cleaned_selftext": "getting popup icici hdfc app uninstalled lot apps since figure could causing anyone else faced issue",
    "cleaned_comments": "go permissions settings see apps screen recordingsharing permissions remove none apps permission checked times already uninstall reinstall app issue still persists turn developer mode check application administrator privileges install kabach app government app find malicious apps softwarescan using go permissions turn permission run apps background check background apps permissions find nothing careful download antivirus needed go store lauda mai kisi sarkari app pe trust karra think app permission display apps hdfc app bug launching new one right think find accessibility features go settings manage app sub menu select list apps look app name malwares get installed app blank logo blank name disable accessibility features services read screen time u break screen right really dangerous desk teamviewer try resetting app preferences used get alert sharing screen discord makes sense lem check thanks icici well app specific thing thanks found matching description uninstalled crazy number apps option enabled disabled seems like ether anydesk teamviewer installed mobile phone",
    "light_cleaned_title": "Does anyone know which app could be triggering this ?",
    "light_cleaned_selftext": "I have been getting this popup in icici and hdfc app and have Uninstalled a lot of apps since then to figure out what could be causing this. Has anyone else faced this issue ?",
    "light_cleaned_comments": "Go to the permissions in the settings and see which apps has screen recording/sharing permissions and then remove it. None of the apps has this permission, checked a few times already :-o Uninstall and reinstall the app. If the issue still persists, turn off Developer Mode and check if any application has administrator privileges. Install m kabach 2 app its a government app to find malicious apps and software.scan it using it Go to permissions and turn off permission to run apps in the background. Check all background apps and permissions. If you find nothing be very careful. Download an antivirus and if needed go to a store. Lauda mai kisi sarkari app pe trust karra I think it's because some app has the permission to display over other apps. Hdfc app is a bug itself they are launching a new one 🔜 This right here. I think you can find it under accessibility features too Go in settings and manage app in sub menu select list all apps and look for an app with no name. There are some malwares that get installed as an app with blank logo and blank name. Disable all of your accessibility features... Because some of this services can read your screen all the time... U should break the screen right now, it's really dangerous Any desk. TeamViewer Try resetting app preferences I used to get the same alert while sharing my screen on Discord. Makes sense, lemme check this out, thanks It's the same with icici as well so not an app specific thing Thanks, found 1 matching this description. Uninstalled! Crazy number of apps had this option enabled, disabled for all. seems like ether you have anydesk or teamviewer installed on your mobile phone."
}