{
    "id": "1e007u3",
    "title": "Shrinking informal economy rings alarm bells for jobs in India",
    "url": "https://www.livemint.com/economy/informal-economy-jobs-employment-gst-covid-manufacturing-sector-trade-small-businesses/amp-11720607620718.html",
    "selftext": "The losses for India may have mounted to ₹11.5 trillion in seven years.",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 1,
    "created_utc": 1720629191.0,
    "convurl": "https://external-preview.redd.it/FOSJfS5Gg7IhUXaZLas5AC94NYEaF9b0aVIygDlgl5A.jpg?auto=webp&s=d2c1c7eb46a670969425cf9adfcab68c617b250b",
    "comments": [
        "1st headline: \"Shrinking informal economy rings alarm bells in Modi government!\"\n\nEditor: \"Not true\"\n\n2nd headline: \"Shrinking informal economy rings alarm bells in corporate India\"\n\nEditor: \"You gotta be joking!\"\n\n3rd headline: \"Ok..umm...Shrinking informal economy rings alarm bells among economists?\"\n\nEditor: \"Nuh uh\"\n\n4th headline: \"Shrinking informal economy rings alarm bells among Indians?\"\n\nEditor: \"Haha that was a good one that was\"\n\n5th headline: \"How abt...Shrinking informal economy rings alarm bells for jobs in India?\"\n\nEditor: \"That's the one!\""
    ],
    "cleaned_text": "shrinking informal economy rings alarm bells jobs india losses india may mounted trillion seven years ",
    "cleaned_title": "shrinking informal economy rings alarm bells jobs india",
    "cleaned_selftext": "losses india may mounted trillion seven years",
    "cleaned_comments": "st headline shrinking informal economy rings alarm bells modi government editor true nd headline shrinking informal economy rings alarm bells corporate india editor got ta joking rd headline okummshrinking informal economy rings alarm bells among economists editor nuh uh th headline shrinking informal economy rings alarm bells among indians editor haha good one th headline abtshrinking informal economy rings alarm bells jobs india editor thats one",
    "light_cleaned_title": "Shrinking informal economy rings alarm bells for jobs in India",
    "light_cleaned_selftext": "The losses for India may have mounted to ₹11.5 trillion in seven years.",
    "light_cleaned_comments": "1st headline: \"Shrinking informal economy rings alarm bells in Modi government!\" Editor: \"Not true\" 2nd headline: \"Shrinking informal economy rings alarm bells in corporate India\" Editor: \"You gotta be joking!\" 3rd headline: \"Ok..umm...Shrinking informal economy rings alarm bells among economists?\" Editor: \"Nuh uh\" 4th headline: \"Shrinking informal economy rings alarm bells among Indians?\" Editor: \"Haha that was a good one that was\" 5th headline: \"How abt...Shrinking informal economy rings alarm bells for jobs in India?\" Editor: \"That's the one!\""
}