{
    "id": "qir4ex",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/qir4ex/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 17,
    "num_comments": 38,
    "created_utc": 1635557411,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "I am happy that Curb your Enthusiasm's new season has started.",
        "Any crime thriller movie recommendations?",
        "Watch Searching on Netflix and then come back here to thank me....",
        "If you can watch Korean movies- \n\nMemories of Murder, Mother, Burning are some good crime thrillers. Confession of murder is alright, I did not like it too much.",
        "I have watched it already. Thanks for the recommendation though. It's a good thriller.",
        "Watched [Thinkalazhcha Nishchayam](https://www.imdb.com/title/tt12091980/) a malayalam movie on SonyLiv.\nVery good would recommend. Writing was superb.",
        "Operation Java",
        "Ishq (Malayalam 2019). Don't go by the name. It's a pretty different kind of a  crime thriller. No spoiler, except that it gets gripping after 20 mins into the movie.\n\nIt's on Prime Videos.",
        "'The Medium'.. Amazing Thai horror movie.. Soon somebody in Hollywood or bollywood might remake this",
        "The Man From Nowhere\n\nOldboy",
        "Watched \n\n**The Man From Nowhere** - Cool. I can see John Wick was inspired by this. 9/10\n\n**Daredevil Season 2** - Brilliant, Charlie Cox/Daredevil and Jon Bernthal/Punisher absolutely killed it(hah). Vincent/Kingpin is perfect as usual . 10/10\n\n**Luke Cage Season 1** - Mike Colter is ok. Pops actor was funny. Mahershala Ali is brilliant as cottonmouth. Diamondback is a crap character but the actor is really good. Hope he gets a good role in the future. Disappointing show overall in terms of plot. 6/10\n\n**Iron Fist Season 1** - Absolute dogshit. Only the actress who played Colleen is worth anything. Butchered Iron Fist. The Meachums storyline was fun though. Harold Meachum was scary. Overall dogshit. 3/10\n\n**Defenders** - I am conflicted . The heroes are pretty good. Even Iron Fist. Fights are awesome. Plot is dogshit though. The Hand is lame and ending was lame. End Credits give me hope though\n\n**Punisher Season 1** - Absolutely brilliant. It was perfect. John Bernthal is an amazing Punisher and actor overall. 10/10 . Look forward to Punisher Season 2 and Daredevil Season 3. Although I will watch Luke Cage Season 2  and Iron Fist Season 2 and probably Jessica Jones first.",
        "I hated Daredevil season 2 especially the Elektra and the ninjas plot.\n\nDaredevil season 3 was amazing though.",
        "As I said. The Hand was crap . In Daredevil , Iron Fist and in Defenders. But I rated Daredevil Season 2 for the other things.",
        "Jessica Jones season 1 is awesome",
        "Clue (1997, Japanese)",
        "I have seen it. I meant s2 and s3",
        "Listening to Stephen fry 7 deadly sins. This man is so amazing in story telling and knowledge.",
        "Watching the Sleepy Hollow tv series. It is quite good so far.",
        "If you have the stomach for it, watch Oldboy, the original Korean version. It's an epic masterpiece of despair and action. And when you finish it, listen the song Yeh Hai Meri Kahaani by Strings. The song is outstanding and was used in the okay-ish Hindi remake of the film.",
        "Litte late but watched Uddham Singh yesterday. It was great. The Jallianwala Bhag massacre scene was heartbreaking. Amol Parashar as Bhagat Singh was a fresh take. Bollywood has always showed the nationalism of the great revolutionary Bhagat Singh. But this time it showed the socialism, humanism and Marxism along with his nationalism. Please do watch if you haven't already.",
        "Punisher and Daredevil has been cancelled by Netflix.",
        "I know. I meant Punisher Season 2 and Daredevil Season 3.\n\nAlso Daredevil might get Season 4 in Disney + with Echo as protag",
        "good indian lovestory movie ?, south north language no problem .",
        "Anupama, just Anupama",
        "Kappela(Malayalam). It's on Netflix.\n\nBangalore Days (also Malayalam)",
        "thanks : )",
        "2 hours 40 mins looks a bit of a stretch.",
        "Ikr, it's actually good. Feels kinda different from other daily soaps (except the occasional crying). The characters are really fleshed out somewhat.",
        "sardar udham is quite good if someone here hasn't watched it already",
        "Hey, thank me only if you like them. Then may be i will recommend you more.",
        "Yeah. They could have condensed it a bit. But overall its worth the watch.",
        "Your namesake book is also quite good, if you haven't read it already",
        "I have. also, SU is a new movie that's why I recommended it",
        "I've watched them both earlier. Would love for you to recommend morr",
        "I was quite disappointed by Sardar Udham. I don't know what's with this new trend of making movies in a non-linear timeline, but this should only be done when it serves some purpose to the story. I thought it would be a good movie to watch together with family. But the way they jumped from one scene to another, the generation in my family who are more used to linear storytelling were not able to keep track of what's happening. \n\nIt was such a good story with huge potential, but it lost an entire generation of viewers just because the director wanted to present it in a different format.",
        "I watched Sarpatta Parambarai on suggestion from a friend. Watched with subtitles. I highly recommend it if u haven't watched already. A slow burner. But, just Wow. Hands down Movie of the year. I probably would have enjoyed it more had I known the language.",
        "I highly recommend Sarpatta Parambarai",
        "Ustaad Hotel may be. Not as good as these ones, but still decent."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "happy curb enthusiasms new season started crime thriller movie recommendations watch searching netflix come back thank watch korean movies memories murder mother burning good crime thrillers confession murder alright like much watched already thanks recommendation though good thriller watched thinkalazhcha nishchayamhttpswwwimdbcomtitlett malayalam movie sonyliv good would recommend writing superb operation java ishq malayalam dont go name pretty different kind crime thriller spoiler except gets gripping mins movie prime videos medium amazing thai horror movie soon somebody hollywood bollywood might remake man nowhere oldboy watched man nowhere cool see john wick inspired daredevil season brilliant charlie coxdaredevil jon bernthalpunisher absolutely killed ithah vincentkingpin perfect usual luke cage season mike colter ok pops actor funny mahershala ali brilliant cottonmouth diamondback crap character actor really good hope gets good role future disappointing show overall terms plot iron fist season absolute dogshit actress played colleen worth anything butchered iron fist meachums storyline fun though harold meachum scary overall dogshit defenders conflicted heroes pretty good even iron fist fights awesome plot dogshit though hand lame ending lame end credits give hope though punisher season absolutely brilliant perfect john bernthal amazing punisher actor overall look forward punisher season daredevil season although watch luke cage season iron fist season probably jessica jones first hated daredevil season especially elektra ninjas plot daredevil season amazing though said hand crap daredevil iron fist defenders rated daredevil season things jessica jones season awesome clue japanese seen meant listening stephen fry deadly sins man amazing story telling knowledge watching sleepy hollow tv series quite good far stomach watch oldboy original korean version epic masterpiece despair action finish listen song yeh hai meri kahaani strings song outstanding used okayish hindi remake film litte late watched uddham singh yesterday great jallianwala bhag massacre scene heartbreaking amol parashar bhagat singh fresh take bollywood always showed nationalism great revolutionary bhagat singh time showed socialism humanism marxism along nationalism please watch havent already punisher daredevil cancelled netflix know meant punisher season daredevil season also daredevil might get season disney echo protag good indian lovestory movie south north language problem anupama anupama kappelamalayalam netflix bangalore days also malayalam thanks hours mins looks bit stretch ikr actually good feels kinda different daily soaps except occasional crying characters really fleshed somewhat sardar udham quite good someone hasnt watched already hey thank like may recommend yeah could condensed bit overall worth watch namesake book also quite good havent read already also su new movie thats recommended ive watched earlier would love recommend morr quite disappointed sardar udham dont know whats new trend making movies nonlinear timeline done serves purpose story thought would good movie watch together family way jumped one scene another generation family used linear storytelling able keep track whats happening good story huge potential lost entire generation viewers director wanted present different format watched sarpatta parambarai suggestion friend watched subtitles highly recommend u havent watched already slow burner wow hands movie year probably would enjoyed known language highly recommend sarpatta parambarai ustaad hotel may good ones still decent",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I am happy that Curb your Enthusiasm's new season has started. Any crime thriller movie recommendations? Watch Searching on Netflix and then come back here to thank me.... If you can watch Korean movies- Memories of Murder, Mother, Burning are some good crime thrillers. Confession of murder is alright, I did not like it too much. I have watched it already. Thanks for the recommendation though. It's a good thriller. Watched [Thinkalazhcha Nishchayam](https://www.imdb.com/title/tt12091980/) a malayalam movie on SonyLiv. Very good would recommend. Writing was superb. Operation Java Ishq (Malayalam 2019). Don't go by the name. It's a pretty different kind of a crime thriller. No spoiler, except that it gets gripping after 20 mins into the movie. It's on Prime Videos. 'The Medium'.. Amazing Thai horror movie.. Soon somebody in Hollywood or bollywood might remake this The Man From Nowhere Oldboy Watched **The Man From Nowhere** - Cool. I can see John Wick was inspired by this. 9/10 **Daredevil Season 2** - Brilliant, Charlie Cox/Daredevil and Jon Bernthal/Punisher absolutely killed it(hah). Vincent/Kingpin is perfect as usual . 10/10 **Luke Cage Season 1** - Mike Colter is ok. Pops actor was funny. Mahershala Ali is brilliant as cottonmouth. Diamondback is a crap character but the actor is really good. Hope he gets a good role in the future. Disappointing show overall in terms of plot. 6/10 **Iron Fist Season 1** - Absolute dogshit. Only the actress who played Colleen is worth anything. Butchered Iron Fist. The Meachums storyline was fun though. Harold Meachum was scary. Overall dogshit. 3/10 **Defenders** - I am conflicted . The heroes are pretty good. Even Iron Fist. Fights are awesome. Plot is dogshit though. The Hand is lame and ending was lame. End Credits give me hope though **Punisher Season 1** - Absolutely brilliant. It was perfect. John Bernthal is an amazing Punisher and actor overall. 10/10 . Look forward to Punisher Season 2 and Daredevil Season 3. Although I will watch Luke Cage Season 2 and Iron Fist Season 2 and probably Jessica Jones first. I hated Daredevil season 2 especially the Elektra and the ninjas plot. Daredevil season 3 was amazing though. As I said. The Hand was crap . In Daredevil , Iron Fist and in Defenders. But I rated Daredevil Season 2 for the other things. Jessica Jones season 1 is awesome Clue (1997, Japanese) I have seen it. I meant s2 and s3 Listening to Stephen fry 7 deadly sins. This man is so amazing in story telling and knowledge. Watching the Sleepy Hollow tv series. It is quite good so far. If you have the stomach for it, watch Oldboy, the original Korean version. It's an epic masterpiece of despair and action. And when you finish it, listen the song Yeh Hai Meri Kahaani by Strings. The song is outstanding and was used in the okay-ish Hindi remake of the film. Litte late but watched Uddham Singh yesterday. It was great. The Jallianwala Bhag massacre scene was heartbreaking. Amol Parashar as Bhagat Singh was a fresh take. Bollywood has always showed the nationalism of the great revolutionary Bhagat Singh. But this time it showed the socialism, humanism and Marxism along with his nationalism. Please do watch if you haven't already. Punisher and Daredevil has been cancelled by Netflix. I know. I meant Punisher Season 2 and Daredevil Season 3. Also Daredevil might get Season 4 in Disney + with Echo as protag good indian lovestory movie ?, south north language no problem . Anupama, just Anupama Kappela(Malayalam). It's on Netflix. Bangalore Days (also Malayalam) thanks : ) 2 hours 40 mins looks a bit of a stretch. Ikr, it's actually good. Feels kinda different from other daily soaps (except the occasional crying). The characters are really fleshed out somewhat. sardar udham is quite good if someone here hasn't watched it already Hey, thank me only if you like them. Then may be i will recommend you more. Yeah. They could have condensed it a bit. But overall its worth the watch. Your namesake book is also quite good, if you haven't read it already I have. also, SU is a new movie that's why I recommended it I've watched them both earlier. Would love for you to recommend morr I was quite disappointed by Sardar Udham. I don't know what's with this new trend of making movies in a non-linear timeline, but this should only be done when it serves some purpose to the story. I thought it would be a good movie to watch together with family. But the way they jumped from one scene to another, the generation in my family who are more used to linear storytelling were not able to keep track of what's happening. It was such a good story with huge potential, but it lost an entire generation of viewers just because the director wanted to present it in a different format. I watched Sarpatta Parambarai on suggestion from a friend. Watched with subtitles. I highly recommend it if u haven't watched already. A slow burner. But, just Wow. Hands down Movie of the year. I probably would have enjoyed it more had I known the language. I highly recommend Sarpatta Parambarai Ustaad Hotel may be. Not as good as these ones, but still decent."
}