{
    "id": "1clewgl",
    "title": "IFF’s cybersecurity report for the first quarter of 2024 #PlugTheBreach | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1clewgl/iffs_cybersecurity_report_for_the_first_quarter/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/jtyj951bzryc1.jpg?width=1600&format=pjpg&auto=webp&s=298fc10004b3ce8df3707da4c2eea940dee183f6\n\n \n\n## tl;dr \n\nRecent data breaches and leaks have  underscored the widespread impact on the data security of millions of  users. Prolonged cybersecurity incidents, like the S3WaaS vulnerability,  have raised concerns about the detection and response capabilities of  India’s cybersecurity authorities. This series, which will include  quarterly reports of IFF’s work on data breaches and vulnerabilities,  will list the various cybersecurity incidents that occurred in the  country as well as our actions in response to them. We highlight the  need for organisations to prioritise proactive measures, transparency,  and public awareness to mitigate risks and foster cyber resilience in an  interconnected digital world.\n\n## The grim state of cybersecurity in India\n\nThe urgent need to operationalise the [Digital Personal Data Protection Act (“DPDPA”), 2023](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in)  is underscored by the increasingly pervasive threats to individuals’  digital privacy and security. As technology advances, so do the methods  and scale of cyberattacks, leaving individuals and organisations  vulnerable to data breaches, identity theft, and surveillance. A  comprehensive, robust, and rights-respecting data protection legislation  is essential to establish clear guidelines, regulations, and  enforcement mechanisms to safeguard personal information, ensure  transparency in data handling practices, and hold entities accountable  for any lapses in cybersecurity protocols. The inadequacies of the  DPDPA, 2023 in safeguarding data privacy and empowering data principals  in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in)  state of cybersecurity in the country reveal concerning gaps and  vulnerabilities. Despite efforts to bolster cybersecurity measures,  including establishing dedicated agencies and initiatives, challenges  such as insufficient resources, outdated infrastructure, and a shortage  of skilled professionals persist. The [recent exemption](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/?ref=static.internetfreedom.in)  of the Indian Computer Emergency Response Team (“CERT-In”) from the  Right to Information (“RTI”) Act, 2005 raises serious concerns about the  accountability of an organisation whose actions or inaction is  consequential for the status of cyber security and individual privacy in  the country.  This move is certainly not in the public interest as it  weakens the rights of the people by diluting an Act meant to empower  them. \n\n## Data breaches and vulnerabilities in 2024 Q1\n\n**Sparsh Portal data leak:** A reported [data breach](https://www.business-standard.com/india-news/govt-pension-portal-for-defence-personnel-sparsh-suffers-data-breach-124011000128_1.html?ref=static.internetfreedom.in) compromised the [SPARSH portal](https://sparsh.defencepension.gov.in/?ref=static.internetfreedom.in),  which is used to manage the pensions of defence personnel. Sensitive  information such as usernames, passwords, and pension numbers of  numerous personnel, mainly from Kerala, had been exposed. This breach,  linked to the 'lumma' malware, underscores vulnerabilities in the Tata  Consultancy Services-developed portal. The data’s appearance on a  Russian marketplace also raised concerns about potential misuse. We  wrote a [letter](https://drive.google.com/file/d/1saYziL2X6a9encIgW7t2Rp3jh4Gxi1sg/view?usp=sharing&ref=static.internetfreedom.in)  to CERT-In, the nodal authority assigned to overlook data breaches,  bringing this breach to their notice and urging for an enquiry as well  as appropriate remedy to the affected users. \n\n**Vulnerability in the Hyundai Motor India Database:** According to [TechCrunch](https://techcrunch.com/2024/01/11/hyundai-motor-india-data-exposed/?ref=static.internetfreedom.in),  the personal data of Hyundai Motor India customers was exposed due to a  bug in their system. Despite Hyundai's fix, concerns persisted as the  company denied providing information regarding any misuse of the bug.  The bug leaked customer details, including names, addresses, emails,  vehicle specifics, and phone numbers, especially for those using  authorised service stations. Web links shared by Hyundai with customers  inadvertently also exposed their phone numbers. Read our letter to  CERT-In [here](https://drive.google.com/file/d/1T4NzIXjCE5f4sOOW2nrAw15D7hC_C6iR/view?usp=sharing&ref=static.internetfreedom.in). \n\n**Data leak of an Indian mobile network database**: CloudSEK, a cybersecurity firm, confirmed a [massive data leak](https://www.business-standard.com/companies/news/personal-information-of-750-mn-indians-up-for-sale-on-dark-web-cloudsek-124012500973_1.html?ref=static.internetfreedom.in)  from an Indian mobile network database. According to reports, a  1.8-terabyte database containing the personal details of 750 million  individuals was being sold on the dark web by a threat actor known as  ‘CyboDevil’. The leaked information included names, mobile numbers,  addresses, and Aadhaar details, affecting approximately 85% of the  population. The breach reportedly impacted all major telecom companies  after analysing sample data provided by the threat actor. Despite  inquiries, the threat actor denied involvement, attributing data  acquisition to undisclosed sources within law enforcement. As per the  report, “An email sent to CERT-In, a government nodal agency for  cybersecurity, elicited no response till the time of going to press.”  Read our letter to CERT-In [here](https://drive.google.com/file/d/1NivPCl-obWhWNSA_QCxpnQCSb5V0K__H/view?usp=drive_link&ref=static.internetfreedom.in). \n\n**Data breach of FreshMenu**: A [significant data breach](https://www.techcircle.in/2024/01/25/bengaluru-based-freshmenu-exposes-data-of-3-5-mn-users-report?ref=static.internetfreedom.in)  reportedly affected FreshMenu, a Bengaluru-based food delivery  platform. Reports indicated that a threat actor had accessed and exposed  over 3.5 million order details containing personal information such as  phone numbers, emails, names, billing and shipping addresses, and IP  addresses due to an unprotected 26 GB MongoDB database. Despite  notification by the Cybernews research team on December 14, 2023,  FreshMenu did not respond to inquiries or comment on the breach. Read  our letter to CERT-In [here](https://drive.google.com/file/d/1meyd8ZFZDC5h55FTFr4u74TMwOMp-Kfw/view?usp=drive_link&ref=static.internetfreedom.in). \n\n**Data breach of UP Marriage Assistance Scheme site**: According to [India Today](https://www.indiatoday.in/india/story/breach-of-up-marriage-scheme-site-results-in-fraud-of-over-rs-1-crore-2496980-2024-02-03?ref=static.internetfreedom.in),  unidentified perpetrators executed a cyber fraud exceeding Rs 1 crore  by breaching the web portal of Uttar Pradesh’s Marriage Assistance  Scheme. The breach compromised the ID of the Additional Labour  Commissioner, facilitating fraudulent payments via the Uttar Pradesh  Building and Other Construction Workers Welfare Board's portal, which  administered the Scheme. The breach affected portals UPLMIS.in and  sna.uplmis. This resulted in double payments to ineligible  beneficiaries, totalling over Rs 1,07,80,000. Allegedly, the actors  submitted over 250 applications within two days, transferring funds from  the accounts of 196 individuals. IFF wrote to CERT-In and received a  prompt response thanking us for informing them of the breach and  assuring us of their involvement in the matter. Read our letter to  CERT-In [here](https://drive.google.com/file/d/1rAL68l_Q5EGqKSIQB1ffyc9D_-3gfLg9/view?usp=drive_link&ref=static.internetfreedom.in).\n\n**Data breach of documents containing data from EPFO, Indian PMO, and other public and private organisations:** The  data breach reportedly impacted datasets from the Prime Minister’s  Office (“PMO”), the Employees’ Provident Fund Organisation (“EPFO”), and  other public and private organisations. ​​According to the [Economic Times](https://economictimes.indiatimes.com/tech/technology/epfo-pmo-data-breach-centre-says-aware-of-reports-cert-in-looking-into-details/articleshow/107870171.cms?from=mdr&ref=static.internetfreedom.in),  the government was investigating reports of a breach allegedly  including data from these entities at the time of reporting. Documents  purportedly leaked on social media platform X (formerly Twitter) claimed  to contain data from EPFO, PMO, and other organisations. Senior  officials informed that CERT-In was tasked with verifying these claims.  Cybersecurity experts were also examining the situation, though there  was no concrete evidence beyond the attackers' claims at the time of the  report. Read our letter to CERT-In [here](https://drive.google.com/file/d/1UCBEflmVUn3wCEhN5VB-8TrwmZ7WEs5n/view?usp=drive_link&ref=static.internetfreedom.in).\n\n**Data breach at boAt:** A significant data breach recently affected the Indian consumer wearable brand, boAt. According to [Business Standard](https://www.business-standard.com/companies/news/boat-suffers-data-breach-personal-data-of-75-lakh-users-leaked-on-dark-web-124040801022_1.html?ref=static.internetfreedom.in),  the breach exposed personal data of over 7.5 million users, allegedly  orchestrated by a hacker known as ShopifyGUY. Sensitive information such  as names, addresses, phone numbers, email addresses, and customer IDs  have been compromised, with approximately 2 gigabytes of data made  available on dark web forums. The company boAt acknowledged the  incident, initiated a thorough investigation to safeguard customer data,  and affirmed that protecting customer information is their utmost  priority. Read our letter to CERT-In [here](https://drive.google.com/file/d/1CBCZZ-iY3L-LBIZmeAqW05e0C-4QCF22/view?usp=drive_link&ref=static.internetfreedom.in).\n\n**S3WaaS Vulnerability:** The  'Secure, Scalable and Sugamya Website as a Service' (S3WaaS) platform  of the Government of India, developed for hosting government websites,  faced a [significant vulnerability](https://techcrunch.com/2024/04/02/indian-government-cloud-spilled-citizens-personal-data-online-for-years/?ref=static.internetfreedom.in)  in January 2022. Security researcher Sourajeet Majumder discovered that  the flaw could potentially lead to the exposure of sensitive personal  data of around 2,50,000 Indian citizens, primarily COVID-19 vaccine  beneficiaries. Upon Sourajeet’s request, IFF alerted CERT-In about the  security flaw twice, in [January](https://streaklinks.com/B5iaLhNNjdWyzgrW6g6sCred/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1gK4-k5a8WdsA33DpEkzGpMaWb-tGDD-C%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) and [March](https://streaklinks.com/B5iaLhRUFLtNke491gVaJaQL/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1je_jc54aV2i3Fv18toBB8EQhjybbk7-j%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) 2022. CERT-In acknowledged the email and responded promptly [both](https://drive.google.com/file/d/1nimm4u5HnJWEOPrO7U6l48PfRk-4Lodd/view?usp=drive_link&ref=static.internetfreedom.in) [times](https://drive.google.com/file/d/1FM263-h9gsNPMOBjXhjPsqVnZfJKZ_h5/view?usp=sharing&ref=static.internetfreedom.in). We also [notified](https://streaklinks.com/B5iaLhRzM2EPwggDewinzoF9/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1a2YqMBbnyXccXatyrQsQbI-K0NCfEARX%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in)  the National Informatics Centre (“NIC”) but they did not respond.  Despite alerts and correspondence with CERT-In and NIC, the breach  persisted until March 2024, when Sourajeet confirmed its resolution.  Read our explainer about this vulnerability [here](https://internetfreedom.in/vulnerability-in-a-government-cloud-service/?ref=static.internetfreedom.in).\n\n## PlugTheBreach: IFF’s data breach tracker\n\nYou can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/?ref=static.internetfreedom.in),  a small-scale IFF initiative aimed at covering, reporting, and tracking  data breaches in India to increase transparency and public awareness. \n\n## Conclusion \n\nThe multitude of [recent data breaches and leaks](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE)  underscores the critical importance of robust cybersecurity measures in  today's digital landscape. From breaches compromising sensitive defence  personnel information to vulnerabilities in major databases and  platforms, these incidents highlight the pervasive risks individuals and  organisations face. \n\nIn these challenges, organisations must  prioritise proactive cybersecurity measures, including regular audits,  robust encryption protocols, and swift incident response procedures.  Moreover, there's an urgent need for greater transparency and  accountability in handling data breaches, as seen in cases where  affected companies failed to acknowledge or adequately address the  breaches promptly. \n\nPublic awareness and education on  cybersecurity best practices also play a vital role in mitigating risks  and fostering a culture of cyber resilience. Thus, as we navigate an  increasingly interconnected digital world, we must remain vigilant and  proactive in safeguarding our digital assets and protecting user  privacy. \n\n## ",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1714987918.0,
    "convurl": "https://external-preview.redd.it/JLQTDE03-3ZOsQNt2_ETj9MbM54qJUqCfkGXEcOR5ao.jpg?auto=webp&s=756420ba9ea1735f961cc586ecb24a8c4d4ed03e",
    "comments": [],
    "cleaned_text": "iffs cybersecurity report first quarter plugthebreach internet freedom foundation xb tldr recent data breaches leaks underscored widespread impact data security millions users prolonged cybersecurity incidents like swaas vulnerability raised concerns detection response capabilities indias cybersecurity authorities series include quarterly reports iffs work data breaches vulnerabilities list various cybersecurity incidents occurred country well actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist recent exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiactrefstaticinternetfreedomin indian computer emergency response team certin right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q sparsh portal data leak reported data breachhttpswwwbusinessstandardcomindianewsgovtpensionportalfordefencepersonnelsparshsuffersdatabreachhtmlrefstaticinternetfreedomin compromised sparsh portalhttpssparshdefencepensiongovinrefstaticinternetfreedomin used manage pensions defence personnel sensitive information usernames passwords pension numbers numerous personnel mainly kerala exposed breach linked lumma malware underscores vulnerabilities tata consultancy servicesdeveloped portal datas appearance russian marketplace also raised concerns potential misuse wrote letterhttpsdrivegooglecomfiledsayzilxaencigwtrpjhgxisgviewuspsharingrefstaticinternetfreedomin certin nodal authority assigned overlook data breaches bringing breach notice urging enquiry well appropriate remedy affected users vulnerability hyundai motor india database according techcrunchhttpstechcrunchcomhyundaimotorindiadataexposedrefstaticinternetfreedomin personal data hyundai motor india customers exposed due bug system despite hyundais fix concerns persisted company denied providing information regarding misuse bug bug leaked customer details including names addresses emails vehicle specifics phone numbers especially using authorised service stations web links shared hyundai customers inadvertently also exposed phone numbers read letter certin herehttpsdrivegooglecomfiledtnzixjcefsoownrawdhccirviewuspsharingrefstaticinternetfreedomin data leak indian mobile network database cloudsek cybersecurity firm confirmed massive data leakhttpswwwbusinessstandardcomcompaniesnewspersonalinformationofmnindiansupforsaleondarkwebcloudsekhtmlrefstaticinternetfreedomin indian mobile network database according reports terabyte database containing personal details million individuals sold dark web threat actor known cybodevil leaked information included names mobile numbers addresses aadhaar details affecting approximately population breach reportedly impacted major telecom companies analysing sample data provided threat actor despite inquiries threat actor denied involvement attributing data acquisition undisclosed sources within law enforcement per report email sent certin government nodal agency cybersecurity elicited response till time going press read letter certin herehttpsdrivegooglecomfilednivpclobwhwnsaqcxpnqcsbvkhviewuspdrivelinkrefstaticinternetfreedomin data breach freshmenu significant data breachhttpswwwtechcircleinbengalurubasedfreshmenuexposesdataofmnusersreportrefstaticinternetfreedomin reportedly affected freshmenu bengalurubased food delivery platform reports indicated threat actor accessed exposed million order details containing personal information phone numbers emails names billing shipping addresses ip addresses due unprotected gb mongodb database despite notification cybernews research team december freshmenu respond inquiries comment breach read letter certin herehttpsdrivegooglecomfiledmeydzfzdchftfrutmwompkfwviewuspdrivelinkrefstaticinternetfreedomin data breach marriage assistance scheme site according india todayhttpswwwindiatodayinindiastorybreachofupmarriageschemesiteresultsinfraudofoverrscrorerefstaticinternetfreedomin unidentified perpetrators executed cyber fraud exceeding rs crore breaching web portal uttar pradeshs marriage assistance scheme breach compromised id additional labour commissioner facilitating fraudulent payments via uttar pradesh building construction workers welfare boards portal administered scheme breach affected portals uplmisin snauplmis resulted double payments ineligible beneficiaries totalling rs allegedly actors submitted applications within two days transferring funds accounts individuals iff wrote certin received prompt response thanking us informing breach assuring us involvement matter read letter certin herehttpsdrivegooglecomfiledrallqegqksiqbffycdgflgviewuspdrivelinkrefstaticinternetfreedomin data breach documents containing data epfo indian pmo public private organisations data breach reportedly impacted datasets prime ministers office pmo employees provident fund organisation epfo public private organisations according economic timeshttpseconomictimesindiatimescomtechtechnologyepfopmodatabreachcentresaysawareofreportscertinlookingintodetailsarticleshowcmsfrommdrrefstaticinternetfreedomin government investigating reports breach allegedly including data entities time reporting documents purportedly leaked social media platform x formerly twitter claimed contain data epfo pmo organisations senior officials informed certin tasked verifying claims cybersecurity experts also examining situation though concrete evidence beyond attackers claims time report read letter certin herehttpsdrivegooglecomfileducbeflmvunwcehnvbtrwmzwesnviewuspdrivelinkrefstaticinternetfreedomin data breach boat significant data breach recently affected indian consumer wearable brand boat according business standardhttpswwwbusinessstandardcomcompaniesnewsboatsuffersdatabreachpersonaldataoflakhusersleakedondarkwebhtmlrefstaticinternetfreedomin breach exposed personal data million users allegedly orchestrated hacker known shopifyguy sensitive information names addresses phone numbers email addresses customer ids compromised approximately gigabytes data made available dark web forums company boat acknowledged incident initiated thorough investigation safeguard customer data affirmed protecting customer information utmost priority read letter certin herehttpsdrivegooglecomfiledcbczziyllbizmeaqwecqcfviewuspdrivelinkrefstaticinternetfreedomin swaas vulnerability secure scalable sugamya website service swaas platform government india developed hosting government websites faced significant vulnerabilityhttpstechcrunchcomindiangovernmentcloudspilledcitizenspersonaldataonlineforyearsrefstaticinternetfreedomin january security researcher sourajeet majumder discovered flaw could potentially lead exposure sensitive personal data around indian citizens primarily covid vaccine beneficiaries upon sourajeets request iff alerted certin security flaw twice januaryhttpsstreaklinkscombialhnnjdwyzgrwgscredhttpsaffdrivegooglecomffilefdfgkkawdsadpekzgpmawbtgddcfviewfuspdsharingrefstaticinternetfreedomin marchhttpsstreaklinkscombialhrufltnkegvajaqlhttpsaffdrivegooglecomffilefdfjejcavifvtobbeqhjybbkjfviewfuspdsharingrefstaticinternetfreedomin certin acknowledged email responded promptly bothhttpsdrivegooglecomfilednimmuhnjweoproulpfrkloddviewuspdrivelinkrefstaticinternetfreedomin timeshttpsdrivegooglecomfiledfmhgsnpmobjxhjpsqvnzfjkzhviewuspsharingrefstaticinternetfreedomin also notifiedhttpsstreaklinkscombialhrzmepwggdewinzofhttpsaffdrivegooglecomffilefdfayqmbbnyxccxatyrqsqbikncfearxfviewfuspdsharingrefstaticinternetfreedomin national informatics centre nic respond despite alerts correspondence certin nic breach persisted march sourajeet confirmed resolution read explainer vulnerability herehttpsinternetfreedominvulnerabilityinagovernmentcloudservicerefstaticinternetfreedomin plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive defence personnel information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy ",
    "cleaned_title": "iffs cybersecurity report first quarter plugthebreach internet freedom foundation",
    "cleaned_selftext": "xb tldr recent data breaches leaks underscored widespread impact data security millions users prolonged cybersecurity incidents like swaas vulnerability raised concerns detection response capabilities indias cybersecurity authorities series include quarterly reports iffs work data breaches vulnerabilities list various cybersecurity incidents occurred country well actions response highlight need organisations prioritise proactive measures transparency public awareness mitigate risks foster cyber resilience interconnected digital world grim state cybersecurity india urgent need operationalise digital personal data protection act dpdpa httpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting data protection legislation essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist recent exemptionhttpsinternetfreedominstatementexemptionofcertinfromthertiactrefstaticinternetfreedomin indian computer emergency response team certin right information rti act raises serious concerns accountability organisation whose actions inaction consequential status cyber security individual privacy country move certainly public interest weakens rights people diluting act meant empower data breaches vulnerabilities q sparsh portal data leak reported data breachhttpswwwbusinessstandardcomindianewsgovtpensionportalfordefencepersonnelsparshsuffersdatabreachhtmlrefstaticinternetfreedomin compromised sparsh portalhttpssparshdefencepensiongovinrefstaticinternetfreedomin used manage pensions defence personnel sensitive information usernames passwords pension numbers numerous personnel mainly kerala exposed breach linked lumma malware underscores vulnerabilities tata consultancy servicesdeveloped portal datas appearance russian marketplace also raised concerns potential misuse wrote letterhttpsdrivegooglecomfiledsayzilxaencigwtrpjhgxisgviewuspsharingrefstaticinternetfreedomin certin nodal authority assigned overlook data breaches bringing breach notice urging enquiry well appropriate remedy affected users vulnerability hyundai motor india database according techcrunchhttpstechcrunchcomhyundaimotorindiadataexposedrefstaticinternetfreedomin personal data hyundai motor india customers exposed due bug system despite hyundais fix concerns persisted company denied providing information regarding misuse bug bug leaked customer details including names addresses emails vehicle specifics phone numbers especially using authorised service stations web links shared hyundai customers inadvertently also exposed phone numbers read letter certin herehttpsdrivegooglecomfiledtnzixjcefsoownrawdhccirviewuspsharingrefstaticinternetfreedomin data leak indian mobile network database cloudsek cybersecurity firm confirmed massive data leakhttpswwwbusinessstandardcomcompaniesnewspersonalinformationofmnindiansupforsaleondarkwebcloudsekhtmlrefstaticinternetfreedomin indian mobile network database according reports terabyte database containing personal details million individuals sold dark web threat actor known cybodevil leaked information included names mobile numbers addresses aadhaar details affecting approximately population breach reportedly impacted major telecom companies analysing sample data provided threat actor despite inquiries threat actor denied involvement attributing data acquisition undisclosed sources within law enforcement per report email sent certin government nodal agency cybersecurity elicited response till time going press read letter certin herehttpsdrivegooglecomfilednivpclobwhwnsaqcxpnqcsbvkhviewuspdrivelinkrefstaticinternetfreedomin data breach freshmenu significant data breachhttpswwwtechcircleinbengalurubasedfreshmenuexposesdataofmnusersreportrefstaticinternetfreedomin reportedly affected freshmenu bengalurubased food delivery platform reports indicated threat actor accessed exposed million order details containing personal information phone numbers emails names billing shipping addresses ip addresses due unprotected gb mongodb database despite notification cybernews research team december freshmenu respond inquiries comment breach read letter certin herehttpsdrivegooglecomfiledmeydzfzdchftfrutmwompkfwviewuspdrivelinkrefstaticinternetfreedomin data breach marriage assistance scheme site according india todayhttpswwwindiatodayinindiastorybreachofupmarriageschemesiteresultsinfraudofoverrscrorerefstaticinternetfreedomin unidentified perpetrators executed cyber fraud exceeding rs crore breaching web portal uttar pradeshs marriage assistance scheme breach compromised id additional labour commissioner facilitating fraudulent payments via uttar pradesh building construction workers welfare boards portal administered scheme breach affected portals uplmisin snauplmis resulted double payments ineligible beneficiaries totalling rs allegedly actors submitted applications within two days transferring funds accounts individuals iff wrote certin received prompt response thanking us informing breach assuring us involvement matter read letter certin herehttpsdrivegooglecomfiledrallqegqksiqbffycdgflgviewuspdrivelinkrefstaticinternetfreedomin data breach documents containing data epfo indian pmo public private organisations data breach reportedly impacted datasets prime ministers office pmo employees provident fund organisation epfo public private organisations according economic timeshttpseconomictimesindiatimescomtechtechnologyepfopmodatabreachcentresaysawareofreportscertinlookingintodetailsarticleshowcmsfrommdrrefstaticinternetfreedomin government investigating reports breach allegedly including data entities time reporting documents purportedly leaked social media platform x formerly twitter claimed contain data epfo pmo organisations senior officials informed certin tasked verifying claims cybersecurity experts also examining situation though concrete evidence beyond attackers claims time report read letter certin herehttpsdrivegooglecomfileducbeflmvunwcehnvbtrwmzwesnviewuspdrivelinkrefstaticinternetfreedomin data breach boat significant data breach recently affected indian consumer wearable brand boat according business standardhttpswwwbusinessstandardcomcompaniesnewsboatsuffersdatabreachpersonaldataoflakhusersleakedondarkwebhtmlrefstaticinternetfreedomin breach exposed personal data million users allegedly orchestrated hacker known shopifyguy sensitive information names addresses phone numbers email addresses customer ids compromised approximately gigabytes data made available dark web forums company boat acknowledged incident initiated thorough investigation safeguard customer data affirmed protecting customer information utmost priority read letter certin herehttpsdrivegooglecomfiledcbczziyllbizmeaqwecqcfviewuspdrivelinkrefstaticinternetfreedomin swaas vulnerability secure scalable sugamya website service swaas platform government india developed hosting government websites faced significant vulnerabilityhttpstechcrunchcomindiangovernmentcloudspilledcitizenspersonaldataonlineforyearsrefstaticinternetfreedomin january security researcher sourajeet majumder discovered flaw could potentially lead exposure sensitive personal data around indian citizens primarily covid vaccine beneficiaries upon sourajeets request iff alerted certin security flaw twice januaryhttpsstreaklinkscombialhnnjdwyzgrwgscredhttpsaffdrivegooglecomffilefdfgkkawdsadpekzgpmawbtgddcfviewfuspdsharingrefstaticinternetfreedomin marchhttpsstreaklinkscombialhrufltnkegvajaqlhttpsaffdrivegooglecomffilefdfjejcavifvtobbeqhjybbkjfviewfuspdsharingrefstaticinternetfreedomin certin acknowledged email responded promptly bothhttpsdrivegooglecomfilednimmuhnjweoproulpfrkloddviewuspdrivelinkrefstaticinternetfreedomin timeshttpsdrivegooglecomfiledfmhgsnpmobjxhjpsqvnzfjkzhviewuspsharingrefstaticinternetfreedomin also notifiedhttpsstreaklinkscombialhrzmepwggdewinzofhttpsaffdrivegooglecomffilefdfayqmbbnyxccxatyrqsqbikncfearxfviewfuspdsharingrefstaticinternetfreedomin national informatics centre nic respond despite alerts correspondence certin nic breach persisted march sourajeet confirmed resolution read explainer vulnerability herehttpsinternetfreedominvulnerabilityinagovernmentcloudservicerefstaticinternetfreedomin plugthebreach iffs data breach tracker find list nonexhaustive data breaches country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness conclusion multitude recent data breaches leakshttpsumbrellaciscocominfothreattrendsreportcryptominingmalwarephishingtrojansutmmediumsearchpaidutmsourcegoogleutmcampaignumbapjcinengsnonbrandthreatsutmcontentumbfyqcontentebookcybersecuritythreattrendsbtbkcyberthreatlandscapebmpbngbggadsourcegclidcjwkcajwopowbhaeeiwajuxrhnjxequzpgokihwcrvfmakihisjptbxovjibjzlqtbocwjeqavdbwe underscores critical importance robust cybersecurity measures todays digital landscape breaches compromising sensitive defence personnel information vulnerabilities major databases platforms incidents highlight pervasive risks individuals organisations face challenges organisations must prioritise proactive cybersecurity measures including regular audits robust encryption protocols swift incident response procedures moreover theres urgent need greater transparency accountability handling data breaches seen cases affected companies failed acknowledge adequately address breaches promptly public awareness education cybersecurity best practices also play vital role mitigating risks fostering culture cyber resilience thus navigate increasingly interconnected digital world must remain vigilant proactive safeguarding digital assets protecting user privacy",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF’s cybersecurity report for the first quarter of 2024 #PlugTheBreach | Internet Freedom Foundation",
    "light_cleaned_selftext": "&#x200B; ## tl;dr Recent data breaches and leaks have underscored the widespread impact on the data security of millions of users. Prolonged cybersecurity incidents, like the S3WaaS vulnerability, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. This series, which will include quarterly reports of IFF’s work on data breaches and vulnerabilities, will list the various cybersecurity incidents that occurred in the country as well as our actions in response to them. We highlight the need for organisations to prioritise proactive measures, transparency, and public awareness to mitigate risks and foster cyber resilience in an interconnected digital world. ## The grim state of cybersecurity in India The urgent need to operationalise the [Digital Personal Data Protection Act (“DPDPA”), 2023](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) is underscored by the increasingly pervasive threats to individuals’ digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting data protection legislation is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The [recent exemption](https://internetfreedom.in/statement-exemption-of-cert-in-from-the-rti-act/?ref=static.internetfreedom.in) of the Indian Computer Emergency Response Team (“CERT-In”) from the Right to Information (“RTI”) Act, 2005 raises serious concerns about the accountability of an organisation whose actions or inaction is consequential for the status of cyber security and individual privacy in the country. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them. ## Data breaches and vulnerabilities in 2024 Q1 **Sparsh Portal data leak:** A reported [data breach](https://www.business-standard.com/india-news/govt-pension-portal-for-defence-personnel-sparsh-suffers-data-breach-124011000128_1.html?ref=static.internetfreedom.in) compromised the [SPARSH portal](https://sparsh.defencepension.gov.in/?ref=static.internetfreedom.in), which is used to manage the pensions of defence personnel. Sensitive information such as usernames, passwords, and pension numbers of numerous personnel, mainly from Kerala, had been exposed. This breach, linked to the 'lumma' malware, underscores vulnerabilities in the Tata Consultancy Services-developed portal. The data’s appearance on a Russian marketplace also raised concerns about potential misuse. We wrote a [letter](https://drive.google.com/file/d/1saYziL2X6a9encIgW7t2Rp3jh4Gxi1sg/view?usp=sharing&ref=static.internetfreedom.in) to CERT-In, the nodal authority assigned to overlook data breaches, bringing this breach to their notice and urging for an enquiry as well as appropriate remedy to the affected users. **Vulnerability in the Hyundai Motor India Database:** According to [TechCrunch](https://techcrunch.com/2024/01/11/hyundai-motor-india-data-exposed/?ref=static.internetfreedom.in), the personal data of Hyundai Motor India customers was exposed due to a bug in their system. Despite Hyundai's fix, concerns persisted as the company denied providing information regarding any misuse of the bug. The bug leaked customer details, including names, addresses, emails, vehicle specifics, and phone numbers, especially for those using authorised service stations. Web links shared by Hyundai with customers inadvertently also exposed their phone numbers. Read our letter to CERT-In [here](https://drive.google.com/file/d/1T4NzIXjCE5f4sOOW2nrAw15D7hC_C6iR/view?usp=sharing&ref=static.internetfreedom.in). **Data leak of an Indian mobile network database**: CloudSEK, a cybersecurity firm, confirmed a [massive data leak](https://www.business-standard.com/companies/news/personal-information-of-750-mn-indians-up-for-sale-on-dark-web-cloudsek-124012500973_1.html?ref=static.internetfreedom.in) from an Indian mobile network database. According to reports, a 1.8-terabyte database containing the personal details of 750 million individuals was being sold on the dark web by a threat actor known as ‘CyboDevil’. The leaked information included names, mobile numbers, addresses, and Aadhaar details, affecting approximately 85% of the population. The breach reportedly impacted all major telecom companies after analysing sample data provided by the threat actor. Despite inquiries, the threat actor denied involvement, attributing data acquisition to undisclosed sources within law enforcement. As per the report, “An email sent to CERT-In, a government nodal agency for cybersecurity, elicited no response till the time of going to press.” Read our letter to CERT-In [here](https://drive.google.com/file/d/1NivPCl-obWhWNSA_QCxpnQCSb5V0K__H/view?usp=drive_link&ref=static.internetfreedom.in). **Data breach of FreshMenu**: A [significant data breach](https://www.techcircle.in/2024/01/25/bengaluru-based-freshmenu-exposes-data-of-3-5-mn-users-report?ref=static.internetfreedom.in) reportedly affected FreshMenu, a Bengaluru-based food delivery platform. Reports indicated that a threat actor had accessed and exposed over 3.5 million order details containing personal information such as phone numbers, emails, names, billing and shipping addresses, and IP addresses due to an unprotected 26 GB MongoDB database. Despite notification by the Cybernews research team on December 14, 2023, FreshMenu did not respond to inquiries or comment on the breach. Read our letter to CERT-In [here](https://drive.google.com/file/d/1meyd8ZFZDC5h55FTFr4u74TMwOMp-Kfw/view?usp=drive_link&ref=static.internetfreedom.in). **Data breach of UP Marriage Assistance Scheme site**: According to [India Today](https://www.indiatoday.in/india/story/breach-of-up-marriage-scheme-site-results-in-fraud-of-over-rs-1-crore-2496980-2024-02-03?ref=static.internetfreedom.in), unidentified perpetrators executed a cyber fraud exceeding Rs 1 crore by breaching the web portal of Uttar Pradesh’s Marriage Assistance Scheme. The breach compromised the ID of the Additional Labour Commissioner, facilitating fraudulent payments via the Uttar Pradesh Building and Other Construction Workers Welfare Board's portal, which administered the Scheme. The breach affected portals UPLMIS.in and sna.uplmis. This resulted in double payments to ineligible beneficiaries, totalling over Rs 1,07,80,000. Allegedly, the actors submitted over 250 applications within two days, transferring funds from the accounts of 196 individuals. IFF wrote to CERT-In and received a prompt response thanking us for informing them of the breach and assuring us of their involvement in the matter. Read our letter to CERT-In [here](https://drive.google.com/file/d/1rAL68l_Q5EGqKSIQB1ffyc9D_-3gfLg9/view?usp=drive_link&ref=static.internetfreedom.in). **Data breach of documents containing data from EPFO, Indian PMO, and other public and private organisations:** The data breach reportedly impacted datasets from the Prime Minister’s Office (“PMO”), the Employees’ Provident Fund Organisation (“EPFO”), and other public and private organisations. ​​According to the [Economic Times](https://economictimes.indiatimes.com/tech/technology/epfo-pmo-data-breach-centre-says-aware-of-reports-cert-in-looking-into-details/articleshow/107870171.cms?from=mdr&ref=static.internetfreedom.in), the government was investigating reports of a breach allegedly including data from these entities at the time of reporting. Documents purportedly leaked on social media platform X (formerly Twitter) claimed to contain data from EPFO, PMO, and other organisations. Senior officials informed that CERT-In was tasked with verifying these claims. Cybersecurity experts were also examining the situation, though there was no concrete evidence beyond the attackers' claims at the time of the report. Read our letter to CERT-In [here](https://drive.google.com/file/d/1UCBEflmVUn3wCEhN5VB-8TrwmZ7WEs5n/view?usp=drive_link&ref=static.internetfreedom.in). **Data breach at boAt:** A significant data breach recently affected the Indian consumer wearable brand, boAt. According to [Business Standard](https://www.business-standard.com/companies/news/boat-suffers-data-breach-personal-data-of-75-lakh-users-leaked-on-dark-web-124040801022_1.html?ref=static.internetfreedom.in), the breach exposed personal data of over 7.5 million users, allegedly orchestrated by a hacker known as ShopifyGUY. Sensitive information such as names, addresses, phone numbers, email addresses, and customer IDs have been compromised, with approximately 2 gigabytes of data made available on dark web forums. The company boAt acknowledged the incident, initiated a thorough investigation to safeguard customer data, and affirmed that protecting customer information is their utmost priority. Read our letter to CERT-In [here](https://drive.google.com/file/d/1CBCZZ-iY3L-LBIZmeAqW05e0C-4QCF22/view?usp=drive_link&ref=static.internetfreedom.in). **S3WaaS Vulnerability:** The 'Secure, Scalable and Sugamya Website as a Service' (S3WaaS) platform of the Government of India, developed for hosting government websites, faced a [significant vulnerability](https://techcrunch.com/2024/04/02/indian-government-cloud-spilled-citizens-personal-data-online-for-years/?ref=static.internetfreedom.in) in January 2022. Security researcher Sourajeet Majumder discovered that the flaw could potentially lead to the exposure of sensitive personal data of around 2,50,000 Indian citizens, primarily COVID-19 vaccine beneficiaries. Upon Sourajeet’s request, IFF alerted CERT-In about the security flaw twice, in [January](https://streaklinks.com/B5iaLhNNjdWyzgrW6g6sCred/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1gK4-k5a8WdsA33DpEkzGpMaWb-tGDD-C%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) and [March](https://streaklinks.com/B5iaLhRUFLtNke491gVaJaQL/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1je_jc54aV2i3Fv18toBB8EQhjybbk7-j%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) 2022. CERT-In acknowledged the email and responded promptly [both](https://drive.google.com/file/d/1nimm4u5HnJWEOPrO7U6l48PfRk-4Lodd/view?usp=drive_link&ref=static.internetfreedom.in) [times](https://drive.google.com/file/d/1FM263-h9gsNPMOBjXhjPsqVnZfJKZ_h5/view?usp=sharing&ref=static.internetfreedom.in). We also [notified](https://streaklinks.com/B5iaLhRzM2EPwggDewinzoF9/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1a2YqMBbnyXccXatyrQsQbI-K0NCfEARX%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) the National Informatics Centre (“NIC”) but they did not respond. Despite alerts and correspondence with CERT-In and NIC, the breach persisted until March 2024, when Sourajeet confirmed its resolution. Read our explainer about this vulnerability [here](https://internetfreedom.in/vulnerability-in-a-government-cloud-service/?ref=static.internetfreedom.in). ## PlugTheBreach: IFF’s data breach tracker You can find a list of all the non-exhaustive data breaches in the country since 2020 on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/?ref=static.internetfreedom.in), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. ## Conclusion The multitude of [recent data breaches and leaks](https://umbrella.cisco.com/info/threat-trends-report-cryptomining-malware-phishing-trojans?utm_medium=search-paid&utm_source=google&utm_campaign=UMB_APJC_IN_EN_GS_Nonbrand_Threats&utm_content=UMB-FY21-Q4-content-ebook-2021-cyber-security-threat-trends&_bt=688693661916&_bk=cyber%20threat%20landscape&_bm=p&_bn=g&_bg=161647957321&gad_source=1&gclid=CjwKCAjwoPOwBhAeEiwAJuXRh-7N142jxEQuZp_9GOKihwC72RvF7MaKIhIsJpTBXoVj8i3BJzlqtBoCwJEQAvD_BwE) underscores the critical importance of robust cybersecurity measures in today's digital landscape. From breaches compromising sensitive defence personnel information to vulnerabilities in major databases and platforms, these incidents highlight the pervasive risks individuals and organisations face. In these challenges, organisations must prioritise proactive cybersecurity measures, including regular audits, robust encryption protocols, and swift incident response procedures. Moreover, there's an urgent need for greater transparency and accountability in handling data breaches, as seen in cases where affected companies failed to acknowledge or adequately address the breaches promptly. Public awareness and education on cybersecurity best practices also play a vital role in mitigating risks and fostering a culture of cyber resilience. Thus, as we navigate an increasingly interconnected digital world, we must remain vigilant and proactive in safeguarding our digital assets and protecting user privacy. ##",
    "light_cleaned_comments": ""
}