{
    "id": "1boeutb",
    "title": "Is it true- axis bank credit card scam ?",
    "url": "https://x.com/actusdei/status/1772683004294402225?",
    "selftext": "I am not sure if this is true, but there are a lot of posts about Axis bank credit card scam.\nThis is a retweet from an editor of mint..\n",
    "flair": "Crime",
    "score": 3,
    "num_comments": 7,
    "created_utc": 1711477080.0,
    "convurl": "https://external-preview.redd.it/FtID5ClvqqcMrUuukR02jV4hIG4eHKwlPvWqftwT4tI.jpg?auto=webp&s=784218b109624bc684140fd3c4a9d51a66ecce5e",
    "comments": [
        "[for further reference](https://x.com/ankurmittal/status/1772679864362860919?)",
        "frauds are too easy these days",
        "I dont think axis bank has any role to play.. this is brute force attack - i have had such transactions for 2 reputed banks and one of the cards was my spare card and i hadnt used it anywhere (online or offline) and still there were unauthorised txns",
        "User privacy and data protections have gone for a toss."
    ],
    "cleaned_text": "true axis bank credit card scam sure true lot posts axis bank credit card scam retweet editor mint ",
    "cleaned_title": "true axis bank credit card scam",
    "cleaned_selftext": "sure true lot posts axis bank credit card scam retweet editor mint",
    "cleaned_comments": "referencehttpsxcomankurmittalstatus frauds easy days dont think axis bank role play brute force attack transactions reputed banks one cards spare card hadnt used anywhere online offline still unauthorised txns user privacy data protections gone toss",
    "light_cleaned_title": "Is it true- axis bank credit card scam ?",
    "light_cleaned_selftext": "I am not sure if this is true, but there are a lot of posts about Axis bank credit card scam. This is a retweet from an editor of mint..",
    "light_cleaned_comments": "[for further reference](https://x.com/ankurmittal/status/1772679864362860919?) frauds are too easy these days I dont think axis bank has any role to play.. this is brute force attack - i have had such transactions for 2 reputed banks and one of the cards was my spare card and i hadnt used it anywhere (online or offline) and still there were unauthorised txns User privacy and data protections have gone for a toss."
}