{
    "id": "168sk8k",
    "title": "Our News Media",
    "url": "https://i.redd.it/ajvukn2bf0mb1.jpg",
    "selftext": "Aint no way The Hindu did a 2 page analysis of Neeraj Chopra's Javelin throw.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693733510.0,
    "convurl": "https://i.redd.it/ajvukn2bf0mb1.jpg",
    "comments": [
        "The Hindu, 3rd September 2023, Page 12-13, Kozhikode.",
        "Nice",
        "Oh! all of a sudden its science.",
        "What's bad about this? Why are you people crying over everything?",
        "Hindu runs sportstar. Looks really cool with the graphics",
        "Never said it was bad. Just outta a boue sorta.",
        "Still a better job than our tv news media especially the Hindi ones.",
        "ill take this over fake and deliberately violence inciting news anyday",
        "I fucking know right, finally someone says it. This place plagued with negativity, every fucking news is turned into something negative. Its suffocating at this point.",
        "This looks really informative",
        ">Aint no way The Hindu did a 2 page analysis of Neeraj Chopra's Javelin throw.\n\nWhat the fuck is this then ?",
        "Random outrage over anything. I remember such articles about swing bowling as well. It's a good educational piece about anyone interested.",
        "OP after hearing about sports science and biomechanics:",
        "I prefer this over all the shitty news we see all the time. This is actually wholesome and informative at the same time.",
        "I think it's cool. He fine tuned his technique in Uppsala before his Olympic gold. In javelin technique plays an important role.",
        "Who is this \"you people\" btw? smh\n\nAs far as I know OP is only one person.\n\nI just think OP is reading newspaper for first time, that's it.",
        "This is just great article... loved it...",
        "Never expected a deep scientific breakdown of the throw.",
        "I don't see anything wrong with it? It is not trying to undermine his achievements instead showing us a different angle. I found it a good read",
        "Where's the outrage tho ? I was just pleasantly surprised they did it. Normally their news on a topic only goes beyond one page for the elections or the budget.",
        "I know science plays an important part in sports.",
        "Title \"Our News Media\"\n\nYou ask anyone about this and people will say it looks like you are complaining.\n\nIf you are happy, choose a happier title.\n\nNo harm no hate.",
        "People still consider them 'news' channels ?",
        "That title itself was satire. Whenever people complain about the standards of the media, they only show the tv media.",
        "The way you put the title is misleading.",
        "More like its explaining how the sport ought to be played. I am more surprised about the length of it since the Hindu never goes beyond 1 page for an issue other than elections or the budget.",
        "I explained exactly why I did so in another comment here.",
        "So I guess everyone must be dumb to not get that satire.",
        "Sports page me disaster ya election kaha se ghusedein? Isse jyada page to kai baar front me ads k liye hote hain.",
        "Says a person who couldn't identify a good news piece.",
        "OP ,do you love kpop and do you belive in yolo?",
        "It's a good article for anyone whether they are an athlete or not for understanding how much effort and science are required to achieve the success.",
        "this sub is turning into more of /r/rant",
        "This is cool , i love reading these kind of information on newspapers",
        "It's the Hindu, they are quirky that way",
        "I never said it was bad. It was a good read.",
        "The Hindu is kinda like that.",
        "Neither.",
        "Thats the fun part. Its not a sports page either. On Sundays, they have 3-4 pages of large articles delving deep into issues. Such as why the Socialists got the upper hand in the Spanish elections or why the Dutch PM Mark Rutte resigned. Just that this time they took it beyond one page, which they rarely do other than for the aforementioned topics.   \nNot that its bad tho. An analysis of this will show people that sports has a lot of science involved as well.",
        "That is why I like them. Tho I have been addicted to them for quite some time.",
        "I've heard CLAT coaching teachers recommended students to read The Hindu for GK. So yeah the Hindu has pretty high standards and reputation.",
        "And CAT as well. Its imo the best Indian news media.",
        "Guys op is not trying to spread negativity , but positivity?",
        "That looks cool, I'd consider framing that.",
        "yep yep",
        "Username doesn't checkout",
        "Bhai u need to learn \"words\" lol.",
        "Whats wrong with this?",
        "nothing"
    ],
    "cleaned_text": "news media aint way hindu page analysis neeraj chopras javelin throw ",
    "cleaned_title": "news media",
    "cleaned_selftext": "aint way hindu page analysis neeraj chopras javelin throw",
    "cleaned_comments": "hindu rd september page kozhikode nice oh sudden science whats bad people crying everything hindu runs sportstar looks really cool graphics never said bad outta boue sorta still better job tv news media especially hindi ones ill take fake deliberately violence inciting news anyday fucking know right finally someone says place plagued negativity every fucking news turned something negative suffocating point looks really informative aint way hindu page analysis neeraj chopras javelin throw fuck random outrage anything remember articles swing bowling well good educational piece anyone interested op hearing sports science biomechanics prefer shitty news see time actually wholesome informative time think cool fine tuned technique uppsala olympic gold javelin technique plays important role people btw smh far know op one person think op reading newspaper first time thats great article loved never expected deep scientific breakdown throw dont see anything wrong trying undermine achievements instead showing us different angle found good read wheres outrage tho pleasantly surprised normally news topic goes beyond one page elections budget know science plays important part sports title news media ask anyone people say looks like complaining happy choose happier title harm hate people still consider news channels title satire whenever people complain standards media show tv media way put title misleading like explaining sport ought played surprised length since hindu never goes beyond page issue elections budget explained exactly another comment guess everyone must dumb get satire sports page disaster ya election kaha se ghusedein isse jyada page kai baar front ads k liye hote hain says person couldnt identify good news piece op love kpop belive yolo good article anyone whether athlete understanding much effort science required achieve success sub turning rrant cool love reading kind information newspapers hindu quirky way never said bad good read hindu kinda like neither thats fun part sports page either sundays pages large articles delving deep issues socialists got upper hand spanish elections dutch pm mark rutte resigned time took beyond one page rarely aforementioned topics bad tho analysis show people sports lot science involved well like tho addicted quite time ive heard clat coaching teachers recommended students read hindu gk yeah hindu pretty high standards reputation cat well imo best indian news media guys op trying spread negativity positivity looks cool id consider framing yep yep username doesnt checkout bhai u need learn words lol whats wrong nothing",
    "light_cleaned_title": "Our News Media",
    "light_cleaned_selftext": "Aint no way The Hindu did a 2 page analysis of Neeraj Chopra's Javelin throw.",
    "light_cleaned_comments": "The Hindu, 3rd September 2023, Page 12-13, Kozhikode. Nice Oh! all of a sudden its science. What's bad about this? Why are you people crying over everything? Hindu runs sportstar. Looks really cool with the graphics Never said it was bad. Just outta a boue sorta. Still a better job than our tv news media especially the Hindi ones. ill take this over fake and deliberately violence inciting news anyday I fucking know right, finally someone says it. This place plagued with negativity, every fucking news is turned into something negative. Its suffocating at this point. This looks really informative >Aint no way The Hindu did a 2 page analysis of Neeraj Chopra's Javelin throw. What the fuck is this then ? Random outrage over anything. I remember such articles about swing bowling as well. It's a good educational piece about anyone interested. OP after hearing about sports science and biomechanics: I prefer this over all the shitty news we see all the time. This is actually wholesome and informative at the same time. I think it's cool. He fine tuned his technique in Uppsala before his Olympic gold. In javelin technique plays an important role. Who is this \"you people\" btw? smh As far as I know OP is only one person. I just think OP is reading newspaper for first time, that's it. This is just great article... loved it... Never expected a deep scientific breakdown of the throw. I don't see anything wrong with it? It is not trying to undermine his achievements instead showing us a different angle. I found it a good read Where's the outrage tho ? I was just pleasantly surprised they did it. Normally their news on a topic only goes beyond one page for the elections or the budget. I know science plays an important part in sports. Title \"Our News Media\" You ask anyone about this and people will say it looks like you are complaining. If you are happy, choose a happier title. No harm no hate. People still consider them 'news' channels ? That title itself was satire. Whenever people complain about the standards of the media, they only show the tv media. The way you put the title is misleading. More like its explaining how the sport ought to be played. I am more surprised about the length of it since the Hindu never goes beyond 1 page for an issue other than elections or the budget. I explained exactly why I did so in another comment here. So I guess everyone must be dumb to not get that satire. Sports page me disaster ya election kaha se ghusedein? Isse jyada page to kai baar front me ads k liye hote hain. Says a person who couldn't identify a good news piece. OP ,do you love kpop and do you belive in yolo? It's a good article for anyone whether they are an athlete or not for understanding how much effort and science are required to achieve the success. this sub is turning into more of /r/rant This is cool , i love reading these kind of information on newspapers It's the Hindu, they are quirky that way I never said it was bad. It was a good read. The Hindu is kinda like that. Neither. Thats the fun part. Its not a sports page either. On Sundays, they have 3-4 pages of large articles delving deep into issues. Such as why the Socialists got the upper hand in the Spanish elections or why the Dutch PM Mark Rutte resigned. Just that this time they took it beyond one page, which they rarely do other than for the aforementioned topics. Not that its bad tho. An analysis of this will show people that sports has a lot of science involved as well. That is why I like them. Tho I have been addicted to them for quite some time. I've heard CLAT coaching teachers recommended students to read The Hindu for GK. So yeah the Hindu has pretty high standards and reputation. And CAT as well. Its imo the best Indian news media. Guys op is not trying to spread negativity , but positivity? That looks cool, I'd consider framing that. yep yep Username doesn't checkout Bhai u need to learn \"words\" lol. Whats wrong with this? nothing"
}