{
    "id": "177e7gk",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/177e7gk/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&format=png&auto=webp&s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697247009.0,
    "convurl": "https://b.thumbs.redditmedia.com/gNzORAqr_xPFUE1MAzyC724fWFBZjZ0W6cspNrX1xVY.jpg",
    "comments": [
        "Madness in the desert is one hell of a documentary everyone can watch. It is a behind the scenes for Lagaan. I was moved when I saw it.",
        "For me , it was even better than the movie itself",
        "Beef on Netflix is overhyped show. It is just bad version of Taxi no. 9211",
        "Paatal Lok!  Finally!  I tried it a while ago and didn't get through the first episode.  It seemed like another cops in the city show and I wasn't in the mood.  \n\nI had nothing else to watch yesterday so I tried again.  Couldn't stop watching.  It's the first thing I've seen that I like as much as Suzhal.",
        "Oh man, that made me go back and watch Lagaan again.  Every time they showed a bit I had to go see it in the movie.  In one week I think I did Madness 3 times and Lagaan twice.  \n\nI also learned who Alka Yagnik and Udit Narayan are!  Now I'm totally crazy for Alka",
        "I want to make films someday and seeing the hard-work that goes behind into working with such a large crew at such conditions is absolutely inspiring. I was in tears when they showed how that old guy wanted the shoot must go on even after going through a severe injury. \n\nGlad you guys liked the recommendation"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall ",
    "cleaned_title": "biweekly movies tv shows documentaries podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall",
    "cleaned_comments": "madness desert one hell documentary everyone watch behind scenes lagaan moved saw even better movie beef netflix overhyped show bad version taxi paatal lok finally tried ago didnt get first episode seemed like another cops city show wasnt mood nothing else watch yesterday tried couldnt stop watching first thing ive seen like much suzhal oh man made go back watch lagaan every time showed bit go see movie one week think madness times lagaan twice also learned alka yagnik udit narayan im totally crazy alka want make films someday seeing hardwork goes behind working large crew conditions absolutely inspiring tears showed old guy wanted shoot must go even going severe injury glad guys liked recommendation",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Madness in the desert is one hell of a documentary everyone can watch. It is a behind the scenes for Lagaan. I was moved when I saw it. For me , it was even better than the movie itself Beef on Netflix is overhyped show. It is just bad version of Taxi no. 9211 Paatal Lok! Finally! I tried it a while ago and didn't get through the first episode. It seemed like another cops in the city show and I wasn't in the mood. I had nothing else to watch yesterday so I tried again. Couldn't stop watching. It's the first thing I've seen that I like as much as Suzhal. Oh man, that made me go back and watch Lagaan again. Every time they showed a bit I had to go see it in the movie. In one week I think I did Madness 3 times and Lagaan twice. I also learned who Alka Yagnik and Udit Narayan are! Now I'm totally crazy for Alka I want to make films someday and seeing the hard-work that goes behind into working with such a large crew at such conditions is absolutely inspiring. I was in tears when they showed how that old guy wanted the shoot must go on even after going through a severe injury. Glad you guys liked the recommendation"
}