{
    "id": "1cklowi",
    "title": "Scammers are evolving!",
    "url": "https://v.redd.it/kniq40tq7kyc1",
    "selftext": "So I received this scam call today but the difference this time was the IVR he used. I started recording a bit late as I thought it was a genuine call from courier ser ice since they do use IVR... never thought that scammers could use it as well.\n\nBe carefull guys, they are adapting at a very rapid rate. Please inform your elders to contact a technically educated person if/when such calls come up.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1714893810.0,
    "convurl": "https://external-preview.redd.it/bzB2ODhsaHE3a3ljMZEI3GCwd8eFnhpIWt7cJaumNEIdpa6JGrAyv29e17oN.png?format=pjpg&auto=webp&s=06e2c7aae99633c8c689d1b0285577c1d6a7b730",
    "comments": [],
    "cleaned_text": "scammers evolving received scam call today difference time ivr used started recording bit late thought genuine call courier ser ice since use ivr never thought scammers could use well carefull guys adapting rapid rate please inform elders contact technically educated person ifwhen calls come ",
    "cleaned_title": "scammers evolving",
    "cleaned_selftext": "received scam call today difference time ivr used started recording bit late thought genuine call courier ser ice since use ivr never thought scammers could use well carefull guys adapting rapid rate please inform elders contact technically educated person ifwhen calls come",
    "cleaned_comments": "",
    "light_cleaned_title": "Scammers are evolving!",
    "light_cleaned_selftext": "So I received this scam call today but the difference this time was the IVR he used. I started recording a bit late as I thought it was a genuine call from courier ser ice since they do use IVR... never thought that scammers could use it as well. Be carefull guys, they are adapting at a very rapid rate. Please inform your elders to contact a technically educated person if/when such calls come up.",
    "light_cleaned_comments": ""
}