{
    "id": "188xpqr",
    "title": "Silkyara tunnel collaped 20 times in past 5 years.",
    "url": "https://i.redd.it/k8h822rcut3c1.jpeg",
    "selftext": "https://m.timesofindia.com/india/silkyara-tunnel-collapsed-20-times-in-past-5-years/articleshow/105637134.cms",
    "flair": "Policy/Economy",
    "score": 332,
    "num_comments": 33,
    "created_utc": 1701499085.0,
    "convurl": "https://i.redd.it/k8h822rcut3c1.jpeg",
    "comments": [
        "https://m.timesofindia.com/india/silkyara-tunnel-collapsed-20-times-in-past-5-years/articleshow/105637134.cms",
        "Pretty concerned for the travelers once this is open.",
        "Yeah me too.",
        "It's the lack of escape tunnel that is still not being built that's my biggest. \n\nEscape tunnels are supposed to be built first before the main tunnel is built. \n\nIt's concerning that the Uttarakhand administration ignored all the inspection reports by NHIDCL.",
        "Even this report is being shoved under the rug. You won't find any news channel talking about previous collapses.",
        "Is that mountain made of scree?",
        "I don't think we need to worry. \n\nThe government isn't worried. The direct descendant of Shri Ram, Lord Modishwara, isn't worried.\n\n[Navayuga engineering company is happy](https://www.telegraphindia.com/india/uttarkashi-tunnel-collapse-no-show-by-central-team-on-safety-mission-for-construction-restart/cid/1983750:) that far from being held accountable, they're free to do what they want:\n\n> officials of the private engineering firm that has the contract for the tunnel project sounded confident about resuming work soon. “We will work with doubled enthusiasm on the construction of the tunnel,” a company official involved in the project was quoted as saying to reporters in Rishikesh. “The Prime Minister and the chief minister have boosted our morale. We will complete the project before the 2024 parliamentary elections.”\n\nThe bhakts are happy about all the disaster porn and its emotional highs and lows. At the end of every crisis, they get a chance to [glorify Lord Modishwara.](https://www.news18.com/india/modis-mission-possible-in-uttarkashi-invoked-manush-machine-to-mahadev-for-silkyara-tunnel-rescue-8680507.html) with help from godi media.\n\nThe rescuers get to chant [Har Har Mahadev and Bharat Mata Ki Jai](https://news.abplive.com/states/up-uk/uttarkashi-tunnel-rescue-ops-trapped-uttarakhand-silkyara-workers-come-out-evacuation-pm-modi-cm-pushkar-dhami-1644570).\n\nEven the trapped workers are happy! They get [1L prizes](https://www.hindustantimes.com/india-news/uttarakhand-cm-pushkar-dhami-announces-financial-aid-of-rs-1-lakh-to-each-worker-rescued-101701189334752.html) for providing disaster porn entertainment.\n\nAll in all, it's just some stupid nobodies who're ranting pointlessly about environmental recklessness, shoddiness, accountability, and that kind of useless western ideas. \n\nWe have Mahadev in \"dev bhoomi\" and Mahadev will protect dev bhoomi.\n\nJai Hind!",
        "A+ level sarcasm 👍",
        "You left the part where Neheru is Responsible for this.",
        "Probably. It was mentioned in the NHIDCL report that the  geology of the land cannot support the tunnel.\n\nTherefore we need to reinforce the land first with concrete rooftops and pillars. \n\nSOP for construction on loose land was not followed despite the PSU reporting about it.\n\nThe contractor saved every penny and contructed the tunnel with bare minimum investment despite repeated collapses.",
        "Please spread this news article as BJP it cell is trying to shove this information under the rug. \n\nYou can already see none of the news channels talking about it.",
        "yeah 70 years of congress rule has turned the solid land into a scree.",
        "The ecosystem and soil quality doesn't support the project and it's bound to fail, maybe like kedarnath, we will hear another tragedy in next 10 years where thousands died because of these vote bank politics stunt.",
        "Once every quarter. Good average.",
        "They are still promoting it as a good project despite the horrible negligence and deliberate violation of standards.",
        "Yeah that's why people should know about it. We can't educate everyone but at least we can tell our friends and family to avoid this tunnel.",
        "Please make sure your family and friends know about this so they can avoid this tunnel.",
        "It seems we have learnt nothing from Bhopal Gas Tragedy. Ignorance is bliss.",
        "Yeah and the Bhopal tragedy is not even preceded by 20 smaller tragedies.",
        "The corporate owns the government that's why they will never question them no matter how many people die",
        "You might think okay this one is people's government or that one is Hindu's government but no it's always the corporate secretly pulling strings",
        "They successfully managed to shutdown this news from airing on any channel.",
        "Well they successfully managed to shutdown this news from airing on any channel. Kudos to godi media."
    ],
    "cleaned_text": "silkyara tunnel collaped times past years  ",
    "cleaned_title": "silkyara tunnel collaped times past years",
    "cleaned_selftext": "",
    "cleaned_comments": "pretty concerned travelers open yeah lack escape tunnel still built thats biggest escape tunnels supposed built first main tunnel built concerning uttarakhand administration ignored inspection reports nhidcl even report shoved rug wont find news channel talking previous collapses mountain made scree dont think need worry government isnt worried direct descendant shri ram lord modishwara isnt worried navayuga engineering company happyhttpswwwtelegraphindiacomindiauttarkashitunnelcollapsenoshowbycentralteamonsafetymissionforconstructionrestartcid far held accountable theyre free want officials private engineering firm contract tunnel project sounded confident resuming work soon work doubled enthusiasm construction tunnel company official involved project quoted saying reporters rishikesh prime minister chief minister boosted morale complete project parliamentary elections bhakts happy disaster porn emotional highs lows end every crisis get chance glorify lord modishwarahttpswwwnewscomindiamodismissionpossibleinuttarkashiinvokedmanushmachinetomahadevforsilkyaratunnelrescuehtml help godi media rescuers get chant har har mahadev bharat mata ki jaihttpsnewsabplivecomstatesupukuttarkashitunnelrescueopstrappeduttarakhandsilkyaraworkerscomeoutevacuationpmmodicmpushkardhami even trapped workers happy get l prizeshttpswwwhindustantimescomindianewsuttarakhandcmpushkardhamiannouncesfinancialaidofrslakhtoeachworkerrescuedhtml providing disaster porn entertainment stupid nobodies whore ranting pointlessly environmental recklessness shoddiness accountability kind useless western ideas mahadev dev bhoomi mahadev protect dev bhoomi jai hind level sarcasm left part neheru responsible probably mentioned nhidcl report geology land support tunnel therefore need reinforce land first concrete rooftops pillars sop construction loose land followed despite psu reporting contractor saved every penny contructed tunnel bare minimum investment despite repeated collapses please spread news article bjp cell trying shove information rug already see none news channels talking yeah years congress rule turned solid land scree ecosystem soil quality doesnt support project bound fail maybe like kedarnath hear another tragedy next years thousands died vote bank politics stunt every quarter good average still promoting good project despite horrible negligence deliberate violation standards yeah thats people know cant educate everyone least tell friends family avoid tunnel please make sure family friends know avoid tunnel seems learnt nothing bhopal gas tragedy ignorance bliss yeah bhopal tragedy even preceded smaller tragedies corporate owns government thats never question matter many people die might think okay one peoples government one hindus government always corporate secretly pulling strings successfully managed shutdown news airing channel well successfully managed shutdown news airing channel kudos godi media",
    "light_cleaned_title": "Silkyara tunnel collaped 20 times in past 5 years.",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Pretty concerned for the travelers once this is open. Yeah me too. It's the lack of escape tunnel that is still not being built that's my biggest. Escape tunnels are supposed to be built first before the main tunnel is built. It's concerning that the Uttarakhand administration ignored all the inspection reports by NHIDCL. Even this report is being shoved under the rug. You won't find any news channel talking about previous collapses. Is that mountain made of scree? I don't think we need to worry. The government isn't worried. The direct descendant of Shri Ram, Lord Modishwara, isn't worried. [Navayuga engineering company is happy](https://www.telegraphindia.com/india/uttarkashi-tunnel-collapse-no-show-by-central-team-on-safety-mission-for-construction-restart/cid/1983750:) that far from being held accountable, they're free to do what they want: > officials of the private engineering firm that has the contract for the tunnel project sounded confident about resuming work soon. “We will work with doubled enthusiasm on the construction of the tunnel,” a company official involved in the project was quoted as saying to reporters in Rishikesh. “The Prime Minister and the chief minister have boosted our morale. We will complete the project before the 2024 parliamentary elections.” The bhakts are happy about all the disaster porn and its emotional highs and lows. At the end of every crisis, they get a chance to [glorify Lord Modishwara.](https://www.news18.com/india/modis-mission-possible-in-uttarkashi-invoked-manush-machine-to-mahadev-for-silkyara-tunnel-rescue-8680507.html) with help from godi media. The rescuers get to chant [Har Har Mahadev and Bharat Mata Ki Jai](https://news.abplive.com/states/up-uk/uttarkashi-tunnel-rescue-ops-trapped-uttarakhand-silkyara-workers-come-out-evacuation-pm-modi-cm-pushkar-dhami-1644570). Even the trapped workers are happy! They get [1L prizes](https://www.hindustantimes.com/india-news/uttarakhand-cm-pushkar-dhami-announces-financial-aid-of-rs-1-lakh-to-each-worker-rescued-101701189334752.html) for providing disaster porn entertainment. All in all, it's just some stupid nobodies who're ranting pointlessly about environmental recklessness, shoddiness, accountability, and that kind of useless western ideas. We have Mahadev in \"dev bhoomi\" and Mahadev will protect dev bhoomi. Jai Hind! A+ level sarcasm 👍 You left the part where Neheru is Responsible for this. Probably. It was mentioned in the NHIDCL report that the geology of the land cannot support the tunnel. Therefore we need to reinforce the land first with concrete rooftops and pillars. SOP for construction on loose land was not followed despite the PSU reporting about it. The contractor saved every penny and contructed the tunnel with bare minimum investment despite repeated collapses. Please spread this news article as BJP it cell is trying to shove this information under the rug. You can already see none of the news channels talking about it. yeah 70 years of congress rule has turned the solid land into a scree. The ecosystem and soil quality doesn't support the project and it's bound to fail, maybe like kedarnath, we will hear another tragedy in next 10 years where thousands died because of these vote bank politics stunt. Once every quarter. Good average. They are still promoting it as a good project despite the horrible negligence and deliberate violation of standards. Yeah that's why people should know about it. We can't educate everyone but at least we can tell our friends and family to avoid this tunnel. Please make sure your family and friends know about this so they can avoid this tunnel. It seems we have learnt nothing from Bhopal Gas Tragedy. Ignorance is bliss. Yeah and the Bhopal tragedy is not even preceded by 20 smaller tragedies. The corporate owns the government that's why they will never question them no matter how many people die You might think okay this one is people's government or that one is Hindu's government but no it's always the corporate secretly pulling strings They successfully managed to shutdown this news from airing on any channel. Well they successfully managed to shutdown this news from airing on any channel. Kudos to godi media."
}