{
    "id": "15f3x0m",
    "title": "Has the narrative building around the Maharashtra RPF attack already started?",
    "url": "https://www.reddit.com/r/india/comments/15f3x0m/has_the_narrative_building_around_the_maharashtra/",
    "selftext": "What Led To Railway Cop Shooting 4 Dead On Train? His Colleague's Account - https://www.ndtv.com/india-news/jaipur-mumbai-superfast-express-rpf-railway-protection-force-mumbai-train-shooting-chetan-singh-what-led-to-railway-cop-shooting-4-dead-on-train-his-c-4257606\n\n---\n\nThere's no mention of the video where the RPF constable is talking about Modi/Yogi/Hindustan. \n\nThere must have been an altercation b/w the cop and his ASI boss but these news agencies need to report/investigate everything. They're just parroting whatever the cops are saying.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690870058.0,
    "convurl": "https://external-preview.redd.it/huiMt9ok48KdBy37ow9aI17WPCJjkWjOy8vQ9fqVSkc.jpg?auto=webp&s=c0aaae45fb3dcc07e802d6656bd3db562b03fcbc",
    "comments": [
        "He was unwell and lost his mental faculties which was further fuelled by the political proopganda these days and eventually lead to this.",
        "I think it’s better to listen to what the cops are saying rather than what we will receive on WhatsApp.",
        "Hmm, the white supremacist terrorists in the US that carry out racial violence are also called mentally ill. This is used to ignore the ideology and culture of fear created by the leaders that really led to this.",
        "It wasn't well planned like the one you mentioned. His mind was maybe brimming communal haterd which unleashed when he lost his mental faculties.",
        "He personally didn't plan it. The ruling party constantly demonizing muslims at every level is guaranteed to result in this, even if they don't know who specifically will carry it out sometimes.\n\nThey want it to happen.\n\n[https://www.youtube.com/watch?v=fkiXrDlWneE](https://www.youtube.com/watch?v=fkiXrDlWneE)",
        "i am seeing the same language being used as it does for the shootings in the US. \n\n\"mental stress\"; \"lone gunman\"; \"motives unclear\".\n\nhis speech ***while standing over the body*** is being glossed over because it's a man in a \"distressed state of mind..\".\n\nthe whataboutery is incredible.",
        "He is clearly brainwashed. We all know how was he brainwashed. To acknowledge that BJP has to acknowledge the negative consequences of their election machinery - media spewing hate and constant propaganda on social media.",
        "Ndtv really??",
        "The Cops can only say what they are approved to say.",
        "Have you not seen the video in which he's standing in front of the person he killed and saying stuff?",
        "44 seconds onwards. \n\nhttps://twitter.com/itsnot_zayd/status/1686296705896157184",
        "Fake news about muslim involvement in manipur came out as soon as the story broke.\n\nThe Nuh conflict even started out with an anti-muslim narrative.\n\nThere is no way to stop this and there is no way you can convince consumers of fake news to change their diet.",
        "One of the railway officer was saying to ani that they're being treated when visuals of bodies on the platform were already out",
        "These jackals will not even report it. They’ll just run the PTI feed. Whereas Harayana is on the front page.",
        "It's Adani TV now",
        "I am not surprised NDTV changed the narrative, no mention about speech made in which he mentioned Modi/Yogi's name. Not sure how many more such brainwashed people are there capable of such violence",
        "The anti-muslim narrative is still strong in the Nuh case. Or Has anything changed with that?",
        "probably worded it bad. nothing changed",
        "Is it only a narrative or the truth? Or even one aspect of the truth?\n\nI'm facing an existential crisis today. Have always decried Hindu fundamentalism, and have somewhat defended Islamic fundamentalism on the grounds of socio economic backwardness. But this time it seems like the mob attacked the VHP procession with prior planning. \n\nIs there a pro-Muslim angle to the violence in Haryana?",
        "It is likely the truth. The attack on the procession cannot and should not be defended. \n\nBut the narrative is also important - the hate being peddled casually justifies the violence that is happening in return, in which only innocents are being harmed. The administration and police have a duty to curb any such violence, but instead they seem to be complicit. \n\nNote that the same reasoning was used by many to justify the violence in Manipur.",
        "This is a textbook example of terrorism. He killed civilians for a political aim",
        "I am of the opinion that he killed his superior (who is not a Muslim) over their altercation about granting him leave and then went about deliberately targeting Muslims with the idea  that killing Muslims would garner him pubic and political support (from the right wing fanatics) and help him escape consequences. Given the current climate, it has been a running pattern that anybody who Murders Muslims can get away with the consequences or at least delay proceedings till the justice is turned upside down.",
        ">i am seeing the same language being used as it does for the shootings in the US.\n\nThe US may have many such incidents, but anytime these incidents are motivated by hate, American media and authorities do not shy away from calling these incidents what they are - hate crimes. \n\nIt is the Indian media that is sweeping the hate filled aspect of this crime under the rug.",
        "can anyone share the speech where he mentioned yogi/modi.",
        "You will know who there the first stone. If I have to make a cakukated guess, I would say Sanghis. \n\nMuslim extremists are easy to provoke and Sanghis know that well.",
        "Elections are coming!",
        "“I'm facing an existential crisis today. Have always decried Hindu fundamentalism, and have somewhat defended Islamic fundamentalism on the grounds of socio economic backwardness.”\n\nHave you read quran?",
        "Dude, this guy killed his tribal boss and then went around killing muslims. This is Hindutva terrorism, motivated by caste and religious hatred.",
        "Could be, as it is well known that a lot of SC/ST doesn't vote for BJP.",
        "Yes, actually. Why?",
        "Any update on this - ki who threw the first stone?"
    ],
    "cleaned_text": "narrative building around maharashtra rpf attack already started led railway cop shooting dead train colleagues account theres mention video rpf constable talking modiyogihindustan must altercation bw cop asi boss news agencies need reportinvestigate everything theyre parroting whatever cops saying ",
    "cleaned_title": "narrative building around maharashtra rpf attack already started",
    "cleaned_selftext": "led railway cop shooting dead train colleagues account theres mention video rpf constable talking modiyogihindustan must altercation bw cop asi boss news agencies need reportinvestigate everything theyre parroting whatever cops saying",
    "cleaned_comments": "unwell lost mental faculties fuelled political proopganda days eventually lead think better listen cops saying rather receive whatsapp hmm white supremacist terrorists us carry racial violence also called mentally ill used ignore ideology culture fear created leaders really led wasnt well planned like one mentioned mind maybe brimming communal haterd unleashed lost mental faculties personally didnt plan ruling party constantly demonizing muslims every level guaranteed result even dont know specifically carry sometimes want happen httpswwwyoutubecomwatchvfkixrdlwneehttpswwwyoutubecomwatchvfkixrdlwnee seeing language used shootings us mental stress lone gunman motives unclear speech standing body glossed man distressed state mind whataboutery incredible clearly brainwashed know brainwashed acknowledge bjp acknowledge negative consequences election machinery media spewing hate constant propaganda social media ndtv really cops say approved say seen video hes standing front person killed saying stuff seconds onwards fake news muslim involvement manipur came soon story broke nuh conflict even started antimuslim narrative way stop way convince consumers fake news change diet one railway officer saying ani theyre treated visuals bodies platform already jackals even report theyll run pti feed whereas harayana front page adani tv surprised ndtv changed narrative mention speech made mentioned modiyogis name sure many brainwashed people capable violence antimuslim narrative still strong nuh case anything changed probably worded bad nothing changed narrative truth even one aspect truth im facing existential crisis today always decried hindu fundamentalism somewhat defended islamic fundamentalism grounds socio economic backwardness time seems like mob attacked vhp procession prior planning promuslim angle violence haryana likely truth attack procession defended narrative also important hate peddled casually justifies violence happening return innocents harmed administration police duty curb violence instead seem complicit note reasoning used many justify violence manipur textbook example terrorism killed civilians political aim opinion killed superior muslim altercation granting leave went deliberately targeting muslims idea killing muslims would garner pubic political support right wing fanatics help escape consequences given current climate running pattern anybody murders muslims get away consequences least delay proceedings till justice turned upside seeing language used shootings us us may many incidents anytime incidents motivated hate american media authorities shy away calling incidents hate crimes indian media sweeping hate filled aspect crime rug anyone share speech mentioned yogimodi know first stone make cakukated guess would say sanghis muslim extremists easy provoke sanghis know well elections coming im facing existential crisis today always decried hindu fundamentalism somewhat defended islamic fundamentalism grounds socio economic backwardness read quran dude guy killed tribal boss went around killing muslims hindutva terrorism motivated caste religious hatred could well known lot scst doesnt vote bjp yes actually update ki threw first stone",
    "light_cleaned_title": "Has the narrative building around the Maharashtra RPF attack already started?",
    "light_cleaned_selftext": "What Led To Railway Cop Shooting 4 Dead On Train? His Colleague's Account - --- There's no mention of the video where the RPF constable is talking about Modi/Yogi/Hindustan. There must have been an altercation b/w the cop and his ASI boss but these news agencies need to report/investigate everything. They're just parroting whatever the cops are saying.",
    "light_cleaned_comments": "He was unwell and lost his mental faculties which was further fuelled by the political proopganda these days and eventually lead to this. I think it’s better to listen to what the cops are saying rather than what we will receive on WhatsApp. Hmm, the white supremacist terrorists in the US that carry out racial violence are also called mentally ill. This is used to ignore the ideology and culture of fear created by the leaders that really led to this. It wasn't well planned like the one you mentioned. His mind was maybe brimming communal haterd which unleashed when he lost his mental faculties. He personally didn't plan it. The ruling party constantly demonizing muslims at every level is guaranteed to result in this, even if they don't know who specifically will carry it out sometimes. They want it to happen. [https://www.youtube.com/watch?v=fkiXrDlWneE](https://www.youtube.com/watch?v=fkiXrDlWneE) i am seeing the same language being used as it does for the shootings in the US. \"mental stress\"; \"lone gunman\"; \"motives unclear\". his speech ***while standing over the body*** is being glossed over because it's a man in a \"distressed state of mind..\". the whataboutery is incredible. He is clearly brainwashed. We all know how was he brainwashed. To acknowledge that BJP has to acknowledge the negative consequences of their election machinery - media spewing hate and constant propaganda on social media. Ndtv really?? The Cops can only say what they are approved to say. Have you not seen the video in which he's standing in front of the person he killed and saying stuff? 44 seconds onwards. Fake news about muslim involvement in manipur came out as soon as the story broke. The Nuh conflict even started out with an anti-muslim narrative. There is no way to stop this and there is no way you can convince consumers of fake news to change their diet. One of the railway officer was saying to ani that they're being treated when visuals of bodies on the platform were already out These jackals will not even report it. They’ll just run the PTI feed. Whereas Harayana is on the front page. It's Adani TV now I am not surprised NDTV changed the narrative, no mention about speech made in which he mentioned Modi/Yogi's name. Not sure how many more such brainwashed people are there capable of such violence The anti-muslim narrative is still strong in the Nuh case. Or Has anything changed with that? probably worded it bad. nothing changed Is it only a narrative or the truth? Or even one aspect of the truth? I'm facing an existential crisis today. Have always decried Hindu fundamentalism, and have somewhat defended Islamic fundamentalism on the grounds of socio economic backwardness. But this time it seems like the mob attacked the VHP procession with prior planning. Is there a pro-Muslim angle to the violence in Haryana? It is likely the truth. The attack on the procession cannot and should not be defended. But the narrative is also important - the hate being peddled casually justifies the violence that is happening in return, in which only innocents are being harmed. The administration and police have a duty to curb any such violence, but instead they seem to be complicit. Note that the same reasoning was used by many to justify the violence in Manipur. This is a textbook example of terrorism. He killed civilians for a political aim I am of the opinion that he killed his superior (who is not a Muslim) over their altercation about granting him leave and then went about deliberately targeting Muslims with the idea that killing Muslims would garner him pubic and political support (from the right wing fanatics) and help him escape consequences. Given the current climate, it has been a running pattern that anybody who Murders Muslims can get away with the consequences or at least delay proceedings till the justice is turned upside down. >i am seeing the same language being used as it does for the shootings in the US. The US may have many such incidents, but anytime these incidents are motivated by hate, American media and authorities do not shy away from calling these incidents what they are - hate crimes. It is the Indian media that is sweeping the hate filled aspect of this crime under the rug. can anyone share the speech where he mentioned yogi/modi. You will know who there the first stone. If I have to make a cakukated guess, I would say Sanghis. Muslim extremists are easy to provoke and Sanghis know that well. Elections are coming! “I'm facing an existential crisis today. Have always decried Hindu fundamentalism, and have somewhat defended Islamic fundamentalism on the grounds of socio economic backwardness.” Have you read quran? Dude, this guy killed his tribal boss and then went around killing muslims. This is Hindutva terrorism, motivated by caste and religious hatred. Could be, as it is well known that a lot of SC/ST doesn't vote for BJP. Yes, actually. Why? Any update on this - ki who threw the first stone?"
}