{
    "id": "1hgwnv9",
    "title": "Avoidable: Supreme Court Collegium to Allahabad HC judge on his remarks against Muslims",
    "url": "https://indianexpress.com/article/india/avoidable-supreme-court-collegium-to-justice-yadav-on-his-remarks-against-muslims-9730849/?ref=hometop_hp",
    "selftext": "'Avoidable' seriously? That's the best you could come up with? ",
    "flair": "Law & Courts",
    "score": 197,
    "num_comments": 13,
    "created_utc": 1734507649.0,
    "convurl": "https://external-preview.redd.it/BrOKWpI6I1opqJu4slikWCroCG-QtBp9CW5VqtOzRlg.jpg?auto=webp&s=6ee851e0cf4c96c6f29ebeee660e3735f233cfc7",
    "comments": [
        "Pathetic",
        "Supreme loude ka verdict: avoidable.\n\nYe loude merit se judge bante hain 😂",
        "Supreme Joke.",
        "This man said the most vile things imaginable and then doesn't even get a slap on the wrist. The venom he spewed in public might be similar to the living room conversations of the collegium.\n\n\n\nThe Supreme Court is setting precedents which break the very foundation of the Constitution.",
        "Zyada bolenge toh khudki naukri danger mein aajayegi",
        "Meeting Notes: These speeches should be \"avoided\" till the retirement. It should quietly reflect in your judgement and then all credit should be taken after retirement.",
        "I remember there was a pic of former CJI Bobde sitting on a bike owned by BJP MLA, when someone shared that pic it was considered contempt of court as it showed Judge in bad light.\n\nHere Judge is openly spewing hate .. but its just 'avoidable'",
        "These same people are super quick to bring contempt charges on anyone criticizing them on the basis that critical comments take away trust from the judiciary\n\nCan anyone tell me how this guy can make unbiased decisions in the high court?",
        "Contempt of court incoming",
        "Bhool rahe ho kya SC judges are busy planning home functions and calling Mr. PM for occasions with Nixon camera everywhere.",
        "He has a good chance of becoming CJI one day.",
        "This L @ uda should be impeached. But ...."
    ],
    "cleaned_text": "avoidable supreme court collegium allahabad hc judge remarks muslims avoidable seriously thats best could come ",
    "cleaned_title": "avoidable supreme court collegium allahabad hc judge remarks muslims",
    "cleaned_selftext": "avoidable seriously thats best could come",
    "cleaned_comments": "pathetic supreme loude ka verdict avoidable ye loude merit se judge bante hain supreme joke man said vile things imaginable doesnt even get slap wrist venom spewed public might similar living room conversations collegium supreme court setting precedents break foundation constitution zyada bolenge toh khudki naukri danger mein aajayegi meeting notes speeches avoided till retirement quietly reflect judgement credit taken retirement remember pic former cji bobde sitting bike owned bjp mla someone shared pic considered contempt court showed judge bad light judge openly spewing hate avoidable people super quick bring contempt charges anyone criticizing basis critical comments take away trust judiciary anyone tell guy make unbiased decisions high court contempt court incoming bhool rahe ho kya sc judges busy planning home functions calling mr pm occasions nixon camera everywhere good chance becoming cji one day l uda impeached",
    "light_cleaned_title": "Avoidable: Supreme Court Collegium to Allahabad HC judge on his remarks against Muslims",
    "light_cleaned_selftext": "'Avoidable' seriously? That's the best you could come up with?",
    "light_cleaned_comments": "Pathetic Supreme loude ka verdict: avoidable. Ye loude merit se judge bante hain 😂 Supreme Joke. This man said the most vile things imaginable and then doesn't even get a slap on the wrist. The venom he spewed in public might be similar to the living room conversations of the collegium. The Supreme Court is setting precedents which break the very foundation of the Constitution. Zyada bolenge toh khudki naukri danger mein aajayegi Meeting Notes: These speeches should be \"avoided\" till the retirement. It should quietly reflect in your judgement and then all credit should be taken after retirement. I remember there was a pic of former CJI Bobde sitting on a bike owned by BJP MLA, when someone shared that pic it was considered contempt of court as it showed Judge in bad light. Here Judge is openly spewing hate .. but its just 'avoidable' These same people are super quick to bring contempt charges on anyone criticizing them on the basis that critical comments take away trust from the judiciary Can anyone tell me how this guy can make unbiased decisions in the high court? Contempt of court incoming Bhool rahe ho kya SC judges are busy planning home functions and calling Mr. PM for occasions with Nixon camera everywhere. He has a good chance of becoming CJI one day. This L @ uda should be impeached. But ...."
}