{
    "id": "1axa086",
    "title": "I have been scammed by croma online and they are denying my complaint. How to proceed legally?",
    "url": "https://www.reddit.com/r/india/comments/1axa086/i_have_been_scammed_by_croma_online_and_they_are/",
    "selftext": "This is the context twitter post [here](https://x.com/AnnoyingPenny89/status/1753315051786961242?s=20)  \nSo, basically ordered a JBL Tour One headset from croma online, croma packaging is perfect but inside the headset box is tampered and the headset is missing. Made unboxing video and provided to them the proof that it was not their, even after several emails all they are saying is As per their SCM or investigation they have confirmed they sent me perfect product.  \nWhats interesting is the weight of the entire package croma sent is 0.58kg and even their shipping label mention 0.58kg, and the empty headset box weighs exactly the same 0.58kg. If the headset was there then it should have weighed 829grams + (got this figure from a friend who also bought the same headset and received in perfect new seal condition) but even their shipping label provided that its weight is 580grams xD They clearly didnt send the headset and still denying that anything is wrong by their side.  \nI made 2 complaints on consumerhelpline gov in website, both of them were closed in under 48 hours stating the same that I have received correct product. I complained around 9th feb last on that website. The order was received by me on 27jan and made my first complaint to croma email on 28th jan.   \n\n\nI dont know what to do now, I want to fight this legally in court, please guide me what steps should I follow now, Should I hire a lawyer now? I live in Mubai.",
    "flair": "Law & Courts",
    "score": 16,
    "num_comments": 8,
    "created_utc": 1708617896.0,
    "convurl": "https://external-preview.redd.it/w9e1Qi-hnLVAxXuJYoFdFuOoQ94uvbCZQ3FjVWNhg5M.jpg?auto=webp&s=21c8565ea62cce6d00c33559fcd3ab25539603d1",
    "comments": [
        "P.s. the video on the twitter website is edited so as to hide my personal details (original uncut unedited unboxing video was sent to croma, and the weight proof was also mentioned to croma on email and on consumer helpline gov)",
        "I'm sorry but why would you buy from croma online their website alone is a major red flag. Looks like a scammy website. Anyways, you could go to consumer court and try your luck there",
        "As i said I already made complaint on consumerhelpline goc page but they denied. I would like to take this to court. Please guide me the steps to do that.  \n\n\nAlso, I bought it because I have bought many items from croma previously with almost no sisue (some issue arrised but meh) also this was at a whopping 10k rs off, i.e. I got it for 5k  \n\n\nMany of the people I know bought it as well and they got perfectly fine headset, 1 guy even got JBL Tour one M2 because they didnt had stock for m1, but here I am getting empty box and even after providing all proof croma just dont want to listen.",
        "People from r/LegalAdviceIndia would be able to guide you through the process of taking this to court.\n\nPost this on that subreddit",
        "Thanks a lot, will do <3",
        "The website is slow and ui is outdated, does that make probably the biggest offline retail store chain in the country a scam?",
        "Have you saved a copy of the original product listing? Read it carefully. It may say in a very small font size or in text the same color as the page background that the item for sale is the box.",
        "No but doesn't paint a good picture does it, especially from \"the biggest offline retail store\"",
        "lol no lmao thats not what they wrote because many have already received perfect sealed pack and 1 guy even got upgraded to M2 since they didnt have M1 in stock.   \nThis isnt ebay xD"
    ],
    "cleaned_text": "scammed croma online denying complaint proceed legally context twitter post herehttpsxcomannoyingpennystatuss basically ordered jbl tour one headset croma online croma packaging perfect inside headset box tampered headset missing made unboxing video provided proof even several emails saying per scm investigation confirmed sent perfect product whats interesting weight entire package croma sent kg even shipping label mention kg empty headset box weighs exactly kg headset weighed grams got figure friend also bought headset received perfect new seal condition even shipping label provided weight grams xd clearly didnt send headset still denying anything wrong side made complaints consumerhelpline gov website closed hours stating received correct product complained around th feb last website order received jan made first complaint croma email th jan dont know want fight legally court please guide steps follow hire lawyer live mubai ",
    "cleaned_title": "scammed croma online denying complaint proceed legally",
    "cleaned_selftext": "context twitter post herehttpsxcomannoyingpennystatuss basically ordered jbl tour one headset croma online croma packaging perfect inside headset box tampered headset missing made unboxing video provided proof even several emails saying per scm investigation confirmed sent perfect product whats interesting weight entire package croma sent kg even shipping label mention kg empty headset box weighs exactly kg headset weighed grams got figure friend also bought headset received perfect new seal condition even shipping label provided weight grams xd clearly didnt send headset still denying anything wrong side made complaints consumerhelpline gov website closed hours stating received correct product complained around th feb last website order received jan made first complaint croma email th jan dont know want fight legally court please guide steps follow hire lawyer live mubai",
    "cleaned_comments": "ps video twitter website edited hide personal details original uncut unedited unboxing video sent croma weight proof also mentioned croma email consumer helpline gov im sorry would buy croma online website alone major red flag looks like scammy website anyways could go consumer court try luck said already made complaint consumerhelpline goc page denied would like take court please guide steps also bought bought many items croma previously almost sisue issue arrised meh also whopping k rs ie got k many people know bought well got perfectly fine headset guy even got jbl tour one didnt stock getting empty box even providing proof croma dont want listen people rlegaladviceindia would able guide process taking court post subreddit thanks lot website slow ui outdated make probably biggest offline retail store chain country scam saved copy original product listing read carefully may say small font size text color page background item sale box doesnt paint good picture especially biggest offline retail store lol lmao thats wrote many already received perfect sealed pack guy even got upgraded since didnt stock isnt ebay xd",
    "light_cleaned_title": "I have been scammed by croma online and they are denying my complaint. How to proceed legally?",
    "light_cleaned_selftext": "This is the context twitter post [here](https://x.com/AnnoyingPenny89/status/1753315051786961242?s=20) So, basically ordered a JBL Tour One headset from croma online, croma packaging is perfect but inside the headset box is tampered and the headset is missing. Made unboxing video and provided to them the proof that it was not their, even after several emails all they are saying is As per their SCM or investigation they have confirmed they sent me perfect product. Whats interesting is the weight of the entire package croma sent is 0.58kg and even their shipping label mention 0.58kg, and the empty headset box weighs exactly the same 0.58kg. If the headset was there then it should have weighed 829grams + (got this figure from a friend who also bought the same headset and received in perfect new seal condition) but even their shipping label provided that its weight is 580grams xD They clearly didnt send the headset and still denying that anything is wrong by their side. I made 2 complaints on consumerhelpline gov in website, both of them were closed in under 48 hours stating the same that I have received correct product. I complained around 9th feb last on that website. The order was received by me on 27jan and made my first complaint to croma email on 28th jan. I dont know what to do now, I want to fight this legally in court, please guide me what steps should I follow now, Should I hire a lawyer now? I live in Mubai.",
    "light_cleaned_comments": "P.s. the video on the twitter website is edited so as to hide my personal details (original uncut unedited unboxing video was sent to croma, and the weight proof was also mentioned to croma on email and on consumer helpline gov) I'm sorry but why would you buy from croma online their website alone is a major red flag. Looks like a scammy website. Anyways, you could go to consumer court and try your luck there As i said I already made complaint on consumerhelpline goc page but they denied. I would like to take this to court. Please guide me the steps to do that. Also, I bought it because I have bought many items from croma previously with almost no sisue (some issue arrised but meh) also this was at a whopping 10k rs off, i.e. I got it for 5k Many of the people I know bought it as well and they got perfectly fine headset, 1 guy even got JBL Tour one M2 because they didnt had stock for m1, but here I am getting empty box and even after providing all proof croma just dont want to listen. People from r/LegalAdviceIndia would be able to guide you through the process of taking this to court. Post this on that subreddit Thanks a lot, will do <3 The website is slow and ui is outdated, does that make probably the biggest offline retail store chain in the country a scam? Have you saved a copy of the original product listing? Read it carefully. It may say in a very small font size or in text the same color as the page background that the item for sale is the box. No but doesn't paint a good picture does it, especially from \"the biggest offline retail store\" lol no lmao thats not what they wrote because many have already received perfect sealed pack and 1 guy even got upgraded to M2 since they didnt have M1 in stock. This isnt ebay xD"
}