{
    "id": "15o2p8i",
    "title": "Question about Rajya Sabha members sitting in Lok Sabha during No Confidence Vote",
    "url": "https://www.reddit.com/r/india/comments/15o2p8i/question_about_rajya_sabha_members_sitting_in_lok/",
    "selftext": "During the No Confidence vote against the Modi govt. in the Lok Sabha yesterday, I noticed that some Rajya Sabha members were sitting in the Lok Sabha (Nirmala Sitharaman, S. Jaishankar, Hardeep Singh Puri).\n\nI didn't find this unusual, because they may have been there are ministers whose consultation might be needed during the debate, etc.\n\nHowever, I was surprised that they didn't leave the Lok Sabha before the voice vote. **Why were they allowed to sit in the Lok Sabha crowd during the voice vote?**\n\nAlso, right after the no-confidence vote was won by the Modi govt., there was a proposal to suspend Adhir Ranjan Chowdhury. I distinctly noticed Hardeep Singh Puri raise his hand in affirmation, during the voice vote on that issue (3:19 in this video [https://youtu.be/PPW42yiIXDs?t=199](https://youtu.be/PPW42yiIXDs?t=199) ). **How come he was allowed to participate in a Lok Sabha vote? Is there something I'm missing?**",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691741387.0,
    "convurl": "https://external-preview.redd.it/QoSDf5zXixPyam-4rE0tTDDpLxLJ3IkTnrqaXC9IEF0.jpg?auto=webp&s=35b020676c3ce3b26cdb7956bae5ed520185bf6a",
    "comments": [],
    "cleaned_text": "question rajya sabha members sitting lok sabha confidence vote confidence vote modi govt lok sabha yesterday noticed rajya sabha members sitting lok sabha nirmala sitharaman jaishankar hardeep singh puri didnt find unusual may ministers whose consultation might needed debate etc however surprised didnt leave lok sabha voice vote allowed sit lok sabha crowd voice vote also right noconfidence vote modi govt proposal suspend adhir ranjan chowdhury distinctly noticed hardeep singh puri raise hand affirmation voice vote issue video httpsyoutubeppwyiixdsthttpsyoutubeppwyiixdst come allowed participate lok sabha vote something im missing ",
    "cleaned_title": "question rajya sabha members sitting lok sabha confidence vote",
    "cleaned_selftext": "confidence vote modi govt lok sabha yesterday noticed rajya sabha members sitting lok sabha nirmala sitharaman jaishankar hardeep singh puri didnt find unusual may ministers whose consultation might needed debate etc however surprised didnt leave lok sabha voice vote allowed sit lok sabha crowd voice vote also right noconfidence vote modi govt proposal suspend adhir ranjan chowdhury distinctly noticed hardeep singh puri raise hand affirmation voice vote issue video httpsyoutubeppwyiixdsthttpsyoutubeppwyiixdst come allowed participate lok sabha vote something im missing",
    "cleaned_comments": "",
    "light_cleaned_title": "Question about Rajya Sabha members sitting in Lok Sabha during No Confidence Vote",
    "light_cleaned_selftext": "During the No Confidence vote against the Modi govt. in the Lok Sabha yesterday, I noticed that some Rajya Sabha members were sitting in the Lok Sabha (Nirmala Sitharaman, S. Jaishankar, Hardeep Singh Puri). I didn't find this unusual, because they may have been there are ministers whose consultation might be needed during the debate, etc. However, I was surprised that they didn't leave the Lok Sabha before the voice vote. **Why were they allowed to sit in the Lok Sabha crowd during the voice vote?** Also, right after the no-confidence vote was won by the Modi govt., there was a proposal to suspend Adhir Ranjan Chowdhury. I distinctly noticed Hardeep Singh Puri raise his hand in affirmation, during the voice vote on that issue (3:19 in this video [https://youtu.be/PPW42yiIXDs?t=199](https://youtu.be/PPW42yiIXDs?t=199) ). **How come he was allowed to participate in a Lok Sabha vote? Is there something I'm missing?**",
    "light_cleaned_comments": ""
}