{
    "id": "1dlavg9",
    "title": "Kerala influencer suicide: Teen's friend held under Pocso",
    "url": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/kerala-influencer-suicide-teens-friend-held-under-pocso/articleshow/111101110.cms",
    "selftext": "Okay, so activity avoid highschool romances because you can be called a rapist if something goes down? Can the POCSO be challenged in this case ? \n\nHow is this abetment of suicide by the guy? \n\nI've so many questions man, I'd love to discuss this.",
    "flair": "Crime",
    "score": 2,
    "num_comments": 6,
    "created_utc": 1718994193.0,
    "convurl": "https://external-preview.redd.it/MPqBYuRz6m-HxSY4Ko2YTsokeRav7aGQ4Dqg4I95orA.jpg?auto=webp&s=65287b25ad3e22efc1bf77dc215761beebdf5b8b",
    "comments": [
        "Like almost any charge, yes it can be challenged and most times in such situations the courts are lenient and only force counselling or something. \n\nAlso, not exactly but this is why we need a 'Romeo and Juliet' clause in the Act. Any couple under 18 engaging in any sexual activity automatically commits a crime against each other under POCSO.",
        "So did they charge the dude with POCSO just to arrest and keep him in custody? \n\nLike, for questioning and stuff?",
        "It's a cognizable, non-bailable offence. \n\nIf the Police come to know of it, they sort of have to arrest and charge the person. Someone else need not file a case or anything."
    ],
    "cleaned_text": "kerala influencer suicide teens friend held pocso okay activity avoid highschool romances called rapist something goes pocso challenged case abetment suicide guy ive many questions man id love discuss ",
    "cleaned_title": "kerala influencer suicide teens friend held pocso",
    "cleaned_selftext": "okay activity avoid highschool romances called rapist something goes pocso challenged case abetment suicide guy ive many questions man id love discuss",
    "cleaned_comments": "like almost charge yes challenged times situations courts lenient force counselling something also exactly need romeo juliet clause act couple engaging sexual activity automatically commits crime pocso charge dude pocso arrest keep custody like questioning stuff cognizable nonbailable offence police come know sort arrest charge person someone else need file case anything",
    "light_cleaned_title": "Kerala influencer suicide: Teen's friend held under Pocso",
    "light_cleaned_selftext": "Okay, so activity avoid highschool romances because you can be called a rapist if something goes down? Can the POCSO be challenged in this case ? How is this abetment of suicide by the guy? I've so many questions man, I'd love to discuss this.",
    "light_cleaned_comments": "Like almost any charge, yes it can be challenged and most times in such situations the courts are lenient and only force counselling or something. Also, not exactly but this is why we need a 'Romeo and Juliet' clause in the Act. Any couple under 18 engaging in any sexual activity automatically commits a crime against each other under POCSO. So did they charge the dude with POCSO just to arrest and keep him in custody? Like, for questioning and stuff? It's a cognizable, non-bailable offence. If the Police come to know of it, they sort of have to arrest and charge the person. Someone else need not file a case or anything."
}