{
    "id": "15wd1te",
    "title": "Update : Help me save my father's life , he needs a kidney transplant",
    "url": "https://www.reddit.com/r/india/comments/15wd1te/update_help_me_save_my_fathers_life_he_needs_a/",
    "selftext": "I posted here yesterday asking for your help to raise funds for his surgery. I'm overwhelmed by the response and the support I have received from you. Thank you so much for your kindness and generosity. I'm happy to share with you that we have raised a total of 1,72,000 rupees in 15 hours. That's amazing and unbelievable. We are so grateful to everyone who has donated and shared our fundraiser. You have given us hope and courage to fight this battle.\n\nHowever, we still need 5.34 lacs more to reach our goal of 7.06 lacs. The transplant is very expensive and we have no other source of income or savings. We are looking for some trusts and NGOs that can help us with the funds, but it will take time and there is no guarantee that we will get the assistance we need. Some of you have raised some doubts and questions about our situation and our fundraiser. I understand your concerns and I respect your right to ask for proof and clarification. I have nothing to hide and I'm ready to provide all the documents and reports that prove our genuineness and desperation.\n\nI have attached some reports and documents that show my father's diagnosis, treatment, hospital bills, donor registration, transplant estimate, and fundraiser details.\n\nSome of you have also suggested that we apply for the PMJAY scheme, which provides free health insurance for poor people. We appreciate your advice and we have looked into it. However, we are not eligible for the scheme because we have a white ration card which is of Uttar Pradesh. We have not been able to change our ration card or get a domicile certificate in Maharashtra. This makes us ineligible for the scheme in both states.\n\nMy father can't do dialysis for long as his creatinine level is already 11.4, which is very high and dangerous. Dialysis is also very expensive and draining for him. He needs a kidney transplant to live a normal life again. We are preparing documents for now as all trusts and NGOs are asking for it.\n\nPls help by donating here :- UPI - sbs221007@okicici\nMilaap - http://m-lp.co/ramkrish-3?utm_medium=native_story&utm_source=donor_app_campaign_page\n\nI've attached recent reports here :- https://www.linkpicture.com/q/IMG-20230819-WA0007.jpg\n\nhttps://www.linkpicture.com/q/Screenshot_20230820-121401.png\n\nhttps://www.linkpicture.com/q/Screenshot_20230820-121640.png\n\nhttps://www.linkpicture.com/q/Screenshot_20230820-121748.png\n\nhttps://www.linkpicture.com/q/Screenshot_20230820-121729-3.png\n\nhttps://www.linkpicture.com/q/IMG-20230819-WA0008.jpg",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692542183.0,
    "convurl": "https://external-preview.redd.it/BnuFWgN8q6_kG_aa-14QFgaJl5jxs1MBJn12v9MdObk.jpg?auto=webp&s=959d92333793b0a86ef8075ef8fcacfe0a347533",
    "comments": [
        "FAKE",
        "BEWARE! THIS IS VERY VERY LIKELY TO BE FAKE GUYS! See the below link which was a similar fundraiser request from 2 years ago from same doctors and same hospital! This guy’s handwritten letter is the exact same writing as that one. He most likely photoshopped it:\n\nhttps://www.ketto.org/amp/fundraiser/i-need-your-urgent-support-for-my-severe-kidney-failure-treatment-556184"
    ],
    "cleaned_text": "update help save fathers life needs kidney transplant posted yesterday asking help raise funds surgery im overwhelmed response support received thank much kindness generosity im happy share raised total rupees hours thats amazing unbelievable grateful everyone donated shared fundraiser given us hope courage fight battle however still need lacs reach goal lacs transplant expensive source income savings looking trusts ngos help us funds take time guarantee get assistance need raised doubts questions situation fundraiser understand concerns respect right ask proof clarification nothing hide im ready provide documents reports prove genuineness desperation attached reports documents show fathers diagnosis treatment hospital bills donor registration transplant estimate fundraiser details also suggested apply pmjay scheme provides free health insurance poor people appreciate advice looked however eligible scheme white ration card uttar pradesh able change ration card get domicile certificate maharashtra makes us ineligible scheme states father cant dialysis long creatinine level already high dangerous dialysis also expensive draining needs kidney transplant live normal life preparing documents trusts ngos asking pls help donating upi sbsokicici milaap ive attached recent reports ",
    "cleaned_title": "update help save fathers life needs kidney transplant",
    "cleaned_selftext": "posted yesterday asking help raise funds surgery im overwhelmed response support received thank much kindness generosity im happy share raised total rupees hours thats amazing unbelievable grateful everyone donated shared fundraiser given us hope courage fight battle however still need lacs reach goal lacs transplant expensive source income savings looking trusts ngos help us funds take time guarantee get assistance need raised doubts questions situation fundraiser understand concerns respect right ask proof clarification nothing hide im ready provide documents reports prove genuineness desperation attached reports documents show fathers diagnosis treatment hospital bills donor registration transplant estimate fundraiser details also suggested apply pmjay scheme provides free health insurance poor people appreciate advice looked however eligible scheme white ration card uttar pradesh able change ration card get domicile certificate maharashtra makes us ineligible scheme states father cant dialysis long creatinine level already high dangerous dialysis also expensive draining needs kidney transplant live normal life preparing documents trusts ngos asking pls help donating upi sbsokicici milaap ive attached recent reports",
    "cleaned_comments": "fake beware likely fake guys see link similar fundraiser request years ago doctors hospital guys handwritten letter exact writing one likely photoshopped",
    "light_cleaned_title": "Update : Help me save my father's life , he needs a kidney transplant",
    "light_cleaned_selftext": "I posted here yesterday asking for your help to raise funds for his surgery. I'm overwhelmed by the response and the support I have received from you. Thank you so much for your kindness and generosity. I'm happy to share with you that we have raised a total of 1,72,000 rupees in 15 hours. That's amazing and unbelievable. We are so grateful to everyone who has donated and shared our fundraiser. You have given us hope and courage to fight this battle. However, we still need 5.34 lacs more to reach our goal of 7.06 lacs. The transplant is very expensive and we have no other source of income or savings. We are looking for some trusts and NGOs that can help us with the funds, but it will take time and there is no guarantee that we will get the assistance we need. Some of you have raised some doubts and questions about our situation and our fundraiser. I understand your concerns and I respect your right to ask for proof and clarification. I have nothing to hide and I'm ready to provide all the documents and reports that prove our genuineness and desperation. I have attached some reports and documents that show my father's diagnosis, treatment, hospital bills, donor registration, transplant estimate, and fundraiser details. Some of you have also suggested that we apply for the PMJAY scheme, which provides free health insurance for poor people. We appreciate your advice and we have looked into it. However, we are not eligible for the scheme because we have a white ration card which is of Uttar Pradesh. We have not been able to change our ration card or get a domicile certificate in Maharashtra. This makes us ineligible for the scheme in both states. My father can't do dialysis for long as his creatinine level is already 11.4, which is very high and dangerous. Dialysis is also very expensive and draining for him. He needs a kidney transplant to live a normal life again. We are preparing documents for now as all trusts and NGOs are asking for it. Pls help by donating here :- UPI - sbs221007@okicici Milaap - I've attached recent reports here :-",
    "light_cleaned_comments": "FAKE BEWARE! THIS IS VERY VERY LIKELY TO BE FAKE GUYS! See the below link which was a similar fundraiser request from 2 years ago from same doctors and same hospital! This guy’s handwritten letter is the exact same writing as that one. He most likely photoshopped it:"
}