{
    "id": "1bvmvdq",
    "title": "Netflix OTT scam Beware!",
    "url": "https://www.reddit.com/gallery/1bvmvdq",
    "selftext": "I have been scammed of Rs60(i know not that much). Beware of Instagram Ids selling OTT accounts for cheap. I fell for a account selling Netflix for 60 a month.\n\nNow there are some accounts which are genuine and they sell at 129 a month but I fell because of extremely low price. Here attaching screenshots so beware.\n\ninsta id: ott_seller005\nPh no: 9903585127\n\nOfcourse he has now blocked me.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 39,
    "created_utc": 1712236570.0,
    "convurl": "https://i.redd.it/hvh9ol5eqgsc1.jpg",
    "comments": [
        "Goddamn i also got to know about these accounts and was thinking to buy.",
        "Yep glad it took me only 60 to learn",
        "Always follow “if it’s too good to be true..”",
        "Yep. I dunno what came over me i got too greedy for fuckin Netflix",
        "Just to be safe change your UPI PIN as well. You never know scanning QR codes from people like this.",
        "Wait what? How can scanning a qr code give them access to my PIN?",
        "Saying this based on a scam my friend had gone through, the QR code led them to a website that looked like a payment gateway and grabbed her UPI PIN when she made the payment, and they took all the money in her account a few minutes later.",
        "I changed my PIN right now.\n\nHowever I scanned the qr on GPay app so i guess what you mentioned didn't happen in my case.\n\nThanks for the info though.",
        "No problem. Stay safe! ✌️",
        "You paid a random stranger called OTT SELLER? ....",
        "bhaii tu mujhe 50 de mai terko internet ki koi bhi chiz laa ke de dunga and that too tu dekh le phir paise diyo in ch\\*\n\ntiya scam me mat phasa kar",
        "😹😹 💀",
        "Bro I know it sounds and dumb(and it prob is) but my friend buys netflix from a seller at 100 a month. \n\nThats why I did not hesitate that much. Guess I was wrong.",
        "Haan bhai kat gaya bohot bura....\n\nMera ek dost h ek saal se netflix khareed rha hai ek telegram ke seller se isi wajah se mai bhi socha aur saste mei le lu lekin la*ude lag gye...🤡🤡",
        "Ikr🤡",
        "Yeah...",
        "Kaun si chij bro ?",
        "why you not go with piracy ?",
        "I think you should use Subspace app. I recently started using it.",
        "I do piracy. In fact I dont have one ott subscription. But sometimes for old titles and for 4k quality the condition of torrents is not good and its not streamable. Since I watch on TV, downloading and transferring is too much of a hassle. So thats why I decided to buy but got scammed.",
        "What does it do?",
        "It's a subscription sharing app. Looks like you need Netflix so you can get it from there instead of shady people.",
        "Link?",
        "Waise bhi Netflix 200 tak aa jata hai, Scam hone se accha legitimate buy kar leta",
        "are mtlb shows , documentry movies etc",
        "Try streamio",
        "I use it extensively in fact its what i use to Hollywood media but those 4k streams just suck without Debrid.",
        "Bhai dost kahan se lau share karne ke liye",
        "Beggers cant be choosers",
        "Chilla chillake scheme bata dijiye",
        "What is this suppose to mean?",
        "Classic Pishing Scam",
        "You asked him to scam you since you are the one who messaged him first. This post doesn’t look like awareness about OTT scam but the awareness about being dumb.",
        "haha",
        "Just yesterday someone shared an app called subspace on Google that allows buying/selling of shared ott or something similar like that.",
        "Hey how's ur experience has been so far with subspace?? Are they legit? With any of the otts they mentioned??",
        "I sell Netflix at ₹163/month that too I only have ₹6 profit for each user and the audacity of mf..",
        "Please verify and buy ....I am selling for 2years now but still itna Kam mey main ₹163/month mey 4k sell karta hu ₹60 mey it's not possible tbh",
        "Yea I'm a Subspace seller only..",
        "Yea I'm a Subspace premium seller and I sell online on telegram and all but never Like seriously only for ₹60?! Like it's not possible"
    ],
    "cleaned_text": "netflix ott scam beware scammed rsi know much beware instagram ids selling ott accounts cheap fell account selling netflix month accounts genuine sell month fell extremely low price attaching screenshots beware insta id ottseller ph ofcourse blocked ",
    "cleaned_title": "netflix ott scam beware",
    "cleaned_selftext": "scammed rsi know much beware instagram ids selling ott accounts cheap fell account selling netflix month accounts genuine sell month fell extremely low price attaching screenshots beware insta id ottseller ph ofcourse blocked",
    "cleaned_comments": "goddamn also got know accounts thinking buy yep glad took learn always follow good true yep dunno came got greedy fuckin netflix safe change upi pin well never know scanning qr codes people like wait scanning qr code give access pin saying based scam friend gone qr code led website looked like payment gateway grabbed upi pin made payment took money account minutes later changed pin right however scanned qr gpay app guess mentioned didnt happen case thanks info though problem stay safe paid random stranger called ott seller bhaii tu mujhe de mai terko internet ki koi bhi chiz laa ke de dunga tu dekh le phir paise diyo ch tiya scam mat phasa kar bro know sounds dumband prob friend buys netflix seller month thats hesitate much guess wrong haan bhai kat gaya bohot bura mera ek dost h ek saal se netflix khareed rha hai ek telegram ke seller se isi wajah se mai bhi socha aur saste mei le lu lekin laude lag gye ikr yeah kaun si chij bro go piracy think use subspace app recently started using piracy fact dont one ott subscription sometimes old titles k quality condition torrents good streamable since watch tv downloading transferring much hassle thats decided buy got scammed subscription sharing app looks like need netflix get instead shady people link waise bhi netflix tak aa jata hai scam hone se accha legitimate buy kar leta mtlb shows documentry movies etc try streamio use extensively fact use hollywood media k streams suck without debrid bhai dost kahan se lau share karne ke liye beggers cant choosers chilla chillake scheme bata dijiye suppose mean classic pishing scam asked scam since one messaged first post doesnt look like awareness ott scam awareness dumb haha yesterday someone shared app called subspace google allows buyingselling shared ott something similar like hey hows ur experience far subspace legit otts mentioned sell netflix month profit user audacity mf please verify buy selling years still itna kam mey main month mey k sell karta hu mey possible tbh yea im subspace seller yea im subspace premium seller sell online telegram never like seriously like possible",
    "light_cleaned_title": "Netflix OTT scam Beware!",
    "light_cleaned_selftext": "I have been scammed of Rs60(i know not that much). Beware of Instagram Ids selling OTT accounts for cheap. I fell for a account selling Netflix for 60 a month. Now there are some accounts which are genuine and they sell at 129 a month but I fell because of extremely low price. Here attaching screenshots so beware. insta id: ott_seller005 Ph no: 9903585127 Ofcourse he has now blocked me.",
    "light_cleaned_comments": "Goddamn i also got to know about these accounts and was thinking to buy. Yep glad it took me only 60 to learn Always follow “if it’s too good to be true..” Yep. I dunno what came over me i got too greedy for fuckin Netflix Just to be safe change your UPI PIN as well. You never know scanning QR codes from people like this. Wait what? How can scanning a qr code give them access to my PIN? Saying this based on a scam my friend had gone through, the QR code led them to a website that looked like a payment gateway and grabbed her UPI PIN when she made the payment, and they took all the money in her account a few minutes later. I changed my PIN right now. However I scanned the qr on GPay app so i guess what you mentioned didn't happen in my case. Thanks for the info though. No problem. Stay safe! ✌️ You paid a random stranger called OTT SELLER? .... bhaii tu mujhe 50 de mai terko internet ki koi bhi chiz laa ke de dunga and that too tu dekh le phir paise diyo in ch\\* tiya scam me mat phasa kar 😹😹 💀 Bro I know it sounds and dumb(and it prob is) but my friend buys netflix from a seller at 100 a month. Thats why I did not hesitate that much. Guess I was wrong. Haan bhai kat gaya bohot bura.... Mera ek dost h ek saal se netflix khareed rha hai ek telegram ke seller se isi wajah se mai bhi socha aur saste mei le lu lekin la*ude lag gye...🤡🤡 Ikr🤡 Yeah... Kaun si chij bro ? why you not go with piracy ? I think you should use Subspace app. I recently started using it. I do piracy. In fact I dont have one ott subscription. But sometimes for old titles and for 4k quality the condition of torrents is not good and its not streamable. Since I watch on TV, downloading and transferring is too much of a hassle. So thats why I decided to buy but got scammed. What does it do? It's a subscription sharing app. Looks like you need Netflix so you can get it from there instead of shady people. Link? Waise bhi Netflix 200 tak aa jata hai, Scam hone se accha legitimate buy kar leta are mtlb shows , documentry movies etc Try streamio I use it extensively in fact its what i use to Hollywood media but those 4k streams just suck without Debrid. Bhai dost kahan se lau share karne ke liye Beggers cant be choosers Chilla chillake scheme bata dijiye What is this suppose to mean? Classic Pishing Scam You asked him to scam you since you are the one who messaged him first. This post doesn’t look like awareness about OTT scam but the awareness about being dumb. haha Just yesterday someone shared an app called subspace on Google that allows buying/selling of shared ott or something similar like that. Hey how's ur experience has been so far with subspace?? Are they legit? With any of the otts they mentioned?? I sell Netflix at ₹163/month that too I only have ₹6 profit for each user and the audacity of mf.. Please verify and buy ....I am selling for 2years now but still itna Kam mey main ₹163/month mey 4k sell karta hu ₹60 mey it's not possible tbh Yea I'm a Subspace seller only.. Yea I'm a Subspace premium seller and I sell online on telegram and all but never Like seriously only for ₹60?! Like it's not possible"
}