{
    "id": "14nv5vp",
    "title": "[Project] India in 2050",
    "url": "https://www.reddit.com/r/india/comments/14nv5vp/project_india_in_2050/",
    "selftext": "I'm working on a book with the same title: \"**India in 2050**\". I'm hoping to publish it by August 2025. I'm reserving the next 12 months for research and reaching out to as many Indians as possible. 27 years is not a long period in a nation's life, but it's not too small. A lot of significant goals can be achieved only if our efforts are focused and directed. \n\nI'm getting started with this research with a small survey. **Please fill out the survey below.** Please ensure that you **don't put any personal information** that can be traced back to you - [https://forms.gle/4iSrxWYK3j6Tm2jg6](https://forms.gle/4iSrxWYK3j6Tm2jg6) ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1688218083.0,
    "convurl": "https://external-preview.redd.it/Z_6race8m9K4rdAYKvzwB0d8NbsGr0BT1ov1YZ2kIsU.jpg?auto=webp&v=enabled&s=e48b1b00ffecead1d0325b7c11a6c7a6cfdd6fef",
    "comments": [],
    "cleaned_text": "project india im working book title india im hoping publish august im reserving next months research reaching many indians possible years long period nations life small lot significant goals achieved efforts focused directed im getting started research small survey please fill survey please ensure dont put personal information traced back httpsformsgleisrxwykjtmjghttpsformsgleisrxwykjtmjg ",
    "cleaned_title": "project india",
    "cleaned_selftext": "im working book title india im hoping publish august im reserving next months research reaching many indians possible years long period nations life small lot significant goals achieved efforts focused directed im getting started research small survey please fill survey please ensure dont put personal information traced back httpsformsgleisrxwykjtmjghttpsformsgleisrxwykjtmjg",
    "cleaned_comments": "",
    "light_cleaned_title": "[Project] India in 2050",
    "light_cleaned_selftext": "I'm working on a book with the same title: \"**India in 2050**\". I'm hoping to publish it by August 2025. I'm reserving the next 12 months for research and reaching out to as many Indians as possible. 27 years is not a long period in a nation's life, but it's not too small. A lot of significant goals can be achieved only if our efforts are focused and directed. I'm getting started with this research with a small survey. **Please fill out the survey below.** Please ensure that you **don't put any personal information** that can be traced back to you - [https://forms.gle/4iSrxWYK3j6Tm2jg6](https://forms.gle/4iSrxWYK3j6Tm2jg6)",
    "light_cleaned_comments": ""
}