{
    "id": "18fnosq",
    "title": "Lack of food safety standards",
    "url": "https://www.reddit.com/gallery/18fnosq",
    "selftext": "I recently purchased a juice from a supermarket which neither had an expiry date (no mfg date in order to determine its expiry date anywhere on the product including top or bottom. It was only mentioned 'expiry after 6 months') nor price on it. \n\nThis isn't the first time i noticed the absence of such basic details on various procucts. But i decided to post this issue here. Initially, instead of purchasing i only wanted to take its photos. But unfortunately the juice section was very near to cash counters & their staff was around me. So i decided to buy it.\n\nAnyway, the lack of such details are appalling & pathetic. Even in 2023, this is the condition of our food safety enforcement. The rules & regulations are terribly executed. Hence, a lot of companies in some or other ways exploit us, consumers. Moreover, so many people still don't give a crap about these basic details. So, before you buy any kind of food/cosmetic products, always check for its expiry date & mrp. Make it a habit & if possible educate your family/friends & so on about it if they aren't aware or even if they don't care about these details. After all, knowing those details are absolutely our right.",
    "flair": "Rant / Vent",
    "score": 97,
    "num_comments": 15,
    "created_utc": 1702274208.0,
    "convurl": "https://i.redd.it/osvg81m6vl5c1.jpg",
    "comments": [
        "This is an OC fyi",
        "File a complaint in consumer court, you will easily win against this.",
        " don't buy if date and details are not available, sometimes its a manufacturing problem as the stamp has a small gap which fails to print on the bottle.\n\nthe store will anyways return the unsold bottles to the manufacturer.\n\nnow checking every batch for every bottle is difficult.\n\nbest contact their consumner care number / email and get a replacement.\n\nI once received a free replacement for Dettol  soap dispenser which had a printing error.\n\ncompany gave me 2 dispensers and 1 year stock of hand wash liquid as apology. also their executive came to my home to inspect the bottle physically and asked for shop details. this way they can track the supply chain of defective bottles.\n\nafter a year dettol even sent me 2 bottles of Foam dispenser as a gift  which was newly launched, they even took a survey by calling me on how i felt about the product.\n\nsame happened with my other friend who bought dry fruits from big bazaar (i forgot the brand name) there were some living bugs in the packet. the company mailed him a big bazar coupon equivalent to 250% of the product cost and also picked up the item from his home.",
        "You need to see if the problem is with whole bottle or entire stock there. If its just one bottle no issue its just a priniting error",
        "Maybe it's the entire stock. I checked for some more bottles & it was the same situation",
        "Take a picture and buy some more sample also looking if batch number is present or not that sue them in court",
        ">best contact their consumner care number /\n\nIs this how you did???",
        "Yes",
        "Check the base of the bottle.",
        ">(no mfg date in order to determine its expiry date anywhere on the product including top or bottom.\n\nIt wasn't there",
        "I filed one 2 years ago. Its still to have its first hearing. Stopped checking after a while.",
        "The health inspectors visiting these facilities sit quietly after taking a few thousands as bribe.\n\nCorruption at every stage. This is the biggest factor for stagnation of India's growth and QoL standards.",
        "So when the product expires, distributors and/or retailers erase the manuf. date, expiry date, etc so that the product can sell. The dates are easily removable using hand sanitizer (or alcohol based products I guess).\n\nSource: Worked at similar FMCG company!",
        "Our country is screwed whatsoever",
        "did you check the bottom too",
        "Did you check the body? (The transparent area between the cap and the wrapper) \n\nSometimes it’s not engraved properly and it’s really hard to see the information. This has happened with me few times."
    ],
    "cleaned_text": "lack food safety standards recently purchased juice supermarket neither expiry date mfg date order determine expiry date anywhere product including top bottom mentioned expiry months price isnt first time noticed absence basic details various procucts decided post issue initially instead purchasing wanted take photos unfortunately juice section near cash counters staff around decided buy anyway lack details appalling pathetic even condition food safety enforcement rules regulations terribly executed hence lot companies ways exploit us consumers moreover many people still dont give crap basic details buy kind foodcosmetic products always check expiry date mrp make habit possible educate familyfriends arent aware even dont care details knowing details absolutely right ",
    "cleaned_title": "lack food safety standards",
    "cleaned_selftext": "recently purchased juice supermarket neither expiry date mfg date order determine expiry date anywhere product including top bottom mentioned expiry months price isnt first time noticed absence basic details various procucts decided post issue initially instead purchasing wanted take photos unfortunately juice section near cash counters staff around decided buy anyway lack details appalling pathetic even condition food safety enforcement rules regulations terribly executed hence lot companies ways exploit us consumers moreover many people still dont give crap basic details buy kind foodcosmetic products always check expiry date mrp make habit possible educate familyfriends arent aware even dont care details knowing details absolutely right",
    "cleaned_comments": "oc fyi file complaint consumer court easily win dont buy date details available sometimes manufacturing problem stamp small gap fails print bottle store anyways return unsold bottles manufacturer checking every batch every bottle difficult best contact consumner care number email get replacement received free replacement dettol soap dispenser printing error company gave dispensers year stock hand wash liquid apology also executive came home inspect bottle physically asked shop details way track supply chain defective bottles year dettol even sent bottles foam dispenser gift newly launched even took survey calling felt product happened friend bought dry fruits big bazaar forgot brand name living bugs packet company mailed big bazar coupon equivalent product cost also picked item home need see problem whole bottle entire stock one bottle issue priniting error maybe entire stock checked bottles situation take picture buy sample also looking batch number present sue court best contact consumner care number yes check base bottle mfg date order determine expiry date anywhere product including top bottom wasnt filed one years ago still first hearing stopped checking health inspectors visiting facilities sit quietly taking thousands bribe corruption every stage biggest factor stagnation indias growth qol standards product expires distributors andor retailers erase manuf date expiry date etc product sell dates easily removable using hand sanitizer alcohol based products guess source worked similar fmcg company country screwed whatsoever check bottom check body transparent area cap wrapper sometimes engraved properly really hard see information happened times",
    "light_cleaned_title": "Lack of food safety standards",
    "light_cleaned_selftext": "I recently purchased a juice from a supermarket which neither had an expiry date (no mfg date in order to determine its expiry date anywhere on the product including top or bottom. It was only mentioned 'expiry after 6 months') nor price on it. This isn't the first time i noticed the absence of such basic details on various procucts. But i decided to post this issue here. Initially, instead of purchasing i only wanted to take its photos. But unfortunately the juice section was very near to cash counters & their staff was around me. So i decided to buy it. Anyway, the lack of such details are appalling & pathetic. Even in 2023, this is the condition of our food safety enforcement. The rules & regulations are terribly executed. Hence, a lot of companies in some or other ways exploit us, consumers. Moreover, so many people still don't give a crap about these basic details. So, before you buy any kind of food/cosmetic products, always check for its expiry date & mrp. Make it a habit & if possible educate your family/friends & so on about it if they aren't aware or even if they don't care about these details. After all, knowing those details are absolutely our right.",
    "light_cleaned_comments": "This is an OC fyi File a complaint in consumer court, you will easily win against this. don't buy if date and details are not available, sometimes its a manufacturing problem as the stamp has a small gap which fails to print on the bottle. the store will anyways return the unsold bottles to the manufacturer. now checking every batch for every bottle is difficult. best contact their consumner care number / email and get a replacement. I once received a free replacement for Dettol soap dispenser which had a printing error. company gave me 2 dispensers and 1 year stock of hand wash liquid as apology. also their executive came to my home to inspect the bottle physically and asked for shop details. this way they can track the supply chain of defective bottles. after a year dettol even sent me 2 bottles of Foam dispenser as a gift which was newly launched, they even took a survey by calling me on how i felt about the product. same happened with my other friend who bought dry fruits from big bazaar (i forgot the brand name) there were some living bugs in the packet. the company mailed him a big bazar coupon equivalent to 250% of the product cost and also picked up the item from his home. You need to see if the problem is with whole bottle or entire stock there. If its just one bottle no issue its just a priniting error Maybe it's the entire stock. I checked for some more bottles & it was the same situation Take a picture and buy some more sample also looking if batch number is present or not that sue them in court >best contact their consumner care number / Is this how you did??? Yes Check the base of the bottle. >(no mfg date in order to determine its expiry date anywhere on the product including top or bottom. It wasn't there I filed one 2 years ago. Its still to have its first hearing. Stopped checking after a while. The health inspectors visiting these facilities sit quietly after taking a few thousands as bribe. Corruption at every stage. This is the biggest factor for stagnation of India's growth and QoL standards. So when the product expires, distributors and/or retailers erase the manuf. date, expiry date, etc so that the product can sell. The dates are easily removable using hand sanitizer (or alcohol based products I guess). Source: Worked at similar FMCG company! Our country is screwed whatsoever did you check the bottom too Did you check the body? (The transparent area between the cap and the wrapper) Sometimes it’s not engraved properly and it’s really hard to see the information. This has happened with me few times."
}