{
    "id": "wx0voy",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/wx0voy/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 12,
    "num_comments": 6,
    "created_utc": 1661391008,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Arpan Ghosh\n\nJournalist, currently working for RTTNews for the last 1.5 years. Have worked for Star Sports previously and have 4 years of experience.\n\nLocation: Kolkata (would prefer WFH options due to family health problems).\n\nI am available to take calls at all hours and the number can be shared when asked.",
        "Frontend developer looking for remote work:\n\n* Fresher\n* HTML, CSS, Javascript\n* ReactJS +React Redux +React Router, Next.js\n\nDM for resume / projects / more info.",
        "1. Accounts/Audit (2 years) \n2. Tally prime, Accounts reconciliation &amp; Finalization, GST,  Income Tax. \n3. Kerala\n4. PM's for resume and further details.",
        "SDE\n1. Fresher\n2. Nit W ECE graduating 2023\n3 .Amazon intern this summer",
        "Posted this with my work-related Reddit account but it seems to be hidden--because of low karma, perhaps. So, posting it with my other account.\n\nLooking for a Content Writer. \n\n1. Amigo Softcom LLP\n2. MG Road, Gurgaon, Haryana\n3. See the job description on [Indeed](https://in.indeed.com/job/content-writer-621b93c1b247d250). You'll be required to produce contents like the ones on our blog: [https://blog.tryamigo.com](https://blog.tryamigo.com)\n4. Apply via the link provided with your resume and (preferably) a cover letter."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "arpan ghosh journalist currently working rttnews last years worked star sports previously years experience location kolkata would prefer wfh options due family health problems available take calls hours number shared asked frontend developer looking remote work fresher html css javascript reactjs react redux react router nextjs dm resume projects info accountsaudit years tally prime accounts reconciliation amp finalization gst income tax kerala pms resume details sde fresher nit w ece graduating amazon intern summer posted workrelated reddit account seems hiddenbecause low karma perhaps posting account looking content writer amigo softcom llp mg road gurgaon haryana see job description indeedhttpsinindeedcomjobcontentwriterbcbd youll required produce contents like ones blog httpsblogtryamigocomhttpsblogtryamigocom apply via link provided resume preferably cover letter",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Arpan Ghosh Journalist, currently working for RTTNews for the last 1.5 years. Have worked for Star Sports previously and have 4 years of experience. Location: Kolkata (would prefer WFH options due to family health problems). I am available to take calls at all hours and the number can be shared when asked. Frontend developer looking for remote work: * Fresher * HTML, CSS, Javascript * ReactJS +React Redux +React Router, Next.js DM for resume / projects / more info. 1. Accounts/Audit (2 years) 2. Tally prime, Accounts reconciliation &amp; Finalization, GST, Income Tax. 3. Kerala 4. PM's for resume and further details. SDE 1. Fresher 2. Nit W ECE graduating 2023 3 .Amazon intern this summer Posted this with my work-related Reddit account but it seems to be hidden--because of low karma, perhaps. So, posting it with my other account. Looking for a Content Writer. 1. Amigo Softcom LLP 2. MG Road, Gurgaon, Haryana 3. See the job description on [Indeed](https://in.indeed.com/job/content-writer-621b93c1b247d250). You'll be required to produce contents like the ones on our blog: [https://blog.tryamigo.com](https://blog.tryamigo.com) 4. Apply via the link provided with your resume and (preferably) a cover letter."
}