{
    "id": "1exjl4x",
    "title": "\"No Fundamental Right To Demand Laws Titled In Familiar Languages\": Kerala HC On 'Hindi' Names Of New Criminal Laws",
    "url": "https://www.livelaw.in/high-court/kerala-high-court/kerala-high-court-nothing-prevents-parliament-giving-hindi-titles-criminal-laws-no-fundamental-right-demand-titles-familiar-languages-267226",
    "selftext": "English is a language recognized under the Constitution. Under Article 351 of the Constitution, directives are issued for the development of Hindi language as a medium of expression for all the elements of composite culture of India. Therefore, nothing prevents Parliament from using Hindi words as the title of an enactment. The mandate under the Constitution is to prefer English as the authoritative text to ensure uniformity throughout the country, not to denounce Hindi in any form with reference to the title of an enactment.” ",
    "flair": "Law & Courts",
    "score": 51,
    "num_comments": 8,
    "created_utc": 1724225835.0,
    "convurl": "https://external-preview.redd.it/_yejaj3o82pz6SsWrNeFwKKUUV8shZUYJnWg3MyZ1h4.jpg?auto=webp&s=ea46de723fcf9470f275bef2c190324bd9504832",
    "comments": [
        "Why can't they name it in Malayalam or Telugu? Names don't matter no?",
        "They don't lose anything by naming the laws in english, right? there'll always be a hindi translation for the name in the official papers, but you just have to name it in english so you don't snub it in south indians' faces.",
        "Wait till Kerala start using Manglish  in Law and claim it is English. Other States will start doing the same. Then we will become modern day Babylon",
        "i think its just to spite the South Indians.",
        "Because of the morons who wanted hindi as the official language while forming the constitution.",
        "Cause these morons can't learn another language. But they expect us to. The educated bunch have to sacrifice cause the rest aren't academically capable of learning anything",
        "This just to make it feel like hindi, hindu, hindustan model for all those who don't belong to each."
    ],
    "cleaned_text": "fundamental right demand laws titled familiar languages kerala hc hindi names new criminal laws english language recognized constitution article constitution directives issued development hindi language medium expression elements composite culture india therefore nothing prevents parliament using hindi words title enactment mandate constitution prefer english authoritative text ensure uniformity throughout country denounce hindi form reference title enactment ",
    "cleaned_title": "fundamental right demand laws titled familiar languages kerala hc hindi names new criminal laws",
    "cleaned_selftext": "english language recognized constitution article constitution directives issued development hindi language medium expression elements composite culture india therefore nothing prevents parliament using hindi words title enactment mandate constitution prefer english authoritative text ensure uniformity throughout country denounce hindi form reference title enactment",
    "cleaned_comments": "cant name malayalam telugu names dont matter dont lose anything naming laws english right therell always hindi translation name official papers name english dont snub south indians faces wait till kerala start using manglish law claim english states start become modern day babylon think spite south indians morons wanted hindi official language forming constitution cause morons cant learn another language expect us educated bunch sacrifice cause rest arent academically capable learning anything make feel like hindi hindu hindustan model dont belong",
    "light_cleaned_title": "\"No Fundamental Right To Demand Laws Titled In Familiar Languages\": Kerala HC On 'Hindi' Names Of New Criminal Laws",
    "light_cleaned_selftext": "English is a language recognized under the Constitution. Under Article 351 of the Constitution, directives are issued for the development of Hindi language as a medium of expression for all the elements of composite culture of India. Therefore, nothing prevents Parliament from using Hindi words as the title of an enactment. The mandate under the Constitution is to prefer English as the authoritative text to ensure uniformity throughout the country, not to denounce Hindi in any form with reference to the title of an enactment.”",
    "light_cleaned_comments": "Why can't they name it in Malayalam or Telugu? Names don't matter no? They don't lose anything by naming the laws in english, right? there'll always be a hindi translation for the name in the official papers, but you just have to name it in english so you don't snub it in south indians' faces. Wait till Kerala start using Manglish in Law and claim it is English. Other States will start doing the same. Then we will become modern day Babylon i think its just to spite the South Indians. Because of the morons who wanted hindi as the official language while forming the constitution. Cause these morons can't learn another language. But they expect us to. The educated bunch have to sacrifice cause the rest aren't academically capable of learning anything This just to make it feel like hindi, hindu, hindustan model for all those who don't belong to each."
}