{
    "id": "16prg4s",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/16prg4s/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&s=bdf0b44db553b7c8c9f4a76aca3943d1728f7d3c",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695432610.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg?auto=webp&amp;s=21b87d3f25e3ab70686935d27f8abf9a7bdc86bd",
    "comments": [
        "# Shoutout: Encouraging our little one to read and review - 98 Book reviews and counting \n\nI have been encouraging our little one to read and review books. \n\n# Thus far it is about [98 Youtube Book reviews](https://youtu.be/Oxiw6koMxPw?si=eTYQkziGtX_hZ5ZE) and counting\n\nIt is hard enough to motivate him to post reviews, even harder when the reviews garner only about 20+ views - as compared to that of his classmates dancing to Bollywood blockbusters!",
        "Recently finished *Ministry of Utmost happiness* and *Azadi* by Arundhati Roy. The first book has some very realistic descriptions of the excesses of the security apparatus in Kashmir. I had to stop reading at several places. Overall, a good book. Azadi is a collection of essays. She remains as fiery and anti-establishment as ever.",
        "Started reading Frank Herbert's Dune. Awesome book.",
        ">2\n\nSubscribed!",
        "I am currently reading \"bidhar\" by Bhalchandra Nemade, on page 100 now.Bidhar is the first book of Nemades \"Changdeo\" quartet.  till now it's very very good read.",
        "Thanks for subscribing... Hard enough motivating a young one to read in this age of social media and digital tools",
        "Yes. And then, just reading and forgetting is not very active. Composing reviews of what you've read is great.  \nUnfortunately, I've been too busy to watch his videos (I added to Watch Later). Watching is more important than just subscribing, I suppose.",
        "> Unfortunately, I've been too busy to watch his videos (I added to Watch Later). Watching is more important than just subscribing, I suppose.\n\nSure. And feedback welcome too..."
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "shoutout encouraging little one read review book reviews counting encouraging little one read review books thus far youtube book reviewshttpsyoutubeoxiwkomxpwsietyqkzigtxhzze counting hard enough motivate post reviews even harder reviews garner views compared classmates dancing bollywood blockbusters recently finished ministry utmost happiness azadi arundhati roy first book realistic descriptions excesses security apparatus kashmir stop reading several places overall good book azadi collection essays remains fiery antiestablishment ever started reading frank herberts dune awesome book subscribed currently reading bidhar bhalchandra nemade page nowbidhar first book nemades changdeo quartet till good read thanks subscribing hard enough motivating young one read age social media digital tools yes reading forgetting active composing reviews youve read great unfortunately ive busy watch videos added watch later watching important subscribing suppose unfortunately ive busy watch videos added watch later watching important subscribing suppose sure feedback welcome",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "# Shoutout: Encouraging our little one to read and review - 98 Book reviews and counting I have been encouraging our little one to read and review books. # Thus far it is about [98 Youtube Book reviews](https://youtu.be/Oxiw6koMxPw?si=eTYQkziGtX_hZ5ZE) and counting It is hard enough to motivate him to post reviews, even harder when the reviews garner only about 20+ views - as compared to that of his classmates dancing to Bollywood blockbusters! Recently finished *Ministry of Utmost happiness* and *Azadi* by Arundhati Roy. The first book has some very realistic descriptions of the excesses of the security apparatus in Kashmir. I had to stop reading at several places. Overall, a good book. Azadi is a collection of essays. She remains as fiery and anti-establishment as ever. Started reading Frank Herbert's Dune. Awesome book. >2 Subscribed! I am currently reading \"bidhar\" by Bhalchandra Nemade, on page 100 now.Bidhar is the first book of Nemades \"Changdeo\" quartet. till now it's very very good read. Thanks for subscribing... Hard enough motivating a young one to read in this age of social media and digital tools Yes. And then, just reading and forgetting is not very active. Composing reviews of what you've read is great. Unfortunately, I've been too busy to watch his videos (I added to Watch Later). Watching is more important than just subscribing, I suppose. > Unfortunately, I've been too busy to watch his videos (I added to Watch Later). Watching is more important than just subscribing, I suppose. Sure. And feedback welcome too..."
}