{
    "id": "179s93j",
    "title": "'Queer Couples Can Adopt Child Together': Supreme Court Gives Key Verdict During Hearing On Same-Sex Marriage",
    "url": "https://english.jagran.com/india/supreme-court-verdict-on-adoption-by-same-sex-couple-unmarried-parents-gay-queer-lesbian-cara-regulations-10107751",
    "selftext": "[deleted]",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1697525458.0,
    "convurl": "https://external-preview.redd.it/eCHOGDMv8dyFjpMoUwwFt61u17FWaLepCwUW-5u8FuI.jpg?auto=webp&s=36223f022f29d7b75fee25fc11f709043b916969",
    "comments": [
        "Not really. This was voted 3-2 against it",
        "Bhai khud ne bhi khol ke nahi padha kya, isi article ki pehli line hai. \n\n\"While the Chief Justice of India supported the recognition of adoption rights and scrapping of Central Adoption Resource Authority (CARA)'s regulation 5(3), three judges dissented from the proposal effectively nullifying the possibility of adoption for Queer couples.\"\n\nKhud ne hi r/worldnews pe post kiya hai waha sahi likha hai. Yaha posted article ka title change karke tune post kiya hai. Iska matlab ya to tu jan ke misinformation failata hai apne 'entertainment' ya 'agenda' ke liye. Ye sab karna band kar de, thoda padhai likhai pe dhyan de.",
        "Got to bless those 3.. phew"
    ],
    "cleaned_text": "queer couples adopt child together supreme court gives key verdict hearing samesex marriage deleted ",
    "cleaned_title": "queer couples adopt child together supreme court gives key verdict hearing samesex marriage",
    "cleaned_selftext": "deleted",
    "cleaned_comments": "really voted bhai khud ne bhi khol ke nahi padha kya isi article ki pehli line hai chief justice india supported recognition adoption rights scrapping central adoption resource authority caras regulation three judges dissented proposal effectively nullifying possibility adoption queer couples khud ne hi rworldnews pe post kiya hai waha sahi likha hai yaha posted article ka title change karke tune post kiya hai iska matlab ya tu jan ke misinformation failata hai apne entertainment ya agenda ke liye ye sab karna band kar de thoda padhai likhai pe dhyan de got bless phew",
    "light_cleaned_title": "'Queer Couples Can Adopt Child Together': Supreme Court Gives Key Verdict During Hearing On Same-Sex Marriage",
    "light_cleaned_selftext": "[deleted]",
    "light_cleaned_comments": "Not really. This was voted 3-2 against it Bhai khud ne bhi khol ke nahi padha kya, isi article ki pehli line hai. \"While the Chief Justice of India supported the recognition of adoption rights and scrapping of Central Adoption Resource Authority (CARA)'s regulation 5(3), three judges dissented from the proposal effectively nullifying the possibility of adoption for Queer couples.\" Khud ne hi r/worldnews pe post kiya hai waha sahi likha hai. Yaha posted article ka title change karke tune post kiya hai. Iska matlab ya to tu jan ke misinformation failata hai apne 'entertainment' ya 'agenda' ke liye. Ye sab karna band kar de, thoda padhai likhai pe dhyan de. Got to bless those 3.. phew"
}