{
    "id": "1e2wkfz",
    "title": "Constant harrasment from life insurance companies.",
    "url": "https://www.reddit.com/gallery/1e2wkfz",
    "selftext": "I was looking for a life insurance and was checking out Tata AIA, HDFC Life and Canara HSBC. to checkout the price, you have to authorize them to override the DND. And this is where problem starts. They keep calling you non-stop. Canara and Tata contacted less frequently, but HDFC wa sthe worst. Was in a meeting with phone in silent and HDFC kept calling again and again. Blocked several numbers and still no respite.\n\nThe funniest part is the companies say that DND registration will take 30 days to take effect, while DND override happens within seconds.\n\nAnyone has a solution for this? I am unable to even out my toddler to sleep because of this nuisance.",
    "flair": "Rant / Vent",
    "score": 54,
    "num_comments": 25,
    "created_utc": 1720942720.0,
    "convurl": "https://i.redd.it/bi470ty8ufcd1.png",
    "comments": [
        "It's happening everywhere. I was just randomly searching for a zero balance account in banks and from next day I started getting calls from banks to get a credit card and open a saving s account with it. 2 weeks non stop.",
        "No solution for this. This is what their business model has come to. I checked these websites for policy premiums now I'm getting spam calls everyday for the past month. HDFC is the worst. Star health equally bad.",
        "These guys are pathetic.",
        "HDFC ergo is the worst when it comes to spamming\n\nEdit: they will spam you at the time of renewal too and if you need help with any change request or claim request or anything process related you will never get a call back.",
        "For anyone looking for insurance, I would suggest using ditto. They do what policy bazaar does but better and won't bother you continuously with calls. I have 4 friends recommend the platform on different occasions and I can endorse it as well from my experience of buying term insurance on their platform. \n\nBonus you don't have to give your number to multiple agencies.",
        "True. HDFC looks so desperate.",
        "If someone can give me quotes without calling me, I would definitely go with them.",
        "Step 1...uninstall Truecaller. \nStep 2..start reporting calls on the dnd trai app.\n\nCalls go down over time, I promise.",
        "You gave up your number on the Internet ?",
        "When I use their premium calculator i just enter some random number. I know these guys will call even after saying they won't spam us",
        " This happens with everything. I wanted to use livespace interior estimate calculator. They kept harassing me for 20days straight with 10-12 calls each day. I had to call their grievances cell to make this stop.",
        "Nobroker is worse.",
        "Right, what else was he expecting?",
        "Yes I can vouch. \nI got so fed up that I called and told them to delete my account.",
        "What works for me is just straight up nonsense vulgar language. They flag your number then and nobody calls.",
        "No. I did it via my Google search. I didn't even enter my number. I don't know how.",
        "Switch to Ditto Insurance. They offer very good and spam free consultations.",
        "Simple Solution:   \nOpen Truecaller -> Manage Blocking -> Enable 'Block top spammers' and other similar options  \n  \nAlso, within Manage Blocking -> Click (+) -> Block a number series : Then add the series that these spam numbers use.",
        "Did you by any chance authorize something using your google account on google chrome",
        "Fatest ways to get cooked\n\n1. Get inside a big boiling vessel\n2. Post your phone number in a website",
        "Bankers are biggest scum bags and have a sorry assed existence when it comes to respecting privacy and general decency. \nIt’s not the fault of the humans working for them. Cut throat competetion, terrible pay package and one of the worst work culture leads people to only work in survival mode all the time . Heading the Japan way",
        "Tell them you have 1 week remaining to live, cry a little on the call and they will never call you back",
        "Agree 100%. They are also more helpful with your queries. This is because their agents are not paid commission based on their sales, so there's no motivation to somehow make the sale.",
        "Next time you want to get a quote, give a number from a service like quackr.io.",
        "+1 to Ditto. They helped me pick an insurance all through Whatsapp. And walked me through entire process. No separate commission or anything. And they give multiple options and never tried to push any insurance if I don't like it.",
        "Better yet goto the truecaller site and register your number to  Suresh Kadu, DSP, Mumabi IT fraud cell or something  similar and DND your number then. Been pretty effective for calls at least for 7+ years for me. And for messages use SMS organizer app that screens most of the spammy messages then you are all set for most part.",
        "I want hdfc ergo health insurance but the website shows you have to check agree to let them call you back to signup and agree to getting called for offers. Their global health insurance is the only good builtin one with international health insurance so it sucks because with others you have to get a  separate travel health insurance. Does anyone know how to get their insurance without sacrificing my number?",
        "Would work for most, but TATA sends an OTP to verify. Lol!",
        "In quackr.io, you can get the OTP too."
    ],
    "cleaned_text": "constant harrasment life insurance companies looking life insurance checking tata aia hdfc life canara hsbc checkout price authorize override dnd problem starts keep calling nonstop canara tata contacted less frequently hdfc wa sthe worst meeting phone silent hdfc kept calling blocked several numbers still respite funniest part companies say dnd registration take days take effect dnd override happens within seconds anyone solution unable even toddler sleep nuisance ",
    "cleaned_title": "constant harrasment life insurance companies",
    "cleaned_selftext": "looking life insurance checking tata aia hdfc life canara hsbc checkout price authorize override dnd problem starts keep calling nonstop canara tata contacted less frequently hdfc wa sthe worst meeting phone silent hdfc kept calling blocked several numbers still respite funniest part companies say dnd registration take days take effect dnd override happens within seconds anyone solution unable even toddler sleep nuisance",
    "cleaned_comments": "happening everywhere randomly searching zero balance account banks next day started getting calls banks get credit card open saving account weeks non stop solution business model come checked websites policy premiums im getting spam calls everyday past month hdfc worst star health equally bad guys pathetic hdfc ergo worst comes spamming edit spam time renewal need help change request claim request anything process related never get call back anyone looking insurance would suggest using ditto policy bazaar better wont bother continuously calls friends recommend platform different occasions endorse well experience buying term insurance platform bonus dont give number multiple agencies true hdfc looks desperate someone give quotes without calling would definitely go step uninstall truecaller step start reporting calls dnd trai app calls go time promise gave number internet use premium calculator enter random number know guys call even saying wont spam us happens everything wanted use livespace interior estimate calculator kept harassing days straight calls day call grievances cell make stop nobroker worse right else expecting yes vouch got fed called told delete account works straight nonsense vulgar language flag number nobody calls via google search didnt even enter number dont know switch ditto insurance offer good spam free consultations simple solution open truecaller manage blocking enable block top spammers similar options also within manage blocking click block number series add series spam numbers use chance authorize something using google account google chrome fatest ways get cooked get inside big boiling vessel post phone number website bankers biggest scum bags sorry assed existence comes respecting privacy general decency fault humans working cut throat competetion terrible pay package one worst work culture leads people work survival mode time heading japan way tell week remaining live cry little call never call back agree also helpful queries agents paid commission based sales theres motivation somehow make sale next time want get quote give number service like quackrio ditto helped pick insurance whatsapp walked entire process separate commission anything give multiple options never tried push insurance dont like better yet goto truecaller site register number suresh kadu dsp mumabi fraud cell something similar dnd number pretty effective calls least years messages use sms organizer app screens spammy messages set part want hdfc ergo health insurance website shows check agree let call back signup agree getting called offers global health insurance good builtin one international health insurance sucks others get separate travel health insurance anyone know get insurance without sacrificing number would work tata sends otp verify lol quackrio get otp",
    "light_cleaned_title": "Constant harrasment from life insurance companies.",
    "light_cleaned_selftext": "I was looking for a life insurance and was checking out Tata AIA, HDFC Life and Canara HSBC. to checkout the price, you have to authorize them to override the DND. And this is where problem starts. They keep calling you non-stop. Canara and Tata contacted less frequently, but HDFC wa sthe worst. Was in a meeting with phone in silent and HDFC kept calling again and again. Blocked several numbers and still no respite. The funniest part is the companies say that DND registration will take 30 days to take effect, while DND override happens within seconds. Anyone has a solution for this? I am unable to even out my toddler to sleep because of this nuisance.",
    "light_cleaned_comments": "It's happening everywhere. I was just randomly searching for a zero balance account in banks and from next day I started getting calls from banks to get a credit card and open a saving s account with it. 2 weeks non stop. No solution for this. This is what their business model has come to. I checked these websites for policy premiums now I'm getting spam calls everyday for the past month. HDFC is the worst. Star health equally bad. These guys are pathetic. HDFC ergo is the worst when it comes to spamming Edit: they will spam you at the time of renewal too and if you need help with any change request or claim request or anything process related you will never get a call back. For anyone looking for insurance, I would suggest using ditto. They do what policy bazaar does but better and won't bother you continuously with calls. I have 4 friends recommend the platform on different occasions and I can endorse it as well from my experience of buying term insurance on their platform. Bonus you don't have to give your number to multiple agencies. True. HDFC looks so desperate. If someone can give me quotes without calling me, I would definitely go with them. Step 1...uninstall Truecaller. Step 2..start reporting calls on the dnd trai app. Calls go down over time, I promise. You gave up your number on the Internet ? When I use their premium calculator i just enter some random number. I know these guys will call even after saying they won't spam us This happens with everything. I wanted to use livespace interior estimate calculator. They kept harassing me for 20days straight with 10-12 calls each day. I had to call their grievances cell to make this stop. Nobroker is worse. Right, what else was he expecting? Yes I can vouch. I got so fed up that I called and told them to delete my account. What works for me is just straight up nonsense vulgar language. They flag your number then and nobody calls. No. I did it via my Google search. I didn't even enter my number. I don't know how. Switch to Ditto Insurance. They offer very good and spam free consultations. Simple Solution: Open Truecaller -> Manage Blocking -> Enable 'Block top spammers' and other similar options Also, within Manage Blocking -> Click (+) -> Block a number series : Then add the series that these spam numbers use. Did you by any chance authorize something using your google account on google chrome Fatest ways to get cooked 1. Get inside a big boiling vessel 2. Post your phone number in a website Bankers are biggest scum bags and have a sorry assed existence when it comes to respecting privacy and general decency. It’s not the fault of the humans working for them. Cut throat competetion, terrible pay package and one of the worst work culture leads people to only work in survival mode all the time . Heading the Japan way Tell them you have 1 week remaining to live, cry a little on the call and they will never call you back Agree 100%. They are also more helpful with your queries. This is because their agents are not paid commission based on their sales, so there's no motivation to somehow make the sale. Next time you want to get a quote, give a number from a service like quackr.io. +1 to Ditto. They helped me pick an insurance all through Whatsapp. And walked me through entire process. No separate commission or anything. And they give multiple options and never tried to push any insurance if I don't like it. Better yet goto the truecaller site and register your number to Suresh Kadu, DSP, Mumabi IT fraud cell or something similar and DND your number then. Been pretty effective for calls at least for 7+ years for me. And for messages use SMS organizer app that screens most of the spammy messages then you are all set for most part. I want hdfc ergo health insurance but the website shows you have to check agree to let them call you back to signup and agree to getting called for offers. Their global health insurance is the only good builtin one with international health insurance so it sucks because with others you have to get a separate travel health insurance. Does anyone know how to get their insurance without sacrificing my number? Would work for most, but TATA sends an OTP to verify. Lol! In quackr.io, you can get the OTP too."
}