{
    "id": "14vs6wf",
    "title": "I am developing an app for organising our grocery shopping. And I need your opinions.",
    "url": "https://www.reddit.com/r/india/comments/14vs6wf/i_am_developing_an_app_for_organising_our_grocery/",
    "selftext": "Namastey!\n\nAfter I forgot to bring catfood for my cat one more time; I felt like something needs to be done.\nIt has come to my notice, that this has happened to few of my friends and this can be an issue with most/some of us. We need to be more organised about this. The first thing that came to my mind was to develop an app for it. I know it's a really simple issue and I am looking to solve it. Right now, I am not looking for profits from it, just want enough money to run it smoothly.\nNow, am I a business person - No.\nAm I a computer engineer/ coder - No.\nBut I have found a way and the app is under development. What I need from you guys, is to fill a short survey so that I know if this is really the need of market or am I dumb. I have already conveyed my friends about it, and they've registered their responses, but I need a larger sample space to be sure.\n\nIt is a very short survey and will take about three minutes. I'd really appreciate it.\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSfY55iil9-OmKSC5R-TZwmEC1e0BlEnR7wKux8euZLmEvmcEA/viewform?vc=0&c=0&w=1&flr=0\n\nHello,\n\nYou may, or may not know me. But we're working on a solution for a problem we think is there. I know you'd want not to, but it would help us enormously if you try filling it.\nIt's very short. And we promise we won't disturb you again.\n***\nनमस्ते,\n\nहो सकता है आप मुझे जानते हों, या न जानते हों। लेकिन हम एक छोटीसी समस्या के समाधान पर काम कर रहे हैं जो।\nमैं जानता आपको तकलीफ दे रहा हूं, लेकिन यदि आप इसे भरने का प्रयास करेंगे तो इससे हमें बहुत मदद मिलेगी।\nयह फार्म बहुत छोटा है. और हम वादा करते हैं कि हम आपको दोबारा परेशान नहीं करेंगे।",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1688990807.0,
    "convurl": "https://external-preview.redd.it/45fi8dx-uASZtopZM8Jgwv0s6FSelzZBTfV8FhKUyXs.jpg?auto=webp&v=enabled&s=d5fac05c0642d7ccaa29bdd7e4d31727325c6e8a",
    "comments": [],
    "cleaned_text": "developing app organising grocery shopping need opinions namastey forgot bring catfood cat one time felt like something needs done come notice happened friends issue mostsome us need organised first thing came mind develop app know really simple issue looking solve right looking profits want enough money run smoothly business person computer engineer coder found way app development need guys fill short survey know really need market dumb already conveyed friends theyve registered responses need larger sample space sure short survey take three minutes id really appreciate hello may may know working solution problem think know youd want would help us enormously try filling short promise wont disturb ",
    "cleaned_title": "developing app organising grocery shopping need opinions",
    "cleaned_selftext": "namastey forgot bring catfood cat one time felt like something needs done come notice happened friends issue mostsome us need organised first thing came mind develop app know really simple issue looking solve right looking profits want enough money run smoothly business person computer engineer coder found way app development need guys fill short survey know really need market dumb already conveyed friends theyve registered responses need larger sample space sure short survey take three minutes id really appreciate hello may may know working solution problem think know youd want would help us enormously try filling short promise wont disturb",
    "cleaned_comments": "",
    "light_cleaned_title": "I am developing an app for organising our grocery shopping. And I need your opinions.",
    "light_cleaned_selftext": "Namastey! After I forgot to bring catfood for my cat one more time; I felt like something needs to be done. It has come to my notice, that this has happened to few of my friends and this can be an issue with most/some of us. We need to be more organised about this. The first thing that came to my mind was to develop an app for it. I know it's a really simple issue and I am looking to solve it. Right now, I am not looking for profits from it, just want enough money to run it smoothly. Now, am I a business person - No. Am I a computer engineer/ coder - No. But I have found a way and the app is under development. What I need from you guys, is to fill a short survey so that I know if this is really the need of market or am I dumb. I have already conveyed my friends about it, and they've registered their responses, but I need a larger sample space to be sure. It is a very short survey and will take about three minutes. I'd really appreciate it. Hello, You may, or may not know me. But we're working on a solution for a problem we think is there. I know you'd want not to, but it would help us enormously if you try filling it. It's very short. And we promise we won't disturb you again. *** नमस्ते, हो सकता है आप मुझे जानते हों, या न जानते हों। लेकिन हम एक छोटीसी समस्या के समाधान पर काम कर रहे हैं जो। मैं जानता आपको तकलीफ दे रहा हूं, लेकिन यदि आप इसे भरने का प्रयास करेंगे तो इससे हमें बहुत मदद मिलेगी। यह फार्म बहुत छोटा है. और हम वादा करते हैं कि हम आपको दोबारा परेशान नहीं करेंगे।",
    "light_cleaned_comments": ""
}