{
    "id": "1e8u71d",
    "title": "Video Of House Bombed In Manipur Viral. Owner, A Displaced Man, Says...",
    "url": "https://www.ndtv.com/india-news/video-of-house-bombed-in-manipur-kuki-dominant-churachandpur-viral-what-owner-naorem-ibomcha-meitei-a-displaced-man-said-6156479",
    "selftext": "Is Manipur not part of India? How could this happen in broad daylight despite huge military deployment?",
    "flair": "Rant / Vent",
    "score": 86,
    "num_comments": 25,
    "created_utc": 1721589636.0,
    "convurl": "https://external-preview.redd.it/utNsvm4wR6mFEM3ZFiDG-jb2vDaF8D5a-VQGz4Bl3mI.jpg?auto=webp&s=b68ad7f75bebb132b74f5ca71af0a9312768147f",
    "comments": [
        "You really think India can fight the huge cia deployment in Myanmar ? Think again.\n\n\nThats why everyone is ignoring it\n\n\nNot to say i remember  bangaladesh pm sheikh  hasinas comment on carving a new nation from  north west myanmmar and chattogram district\n\n\nLets see what happens  in the long run",
        "Another India-Pakistan like conflict grooming in the eastern region. India must act now before it’s too late.",
        "I dont see that happening\n\n\nCurrent myanmmar head is selling assets to americN companies one after the other like its free rice.\n\n\nFortunately some of our state run oil giants have got some in myanmmar waters( you know india mapped its andaman waters completely in a hurry- back then)\n\n\nWhy myanmmar is doing that?? Well a puppet dictator  .\n\n\nAnd why the chottogram manipur region is so lucrative- maybe theres lithium or gold , i dont know why they will destabilize that place eitherwise. Cant think of any other mineral that is lucrative . Maybe it could be uranium because the  france monetary empire of east africa- many states including niger  have refused to sell france uranium in recent times and even got russia and  got wagner and some other mercenary  group there\n\n\nEitherway  modi or rahul gandhi whoever the pm is ( say today ) , none would talk about it because you know what cia did to a lot of our predessor pms. (Including some we believe  to be a reault of their own decisons- but it was actually cia)\n\n\nSo nope.\n\n\nAll we can hope is there is less human damge and death.\n\n\nWhere there is cia, everyone runs away.\n\n\nWe got no power brother. \n\nJust pray to god human lives are safe even if they become displaced.  Thats the best we can do.",
        " no rahul gandhi gave a long ass speech over manipur. modi doesn’t give a shit",
        "why there's been murmur of CIA these days? hasina mentioned about powerful entity in her speech. will you care to explain? or if possible, can you share the link where it has been said so?",
        "https://www.indiatoday.in/world/story/sheikh-hasin-christian-state-foreign-airbase-bangladesh-awami-league-dhaka-india-2544410-2024-05-27\n\n\nSearch keywords for other news sources",
        "I know. i have seen that\n\n\nWhat i mean is whoever is pm of India will not meddle with it.\n\n\n>no rahul gandhi gave a long ass speech over manipur. modi doesn’t give a shit\n\nChange the people  vice versa and they will  do the same thing . The pm wont say anything and the opposition leader will say a lot of words.",
        ">why there's been murmur of CIA these days?\n\nAccording to some people cia is trying to create a new ethno nationalist state (consisting of mainly christian tribes) along the indo Myanmar border, which tbf I don't believe 100%, but then knowing America's history i won't dismiss it either,\n\n>hasina mentioned about powerful entity in her speech.\n\nThat entity is the US ofc, it's an open secret us wants hasina gone",
        "https://www.indiatoday.in/world/story/sheikh-hasin-christian-state-foreign-airbase-bangladesh-awami-league-dhaka-india-2544410-2024-05-27\n\n\nMilitary base isnt the only thing i smell.\n\n\nI smell uranium/ gold/ lithium too.\n\nAlso\n\n\nMyanmar  puppet head had been selling assets( minerals and oils) like crazy in the last few years",
        "North Indians who control Indian politics don’t care about north east.",
        "Here is a letter of the victim.\n\nhttps://preview.redd.it/2bl247xfa1ed1.jpeg?width=959&format=pjpg&auto=webp&s=104ee35c4775b8e06754edc11317023433ae25b6",
        "This is a house in Kumujamba in Churachandpur and Kumujamba was a hotspot for drugs, local made liquor and illegal activities. It was illegally occupied by the Meitei community who claimed they cant own land in the hills and which is the reason why the violence started but now they suddenly do own land in the hills. r/manipur has been one sided just as the local media is and was from the start of the conflict and which in turn influenced the national media. The meiteis will always try to claim the hindu angle and will also say they are fighting against illegal immigrants and drugs and support the chief minister of Manipur but in reality they the conflict is between all the non nagas vs the meiteis because they butchered many non nagas in 3rd May in imphal when the violence erupted in the border of a meitei village and a kuki village. You wont see this in the national media because the Meiteis are actively trying to bury the truth with misinformation. I have no hate against the meitei community but they are easily swayed by false propaganda. Honestly there are drug smugglers and illegal immigrants in every community and illegal poppy farmers too but the Kukis get the brunt of the allegations even though the meitei community and the naga community are doing it too. The state govt who cant keep a check on the illegal immigration and drug smuggling is to blame and not a particular community.",
        "I am not very well versed in the conflict but do know an average amount and r/manipur does seem very one sided. Its filled with posts throwing around the word 'Kuki terrorists' here and there. In my experience, people who are very eager to shout someone out as terrorists often have something to hide themselves.",
        "Definitely and I understand why they would be  that way since they cant speak up or they will get phone call from a particular civil organisation asking to meet up because they commented this and that against the narrative.",
        "Kumujamba is a meitei village in Chrachandpur district of Manipur. It is an area surrounded by the Kukis tribes. Within the last two decades the demography of Churachandpur district have changed significantly with the arrival of kukis illegal immigrants from Myanmar and the rampant destruction of forest for poppy plantation. The kukis do not pay any land tax while the meitei villages comes under the state land revenue  and are patta holders paying land taxes. These villages are the first to be targeted as these are the prime spot, you can see the other guy telling it's a hotspot for liquor and drugs, well how can you justify a controlled bomb demolition, give them the lie that it was a bad place so we destroying it. No meiteis village are standing in Kukis with no sign about civilization while the houses of Kukis are still standing tall in Imphal under the protection of security.",
        "Youre saying Kumujamba was there before Lamka? funny guy",
        "Lol kuki Propaganda spread in Reddit also 😂🤣🤣",
        "https://preview.redd.it/u54srjdc53ed1.jpeg?width=3024&format=pjpg&auto=webp&s=0c5ddb47942972539446775193772b4bbb509da6\n\nI honestly don’t understand Meiteis trying to play a victim card here. Both communities have suffered.\n\nIn this photo, depicts the Kuki houses/buildings in Langol, about 6km from Manipur CM’s official residence. Nothing remains except the pillars.\n\nI hope the Meiteis also don’t ignore over a 1000 such Kuki buildings in Imphal. Anybody with Google Earth can see the historical images and see the damages in Imphal in places like Khongsai Veng, Paite Veng, Langol, and all the other Kuki localities. In fact, Kuki buildings and locality which are few 100 meters away from CM’s official bungalow burnt, looted and damaged. But no outrage?",
        "Speak anything against the Meitei in that sub and they will delete your post/comment and ban you. \n\nAnything that is true too.",
        "You cannot compare vandalism by mobs with demolition of buildings using bombs. My post was about how such destruction using bomb in daylight just happened when central forces are deployed.",
        "Well, you did miss the initial days of the violence when internet was banned. Fact is when internet was banned in entire state propaganda was running from Churachandpur through internet connection from a bank. Speaking of r/manipur you should have seen the amount of propaganda and disinformation being posted.",
        "On the contrary a mod who was deleting and banning users posting the facts when internet was banned all in favour of kuki. Was finally kicked out. No more disinformation or propaganda.",
        "Victim card? Who has been playing victim card in the name of minority tribe, minority religion on international platform? A minority tribe who has ethnically cleansed the meitei “majority” from Churachandpur, the epicentre of the violence on 3rd May 2023.",
        "Facts against Meitei or anti-Meitei topic is still actively deleted and authors banned in that sub.",
        "It’s like you’re blind to what Meiteis do and only targeting the Kukis.\n\nYes, what Kukis did.. the video is posted and there to see on this post.\n\nBut you’re ignoring the fact that Arambai Tenggol attacked 1st MR with bombs, assault rifles, automatic weapons and then came with stolen Casper trucks at Sanjenthong to challenge the central forces. \n\nI’m not trying to answer you with a whataboutery but there’s a limit to hypocrisy too.\n\nBoth Kukis and Meiteis are no different.",
        "I’m not denying that but you feel it’s right to play the victim card when Meiteis have equally done the damages? Are you going to blame the mob?\n\nGo to Langol and all the other Kuki colonies in Imphal. See how the demolitions are happening. Go tomorrow if you don’t believe me! Sure, they are not using bombs like the Kukis did in this particular video but they are using manual labourers and JCB and other tools available to demolish the Kukis buildings.",
        "What about all the Kuki houses in Imphal which is being razed to the ground as we speak TODAY by the Meiteis. Why blind side them?\n\nGo to Langol and see how the houses are being manually broken down or sometimes using JCB. Go now and see for yourself. It’s happening everyday.\n\nThis photo attached is just one of the areas of the Kuki locality in Imphal. The house belongs to a Kuki family near Shija Hospital. Officially used by Shija to park cars of the doctors and paying “rent” to Arambai Tenggol and UNLF.\n\nhttps://preview.redd.it/1eyfat1i57ed1.jpeg?width=1170&format=pjpg&auto=webp&s=fe6d35b9f6b76d7de3a18343db787fea636dc3b0",
        "You mean the rape of Meitei women propagated by local media channels like ImpactTV when the internet was banned? Saying raped Meitei women were brought to Shija morgue!!! Shija had to clarify after a few days that they don’t even have a morgue and no raped women were brought in.\n\nYou mean the rape of the MBBS student who had to be clarified that she’s safe and home. Her father came on live television to stop spreading the fake news?\n\nYou mean the raped Meitei women brought to RIMS from Churachandpur? Which turned out to be fake as well.\n\nDid you care to believe that Meiteis raped those Kuki women (became an international news) because of the fake news propagated by Meitei local media channels? Deep down, I know those Meitei men won’t have rape the Kuki women if the fake news were not propagated by local meitei channels and media houses specially when there’s no internet to fact-check.",
        "Yes meitei mob did vandalise houses. No structures have been razed to the ground unlike what had happened in Churachandpur and I am not justifying either. So, please stop the whataboutery. The question is how the hell bombs were used to demolish the buildings in broad daylight and who is supplying the bombs? That is pure act of terrorism.",
        "Dude.. go to Langol, Paite Veng, Khongsai Veng or any Kuki settlement ONCE. Go tomorrow if you aren’t too busy.\n\nSee if the houses are being actively bull dozed by JCB and manual labourers. It’s happening today, yesterday and will be happening tomorrow too. Tomorrow as in July 27, 2024.\n\nAnd then let’s talk about mob vandalism in May 2023.\n\nYes, using dynamites in broad daylight by Kukis is crazy. This, I admit but you have to admit that Manipur has no more law. It’s taken over by militia both in Kukis areas and in Meitei areas.",
        "Whataboutery? My home was burned and the church next to us in front of our eyes THRICE. Three times they came and kept repeatedly burning. And my home was demolished shortly after they burnt it. And you're talking as if bombing cases are rare in manipur lol. Obtain some more knowledge abt the state first."
    ],
    "cleaned_text": "video house bombed manipur viral owner displaced man says manipur part india could happen broad daylight despite huge military deployment ",
    "cleaned_title": "video house bombed manipur viral owner displaced man says",
    "cleaned_selftext": "manipur part india could happen broad daylight despite huge military deployment",
    "cleaned_comments": "really think india fight huge cia deployment myanmar think thats everyone ignoring say remember bangaladesh pm sheikh hasinas comment carving new nation north west myanmmar chattogram district lets see happens long run another indiapakistan like conflict grooming eastern region india must act late dont see happening current myanmmar head selling assets americn companies one like free rice fortunately state run oil giants got myanmmar waters know india mapped andaman waters completely hurry back myanmmar well puppet dictator chottogram manipur region lucrative maybe theres lithium gold dont know destabilize place eitherwise cant think mineral lucrative maybe could uranium france monetary empire east africa many states including niger refused sell france uranium recent times even got russia got wagner mercenary group eitherway modi rahul gandhi whoever pm say today none would talk know cia lot predessor pms including believe reault decisons actually cia nope hope less human damge death cia everyone runs away got power brother pray god human lives safe even become displaced thats best rahul gandhi gave long ass speech manipur modi doesnt give shit theres murmur cia days hasina mentioned powerful entity speech care explain possible share link said search keywords news sources know seen mean whoever pm india meddle rahul gandhi gave long ass speech manipur modi doesnt give shit change people vice versa thing pm wont say anything opposition leader say lot words theres murmur cia days according people cia trying create new ethno nationalist state consisting mainly christian tribes along indo myanmar border tbf dont believe knowing americas history wont dismiss either hasina mentioned powerful entity speech entity us ofc open secret us wants hasina gone military base isnt thing smell smell uranium gold lithium also myanmar puppet head selling assets minerals oils like crazy last years north indians control indian politics dont care north east letter victim house kumujamba churachandpur kumujamba hotspot drugs local made liquor illegal activities illegally occupied meitei community claimed cant land hills reason violence started suddenly land hills rmanipur one sided local media start conflict turn influenced national media meiteis always try claim hindu angle also say fighting illegal immigrants drugs support chief minister manipur reality conflict non nagas vs meiteis butchered many non nagas rd may imphal violence erupted border meitei village kuki village wont see national media meiteis actively trying bury truth misinformation hate meitei community easily swayed false propaganda honestly drug smugglers illegal immigrants every community illegal poppy farmers kukis get brunt allegations even though meitei community naga community state govt cant keep check illegal immigration drug smuggling blame particular community well versed conflict know average amount rmanipur seem one sided filled posts throwing around word kuki terrorists experience people eager shout someone terrorists often something hide definitely understand would way since cant speak get phone call particular civil organisation asking meet commented narrative kumujamba meitei village chrachandpur district manipur area surrounded kukis tribes within last two decades demography churachandpur district changed significantly arrival kukis illegal immigrants myanmar rampant destruction forest poppy plantation kukis pay land tax meitei villages comes state land revenue patta holders paying land taxes villages first targeted prime spot see guy telling hotspot liquor drugs well justify controlled bomb demolition give lie bad place destroying meiteis village standing kukis sign civilization houses kukis still standing tall imphal protection security youre saying kumujamba lamka funny guy lol kuki propaganda spread reddit also honestly dont understand meiteis trying play victim card communities suffered photo depicts kuki housesbuildings langol km manipur cms official residence nothing remains except pillars hope meiteis also dont ignore kuki buildings imphal anybody google earth see historical images see damages imphal places like khongsai veng paite veng langol kuki localities fact kuki buildings locality meters away cms official bungalow burnt looted damaged outrage speak anything meitei sub delete postcomment ban anything true compare vandalism mobs demolition buildings using bombs post destruction using bomb daylight happened central forces deployed well miss initial days violence internet banned fact internet banned entire state propaganda running churachandpur internet connection bank speaking rmanipur seen amount propaganda disinformation posted contrary mod deleting banning users posting facts internet banned favour kuki finally kicked disinformation propaganda victim card playing victim card name minority tribe minority religion international platform minority tribe ethnically cleansed meitei majority churachandpur epicentre violence rd may facts meitei antimeitei topic still actively deleted authors banned sub like youre blind meiteis targeting kukis yes kukis video posted see post youre ignoring fact arambai tenggol attacked st mr bombs assault rifles automatic weapons came stolen casper trucks sanjenthong challenge central forces im trying answer whataboutery theres limit hypocrisy kukis meiteis different im denying feel right play victim card meiteis equally done damages going blame mob go langol kuki colonies imphal see demolitions happening go tomorrow dont believe sure using bombs like kukis particular video using manual labourers jcb tools available demolish kukis buildings kuki houses imphal razed ground speak today meiteis blind side go langol see houses manually broken sometimes using jcb go see happening everyday photo attached one areas kuki locality imphal house belongs kuki family near shija hospital officially used shija park cars doctors paying rent arambai tenggol unlf mean rape meitei women propagated local media channels like impacttv internet banned saying raped meitei women brought shija morgue shija clarify days dont even morgue raped women brought mean rape mbbs student clarified shes safe home father came live television stop spreading fake news mean raped meitei women brought rims churachandpur turned fake well care believe meiteis raped kuki women became international news fake news propagated meitei local media channels deep know meitei men wont rape kuki women fake news propagated local meitei channels media houses specially theres internet factcheck yes meitei mob vandalise houses structures razed ground unlike happened churachandpur justifying either please stop whataboutery question hell bombs used demolish buildings broad daylight supplying bombs pure act terrorism dude go langol paite veng khongsai veng kuki settlement go tomorrow arent busy see houses actively bull dozed jcb manual labourers happening today yesterday happening tomorrow tomorrow july lets talk mob vandalism may yes using dynamites broad daylight kukis crazy admit admit manipur law taken militia kukis areas meitei areas whataboutery home burned church next us front eyes thrice three times came kept repeatedly burning home demolished shortly burnt youre talking bombing cases rare manipur lol obtain knowledge abt state first",
    "light_cleaned_title": "Video Of House Bombed In Manipur Viral. Owner, A Displaced Man, Says...",
    "light_cleaned_selftext": "Is Manipur not part of India? How could this happen in broad daylight despite huge military deployment?",
    "light_cleaned_comments": "You really think India can fight the huge cia deployment in Myanmar ? Think again. Thats why everyone is ignoring it Not to say i remember bangaladesh pm sheikh hasinas comment on carving a new nation from north west myanmmar and chattogram district Lets see what happens in the long run Another India-Pakistan like conflict grooming in the eastern region. India must act now before it’s too late. I dont see that happening Current myanmmar head is selling assets to americN companies one after the other like its free rice. Fortunately some of our state run oil giants have got some in myanmmar waters( you know india mapped its andaman waters completely in a hurry- back then) Why myanmmar is doing that?? Well a puppet dictator . And why the chottogram manipur region is so lucrative- maybe theres lithium or gold , i dont know why they will destabilize that place eitherwise. Cant think of any other mineral that is lucrative . Maybe it could be uranium because the france monetary empire of east africa- many states including niger have refused to sell france uranium in recent times and even got russia and got wagner and some other mercenary group there Eitherway modi or rahul gandhi whoever the pm is ( say today ) , none would talk about it because you know what cia did to a lot of our predessor pms. (Including some we believe to be a reault of their own decisons- but it was actually cia) So nope. All we can hope is there is less human damge and death. Where there is cia, everyone runs away. We got no power brother. Just pray to god human lives are safe even if they become displaced. Thats the best we can do. no rahul gandhi gave a long ass speech over manipur. modi doesn’t give a shit why there's been murmur of CIA these days? hasina mentioned about powerful entity in her speech. will you care to explain? or if possible, can you share the link where it has been said so? Search keywords for other news sources I know. i have seen that What i mean is whoever is pm of India will not meddle with it. >no rahul gandhi gave a long ass speech over manipur. modi doesn’t give a shit Change the people vice versa and they will do the same thing . The pm wont say anything and the opposition leader will say a lot of words. >why there's been murmur of CIA these days? According to some people cia is trying to create a new ethno nationalist state (consisting of mainly christian tribes) along the indo Myanmar border, which tbf I don't believe 100%, but then knowing America's history i won't dismiss it either, >hasina mentioned about powerful entity in her speech. That entity is the US ofc, it's an open secret us wants hasina gone Military base isnt the only thing i smell. I smell uranium/ gold/ lithium too. Also Myanmar puppet head had been selling assets( minerals and oils) like crazy in the last few years North Indians who control Indian politics don’t care about north east. Here is a letter of the victim. This is a house in Kumujamba in Churachandpur and Kumujamba was a hotspot for drugs, local made liquor and illegal activities. It was illegally occupied by the Meitei community who claimed they cant own land in the hills and which is the reason why the violence started but now they suddenly do own land in the hills. r/manipur has been one sided just as the local media is and was from the start of the conflict and which in turn influenced the national media. The meiteis will always try to claim the hindu angle and will also say they are fighting against illegal immigrants and drugs and support the chief minister of Manipur but in reality they the conflict is between all the non nagas vs the meiteis because they butchered many non nagas in 3rd May in imphal when the violence erupted in the border of a meitei village and a kuki village. You wont see this in the national media because the Meiteis are actively trying to bury the truth with misinformation. I have no hate against the meitei community but they are easily swayed by false propaganda. Honestly there are drug smugglers and illegal immigrants in every community and illegal poppy farmers too but the Kukis get the brunt of the allegations even though the meitei community and the naga community are doing it too. The state govt who cant keep a check on the illegal immigration and drug smuggling is to blame and not a particular community. I am not very well versed in the conflict but do know an average amount and r/manipur does seem very one sided. Its filled with posts throwing around the word 'Kuki terrorists' here and there. In my experience, people who are very eager to shout someone out as terrorists often have something to hide themselves. Definitely and I understand why they would be that way since they cant speak up or they will get phone call from a particular civil organisation asking to meet up because they commented this and that against the narrative. Kumujamba is a meitei village in Chrachandpur district of Manipur. It is an area surrounded by the Kukis tribes. Within the last two decades the demography of Churachandpur district have changed significantly with the arrival of kukis illegal immigrants from Myanmar and the rampant destruction of forest for poppy plantation. The kukis do not pay any land tax while the meitei villages comes under the state land revenue and are patta holders paying land taxes. These villages are the first to be targeted as these are the prime spot, you can see the other guy telling it's a hotspot for liquor and drugs, well how can you justify a controlled bomb demolition, give them the lie that it was a bad place so we destroying it. No meiteis village are standing in Kukis with no sign about civilization while the houses of Kukis are still standing tall in Imphal under the protection of security. Youre saying Kumujamba was there before Lamka? funny guy Lol kuki Propaganda spread in Reddit also 😂🤣🤣 I honestly don’t understand Meiteis trying to play a victim card here. Both communities have suffered. In this photo, depicts the Kuki houses/buildings in Langol, about 6km from Manipur CM’s official residence. Nothing remains except the pillars. I hope the Meiteis also don’t ignore over a 1000 such Kuki buildings in Imphal. Anybody with Google Earth can see the historical images and see the damages in Imphal in places like Khongsai Veng, Paite Veng, Langol, and all the other Kuki localities. In fact, Kuki buildings and locality which are few 100 meters away from CM’s official bungalow burnt, looted and damaged. But no outrage? Speak anything against the Meitei in that sub and they will delete your post/comment and ban you. Anything that is true too. You cannot compare vandalism by mobs with demolition of buildings using bombs. My post was about how such destruction using bomb in daylight just happened when central forces are deployed. Well, you did miss the initial days of the violence when internet was banned. Fact is when internet was banned in entire state propaganda was running from Churachandpur through internet connection from a bank. Speaking of r/manipur you should have seen the amount of propaganda and disinformation being posted. On the contrary a mod who was deleting and banning users posting the facts when internet was banned all in favour of kuki. Was finally kicked out. No more disinformation or propaganda. Victim card? Who has been playing victim card in the name of minority tribe, minority religion on international platform? A minority tribe who has ethnically cleansed the meitei “majority” from Churachandpur, the epicentre of the violence on 3rd May 2023. Facts against Meitei or anti-Meitei topic is still actively deleted and authors banned in that sub. It’s like you’re blind to what Meiteis do and only targeting the Kukis. Yes, what Kukis did.. the video is posted and there to see on this post. But you’re ignoring the fact that Arambai Tenggol attacked 1st MR with bombs, assault rifles, automatic weapons and then came with stolen Casper trucks at Sanjenthong to challenge the central forces. I’m not trying to answer you with a whataboutery but there’s a limit to hypocrisy too. Both Kukis and Meiteis are no different. I’m not denying that but you feel it’s right to play the victim card when Meiteis have equally done the damages? Are you going to blame the mob? Go to Langol and all the other Kuki colonies in Imphal. See how the demolitions are happening. Go tomorrow if you don’t believe me! Sure, they are not using bombs like the Kukis did in this particular video but they are using manual labourers and JCB and other tools available to demolish the Kukis buildings. What about all the Kuki houses in Imphal which is being razed to the ground as we speak TODAY by the Meiteis. Why blind side them? Go to Langol and see how the houses are being manually broken down or sometimes using JCB. Go now and see for yourself. It’s happening everyday. This photo attached is just one of the areas of the Kuki locality in Imphal. The house belongs to a Kuki family near Shija Hospital. Officially used by Shija to park cars of the doctors and paying “rent” to Arambai Tenggol and UNLF. You mean the rape of Meitei women propagated by local media channels like ImpactTV when the internet was banned? Saying raped Meitei women were brought to Shija morgue!!! Shija had to clarify after a few days that they don’t even have a morgue and no raped women were brought in. You mean the rape of the MBBS student who had to be clarified that she’s safe and home. Her father came on live television to stop spreading the fake news? You mean the raped Meitei women brought to RIMS from Churachandpur? Which turned out to be fake as well. Did you care to believe that Meiteis raped those Kuki women (became an international news) because of the fake news propagated by Meitei local media channels? Deep down, I know those Meitei men won’t have rape the Kuki women if the fake news were not propagated by local meitei channels and media houses specially when there’s no internet to fact-check. Yes meitei mob did vandalise houses. No structures have been razed to the ground unlike what had happened in Churachandpur and I am not justifying either. So, please stop the whataboutery. The question is how the hell bombs were used to demolish the buildings in broad daylight and who is supplying the bombs? That is pure act of terrorism. Dude.. go to Langol, Paite Veng, Khongsai Veng or any Kuki settlement ONCE. Go tomorrow if you aren’t too busy. See if the houses are being actively bull dozed by JCB and manual labourers. It’s happening today, yesterday and will be happening tomorrow too. Tomorrow as in July 27, 2024. And then let’s talk about mob vandalism in May 2023. Yes, using dynamites in broad daylight by Kukis is crazy. This, I admit but you have to admit that Manipur has no more law. It’s taken over by militia both in Kukis areas and in Meitei areas. Whataboutery? My home was burned and the church next to us in front of our eyes THRICE. Three times they came and kept repeatedly burning. And my home was demolished shortly after they burnt it. And you're talking as if bombing cases are rare in manipur lol. Obtain some more knowledge abt the state first."
}