{
    "id": "12fjdwj",
    "title": "Spitz and himalayan mountain cross dog for adoption in India and abroa",
    "url": "https://www.reddit.com/gallery/12fjdwj",
    "selftext": "Hi Folks, \n\nThis is barfi. She is 2 years old. Unfortunately, the family who adopted her two years back are separating and can't take care of her anymore. She is loving and caring towards her humans. We are looking for kind family to accept her as their own. She has gone through a lot in her short life. \n\nLittle about her - Her mother is Spitz and himalayan dog mix. Her father was indie. She can eat pedigree/home cooked food. She is delhi right now. But her adoption is open for anywhere across India or outside. \n\nShe had hundreds of takers as a puppy, I hope she would again find a loving home. After all, she has suffered enough without any fault of her own.\n\nLastly, even if you can't adopt her. Both barfi and I will thank you, if you could share this with friends/family looking for adoption.\n\nPlease whatsapp/call/dm at 7905601494 for any enquiries.",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 1,
    "created_utc": 1680954113.0,
    "convurl": "https://i.redd.it/00k53re2ensa1.jpg",
    "comments": [],
    "cleaned_text": "spitz himalayan mountain cross dog adoption india abroa hi folks barfi years old unfortunately family adopted two years back separating cant take care anymore loving caring towards humans looking kind family accept gone lot short life little mother spitz himalayan dog mix father indie eat pedigreehome cooked food delhi right adoption open anywhere across india outside hundreds takers puppy hope would find loving home suffered enough without fault lastly even cant adopt barfi thank could share friendsfamily looking adoption please whatsappcalldm enquiries ",
    "cleaned_title": "spitz himalayan mountain cross dog adoption india abroa",
    "cleaned_selftext": "hi folks barfi years old unfortunately family adopted two years back separating cant take care anymore loving caring towards humans looking kind family accept gone lot short life little mother spitz himalayan dog mix father indie eat pedigreehome cooked food delhi right adoption open anywhere across india outside hundreds takers puppy hope would find loving home suffered enough without fault lastly even cant adopt barfi thank could share friendsfamily looking adoption please whatsappcalldm enquiries",
    "cleaned_comments": "",
    "light_cleaned_title": "Spitz and himalayan mountain cross dog for adoption in India and abroa",
    "light_cleaned_selftext": "Hi Folks, This is barfi. She is 2 years old. Unfortunately, the family who adopted her two years back are separating and can't take care of her anymore. She is loving and caring towards her humans. We are looking for kind family to accept her as their own. She has gone through a lot in her short life. Little about her - Her mother is Spitz and himalayan dog mix. Her father was indie. She can eat pedigree/home cooked food. She is delhi right now. But her adoption is open for anywhere across India or outside. She had hundreds of takers as a puppy, I hope she would again find a loving home. After all, she has suffered enough without any fault of her own. Lastly, even if you can't adopt her. Both barfi and I will thank you, if you could share this with friends/family looking for adoption. Please whatsapp/call/dm at 7905601494 for any enquiries.",
    "light_cleaned_comments": ""
}