{
    "id": "14l05n4",
    "title": "If I get downvoted, let it be but I need to say it here.",
    "url": "https://www.reddit.com/r/india/comments/14l05n4/if_i_get_downvoted_let_it_be_but_i_need_to_say_it/",
    "selftext": "I think KCR is right when he took 600 vehicles to neighboring state. It hurts to see tax payers money go to dump but let’s be real, how else do you make a statement in Indian politics. Specially, when the politics in the country is deviated from real issues and media won’t stop chanting yogi-modi-mama-Amit.  \n  \nHe dealt with more tough situations in the past during Telangana agitation and only thing that might stop him is his age. \n\n\nhttps://www.ndtv.com/india-news/show-of-strength-worrisome-sharad-pawar-on-kcrs-600-car-convoy-in-maharashtra-4158526",
    "flair": "Politics",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1687928426.0,
    "convurl": "https://external-preview.redd.it/K4UMf9JGKROV26NBTR7jxbDz007ddWHHiSAiZNS7cII.jpg?auto=webp&v=enabled&s=445cd6fb2e560df45ff2e06cbaab31c1b6ac5566",
    "comments": [
        ">It hurts to see tax payers money go to dump but let’s be real, how else do you make a statement in Indian politics.\n\nIt's not a dick measuring contest, they can do their fucking jobs right to make a statement in Indian politics.",
        "But I don't think people voted for him and paying his government taxes so that he can make a STATEMENT using 600 cars.  \nAnyway he won't win even a single seat outside Telangana ever."
    ],
    "cleaned_text": "get downvoted let need say think kcr right took vehicles neighboring state hurts see tax payers money go dump lets real else make statement indian politics specially politics country deviated real issues media wont stop chanting yogimodimamaamit dealt tough situations past telangana agitation thing might stop age ",
    "cleaned_title": "get downvoted let need say",
    "cleaned_selftext": "think kcr right took vehicles neighboring state hurts see tax payers money go dump lets real else make statement indian politics specially politics country deviated real issues media wont stop chanting yogimodimamaamit dealt tough situations past telangana agitation thing might stop age",
    "cleaned_comments": "hurts see tax payers money go dump lets real else make statement indian politics dick measuring contest fucking jobs right make statement indian politics dont think people voted paying government taxes make statement using cars anyway wont win even single seat outside telangana ever",
    "light_cleaned_title": "If I get downvoted, let it be but I need to say it here.",
    "light_cleaned_selftext": "I think KCR is right when he took 600 vehicles to neighboring state. It hurts to see tax payers money go to dump but let’s be real, how else do you make a statement in Indian politics. Specially, when the politics in the country is deviated from real issues and media won’t stop chanting yogi-modi-mama-Amit. He dealt with more tough situations in the past during Telangana agitation and only thing that might stop him is his age.",
    "light_cleaned_comments": ">It hurts to see tax payers money go to dump but let’s be real, how else do you make a statement in Indian politics. It's not a dick measuring contest, they can do their fucking jobs right to make a statement in Indian politics. But I don't think people voted for him and paying his government taxes so that he can make a STATEMENT using 600 cars. Anyway he won't win even a single seat outside Telangana ever."
}