{
    "id": "16my1ps",
    "title": "Why do we hear about drought now when two months back it was floods",
    "url": "https://www.reddit.com/r/india/comments/16my1ps/why_do_we_hear_about_drought_now_when_two_months/",
    "selftext": "Just few months back we keep hearing there are floods everywhere and 2000 people lost their lives in 2023 across India as per https://m.economictimes.com/news/india/2038-dead-due-to-floods-landslides-lightning-since-april-1-mha-data/articleshow/102836319.cms\nNow we hear drought just two months down the line, summer is far away.\nWhy don't we manage irrigation and storage properly.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695146974.0,
    "convurl": "https://external-preview.redd.it/irPQJ1YRcWQHbwAx7yDYgftm7GlkhtWSgQ4ALxkDXq4.jpg?auto=webp&s=874bd57c3636d94a24a8e3b68bbf5a115ef8d538",
    "comments": [
        "Because india has terrible water management infrastructure. \n\nIn the west, every major city has a reservoir on the outskirts that stores enough water to supply the city for a year in case there is no rain. \n\nIndia gets more than enough rain to support its population. We have terrible infrastructure to store that water. It all goes away into the ocean as floods and in the summer we have no water. \n\nSome countries are blessed with natural reservoirs in the form of snow covered mountains. During winter the mountains get a ton of snow and they slowly melt throughout summer giving water. They act like reservoirs. We don’t have that. So we need to build artificial reservoirs."
    ],
    "cleaned_text": "hear drought two months back floods months back keep hearing floods everywhere people lost lives across india per hear drought two months line summer far away dont manage irrigation storage properly ",
    "cleaned_title": "hear drought two months back floods",
    "cleaned_selftext": "months back keep hearing floods everywhere people lost lives across india per hear drought two months line summer far away dont manage irrigation storage properly",
    "cleaned_comments": "india terrible water management infrastructure west every major city reservoir outskirts stores enough water supply city year case rain india gets enough rain support population terrible infrastructure store water goes away ocean floods summer water countries blessed natural reservoirs form snow covered mountains winter mountains get ton snow slowly melt throughout summer giving water act like reservoirs dont need build artificial reservoirs",
    "light_cleaned_title": "Why do we hear about drought now when two months back it was floods",
    "light_cleaned_selftext": "Just few months back we keep hearing there are floods everywhere and 2000 people lost their lives in 2023 across India as per Now we hear drought just two months down the line, summer is far away. Why don't we manage irrigation and storage properly.",
    "light_cleaned_comments": "Because india has terrible water management infrastructure. In the west, every major city has a reservoir on the outskirts that stores enough water to supply the city for a year in case there is no rain. India gets more than enough rain to support its population. We have terrible infrastructure to store that water. It all goes away into the ocean as floods and in the summer we have no water. Some countries are blessed with natural reservoirs in the form of snow covered mountains. During winter the mountains get a ton of snow and they slowly melt throughout summer giving water. They act like reservoirs. We don’t have that. So we need to build artificial reservoirs."
}