{
    "id": "14hkwwp",
    "title": "Modi and Godi media’s trip to the US | TV Newsance 216",
    "url": "https://youtu.be/V2txNQ4R28I",
    "selftext": "This week we learned that Rahul Shivshankar, or RSS, is tragically leaving Times Now for new pastures. We look back at some of his best, worst and most memorable moments. \n\nWith one towering news personality leaving Times Now, another has seamlessly taken his spot on Times Now Navbharat. Yes, it’s Sushant Sinha, who left his blackboard this week and followed Dear Leader to the United States. PM Modi is there to strengthen ties between the two countries but Sushant tried his best to spoil the fun by telling viewers the US isn’t a nice place to live and they should be grateful to live in a great country like India.\n\nIt wasn’t just Sushant. Republic dispatched Aishwarya Kapoor to the US too. But once we watched his report on ‘Modi thali’, we realised why he doesn’t leave the studio much.",
    "flair": "Politics",
    "score": 13,
    "num_comments": 0,
    "created_utc": 1687586281.0,
    "convurl": "https://external-preview.redd.it/e3bX7NreRrpv77RJVTn-3LE5l9AYBFFk23ycPO0Kk_A.jpg?auto=webp&v=enabled&s=16ca7fbc42bc000eff9833be055b1235455a8a20",
    "comments": [],
    "cleaned_text": "modi godi medias trip us tv newsance week learned rahul shivshankar rss tragically leaving times new pastures look back best worst memorable moments one towering news personality leaving times another seamlessly taken spot times navbharat yes sushant sinha left blackboard week followed dear leader united states pm modi strengthen ties two countries sushant tried best spoil fun telling viewers us isnt nice place live grateful live great country like india wasnt sushant republic dispatched aishwarya kapoor us watched report modi thali realised doesnt leave studio much ",
    "cleaned_title": "modi godi medias trip us tv newsance",
    "cleaned_selftext": "week learned rahul shivshankar rss tragically leaving times new pastures look back best worst memorable moments one towering news personality leaving times another seamlessly taken spot times navbharat yes sushant sinha left blackboard week followed dear leader united states pm modi strengthen ties two countries sushant tried best spoil fun telling viewers us isnt nice place live grateful live great country like india wasnt sushant republic dispatched aishwarya kapoor us watched report modi thali realised doesnt leave studio much",
    "cleaned_comments": "",
    "light_cleaned_title": "Modi and Godi media’s trip to the US | TV Newsance 216",
    "light_cleaned_selftext": "This week we learned that Rahul Shivshankar, or RSS, is tragically leaving Times Now for new pastures. We look back at some of his best, worst and most memorable moments. With one towering news personality leaving Times Now, another has seamlessly taken his spot on Times Now Navbharat. Yes, it’s Sushant Sinha, who left his blackboard this week and followed Dear Leader to the United States. PM Modi is there to strengthen ties between the two countries but Sushant tried his best to spoil the fun by telling viewers the US isn’t a nice place to live and they should be grateful to live in a great country like India. It wasn’t just Sushant. Republic dispatched Aishwarya Kapoor to the US too. But once we watched his report on ‘Modi thali’, we realised why he doesn’t leave the studio much.",
    "light_cleaned_comments": ""
}