{
    "id": "19aqjq4",
    "title": "Multi-dimensional poverty in India falls by 25 crore in 9 years: Niti Aayog",
    "url": "https://www.newindianexpress.com/amp/story/business/2024/Jan/16/multi-dimensional-poverty-in-india-falls-by-25-crore-in-9-years-niti-aayog",
    "selftext": "Since CEO of NITI Aayog is now very trust worthy for all the members of I.N.D.I.A alliance, they should now concede this report also about India being able to lift 25 crore Indians out of multi dimensional poverty in the last decade. \n\nThis is no small feat and I believe as a country we are on the right track. India of 2024 is on path to go on a growth juggernaut like what China did. If we have a strong government, we will have double digit growth. If we have a weak (kitchdi) government, then it might be single digit growth. 2024 elections for me is about the pace at which our country can grow.",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 3,
    "created_utc": 1705690346.0,
    "convurl": "https://external-preview.redd.it/EcmM8jAmAJKTG1E0uWyEcdd_2bE56WLfsvgL56vrBLw.jpg?auto=webp&s=2e32b4d4b9db05d821110313869e4cf92f9b229c",
    "comments": [
        "Yet 80cr Indian need free ration",
        "And this has been the historical trend. Check out the numbers from 2005 onwards and the number is approximately 25 crore."
    ],
    "cleaned_text": "multidimensional poverty india falls crore years niti aayog since ceo niti aayog trust worthy members india alliance concede report also india able lift crore indians multi dimensional poverty last decade small feat believe country right track india path go growth juggernaut like china strong government double digit growth weak kitchdi government might single digit growth elections pace country grow ",
    "cleaned_title": "multidimensional poverty india falls crore years niti aayog",
    "cleaned_selftext": "since ceo niti aayog trust worthy members india alliance concede report also india able lift crore indians multi dimensional poverty last decade small feat believe country right track india path go growth juggernaut like china strong government double digit growth weak kitchdi government might single digit growth elections pace country grow",
    "cleaned_comments": "yet cr indian need free ration historical trend check numbers onwards number approximately crore",
    "light_cleaned_title": "Multi-dimensional poverty in India falls by 25 crore in 9 years: Niti Aayog",
    "light_cleaned_selftext": "Since CEO of NITI Aayog is now very trust worthy for all the members of I.N.D.I.A alliance, they should now concede this report also about India being able to lift 25 crore Indians out of multi dimensional poverty in the last decade. This is no small feat and I believe as a country we are on the right track. India of 2024 is on path to go on a growth juggernaut like what China did. If we have a strong government, we will have double digit growth. If we have a weak (kitchdi) government, then it might be single digit growth. 2024 elections for me is about the pace at which our country can grow.",
    "light_cleaned_comments": "Yet 80cr Indian need free ration And this has been the historical trend. Check out the numbers from 2005 onwards and the number is approximately 25 crore."
}