{
    "id": "1hermrs",
    "title": "Got scammed for the first time",
    "url": "https://www.reddit.com/gallery/1hermrs",
    "selftext": "I ordered a pair of nike downshifters (3000 rupees) from AMAZON and got them in 10 days . When i opened the box voila they were the cutest pair of shoes i had ever seen. Now i have ordered a return . Lets hope they take it back smoothly. \nNever ordering from amazon again. Completely lost my trust.\n\nFuck these guys - *Cocoblu Retail*",
    "flair": "Rant / Vent",
    "score": 777,
    "num_comments": 154,
    "created_utc": 1734265848.0,
    "convurl": "https://i.redd.it/03x82dloa07e1.jpg",
    "comments": [
        "funny looking shoes.",
        "Mere liye to traumatic hai",
        "Nice choice Bhai",
        "No matter what you buy always take a video of unboxing🤦.",
        "Wtf 😂😂, tats trippy",
        "Bro,see the print…. It’s inclusive of all taxes… \nWhat you saw on Amazon page was before taxes…",
        "When it comes to buying books, *Cocoblu Retail* is the best retailer. Never got anything else from them. Though personally I avoid getting clothes and shoes from amazon in the first place.",
        "Technically not fault of Amazon.. its the fault of retailer.. if Amazon refund this.. most likely they will. Then they aren't bad",
        "How does it feel?",
        "Here's the thing it's not Amazon's fault nor the retailer's fault, I have worked for a client who sold his goods on Amazon and Flipkart , the items usually get stolen and replaced during the shipment.\n\n The seller usually incurs the loses for his goods and then he's needs to ask Amazon for compensation even though Amazon's shouldn't even care since it's delivery partners fault but it compensates the seller for the goods sometimes this can be a tedious process since this is a recurring issue for most branded shoes and shit,  it is the people who do this illegal shit are fucked .",
        "Kind of similar to how people get Soap instead on phones and then they blame the Company.\n\n\nThis issue cannot be rectified easily since during the shipping process too many people are involved hence finding the mole is a pain in the ass.\n\n\nAmazon being a billion dollar corporation probably doesn't care that much about things being stolen .\n\nFlipkart is very gay I would suggest stay away from it for buying expensive things, Amazon has better customer care.",
        "Absolute Cinema",
        "Nike down shifter is like a shape shifter, Ain’t that mate? 😳",
        "Just report it they'll raise a said investigation and then resolve it by 4 days. It's common issue and will be resolved just needs like 4 days at max",
        "VPR,Size 5 >>>>>>>> old ass nike",
        "You returned it?",
        "Of all the things you couldve done, you decided to blame the company that is literally the best in terms of customer service.",
        "Good for you bro, downshifters are shit",
        "Seeing this post after ordering jeans from Amazon two days back. Actually I returned one and this is a new one i ordered.",
        "He ordered Nike Down Shifters and they delivered him Nike Shoe Shifters.",
        "Bhai jaha se kharida hai uska hi to naam lunga na. Best hogi customer service par jo mood aur time barbad kiya hai usko vent to kar hi skta hu.",
        ">Flipkart is very gay I would suggest stay away from it for buying expensive things, Amazon has better customer care.\n\nEven the ui of fp looks shady lol. The only things I've ordered from fp are a cheap watch and a hair product lol",
        "What might have happened is -\n\n1. Someone else bought these shoes \n2. Returned to original seller these wrong ones (seller and delivery guys don't check waste time checking if the box is intact) and sold the shoes \n3. You got delivered the returned ones.",
        "If you have taken a video then it's an easy return.  I can personally vouch for their customer service.  I have been using it for last 12-15 yrs",
        "VPR! Funny seeing out in wild. It's a brand owned by a relative in Delhi.",
        "🧠",
        "Fashion 👍🏼",
        "Unko dikhao ki unke juto ka galat upyog ho raha hai🤧",
        "Dayumm",
        "Cocoblu was the retailer I used to buy books from the most. For the past few months, they were always good and the books arrived in good condition. But I completely lost trust for them the past week because all the books I ordered from them were not wrapped properly and just tossed into a paperbag. But most egregiously of all, I ordered a hardcover Tor copy of The Eye Of The World and it arrived in an extremely damaged condition and it wasn't even the original book but an extremely cheap and shitty pirated copy.",
        "Sold by cocoblu retail is already a scam lol",
        "Cocoblu and RealNet retails both are same and shit i got my watch completely used every inch of it was having deep scrathes , replaced it, received the same type again returned it then",
        "Can't return it, you have replace it then they provide option to return it",
        "Sahi toh lagre hai bhai 😎",
        "I'm sorry to tell you, but this is not Amazon fault, is your people fault for being less than decent and fake returning expensive shoes... we can just criticize the way Amazon handles the returns",
        "> Of all the things you couldve done\n\nSuch as...?",
        "Blame Modi",
        "I do not take people seriously who buys Nike shoes from Amazon",
        "*I see through the walls you’ve built—there’s kindness inside*",
        "The only people who steal are the delivery person.\nI have been an online seller for 3 years",
        "Heavy komedy ho gyi 🥹",
        "I bought(Nov) the same DS13 white from the same retail and I had some suspicion as it was taking some time in transit, but got the shoe in perfect(new) condition.",
        "Mera bhi jharkhand aur west bengal hote hue aaya hai. Par raaste mei rang badal liya joote ne",
        "I was a bit suspicious about the Cocoblue retail as it has some mixed reviews, some bad some good.",
        "Anyways are you buying it for running or just as casual bhai?",
        "Yr maine jogging k liye mangaya tha. Sala schedule bhi tayyar krliya tha GTN se dekhkar first 5km ka. Par koi baat nhi ab 10 din aur wait krlunga",
        "Yr maine jogging k liye mangaya tha. Sala schedule bhi tayyar krliya tha GTN se dekhkar first 5km ka. Par koi baat nhi ab 10 din aur wait krlunga",
        "Did you contact customer care?\n\nI have been buying from Amazon for ~12 years, and I never lost a penny.",
        "You forgot the most common problem, someone in the delivery chain swapped it.",
        "\\+1 for The Eye of The World",
        "Yes i did. I'll tell you what happens tomorrow.",
        "Yeah them are good shoes, I've ran about 170 kms In them till now, heel side se ghisa hai thoda due to pronation.",
        "Damn bhai. Kitne din mei cover kara itna distance?\n\n Maine last time 2 week lagatar bhaga tha daily 30 40 minute (break lelekar) phir mera shin pain start hogaya tha. Abki baar schedule banakar bhagunga to avoid injuries.",
        "I feel while these experiences are not great, Amazon usually rectifies them by not causing any hassles during refund and returns.",
        "Well. I've heard Amazon shifted for cheaper delivery companies, if that's indeed true, then it is their fault.",
        "From the ecom background: \n\nOk ! It's not a problem of cocoblu Retail, it's the return process that's fucked up.\n\nSome guy ordered a nike and replaced it with fake shoes  & returned.\n\nThe amazon warehouse team processed without proper checks.\n\nAnd it went to the shoe bin & when you ordered it came from there without checks.\n\nSo, people scammed cocoblu Retail & you should get your refund most probably, unless you are part of abuser's list.",
        "More like nike down sindrome",
        "Exactly, Take preventive measures for the worse.",
        "I ordered some version of Zoom Fly from the same seller on Amazon, the box came all damaged. I clearly asked the delivery guy to open the box before receiving the delivery. For me it was not a scam.",
        "Yup it’s important to stay vigilant at all times if you want to stay in this country.",
        "That's Nike Shape Shifters 😭",
        "Unboxing video doesn't really prove anything",
        "Happened to me once on Milton's official website, got an empty box, filled a complaint on their forum and contacted customer care, after 3 days and 6 calls with the same person, finally on the 7th call a kind person picked up and refunded the amount instantly.",
        "If you’re buying books, you can trust or try these sellers. Fraud cases do happen, but at least you can return or replace them.. just don’t place big orders.\n\nFor anything else... perfumes, protein supplements, clothes, shoes, beauty products, creams.. don’t even think about it. These sellers are all about fake products. Amazon’s algorithm itself promotes them, hides bad reviews, and makes it look legit.\n\nIf you don’t believe me, check online reviews on LinkedIn, Reddit, or use sites to see bot reviews. You’ll see how shady this is.\n\n### Sellers to Avoid (Not Limited to..) \n\nClicktech Retail\n\nRetailEZ\n\nEtrade Online\n\nRK World Infocom\n\nCloudtail\n\nCocoblu Retail\n\n\n### Owner: RattanIndia Enterprises Limited.\n\nStay safe while Shopping Online.",
        "That’s what you get for buying clothing from amazon. Lol",
        "Check the national consumer [helpline ](https://consumerhelpline.gov.in/user/signup.php)Have all the details with you , Add all the details , but most importantly, the webpage has a timer , it expires after some time , so for the description part of the complaint in the notes app, and copy paste it. write a formal complaint with all the details. \nOnce done. Search for nch track grievance, enter your details , once opened , save that page as pdf (there is an option) sent to their grievance email id. And post the whole incident on twitter , in the form of a thread. Hope this helps. Email them & take the matter to Twitter , and instagram.",
        "Doesn’t matter, a lot of the companies and resellers have a “unboxing video” policy … a lot of 3rd party website drop shippers too.",
        "Link",
        "This is a special edition bro… Nike just tie up with amazon to deliver such special shit to their customers",
        "Nike❌\n\nFashion✅",
        "I had a similar experience with a Puma Tracksuit which i had ordered from Puma India Official App. I had ordered for Puma Tracksuit which was delayed and kept at the final delivery warehouse for like 4 days. I complained to Puma customer care and finally the delivery came but when the delivery of the order came i was in duty so i asked delivery boy to leave the parcel in gate. Later i received the parcel and when opened the parcel the lower was missing only jacket was there. I called Puma customer care and they asked me if the parcel seal was intact when receiving so i told them it was okay but check once again and found that the invoice which was stuck inside that there was a big hole in parcel. So i told Puma and they said don’t return the parcel to that delivery agent we will arrange for someone else. Later another courier came for pickup and money was refunded. So as per my knowledge the delivery agent might have done that theft.",
        "Wtf man..wasn't Cocoblu Retail actually Amazon themselves?",
        "That's such an illogical system",
        "Truly a downshift",
        "I genuinely have a question, do most of the folks change the seller while buying anything? \n\nI’ve been going with whatever Amazon has suggested since inception in india and so far it’s been all good. I am also talking about big purchases like phones, cameras & laptops.",
        "Maine inka check Kiya tha to ratings acchi thi. \nJust record a VIDEO during unboxing. (Learn from my mistake)",
        "Yep. I usually do it for big purchases but heck why would you record for a pair of shoes 😅",
        "Wahi to bhai. This is mainly due to greedy workers i guess. Inko free ka juta chhaiye. Just beware.",
        "19 - 20 ka hi fark hain .",
        "I burst out laughing after the 3rd slide.",
        "I once ordered Nike shoes worth 13k and received some dummy shoes worth 700. I returned them and bought from store directly",
        "who tf is buying books from cocoblu 😭🙏",
        "Cocoblu 😭 ordered books and received damaged book covers almost every time from them.",
        "Just do it❌️ Just got scammed✅️",
        "How so,in terms of just aesthetics or for roadwork too?",
        "The return pickup guy is not going to pick it up. They pick it up only if it matches the product in the picture. Call Customer Care and arrange a non-verified pickup. Then they pick it up without checking what is being returned. \nIt will still be a monumental task getting your money back.",
        "Comfort is below average, looks are also very plain. In the same range go for adidas galaxy 6m, bit heavy but relatively more comfortable",
        "Is there another book with the same title or am I witnessing fellow WoT readers conversing?",
        "Idk for sure but I think it's a running shoe meant for optimal performance while running specially on the road ,that's why you feel the comfort isn't upto the mark imo could be wrong",
        "If it ain't comfortable while walking, it won't be while running. Anyways you should try them once before the final decision cause a lot depends on one's feet structure",
        "Ever heard about insurance?",
        "Yea, similar experience. Received an empty ssd box a few weeks back, seller was click tech retail.. 11k down the drain.. 🥲",
        "😂🫵🏻",
        "Literally everyone. When ever I am buying a book which is relatively expensive, I make sure the seller is cocoblu so that I receive a genuine copy in good condition. At least that's the case most of the times. (not promoting or anything, just my experience)",
        "I really hate to get books from cocoblu retail, 9/10 times they would pack the book randomly without any bubble rap and books get damage on the way.",
        "Han to return kar de bhai",
        "Bakwaas mat kar. Although there are tons of instances of items being tampered with in transit, there are tons of sellers who have set up a fake operation on ecom. And it is the 100% correct course to hold the service you used accountable for the fraud. Don't mislead people with your shady bullshit. If Amazon  wanted, they could pin down shady operations but they don't to avoid the costs. That's no reason for the consumer to bear the burden of being scammed. People like you are the reason everyone is blatantly committing fraud in this country. You never hold those that are responsible accountable.",
        "I always order from vegnonveg.",
        "Nike doesn’t sell on Amazon!",
        "Any shoe suggestions for running apart from downshiftera; im looking at revolution 7, are they good??",
        "Fashion",
        "Downshifter13 better hai. (YouTube reviews se info collect kri hai)  \nBut budget kam hai to revolution 7 best rhega us range mei",
        "I never liked buying from ecom. Always preferred brick and mortar stores. In my hometown or in Mumbai I always go to these stores. I do compare the prices online but buy from stores. Authenticity and human connect are my preference rather than these billion dollars shit companies. Brick store mein you can try also which shoes is a better fit for your feet and walking comfort. Baught 8k Nike's from them fully happy from paaji who treated well and also told about range and what would be better fot my feet type.",
        "You should call customer service and compliant about this.",
        "First thing before buying expensive things on amazon, check the seller ratings and its other listing and check the reviews , if reviews in all the listings combined are at-least 100 then You can think of buying the item from that seller else there are high chances for jt to be a scam.",
        "Oh Santa sent elf the shoes!!",
        "That’s a lot of downshifting",
        "Downshift ❌ Downgrade ✅",
        "Damn they really Downshifted them Nikes!",
        "When the item you ordered is more than what the delivery guy makes in a day\n\nIt's bound to happen \n\nUSA has strict laws under an umbrella term \" mail fraud\" you Indians are like LoL yeh sab toh hota hai",
        "That is hysterical 🤣🤣\nOrdered Nike, got a mike",
        "Those are nice pairs of shoes",
        "Cocoblu is a trusted and reputed seller try raising a ticket it will be resolved quickly sometime orders do get mixed up",
        "Pro tip - always check on Amazon that the manufacturer is nike India pvt ltd and not any other third party distributor",
        "Nayak",
        "If you can return and get the refund you are not scammed.",
        "When I am buying online, I follow below categorization:\n\nfashion: Myntra \nelectronics: Amazon\nbooks: Amazon\n\nThis strategy has never failed me.\n\nFlipkart? Ignore it like a plague",
        "However I've received shit frm myntra but always got good shoes frm amazon",
        "Nikki Downshifters",
        "that's hilarious 😂😂",
        "Happened with me with Nykaa order. First time as well.",
        "damn",
        "I shouldn’t have snorted out loud, this was funnier than I thought it would be. 😭",
        "Nike shape shifters",
        "Bro got downshifted",
        "Everything is a Nike if you're brave enough.",
        "> Flipkart is very gay\n\n\nWut?",
        "As far as I know it's the only title..\n\nThe Wheel weaves as the Wheel wills.",
        "Legend fades to myth, and even myth is long forgotten when the Age that gave it birth comes again.\n\nMight be time for a WoT India subreddit 🤔",
        "I can not agree any less. The whole delivery operation is complex and it is hardest to deal with in a country like India.\n\nAnd from my experience I will trust Amazon then any other online platform. No matter what the situation is Amazon has always loved my issues without too much of hassle.\n\nFlipkart on the other hand is too slow on anything and everything.",
        "ajio is way better w these things",
        "Open box delivery is a feature if you don't know",
        "I ordered a macbook from Flipkart am I cooked😭",
        "Update us in what action Amazon took!",
        "This is amazon.",
        "Pickup hogaya hai 👍",
        "Have you tried contacting support?\n\nI (my family) have been using Amazon from more than 8-9 years now nearly, haven't been scammed or ever faced something like this.",
        "Never buy shoes and clothes online. Some might have good experience but it's always risky we might end up getting fake products.",
        ">Flipkart is very gay\n\nCouldn't agree more.",
        "Yes i have contacted them. They have picked up the PRODUCT. I am giving updates on the top comment. Smh reddit doesn't allow edits on posts with pictures.",
        "Refund aye to batana, Amazon usually does not give back money easily in these cases (coming from an Amazon employee)",
        "Just send it back. Its amazon",
        "I've had the same kind of experience, if not, worse with the seller cocoblu retail. \nOrdered two items, got only a part of a single item delivered. Went through hell to get it returned and refunded. Ordered the two items again thinking it might have been a mistake in their end and I'll actually get it this time and guess what, the same thing happened again.",
        "What are those!!!",
        "Darn, that’s so sad but so funny",
        "Yeh kua bhjdiya",
        "Got ya, thanks",
        "Cocoblu Retail have messed up many of my orders as well. Incomplete orders, missed orders, wrong addressed  orders(order of domeelse delivered to me bcoz the address inside is differentftom one pasted outside)",
        "Piggy back on top comment. Only Myntra fk and ajio are official Nike sellers in india. Not Amazon",
        "Yeah I also felt the same related to comfort, planning to buy decathlon memory foam insoles. Is it good?",
        "Never used them but I love Decathlon, VFM products",
        "I guess buying online in India is basically playing Russian Roulette",
        "Hehe lol.",
        "Bro I was eyeing the very same pair of shoes last night. Nike Downshifters Black. What are the odds 😂",
        "I ordered a shirt and the delivery guy ran away it.",
        "Par isme itna pareshan hone wali kya baat hai? If Amazon says that they won't take the item back or refund, then it is concerning no? I've received wrong products from Amazon, myntra and Flipkart a few times, and have been successfully got the correct item or a refund later.\n\nIsme Amazon boycott karne wali kya baat hai bhai? Ye sab kaam karne wale bhi insaan hi hai, bhagwaan nahi",
        "Looks like they downshifted before packing only",
        "Make sure to Take an unboxing video",
        "Someone got \"downshifted\" by the seller 🤣",
        "I'm done buying from amazon and flipkart. Offline stores will win if they don't take matters seriously.",
        "Did u get ur refund?",
        "Ohkay this is pathetic 🤡\n\nhttps://preview.redd.it/omcdykyikr9e1.jpeg?width=1080&format=pjpg&auto=webp&s=c31edf94207757f055f9eab7951ba6a1d6c5996e",
        "Sed"
    ],
    "cleaned_text": "got scammed first time ordered pair nike downshifters rupees amazon got days opened box voila cutest pair shoes ever seen ordered return lets hope take back smoothly never ordering amazon completely lost trust fuck guys cocoblu retail ",
    "cleaned_title": "got scammed first time",
    "cleaned_selftext": "ordered pair nike downshifters rupees amazon got days opened box voila cutest pair shoes ever seen ordered return lets hope take back smoothly never ordering amazon completely lost trust fuck guys cocoblu retail",
    "cleaned_comments": "funny looking shoes mere liye traumatic hai nice choice bhai matter buy always take video unboxing wtf tats trippy brosee print inclusive taxes saw amazon page taxes comes buying books cocoblu retail best retailer never got anything else though personally avoid getting clothes shoes amazon first place technically fault amazon fault retailer amazon refund likely arent bad feel heres thing amazons fault retailers fault worked client sold goods amazon flipkart items usually get stolen replaced shipment seller usually incurs loses goods hes needs ask amazon compensation even though amazons shouldnt even care since delivery partners fault compensates seller goods sometimes tedious process since recurring issue branded shoes shit people illegal shit fucked kind similar people get soap instead phones blame company issue rectified easily since shipping process many people involved hence finding mole pain ass amazon billion dollar corporation probably doesnt care much things stolen flipkart gay would suggest stay away buying expensive things amazon better customer care absolute cinema nike shifter like shape shifter aint mate report theyll raise said investigation resolve days common issue resolved needs like days max vprsize old ass nike returned things couldve done decided blame company literally best terms customer service good bro downshifters shit seeing post ordering jeans amazon two days back actually returned one new one ordered ordered nike shifters delivered nike shoe shifters bhai jaha se kharida hai uska hi naam lunga na best hogi customer service par jo mood aur time barbad kiya hai usko vent kar hi skta hu flipkart gay would suggest stay away buying expensive things amazon better customer care even ui fp looks shady lol things ive ordered fp cheap watch hair product lol might happened someone else bought shoes returned original seller wrong ones seller delivery guys dont check waste time checking box intact sold shoes got delivered returned ones taken video easy return personally vouch customer service using last yrs vpr funny seeing wild brand owned relative delhi fashion unko dikhao ki unke juto ka galat upyog ho raha hai dayumm cocoblu retailer used buy books past months always good books arrived good condition completely lost trust past week books ordered wrapped properly tossed paperbag egregiously ordered hardcover tor copy eye world arrived extremely damaged condition wasnt even original book extremely cheap shitty pirated copy sold cocoblu retail already scam lol cocoblu realnet retails shit got watch completely used every inch deep scrathes replaced received type returned cant return replace provide option return sahi toh lagre hai bhai im sorry tell amazon fault people fault less decent fake returning expensive shoes criticize way amazon handles returns things couldve done blame modi take people seriously buys nike shoes amazon see walls youve builttheres kindness inside people steal delivery person online seller years heavy komedy ho gyi boughtnov ds white retail suspicion taking time transit got shoe perfectnew condition mera bhi jharkhand aur west bengal hote hue aaya hai par raaste mei rang badal liya joote ne bit suspicious cocoblue retail mixed reviews bad good anyways buying running casual bhai yr maine jogging k liye mangaya tha sala schedule bhi tayyar krliya tha gtn se dekhkar first km ka par koi baat nhi ab din aur wait krlunga yr maine jogging k liye mangaya tha sala schedule bhi tayyar krliya tha gtn se dekhkar first km ka par koi baat nhi ab din aur wait krlunga contact customer care buying amazon years never lost penny forgot common problem someone delivery chain swapped eye world yes ill tell happens tomorrow yeah good shoes ive ran kms till heel side se ghisa hai thoda due pronation damn bhai kitne din mei cover kara itna distance maine last time week lagatar bhaga tha daily minute break lelekar phir mera shin pain start hogaya tha abki baar schedule banakar bhagunga avoid injuries feel experiences great amazon usually rectifies causing hassles refund returns well ive heard amazon shifted cheaper delivery companies thats indeed true fault ecom background ok problem cocoblu retail return process thats fucked guy ordered nike replaced fake shoes returned amazon warehouse team processed without proper checks went shoe bin ordered came without checks people scammed cocoblu retail get refund probably unless part abusers list like nike sindrome exactly take preventive measures worse ordered version zoom fly seller amazon box came damaged clearly asked delivery guy open box receiving delivery scam yup important stay vigilant times want stay country thats nike shape shifters unboxing video doesnt really prove anything happened miltons official website got empty box filled complaint forum contacted customer care days calls person finally th call kind person picked refunded amount instantly youre buying books trust try sellers fraud cases happen least return replace dont place big orders anything else perfumes protein supplements clothes shoes beauty products creams dont even think sellers fake products amazons algorithm promotes hides bad reviews makes look legit dont believe check online reviews linkedin reddit use sites see bot reviews youll see shady sellers avoid limited clicktech retail retailez etrade online rk world infocom cloudtail cocoblu retail owner rattanindia enterprises limited stay safe shopping online thats get buying clothing amazon lol check national consumer helpline httpsconsumerhelplinegovinusersignupphphave details add details importantly webpage timer expires time description part complaint notes app copy paste write formal complaint details done search nch track grievance enter details opened save page pdf option sent grievance email id post whole incident twitter form thread hope helps email take matter twitter instagram doesnt matter lot companies resellers unboxing video policy lot rd party website drop shippers link special edition bro nike tie amazon deliver special shit customers nike fashion similar experience puma tracksuit ordered puma india official app ordered puma tracksuit delayed kept final delivery warehouse like days complained puma customer care finally delivery came delivery order came duty asked delivery boy leave parcel gate later received parcel opened parcel lower missing jacket called puma customer care asked parcel seal intact receiving told okay check found invoice stuck inside big hole parcel told puma said dont return parcel delivery agent arrange someone else later another courier came pickup money refunded per knowledge delivery agent might done theft wtf manwasnt cocoblu retail actually amazon thats illogical system truly downshift genuinely question folks change seller buying anything ive going whatever amazon suggested since inception india far good also talking big purchases like phones cameras laptops maine inka check kiya tha ratings acchi thi record video unboxing learn mistake yep usually big purchases heck would record pair shoes wahi bhai mainly due greedy workers guess inko free ka juta chhaiye beware ka hi fark hain burst laughing rd slide ordered nike shoes worth k received dummy shoes worth returned bought store directly tf buying books cocoblu cocoblu ordered books received damaged book covers almost every time got scammed soin terms aesthetics roadwork return pickup guy going pick pick matches product picture call customer care arrange nonverified pickup pick without checking returned still monumental task getting money back comfort average looks also plain range go adidas galaxy bit heavy relatively comfortable another book title witnessing fellow wot readers conversing idk sure think running shoe meant optimal performance running specially road thats feel comfort isnt upto mark imo could wrong aint comfortable walking wont running anyways try final decision cause lot depends ones feet structure ever heard insurance yea similar experience received empty ssd box weeks back seller click tech retail k drain literally everyone ever buying book relatively expensive make sure seller cocoblu receive genuine copy good condition least thats case times promoting anything experience really hate get books cocoblu retail times would pack book randomly without bubble rap books get damage way han return kar de bhai bakwaas mat kar although tons instances items tampered transit tons sellers set fake operation ecom correct course hold service used accountable fraud dont mislead people shady bullshit amazon wanted could pin shady operations dont avoid costs thats reason consumer bear burden scammed people like reason everyone blatantly committing fraud country never hold responsible accountable always order vegnonveg nike doesnt sell amazon shoe suggestions running apart downshiftera im looking revolution good fashion downshifter better hai youtube reviews se info collect kri hai budget kam hai revolution best rhega us range mei never liked buying ecom always preferred brick mortar stores hometown mumbai always go stores compare prices online buy stores authenticity human connect preference rather billion dollars shit companies brick store mein try also shoes better fit feet walking comfort baught k nikes fully happy paaji treated well also told range would better fot feet type call customer service compliant first thing buying expensive things amazon check seller ratings listing check reviews reviews listings combined atleast think buying item seller else high chances jt scam oh santa sent elf shoes thats lot downshifting downshift downgrade damn really downshifted nikes item ordered delivery guy makes day bound happen usa strict laws umbrella term mail fraud indians like lol yeh sab toh hota hai hysterical ordered nike got mike nice pairs shoes cocoblu trusted reputed seller try raising ticket resolved quickly sometime orders get mixed pro tip always check amazon manufacturer nike india pvt ltd third party distributor nayak return get refund scammed buying online follow categorization fashion myntra electronics amazon books amazon strategy never failed flipkart ignore like plague however ive received shit frm myntra always got good shoes frm amazon nikki downshifters thats hilarious happened nykaa order first time well damn shouldnt snorted loud funnier thought would nike shape shifters bro got downshifted everything nike youre brave enough flipkart gay wut far know title wheel weaves wheel wills legend fades myth even myth long forgotten age gave birth comes might time wot india subreddit agree less whole delivery operation complex hardest deal country like india experience trust amazon online platform matter situation amazon always loved issues without much hassle flipkart hand slow anything everything ajio way better w things open box delivery feature dont know ordered macbook flipkart cooked update us action amazon took amazon pickup hogaya hai tried contacting support family using amazon years nearly havent scammed ever faced something like never buy shoes clothes online might good experience always risky might end getting fake products flipkart gay couldnt agree yes contacted picked product giving updates top comment smh reddit doesnt allow edits posts pictures refund aye batana amazon usually give back money easily cases coming amazon employee send back amazon ive kind experience worse seller cocoblu retail ordered two items got part single item delivered went hell get returned refunded ordered two items thinking might mistake end ill actually get time guess thing happened darn thats sad funny yeh kua bhjdiya got ya thanks cocoblu retail messed many orders well incomplete orders missed orders wrong addressed ordersorder domeelse delivered bcoz address inside differentftom one pasted outside piggy back top comment myntra fk ajio official nike sellers india amazon yeah also felt related comfort planning buy decathlon memory foam insoles good never used love decathlon vfm products guess buying online india basically playing russian roulette hehe lol bro eyeing pair shoes last night nike downshifters black odds ordered shirt delivery guy ran away par isme itna pareshan hone wali kya baat hai amazon says wont take item back refund concerning ive received wrong products amazon myntra flipkart times successfully got correct item refund later isme amazon boycott karne wali kya baat hai bhai ye sab kaam karne wale bhi insaan hi hai bhagwaan nahi looks like downshifted packing make sure take unboxing video someone got downshifted seller im done buying amazon flipkart offline stores win dont take matters seriously u get ur refund ohkay pathetic sed",
    "light_cleaned_title": "Got scammed for the first time",
    "light_cleaned_selftext": "I ordered a pair of nike downshifters (3000 rupees) from AMAZON and got them in 10 days . When i opened the box voila they were the cutest pair of shoes i had ever seen. Now i have ordered a return . Lets hope they take it back smoothly. Never ordering from amazon again. Completely lost my trust. Fuck these guys - *Cocoblu Retail*",
    "light_cleaned_comments": "funny looking shoes. Mere liye to traumatic hai Nice choice Bhai No matter what you buy always take a video of unboxing🤦. Wtf 😂😂, tats trippy Bro,see the print…. It’s inclusive of all taxes… What you saw on Amazon page was before taxes… When it comes to buying books, *Cocoblu Retail* is the best retailer. Never got anything else from them. Though personally I avoid getting clothes and shoes from amazon in the first place. Technically not fault of Amazon.. its the fault of retailer.. if Amazon refund this.. most likely they will. Then they aren't bad How does it feel? Here's the thing it's not Amazon's fault nor the retailer's fault, I have worked for a client who sold his goods on Amazon and Flipkart , the items usually get stolen and replaced during the shipment. The seller usually incurs the loses for his goods and then he's needs to ask Amazon for compensation even though Amazon's shouldn't even care since it's delivery partners fault but it compensates the seller for the goods sometimes this can be a tedious process since this is a recurring issue for most branded shoes and shit, it is the people who do this illegal shit are fucked . Kind of similar to how people get Soap instead on phones and then they blame the Company. This issue cannot be rectified easily since during the shipping process too many people are involved hence finding the mole is a pain in the ass. Amazon being a billion dollar corporation probably doesn't care that much about things being stolen . Flipkart is very gay I would suggest stay away from it for buying expensive things, Amazon has better customer care. Absolute Cinema Nike down shifter is like a shape shifter, Ain’t that mate? 😳 Just report it they'll raise a said investigation and then resolve it by 4 days. It's common issue and will be resolved just needs like 4 days at max VPR,Size 5 >>>>>>>> old ass nike You returned it? Of all the things you couldve done, you decided to blame the company that is literally the best in terms of customer service. Good for you bro, downshifters are shit Seeing this post after ordering jeans from Amazon two days back. Actually I returned one and this is a new one i ordered. He ordered Nike Down Shifters and they delivered him Nike Shoe Shifters. Bhai jaha se kharida hai uska hi to naam lunga na. Best hogi customer service par jo mood aur time barbad kiya hai usko vent to kar hi skta hu. >Flipkart is very gay I would suggest stay away from it for buying expensive things, Amazon has better customer care. Even the ui of fp looks shady lol. The only things I've ordered from fp are a cheap watch and a hair product lol What might have happened is - 1. Someone else bought these shoes 2. Returned to original seller these wrong ones (seller and delivery guys don't check waste time checking if the box is intact) and sold the shoes 3. You got delivered the returned ones. If you have taken a video then it's an easy return. I can personally vouch for their customer service. I have been using it for last 12-15 yrs VPR! Funny seeing out in wild. It's a brand owned by a relative in Delhi. 🧠 Fashion 👍🏼 Unko dikhao ki unke juto ka galat upyog ho raha hai🤧 Dayumm Cocoblu was the retailer I used to buy books from the most. For the past few months, they were always good and the books arrived in good condition. But I completely lost trust for them the past week because all the books I ordered from them were not wrapped properly and just tossed into a paperbag. But most egregiously of all, I ordered a hardcover Tor copy of The Eye Of The World and it arrived in an extremely damaged condition and it wasn't even the original book but an extremely cheap and shitty pirated copy. Sold by cocoblu retail is already a scam lol Cocoblu and RealNet retails both are same and shit i got my watch completely used every inch of it was having deep scrathes , replaced it, received the same type again returned it then Can't return it, you have replace it then they provide option to return it Sahi toh lagre hai bhai 😎 I'm sorry to tell you, but this is not Amazon fault, is your people fault for being less than decent and fake returning expensive shoes... we can just criticize the way Amazon handles the returns > Of all the things you couldve done Such as...? Blame Modi I do not take people seriously who buys Nike shoes from Amazon *I see through the walls you’ve built—there’s kindness inside* The only people who steal are the delivery person. I have been an online seller for 3 years Heavy komedy ho gyi 🥹 I bought(Nov) the same DS13 white from the same retail and I had some suspicion as it was taking some time in transit, but got the shoe in perfect(new) condition. Mera bhi jharkhand aur west bengal hote hue aaya hai. Par raaste mei rang badal liya joote ne I was a bit suspicious about the Cocoblue retail as it has some mixed reviews, some bad some good. Anyways are you buying it for running or just as casual bhai? Yr maine jogging k liye mangaya tha. Sala schedule bhi tayyar krliya tha GTN se dekhkar first 5km ka. Par koi baat nhi ab 10 din aur wait krlunga Yr maine jogging k liye mangaya tha. Sala schedule bhi tayyar krliya tha GTN se dekhkar first 5km ka. Par koi baat nhi ab 10 din aur wait krlunga Did you contact customer care? I have been buying from Amazon for ~12 years, and I never lost a penny. You forgot the most common problem, someone in the delivery chain swapped it. \\+1 for The Eye of The World Yes i did. I'll tell you what happens tomorrow. Yeah them are good shoes, I've ran about 170 kms In them till now, heel side se ghisa hai thoda due to pronation. Damn bhai. Kitne din mei cover kara itna distance? Maine last time 2 week lagatar bhaga tha daily 30 40 minute (break lelekar) phir mera shin pain start hogaya tha. Abki baar schedule banakar bhagunga to avoid injuries. I feel while these experiences are not great, Amazon usually rectifies them by not causing any hassles during refund and returns. Well. I've heard Amazon shifted for cheaper delivery companies, if that's indeed true, then it is their fault. From the ecom background: Ok ! It's not a problem of cocoblu Retail, it's the return process that's fucked up. Some guy ordered a nike and replaced it with fake shoes & returned. The amazon warehouse team processed without proper checks. And it went to the shoe bin & when you ordered it came from there without checks. So, people scammed cocoblu Retail & you should get your refund most probably, unless you are part of abuser's list. More like nike down sindrome Exactly, Take preventive measures for the worse. I ordered some version of Zoom Fly from the same seller on Amazon, the box came all damaged. I clearly asked the delivery guy to open the box before receiving the delivery. For me it was not a scam. Yup it’s important to stay vigilant at all times if you want to stay in this country. That's Nike Shape Shifters 😭 Unboxing video doesn't really prove anything Happened to me once on Milton's official website, got an empty box, filled a complaint on their forum and contacted customer care, after 3 days and 6 calls with the same person, finally on the 7th call a kind person picked up and refunded the amount instantly. If you’re buying books, you can trust or try these sellers. Fraud cases do happen, but at least you can return or replace them.. just don’t place big orders. For anything else... perfumes, protein supplements, clothes, shoes, beauty products, creams.. don’t even think about it. These sellers are all about fake products. Amazon’s algorithm itself promotes them, hides bad reviews, and makes it look legit. If you don’t believe me, check online reviews on LinkedIn, Reddit, or use sites to see bot reviews. You’ll see how shady this is. ### Sellers to Avoid (Not Limited to..) Clicktech Retail RetailEZ Etrade Online RK World Infocom Cloudtail Cocoblu Retail ### Owner: RattanIndia Enterprises Limited. Stay safe while Shopping Online. That’s what you get for buying clothing from amazon. Lol Check the national consumer [helpline ](https://consumerhelpline.gov.in/user/signup.php)Have all the details with you , Add all the details , but most importantly, the webpage has a timer , it expires after some time , so for the description part of the complaint in the notes app, and copy paste it. write a formal complaint with all the details. Once done. Search for nch track grievance, enter your details , once opened , save that page as pdf (there is an option) sent to their grievance email id. And post the whole incident on twitter , in the form of a thread. Hope this helps. Email them & take the matter to Twitter , and instagram. Doesn’t matter, a lot of the companies and resellers have a “unboxing video” policy … a lot of 3rd party website drop shippers too. Link This is a special edition bro… Nike just tie up with amazon to deliver such special shit to their customers Nike❌ Fashion✅ I had a similar experience with a Puma Tracksuit which i had ordered from Puma India Official App. I had ordered for Puma Tracksuit which was delayed and kept at the final delivery warehouse for like 4 days. I complained to Puma customer care and finally the delivery came but when the delivery of the order came i was in duty so i asked delivery boy to leave the parcel in gate. Later i received the parcel and when opened the parcel the lower was missing only jacket was there. I called Puma customer care and they asked me if the parcel seal was intact when receiving so i told them it was okay but check once again and found that the invoice which was stuck inside that there was a big hole in parcel. So i told Puma and they said don’t return the parcel to that delivery agent we will arrange for someone else. Later another courier came for pickup and money was refunded. So as per my knowledge the delivery agent might have done that theft. Wtf man..wasn't Cocoblu Retail actually Amazon themselves? That's such an illogical system Truly a downshift I genuinely have a question, do most of the folks change the seller while buying anything? I’ve been going with whatever Amazon has suggested since inception in india and so far it’s been all good. I am also talking about big purchases like phones, cameras & laptops. Maine inka check Kiya tha to ratings acchi thi. Just record a VIDEO during unboxing. (Learn from my mistake) Yep. I usually do it for big purchases but heck why would you record for a pair of shoes 😅 Wahi to bhai. This is mainly due to greedy workers i guess. Inko free ka juta chhaiye. Just beware. 19 - 20 ka hi fark hain . I burst out laughing after the 3rd slide. I once ordered Nike shoes worth 13k and received some dummy shoes worth 700. I returned them and bought from store directly who tf is buying books from cocoblu 😭🙏 Cocoblu 😭 ordered books and received damaged book covers almost every time from them. Just do it❌️ Just got scammed✅️ How so,in terms of just aesthetics or for roadwork too? The return pickup guy is not going to pick it up. They pick it up only if it matches the product in the picture. Call Customer Care and arrange a non-verified pickup. Then they pick it up without checking what is being returned. It will still be a monumental task getting your money back. Comfort is below average, looks are also very plain. In the same range go for adidas galaxy 6m, bit heavy but relatively more comfortable Is there another book with the same title or am I witnessing fellow WoT readers conversing? Idk for sure but I think it's a running shoe meant for optimal performance while running specially on the road ,that's why you feel the comfort isn't upto the mark imo could be wrong If it ain't comfortable while walking, it won't be while running. Anyways you should try them once before the final decision cause a lot depends on one's feet structure Ever heard about insurance? Yea, similar experience. Received an empty ssd box a few weeks back, seller was click tech retail.. 11k down the drain.. 🥲 😂🫵🏻 Literally everyone. When ever I am buying a book which is relatively expensive, I make sure the seller is cocoblu so that I receive a genuine copy in good condition. At least that's the case most of the times. (not promoting or anything, just my experience) I really hate to get books from cocoblu retail, 9/10 times they would pack the book randomly without any bubble rap and books get damage on the way. Han to return kar de bhai Bakwaas mat kar. Although there are tons of instances of items being tampered with in transit, there are tons of sellers who have set up a fake operation on ecom. And it is the 100% correct course to hold the service you used accountable for the fraud. Don't mislead people with your shady bullshit. If Amazon wanted, they could pin down shady operations but they don't to avoid the costs. That's no reason for the consumer to bear the burden of being scammed. People like you are the reason everyone is blatantly committing fraud in this country. You never hold those that are responsible accountable. I always order from vegnonveg. Nike doesn’t sell on Amazon! Any shoe suggestions for running apart from downshiftera; im looking at revolution 7, are they good?? Fashion Downshifter13 better hai. (YouTube reviews se info collect kri hai) But budget kam hai to revolution 7 best rhega us range mei I never liked buying from ecom. Always preferred brick and mortar stores. In my hometown or in Mumbai I always go to these stores. I do compare the prices online but buy from stores. Authenticity and human connect are my preference rather than these billion dollars shit companies. Brick store mein you can try also which shoes is a better fit for your feet and walking comfort. Baught 8k Nike's from them fully happy from paaji who treated well and also told about range and what would be better fot my feet type. You should call customer service and compliant about this. First thing before buying expensive things on amazon, check the seller ratings and its other listing and check the reviews , if reviews in all the listings combined are at-least 100 then You can think of buying the item from that seller else there are high chances for jt to be a scam. Oh Santa sent elf the shoes!! That’s a lot of downshifting Downshift ❌ Downgrade ✅ Damn they really Downshifted them Nikes! When the item you ordered is more than what the delivery guy makes in a day It's bound to happen USA has strict laws under an umbrella term \" mail fraud\" you Indians are like LoL yeh sab toh hota hai That is hysterical 🤣🤣 Ordered Nike, got a mike Those are nice pairs of shoes Cocoblu is a trusted and reputed seller try raising a ticket it will be resolved quickly sometime orders do get mixed up Pro tip - always check on Amazon that the manufacturer is nike India pvt ltd and not any other third party distributor Nayak If you can return and get the refund you are not scammed. When I am buying online, I follow below categorization: fashion: Myntra electronics: Amazon books: Amazon This strategy has never failed me. Flipkart? Ignore it like a plague However I've received shit frm myntra but always got good shoes frm amazon Nikki Downshifters that's hilarious 😂😂 Happened with me with Nykaa order. First time as well. damn I shouldn’t have snorted out loud, this was funnier than I thought it would be. 😭 Nike shape shifters Bro got downshifted Everything is a Nike if you're brave enough. > Flipkart is very gay Wut? As far as I know it's the only title.. The Wheel weaves as the Wheel wills. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth comes again. Might be time for a WoT India subreddit 🤔 I can not agree any less. The whole delivery operation is complex and it is hardest to deal with in a country like India. And from my experience I will trust Amazon then any other online platform. No matter what the situation is Amazon has always loved my issues without too much of hassle. Flipkart on the other hand is too slow on anything and everything. ajio is way better w these things Open box delivery is a feature if you don't know I ordered a macbook from Flipkart am I cooked😭 Update us in what action Amazon took! This is amazon. Pickup hogaya hai 👍 Have you tried contacting support? I (my family) have been using Amazon from more than 8-9 years now nearly, haven't been scammed or ever faced something like this. Never buy shoes and clothes online. Some might have good experience but it's always risky we might end up getting fake products. >Flipkart is very gay Couldn't agree more. Yes i have contacted them. They have picked up the PRODUCT. I am giving updates on the top comment. Smh reddit doesn't allow edits on posts with pictures. Refund aye to batana, Amazon usually does not give back money easily in these cases (coming from an Amazon employee) Just send it back. Its amazon I've had the same kind of experience, if not, worse with the seller cocoblu retail. Ordered two items, got only a part of a single item delivered. Went through hell to get it returned and refunded. Ordered the two items again thinking it might have been a mistake in their end and I'll actually get it this time and guess what, the same thing happened again. What are those!!! Darn, that’s so sad but so funny Yeh kua bhjdiya Got ya, thanks Cocoblu Retail have messed up many of my orders as well. Incomplete orders, missed orders, wrong addressed orders(order of domeelse delivered to me bcoz the address inside is differentftom one pasted outside) Piggy back on top comment. Only Myntra fk and ajio are official Nike sellers in india. Not Amazon Yeah I also felt the same related to comfort, planning to buy decathlon memory foam insoles. Is it good? Never used them but I love Decathlon, VFM products I guess buying online in India is basically playing Russian Roulette Hehe lol. Bro I was eyeing the very same pair of shoes last night. Nike Downshifters Black. What are the odds 😂 I ordered a shirt and the delivery guy ran away it. Par isme itna pareshan hone wali kya baat hai? If Amazon says that they won't take the item back or refund, then it is concerning no? I've received wrong products from Amazon, myntra and Flipkart a few times, and have been successfully got the correct item or a refund later. Isme Amazon boycott karne wali kya baat hai bhai? Ye sab kaam karne wale bhi insaan hi hai, bhagwaan nahi Looks like they downshifted before packing only Make sure to Take an unboxing video Someone got \"downshifted\" by the seller 🤣 I'm done buying from amazon and flipkart. Offline stores will win if they don't take matters seriously. Did u get ur refund? Ohkay this is pathetic 🤡 Sed"
}