{
    "id": "1c0cdzh",
    "title": "Sensex hits 75,000, it was at 25,000 when PM Modi won 10 years ago",
    "url": "https://www.reddit.com/r/india/comments/1c0cdzh/sensex_hits_75000_it_was_at_25000_when_pm_modi/",
    "selftext": "**Good morning, everyone!**\n\n**Sensex Hits Historic Milestone**\n\nExciting news from the financial realm today as the Sensex, India's key stock market index, surges to an unprecedented milestone of 75,000 points. Let's delve into the details:\n\n**1. Landmark Achievement:**\n\nThe Sensex reaching the 75,000 mark marks a momentous occasion in India's economic history, symbolizing the country's remarkable resilience and growth trajectory.\n\n**2. Investor Confidence:**\n\nThe journey of Sensex from 25,000 to 75,000 points over the past decade underscores the unwavering confidence of investors in the Indian market and highlights its stability.\n\n**3. Impact of Government Policies:**\n\nThe policies implemented under Prime Minister Modi's leadership likely played a pivotal role in driving this growth, instilling optimism among investors, and fostering an environment conducive to economic expansion.\n\n**4. Sustained Progress:**\n\nThe gradual yet steady increase in Sensex over the span of a decade reflects the nation's sustained economic progress, indicating long-term stability and growth prospects.\n\n**5. Wealth Creation:**\n\nThe surge in Sensex translates to enhanced wealth for investors, signifying the robust performance of the market and the tangible benefits reaped by stakeholders.\n\nRead more at:\n\n[http://timesofindia.indiatimes.com/articleshow/109176567.cms?utm\\_source=contentofinterest&utm\\_medium=text&utm\\_campaign=cppst](http://timesofindia.indiatimes.com/articleshow/109176567.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 18,
    "created_utc": 1712721555.0,
    "convurl": "https://external-preview.redd.it/mKQXnG1Ngd-pzIoLhqpsTRflUlCSJPIMxotgViyZNtg.jpg?auto=webp&s=f49b027ee0be34b97dcee200af4840092dfcd289",
    "comments": [
        "I dont know how stock market is doing so well?",
        "I’m going to give standard reply that this government gives when numbers like press freedom index etc are put out - “we don’t accept these numbers”",
        "I mean what’s surprising about it? A healthy growing economy with Pro capitalistic policies with heavy investment in infrastructure making the viability of businesses increase will make obviously lead to the stock market doing good.",
        "The Indian stock market historically grew at 15% p.a., which means it tripples every 7.5 years and in 10 years it becomes 4 times.\n\n**The Modi government underperformed by 25% despite extremely high PE multiples.**",
        "Indexes grow over time. Surprise surprise.",
        "Yeah, it was around 5500 in 2004. It grew under MMS as well (and more in percentage terms).",
        "18% CAGR from 2004 to 2014 and 11.6% from 2014 to 2024. Well done!!",
        "by the way bhakts have been touching their privates over this news it feels like before 2014 the growth was 0 and suddenly they poured some tea on the sensex floor and the graphs went up",
        "And with all this effort, the CAGR is only 11.6%, should it not have been more than the 16 % seen in the MMS & PC era?",
        "Ben ke love day /s - he who must not be named."
    ],
    "cleaned_text": "sensex hits pm modi years ago good morning everyone sensex hits historic milestone exciting news financial realm today sensex indias key stock market index surges unprecedented milestone points lets delve details landmark achievement sensex reaching mark marks momentous occasion indias economic history symbolizing countrys remarkable resilience growth trajectory investor confidence journey sensex points past decade underscores unwavering confidence investors indian market highlights stability impact government policies policies implemented prime minister modis leadership likely played pivotal role driving growth instilling optimism among investors fostering environment conducive economic expansion sustained progress gradual yet steady increase sensex span decade reflects nations sustained economic progress indicating longterm stability growth prospects wealth creation surge sensex translates enhanced wealth investors signifying robust performance market tangible benefits reaped stakeholders read httptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppsthttptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst ",
    "cleaned_title": "sensex hits pm modi years ago",
    "cleaned_selftext": "good morning everyone sensex hits historic milestone exciting news financial realm today sensex indias key stock market index surges unprecedented milestone points lets delve details landmark achievement sensex reaching mark marks momentous occasion indias economic history symbolizing countrys remarkable resilience growth trajectory investor confidence journey sensex points past decade underscores unwavering confidence investors indian market highlights stability impact government policies policies implemented prime minister modis leadership likely played pivotal role driving growth instilling optimism among investors fostering environment conducive economic expansion sustained progress gradual yet steady increase sensex span decade reflects nations sustained economic progress indicating longterm stability growth prospects wealth creation surge sensex translates enhanced wealth investors signifying robust performance market tangible benefits reaped stakeholders read httptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppsthttptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst",
    "cleaned_comments": "dont know stock market well im going give standard reply government gives numbers like press freedom index etc put dont accept numbers mean whats surprising healthy growing economy pro capitalistic policies heavy investment infrastructure making viability businesses increase make obviously lead stock market good indian stock market historically grew pa means tripples every years years becomes times modi government underperformed despite extremely high pe multiples indexes grow time surprise surprise yeah around grew mms well percentage terms cagr well done way bhakts touching privates news feels like growth suddenly poured tea sensex floor graphs went effort cagr seen mms pc era ben ke love day must named",
    "light_cleaned_title": "Sensex hits 75,000, it was at 25,000 when PM Modi won 10 years ago",
    "light_cleaned_selftext": "**Good morning, everyone!** **Sensex Hits Historic Milestone** Exciting news from the financial realm today as the Sensex, India's key stock market index, surges to an unprecedented milestone of 75,000 points. Let's delve into the details: **1. Landmark Achievement:** The Sensex reaching the 75,000 mark marks a momentous occasion in India's economic history, symbolizing the country's remarkable resilience and growth trajectory. **2. Investor Confidence:** The journey of Sensex from 25,000 to 75,000 points over the past decade underscores the unwavering confidence of investors in the Indian market and highlights its stability. **3. Impact of Government Policies:** The policies implemented under Prime Minister Modi's leadership likely played a pivotal role in driving this growth, instilling optimism among investors, and fostering an environment conducive to economic expansion. **4. Sustained Progress:** The gradual yet steady increase in Sensex over the span of a decade reflects the nation's sustained economic progress, indicating long-term stability and growth prospects. **5. Wealth Creation:** The surge in Sensex translates to enhanced wealth for investors, signifying the robust performance of the market and the tangible benefits reaped by stakeholders. Read more at: [http://timesofindia.indiatimes.com/articleshow/109176567.cms?utm\\_source=contentofinterest&utm\\_medium=text&utm\\_campaign=cppst](http://timesofindia.indiatimes.com/articleshow/109176567.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst)",
    "light_cleaned_comments": "I dont know how stock market is doing so well? I’m going to give standard reply that this government gives when numbers like press freedom index etc are put out - “we don’t accept these numbers” I mean what’s surprising about it? A healthy growing economy with Pro capitalistic policies with heavy investment in infrastructure making the viability of businesses increase will make obviously lead to the stock market doing good. The Indian stock market historically grew at 15% p.a., which means it tripples every 7.5 years and in 10 years it becomes 4 times. **The Modi government underperformed by 25% despite extremely high PE multiples.** Indexes grow over time. Surprise surprise. Yeah, it was around 5500 in 2004. It grew under MMS as well (and more in percentage terms). 18% CAGR from 2004 to 2014 and 11.6% from 2014 to 2024. Well done!! by the way bhakts have been touching their privates over this news it feels like before 2014 the growth was 0 and suddenly they poured some tea on the sensex floor and the graphs went up And with all this effort, the CAGR is only 11.6%, should it not have been more than the 16 % seen in the MMS & PC era? Ben ke love day /s - he who must not be named."
}