{
    "id": "16iflm6",
    "title": "\"Seamless\" experience to register my drone on DigitalSky India.",
    "url": "https://www.reddit.com/r/india/comments/16iflm6/seamless_experience_to_register_my_drone_on/",
    "selftext": "&#x200B;\n\n[What is the valid password format then?](https://preview.redd.it/0p9rki0ge7ob1.png?width=1166&format=png&auto=webp&s=639554718f404aa5e50303571cdfbcfe0d4b5894)\n\nMe: \\*creates password\\*\n\nDigital Sky: INVALID FORMAT!\n\nMe: \\*creates stronger password\\*\n\nDigital Sky: INVALID FORMAT!\n\nMe: \\*creates password with different numbers and symbols\\*\n\nDigital Sky: INVALID FORMAT!\n\nMe: What is the valid format then???\n\nDigital Sky: ...\n\n&#x200B;\n\nI tried many formats - symbols, numbers, arrangements, caps, all for DigiSky to say its invalid.\n\nAny help in the comments is appreciated.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694689936.0,
    "convurl": "https://a.thumbs.redditmedia.com/CYerLTpRFwyNs_dE1xaxxNr38WEJbvgd6mGoXSift20.jpg",
    "comments": [
        "Contact them? Should have an email",
        "Try just alphabets, around 10-15 letters. I know stupid, but completely possible from government.",
        "You can practice setting a password here [https://neal.fun/password-game/](https://neal.fun/password-game/)\n\nIf you're able to set a password here, you'll find every other password simple.",
        "Are you using a mobile app? If yes, try using a browser to just set up the account and password.",
        "This is amusing"
    ],
    "cleaned_text": "seamless experience register drone digitalsky india xb valid password format thenhttpspreviewredditprkigeobpngwidthformatpngautowebpsfaaecdfbcfedb creates password digital sky invalid format creates stronger password digital sky invalid format creates password different numbers symbols digital sky invalid format valid format digital sky xb tried many formats symbols numbers arrangements caps digisky say invalid help comments appreciated ",
    "cleaned_title": "seamless experience register drone digitalsky india",
    "cleaned_selftext": "xb valid password format thenhttpspreviewredditprkigeobpngwidthformatpngautowebpsfaaecdfbcfedb creates password digital sky invalid format creates stronger password digital sky invalid format creates password different numbers symbols digital sky invalid format valid format digital sky xb tried many formats symbols numbers arrangements caps digisky say invalid help comments appreciated",
    "cleaned_comments": "contact email try alphabets around letters know stupid completely possible government practice setting password httpsnealfunpasswordgamehttpsnealfunpasswordgame youre able set password youll find every password simple using mobile app yes try using browser set account password amusing",
    "light_cleaned_title": "\"Seamless\" experience to register my drone on DigitalSky India.",
    "light_cleaned_selftext": "&#x200B; [What is the valid password format then?](https://preview.redd.it/0p9rki0ge7ob1.png?width=1166&format=png&auto=webp&s=639554718f404aa5e50303571cdfbcfe0d4b5894) Me: \\*creates password\\* Digital Sky: INVALID FORMAT! Me: \\*creates stronger password\\* Digital Sky: INVALID FORMAT! Me: \\*creates password with different numbers and symbols\\* Digital Sky: INVALID FORMAT! Me: What is the valid format then??? Digital Sky: ... &#x200B; I tried many formats - symbols, numbers, arrangements, caps, all for DigiSky to say its invalid. Any help in the comments is appreciated.",
    "light_cleaned_comments": "Contact them? Should have an email Try just alphabets, around 10-15 letters. I know stupid, but completely possible from government. You can practice setting a password here [https://neal.fun/password-game/](https://neal.fun/password-game/) If you're able to set a password here, you'll find every other password simple. Are you using a mobile app? If yes, try using a browser to just set up the account and password. This is amusing"
}