{
    "id": "1377jvx",
    "title": "Karnataka: Muslim student assaulted for talking to Hindu girl, 4 held",
    "url": "https://maktoobmedia.com/india/south-india/karnataka-muslim-student-assaulted-for-talking-to-hindu-girl-4-held/",
    "selftext": "A Muslim student was assaulted by four Hindu men for talking to a Hindu girl at Puttur in Karnataka’s Dakshina Kannada district Tuesday. The police have arrested the four assailants.\n\n17-year-old Mohammed Faris was at a juice parlour with his female classmates from the government pre-university college in Puttur.",
    "flair": "Crime",
    "score": 83,
    "num_comments": 10,
    "created_utc": 1683168026.0,
    "convurl": "https://external-preview.redd.it/p6K77PEePp7C4lLJ5NYxNzQDcnltGXH9_vm_BMgF9Vo.jpg?auto=webp&v=enabled&s=f2285979b59e9d06dd9ec8666ef2cd938dee4725",
    "comments": [
        "Basically everyday news now. India is a great country with lots of positives but also lots of negatives, I have to say religious intolerance, violence and nationalism is my biggest negative viewpoint of India as an outsider now.",
        "Madness!",
        "Love Jihad /s",
        "Well done. I'm sure this hindu girl must now be smitten and all head over heels at the bravado and machismo of these alpha hindu men.",
        "Rumor is her parents are arranging for her to be married with one of the men now.",
        "I hope you're not serious.",
        "Rip sarcasm",
        "Sorry it wasn't obvious to me - I've come across too many mind-numbing news from India that it wouldn't surprise me much if this was actually true"
    ],
    "cleaned_text": "karnataka muslim student assaulted talking hindu girl held muslim student assaulted four hindu men talking hindu girl puttur karnatakas dakshina kannada district tuesday police arrested four assailants yearold mohammed faris juice parlour female classmates government preuniversity college puttur ",
    "cleaned_title": "karnataka muslim student assaulted talking hindu girl held",
    "cleaned_selftext": "muslim student assaulted four hindu men talking hindu girl puttur karnatakas dakshina kannada district tuesday police arrested four assailants yearold mohammed faris juice parlour female classmates government preuniversity college puttur",
    "cleaned_comments": "basically everyday news india great country lots positives also lots negatives say religious intolerance violence nationalism biggest negative viewpoint india outsider madness love jihad well done im sure hindu girl must smitten head heels bravado machismo alpha hindu men rumor parents arranging married one men hope youre serious rip sarcasm sorry wasnt obvious ive come across many mindnumbing news india wouldnt surprise much actually true",
    "light_cleaned_title": "Karnataka: Muslim student assaulted for talking to Hindu girl, 4 held",
    "light_cleaned_selftext": "A Muslim student was assaulted by four Hindu men for talking to a Hindu girl at Puttur in Karnataka’s Dakshina Kannada district Tuesday. The police have arrested the four assailants. 17-year-old Mohammed Faris was at a juice parlour with his female classmates from the government pre-university college in Puttur.",
    "light_cleaned_comments": "Basically everyday news now. India is a great country with lots of positives but also lots of negatives, I have to say religious intolerance, violence and nationalism is my biggest negative viewpoint of India as an outsider now. Madness! Love Jihad /s Well done. I'm sure this hindu girl must now be smitten and all head over heels at the bravado and machismo of these alpha hindu men. Rumor is her parents are arranging for her to be married with one of the men now. I hope you're not serious. Rip sarcasm Sorry it wasn't obvious to me - I've come across too many mind-numbing news from India that it wouldn't surprise me much if this was actually true"
}