{
    "id": "1hd9681",
    "title": "Allu Arjun Arrested Days After Woman Killed In Stampede At 'Pushpa 2' Screening",
    "url": "https://www.ndtv.com/india-news/actor-allu-arjun-arrested-days-after-woman-killed-in-stampede-at-pushpa-2-screening-in-hyderabad-7238386#pfrom=home-ndtv_topscroll",
    "selftext": "The cynic in me makes me wonder - “part of promotion for a movie”\n\n\nTalk to me when he is convicted and cops who re higher up fired.\n\n\nWe are a nation of theater - actors politicians all doing continuous nautanki \n\n\nTrue people who fight the system are incarcerated like Umar Khalid on crimes they never committed\n\n\nThe greatest actor sits in the PM seat\n\n\nWould love to be wrong on allu Arjun arrest - but if history tells us, nothing will come of it.\n",
    "flair": "Law & Courts",
    "score": 230,
    "num_comments": 23,
    "created_utc": 1734084692.0,
    "convurl": "https://external-preview.redd.it/Hm6nEwqmvnWgpi-XW30LZwGJhYyKgP7j1wwlKRmsA8M.jpg?auto=webp&s=7abc079b8295a3f1500f1399561c6be7080ee300",
    "comments": [
        "Same bro.... I'm sure all of this just pr ops",
        "Every telugu actor has a relative who is in politics and and fan works like party members",
        "Why should the actor be arrested for the stampede?",
        "When you know you have crowd - you are organizing an event (he is promoting his movie). It is your responsibility to ensure the safety vis-à-vis crowd management\n\nJust like during religious festivals it is the organizers responsibility to ensure crowd management is in place\n\n\nIt is not just allu Arjun - the movie theater, police and the general public all are responsible\n\n\nThe only one not responsible is the kid - I would say his mother is partly responsible as well as the victim\n\n\nWe had numerous stampedes in India and we never learn as we think on the line -“why is allu Arjun responsible?”",
        "Stupid people and their cravings to a low iq masala film. Stampede is expected when you gather a herd of stupid people at a place. The woman who went there  didn't think that? What was she thinking, \"I will go to a low iq film on day 1 of release and people their will behave nicely\".",
        "https://preview.redd.it/wvdnz67rtl6e1.jpeg?width=1080&format=pjpg&auto=webp&s=f97e48e71a8fe7428b1079a44b79a387bba1ea28",
        "Lmfaoo.. dont joke...",
        "What? Victims blaming ??? She has every right to go to a movie theatre as much as any other citizen",
        "Nope. Law and order is the sole responsibility of the police once the permission has been sought and granted as long as the incident happens in a public place. If this would have happened in his private property then it would be a completely different story.",
        "Source : X (twitter)",
        "Ab to bail bhi mil gyi",
        "His responsibility is promotion not crowd management",
        "It's not PR, the husband of the deceased filed an FIR which included organisers, Arjuns and his personal security guards names",
        "The husband of the deceased just said Allu doesn't have to do anything with her death. You're just another pr",
        "not to defend a millionaire or anything but how is it his fault?",
        "Was at a wedding where his security detail whacked my grandmom with the car door. Arjun turned around and apologised to a kid nearby.",
        "What did she expect? Allu Arjun was present in the theater, it was the first day - first show , it was undoubtedly going to be a stampede. Indians lack civil sense , neither the government nor a celebrity cares for the life of the common man here.",
        "Then why did he mention his name in FIR?",
        "Yes you have the right to go but that doesn't mean you have to shut your brain off and behave like a hive, how is this different from all those religious gatherings where stampede happens?. When you look at the crowd, you can see most of those are low iq people.",
        "... and got bail..",
        "It’s dumb as hell. Allu Arjun wasn’t personally managing the crowd, he probably hired an event management company to do it. Or the police.\n\nThis stupid thing is like getting married in a marriage hall, the roof collapses and the police arrest the groom. They should be arresting the owner of the marriage hall.",
        "agreed - arrest is overreaction. send legal notices .no need to arrest anyone - let there be a lawsuit and timely justice",
        "How tf is this a PR. Entities like high court, state govt, police and many other big shots are involved. On top of it, the movie is already a blockbuster. Still PR huh!",
        "Bet this is part of political targeting. Have you ever heard of a film hero or politician arrested for a stampede death? The very fact that he was arrested in a short time shows that the wheels of justice, judiciary and police acted at  warp speed. How is this possible in India?",
        "When you get the wrong person arrested,  it means the people actually responsible ( like event organisers) are getting off scot free.  Diversion tactic.",
        "Allu arjun was not given permission to rally. He showed up unnoticed and, through his sunroof, waved at audiences and grabbed their attention . While passing through narrow entrance , he was directly responsible for a sudden surge of crowd towards him that killed poor mother. \n\nAll actors for such events use the backdoor to enter the theater during special shows. Police provide clear protocols to management to avoid such incidents. \nDespite all this, Allu Aravind is A11 accused. There are 10 people ahead of him who got arrested.",
        "Change the name of the movie to “Don’t Push Pa or Ma”"
    ],
    "cleaned_text": "allu arjun arrested days woman killed stampede pushpa screening cynic makes wonder part promotion movie talk convicted cops higher fired nation theater actors politicians continuous nautanki true people fight system incarcerated like umar khalid crimes never committed greatest actor sits pm seat would love wrong allu arjun arrest history tells us nothing come ",
    "cleaned_title": "allu arjun arrested days woman killed stampede pushpa screening",
    "cleaned_selftext": "cynic makes wonder part promotion movie talk convicted cops higher fired nation theater actors politicians continuous nautanki true people fight system incarcerated like umar khalid crimes never committed greatest actor sits pm seat would love wrong allu arjun arrest history tells us nothing come",
    "cleaned_comments": "bro im sure pr ops every telugu actor relative politics fan works like party members actor arrested stampede know crowd organizing event promoting movie responsibility ensure safety visvis crowd management like religious festivals organizers responsibility ensure crowd management place allu arjun movie theater police general public responsible one responsible kid would say mother partly responsible well victim numerous stampedes india never learn think line allu arjun responsible stupid people cravings low iq masala film stampede expected gather herd stupid people place woman went didnt think thinking go low iq film day release people behave nicely lmfaoo dont joke victims blaming every right go movie theatre much citizen nope law order sole responsibility police permission sought granted long incident happens public place would happened private property would completely different story source x twitter ab bail bhi mil gyi responsibility promotion crowd management pr husband deceased filed fir included organisers arjuns personal security guards names husband deceased said allu doesnt anything death youre another pr defend millionaire anything fault wedding security detail whacked grandmom car door arjun turned around apologised kid nearby expect allu arjun present theater first day first show undoubtedly going stampede indians lack civil sense neither government celebrity cares life common man mention name fir yes right go doesnt mean shut brain behave like hive different religious gatherings stampede happens look crowd see low iq people got bail dumb hell allu arjun wasnt personally managing crowd probably hired event management company police stupid thing like getting married marriage hall roof collapses police arrest groom arresting owner marriage hall agreed arrest overreaction send legal notices need arrest anyone let lawsuit timely justice tf pr entities like high court state govt police many big shots involved top movie already blockbuster still pr huh bet part political targeting ever heard film hero politician arrested stampede death fact arrested short time shows wheels justice judiciary police acted warp speed possible india get wrong person arrested means people actually responsible like event organisers getting scot free diversion tactic allu arjun given permission rally showed unnoticed sunroof waved audiences grabbed attention passing narrow entrance directly responsible sudden surge crowd towards killed poor mother actors events use backdoor enter theater special shows police provide clear protocols management avoid incidents despite allu aravind accused people ahead got arrested change name movie dont push pa",
    "light_cleaned_title": "Allu Arjun Arrested Days After Woman Killed In Stampede At 'Pushpa 2' Screening",
    "light_cleaned_selftext": "The cynic in me makes me wonder - “part of promotion for a movie” Talk to me when he is convicted and cops who re higher up fired. We are a nation of theater - actors politicians all doing continuous nautanki True people who fight the system are incarcerated like Umar Khalid on crimes they never committed The greatest actor sits in the PM seat Would love to be wrong on allu Arjun arrest - but if history tells us, nothing will come of it.",
    "light_cleaned_comments": "Same bro.... I'm sure all of this just pr ops Every telugu actor has a relative who is in politics and and fan works like party members Why should the actor be arrested for the stampede? When you know you have crowd - you are organizing an event (he is promoting his movie). It is your responsibility to ensure the safety vis-à-vis crowd management Just like during religious festivals it is the organizers responsibility to ensure crowd management is in place It is not just allu Arjun - the movie theater, police and the general public all are responsible The only one not responsible is the kid - I would say his mother is partly responsible as well as the victim We had numerous stampedes in India and we never learn as we think on the line -“why is allu Arjun responsible?” Stupid people and their cravings to a low iq masala film. Stampede is expected when you gather a herd of stupid people at a place. The woman who went there didn't think that? What was she thinking, \"I will go to a low iq film on day 1 of release and people their will behave nicely\". Lmfaoo.. dont joke... What? Victims blaming ??? She has every right to go to a movie theatre as much as any other citizen Nope. Law and order is the sole responsibility of the police once the permission has been sought and granted as long as the incident happens in a public place. If this would have happened in his private property then it would be a completely different story. Source : X (twitter) Ab to bail bhi mil gyi His responsibility is promotion not crowd management It's not PR, the husband of the deceased filed an FIR which included organisers, Arjuns and his personal security guards names The husband of the deceased just said Allu doesn't have to do anything with her death. You're just another pr not to defend a millionaire or anything but how is it his fault? Was at a wedding where his security detail whacked my grandmom with the car door. Arjun turned around and apologised to a kid nearby. What did she expect? Allu Arjun was present in the theater, it was the first day - first show , it was undoubtedly going to be a stampede. Indians lack civil sense , neither the government nor a celebrity cares for the life of the common man here. Then why did he mention his name in FIR? Yes you have the right to go but that doesn't mean you have to shut your brain off and behave like a hive, how is this different from all those religious gatherings where stampede happens?. When you look at the crowd, you can see most of those are low iq people. ... and got bail.. It’s dumb as hell. Allu Arjun wasn’t personally managing the crowd, he probably hired an event management company to do it. Or the police. This stupid thing is like getting married in a marriage hall, the roof collapses and the police arrest the groom. They should be arresting the owner of the marriage hall. agreed - arrest is overreaction. send legal notices .no need to arrest anyone - let there be a lawsuit and timely justice How tf is this a PR. Entities like high court, state govt, police and many other big shots are involved. On top of it, the movie is already a blockbuster. Still PR huh! Bet this is part of political targeting. Have you ever heard of a film hero or politician arrested for a stampede death? The very fact that he was arrested in a short time shows that the wheels of justice, judiciary and police acted at warp speed. How is this possible in India? When you get the wrong person arrested, it means the people actually responsible ( like event organisers) are getting off scot free. Diversion tactic. Allu arjun was not given permission to rally. He showed up unnoticed and, through his sunroof, waved at audiences and grabbed their attention . While passing through narrow entrance , he was directly responsible for a sudden surge of crowd towards him that killed poor mother. All actors for such events use the backdoor to enter the theater during special shows. Police provide clear protocols to management to avoid such incidents. Despite all this, Allu Aravind is A11 accused. There are 10 people ahead of him who got arrested. Change the name of the movie to “Don’t Push Pa or Ma”"
}