{
    "id": "1esalyv",
    "title": "Women from Barasat, West Bengal are taking control of the night after comments were made about the murdered lady doctor's whereabouts.",
    "url": "https://v.redd.it/u0vel6jlmoid1",
    "selftext": "The principal of RG Kar medical college had the audacity to  make a derogatory remarks like - what was she doing at that time of the night; about the murdered lady doctor. In response women from my hometown is taking control of the night. \n\n[It is the same place where Vidyasagar opened first girl's school in India. Make what you can of this remark]\n",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1723664200.0,
    "convurl": "https://external-preview.redd.it/OHM2eTJ0Ymttb2lkMVC8D2c56EZf00zFlu41FuxhoaWUR9h1J_GQTcsP9Pyi.png?format=pjpg&auto=webp&s=bdd460152af255230cb77196c18d6daab26e8ccb",
    "comments": [],
    "cleaned_text": "women barasat west bengal taking control night comments made murdered lady doctors whereabouts principal rg kar medical college audacity make derogatory remarks like time night murdered lady doctor response women hometown taking control night place vidyasagar opened first girls school india make remark ",
    "cleaned_title": "women barasat west bengal taking control night comments made murdered lady doctors whereabouts",
    "cleaned_selftext": "principal rg kar medical college audacity make derogatory remarks like time night murdered lady doctor response women hometown taking control night place vidyasagar opened first girls school india make remark",
    "cleaned_comments": "",
    "light_cleaned_title": "Women from Barasat, West Bengal are taking control of the night after comments were made about the murdered lady doctor's whereabouts.",
    "light_cleaned_selftext": "The principal of RG Kar medical college had the audacity to make a derogatory remarks like - what was she doing at that time of the night; about the murdered lady doctor. In response women from my hometown is taking control of the night. [It is the same place where Vidyasagar opened first girl's school in India. Make what you can of this remark]",
    "light_cleaned_comments": ""
}