{
    "id": "16hwsvw",
    "title": "Make in India, a sham?",
    "url": "https://i.redd.it/d8mdohx4u2ob1.jpg",
    "selftext": "We keep on hearing that India's make in India initiative is flying, we are to the moon, India is manufacturing more tha ever.\n\nHowever the same isn't reflecting in this data of world Bank. We are literally at almost a 45 year low in terms of manufacturing value add to GDP percentage. Can anyone explain why? \n\nThis is genuine questions all views are welcome.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694634411.0,
    "convurl": "https://i.redd.it/d8mdohx4u2ob1.jpg",
    "comments": [
        "i dont want this number to be high anyways, we should have a high service sector contribution instead of working in factories",
        "You cannot make farmers into software engineers first comes the factories",
        "And why do you exactly saw that? Service sector contribution is about skilled intellectuals. Where does rest of India go? Only 60 percent of Indians are educated beyond 8th standard, you can't expect them to sit in a plush office in Bangalore or Gurgaon and code (just an example )\n\nAlso why would you want to look at absolute numbers? If you want to look at absolute numbers let's look at growth in GDP in terms of absolutes too (US vs India or China vs India) \n\nI'm surprised that we are even thinking of looking at absolute numbers when GDP growth is calculated in CAGr",
        "Lol this the definition of statistics being used to for propaganda except this is a hilarious fail attempt 🤣 \nPre 1990 India's GDP was literally peanuts this graph shows how well other sectors have manganese to push indian economy up",
        "Okay so how about 2002 onwards?",
        "Why u want to make every thing in india and screw it with pollution like China did",
        "Service sector is 100x bigger than just software engineering and that too sitting in a plush office. Restaurants hotels etc also come under service sector. Service sector is better than manufacturing because you produce more output (more GDP) per hour as compared to manufacturing sector.  Given this last statement, would you like manufacturing sector contribution to go up or down? And I said to look at absolute numbers because make in India doesn’t mean that % of manufacturing will go up, it’s just means MORE would be manufactured",
        "Yeah I don't want to,  but what is about all the noise about? \n\nI'd ideally want skilled intellectual labour for my country, but that's unfortunately not going to happen since 60 percent of Indians don't have education beyond primary (8th standard) in absence of that, the economy is going to be pushed by farming and manufacturing.",
        "Do you even know the meaning of service sector",
        "And the skilled ones are leaving the country for better life",
        "Yeah, not a good growth story there also :p\n\n2019 was an anomaly because all other form on value adds stopped due to covid and our GDP shrunk. , look at where UPA started in 2004 and where it reached.\n\nhttps://preview.redd.it/cw1vla2j03ob1.jpeg?width=1080&format=pjpg&auto=webp&s=1ebb12e9792e05ed05aaf407da6dffc2ad373c59",
        "You must have taught economic history backwards to say that shit confidently",
        "What was indias GDP 2002 and let's do 1990 first",
        "Not denying what you are saying, just that your previous argument was incorrect.",
        "Then my question is, are we just growing because our work force is growing or there is any value add done my the government?",
        "Ok so did the service sector grow?\n\nhttps://preview.redd.it/mnp4zqdc13ob1.jpeg?width=1080&format=pjpg&auto=webp&s=9bba822f56830e1474feddf73da460fa05e503fb\n\nUPA clearly did much better here too",
        "Gdp growth comes from population growth (which. Is 1%ish) and productivity growth , given our gdp growth rate is higher than 1% we do have some productivity growth because people are doing better jobs. I won’t go into which government did better as I can take either sides by choosing the correct charts to show.",
        "Not at all talking about population growth, talking about workforce growth.",
        "Lol ok, but you do know a rickshaw driver also comes in service sector right, or you just want to say random statements confidently because you have no arguments",
        "Yeah I meant that only, working population",
        "I don’t know the growth in that",
        "Fair, okay. Makes sense. \n\nSo in conclusion, we are growing, but it's not through the ones where most noise is made.",
        "If you think countries bring their poor mass out of poverty by driving rickshaws and don't see the logic behind by comments then you have proved that indeed you have learnt economics backwards",
        "Do you not see the graph? It literally shows how well service sector has been doing after 2014 and I asked you for data since 1990 not 2004",
        "Yep.\nThe real story is that share of services on GDP has grown a lot",
        "Manufacturing is still growing YoY, it’s just that GDP is growing at a faster rate.\n\nThe effects of make in India will be visible in a few more years. So far it hasn’t worked but that doesn’t mean the idea is bad, it’s just the execution that’s terrible because our politicians are idiots.\n\nManufacturing can’t succeed in a corrupt, policy unstable(taxes and policies change on whim), infrastructure lacking country with lots of red tape. These are systemic problems which will require at least a decade more to solve, if ever.",
        "It peaked at 50%, and has dipped since 2020",
        "Bro in all honesty, you are reading this graph wrong.  % of GDP being lower means there are others contributing even more and that still doesn’t mean manufacturing is going down.",
        "Sure, but the numbers are bloated by considering Gig work in service jobs",
        "Service jobs means tech, software, outsourcing, BPO etc",
        "If you know someone with common sense, go show the graph to him/her. They will explain what it means",
        "This chart is basically validating what Raghuram Rajan has been saying. The value add from \"Make in India\" is close to zero or negative thanks to freebies and incentives. If there was a positive influence the rupee would be appreciating, not declining. In fact, the rupee is going to decline further in 2024.\n\nhttps://www.youtube.com/live/t4pd7BVJ5Vw?si=V7idsLmG_NlTO7Po",
        "Precisely, but Govt includes BlinkIt or Amazon Delivery men, Oyo or Rapido Drivers etc. as service sector jobs, which they are not",
        "So, UPA was a more mom corrupt government? There manufacturing was growing steadily and so was GDP.",
        "Were do you see a growth after 2014??????\n\n2019 was a growth only because we stopped all forms of revenue except services. Also our GDP shrunk the most in this world",
        "Why don't you explain why our service industry value add has been stagnant and manufacturing value add to GDP has declined to this level?\n\nhttps://preview.redd.it/5vfss38fw3ob1.png?width=1080&format=pjpg&auto=webp&s=49f28ca4022130f0f2770a4a13690492e6921c9b\n\nScreenshot added for reference",
        "That exactly means Manufacturing is going down. We never calculate absolutes, it's always the growth / degrowth which is noted. \n\nWould you say that we are growing faster than China or not? But in absolute sense, it's still a wet dream for us to reach 10 percent of China's absolute GDP growth",
        "It never peaked in 2019, 2020, the economy shrunk in 2020 and we stopped all other revenue streams, literally and physically. Service value add hasn't grown in India since UPA.\n\nCheck graph for reference\n\nhttps://preview.redd.it/lv8vtq9gx3ob1.png?width=1080&format=pjpg&auto=webp&s=b459cc6ce3c711996ada28dc48c1d8c951b9375f",
        "If you keep comparing wrt to GDP most sectors will go down, since most of our GDP generates through consumption then business spending, neither can generate growth in particular sectors.",
        "Bruh, you are arguing with everyone without knowing stuff. Economics is not that simple as want it to be.\n\nYes, Make in India wasn't implemented in a good way, and yes it's marketing is hyped, but Manufacturing sector is growing yoy since decades, you need to see that graph. You can not use percent contribution of manufacturing to overall GDP to comment on manufacturing sector.",
        "The other guy has already answered this question I won't bother doing again",
        "Man! It looks like you got no idea or a feeling of how a graph works or how to interpret it. \n\nPeople like you are the one who plays with half baked information and spreads it on to others which later gets sealed in the WA University.",
        "The only thing Modi is doing very well is 'Sell India'",
        "Your chart literally shows a massive increase in the percentage of GDP that the service industry contributed except for the COVID years... what are you not following here?",
        "If agricultural output falls or services output falls or exports fall or some combination of all three, but manufacturing remains untouched (because of PSU's), then manufacturing o/p as percentage of GDP will increase. If services do better, but manufacturing stays put, manufacturing o/p as percentage of GDP will decrease. If you want to track manufacturing, see manufacturing numbers in absolute terms, why as a percentage of GDP?",
        "Yes but it's not relative to other sectors or relative to GDP, growth is relative to its own past.",
        "Manufacturing 10, GDP 50 - Percentage 20\n\nManufacturing 15, GDP 80 - Percentage 18.75\n\nDid manufacturing go down? Or Did GDP grow at a faster rate?\n\nManufacturing 10, GDP 50 - Percentage 20\n\nManufacturing 8, GDP 32 - Percentage 25\n\nDid manufacturing go up here?\n\n\nAbsolute and percentages should both be looked at depending on the context. \n\nI dont know whats happening in India but learn some basic math first mate!",
        "Assembling in India!",
        "Its funny how some people on this sub can’t accept the positive aspects of our country and tries to find every small reason to criticize even positive things…the value added in manufacturing sector has grown from $207 billion in 2018 to $244.50 billion in 2023(https://www.statista.com/outlook/io/manufacturing/india ) … so yes manufacturing has grown quite a bit but other parts of the economy has grown even faster which is why the overall manufacturing percentage of gdp has gone down…all in all its a good thing, you don’t want a economy to heavily rely on just manufacturing..you also need a diverse economy with a strong services sector.",
        "Ok so that means Raghuram Rajan is Bang on with his assessment of Make in India being a total failure and a gimmick? \n\nAlso you call a 3.5 percent growth yoy, growth? This is a joke for such a large campaign",
        "Idiot, no one is saying manufacturing is going down, but it's contribution to GDP is going down, and that's the question here, WHY? even after spending billions on subsidy.\n\nWhy are you looking at absolutes? \n\nDon't you think, without make in India campaign, we would have grown our manufacturing to the same levels?",
        "My question on the first place was that, is make in India a failure?\n\nOur revenue mix suggests so, even after giving out so much subsidy, our manufacturing value add to GDP percentage reduces drastically. Which is evident because our GDP is a result of internal consumption, exports are at 20 year lowest\n\nhttps://preview.redd.it/qpp2fy7tn5ob1.png?width=1080&format=pjpg&auto=webp&s=83d62c844033c99bd73c5aab5740912d12e6f18f",
        "Wow. idiot. Good job\n\nSo your entire argument is even if manufacturing goes up, if other components go up more and hence % of gdp goes down, its a problem\n\nNot sure why or whats the argument here, but doesnt take two shillings to guess who’s the idiot here. \n\nAdios Mate. You simmer in your own world!",
        "I have opened some electronic things labelled as Make in India. The innards were totally Chinese made. So, what is made in India is the label claiming the same and maybe they put the case and some screws on  there. Not to be trusted."
    ],
    "cleaned_text": "make india sham keep hearing indias make india initiative flying moon india manufacturing tha ever however isnt reflecting data world bank literally almost year low terms manufacturing value add gdp percentage anyone explain genuine questions views welcome ",
    "cleaned_title": "make india sham",
    "cleaned_selftext": "keep hearing indias make india initiative flying moon india manufacturing tha ever however isnt reflecting data world bank literally almost year low terms manufacturing value add gdp percentage anyone explain genuine questions views welcome",
    "cleaned_comments": "dont want number high anyways high service sector contribution instead working factories make farmers software engineers first comes factories exactly saw service sector contribution skilled intellectuals rest india go percent indians educated beyond th standard cant expect sit plush office bangalore gurgaon code example also would want look absolute numbers want look absolute numbers lets look growth gdp terms absolutes us vs india china vs india im surprised even thinking looking absolute numbers gdp growth calculated cagr lol definition statistics used propaganda except hilarious fail attempt pre indias gdp literally peanuts graph shows well sectors manganese push indian economy okay onwards u want make every thing india screw pollution like china service sector x bigger software engineering sitting plush office restaurants hotels etc also come service sector service sector better manufacturing produce output gdp per hour compared manufacturing sector given last statement would like manufacturing sector contribution go said look absolute numbers make india doesnt mean manufacturing go means would manufactured yeah dont want noise id ideally want skilled intellectual labour country thats unfortunately going happen since percent indians dont education beyond primary th standard absence economy going pushed farming manufacturing even know meaning service sector skilled ones leaving country better life yeah good growth story also p anomaly form value adds stopped due covid gdp shrunk look upa started reached must taught economic history backwards say shit confidently indias gdp lets first denying saying previous argument incorrect question growing work force growing value add done government ok service sector grow upa clearly much better gdp growth comes population growth ish productivity growth given gdp growth rate higher productivity growth people better jobs wont go government better take either sides choosing correct charts show talking population growth talking workforce growth lol ok know rickshaw driver also comes service sector right want say random statements confidently arguments yeah meant working population dont know growth fair okay makes sense conclusion growing ones noise made think countries bring poor mass poverty driving rickshaws dont see logic behind comments proved indeed learnt economics backwards see graph literally shows well service sector asked data since yep real story share services gdp grown lot manufacturing still growing yoy gdp growing faster rate effects make india visible years far hasnt worked doesnt mean idea bad execution thats terrible politicians idiots manufacturing cant succeed corrupt policy unstabletaxes policies change whim infrastructure lacking country lots red tape systemic problems require least decade solve ever peaked dipped since bro honesty reading graph wrong gdp lower means others contributing even still doesnt mean manufacturing going sure numbers bloated considering gig work service jobs service jobs means tech software outsourcing bpo etc know someone common sense go show graph himher explain means chart basically validating raghuram rajan saying value add make india close zero negative thanks freebies incentives positive influence rupee would appreciating declining fact rupee going decline precisely govt includes blinkit amazon delivery men oyo rapido drivers etc service sector jobs upa mom corrupt government manufacturing growing steadily gdp see growth growth stopped forms revenue except services also gdp shrunk world dont explain service industry value add stagnant manufacturing value add gdp declined level screenshot added reference exactly means manufacturing going never calculate absolutes always growth degrowth noted would say growing faster china absolute sense still wet dream us reach percent chinas absolute gdp growth never peaked economy shrunk stopped revenue streams literally physically service value add hasnt grown india since upa check graph reference keep comparing wrt gdp sectors go since gdp generates consumption business spending neither generate growth particular sectors bruh arguing everyone without knowing stuff economics simple want yes make india wasnt implemented good way yes marketing hyped manufacturing sector growing yoy since decades need see graph use percent contribution manufacturing overall gdp comment manufacturing sector guy already answered question wont bother man looks like got idea feeling graph works interpret people like one plays half baked information spreads others later gets sealed wa university thing modi well sell india chart literally shows massive increase percentage gdp service industry contributed except covid years following agricultural output falls services output falls exports fall combination three manufacturing remains untouched psus manufacturing op percentage gdp increase services better manufacturing stays put manufacturing op percentage gdp decrease want track manufacturing see manufacturing numbers absolute terms percentage gdp yes relative sectors relative gdp growth relative past manufacturing gdp percentage manufacturing gdp percentage manufacturing go gdp grow faster rate manufacturing gdp percentage manufacturing gdp percentage manufacturing go absolute percentages looked depending context dont know whats happening india learn basic math first mate assembling india funny people sub cant accept positive aspects country tries find every small reason criticize even positive thingsthe value added manufacturing sector grown billion billion httpswwwstatistacomoutlookiomanufacturingindia yes manufacturing grown quite bit parts economy grown even faster overall manufacturing percentage gdp gone downall good thing dont want economy heavily rely manufacturingyou also need diverse economy strong services sector ok means raghuram rajan bang assessment make india total failure gimmick also call percent growth yoy growth joke large campaign idiot one saying manufacturing going contribution gdp going thats question even spending billions subsidy looking absolutes dont think without make india campaign would grown manufacturing levels question first place make india failure revenue mix suggests even giving much subsidy manufacturing value add gdp percentage reduces drastically evident gdp result internal consumption exports year lowest wow idiot good job entire argument even manufacturing goes components go hence gdp goes problem sure whats argument doesnt take two shillings guess whos idiot adios mate simmer world opened electronic things labelled make india innards totally chinese made made india label claiming maybe put case screws trusted",
    "light_cleaned_title": "Make in India, a sham?",
    "light_cleaned_selftext": "We keep on hearing that India's make in India initiative is flying, we are to the moon, India is manufacturing more tha ever. However the same isn't reflecting in this data of world Bank. We are literally at almost a 45 year low in terms of manufacturing value add to GDP percentage. Can anyone explain why? This is genuine questions all views are welcome.",
    "light_cleaned_comments": "i dont want this number to be high anyways, we should have a high service sector contribution instead of working in factories You cannot make farmers into software engineers first comes the factories And why do you exactly saw that? Service sector contribution is about skilled intellectuals. Where does rest of India go? Only 60 percent of Indians are educated beyond 8th standard, you can't expect them to sit in a plush office in Bangalore or Gurgaon and code (just an example ) Also why would you want to look at absolute numbers? If you want to look at absolute numbers let's look at growth in GDP in terms of absolutes too (US vs India or China vs India) I'm surprised that we are even thinking of looking at absolute numbers when GDP growth is calculated in CAGr Lol this the definition of statistics being used to for propaganda except this is a hilarious fail attempt 🤣 Pre 1990 India's GDP was literally peanuts this graph shows how well other sectors have manganese to push indian economy up Okay so how about 2002 onwards? Why u want to make every thing in india and screw it with pollution like China did Service sector is 100x bigger than just software engineering and that too sitting in a plush office. Restaurants hotels etc also come under service sector. Service sector is better than manufacturing because you produce more output (more GDP) per hour as compared to manufacturing sector. Given this last statement, would you like manufacturing sector contribution to go up or down? And I said to look at absolute numbers because make in India doesn’t mean that % of manufacturing will go up, it’s just means MORE would be manufactured Yeah I don't want to, but what is about all the noise about? I'd ideally want skilled intellectual labour for my country, but that's unfortunately not going to happen since 60 percent of Indians don't have education beyond primary (8th standard) in absence of that, the economy is going to be pushed by farming and manufacturing. Do you even know the meaning of service sector And the skilled ones are leaving the country for better life Yeah, not a good growth story there also :p 2019 was an anomaly because all other form on value adds stopped due to covid and our GDP shrunk. , look at where UPA started in 2004 and where it reached. You must have taught economic history backwards to say that shit confidently What was indias GDP 2002 and let's do 1990 first Not denying what you are saying, just that your previous argument was incorrect. Then my question is, are we just growing because our work force is growing or there is any value add done my the government? Ok so did the service sector grow? UPA clearly did much better here too Gdp growth comes from population growth (which. Is 1%ish) and productivity growth , given our gdp growth rate is higher than 1% we do have some productivity growth because people are doing better jobs. I won’t go into which government did better as I can take either sides by choosing the correct charts to show. Not at all talking about population growth, talking about workforce growth. Lol ok, but you do know a rickshaw driver also comes in service sector right, or you just want to say random statements confidently because you have no arguments Yeah I meant that only, working population I don’t know the growth in that Fair, okay. Makes sense. So in conclusion, we are growing, but it's not through the ones where most noise is made. If you think countries bring their poor mass out of poverty by driving rickshaws and don't see the logic behind by comments then you have proved that indeed you have learnt economics backwards Do you not see the graph? It literally shows how well service sector has been doing after 2014 and I asked you for data since 1990 not 2004 Yep. The real story is that share of services on GDP has grown a lot Manufacturing is still growing YoY, it’s just that GDP is growing at a faster rate. The effects of make in India will be visible in a few more years. So far it hasn’t worked but that doesn’t mean the idea is bad, it’s just the execution that’s terrible because our politicians are idiots. Manufacturing can’t succeed in a corrupt, policy unstable(taxes and policies change on whim), infrastructure lacking country with lots of red tape. These are systemic problems which will require at least a decade more to solve, if ever. It peaked at 50%, and has dipped since 2020 Bro in all honesty, you are reading this graph wrong. % of GDP being lower means there are others contributing even more and that still doesn’t mean manufacturing is going down. Sure, but the numbers are bloated by considering Gig work in service jobs Service jobs means tech, software, outsourcing, BPO etc If you know someone with common sense, go show the graph to him/her. They will explain what it means This chart is basically validating what Raghuram Rajan has been saying. The value add from \"Make in India\" is close to zero or negative thanks to freebies and incentives. If there was a positive influence the rupee would be appreciating, not declining. In fact, the rupee is going to decline further in 2024. Precisely, but Govt includes BlinkIt or Amazon Delivery men, Oyo or Rapido Drivers etc. as service sector jobs, which they are not So, UPA was a more mom corrupt government? There manufacturing was growing steadily and so was GDP. Were do you see a growth after 2014?????? 2019 was a growth only because we stopped all forms of revenue except services. Also our GDP shrunk the most in this world Why don't you explain why our service industry value add has been stagnant and manufacturing value add to GDP has declined to this level? Screenshot added for reference That exactly means Manufacturing is going down. We never calculate absolutes, it's always the growth / degrowth which is noted. Would you say that we are growing faster than China or not? But in absolute sense, it's still a wet dream for us to reach 10 percent of China's absolute GDP growth It never peaked in 2019, 2020, the economy shrunk in 2020 and we stopped all other revenue streams, literally and physically. Service value add hasn't grown in India since UPA. Check graph for reference If you keep comparing wrt to GDP most sectors will go down, since most of our GDP generates through consumption then business spending, neither can generate growth in particular sectors. Bruh, you are arguing with everyone without knowing stuff. Economics is not that simple as want it to be. Yes, Make in India wasn't implemented in a good way, and yes it's marketing is hyped, but Manufacturing sector is growing yoy since decades, you need to see that graph. You can not use percent contribution of manufacturing to overall GDP to comment on manufacturing sector. The other guy has already answered this question I won't bother doing again Man! It looks like you got no idea or a feeling of how a graph works or how to interpret it. People like you are the one who plays with half baked information and spreads it on to others which later gets sealed in the WA University. The only thing Modi is doing very well is 'Sell India' Your chart literally shows a massive increase in the percentage of GDP that the service industry contributed except for the COVID years... what are you not following here? If agricultural output falls or services output falls or exports fall or some combination of all three, but manufacturing remains untouched (because of PSU's), then manufacturing o/p as percentage of GDP will increase. If services do better, but manufacturing stays put, manufacturing o/p as percentage of GDP will decrease. If you want to track manufacturing, see manufacturing numbers in absolute terms, why as a percentage of GDP? Yes but it's not relative to other sectors or relative to GDP, growth is relative to its own past. Manufacturing 10, GDP 50 - Percentage 20 Manufacturing 15, GDP 80 - Percentage 18.75 Did manufacturing go down? Or Did GDP grow at a faster rate? Manufacturing 10, GDP 50 - Percentage 20 Manufacturing 8, GDP 32 - Percentage 25 Did manufacturing go up here? Absolute and percentages should both be looked at depending on the context. I dont know whats happening in India but learn some basic math first mate! Assembling in India! Its funny how some people on this sub can’t accept the positive aspects of our country and tries to find every small reason to criticize even positive things…the value added in manufacturing sector has grown from $207 billion in 2018 to $244.50 billion in 2023(https://www.statista.com/outlook/io/manufacturing/india ) … so yes manufacturing has grown quite a bit but other parts of the economy has grown even faster which is why the overall manufacturing percentage of gdp has gone down…all in all its a good thing, you don’t want a economy to heavily rely on just manufacturing..you also need a diverse economy with a strong services sector. Ok so that means Raghuram Rajan is Bang on with his assessment of Make in India being a total failure and a gimmick? Also you call a 3.5 percent growth yoy, growth? This is a joke for such a large campaign Idiot, no one is saying manufacturing is going down, but it's contribution to GDP is going down, and that's the question here, WHY? even after spending billions on subsidy. Why are you looking at absolutes? Don't you think, without make in India campaign, we would have grown our manufacturing to the same levels? My question on the first place was that, is make in India a failure? Our revenue mix suggests so, even after giving out so much subsidy, our manufacturing value add to GDP percentage reduces drastically. Which is evident because our GDP is a result of internal consumption, exports are at 20 year lowest Wow. idiot. Good job So your entire argument is even if manufacturing goes up, if other components go up more and hence % of gdp goes down, its a problem Not sure why or whats the argument here, but doesnt take two shillings to guess who’s the idiot here. Adios Mate. You simmer in your own world! I have opened some electronic things labelled as Make in India. The innards were totally Chinese made. So, what is made in India is the label claiming the same and maybe they put the case and some screws on there. Not to be trusted."
}