{
    "id": "19ekw7z",
    "title": "Karnataka man detained for posting edited pic of Ram Mandir with Pakistani flag - India Today",
    "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-man-detained-posting-edited-pic-ram-mandir-pakistani-flag-babri-masjid-2492104-2024-01-22",
    "selftext": "\nSo much for freedom of speech.",
    "flair": "Law & Courts",
    "score": 73,
    "num_comments": 39,
    "created_utc": 1706113261.0,
    "convurl": "https://external-preview.redd.it/togW2P8Aa7h-9RVl74CoCrNxrU7eJrNcSPSw4g1ydE8.jpg?auto=webp&s=20a5c53cde8b067e24ce9df53d7609adb06ec705",
    "comments": [
        "Read the fucking room, Karnataka man",
        "> So much for freedom of speech\n\nOh, irony",
        "Stupid",
        "Ah the consequences of your own actions",
        "Setup for election 2029 has begun.",
        "The article doesn’t say, what is the charge?",
        "Consequences of your own actions? Who the fuck opted for a totalitarian fascist dictatorship? ",
        "We use the words too lightly don’t we? I don’t think we would have unrestricted Internet access in a dictatorship.",
        "Terrorism /s",
        "Are you supporting his detention?",
        "Wait why the fuck is this happening in an Congress state?",
        "That BJP is a totalitarian party vs what the man did was totally uncalled for can be two separate things. You don't have to cry 'dictatorship' over everything. It was a stupid, stupid thing to do and post. And you would think one would know the repercussions beforehand.",
        "Congress isn’t worth anything. As long as they want the Gandhi family in charge they’ll never be a real opposition party.",
        "Dictatorship is when I don't get unrestricted internet access wah wah",
        "see...this is the issue. Just because \"you\" have unrestricted internet access doesn't mean everyone else does.\n\nIndia ranks amongst the worst in internet freedom and is not something recent, I got to know about it when my friend used to work for Software Freedom Law Centre back in 2015 (Congress also did the same, BJP has doubled down with the new laws).\n\nYou think people are fighting BJP but they don't care who's in power, they will fight the government for civil rights.",
        "Calling a Congress ruled state a totalitarian fascist dictatorship. My my my……………..",
        "I don't see why ppl defending him",
        "We're not a serious country if we can't tolerate a bit of minority dissent.",
        "> we would have unrestricted Internet access\n\nWe don't.",
        "Should be “charged with life with stupid” (sent to pakistan)",
        "Clear attempt to incite violence and disrupt harmony. Good job Karnataka police.",
        "Clear attempt to incite violence and disrupt harmony. Good job Karnataka police.",
        "Are you justifying his action?",
        "Does he deserve detention for this? I think not.",
        "To ve fair, that IS inciting violence. I have no sympathy for hate mongerers, but if he gets UAPA, it would be wrong",
        "Aa bael mujhe maar.\n\n(Come bull, hit me.)",
        "Why are people supporting him. His intention was to incite hate and violence. He should be detained. Freedom of speech does not mean you can share morphed images to incite riots .",
        "plus i’m 99% sure this dude will just get a slap in the hand (hopefully face) and released in two weeks."
    ],
    "cleaned_text": "karnataka man detained posting edited pic ram mandir pakistani flag india today much freedom speech ",
    "cleaned_title": "karnataka man detained posting edited pic ram mandir pakistani flag india today",
    "cleaned_selftext": "much freedom speech",
    "cleaned_comments": "read fucking room karnataka man much freedom speech oh irony stupid ah consequences actions setup election begun article doesnt say charge consequences actions fuck opted totalitarian fascist dictatorship use words lightly dont dont think would unrestricted internet access dictatorship terrorism supporting detention wait fuck happening congress state bjp totalitarian party vs man totally uncalled two separate things dont cry dictatorship everything stupid stupid thing post would think one would know repercussions beforehand congress isnt worth anything long want gandhi family charge theyll never real opposition party dictatorship dont get unrestricted internet access wah wah seethis issue unrestricted internet access doesnt mean everyone else india ranks amongst worst internet freedom something recent got know friend used work software freedom law centre back congress also bjp doubled new laws think people fighting bjp dont care whos power fight government civil rights calling congress ruled state totalitarian fascist dictatorship dont see ppl defending serious country cant tolerate bit minority dissent would unrestricted internet access dont charged life stupid sent pakistan clear attempt incite violence disrupt harmony good job karnataka police clear attempt incite violence disrupt harmony good job karnataka police justifying action deserve detention think fair inciting violence sympathy hate mongerers gets uapa would wrong aa bael mujhe maar come bull hit people supporting intention incite hate violence detained freedom speech mean share morphed images incite riots plus im sure dude get slap hand hopefully face released two weeks",
    "light_cleaned_title": "Karnataka man detained for posting edited pic of Ram Mandir with Pakistani flag - India Today",
    "light_cleaned_selftext": "So much for freedom of speech.",
    "light_cleaned_comments": "Read the fucking room, Karnataka man > So much for freedom of speech Oh, irony Stupid Ah the consequences of your own actions Setup for election 2029 has begun. The article doesn’t say, what is the charge? Consequences of your own actions? Who the fuck opted for a totalitarian fascist dictatorship? We use the words too lightly don’t we? I don’t think we would have unrestricted Internet access in a dictatorship. Terrorism /s Are you supporting his detention? Wait why the fuck is this happening in an Congress state? That BJP is a totalitarian party vs what the man did was totally uncalled for can be two separate things. You don't have to cry 'dictatorship' over everything. It was a stupid, stupid thing to do and post. And you would think one would know the repercussions beforehand. Congress isn’t worth anything. As long as they want the Gandhi family in charge they’ll never be a real opposition party. Dictatorship is when I don't get unrestricted internet access wah wah see...this is the issue. Just because \"you\" have unrestricted internet access doesn't mean everyone else does. India ranks amongst the worst in internet freedom and is not something recent, I got to know about it when my friend used to work for Software Freedom Law Centre back in 2015 (Congress also did the same, BJP has doubled down with the new laws). You think people are fighting BJP but they don't care who's in power, they will fight the government for civil rights. Calling a Congress ruled state a totalitarian fascist dictatorship. My my my…………….. I don't see why ppl defending him We're not a serious country if we can't tolerate a bit of minority dissent. > we would have unrestricted Internet access We don't. Should be “charged with life with stupid” (sent to pakistan) Clear attempt to incite violence and disrupt harmony. Good job Karnataka police. Clear attempt to incite violence and disrupt harmony. Good job Karnataka police. Are you justifying his action? Does he deserve detention for this? I think not. To ve fair, that IS inciting violence. I have no sympathy for hate mongerers, but if he gets UAPA, it would be wrong Aa bael mujhe maar. (Come bull, hit me.) Why are people supporting him. His intention was to incite hate and violence. He should be detained. Freedom of speech does not mean you can share morphed images to incite riots . plus i’m 99% sure this dude will just get a slap in the hand (hopefully face) and released in two weeks."
}