{
    "id": "1bh39ap",
    "title": "This is our whole reputation. Viswaguru my a**",
    "url": "https://i.redd.it/p6g2sgbijxoc1.jpeg",
    "selftext": "They only see us as scammers and nothing else. If Gobiji really wants India to have a better reputation he should start a crackdown on such crimes ! ",
    "flair": "Rant / Vent",
    "score": 12,
    "num_comments": 8,
    "created_utc": 1710696674.0,
    "convurl": "https://i.redd.it/p6g2sgbijxoc1.jpeg",
    "comments": [
        "They are American 'conservatives', so basically Republicans. Racism runs in their veins. What else did you expect?",
        "Indians cares more about what white people think about us than the actual problems we have.",
        "They're basically BJP and their supporters.",
        "Apparently,most of these rw guys in india support the conservatives.",
        "Unrelated but how is this a win for Indian Scammers, Sharia law an",
        "So these types of online scams not only happen from india , these types of scams happen more in large scale with big gigantic hacking teams in china ,Thailand,taiwan like countries.\nThey usually really hack accounts and then they scam people money but in India all the scams are either done by UPI (lottery or need help )or saying download mirroring app. So Indian scammers are not legitimate scammers that's why foreign youtubers can track them easily, if they had a little bit of real knowledge of hacking then those foreign youtubers can never caught them. And because foreign youtubers can't catch Chinese or Asian hackers except India , they make content out of poor small scammers and they usually Target India cause all over the world people like to hear bad things about India , by doing this foreign youtubers get millions of views.\n\nIt's just a delusion created by foreign scam finding youtuber that India scams the most . And India is really big if you compare these types of scam per capita I can assure you that our India's scammers number is less than usa in terms of scammers per capita 😂."
    ],
    "cleaned_text": "whole reputation viswaguru see us scammers nothing else gobiji really wants india better reputation start crackdown crimes ",
    "cleaned_title": "whole reputation viswaguru",
    "cleaned_selftext": "see us scammers nothing else gobiji really wants india better reputation start crackdown crimes",
    "cleaned_comments": "american conservatives basically republicans racism runs veins else expect indians cares white people think us actual problems theyre basically bjp supporters apparentlymost rw guys india support conservatives unrelated win indian scammers sharia law types online scams happen india types scams happen large scale big gigantic hacking teams china thailandtaiwan like countries usually really hack accounts scam people money india scams either done upi lottery need help saying download mirroring app indian scammers legitimate scammers thats foreign youtubers track easily little bit real knowledge hacking foreign youtubers never caught foreign youtubers cant catch chinese asian hackers except india make content poor small scammers usually target india cause world people like hear bad things india foreign youtubers get millions views delusion created foreign scam finding youtuber india scams india really big compare types scam per capita assure indias scammers number less usa terms scammers per capita",
    "light_cleaned_title": "This is our whole reputation. Viswaguru my a**",
    "light_cleaned_selftext": "They only see us as scammers and nothing else. If Gobiji really wants India to have a better reputation he should start a crackdown on such crimes !",
    "light_cleaned_comments": "They are American 'conservatives', so basically Republicans. Racism runs in their veins. What else did you expect? Indians cares more about what white people think about us than the actual problems we have. They're basically BJP and their supporters. Apparently,most of these rw guys in india support the conservatives. Unrelated but how is this a win for Indian Scammers, Sharia law an So these types of online scams not only happen from india , these types of scams happen more in large scale with big gigantic hacking teams in china ,Thailand,taiwan like countries. They usually really hack accounts and then they scam people money but in India all the scams are either done by UPI (lottery or need help )or saying download mirroring app. So Indian scammers are not legitimate scammers that's why foreign youtubers can track them easily, if they had a little bit of real knowledge of hacking then those foreign youtubers can never caught them. And because foreign youtubers can't catch Chinese or Asian hackers except India , they make content out of poor small scammers and they usually Target India cause all over the world people like to hear bad things about India , by doing this foreign youtubers get millions of views. It's just a delusion created by foreign scam finding youtuber that India scams the most . And India is really big if you compare these types of scam per capita I can assure you that our India's scammers number is less than usa in terms of scammers per capita 😂."
}