{
    "id": "17plx08",
    "title": "Murders by Mining Mafia in India",
    "url": "https://www.reddit.com/r/india/comments/17plx08/murders_by_mining_mafia_in_india/",
    "selftext": "After the recent murder of geologist [**Prathima KS**](https://timesofindia.indiatimes.com/city/bengaluru/karnataka-official-who-took-on-mining-mafia-killed-in-bengaluru-home/articleshow/104995400.cms) who cracked down on illegal mining and sand mafia in Karnataka. I wanted to highlight a few lesser know heroes who were murdered while opposing Mining Mafia in India.\n\n[**D.K. Ravi**](https://en.wikipedia.org/wiki/D._K._Ravi)\n\nHe was an IAS officer who did a crackdown against the encroachment of government lands and rampant illegal sand mining in the Kolar district of Karnataka. He also prepared a list of the top 50 tax defaulters and set a target of ₹1,000 crore in tax collection from the tax-evading defaulters, who were mostly powerful real estate developers and politicians. Also had collected over ₹138 crore tax in the first two weeks.\n\nHe was transferred from Kolar to Bangalore and was found hanging on March 16, 2015, after a short while.\n\n[**Sandeep Kothari**](https://en.wikipedia.org/wiki/Murder_of_Sandeep_Kothari)\n\nHe was a freelance investigative crime journalist from Balaghat District, Madhya Pradesh. His reports exposed the sand mafia and illegal mining activities in Madhya Pradesh. He informed the police of the death threats he received. He also had 19 false accusations on record at various police stations.\n\nOn June 19, 2015, he was abducted, beaten, strangled, and then burned alive near a railway track in Butibori, Maharashtra.\n\n[**Surender Singh**](https://timesofindia.indiatimes.com/city/gurgaon/haryana-dsp-murder-police-arrest-truck-driver-who-mowed-down-surender-singh/articleshow/93010394.cms)\n\nHe was a DSP in the Haryana police. He was investigating illegal stone mining in Haryana's Nuh district.\n\nOn July 19, 2023, he was mowed down by a truck when he went to stop illegal mining in the Aravalli Hills near Pachgaon, Haryana.\n\n[**Lourdhu Francis**](https://www.thehindu.com/news/national/tamil-nadu/sand-mining-mafia-murder-village-administrative-officer-inside-his-office-in-thoothukudi-district/article66777090.ece)\n\nHe was Village Administrative Officer (VAO) of Murappanadu in Thoothukudi district, Tamil Nadu. He was informing the police and his higher-ups about the illegal sand miners operating in the area.\n\nOn April 25, 2023, he was hacked to death at his office.\n\n&#x200B;\n\n**Many more people have gone down while fighting various Mining Mafia in India. I regard their efforts the same as martyred soldiers. The least we can do is to know and respect them.**\n\nPS: Sources are added as hyperlinks on respective names.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**Edit:** Here are few more heroes with respective article who were killed while fighting mining mafias.\n\n[Sonu Chowdhary, June 2019, Uttar Pradesh.](https://www.indiatoday.in/india/story/agra-police-accelerate-probe-into-illegal-sand-mining-after-sand-mafia-crushes-constable-to-death-1739471-2020-11-09)\n\n[A. Kishan, 19 August 2022, Andhra Pradesh.](https://www.telugu360.com/sand-mafia-kills-innocent-for-questioning-illegal-mining-in-chittoor-of-ap-2/)\n\n[Narendra Balia, 6 October 2022, Gujrat.](https://www.oneindia.com/ahmedabad/gujarat-rti-activist-injured-son-killed-by-illegal-sand-mafia-3470868.html)\n\n[Sangeeth, 24 January, 2020, Kerala](https://www.newindianexpress.com/cities/thiruvananthapuram/2020/jan/24/sand-mafia-jcb-knocks-down-man-in-thiruvananthapuram-for-resisting-mining-from-his-land-2093934.html)\n\n[Chandrika Rai and Family, 19th Feb 2012, Madhya Pradesh.](https://www.thehindu.com/news/national/other-states/journalist-family-murdered-hand-of-mining-mafia-suspected/article2910400.ece)\n\n&#x200B;\n\n**List Goes On......**",
    "flair": "Crime",
    "score": 1166,
    "num_comments": 43,
    "created_utc": 1699329823.0,
    "convurl": "https://external-preview.redd.it/O9E86O39xBRAKpBdu8Mob9N7uA40G1l4y3USxzpa_Go.jpg?auto=webp&s=345e0b6bafd9b380e3e3212fb8fcb8703d1b7d70",
    "comments": [
        "Proud of such people. Nation needs more such heroes!!",
        "Thanks for sharing",
        "Or someone who can save these heroes.",
        "Agreed 😞",
        "The nation absolutely needs more heroes like this, but cannot even protect them. This is a list of dead people. We can't be asking for more dead heroes if we cannot protect them.\n\nThe higher-ups in the government are always involved with the mafia itself. When the whole body is corrupt, and it encounters a clean cell, it's either going to corrupt it or kill it.",
        "The mining mafia, sand mafia, water mafia, oil mafia everyone are hand in glove with police, govt officers, and most importantly politicians. It's sad that government officers who choose honesty aren't supported by anyone and face harassment and get killed like this. It's a crime to be honest in this country.",
        "You are right. The unholy bond of corruption and politicians is the root cause which sadly is not going to go very soon because the government seems to be unwilling to take any action on corruption and frame policies.",
        "These illegal mining mafias should be hanged and moved down instead. What is our government doing? Sleeping?",
        "Personally profiting from the mafia activities",
        "Real heroes!!\nSalute",
        "Thanks for sharing OP. \nThe question that arises… what can we do about/ prevent this in the future?",
        "If someone understands Kannada here are more links about those happening in coastal area \n\nhttps://youtu.be/REkRGsBO7jk?si=FR5RBnP7BqQ9KRul\n\nhttps://youtu.be/MzW0Vzdy-uM?si=vTy26c6D7CXHYhpt\n\nhttps://youtu.be/wjVeg0ydSSk?si=5ZIJrWYItFKumth9",
        "Honesty may not be the best policy in India, if you want to live.",
        "Sad to see that so many officers are trying to prevent illegal stuff and punished for this; why is the media not covering this mining mafia and these murders 😞",
        "Honesty and doing duty in civil service in India is impossible. Politicians are judge, jury and executioner.",
        "Start by removing any politician with criminal cases against them from power which is impossible.",
        "thank you for sharing",
        "Why ?\n\nSo that more people can get murdered ?",
        "And you forgot private construction companies in your list,  (many big players like L&T, Tata, Punj Loyd etc) \n\n\nThey all work together.",
        "Even if you want to be an honest officer in India it’s impossible",
        "Didn't this woman file a report on some illegal activity by a bjp mla?",
        "The fact that IAS and IPS officers are getting murdered isn't very reassuring for common public like us, those protecting us arent safe",
        "And judiciary.",
        "as per the latest news report she was murdered by her ex driver who was fired a few days ago from work by her.",
        "Wonderfully done OP! Kudos! Post it on Twitter. I want to share.",
        "To be killed?",
        "The data you shared sounded like movie script literally.... can't even imagine for people who have to actually go through it 😔",
        "We will have like a grand total of 3 politicians left in the country if that happens",
        "Don't know if this is relavent to the discussion My maternal uncle was a COO or something  for a very big construction company and he has been kidnapped 3 times while he was going to the construction site by the local gangsters asking for their cut to let them build the buildings",
        "Mining is like free money. Why wouldnt* people kill for it",
        "Well, change for a better future needs to start some day.\n\nWhy not today!!",
        "Even better. India needs brilliant minds not uneducated illinformed goons as politicians aka people's representatives.",
        "Damn! Thanks for sharing",
        "For those who think how powerful is sand mafia,\n\nJust check the revenue collection of Punjab Govt. and the share of retta(Sand) mining",
        "Yeah ....",
        "Sadly there was a journalist too in the above list. People who cover these things will go missing or end up of dead. Unless you are politically powerful nothing can be said or done by common man",
        "***List Goes On......*** \n\nThe list will be much much longer if you add the urban land mafia in the mix!",
        "The crackdown has to come from top. Brutally arrest politicians and execute the corrupt ones like China does.",
        "All parties are involved, all leaders are involved. Even the environmentalists who condemn it out in the open are in it for a commission, the police officers are in on it, the community is on it because it’s easy money. That green board which is created to review the effects of mining can be bought for the right price. The government officers who are experts are in on it. The common man cannot do shit about it and that’s the truth.",
        "Now there are andh bhakts on both sides who will criticize this party that party etc. but at the end of the day we as a citizen of this country are losers",
        "India needs a more autocratic government like Singapore where law and offset is taken extremely seriously"
    ],
    "cleaned_text": "murders mining mafia india recent murder geologist prathima kshttpstimesofindiaindiatimescomcitybengalurukarnatakaofficialwhotookonminingmafiakilledinbengaluruhomearticleshowcms cracked illegal mining sand mafia karnataka wanted highlight lesser know heroes murdered opposing mining mafia india dk ravihttpsenwikipediaorgwikidkravi ias officer crackdown encroachment government lands rampant illegal sand mining kolar district karnataka also prepared list top tax defaulters set target crore tax collection taxevading defaulters mostly powerful real estate developers politicians also collected crore tax first two weeks transferred kolar bangalore found hanging march short sandeep kotharihttpsenwikipediaorgwikimurderofsandeepkothari freelance investigative crime journalist balaghat district madhya pradesh reports exposed sand mafia illegal mining activities madhya pradesh informed police death threats received also false accusations record various police stations june abducted beaten strangled burned alive near railway track butibori maharashtra surender singhhttpstimesofindiaindiatimescomcitygurgaonharyanadspmurderpolicearresttruckdriverwhomoweddownsurendersingharticleshowcms dsp haryana police investigating illegal stone mining haryanas nuh district july mowed truck went stop illegal mining aravalli hills near pachgaon haryana lourdhu francishttpswwwthehinducomnewsnationaltamilnadusandminingmafiamurdervillageadministrativeofficerinsidehisofficeinthoothukudidistrictarticleece village administrative officer vao murappanadu thoothukudi district tamil nadu informing police higherups illegal sand miners operating area april hacked death office xb many people gone fighting various mining mafia india regard efforts martyred soldiers least know respect ps sources added hyperlinks respective names xb xb xb xb xb edit heroes respective article killed fighting mining mafias sonu chowdhary june uttar pradeshhttpswwwindiatodayinindiastoryagrapoliceaccelerateprobeintoillegalsandminingaftersandmafiacrushesconstabletodeath kishan august andhra pradeshhttpswwwtelugucomsandmafiakillsinnocentforquestioningillegalmininginchittoorofap narendra balia october gujrathttpswwwoneindiacomahmedabadgujaratrtiactivistinjuredsonkilledbyillegalsandmafiahtml sangeeth january keralahttpswwwnewindianexpresscomcitiesthiruvananthapuramjansandmafiajcbknocksdownmaninthiruvananthapuramforresistingminingfromhislandhtml chandrika rai family th feb madhya pradeshhttpswwwthehinducomnewsnationalotherstatesjournalistfamilymurderedhandofminingmafiasuspectedarticleece xb list goes ",
    "cleaned_title": "murders mining mafia india",
    "cleaned_selftext": "recent murder geologist prathima kshttpstimesofindiaindiatimescomcitybengalurukarnatakaofficialwhotookonminingmafiakilledinbengaluruhomearticleshowcms cracked illegal mining sand mafia karnataka wanted highlight lesser know heroes murdered opposing mining mafia india dk ravihttpsenwikipediaorgwikidkravi ias officer crackdown encroachment government lands rampant illegal sand mining kolar district karnataka also prepared list top tax defaulters set target crore tax collection taxevading defaulters mostly powerful real estate developers politicians also collected crore tax first two weeks transferred kolar bangalore found hanging march short sandeep kotharihttpsenwikipediaorgwikimurderofsandeepkothari freelance investigative crime journalist balaghat district madhya pradesh reports exposed sand mafia illegal mining activities madhya pradesh informed police death threats received also false accusations record various police stations june abducted beaten strangled burned alive near railway track butibori maharashtra surender singhhttpstimesofindiaindiatimescomcitygurgaonharyanadspmurderpolicearresttruckdriverwhomoweddownsurendersingharticleshowcms dsp haryana police investigating illegal stone mining haryanas nuh district july mowed truck went stop illegal mining aravalli hills near pachgaon haryana lourdhu francishttpswwwthehinducomnewsnationaltamilnadusandminingmafiamurdervillageadministrativeofficerinsidehisofficeinthoothukudidistrictarticleece village administrative officer vao murappanadu thoothukudi district tamil nadu informing police higherups illegal sand miners operating area april hacked death office xb many people gone fighting various mining mafia india regard efforts martyred soldiers least know respect ps sources added hyperlinks respective names xb xb xb xb xb edit heroes respective article killed fighting mining mafias sonu chowdhary june uttar pradeshhttpswwwindiatodayinindiastoryagrapoliceaccelerateprobeintoillegalsandminingaftersandmafiacrushesconstabletodeath kishan august andhra pradeshhttpswwwtelugucomsandmafiakillsinnocentforquestioningillegalmininginchittoorofap narendra balia october gujrathttpswwwoneindiacomahmedabadgujaratrtiactivistinjuredsonkilledbyillegalsandmafiahtml sangeeth january keralahttpswwwnewindianexpresscomcitiesthiruvananthapuramjansandmafiajcbknocksdownmaninthiruvananthapuramforresistingminingfromhislandhtml chandrika rai family th feb madhya pradeshhttpswwwthehinducomnewsnationalotherstatesjournalistfamilymurderedhandofminingmafiasuspectedarticleece xb list goes",
    "cleaned_comments": "proud people nation needs heroes thanks sharing someone save heroes agreed nation absolutely needs heroes like even protect list dead people cant asking dead heroes protect higherups government always involved mafia whole body corrupt encounters clean cell either going corrupt kill mining mafia sand mafia water mafia oil mafia everyone hand glove police govt officers importantly politicians sad government officers choose honesty arent supported anyone face harassment get killed like crime honest country right unholy bond corruption politicians root cause sadly going go soon government seems unwilling take action corruption frame policies illegal mining mafias hanged moved instead government sleeping personally profiting mafia activities real heroes salute thanks sharing op question arises prevent future someone understands kannada links happening coastal area honesty may best policy india want live sad see many officers trying prevent illegal stuff punished media covering mining mafia murders honesty duty civil service india impossible politicians judge jury executioner start removing politician criminal cases power impossible thank sharing people get murdered forgot private construction companies list many big players like lt tata punj loyd etc work together even want honest officer india impossible didnt woman file report illegal activity bjp mla fact ias ips officers getting murdered isnt reassuring common public like us protecting us arent safe judiciary per latest news report murdered ex driver fired days ago work wonderfully done op kudos post twitter want share killed data shared sounded like movie script literally cant even imagine people actually go like grand total politicians left country happens dont know relavent discussion maternal uncle coo something big construction company kidnapped times going construction site local gangsters asking cut let build buildings mining like free money wouldnt people kill well change better future needs start day today even better india needs brilliant minds uneducated illinformed goons politicians aka peoples representatives damn thanks sharing think powerful sand mafia check revenue collection punjab govt share rettasand mining yeah sadly journalist list people cover things go missing end dead unless politically powerful nothing said done common man list goes list much much longer add urban land mafia mix crackdown come top brutally arrest politicians execute corrupt ones like china parties involved leaders involved even environmentalists condemn open commission police officers community easy money green board created review effects mining bought right price government officers experts common man shit thats truth andh bhakts sides criticize party party etc end day citizen country losers india needs autocratic government like singapore law offset taken extremely seriously",
    "light_cleaned_title": "Murders by Mining Mafia in India",
    "light_cleaned_selftext": "After the recent murder of geologist [**Prathima KS**](https://timesofindia.indiatimes.com/city/bengaluru/karnataka-official-who-took-on-mining-mafia-killed-in-bengaluru-home/articleshow/104995400.cms) who cracked down on illegal mining and sand mafia in Karnataka. I wanted to highlight a few lesser know heroes who were murdered while opposing Mining Mafia in India. [**D.K. Ravi**](https://en.wikipedia.org/wiki/D._K._Ravi) He was an IAS officer who did a crackdown against the encroachment of government lands and rampant illegal sand mining in the Kolar district of Karnataka. He also prepared a list of the top 50 tax defaulters and set a target of ₹1,000 crore in tax collection from the tax-evading defaulters, who were mostly powerful real estate developers and politicians. Also had collected over ₹138 crore tax in the first two weeks. He was transferred from Kolar to Bangalore and was found hanging on March 16, 2015, after a short while. [**Sandeep Kothari**](https://en.wikipedia.org/wiki/Murder_of_Sandeep_Kothari) He was a freelance investigative crime journalist from Balaghat District, Madhya Pradesh. His reports exposed the sand mafia and illegal mining activities in Madhya Pradesh. He informed the police of the death threats he received. He also had 19 false accusations on record at various police stations. On June 19, 2015, he was abducted, beaten, strangled, and then burned alive near a railway track in Butibori, Maharashtra. [**Surender Singh**](https://timesofindia.indiatimes.com/city/gurgaon/haryana-dsp-murder-police-arrest-truck-driver-who-mowed-down-surender-singh/articleshow/93010394.cms) He was a DSP in the Haryana police. He was investigating illegal stone mining in Haryana's Nuh district. On July 19, 2023, he was mowed down by a truck when he went to stop illegal mining in the Aravalli Hills near Pachgaon, Haryana. [**Lourdhu Francis**](https://www.thehindu.com/news/national/tamil-nadu/sand-mining-mafia-murder-village-administrative-officer-inside-his-office-in-thoothukudi-district/article66777090.ece) He was Village Administrative Officer (VAO) of Murappanadu in Thoothukudi district, Tamil Nadu. He was informing the police and his higher-ups about the illegal sand miners operating in the area. On April 25, 2023, he was hacked to death at his office. &#x200B; **Many more people have gone down while fighting various Mining Mafia in India. I regard their efforts the same as martyred soldiers. The least we can do is to know and respect them.** PS: Sources are added as hyperlinks on respective names. &#x200B; &#x200B; &#x200B; &#x200B; &#x200B; **Edit:** Here are few more heroes with respective article who were killed while fighting mining mafias. [Sonu Chowdhary, June 2019, Uttar Pradesh.](https://www.indiatoday.in/india/story/agra-police-accelerate-probe-into-illegal-sand-mining-after-sand-mafia-crushes-constable-to-death-1739471-2020-11-09) [A. Kishan, 19 August 2022, Andhra Pradesh.](https://www.telugu360.com/sand-mafia-kills-innocent-for-questioning-illegal-mining-in-chittoor-of-ap-2/) [Narendra Balia, 6 October 2022, Gujrat.](https://www.oneindia.com/ahmedabad/gujarat-rti-activist-injured-son-killed-by-illegal-sand-mafia-3470868.html) [Sangeeth, 24 January, 2020, Kerala](https://www.newindianexpress.com/cities/thiruvananthapuram/2020/jan/24/sand-mafia-jcb-knocks-down-man-in-thiruvananthapuram-for-resisting-mining-from-his-land-2093934.html) [Chandrika Rai and Family, 19th Feb 2012, Madhya Pradesh.](https://www.thehindu.com/news/national/other-states/journalist-family-murdered-hand-of-mining-mafia-suspected/article2910400.ece) &#x200B; **List Goes On......**",
    "light_cleaned_comments": "Proud of such people. Nation needs more such heroes!! Thanks for sharing Or someone who can save these heroes. Agreed 😞 The nation absolutely needs more heroes like this, but cannot even protect them. This is a list of dead people. We can't be asking for more dead heroes if we cannot protect them. The higher-ups in the government are always involved with the mafia itself. When the whole body is corrupt, and it encounters a clean cell, it's either going to corrupt it or kill it. The mining mafia, sand mafia, water mafia, oil mafia everyone are hand in glove with police, govt officers, and most importantly politicians. It's sad that government officers who choose honesty aren't supported by anyone and face harassment and get killed like this. It's a crime to be honest in this country. You are right. The unholy bond of corruption and politicians is the root cause which sadly is not going to go very soon because the government seems to be unwilling to take any action on corruption and frame policies. These illegal mining mafias should be hanged and moved down instead. What is our government doing? Sleeping? Personally profiting from the mafia activities Real heroes!! Salute Thanks for sharing OP. The question that arises… what can we do about/ prevent this in the future? If someone understands Kannada here are more links about those happening in coastal area Honesty may not be the best policy in India, if you want to live. Sad to see that so many officers are trying to prevent illegal stuff and punished for this; why is the media not covering this mining mafia and these murders 😞 Honesty and doing duty in civil service in India is impossible. Politicians are judge, jury and executioner. Start by removing any politician with criminal cases against them from power which is impossible. thank you for sharing Why ? So that more people can get murdered ? And you forgot private construction companies in your list, (many big players like L&T, Tata, Punj Loyd etc) They all work together. Even if you want to be an honest officer in India it’s impossible Didn't this woman file a report on some illegal activity by a bjp mla? The fact that IAS and IPS officers are getting murdered isn't very reassuring for common public like us, those protecting us arent safe And judiciary. as per the latest news report she was murdered by her ex driver who was fired a few days ago from work by her. Wonderfully done OP! Kudos! Post it on Twitter. I want to share. To be killed? The data you shared sounded like movie script literally.... can't even imagine for people who have to actually go through it 😔 We will have like a grand total of 3 politicians left in the country if that happens Don't know if this is relavent to the discussion My maternal uncle was a COO or something for a very big construction company and he has been kidnapped 3 times while he was going to the construction site by the local gangsters asking for their cut to let them build the buildings Mining is like free money. Why wouldnt* people kill for it Well, change for a better future needs to start some day. Why not today!! Even better. India needs brilliant minds not uneducated illinformed goons as politicians aka people's representatives. Damn! Thanks for sharing For those who think how powerful is sand mafia, Just check the revenue collection of Punjab Govt. and the share of retta(Sand) mining Yeah .... Sadly there was a journalist too in the above list. People who cover these things will go missing or end up of dead. Unless you are politically powerful nothing can be said or done by common man ***List Goes On......*** The list will be much much longer if you add the urban land mafia in the mix! The crackdown has to come from top. Brutally arrest politicians and execute the corrupt ones like China does. All parties are involved, all leaders are involved. Even the environmentalists who condemn it out in the open are in it for a commission, the police officers are in on it, the community is on it because it’s easy money. That green board which is created to review the effects of mining can be bought for the right price. The government officers who are experts are in on it. The common man cannot do shit about it and that’s the truth. Now there are andh bhakts on both sides who will criticize this party that party etc. but at the end of the day we as a citizen of this country are losers India needs a more autocratic government like Singapore where law and offset is taken extremely seriously"
}