{
    "id": "1bejuw8",
    "title": "Supreme Court dilutes it's order regarding electoral bonds ",
    "url": "https://www.firstpost.com/opinion/electoral-bonds-why-sc-order-to-sbi-to-disclose-details-could-have-been-probing-13748796.html",
    "selftext": "As per observation made by supreme court on March 11  SBI just need to submit  list of donors and the list of donees separately with only the overall amounts in the two lists matching, period. One-to-one matching of bonds with the political parties not required.\n\nThe bottom line would be the BJP, which has been bearing the brunt of the criticism over the opacity of the electoral bonds, would laugh up its sleeves and the donors would heave a sigh of relief that while their identities as donors to be sure have been revealed, their connection with the industrial house to which they had donated remains concealed. Both would thank their stars that the Supreme Court has spared them the blushes. While the beneficiary political parties are happy, the original purchaser would be happy that the anonymity promised by the scheme at the end of the day has been honoured!\n",
    "flair": "Law & Courts",
    "score": 5,
    "num_comments": 4,
    "created_utc": 1710418795.0,
    "convurl": "https://external-preview.redd.it/sQwsRKSknxG3lFC_zt5Eafq8Vrdua5ObD_o0hfGdgZc.jpg?auto=webp&s=be0ba22e707b5f56726ae20b15eb3d01a008ee75",
    "comments": [
        "I think it would be still possible to match one-to-one but not sure about the level of accuracy. I'm eager to see how this unfolds",
        "Op is so happy with the Bjp unconstitutional things",
        "Alternative headline could be \"Apex Court chooses Stability over Accountability\".",
        "What"
    ],
    "cleaned_text": "supreme court dilutes order regarding electoral bonds per observation made supreme court march sbi need submit list donors list donees separately overall amounts two lists matching period onetoone matching bonds political parties required bottom line would bjp bearing brunt criticism opacity electoral bonds would laugh sleeves donors would heave sigh relief identities donors sure revealed connection industrial house donated remains concealed would thank stars supreme court spared blushes beneficiary political parties happy original purchaser would happy anonymity promised scheme end day honoured ",
    "cleaned_title": "supreme court dilutes order regarding electoral bonds",
    "cleaned_selftext": "per observation made supreme court march sbi need submit list donors list donees separately overall amounts two lists matching period onetoone matching bonds political parties required bottom line would bjp bearing brunt criticism opacity electoral bonds would laugh sleeves donors would heave sigh relief identities donors sure revealed connection industrial house donated remains concealed would thank stars supreme court spared blushes beneficiary political parties happy original purchaser would happy anonymity promised scheme end day honoured",
    "cleaned_comments": "think would still possible match onetoone sure level accuracy im eager see unfolds op happy bjp unconstitutional things alternative headline could apex court chooses stability accountability",
    "light_cleaned_title": "Supreme Court dilutes it's order regarding electoral bonds",
    "light_cleaned_selftext": "As per observation made by supreme court on March 11 SBI just need to submit list of donors and the list of donees separately with only the overall amounts in the two lists matching, period. One-to-one matching of bonds with the political parties not required. The bottom line would be the BJP, which has been bearing the brunt of the criticism over the opacity of the electoral bonds, would laugh up its sleeves and the donors would heave a sigh of relief that while their identities as donors to be sure have been revealed, their connection with the industrial house to which they had donated remains concealed. Both would thank their stars that the Supreme Court has spared them the blushes. While the beneficiary political parties are happy, the original purchaser would be happy that the anonymity promised by the scheme at the end of the day has been honoured!",
    "light_cleaned_comments": "I think it would be still possible to match one-to-one but not sure about the level of accuracy. I'm eager to see how this unfolds Op is so happy with the Bjp unconstitutional things Alternative headline could be \"Apex Court chooses Stability over Accountability\". What"
}