{
    "id": "16dfsyu",
    "title": "Ola is harassing and running a scam",
    "url": "https://www.reddit.com/r/india/comments/16dfsyu/ola_is_harassing_and_running_a_scam/",
    "selftext": "My dad and I used two separate Ola Cabs to get to the airport. We paid both the drivers in cash after the ride ended. Since we were in a rush to catch the international flight we did not the check the ola app again.\n\nAfter returning from our trip, both me and my dad are receiving 30-35 automated calls a day from ola to pay for the ride. They are claiming we used ola postpaid to pay for our ride, which we didn't. We paid the full amount in cash after the ride ended and we never opted/enabled ola postpaid service.\n\nIt has gotten so bad that we are receiving calls every 15 to 20 mins. Plus there is no way to talk to customer care executive. The only way to talk to them is via email. And even after numerous emails and warning to them, they didn't do anything.\n\nBoth me and my dad filed finally filled two seperate police complaints against ola.\n\nWhat other measures can we take to make them pay for harassing us and to stop this nuisance?\n\nhttps://preview.redd.it/uajb0xbza2nb1.jpg?width=540&format=pjpg&auto=webp&s=17b56e7efeb09e21014fa181e79ff46d70f3244a",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694192124.0,
    "convurl": "https://a.thumbs.redditmedia.com/otlu_dDpmoVkD7NThEdLhVBD-JvFGtfPWmtF9daSWb0.jpg",
    "comments": [
        "I know you won't have proof as such that you paid via cash...\n\nBut since you filed a police complaint maybe ola will straight away dent that you paid by cash",
        "My dad paid through cash but default was ola postpaid. So this thing happened twice. It was extremely simple and easy for me to resolve it. There was a chat option in the app and i just said we already paid in the chat and done. No more dues.",
        "I lost my phone in an ola cab but there was no way to contact ola customer care. Bullshit company."
    ],
    "cleaned_text": "ola harassing running scam dad used two separate ola cabs get airport paid drivers cash ride ended since rush catch international flight check ola app returning trip dad receiving automated calls day ola pay ride claiming used ola postpaid pay ride didnt paid full amount cash ride ended never optedenabled ola postpaid service gotten bad receiving calls every mins plus way talk customer care executive way talk via email even numerous emails warning didnt anything dad filed finally filled two seperate police complaints ola measures take make pay harassing us stop nuisance ",
    "cleaned_title": "ola harassing running scam",
    "cleaned_selftext": "dad used two separate ola cabs get airport paid drivers cash ride ended since rush catch international flight check ola app returning trip dad receiving automated calls day ola pay ride claiming used ola postpaid pay ride didnt paid full amount cash ride ended never optedenabled ola postpaid service gotten bad receiving calls every mins plus way talk customer care executive way talk via email even numerous emails warning didnt anything dad filed finally filled two seperate police complaints ola measures take make pay harassing us stop nuisance",
    "cleaned_comments": "know wont proof paid via cash since filed police complaint maybe ola straight away dent paid cash dad paid cash default ola postpaid thing happened twice extremely simple easy resolve chat option app said already paid chat done dues lost phone ola cab way contact ola customer care bullshit company",
    "light_cleaned_title": "Ola is harassing and running a scam",
    "light_cleaned_selftext": "My dad and I used two separate Ola Cabs to get to the airport. We paid both the drivers in cash after the ride ended. Since we were in a rush to catch the international flight we did not the check the ola app again. After returning from our trip, both me and my dad are receiving 30-35 automated calls a day from ola to pay for the ride. They are claiming we used ola postpaid to pay for our ride, which we didn't. We paid the full amount in cash after the ride ended and we never opted/enabled ola postpaid service. It has gotten so bad that we are receiving calls every 15 to 20 mins. Plus there is no way to talk to customer care executive. The only way to talk to them is via email. And even after numerous emails and warning to them, they didn't do anything. Both me and my dad filed finally filled two seperate police complaints against ola. What other measures can we take to make them pay for harassing us and to stop this nuisance?",
    "light_cleaned_comments": "I know you won't have proof as such that you paid via cash... But since you filed a police complaint maybe ola will straight away dent that you paid by cash My dad paid through cash but default was ola postpaid. So this thing happened twice. It was extremely simple and easy for me to resolve it. There was a chat option in the app and i just said we already paid in the chat and done. No more dues. I lost my phone in an ola cab but there was no way to contact ola customer care. Bullshit company."
}