{
    "id": "mufn71",
    "title": "Bi-Weekly Music Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/mufn71/biweekly_music_discussion_thread/",
    "selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here!\n\nIf you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days!\n\nDon't just mention stuff, link it! Links that are official and provided by the artist them self are preferred.\n\nAlso, check out r/IndianMusicTheory for serious discussion on Hindustani and Carnatic music, and r/icm for a more wide-ranging discussion.\n\n**The Music Thread is posted every two weeks on Tuesday mornings.**\n\nhttps://preview.redd.it/06d0xwq1x8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=4195dbb767ebd70a3209ea46a4497062e788c176",
    "flair": "Scheduled",
    "score": 12,
    "num_comments": 8,
    "created_utc": 1618882213,
    "convurl": "https://a.thumbs.redditmedia.com/E5ByWFrXZvGobINAGUfSALpA8YJN7sRcIH1HwOLuav0.jpg",
    "comments": [
        "Been listening to the new [Dhruv Visvanath](https://youtu.be/8wax8FDMNOc) album\n\nAlso this new track from [Nalayaak](https://youtu.be/1j2YXCvTtTs)",
        "I am listening to Lo-Fi music because I am currently squashing bugs in my code. That's it!",
        "https://open.spotify.com/user/hdwlphin0ra5gmgtvx4k38ew9/playlist/3RwSIlAiYGa16YjFfcPnNv?si=aL7vaG3hQ5-F_-WpmFNpUQ\n\nThis is just a link of a Spotify playlist that I made. It's just a number of good telugu songs I enjoy. Fell free to recommend more and follow. Thanks",
        "This is another playlist that has songs as old as the 50's. It covers hits and melodious ones upto the late 80's. Hope you can enjoy it. \nhttps://open.spotify.com/user/hdwlphin0ra5gmgtvx4k38ew9/playlist/0IlIQYWbQTVFPnTDJ2ptdK?si=sKPZNNfZT5ei7q1iRIVu_w",
        "I came across this song yesterday on a JoJo (anime) video on YouTube and have been really enjoying it. It's called 2 months off! by Underworld.\n\nHere's the official video https://youtu.be/KsE9iXoXB6s\n\nApart from that I've been listening to some Buddhist chants that I've been finding peace in lately. If anyone's interested here's the playlist\n\nhttps://open.spotify.com/playlist/3LLAAz6x5o2ArDdXFPLqqa?si=7f-vTEgZRYmCYMc_YzBirQ&amp;utm_source=copy-link",
        "JoJo has awesome music the first season has opening track from YES which is 70's prog song , I feel in love straight away . Do you like giornos theme??",
        "Ohhhh yes yes yes, the first season's ED- Roundabout was so good. Almost all of Jojo's music is great and a blessing. I'm a huge fan, so I can't stop going gaga over it.\n\nOh I do like his theme but my favorite theme is Joseph's followed by Jotaro's.\n\nAlso, I'm so happy to find a fellow JoJo fan in India. Yaay!",
        "I made a bollywood playlist, about 1500 songs, and 102 hours of play time. Check it out.\n\n[https://open.spotify.com/playlist/02mXQOxsq30LKZaLoXWXm1?si=ae2ba1149fbe4df9](https://open.spotify.com/playlist/02mXQOxsq30LKZaLoXWXm1?si=ae2ba1149fbe4df9)\n\nPersonally, I think the songs are pretty good"
    ],
    "cleaned_text": "biweekly music discussion thread rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artist self preferred also check rindianmusictheory serious discussion hindustani carnatic music ricm wideranging discussion music thread posted every two weeks tuesday mornings ",
    "cleaned_title": "biweekly music discussion thread",
    "cleaned_selftext": "rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artist self preferred also check rindianmusictheory serious discussion hindustani carnatic music ricm wideranging discussion music thread posted every two weeks tuesday mornings",
    "cleaned_comments": "listening new dhruv visvanathhttpsyoutubewaxfdmnoc album also new track nalayaakhttpsyoutubejyxcvttts listening lofi music currently squashing bugs code thats link spotify playlist made number good telugu songs enjoy fell free recommend follow thanks another playlist songs old covers hits melodious ones upto late hope enjoy came across song yesterday jojo anime video youtube really enjoying called months underworld heres official video apart ive listening buddhist chants ive finding peace lately anyones interested heres playlist jojo awesome music first season opening track yes prog song feel love straight away like giornos theme ohhhh yes yes yes first seasons ed roundabout good almost jojos music great blessing im huge fan cant stop going gaga oh like theme favorite theme josephs followed jotaros also im happy find fellow jojo fan india yaay made bollywood playlist songs hours play time check httpsopenspotifycomplaylistmxqoxsqlkzaloxwxmsiaebafbedfhttpsopenspotifycomplaylistmxqoxsqlkzaloxwxmsiaebafbedf personally think songs pretty good",
    "light_cleaned_title": "Bi-Weekly Music Discussion Thread",
    "light_cleaned_selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here! If you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days! Don't just mention stuff, link it! Links that are official and provided by the artist them self are preferred. Also, check out r/IndianMusicTheory for serious discussion on Hindustani and Carnatic music, and r/icm for a more wide-ranging discussion. **The Music Thread is posted every two weeks on Tuesday mornings.**",
    "light_cleaned_comments": "Been listening to the new [Dhruv Visvanath](https://youtu.be/8wax8FDMNOc) album Also this new track from [Nalayaak](https://youtu.be/1j2YXCvTtTs) I am listening to Lo-Fi music because I am currently squashing bugs in my code. That's it! This is just a link of a Spotify playlist that I made. It's just a number of good telugu songs I enjoy. Fell free to recommend more and follow. Thanks This is another playlist that has songs as old as the 50's. It covers hits and melodious ones upto the late 80's. Hope you can enjoy it. I came across this song yesterday on a JoJo (anime) video on YouTube and have been really enjoying it. It's called 2 months off! by Underworld. Here's the official video Apart from that I've been listening to some Buddhist chants that I've been finding peace in lately. If anyone's interested here's the playlist JoJo has awesome music the first season has opening track from YES which is 70's prog song , I feel in love straight away . Do you like giornos theme?? Ohhhh yes yes yes, the first season's ED- Roundabout was so good. Almost all of Jojo's music is great and a blessing. I'm a huge fan, so I can't stop going gaga over it. Oh I do like his theme but my favorite theme is Joseph's followed by Jotaro's. Also, I'm so happy to find a fellow JoJo fan in India. Yaay! I made a bollywood playlist, about 1500 songs, and 102 hours of play time. Check it out. [https://open.spotify.com/playlist/02mXQOxsq30LKZaLoXWXm1?si=ae2ba1149fbe4df9](https://open.spotify.com/playlist/02mXQOxsq30LKZaLoXWXm1?si=ae2ba1149fbe4df9) Personally, I think the songs are pretty good"
}