{
    "id": "13jrgue",
    "title": "Man behind controversial play on Tipu Sultan resigns as chief of Karnataka-run theatre institute",
    "url": "https://scroll.in/latest/1049199/man-behind-controversial-play-on-tipu-sultan-resigns-as-chief-of-karnataka-run-theatre-institute",
    "selftext": "Addanda C Cariappa quit citing the loss of the Bharatiya Janata Party in state Assembly elections.",
    "flair": "Politics",
    "score": 56,
    "num_comments": 3,
    "created_utc": 1684298104.0,
    "convurl": "https://external-preview.redd.it/yo6Xs8dv9JqSYty8igi7s8gwrkzxffkiTpFPZko9Fbg.jpg?auto=webp&v=enabled&s=4b2d12057dc4b0dc0e5a9b3c8a3cd7331c811e09",
    "comments": [
        "Good riddance of hindutva rubbish.",
        "> Initially, Cariappa asserted that he has substantial documents to prove his claims but later admitted that the two characters were fictional\n\nHe and Sudipto Sen must be WhatsApp buddies."
    ],
    "cleaned_text": "man behind controversial play tipu sultan resigns chief karnatakarun theatre institute addanda c cariappa quit citing loss bharatiya janata party state assembly elections ",
    "cleaned_title": "man behind controversial play tipu sultan resigns chief karnatakarun theatre institute",
    "cleaned_selftext": "addanda c cariappa quit citing loss bharatiya janata party state assembly elections",
    "cleaned_comments": "good riddance hindutva rubbish initially cariappa asserted substantial documents prove claims later admitted two characters fictional sudipto sen must whatsapp buddies",
    "light_cleaned_title": "Man behind controversial play on Tipu Sultan resigns as chief of Karnataka-run theatre institute",
    "light_cleaned_selftext": "Addanda C Cariappa quit citing the loss of the Bharatiya Janata Party in state Assembly elections.",
    "light_cleaned_comments": "Good riddance of hindutva rubbish. > Initially, Cariappa asserted that he has substantial documents to prove his claims but later admitted that the two characters were fictional He and Sudipto Sen must be WhatsApp buddies."
}