{
    "id": "16njyhf",
    "title": "Is Extending SC/ST Reservations In Lok Sabha & State Assemblies Valid? Supreme Court To Hear On November 21",
    "url": "https://www.livelaw.in/top-stories/is-extending-period-of-scst-reservations-in-lok-sabha-state-assemblies-valid-supreme-court-to-hear-on-november-21-238215",
    "selftext": "The bench comprising Chief Justice of India DY Chandrachud along with Justices AS Bopanna, MM Sundresh, JB Pardiwala, and Manoj Misra will adjudicate upon the validity of the Constitution(104th) Amendment Act 2019, which extended the political reservations for SC/STs by another ten years. The bench however clarified that it will not go into the validity of the previous extensions given for SC/ST reservations through earlier amendments.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1695212645.0,
    "convurl": "https://external-preview.redd.it/4cJR5bLVA7rg1UNzepl-B4-VTblTwMgKRIGXRRx7hcI.jpg?auto=webp&s=a5740c251d457a3a3bb47b58eebe2762569512e8",
    "comments": [
        ">The following issues were framed in the matter–\n\n>1. Whether the Constitution (104th Amendment) Act 2019 is unconstitutional?\n\n>2. Whether the exercise of constituent powers of amendment to extend the period prescribed for the expiration of period of reservations under Article 334 is constitutionally valid?\n\n>The bench clarified that the second issue as framed, shall not impinge on the legitimacy of the amendments to the Constitution which were made prior to the 104th amendment. The bench further added \"The validity of the 104th amendment shall be determined to the extent that it applies to the SCs and the STs since the reservations for Anglo Indians has come to an end at the expiration of 70 years from the commencement of the Constitution.\"\n\n>Senior Advocate C Aryama Sundaram, appearing for the petitioners, submitted that that issue was whether the amendments violated the basic structure of the Constitution. He also submitted that it has to be analysed if there was any quantifiable data regarding lack of representation which justified the amendments; otherwise, the amendments will suffer from the vice of \"manifest arbitrariness\".\n\n>\"You are saying reserving seats for one community deprives another community of the same and thus goes against the basic structure. That is your submission\", CJI Chandrachud summarised the arguments of Sundaram.",
        "25% reservation exists while population share is believed to be same. Opposition asking for OBC reservation as well and they're asking to roll back sc/st\n\nAnd oh, totally not putting someone on the bench who has twice made unsolicited comments on caste reservation and was threatened with impeachment for the first instance",
        "So now redditors are going to decide what's unsolicited and what's not?",
        "Yes I am a simple redditor. Are you an expert? Then which were those two cases",
        "Clearly you are not a bigger expert then the Supreme Court Judge herself right?",
        "Wrong gender and none of the two cases called for observations on caste based reservations"
    ],
    "cleaned_text": "extending scst reservations lok sabha state assemblies valid supreme court hear november bench comprising chief justice india dy chandrachud along justices bopanna mm sundresh jb pardiwala manoj misra adjudicate upon validity constitutionth amendment act extended political reservations scsts another ten years bench however clarified go validity previous extensions given scst reservations earlier amendments ",
    "cleaned_title": "extending scst reservations lok sabha state assemblies valid supreme court hear november",
    "cleaned_selftext": "bench comprising chief justice india dy chandrachud along justices bopanna mm sundresh jb pardiwala manoj misra adjudicate upon validity constitutionth amendment act extended political reservations scsts another ten years bench however clarified go validity previous extensions given scst reservations earlier amendments",
    "cleaned_comments": "following issues framed matter whether constitution th amendment act unconstitutional whether exercise constituent powers amendment extend period prescribed expiration period reservations article constitutionally valid bench clarified second issue framed shall impinge legitimacy amendments constitution made prior th amendment bench added validity th amendment shall determined extent applies scs sts since reservations anglo indians come end expiration years commencement constitution senior advocate c aryama sundaram appearing petitioners submitted issue whether amendments violated basic structure constitution also submitted analysed quantifiable data regarding lack representation justified amendments otherwise amendments suffer vice manifest arbitrariness saying reserving seats one community deprives another community thus goes basic structure submission cji chandrachud summarised arguments sundaram reservation exists population share believed opposition asking obc reservation well theyre asking roll back scst oh totally putting someone bench twice made unsolicited comments caste reservation threatened impeachment first instance redditors going decide whats unsolicited whats yes simple redditor expert two cases clearly bigger expert supreme court judge right wrong gender none two cases called observations caste based reservations",
    "light_cleaned_title": "Is Extending SC/ST Reservations In Lok Sabha & State Assemblies Valid? Supreme Court To Hear On November 21",
    "light_cleaned_selftext": "The bench comprising Chief Justice of India DY Chandrachud along with Justices AS Bopanna, MM Sundresh, JB Pardiwala, and Manoj Misra will adjudicate upon the validity of the Constitution(104th) Amendment Act 2019, which extended the political reservations for SC/STs by another ten years. The bench however clarified that it will not go into the validity of the previous extensions given for SC/ST reservations through earlier amendments.",
    "light_cleaned_comments": ">The following issues were framed in the matter– >1. Whether the Constitution (104th Amendment) Act 2019 is unconstitutional? >2. Whether the exercise of constituent powers of amendment to extend the period prescribed for the expiration of period of reservations under Article 334 is constitutionally valid? >The bench clarified that the second issue as framed, shall not impinge on the legitimacy of the amendments to the Constitution which were made prior to the 104th amendment. The bench further added \"The validity of the 104th amendment shall be determined to the extent that it applies to the SCs and the STs since the reservations for Anglo Indians has come to an end at the expiration of 70 years from the commencement of the Constitution.\" >Senior Advocate C Aryama Sundaram, appearing for the petitioners, submitted that that issue was whether the amendments violated the basic structure of the Constitution. He also submitted that it has to be analysed if there was any quantifiable data regarding lack of representation which justified the amendments; otherwise, the amendments will suffer from the vice of \"manifest arbitrariness\". >\"You are saying reserving seats for one community deprives another community of the same and thus goes against the basic structure. That is your submission\", CJI Chandrachud summarised the arguments of Sundaram. 25% reservation exists while population share is believed to be same. Opposition asking for OBC reservation as well and they're asking to roll back sc/st And oh, totally not putting someone on the bench who has twice made unsolicited comments on caste reservation and was threatened with impeachment for the first instance So now redditors are going to decide what's unsolicited and what's not? Yes I am a simple redditor. Are you an expert? Then which were those two cases Clearly you are not a bigger expert then the Supreme Court Judge herself right? Wrong gender and none of the two cases called for observations on caste based reservations"
}