{
    "id": "172zm9a",
    "title": "(HELP!) Two teachers were arrested in Chaitanya School school for sexually assaulting multiple girls of class 10, 11, 12.",
    "url": "https://www.reddit.com/r/india/comments/172zm9a/help_two_teachers_were_arrested_in_chaitanya/",
    "selftext": "What is happening with #ChaitanyaSchool? Two teachers were arrested for assaulting girls of class 10, 11, 12. The students themselves informed the police because the principal took NO action. According to the students, school paid money to suppress the media. The school is now trying to pay the parents of those affected students to not affect the school's name. The students wondering where this shithole of a school is heading.\n\nThe Principal: Popuri Anjibabu\n\nThe arrested teachers: Vijayakumar, Muralidharan\n\nSchool: Sri Chaitanya Techno School (CBE1), Chinnavedampatti, Coimbatore\n\nhttps://www.youtube.com/watch?v=tQoWlOmKheI&ab_channel=ThanthiTV\n\nhttps://www.vikatan.com/crime/coimbatore-two-arrested-in-pocso-act\nBoycottChaitanya #Coimbatore #Chinnavedampatti #CBE1 #SexualAssault #POCSO\n\nPlease take this issue to twitter with the hashtags above. Please spread the word wherever possible. 🙏🙏THE STUDENTS NEED ALL THE SUPPORT POSSIBLE FROM YOU GUYS AS THE STUDENTS OF THAT SCHOOL CAN'T REALLY DO MUCH. Thanks :)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696772971.0,
    "convurl": "https://external-preview.redd.it/hwkt0V0oA7BftOVv1fl6xdPpO0r0US2yOZ_lpX5dFDw.jpg",
    "comments": [],
    "cleaned_text": "help two teachers arrested chaitanya school school sexually assaulting multiple girls class happening chaitanyaschool two teachers arrested assaulting girls class students informed police principal took action according students school paid money suppress media school trying pay parents affected students affect schools name students wondering shithole school heading principal popuri anjibabu arrested teachers vijayakumar muralidharan school sri chaitanya techno school cbe chinnavedampatti coimbatore boycottchaitanya coimbatore chinnavedampatti cbe sexualassault pocso please take issue twitter hashtags please spread word wherever possible students need support possible guys students school cant really much thanks ",
    "cleaned_title": "help two teachers arrested chaitanya school school sexually assaulting multiple girls class",
    "cleaned_selftext": "happening chaitanyaschool two teachers arrested assaulting girls class students informed police principal took action according students school paid money suppress media school trying pay parents affected students affect schools name students wondering shithole school heading principal popuri anjibabu arrested teachers vijayakumar muralidharan school sri chaitanya techno school cbe chinnavedampatti coimbatore boycottchaitanya coimbatore chinnavedampatti cbe sexualassault pocso please take issue twitter hashtags please spread word wherever possible students need support possible guys students school cant really much thanks",
    "cleaned_comments": "",
    "light_cleaned_title": "(HELP!) Two teachers were arrested in Chaitanya School school for sexually assaulting multiple girls of class 10, 11, 12.",
    "light_cleaned_selftext": "What is happening with #ChaitanyaSchool? Two teachers were arrested for assaulting girls of class 10, 11, 12. The students themselves informed the police because the principal took NO action. According to the students, school paid money to suppress the media. The school is now trying to pay the parents of those affected students to not affect the school's name. The students wondering where this shithole of a school is heading. The Principal: Popuri Anjibabu The arrested teachers: Vijayakumar, Muralidharan School: Sri Chaitanya Techno School (CBE1), Chinnavedampatti, Coimbatore BoycottChaitanya #Coimbatore #Chinnavedampatti #CBE1 #SexualAssault #POCSO Please take this issue to twitter with the hashtags above. Please spread the word wherever possible. 🙏🙏THE STUDENTS NEED ALL THE SUPPORT POSSIBLE FROM YOU GUYS AS THE STUDENTS OF THAT SCHOOL CAN'T REALLY DO MUCH. Thanks :)",
    "light_cleaned_comments": ""
}