{
    "id": "1hjer0t",
    "title": "55th GST Council meeting: 7 key takeaways from FM Nirmala Sitharaman's address",
    "url": "https://www.firstpost.com/world/55th-gst-council-meeting-7-key-takeaways-from-fm-nirmala-sitharamans-address-13846583.html",
    "selftext": "Key points:\n*Increase in GST from 12 to 18 percent for used electric vehicles (EVs)\n*Hike in GST from 12 to 18 percent for small petrol     and diesel cars\n*Tax relief on health and life insurance premiums    upto 5lakh \n*Increase GST rates on luxury items\n*lowered GST rates on essential goods, including bicycles, exercise books, and large packs of packaged drinking water\n\n",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 7,
    "created_utc": 1734802550.0,
    "convurl": "https://external-preview.redd.it/jrnb8MaazhdUqDtjwY5Wbkk56JWsJDs4kQ3NzwK6zJ0.jpg?auto=webp&s=e851fa7c2fa62168f08195ce2768fd45f6461a80",
    "comments": [
        "Nirmala taii on full form",
        "Gst on air in next meeting",
        "Already ha 18 percent GST on air purifier",
        "clean air is a luxury. it needs to be taxed.",
        "Tax lagane ayi hmari nirmala taai.",
        "Getting Clean air and water is basic nassesity"
    ],
    "cleaned_text": "th gst council meeting key takeaways fm nirmala sitharamans address key points increase gst percent used electric vehicles evs hike gst percent small petrol diesel cars tax relief health life insurance premiums upto lakh increase gst rates luxury items lowered gst rates essential goods including bicycles exercise books large packs packaged drinking water ",
    "cleaned_title": "th gst council meeting key takeaways fm nirmala sitharamans address",
    "cleaned_selftext": "key points increase gst percent used electric vehicles evs hike gst percent small petrol diesel cars tax relief health life insurance premiums upto lakh increase gst rates luxury items lowered gst rates essential goods including bicycles exercise books large packs packaged drinking water",
    "cleaned_comments": "nirmala taii full form gst air next meeting already ha percent gst air purifier clean air luxury needs taxed tax lagane ayi hmari nirmala taai getting clean air water basic nassesity",
    "light_cleaned_title": "55th GST Council meeting: 7 key takeaways from FM Nirmala Sitharaman's address",
    "light_cleaned_selftext": "Key points: *Increase in GST from 12 to 18 percent for used electric vehicles (EVs) *Hike in GST from 12 to 18 percent for small petrol and diesel cars *Tax relief on health and life insurance premiums upto 5lakh *Increase GST rates on luxury items *lowered GST rates on essential goods, including bicycles, exercise books, and large packs of packaged drinking water",
    "light_cleaned_comments": "Nirmala taii on full form Gst on air in next meeting Already ha 18 percent GST on air purifier clean air is a luxury. it needs to be taxed. Tax lagane ayi hmari nirmala taai. Getting Clean air and water is basic nassesity"
}