{
    "id": "13yb5ck",
    "title": "Opinion: Why BJP wont arrest their POCSO accused MP",
    "url": "https://www.reddit.com/r/india/comments/13yb5ck/opinion_why_bjp_wont_arrest_their_pocso_accused_mp/",
    "selftext": "TLDR: Thakurs play a big part in BJPs UP prospects. Plus they are very fickle and will support which ever party gives them more power. In terms of numbers, BJP* won 41% of the vote in UP elections and SP* won 32.06%. Even if half of the Thakur vote (roughly 10% of the total UP vote) shifts back to SP, that would bring SP* and BJP* to even keel, making it doubly important to appease them.\n\nWhile I would like to give my own opinions, I'm sharing some articles by jounalists who have put their thoughts much better than I think I can\n\n>Jan 21 2022 :  Thakurs in Uttar Pradesh, despite being a powerful community that wields influence in urban and rural areas, has failed to find its voice in the corridors of power after the end of the Veer Bahadur Singh regime in 1988.\n\n> Thakurs constitute only 8 per cent of the state's population but actually own around 50 per cent of the land. \n\nRead the whole article because it covers the caste arithmetic of the other UP parties, but here is the most important bit\n\n> The opposition has even accused the Yogi government of going overboard in protecting Thakur interests and shielding Thakur criminals but the chief minister remains unapologetic about it.\n\nhttps://www.deccanherald.com/election/uttar-pradesh/yogi-a-major-factor-in-thakur-support-for-bjp-1073184.html\n\nThe below article describes how SP used the Thakur vote to win big in 2002* and again in 2012 \n\n> Mar 16, 2022 : In 2002, BJP supported the Bahujan Samaj Party (BSP) and Mayawati became the chief minister of Uttar Pradesh. But her decision not to shield Kunda MLA Raghuraj Pratap Singh (Raja Bhaiya) and Jaunpur MLA Dhananjay Singh from arrest irked the Kshatriya community.\n\n> Their arrests triggered a revolt with as many as 40 Kshatriya MLAs of the UP Assembly, under the leadership of late Deoband MLA Rajender Singh Rana, extending outside support to the Samajwadi Party. This enabled the SP to form a government in UP with Mulayam Singh Yadav as chief minister.\n\n\nhttps://www.indiatoday.in/india/story/samajwadi-party-kshatriya-thakurs-rajputs-bjp-bsp-akhilesh-yadav-amar-singh-1926143-2022-03-16\n\n>  Apr 19, 2019 : Since assuming power in 2017, the UP government led by Yogi Adityanath has been on a nomination spree of Thakurs in various institutional domains. Be it zilla parishad elections, SHO nominations, promotion of civil servants or of cops in particular, Thakurs have received a preferential treatment from the Yogi administration. Before the December 2018 elections, five out of seven BJP chief ministers in the Hindi belt were Thakurs.\n\n> In UP, the Hindu Yuva Vahini, essentially a Thakur organisation Yogi Adityanath founded in 2002, has greatly expanded its reach and activities, filling the void in the criminal space left by gangsters who have been eliminated, arrested or driven out by the government's drastic encounter policy.\n\nhttps://www.indiatoday.in/magazine/cover-story/story/20190429-the-return-of-thakurvad-1504672-2019-04-19\n\nEdit:\n\nSince the girls seem to have univocal support from the Jatt community, it is important to note that Jatts make up significant population in Rajasthan, Haryana, Punjab, Delhi and UP. Electorally, this may not be the best idea considering that RJ and HR have elections next year. But maybe UP Rajput support is worth more than the other states altogether?",
    "flair": "Politics",
    "score": 592,
    "num_comments": 99,
    "created_utc": 1685708379.0,
    "convurl": "https://external-preview.redd.it/AWluvMgpP-6ArpLY1qguMfs4J-dYoV-PmId7v2Nlon0.jpg?auto=webp&v=enabled&s=0b2fbf98de41e53c8ac14350f4a42a96ea8be71b",
    "comments": [
        "Thanks he definitely has some pull. BJP booted out that spokesperson after backlash when she said about Islam (I mean that is pretty much requirement at this point yet she got booted). Meanwhile this dude has most horrendous accusation with Olympic atheletes protesting bringing in such negative PR remains untouchable, seems fishy.",
        "She was only sidelined because countries with whom we had ties with were annoyed.",
        "Yeah he won't be arrested. It will go on just like this. Soon they'll inaugurate Ram Mandir and people will vote because of that. They won't take any action because they won't lose any significant vote over that creepy Brij Bhushan.",
        "Yeah but this thing isnt a good PR in Intl relations either. Imagine your best of the best athletes throwing their olympic medals because Indian govt cant take down a rapist minister. It is definitely reinforcing the stereotype of Indians in foregin perception. \n\nI honestly feel sick this isnt being given the same level of attention all other \"nationalist\" things get.",
        "The only reason Nupur sharma was castigated was because she talked shit about Islam. If she had stuck to the party line and shat on Indian muslims, the gulf countries wouldnt have pressured Modi.",
        "I don't think this has received much media attention outside. Like even NS said all that, foreign media picked it up and it reached people in the government in other countries. \nI checked one or two international media outlets, not much coverage of this.\n\nSo sick man, at the least he should have been asked to resign from his post till the investigation is ongoing but no. They won't because they won't lose significant votes over it.",
        "True, they bow down like bitches to mullahs and claim to be kattarwadi lol more like katwawadi. The two-facedness, hypocrisy and jingoism of this govt is at unhealthy levels high.",
        "When people vote for caste and religious politicians, what do you expect? We, as citizens, have to do better but majority of us won't do that.",
        "This language isnt appreciated. Reporting this comment",
        "Understandable",
        "Not even Islam, people make horrible comments about it everyday here. She made a direct comment about their prophet. Had she not done that, it would still have been business as usual.",
        "In my observation from how the situation is turning out as of now, if BJP shields Brij Bhushan Singh then Jats can desert BJP in future elections. Khaps and farmer organization of North India, in which Jats yield enormous influence, have come out in support of wrestlers, who are also Jats. Meanwhile, Brij Bhushan is also ramping up support for himself through his Rajput caste. It looks like battle can turn into Rajput vs. Jat tussle, making it a tricky situation for BJP.",
        "The molestor’ son killed himself with his father’s gun and blamed him for it.\n\nEdit : typo. [link to the news](https://m.timesofindia.com/city/lucknow/bjp-mps-son-shoots-self-blames-father/articleshow/744539.cms)",
        "It's sad that Thakur's will support a rapist rather than doing what's right .",
        "true",
        "Jats sided with SP in the UP state elections and the result was significant. Modi will not let Thakur vote slip away. They are already hanging by a thread in Haryana. \n\nCome to think of it, Jats make ~~a significant population in east~~ largest caste group in Rajasthan too. Modi might be betting everything on UP tbh. Seems like a risky gamble",
        "He \"may\" also have deep secrets of BJP, which they don't want him to spill out if shit hits the fan.",
        "Makes you wonder if we really are in 2023 where it’s still unsafe to be a woman.",
        "Caste before crime.",
        "MMS clip of Modi?",
        "Doubt it. Someone with secrets can be permanently finished off. Caste politics will remain",
        "Exactly, it's kind of default for people to support based on their caste just look at the comments here only when people are saying that who will vote for who based on how current govt react.\n\nOn the contrary, people should make other conscious of the fact that how everyone should oppose if someone is in crime irrespective of the caste they belong to. But this is not going to happen in India.",
        "With the first lady?\n\n*(you know who)*",
        "Talking about Jats of UP alone, check out community-wise voting percentage in the [table](https://www.bqprime.com/politics/up-election-results-in-charts-how-bjps-my-square-beat-akhileshs-my). BJP got highest share of Jat votes. Even if we assume that the share is 10 percentage points lower, keep in this mind that BJP was able to retain its Jat votes even after farm protests. So basically large number of Jats decided to vote for BJP even after it tried to screw them over because they found BJP's anti-Muslim stance. After the Muzaffarnagar riots of 2013, communalism has seeped into Jats, current wrestlers protest has the potential to drive Jats away from BJP.",
        "Possibly...Plus he left his wife too. Sounds suspicious!!!",
        "hence the surprisingly pro LGBTQ stance I guess",
        "ironically they were middle east/UAE who forced goberment to fire that idiot...sending all the chaddis into a frenzy for bending to the will of those who they hate the most.",
        "That meltdown was hilarious. You see something similar under the comments section of Modi's tweet whenever he wishes on any Muslim festivals.",
        ">In UP, the Hindu Yuva Vahini, essentially a Thakur organisation Yogi Adityanath founded in 2002, has greatly expanded its reach and activities, filling the void in the criminal space left by gangsters who have been eliminated, arrested or driven out by the government's drastic encounter policy.\n\nThis was not a passive process of occupying space that was incidentally left open. The space was deliberately created for their expansion by their own godfather, vin ghaslet, through encounters etc.",
        "Disgusting comment. Shame on you. You're as bad as them.",
        "awww *\\*cries in acche din\\**",
        "Fanta?",
        "That was cold.",
        "first lady uska bff hai. chota fanta to aur hi kuch hai.",
        "kamra ke dono videos dekhe? chota fanta wala?",
        "The guy is literally Bahubali - regional don. \n\nHe has admitted killing someone on camera https://youtu.be/_wzsb7zwPmY\n\nWe deserve such MPs",
        "The guy is literally a regional don. Yogi adityanath is mafia boss in saffron shawl",
        "Yes...got it 😂",
        "I'm not an anti-modi/pro-modi guy. I just like absolute free speech; the freedom to criticise and make fun of any person/institution.\n\nSo I agree with Nupur Sharma's quip. I agree with most of Kamra's comentary. I agree whole-heartedly with Varun Grover's ideas.\n\n*I may not agree with what you have to say, but I will defend to the death your right to say it. - wrongfully attributed to Voltaire*",
        "The Arab countries are possibly the only ones more blatantly racist than india. But we are catching up.",
        "You can get secrets leaked even if you are finished off, though it maybe tougher to prosecute with a dead witness.\n\n I doubt BJP are scared of any secrets that might leak , but if there are, finishing him off is not the best course of action.\nOnly thing is, it will act as a deterrent for others to leak secrets but that can backfire too.\n\nStill, I agree with you its likely to be caste politics (and well his own personal political power).",
        "In India, caste loyalty is paramount, righteousness comes at last. Khaps too are notorious for oppressing Dalits and women, when crimes are committed by their own Jat kins.",
        "That's an interesting table. The question is if the Jat leaders support this movement?",
        "Thakurs - the so called fucking third class upper caste  , imagine whole community swinging votes for a child molestor .Thanks OP for the post and numbers",
        "Cheers man",
        "No doubt.",
        "I wish we didnt",
        "Very true.",
        "'Jhooti izzat'",
        "double check for typos when copy pasting Sansani Khusala wisdoms !!",
        "Yup. And everyone knew that. Including his voters, who voted for him precisely because he was converting UP into an orange savarna mafia state.",
        "With mms clip of Modi, he would become either deputy PM or home minister",
        "So we blame bjp? Or we blame brij bhushan? Or we blame the thakurs? \n\nIn the end its us, we select such assholes, we see their criminal cases, we see their ill gotten property and gains, we see that they are the same caste or religion, we see their goons and how they harass.\n\nWe the people don't vote on qualification and how good the person is, we vote based on everything that a leader shouldn't have.\n\nMostly the middle class and youth don't even vote, leading to small confirmed voters being the majority who decide on such politicians and who the politicians keep happy for votes.",
        "\n> Mostly the middle class and youth don't even vote, leading to small confirmed voters being the majority who decide on such politicians and who the politicians keep happy for votes.\n\nIndia has high participation rate across all age groups. Western countries may have the problem you are thinking of. India doesnt.\n\n> We the people don't vote on qualification and how good the person is, we vote based on everything that a leader shouldn't have.\n\nWe vote by caste. The reason we do this is because when a sympathetic caste leader is in power, he will help point government resources in your direction. We will continue to vote by caste as long as politicians have the power to direct government spending. \n\n> So we blame bjp? Or we blame brij bhushan? Or we blame the thakurs? \n\nNo. BJP is just taking advantage of the system. Brij Bhushan is one man. If he is removed another will take his place. The system is fucked. \n\n> In the end its us, we select such assholes, we see their criminal cases, we see their ill gotten property and gains, we see that they are the same caste or religion, we see their goons and how they harass.\n\nMaybe. It is not the job of salaried/worker class to constantly protest and fight back against a corrupt system. I mean how will we feed our children then? Idk. Maybe it is our fault. Do we do a revolution? We have to vote for one of many shitty choices. idk.",
        "Very well replied. But you see, what i meant when i said its us is, when a good hardworking guy or a doctor or an engineer steps up to fight in election, we don't vote for him, the ppl vote for freebies and based on caste line. \n\nAnd the problem with voting for ppl along caste line is the development is not as a whole. Its still misused by certain people always.\n\nAnd its not about bjp or congress. Our entire system is gone bad, there isn't a single politician who actually cares. We need to start saying we need new ppl and all of the existing ones are bad instead of saying this one is better than him and all that. \n\nOur population and everything is so much, its really hard to bring change. Corruption is ingrained as a whole and us middle class keep fighting for basic things.",
        "It is difficult for me to accept victim blaming. But ultimately it is upto us to force the system to improve.",
        "Victims should not even be mentioned let alone blamed. They are not at the fault here. We as a people have given powers to such people, who can get away with the use of sheer power and influence given to them by people, who would not stop supporting him even after knowing he is guilty.",
        "Yes, sorry, I meant that we as citizens are also victims of our political system.",
        "Actually no, the political system is a victim of people. We need to ask better things, choose better, hold them accountable, stop being bootlickers of politicians, and fighting about them like they are huge personalities, but we give blind support to them, fight for them. \nI may be wrong, but thats what i think. Education should also be a criteria for fighting elections. Also age , how much they earned in 5 years, cases going on them. And no politician should be given more than 10 years of term.",
        "Agree with the term limits idea"
    ],
    "cleaned_text": "opinion bjp wont arrest pocso accused mp tldr thakurs play big part bjps prospects plus fickle support ever party gives power terms numbers bjp vote elections sp even half thakur vote roughly total vote shifts back sp would bring sp bjp even keel making doubly important appease would like give opinions im sharing articles jounalists put thoughts much better think jan thakurs uttar pradesh despite powerful community wields influence urban rural areas failed find voice corridors power end veer bahadur singh regime thakurs constitute per cent states population actually around per cent land read whole article covers caste arithmetic parties important bit opposition even accused yogi government going overboard protecting thakur interests shielding thakur criminals chief minister remains unapologetic article describes sp used thakur vote win big mar bjp supported bahujan samaj party bsp mayawati became chief minister uttar pradesh decision shield kunda mla raghuraj pratap singh raja bhaiya jaunpur mla dhananjay singh arrest irked kshatriya community arrests triggered revolt many kshatriya mlas assembly leadership late deoband mla rajender singh rana extending outside support samajwadi party enabled sp form government mulayam singh yadav chief minister apr since assuming power government led yogi adityanath nomination spree thakurs various institutional domains zilla parishad elections sho nominations promotion civil servants cops particular thakurs received preferential treatment yogi administration december elections five seven bjp chief ministers hindi belt thakurs hindu yuva vahini essentially thakur organisation yogi adityanath founded greatly expanded reach activities filling void criminal space left gangsters eliminated arrested driven governments drastic encounter policy edit since girls seem univocal support jatt community important note jatts make significant population rajasthan haryana punjab delhi electorally may best idea considering rj hr elections next year maybe rajput support worth states altogether ",
    "cleaned_title": "opinion bjp wont arrest pocso accused mp",
    "cleaned_selftext": "tldr thakurs play big part bjps prospects plus fickle support ever party gives power terms numbers bjp vote elections sp even half thakur vote roughly total vote shifts back sp would bring sp bjp even keel making doubly important appease would like give opinions im sharing articles jounalists put thoughts much better think jan thakurs uttar pradesh despite powerful community wields influence urban rural areas failed find voice corridors power end veer bahadur singh regime thakurs constitute per cent states population actually around per cent land read whole article covers caste arithmetic parties important bit opposition even accused yogi government going overboard protecting thakur interests shielding thakur criminals chief minister remains unapologetic article describes sp used thakur vote win big mar bjp supported bahujan samaj party bsp mayawati became chief minister uttar pradesh decision shield kunda mla raghuraj pratap singh raja bhaiya jaunpur mla dhananjay singh arrest irked kshatriya community arrests triggered revolt many kshatriya mlas assembly leadership late deoband mla rajender singh rana extending outside support samajwadi party enabled sp form government mulayam singh yadav chief minister apr since assuming power government led yogi adityanath nomination spree thakurs various institutional domains zilla parishad elections sho nominations promotion civil servants cops particular thakurs received preferential treatment yogi administration december elections five seven bjp chief ministers hindi belt thakurs hindu yuva vahini essentially thakur organisation yogi adityanath founded greatly expanded reach activities filling void criminal space left gangsters eliminated arrested driven governments drastic encounter policy edit since girls seem univocal support jatt community important note jatts make significant population rajasthan haryana punjab delhi electorally may best idea considering rj hr elections next year maybe rajput support worth states altogether",
    "cleaned_comments": "thanks definitely pull bjp booted spokesperson backlash said islam mean pretty much requirement point yet got booted meanwhile dude horrendous accusation olympic atheletes protesting bringing negative pr remains untouchable seems fishy sidelined countries ties annoyed yeah wont arrested go like soon theyll inaugurate ram mandir people vote wont take action wont lose significant vote creepy brij bhushan yeah thing isnt good pr intl relations either imagine best best athletes throwing olympic medals indian govt cant take rapist minister definitely reinforcing stereotype indians foregin perception honestly feel sick isnt given level attention nationalist things get reason nupur sharma castigated talked shit islam stuck party line shat indian muslims gulf countries wouldnt pressured modi dont think received much media attention outside like even ns said foreign media picked reached people government countries checked one two international media outlets much coverage sick man least asked resign post till investigation ongoing wont wont lose significant votes true bow like bitches mullahs claim kattarwadi lol like katwawadi twofacedness hypocrisy jingoism govt unhealthy levels high people vote caste religious politicians expect citizens better majority us wont language isnt appreciated reporting comment understandable even islam people make horrible comments everyday made direct comment prophet done would still business usual observation situation turning bjp shields brij bhushan singh jats desert bjp future elections khaps farmer organization north india jats yield enormous influence come support wrestlers also jats meanwhile brij bhushan also ramping support rajput caste looks like battle turn rajput vs jat tussle making tricky situation bjp molestor son killed fathers gun blamed edit typo link newshttpsmtimesofindiacomcitylucknowbjpmpssonshootsselfblamesfatherarticleshowcms sad thakurs support rapist rather whats right true jats sided sp state elections result significant modi let thakur vote slip away already hanging thread haryana come think jats make significant population east largest caste group rajasthan modi might betting everything tbh seems like risky gamble may also deep secrets bjp dont want spill shit hits fan makes wonder really still unsafe woman caste crime mms clip modi doubt someone secrets permanently finished caste politics remain exactly kind default people support based caste look comments people saying vote based current govt react contrary people make conscious fact everyone oppose someone crime irrespective caste belong going happen india first lady know talking jats alone check communitywise voting percentage tablehttpswwwbqprimecompoliticsupelectionresultsinchartshowbjpsmysquarebeatakhileshsmy bjp got highest share jat votes even assume share percentage points lower keep mind bjp able retain jat votes even farm protests basically large number jats decided vote bjp even tried screw found bjps antimuslim stance muzaffarnagar riots communalism seeped jats current wrestlers protest potential drive jats away bjp possiblyplus left wife sounds suspicious hence surprisingly pro lgbtq stance guess ironically middle eastuae forced goberment fire idiotsending chaddis frenzy bending hate meltdown hilarious see something similar comments section modis tweet whenever wishes muslim festivals hindu yuva vahini essentially thakur organisation yogi adityanath founded greatly expanded reach activities filling void criminal space left gangsters eliminated arrested driven governments drastic encounter policy passive process occupying space incidentally left open space deliberately created expansion godfather vin ghaslet encounters etc disgusting comment shame youre bad awww cries acche din fanta cold first lady uska bff hai chota fanta aur hi kuch hai kamra ke dono videos dekhe chota fanta wala guy literally bahubali regional admitted killing someone camera deserve mps guy literally regional yogi adityanath mafia boss saffron shawl yesgot im antimodipromodi guy like absolute free speech freedom criticise make fun personinstitution agree nupur sharmas quip agree kamras comentary agree wholeheartedly varun grovers ideas may agree say defend death right say wrongfully attributed voltaire arab countries possibly ones blatantly racist india catching get secrets leaked even finished though maybe tougher prosecute dead witness doubt bjp scared secrets might leak finishing best course action thing act deterrent others leak secrets backfire still agree likely caste politics well personal political power india caste loyalty paramount righteousness comes last khaps notorious oppressing dalits women crimes committed jat kins thats interesting table question jat leaders support movement thakurs called fucking third class upper caste imagine whole community swinging votes child molestor thanks op post numbers cheers man doubt wish didnt true jhooti izzat double check typos copy pasting sansani khusala wisdoms yup everyone knew including voters voted precisely converting orange savarna mafia state mms clip modi would become either deputy pm home minister blame bjp blame brij bhushan blame thakurs end us select assholes see criminal cases see ill gotten property gains see caste religion see goons harass people dont vote qualification good person vote based everything leader shouldnt mostly middle class youth dont even vote leading small confirmed voters majority decide politicians politicians keep happy votes mostly middle class youth dont even vote leading small confirmed voters majority decide politicians politicians keep happy votes india high participation rate across age groups western countries may problem thinking india doesnt people dont vote qualification good person vote based everything leader shouldnt vote caste reason sympathetic caste leader power help point government resources direction continue vote caste long politicians power direct government spending blame bjp blame brij bhushan blame thakurs bjp taking advantage system brij bhushan one man removed another take place system fucked end us select assholes see criminal cases see ill gotten property gains see caste religion see goons harass maybe job salariedworker class constantly protest fight back corrupt system mean feed children idk maybe fault revolution vote one many shitty choices idk well replied see meant said us good hardworking guy doctor engineer steps fight election dont vote ppl vote freebies based caste line problem voting ppl along caste line development whole still misused certain people always bjp congress entire system gone bad isnt single politician actually cares need start saying need new ppl existing ones bad instead saying one better population everything much really hard bring change corruption ingrained whole us middle class keep fighting basic things difficult accept victim blaming ultimately upto us force system improve victims even mentioned let alone blamed fault people given powers people get away use sheer power influence given people would stop supporting even knowing guilty yes sorry meant citizens also victims political system actually political system victim people need ask better things choose better hold accountable stop bootlickers politicians fighting like huge personalities give blind support fight may wrong thats think education also criteria fighting elections also age much earned years cases going politician given years term agree term limits idea",
    "light_cleaned_title": "Opinion: Why BJP wont arrest their POCSO accused MP",
    "light_cleaned_selftext": "TLDR: Thakurs play a big part in BJPs UP prospects. Plus they are very fickle and will support which ever party gives them more power. In terms of numbers, BJP* won 41% of the vote in UP elections and SP* won 32.06%. Even if half of the Thakur vote (roughly 10% of the total UP vote) shifts back to SP, that would bring SP* and BJP* to even keel, making it doubly important to appease them. While I would like to give my own opinions, I'm sharing some articles by jounalists who have put their thoughts much better than I think I can >Jan 21 2022 : Thakurs in Uttar Pradesh, despite being a powerful community that wields influence in urban and rural areas, has failed to find its voice in the corridors of power after the end of the Veer Bahadur Singh regime in 1988. > Thakurs constitute only 8 per cent of the state's population but actually own around 50 per cent of the land. Read the whole article because it covers the caste arithmetic of the other UP parties, but here is the most important bit > The opposition has even accused the Yogi government of going overboard in protecting Thakur interests and shielding Thakur criminals but the chief minister remains unapologetic about it. The below article describes how SP used the Thakur vote to win big in 2002* and again in 2012 > Mar 16, 2022 : In 2002, BJP supported the Bahujan Samaj Party (BSP) and Mayawati became the chief minister of Uttar Pradesh. But her decision not to shield Kunda MLA Raghuraj Pratap Singh (Raja Bhaiya) and Jaunpur MLA Dhananjay Singh from arrest irked the Kshatriya community. > Their arrests triggered a revolt with as many as 40 Kshatriya MLAs of the UP Assembly, under the leadership of late Deoband MLA Rajender Singh Rana, extending outside support to the Samajwadi Party. This enabled the SP to form a government in UP with Mulayam Singh Yadav as chief minister. > Apr 19, 2019 : Since assuming power in 2017, the UP government led by Yogi Adityanath has been on a nomination spree of Thakurs in various institutional domains. Be it zilla parishad elections, SHO nominations, promotion of civil servants or of cops in particular, Thakurs have received a preferential treatment from the Yogi administration. Before the December 2018 elections, five out of seven BJP chief ministers in the Hindi belt were Thakurs. > In UP, the Hindu Yuva Vahini, essentially a Thakur organisation Yogi Adityanath founded in 2002, has greatly expanded its reach and activities, filling the void in the criminal space left by gangsters who have been eliminated, arrested or driven out by the government's drastic encounter policy. Edit: Since the girls seem to have univocal support from the Jatt community, it is important to note that Jatts make up significant population in Rajasthan, Haryana, Punjab, Delhi and UP. Electorally, this may not be the best idea considering that RJ and HR have elections next year. But maybe UP Rajput support is worth more than the other states altogether?",
    "light_cleaned_comments": "Thanks he definitely has some pull. BJP booted out that spokesperson after backlash when she said about Islam (I mean that is pretty much requirement at this point yet she got booted). Meanwhile this dude has most horrendous accusation with Olympic atheletes protesting bringing in such negative PR remains untouchable, seems fishy. She was only sidelined because countries with whom we had ties with were annoyed. Yeah he won't be arrested. It will go on just like this. Soon they'll inaugurate Ram Mandir and people will vote because of that. They won't take any action because they won't lose any significant vote over that creepy Brij Bhushan. Yeah but this thing isnt a good PR in Intl relations either. Imagine your best of the best athletes throwing their olympic medals because Indian govt cant take down a rapist minister. It is definitely reinforcing the stereotype of Indians in foregin perception. I honestly feel sick this isnt being given the same level of attention all other \"nationalist\" things get. The only reason Nupur sharma was castigated was because she talked shit about Islam. If she had stuck to the party line and shat on Indian muslims, the gulf countries wouldnt have pressured Modi. I don't think this has received much media attention outside. Like even NS said all that, foreign media picked it up and it reached people in the government in other countries. I checked one or two international media outlets, not much coverage of this. So sick man, at the least he should have been asked to resign from his post till the investigation is ongoing but no. They won't because they won't lose significant votes over it. True, they bow down like bitches to mullahs and claim to be kattarwadi lol more like katwawadi. The two-facedness, hypocrisy and jingoism of this govt is at unhealthy levels high. When people vote for caste and religious politicians, what do you expect? We, as citizens, have to do better but majority of us won't do that. This language isnt appreciated. Reporting this comment Understandable Not even Islam, people make horrible comments about it everyday here. She made a direct comment about their prophet. Had she not done that, it would still have been business as usual. In my observation from how the situation is turning out as of now, if BJP shields Brij Bhushan Singh then Jats can desert BJP in future elections. Khaps and farmer organization of North India, in which Jats yield enormous influence, have come out in support of wrestlers, who are also Jats. Meanwhile, Brij Bhushan is also ramping up support for himself through his Rajput caste. It looks like battle can turn into Rajput vs. Jat tussle, making it a tricky situation for BJP. The molestor’ son killed himself with his father’s gun and blamed him for it. Edit : typo. [link to the news](https://m.timesofindia.com/city/lucknow/bjp-mps-son-shoots-self-blames-father/articleshow/744539.cms) It's sad that Thakur's will support a rapist rather than doing what's right . true Jats sided with SP in the UP state elections and the result was significant. Modi will not let Thakur vote slip away. They are already hanging by a thread in Haryana. Come to think of it, Jats make ~~a significant population in east~~ largest caste group in Rajasthan too. Modi might be betting everything on UP tbh. Seems like a risky gamble He \"may\" also have deep secrets of BJP, which they don't want him to spill out if shit hits the fan. Makes you wonder if we really are in 2023 where it’s still unsafe to be a woman. Caste before crime. MMS clip of Modi? Doubt it. Someone with secrets can be permanently finished off. Caste politics will remain Exactly, it's kind of default for people to support based on their caste just look at the comments here only when people are saying that who will vote for who based on how current govt react. On the contrary, people should make other conscious of the fact that how everyone should oppose if someone is in crime irrespective of the caste they belong to. But this is not going to happen in India. With the first lady? *(you know who)* Talking about Jats of UP alone, check out community-wise voting percentage in the [table](https://www.bqprime.com/politics/up-election-results-in-charts-how-bjps-my-square-beat-akhileshs-my). BJP got highest share of Jat votes. Even if we assume that the share is 10 percentage points lower, keep in this mind that BJP was able to retain its Jat votes even after farm protests. So basically large number of Jats decided to vote for BJP even after it tried to screw them over because they found BJP's anti-Muslim stance. After the Muzaffarnagar riots of 2013, communalism has seeped into Jats, current wrestlers protest has the potential to drive Jats away from BJP. Possibly...Plus he left his wife too. Sounds suspicious!!! hence the surprisingly pro LGBTQ stance I guess ironically they were middle east/UAE who forced goberment to fire that idiot...sending all the chaddis into a frenzy for bending to the will of those who they hate the most. That meltdown was hilarious. You see something similar under the comments section of Modi's tweet whenever he wishes on any Muslim festivals. >In UP, the Hindu Yuva Vahini, essentially a Thakur organisation Yogi Adityanath founded in 2002, has greatly expanded its reach and activities, filling the void in the criminal space left by gangsters who have been eliminated, arrested or driven out by the government's drastic encounter policy. This was not a passive process of occupying space that was incidentally left open. The space was deliberately created for their expansion by their own godfather, vin ghaslet, through encounters etc. Disgusting comment. Shame on you. You're as bad as them. awww *\\*cries in acche din\\** Fanta? That was cold. first lady uska bff hai. chota fanta to aur hi kuch hai. kamra ke dono videos dekhe? chota fanta wala? The guy is literally Bahubali - regional don. He has admitted killing someone on camera We deserve such MPs The guy is literally a regional don. Yogi adityanath is mafia boss in saffron shawl Yes...got it 😂 I'm not an anti-modi/pro-modi guy. I just like absolute free speech; the freedom to criticise and make fun of any person/institution. So I agree with Nupur Sharma's quip. I agree with most of Kamra's comentary. I agree whole-heartedly with Varun Grover's ideas. *I may not agree with what you have to say, but I will defend to the death your right to say it. - wrongfully attributed to Voltaire* The Arab countries are possibly the only ones more blatantly racist than india. But we are catching up. You can get secrets leaked even if you are finished off, though it maybe tougher to prosecute with a dead witness. I doubt BJP are scared of any secrets that might leak , but if there are, finishing him off is not the best course of action. Only thing is, it will act as a deterrent for others to leak secrets but that can backfire too. Still, I agree with you its likely to be caste politics (and well his own personal political power). In India, caste loyalty is paramount, righteousness comes at last. Khaps too are notorious for oppressing Dalits and women, when crimes are committed by their own Jat kins. That's an interesting table. The question is if the Jat leaders support this movement? Thakurs - the so called fucking third class upper caste , imagine whole community swinging votes for a child molestor .Thanks OP for the post and numbers Cheers man No doubt. I wish we didnt Very true. 'Jhooti izzat' double check for typos when copy pasting Sansani Khusala wisdoms !! Yup. And everyone knew that. Including his voters, who voted for him precisely because he was converting UP into an orange savarna mafia state. With mms clip of Modi, he would become either deputy PM or home minister So we blame bjp? Or we blame brij bhushan? Or we blame the thakurs? In the end its us, we select such assholes, we see their criminal cases, we see their ill gotten property and gains, we see that they are the same caste or religion, we see their goons and how they harass. We the people don't vote on qualification and how good the person is, we vote based on everything that a leader shouldn't have. Mostly the middle class and youth don't even vote, leading to small confirmed voters being the majority who decide on such politicians and who the politicians keep happy for votes. > Mostly the middle class and youth don't even vote, leading to small confirmed voters being the majority who decide on such politicians and who the politicians keep happy for votes. India has high participation rate across all age groups. Western countries may have the problem you are thinking of. India doesnt. > We the people don't vote on qualification and how good the person is, we vote based on everything that a leader shouldn't have. We vote by caste. The reason we do this is because when a sympathetic caste leader is in power, he will help point government resources in your direction. We will continue to vote by caste as long as politicians have the power to direct government spending. > So we blame bjp? Or we blame brij bhushan? Or we blame the thakurs? No. BJP is just taking advantage of the system. Brij Bhushan is one man. If he is removed another will take his place. The system is fucked. > In the end its us, we select such assholes, we see their criminal cases, we see their ill gotten property and gains, we see that they are the same caste or religion, we see their goons and how they harass. Maybe. It is not the job of salaried/worker class to constantly protest and fight back against a corrupt system. I mean how will we feed our children then? Idk. Maybe it is our fault. Do we do a revolution? We have to vote for one of many shitty choices. idk. Very well replied. But you see, what i meant when i said its us is, when a good hardworking guy or a doctor or an engineer steps up to fight in election, we don't vote for him, the ppl vote for freebies and based on caste line. And the problem with voting for ppl along caste line is the development is not as a whole. Its still misused by certain people always. And its not about bjp or congress. Our entire system is gone bad, there isn't a single politician who actually cares. We need to start saying we need new ppl and all of the existing ones are bad instead of saying this one is better than him and all that. Our population and everything is so much, its really hard to bring change. Corruption is ingrained as a whole and us middle class keep fighting for basic things. It is difficult for me to accept victim blaming. But ultimately it is upto us to force the system to improve. Victims should not even be mentioned let alone blamed. They are not at the fault here. We as a people have given powers to such people, who can get away with the use of sheer power and influence given to them by people, who would not stop supporting him even after knowing he is guilty. Yes, sorry, I meant that we as citizens are also victims of our political system. Actually no, the political system is a victim of people. We need to ask better things, choose better, hold them accountable, stop being bootlickers of politicians, and fighting about them like they are huge personalities, but we give blind support to them, fight for them. I may be wrong, but thats what i think. Education should also be a criteria for fighting elections. Also age , how much they earned in 5 years, cases going on them. And no politician should be given more than 10 years of term. Agree with the term limits idea"
}