{
    "id": "16fpi4o",
    "title": "#netneutrality | Hello internet freedom fighters⚠️ TRAI is wondering whether “OTT” space should be policed — & your telecom service providers (TSPs) believe IT SHOULD❗ It is time to fight back, and #SaveTheInternet again. Here's how you can help.",
    "url": "https://www.reddit.com/r/india/comments/16fpi4o/netneutrality_hello_internet_freedom_fighters/",
    "selftext": "Last month, TRAI released a consultation paper proposing the regulation, licensing, and banning of OTT communication services, and some of the comments it received on the paper are alarming. The likes of Reliance Jio, Airtel, Vodafone Idea and BSNL are pushing for a “same service, same rules” argument to levy the same obligations and encumbrances as TSPs face in India on OTT services — simply because OTTs are delivered “on top” of their infrastructure. Additionally, telcos want OTTs to pay them for using their infrastructure, while claiming that this will not threaten net neutrality. We, at IFF, strongly oppose these stances as they will have consequences for user autonomy, rights, safety, and net neutrality. This may also lead to obligations to weaken end-to-end encryption, to intercept personal communication: calls, messages, voicenotes, and so on.\n\nThere is no other way to put it: our internet is in crisis, and we need to save it again. #SaveTheInternet. \n\n## Write to TRAI\n\n## [https://internetfreedom.in/letter-to-trai-to-protect-net-neutrality-again/](https://internetfreedom.in/letter-to-trai-to-protect-net-neutrality-again/)\n\n\\[If the above method doesn’t work for you, please find the relevant details for sending the email, including the draft text for counter-comments [**here**](https://docs.google.com/document/d/1VUBpje6_dVceqkHkMir2vBZfE6hDafYEVVQd7jcgi44/edit?usp=sharing)\\]\n\nRead our response to TRAI’s consultation paper on OTT Regulation and Selective Banning: [https://internetfreedom.in/consultation-response-to-ott-regulation-and-selective-banning/](https://internetfreedom.in/consultation-response-to-ott-regulation-and-selective-banning/)\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 32,
    "created_utc": 1694419568.0,
    "convurl": "https://external-preview.redd.it/xl9312awVEalZfiWHSkovl6_1r_r8DisVbozR3L5xrg.jpg",
    "comments": [
        "This is extremely important for all us internet users, it attacks net neutrality, please do the needful everyone.",
        "greedy bois",
        "Why is it asking for Organisation in the form? Or am I misunderstanding it?",
        "Can someone explain....in easier language?",
        "This whole 'OTTs should pay their fair share' douchebaggery comes from self-proclaimed thought leaders who have no basis for their arguments. Didn't work in Korea, isn't working in Europe (despite their Telcos publishing tens of clearly biased whitepapers which get quoted the world over). Should absolutely not work in India where Telcos own their own streaming services.",
        "Done",
        "Why should govt. not regulate speech? Why are pvt. organisations better poised to regulate speech? \n\nSocial Media has done a rather terrific job polarising electorates in absence of regulations, why don't we all help OTT platforms do the same!! Let's help them avoid any censorship and produce 10 diverse shows scripting the replacement of the Constitution with the Manusmriti. :-)",
        "OTT communication service means WhatsApp or similar apps. The Indian ISPs(Jio, Airtel etc...) want the same rules apply to as it applies to SMS. That means, WhatsApp has to store and provide plain text (i.e., not encrypted) when Govt asks for. WhatApp does End-to-end encryption which means it cannot produce plain text and doesn't store the data.\n\nI seriously doubt that ISPs care about all that. What they want is next part which is to charge OTT service providers as they use the bandwidth. But, ISPs are already charging their subscribers (i.e., Us, the hapless consumers). That means they want to charge Youtube, Netflix, WhatsApp etc.. That means if some young Indian entrepreneur wants create his or her own WhatsApp or Youtube they have to shell out lots of lots of money which will basically put an end to any sort of start-up which uses the internet.\n\nBasically ISPs want to double charge users as well as the service providers for using the same bandwidth. For now ISPs want to charge communication apps, but soon they'll want netflix, youtube etc.. to pay them as well.",
        "What's worrisome is that BSNL too is in on this. BSNL is owned by government which means government wants it too?",
        "Do not allow the internet to convert the internet into Cable TV. Say no to policing.",
        "For whatsapp, pay 30 rs monthly extra, for FB, 35, for twitter 10rs, for gmail 130.",
        "I remember the time when AIB made 3 videos against airtel and stood up for net neutrality in 2015 \n\nWhen airtel was trying to throttle websites which didn’t pay them money\n\nDamn acche din toh 2015 ke phele the",
        "How many times do we need to fight for net neutrality.\nIt seems every 5 year these companies cone up with some new evil plan to destroy internet and create monopoly.",
        "Yesssss... I too remember those videos...",
        "Important note,  if writing any letter to TRAI, do it from a disposable or unimportant email id. TRAI has a habit of leaking email addresses. \n\n\nhttps://www.indiatimes.com/news/india/we-wanted-netneutrality-trai-just-leaked-a-million-indian-email-addresses-of-the-people-who-spoke-up-for-it-instead-232194.html",
        "Everybody please ensure that you ask your friends and family to sign the petition and send it and help those who are not that into understanding the way to send it etc.",
        "it isnt mandatory",
        "also lets retweet,pin it to our fb pages,sned in watsapp groups etc.please circulate this far and wide.Our collective protest is the only way to stop this against the wealth and might of telcos and ISPs",
        "also tweet to ur mps,the PMO twitter account,Ashwini vaishnavs twitter account and all other parties twitter accounts and get this noticed",
        "nope.Maybe the govt wanst to like way back in 2015but if u send in your comments and make noise it will step back like DOT,TRAI and the govt did in [2015.It](https://2015.It) was much worse then.",
        "Yup and they will keep trying.We have to keep on holding them back.",
        "Done my part.",
        "Exactly, they ruined the already bad television space with so called \"giving options to customers\".\n\nThey created a huge road block for newer channels to enter the market.",
        "Done within seconds, thanks guys for making it so easy",
        ":melting face emoji",
        "Hi, we've fixed this!"
    ],
    "cleaned_text": "netneutrality hello internet freedom fighters trai wondering whether ott space policed telecom service providers tsps believe time fight back savetheinternet heres help last month trai released consultation paper proposing regulation licensing banning ott communication services comments received paper alarming likes reliance jio airtel vodafone idea bsnl pushing service rules argument levy obligations encumbrances tsps face india ott services simply otts delivered top infrastructure additionally telcos want otts pay using infrastructure claiming threaten net neutrality iff strongly oppose stances consequences user autonomy rights safety net neutrality may also lead obligations weaken endtoend encryption intercept personal communication calls messages voicenotes way put internet crisis need save savetheinternet write trai httpsinternetfreedominlettertotraitoprotectnetneutralityagainhttpsinternetfreedominlettertotraitoprotectnetneutralityagain method doesnt work please find relevant details sending email including draft text countercomments herehttpsdocsgooglecomdocumentdvubpjedvceqkhkmirvbzfehdafyevvqdjcgiedituspsharing read response trais consultation paper ott regulation selective banning httpsinternetfreedominconsultationresponsetoottregulationandselectivebanninghttpsinternetfreedominconsultationresponsetoottregulationandselectivebanning xb ",
    "cleaned_title": "netneutrality hello internet freedom fighters trai wondering whether ott space policed telecom service providers tsps believe time fight back savetheinternet heres help",
    "cleaned_selftext": "last month trai released consultation paper proposing regulation licensing banning ott communication services comments received paper alarming likes reliance jio airtel vodafone idea bsnl pushing service rules argument levy obligations encumbrances tsps face india ott services simply otts delivered top infrastructure additionally telcos want otts pay using infrastructure claiming threaten net neutrality iff strongly oppose stances consequences user autonomy rights safety net neutrality may also lead obligations weaken endtoend encryption intercept personal communication calls messages voicenotes way put internet crisis need save savetheinternet write trai httpsinternetfreedominlettertotraitoprotectnetneutralityagainhttpsinternetfreedominlettertotraitoprotectnetneutralityagain method doesnt work please find relevant details sending email including draft text countercomments herehttpsdocsgooglecomdocumentdvubpjedvceqkhkmirvbzfehdafyevvqdjcgiedituspsharing read response trais consultation paper ott regulation selective banning httpsinternetfreedominconsultationresponsetoottregulationandselectivebanninghttpsinternetfreedominconsultationresponsetoottregulationandselectivebanning xb",
    "cleaned_comments": "extremely important us internet users attacks net neutrality please needful everyone greedy bois asking organisation form misunderstanding someone explainin easier language whole otts pay fair share douchebaggery comes selfproclaimed thought leaders basis arguments didnt work korea isnt working europe despite telcos publishing tens clearly biased whitepapers get quoted world absolutely work india telcos streaming services done govt regulate speech pvt organisations better poised regulate speech social media done rather terrific job polarising electorates absence regulations dont help ott platforms lets help avoid censorship produce diverse shows scripting replacement constitution manusmriti ott communication service means whatsapp similar apps indian ispsjio airtel etc want rules apply applies sms means whatsapp store provide plain text ie encrypted govt asks whatapp endtoend encryption means produce plain text doesnt store data seriously doubt isps care want next part charge ott service providers use bandwidth isps already charging subscribers ie us hapless consumers means want charge youtube netflix whatsapp etc means young indian entrepreneur wants create whatsapp youtube shell lots lots money basically put end sort startup uses internet basically isps want double charge users well service providers using bandwidth isps want charge communication apps soon theyll want netflix youtube etc pay well whats worrisome bsnl bsnl owned government means government wants allow internet convert internet cable tv say policing whatsapp pay rs monthly extra fb twitter rs gmail remember time aib made videos airtel stood net neutrality airtel trying throttle websites didnt pay money damn acche din toh ke phele many times need fight net neutrality seems every year companies cone new evil plan destroy internet create monopoly yesssss remember videos important note writing letter trai disposable unimportant email id trai habit leaking email addresses everybody please ensure ask friends family sign petition send help understanding way send etc isnt mandatory also lets retweetpin fb pagessned watsapp groups etcplease circulate far wideour collective protest way stop wealth might telcos isps also tweet ur mpsthe pmo twitter accountashwini vaishnavs twitter account parties twitter accounts get noticed nopemaybe govt wanst like way back u send comments make noise step back like dottrai govt ithttpsit much worse yup keep tryingwe keep holding back done part exactly ruined already bad television space called giving options customers created huge road block newer channels enter market done within seconds thanks guys making easy melting face emoji hi weve fixed",
    "light_cleaned_title": "#netneutrality | Hello internet freedom fighters⚠️ TRAI is wondering whether “OTT” space should be policed — & your telecom service providers (TSPs) believe IT SHOULD❗ It is time to fight back, and #SaveTheInternet again. Here's how you can help.",
    "light_cleaned_selftext": "Last month, TRAI released a consultation paper proposing the regulation, licensing, and banning of OTT communication services, and some of the comments it received on the paper are alarming. The likes of Reliance Jio, Airtel, Vodafone Idea and BSNL are pushing for a “same service, same rules” argument to levy the same obligations and encumbrances as TSPs face in India on OTT services — simply because OTTs are delivered “on top” of their infrastructure. Additionally, telcos want OTTs to pay them for using their infrastructure, while claiming that this will not threaten net neutrality. We, at IFF, strongly oppose these stances as they will have consequences for user autonomy, rights, safety, and net neutrality. This may also lead to obligations to weaken end-to-end encryption, to intercept personal communication: calls, messages, voicenotes, and so on. There is no other way to put it: our internet is in crisis, and we need to save it again. #SaveTheInternet. ## Write to TRAI ## [https://internetfreedom.in/letter-to-trai-to-protect-net-neutrality-again/](https://internetfreedom.in/letter-to-trai-to-protect-net-neutrality-again/) \\[If the above method doesn’t work for you, please find the relevant details for sending the email, including the draft text for counter-comments [**here**](https://docs.google.com/document/d/1VUBpje6_dVceqkHkMir2vBZfE6hDafYEVVQd7jcgi44/edit?usp=sharing)\\] Read our response to TRAI’s consultation paper on OTT Regulation and Selective Banning: [https://internetfreedom.in/consultation-response-to-ott-regulation-and-selective-banning/](https://internetfreedom.in/consultation-response-to-ott-regulation-and-selective-banning/) &#x200B;",
    "light_cleaned_comments": "This is extremely important for all us internet users, it attacks net neutrality, please do the needful everyone. greedy bois Why is it asking for Organisation in the form? Or am I misunderstanding it? Can someone explain....in easier language? This whole 'OTTs should pay their fair share' douchebaggery comes from self-proclaimed thought leaders who have no basis for their arguments. Didn't work in Korea, isn't working in Europe (despite their Telcos publishing tens of clearly biased whitepapers which get quoted the world over). Should absolutely not work in India where Telcos own their own streaming services. Done Why should govt. not regulate speech? Why are pvt. organisations better poised to regulate speech? Social Media has done a rather terrific job polarising electorates in absence of regulations, why don't we all help OTT platforms do the same!! Let's help them avoid any censorship and produce 10 diverse shows scripting the replacement of the Constitution with the Manusmriti. :-) OTT communication service means WhatsApp or similar apps. The Indian ISPs(Jio, Airtel etc...) want the same rules apply to as it applies to SMS. That means, WhatsApp has to store and provide plain text (i.e., not encrypted) when Govt asks for. WhatApp does End-to-end encryption which means it cannot produce plain text and doesn't store the data. I seriously doubt that ISPs care about all that. What they want is next part which is to charge OTT service providers as they use the bandwidth. But, ISPs are already charging their subscribers (i.e., Us, the hapless consumers). That means they want to charge Youtube, Netflix, WhatsApp etc.. That means if some young Indian entrepreneur wants create his or her own WhatsApp or Youtube they have to shell out lots of lots of money which will basically put an end to any sort of start-up which uses the internet. Basically ISPs want to double charge users as well as the service providers for using the same bandwidth. For now ISPs want to charge communication apps, but soon they'll want netflix, youtube etc.. to pay them as well. What's worrisome is that BSNL too is in on this. BSNL is owned by government which means government wants it too? Do not allow the internet to convert the internet into Cable TV. Say no to policing. For whatsapp, pay 30 rs monthly extra, for FB, 35, for twitter 10rs, for gmail 130. I remember the time when AIB made 3 videos against airtel and stood up for net neutrality in 2015 When airtel was trying to throttle websites which didn’t pay them money Damn acche din toh 2015 ke phele the How many times do we need to fight for net neutrality. It seems every 5 year these companies cone up with some new evil plan to destroy internet and create monopoly. Yesssss... I too remember those videos... Important note, if writing any letter to TRAI, do it from a disposable or unimportant email id. TRAI has a habit of leaking email addresses. Everybody please ensure that you ask your friends and family to sign the petition and send it and help those who are not that into understanding the way to send it etc. it isnt mandatory also lets retweet,pin it to our fb pages,sned in watsapp groups etc.please circulate this far and wide.Our collective protest is the only way to stop this against the wealth and might of telcos and ISPs also tweet to ur mps,the PMO twitter account,Ashwini vaishnavs twitter account and all other parties twitter accounts and get this noticed nope.Maybe the govt wanst to like way back in 2015but if u send in your comments and make noise it will step back like DOT,TRAI and the govt did in [2015.It](https://2015.It) was much worse then. Yup and they will keep trying.We have to keep on holding them back. Done my part. Exactly, they ruined the already bad television space with so called \"giving options to customers\". They created a huge road block for newer channels to enter the market. Done within seconds, thanks guys for making it so easy :melting face emoji Hi, we've fixed this!"
}