{
    "id": "188wk9x",
    "title": "Netflix, Viacom18 among streaming firms set to oppose India broadcasting bill-sources",
    "url": "https://www.reuters.com/world/india/netflix-viacom18-among-streaming-firms-set-oppose-india-broadcasting-bill-2023-12-01/",
    "selftext": "Viacom18 is majorly owned by Reliance. The only time, I am hoping for some Corporate influence on government policies.",
    "flair": "Law & Courts",
    "score": 84,
    "num_comments": 3,
    "created_utc": 1701494761.0,
    "convurl": "https://external-preview.redd.it/hgrXlGHQ438ODDrN9c6zMYJteAVmtf5x5tf4nEsiP1Q.jpg?auto=webp&s=d82a33c50bdec6abb1f9443a4ddee1ebac23eb37",
    "comments": [
        "Just saw the National Geography Documentary on Elections in India, and it's nothing more than a paid election campaign.",
        "Yeah use the taxes for that, cuntry is still a shit hole and they want to turn it even more suffocating. If this passes and is executed well then Netflix will become like jiosaneema, remember vpns at least on paper are banned too.\n\nAlthough, Ambani is against it so I guess vishwaguru will not pass it or pass it in a manner that doesn't harm ambani......maybe that's why it was introduced.",
        "Will they review international content too? Indian content need no censorship as the movies are already being cut nonsensically"
    ],
    "cleaned_text": "netflix viacom among streaming firms set oppose india broadcasting billsources viacom majorly owned reliance time hoping corporate influence government policies ",
    "cleaned_title": "netflix viacom among streaming firms set oppose india broadcasting billsources",
    "cleaned_selftext": "viacom majorly owned reliance time hoping corporate influence government policies",
    "cleaned_comments": "saw national geography documentary elections india nothing paid election campaign yeah use taxes cuntry still shit hole want turn even suffocating passes executed well netflix become like jiosaneema remember vpns least paper banned although ambani guess vishwaguru pass pass manner doesnt harm ambanimaybe thats introduced review international content indian content need censorship movies already cut nonsensically",
    "light_cleaned_title": "Netflix, Viacom18 among streaming firms set to oppose India broadcasting bill-sources",
    "light_cleaned_selftext": "Viacom18 is majorly owned by Reliance. The only time, I am hoping for some Corporate influence on government policies.",
    "light_cleaned_comments": "Just saw the National Geography Documentary on Elections in India, and it's nothing more than a paid election campaign. Yeah use the taxes for that, cuntry is still a shit hole and they want to turn it even more suffocating. If this passes and is executed well then Netflix will become like jiosaneema, remember vpns at least on paper are banned too. Although, Ambani is against it so I guess vishwaguru will not pass it or pass it in a manner that doesn't harm ambani......maybe that's why it was introduced. Will they review international content too? Indian content need no censorship as the movies are already being cut nonsensically"
}