{
    "id": "17cbxxp",
    "title": "PSA: A Step by Step Guide to dealing with Notice / Penalty under section 112(a) of Customs Act for import of obscene item or import of e-juice etc.",
    "url": "https://www.reddit.com/r/india/comments/17cbxxp/psa_a_step_by_step_guide_to_dealing_with_notice/",
    "selftext": "While there is at least one Kolkata High Court order of 2011 that items for personal use are not an offence under Customs Act for obscenity, getting Customs to follow the law rather than moral policing is a tough nut. If you are a law/customs student with time on hand, this can be a good practice case in customs procedure.  \n\n**What should you do when you receive first Notice or Notice for personal hearing?**\n\nStopping this bullshit it at this point is the easiest and most effective. On a plain paper, write a response denying ordering the contents and that they have been shipped without your consent. “Hence I pray that the parcel may be confiscated and issue may be closed without further action” \nSend the letter via Registered Post Return Receipt (it provides you proof that it is delivered) to the same address you get the notice from. Hopefully this will end the matter. 50-50 chance. \n\n**What to do if penalty has been imposed?**\nYou will get a registered post letter with reference of “Order In Original No. XXX dated xx/xx/xxx”. Don’t worry about it too much. Figure out the Main Branch of SBI in your city that accepts Customs Duty payments.  \n\nStep 1: Print four copies of TR6 Challan\n[TR6 Challan](https://dokumen.tips/documents/form-tr-6-2-all-indian-taxes-tr-6-major-head-0037-custom-duties-tr-6gar7-challan.html?page=1)\nThis form is easily available on Google search. Just use one for customs. Different departments have created various versions of it. \nFill the following fields \n1. Division: City Customs P.A.D. (postal assessment divison); leave others blank. \n2. Name and Address of Assessee: Your name and short address \n3. In Particulars Column; Fill “With respect to Penalty for Order in Original No. XXX dated xx/xx/xxxx”\n4. Head of Accounts and Major Head: 0037 - Customs Duties \n5. Fill Amount under Cash column, total and in words \n6. Sign\n\nStep 2: Go to SBI Main Branch (google which branch in your city accept Customs Fee deposits).\nEnquire on which counter customs payments are made. The Cashier may direct you to someone at another counter to enquire the Account Number of Customs PAD if they do not know it. \nAccount No: 10977270960 for Bengaluru City Customs\nPay the amount and get two copies of the TR6 challan back after they have been stamped and signed. \n\nStep 3: Deposit One Copy of TR6 Challan and a photocopy of the penalty letter at Customs Section in Foreign Parcel Post Office. Or you can send it via registered post with return receipt to the same address in penalty letter. Write a two line cover letter sayings it’s done.\n\nStep 4: Keep 4th copy of TR6 and Return Receipt (if sent via post) for your personal records in case needed in future.\n\nDon’t be in a rush. You can take your time to do all this. \n\nHowever best is to buy domestically. Sab milta hai!",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697810347.0,
    "convurl": "https://external-preview.redd.it/4dQv1vrSqSAAmT3ZEMUyKyZBOXzKJFOSJ0UnZGvCw1E.jpg?auto=webp&s=72c7e96479cb4d0326f55d8e11f25a9b6d5d3b3d",
    "comments": [
        "You can buy and come to India through nepal",
        "Everything is available online domestically cheap now. Why spend time and money to travel via Nepal. Not advisable.",
        "Na man. Quality and custom penis sleeves are not available in India or any Indian adult site"
    ],
    "cleaned_text": "psa step step guide dealing notice penalty section customs act import obscene item import ejuice etc least one kolkata high court order items personal use offence customs act obscenity getting customs follow law rather moral policing tough nut lawcustoms student time hand good practice case customs procedure receive first notice notice personal hearing stopping bullshit point easiest effective plain paper write response denying ordering contents shipped without consent hence pray parcel may confiscated issue may closed without action send letter via registered post return receipt provides proof delivered address get notice hopefully end matter chance penalty imposed get registered post letter reference order original xxx dated xxxxxxx dont worry much figure main branch sbi city accepts customs duty payments step print four copies tr challan tr challanhttpsdokumentipsdocumentsformtrallindiantaxestrmajorheadcustomdutiestrgarchallanhtmlpage form easily available google search use one customs different departments created various versions fill following fields division city customs pad postal assessment divison leave others blank name address assessee name short address particulars column fill respect penalty order original xxx dated xxxxxxxx head accounts major head customs duties fill amount cash column total words sign step go sbi main branch google branch city accept customs fee deposits enquire counter customs payments made cashier may direct someone another counter enquire account number customs pad know account bengaluru city customs pay amount get two copies tr challan back stamped signed step deposit one copy tr challan photocopy penalty letter customs section foreign parcel post office send via registered post return receipt address penalty letter write two line cover letter sayings done step keep th copy tr return receipt sent via post personal records case needed future dont rush take time however best buy domestically sab milta hai ",
    "cleaned_title": "psa step step guide dealing notice penalty section customs act import obscene item import ejuice etc",
    "cleaned_selftext": "least one kolkata high court order items personal use offence customs act obscenity getting customs follow law rather moral policing tough nut lawcustoms student time hand good practice case customs procedure receive first notice notice personal hearing stopping bullshit point easiest effective plain paper write response denying ordering contents shipped without consent hence pray parcel may confiscated issue may closed without action send letter via registered post return receipt provides proof delivered address get notice hopefully end matter chance penalty imposed get registered post letter reference order original xxx dated xxxxxxx dont worry much figure main branch sbi city accepts customs duty payments step print four copies tr challan tr challanhttpsdokumentipsdocumentsformtrallindiantaxestrmajorheadcustomdutiestrgarchallanhtmlpage form easily available google search use one customs different departments created various versions fill following fields division city customs pad postal assessment divison leave others blank name address assessee name short address particulars column fill respect penalty order original xxx dated xxxxxxxx head accounts major head customs duties fill amount cash column total words sign step go sbi main branch google branch city accept customs fee deposits enquire counter customs payments made cashier may direct someone another counter enquire account number customs pad know account bengaluru city customs pay amount get two copies tr challan back stamped signed step deposit one copy tr challan photocopy penalty letter customs section foreign parcel post office send via registered post return receipt address penalty letter write two line cover letter sayings done step keep th copy tr return receipt sent via post personal records case needed future dont rush take time however best buy domestically sab milta hai",
    "cleaned_comments": "buy come india nepal everything available online domestically cheap spend time money travel via nepal advisable na man quality custom penis sleeves available india indian adult site",
    "light_cleaned_title": "PSA: A Step by Step Guide to dealing with Notice / Penalty under section 112(a) of Customs Act for import of obscene item or import of e-juice etc.",
    "light_cleaned_selftext": "While there is at least one Kolkata High Court order of 2011 that items for personal use are not an offence under Customs Act for obscenity, getting Customs to follow the law rather than moral policing is a tough nut. If you are a law/customs student with time on hand, this can be a good practice case in customs procedure. **What should you do when you receive first Notice or Notice for personal hearing?** Stopping this bullshit it at this point is the easiest and most effective. On a plain paper, write a response denying ordering the contents and that they have been shipped without your consent. “Hence I pray that the parcel may be confiscated and issue may be closed without further action” Send the letter via Registered Post Return Receipt (it provides you proof that it is delivered) to the same address you get the notice from. Hopefully this will end the matter. 50-50 chance. **What to do if penalty has been imposed?** You will get a registered post letter with reference of “Order In Original No. XXX dated xx/xx/xxx”. Don’t worry about it too much. Figure out the Main Branch of SBI in your city that accepts Customs Duty payments. Step 1: Print four copies of TR6 Challan [TR6 Challan](https://dokumen.tips/documents/form-tr-6-2-all-indian-taxes-tr-6-major-head-0037-custom-duties-tr-6gar7-challan.html?page=1) This form is easily available on Google search. Just use one for customs. Different departments have created various versions of it. Fill the following fields 1. Division: City Customs P.A.D. (postal assessment divison); leave others blank. 2. Name and Address of Assessee: Your name and short address 3. In Particulars Column; Fill “With respect to Penalty for Order in Original No. XXX dated xx/xx/xxxx” 4. Head of Accounts and Major Head: 0037 - Customs Duties 5. Fill Amount under Cash column, total and in words 6. Sign Step 2: Go to SBI Main Branch (google which branch in your city accept Customs Fee deposits). Enquire on which counter customs payments are made. The Cashier may direct you to someone at another counter to enquire the Account Number of Customs PAD if they do not know it. Account No: 10977270960 for Bengaluru City Customs Pay the amount and get two copies of the TR6 challan back after they have been stamped and signed. Step 3: Deposit One Copy of TR6 Challan and a photocopy of the penalty letter at Customs Section in Foreign Parcel Post Office. Or you can send it via registered post with return receipt to the same address in penalty letter. Write a two line cover letter sayings it’s done. Step 4: Keep 4th copy of TR6 and Return Receipt (if sent via post) for your personal records in case needed in future. Don’t be in a rush. You can take your time to do all this. However best is to buy domestically. Sab milta hai!",
    "light_cleaned_comments": "You can buy and come to India through nepal Everything is available online domestically cheap now. Why spend time and money to travel via Nepal. Not advisable. Na man. Quality and custom penis sleeves are not available in India or any Indian adult site"
}