{
    "id": "1de86x6",
    "title": "What's wrong with Indians ",
    "url": "https://www.reddit.com/gallery/1de86x6",
    "selftext": "Everytime I open my Twitter or Instagram, there are a lot of negative content based on religion spread. And unsurprisingly most are uploaded my an India , either in form of a comment, story, reels or as a tweet. \n\nLook at the images attached, A indian man (Hindu) is telling , he doesn't abuse any religion but comes up to defend when his religion is attacked . Unsurprisingly it was an Indian man also a Hindu, who started an online abuse and hatred content against Jesus. It's been 2000 years since Jesus left and his guy comes up shaming him and his community. \n\nWhen will Indians , respective of whichever religion they follow ,  Stop spreading communal hate everyday online for the same of views, like or to fulfill their desires of communal hatred. There's kind of posts are the main reasons for hatred towards Indians and Hindu community worldwide, and brings a huge disgrace towards us.",
    "flair": "Rant / Vent",
    "score": 34,
    "num_comments": 70,
    "created_utc": 1718202943.0,
    "convurl": "https://i.redd.it/xdiw39ohj56d1.jpg",
    "comments": [
        "Too much internet but not enough education",
        "“The world and its desires pass away, but whoever does the will of God lives forever.” John 2:9-17\n\nGod can have any name, the devil is the one without any!! \n\nIgnore, pray for them and move on! That’s what I do.✌️",
        "Some people don’t deserve to have internet access, or phones for that matter.",
        "this is what happens when people live in a bubble",
        "My eyes",
        "Bro, put the nsfw tag.\n\nI wasn't ready for the Jesus pinned part, please put nsfw tag.",
        "Religion is definitely important in India. But in recent days insulting other religion has become more important.",
        "Ngl but that position got me  🙄",
        "these are paid accounts of bjp it cell/ right wing organisations, and elon has given them a platform to express \"freedom of speech\" on twitter\n\ncompare them to stray dogs, but the difference now is elon has locked up the stray animal catchers",
        "I'll pray for them",
        "OMG. Didn't notice it until you said 💀",
        "A piece of shit is a piece of shit, regardless of where they call home or what beliefs they may / may not have. All they have to show for their pathetic lives is the ability to shit post online, so don't give 'em the time of day and then, once nobody has given them the reaction they sought, they'll be posting about how they want to end it all...",
        "Hame bas Tamas to bahdava dena hai\n\nhttps://preview.redd.it/8xcv7g4kn56d1.jpeg?width=640&format=pjpg&auto=webp&s=7be440cbe7e99333e66959e00322db4b97d449e1",
        "anybody concerned with countering this (or the other posts in this thread)\n\n\\[NSFW\\] here is the link\n\n[https://x.com/DesiKing\\_/status/1800516583296815288](https://x.com/DesiKing_/status/1800516583296815288)\n\ngo click report > hate > hateful imagery \\[or whatever you find appropriate \n\ntake action, this filth has spread too far, 20% of population with even miniscule percent of RW troll accounts are contributing a huge number of filthy vile posts\n\nthe dipshit elon musk doesnt care",
        "im realy sick of this, we proper laws regarding what will be allowed and what not, im not sure what the course of action is for me to take,\n\nDo I have to write to IT minister? This is really disturbing, I want to see all these accounts closed and this person arrested",
        "r/jiowasamistake",
        "These bjp paid it cell buggers hate everyone except uc hindus.",
        "This is what happens when roadside chhapris get access to cheap internet.",
        "They even abuse Modi since he is OBC, call him maulana.",
        "The problem is that some of them have their ego so high up their ass that they forget to think there exists a reality , religion and culture outside India. These people have very likely never left their hometown and therefore is not subjected to any change of reality.",
        "Twitter was always toxic. But this is a new low. Like Mike Tyson said \"Social media made y'all way too comfortable with disrespecting people and not getting punched in the face for it.”.",
        "Third pic 💀💀",
        "Post the tweets screenshots abusing and defaming India.",
        "We need a vigilante to beat the shit out of this degenerate shit. They deserve belt treatment. They're destabilizing Indian society with their provocative tweets and blabbers.",
        "Chill bro, it's just one guy from our religion, pretty sure you'd find fanatics in every other religion",
        "Unfortunately it will take 1-2 generations, to un-brainwash the people. The damage our fascist government did to the youth, for votes only.",
        "My imaginary sky friend is better than yours. Lmao",
        "That was really unnecessary and shows how narrow minded they are.",
        "I Prefer medium well.",
        "r/jiowasamistake",
        "India cannot survive if christians disappear hypothetically. Almost 70% schools are convent schools and it is very common among parents to send their children to a convent school. Not only christians but all minorities and other religious groups. Sikhs, muslims, parsis etc. We need to realise that we are dependent on each other.",
        "Lemme introduce you to Hollywood.",
        "People get obsessed with religion when they got no meaningful work to do.",
        "Naww I’ve seen educated Indians spewing hate from North America",
        "Unemployment at its peak. Nalli janta",
        "most of them are political workers / it cell , this is their way to catch youth peoples ATTENTION towards religious disputes instead legislative incompetence and mistakes.\n\nthe best way to stop this just ignore this kind of posts, go to option say not interested.\n\nthey seek our attention they want us to discuss this\nignore them\n\nlight love and peace all around .",
        "even Education doesn't guarantee mutual respect decency.",
        "The crusade 10 crusade 2 electric boogaloo",
        "Just like Krishna and Ram even Jesus is just fiction.",
        "U can argue like that, but the point in this post is the disrespect these men created. It's not hard to be respectful, is it?",
        "Tbh one should stay away from Indian and American right wing accounts on social media.\n\nMost of these people live in their own bubble.",
        "Just ignore online, and confront if it's in person. There are shits in every society.",
        "It seems so many political bots are taking over twitter",
        "putin wala dp lagna walo pata bhi nahi hai ki Putin kattar Christian hai🤣",
        "As an atheist, Jesus seems like the chillest one among religious leaders.",
        "We don't intend to highlight this issue with regard to the religion. This is just a byproduct of ignorance and arrogance that anyone can be subjected to. The problem with the false superiority and religious politics by modi created an inflated sense of ego for people like him to consider his ethnic religion to be the most superior. The second they leave the country and expose themselves to other culture, all fantasies and superiority will be drained.",
        "Ah classism being upvoted on reddit, a tale as old as time",
        "Education system",
        "We are too obsessed with religion, we need to follow religion like our ancestors did, that is it should be a personal connection between you and god, not a reason for you to attack and berate the religion of others.",
        "Jio was a mistake   \nWe use internet for all these bs things but they can do better if they were educated enough",
        "So, I can't see what OP posted. Can anyone either link or describe it?",
        "Yes true not only modi many of these incels constantly abuse the constitution also and desire for the replacement of the constitution with manusmriti.",
        "That nail was a bit too much. 💀",
        "Because the constitution is too long? Or some other reason.",
        "I have DM'ed you",
        "Dumbest shit I've ever seen, bro. Seriously, what is wrong with these people?",
        "Obsessed with religion but not at all religious.\n\n Such a facade and just because they belong to certain religion they have to prove it to be worthy and superior.",
        "Bro what? 70% schools are convent? Where are you getting your stats from? 💀",
        "To answer your question: lack if intelligence and education. These mfs dont know shit beyond the 10km area that they live in",
        "Because according to their narrow minded bigotic thinking, the constitution hasn't provided any rights to the UCs and provided rights to the LCs and if they can replace it with manusmriti than they can bring their casteist laws into action."
    ],
    "cleaned_text": "whats wrong indians everytime open twitter instagram lot negative content based religion spread unsurprisingly uploaded india either form comment story reels tweet look images attached indian man hindu telling doesnt abuse religion comes defend religion attacked unsurprisingly indian man also hindu started online abuse hatred content jesus years since jesus left guy comes shaming community indians respective whichever religion follow stop spreading communal hate everyday online views like fulfill desires communal hatred theres kind posts main reasons hatred towards indians hindu community worldwide brings huge disgrace towards us ",
    "cleaned_title": "whats wrong indians",
    "cleaned_selftext": "everytime open twitter instagram lot negative content based religion spread unsurprisingly uploaded india either form comment story reels tweet look images attached indian man hindu telling doesnt abuse religion comes defend religion attacked unsurprisingly indian man also hindu started online abuse hatred content jesus years since jesus left guy comes shaming community indians respective whichever religion follow stop spreading communal hate everyday online views like fulfill desires communal hatred theres kind posts main reasons hatred towards indians hindu community worldwide brings huge disgrace towards us",
    "cleaned_comments": "much internet enough education world desires pass away whoever god lives forever john god name devil one without ignore pray move thats people dont deserve internet access phones matter happens people live bubble eyes bro put nsfw tag wasnt ready jesus pinned part please put nsfw tag religion definitely important india recent days insulting religion become important ngl position got paid accounts bjp cell right wing organisations elon given platform express freedom speech twitter compare stray dogs difference elon locked stray animal catchers ill pray omg didnt notice said piece shit piece shit regardless call home beliefs may may show pathetic lives ability shit post online dont give em time day nobody given reaction sought theyll posting want end hame bas tamas bahdava dena hai anybody concerned countering posts thread nsfw link httpsxcomdesikingstatushttpsxcomdesikingstatus go click report hate hateful imagery whatever find appropriate take action filth spread far population even miniscule percent rw troll accounts contributing huge number filthy vile posts dipshit elon musk doesnt care im realy sick proper laws regarding allowed im sure course action take write minister really disturbing want see accounts closed person arrested rjiowasamistake bjp paid cell buggers hate everyone except uc hindus happens roadside chhapris get access cheap internet even abuse modi since obc call maulana problem ego high ass forget think exists reality religion culture outside india people likely never left hometown therefore subjected change reality twitter always toxic new low like mike tyson said social media made yall way comfortable disrespecting people getting punched face third pic post tweets screenshots abusing defaming india need vigilante beat shit degenerate shit deserve belt treatment theyre destabilizing indian society provocative tweets blabbers chill bro one guy religion pretty sure youd find fanatics every religion unfortunately take generations unbrainwash people damage fascist government youth votes imaginary sky friend better lmao really unnecessary shows narrow minded prefer medium well rjiowasamistake india survive christians disappear hypothetically almost schools convent schools common among parents send children convent school christians minorities religious groups sikhs muslims parsis etc need realise dependent lem introduce hollywood people get obsessed religion got meaningful work naww ive seen educated indians spewing hate north america unemployment peak nalli janta political workers cell way catch youth peoples attention towards religious disputes instead legislative incompetence mistakes best way stop ignore kind posts go option say interested seek attention want us discuss ignore light love peace around even education doesnt guarantee mutual respect decency crusade crusade electric boogaloo like krishna ram even jesus fiction u argue like point post disrespect men created hard respectful tbh one stay away indian american right wing accounts social media people live bubble ignore online confront person shits every society seems many political bots taking twitter putin wala dp lagna walo pata bhi nahi hai ki putin kattar christian hai atheist jesus seems like chillest one among religious leaders dont intend highlight issue regard religion byproduct ignorance arrogance anyone subjected problem false superiority religious politics modi created inflated sense ego people like consider ethnic religion superior second leave country expose culture fantasies superiority drained ah classism upvoted reddit tale old time education system obsessed religion need follow religion like ancestors personal connection god reason attack berate religion others jio mistake use internet bs things better educated enough cant see op posted anyone either link describe yes true modi many incels constantly abuse constitution also desire replacement constitution manusmriti nail bit much constitution long reason dmed dumbest shit ive ever seen bro seriously wrong people obsessed religion religious facade belong certain religion prove worthy superior bro schools convent getting stats answer question lack intelligence education mfs dont know shit beyond km area live according narrow minded bigotic thinking constitution hasnt provided rights ucs provided rights lcs replace manusmriti bring casteist laws action",
    "light_cleaned_title": "What's wrong with Indians",
    "light_cleaned_selftext": "Everytime I open my Twitter or Instagram, there are a lot of negative content based on religion spread. And unsurprisingly most are uploaded my an India , either in form of a comment, story, reels or as a tweet. Look at the images attached, A indian man (Hindu) is telling , he doesn't abuse any religion but comes up to defend when his religion is attacked . Unsurprisingly it was an Indian man also a Hindu, who started an online abuse and hatred content against Jesus. It's been 2000 years since Jesus left and his guy comes up shaming him and his community. When will Indians , respective of whichever religion they follow , Stop spreading communal hate everyday online for the same of views, like or to fulfill their desires of communal hatred. There's kind of posts are the main reasons for hatred towards Indians and Hindu community worldwide, and brings a huge disgrace towards us.",
    "light_cleaned_comments": "Too much internet but not enough education “The world and its desires pass away, but whoever does the will of God lives forever.” John 2:9-17 God can have any name, the devil is the one without any!! Ignore, pray for them and move on! That’s what I do.✌️ Some people don’t deserve to have internet access, or phones for that matter. this is what happens when people live in a bubble My eyes Bro, put the nsfw tag. I wasn't ready for the Jesus pinned part, please put nsfw tag. Religion is definitely important in India. But in recent days insulting other religion has become more important. Ngl but that position got me 🙄 these are paid accounts of bjp it cell/ right wing organisations, and elon has given them a platform to express \"freedom of speech\" on twitter compare them to stray dogs, but the difference now is elon has locked up the stray animal catchers I'll pray for them OMG. Didn't notice it until you said 💀 A piece of shit is a piece of shit, regardless of where they call home or what beliefs they may / may not have. All they have to show for their pathetic lives is the ability to shit post online, so don't give 'em the time of day and then, once nobody has given them the reaction they sought, they'll be posting about how they want to end it all... Hame bas Tamas to bahdava dena hai anybody concerned with countering this (or the other posts in this thread) \\[NSFW\\] here is the link [https://x.com/DesiKing\\_/status/1800516583296815288](https://x.com/DesiKing_/status/1800516583296815288) go click report > hate > hateful imagery \\[or whatever you find appropriate take action, this filth has spread too far, 20% of population with even miniscule percent of RW troll accounts are contributing a huge number of filthy vile posts the dipshit elon musk doesnt care im realy sick of this, we proper laws regarding what will be allowed and what not, im not sure what the course of action is for me to take, Do I have to write to IT minister? This is really disturbing, I want to see all these accounts closed and this person arrested r/jiowasamistake These bjp paid it cell buggers hate everyone except uc hindus. This is what happens when roadside chhapris get access to cheap internet. They even abuse Modi since he is OBC, call him maulana. The problem is that some of them have their ego so high up their ass that they forget to think there exists a reality , religion and culture outside India. These people have very likely never left their hometown and therefore is not subjected to any change of reality. Twitter was always toxic. But this is a new low. Like Mike Tyson said \"Social media made y'all way too comfortable with disrespecting people and not getting punched in the face for it.”. Third pic 💀💀 Post the tweets screenshots abusing and defaming India. We need a vigilante to beat the shit out of this degenerate shit. They deserve belt treatment. They're destabilizing Indian society with their provocative tweets and blabbers. Chill bro, it's just one guy from our religion, pretty sure you'd find fanatics in every other religion Unfortunately it will take 1-2 generations, to un-brainwash the people. The damage our fascist government did to the youth, for votes only. My imaginary sky friend is better than yours. Lmao That was really unnecessary and shows how narrow minded they are. I Prefer medium well. r/jiowasamistake India cannot survive if christians disappear hypothetically. Almost 70% schools are convent schools and it is very common among parents to send their children to a convent school. Not only christians but all minorities and other religious groups. Sikhs, muslims, parsis etc. We need to realise that we are dependent on each other. Lemme introduce you to Hollywood. People get obsessed with religion when they got no meaningful work to do. Naww I’ve seen educated Indians spewing hate from North America Unemployment at its peak. Nalli janta most of them are political workers / it cell , this is their way to catch youth peoples ATTENTION towards religious disputes instead legislative incompetence and mistakes. the best way to stop this just ignore this kind of posts, go to option say not interested. they seek our attention they want us to discuss this ignore them light love and peace all around . even Education doesn't guarantee mutual respect decency. The crusade 10 crusade 2 electric boogaloo Just like Krishna and Ram even Jesus is just fiction. U can argue like that, but the point in this post is the disrespect these men created. It's not hard to be respectful, is it? Tbh one should stay away from Indian and American right wing accounts on social media. Most of these people live in their own bubble. Just ignore online, and confront if it's in person. There are shits in every society. It seems so many political bots are taking over twitter putin wala dp lagna walo pata bhi nahi hai ki Putin kattar Christian hai🤣 As an atheist, Jesus seems like the chillest one among religious leaders. We don't intend to highlight this issue with regard to the religion. This is just a byproduct of ignorance and arrogance that anyone can be subjected to. The problem with the false superiority and religious politics by modi created an inflated sense of ego for people like him to consider his ethnic religion to be the most superior. The second they leave the country and expose themselves to other culture, all fantasies and superiority will be drained. Ah classism being upvoted on reddit, a tale as old as time Education system We are too obsessed with religion, we need to follow religion like our ancestors did, that is it should be a personal connection between you and god, not a reason for you to attack and berate the religion of others. Jio was a mistake We use internet for all these bs things but they can do better if they were educated enough So, I can't see what OP posted. Can anyone either link or describe it? Yes true not only modi many of these incels constantly abuse the constitution also and desire for the replacement of the constitution with manusmriti. That nail was a bit too much. 💀 Because the constitution is too long? Or some other reason. I have DM'ed you Dumbest shit I've ever seen, bro. Seriously, what is wrong with these people? Obsessed with religion but not at all religious. Such a facade and just because they belong to certain religion they have to prove it to be worthy and superior. Bro what? 70% schools are convent? Where are you getting your stats from? 💀 To answer your question: lack if intelligence and education. These mfs dont know shit beyond the 10km area that they live in Because according to their narrow minded bigotic thinking, the constitution hasn't provided any rights to the UCs and provided rights to the LCs and if they can replace it with manusmriti than they can bring their casteist laws into action."
}