{
    "id": "1hlw7tk",
    "title": "The economic outlook doesn't seem very promising.",
    "url": "https://www.business-standard.com/finance/news/states-sops-may-divert-resources-away-from-infra-development-rbi-article-124122400979_1.html",
    "selftext": "An RBI article warns that sops announced in the 2024-25 Budgets by various Indian states Haryana, Punjab, Maharashtra, and Jharkhand  including free electricity to agriculture and households, free transport, allowances to unemployed youth and monetary assistance to women may divert funds from critical social and economic infrastructure developement.\n\nIndia is bouncing back from a slowdown in Q2, but with high inflation and upcoming state budget sops are causing worries and may put India in bad state.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1735112127.0,
    "convurl": "https://external-preview.redd.it/_Nw9pqNE5NqWjLVaYJzynrYJIhaGn8jmmsxaB5-1348.jpg?auto=webp&s=b929733e887150d6960916aa8d956a941958c76f",
    "comments": [],
    "cleaned_text": "economic outlook doesnt seem promising rbi article warns sops announced budgets various indian states haryana punjab maharashtra jharkhand including free electricity agriculture households free transport allowances unemployed youth monetary assistance women may divert funds critical social economic infrastructure developement india bouncing back slowdown q high inflation upcoming state budget sops causing worries may put india bad state ",
    "cleaned_title": "economic outlook doesnt seem promising",
    "cleaned_selftext": "rbi article warns sops announced budgets various indian states haryana punjab maharashtra jharkhand including free electricity agriculture households free transport allowances unemployed youth monetary assistance women may divert funds critical social economic infrastructure developement india bouncing back slowdown q high inflation upcoming state budget sops causing worries may put india bad state",
    "cleaned_comments": "",
    "light_cleaned_title": "The economic outlook doesn't seem very promising.",
    "light_cleaned_selftext": "An RBI article warns that sops announced in the 2024-25 Budgets by various Indian states Haryana, Punjab, Maharashtra, and Jharkhand including free electricity to agriculture and households, free transport, allowances to unemployed youth and monetary assistance to women may divert funds from critical social and economic infrastructure developement. India is bouncing back from a slowdown in Q2, but with high inflation and upcoming state budget sops are causing worries and may put India in bad state.",
    "light_cleaned_comments": ""
}