{
    "id": "16td080",
    "title": "Recognise a dark pattern while doomscrolling on your most (or least) favourite apps or websites? Fill out this survey and help us engage with the Department of Consumer Affairs on their draft Guidelines for Prevention and Regulation of Dark Patterns,",
    "url": "https://www.reddit.com/r/india/comments/16td080/recognise_a_dark_pattern_while_doomscrolling_on/",
    "selftext": "  \n[Fill out the survey](https://forms.internetfreedom.in/survey-on-recognising-dark-patterns-G_6C4hZmQT.NScZgJQ5Dhg-o)\n\nDepartment of Consumer Affairs is inviting public comments on the draft Guidelines for Prevention and Regulation of Dark Patterns till October 5, 2023. The guidelines will aim to protect and enhance consumer experience on apps and websites.   \n\n\nIFF will write to the Department of Consumer Affairs with suggestions on what kinds of online malpractices they can characterise as a dark pattern.   \n[Fill out the survey](https://forms.internetfreedom.in/survey-on-recognising-dark-patterns-G_6C4hZmQT.NScZgJQ5Dhg-o)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695796030.0,
    "convurl": "https://external-preview.redd.it/PctzcFFV_wLFEWp7kSRV7ThJc99dsGZKBCtADckRq6c.jpg?auto=webp&s=b6ca51b2667aaa8e927e8caca4be77eaab42d7e7",
    "comments": [],
    "cleaned_text": "recognise dark pattern doomscrolling least favourite apps websites fill survey help us engage department consumer affairs draft guidelines prevention regulation dark patterns fill surveyhttpsformsinternetfreedominsurveyonrecognisingdarkpatternsgchzmqtnsczgjqdhgo department consumer affairs inviting public comments draft guidelines prevention regulation dark patterns till october guidelines aim protect enhance consumer experience apps websites iff write department consumer affairs suggestions kinds online malpractices characterise dark pattern fill surveyhttpsformsinternetfreedominsurveyonrecognisingdarkpatternsgchzmqtnsczgjqdhgo ",
    "cleaned_title": "recognise dark pattern doomscrolling least favourite apps websites fill survey help us engage department consumer affairs draft guidelines prevention regulation dark patterns",
    "cleaned_selftext": "fill surveyhttpsformsinternetfreedominsurveyonrecognisingdarkpatternsgchzmqtnsczgjqdhgo department consumer affairs inviting public comments draft guidelines prevention regulation dark patterns till october guidelines aim protect enhance consumer experience apps websites iff write department consumer affairs suggestions kinds online malpractices characterise dark pattern fill surveyhttpsformsinternetfreedominsurveyonrecognisingdarkpatternsgchzmqtnsczgjqdhgo",
    "cleaned_comments": "",
    "light_cleaned_title": "Recognise a dark pattern while doomscrolling on your most (or least) favourite apps or websites? Fill out this survey and help us engage with the Department of Consumer Affairs on their draft Guidelines for Prevention and Regulation of Dark Patterns,",
    "light_cleaned_selftext": "[Fill out the survey](https://forms.internetfreedom.in/survey-on-recognising-dark-patterns-G_6C4hZmQT.NScZgJQ5Dhg-o) Department of Consumer Affairs is inviting public comments on the draft Guidelines for Prevention and Regulation of Dark Patterns till October 5, 2023. The guidelines will aim to protect and enhance consumer experience on apps and websites. IFF will write to the Department of Consumer Affairs with suggestions on what kinds of online malpractices they can characterise as a dark pattern. [Fill out the survey](https://forms.internetfreedom.in/survey-on-recognising-dark-patterns-G_6C4hZmQT.NScZgJQ5Dhg-o)",
    "light_cleaned_comments": ""
}