{
    "id": "1b2yn2a",
    "title": "'Was 5 Steps Ahead of Me When He Was Shot': Shubhkaran's Father Claims in FIR",
    "url": "https://www.thequint.com/news/crime/shubhkaran-singh-death-bullet-injury-farmers-protest-fir-details?",
    "selftext": "21-year-old Shubhkaran Singh was killed during police action at Khanauri Border amid the ongoing farmers' protest.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1709207912.0,
    "convurl": "https://external-preview.redd.it/Mrpl-HIJFwilLjSJY_dz6nCgAoAFh_qJcWBNNlTJkfI.jpg?auto=webp&s=48463b5aa163db0e1709dac4f0799398c98e515f",
    "comments": [
        "From the article:\n\n\"Shubhkaran was walking five steps ahead of me when a bullet hit his head from behind,\" Charanjeet Singh — father of 21-year-old Shubhkaran Singh who died allegedly during police action amid the ongoing farmers' protest — claimed in a police complaint filed on 28 February.\n\nBased on Charanjeet's complaint an FIR was registered under sections 302 (murder) and 114 (punishment for abetment) of the Indian Penal Code (IPC) at the Patran police station in Patiala, Punjab.\n\n\"On 21 February, at around 11 am, several of us (protesting farmers) tried to cross the barricades to follow the call to march towards Delhi. But the Haryana Police blocked the road with smoke balls and tear gas. On the instructions of the farmer leaders, we went back 100-150 meters and stood in the fields but the police started firing bullets. Then, we tried to run back to our trolleys. At that time, Shubhkaran was just five steps ahead of me when a bullet hit his head from behind,\" Charanjeet claimed in the FIR.\n\n\"Shubhkaran was walking five steps ahead of me when a bullet hit his head from behind,\" Charanjeet Singh — father of 21-year-old Shubhkaran Singh who died allegedly during police action amid the ongoing farmers' protest — claimed in a police complaint filed on 28 February.\n\nBased on Charanjeet's complaint an FIR was registered under sections 302 (murder) and 114 (punishment for abetment) of the Indian Penal Code (IPC) at the Patran police station in Patiala, Punjab.\n\n\"On 21 February, at around 11 am, several of us (protesting farmers) tried to cross the barricades to follow the call to march towards Delhi. But the Haryana Police blocked the road with smoke balls and tear gas. On the instructions of the farmer leaders, we went back 100-150 meters and stood in the fields but the police started firing bullets. Then, we tried to run back to our trolleys. At that time, Shubhkaran was just five steps ahead of me when a bullet hit his head from behind,\" Charanjeet claimed in the FIR.\n\nA resident of Bathinda's Ballo village, Shubhkaran died due to an injury on the back of his head, which doctors at Patiala's Rajendra Hospital said looked like a a \"bullet\" injury.\n\nHe was one of the farmers protesting at the Haryana-Punjab Khanauri Border over the demand for a Minimum Support Price guarantee law.\n\nShubhkaran's Father, Charanjeet Singh further alleged in the FIR that soon after his son was shot, he fell to the ground and was taken to the hospital in an ambulance.\n\n\"About an hour later, we received a call informing our family members in the village that Shubhkaran was dead,\" Charanjeet claimed.\n\nThe Delay\n\nThe delay in filing the FIR in connection with this case was attributed to jurisdiction-related issues by the Punjab Police.\n\nWhile Shubhkaran's family was insisting against filing an FIR in Haryana, senior officials in the Punjab Police said that the area where Shubhkaran was injured lies under the jurisdiction of Haryana's Jind district.\n\nAccording to the FIR, on 21, 22, and February, officers from Jind's Garhi Police Station visited Rajendra Hospital where Shubhkaran's body was kept for post-mortem. The family, however, refused to let the Haryana Police investigate the matter.\n\nOn 28 February, Shubhkaran's father submitted a written complaint to the Patran Police Station, where the FIR was finally registered."
    ],
    "cleaned_text": "steps ahead shot shubhkarans father claims fir yearold shubhkaran singh killed police action khanauri border amid ongoing farmers protest ",
    "cleaned_title": "steps ahead shot shubhkarans father claims fir",
    "cleaned_selftext": "yearold shubhkaran singh killed police action khanauri border amid ongoing farmers protest",
    "cleaned_comments": "article shubhkaran walking five steps ahead bullet hit head behind charanjeet singh father yearold shubhkaran singh died allegedly police action amid ongoing farmers protest claimed police complaint filed february based charanjeets complaint fir registered sections murder punishment abetment indian penal code ipc patran police station patiala punjab february around several us protesting farmers tried cross barricades follow call march towards delhi haryana police blocked road smoke balls tear gas instructions farmer leaders went back meters stood fields police started firing bullets tried run back trolleys time shubhkaran five steps ahead bullet hit head behind charanjeet claimed fir shubhkaran walking five steps ahead bullet hit head behind charanjeet singh father yearold shubhkaran singh died allegedly police action amid ongoing farmers protest claimed police complaint filed february based charanjeets complaint fir registered sections murder punishment abetment indian penal code ipc patran police station patiala punjab february around several us protesting farmers tried cross barricades follow call march towards delhi haryana police blocked road smoke balls tear gas instructions farmer leaders went back meters stood fields police started firing bullets tried run back trolleys time shubhkaran five steps ahead bullet hit head behind charanjeet claimed fir resident bathindas ballo village shubhkaran died due injury back head doctors patialas rajendra hospital said looked like bullet injury one farmers protesting haryanapunjab khanauri border demand minimum support price guarantee law shubhkarans father charanjeet singh alleged fir soon son shot fell ground taken hospital ambulance hour later received call informing family members village shubhkaran dead charanjeet claimed delay delay filing fir connection case attributed jurisdictionrelated issues punjab police shubhkarans family insisting filing fir haryana senior officials punjab police said area shubhkaran injured lies jurisdiction haryanas jind district according fir february officers jinds garhi police station visited rajendra hospital shubhkarans body kept postmortem family however refused let haryana police investigate matter february shubhkarans father submitted written complaint patran police station fir finally registered",
    "light_cleaned_title": "'Was 5 Steps Ahead of Me When He Was Shot': Shubhkaran's Father Claims in FIR",
    "light_cleaned_selftext": "21-year-old Shubhkaran Singh was killed during police action at Khanauri Border amid the ongoing farmers' protest.",
    "light_cleaned_comments": "From the article: \"Shubhkaran was walking five steps ahead of me when a bullet hit his head from behind,\" Charanjeet Singh — father of 21-year-old Shubhkaran Singh who died allegedly during police action amid the ongoing farmers' protest — claimed in a police complaint filed on 28 February. Based on Charanjeet's complaint an FIR was registered under sections 302 (murder) and 114 (punishment for abetment) of the Indian Penal Code (IPC) at the Patran police station in Patiala, Punjab. \"On 21 February, at around 11 am, several of us (protesting farmers) tried to cross the barricades to follow the call to march towards Delhi. But the Haryana Police blocked the road with smoke balls and tear gas. On the instructions of the farmer leaders, we went back 100-150 meters and stood in the fields but the police started firing bullets. Then, we tried to run back to our trolleys. At that time, Shubhkaran was just five steps ahead of me when a bullet hit his head from behind,\" Charanjeet claimed in the FIR. \"Shubhkaran was walking five steps ahead of me when a bullet hit his head from behind,\" Charanjeet Singh — father of 21-year-old Shubhkaran Singh who died allegedly during police action amid the ongoing farmers' protest — claimed in a police complaint filed on 28 February. Based on Charanjeet's complaint an FIR was registered under sections 302 (murder) and 114 (punishment for abetment) of the Indian Penal Code (IPC) at the Patran police station in Patiala, Punjab. \"On 21 February, at around 11 am, several of us (protesting farmers) tried to cross the barricades to follow the call to march towards Delhi. But the Haryana Police blocked the road with smoke balls and tear gas. On the instructions of the farmer leaders, we went back 100-150 meters and stood in the fields but the police started firing bullets. Then, we tried to run back to our trolleys. At that time, Shubhkaran was just five steps ahead of me when a bullet hit his head from behind,\" Charanjeet claimed in the FIR. A resident of Bathinda's Ballo village, Shubhkaran died due to an injury on the back of his head, which doctors at Patiala's Rajendra Hospital said looked like a a \"bullet\" injury. He was one of the farmers protesting at the Haryana-Punjab Khanauri Border over the demand for a Minimum Support Price guarantee law. Shubhkaran's Father, Charanjeet Singh further alleged in the FIR that soon after his son was shot, he fell to the ground and was taken to the hospital in an ambulance. \"About an hour later, we received a call informing our family members in the village that Shubhkaran was dead,\" Charanjeet claimed. The Delay The delay in filing the FIR in connection with this case was attributed to jurisdiction-related issues by the Punjab Police. While Shubhkaran's family was insisting against filing an FIR in Haryana, senior officials in the Punjab Police said that the area where Shubhkaran was injured lies under the jurisdiction of Haryana's Jind district. According to the FIR, on 21, 22, and February, officers from Jind's Garhi Police Station visited Rajendra Hospital where Shubhkaran's body was kept for post-mortem. The family, however, refused to let the Haryana Police investigate the matter. On 28 February, Shubhkaran's father submitted a written complaint to the Patran Police Station, where the FIR was finally registered."
}