{
    "id": "1dub2hk",
    "title": "I recently got scammed by an online thrift store on instgram",
    "url": "https://www.reddit.com/gallery/1dub2hk",
    "selftext": "I was recently tryna buy a windbreaker jacket from a thrift store on instagram which was based in JMU. They had posted a lot of screenshots of the postive reviews from their customers on their highlights(ig now those reviews were fake af) and they had like over 1000 plus followers as well... These ppl told me that they had shipped my order nd when I started asking them for the order ID nd such infos they blocked me the next day. I had made the payment through a UPI app\n\nSo next time guyss when you tryna buy something of these so called thrift stores nd such try getting their legit numbers and make sure to call them before ordering nd confirm whether its their number as well. \n\n\n\n\n",
    "flair": "Crime",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1720002599,
    "convurl": "https://i.redd.it/qv7i5sss6aad1.jpg",
    "comments": [],
    "cleaned_text": "recently got scammed online thrift store instgram recently tryna buy windbreaker jacket thrift store instagram based jmu posted lot screenshots postive reviews customers highlightsig reviews fake af like plus followers well ppl told shipped order nd started asking order id nd infos blocked next day made payment upi app next time guyss tryna buy something called thrift stores nd try getting legit numbers make sure call ordering nd confirm whether number well ",
    "cleaned_title": "recently got scammed online thrift store instgram",
    "cleaned_selftext": "recently tryna buy windbreaker jacket thrift store instagram based jmu posted lot screenshots postive reviews customers highlightsig reviews fake af like plus followers well ppl told shipped order nd started asking order id nd infos blocked next day made payment upi app next time guyss tryna buy something called thrift stores nd try getting legit numbers make sure call ordering nd confirm whether number well",
    "cleaned_comments": "",
    "light_cleaned_title": "I recently got scammed by an online thrift store on instgram",
    "light_cleaned_selftext": "I was recently tryna buy a windbreaker jacket from a thrift store on instagram which was based in JMU. They had posted a lot of screenshots of the postive reviews from their customers on their highlights(ig now those reviews were fake af) and they had like over 1000 plus followers as well... These ppl told me that they had shipped my order nd when I started asking them for the order ID nd such infos they blocked me the next day. I had made the payment through a UPI app So next time guyss when you tryna buy something of these so called thrift stores nd such try getting their legit numbers and make sure to call them before ordering nd confirm whether its their number as well.",
    "light_cleaned_comments": ""
}