{
    "id": "k5slv5",
    "title": "Internal govt documents provide insight into the creation and expansion of Aarogya Setu",
    "url": "https://www.reddit.com/r/india/comments/k5slv5/internal_govt_documents_provide_insight_into_the/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/hw4cus15ax261.png?width=1024&amp;format=png&amp;auto=webp&amp;s=62616e37f905bc0257ff58deba750adeb209fec7\n\n### Tl;dr\n\nMinutes of meetings of the 9th Empowered Group on Technology and Data Management provide an insider view into the creation and expansion of Aarogya Setu  between 31 March 2020 to 10 August 2020. These documents were obtained by IFF through the Right to Information Act, 2005 and they contain information about several projects including the Aarogya Setu proximity exposure notification app, the ITIHAS hotspot mapping and prediction system, collection of cell tower location data by the Department of Telecom, and apps to input data regarding RT-PCR and antigen tests.\n\n### Background\n\nIn April 2020, we filed RTI applications seeking information about the Aarogya Setu app with various government authorities including the Ministry of Health &amp; Family Welfare (MoHFW). Since we did not receive a response to our RTI queries within the stipulated 30 day time period, we filed a first appeal with MoHFW which was transferred to the Department of Electronics and Information Technology (DeitY) like the original RTI application. Finally, on 10 November 2020, DeitY shared minutes of meetings of the 9th Empowered Group Committee on Technology and Data Management held between 31 March 2020 to 10 August 2020 in response to our RTI queries.\n\nThe Central Government has constituted several Empowered Groups under the Disaster Management Act, 2005 (DMA 2005) and powers have been delegated to these groups through orders which reference Sections 10(2)(h) and (i) of the Act. However, Section 10 does not permit any delegation of power and none of the provisions of DMA 2005 contain any reference to an “Empowered Group”. Therefore, the legality of this delegation of power upon Empowered Groups is questionable. The Government has constituted 11 Empowered Groups in total and the 9th Group has been specifically tasked with 'Technology and Data Management' and it is responsible for the creation and expansion of Aarogya Setu.\n\nThe minutes of meetings of the 9th Empowered Group obtained through the RTI Act provide an insider view of the government's data collection projects during the COVID-19 pandemic which include the Aarogya Setu proximity exposure notification app, the ITIHAS hotspot mapping and prediction system, collection of cell tower location data by the Department of Telecom, and apps to input data regarding RT-PCR and antigen tests.\n\n### Aarogya Setu Mobile App\n\nThe documents clearly state that there should be two-way sharing of data between Aarogya Setu and other databases which include the COVID India Portal (S-3) and the Ayushman Bharat System. These databases would also be connected to apps for RT-PCR and antigen tests to create a single source of truth.  Here are some of the relevant portions of the minutes which descibe the relationship between different databases.\n\n**(i) Aarogya Setu and COVID India Portal (S-3)**\n\n&gt;*\"It was decided that that there should be integration of Bluetooth contact tracing data of Confirmed Positive cases from Aarogya Setu to S3 System. The contact tracing data should be visible to the district / state officers through S3 System interface enabling them to track and take necessary action for testing/ surveillance of these suspect cases. The action taken by the officers on this cases then should flow back to Aarogya setu to complete the cycle.\"*\n\n**(ii) Aarogya Setu and Ayushman Bharat**\n\n&gt;*\"Leads in the Aarogya Setu should be verified by Ayushman Bharat System and the filtered set of leads should be shared with states. Further feedback and action taken from field staff should flow back to Aarogya Setu.\"*  \n*\"The group was further informed that both Bluetooth and self assessment data (cleaned by Aarogya Bharat) are flowing from Aarogya Setu to S3 and vice-versa.\"*\n\nDuring the meetings, concerns were raised about sharing of health data between so many databases with Dr. Harpreet Singh, ICMR noting that *\"lab data of Covid-19 is highly sensitive (health data) and at present there are many APIs for sharing of data with different stakeholders including NDMA, NHA &amp; others. There is need for Do’s and Don’ts with clear set of guidelines to secure the data.\"* Government officials also seem to be aware of inaccurate reporting of a person's status by the Aarogya Setu app. For instance, during one of the meetings, Mr. RS Mani, DDG NIC highlighted *\"the issue of false alarm (person released from hospital but status not updated).\"*  \n\nThe technical design choices of Aarogya Setu have been a subject of discussion among members of the 9th Empowered Group and officials from National Informatics Centre (NIC) were required to explain their reasons for adopting a static ID and not sharing the source code initially but these reasons are not mentioned in the minutes. NIC officials further pointed out that India could not use the Google-Apple API because it prohibited location tracking. NIC was also entrusted with the responsibility of handling the back end code of Aarogya Setu and it worked with pro bono volunteers from HP on this project.\n\n### ITIHAS Hotspot Mapping and Prediction System\n\nThe minutes of meetings of the 9th Empowered Group contain several references to the ITIHAS system developed by Prof. Kamakoti, IIT Madras and NSAB for hotspot mapping and prediction. The forecasts from ITIHAS were to be integrated with the COVID India Portal (S3) and Prof. Kamakoti also made a presentation on findings from integration of ITIHAS with Aarogya Setu data. The documents also contain references to a project called 'Aarogya Rekha' being developed by Prof. Kamakoti which would be integrated with Aarogya Setu. Once this integration was done, states would then be asked to start using this tool for geographical marking of hot-spots.\n\n### Use of Cell Tower Location Data\n\nThe minutes of meetings reveal that proposals to use cell tower location data to track the movement of persons was first considered in the context of the post lockdown exodus of migrants. It was decided that the Department of Telecom (DoT) would determine what kind of telecom data could be obtained about movement of migrants and this data could subsequently be shared with state governments to follow up with individual cases.\n\nOnce this data was collected by DoT, it was shared with Professor Kamakoti for further analysis and it was also made available on the COVID India Portal (S-3). In later meetings, it is clarified that the data has been aggregated at Cell Tower Level and anonymised to remove all mobile numbers and personal details but it is not clear at what stage such anonymisation took place.\n\nDuring one of the meetings, the DoT officials also offered to *\"monitor the intrusion (persons with/without pass) and report the telephone numbers which do not have valid pass to States/Authorities.\"* For this purpose, DoT was supposed to create a dashboard with latitude and longitude coordinates for all telephone numbers which could be piloted in a city.\n\n### Important Documents\n\n1. Folder containing minutes of meetings of 9th Empowered Group ([**link**](https://drive.google.com/drive/folders/1fF-UmjWa0Sr_lLx9gkYsqZJID6C91hOM?usp=sharing))\n2. Previous post titled 'A look at Aarogya Setu through the Right to Information lens' dated 27 May 2020 ([**link**](https://internetfreedom.in/aarogya-setu-through-the-right-to-information-lens/))",
    "flair": "Policy/Economy",
    "score": 36,
    "num_comments": 2,
    "created_utc": 1606979701,
    "convurl": "https://b.thumbs.redditmedia.com/SC1q7UmTPNEPT1oqLMxBZ-uR_zetU-Y-swRU7dtm24U.jpg",
    "comments": [
        "Corona was just an excuse, gobarment is hellbent on tracking each and every movement of citizens and waste thousands of crores of tax payers money.\n\nGau rogya setu app laga dala to 360 degree surveillance jhinga la la.\n\nFodi hai to mumkin hai.",
        "Couple of things I've wondered about these systems is how long the data is retained for, and who oversees which departments get access to which API. \n\nFor purposes of COVID tracing surely any data older than say 30 days is useless and needs to be erased."
    ],
    "cleaned_text": "internal govt documents provide insight creation expansion aarogya setu ampxb tldr minutes meetings th empowered group technology data management provide insider view creation expansion aarogya setu march august documents obtained iff right information act contain information several projects including aarogya setu proximity exposure notification app itihas hotspot mapping prediction system collection cell tower location data department telecom apps input data regarding rtpcr antigen tests background april filed rti applications seeking information aarogya setu app various government authorities including ministry health amp family welfare mohfw since receive response rti queries within stipulated day time period filed first appeal mohfw transferred department electronics information technology deity like original rti application finally november deity shared minutes meetings th empowered group committee technology data management held march august response rti queries central government constituted several empowered groups disaster management act dma powers delegated groups orders reference sections h act however section permit delegation power none provisions dma contain reference empowered group therefore legality delegation power upon empowered groups questionable government constituted empowered groups total th group specifically tasked technology data management responsible creation expansion aarogya setu minutes meetings th empowered group obtained rti act provide insider view governments data collection projects covid pandemic include aarogya setu proximity exposure notification app itihas hotspot mapping prediction system collection cell tower location data department telecom apps input data regarding rtpcr antigen tests aarogya setu mobile app documents clearly state twoway sharing data aarogya setu databases include covid india portal ayushman bharat system databases would also connected apps rtpcr antigen tests create single source truth relevant portions minutes descibe relationship different databases aarogya setu covid india portal gtit decided integration bluetooth contact tracing data confirmed positive cases aarogya setu system contact tracing data visible district state officers system interface enabling track take necessary action testing surveillance suspect cases action taken officers cases flow back aarogya setu complete cycle ii aarogya setu ayushman bharat gtleads aarogya setu verified ayushman bharat system filtered set leads shared states feedback action taken field staff flow back aarogya setu group informed bluetooth self assessment data cleaned aarogya bharat flowing aarogya setu viceversa meetings concerns raised sharing health data many databases dr harpreet singh icmr noting lab data covid highly sensitive health data present many apis sharing data different stakeholders including ndma nha amp others need dos donts clear set guidelines secure data government officials also seem aware inaccurate reporting persons status aarogya setu app instance one meetings mr rs mani ddg nic highlighted issue false alarm person released hospital status updated technical design choices aarogya setu subject discussion among members th empowered group officials national informatics centre nic required explain reasons adopting static id sharing source code initially reasons mentioned minutes nic officials pointed india could use googleapple api prohibited location tracking nic also entrusted responsibility handling back end code aarogya setu worked pro bono volunteers hp project itihas hotspot mapping prediction system minutes meetings th empowered group contain several references itihas system developed prof kamakoti iit madras nsab hotspot mapping prediction forecasts itihas integrated covid india portal prof kamakoti also made presentation findings integration itihas aarogya setu data documents also contain references project called aarogya rekha developed prof kamakoti would integrated aarogya setu integration done states would asked start using tool geographical marking hotspots use cell tower location data minutes meetings reveal proposals use cell tower location data track movement persons first considered context post lockdown exodus migrants decided department telecom dot would determine kind telecom data could obtained movement migrants data could subsequently shared state governments follow individual cases data collected dot shared professor kamakoti analysis also made available covid india portal later meetings clarified data aggregated cell tower level anonymised remove mobile numbers personal details clear stage anonymisation took place one meetings dot officials also offered monitor intrusion persons withwithout pass report telephone numbers valid pass statesauthorities purpose dot supposed create dashboard latitude longitude coordinates telephone numbers could piloted city important documents folder containing minutes meetings th empowered group linkhttpsdrivegooglecomdrivefoldersffumjwasrllxgkysqzjidchomuspsharing previous post titled look aarogya setu right information lens dated may linkhttpsinternetfreedominaarogyasetuthroughtherighttoinformationlens ",
    "cleaned_title": "internal govt documents provide insight creation expansion aarogya setu",
    "cleaned_selftext": "ampxb tldr minutes meetings th empowered group technology data management provide insider view creation expansion aarogya setu march august documents obtained iff right information act contain information several projects including aarogya setu proximity exposure notification app itihas hotspot mapping prediction system collection cell tower location data department telecom apps input data regarding rtpcr antigen tests background april filed rti applications seeking information aarogya setu app various government authorities including ministry health amp family welfare mohfw since receive response rti queries within stipulated day time period filed first appeal mohfw transferred department electronics information technology deity like original rti application finally november deity shared minutes meetings th empowered group committee technology data management held march august response rti queries central government constituted several empowered groups disaster management act dma powers delegated groups orders reference sections h act however section permit delegation power none provisions dma contain reference empowered group therefore legality delegation power upon empowered groups questionable government constituted empowered groups total th group specifically tasked technology data management responsible creation expansion aarogya setu minutes meetings th empowered group obtained rti act provide insider view governments data collection projects covid pandemic include aarogya setu proximity exposure notification app itihas hotspot mapping prediction system collection cell tower location data department telecom apps input data regarding rtpcr antigen tests aarogya setu mobile app documents clearly state twoway sharing data aarogya setu databases include covid india portal ayushman bharat system databases would also connected apps rtpcr antigen tests create single source truth relevant portions minutes descibe relationship different databases aarogya setu covid india portal gtit decided integration bluetooth contact tracing data confirmed positive cases aarogya setu system contact tracing data visible district state officers system interface enabling track take necessary action testing surveillance suspect cases action taken officers cases flow back aarogya setu complete cycle ii aarogya setu ayushman bharat gtleads aarogya setu verified ayushman bharat system filtered set leads shared states feedback action taken field staff flow back aarogya setu group informed bluetooth self assessment data cleaned aarogya bharat flowing aarogya setu viceversa meetings concerns raised sharing health data many databases dr harpreet singh icmr noting lab data covid highly sensitive health data present many apis sharing data different stakeholders including ndma nha amp others need dos donts clear set guidelines secure data government officials also seem aware inaccurate reporting persons status aarogya setu app instance one meetings mr rs mani ddg nic highlighted issue false alarm person released hospital status updated technical design choices aarogya setu subject discussion among members th empowered group officials national informatics centre nic required explain reasons adopting static id sharing source code initially reasons mentioned minutes nic officials pointed india could use googleapple api prohibited location tracking nic also entrusted responsibility handling back end code aarogya setu worked pro bono volunteers hp project itihas hotspot mapping prediction system minutes meetings th empowered group contain several references itihas system developed prof kamakoti iit madras nsab hotspot mapping prediction forecasts itihas integrated covid india portal prof kamakoti also made presentation findings integration itihas aarogya setu data documents also contain references project called aarogya rekha developed prof kamakoti would integrated aarogya setu integration done states would asked start using tool geographical marking hotspots use cell tower location data minutes meetings reveal proposals use cell tower location data track movement persons first considered context post lockdown exodus migrants decided department telecom dot would determine kind telecom data could obtained movement migrants data could subsequently shared state governments follow individual cases data collected dot shared professor kamakoti analysis also made available covid india portal later meetings clarified data aggregated cell tower level anonymised remove mobile numbers personal details clear stage anonymisation took place one meetings dot officials also offered monitor intrusion persons withwithout pass report telephone numbers valid pass statesauthorities purpose dot supposed create dashboard latitude longitude coordinates telephone numbers could piloted city important documents folder containing minutes meetings th empowered group linkhttpsdrivegooglecomdrivefoldersffumjwasrllxgkysqzjidchomuspsharing previous post titled look aarogya setu right information lens dated may linkhttpsinternetfreedominaarogyasetuthroughtherighttoinformationlens",
    "cleaned_comments": "corona excuse gobarment hellbent tracking every movement citizens waste thousands crores tax payers money gau rogya setu app laga dala degree surveillance jhinga la la fodi hai mumkin hai couple things ive wondered systems long data retained oversees departments get access api purposes covid tracing surely data older say days useless needs erased",
    "light_cleaned_title": "Internal govt documents provide insight into the creation and expansion of Aarogya Setu",
    "light_cleaned_selftext": "### Tl;dr Minutes of meetings of the 9th Empowered Group on Technology and Data Management provide an insider view into the creation and expansion of Aarogya Setu between 31 March 2020 to 10 August 2020. These documents were obtained by IFF through the Right to Information Act, 2005 and they contain information about several projects including the Aarogya Setu proximity exposure notification app, the ITIHAS hotspot mapping and prediction system, collection of cell tower location data by the Department of Telecom, and apps to input data regarding RT-PCR and antigen tests. ### Background In April 2020, we filed RTI applications seeking information about the Aarogya Setu app with various government authorities including the Ministry of Health &amp; Family Welfare (MoHFW). Since we did not receive a response to our RTI queries within the stipulated 30 day time period, we filed a first appeal with MoHFW which was transferred to the Department of Electronics and Information Technology (DeitY) like the original RTI application. Finally, on 10 November 2020, DeitY shared minutes of meetings of the 9th Empowered Group Committee on Technology and Data Management held between 31 March 2020 to 10 August 2020 in response to our RTI queries. The Central Government has constituted several Empowered Groups under the Disaster Management Act, 2005 (DMA 2005) and powers have been delegated to these groups through orders which reference Sections 10(2)(h) and (i) of the Act. However, Section 10 does not permit any delegation of power and none of the provisions of DMA 2005 contain any reference to an “Empowered Group”. Therefore, the legality of this delegation of power upon Empowered Groups is questionable. The Government has constituted 11 Empowered Groups in total and the 9th Group has been specifically tasked with 'Technology and Data Management' and it is responsible for the creation and expansion of Aarogya Setu. The minutes of meetings of the 9th Empowered Group obtained through the RTI Act provide an insider view of the government's data collection projects during the COVID-19 pandemic which include the Aarogya Setu proximity exposure notification app, the ITIHAS hotspot mapping and prediction system, collection of cell tower location data by the Department of Telecom, and apps to input data regarding RT-PCR and antigen tests. ### Aarogya Setu Mobile App The documents clearly state that there should be two-way sharing of data between Aarogya Setu and other databases which include the COVID India Portal (S-3) and the Ayushman Bharat System. These databases would also be connected to apps for RT-PCR and antigen tests to create a single source of truth. Here are some of the relevant portions of the minutes which descibe the relationship between different databases. **(i) Aarogya Setu and COVID India Portal (S-3)** &gt;*\"It was decided that that there should be integration of Bluetooth contact tracing data of Confirmed Positive cases from Aarogya Setu to S3 System. The contact tracing data should be visible to the district / state officers through S3 System interface enabling them to track and take necessary action for testing/ surveillance of these suspect cases. The action taken by the officers on this cases then should flow back to Aarogya setu to complete the cycle.\"* **(ii) Aarogya Setu and Ayushman Bharat** &gt;*\"Leads in the Aarogya Setu should be verified by Ayushman Bharat System and the filtered set of leads should be shared with states. Further feedback and action taken from field staff should flow back to Aarogya Setu.\"* *\"The group was further informed that both Bluetooth and self assessment data (cleaned by Aarogya Bharat) are flowing from Aarogya Setu to S3 and vice-versa.\"* During the meetings, concerns were raised about sharing of health data between so many databases with Dr. Harpreet Singh, ICMR noting that *\"lab data of Covid-19 is highly sensitive (health data) and at present there are many APIs for sharing of data with different stakeholders including NDMA, NHA &amp; others. There is need for Do’s and Don’ts with clear set of guidelines to secure the data.\"* Government officials also seem to be aware of inaccurate reporting of a person's status by the Aarogya Setu app. For instance, during one of the meetings, Mr. RS Mani, DDG NIC highlighted *\"the issue of false alarm (person released from hospital but status not updated).\"* The technical design choices of Aarogya Setu have been a subject of discussion among members of the 9th Empowered Group and officials from National Informatics Centre (NIC) were required to explain their reasons for adopting a static ID and not sharing the source code initially but these reasons are not mentioned in the minutes. NIC officials further pointed out that India could not use the Google-Apple API because it prohibited location tracking. NIC was also entrusted with the responsibility of handling the back end code of Aarogya Setu and it worked with pro bono volunteers from HP on this project. ### ITIHAS Hotspot Mapping and Prediction System The minutes of meetings of the 9th Empowered Group contain several references to the ITIHAS system developed by Prof. Kamakoti, IIT Madras and NSAB for hotspot mapping and prediction. The forecasts from ITIHAS were to be integrated with the COVID India Portal (S3) and Prof. Kamakoti also made a presentation on findings from integration of ITIHAS with Aarogya Setu data. The documents also contain references to a project called 'Aarogya Rekha' being developed by Prof. Kamakoti which would be integrated with Aarogya Setu. Once this integration was done, states would then be asked to start using this tool for geographical marking of hot-spots. ### Use of Cell Tower Location Data The minutes of meetings reveal that proposals to use cell tower location data to track the movement of persons was first considered in the context of the post lockdown exodus of migrants. It was decided that the Department of Telecom (DoT) would determine what kind of telecom data could be obtained about movement of migrants and this data could subsequently be shared with state governments to follow up with individual cases. Once this data was collected by DoT, it was shared with Professor Kamakoti for further analysis and it was also made available on the COVID India Portal (S-3). In later meetings, it is clarified that the data has been aggregated at Cell Tower Level and anonymised to remove all mobile numbers and personal details but it is not clear at what stage such anonymisation took place. During one of the meetings, the DoT officials also offered to *\"monitor the intrusion (persons with/without pass) and report the telephone numbers which do not have valid pass to States/Authorities.\"* For this purpose, DoT was supposed to create a dashboard with latitude and longitude coordinates for all telephone numbers which could be piloted in a city. ### Important Documents 1. Folder containing minutes of meetings of 9th Empowered Group ([**link**](https://drive.google.com/drive/folders/1fF-UmjWa0Sr_lLx9gkYsqZJID6C91hOM?usp=sharing)) 2. Previous post titled 'A look at Aarogya Setu through the Right to Information lens' dated 27 May 2020 ([**link**](https://internetfreedom.in/aarogya-setu-through-the-right-to-information-lens/))",
    "light_cleaned_comments": "Corona was just an excuse, gobarment is hellbent on tracking each and every movement of citizens and waste thousands of crores of tax payers money. Gau rogya setu app laga dala to 360 degree surveillance jhinga la la. Fodi hai to mumkin hai. Couple of things I've wondered about these systems is how long the data is retained for, and who oversees which departments get access to which API. For purposes of COVID tracing surely any data older than say 30 days is useless and needs to be erased."
}