{
    "id": "1711ft6",
    "title": "These are Online Journalists?",
    "url": "https://www.reddit.com/gallery/1711ft6",
    "selftext": "What in even Now Something Orange and Green is Becoming Indian Flag and Every Punjabi if seen wearing this colour combination is now a Khalistani?? It's mind boggling to see such retarded grown aßß people.\n\nHere's the Original Tweet - https://twitter.com/AsYouNotWish/status/1709867097957011841?t=jBRMLI--H4UTaF2uWQmbTA&s=19",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696561171.0,
    "convurl": "https://i.redd.it/k5ezbf9ezhsb1.jpg",
    "comments": [
        "Godi media has been aggressive against the Sikhs for some time now.",
        "Did you forget the whole Bhesharam  Rang fiasco  , all these retards   need is something  that resonates  with the bhakt mandali  nd it's circus from thereon ..",
        "My honest reaction to her:/j\n\nhttps://preview.redd.it/6soj3yuj7isb1.png?width=1080&format=pjpg&auto=webp&s=f22ba17d1ff6a774ee68ad90504305bdaa15fd38",
        "https://preview.redd.it/g3yp2j8hcisb1.jpeg?width=1280&format=pjpg&auto=webp&s=92feb450899b4601154d73f2d9225c4d3472934d\n\nMe to Ms Mahajan",
        "If someone spits toward the sun, it is going to fall back to his face.\n\nHindustan Zindabad tha, Zindabad hai aur Zindabad rahega...",
        "Lemme just yoink this for future use :)",
        "Stealing this.\n\nThanks.",
        "Ye sab mere feed me toh nahi aata😂 \n\nAlag alag kono se khoj ke laate ho kya ye sab?",
        "Tu Gadar 2 phir we dekh ke aaa pehle",
        "When u think RW journalist can't stoop any lower",
        "Not a journalist. I think she is one of those paid members of BJ Party IT Cell. \nShe has gained her following amongst the people as someone from Kashmiri Dogra community. \nBut unfortunately she uses that to spew venom against anyone and everyone who are against BJP.",
        "Why the hell you're getting downvoted?",
        "What if rindia is full of rpakistan users .\nKanspiratcy theory",
        "What’s the bitch trying to do here? To frame Diljit as disrespecting the flag?",
        "Yes.",
        "Apparently Because He Is Wearing a \"Pajama\" with Green colour.\n\nWhy can't a similar argument be phrased like he is wearing a saffron turban with white shirt and green pants so he is looking Irish lmao.\n\nhttps://preview.redd.it/4b73k9vrpjsb1.jpeg?width=1080&format=pjpg&auto=webp&s=30549a9b538ce7e02448b82882262499de30e9f5",
        "Too low even for this godhi larping bitch.",
        "paxtanis getting mad",
        "Isn't diljeet in the video is wearing a saffron turban with white shirt.\nAren't saffron and white colors of the Indian flag?",
        "A good propagandist would spin this as an assault on Hindu (orange) and Muslim (green) culture, but alas the Sanghi bitch can't even be sasti Goebbels"
    ],
    "cleaned_text": "online journalists even something orange green becoming indian flag every punjabi seen wearing colour combination khalistani mind boggling see retarded grown people heres original tweet ",
    "cleaned_title": "online journalists",
    "cleaned_selftext": "even something orange green becoming indian flag every punjabi seen wearing colour combination khalistani mind boggling see retarded grown people heres original tweet",
    "cleaned_comments": "godi media aggressive sikhs time forget whole bhesharam rang fiasco retards need something resonates bhakt mandali nd circus thereon honest reaction herj ms mahajan someone spits toward sun going fall back face hindustan zindabad tha zindabad hai aur zindabad rahega lem yoink future use stealing thanks ye sab mere feed toh nahi aata alag alag kono se khoj ke laate ho kya ye sab tu gadar phir dekh ke aaa pehle u think rw journalist cant stoop lower journalist think one paid members bj party cell gained following amongst people someone kashmiri dogra community unfortunately uses spew venom anyone everyone bjp hell youre getting downvoted rindia full rpakistan users kanspiratcy theory whats bitch trying frame diljit disrespecting flag yes apparently wearing pajama green colour cant similar argument phrased like wearing saffron turban white shirt green pants looking irish lmao low even godhi larping bitch paxtanis getting mad isnt diljeet video wearing saffron turban white shirt arent saffron white colors indian flag good propagandist would spin assault hindu orange muslim green culture alas sanghi bitch cant even sasti goebbels",
    "light_cleaned_title": "These are Online Journalists?",
    "light_cleaned_selftext": "What in even Now Something Orange and Green is Becoming Indian Flag and Every Punjabi if seen wearing this colour combination is now a Khalistani?? It's mind boggling to see such retarded grown aßß people. Here's the Original Tweet -",
    "light_cleaned_comments": "Godi media has been aggressive against the Sikhs for some time now. Did you forget the whole Bhesharam Rang fiasco , all these retards need is something that resonates with the bhakt mandali nd it's circus from thereon .. My honest reaction to her:/j Me to Ms Mahajan If someone spits toward the sun, it is going to fall back to his face. Hindustan Zindabad tha, Zindabad hai aur Zindabad rahega... Lemme just yoink this for future use :) Stealing this. Thanks. Ye sab mere feed me toh nahi aata😂 Alag alag kono se khoj ke laate ho kya ye sab? Tu Gadar 2 phir we dekh ke aaa pehle When u think RW journalist can't stoop any lower Not a journalist. I think she is one of those paid members of BJ Party IT Cell. She has gained her following amongst the people as someone from Kashmiri Dogra community. But unfortunately she uses that to spew venom against anyone and everyone who are against BJP. Why the hell you're getting downvoted? What if rindia is full of rpakistan users . Kanspiratcy theory What’s the bitch trying to do here? To frame Diljit as disrespecting the flag? Yes. Apparently Because He Is Wearing a \"Pajama\" with Green colour. Why can't a similar argument be phrased like he is wearing a saffron turban with white shirt and green pants so he is looking Irish lmao. Too low even for this godhi larping bitch. paxtanis getting mad Isn't diljeet in the video is wearing a saffron turban with white shirt. Aren't saffron and white colors of the Indian flag? A good propagandist would spin this as an assault on Hindu (orange) and Muslim (green) culture, but alas the Sanghi bitch can't even be sasti Goebbels"
}