{
    "id": "19bxcj8",
    "title": "Racism against indian women is sickening",
    "url": "https://www.reddit.com/gallery/19bxcj8",
    "selftext": "I know that I am not supposed to look into these subreddits. But why racism is so casual against Indians?",
    "flair": "Rant / Vent",
    "score": 13,
    "num_comments": 15,
    "created_utc": 1705819755.0,
    "convurl": "https://i.redd.it/gky7pzfwpqdc1.png",
    "comments": [
        "You are on an incel sub what did you expect?",
        "These people never got laid (its an incel sub) and they blame it on women for that , and they keep this shit up they probably never will",
        "It's hard to believe people like this too exist...are they white ?",
        "Why are you in incel subreddits ? Thay are trash.",
        "An Indian Woman must have laughed at their small 🥜. Must have hurt their white male ego",
        "Yes",
        "What sub is that?",
        "4chan",
        "It's foolish to expect normal behavior from those gremlins. They have no idea how to move in a normal society. Yes racism is a problem definitely but you are also looking into a sub of violently white supremacist and misogynistic trolls.",
        "I want Indians with their population to use 4chan. I will see what these guys do. They will probably sh%t their pants. Like they make fun of indians on open defacation. I know it exists, but still",
        "Hell nah💀"
    ],
    "cleaned_text": "racism indian women sickening know supposed look subreddits racism casual indians ",
    "cleaned_title": "racism indian women sickening",
    "cleaned_selftext": "know supposed look subreddits racism casual indians",
    "cleaned_comments": "incel sub expect people never got laid incel sub blame women keep shit probably never hard believe people like existare white incel subreddits thay trash indian woman must laughed small must hurt white male ego yes sub chan foolish expect normal behavior gremlins idea move normal society yes racism problem definitely also looking sub violently white supremacist misogynistic trolls want indians population use chan see guys probably sht pants like make fun indians open defacation know exists still hell nah",
    "light_cleaned_title": "Racism against indian women is sickening",
    "light_cleaned_selftext": "I know that I am not supposed to look into these subreddits. But why racism is so casual against Indians?",
    "light_cleaned_comments": "You are on an incel sub what did you expect? These people never got laid (its an incel sub) and they blame it on women for that , and they keep this shit up they probably never will It's hard to believe people like this too exist...are they white ? Why are you in incel subreddits ? Thay are trash. An Indian Woman must have laughed at their small 🥜. Must have hurt their white male ego Yes What sub is that? 4chan It's foolish to expect normal behavior from those gremlins. They have no idea how to move in a normal society. Yes racism is a problem definitely but you are also looking into a sub of violently white supremacist and misogynistic trolls. I want Indians with their population to use 4chan. I will see what these guys do. They will probably sh%t their pants. Like they make fun of indians on open defacation. I know it exists, but still Hell nah💀"
}