{
    "id": "1dpl09j",
    "title": "Charanseva: The Evil Practice of Indian Society",
    "url": "https://www.reddit.com/r/india/comments/1dpl09j/charanseva_the_evil_practice_of_indian_society/",
    "selftext": "Charanseva, traditionally seen as an act of deep respect and reverence towards elders and spiritual leaders in Indian society, has increasingly taken on darker connotations in recent times. Historically, this ritual involved acts such as washing the feet of elders or spiritual gurus, symbolizing humility and devotion. However, in the contemporary context, it often perpetuates social hierarchies and exploitation, undermining its original spirit.\n\nThe historical significance of charanseva can be traced back to ancient customs where disciples performed acts of service for their gurus, signifying devotion and respect. In households, touching the feet of elders is a common gesture of seeking blessings. Yet, what was once a voluntary act of reverence has often morphed into a tool for reinforcing caste and economic hierarchies, turning respect into subjugation.\n\nA significant historical example of the misuse of such practices is the Maharaj Libel Case of 1862. This landmark case revolved around Karsandas Mulji, a social reformer and journalist who published articles in his Gujarati weekly, \"Satya Prakash,\" criticizing the Vallabhacharya sect's Pustimarg tradition. Mulji alleged that Jadunathji Brijratanji Maharaj, a religious leader of the sect, was exploiting devotees, particularly women, under the guise of religious rituals. The Maharaj, feeling his reputation threatened, filed a defamation suit against Mulji and the publisher, Nanabhai Rustomji Ranina.\n\nThe trial, which took place in the Bombay High Court, became a battleground for competing principles of freedom of speech and religious defamation. Mulji's defense was that his articles were a form of investigative journalism exposing corrupt practices. The court proceedings revealed disturbing details about the Maharaj's alleged exploitation of female devotees, including testimonies from witnesses and physicians who claimed that the Maharaj had sexually exploited many women and even contracted syphilis from these encounters [oai_citation:1,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:2,Who was Pushtimarg sect's Jadunathji Brijratanji? Accused of sexual misconduct, Case inspired controversial film Maharaj](https://www.dnaindia.com/bollywood/report-who-was-jadunathji-brijratanji-head-of-pushtimarg-sect-who-inspired-junaid-khan-jaideep-ahlawat-maharaj-3093516).\n\nDespite the Maharaj's denial of all accusations, the evidence presented by Mulji's defense, including testimonies from Bhau Daji, the Maharaj's physician, and other witnesses, proved overwhelming. The court ultimately ruled in favor of Mulji, marking a significant victory for freedom of the press and highlighting the exploitative potential of religious practices like charanseva [oai_citation:3,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:4,Real-Life JJ (Jadunathji Brijratnaji) In Netflix's 'Maharaj' Film](https://dmtalkies.com/real-life-jj-jadunathji-brijratnaji-in-netflix-maharaj-film-2024/).\n\nMoreover, Jadunathji Brijratanji Maharaj was later prosecuted for rape and other offenses. The revelations during the trial were shocking, with witnesses describing how the Maharaj used his religious position to sexually exploit women and young girls, some as young as fourteen. These testimonies highlighted the severe abuse of power and trust by the Maharaj, further emphasizing the need for scrutiny and reform in religious practices [oai_citation:5,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:6,Real-Life JJ (Jadunathji Brijratnaji) In Netflix's 'Maharaj' Film](https://dmtalkies.com/real-life-jj-jadunathji-brijratnaji-in-netflix-maharaj-film-2024/).\n\nThe recent Netflix movie \"Maharaj,\" starring Junaid Khan, has reignited interest in this historical case. The film portrays the efforts of Karsandas Mulji to expose the alleged sexual misconduct of Jadunathji Brijratanji Maharaj. However, its release has been controversial, with some arguing that it portrays the religious sect in a negative light. This debate underscores the ongoing tension between freedom of expression and the protection of religious beliefs [oai_citation:7,The Maharaj Libel Case 1862- behind Junaid Khan Netflix Movie](https://arynews.tv/maharaj-libel-case-of-1862-back-in-the-spotlight/) [oai_citation:8,Who was Pushtimarg sect's Jadunathji Brijratanji? Accused of sexual misconduct, Case inspired controversial film Maharaj](https://www.dnaindia.com/bollywood/report-who-was-jadunathji-brijratanji-head-of-pushtimarg-sect-who-inspired-junaid-khan-jaideep-ahlawat-maharaj-3093516).\n\nCharanseva, when practiced in its true spirit, symbolizes humility, respect, and devotion. However, its modern misinterpretations often reflect the darker aspects of Indian society, perpetuating inequality and exploitation. ",
    "flair": "Law & Courts",
    "score": 90,
    "num_comments": 20,
    "created_utc": 1719471376.0,
    "convurl": "https://external-preview.redd.it/Uzx5td38ZIU9HfNvKhYD5f-86xuMoNCXwHeqmgjfHJc.jpg?auto=webp&s=37f196df9ce044f26846cc4f2b68bd5b50c9b577",
    "comments": [
        "I still want to know what was censored from the movie Maharaj?\n\nAlso kudos to Aamir Khan for having his son debut through such a meaningful movie over some masala or rom-com flick.",
        "How does charanseva equate to sexual exploitation? I personally feel charanseva if forced is a bad thing but to criticize it because some dhongi baba raped his followers is a logic I don't follow",
        "I guess even I’m wondering how the arguments presented strengthen the opinion about Chanranseva",
        "Even touching elders feet just because they are elders is unnecessary subservience.",
        "It's a logical leap, common practice when you want to bring in guilt by association.",
        "No no, you're not supposed to question the post. It reflects the deeply conditioned hindu reactive element inside you. Stop being a bigot and toe in line.",
        "Did you even get to the end of the post? Did you read the court proceedings? Did you at least watch the movie? \nWho is saying charanseva equals sexual exploitation?",
        "So people aren't allowed to question clickbaity titles which villifies whole practice because a cultist used it to exploit others?",
        "No they're supposed to read the post first. Looks like you haven't heard of don't judge a book by it's cover. Didn't go to school?",
        "why do you have so much hate you in bro? the title is clickbaity, a person reads a reddit post, because it seem interesting, this is reddit not a new channel, we are not here to bore ourself with thing we dont want to watch, so basically a post title is interesting you click it, but the post  and its title are are not really connect, why would i then read the full article, do google searches and other shit. When i am not even interested?  \nIs this a job for me? no right?",
        "Look \"bro\" I don't have hate. But I do believe people should be aware of social evils. The title may be clickbaity yes BUT OMG charanseva how can they equate it to sexual exploitation is NOT the message. \n\nThe message is that any religious concept can be twisted by people in power to exploit people in the name of religion. \n\nThis post brings light to that but please go ahead and say such a leap, and post ignorant comments just because it's critical of a Hindu concept. Really? \n\nWhat do you mean is this a job for me? If you're not interested don't comment, go read the next post.",
        "You're supposed to question the post after you actually read the post. You read the title and started burning inside, which proves that you do have that reactive element inside you. \n\nThe post specifically goes into the benign and magicians success of the practice. You just need to read.",
        "And You know if the post wasn't clickbaity , nobody would notice it , sexual exploitation under a light of a legitimate crime is often neglected in our society specially when it has religious grounds .",
        "Reddit is a funny place. Look who's talking about going to school. The same dumbfuck who can't comprehend that only after reading the whole post will people complain that the title is clickbaity. \nSomeone who has just read the title will just say that \"No! How can you say charanvandana is bad?\" instead of questioning the clickbaity title. But maybe all this is too hard to understand for your pea-sized brain. Get better. You sound too bitter. Maybe consider getting professional help. It's not taboo. \n\n>The title says evils of SOCIETY not of religion. \n\nI couldn't care less. I am not a staunch follower of that sect nor a devout Hindu. Also, I was already aware of this scandal prior to the movie release but I would've still appreciated this well written and summarised post if not for the clickbaity title.",
        "It's not even charanvandana. Yes Reddit is for people who can read for others there's Instagram.\n\nWhy the hell are y'all acting as if the comment is questioning the clickbaity title? It's such an ignorant comment and that's not even what the title says???",
        "Not only will I not read the post because I can't,  but I will also engage in more such toxic conversations as is my right.",
        "OP the case judgement was not in Mulji's favour. He was found guilty of libel but since his arguments and defense impressed the judges he was let off with a fine of 5 rupees only. From the wiki link you cited.",
        "Bullshit. How did you associate charan seva with rape? You are the same category of people who associate swastik with genocide. An evil person came along and hijacked a symbol, and now the symbol is screwed forever? GTFOH",
        "let’s be honest. Junaid doesn’t have the screen presence for a big budget cinema release. It is an important topic, but the screenplay and a lot of the acting was mediocre at best.",
        "It's not limited to a dhongi sadhu exploiting his followers for sexual favors, it's shocking that other 'random' people could watch this 'engagement' from little windows up above, like medical residents do in an operation theatre. Having these inappropriate practices institutionalized to the extent normalization , boggles my mind."
    ],
    "cleaned_text": "charanseva evil practice indian society charanseva traditionally seen act deep respect reverence towards elders spiritual leaders indian society increasingly taken darker connotations recent times historically ritual involved acts washing feet elders spiritual gurus symbolizing humility devotion however contemporary context often perpetuates social hierarchies exploitation undermining original spirit historical significance charanseva traced back ancient customs disciples performed acts service gurus signifying devotion respect households touching feet elders common gesture seeking blessings yet voluntary act reverence often morphed tool reinforcing caste economic hierarchies turning respect subjugation significant historical example misuse practices maharaj libel case landmark case revolved around karsandas mulji social reformer journalist published articles gujarati weekly satya prakash criticizing vallabhacharya sects pustimarg tradition mulji alleged jadunathji brijratanji maharaj religious leader sect exploiting devotees particularly women guise religious rituals maharaj feeling reputation threatened filed defamation suit mulji publisher nanabhai rustomji ranina trial took place bombay high court became battleground competing principles freedom speech religious defamation muljis defense articles form investigative journalism exposing corrupt practices court proceedings revealed disturbing details maharajs alleged exploitation female devotees including testimonies witnesses physicians claimed maharaj sexually exploited many women even contracted syphilis encounters oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationwho pushtimarg sects jadunathji brijratanji accused sexual misconduct case inspired controversial film maharajhttpswwwdnaindiacombollywoodreportwhowasjadunathjibrijratanjiheadofpushtimargsectwhoinspiredjunaidkhanjaideepahlawatmaharaj despite maharajs denial accusations evidence presented muljis defense including testimonies bhau daji maharajs physician witnesses proved overwhelming court ultimately ruled favor mulji marking significant victory freedom press highlighting exploitative potential religious practices like charanseva oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationreallife jj jadunathji brijratnaji netflixs maharaj filmhttpsdmtalkiescomreallifejjjadunathjibrijratnajiinnetflixmaharajfilm moreover jadunathji brijratanji maharaj later prosecuted rape offenses revelations trial shocking witnesses describing maharaj used religious position sexually exploit women young girls young fourteen testimonies highlighted severe abuse power trust maharaj emphasizing need scrutiny reform religious practices oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationreallife jj jadunathji brijratnaji netflixs maharaj filmhttpsdmtalkiescomreallifejjjadunathjibrijratnajiinnetflixmaharajfilm recent netflix movie maharaj starring junaid khan reignited interest historical case film portrays efforts karsandas mulji expose alleged sexual misconduct jadunathji brijratanji maharaj however release controversial arguing portrays religious sect negative light debate underscores ongoing tension freedom expression protection religious beliefs oaicitationthe maharaj libel case behind junaid khan netflix moviehttpsarynewstvmaharajlibelcaseofbackinthespotlight oaicitationwho pushtimarg sects jadunathji brijratanji accused sexual misconduct case inspired controversial film maharajhttpswwwdnaindiacombollywoodreportwhowasjadunathjibrijratanjiheadofpushtimargsectwhoinspiredjunaidkhanjaideepahlawatmaharaj charanseva practiced true spirit symbolizes humility respect devotion however modern misinterpretations often reflect darker aspects indian society perpetuating inequality exploitation ",
    "cleaned_title": "charanseva evil practice indian society",
    "cleaned_selftext": "charanseva traditionally seen act deep respect reverence towards elders spiritual leaders indian society increasingly taken darker connotations recent times historically ritual involved acts washing feet elders spiritual gurus symbolizing humility devotion however contemporary context often perpetuates social hierarchies exploitation undermining original spirit historical significance charanseva traced back ancient customs disciples performed acts service gurus signifying devotion respect households touching feet elders common gesture seeking blessings yet voluntary act reverence often morphed tool reinforcing caste economic hierarchies turning respect subjugation significant historical example misuse practices maharaj libel case landmark case revolved around karsandas mulji social reformer journalist published articles gujarati weekly satya prakash criticizing vallabhacharya sects pustimarg tradition mulji alleged jadunathji brijratanji maharaj religious leader sect exploiting devotees particularly women guise religious rituals maharaj feeling reputation threatened filed defamation suit mulji publisher nanabhai rustomji ranina trial took place bombay high court became battleground competing principles freedom speech religious defamation muljis defense articles form investigative journalism exposing corrupt practices court proceedings revealed disturbing details maharajs alleged exploitation female devotees including testimonies witnesses physicians claimed maharaj sexually exploited many women even contracted syphilis encounters oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationwho pushtimarg sects jadunathji brijratanji accused sexual misconduct case inspired controversial film maharajhttpswwwdnaindiacombollywoodreportwhowasjadunathjibrijratanjiheadofpushtimargsectwhoinspiredjunaidkhanjaideepahlawatmaharaj despite maharajs denial accusations evidence presented muljis defense including testimonies bhau daji maharajs physician witnesses proved overwhelming court ultimately ruled favor mulji marking significant victory freedom press highlighting exploitative potential religious practices like charanseva oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationreallife jj jadunathji brijratnaji netflixs maharaj filmhttpsdmtalkiescomreallifejjjadunathjibrijratnajiinnetflixmaharajfilm moreover jadunathji brijratanji maharaj later prosecuted rape offenses revelations trial shocking witnesses describing maharaj used religious position sexually exploit women young girls young fourteen testimonies highlighted severe abuse power trust maharaj emphasizing need scrutiny reform religious practices oaicitationmaharaj libel case wikipediahttpsenwikipediaorgwikimaharajlibelcase oaicitationreallife jj jadunathji brijratnaji netflixs maharaj filmhttpsdmtalkiescomreallifejjjadunathjibrijratnajiinnetflixmaharajfilm recent netflix movie maharaj starring junaid khan reignited interest historical case film portrays efforts karsandas mulji expose alleged sexual misconduct jadunathji brijratanji maharaj however release controversial arguing portrays religious sect negative light debate underscores ongoing tension freedom expression protection religious beliefs oaicitationthe maharaj libel case behind junaid khan netflix moviehttpsarynewstvmaharajlibelcaseofbackinthespotlight oaicitationwho pushtimarg sects jadunathji brijratanji accused sexual misconduct case inspired controversial film maharajhttpswwwdnaindiacombollywoodreportwhowasjadunathjibrijratanjiheadofpushtimargsectwhoinspiredjunaidkhanjaideepahlawatmaharaj charanseva practiced true spirit symbolizes humility respect devotion however modern misinterpretations often reflect darker aspects indian society perpetuating inequality exploitation",
    "cleaned_comments": "still want know censored movie maharaj also kudos aamir khan son debut meaningful movie masala romcom flick charanseva equate sexual exploitation personally feel charanseva forced bad thing criticize dhongi baba raped followers logic dont follow guess even im wondering arguments presented strengthen opinion chanranseva even touching elders feet elders unnecessary subservience logical leap common practice want bring guilt association youre supposed question post reflects deeply conditioned hindu reactive element inside stop bigot toe line even get end post read court proceedings least watch movie saying charanseva equals sexual exploitation people arent allowed question clickbaity titles villifies whole practice cultist used exploit others theyre supposed read post first looks like havent heard dont judge book cover didnt go school much hate bro title clickbaity person reads reddit post seem interesting reddit new channel bore ourself thing dont want watch basically post title interesting click post title really connect would read full article google searches shit even interested job right look bro dont hate believe people aware social evils title may clickbaity yes omg charanseva equate sexual exploitation message message religious concept twisted people power exploit people name religion post brings light please go ahead say leap post ignorant comments critical hindu concept really mean job youre interested dont comment go read next post youre supposed question post actually read post read title started burning inside proves reactive element inside post specifically goes benign magicians success practice need read know post wasnt clickbaity nobody would notice sexual exploitation light legitimate crime often neglected society specially religious grounds reddit funny place look whos talking going school dumbfuck cant comprehend reading whole post people complain title clickbaity someone read title say say charanvandana bad instead questioning clickbaity title maybe hard understand peasized brain get better sound bitter maybe consider getting professional help taboo title says evils society religion couldnt care less staunch follower sect devout hindu also already aware scandal prior movie release wouldve still appreciated well written summarised post clickbaity title even charanvandana yes reddit people read others theres instagram hell yall acting comment questioning clickbaity title ignorant comment thats even title says read post cant also engage toxic conversations right op case judgement muljis favour found guilty libel since arguments defense impressed judges let fine rupees wiki link cited bullshit associate charan seva rape category people associate swastik genocide evil person came along hijacked symbol symbol screwed forever gtfoh lets honest junaid doesnt screen presence big budget cinema release important topic screenplay lot acting mediocre best limited dhongi sadhu exploiting followers sexual favors shocking random people could watch engagement little windows like medical residents operation theatre inappropriate practices institutionalized extent normalization boggles mind",
    "light_cleaned_title": "Charanseva: The Evil Practice of Indian Society",
    "light_cleaned_selftext": "Charanseva, traditionally seen as an act of deep respect and reverence towards elders and spiritual leaders in Indian society, has increasingly taken on darker connotations in recent times. Historically, this ritual involved acts such as washing the feet of elders or spiritual gurus, symbolizing humility and devotion. However, in the contemporary context, it often perpetuates social hierarchies and exploitation, undermining its original spirit. The historical significance of charanseva can be traced back to ancient customs where disciples performed acts of service for their gurus, signifying devotion and respect. In households, touching the feet of elders is a common gesture of seeking blessings. Yet, what was once a voluntary act of reverence has often morphed into a tool for reinforcing caste and economic hierarchies, turning respect into subjugation. A significant historical example of the misuse of such practices is the Maharaj Libel Case of 1862. This landmark case revolved around Karsandas Mulji, a social reformer and journalist who published articles in his Gujarati weekly, \"Satya Prakash,\" criticizing the Vallabhacharya sect's Pustimarg tradition. Mulji alleged that Jadunathji Brijratanji Maharaj, a religious leader of the sect, was exploiting devotees, particularly women, under the guise of religious rituals. The Maharaj, feeling his reputation threatened, filed a defamation suit against Mulji and the publisher, Nanabhai Rustomji Ranina. The trial, which took place in the Bombay High Court, became a battleground for competing principles of freedom of speech and religious defamation. Mulji's defense was that his articles were a form of investigative journalism exposing corrupt practices. The court proceedings revealed disturbing details about the Maharaj's alleged exploitation of female devotees, including testimonies from witnesses and physicians who claimed that the Maharaj had sexually exploited many women and even contracted syphilis from these encounters [oai_citation:1,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:2,Who was Pushtimarg sect's Jadunathji Brijratanji? Accused of sexual misconduct, Case inspired controversial film Maharaj](https://www.dnaindia.com/bollywood/report-who-was-jadunathji-brijratanji-head-of-pushtimarg-sect-who-inspired-junaid-khan-jaideep-ahlawat-maharaj-3093516). Despite the Maharaj's denial of all accusations, the evidence presented by Mulji's defense, including testimonies from Bhau Daji, the Maharaj's physician, and other witnesses, proved overwhelming. The court ultimately ruled in favor of Mulji, marking a significant victory for freedom of the press and highlighting the exploitative potential of religious practices like charanseva [oai_citation:3,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:4,Real-Life JJ (Jadunathji Brijratnaji) In Netflix's 'Maharaj' Film](https://dmtalkies.com/real-life-jj-jadunathji-brijratnaji-in-netflix-maharaj-film-2024/). Moreover, Jadunathji Brijratanji Maharaj was later prosecuted for rape and other offenses. The revelations during the trial were shocking, with witnesses describing how the Maharaj used his religious position to sexually exploit women and young girls, some as young as fourteen. These testimonies highlighted the severe abuse of power and trust by the Maharaj, further emphasizing the need for scrutiny and reform in religious practices [oai_citation:5,Maharaj Libel Case - Wikipedia](https://en.wikipedia.org/wiki/Maharaj_Libel_Case) [oai_citation:6,Real-Life JJ (Jadunathji Brijratnaji) In Netflix's 'Maharaj' Film](https://dmtalkies.com/real-life-jj-jadunathji-brijratnaji-in-netflix-maharaj-film-2024/). The recent Netflix movie \"Maharaj,\" starring Junaid Khan, has reignited interest in this historical case. The film portrays the efforts of Karsandas Mulji to expose the alleged sexual misconduct of Jadunathji Brijratanji Maharaj. However, its release has been controversial, with some arguing that it portrays the religious sect in a negative light. This debate underscores the ongoing tension between freedom of expression and the protection of religious beliefs [oai_citation:7,The Maharaj Libel Case 1862- behind Junaid Khan Netflix Movie](https://arynews.tv/maharaj-libel-case-of-1862-back-in-the-spotlight/) [oai_citation:8,Who was Pushtimarg sect's Jadunathji Brijratanji? Accused of sexual misconduct, Case inspired controversial film Maharaj](https://www.dnaindia.com/bollywood/report-who-was-jadunathji-brijratanji-head-of-pushtimarg-sect-who-inspired-junaid-khan-jaideep-ahlawat-maharaj-3093516). Charanseva, when practiced in its true spirit, symbolizes humility, respect, and devotion. However, its modern misinterpretations often reflect the darker aspects of Indian society, perpetuating inequality and exploitation.",
    "light_cleaned_comments": "I still want to know what was censored from the movie Maharaj? Also kudos to Aamir Khan for having his son debut through such a meaningful movie over some masala or rom-com flick. How does charanseva equate to sexual exploitation? I personally feel charanseva if forced is a bad thing but to criticize it because some dhongi baba raped his followers is a logic I don't follow I guess even I’m wondering how the arguments presented strengthen the opinion about Chanranseva Even touching elders feet just because they are elders is unnecessary subservience. It's a logical leap, common practice when you want to bring in guilt by association. No no, you're not supposed to question the post. It reflects the deeply conditioned hindu reactive element inside you. Stop being a bigot and toe in line. Did you even get to the end of the post? Did you read the court proceedings? Did you at least watch the movie? Who is saying charanseva equals sexual exploitation? So people aren't allowed to question clickbaity titles which villifies whole practice because a cultist used it to exploit others? No they're supposed to read the post first. Looks like you haven't heard of don't judge a book by it's cover. Didn't go to school? why do you have so much hate you in bro? the title is clickbaity, a person reads a reddit post, because it seem interesting, this is reddit not a new channel, we are not here to bore ourself with thing we dont want to watch, so basically a post title is interesting you click it, but the post and its title are are not really connect, why would i then read the full article, do google searches and other shit. When i am not even interested? Is this a job for me? no right? Look \"bro\" I don't have hate. But I do believe people should be aware of social evils. The title may be clickbaity yes BUT OMG charanseva how can they equate it to sexual exploitation is NOT the message. The message is that any religious concept can be twisted by people in power to exploit people in the name of religion. This post brings light to that but please go ahead and say such a leap, and post ignorant comments just because it's critical of a Hindu concept. Really? What do you mean is this a job for me? If you're not interested don't comment, go read the next post. You're supposed to question the post after you actually read the post. You read the title and started burning inside, which proves that you do have that reactive element inside you. The post specifically goes into the benign and magicians success of the practice. You just need to read. And You know if the post wasn't clickbaity , nobody would notice it , sexual exploitation under a light of a legitimate crime is often neglected in our society specially when it has religious grounds . Reddit is a funny place. Look who's talking about going to school. The same dumbfuck who can't comprehend that only after reading the whole post will people complain that the title is clickbaity. Someone who has just read the title will just say that \"No! How can you say charanvandana is bad?\" instead of questioning the clickbaity title. But maybe all this is too hard to understand for your pea-sized brain. Get better. You sound too bitter. Maybe consider getting professional help. It's not taboo. >The title says evils of SOCIETY not of religion. I couldn't care less. I am not a staunch follower of that sect nor a devout Hindu. Also, I was already aware of this scandal prior to the movie release but I would've still appreciated this well written and summarised post if not for the clickbaity title. It's not even charanvandana. Yes Reddit is for people who can read for others there's Instagram. Why the hell are y'all acting as if the comment is questioning the clickbaity title? It's such an ignorant comment and that's not even what the title says??? Not only will I not read the post because I can't, but I will also engage in more such toxic conversations as is my right. OP the case judgement was not in Mulji's favour. He was found guilty of libel but since his arguments and defense impressed the judges he was let off with a fine of 5 rupees only. From the wiki link you cited. Bullshit. How did you associate charan seva with rape? You are the same category of people who associate swastik with genocide. An evil person came along and hijacked a symbol, and now the symbol is screwed forever? GTFOH let’s be honest. Junaid doesn’t have the screen presence for a big budget cinema release. It is an important topic, but the screenplay and a lot of the acting was mediocre at best. It's not limited to a dhongi sadhu exploiting his followers for sexual favors, it's shocking that other 'random' people could watch this 'engagement' from little windows up above, like medical residents do in an operation theatre. Having these inappropriate practices institutionalized to the extent normalization , boggles my mind."
}