{
    "id": "14bsua2",
    "title": "which paper is used by ICSE to print the marksheet?",
    "url": "https://www.reddit.com/r/india/comments/14bsua2/which_paper_is_used_by_icse_to_print_the_marksheet/",
    "selftext": "i wanted a coloured printout of my original ICSE marksheets but I don't want them on a regular A4 paper, i would like to have it on the same paper that the marksheets are printed on, its slightly thicker than regular paper, does anyone know what the paper is called?\n\n&#x200B;\n\nThis is what my marksheet looks like [https://qph.cf2.quoracdn.net/main-qimg-e8133a18bd9742044879ef7587fc4089](https://qph.cf2.quoracdn.net/main-qimg-e8133a18bd9742044879ef7587fc4089)  its someone else image i am just linking it as an example. I passed out in 2015",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 9,
    "created_utc": 1687012982.0,
    "convurl": "https://external-preview.redd.it/Sz3nNUYHk2uLgP3mACinIuBiFtAFly3R1NLNgM3ilhY.jpg?auto=webp&v=enabled&s=6f63697a3b48817edbb325c140709355af5a7311",
    "comments": [
        "Scammer be wildin",
        "You may want to blur out details of the name, school, parents name, etc.",
        "There is a subreddit called r/icse. Ask there.",
        "Nice marks",
        "I don't think you can post personal information on this sub. At least blur them out.",
        "Brooo there are so many creeps on reddit and so many scammers in India. Why would you post all your details here",
        "Hmm. Are you trying to fake or edit your mark sheet?",
        "probably bond paper . measure the thickness and get a paper like that and do laser printing  . but gota warn , printing like that could land you in troubles and xerox /colour xerox is more preferable",
        "no i lose my original ones so i want a printout of the digilocker ones that looks as close to original as possible."
    ],
    "cleaned_text": "paper used icse print marksheet wanted coloured printout original icse marksheets dont want regular paper would like paper marksheets printed slightly thicker regular paper anyone know paper called xb marksheet looks like httpsqphcfquoracdnnetmainqimgeabdeffchttpsqphcfquoracdnnetmainqimgeabdeffc someone else image linking example passed ",
    "cleaned_title": "paper used icse print marksheet",
    "cleaned_selftext": "wanted coloured printout original icse marksheets dont want regular paper would like paper marksheets printed slightly thicker regular paper anyone know paper called xb marksheet looks like httpsqphcfquoracdnnetmainqimgeabdeffchttpsqphcfquoracdnnetmainqimgeabdeffc someone else image linking example passed",
    "cleaned_comments": "scammer wildin may want blur details name school parents name etc subreddit called ricse ask nice marks dont think post personal information sub least blur brooo many creeps reddit many scammers india would post details hmm trying fake edit mark sheet probably bond paper measure thickness get paper like laser printing gota warn printing like could land troubles xerox colour xerox preferable lose original ones want printout digilocker ones looks close original possible",
    "light_cleaned_title": "which paper is used by ICSE to print the marksheet?",
    "light_cleaned_selftext": "i wanted a coloured printout of my original ICSE marksheets but I don't want them on a regular A4 paper, i would like to have it on the same paper that the marksheets are printed on, its slightly thicker than regular paper, does anyone know what the paper is called? &#x200B; This is what my marksheet looks like [https://qph.cf2.quoracdn.net/main-qimg-e8133a18bd9742044879ef7587fc4089](https://qph.cf2.quoracdn.net/main-qimg-e8133a18bd9742044879ef7587fc4089) its someone else image i am just linking it as an example. I passed out in 2015",
    "light_cleaned_comments": "Scammer be wildin You may want to blur out details of the name, school, parents name, etc. There is a subreddit called r/icse. Ask there. Nice marks I don't think you can post personal information on this sub. At least blur them out. Brooo there are so many creeps on reddit and so many scammers in India. Why would you post all your details here Hmm. Are you trying to fake or edit your mark sheet? probably bond paper . measure the thickness and get a paper like that and do laser printing . but gota warn , printing like that could land you in troubles and xerox /colour xerox is more preferable no i lose my original ones so i want a printout of the digilocker ones that looks as close to original as possible."
}