{
    "id": "16mm4jz",
    "title": "Please be careful of this scam!",
    "url": "https://i.redd.it/39pe2l65j6pb1.jpg",
    "selftext": "Update: Apparently I was not careful enough the first time, you can fill in the blanks for the redacted part",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695114984.0,
    "convurl": "https://i.redd.it/39pe2l65j6pb1.jpg",
    "comments": [
        "Their modus operandi is fairly simple.\n\n1. Add you to a telegram group with announcements where you cant reply\n2. There you'll see them assigning tasks (like rating in gmaps). \n3. You will have a PoC who will tell you to complete task and give screenshot\n4. Once you do you will get 150 rs legit via upi\n5. This is where the scam starts, in between the rating task they'll throw in a task to invest say 5k (a whole pyramid from 5k to 1L) for the day and get back 6k (a typical scam)\n7. They won't directly tell you to do that task but its expected and they'll say complete all tasks maximize earning\n8. And you will see messages like people getting paid back their money at the EOD which is ofcourse fake (they post payment screenshots from the same account)\n9. The moment you do pay, thats it. they stop responding, remove you from the group.\n\nI did not fall for the last step, just extrapolated based on my analysis. I got about ₹600 for free instead 😂. They stopped responding after that.\n\nFYI, of course I'm not a cyber crime employee",
        "Yeah I got this text a few months ago as well. I was able to get around Rs 500 before they kicked me out of the group!",
        "Good job. I tried it just to understand what the scam was, got the 150 and was too lazy to continue. Some screenshots of the teligram group will be helpful for others to understand how this scam works. They removed me from the group because I was inactive. Forgot to take screenshots 😕"
    ],
    "cleaned_text": "please careful scam update apparently careful enough first time fill blanks redacted part ",
    "cleaned_title": "please careful scam",
    "cleaned_selftext": "update apparently careful enough first time fill blanks redacted part",
    "cleaned_comments": "modus operandi fairly simple add telegram group announcements cant reply youll see assigning tasks like rating gmaps poc tell complete task give screenshot get rs legit via upi scam starts rating task theyll throw task invest say k whole pyramid k l day get back k typical scam wont directly tell task expected theyll say complete tasks maximize earning see messages like people getting paid back money eod ofcourse fake post payment screenshots account moment pay thats stop responding remove group fall last step extrapolated based analysis got free instead stopped responding fyi course im cyber crime employee yeah got text months ago well able get around rs kicked group good job tried understand scam got lazy continue screenshots teligram group helpful others understand scam works removed group inactive forgot take screenshots",
    "light_cleaned_title": "Please be careful of this scam!",
    "light_cleaned_selftext": "Update: Apparently I was not careful enough the first time, you can fill in the blanks for the redacted part",
    "light_cleaned_comments": "Their modus operandi is fairly simple. 1. Add you to a telegram group with announcements where you cant reply 2. There you'll see them assigning tasks (like rating in gmaps). 3. You will have a PoC who will tell you to complete task and give screenshot 4. Once you do you will get 150 rs legit via upi 5. This is where the scam starts, in between the rating task they'll throw in a task to invest say 5k (a whole pyramid from 5k to 1L) for the day and get back 6k (a typical scam) 7. They won't directly tell you to do that task but its expected and they'll say complete all tasks maximize earning 8. And you will see messages like people getting paid back their money at the EOD which is ofcourse fake (they post payment screenshots from the same account) 9. The moment you do pay, thats it. they stop responding, remove you from the group. I did not fall for the last step, just extrapolated based on my analysis. I got about ₹600 for free instead 😂. They stopped responding after that. FYI, of course I'm not a cyber crime employee Yeah I got this text a few months ago as well. I was able to get around Rs 500 before they kicked me out of the group! Good job. I tried it just to understand what the scam was, got the 150 and was too lazy to continue. Some screenshots of the teligram group will be helpful for others to understand how this scam works. They removed me from the group because I was inactive. Forgot to take screenshots 😕"
}