{
    "id": "1e3d8o1",
    "title": "Ajay's Unfortunate Day: Attacked and Left Alone",
    "url": "https://www.reddit.com/gallery/1e3d8o1",
    "selftext": "Meet Ajay. Yesterday, his life took a turn for the worse in Sadar Bazaar. Attacked by four men, Ajay was left battered and bruised. His injuries were so severe that he sought medical help, only to be discharged prematurely by the hospital.As if that wasn’t enough, when Ajay went to the police to file a complaint, they refused to even register it. Feeling abandoned and helpless, he tried reaching out to his brothers, but no one answered his calls.Ajay’s story is a stark reminder of the vulnerabilities faced by individuals when institutions and loved ones fail them. Let’s come together to support him and raise awareness about the need for better protection and care for victims like Ajay.What would you do if you were in his shoes?",
    "flair": "Crime",
    "score": 145,
    "num_comments": 9,
    "created_utc": 1720992199.0,
    "convurl": "https://i.redd.it/cna13jndxjcd1.png",
    "comments": [
        "Brah, ngl its 3 AM and I'm too down to call someone but I can reimburse 500 to his/your UPI if you share it here.",
        "Name of the police station he went to?",
        "Mereko dede 500",
        "If you're keen on donating, I saw him at 12:50 AM and he wasn't drunk then. So, if you still want to help out, maybe consider donating ₹200 for food and painkillers. (8474521172303@paytm). I'll share you proof in the morning.",
        "he will drink again , you buy food and give it to him",
        "Abe par why was he beaten?",
        "Why was he beaten? And why did the police refuse to file an FIR?",
        "A group of thugs jumped him, stole his money, and smashed his face with a brick. He tried to report it, but the cops couldn't care less. Seeing him bleeding, I jumped in, got him to the nearest hospital, and made sure he got some help."
    ],
    "cleaned_text": "ajays unfortunate day attacked left alone meet ajay yesterday life took turn worse sadar bazaar attacked four men ajay left battered bruised injuries severe sought medical help discharged prematurely hospitalas wasnt enough ajay went police file complaint refused even register feeling abandoned helpless tried reaching brothers one answered callsajays story stark reminder vulnerabilities faced individuals institutions loved ones fail lets come together support raise awareness need better protection care victims like ajaywhat would shoes ",
    "cleaned_title": "ajays unfortunate day attacked left alone",
    "cleaned_selftext": "meet ajay yesterday life took turn worse sadar bazaar attacked four men ajay left battered bruised injuries severe sought medical help discharged prematurely hospitalas wasnt enough ajay went police file complaint refused even register feeling abandoned helpless tried reaching brothers one answered callsajays story stark reminder vulnerabilities faced individuals institutions loved ones fail lets come together support raise awareness need better protection care victims like ajaywhat would shoes",
    "cleaned_comments": "brah ngl im call someone reimburse hisyour upi share name police station went mereko dede youre keen donating saw wasnt drunk still want help maybe consider donating food painkillers paytm ill share proof morning drink buy food give abe par beaten beaten police refuse file fir group thugs jumped stole money smashed face brick tried report cops couldnt care less seeing bleeding jumped got nearest hospital made sure got help",
    "light_cleaned_title": "Ajay's Unfortunate Day: Attacked and Left Alone",
    "light_cleaned_selftext": "Meet Ajay. Yesterday, his life took a turn for the worse in Sadar Bazaar. Attacked by four men, Ajay was left battered and bruised. His injuries were so severe that he sought medical help, only to be discharged prematurely by the hospital.As if that wasn’t enough, when Ajay went to the police to file a complaint, they refused to even register it. Feeling abandoned and helpless, he tried reaching out to his brothers, but no one answered his calls.Ajay’s story is a stark reminder of the vulnerabilities faced by individuals when institutions and loved ones fail them. Let’s come together to support him and raise awareness about the need for better protection and care for victims like Ajay.What would you do if you were in his shoes?",
    "light_cleaned_comments": "Brah, ngl its 3 AM and I'm too down to call someone but I can reimburse 500 to his/your UPI if you share it here. Name of the police station he went to? Mereko dede 500 If you're keen on donating, I saw him at 12:50 AM and he wasn't drunk then. So, if you still want to help out, maybe consider donating ₹200 for food and painkillers. (8474521172303@paytm). I'll share you proof in the morning. he will drink again , you buy food and give it to him Abe par why was he beaten? Why was he beaten? And why did the police refuse to file an FIR? A group of thugs jumped him, stole his money, and smashed his face with a brick. He tried to report it, but the cops couldn't care less. Seeing him bleeding, I jumped in, got him to the nearest hospital, and made sure he got some help."
}