{
    "id": "1462cdw",
    "title": "Update: Help. Missing person. Himachal.",
    "url": "https://www.reddit.com/gallery/1462cdw",
    "selftext": "1. Comments r not so reliable yet.\n2. I am adding facebook link in comment so please like it to be a prominent one.\n3. Comment more on post 'Cfmr' for better reach.\n\nAny help is appreciated.\nThank you in advance.",
    "flair": "AskIndia",
    "score": 833,
    "num_comments": 128,
    "created_utc": 1686408999.0,
    "convurl": "https://i.redd.it/39rb3unrf75b1.jpg",
    "comments": [
        "https://www.facebook.com/groups/htghimalayantravelgroup/permalink/3630283413873127/?sfnsn=wiwspwa&ref=share&mibextid=KtfwRi",
        "CFMR",
        "Was he travelling alone?",
        "Yes",
        "CFBR",
        "Cfbr, hope you find him as soon as possible and hope he's fine",
        "Cfmr, hope you guys find him soon and in good health.",
        "Cfbr may he be found at earliest...",
        "Cfbr",
        "cfmr",
        "Cfbr",
        "Hope you find him soon and without any harm to him 🙏",
        "CFMR",
        "CFBR",
        "Uncle I've seen this post before, what's the update from local authorities. Did he tell you the exact place he planned to visit before he left? Contact Himachal police and search and rescue.",
        "Cfbr",
        "They r still searching. He was suppose to check out that day later but he check out soon n was not spotted after that. Yes local authorities have been informed yt no sign🥺😭",
        "CFMR",
        "Cfbr",
        "Do you have the address of the place he was staying!? What about the CCTV cameras? People in Kullu Manali (some remote villages) believe that they are Alexander the great descendants so, they don't let anyone touch them, their houses etc, also they don't talk to outsiders that much, almost to the point where it'll feel like they are being rude. It's been more than 10 days, request the police to trace the last location of his phone you'll have to increase the pressure otherwise you know that they are slothful.",
        " Cfbr",
        "CFMR",
        "Bhai misinformation mat spread kar.\nThat village is called Manala and only 1 such village exists.\nMountains are pretty unforgiving especially in times of rain and so are the rivers.I hope they find him but now it's very unlikely too much time has gone by.\nOne should not travel alone in the mountains unless you have a lot of experience.",
        "Cfbr",
        "CFMR",
        "Well i actually read that as Manala, my bad, but isn't it a cluster of villages? Well thank you for correcting me.",
        "Cfmr",
        "No.\nManala is actually quite far away from Kasol.\nKasol doesn't really have any difficult or even moderate level trek the only thing is never go too close to the river especially at times of rain.\nIt's likely that he actually went for Kheerganga as it is a popular trek but that too is quite a distance from Kasol.\nKheerganga is a big enough trek to get lost but in the case of kasol i don't think any trek there is long enough for a person to get lost.\nAlthough Kasol is famous for recreational drugs it's never a good idea to try them alone..\nI don't want to be insensitive and say it but that's the most likely scenario.",
        "CFBR",
        "CFMR",
        "CFMR",
        "What is cmfr and cfbr?",
        "From point 3 in the context written by the op,\n\nFigured that:\n\ncomment for more reach(cfmr) \n\nOr comment for better reach(cfbr)",
        "Hwo do you know all that",
        "Oh, thanks :)",
        "Cfbr, everything is gonna be alright uncle. hope you find him as soon as possible and hope he's fine",
        "Try contacting yhai they conduct sarpass trek through ghrahan village as first campsite.",
        "No issues,it was a new term for me as well.",
        "Because i have been to himachal multiple times I'm from Uttrakhand we literally share a border with them.\nPS- also i got stuck once on Kheerganga trek due to landslides ,climbed that landslide which let me tell you is a bad idea at night, ultimately had to spend the night in the middle of jungle without any camp while it snowed.\nLuckily growing up surrounded by mountains did help in remaining calm and we survived.",
        "Cfmr",
        "Is it Malana?",
        "CFBR",
        "Yes sorry i misspelt it..lol",
        "Cfbr",
        "Cfmr",
        "Hey I'm from uttarakhand as well, once anyone says kasol, the first thing that comes to mind is Malana.\n\nMy friends who have been to Malana told me about that Alexander stuff.",
        "Mummy ab kasol nahi jaane dengi",
        "CFMR",
        "Cfbr",
        "I hope he is found. My prayers are with you uncle.",
        "Cfmr",
        "Cfbr",
        "Cfbr",
        "Cfmr",
        "While there are some sacred buildings you can't touch in Malana, you can absolutely talk with the locals, go to their houses, and even eat with them.",
        "Cfmr",
        "CFMR",
        "Cfbr",
        "Cfbr",
        "Cfmr",
        "what is wrong with you?",
        "cfbr",
        "Cfmr",
        "Cfbr",
        "I really hope he is found",
        "Cfmr",
        "CFMR \nI hope you find him",
        "Cmfr",
        "cfbr",
        "You can try to track his location via his device accounts. Please reply if he has left any electronics at home you can access, something that has his Google account logged in.",
        "CFBR",
        "Cfbr",
        "CFBR",
        "Cfmr",
        "Cfbr.",
        "Cfmr",
        "Cfbr",
        "Upvoted in an attempt to bring at top of sub reddit.",
        "Cfmr",
        "Cfmr",
        "I have been to Kasol, Grahan and nearby villages many times and I can assure you the locals are really helpful in finding missing people. Woh log apni jaan laga dete hai. So hopefully there will be some good news.",
        "Cfbr",
        "CFMR",
        "cfbr",
        "Can you provide his instagram or Facebook id? \nAnd ask about him to his followers or close friends?",
        "https://www.facebook[dot]com/groups/htghimalayantravelgroup/permalink/3630283413873127/?sfnsn=wiwspwa&ref=share&mibextid=KtfwRi\n\n\n\nChange [dot] and then u r good to go",
        "Cfbr",
        "Bump.",
        "Cfmr. Praying for his safe return",
        "CFMR, CFBR",
        "Cfmr",
        "Is he found yet?",
        "No. Not yet. Sadly😔",
        "cfbr",
        "Cfmr",
        "CFBR",
        "Cfmr",
        "Cfbr",
        "These people need to stop posting personal details like phone no. Or email.",
        "How r u suppose to spread the info n help forward.\nPlease enlighten me.",
        "Bro I am only saying this for your safety, don't post personal details on reddit.\n\nAs to what you could do instead is put no. Of your local police station in the post where you have registered the complaint",
        "CFMR",
        "Thanks fine. These no. N email is was this purpose.\n\nI am in no direct contact with the family. I am just helping in all the ways i can.if this no./ mail was posted in a fb group their must have been a reason for it",
        "CFMR I hope you find him as soon as possible.",
        "Cmfr",
        "CFBR",
        "cfmr",
        "Cfmr",
        "Cfmr",
        "Hi do u have insta gram I can share it on there if u give me a username either of u or ur son both works to hope u find him soon",
        "Cfbr",
        "Cfbr",
        "FYI folks, \nif you have info about the missing person, contact the police, not the \"family member\" posting the request. \n\nyou never know whats the real reason they are missing.",
        "Cfmr",
        "Hey...\nWell i dont have insta and i dont have his insta but probably 'Akshay Sethi' se aajana chahiye 1st account he hoga... its an open account ig",
        "I agree. This all additional help is being done by friends n family and they r doing their best to help find him.",
        "Good Point.",
        "First account is the actor j the others are some random people but I'll be sure to spread the word although most of my followers are from mumbai or Germany but I'll try uncle I know u are under distress but it's all going to be OK 👍",
        "Hey can we keep in touch better here's my number don't use reddit much 9892970933",
        "Hey I hv msged my freinds in the car and photography community and posted it on my story this may not help much but the slightest bit can help in some cases I hope u are feeling better",
        "I heard the \"third eye cafe\" he was living at, In grahan tried to burn his bag or something when he did not return...failed to inform the panchayat ... sad scenes, their excuse was \"they got scared\"...",
        "Cfbr",
        "Cfmr",
        "What is the update today?",
        "Still not found.\nI actively update in sub of Himachal and Chandigarh.\n The Times did an article on him. He is the 27th person to be lost there.",
        "CMFR",
        "Cfbr",
        "Cfmr",
        "Found him??",
        "No",
        "Please come back home Akshay. Please just be healthy and safe. I miss you.",
        "I am solo trekker, did most of my treks alone, but this breaks my heart, I hope people understand how necessary a fellow companion is specially if you are not experienced, I wish everyone who is planning to go for a trek consider talking someone along or atleast share live location with some friend, if not family member",
        "Found him???",
        "Sadly not yet😔",
        "any updates ?",
        "I put a new post",
        "Is he back?"
    ],
    "cleaned_text": "update help missing person himachal comments r reliable yet adding facebook link comment please like prominent one comment post cfmr better reach help appreciated thank advance ",
    "cleaned_title": "update help missing person himachal",
    "cleaned_selftext": "comments r reliable yet adding facebook link comment please like prominent one comment post cfmr better reach help appreciated thank advance",
    "cleaned_comments": "cfmr travelling alone yes cfbr cfbr hope find soon possible hope hes fine cfmr hope guys find soon good health cfbr may found earliest cfbr cfmr cfbr hope find soon without harm cfmr cfbr uncle ive seen post whats update local authorities tell exact place planned visit left contact himachal police search rescue cfbr r still searching suppose check day later check soon n spotted yes local authorities informed yt sign cfmr cfbr address place staying cctv cameras people kullu manali remote villages believe alexander great descendants dont let anyone touch houses etc also dont talk outsiders much almost point itll feel like rude days request police trace last location phone youll increase pressure otherwise know slothful cfbr cfmr bhai misinformation mat spread kar village called manala village exists mountains pretty unforgiving especially times rain riversi hope find unlikely much time gone one travel alone mountains unless lot experience cfbr cfmr well actually read manala bad isnt cluster villages well thank correcting cfmr manala actually quite far away kasol kasol doesnt really difficult even moderate level trek thing never go close river especially times rain likely actually went kheerganga popular trek quite distance kasol kheerganga big enough trek get lost case kasol dont think trek long enough person get lost although kasol famous recreational drugs never good idea try alone dont want insensitive say thats likely scenario cfbr cfmr cfmr cmfr cfbr point context written op figured comment reachcfmr comment better reachcfbr hwo know oh thanks cfbr everything gon na alright uncle hope find soon possible hope hes fine try contacting yhai conduct sarpass trek ghrahan village first campsite issuesit new term well himachal multiple times im uttrakhand literally share border ps also got stuck kheerganga trek due landslides climbed landslide let tell bad idea night ultimately spend night middle jungle without camp snowed luckily growing surrounded mountains help remaining calm survived cfmr malana cfbr yes sorry misspelt itlol cfbr cfmr hey im uttarakhand well anyone says kasol first thing comes mind malana friends malana told alexander stuff mummy ab kasol nahi jaane dengi cfmr cfbr hope found prayers uncle cfmr cfbr cfbr cfmr sacred buildings cant touch malana absolutely talk locals go houses even eat cfmr cfmr cfbr cfbr cfmr wrong cfbr cfmr cfbr really hope found cfmr cfmr hope find cmfr cfbr try track location via device accounts please reply left electronics home access something google account logged cfbr cfbr cfbr cfmr cfbr cfmr cfbr upvoted attempt bring top sub reddit cfmr cfmr kasol grahan nearby villages many times assure locals really helpful finding missing people woh log apni jaan laga dete hai hopefully good news cfbr cfmr cfbr provide instagram facebook id ask followers close friends change dot u r good go cfbr bump cfmr praying safe return cfmr cfbr cfmr found yet yet sadly cfbr cfmr cfbr cfmr cfbr people need stop posting personal details like phone email r u suppose spread info n help forward please enlighten bro saying safety dont post personal details reddit could instead put local police station post registered complaint cfmr thanks fine n email purpose direct contact family helping ways canif mail posted fb group must reason cfmr hope find soon possible cmfr cfbr cfmr cfmr cfmr hi u insta gram share u give username either u ur son works hope u find soon cfbr cfbr fyi folks info missing person contact police family member posting request never know whats real reason missing cfmr hey well dont insta dont insta probably akshay sethi se aajana chahiye st account hoga open account ig agree additional help done friends n family r best help find good point first account actor j others random people ill sure spread word although followers mumbai germany ill try uncle know u distress going ok hey keep touch better heres number dont use reddit much hey hv msged freinds car photography community posted story may help much slightest bit help cases hope u feeling better heard third eye cafe living grahan tried burn bag something returnfailed inform panchayat sad scenes excuse got scared cfbr cfmr update today still found actively update sub himachal chandigarh times article th person lost cmfr cfbr cfmr found please come back home akshay please healthy safe miss solo trekker treks alone breaks heart hope people understand necessary fellow companion specially experienced wish everyone planning go trek consider talking someone along atleast share live location friend family member found sadly yet updates put new post back",
    "light_cleaned_title": "Update: Help. Missing person. Himachal.",
    "light_cleaned_selftext": "1. Comments r not so reliable yet. 2. I am adding facebook link in comment so please like it to be a prominent one. 3. Comment more on post 'Cfmr' for better reach. Any help is appreciated. Thank you in advance.",
    "light_cleaned_comments": "CFMR Was he travelling alone? Yes CFBR Cfbr, hope you find him as soon as possible and hope he's fine Cfmr, hope you guys find him soon and in good health. Cfbr may he be found at earliest... Cfbr cfmr Cfbr Hope you find him soon and without any harm to him 🙏 CFMR CFBR Uncle I've seen this post before, what's the update from local authorities. Did he tell you the exact place he planned to visit before he left? Contact Himachal police and search and rescue. Cfbr They r still searching. He was suppose to check out that day later but he check out soon n was not spotted after that. Yes local authorities have been informed yt no sign🥺😭 CFMR Cfbr Do you have the address of the place he was staying!? What about the CCTV cameras? People in Kullu Manali (some remote villages) believe that they are Alexander the great descendants so, they don't let anyone touch them, their houses etc, also they don't talk to outsiders that much, almost to the point where it'll feel like they are being rude. It's been more than 10 days, request the police to trace the last location of his phone you'll have to increase the pressure otherwise you know that they are slothful. Cfbr CFMR Bhai misinformation mat spread kar. That village is called Manala and only 1 such village exists. Mountains are pretty unforgiving especially in times of rain and so are the rivers.I hope they find him but now it's very unlikely too much time has gone by. One should not travel alone in the mountains unless you have a lot of experience. Cfbr CFMR Well i actually read that as Manala, my bad, but isn't it a cluster of villages? Well thank you for correcting me. Cfmr No. Manala is actually quite far away from Kasol. Kasol doesn't really have any difficult or even moderate level trek the only thing is never go too close to the river especially at times of rain. It's likely that he actually went for Kheerganga as it is a popular trek but that too is quite a distance from Kasol. Kheerganga is a big enough trek to get lost but in the case of kasol i don't think any trek there is long enough for a person to get lost. Although Kasol is famous for recreational drugs it's never a good idea to try them alone.. I don't want to be insensitive and say it but that's the most likely scenario. CFBR CFMR CFMR What is cmfr and cfbr? From point 3 in the context written by the op, Figured that: comment for more reach(cfmr) Or comment for better reach(cfbr) Hwo do you know all that Oh, thanks :) Cfbr, everything is gonna be alright uncle. hope you find him as soon as possible and hope he's fine Try contacting yhai they conduct sarpass trek through ghrahan village as first campsite. No issues,it was a new term for me as well. Because i have been to himachal multiple times I'm from Uttrakhand we literally share a border with them. PS- also i got stuck once on Kheerganga trek due to landslides ,climbed that landslide which let me tell you is a bad idea at night, ultimately had to spend the night in the middle of jungle without any camp while it snowed. Luckily growing up surrounded by mountains did help in remaining calm and we survived. Cfmr Is it Malana? CFBR Yes sorry i misspelt it..lol Cfbr Cfmr Hey I'm from uttarakhand as well, once anyone says kasol, the first thing that comes to mind is Malana. My friends who have been to Malana told me about that Alexander stuff. Mummy ab kasol nahi jaane dengi CFMR Cfbr I hope he is found. My prayers are with you uncle. Cfmr Cfbr Cfbr Cfmr While there are some sacred buildings you can't touch in Malana, you can absolutely talk with the locals, go to their houses, and even eat with them. Cfmr CFMR Cfbr Cfbr Cfmr what is wrong with you? cfbr Cfmr Cfbr I really hope he is found Cfmr CFMR I hope you find him Cmfr cfbr You can try to track his location via his device accounts. Please reply if he has left any electronics at home you can access, something that has his Google account logged in. CFBR Cfbr CFBR Cfmr Cfbr. Cfmr Cfbr Upvoted in an attempt to bring at top of sub reddit. Cfmr Cfmr I have been to Kasol, Grahan and nearby villages many times and I can assure you the locals are really helpful in finding missing people. Woh log apni jaan laga dete hai. So hopefully there will be some good news. Cfbr CFMR cfbr Can you provide his instagram or Facebook id? And ask about him to his followers or close friends? Change [dot] and then u r good to go Cfbr Bump. Cfmr. Praying for his safe return CFMR, CFBR Cfmr Is he found yet? No. Not yet. Sadly😔 cfbr Cfmr CFBR Cfmr Cfbr These people need to stop posting personal details like phone no. Or email. How r u suppose to spread the info n help forward. Please enlighten me. Bro I am only saying this for your safety, don't post personal details on reddit. As to what you could do instead is put no. Of your local police station in the post where you have registered the complaint CFMR Thanks fine. These no. N email is was this purpose. I am in no direct contact with the family. I am just helping in all the ways i can.if this no./ mail was posted in a fb group their must have been a reason for it CFMR I hope you find him as soon as possible. Cmfr CFBR cfmr Cfmr Cfmr Hi do u have insta gram I can share it on there if u give me a username either of u or ur son both works to hope u find him soon Cfbr Cfbr FYI folks, if you have info about the missing person, contact the police, not the \"family member\" posting the request. you never know whats the real reason they are missing. Cfmr Hey... Well i dont have insta and i dont have his insta but probably 'Akshay Sethi' se aajana chahiye 1st account he hoga... its an open account ig I agree. This all additional help is being done by friends n family and they r doing their best to help find him. Good Point. First account is the actor j the others are some random people but I'll be sure to spread the word although most of my followers are from mumbai or Germany but I'll try uncle I know u are under distress but it's all going to be OK 👍 Hey can we keep in touch better here's my number don't use reddit much 9892970933 Hey I hv msged my freinds in the car and photography community and posted it on my story this may not help much but the slightest bit can help in some cases I hope u are feeling better I heard the \"third eye cafe\" he was living at, In grahan tried to burn his bag or something when he did not return...failed to inform the panchayat ... sad scenes, their excuse was \"they got scared\"... Cfbr Cfmr What is the update today? Still not found. I actively update in sub of Himachal and Chandigarh. The Times did an article on him. He is the 27th person to be lost there. CMFR Cfbr Cfmr Found him?? No Please come back home Akshay. Please just be healthy and safe. I miss you. I am solo trekker, did most of my treks alone, but this breaks my heart, I hope people understand how necessary a fellow companion is specially if you are not experienced, I wish everyone who is planning to go for a trek consider talking someone along or atleast share live location with some friend, if not family member Found him??? Sadly not yet😔 any updates ? I put a new post Is he back?"
}