{
    "id": "13x4ji5",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/13x4ji5/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=79f0d698e4abf87f45628ddd3057be3fe4b83435",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 11,
    "created_utc": 1685583012.0,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Hello, M 20 in urgent need of work (preferably\ncontent writing)\n\nMy skills include effective communication, good proficiency in English, ability to co-operate with others and meet strict deadlines on time. I am a keen learner and constantly strive to improve myself and the way I can contribute to a project. I am a good writer and have worked on a lot of press releases and similar marketing work which has generated many sales in the past. What seperates my work from others is keen attention to detail and formatting so the viewer is drawn into learn more about a product or service.\n\nI am currently a third year student and pursuing BA (hons) I am graduating this year and am ready to work fulltime/part-time (preferably work from home) at a moment's notice if we can agree on a figure.\n\nSample of my past gigs -\n\nhttps://drive.google.com/file/d/15MVk8wlUtVUXay1PhGevXMyv_AibZ_sc/view?usp=drivesdk\n\nI am located in Greater Noida so I prefer somewhere close however I am ready to work anywhere in NCR (if the job requires me to be in office)\n\n\nYou can contact me on reddit through a pm and further communication can be done through email.",
        "Hello, looking to hear suggestions & get some guidance.   \n\n\n29F, Sr. General Dentist, with 3 years of work experience as a medical data & quality analyst. Picked up a non-clinical role pre-pandemic and was forced to continue due to the fear around dental consultation and the spread of Covid-19.   \nHowever, I quit my non-clinical role six-month ago to resume Dentistry but  I'm unhappy with the pay and working environment. Hence, looking to move back to non-clinical medical jobs.\n\nExperience: 3 years  \nSkills:  Analyzing and Interpreting complex healthcare data   \nLocation: Mumbai/Navi Mumbai or Remote  \nPreferred way of contacting: Email ID/ phone no: once PMed",
        "\"relating to content writing\", \"lot press releases\" (preposition of?). If you are saying you are proficient in english, at the least bother to proof-read what you post!",
        "Lot of was just a typo what's wrong with \"relating to\"?",
        "Ask just use grammarly lol. Humans end of the day.",
        "hey, you need to make the drive link open to all. currently, i need to ask for access",
        "this might help? \n\nhttps://preview.redd.it/kp87z89ppj3b1.png?width=755&format=png&auto=webp&v=enabled&s=47b814ea66f63c63f8132ac6da1107fff078e409",
        "Just a typo : And call yourself a professional? Wow!",
        "Thanks",
        "https://drive.google.com/file/d/15MVk8wlUtVUXay1PhGevXMyv_AibZ_sc/view?usp=drivesdk"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "hello urgent need work preferably content writing skills include effective communication good proficiency english ability cooperate others meet strict deadlines time keen learner constantly strive improve way contribute project good writer worked lot press releases similar marketing work generated many sales past seperates work others keen attention detail formatting viewer drawn learn product service currently third year student pursuing ba hons graduating year ready work fulltimeparttime preferably work home moments notice agree figure sample past gigs located greater noida prefer somewhere close however ready work anywhere ncr job requires office contact reddit pm communication done email hello looking hear suggestions get guidance f sr general dentist years work experience medical data quality analyst picked nonclinical role prepandemic forced continue due fear around dental consultation spread covid however quit nonclinical role sixmonth ago resume dentistry im unhappy pay working environment hence looking move back nonclinical medical jobs experience years skills analyzing interpreting complex healthcare data location mumbainavi mumbai remote preferred way contacting email id phone pmed relating content writing lot press releases preposition saying proficient english least bother proofread post lot typo whats wrong relating ask use grammarly lol humans end day hey need make drive link open currently need ask access might help typo call professional wow thanks",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Hello, M 20 in urgent need of work (preferably content writing) My skills include effective communication, good proficiency in English, ability to co-operate with others and meet strict deadlines on time. I am a keen learner and constantly strive to improve myself and the way I can contribute to a project. I am a good writer and have worked on a lot of press releases and similar marketing work which has generated many sales in the past. What seperates my work from others is keen attention to detail and formatting so the viewer is drawn into learn more about a product or service. I am currently a third year student and pursuing BA (hons) I am graduating this year and am ready to work fulltime/part-time (preferably work from home) at a moment's notice if we can agree on a figure. Sample of my past gigs - I am located in Greater Noida so I prefer somewhere close however I am ready to work anywhere in NCR (if the job requires me to be in office) You can contact me on reddit through a pm and further communication can be done through email. Hello, looking to hear suggestions & get some guidance. 29F, Sr. General Dentist, with 3 years of work experience as a medical data & quality analyst. Picked up a non-clinical role pre-pandemic and was forced to continue due to the fear around dental consultation and the spread of Covid-19. However, I quit my non-clinical role six-month ago to resume Dentistry but I'm unhappy with the pay and working environment. Hence, looking to move back to non-clinical medical jobs. Experience: 3 years Skills: Analyzing and Interpreting complex healthcare data Location: Mumbai/Navi Mumbai or Remote Preferred way of contacting: Email ID/ phone no: once PMed \"relating to content writing\", \"lot press releases\" (preposition of?). If you are saying you are proficient in english, at the least bother to proof-read what you post! Lot of was just a typo what's wrong with \"relating to\"? Ask just use grammarly lol. Humans end of the day. hey, you need to make the drive link open to all. currently, i need to ask for access this might help? Just a typo : And call yourself a professional? Wow! Thanks"
}