{
    "id": "1fay10o",
    "title": "This madness for Reel needs to stop",
    "url": "https://i.redd.it/tp66gqri6bnd1.jpeg",
    "selftext": "Because people are seeing Reel making as a source of income they will do everything possible to gain the views . So called influencer flaunting how many lakhs they are earning is causing more and more population to make viral reel",
    "flair": "Rant / Vent",
    "score": 146,
    "num_comments": 33,
    "created_utc": 1725680636,
    "convurl": "https://i.redd.it/tp66gqri6bnd1.jpeg",
    "comments": [
        "If people hurt only themselves with stupidity I am ok. It's not great but so long as this stupidity only affects them, it's ok.\n\nAs long as others are not hurt or inconvenienced do as you will. Eat cobras or the space shuttle. \n\nProblem with reels is that most time people make these ignoring the convenience of others.",
        "the things people do to get fame....smh",
        "Fuck around and Find out. Darwin would be proud",
        "Darwin FTW",
        "r/darwinism",
        "0% sympathy for him ..",
        "Exactly, personal privacy have gone to vain in office , gym or even in temples . Wherever I see people are holding their mobile . We are creating content exponentially and uploading on internet all the garbage",
        "Natural selection in action!",
        "Reels are a boon for selection. These stupid genes end here and evolution continues. Long live reels",
        "I don’t mind to be honest. It’s the natural cleansing process of mother earth. Stupid people die while others survive.",
        "r/winstupidprizes",
        "No it doesn’t, let natural selection do it’s job.",
        "Sahi hua ab views hi views hai",
        "I see it as natural selection.",
        "I feel sympathy for the snake!",
        "Darwins Award Goes To...\n\nOr We Can Say Nature's Selection",
        "Agree to a large part with you but i can easily see this becoming another blue whale.",
        "Darwinism",
        "Bro thinks he is from Bihar",
        "Bro deserve Darwin Ratna",
        "Neo-Darwinism",
        "He himself knocked the door of yamaraj !",
        "hope the cobra didnt get injured",
        "Great father!",
        "My mother saw this news on TV and said\"instead of all these madness why not do some work (agricultural/any shop work)and Earn some money?\"",
        "Natural selection. Nature cleansing the gene pool",
        "Satisfaction 📈",
        "In this case I doubt it only affected him - the people who were with him who had to witness his death, rush him to hospital, the workers there who had to deal with this emergency instead of helping other victims; it's all a cascade of unnecessary misery. Besides - it seems like this wasn't even his idea but his fathers.",
        "Came to say this. My reaction initially used to be the same as op but now after seeing hundreds of such news... Let the stupid die!",
        "Play stupid games, win stupid prizes ☺",
        "Laughed my ass off",
        "One less idiot to worry about I’d say. Darwinism on display"
    ],
    "cleaned_text": "madness reel needs stop people seeing reel making source income everything possible gain views called influencer flaunting many lakhs earning causing population make viral reel ",
    "cleaned_title": "madness reel needs stop",
    "cleaned_selftext": "people seeing reel making source income everything possible gain views called influencer flaunting many lakhs earning causing population make viral reel",
    "cleaned_comments": "people hurt stupidity ok great long stupidity affects ok long others hurt inconvenienced eat cobras space shuttle problem reels time people make ignoring convenience others things people get famesmh fuck around find darwin would proud darwin ftw rdarwinism sympathy exactly personal privacy gone vain office gym even temples wherever see people holding mobile creating content exponentially uploading internet garbage natural selection action reels boon selection stupid genes end evolution continues long live reels dont mind honest natural cleansing process mother earth stupid people die others survive rwinstupidprizes doesnt let natural selection job sahi hua ab views hi views hai see natural selection feel sympathy snake darwins award goes say natures selection agree large part easily see becoming another blue whale darwinism bro thinks bihar bro deserve darwin ratna neodarwinism knocked door yamaraj hope cobra didnt get injured great father mother saw news tv saidinstead madness work agriculturalany shop workand earn money natural selection nature cleansing gene pool satisfaction case doubt affected people witness death rush hospital workers deal emergency instead helping victims cascade unnecessary misery besides seems like wasnt even idea fathers came say reaction initially used op seeing hundreds news let stupid die play stupid games win stupid prizes laughed ass one less idiot worry id say darwinism display",
    "light_cleaned_title": "This madness for Reel needs to stop",
    "light_cleaned_selftext": "Because people are seeing Reel making as a source of income they will do everything possible to gain the views . So called influencer flaunting how many lakhs they are earning is causing more and more population to make viral reel",
    "light_cleaned_comments": "If people hurt only themselves with stupidity I am ok. It's not great but so long as this stupidity only affects them, it's ok. As long as others are not hurt or inconvenienced do as you will. Eat cobras or the space shuttle. Problem with reels is that most time people make these ignoring the convenience of others. the things people do to get fame....smh Fuck around and Find out. Darwin would be proud Darwin FTW r/darwinism 0% sympathy for him .. Exactly, personal privacy have gone to vain in office , gym or even in temples . Wherever I see people are holding their mobile . We are creating content exponentially and uploading on internet all the garbage Natural selection in action! Reels are a boon for selection. These stupid genes end here and evolution continues. Long live reels I don’t mind to be honest. It’s the natural cleansing process of mother earth. Stupid people die while others survive. r/winstupidprizes No it doesn’t, let natural selection do it’s job. Sahi hua ab views hi views hai I see it as natural selection. I feel sympathy for the snake! Darwins Award Goes To... Or We Can Say Nature's Selection Agree to a large part with you but i can easily see this becoming another blue whale. Darwinism Bro thinks he is from Bihar Bro deserve Darwin Ratna Neo-Darwinism He himself knocked the door of yamaraj ! hope the cobra didnt get injured Great father! My mother saw this news on TV and said\"instead of all these madness why not do some work (agricultural/any shop work)and Earn some money?\" Natural selection. Nature cleansing the gene pool Satisfaction 📈 In this case I doubt it only affected him - the people who were with him who had to witness his death, rush him to hospital, the workers there who had to deal with this emergency instead of helping other victims; it's all a cascade of unnecessary misery. Besides - it seems like this wasn't even his idea but his fathers. Came to say this. My reaction initially used to be the same as op but now after seeing hundreds of such news... Let the stupid die! Play stupid games, win stupid prizes ☺ Laughed my ass off One less idiot to worry about I’d say. Darwinism on display"
}