{
    "id": "1dzutzh",
    "title": "1994 ISRO spy case: Ex-Kerala DGP Siby Mathews arrested Nambi Narayanan without proof, reveals CBI chargesheet",
    "url": "https://newsable.asianetnews.com/india/1994-isro-spy-case-ex-kerala-dgp-siby-mathews-arrested-nambi-narayanan-without-proof-reveals-cbi-chargesheet-anr-sgeow4",
    "selftext": "Thiruvananthapuram: In the 1994 ISRO espionage case, the Central Bureau of Investigation (CBI) chargesheet stated that former C.I. S Vijayan fabricated the spy case and filed a case against Mariyam Rasheeda, a Maldivian native, without substantial evidence. A case was registered against her at Vanchiyoor police station without proof.   \n\nThe CBI had filed a chargesheet against two former DGPs, Siby Mathews of Kerala and R. B. Sreekumar of Gujarat, and three other retired police officials in connection with the alleged framing of space scientist Nambi Narayanan in the 1994 ISRO espionage case.\n\nThe CBI chargesheet says, \" The facts and circumstances emerged during the investigation of CBI has revealed that this is a clear case of abuse of law/authority right from the initial stage as victim Mariyam Rasheeda was detained illegally and framed with the false overstaying case. To sustain the initial wrongs, another case of serious nature was launched with false interrogation reports against victims.\"\n\nThe chargesheet further mentions, \" The facts and circumstances substantiate role of accused  S Vijayan, Siby Mathews, KK Joshua, RB Sreekumar and PS Jayaprakash in the registration of the false cases under the Foreigners Act and Official Secrets Act against two Maldivian ladies Mariyam Rasheeda and Fauzia Hasan, two ISRO scientists D Sashikumaran and Nambi Narayanan and two other persons K Chandrasekhar and SK Sharma (both deceased). The said accused persons played an active role in conspiracy to create false documents, leading to illegal arrests, torture etc.\"\n\nAccording to the chargesheet, CI Vijayan came to the hotel room where Mariyam Rasheeda was staying and made sexual advances towards her. However, she spurned the sexual advances of Vijayan and he left the room immediately. This provoked him and he found that Rasheeda was in contact with scientist D Sashikumaran, working in the Liquid Propulsion Systems Centre (LPSC) at ISRO. \n\nIn October 1994, the Kerala Police registered two cases following the arrest of Maldivian national Rasheeda in Thiruvananthapuram for allegedly obtaining secret drawings of ISRO rocket engines to sell to Pakistan. Nambi Narayanan, then director of ISRO's cryogenic project, was arrested along with ISRO deputy director D. Sasikumaran and Fousiya Hasan, a Maldivian friend of Rasheeda.  \n\n\n\n",
    "flair": "Crime",
    "score": 21,
    "num_comments": 0,
    "created_utc": 1720615400.0,
    "convurl": "https://external-preview.redd.it/wz5Xl6A96DTBe0VqNYGL1dWwkCmfRdfop8p0-y1mKwE.jpg?auto=webp&s=2045fbd4289de6b1edf56961e70cb707360f6f8b",
    "comments": [],
    "cleaned_text": "isro spy case exkerala dgp siby mathews arrested nambi narayanan without proof reveals cbi chargesheet thiruvananthapuram isro espionage case central bureau investigation cbi chargesheet stated former ci vijayan fabricated spy case filed case mariyam rasheeda maldivian native without substantial evidence case registered vanchiyoor police station without proof cbi filed chargesheet two former dgps siby mathews kerala r b sreekumar gujarat three retired police officials connection alleged framing space scientist nambi narayanan isro espionage case cbi chargesheet says facts circumstances emerged investigation cbi revealed clear case abuse lawauthority right initial stage victim mariyam rasheeda detained illegally framed false overstaying case sustain initial wrongs another case serious nature launched false interrogation reports victims chargesheet mentions facts circumstances substantiate role accused vijayan siby mathews kk joshua rb sreekumar ps jayaprakash registration false cases foreigners act official secrets act two maldivian ladies mariyam rasheeda fauzia hasan two isro scientists sashikumaran nambi narayanan two persons k chandrasekhar sk sharma deceased said accused persons played active role conspiracy create false documents leading illegal arrests torture etc according chargesheet ci vijayan came hotel room mariyam rasheeda staying made sexual advances towards however spurned sexual advances vijayan left room immediately provoked found rasheeda contact scientist sashikumaran working liquid propulsion systems centre lpsc isro october kerala police registered two cases following arrest maldivian national rasheeda thiruvananthapuram allegedly obtaining secret drawings isro rocket engines sell pakistan nambi narayanan director isros cryogenic project arrested along isro deputy director sasikumaran fousiya hasan maldivian friend rasheeda ",
    "cleaned_title": "isro spy case exkerala dgp siby mathews arrested nambi narayanan without proof reveals cbi chargesheet",
    "cleaned_selftext": "thiruvananthapuram isro espionage case central bureau investigation cbi chargesheet stated former ci vijayan fabricated spy case filed case mariyam rasheeda maldivian native without substantial evidence case registered vanchiyoor police station without proof cbi filed chargesheet two former dgps siby mathews kerala r b sreekumar gujarat three retired police officials connection alleged framing space scientist nambi narayanan isro espionage case cbi chargesheet says facts circumstances emerged investigation cbi revealed clear case abuse lawauthority right initial stage victim mariyam rasheeda detained illegally framed false overstaying case sustain initial wrongs another case serious nature launched false interrogation reports victims chargesheet mentions facts circumstances substantiate role accused vijayan siby mathews kk joshua rb sreekumar ps jayaprakash registration false cases foreigners act official secrets act two maldivian ladies mariyam rasheeda fauzia hasan two isro scientists sashikumaran nambi narayanan two persons k chandrasekhar sk sharma deceased said accused persons played active role conspiracy create false documents leading illegal arrests torture etc according chargesheet ci vijayan came hotel room mariyam rasheeda staying made sexual advances towards however spurned sexual advances vijayan left room immediately provoked found rasheeda contact scientist sashikumaran working liquid propulsion systems centre lpsc isro october kerala police registered two cases following arrest maldivian national rasheeda thiruvananthapuram allegedly obtaining secret drawings isro rocket engines sell pakistan nambi narayanan director isros cryogenic project arrested along isro deputy director sasikumaran fousiya hasan maldivian friend rasheeda",
    "cleaned_comments": "",
    "light_cleaned_title": "1994 ISRO spy case: Ex-Kerala DGP Siby Mathews arrested Nambi Narayanan without proof, reveals CBI chargesheet",
    "light_cleaned_selftext": "Thiruvananthapuram: In the 1994 ISRO espionage case, the Central Bureau of Investigation (CBI) chargesheet stated that former C.I. S Vijayan fabricated the spy case and filed a case against Mariyam Rasheeda, a Maldivian native, without substantial evidence. A case was registered against her at Vanchiyoor police station without proof. The CBI had filed a chargesheet against two former DGPs, Siby Mathews of Kerala and R. B. Sreekumar of Gujarat, and three other retired police officials in connection with the alleged framing of space scientist Nambi Narayanan in the 1994 ISRO espionage case. The CBI chargesheet says, \" The facts and circumstances emerged during the investigation of CBI has revealed that this is a clear case of abuse of law/authority right from the initial stage as victim Mariyam Rasheeda was detained illegally and framed with the false overstaying case. To sustain the initial wrongs, another case of serious nature was launched with false interrogation reports against victims.\" The chargesheet further mentions, \" The facts and circumstances substantiate role of accused S Vijayan, Siby Mathews, KK Joshua, RB Sreekumar and PS Jayaprakash in the registration of the false cases under the Foreigners Act and Official Secrets Act against two Maldivian ladies Mariyam Rasheeda and Fauzia Hasan, two ISRO scientists D Sashikumaran and Nambi Narayanan and two other persons K Chandrasekhar and SK Sharma (both deceased). The said accused persons played an active role in conspiracy to create false documents, leading to illegal arrests, torture etc.\" According to the chargesheet, CI Vijayan came to the hotel room where Mariyam Rasheeda was staying and made sexual advances towards her. However, she spurned the sexual advances of Vijayan and he left the room immediately. This provoked him and he found that Rasheeda was in contact with scientist D Sashikumaran, working in the Liquid Propulsion Systems Centre (LPSC) at ISRO. In October 1994, the Kerala Police registered two cases following the arrest of Maldivian national Rasheeda in Thiruvananthapuram for allegedly obtaining secret drawings of ISRO rocket engines to sell to Pakistan. Nambi Narayanan, then director of ISRO's cryogenic project, was arrested along with ISRO deputy director D. Sasikumaran and Fousiya Hasan, a Maldivian friend of Rasheeda.",
    "light_cleaned_comments": ""
}