{
    "id": "120f09q",
    "title": "Wtf is airtel's problem? Keeps saying recharge failed..",
    "url": "https://i.redd.it/pgyquzoo5ppa1.jpg",
    "selftext": "This happens with every fucking recharge.\n\nIt goes through fine and yet they keep saying it failed. For fucking what. \n\nThis billion dollars company can't track recharges? \n\nThis rc was done last week and again got this message. \n\nDoes it happen with other carriers?",
    "flair": "Rant / Vent",
    "score": 0,
    "num_comments": 2,
    "created_utc": 1679649958,
    "convurl": "https://i.redd.it/pgyquzoo5ppa1.jpg",
    "comments": [
        "You get this msg when you try to recharge via the airtel app but end up recharging from a different app such as paytm, etc.",
        "I recharged using gpay and it was successfully right away every time. \n\nThey should not be doing this right I'm sure there are people getting confused and doing it a second time",
        "After a year still the airtel app sucks. It took money and recharging. Shame on Airtel"
    ],
    "cleaned_text": "wtf airtels problem keeps saying recharge failed happens every fucking recharge goes fine yet keep saying failed fucking billion dollars company cant track recharges rc done last week got message happen carriers ",
    "cleaned_title": "wtf airtels problem keeps saying recharge failed",
    "cleaned_selftext": "happens every fucking recharge goes fine yet keep saying failed fucking billion dollars company cant track recharges rc done last week got message happen carriers",
    "cleaned_comments": "get msg try recharge via airtel app end recharging different app paytm etc recharged using gpay successfully right away every time right im sure people getting confused second time year still airtel app sucks took money recharging shame airtel",
    "light_cleaned_title": "Wtf is airtel's problem? Keeps saying recharge failed..",
    "light_cleaned_selftext": "This happens with every fucking recharge. It goes through fine and yet they keep saying it failed. For fucking what. This billion dollars company can't track recharges? This rc was done last week and again got this message. Does it happen with other carriers?",
    "light_cleaned_comments": "You get this msg when you try to recharge via the airtel app but end up recharging from a different app such as paytm, etc. I recharged using gpay and it was successfully right away every time. They should not be doing this right I'm sure there are people getting confused and doing it a second time After a year still the airtel app sucks. It took money and recharging. Shame on Airtel"
}