{
    "id": "14fc0ov",
    "title": "[Legit] [Paid] Website Testing for Indians",
    "url": "https://www.reddit.com/r/india/comments/14fc0ov/legit_paid_website_testing_for_indians/",
    "selftext": "Hello, the educational company, NeoCananda, based in Canada, is performing a PAID ONLINE TEST with Indians living in India to get insights for its website. \n\nThe test will be performed through a 30-minute video meeting on Zoom, and the company is paying 1,000.00 INR for each participant.\n\nIf you are interested in being one of the testers, the first step is to respond to a screening questionnaire and confirm your fit to participate. \n\nHere is the link: [https://zfrmz.com/VqHXhAZea94A9YFux46U](https://zfrmz.com/VqHXhAZea94A9YFux46U)\n\nGood luck",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687364127.0,
    "convurl": "https://external-preview.redd.it/MCBoHwxYWL2emgFo9OXn_6JOGnvGAdVfk0pe7ImG_uY.jpg?auto=webp&v=enabled&s=41e6863dbe620de59d36a95ff969231674c38f42",
    "comments": [],
    "cleaned_text": "legit paid website testing indians hello educational company neocananda based canada performing paid online test indians living india get insights website test performed minute video meeting zoom company paying inr participant interested one testers first step respond screening questionnaire confirm fit participate link httpszfrmzcomvqhxhazeaayfuxuhttpszfrmzcomvqhxhazeaayfuxu good luck ",
    "cleaned_title": "legit paid website testing indians",
    "cleaned_selftext": "hello educational company neocananda based canada performing paid online test indians living india get insights website test performed minute video meeting zoom company paying inr participant interested one testers first step respond screening questionnaire confirm fit participate link httpszfrmzcomvqhxhazeaayfuxuhttpszfrmzcomvqhxhazeaayfuxu good luck",
    "cleaned_comments": "",
    "light_cleaned_title": "[Legit] [Paid] Website Testing for Indians",
    "light_cleaned_selftext": "Hello, the educational company, NeoCananda, based in Canada, is performing a PAID ONLINE TEST with Indians living in India to get insights for its website. The test will be performed through a 30-minute video meeting on Zoom, and the company is paying 1,000.00 INR for each participant. If you are interested in being one of the testers, the first step is to respond to a screening questionnaire and confirm your fit to participate. Here is the link: [https://zfrmz.com/VqHXhAZea94A9YFux46U](https://zfrmz.com/VqHXhAZea94A9YFux46U) Good luck",
    "light_cleaned_comments": ""
}