{
    "id": "13aqmuq",
    "title": "How can I avoid Customs/Reduce",
    "url": "https://www.reddit.com/r/india/comments/13aqmuq/how_can_i_avoid_customsreduce/",
    "selftext": "I'm planning to buy Hacksmith's Mini Lightsaber([https://hacksmith.store/en-in/products/pre-order-mini-saber-gen-2?variant=43797932015831](https://hacksmith.store/en-in/products/pre-order-mini-saber-gen-2?variant=43797932015831)) which costs around 7000INR, With Duties and Taxes it estimates around 110 usd which is 9000INR. Of course I do not wish to pay 9000 extra rupees so, is there a way to possibly reduce tax or perhaps completely avoid.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1683470381.0,
    "convurl": "https://external-preview.redd.it/ctKEoM5PG_UoiYnD-_HMCjNbrko5e4nJDYN5i5HSiU4.jpg?auto=webp&v=enabled&s=090b02468c49d62e0e3bedabee7202425783d14a",
    "comments": [
        "If you know somebody ask them to get it in their baggage if possible. Free allowance of upto 50,000",
        "Unfortunately no",
        "Do you *know a guy who knows a guy who knows another guy*?",
        "this line seems awfully familiar?",
        "There’s some websites which help you get stuff from other countries (more from US, UK, Canada, Australia), by adding the item into a traveller’s luggage. Maybe try that?\nPS: I’ve never tried it, just seen some sites.\n\nAlso, I’d say wait until any friend of your’s is coming to India and ask them to get it.",
        "i’ve never heard of sites like this, can you link some of those sites you’ve come across"
    ],
    "cleaned_text": "avoid customsreduce im planning buy hacksmiths mini lightsaberhttpshacksmithstoreeninproductspreorderminisabergenvarianthttpshacksmithstoreeninproductspreorderminisabergenvariant costs around inr duties taxes estimates around usd inr course wish pay extra rupees way possibly reduce tax perhaps completely avoid ",
    "cleaned_title": "avoid customsreduce",
    "cleaned_selftext": "im planning buy hacksmiths mini lightsaberhttpshacksmithstoreeninproductspreorderminisabergenvarianthttpshacksmithstoreeninproductspreorderminisabergenvariant costs around inr duties taxes estimates around usd inr course wish pay extra rupees way possibly reduce tax perhaps completely avoid",
    "cleaned_comments": "know somebody ask get baggage possible free allowance upto unfortunately know guy knows guy knows another guy line seems awfully familiar theres websites help get stuff countries us uk canada australia adding item travellers luggage maybe try ps ive never tried seen sites also id say wait friend coming india ask get ive never heard sites like link sites youve come across",
    "light_cleaned_title": "How can I avoid Customs/Reduce",
    "light_cleaned_selftext": "I'm planning to buy Hacksmith's Mini Lightsaber([https://hacksmith.store/en-in/products/pre-order-mini-saber-gen-2?variant=43797932015831](https://hacksmith.store/en-in/products/pre-order-mini-saber-gen-2?variant=43797932015831)) which costs around 7000INR, With Duties and Taxes it estimates around 110 usd which is 9000INR. Of course I do not wish to pay 9000 extra rupees so, is there a way to possibly reduce tax or perhaps completely avoid.",
    "light_cleaned_comments": "If you know somebody ask them to get it in their baggage if possible. Free allowance of upto 50,000 Unfortunately no Do you *know a guy who knows a guy who knows another guy*? this line seems awfully familiar? There’s some websites which help you get stuff from other countries (more from US, UK, Canada, Australia), by adding the item into a traveller’s luggage. Maybe try that? PS: I’ve never tried it, just seen some sites. Also, I’d say wait until any friend of your’s is coming to India and ask them to get it. i’ve never heard of sites like this, can you link some of those sites you’ve come across"
}