{
    "id": "14hgn9a",
    "title": "Kharge-Kejriwal tension casts a shadow on Oppn meet as AAP ups ante over ordinance",
    "url": "https://indianexpress.com/article/political-pulse/kharge-kejriwal-tension-casts-a-shadow-on-oppn-meet-as-aap-ups-ante-over-ordinance-8682981/",
    "selftext": "Kharge said AAP could not make Cong support over Delhi ordinance a precondition to join an alliance to fight BJP; Kejriwal skipped Opp leaders' joint press conference",
    "flair": "Politics",
    "score": 17,
    "num_comments": 9,
    "created_utc": 1687572727.0,
    "convurl": "https://external-preview.redd.it/fWb0MBT_gGz82fJ6BQGH0HWlNevNg33A-gOqbXhR9vM.jpg?auto=webp&v=enabled&s=3b2be9d84f31df6eeaa6739d7843b4580a9b3e73",
    "comments": [
        ">In the course of the meeting, the AAP leaders were said to have raked up the Congress’s non-committal stance on the Delhi ordinance so far.\n\n>Kharge, it is learnt, then conveyed his strong displeasure to Kejriwal over an AAP spokesperson’s charge in Delhi – which apparently came even as the meeting was underway in Patna – that there was allegedly an agreement between the BJP and the Congress on the ordinance and that the latter would walk out when the Bill will be put to vote in the Rajya Sabha in Parliament’s upcoming session.\n\n>This led to an exchange of words between Kharge and Kejriwal, prompting West Bengal CM and TMC chief Mamata Banerjee to intervene and play the role of a referee. Sources said she told Kejriwal that he should calm down since the Congress has made it clear that it will take a stand on the issue before the commencement of the Parliament session. Most of the leaders sided with the Congress suggesting that let the party go through its internal procedures and not be forced to take a stand in the meeting.\n\n>Sources said Banerjee at one point asked the leaders of the Congress and the AAP to sit and resolve their differences over tea and biscuits.\n\n>Kharge reportedly said the support on the ordinance issue could not be put as a precondition for an alliance to fight the BJP and cited the AAP’s several “provocative statements” targeting his party.",
        "The best case scenario for opposition is to fight election on their own and then come together for the post poll alliance.\nThe issue is that in politics you can create space for yourself only after taking space from the other because the space is fixed. Even if party leaders come together the local karyakartas would not want to concede their space to the new ally because in local elections like gram panchayat or nagarpalika they have to fight against each other. In such a scenario their focus is to ensure the candidate of the ally loses so that they don't get dominant after the election.",
        "Kejriwal can't put preconditions for his support. What is he offering in return? Will he pledge to not play spoilsport in Rajasthan like he did in Gujarat? \n\nAlso, Kejriwal only decided to be part of a united opposition front after the ordinance stripped his Delhi government of power for all practical purposes. Before that, he always refused to be part of a united front.\n\nFirst Kejriwal should at least get his constituents to oppose the ordinance. Fact is, no one in Delhi cares as most of them are staunch Modi aipporters (as evidenced by the LS results). When he has Delhi behind him, he can start asking for support from opposition parties. \n\nMore importantly, the same thing that has been done to Delhi was done to Kashmir and in a much worse manner. The elected MPs opposed to the love were placed under house arrest, the state was blacked out and no elections have been held till now. Kejriwal actively supported the decision, even cheering it. \n\nIn light of what happened in Delhi, he should first apologise for his support of what was done to Kashmir. You need to be ideologically consistent, you can't only have a problem when you are targeted.",
        "That is never going to work in a FPTP system. It will lead to a sureshot BJP win.",
        "Well atleast (from the other article I shared)\n\n\"While he lost no time distancing himself from the gathering as soon as it got over, during the talks, Kejriwal suggested that parties “nurture a bond of unity” and strive to ensure one-on-one contests against the BJP. He is learnt to have also suggested that parties put on hold plans for expansion in newer territories till the Lok Sabha elections.\"\n\n>First Kejriwal should at least get his constituents to oppose the ordinance. Fact is, no one in Delhi cares as most of them are staunch Modi aipporters (as evidenced by the LS results). \n\nHow did you conclude that his constituents don't support him on the issue? They voted him in again right after 2019. And again aap gained in mcd recently. \n\nAnd yes \n\n\"As Kejriwal pressed on, PDP chief Mehbooba Mufti reminded the AAP of its vociferous support to the Centre’s move to abrogate Article 370 and bifurcate J&K into two Union territories, unlike the other Opposition parties.\"",
        "From your own quoted piece. \n\nKejriwal lost no time in distancing himself from the gathering. His entire reason for attending the meeting was to gather support against the ordinance. He (and AAP) are not interested in a united front.  \n\nAnd you should read my comment carefully. See the LS results for Delhi. BJP has swept Delhi, both in 2014 and 2019. Delhi is not against Modi at all, they don't have a problem with the centre controlling Kejriwal. Delhi prefers BJP at the centre, and AAP at the \"state\". Do you see any ground level protest against the centre's ordinance? \n\nEven after Mufti's reminder, did Kejriwal recant his support for the abrogation? No he did not. And that's because AAP is ideologically bereft. Their calculation tells them that to gather the bhakt vote, they need to demonise Kashmir. So they will continue to do that. \n\nUnless they fix their ideology, they don't belong in a united opposition front.",
        "A united opposition will not work. The bjp is already projecting it as a one vs all fight. The neutral crowd will automatically side with the one. All the infighting between the opposition factions are really bad for the optics. When it comes to state politics there's more rift like Tmc VS congress etc. Additionally the question of if not modi then who? Is really a major thorn in the opposition. Prime ministerial candidate and the allocations are really gonna be a nightmare. Instead the majority party should focus on building the image of one central puppet just like how bjp and amitshah groomed Modi.",
        "Kejriwal found no support amongst opposition leaders when he demanded Congress make a statement at the end of the meeting in support. \n\nIt says a lot when Mamata comes to the defense of Congress. \n\nKejriwal wants Congress to not contest in Punjab and Delhi for concessions in states where AAP has zero presence like Rajasthan. \n\nHe is a weasel and its showing so badly right now",
        "It is very clear that Delhi only supports AAP in local elections but does not support them in Lok Sabha elections. BJP got 46% votes in 2014, and 57% votes in 2019 general elections."
    ],
    "cleaned_text": "khargekejriwal tension casts shadow oppn meet aap ups ante ordinance kharge said aap could make cong support delhi ordinance precondition join alliance fight bjp kejriwal skipped opp leaders joint press conference ",
    "cleaned_title": "khargekejriwal tension casts shadow oppn meet aap ups ante ordinance",
    "cleaned_selftext": "kharge said aap could make cong support delhi ordinance precondition join alliance fight bjp kejriwal skipped opp leaders joint press conference",
    "cleaned_comments": "course meeting aap leaders said raked congresss noncommittal stance delhi ordinance far kharge learnt conveyed strong displeasure kejriwal aap spokespersons charge delhi apparently came even meeting underway patna allegedly agreement bjp congress ordinance latter would walk bill put vote rajya sabha parliaments upcoming session led exchange words kharge kejriwal prompting west bengal cm tmc chief mamata banerjee intervene play role referee sources said told kejriwal calm since congress made clear take stand issue commencement parliament session leaders sided congress suggesting let party go internal procedures forced take stand meeting sources said banerjee one point asked leaders congress aap sit resolve differences tea biscuits kharge reportedly said support ordinance issue could put precondition alliance fight bjp cited aaps several provocative statements targeting party best case scenario opposition fight election come together post poll alliance issue politics create space taking space space fixed even party leaders come together local karyakartas would want concede space new ally local elections like gram panchayat nagarpalika fight scenario focus ensure candidate ally loses dont get dominant election kejriwal cant put preconditions support offering return pledge play spoilsport rajasthan like gujarat also kejriwal decided part united opposition front ordinance stripped delhi government power practical purposes always refused part united front first kejriwal least get constituents oppose ordinance fact one delhi cares staunch modi aipporters evidenced ls results delhi behind start asking support opposition parties importantly thing done delhi done kashmir much worse manner elected mps opposed love placed house arrest state blacked elections held till kejriwal actively supported decision even cheering light happened delhi first apologise support done kashmir need ideologically consistent cant problem targeted never going work fptp system lead sureshot bjp win well atleast article shared lost time distancing gathering soon got talks kejriwal suggested parties nurture bond unity strive ensure oneonone contests bjp learnt also suggested parties put hold plans expansion newer territories till lok sabha elections first kejriwal least get constituents oppose ordinance fact one delhi cares staunch modi aipporters evidenced ls results conclude constituents dont support issue voted right aap gained mcd recently yes kejriwal pressed pdp chief mehbooba mufti reminded aap vociferous support centres move abrogate article bifurcate jk two union territories unlike opposition parties quoted piece kejriwal lost time distancing gathering entire reason attending meeting gather support ordinance aap interested united front read comment carefully see ls results delhi bjp swept delhi delhi modi dont problem centre controlling kejriwal delhi prefers bjp centre aap state see ground level protest centres ordinance even muftis reminder kejriwal recant support abrogation thats aap ideologically bereft calculation tells gather bhakt vote need demonise kashmir continue unless fix ideology dont belong united opposition front united opposition work bjp already projecting one vs fight neutral crowd automatically side one infighting opposition factions really bad optics comes state politics theres rift like tmc vs congress etc additionally question modi really major thorn opposition prime ministerial candidate allocations really gon na nightmare instead majority party focus building image one central puppet like bjp amitshah groomed modi kejriwal found support amongst opposition leaders demanded congress make statement end meeting support says lot mamata comes defense congress kejriwal wants congress contest punjab delhi concessions states aap zero presence like rajasthan weasel showing badly right clear delhi supports aap local elections support lok sabha elections bjp got votes votes general elections",
    "light_cleaned_title": "Kharge-Kejriwal tension casts a shadow on Oppn meet as AAP ups ante over ordinance",
    "light_cleaned_selftext": "Kharge said AAP could not make Cong support over Delhi ordinance a precondition to join an alliance to fight BJP; Kejriwal skipped Opp leaders' joint press conference",
    "light_cleaned_comments": ">In the course of the meeting, the AAP leaders were said to have raked up the Congress’s non-committal stance on the Delhi ordinance so far. >Kharge, it is learnt, then conveyed his strong displeasure to Kejriwal over an AAP spokesperson’s charge in Delhi – which apparently came even as the meeting was underway in Patna – that there was allegedly an agreement between the BJP and the Congress on the ordinance and that the latter would walk out when the Bill will be put to vote in the Rajya Sabha in Parliament’s upcoming session. >This led to an exchange of words between Kharge and Kejriwal, prompting West Bengal CM and TMC chief Mamata Banerjee to intervene and play the role of a referee. Sources said she told Kejriwal that he should calm down since the Congress has made it clear that it will take a stand on the issue before the commencement of the Parliament session. Most of the leaders sided with the Congress suggesting that let the party go through its internal procedures and not be forced to take a stand in the meeting. >Sources said Banerjee at one point asked the leaders of the Congress and the AAP to sit and resolve their differences over tea and biscuits. >Kharge reportedly said the support on the ordinance issue could not be put as a precondition for an alliance to fight the BJP and cited the AAP’s several “provocative statements” targeting his party. The best case scenario for opposition is to fight election on their own and then come together for the post poll alliance. The issue is that in politics you can create space for yourself only after taking space from the other because the space is fixed. Even if party leaders come together the local karyakartas would not want to concede their space to the new ally because in local elections like gram panchayat or nagarpalika they have to fight against each other. In such a scenario their focus is to ensure the candidate of the ally loses so that they don't get dominant after the election. Kejriwal can't put preconditions for his support. What is he offering in return? Will he pledge to not play spoilsport in Rajasthan like he did in Gujarat? Also, Kejriwal only decided to be part of a united opposition front after the ordinance stripped his Delhi government of power for all practical purposes. Before that, he always refused to be part of a united front. First Kejriwal should at least get his constituents to oppose the ordinance. Fact is, no one in Delhi cares as most of them are staunch Modi aipporters (as evidenced by the LS results). When he has Delhi behind him, he can start asking for support from opposition parties. More importantly, the same thing that has been done to Delhi was done to Kashmir and in a much worse manner. The elected MPs opposed to the love were placed under house arrest, the state was blacked out and no elections have been held till now. Kejriwal actively supported the decision, even cheering it. In light of what happened in Delhi, he should first apologise for his support of what was done to Kashmir. You need to be ideologically consistent, you can't only have a problem when you are targeted. That is never going to work in a FPTP system. It will lead to a sureshot BJP win. Well atleast (from the other article I shared) \"While he lost no time distancing himself from the gathering as soon as it got over, during the talks, Kejriwal suggested that parties “nurture a bond of unity” and strive to ensure one-on-one contests against the BJP. He is learnt to have also suggested that parties put on hold plans for expansion in newer territories till the Lok Sabha elections.\" >First Kejriwal should at least get his constituents to oppose the ordinance. Fact is, no one in Delhi cares as most of them are staunch Modi aipporters (as evidenced by the LS results). How did you conclude that his constituents don't support him on the issue? They voted him in again right after 2019. And again aap gained in mcd recently. And yes \"As Kejriwal pressed on, PDP chief Mehbooba Mufti reminded the AAP of its vociferous support to the Centre’s move to abrogate Article 370 and bifurcate J&K into two Union territories, unlike the other Opposition parties.\" From your own quoted piece. Kejriwal lost no time in distancing himself from the gathering. His entire reason for attending the meeting was to gather support against the ordinance. He (and AAP) are not interested in a united front. And you should read my comment carefully. See the LS results for Delhi. BJP has swept Delhi, both in 2014 and 2019. Delhi is not against Modi at all, they don't have a problem with the centre controlling Kejriwal. Delhi prefers BJP at the centre, and AAP at the \"state\". Do you see any ground level protest against the centre's ordinance? Even after Mufti's reminder, did Kejriwal recant his support for the abrogation? No he did not. And that's because AAP is ideologically bereft. Their calculation tells them that to gather the bhakt vote, they need to demonise Kashmir. So they will continue to do that. Unless they fix their ideology, they don't belong in a united opposition front. A united opposition will not work. The bjp is already projecting it as a one vs all fight. The neutral crowd will automatically side with the one. All the infighting between the opposition factions are really bad for the optics. When it comes to state politics there's more rift like Tmc VS congress etc. Additionally the question of if not modi then who? Is really a major thorn in the opposition. Prime ministerial candidate and the allocations are really gonna be a nightmare. Instead the majority party should focus on building the image of one central puppet just like how bjp and amitshah groomed Modi. Kejriwal found no support amongst opposition leaders when he demanded Congress make a statement at the end of the meeting in support. It says a lot when Mamata comes to the defense of Congress. Kejriwal wants Congress to not contest in Punjab and Delhi for concessions in states where AAP has zero presence like Rajasthan. He is a weasel and its showing so badly right now It is very clear that Delhi only supports AAP in local elections but does not support them in Lok Sabha elections. BJP got 46% votes in 2014, and 57% votes in 2019 general elections."
}