{
    "id": "1b9ogns",
    "title": "Questioning the Transition from Judiciary to Politics: Seeking Insights on Transparency",
    "url": "https://www.reddit.com/r/india/comments/1b9ogns/questioning_the_transition_from_judiciary_to/",
    "selftext": " The recent announcement by former Calcutta High Court judge Abhijit Gangopadhyay, resigning from the judiciary to join politics, has ignited a discussion on the appropriateness of such moves by judges. As he gears up to join the BJP, the question arises: What considerations should the public keep in mind when judges transition into political roles?\n\nNews articles like those mentioned below shed light on similar instances:\n\n* [Indian Express - Courtroom Politics: Justice Abhijit Gangopadhyay Quits SC Judges, Polls](https://indianexpress.com/article/political-pulse/courtroom-politics-justice-abhijit-gangopadhyay-quits-sc-judges-polls-9196815/)\n* [Times of India - Iyer, Hegde, Alam: Netas Who Became Judges and Judges Who Turned Netas](https://timesofindia.indiatimes.com/india/iyer-hegde-alam-netas-who-became-judges-and-judges-who-turned-netas/articleshow/97716740.cms)\n* [India Legal Live - Judges in Politics](https://www.indialegallive.com/viewpoint/judges-in-politics/)\n\nNow, the question arises: What role can the common public play, and how can we discern whether such transitions into politics are driven by a genuine intent for betterment or personal interest?\n\nShare your thoughts and insights below.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1709906025.0,
    "convurl": "https://external-preview.redd.it/LdO7xWQcIcDbjQ0LO99GGLf4Wvs-wxvRE83BxT-0Zzo.jpg?auto=webp&s=c9d9f6ef1628d7be6a5ff10ce7c991370949cd90",
    "comments": [],
    "cleaned_text": "questioning transition judiciary politics seeking insights transparency recent announcement former calcutta high court judge abhijit gangopadhyay resigning judiciary join politics ignited discussion appropriateness moves judges gears join bjp question arises considerations public keep mind judges transition political roles news articles like mentioned shed light similar instances indian express courtroom politics justice abhijit gangopadhyay quits sc judges pollshttpsindianexpresscomarticlepoliticalpulsecourtroompoliticsjusticeabhijitgangopadhyayquitsscjudgespolls times india iyer hegde alam netas became judges judges turned netashttpstimesofindiaindiatimescomindiaiyerhegdealamnetaswhobecamejudgesandjudgeswhoturnednetasarticleshowcms india legal live judges politicshttpswwwindialegallivecomviewpointjudgesinpolitics question arises role common public play discern whether transitions politics driven genuine intent betterment personal interest share thoughts insights ",
    "cleaned_title": "questioning transition judiciary politics seeking insights transparency",
    "cleaned_selftext": "recent announcement former calcutta high court judge abhijit gangopadhyay resigning judiciary join politics ignited discussion appropriateness moves judges gears join bjp question arises considerations public keep mind judges transition political roles news articles like mentioned shed light similar instances indian express courtroom politics justice abhijit gangopadhyay quits sc judges pollshttpsindianexpresscomarticlepoliticalpulsecourtroompoliticsjusticeabhijitgangopadhyayquitsscjudgespolls times india iyer hegde alam netas became judges judges turned netashttpstimesofindiaindiatimescomindiaiyerhegdealamnetaswhobecamejudgesandjudgeswhoturnednetasarticleshowcms india legal live judges politicshttpswwwindialegallivecomviewpointjudgesinpolitics question arises role common public play discern whether transitions politics driven genuine intent betterment personal interest share thoughts insights",
    "cleaned_comments": "",
    "light_cleaned_title": "Questioning the Transition from Judiciary to Politics: Seeking Insights on Transparency",
    "light_cleaned_selftext": "The recent announcement by former Calcutta High Court judge Abhijit Gangopadhyay, resigning from the judiciary to join politics, has ignited a discussion on the appropriateness of such moves by judges. As he gears up to join the BJP, the question arises: What considerations should the public keep in mind when judges transition into political roles? News articles like those mentioned below shed light on similar instances: * [Indian Express - Courtroom Politics: Justice Abhijit Gangopadhyay Quits SC Judges, Polls](https://indianexpress.com/article/political-pulse/courtroom-politics-justice-abhijit-gangopadhyay-quits-sc-judges-polls-9196815/) * [Times of India - Iyer, Hegde, Alam: Netas Who Became Judges and Judges Who Turned Netas](https://timesofindia.indiatimes.com/india/iyer-hegde-alam-netas-who-became-judges-and-judges-who-turned-netas/articleshow/97716740.cms) * [India Legal Live - Judges in Politics](https://www.indialegallive.com/viewpoint/judges-in-politics/) Now, the question arises: What role can the common public play, and how can we discern whether such transitions into politics are driven by a genuine intent for betterment or personal interest? Share your thoughts and insights below.",
    "light_cleaned_comments": ""
}