{
    "id": "1gze3vr",
    "title": "Maharashtra looks at tweaks to Ladki Bahin amid fiscal challenges",
    "url": "https://www.hindustantimes.com/cities/mumbai-news/ladki-bahin-list-likely-to-be-pruned-101732475918601.html",
    "selftext": "So 3 political parties used the public exchequer to fund their popp promises knowing very well the scheme was not sustainable and did not check if those benefitting are eligible.",
    "flair": "Policy/Economy",
    "score": 136,
    "num_comments": 35,
    "created_utc": 1732522621.0,
    "convurl": "https://external-preview.redd.it/_uXTNqEi6Tqybflf7QowOPTqonA1abuZzZ2toAttMh4.jpg?auto=webp&s=ee892a827a067b474183f36dd381e10416d8bf6e",
    "comments": [
        "In short 🖕",
        "Good",
        "Muft ki Revdi",
        "lol more voters will be absent or nota next time",
        "Let the municipal elections get over and we will see what happens to ladki bahin.",
        "money does not grow on trees even foolish indians will know now.",
        "by 2028 everyone will receive universal basic income in some form, this is just beginning",
        "Lmfaoaoaoao. Maharashtra fucked in the butt again by gujjus. How long is it going to take for maharashtra to learn the lesson?",
        "Acha hua. Logo ko bhi tamacha milna chahiye for electing clowns",
        "We are one decision  (and a really bad one) away from Universal basic income and going bankrupt like Sri Lanka",
        "people deserve this..",
        ">Maharashtra fucked in the butt again by gujjus\n\nLike they weren't going to by anyone else coming to power. At least there is the promise of some infrastructure development, some policy progress due to the double engine butt fuck. \n\nThe others may not have enough wherewithal nay the courtesy to use lubricant during said butt fuck",
        "There's nothing concrete in the BJP Manifesto.",
        "Kya kare bhai hamari public hi aisi chu*iya hain 🤦",
        "Don’t both sides like some enlightened centrist here. Maharashtra has always performed better economically relative to the country under congress governments than fadnavis sarkaar.",
        "Are they even planning to conduct them? Haven't read anything at all about it\n\n\nRight now state govt controls municipalities through their IAS appointees ",
        "Mate I have friends working in the BJP strategy department and lemme just say even the ones working on the the manifestos knew less than half of those things were ever meant by them. Hell, they were caught blindsided when the state alliance leaders made some wild 10 point plan on TV out of thin air and had to amend the manifesto to include those in the middle of the night.",
        "Ghis meri bevdi",
        "No wonder there's most mess and unchecked hawker encroachment....not that it was different without them.",
        "So.. there's a Anganwadi in a rented block at my home. Today I saw two women, who I am aware of being from a middle class family, actually came to register themselves to the ladki behen scheme saying that the last day is 30 Nov. They were not the first from decent earning families whom I've witnessed applying for the scheme. \n\nGovernment should have focused more on creating employment opportunities for many to benefit on a long term basis while benefiting from taxes instead of pulling such poorly implemented schemes out of their bum holes.",
        "hear rumblings about Feb",
        "The only concrete is being used to make sub-standard roads.",
        "RaGa speed ran everyone in 2019 with NYAY scheme lol. \n\nUBI is inevitable with reduced earning opportunities and a \"jobless growth\" kinda economy.",
        "Achche din!",
        "Nah, if they continue with infrastructure projects, attract investments, facilitate startups, they will have money for these schemes.",
        ">  At least there is the promise of some infrastructure development \n\n\n You sure the promised development hasn't moved to gujarat, yet?",
        "Atleast there was a corporator that a citizen of a ward to go to for issues pertaining water supply, electricty whatever\n\nNow they have to go to MLA/IAS who are too high on themselves and never listen",
        "People deserve this. I have seen people who make 1 lakh and even 4 lakh(a month), take even 1000rs from the government and apply for schemes. \nSlowly, there won't be any roads or any development, just freebies, and people can start moving backward in time.everyone is busy looting the country.",
        "Even the original \"Laadli Behna\" scheme in MP was a scam. Elderly widows who benefited from the Vidhwa Pension Yojna (₹ 600) were given only ₹ 400 instead of the ₹ 1000 promised under Laadli Behna.",
        "They rolled out 40-50 schemes overnight without informing anyone. It was most likely a knee-jerk reaction to the deteriorating Adani situation.",
        "Definitely something is going on with EVMs. People should not be blamed.",
        "Really ?? I doubt how ..",
        "The tweak should be nationwide, that every such scheme the money should come from the political party's budget not from the government",
        "Things have not come out of the closet completely. It will be difficult to furnish a fool-proof evidence trail of ECI tampering with the results. But there are plenty of signs that they are involved. People point out other state victories for opposition. If BJP wants it - they can do it there as well. But they pick their states and constituencies strategically in order to keep people from revolting. That's the reason Jharkhand was left alone. In my opinion - ECI has played with many of the recent state elections also - MP, Haryana, Rajasthan and now MH. I think this game started slowly from 2019.",
        "conspiracy... there is no evidence\n\nto actually tamper with EVM or election, one needs involvement of huge number of people.. each booth has 5 staff, each center has 7 or 8 booths.. there are 500-600 centers in one assembly constituency.. so count the involvement plus police staff extra.. it is impossible that none of these people will know..",
        "Does not happen at the booth. Very much possible that ECI rigs assignment of EVM units. EVM units could be changed at the storage center. The inconsistency in final number reporting is due to this. People who are involved are keeping quiet now. One day the evidence will fall out of the closet."
    ],
    "cleaned_text": "maharashtra looks tweaks ladki bahin amid fiscal challenges political parties used public exchequer fund popp promises knowing well scheme sustainable check benefitting eligible ",
    "cleaned_title": "maharashtra looks tweaks ladki bahin amid fiscal challenges",
    "cleaned_selftext": "political parties used public exchequer fund popp promises knowing well scheme sustainable check benefitting eligible",
    "cleaned_comments": "short good muft ki revdi lol voters absent nota next time let municipal elections get see happens ladki bahin money grow trees even foolish indians know everyone receive universal basic income form beginning lmfaoaoaoao maharashtra fucked butt gujjus long going take maharashtra learn lesson acha hua logo ko bhi tamacha milna chahiye electing clowns one decision really bad one away universal basic income going bankrupt like sri lanka people deserve maharashtra fucked butt gujjus like werent going anyone else coming power least promise infrastructure development policy progress due double engine butt fuck others may enough wherewithal nay courtesy use lubricant said butt fuck theres nothing concrete bjp manifesto kya kare bhai hamari public hi aisi chuiya hain dont sides like enlightened centrist maharashtra always performed better economically relative country congress governments fadnavis sarkaar even planning conduct havent read anything right state govt controls municipalities ias appointees mate friends working bjp strategy department lem say even ones working manifestos knew less half things ever meant hell caught blindsided state alliance leaders made wild point plan tv thin air amend manifesto include middle night ghis meri bevdi wonder theres mess unchecked hawker encroachmentnot different without theres anganwadi rented block home today saw two women aware middle class family actually came register ladki behen scheme saying last day nov first decent earning families ive witnessed applying scheme government focused creating employment opportunities many benefit long term basis benefiting taxes instead pulling poorly implemented schemes bum holes hear rumblings feb concrete used make substandard roads raga speed ran everyone nyay scheme lol ubi inevitable reduced earning opportunities jobless growth kinda economy achche din nah continue infrastructure projects attract investments facilitate startups money schemes least promise infrastructure development sure promised development hasnt moved gujarat yet atleast corporator citizen ward go issues pertaining water supply electricty whatever go mlaias high never listen people deserve seen people make lakh even lakha month take even rs government apply schemes slowly wont roads development freebies people start moving backward timeeveryone busy looting country even original laadli behna scheme mp scam elderly widows benefited vidhwa pension yojna given instead promised laadli behna rolled schemes overnight without informing anyone likely kneejerk reaction deteriorating adani situation definitely something going evms people blamed really doubt tweak nationwide every scheme money come political partys budget government things come closet completely difficult furnish foolproof evidence trail eci tampering results plenty signs involved people point state victories opposition bjp wants well pick states constituencies strategically order keep people revolting thats reason jharkhand left alone opinion eci played many recent state elections also mp haryana rajasthan mh think game started slowly conspiracy evidence actually tamper evm election one needs involvement huge number people booth staff center booths centers one assembly constituency count involvement plus police staff extra impossible none people know happen booth much possible eci rigs assignment evm units evm units could changed storage center inconsistency final number reporting due people involved keeping quiet one day evidence fall closet",
    "light_cleaned_title": "Maharashtra looks at tweaks to Ladki Bahin amid fiscal challenges",
    "light_cleaned_selftext": "So 3 political parties used the public exchequer to fund their popp promises knowing very well the scheme was not sustainable and did not check if those benefitting are eligible.",
    "light_cleaned_comments": "In short 🖕 Good Muft ki Revdi lol more voters will be absent or nota next time Let the municipal elections get over and we will see what happens to ladki bahin. money does not grow on trees even foolish indians will know now. by 2028 everyone will receive universal basic income in some form, this is just beginning Lmfaoaoaoao. Maharashtra fucked in the butt again by gujjus. How long is it going to take for maharashtra to learn the lesson? Acha hua. Logo ko bhi tamacha milna chahiye for electing clowns We are one decision (and a really bad one) away from Universal basic income and going bankrupt like Sri Lanka people deserve this.. >Maharashtra fucked in the butt again by gujjus Like they weren't going to by anyone else coming to power. At least there is the promise of some infrastructure development, some policy progress due to the double engine butt fuck. The others may not have enough wherewithal nay the courtesy to use lubricant during said butt fuck There's nothing concrete in the BJP Manifesto. Kya kare bhai hamari public hi aisi chu*iya hain 🤦 Don’t both sides like some enlightened centrist here. Maharashtra has always performed better economically relative to the country under congress governments than fadnavis sarkaar. Are they even planning to conduct them? Haven't read anything at all about it Right now state govt controls municipalities through their IAS appointees Mate I have friends working in the BJP strategy department and lemme just say even the ones working on the the manifestos knew less than half of those things were ever meant by them. Hell, they were caught blindsided when the state alliance leaders made some wild 10 point plan on TV out of thin air and had to amend the manifesto to include those in the middle of the night. Ghis meri bevdi No wonder there's most mess and unchecked hawker encroachment....not that it was different without them. So.. there's a Anganwadi in a rented block at my home. Today I saw two women, who I am aware of being from a middle class family, actually came to register themselves to the ladki behen scheme saying that the last day is 30 Nov. They were not the first from decent earning families whom I've witnessed applying for the scheme. Government should have focused more on creating employment opportunities for many to benefit on a long term basis while benefiting from taxes instead of pulling such poorly implemented schemes out of their bum holes. hear rumblings about Feb The only concrete is being used to make sub-standard roads. RaGa speed ran everyone in 2019 with NYAY scheme lol. UBI is inevitable with reduced earning opportunities and a \"jobless growth\" kinda economy. Achche din! Nah, if they continue with infrastructure projects, attract investments, facilitate startups, they will have money for these schemes. > At least there is the promise of some infrastructure development You sure the promised development hasn't moved to gujarat, yet? Atleast there was a corporator that a citizen of a ward to go to for issues pertaining water supply, electricty whatever Now they have to go to MLA/IAS who are too high on themselves and never listen People deserve this. I have seen people who make 1 lakh and even 4 lakh(a month), take even 1000rs from the government and apply for schemes. Slowly, there won't be any roads or any development, just freebies, and people can start moving backward in time.everyone is busy looting the country. Even the original \"Laadli Behna\" scheme in MP was a scam. Elderly widows who benefited from the Vidhwa Pension Yojna (₹ 600) were given only ₹ 400 instead of the ₹ 1000 promised under Laadli Behna. They rolled out 40-50 schemes overnight without informing anyone. It was most likely a knee-jerk reaction to the deteriorating Adani situation. Definitely something is going on with EVMs. People should not be blamed. Really ?? I doubt how .. The tweak should be nationwide, that every such scheme the money should come from the political party's budget not from the government Things have not come out of the closet completely. It will be difficult to furnish a fool-proof evidence trail of ECI tampering with the results. But there are plenty of signs that they are involved. People point out other state victories for opposition. If BJP wants it - they can do it there as well. But they pick their states and constituencies strategically in order to keep people from revolting. That's the reason Jharkhand was left alone. In my opinion - ECI has played with many of the recent state elections also - MP, Haryana, Rajasthan and now MH. I think this game started slowly from 2019. conspiracy... there is no evidence to actually tamper with EVM or election, one needs involvement of huge number of people.. each booth has 5 staff, each center has 7 or 8 booths.. there are 500-600 centers in one assembly constituency.. so count the involvement plus police staff extra.. it is impossible that none of these people will know.. Does not happen at the booth. Very much possible that ECI rigs assignment of EVM units. EVM units could be changed at the storage center. The inconsistency in final number reporting is due to this. People who are involved are keeping quiet now. One day the evidence will fall out of the closet."
}