{
    "id": "1ge049k",
    "title": "Mukesh is coming to your home and you can’t skip it: IFF’s submissions on the Cigarettes & Other Tobacco Products Amendment Rules 2024\n",
    "url": "https://www.reddit.com/r/india/comments/1ge049k/mukesh_is_coming_to_your_home_and_you_cant_skip/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/akwa74ysjhxd1.jpg?width=900&format=pjpg&auto=webp&s=6ee4110bddbef6b63c7492cc22a9a4dca0202cc9)\n\nKeeping in mind the injurious health impact of tobacco consumption, IFF submitted comments to MoHFW on the draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 from a free speech perspective. \n\n\n\n**Tl;dr**\n\nOn 13 September 2024, the Ministry of Health and Family Welfare (“MoHFW”) issued the draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 (“COTPA Amendment Rules”) for public consultation, with a deadline of October 12, 2024 for submitting comments. The COTPA Amendment Rules have introduced non-skippable mandatory tobacco health warnings on OTT platforms. Given the implications that these rules have on our freedom of speech and expression, IFF wrote to MoHFW and submitted our detailed comments on the Rules.\n\n**Important documents**\n\n1. IFF’s consultation response on the Draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 ([link](https://drive.google.com/file/d/1X0-fhBVD4d8nzGTyOZmEquez18Aj-GZA/view?usp=drive_link))\n2. Draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 ([link](https://drive.google.com/file/d/1WBmlJ0ADcd9_KorjuBBcf7vHAj_N6MLH/view?usp=sharing))\n3. Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 ([link](https://ntcp.mohfw.gov.in/assets/document/Cigarettes%20and%20other%20Tobacco%20Products%20(Prohibition%20of%20Advertisement%20and%20Regulation%20of%20Trade%20and%20Commerce,%20Production,%20Supply%20and%20Distribution)%20Amendment%20Rules,%202023.pdf))\n\n**Background**\n\nIn May 2023, MoHFW introduced the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 (“2023 COTPA Amendment Rules”), which introduced Rule 11 to the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Rules, 2004. Rule 11 of the 2023 COTPA Amendment Rules requires publishers of online curated content displaying tobacco products or their use to show anti-tobacco health spots for at least thirty seconds, warning messages at the bottom of the screen during any display of tobacco products, and audio-visual disclaimers of a minimum of twenty-second duration.\n\nThe 2024 draft COTPA Amendment Rules has proposed modifications to Rule 11 and now requires the display of non-skippable anti-tobacco health spots and audio-visual disclaimers upon opening the platforms of the publishers of the online curated content, ie., OTT platforms. The requirement for static anti-tobacco warnings at the bottom of the screen during the period of display of the tobacco products has been retained in the draft COTPA Amendment Rules from the erstwhile Rule 11. Additionally, the draft COTPA Amendment Rules also introduced a new sub-rule which mandates the display of anti-tobacco health spots, anti-tobacco static message at the bottom of the screen during the period of display of the tobacco products or their use in the and audio-visual disclaimers in all films published on OTT platforms.\n\n  \n\n\n**Our Submissions**\n\n\n\n1. **Jurisdictional Conflict**\n\nThe draft COTPA Amendment Rules have been released by the MoHFW. Section 31 of the Cigarettes and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Act, 2003 (“COTPA Act”) empowers the Union Government to make rules on anti-tobacco warnings, however, the draft COTPA Amendment Rules directly regulate OTT platforms and their published content. As per Rule 8, Part III of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, publishers of online curated content will be administered by the Ministry of Information Broadcasting (“MIB”). This is further confirmed by the [Government of India (Allocation of Business) Rules, 1961](https://cabsec.gov.in/allocationofbusinessrules/completeaobrules/) which provides that “*Films and Audio-Visual programmes/content made available by online content providers/publishers*” fall under the purview of MIB*.* The draft COTPA Amendment Rules have bypassed the nodal ministry for OTT platforms and have legislated upon areas that do not fall under their executive preview. MoHFW has overreached the limits of its powers by seeking to govern OTT platforms by infringing on the jurisdiction of another ministry which must be remedied. \n\n\n\n1. **Negative impact on freedom of speech and expression**\n\nThe introduction of the draft COTPA Amendment Rules may have a chilling effect on critical depiction of societal ills in the context of lifestyle choices, thus infringing on the right to freedom of speech and expression of the individual involved in the making of the content in question. Requiring films and other content to include non-skippable 30-second anti-tobacco health spots and warnings during the display of tobacco use are stringent requirements that impact the creative freedom of artists. These requirements are also inherently judgemental of certain lifestyle choices and are patronizing towards individuals consuming content on OTT platforms. We believe, therefore, that the draft COTPA Amendment Rules, can have adverse consequences on the constitutional and cultural rights of the citizens of India, especially their right to the freedom of speech and expression. This right extends to both, the creator of the content as well as the audience, whose artistic freedom and right to receive information are being interfered with respectively. \n\n\n\n1. **Non-efficacy of tobacco warning health spots**\n\n[Initial research](https://www.koanadvisory.com/storage/2023/05/Tobacco-Disclaimers-Report_Koan.pdf) on the effectiveness of pictorial and threatening warnings (“PTW”) associated with tobacco on OTT platforms suggest that such warnings may have limited, if any, effect on people’s intention to quit or reduce cigarette consumption, and that the effect fades over time.  Viewers also feel that the need for additional text disclaimers is “unwarranted”. A judgment in the case of *Tobacco Institute of India v. Union of India* states that rules mandating cigarette manufacturers to show a health warning on 85% of the cigarette packaging as well as text stating “smoking causes cancer” are found “unscientific and disproportionate”.\n\n\n\n1. **Regulation of OTT platforms**\n\nThe draft COTPA Amendment Rules do not take into account the unique nature of OTT platforms and streaming services. These rules have blindly imported requirements for tobacco warnings in theatres to OTT platforms without considering key differences between the same. While discouraging the use of tobacco products is a legitimate state aim, it may be worth considering if online streaming services are the right avenue for implementing this aim, given their inaccessibility due to access or economic constraints. The Kerala High Court in the case of *Peggy Fen vs Central Board Of Film Certification* *\\[2022 SCC Online Ker 785\\]* stated that - “*There is no compelled viewing of this movie. The OTT platform cannot be treated as a captive audience who are forced to watch the movie.*” \n\n\n\nThus, the distinct nature of OTT platforms and their audience must also be considered before introducing such regulatory burdens on publishers and platforms. For instance, the draft COTPA Amendment Rules do not consider the fact that viewers tend to binge-watch content on OTT platforms and that these non-skippable tobacco health spots would be displayed before every single episode/content block and hence viewers will be subjected to repeated ads during a given viewing session. Further, viewers often consume content on OTT platforms using small-screen personal devices. Cramming static tobacco warnings into small smartphone screens could significantly ruin the viewer experience. Lastly, the draft COTPA Amendment Rules do not specify the language in which the tobacco health spots are to be shown in. Given that OTT platforms host content in a bevy of languages, it would be unrealistic to customise the health spots for every single language that is available on OTT platforms.\n\n\n\n1. **Impact on EoDB and the Indian Economy**\n\nThe stringent requirements imposed on OTT platforms through the draft COTPA Amendment Rules could significantly impact the EoDB of OTT platforms and hamper the growth of the OTT industry in the country. India is uniquely positioned to experience an OTT and internet boom in the near future. As per a recent [report](https://www.trai.gov.in/sites/default/files/QPIR_04072024_0.pdf) by the Telecom Regulatory Authority of India, the total number of internet subscribers increased from 936.16 million at the end of December 2023 to 954.40 million at the end of March 2024, registering a quarterly rate of growth of 1.95%. With a growing penetration of internet users, India is uniquely positioned as an attractive market for OTT video/streaming services. Revenue of the Indian video OTT market is [set to double](https://www.ibef.org/industry/media-entertainment-india) from US$ 1.8 billion in 2022 to US$ 3.5 billion by 2027.​ The growth of this sector and the revenue generated from the same could be a huge boost to the Indian economy. However, compliance requirements such as the draft COTPA Amendment Rules would likely be viewed as huge regulatory hurdles by OTT platforms and as a deterrent to EoDB. In order to implement the draft COTPA Amendment Rules, unlike other mediums such as theatres and TV, OTT platforms have to go back and edit hours and hours of content to include the tobacco health spots. The impact which these health spots would have on the viewing experience is also not likely to be taken kindly by the OTT industry.\n\n \n\nThe draft COTPA Amendment Rules also require the display of a non-skippable audio-visual disclaimer on the ill effects of tobacco use, for a minimum of twenty seconds upon opening the OTT platforms. Such a requirement would have a deep impact on the carefully curated and researched consumer experience crafted by OTT platforms. In the wake of the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 dated 31 May, 2023, OTT platforms are already planning to adopt [legal challenges](https://www.reuters.com/world/india/netflix-disney-amazon-challenge-indias-tobacco-rules-streaming-sources-2023-06-02/) to fight the requirements for tobacco warnings on streaming platforms. If these regulatory hurdles prove to be too cumbersome for OTT platforms, then we might be looking at a situation where they restrict their involvement in the Indian market. \n\nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 92,
    "num_comments": 13,
    "created_utc": 1730116421.0,
    "convurl": "https://b.thumbs.redditmedia.com/OP2ZyIjVPLLd8j8Crb-ieHe19wcZS8vfemaoYTAeCkk.jpg",
    "comments": [
        "You know, this advertisement doesn’t really deter the smokers. It just reminds them to smoke after the movie or in break.\n\nIf you really want to deter the smokers, show them the hospital bills that likes of Mukesh have incurred. But wait, then it could showcase government’s inability to control prices of medical treatments.",
        "Only way is to educate and let people make the choice. Also, increase rehab facility and make addicts welcome.",
        "Thank you! Please get rid of this nonsense",
        "What societal Taboo & Stigma?\n\nHow do you remove these associated with rehabs?\n\nWithin general public if someone goes to rehab for solving addiction problems, the person is looked down like a criminal. For whole life this one thing sticks to his identity. I have a relative who was addicted to cigarettes & alcohol in young age. He went to rehab, got deaddicted & started leaving normal life by age of 35. Got married by 40ish. But when talking about that person, his addiction & rehabs gets talked more.",
        "Gore doesnt really deter people\n\nMake the ads more about people missing out on good experiences and happy moments in life due to smoking and it might work",
        "Nobody really pata attention to this nonsense before a movie.",
        "Here in Australia the government has put 75% tax on the cigarettes and tobacco, a $40 cigarette pack has $30 tax, there is complete ban on any kind of tobacco/cigarette advertisement since 1992, cigarettes and tobacco can be purchased from supermarkets, fuels stations but only at request, they are hidden.",
        "The title is straight up threat.",
        "Government won’t make a good plan or even consider to phase out tobacco entirely (because tobacco tax money) but will shove their fake-concern ads everywhere they can. \n\nWhy do more work when less work do work",
        "This seem to be a non urgent issue. There were data breaches after data breaches. Are you folks doing anything for that?",
        "OTT everyday turns into what Cable TV was, just with a slicker UI and on-demand availability but with 10 times the price. In a few years, a new platform will come providing what OTT had in the initial days - no regulations, no Advertisements, and dirt cheap prices. And then the cycle continues.",
        "I've been thinking about thes ads and i have an idea- why not fight fire with fire? Rather than explaining I'll get straight to an example pitch- \\*start\\* the ad starts of with actor behind the scenes in a smoking ad acting in out and and then \"cut! great job,\" is seen going back home, spending time eating healthy in a nice a\\*\\* home, going to gym working out like hell, hanging out with friends and at last rejecting a packet of cigarettes when offered one at a party, they then turn towards the camera and have flashbacks of the ad they acted on that day with the exact lines reiterated (maybe line could be - hum cool he kyuki hum iss brand ki smoke karte he) and then end ad with a catchy anti smoking ad picking up from the same sentence that was iterated previously.\n\nI believe something like this could actually work way better...",
        "The only solution is to ban all tobacco products like in Singapore"
    ],
    "cleaned_text": "mukesh coming home cant skip iffs submissions cigarettes tobacco products amendment rules iff needs support ever details end posthttpspreviewredditakwaysjhxdjpgwidthformatpjpgautowebpseebddbefbcccaadcacc keeping mind injurious health impact tobacco consumption iff submitted comments mohfw draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules free speech perspective tldr september ministry health family welfare mohfw issued draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules cotpa amendment rules public consultation deadline october submitting comments cotpa amendment rules introduced nonskippable mandatory tobacco health warnings ott platforms given implications rules freedom speech expression iff wrote mohfw submitted detailed comments rules important documents iffs consultation response draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsdrivegooglecomfiledxfhbvddnzgtyozmequezajgzaviewuspdrivelink draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsdrivegooglecomfiledwbmljadcdkorjubbcfvhajnmlhviewuspsharing cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsntcpmohfwgovinassetsdocumentcigarettesandothertobaccoproductsprohibitionofadvertisementandregulationoftradeandcommerceproductionsupplyanddistributionamendmentrulespdf background may mohfw introduced cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules cotpa amendment rules introduced rule cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution rules rule cotpa amendment rules requires publishers online curated content displaying tobacco products use show antitobacco health spots least thirty seconds warning messages bottom screen display tobacco products audiovisual disclaimers minimum twentysecond duration draft cotpa amendment rules proposed modifications rule requires display nonskippable antitobacco health spots audiovisual disclaimers upon opening platforms publishers online curated content ie ott platforms requirement static antitobacco warnings bottom screen period display tobacco products retained draft cotpa amendment rules erstwhile rule additionally draft cotpa amendment rules also introduced new subrule mandates display antitobacco health spots antitobacco static message bottom screen period display tobacco products use audiovisual disclaimers films published ott platforms submissions jurisdictional conflict draft cotpa amendment rules released mohfw section cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution act cotpa act empowers union government make rules antitobacco warnings however draft cotpa amendment rules directly regulate ott platforms published content per rule part iii information technology intermediary guidelines digital media ethics code rules publishers online curated content administered ministry information broadcasting mib confirmed government india allocation business rules httpscabsecgovinallocationofbusinessrulescompleteaobrules provides films audiovisual programmescontent made available online content providerspublishers fall purview mib draft cotpa amendment rules bypassed nodal ministry ott platforms legislated upon areas fall executive preview mohfw overreached limits powers seeking govern ott platforms infringing jurisdiction another ministry must remedied negative impact freedom speech expression introduction draft cotpa amendment rules may chilling effect critical depiction societal ills context lifestyle choices thus infringing right freedom speech expression individual involved making content question requiring films content include nonskippable second antitobacco health spots warnings display tobacco use stringent requirements impact creative freedom artists requirements also inherently judgemental certain lifestyle choices patronizing towards individuals consuming content ott platforms believe therefore draft cotpa amendment rules adverse consequences constitutional cultural rights citizens india especially right freedom speech expression right extends creator content well audience whose artistic freedom right receive information interfered respectively nonefficacy tobacco warning health spots initial researchhttpswwwkoanadvisorycomstoragetobaccodisclaimersreportkoanpdf effectiveness pictorial threatening warnings ptw associated tobacco ott platforms suggest warnings may limited effect peoples intention quit reduce cigarette consumption effect fades time viewers also feel need additional text disclaimers unwarranted judgment case tobacco institute india v union india states rules mandating cigarette manufacturers show health warning cigarette packaging well text stating smoking causes cancer found unscientific disproportionate regulation ott platforms draft cotpa amendment rules take account unique nature ott platforms streaming services rules blindly imported requirements tobacco warnings theatres ott platforms without considering key differences discouraging use tobacco products legitimate state aim may worth considering online streaming services right avenue implementing aim given inaccessibility due access economic constraints kerala high court case peggy fen vs central board film certification scc online ker stated compelled viewing movie ott platform treated captive audience forced watch movie thus distinct nature ott platforms audience must also considered introducing regulatory burdens publishers platforms instance draft cotpa amendment rules consider fact viewers tend bingewatch content ott platforms nonskippable tobacco health spots would displayed every single episodecontent block hence viewers subjected repeated ads given viewing session viewers often consume content ott platforms using smallscreen personal devices cramming static tobacco warnings small smartphone screens could significantly ruin viewer experience lastly draft cotpa amendment rules specify language tobacco health spots shown given ott platforms host content bevy languages would unrealistic customise health spots every single language available ott platforms impact eodb indian economy stringent requirements imposed ott platforms draft cotpa amendment rules could significantly impact eodb ott platforms hamper growth ott industry country india uniquely positioned experience ott internet boom near future per recent reporthttpswwwtraigovinsitesdefaultfilesqpirpdf telecom regulatory authority india total number internet subscribers increased million end december million end march registering quarterly rate growth growing penetration internet users india uniquely positioned attractive market ott videostreaming services revenue indian video ott market set doublehttpswwwibeforgindustrymediaentertainmentindia us billion us billion growth sector revenue generated could huge boost indian economy however compliance requirements draft cotpa amendment rules would likely viewed huge regulatory hurdles ott platforms deterrent eodb order implement draft cotpa amendment rules unlike mediums theatres tv ott platforms go back edit hours hours content include tobacco health spots impact health spots would viewing experience also likely taken kindly ott industry draft cotpa amendment rules also require display nonskippable audiovisual disclaimer ill effects tobacco use minimum twenty seconds upon opening ott platforms requirement would deep impact carefully curated researched consumer experience crafted ott platforms wake cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules dated may ott platforms already planning adopt legal challengeshttpswwwreuterscomworldindianetflixdisneyamazonchallengeindiastobaccorulesstreamingsources fight requirements tobacco warnings streaming platforms regulatory hurdles prove cumbersome ott platforms might looking situation restrict involvement indian market help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "mukesh coming home cant skip iffs submissions cigarettes tobacco products amendment rules",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditakwaysjhxdjpgwidthformatpjpgautowebpseebddbefbcccaadcacc keeping mind injurious health impact tobacco consumption iff submitted comments mohfw draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules free speech perspective tldr september ministry health family welfare mohfw issued draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules cotpa amendment rules public consultation deadline october submitting comments cotpa amendment rules introduced nonskippable mandatory tobacco health warnings ott platforms given implications rules freedom speech expression iff wrote mohfw submitted detailed comments rules important documents iffs consultation response draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsdrivegooglecomfiledxfhbvddnzgtyozmequezajgzaviewuspdrivelink draft cigarette tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsdrivegooglecomfiledwbmljadcdkorjubbcfvhajnmlhviewuspsharing cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules linkhttpsntcpmohfwgovinassetsdocumentcigarettesandothertobaccoproductsprohibitionofadvertisementandregulationoftradeandcommerceproductionsupplyanddistributionamendmentrulespdf background may mohfw introduced cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules cotpa amendment rules introduced rule cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution rules rule cotpa amendment rules requires publishers online curated content displaying tobacco products use show antitobacco health spots least thirty seconds warning messages bottom screen display tobacco products audiovisual disclaimers minimum twentysecond duration draft cotpa amendment rules proposed modifications rule requires display nonskippable antitobacco health spots audiovisual disclaimers upon opening platforms publishers online curated content ie ott platforms requirement static antitobacco warnings bottom screen period display tobacco products retained draft cotpa amendment rules erstwhile rule additionally draft cotpa amendment rules also introduced new subrule mandates display antitobacco health spots antitobacco static message bottom screen period display tobacco products use audiovisual disclaimers films published ott platforms submissions jurisdictional conflict draft cotpa amendment rules released mohfw section cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution act cotpa act empowers union government make rules antitobacco warnings however draft cotpa amendment rules directly regulate ott platforms published content per rule part iii information technology intermediary guidelines digital media ethics code rules publishers online curated content administered ministry information broadcasting mib confirmed government india allocation business rules httpscabsecgovinallocationofbusinessrulescompleteaobrules provides films audiovisual programmescontent made available online content providerspublishers fall purview mib draft cotpa amendment rules bypassed nodal ministry ott platforms legislated upon areas fall executive preview mohfw overreached limits powers seeking govern ott platforms infringing jurisdiction another ministry must remedied negative impact freedom speech expression introduction draft cotpa amendment rules may chilling effect critical depiction societal ills context lifestyle choices thus infringing right freedom speech expression individual involved making content question requiring films content include nonskippable second antitobacco health spots warnings display tobacco use stringent requirements impact creative freedom artists requirements also inherently judgemental certain lifestyle choices patronizing towards individuals consuming content ott platforms believe therefore draft cotpa amendment rules adverse consequences constitutional cultural rights citizens india especially right freedom speech expression right extends creator content well audience whose artistic freedom right receive information interfered respectively nonefficacy tobacco warning health spots initial researchhttpswwwkoanadvisorycomstoragetobaccodisclaimersreportkoanpdf effectiveness pictorial threatening warnings ptw associated tobacco ott platforms suggest warnings may limited effect peoples intention quit reduce cigarette consumption effect fades time viewers also feel need additional text disclaimers unwarranted judgment case tobacco institute india v union india states rules mandating cigarette manufacturers show health warning cigarette packaging well text stating smoking causes cancer found unscientific disproportionate regulation ott platforms draft cotpa amendment rules take account unique nature ott platforms streaming services rules blindly imported requirements tobacco warnings theatres ott platforms without considering key differences discouraging use tobacco products legitimate state aim may worth considering online streaming services right avenue implementing aim given inaccessibility due access economic constraints kerala high court case peggy fen vs central board film certification scc online ker stated compelled viewing movie ott platform treated captive audience forced watch movie thus distinct nature ott platforms audience must also considered introducing regulatory burdens publishers platforms instance draft cotpa amendment rules consider fact viewers tend bingewatch content ott platforms nonskippable tobacco health spots would displayed every single episodecontent block hence viewers subjected repeated ads given viewing session viewers often consume content ott platforms using smallscreen personal devices cramming static tobacco warnings small smartphone screens could significantly ruin viewer experience lastly draft cotpa amendment rules specify language tobacco health spots shown given ott platforms host content bevy languages would unrealistic customise health spots every single language available ott platforms impact eodb indian economy stringent requirements imposed ott platforms draft cotpa amendment rules could significantly impact eodb ott platforms hamper growth ott industry country india uniquely positioned experience ott internet boom near future per recent reporthttpswwwtraigovinsitesdefaultfilesqpirpdf telecom regulatory authority india total number internet subscribers increased million end december million end march registering quarterly rate growth growing penetration internet users india uniquely positioned attractive market ott videostreaming services revenue indian video ott market set doublehttpswwwibeforgindustrymediaentertainmentindia us billion us billion growth sector revenue generated could huge boost indian economy however compliance requirements draft cotpa amendment rules would likely viewed huge regulatory hurdles ott platforms deterrent eodb order implement draft cotpa amendment rules unlike mediums theatres tv ott platforms go back edit hours hours content include tobacco health spots impact health spots would viewing experience also likely taken kindly ott industry draft cotpa amendment rules also require display nonskippable audiovisual disclaimer ill effects tobacco use minimum twenty seconds upon opening ott platforms requirement would deep impact carefully curated researched consumer experience crafted ott platforms wake cigarettes tobacco products prohibition advertisement regulation trade commerce production supply distribution amendment rules dated may ott platforms already planning adopt legal challengeshttpswwwreuterscomworldindianetflixdisneyamazonchallengeindiastobaccorulesstreamingsources fight requirements tobacco warnings streaming platforms regulatory hurdles prove cumbersome ott platforms might looking situation restrict involvement indian market help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "know advertisement doesnt really deter smokers reminds smoke movie break really want deter smokers show hospital bills likes mukesh incurred wait could showcase governments inability control prices medical treatments way educate let people make choice also increase rehab facility make addicts welcome thank please get rid nonsense societal taboo stigma remove associated rehabs within general public someone goes rehab solving addiction problems person looked like criminal whole life one thing sticks identity relative addicted cigarettes alcohol young age went rehab got deaddicted started leaving normal life age got married ish talking person addiction rehabs gets talked gore doesnt really deter people make ads people missing good experiences happy moments life due smoking might work nobody really pata attention nonsense movie australia government put tax cigarettes tobacco cigarette pack tax complete ban kind tobaccocigarette advertisement since cigarettes tobacco purchased supermarkets fuels stations request hidden title straight threat government wont make good plan even consider phase tobacco entirely tobacco tax money shove fakeconcern ads everywhere work less work work seem non urgent issue data breaches data breaches folks anything ott everyday turns cable tv slicker ui ondemand availability times price years new platform come providing ott initial days regulations advertisements dirt cheap prices cycle continues ive thinking thes ads idea fight fire fire rather explaining ill get straight example pitch start ad starts actor behind scenes smoking ad acting cut great job seen going back home spending time eating healthy nice home going gym working like hell hanging friends last rejecting packet cigarettes offered one party turn towards camera flashbacks ad acted day exact lines reiterated maybe line could hum cool kyuki hum iss brand ki smoke karte end ad catchy anti smoking ad picking sentence iterated previously believe something like could actually work way better solution ban tobacco products like singapore",
    "light_cleaned_title": "Mukesh is coming to your home and you can’t skip it: IFF’s submissions on the Cigarettes & Other Tobacco Products Amendment Rules 2024",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/akwa74ysjhxd1.jpg?width=900&format=pjpg&auto=webp&s=6ee4110bddbef6b63c7492cc22a9a4dca0202cc9) Keeping in mind the injurious health impact of tobacco consumption, IFF submitted comments to MoHFW on the draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 from a free speech perspective. **Tl;dr** On 13 September 2024, the Ministry of Health and Family Welfare (“MoHFW”) issued the draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 (“COTPA Amendment Rules”) for public consultation, with a deadline of October 12, 2024 for submitting comments. The COTPA Amendment Rules have introduced non-skippable mandatory tobacco health warnings on OTT platforms. Given the implications that these rules have on our freedom of speech and expression, IFF wrote to MoHFW and submitted our detailed comments on the Rules. **Important documents** 1. IFF’s consultation response on the Draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 ([link](https://drive.google.com/file/d/1X0-fhBVD4d8nzGTyOZmEquez18Aj-GZA/view?usp=drive_link)) 2. Draft Cigarette and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2024 ([link](https://drive.google.com/file/d/1WBmlJ0ADcd9_KorjuBBcf7vHAj_N6MLH/view?usp=sharing)) 3. Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 ([link](https://ntcp.mohfw.gov.in/assets/document/Cigarettes%20and%20other%20Tobacco%20Products%20(Prohibition%20of%20Advertisement%20and%20Regulation%20of%20Trade%20and%20Commerce,%20Production,%20Supply%20and%20Distribution)%20Amendment%20Rules,%202023.pdf)) **Background** In May 2023, MoHFW introduced the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 (“2023 COTPA Amendment Rules”), which introduced Rule 11 to the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Rules, 2004. Rule 11 of the 2023 COTPA Amendment Rules requires publishers of online curated content displaying tobacco products or their use to show anti-tobacco health spots for at least thirty seconds, warning messages at the bottom of the screen during any display of tobacco products, and audio-visual disclaimers of a minimum of twenty-second duration. The 2024 draft COTPA Amendment Rules has proposed modifications to Rule 11 and now requires the display of non-skippable anti-tobacco health spots and audio-visual disclaimers upon opening the platforms of the publishers of the online curated content, ie., OTT platforms. The requirement for static anti-tobacco warnings at the bottom of the screen during the period of display of the tobacco products has been retained in the draft COTPA Amendment Rules from the erstwhile Rule 11. Additionally, the draft COTPA Amendment Rules also introduced a new sub-rule which mandates the display of anti-tobacco health spots, anti-tobacco static message at the bottom of the screen during the period of display of the tobacco products or their use in the and audio-visual disclaimers in all films published on OTT platforms. **Our Submissions** 1. **Jurisdictional Conflict** The draft COTPA Amendment Rules have been released by the MoHFW. Section 31 of the Cigarettes and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Act, 2003 (“COTPA Act”) empowers the Union Government to make rules on anti-tobacco warnings, however, the draft COTPA Amendment Rules directly regulate OTT platforms and their published content. As per Rule 8, Part III of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, publishers of online curated content will be administered by the Ministry of Information Broadcasting (“MIB”). This is further confirmed by the [Government of India (Allocation of Business) Rules, 1961](https://cabsec.gov.in/allocationofbusinessrules/completeaobrules/) which provides that “*Films and Audio-Visual programmes/content made available by online content providers/publishers*” fall under the purview of MIB*.* The draft COTPA Amendment Rules have bypassed the nodal ministry for OTT platforms and have legislated upon areas that do not fall under their executive preview. MoHFW has overreached the limits of its powers by seeking to govern OTT platforms by infringing on the jurisdiction of another ministry which must be remedied. 1. **Negative impact on freedom of speech and expression** The introduction of the draft COTPA Amendment Rules may have a chilling effect on critical depiction of societal ills in the context of lifestyle choices, thus infringing on the right to freedom of speech and expression of the individual involved in the making of the content in question. Requiring films and other content to include non-skippable 30-second anti-tobacco health spots and warnings during the display of tobacco use are stringent requirements that impact the creative freedom of artists. These requirements are also inherently judgemental of certain lifestyle choices and are patronizing towards individuals consuming content on OTT platforms. We believe, therefore, that the draft COTPA Amendment Rules, can have adverse consequences on the constitutional and cultural rights of the citizens of India, especially their right to the freedom of speech and expression. This right extends to both, the creator of the content as well as the audience, whose artistic freedom and right to receive information are being interfered with respectively. 1. **Non-efficacy of tobacco warning health spots** [Initial research](https://www.koanadvisory.com/storage/2023/05/Tobacco-Disclaimers-Report_Koan.pdf) on the effectiveness of pictorial and threatening warnings (“PTW”) associated with tobacco on OTT platforms suggest that such warnings may have limited, if any, effect on people’s intention to quit or reduce cigarette consumption, and that the effect fades over time. Viewers also feel that the need for additional text disclaimers is “unwarranted”. A judgment in the case of *Tobacco Institute of India v. Union of India* states that rules mandating cigarette manufacturers to show a health warning on 85% of the cigarette packaging as well as text stating “smoking causes cancer” are found “unscientific and disproportionate”. 1. **Regulation of OTT platforms** The draft COTPA Amendment Rules do not take into account the unique nature of OTT platforms and streaming services. These rules have blindly imported requirements for tobacco warnings in theatres to OTT platforms without considering key differences between the same. While discouraging the use of tobacco products is a legitimate state aim, it may be worth considering if online streaming services are the right avenue for implementing this aim, given their inaccessibility due to access or economic constraints. The Kerala High Court in the case of *Peggy Fen vs Central Board Of Film Certification* *\\[2022 SCC Online Ker 785\\]* stated that - “*There is no compelled viewing of this movie. The OTT platform cannot be treated as a captive audience who are forced to watch the movie.*” Thus, the distinct nature of OTT platforms and their audience must also be considered before introducing such regulatory burdens on publishers and platforms. For instance, the draft COTPA Amendment Rules do not consider the fact that viewers tend to binge-watch content on OTT platforms and that these non-skippable tobacco health spots would be displayed before every single episode/content block and hence viewers will be subjected to repeated ads during a given viewing session. Further, viewers often consume content on OTT platforms using small-screen personal devices. Cramming static tobacco warnings into small smartphone screens could significantly ruin the viewer experience. Lastly, the draft COTPA Amendment Rules do not specify the language in which the tobacco health spots are to be shown in. Given that OTT platforms host content in a bevy of languages, it would be unrealistic to customise the health spots for every single language that is available on OTT platforms. 1. **Impact on EoDB and the Indian Economy** The stringent requirements imposed on OTT platforms through the draft COTPA Amendment Rules could significantly impact the EoDB of OTT platforms and hamper the growth of the OTT industry in the country. India is uniquely positioned to experience an OTT and internet boom in the near future. As per a recent [report](https://www.trai.gov.in/sites/default/files/QPIR_04072024_0.pdf) by the Telecom Regulatory Authority of India, the total number of internet subscribers increased from 936.16 million at the end of December 2023 to 954.40 million at the end of March 2024, registering a quarterly rate of growth of 1.95%. With a growing penetration of internet users, India is uniquely positioned as an attractive market for OTT video/streaming services. Revenue of the Indian video OTT market is [set to double](https://www.ibef.org/industry/media-entertainment-india) from US$ 1.8 billion in 2022 to US$ 3.5 billion by 2027.​ The growth of this sector and the revenue generated from the same could be a huge boost to the Indian economy. However, compliance requirements such as the draft COTPA Amendment Rules would likely be viewed as huge regulatory hurdles by OTT platforms and as a deterrent to EoDB. In order to implement the draft COTPA Amendment Rules, unlike other mediums such as theatres and TV, OTT platforms have to go back and edit hours and hours of content to include the tobacco health spots. The impact which these health spots would have on the viewing experience is also not likely to be taken kindly by the OTT industry. The draft COTPA Amendment Rules also require the display of a non-skippable audio-visual disclaimer on the ill effects of tobacco use, for a minimum of twenty seconds upon opening the OTT platforms. Such a requirement would have a deep impact on the carefully curated and researched consumer experience crafted by OTT platforms. In the wake of the Cigarettes and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules, 2023 dated 31 May, 2023, OTT platforms are already planning to adopt [legal challenges](https://www.reuters.com/world/india/netflix-disney-amazon-challenge-indias-tobacco-rules-streaming-sources-2023-06-02/) to fight the requirements for tobacco warnings on streaming platforms. If these regulatory hurdles prove to be too cumbersome for OTT platforms, then we might be looking at a situation where they restrict their involvement in the Indian market. Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "You know, this advertisement doesn’t really deter the smokers. It just reminds them to smoke after the movie or in break. If you really want to deter the smokers, show them the hospital bills that likes of Mukesh have incurred. But wait, then it could showcase government’s inability to control prices of medical treatments. Only way is to educate and let people make the choice. Also, increase rehab facility and make addicts welcome. Thank you! Please get rid of this nonsense What societal Taboo & Stigma? How do you remove these associated with rehabs? Within general public if someone goes to rehab for solving addiction problems, the person is looked down like a criminal. For whole life this one thing sticks to his identity. I have a relative who was addicted to cigarettes & alcohol in young age. He went to rehab, got deaddicted & started leaving normal life by age of 35. Got married by 40ish. But when talking about that person, his addiction & rehabs gets talked more. Gore doesnt really deter people Make the ads more about people missing out on good experiences and happy moments in life due to smoking and it might work Nobody really pata attention to this nonsense before a movie. Here in Australia the government has put 75% tax on the cigarettes and tobacco, a $40 cigarette pack has $30 tax, there is complete ban on any kind of tobacco/cigarette advertisement since 1992, cigarettes and tobacco can be purchased from supermarkets, fuels stations but only at request, they are hidden. The title is straight up threat. Government won’t make a good plan or even consider to phase out tobacco entirely (because tobacco tax money) but will shove their fake-concern ads everywhere they can. Why do more work when less work do work This seem to be a non urgent issue. There were data breaches after data breaches. Are you folks doing anything for that? OTT everyday turns into what Cable TV was, just with a slicker UI and on-demand availability but with 10 times the price. In a few years, a new platform will come providing what OTT had in the initial days - no regulations, no Advertisements, and dirt cheap prices. And then the cycle continues. I've been thinking about thes ads and i have an idea- why not fight fire with fire? Rather than explaining I'll get straight to an example pitch- \\*start\\* the ad starts of with actor behind the scenes in a smoking ad acting in out and and then \"cut! great job,\" is seen going back home, spending time eating healthy in a nice a\\*\\* home, going to gym working out like hell, hanging out with friends and at last rejecting a packet of cigarettes when offered one at a party, they then turn towards the camera and have flashbacks of the ad they acted on that day with the exact lines reiterated (maybe line could be - hum cool he kyuki hum iss brand ki smoke karte he) and then end ad with a catchy anti smoking ad picking up from the same sentence that was iterated previously. I believe something like this could actually work way better... The only solution is to ban all tobacco products like in Singapore"
}