{
    "id": "145eef5",
    "title": "What happened to the whistleblower Para SF officer who exposed the fake encounters in Manipur by the Indian Army?",
    "url": "https://www.reddit.com/r/india/comments/145eef5/what_happened_to_the_whistleblower_para_sf/",
    "selftext": "The court stated that in order to save the image of the army, the media should not report further on this high-profile case. But is anybody aware of what happened?\n\n&#x200B;\n\n> Lt.Col. Dharamveer revealed as to how the CISU was behind the killing of Manipuri youths namely Phijam- Naobli, R.K. Ronenland Th. Prem in March 2010.  \n>  \n>They were picked up and subjected to heavy torture and shot behind the Unit Mess and their bodies were dumped in the jungles in Karbi Anlong in nearby Assam. He added how in the same year – 2010 – then Major SanjenbamNector had ventured into Shillong and had abducted Thangjam Satish and a friend of his, transported them to Massimpur, shot them dead and had their bodies buried there.  \n>  \n>He also revealed as to how the same CISU had in August 2011 taken into custody Gurumayum Jitshwar Sharma aka Gypsy, then Assistant Publicity Secretary of the proscribed Revolutionary People’s Front (RPF), the political wing of the People’s Liberation Army. After having held him in custody and having demanded Rs. 1crore in ransom money from his family, he was killed. He had also revealed how the same unit had abducted a Manipuri woman with a child and had released her after receiving a sum of Rs.1crore as ransom money.\n\nThe accused lady officer, Major Rubina Kaur Keer, was later involved in another alleged botched operation and had received gallantry award for this one. However, karma caught on her and recently, she was cashiered from army after she was caught having illicit relationship with a married Para SF officer Major Manish Kumar. The wife of Major Manish Kumar, pregnant with his child, had filed the complaint and provided a video recording of the officers in the \"act\" following which both were cashiered with the male officer receiving three years rigorous imprisonment.\n\n&#x200B;\n\nSource: [https://www.thestatesman.com/supplements/north/cries-for-justice-1502717039.html](https://www.thestatesman.com/supplements/north/cries-for-justice-1502717039.html)\n\n[https://theprint.in/defence/soldier-who-went-on-to-become-indian-army-officer-is-now-up-against-his-own-elite-unit/96688/](https://theprint.in/defence/soldier-who-went-on-to-become-indian-army-officer-is-now-up-against-his-own-elite-unit/96688/)\n\n[https://www.casemine.com/judgement/in/5e95554a894ef22c5567da6b](https://www.casemine.com/judgement/in/5e95554a894ef22c5567da6b)\n\n[https://timesofindia.indiatimes.com/india/woman-army-officer-involved-in-botched-intel-op-faces-sack/articleshow/24064025.cms](https://timesofindia.indiatimes.com/india/woman-army-officer-involved-in-botched-intel-op-faces-sack/articleshow/24064025.cms)\n\n[https://www.tribuneindia.com/news/nation/aft-upholds-conviction-of-two-majors-for-illicit-relationship-says-good-character-expected-from-army-officer-436251](https://www.tribuneindia.com/news/nation/aft-upholds-conviction-of-two-majors-for-illicit-relationship-says-good-character-expected-from-army-officer-436251)\n\nMods: please suggest an appropriate flair for this.",
    "flair": "Crime",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1686338959.0,
    "convurl": "https://external-preview.redd.it/nFpNavKyUbR2k8xb9-S0VCCGuIlhoOBzcGxWG11VQE4.jpg?auto=webp&v=enabled&s=1b94047a5c75c9cbea1e4e0c98a6fdac182aff28",
    "comments": [],
    "cleaned_text": "happened whistleblower para sf officer exposed fake encounters manipur indian army court stated order save image army media report highprofile case anybody aware happened xb ltcol dharamveer revealed cisu behind killing manipuri youths namely phijam naobli rk ronenland th prem march picked subjected heavy torture shot behind unit mess bodies dumped jungles karbi anlong nearby assam added year major sanjenbamnector ventured shillong abducted thangjam satish friend transported massimpur shot dead bodies buried also revealed cisu august taken custody gurumayum jitshwar sharma aka gypsy assistant publicity secretary proscribed revolutionary peoples front rpf political wing peoples liberation army held custody demanded rs crore ransom money family killed also revealed unit abducted manipuri woman child released receiving sum rscrore ransom money accused lady officer major rubina kaur keer later involved another alleged botched operation received gallantry award one however karma caught recently cashiered army caught illicit relationship married para sf officer major manish kumar wife major manish kumar pregnant child filed complaint provided video recording officers act following cashiered male officer receiving three years rigorous imprisonment xb source httpswwwthestatesmancomsupplementsnorthcriesforjusticehtmlhttpswwwthestatesmancomsupplementsnorthcriesforjusticehtml httpstheprintindefencesoldierwhowentontobecomeindianarmyofficerisnowupagainsthisowneliteunithttpstheprintindefencesoldierwhowentontobecomeindianarmyofficerisnowupagainsthisowneliteunit httpswwwcaseminecomjudgementineaefcdabhttpswwwcaseminecomjudgementineaefcdab httpstimesofindiaindiatimescomindiawomanarmyofficerinvolvedinbotchedintelopfacessackarticleshowcmshttpstimesofindiaindiatimescomindiawomanarmyofficerinvolvedinbotchedintelopfacessackarticleshowcms httpswwwtribuneindiacomnewsnationaftupholdsconvictionoftwomajorsforillicitrelationshipsaysgoodcharacterexpectedfromarmyofficerhttpswwwtribuneindiacomnewsnationaftupholdsconvictionoftwomajorsforillicitrelationshipsaysgoodcharacterexpectedfromarmyofficer mods please suggest appropriate flair ",
    "cleaned_title": "happened whistleblower para sf officer exposed fake encounters manipur indian army",
    "cleaned_selftext": "court stated order save image army media report highprofile case anybody aware happened xb ltcol dharamveer revealed cisu behind killing manipuri youths namely phijam naobli rk ronenland th prem march picked subjected heavy torture shot behind unit mess bodies dumped jungles karbi anlong nearby assam added year major sanjenbamnector ventured shillong abducted thangjam satish friend transported massimpur shot dead bodies buried also revealed cisu august taken custody gurumayum jitshwar sharma aka gypsy assistant publicity secretary proscribed revolutionary peoples front rpf political wing peoples liberation army held custody demanded rs crore ransom money family killed also revealed unit abducted manipuri woman child released receiving sum rscrore ransom money accused lady officer major rubina kaur keer later involved another alleged botched operation received gallantry award one however karma caught recently cashiered army caught illicit relationship married para sf officer major manish kumar wife major manish kumar pregnant child filed complaint provided video recording officers act following cashiered male officer receiving three years rigorous imprisonment xb source httpswwwthestatesmancomsupplementsnorthcriesforjusticehtmlhttpswwwthestatesmancomsupplementsnorthcriesforjusticehtml httpstheprintindefencesoldierwhowentontobecomeindianarmyofficerisnowupagainsthisowneliteunithttpstheprintindefencesoldierwhowentontobecomeindianarmyofficerisnowupagainsthisowneliteunit httpswwwcaseminecomjudgementineaefcdabhttpswwwcaseminecomjudgementineaefcdab httpstimesofindiaindiatimescomindiawomanarmyofficerinvolvedinbotchedintelopfacessackarticleshowcmshttpstimesofindiaindiatimescomindiawomanarmyofficerinvolvedinbotchedintelopfacessackarticleshowcms httpswwwtribuneindiacomnewsnationaftupholdsconvictionoftwomajorsforillicitrelationshipsaysgoodcharacterexpectedfromarmyofficerhttpswwwtribuneindiacomnewsnationaftupholdsconvictionoftwomajorsforillicitrelationshipsaysgoodcharacterexpectedfromarmyofficer mods please suggest appropriate flair",
    "cleaned_comments": "",
    "light_cleaned_title": "What happened to the whistleblower Para SF officer who exposed the fake encounters in Manipur by the Indian Army?",
    "light_cleaned_selftext": "The court stated that in order to save the image of the army, the media should not report further on this high-profile case. But is anybody aware of what happened? &#x200B; > Lt.Col. Dharamveer revealed as to how the CISU was behind the killing of Manipuri youths namely Phijam- Naobli, R.K. Ronenland Th. Prem in March 2010. > >They were picked up and subjected to heavy torture and shot behind the Unit Mess and their bodies were dumped in the jungles in Karbi Anlong in nearby Assam. He added how in the same year – 2010 – then Major SanjenbamNector had ventured into Shillong and had abducted Thangjam Satish and a friend of his, transported them to Massimpur, shot them dead and had their bodies buried there. > >He also revealed as to how the same CISU had in August 2011 taken into custody Gurumayum Jitshwar Sharma aka Gypsy, then Assistant Publicity Secretary of the proscribed Revolutionary People’s Front (RPF), the political wing of the People’s Liberation Army. After having held him in custody and having demanded Rs. 1crore in ransom money from his family, he was killed. He had also revealed how the same unit had abducted a Manipuri woman with a child and had released her after receiving a sum of Rs.1crore as ransom money. The accused lady officer, Major Rubina Kaur Keer, was later involved in another alleged botched operation and had received gallantry award for this one. However, karma caught on her and recently, she was cashiered from army after she was caught having illicit relationship with a married Para SF officer Major Manish Kumar. The wife of Major Manish Kumar, pregnant with his child, had filed the complaint and provided a video recording of the officers in the \"act\" following which both were cashiered with the male officer receiving three years rigorous imprisonment. &#x200B; Source: [https://www.thestatesman.com/supplements/north/cries-for-justice-1502717039.html](https://www.thestatesman.com/supplements/north/cries-for-justice-1502717039.html) [https://theprint.in/defence/soldier-who-went-on-to-become-indian-army-officer-is-now-up-against-his-own-elite-unit/96688/](https://theprint.in/defence/soldier-who-went-on-to-become-indian-army-officer-is-now-up-against-his-own-elite-unit/96688/) [https://www.casemine.com/judgement/in/5e95554a894ef22c5567da6b](https://www.casemine.com/judgement/in/5e95554a894ef22c5567da6b) [https://timesofindia.indiatimes.com/india/woman-army-officer-involved-in-botched-intel-op-faces-sack/articleshow/24064025.cms](https://timesofindia.indiatimes.com/india/woman-army-officer-involved-in-botched-intel-op-faces-sack/articleshow/24064025.cms) [https://www.tribuneindia.com/news/nation/aft-upholds-conviction-of-two-majors-for-illicit-relationship-says-good-character-expected-from-army-officer-436251](https://www.tribuneindia.com/news/nation/aft-upholds-conviction-of-two-majors-for-illicit-relationship-says-good-character-expected-from-army-officer-436251) Mods: please suggest an appropriate flair for this.",
    "light_cleaned_comments": ""
}