{
    "id": "1hlueme",
    "title": "What is the logic of removing public access to cctv and web telecast of electorial process",
    "url": "https://www.thehindu.com/news/national/why-are-activists-opposing-ecs-election-rule-amendment-explained/article69024277.ece",
    "selftext": "I came across this news in a shock. Isn't it a threat to the transparency of electorial process. ",
    "flair": "Policy/Economy",
    "score": 58,
    "num_comments": 12,
    "created_utc": 1735103948.0,
    "convurl": "https://external-preview.redd.it/h9gYRES-bS4yhqo94lHXtNx056vkUq6MEuSYN6U2Sfo.jpg?auto=webp&s=c017eb4eb0240097b49f9eca53aee7dfc13afc5e",
    "comments": [
        "Russia style democracy at work.  Move on.",
        "Transparency? Wait till there is only one option on the ballot. \n\nRevolution!!!",
        ">What is the logic of removing public access to cctv and web telecast of electorial process \n\nWhat is the logic of having elections when everyone knows that Supreme Leader is the most popular leader?",
        "So that elections like chadigarh can be easily repeated",
        ">Wait till there is only one option on the ballot\n\nThat happened in a couple of constituencies recently, IIRC.\n\nBetter thing to say would be: \"Wait till when the opponent falls out of a window the day before the election\" or \"Wait till when the opponent dies because of poisoning in a cafe just before the election\".",
        "Tab ghapla karna easy hoga simple",
        "😅",
        "Move on to where? No choice whatsoever.",
        "27% fake votes registered in some booths lately..",
        "Just testing waters, level is very low but still need to identify the alligators.",
        "So that when one's caught cheating it's not openly available  for public consumption 🤷‍♂️\n\nhttps://preview.redd.it/5qtd3eb7qx8e1.jpeg?width=706&format=pjpg&auto=webp&s=33c2687d21cffd047c4de00299ecee1d5dd0b2c4",
        "According to an article in IE, the video was never available but the ambiguity in the wordings of the rule meant that people came asking around for it. The amendment just specifies that it is not available.   \nTldr: nothing new only specified the ground reality."
    ],
    "cleaned_text": "logic removing public access cctv web telecast electorial process came across news shock isnt threat transparency electorial process ",
    "cleaned_title": "logic removing public access cctv web telecast electorial process",
    "cleaned_selftext": "came across news shock isnt threat transparency electorial process",
    "cleaned_comments": "russia style democracy work move transparency wait till one option ballot revolution logic removing public access cctv web telecast electorial process logic elections everyone knows supreme leader popular leader elections like chadigarh easily repeated wait till one option ballot happened couple constituencies recently iirc better thing say would wait till opponent falls window day election wait till opponent dies poisoning cafe election tab ghapla karna easy hoga simple move choice whatsoever fake votes registered booths lately testing waters level low still need identify alligators ones caught cheating openly available public consumption according article ie video never available ambiguity wordings rule meant people came asking around amendment specifies available tldr nothing new specified ground reality",
    "light_cleaned_title": "What is the logic of removing public access to cctv and web telecast of electorial process",
    "light_cleaned_selftext": "I came across this news in a shock. Isn't it a threat to the transparency of electorial process.",
    "light_cleaned_comments": "Russia style democracy at work. Move on. Transparency? Wait till there is only one option on the ballot. Revolution!!! >What is the logic of removing public access to cctv and web telecast of electorial process What is the logic of having elections when everyone knows that Supreme Leader is the most popular leader? So that elections like chadigarh can be easily repeated >Wait till there is only one option on the ballot That happened in a couple of constituencies recently, IIRC. Better thing to say would be: \"Wait till when the opponent falls out of a window the day before the election\" or \"Wait till when the opponent dies because of poisoning in a cafe just before the election\". Tab ghapla karna easy hoga simple 😅 Move on to where? No choice whatsoever. 27% fake votes registered in some booths lately.. Just testing waters, level is very low but still need to identify the alligators. So that when one's caught cheating it's not openly available for public consumption 🤷‍♂️ According to an article in IE, the video was never available but the ambiguity in the wordings of the rule meant that people came asking around for it. The amendment just specifies that it is not available. Tldr: nothing new only specified the ground reality."
}