{
    "id": "1hd6x84",
    "title": "Cash-for-job scam: SC grants future bail to former WB min Partha Chatterjee | India News - Business Standard",
    "url": "https://www.business-standard.com/india-news/cash-for-job-scam-sc-grants-future-bail-to-former-wb-min-partha-chatterjee-124121300279_1.html",
    "selftext": "The top court said upon his release Chatterjee shall not hold any public office but can continue as MLA.\n\nThe bench said that a suspect cannot be detained indefinitely and, therefore, it has to balance the rights of the accused and the victims.\n\nOn December 4, the top court had reserved its verdict on his bail plea and told him that, \"On the face of it you are a corrupt person. Crores of rupees were recovered from your premises.\"",
    "flair": "Law & Courts",
    "score": 7,
    "num_comments": 0,
    "created_utc": 1734073980.0,
    "convurl": "https://external-preview.redd.it/Zze5LIVBwStDPfOImwwY_sS2pa5OQVoSTwEjBTUnZRs.jpg?auto=webp&s=915cc7b65834e2dcb7112014838ac470ffe00a34",
    "comments": [],
    "cleaned_text": "cashforjob scam sc grants future bail former wb min partha chatterjee india news business standard top court said upon release chatterjee shall hold public office continue mla bench said suspect detained indefinitely therefore balance rights accused victims december top court reserved verdict bail plea told face corrupt person crores rupees recovered premises ",
    "cleaned_title": "cashforjob scam sc grants future bail former wb min partha chatterjee india news business standard",
    "cleaned_selftext": "top court said upon release chatterjee shall hold public office continue mla bench said suspect detained indefinitely therefore balance rights accused victims december top court reserved verdict bail plea told face corrupt person crores rupees recovered premises",
    "cleaned_comments": "",
    "light_cleaned_title": "Cash-for-job scam: SC grants future bail to former WB min Partha Chatterjee | India News - Business Standard",
    "light_cleaned_selftext": "The top court said upon his release Chatterjee shall not hold any public office but can continue as MLA. The bench said that a suspect cannot be detained indefinitely and, therefore, it has to balance the rights of the accused and the victims. On December 4, the top court had reserved its verdict on his bail plea and told him that, \"On the face of it you are a corrupt person. Crores of rupees were recovered from your premises.\"",
    "light_cleaned_comments": ""
}