{
    "id": "158qdq6",
    "title": "Most people don't know what an MLA exactly can and can't do?",
    "url": "https://www.reddit.com/r/india/comments/158qdq6/most_people_dont_know_what_an_mla_exactly_can_and/",
    "selftext": "Dr. [Jaya Prakash Narayana](https://en.wikipedia.org/wiki/Jaya_Prakash_Narayana) is a former IAS officer and renowned activist from Andhra Pradesh/Telangana.  He  started Lok Satta Party (State party) and got elected as MLA some time back and lost in second term.  \n\n\nHe's is famous amongst youth for his sincerity, intellect  and oratory skills. But when he lost many accused him of not doing much for the the constituency. I remember having high hopes on him and was disappointed that he lost the second term and was a bit upset that he didn't prove himself. That's when I got to know the actually function of an MLA. As simple as it sounds I feel most people don't know the responsibilities of an MLA. While searching I found this article that tells a bit more on the topic.  \n[https://www.thebetterindia.com/141674/mla-roles-responsibilities-karnataka/](https://www.thebetterindia.com/141674/mla-roles-responsibilities-karnataka/)  \nEven though it doesn't exactly tells what and MLA can and can't do, it's a good start.\n\nPlease feel free to correct me or add more in the comments. I just feel sad how unaware many of us are.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690240282.0,
    "convurl": "https://external-preview.redd.it/qdb768O_yKtkFu6wcyH6Cwsa30ltyYE4pn_T6h5J4Vo.jpg?auto=webp&s=a9230c7bbea6956740728b7f8912302d6aa78007",
    "comments": [
        "any official document (govt website) that mentions duties, powers of an MLA?",
        "Spot on OP. There are two segments of people in our society\n\n* One who simply don't know who their local corporator or MLA is\n\n* The other who gives undue importance to these elected leaders. Tries to bribe or petition them for smallest of favors \n\nThe middle ground is missing. And hence most elected representatives tend to misuse the powers vested in them.",
        "Articles 168-177 of the Indian Constitution",
        "MP/MLAs have no executive powers unless they're ministers. This is one of reasons why Bahubali win, because they've unofficial executive powers through Goondas; and other old fucks win because they've connections to intimidate the officials.\n\nNo one gives a fuck whether they're attending the assembly, asking the questions, raising the issues, voting for/against which bills etc.\n\nLot of problems can be fixed if Indians are more socio-politically aware and have basic understanding of the structure of our government."
    ],
    "cleaned_text": "people dont know mla exactly cant dr jaya prakash narayanahttpsenwikipediaorgwikijayaprakashnarayana former ias officer renowned activist andhra pradeshtelangana started lok satta party state party got elected mla time back lost second term hes famous amongst youth sincerity intellect oratory skills lost many accused much constituency remember high hopes disappointed lost second term bit upset didnt prove thats got know actually function mla simple sounds feel people dont know responsibilities mla searching found article tells bit topic httpswwwthebetterindiacommlarolesresponsibilitieskarnatakahttpswwwthebetterindiacommlarolesresponsibilitieskarnataka even though doesnt exactly tells mla cant good start please feel free correct add comments feel sad unaware many us ",
    "cleaned_title": "people dont know mla exactly cant",
    "cleaned_selftext": "dr jaya prakash narayanahttpsenwikipediaorgwikijayaprakashnarayana former ias officer renowned activist andhra pradeshtelangana started lok satta party state party got elected mla time back lost second term hes famous amongst youth sincerity intellect oratory skills lost many accused much constituency remember high hopes disappointed lost second term bit upset didnt prove thats got know actually function mla simple sounds feel people dont know responsibilities mla searching found article tells bit topic httpswwwthebetterindiacommlarolesresponsibilitieskarnatakahttpswwwthebetterindiacommlarolesresponsibilitieskarnataka even though doesnt exactly tells mla cant good start please feel free correct add comments feel sad unaware many us",
    "cleaned_comments": "official document govt website mentions duties powers mla spot op two segments people society one simply dont know local corporator mla gives undue importance elected leaders tries bribe petition smallest favors middle ground missing hence elected representatives tend misuse powers vested articles indian constitution mpmlas executive powers unless theyre ministers one reasons bahubali win theyve unofficial executive powers goondas old fucks win theyve connections intimidate officials one gives fuck whether theyre attending assembly asking questions raising issues voting foragainst bills etc lot problems fixed indians sociopolitically aware basic understanding structure government",
    "light_cleaned_title": "Most people don't know what an MLA exactly can and can't do?",
    "light_cleaned_selftext": "Dr. [Jaya Prakash Narayana](https://en.wikipedia.org/wiki/Jaya_Prakash_Narayana) is a former IAS officer and renowned activist from Andhra Pradesh/Telangana. He started Lok Satta Party (State party) and got elected as MLA some time back and lost in second term. He's is famous amongst youth for his sincerity, intellect and oratory skills. But when he lost many accused him of not doing much for the the constituency. I remember having high hopes on him and was disappointed that he lost the second term and was a bit upset that he didn't prove himself. That's when I got to know the actually function of an MLA. As simple as it sounds I feel most people don't know the responsibilities of an MLA. While searching I found this article that tells a bit more on the topic. [https://www.thebetterindia.com/141674/mla-roles-responsibilities-karnataka/](https://www.thebetterindia.com/141674/mla-roles-responsibilities-karnataka/) Even though it doesn't exactly tells what and MLA can and can't do, it's a good start. Please feel free to correct me or add more in the comments. I just feel sad how unaware many of us are.",
    "light_cleaned_comments": "any official document (govt website) that mentions duties, powers of an MLA? Spot on OP. There are two segments of people in our society * One who simply don't know who their local corporator or MLA is * The other who gives undue importance to these elected leaders. Tries to bribe or petition them for smallest of favors The middle ground is missing. And hence most elected representatives tend to misuse the powers vested in them. Articles 168-177 of the Indian Constitution MP/MLAs have no executive powers unless they're ministers. This is one of reasons why Bahubali win, because they've unofficial executive powers through Goondas; and other old fucks win because they've connections to intimidate the officials. No one gives a fuck whether they're attending the assembly, asking the questions, raising the issues, voting for/against which bills etc. Lot of problems can be fixed if Indians are more socio-politically aware and have basic understanding of the structure of our government."
}