{
    "id": "1ewqfbj",
    "title": "Capital Punishments",
    "url": "https://www.reddit.com/r/india/comments/1ewqfbj/capital_punishments/",
    "selftext": "I am so damn angry with all what is happening in our country.. what women have to suffer in our country on day to day basis boils my blood.. \neven after all the rage after the kolkata heinous crime, this video again proves that some dumbfucks are so mentally retarted and ill that only capital punishments for any offense again st women can only be a start.. what is more pressing is PM of country speaks on our indep day that we have to do something and we can not tolerate etc and you are the leader and sound so helpless instead of making an action plan...how can it not anger all the people who are in power and have daughters or it is that it doesn't affect them because they know nothing can happen to they children...\n\nI have been thinking about solutions as an individual what we can do and definitely can not be just at mercy of these politicians who think themselves of some royalty or kings and mad in power. Only solution which i feel is people with strong will to enter politics which on ground level seems so difficult as an individual but if as a community there can be a start. Again everything is driven from money and to bring them on their knees that cab be one of the toold as community.\n\nIdea - If we build an app where we we make a community of people and it is need to be kinda kyc done with all proofs while on face anyone can be anonymous and if we all contribute a fixed monthly amount. In case of any mis happening with any one in the group those funds will be used to support then with legal help, protection through private security if needed,PR on social media in country and international so that it reaches to masses and other support as needed. Even if there are 100000 people who contribute 100 it is 1crore a month. But more then that we will be aware of what is happening in that one big community or in surrounding of that as we only come across on the viral incidents on social media but not all of them. Let know your thoughts on this ?[\n\nAgra incident](https://x.com/shivaroor/status/1825770372345536546?)",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1724142938.0,
    "convurl": "https://external-preview.redd.it/-tQKwg1LSK5XmmyMknkPDb4K7hOraQn6y4MXyQr3k8U.jpg?auto=webp&s=d4488dc72b06a78c5fb1e33b4eca5d73654bb1dd",
    "comments": [
        "So, insurance for anything that could happen to you due to the increasing danger and difficulties of life in India? It’s not a bad idea, but we need to ask why we require such a thing in the first place. What you're proposing is a mitigation strategy. We pay a significant amount in taxes, so the real question should be why we continue to pay when it seems like we’re getting nothing in return, especially if we have to spend even more on an insurance scheme like the one you’ve suggested.",
        "Totally agree that why we have to pay for our right to even live peacefully but being realistic we are loving far from the ideal world… My family members safety is most important for thing for me and some how if money can ensure that my first preference would be to spend it there and somewhere we have to start for a change… it is like insurance but long term vision is to build a community of change makers…\n\nOn tax front my idea was we can set up a trust or something where donations are expempted in income tax or for the sake of it can even create a political party so 100% exemption."
    ],
    "cleaned_text": "capital punishments damn angry happening country women suffer country day day basis boils blood even rage kolkata heinous crime video proves dumbfucks mentally retarted ill capital punishments offense st women start pressing pm country speaks indep day something tolerate etc leader sound helpless instead making action planhow anger people power daughters doesnt affect know nothing happen children thinking solutions individual definitely mercy politicians think royalty kings mad power solution feel people strong enter politics ground level seems difficult individual community start everything driven money bring knees cab one toold community idea build app make community people need kinda kyc done proofs face anyone anonymous contribute fixed monthly amount case mis happening one group funds used support legal help protection private security neededpr social media country international reaches masses support needed even people contribute crore month aware happening one big community surrounding come across viral incidents social media let know thoughts agra incidenthttpsxcomshivaroorstatus ",
    "cleaned_title": "capital punishments",
    "cleaned_selftext": "damn angry happening country women suffer country day day basis boils blood even rage kolkata heinous crime video proves dumbfucks mentally retarted ill capital punishments offense st women start pressing pm country speaks indep day something tolerate etc leader sound helpless instead making action planhow anger people power daughters doesnt affect know nothing happen children thinking solutions individual definitely mercy politicians think royalty kings mad power solution feel people strong enter politics ground level seems difficult individual community start everything driven money bring knees cab one toold community idea build app make community people need kinda kyc done proofs face anyone anonymous contribute fixed monthly amount case mis happening one group funds used support legal help protection private security neededpr social media country international reaches masses support needed even people contribute crore month aware happening one big community surrounding come across viral incidents social media let know thoughts agra incidenthttpsxcomshivaroorstatus",
    "cleaned_comments": "insurance anything could happen due increasing danger difficulties life india bad idea need ask require thing first place youre proposing mitigation strategy pay significant amount taxes real question continue pay seems like getting nothing return especially spend even insurance scheme like one youve suggested totally agree pay right even live peacefully realistic loving far ideal world family members safety important thing money ensure first preference would spend somewhere start change like insurance long term vision build community change makers tax front idea set trust something donations expempted income tax sake even create political party exemption",
    "light_cleaned_title": "Capital Punishments",
    "light_cleaned_selftext": "I am so damn angry with all what is happening in our country.. what women have to suffer in our country on day to day basis boils my blood.. even after all the rage after the kolkata heinous crime, this video again proves that some dumbfucks are so mentally retarted and ill that only capital punishments for any offense again st women can only be a start.. what is more pressing is PM of country speaks on our indep day that we have to do something and we can not tolerate etc and you are the leader and sound so helpless instead of making an action plan...how can it not anger all the people who are in power and have daughters or it is that it doesn't affect them because they know nothing can happen to they children... I have been thinking about solutions as an individual what we can do and definitely can not be just at mercy of these politicians who think themselves of some royalty or kings and mad in power. Only solution which i feel is people with strong will to enter politics which on ground level seems so difficult as an individual but if as a community there can be a start. Again everything is driven from money and to bring them on their knees that cab be one of the toold as community. Idea - If we build an app where we we make a community of people and it is need to be kinda kyc done with all proofs while on face anyone can be anonymous and if we all contribute a fixed monthly amount. In case of any mis happening with any one in the group those funds will be used to support then with legal help, protection through private security if needed,PR on social media in country and international so that it reaches to masses and other support as needed. Even if there are 100000 people who contribute 100 it is 1crore a month. But more then that we will be aware of what is happening in that one big community or in surrounding of that as we only come across on the viral incidents on social media but not all of them. Let know your thoughts on this ?[ Agra incident](https://x.com/shivaroor/status/1825770372345536546?)",
    "light_cleaned_comments": "So, insurance for anything that could happen to you due to the increasing danger and difficulties of life in India? It’s not a bad idea, but we need to ask why we require such a thing in the first place. What you're proposing is a mitigation strategy. We pay a significant amount in taxes, so the real question should be why we continue to pay when it seems like we’re getting nothing in return, especially if we have to spend even more on an insurance scheme like the one you’ve suggested. Totally agree that why we have to pay for our right to even live peacefully but being realistic we are loving far from the ideal world… My family members safety is most important for thing for me and some how if money can ensure that my first preference would be to spend it there and somewhere we have to start for a change… it is like insurance but long term vision is to build a community of change makers… On tax front my idea was we can set up a trust or something where donations are expempted in income tax or for the sake of it can even create a political party so 100% exemption."
}