{
    "id": "1ev06vi",
    "title": "What is wrong and what can be done? Is the problem ultimately economics?",
    "url": "https://www.reddit.com/gallery/1ev06vi",
    "selftext": "My own content",
    "flair": "Rant / Vent",
    "score": 86,
    "num_comments": 19,
    "created_utc": 1723953202.0,
    "convurl": "https://i.redd.it/nsbc4qvyhcjd1.jpg",
    "comments": [
        "I humbly disagree. If economics, I mean material wealth, is the all-in-one solution for all our problems, including rape, corruptions and even flaunting billions throwing marriage, then people like Musk, Bezos and Amdanis would have been the most honest morally sound people in the world. But the truth is visible to all. Moderate wealth and rampant inequality, as ours may actually help to certain extent, but they are mere patchwork not cure for our problems. We need a morally sound emphatic holistic education system. GOOD EDUCATION is the only solution. ",
        "Religion is involved too much in politics!",
        "Cool pixel art",
        "I beg to differ on the point made for the reasons of corruption. \n\nPoverty/unmet needs is often not the reason for corruption. \n\n  \nIf it was so, the ultra rich have no reasons to be corrupt. \n\nIf you see, the biggest of corruptions are usually perpetrated by the richest of persons. \n\n  \nThe main reason for rape is the twisted sense of patriarchy that exists in many sections of the society. Some men just cannot digest women reaching positions of power. Such men are the problem and they can come from any segment of the society. We need to fight this mindset and break the traditional gender roles/stereotypes.",
        "minimum standard to live vs fuck you money is also different",
        "Regarding short term solution of strong punishments, rape already carries life term and even capital punishment in certain cases. Punishments in law aren't really an issue. The issue is the actual punishment served.\n\nSpeedy justice is also not really a solution, it is an end result of increase in courts and police. And, improving the process for how cases are to be handled.\n\nEveryone asks for the same end result, but rarely people propose the process and changes needed to get to it. Most of the time someone suggests changes, you will find those changes do the opposite.",
        "if people are involved in politics with their biases and affinities and interests ... what not, people carry religion into politics, religion is dead virus without its carriers. This order of power distribution comes back to us \"We the People of India\" and not primarily the religion or say any institution be it economy , caste or anything, we are the host of them and we ourselves tend to intermix according to our preferences",
        "I agree mate…",
        "Everything is wrong and you can't do nothing about it",
        "Politicians don't want you to prosper \n\nIf you prospered \n\nWhat use will the politicians bry",
        "Double negative, you're saying we should do something about it. I agree! The problem is, what?",
        "People are the problem in my country",
        "that I cannot tell you, you should find out for yourself and If you don't see that as a problem then you know what's wrong",
        "There is alot of things wrong with our country and sadly nothing can be done or rather will be done by our politicians. Just be safe on your part and live a quiet life here.",
        "Those in power specially UPSC guys should grow spines, else they need to resign.",
        "we have too many dumb people in this country and smart ones don't do anything about it.",
        "The long term solutions listed are absolutely spot on!",
        "It isn't economics. Japan and South Korea have misogynistic societies which have sexual assaults on a daily basis in their trains and buses(though these are o a much smaller scale than here). The problem is that a large portion of our society is traditional, and tradition is usually misogyny in all cultures."
    ],
    "cleaned_text": "wrong done problem ultimately economics content ",
    "cleaned_title": "wrong done problem ultimately economics",
    "cleaned_selftext": "content",
    "cleaned_comments": "humbly disagree economics mean material wealth allinone solution problems including rape corruptions even flaunting billions throwing marriage people like musk bezos amdanis would honest morally sound people world truth visible moderate wealth rampant inequality may actually help certain extent mere patchwork cure problems need morally sound emphatic holistic education system good education solution religion involved much politics cool pixel art beg differ point made reasons corruption povertyunmet needs often reason corruption ultra rich reasons corrupt see biggest corruptions usually perpetrated richest persons main reason rape twisted sense patriarchy exists many sections society men digest women reaching positions power men problem come segment society need fight mindset break traditional gender rolesstereotypes minimum standard live vs fuck money also different regarding short term solution strong punishments rape already carries life term even capital punishment certain cases punishments law arent really issue issue actual punishment served speedy justice also really solution end result increase courts police improving process cases handled everyone asks end result rarely people propose process changes needed get time someone suggests changes find changes opposite people involved politics biases affinities interests people carry religion politics religion dead virus without carriers order power distribution comes back us people india primarily religion say institution economy caste anything host tend intermix according preferences agree mate everything wrong cant nothing politicians dont want prosper prospered use politicians bry double negative youre saying something agree problem people problem country tell find dont see problem know whats wrong alot things wrong country sadly nothing done rather done politicians safe part live quiet life power specially upsc guys grow spines else need resign many dumb people country smart ones dont anything long term solutions listed absolutely spot isnt economics japan south korea misogynistic societies sexual assaults daily basis trains busesthough much smaller scale problem large portion society traditional tradition usually misogyny cultures",
    "light_cleaned_title": "What is wrong and what can be done? Is the problem ultimately economics?",
    "light_cleaned_selftext": "My own content",
    "light_cleaned_comments": "I humbly disagree. If economics, I mean material wealth, is the all-in-one solution for all our problems, including rape, corruptions and even flaunting billions throwing marriage, then people like Musk, Bezos and Amdanis would have been the most honest morally sound people in the world. But the truth is visible to all. Moderate wealth and rampant inequality, as ours may actually help to certain extent, but they are mere patchwork not cure for our problems. We need a morally sound emphatic holistic education system. GOOD EDUCATION is the only solution. Religion is involved too much in politics! Cool pixel art I beg to differ on the point made for the reasons of corruption. Poverty/unmet needs is often not the reason for corruption. If it was so, the ultra rich have no reasons to be corrupt. If you see, the biggest of corruptions are usually perpetrated by the richest of persons. The main reason for rape is the twisted sense of patriarchy that exists in many sections of the society. Some men just cannot digest women reaching positions of power. Such men are the problem and they can come from any segment of the society. We need to fight this mindset and break the traditional gender roles/stereotypes. minimum standard to live vs fuck you money is also different Regarding short term solution of strong punishments, rape already carries life term and even capital punishment in certain cases. Punishments in law aren't really an issue. The issue is the actual punishment served. Speedy justice is also not really a solution, it is an end result of increase in courts and police. And, improving the process for how cases are to be handled. Everyone asks for the same end result, but rarely people propose the process and changes needed to get to it. Most of the time someone suggests changes, you will find those changes do the opposite. if people are involved in politics with their biases and affinities and interests ... what not, people carry religion into politics, religion is dead virus without its carriers. This order of power distribution comes back to us \"We the People of India\" and not primarily the religion or say any institution be it economy , caste or anything, we are the host of them and we ourselves tend to intermix according to our preferences I agree mate… Everything is wrong and you can't do nothing about it Politicians don't want you to prosper If you prospered What use will the politicians bry Double negative, you're saying we should do something about it. I agree! The problem is, what? People are the problem in my country that I cannot tell you, you should find out for yourself and If you don't see that as a problem then you know what's wrong There is alot of things wrong with our country and sadly nothing can be done or rather will be done by our politicians. Just be safe on your part and live a quiet life here. Those in power specially UPSC guys should grow spines, else they need to resign. we have too many dumb people in this country and smart ones don't do anything about it. The long term solutions listed are absolutely spot on! It isn't economics. Japan and South Korea have misogynistic societies which have sexual assaults on a daily basis in their trains and buses(though these are o a much smaller scale than here). The problem is that a large portion of our society is traditional, and tradition is usually misogyny in all cultures."
}