{
    "id": "19agefv",
    "title": "Indian Food Delivery Aggregator nails it again with their amazing customer \"care\"",
    "url": "https://www.reddit.com/gallery/19agefv",
    "selftext": "So ordered Chicken Schezwan Fried Rice from a restaurant, and got mutton rice. I thought ok, made a mistake, will take it up with them. They asked for a video of the food. Sent video of food. Customer care couldn't \"ascertain\" any difference. Dumb shit. Triggered me instantly and I send mail. Well worded. Full Chat GPT. Amazong folks working there. Best part is, even after I say all of that, nothing would happen. I've even sent a mail saying that brother, get some nice customer relations guy, and they sent me refund for a random order I had placed.",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 6,
    "created_utc": 1705661381.0,
    "convurl": "https://i.redd.it/zqho5fnzmddc1.jpg",
    "comments": [
        "79 for a schezwan is a deal",
        "I don't even understand what this behaviour is! Ok so sorry for mixing it up, here is a part of your money back?",
        "Post it on X(Twitter) tagging Deepinder Goyal and Zomato, and see how the customer support team will come running at you.",
        "That's all we can do nowadays. Shout loud enough for everyone to hear.",
        "I'd rather lick the fucking salt from rocks than ordering from shitmato.",
        "The problem is that all of us keep ordering again after such kind of responses. What I’ve come to realise is that they do refund the entire amount if you insist by saying that you’ll raise a case in consumer forum or post on social media. But, the added mental burden for such a simple task just ruins the entire experience."
    ],
    "cleaned_text": "indian food delivery aggregator nails amazing customer care ordered chicken schezwan fried rice restaurant got mutton rice thought ok made mistake take asked video food sent video food customer care couldnt ascertain difference dumb shit triggered instantly send mail well worded full chat gpt amazong folks working best part even say nothing would happen ive even sent mail saying brother get nice customer relations guy sent refund random order placed ",
    "cleaned_title": "indian food delivery aggregator nails amazing customer care",
    "cleaned_selftext": "ordered chicken schezwan fried rice restaurant got mutton rice thought ok made mistake take asked video food sent video food customer care couldnt ascertain difference dumb shit triggered instantly send mail well worded full chat gpt amazong folks working best part even say nothing would happen ive even sent mail saying brother get nice customer relations guy sent refund random order placed",
    "cleaned_comments": "schezwan deal dont even understand behaviour ok sorry mixing part money back post xtwitter tagging deepinder goyal zomato see customer support team come running thats nowadays shout loud enough everyone hear id rather lick fucking salt rocks ordering shitmato problem us keep ordering kind responses ive come realise refund entire amount insist saying youll raise case consumer forum post social media added mental burden simple task ruins entire experience",
    "light_cleaned_title": "Indian Food Delivery Aggregator nails it again with their amazing customer \"care\"",
    "light_cleaned_selftext": "So ordered Chicken Schezwan Fried Rice from a restaurant, and got mutton rice. I thought ok, made a mistake, will take it up with them. They asked for a video of the food. Sent video of food. Customer care couldn't \"ascertain\" any difference. Dumb shit. Triggered me instantly and I send mail. Well worded. Full Chat GPT. Amazong folks working there. Best part is, even after I say all of that, nothing would happen. I've even sent a mail saying that brother, get some nice customer relations guy, and they sent me refund for a random order I had placed.",
    "light_cleaned_comments": "79 for a schezwan is a deal I don't even understand what this behaviour is! Ok so sorry for mixing it up, here is a part of your money back? Post it on X(Twitter) tagging Deepinder Goyal and Zomato, and see how the customer support team will come running at you. That's all we can do nowadays. Shout loud enough for everyone to hear. I'd rather lick the fucking salt from rocks than ordering from shitmato. The problem is that all of us keep ordering again after such kind of responses. What I’ve come to realise is that they do refund the entire amount if you insist by saying that you’ll raise a case in consumer forum or post on social media. But, the added mental burden for such a simple task just ruins the entire experience."
}