{
    "id": "12ydsl0",
    "title": "The Remorseless Rise of the Modi Cult",
    "url": "https://www.newsclick.in/remorseless-rise-modi-cult",
    "selftext": "Giant hoardings in which the most dominating image is Modi’s, the others are reduced to alter-egos or incidentals, stare down at every passer-by.",
    "flair": "Politics",
    "score": 45,
    "num_comments": 2,
    "created_utc": 1682414077.0,
    "convurl": "https://external-preview.redd.it/DcQwsu__i6zl5kpaVofqKC0_4ZN2vhELVvdghZrPdnE.jpg?auto=webp&v=enabled&s=77ed0813159a4771b3dd86b65f213b14bd16dd7b",
    "comments": [
        ".\n\n>But, the Centre poses questions and demands payment of the amount spent on publicity, only from non-BJP chief ministers.",
        "the use of symbolism at each and every nook and corner was one of the major strategy of nazis. \n\n\nPeople should read about rise of Hitler as well. you'll get to know what is the MO of nazis and how difficult it was to remove them once they captured power.\n\n\nthe last step before complete dictatorship was establishment of gestapo and annihilation of army leadership.\n\nhttps://www.annefrank.org/en/anne-frank/go-in-depth/germany-1933-democracy-dictatorship/"
    ],
    "cleaned_text": "remorseless rise modi cult giant hoardings dominating image modis others reduced alteregos incidentals stare every passerby ",
    "cleaned_title": "remorseless rise modi cult",
    "cleaned_selftext": "giant hoardings dominating image modis others reduced alteregos incidentals stare every passerby",
    "cleaned_comments": "centre poses questions demands payment amount spent publicity nonbjp chief ministers use symbolism every nook corner one major strategy nazis people read rise hitler well youll get know mo nazis difficult remove captured power last step complete dictatorship establishment gestapo annihilation army leadership",
    "light_cleaned_title": "The Remorseless Rise of the Modi Cult",
    "light_cleaned_selftext": "Giant hoardings in which the most dominating image is Modi’s, the others are reduced to alter-egos or incidentals, stare down at every passer-by.",
    "light_cleaned_comments": ". >But, the Centre poses questions and demands payment of the amount spent on publicity, only from non-BJP chief ministers. the use of symbolism at each and every nook and corner was one of the major strategy of nazis. People should read about rise of Hitler as well. you'll get to know what is the MO of nazis and how difficult it was to remove them once they captured power. the last step before complete dictatorship was establishment of gestapo and annihilation of army leadership."
}