{
    "id": "ludxmc",
    "title": "What can we learn from Vietnam's development?",
    "url": "https://www.reddit.com/r/india/comments/ludxmc/what_can_we_learn_from_vietnams_development/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/bv7vfa3xg7k61.png?width=2024&amp;format=png&amp;auto=webp&amp;s=35dcabf0b5e5e3cd9ee6a73a80ad00d1abba7f20\n\nhttps://preview.redd.it/xs1wox7tb7k61.png?width=2004&amp;format=png&amp;auto=webp&amp;s=503e9fb58b360d036cdb74bcaf65d7e12a26a0f4\n\nPer capita:\n\n* India: 286.6$\n* Vietnam: 447.6$\n\n&amp;#x200B;\n\nhttps://preview.redd.it/skdys5kae7k61.png?width=2034&amp;format=png&amp;auto=webp&amp;s=a6a76a96f8f620e863c43e6c7d0819f830bd0c2b\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8yjot2psd7k61.png?width=2024&amp;format=png&amp;auto=webp&amp;s=6744a504c156bc6d8a998ab7a2307fd630ccba41\n\nhttps://preview.redd.it/kjru89p1e7k61.png?width=2046&amp;format=png&amp;auto=webp&amp;s=9309cce54564f1886279759c3fc48a2a835ea19c\n\nhttps://preview.redd.it/j5m507xhg7k61.png?width=2018&amp;format=png&amp;auto=webp&amp;s=a12afe992b91b08c55735a0e42433c61c815b01a\n\nhttps://preview.redd.it/ur6u0vmne7k61.png?width=2022&amp;format=png&amp;auto=webp&amp;s=4c9a995819a458544cc82c59fe50fac1f6cc0152\n\nhttps://preview.redd.it/qvqax8dbf7k61.png?width=2038&amp;format=png&amp;auto=webp&amp;s=8c530111c8ecbcaca0419e2e7d2a9b4e99b7541d\n\nhttps://preview.redd.it/jrqcukb0g7k61.png?width=2046&amp;format=png&amp;auto=webp&amp;s=532e38aba9ee84cfd9eefcb34fe9f6830e2055e4",
    "flair": "Policy/Economy",
    "score": 41,
    "num_comments": 16,
    "created_utc": 1614512343,
    "convurl": "https://b.thumbs.redditmedia.com/uG5UGr76Vj5BLJioXvwUqCwXrUAoaeXR5ei4KRL-qzw.jpg",
    "comments": [
        "This is output. Learning is about how and why said output was arrived at. \nGood post though. Puts into perspective being outcompeted by a place with the population smaller than of Maharashtra, with similar area and population density metrics.",
        "Work ethic.",
        "Form one party system and abolish elections?",
        "Between 1990 and 2014 - Vietnam's Human Development Index shot up from levels of Sub Saharan Africa to rest of south east asia levels (0.4 to.0.7). Essentially good education, basic community healthcare which are all good inputs for improvement in GDP and development..(look at South Indian states like TN for example). That's not happened in UP, bihar , MP etc (combined population of 400 M)",
        "Vietnam has piggybacked China. What we can learn from this is to use collusion with your neighbours and work around politically destroying tendencies.",
        "Destroy the rural economy in a fiscally irresponsible shitshow weekend and sell off nation's assets to the crony buddies from your hometown?",
        "That will be even easier in a one man authoritarian government.",
        "Work ethic ki chut, try starting a business in India. They were as poor per capita as India 30 years ago, within 30 years what work ethic did the people develop out of nowhere. If people have jobs and are motivated, they'll work.",
        "Plz.... Maruti under state control was sick asset and look at the current conditions. Privatisation Zindabad.\n\n\nWith regards to APMC watch this video.https://youtu.be/vkDeTnNhQD8\n\n[**Privatisation creates wealth: Maruti was worth Rs 4,339 cr at sale. Now it’s Rs 2.18 lakh cr\nPrice of Maruti Suzuki's stock has increased nearly 5,700% to Rs 7,243.75 as of closing on 14 November from Rs 125 at the time of listing in 2002.**](\nhttps://theprint.in/economy/privatisation-creates-wealth-maruti-worth-rs-4339-cr-at-sale-now-2-18-lakh-cr/322346/)\n\n\n[Govt sold 45% of Hindustan Zinc for Rs 769 cr in 2002. Its 30% stake is now worth Rs 27,000 cr](https://theprint.in/economy/hindustan-zinc-role-model-for-disinvestment-value-rose-by-rs-27078-cr-in-17-yrs/314143/)\n\n\nGovernment should start selling PSU banks and maybe keep only 3-4 banks under its control.",
        "You don't get fat by eating rice.",
        "Exactly. These commies should probably get their heads out of their asses and live in the real world for once.",
        "&gt;Vietnam has piggybacked China.\n\nHow ? I thought both were quite antagonistic ?",
        "A bit of this, and perhaps you can research a Council of foreign Affairs' report on Vietnam and the dual dependency of China and Vietnam after Hu Jintao. \n\nXi Jinping wants to change that hence the fresh tensions have come up.\n\n[Viêtnam's economic miracle](https://youtu.be/TeZNLanfkHo)",
        "yes you do . Source : dude , trust me"
    ],
    "cleaned_text": "learn vietnams development ampxb per capita india vietnam ampxb ampxb ",
    "cleaned_title": "learn vietnams development",
    "cleaned_selftext": "ampxb per capita india vietnam ampxb ampxb",
    "cleaned_comments": "output learning said output arrived good post though puts perspective outcompeted place population smaller maharashtra similar area population density metrics work ethic form one party system abolish elections vietnams human development index shot levels sub saharan africa rest south east asia levels essentially good education basic community healthcare good inputs improvement gdp developmentlook south indian states like tn example thats happened bihar mp etc combined population vietnam piggybacked china learn use collusion neighbours work around politically destroying tendencies destroy rural economy fiscally irresponsible shitshow weekend sell nations assets crony buddies hometown even easier one man authoritarian government work ethic ki chut try starting business india poor per capita india years ago within years work ethic people develop nowhere people jobs motivated theyll work plz maruti state control sick asset look current conditions privatisation zindabad regards apmc watch videohttpsyoutubevkdetnnhqd privatisation creates wealth maruti worth rs cr sale rs lakh cr price maruti suzukis stock increased nearly rs closing november rs time listing govt sold hindustan zinc rs cr stake worth rs crhttpstheprintineconomyhindustanzincrolemodelfordisinvestmentvaluerosebyrscrinyrs government start selling psu banks maybe keep banks control dont get fat eating rice exactly commies probably get heads asses live real world gtvietnam piggybacked china thought quite antagonistic bit perhaps research council foreign affairs report vietnam dual dependency china vietnam hu jintao xi jinping wants change hence fresh tensions come vitnams economic miraclehttpsyoutubeteznlanfkho yes source dude trust",
    "light_cleaned_title": "What can we learn from Vietnam's development?",
    "light_cleaned_selftext": "Per capita: * India: 286.6$ * Vietnam: 447.6$",
    "light_cleaned_comments": "This is output. Learning is about how and why said output was arrived at. Good post though. Puts into perspective being outcompeted by a place with the population smaller than of Maharashtra, with similar area and population density metrics. Work ethic. Form one party system and abolish elections? Between 1990 and 2014 - Vietnam's Human Development Index shot up from levels of Sub Saharan Africa to rest of south east asia levels (0.4 to.0.7). Essentially good education, basic community healthcare which are all good inputs for improvement in GDP and development..(look at South Indian states like TN for example). That's not happened in UP, bihar , MP etc (combined population of 400 M) Vietnam has piggybacked China. What we can learn from this is to use collusion with your neighbours and work around politically destroying tendencies. Destroy the rural economy in a fiscally irresponsible shitshow weekend and sell off nation's assets to the crony buddies from your hometown? That will be even easier in a one man authoritarian government. Work ethic ki chut, try starting a business in India. They were as poor per capita as India 30 years ago, within 30 years what work ethic did the people develop out of nowhere. If people have jobs and are motivated, they'll work. Plz.... Maruti under state control was sick asset and look at the current conditions. Privatisation Zindabad. With regards to APMC watch this video.https://youtu.be/vkDeTnNhQD8 [**Privatisation creates wealth: Maruti was worth Rs 4,339 cr at sale. Now it’s Rs 2.18 lakh cr Price of Maruti Suzuki's stock has increased nearly 5,700% to Rs 7,243.75 as of closing on 14 November from Rs 125 at the time of listing in 2002.**]( [Govt sold 45% of Hindustan Zinc for Rs 769 cr in 2002. Its 30% stake is now worth Rs 27,000 cr](https://theprint.in/economy/hindustan-zinc-role-model-for-disinvestment-value-rose-by-rs-27078-cr-in-17-yrs/314143/) Government should start selling PSU banks and maybe keep only 3-4 banks under its control. You don't get fat by eating rice. Exactly. These commies should probably get their heads out of their asses and live in the real world for once. &gt;Vietnam has piggybacked China. How ? I thought both were quite antagonistic ? A bit of this, and perhaps you can research a Council of foreign Affairs' report on Vietnam and the dual dependency of China and Vietnam after Hu Jintao. Xi Jinping wants to change that hence the fresh tensions have come up. [Viêtnam's economic miracle](https://youtu.be/TeZNLanfkHo) yes you do . Source : dude , trust me"
}