{
    "id": "174iur8",
    "title": "Earned 200 from a Scammer",
    "url": "https://www.reddit.com/gallery/174iur8",
    "selftext": "Started with a random number wp me.\n\n1. Introduced herself as a associate of a digital marketing agency. \n\n2. Told me I have to give rating and would earn according. \n\n3. I went along and given 5 star rating to a link she given\n\n4. Gave me a code and a person to contact on telegram. \n\n5. Gave code to the person on telegram and was added to a group with task coming every 15mins\n\n6. Got 200 in my bank account. \n\nAttaching screenshots",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696937401.0,
    "convurl": "https://i.redd.it/31bbapz32dtb1.jpg",
    "comments": [
        "I have earned 600 from them by liking youtube videos. Now I welcome this type of scammer.",
        "Sadly, some get too involved and get scammed\nThey make big time with those people.\nTrying to make awareness.",
        "What a sad state of the country.",
        "Do remember to go back and change all the reviews to 1 star and mention that they have paid to add this review....",
        "Do you think hotels are involved in this?\nGiving them 1 star, just seems wrong.",
        "Of course they are. Who else will pay money to give the hotels 5 stars except for the hotels itself?",
        "Possible ..... I recently was checking reviews for booking a hotel, and most of the hotels had a lot of 5 star reviews with minimal text... When I check the history of such users, within the same dates they would have given 5 star reviews to multiple other places (which are unrelated)....",
        "I dont think so, the main scam starts once you join there group on telegram, they will ask you to invest amount ranging from 1000 to 3lakh, saying in 10mins you will get the same amount back with some intrest.\n\nInitally for lower amount they will return you but as soon as you will think it's legit\nThey will keep giving task and asking more but wont release the initial amount.",
        "Trading your bank details for 200 rs? Doesn't feel like a gain to me.",
        "Na man, this was for the awareness.\nIt was not my main saving account.",
        "No issues then. It's just that the scammers are getting so advanced these days that it's super easy to make a fool of someone who is not \"technologically sound\".",
        "It's unfortunate that people have fallen victim to these scams. Let's hope that nobody falls for them in the future. The level of organization behind these operations is truly astonishing.",
        "Please remove the rating later too. Misleads a lot of people. I once went to a 5star rated hotel, already paid for in advance, the floor was full of used condoms. There were like 100 shampoo sachets on the bathroom floor and the bedsheet had rose petals from last night. I couldnt stay there for 5 seconds and I didn't get a refund too.",
        "I have removed.",
        "Yes, the hotels pay PR agencies/scam centers to get higher reviews. Why would scammers do a charity?",
        "I think they lure you into this one step at a time and get away with a bigger amount of money as you keep working with them. I would block them after they ask you for money instead of sending you.",
        "But all of your bank accounts have a common KYC which will reveal a lot more info.",
        "That's good, enjoy the money now. 💰",
        "Got a similar message today.\n\nhttps://preview.redd.it/t97hv6tbtdtb1.png?width=1080&format=pjpg&auto=webp&s=c9b58197e99c52937dbdb17f3859f9dba1a19661",
        "Lia Vaishya - what an ironic name!",
        "Now you became scammer of the scammers.",
        "The accounts you get paid from are money mules and the money you receive is what they have scammed from other people.\n\nIt’s better to waste their time and just keep them on the hook.",
        "You are correct, donating the amount",
        "This is why I don’t book regular hotels anymore. \n\nI started using Airbnb for my holiday homes and you can’t do this kind of shit there",
        "I am curious why people even bother to respond to these random messages on WhatsApp? Help me understand.",
        "I feel there are many reasons\n\n1. Unemployment \n2. Not much awareness about the scam\n3. Curiosity \n\nBut it boils down to lack of cyber security awareness mostly.",
        " I came to know that there are chances of bank account getting blocked/freezed....They are looting/scamming some innocent people...if these guys complains there are provisions to block the scammers acount and all other accounts to which those money is transferred ......",
        "me too , earned 3.5k till date",
        "Why is OP getting downvoted in the comments?? Are the downvotes from scanners??"
    ],
    "cleaned_text": "earned scammer started random number wp introduced associate digital marketing agency told give rating would earn according went along given star rating link given gave code person contact telegram gave code person telegram added group task coming every mins got bank account attaching screenshots ",
    "cleaned_title": "earned scammer",
    "cleaned_selftext": "started random number wp introduced associate digital marketing agency told give rating would earn according went along given star rating link given gave code person contact telegram gave code person telegram added group task coming every mins got bank account attaching screenshots",
    "cleaned_comments": "earned liking youtube videos welcome type scammer sadly get involved get scammed make big time people trying make awareness sad state country remember go back change reviews star mention paid add review think hotels involved giving star seems wrong course else pay money give hotels stars except hotels possible recently checking reviews booking hotel hotels lot star reviews minimal text check history users within dates would given star reviews multiple places unrelated dont think main scam starts join group telegram ask invest amount ranging lakh saying mins get amount back intrest initally lower amount return soon think legit keep giving task asking wont release initial amount trading bank details rs doesnt feel like gain na man awareness main saving account issues scammers getting advanced days super easy make fool someone technologically sound unfortunate people fallen victim scams lets hope nobody falls future level organization behind operations truly astonishing please remove rating later misleads lot people went star rated hotel already paid advance floor full used condoms like shampoo sachets bathroom floor bedsheet rose petals last night couldnt stay seconds didnt get refund removed yes hotels pay pr agenciesscam centers get higher reviews would scammers charity think lure one step time get away bigger amount money keep working would block ask money instead sending bank accounts common kyc reveal lot info thats good enjoy money got similar message today lia vaishya ironic name became scammer scammers accounts get paid money mules money receive scammed people better waste time keep hook correct donating amount dont book regular hotels anymore started using airbnb holiday homes cant kind shit curious people even bother respond random messages whatsapp help understand feel many reasons unemployment much awareness scam curiosity boils lack cyber security awareness mostly came know chances bank account getting blockedfreezedthey lootingscamming innocent peopleif guys complains provisions block scammers acount accounts money transferred earned k till date op getting downvoted comments downvotes scanners",
    "light_cleaned_title": "Earned 200 from a Scammer",
    "light_cleaned_selftext": "Started with a random number wp me. 1. Introduced herself as a associate of a digital marketing agency. 2. Told me I have to give rating and would earn according. 3. I went along and given 5 star rating to a link she given 4. Gave me a code and a person to contact on telegram. 5. Gave code to the person on telegram and was added to a group with task coming every 15mins 6. Got 200 in my bank account. Attaching screenshots",
    "light_cleaned_comments": "I have earned 600 from them by liking youtube videos. Now I welcome this type of scammer. Sadly, some get too involved and get scammed They make big time with those people. Trying to make awareness. What a sad state of the country. Do remember to go back and change all the reviews to 1 star and mention that they have paid to add this review.... Do you think hotels are involved in this? Giving them 1 star, just seems wrong. Of course they are. Who else will pay money to give the hotels 5 stars except for the hotels itself? Possible ..... I recently was checking reviews for booking a hotel, and most of the hotels had a lot of 5 star reviews with minimal text... When I check the history of such users, within the same dates they would have given 5 star reviews to multiple other places (which are unrelated).... I dont think so, the main scam starts once you join there group on telegram, they will ask you to invest amount ranging from 1000 to 3lakh, saying in 10mins you will get the same amount back with some intrest. Initally for lower amount they will return you but as soon as you will think it's legit They will keep giving task and asking more but wont release the initial amount. Trading your bank details for 200 rs? Doesn't feel like a gain to me. Na man, this was for the awareness. It was not my main saving account. No issues then. It's just that the scammers are getting so advanced these days that it's super easy to make a fool of someone who is not \"technologically sound\". It's unfortunate that people have fallen victim to these scams. Let's hope that nobody falls for them in the future. The level of organization behind these operations is truly astonishing. Please remove the rating later too. Misleads a lot of people. I once went to a 5star rated hotel, already paid for in advance, the floor was full of used condoms. There were like 100 shampoo sachets on the bathroom floor and the bedsheet had rose petals from last night. I couldnt stay there for 5 seconds and I didn't get a refund too. I have removed. Yes, the hotels pay PR agencies/scam centers to get higher reviews. Why would scammers do a charity? I think they lure you into this one step at a time and get away with a bigger amount of money as you keep working with them. I would block them after they ask you for money instead of sending you. But all of your bank accounts have a common KYC which will reveal a lot more info. That's good, enjoy the money now. 💰 Got a similar message today. Lia Vaishya - what an ironic name! Now you became scammer of the scammers. The accounts you get paid from are money mules and the money you receive is what they have scammed from other people. It’s better to waste their time and just keep them on the hook. You are correct, donating the amount This is why I don’t book regular hotels anymore. I started using Airbnb for my holiday homes and you can’t do this kind of shit there I am curious why people even bother to respond to these random messages on WhatsApp? Help me understand. I feel there are many reasons 1. Unemployment 2. Not much awareness about the scam 3. Curiosity But it boils down to lack of cyber security awareness mostly. I came to know that there are chances of bank account getting blocked/freezed....They are looting/scamming some innocent people...if these guys complains there are provisions to block the scammers acount and all other accounts to which those money is transferred ...... me too , earned 3.5k till date Why is OP getting downvoted in the comments?? Are the downvotes from scanners??"
}