{
    "id": "18f5cmj",
    "title": "3 hour+ traffic in Delhi North Campus Area due to an ABVP procession",
    "url": "https://v.redd.it/ezgb41rmeh5c1",
    "selftext": "A little background: I am a 1st year B.Sc Student enrolled in Delhi University. I came to Delhi to enrol in a regular college because I am originally a resident of Kolkata. Yesterday, I left my hostel to go to the gym and en route saw a huge procession of people, presumably aged 20-25, waving ABVP flags and law enforcement personnel protecting them.\nThe consequent traffic was simply atrocious, for a lack of a better word. People having to give up 30-40mins of their time simply stuck in traffic being unable to go back or move forward, and the traffic persisted for 3+hours. I saw Ambulances stuck in the traffic as well. I don't know what I would have done if my loved one was in a critical condition and we were stuck in traffic due to this reason. Maybe I would have become a vigilante and got blood on\nmy hands. Is there nothing we can do to\nstop this? How are the law enforcement people condoning this? You CANNOT disrupt a public area like this, no matter what your reason is. It will never\nbe justified. It's simply outrageous how the\ncommon man has to always receive the shorter end of the stick and be inconvenienced when they are\nnot at fault. What can we do to prevent this? What can I, as a student, start doing so I can make an impact? How is this not a crime? Impeding people's work and stealing people's precious time? Not to mention the enormous amounts of waste generated during these events. Attaching video for reference; Disclaimer: I DON'T have a problem with any person/group expressing their opinions/exercising their right to speech/ right to express themselves. What I do have a problem with, however, is as simple as you cannot exercise your right at the expense of someone else's right/ someone's time. Time once lost can never be compensated for.",
    "flair": "Rant / Vent",
    "score": 62,
    "num_comments": 16,
    "created_utc": 1702220272.0,
    "convurl": "https://external-preview.redd.it/d3VtanJrdmxlaDVjMWSP2ngw0rjSj9PqNv-SHVor1x-dlM3ngTs_mGtlNHyH.png?format=pjpg&auto=webp&s=0f80acda6c5595d346265da5ed46cd6f4cfa97d5",
    "comments": [
        "No, you cannot do anything. \n\nPeople in Delhi would rather live in a gas chamber than not use fireworkers in the name of culture and tradition.\n\nIt is proved in India that it is very easy to mislead the mass, make them live an illusion. The reverse process is hard and time-consuming.\n\nGet out of that shithole if you can.",
        "Oh we blaming Diwali for this year’s smog too? Alright",
        "Dude caa protest, farmers protest all blocked traffic, and farmers protest led to death of COVID patients as well as ambulance were stuck, these things are bad but are inevitable",
        "reveling so enthusiastically in the supposed past that they have lost any current sense for the present or any hopes/plans for a better future.",
        "And you think they are sensible....",
        "> farmers protest led to death of COVID patients \n\nLiterally no proof of this.\n\nYou know what else led to death of COVID patients though?",
        "Bjp ke chomu sab jagah maujood he",
        "People have protests and rallies, can't really do anything about it, because of decades of history being for this. So if you try to stop anyone of them(like this or the Palestine support ones or the LGBTQ marches), authorities will be called bias and an infinite number of phobes and bigots.",
        "yes maybe not covid patients but try to understand his point as well, is it really hard to believe that farmers protest would've caused the same issues that this rally is doing.",
        ">People in Delhi would rather live in a gas chamber than not use fireworkers in the name of culture and tradition.\n\nDon't show bias here, firecrackers do have a lot of pollution, but what about the stubble burning from neighbouring states like Punjab, Haryana,etc. Their Stubble burning already increases pollution levels to unhealthy standards, I have lived in rural Punjab and they truly do not care,they will specially time it closer and closer to Diwali.",
        "A protest is different from a procession though. One is the only source you have to raise your voice and the other is an intimidation tactic by those in power.",
        "but for the patients of the people in that ambulance, would they care if their loved ones are dead because of a farmer's protest/CAA protest or a ABVP procession, to them they are all the same people who think they are right and won't give the ambulance space. So the solution is to stop both of them which people would call fascism or hold them into grounds which neither protestors nor processions would agree to.",
        "> but for the patients of the people in that ambulance \n\nThere is no evidence of this though. I have participated in IAC protests in 2012-2013. Whenever an ambulance or something was stuck, the protestors would always let it pass. The problem with the farmers protest is that the government cordoned off that area to avoid more people joining them and embarassing the governmemnt further. \n\nSo no ambulances were stuck outside the protests because that entire area was a no-go zone, because of the government",
        "a decade changes a lot, and just because some region is a no go, doesn't mean that it wouldn't affect an outcome.",
        "A decade can change what? I am saying protestors usually don't hold ambulances. How do you know that has changed?\n\nLook you want to justify ABVP stopping traffic that is your choice. But don't pretend like this is an \"all sides\" issue. Hindu right wingers lack empathy and cause obstructions like this while their online supporters cook up problems with other people.\n\nYou are a perfect example of this.",
        "Lying about deaths...\n\nThis is not WhatsApp.."
    ],
    "cleaned_text": "hour traffic delhi north campus area due abvp procession little background st year bsc student enrolled delhi university came delhi enrol regular college originally resident kolkata yesterday left hostel go gym en route saw huge procession people presumably aged waving abvp flags law enforcement personnel protecting consequent traffic simply atrocious lack better word people give mins time simply stuck traffic unable go back move forward traffic persisted hours saw ambulances stuck traffic well dont know would done loved one critical condition stuck traffic due reason maybe would become vigilante got blood hands nothing stop law enforcement people condoning disrupt public area like matter reason never justified simply outrageous common man always receive shorter end stick inconvenienced fault prevent student start make impact crime impeding peoples work stealing peoples precious time mention enormous amounts waste generated events attaching video reference disclaimer dont problem persongroup expressing opinionsexercising right speech right express problem however simple exercise right expense someone elses right someones time time lost never compensated ",
    "cleaned_title": "hour traffic delhi north campus area due abvp procession",
    "cleaned_selftext": "little background st year bsc student enrolled delhi university came delhi enrol regular college originally resident kolkata yesterday left hostel go gym en route saw huge procession people presumably aged waving abvp flags law enforcement personnel protecting consequent traffic simply atrocious lack better word people give mins time simply stuck traffic unable go back move forward traffic persisted hours saw ambulances stuck traffic well dont know would done loved one critical condition stuck traffic due reason maybe would become vigilante got blood hands nothing stop law enforcement people condoning disrupt public area like matter reason never justified simply outrageous common man always receive shorter end stick inconvenienced fault prevent student start make impact crime impeding peoples work stealing peoples precious time mention enormous amounts waste generated events attaching video reference disclaimer dont problem persongroup expressing opinionsexercising right speech right express problem however simple exercise right expense someone elses right someones time time lost never compensated",
    "cleaned_comments": "anything people delhi would rather live gas chamber use fireworkers name culture tradition proved india easy mislead mass make live illusion reverse process hard timeconsuming get shithole oh blaming diwali years smog alright dude caa protest farmers protest blocked traffic farmers protest led death covid patients well ambulance stuck things bad inevitable reveling enthusiastically supposed past lost current sense present hopesplans better future think sensible farmers protest led death covid patients literally proof know else led death covid patients though bjp ke chomu sab jagah maujood people protests rallies cant really anything decades history try stop anyone themlike palestine support ones lgbtq marches authorities called bias infinite number phobes bigots yes maybe covid patients try understand point well really hard believe farmers protest wouldve caused issues rally people delhi would rather live gas chamber use fireworkers name culture tradition dont show bias firecrackers lot pollution stubble burning neighbouring states like punjab haryanaetc stubble burning already increases pollution levels unhealthy standards lived rural punjab truly carethey specially time closer closer diwali protest different procession though one source raise voice intimidation tactic power patients people ambulance would care loved ones dead farmers protestcaa protest abvp procession people think right wont give ambulance space solution stop people would call fascism hold grounds neither protestors processions would agree patients people ambulance evidence though participated iac protests whenever ambulance something stuck protestors would always let pass problem farmers protest government cordoned area avoid people joining embarassing governmemnt ambulances stuck outside protests entire area nogo zone government decade changes lot region go doesnt mean wouldnt affect outcome decade change saying protestors usually dont hold ambulances know changed look want justify abvp stopping traffic choice dont pretend like sides issue hindu right wingers lack empathy cause obstructions like online supporters cook problems people perfect example lying deaths whatsapp",
    "light_cleaned_title": "3 hour+ traffic in Delhi North Campus Area due to an ABVP procession",
    "light_cleaned_selftext": "A little background: I am a 1st year B.Sc Student enrolled in Delhi University. I came to Delhi to enrol in a regular college because I am originally a resident of Kolkata. Yesterday, I left my hostel to go to the gym and en route saw a huge procession of people, presumably aged 20-25, waving ABVP flags and law enforcement personnel protecting them. The consequent traffic was simply atrocious, for a lack of a better word. People having to give up 30-40mins of their time simply stuck in traffic being unable to go back or move forward, and the traffic persisted for 3+hours. I saw Ambulances stuck in the traffic as well. I don't know what I would have done if my loved one was in a critical condition and we were stuck in traffic due to this reason. Maybe I would have become a vigilante and got blood on my hands. Is there nothing we can do to stop this? How are the law enforcement people condoning this? You CANNOT disrupt a public area like this, no matter what your reason is. It will never be justified. It's simply outrageous how the common man has to always receive the shorter end of the stick and be inconvenienced when they are not at fault. What can we do to prevent this? What can I, as a student, start doing so I can make an impact? How is this not a crime? Impeding people's work and stealing people's precious time? Not to mention the enormous amounts of waste generated during these events. Attaching video for reference; Disclaimer: I DON'T have a problem with any person/group expressing their opinions/exercising their right to speech/ right to express themselves. What I do have a problem with, however, is as simple as you cannot exercise your right at the expense of someone else's right/ someone's time. Time once lost can never be compensated for.",
    "light_cleaned_comments": "No, you cannot do anything. People in Delhi would rather live in a gas chamber than not use fireworkers in the name of culture and tradition. It is proved in India that it is very easy to mislead the mass, make them live an illusion. The reverse process is hard and time-consuming. Get out of that shithole if you can. Oh we blaming Diwali for this year’s smog too? Alright Dude caa protest, farmers protest all blocked traffic, and farmers protest led to death of COVID patients as well as ambulance were stuck, these things are bad but are inevitable reveling so enthusiastically in the supposed past that they have lost any current sense for the present or any hopes/plans for a better future. And you think they are sensible.... > farmers protest led to death of COVID patients Literally no proof of this. You know what else led to death of COVID patients though? Bjp ke chomu sab jagah maujood he People have protests and rallies, can't really do anything about it, because of decades of history being for this. So if you try to stop anyone of them(like this or the Palestine support ones or the LGBTQ marches), authorities will be called bias and an infinite number of phobes and bigots. yes maybe not covid patients but try to understand his point as well, is it really hard to believe that farmers protest would've caused the same issues that this rally is doing. >People in Delhi would rather live in a gas chamber than not use fireworkers in the name of culture and tradition. Don't show bias here, firecrackers do have a lot of pollution, but what about the stubble burning from neighbouring states like Punjab, Haryana,etc. Their Stubble burning already increases pollution levels to unhealthy standards, I have lived in rural Punjab and they truly do not care,they will specially time it closer and closer to Diwali. A protest is different from a procession though. One is the only source you have to raise your voice and the other is an intimidation tactic by those in power. but for the patients of the people in that ambulance, would they care if their loved ones are dead because of a farmer's protest/CAA protest or a ABVP procession, to them they are all the same people who think they are right and won't give the ambulance space. So the solution is to stop both of them which people would call fascism or hold them into grounds which neither protestors nor processions would agree to. > but for the patients of the people in that ambulance There is no evidence of this though. I have participated in IAC protests in 2012-2013. Whenever an ambulance or something was stuck, the protestors would always let it pass. The problem with the farmers protest is that the government cordoned off that area to avoid more people joining them and embarassing the governmemnt further. So no ambulances were stuck outside the protests because that entire area was a no-go zone, because of the government a decade changes a lot, and just because some region is a no go, doesn't mean that it wouldn't affect an outcome. A decade can change what? I am saying protestors usually don't hold ambulances. How do you know that has changed? Look you want to justify ABVP stopping traffic that is your choice. But don't pretend like this is an \"all sides\" issue. Hindu right wingers lack empathy and cause obstructions like this while their online supporters cook up problems with other people. You are a perfect example of this. Lying about deaths... This is not WhatsApp.."
}