{
    "id": "16l86ef",
    "title": "Survey on Sexual Assault",
    "url": "https://www.reddit.com/r/india/comments/16l86ef/survey_on_sexual_assault/",
    "selftext": "Every female friend and few male friends I have ever known has encountered a sexual assault incident during their childhood, teenage years, or later. Most of the assaulters were part of their family and most of them chose not to report it to their parents, and they still go through the part where they have to meet them during their family reunions. Many cases of assaults were committed by strangers, and the victims can be Male or Female(a disproportionate number of cases are where females are the victims).\n\n  \nI(M) had my own experience of assault. when I was traveling in the Hyderabad metro a year back or two, a person - about their 30s came and sat beside me and started talking to me, he was nice at first, we were talking and suddenly when my station came and I was about to leave, he groped my balls, and was asking how big are my balls.   \n\n\nI am trying to make a case study on sexual assaults as part of a semester project, would really help if you guys take my survey on your side of the experience, or the experience of the person you know. No personal questions regarding yourself would be asked, just age and the state.   \n\n\nWill report back to the compiled results.\n\n[Take the Survey](https://forms.gle/vJBbdeLYFbtUCi4D6)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1694975289.0,
    "convurl": "https://external-preview.redd.it/i3EYuAd-K3xnjEyx8ihYebwEyOXjO5l2eyit6ui21lw.jpg?auto=webp&s=22a112ad225ea35e639bd6834b3a06bf7f58f00b",
    "comments": [],
    "cleaned_text": "survey sexual assault every female friend male friends ever known encountered sexual assault incident childhood teenage years later assaulters part family chose report parents still go part meet family reunions many cases assaults committed strangers victims male femalea disproportionate number cases females victims im experience assault traveling hyderabad metro year back two person came sat beside started talking nice first talking suddenly station came leave groped balls asking big balls trying make case study sexual assaults part semester project would really help guys take survey side experience experience person know personal questions regarding would asked age state report back compiled results take surveyhttpsformsglevjbbdelyfbtucid ",
    "cleaned_title": "survey sexual assault",
    "cleaned_selftext": "every female friend male friends ever known encountered sexual assault incident childhood teenage years later assaulters part family chose report parents still go part meet family reunions many cases assaults committed strangers victims male femalea disproportionate number cases females victims im experience assault traveling hyderabad metro year back two person came sat beside started talking nice first talking suddenly station came leave groped balls asking big balls trying make case study sexual assaults part semester project would really help guys take survey side experience experience person know personal questions regarding would asked age state report back compiled results take surveyhttpsformsglevjbbdelyfbtucid",
    "cleaned_comments": "",
    "light_cleaned_title": "Survey on Sexual Assault",
    "light_cleaned_selftext": "Every female friend and few male friends I have ever known has encountered a sexual assault incident during their childhood, teenage years, or later. Most of the assaulters were part of their family and most of them chose not to report it to their parents, and they still go through the part where they have to meet them during their family reunions. Many cases of assaults were committed by strangers, and the victims can be Male or Female(a disproportionate number of cases are where females are the victims). I(M) had my own experience of assault. when I was traveling in the Hyderabad metro a year back or two, a person - about their 30s came and sat beside me and started talking to me, he was nice at first, we were talking and suddenly when my station came and I was about to leave, he groped my balls, and was asking how big are my balls. I am trying to make a case study on sexual assaults as part of a semester project, would really help if you guys take my survey on your side of the experience, or the experience of the person you know. No personal questions regarding yourself would be asked, just age and the state. Will report back to the compiled results. [Take the Survey](https://forms.gle/vJBbdeLYFbtUCi4D6)",
    "light_cleaned_comments": ""
}