{
    "id": "1c0kxgp",
    "title": "Is the Judiciary still Independent? ",
    "url": "https://i.redd.it/51hph4odgntc1.png",
    "selftext": "Well, I was reading about Kejriwal Case and found out about this information, digging deeper into the case threw light on different Justices in High Court and Supreme Court and how they act against Politicians affiliated with different parties. \n\nJustice Swarna Kanta Sharma refused Kejriwal's bail by saying that ED has enough evidence against him, though they haven't found any money trail leading to Kejriwal's bank account and it's just witness statement (source: SC when it bailed Sanjay Singh). \n\nBut Dilip Ray has Property worth crores and same Justice SK Sharma bailed him and allowed him to take part him election because his \"Right to Take part in Political Activity\" will be threatened if he wasn't bailed out. The case against him was being run by CBI and interestingly, the Judge on his case changed soon after he switched parties to BJP. \n\nSame with Supreme Court Judges, all AAP cases have gone to either Justice Sanjeev Khanna or Justice Bela Trivedi, who cancelled all Bail orders, until due to Scheduling conflicts and interference by Justice Dipankar Dutta, Sanjay Singh got bailed out, and SC said that ED couldn't link him and the Liquor Scam. \n\nMy main problem is how can the same court give different judgement, do the judges follow law or their own (and their party's) interest? Sanjay Singh filed for Bail multiple times, and it got rejected, until so called \"impartial\" judge took up the case and granted him bail. \n\nRemember the incident with Rahul Gandhi where he had to lose his seat because of Defamation case? The SC stayed the lower court order but why he was given the maximum punishment for a political speech? So that he can lose his constituency? Why the SC didn't talk about the local court judge (who was arbitrarily sus). Not talking about Kolkata HC judge who gave anti TMC orders and joined BJP 1 day after his term was over. \n\nIs the judiciary really independent? Are we losing the last pillar of democracy. \n\nPS: Saw some videos of Justice Swarna Kanta Sharma where she stopped using the word India and started using the word Bharat (after the whole INDI Alliance fiasco), her talking about why being a housewife is better as wives of Hindu kings were the same (Hindu traditions are always right stuff) and other RW ideas. I don't understand why she is in a sus Conference anyways, isn't she a Judge in HC? ",
    "flair": "Law & Courts",
    "score": 264,
    "num_comments": 30,
    "created_utc": 1712753794.0,
    "convurl": "https://i.redd.it/51hph4odgntc1.png",
    "comments": [
        "Delhi High Court?\n\nDoubtful!",
        ">Are we losing the last pillar of democracy.\n\nWe already have.",
        "On the other hand we can see the judgements given by CJI. Not the whole judiciary but parts of it could be.",
        "India is never democratic , we are divided on the basis of sex religion caste and location .. but it got worsen since few years .",
        "Is it possible for a court to issue a summons to Reddit users for making such posts?",
        "I wish",
        "One correction: The Kolkata HC judge hinted towards joining a political party before he gave his resignation. He joined BJP 2 days after he resigned from his post. And later, he said that he had contacts with BJP (both he and BJP approached each other) even before him resigning, which is scary to say the least!",
        "The judiciary was never really independent when it had to deal with authoritarian governments. Check the history of it during the Indira years. It becomes hyperactive only when tolerant democrats like MMS are leading the government. This institution is the best example to show the extreme lack of principles among the highly educated upper caste urban middle class in India. \n\nSome people here keep clapping for Chandrachud just because once in a while he passes a few relatively non consequential orders against the government so that the SC can maintain the optics of being independent. These people never seem to think about how Bela Trivedi and S Khanna gets all the politically sensitive cases when the CJI is in charge of allotting cases to the benches.",
        "I am so fed up with this army of Chandrachud fans. \nSome people here keep clapping for Chandrachud just because once in a while he passes a few relatively non consequential orders against the government so that the SC can maintain the optics of being independent. These people never seem to think about how Bela Trivedi and S Khanna gets all the politically sensitive cases when the CJI is in charge of allotting cases to the benches or Chandrachud shamelessly signed off on the Ayodhya and article 370 verdicts to stay in the good books of the government.\n\nIf you take a closer look it is clear that he is more or less maintaining his father's legacy but a bit more subtle about it. People should see this and stop portraying him as some sort of present day version of the honourable Hans Raj Khanna.",
        "Why? Is your party so weak that one reddit post will make it fall",
        "Before we conclude anything or lose remaining hope,I'd like to know few things\n\nDilip Ray was also booked under PMLA or by ED ?\n\nCourt gave judgement on Kejriwal's appeal that arrest was not needed and was done by political motives. He said that there enough evidence to continue the process of remand. He didn't ask for bail.\n\nPlus if we question everything or doubt everyone,soon we don't like the people who gave judgements that's we don't approve or like, only thing left to trust in this country is supreme court or in some cases high court. I'd like to give them benifit of doubt. \n\nPlease correct me if I'm wrong or share your own opinions too, I'm open to ideas.",
        "Welp, I am scared now.",
        "Your parents should be summoned for producing you.",
        "Yeah people forget the whole episode where Modi looked the other way while the previous CJI got away with sexual harassment. And in return he got a clean chit for Rafael deal.",
        "This is nothing in front of Chandra Babu from Andhra Pradesh. ifkyk\n\nThe number of cases he got 'stay' orders breaks Guinness world records.\n\nThere is a gag order to not discuss on Amaravathi land Scam.",
        "Slightly unrelated but SC is showing very mixed signal depending on which judge you are allotted. \n\nBaba Ramdev and Patanjali got unlucky because they messed with the judges who clearly don't like them. I'm certain any other judge and they would have heaped praises on Baba Ramdev and Patanjali for their fake apology. Not defending those fraudsters but just pointing out the irony.",
        "Just recently (9th April 2024), his bail plea was refused by Delhi HC, and the Judge said that the ED had evidence of him being involved in the Liquor scam, based on some documents, but those documents were not shown to the defense and was only shared between Prosecutor and the Judge. The same thing happened with Sanjay Singh, but he was then bailed out by a different judge in HC. \n\nI really don't care much about Kejri, but when other bigger corrupted politicians get bail from court, and some other leader (who is also a sitting CM) doesn't, it raises a lot of questions.",
        "looks like whoever is in power...they control everything it is simple as that",
        "What it has anything to do with BJP? Its none of judge's business to know what a person does after he is free. Kejriwal case is presented by ED  and on the basis of evidence he is denied bail.",
        "Less than us jagan",
        "Judge critical of police probe in delhi riots cases transferred to rouse avenue\n\nThe Delhi high court on Wednesday transferred 11 judicial officers, including additional sessions judge (ASJ) Vinod Yadav, who was hearing the north-east Delhi riots cases.\n\nYadav has passed several orders criticising the Delhi Police’s probe in the riots, prompting Delhi Police commissioner Rakesh Asthana to form a special investigative cell (SIC) to monitor the progress in the cases. He also ordered that police officers who were posted in north-east Delhi during the riots have since been transferred, should be roped in for probe.\n\nIn one of the orders in July, Yadav imposed a fine of ₹25,000 on the Delhi Police for what the court called a “casual, callous and farcical” investigation into the complaint by a man who was shot in his left eye during the communal riots in February last year\n\nThe public notice issued by the Delhi high court listing the names of the judges who have been transferred said: “..##the Chief Justice##  and Judges of this Court have been pleased to make the following postings/transfers in the Delhi Higher Judicial Service \n\nhttps://www.hindustantimes.com/cities/delhi-news/judge-critical-of-police-probe-in-delhi-riots-cases-transferred-to-rouse-avenue-101633561674326.html",
        "He was convicted by a Special CBI court. His conviction was stayed so that he can stand in elections which would have not been possible with a conviction. Its just a message that BJP has so much reach in the justice system that they can get you out just like that even after a conviction, i.e. provided that you do their bidding.\n\n[Delhi High Court Stays Conviction Of Former Union Minister Dilip Ray To Enable Him To Contest Elections](https://www.livelaw.in/high-court/delhi-high-court/delhi-high-court-coal-scam-stays-conviction-former-union-minister-dilip-ray-254632)\n\nIt would not have mattered even if it were a PMLA case because that also could be stayed. Courts have discretion to do that. So this judge used discretion to stay the conviction for this guy and in Kejriwal's case, the same discretion was used to legitimize his arrest and to continue keeping him detained. Even if they ask for bail, court can use their discretion to keep rejecting it and perpetually keep them imprisoned.\n\nIts the same for UAPA cases as well. Its not that courts are helpless in the matter. In a normal criminal case, the accused will qualify for automatic bail if a charge sheet is not filed in 90 days. UAPA and PMLA just don't have that kind of limitation. This just means that its up to their discretion. The issue is that our \"esteemed judges\" are using their discretionary powers for helping BJP to persecute its critics and helping their benefactors.",
        "Thank you, Bro. You should post this and comment that the Delhi High Court may not be fair",
        "https://www.reddit.com/r/india/comments/19c4dvp/how_the_modi_govt_facilitates_promotes_corruption/",
        "His conviction by a special CBI court has been \"stayed\" to allowed him to contest elections. That was the literal basis on which they argued in court and got the stay. Isn't it funny how somebody already convicted for a major scam had their conviction stayed to contest elections just a day before he joined the BJP.\n\nMeanwhile, the same judge said this about the Kejriwal case.\n\n>This court is of the opinion that the accused has been arrested and his arrest and remand has to be examined as per law and not as per timing of elections.\n\nIsn't it funny how the law doesn't need to take its own course when the accused is joining the BJP.\n\nAnd by the way, given that even a chargesheet was not filed, let alone a trial, how does this judge speak of evidence or the authenticity of it?\n\nYou can be a dumbass about it all you want, just don't expect everyone to not see what exactly is happening.",
        "Nothing is being happening here , a crook is booked under pmln act for the crimes he did in liquor case. \nAnd if you're such a smart ass and believe you are more qualified than a sitting judge you are all the way wrong. \n\nHe plea was rejected that he has been wrongfully arrested was thrown out of the roof as the court categorically said that he is the kingpin in the case.\nOn the basis of authentic evidences, he was denied bail yesterday. Chargesheet will follow later. Thats how the process is.",
        "Well, the real crook I see here is the insecure loser sitting in the PM seat and his party which was shown to have  received kickbacks through electoral bonds from people involved in the case and later conveniently turned from accused to approver.\n\nAnd where is this so called \"authentic evidence\" and why does this judge have access to it before the trial phase and how did he determine it to be authentic? Evidence cannot be considered authentic before it's revealed in the court and deliberated on and it's authenticity is established. So, this judge is relying on just unsubstantiated claims which are not revealed to the defense, which is as good as hearsay and non-existent to reach decisions.\n\nDumbass morons like you need to stop pretending that you know the process because this is not the process.",
        "Well the case is made up on the evident money trail that is there of 338 CR and due process is followed. The problem lies in people like you and your cartel who think what they say is right. \nTalking foul language and non sensical things are few traits of keyboard warriors like you.\nWell on Modi and electoral bonds I think those are the topics above your pay grade so better first get yourself educated on how much money each political party got and also research how they use to get money in the past and how it was used for elections."
    ],
    "cleaned_text": "judiciary still independent well reading kejriwal case found information digging deeper case threw light different justices high court supreme court act politicians affiliated different parties justice swarna kanta sharma refused kejriwals bail saying ed enough evidence though havent found money trail leading kejriwals bank account witness statement source sc bailed sanjay singh dilip ray property worth crores justice sk sharma bailed allowed take part election right take part political activity threatened wasnt bailed case run cbi interestingly judge case changed soon switched parties bjp supreme court judges aap cases gone either justice sanjeev khanna justice bela trivedi cancelled bail orders due scheduling conflicts interference justice dipankar dutta sanjay singh got bailed sc said ed couldnt link liquor scam main problem court give different judgement judges follow law partys interest sanjay singh filed bail multiple times got rejected called impartial judge took case granted bail remember incident rahul gandhi lose seat defamation case sc stayed lower court order given maximum punishment political speech lose constituency sc didnt talk local court judge arbitrarily sus talking kolkata hc judge gave anti tmc orders joined bjp day term judiciary really independent losing last pillar democracy ps saw videos justice swarna kanta sharma stopped using word india started using word bharat whole indi alliance fiasco talking housewife better wives hindu kings hindu traditions always right stuff rw ideas dont understand sus conference anyways isnt judge hc ",
    "cleaned_title": "judiciary still independent",
    "cleaned_selftext": "well reading kejriwal case found information digging deeper case threw light different justices high court supreme court act politicians affiliated different parties justice swarna kanta sharma refused kejriwals bail saying ed enough evidence though havent found money trail leading kejriwals bank account witness statement source sc bailed sanjay singh dilip ray property worth crores justice sk sharma bailed allowed take part election right take part political activity threatened wasnt bailed case run cbi interestingly judge case changed soon switched parties bjp supreme court judges aap cases gone either justice sanjeev khanna justice bela trivedi cancelled bail orders due scheduling conflicts interference justice dipankar dutta sanjay singh got bailed sc said ed couldnt link liquor scam main problem court give different judgement judges follow law partys interest sanjay singh filed bail multiple times got rejected called impartial judge took case granted bail remember incident rahul gandhi lose seat defamation case sc stayed lower court order given maximum punishment political speech lose constituency sc didnt talk local court judge arbitrarily sus talking kolkata hc judge gave anti tmc orders joined bjp day term judiciary really independent losing last pillar democracy ps saw videos justice swarna kanta sharma stopped using word india started using word bharat whole indi alliance fiasco talking housewife better wives hindu kings hindu traditions always right stuff rw ideas dont understand sus conference anyways isnt judge hc",
    "cleaned_comments": "delhi high court doubtful losing last pillar democracy already hand see judgements given cji whole judiciary parts could india never democratic divided basis sex religion caste location got worsen since years possible court issue summons reddit users making posts wish one correction kolkata hc judge hinted towards joining political party gave resignation joined bjp days resigned post later said contacts bjp bjp approached even resigning scary say least judiciary never really independent deal authoritarian governments check history indira years becomes hyperactive tolerant democrats like mms leading government institution best example show extreme lack principles among highly educated upper caste urban middle class india people keep clapping chandrachud passes relatively non consequential orders government sc maintain optics independent people never seem think bela trivedi khanna gets politically sensitive cases cji charge allotting cases benches fed army chandrachud fans people keep clapping chandrachud passes relatively non consequential orders government sc maintain optics independent people never seem think bela trivedi khanna gets politically sensitive cases cji charge allotting cases benches chandrachud shamelessly signed ayodhya article verdicts stay good books government take closer look clear less maintaining fathers legacy bit subtle people see stop portraying sort present day version honourable hans raj khanna party weak one reddit post make fall conclude anything lose remaining hopeid like know things dilip ray also booked pmla ed court gave judgement kejriwals appeal arrest needed done political motives said enough evidence continue process remand didnt ask bail plus question everything doubt everyonesoon dont like people gave judgements thats dont approve like thing left trust country supreme court cases high court id like give benifit doubt please correct im wrong share opinions im open ideas welp scared parents summoned producing yeah people forget whole episode modi looked way previous cji got away sexual harassment return got clean chit rafael deal nothing front chandra babu andhra pradesh ifkyk number cases got stay orders breaks guinness world records gag order discuss amaravathi land scam slightly unrelated sc showing mixed signal depending judge allotted baba ramdev patanjali got unlucky messed judges clearly dont like im certain judge would heaped praises baba ramdev patanjali fake apology defending fraudsters pointing irony recently th april bail plea refused delhi hc judge said ed evidence involved liquor scam based documents documents shown defense shared prosecutor judge thing happened sanjay singh bailed different judge hc really dont care much kejri bigger corrupted politicians get bail court leader also sitting cm doesnt raises lot questions looks like whoever powerthey control everything simple anything bjp none judges business know person free kejriwal case presented ed basis evidence denied bail less us jagan judge critical police probe delhi riots cases transferred rouse avenue delhi high court wednesday transferred judicial officers including additional sessions judge asj vinod yadav hearing northeast delhi riots cases yadav passed several orders criticising delhi polices probe riots prompting delhi police commissioner rakesh asthana form special investigative cell sic monitor progress cases also ordered police officers posted northeast delhi riots since transferred roped probe one orders july yadav imposed fine delhi police court called casual callous farcical investigation complaint man shot left eye communal riots february last year public notice issued delhi high court listing names judges transferred said chief justice judges court pleased make following postingstransfers delhi higher judicial service convicted special cbi court conviction stayed stand elections would possible conviction message bjp much reach justice system get like even conviction ie provided bidding delhi high court stays conviction former union minister dilip ray enable contest electionshttpswwwlivelawinhighcourtdelhihighcourtdelhihighcourtcoalscamstaysconvictionformerunionministerdilipray would mattered even pmla case also could stayed courts discretion judge used discretion stay conviction guy kejriwals case discretion used legitimize arrest continue keeping detained even ask bail court use discretion keep rejecting perpetually keep imprisoned uapa cases well courts helpless matter normal criminal case accused qualify automatic bail charge sheet filed days uapa pmla dont kind limitation means discretion issue esteemed judges using discretionary powers helping bjp persecute critics helping benefactors thank bro post comment delhi high court may fair conviction special cbi court stayed allowed contest elections literal basis argued court got stay isnt funny somebody already convicted major scam conviction stayed contest elections day joined bjp meanwhile judge said kejriwal case court opinion accused arrested arrest remand examined per law per timing elections isnt funny law doesnt need take course accused joining bjp way given even chargesheet filed let alone trial judge speak evidence authenticity dumbass want dont expect everyone see exactly happening nothing happening crook booked pmln act crimes liquor case youre smart ass believe qualified sitting judge way wrong plea rejected wrongfully arrested thrown roof court categorically said kingpin case basis authentic evidences denied bail yesterday chargesheet follow later thats process well real crook see insecure loser sitting pm seat party shown received kickbacks electoral bonds people involved case later conveniently turned accused approver called authentic evidence judge access trial phase determine authentic evidence considered authentic revealed court deliberated authenticity established judge relying unsubstantiated claims revealed defense good hearsay nonexistent reach decisions dumbass morons like need stop pretending know process process well case made evident money trail cr due process followed problem lies people like cartel think say right talking foul language non sensical things traits keyboard warriors like well modi electoral bonds think topics pay grade better first get educated much money political party got also research use get money past used elections",
    "light_cleaned_title": "Is the Judiciary still Independent?",
    "light_cleaned_selftext": "Well, I was reading about Kejriwal Case and found out about this information, digging deeper into the case threw light on different Justices in High Court and Supreme Court and how they act against Politicians affiliated with different parties. Justice Swarna Kanta Sharma refused Kejriwal's bail by saying that ED has enough evidence against him, though they haven't found any money trail leading to Kejriwal's bank account and it's just witness statement (source: SC when it bailed Sanjay Singh). But Dilip Ray has Property worth crores and same Justice SK Sharma bailed him and allowed him to take part him election because his \"Right to Take part in Political Activity\" will be threatened if he wasn't bailed out. The case against him was being run by CBI and interestingly, the Judge on his case changed soon after he switched parties to BJP. Same with Supreme Court Judges, all AAP cases have gone to either Justice Sanjeev Khanna or Justice Bela Trivedi, who cancelled all Bail orders, until due to Scheduling conflicts and interference by Justice Dipankar Dutta, Sanjay Singh got bailed out, and SC said that ED couldn't link him and the Liquor Scam. My main problem is how can the same court give different judgement, do the judges follow law or their own (and their party's) interest? Sanjay Singh filed for Bail multiple times, and it got rejected, until so called \"impartial\" judge took up the case and granted him bail. Remember the incident with Rahul Gandhi where he had to lose his seat because of Defamation case? The SC stayed the lower court order but why he was given the maximum punishment for a political speech? So that he can lose his constituency? Why the SC didn't talk about the local court judge (who was arbitrarily sus). Not talking about Kolkata HC judge who gave anti TMC orders and joined BJP 1 day after his term was over. Is the judiciary really independent? Are we losing the last pillar of democracy. PS: Saw some videos of Justice Swarna Kanta Sharma where she stopped using the word India and started using the word Bharat (after the whole INDI Alliance fiasco), her talking about why being a housewife is better as wives of Hindu kings were the same (Hindu traditions are always right stuff) and other RW ideas. I don't understand why she is in a sus Conference anyways, isn't she a Judge in HC?",
    "light_cleaned_comments": "Delhi High Court? Doubtful! >Are we losing the last pillar of democracy. We already have. On the other hand we can see the judgements given by CJI. Not the whole judiciary but parts of it could be. India is never democratic , we are divided on the basis of sex religion caste and location .. but it got worsen since few years . Is it possible for a court to issue a summons to Reddit users for making such posts? I wish One correction: The Kolkata HC judge hinted towards joining a political party before he gave his resignation. He joined BJP 2 days after he resigned from his post. And later, he said that he had contacts with BJP (both he and BJP approached each other) even before him resigning, which is scary to say the least! The judiciary was never really independent when it had to deal with authoritarian governments. Check the history of it during the Indira years. It becomes hyperactive only when tolerant democrats like MMS are leading the government. This institution is the best example to show the extreme lack of principles among the highly educated upper caste urban middle class in India. Some people here keep clapping for Chandrachud just because once in a while he passes a few relatively non consequential orders against the government so that the SC can maintain the optics of being independent. These people never seem to think about how Bela Trivedi and S Khanna gets all the politically sensitive cases when the CJI is in charge of allotting cases to the benches. I am so fed up with this army of Chandrachud fans. Some people here keep clapping for Chandrachud just because once in a while he passes a few relatively non consequential orders against the government so that the SC can maintain the optics of being independent. These people never seem to think about how Bela Trivedi and S Khanna gets all the politically sensitive cases when the CJI is in charge of allotting cases to the benches or Chandrachud shamelessly signed off on the Ayodhya and article 370 verdicts to stay in the good books of the government. If you take a closer look it is clear that he is more or less maintaining his father's legacy but a bit more subtle about it. People should see this and stop portraying him as some sort of present day version of the honourable Hans Raj Khanna. Why? Is your party so weak that one reddit post will make it fall Before we conclude anything or lose remaining hope,I'd like to know few things Dilip Ray was also booked under PMLA or by ED ? Court gave judgement on Kejriwal's appeal that arrest was not needed and was done by political motives. He said that there enough evidence to continue the process of remand. He didn't ask for bail. Plus if we question everything or doubt everyone,soon we don't like the people who gave judgements that's we don't approve or like, only thing left to trust in this country is supreme court or in some cases high court. I'd like to give them benifit of doubt. Please correct me if I'm wrong or share your own opinions too, I'm open to ideas. Welp, I am scared now. Your parents should be summoned for producing you. Yeah people forget the whole episode where Modi looked the other way while the previous CJI got away with sexual harassment. And in return he got a clean chit for Rafael deal. This is nothing in front of Chandra Babu from Andhra Pradesh. ifkyk The number of cases he got 'stay' orders breaks Guinness world records. There is a gag order to not discuss on Amaravathi land Scam. Slightly unrelated but SC is showing very mixed signal depending on which judge you are allotted. Baba Ramdev and Patanjali got unlucky because they messed with the judges who clearly don't like them. I'm certain any other judge and they would have heaped praises on Baba Ramdev and Patanjali for their fake apology. Not defending those fraudsters but just pointing out the irony. Just recently (9th April 2024), his bail plea was refused by Delhi HC, and the Judge said that the ED had evidence of him being involved in the Liquor scam, based on some documents, but those documents were not shown to the defense and was only shared between Prosecutor and the Judge. The same thing happened with Sanjay Singh, but he was then bailed out by a different judge in HC. I really don't care much about Kejri, but when other bigger corrupted politicians get bail from court, and some other leader (who is also a sitting CM) doesn't, it raises a lot of questions. looks like whoever is in power...they control everything it is simple as that What it has anything to do with BJP? Its none of judge's business to know what a person does after he is free. Kejriwal case is presented by ED and on the basis of evidence he is denied bail. Less than us jagan Judge critical of police probe in delhi riots cases transferred to rouse avenue The Delhi high court on Wednesday transferred 11 judicial officers, including additional sessions judge (ASJ) Vinod Yadav, who was hearing the north-east Delhi riots cases. Yadav has passed several orders criticising the Delhi Police’s probe in the riots, prompting Delhi Police commissioner Rakesh Asthana to form a special investigative cell (SIC) to monitor the progress in the cases. He also ordered that police officers who were posted in north-east Delhi during the riots have since been transferred, should be roped in for probe. In one of the orders in July, Yadav imposed a fine of ₹25,000 on the Delhi Police for what the court called a “casual, callous and farcical” investigation into the complaint by a man who was shot in his left eye during the communal riots in February last year The public notice issued by the Delhi high court listing the names of the judges who have been transferred said: “..##the Chief Justice## and Judges of this Court have been pleased to make the following postings/transfers in the Delhi Higher Judicial Service He was convicted by a Special CBI court. His conviction was stayed so that he can stand in elections which would have not been possible with a conviction. Its just a message that BJP has so much reach in the justice system that they can get you out just like that even after a conviction, i.e. provided that you do their bidding. [Delhi High Court Stays Conviction Of Former Union Minister Dilip Ray To Enable Him To Contest Elections](https://www.livelaw.in/high-court/delhi-high-court/delhi-high-court-coal-scam-stays-conviction-former-union-minister-dilip-ray-254632) It would not have mattered even if it were a PMLA case because that also could be stayed. Courts have discretion to do that. So this judge used discretion to stay the conviction for this guy and in Kejriwal's case, the same discretion was used to legitimize his arrest and to continue keeping him detained. Even if they ask for bail, court can use their discretion to keep rejecting it and perpetually keep them imprisoned. Its the same for UAPA cases as well. Its not that courts are helpless in the matter. In a normal criminal case, the accused will qualify for automatic bail if a charge sheet is not filed in 90 days. UAPA and PMLA just don't have that kind of limitation. This just means that its up to their discretion. The issue is that our \"esteemed judges\" are using their discretionary powers for helping BJP to persecute its critics and helping their benefactors. Thank you, Bro. You should post this and comment that the Delhi High Court may not be fair His conviction by a special CBI court has been \"stayed\" to allowed him to contest elections. That was the literal basis on which they argued in court and got the stay. Isn't it funny how somebody already convicted for a major scam had their conviction stayed to contest elections just a day before he joined the BJP. Meanwhile, the same judge said this about the Kejriwal case. >This court is of the opinion that the accused has been arrested and his arrest and remand has to be examined as per law and not as per timing of elections. Isn't it funny how the law doesn't need to take its own course when the accused is joining the BJP. And by the way, given that even a chargesheet was not filed, let alone a trial, how does this judge speak of evidence or the authenticity of it? You can be a dumbass about it all you want, just don't expect everyone to not see what exactly is happening. Nothing is being happening here , a crook is booked under pmln act for the crimes he did in liquor case. And if you're such a smart ass and believe you are more qualified than a sitting judge you are all the way wrong. He plea was rejected that he has been wrongfully arrested was thrown out of the roof as the court categorically said that he is the kingpin in the case. On the basis of authentic evidences, he was denied bail yesterday. Chargesheet will follow later. Thats how the process is. Well, the real crook I see here is the insecure loser sitting in the PM seat and his party which was shown to have received kickbacks through electoral bonds from people involved in the case and later conveniently turned from accused to approver. And where is this so called \"authentic evidence\" and why does this judge have access to it before the trial phase and how did he determine it to be authentic? Evidence cannot be considered authentic before it's revealed in the court and deliberated on and it's authenticity is established. So, this judge is relying on just unsubstantiated claims which are not revealed to the defense, which is as good as hearsay and non-existent to reach decisions. Dumbass morons like you need to stop pretending that you know the process because this is not the process. Well the case is made up on the evident money trail that is there of 338 CR and due process is followed. The problem lies in people like you and your cartel who think what they say is right. Talking foul language and non sensical things are few traits of keyboard warriors like you. Well on Modi and electoral bonds I think those are the topics above your pay grade so better first get yourself educated on how much money each political party got and also research how they use to get money in the past and how it was used for elections."
}