{
    "id": "13whcf9",
    "title": "More people should know about Zero FIR. Asaram Bapu was convicted as a rapist because of it",
    "url": "https://www.reddit.com/r/india/comments/13whcf9/more_people_should_know_about_zero_fir_asaram/",
    "selftext": "Hi folks.\n\nI don't know how to begin conversations, so I am coming to the point.\n\nIt  appears that society at large is unaware of the provisions of Zero FIR,  which can be especially useful and empowering for women to get justice.\n\nOne  of the biggest problems in the Nirbhaya case was jurisdiction: Cops  from 2 different police stations argued for 30 minutes — some say even  more — about where to register the case.\n\nThis, even as she lay bleeding on the roadside.\n\nOne of the reforms the horrors of the Nirbhaya case brought was the Zero FIR.\n\nAccording  to the law, a Zero FIR is an FIR about a crime that can be lodged at  any police station, irrespective of where the crime occurred or the  police of which state, city, or area would investigate it.\n\nMore details: [https://www.deccanherald.com/national/explained-what-is-a-zero-fir-1142738.html](https://www.deccanherald.com/national/explained-what-is-a-zero-fir-1142738.html)\n\nAnd this has yielded results. One big case that started with a Zero FIR is the one because of which Asaram Bapu is jailed.\n\nThe  incident is said to have happened in Jodhpur. But the local police  there refused to take an FIR (which itself should not have happened).\n\nSo, the rape survivor and her parents lodged a Zero FIR in Delhi: [https://timesofindia.indiatimes.com/city/delhi/asaram-bapu-booked-in-delhi-for-sexual-assault-on-minor/articleshow/21952233.cms](https://timesofindia.indiatimes.com/city/delhi/asaram-bapu-booked-in-delhi-for-sexual-assault-on-minor/articleshow/21952233.cms)\n\nThe end result was Asaram Bapu was convicted of rape, and is now serving a prison term of 20 years.\n\nLawyers in the sub, please correct me if I have got anything wrong. Also, please add if I have missed something.\n\nTL;DR:  The Indian criminal justice system has provisions for Zero FIR, which  can be lodged anywhere irrespective of where the crime occurred. Asaram  Bapu is now a convicted rapist because his victim registered a Zero FIR  in Delhi because of a crime in Jodhpur.\n\nPS: Please forgive me if I have mansplained something.",
    "flair": "Law & Courts",
    "score": 590,
    "num_comments": 41,
    "created_utc": 1685525370.0,
    "convurl": "https://external-preview.redd.it/MGt1iUY1KamKVIwXs5kooZCrXJrdNX0BHSkfMV0wTbs.jpg?auto=webp&v=enabled&s=a88522c5b045254c468ea555921903f98d2e0ab4",
    "comments": [
        "Good to know.",
        "definitely belongs in r/legaladviceindia",
        "The only reason he went to jail is because the case was filed in Delhi and tried in Rajasthan. The state he actually operated from showed no interest in prosecuting him despite years of accusations against him. Absolutely no prizes to anyone for guessing which state that was and why.",
        "Its all well and good, but how much of an imbecile and moron you have to be to not include such an obvious, basic and necessary thing from the first place? Makes you wonder what sort of idiots are running the show in this pathetic excuse of a country.",
        "Why do his bhakts keep defending him. His trial was fair and  justified.",
        "Police never registers FIR despite multiple clear directions to do so. You can do nothing about it. Only courts can help.",
        "Because all their heroes are scum and they know what will happen if fair and justified trials become the norm",
        "I have no idea, but I read reddit a lot. So I am going to go with UP. It just feels on brand for everyone involved.",
        "SC issued directions in 2013 lalita Kumari case, but it depends upon nature of information. Information must be  about cognizable case .All depends upon what information given by informant.And also Justice Verma Committee set up after Nirbhaya case raised this issue.",
        "Gujarat",
        "Because that state’s cm considered him his guru, public",
        "Uske andar jaane ka fayda bhi Madhya Pradesh aur Gujarat ko hi hua he. He grabbed govt. Land in this states.",
        "Oh, that's worse. Thanks for the info though.",
        "Go to dadar police station, right in the middle of Mumbai.\nThere are about 50 posters stuck on the wall, that FIRs can be registered at any police station.\n\nAnd when you do try to file an FIR, they will blankly refuse, as they have to do follow up work on an FIR.\n\nThey don't even tell you what to do. I had to talk to a lawyer who told me to at least file a Non-Cognizant complaint. The police took it down only then, that too as an NC, so they are not required to follow up on it.\n\nThe next day when i went to file a fresh FIR, they told me to go to the next area even though this was the closest police station to me.\n\nAbsolutely disgusting our cops are, IN OUR CITIES. Just imagine how they are in the rest of our country.",
        "A person idolises another person of same values. His bhakts are scum.",
        "You weren't too far",
        "Hey, OP . I appreciate your post as I didn't know about zero FIR and this actually puts me at ease knowing that I can lodge it anywhere. However, when I read the last line and you were apologising for mansplaining, I thought I should let you know that this doesn't count as such. If you had gone to a legal centric sub with lawyers and such and made this post there then it could have been seen as mansplaining. Could've, depends on your language but could've. However, seeing that this sub is just a normal sub with no focus on specialisation this doesn't count as such. I do love how you're looking into your blind spots and we need more people like you.",
        "Not 20 years but till death prison",
        "Thanks a lot for sharing the detailed information, OP",
        "Great post, but I don’t think we need a PS about mansplaining here. Like how would anyone even know you are a man in the first place .",
        "Another option is to go with an Online FIR option folks. In case you are not able to get a station to file the FIR, get a lawyer and file an online.",
        "Another thing which most people don't know when the police denies to register your FIR you have two options-\n\n\n\n1. File an application to the SP of your city that this police station is not accepting my FIR then it will most likely be registered.\n\n\n2. You can directly file a complaint case before the judicial magistrate aka court under section 190(3) of CrPC if your case is of criminal nature. The court would take cognizance and direct the police to register FIR and conduct investigation.",
        "Is zero FIR applicable only for rape cases ?",
        "How'd you think you mansplained? What should other gender do now, womenunderstand?",
        "What is that P.S at the end? What? So men need to apologize for explaining?",
        "I have a couple questions over this since a long time. Those knowledgeable in law please shade light if you can.\n\nWhat I understand from this is if the police in a jurisdiction refuses to file an FIR for any reason, one can file it in any other police station of different jurisdiction.\n\nSo they made changes and introduced one more type of FIR, and called it Zero FIR. So now we have 2 types of FIRs - Regular & Zero.\n\nMy questions are –\n\nInstead of introducing another type, why didn’t we make amendments to the definition of existing FIR to accommodate scenarios such as these?\n\nWhy can we simply not call it an FIR - something that can be filed anywhere irrespective of jurisdiction?\n\nIs Zero FIR limited to only certain crimes? Such as sexual assault etc.",
        "History repeating right now for WFI Cheif, seers from Ayodhya supporting this scum like nothing ever happened.",
        "Bandaa movie showing same as its based in that bapu case",
        "He practically runs a cult its no wonder that his followers support his every word. My roommate in college was a follower of the dera sacha sauda which is basically the ram raheem guy who also ended up in jail for rape and it was the most embarrassing thing for him that his parents still supported the dera after all that. After which he became a hardcore atheist probably not the best transition but this is what generally happens. You either buy into this stuff harder or you become completely disillusioned.",
        "Ram Rajya becoming Ravan Rajya. Kalyug is here as they say.",
        "Been alive for 31 years now. I am yet to meet an honest cop. God I hate them. I don't even feel afraid of them anymore. They're so cheap and easily bought.",
        "People who don't know him ,see\n\nhttps://preview.redd.it/1i19aejgad3b1.jpeg?width=720&format=pjpg&auto=webp&v=enabled&s=22e5072c4f6cb5226833aac08ecb809efe554a42",
        "spot on with Zero FIR. Useful when local police is useless.",
        " PS: Please forgive me if I have mansplained something. \n\n???"
    ],
    "cleaned_text": "people know zero fir asaram bapu convicted rapist hi folks dont know begin conversations coming point appears society large unaware provisions zero fir especially useful empowering women get justice one biggest problems nirbhaya case jurisdiction cops different police stations argued minutes say even register case even lay bleeding roadside one reforms horrors nirbhaya case brought zero fir according law zero fir fir crime lodged police station irrespective crime occurred police state city area would investigate details httpswwwdeccanheraldcomnationalexplainedwhatisazerofirhtmlhttpswwwdeccanheraldcomnationalexplainedwhatisazerofirhtml yielded results one big case started zero fir one asaram bapu jailed incident said happened jodhpur local police refused take fir happened rape survivor parents lodged zero fir delhi httpstimesofindiaindiatimescomcitydelhiasarambapubookedindelhiforsexualassaultonminorarticleshowcmshttpstimesofindiaindiatimescomcitydelhiasarambapubookedindelhiforsexualassaultonminorarticleshowcms end result asaram bapu convicted rape serving prison term years lawyers sub please correct got anything wrong also please add missed something tldr indian criminal justice system provisions zero fir lodged anywhere irrespective crime occurred asaram bapu convicted rapist victim registered zero fir delhi crime jodhpur ps please forgive mansplained something ",
    "cleaned_title": "people know zero fir asaram bapu convicted rapist",
    "cleaned_selftext": "hi folks dont know begin conversations coming point appears society large unaware provisions zero fir especially useful empowering women get justice one biggest problems nirbhaya case jurisdiction cops different police stations argued minutes say even register case even lay bleeding roadside one reforms horrors nirbhaya case brought zero fir according law zero fir fir crime lodged police station irrespective crime occurred police state city area would investigate details httpswwwdeccanheraldcomnationalexplainedwhatisazerofirhtmlhttpswwwdeccanheraldcomnationalexplainedwhatisazerofirhtml yielded results one big case started zero fir one asaram bapu jailed incident said happened jodhpur local police refused take fir happened rape survivor parents lodged zero fir delhi httpstimesofindiaindiatimescomcitydelhiasarambapubookedindelhiforsexualassaultonminorarticleshowcmshttpstimesofindiaindiatimescomcitydelhiasarambapubookedindelhiforsexualassaultonminorarticleshowcms end result asaram bapu convicted rape serving prison term years lawyers sub please correct got anything wrong also please add missed something tldr indian criminal justice system provisions zero fir lodged anywhere irrespective crime occurred asaram bapu convicted rapist victim registered zero fir delhi crime jodhpur ps please forgive mansplained something",
    "cleaned_comments": "good know definitely belongs rlegaladviceindia reason went jail case filed delhi tried rajasthan state actually operated showed interest prosecuting despite years accusations absolutely prizes anyone guessing state well good much imbecile moron include obvious basic necessary thing first place makes wonder sort idiots running show pathetic excuse country bhakts keep defending trial fair justified police never registers fir despite multiple clear directions nothing courts help heroes scum know happen fair justified trials become norm idea read reddit lot going go feels brand everyone involved sc issued directions lalita kumari case depends upon nature information information must cognizable case depends upon information given informantand also justice verma committee set nirbhaya case raised issue gujarat states cm considered guru public uske andar jaane ka fayda bhi madhya pradesh aur gujarat ko hi hua grabbed govt land states oh thats worse thanks info though go dadar police station right middle mumbai posters stuck wall firs registered police station try file fir blankly refuse follow work fir dont even tell talk lawyer told least file noncognizant complaint police took nc required follow next day went file fresh fir told go next area even though closest police station absolutely disgusting cops cities imagine rest country person idolises another person values bhakts scum werent far hey op appreciate post didnt know zero fir actually puts ease knowing lodge anywhere however read last line apologising mansplaining thought let know doesnt count gone legal centric sub lawyers made post could seen mansplaining couldve depends language couldve however seeing sub normal sub focus specialisation doesnt count love youre looking blind spots need people like years till death prison thanks lot sharing detailed information op great post dont think need ps mansplaining like would anyone even know man first place another option go online fir option folks case able get station file fir get lawyer file online another thing people dont know police denies register fir two options file application sp city police station accepting fir likely registered directly file complaint case judicial magistrate aka court section crpc case criminal nature court would take cognizance direct police register fir conduct investigation zero fir applicable rape cases howd think mansplained gender womenunderstand ps end men need apologize explaining couple questions since long time knowledgeable law please shade light understand police jurisdiction refuses file fir reason one file police station different jurisdiction made changes introduced one type fir called zero fir types firs regular zero questions instead introducing another type didnt make amendments definition existing fir accommodate scenarios simply call fir something filed anywhere irrespective jurisdiction zero fir limited certain crimes sexual assault etc history repeating right wfi cheif seers ayodhya supporting scum like nothing ever happened bandaa movie showing based bapu case practically runs cult wonder followers support every word roommate college follower dera sacha sauda basically ram raheem guy also ended jail rape embarrassing thing parents still supported dera became hardcore atheist probably best transition generally happens either buy stuff harder become completely disillusioned ram rajya becoming ravan rajya kalyug say alive years yet meet honest cop god hate dont even feel afraid anymore theyre cheap easily bought people dont know see spot zero fir useful local police useless ps please forgive mansplained something",
    "light_cleaned_title": "More people should know about Zero FIR. Asaram Bapu was convicted as a rapist because of it",
    "light_cleaned_selftext": "Hi folks. I don't know how to begin conversations, so I am coming to the point. It appears that society at large is unaware of the provisions of Zero FIR, which can be especially useful and empowering for women to get justice. One of the biggest problems in the Nirbhaya case was jurisdiction: Cops from 2 different police stations argued for 30 minutes — some say even more — about where to register the case. This, even as she lay bleeding on the roadside. One of the reforms the horrors of the Nirbhaya case brought was the Zero FIR. According to the law, a Zero FIR is an FIR about a crime that can be lodged at any police station, irrespective of where the crime occurred or the police of which state, city, or area would investigate it. More details: [https://www.deccanherald.com/national/explained-what-is-a-zero-fir-1142738.html](https://www.deccanherald.com/national/explained-what-is-a-zero-fir-1142738.html) And this has yielded results. One big case that started with a Zero FIR is the one because of which Asaram Bapu is jailed. The incident is said to have happened in Jodhpur. But the local police there refused to take an FIR (which itself should not have happened). So, the rape survivor and her parents lodged a Zero FIR in Delhi: [https://timesofindia.indiatimes.com/city/delhi/asaram-bapu-booked-in-delhi-for-sexual-assault-on-minor/articleshow/21952233.cms](https://timesofindia.indiatimes.com/city/delhi/asaram-bapu-booked-in-delhi-for-sexual-assault-on-minor/articleshow/21952233.cms) The end result was Asaram Bapu was convicted of rape, and is now serving a prison term of 20 years. Lawyers in the sub, please correct me if I have got anything wrong. Also, please add if I have missed something. TL;DR: The Indian criminal justice system has provisions for Zero FIR, which can be lodged anywhere irrespective of where the crime occurred. Asaram Bapu is now a convicted rapist because his victim registered a Zero FIR in Delhi because of a crime in Jodhpur. PS: Please forgive me if I have mansplained something.",
    "light_cleaned_comments": "Good to know. definitely belongs in r/legaladviceindia The only reason he went to jail is because the case was filed in Delhi and tried in Rajasthan. The state he actually operated from showed no interest in prosecuting him despite years of accusations against him. Absolutely no prizes to anyone for guessing which state that was and why. Its all well and good, but how much of an imbecile and moron you have to be to not include such an obvious, basic and necessary thing from the first place? Makes you wonder what sort of idiots are running the show in this pathetic excuse of a country. Why do his bhakts keep defending him. His trial was fair and justified. Police never registers FIR despite multiple clear directions to do so. You can do nothing about it. Only courts can help. Because all their heroes are scum and they know what will happen if fair and justified trials become the norm I have no idea, but I read reddit a lot. So I am going to go with UP. It just feels on brand for everyone involved. SC issued directions in 2013 lalita Kumari case, but it depends upon nature of information. Information must be about cognizable case .All depends upon what information given by informant.And also Justice Verma Committee set up after Nirbhaya case raised this issue. Gujarat Because that state’s cm considered him his guru, public Uske andar jaane ka fayda bhi Madhya Pradesh aur Gujarat ko hi hua he. He grabbed govt. Land in this states. Oh, that's worse. Thanks for the info though. Go to dadar police station, right in the middle of Mumbai. There are about 50 posters stuck on the wall, that FIRs can be registered at any police station. And when you do try to file an FIR, they will blankly refuse, as they have to do follow up work on an FIR. They don't even tell you what to do. I had to talk to a lawyer who told me to at least file a Non-Cognizant complaint. The police took it down only then, that too as an NC, so they are not required to follow up on it. The next day when i went to file a fresh FIR, they told me to go to the next area even though this was the closest police station to me. Absolutely disgusting our cops are, IN OUR CITIES. Just imagine how they are in the rest of our country. A person idolises another person of same values. His bhakts are scum. You weren't too far Hey, OP . I appreciate your post as I didn't know about zero FIR and this actually puts me at ease knowing that I can lodge it anywhere. However, when I read the last line and you were apologising for mansplaining, I thought I should let you know that this doesn't count as such. If you had gone to a legal centric sub with lawyers and such and made this post there then it could have been seen as mansplaining. Could've, depends on your language but could've. However, seeing that this sub is just a normal sub with no focus on specialisation this doesn't count as such. I do love how you're looking into your blind spots and we need more people like you. Not 20 years but till death prison Thanks a lot for sharing the detailed information, OP Great post, but I don’t think we need a PS about mansplaining here. Like how would anyone even know you are a man in the first place . Another option is to go with an Online FIR option folks. In case you are not able to get a station to file the FIR, get a lawyer and file an online. Another thing which most people don't know when the police denies to register your FIR you have two options- 1. File an application to the SP of your city that this police station is not accepting my FIR then it will most likely be registered. 2. You can directly file a complaint case before the judicial magistrate aka court under section 190(3) of CrPC if your case is of criminal nature. The court would take cognizance and direct the police to register FIR and conduct investigation. Is zero FIR applicable only for rape cases ? How'd you think you mansplained? What should other gender do now, womenunderstand? What is that P.S at the end? What? So men need to apologize for explaining? I have a couple questions over this since a long time. Those knowledgeable in law please shade light if you can. What I understand from this is if the police in a jurisdiction refuses to file an FIR for any reason, one can file it in any other police station of different jurisdiction. So they made changes and introduced one more type of FIR, and called it Zero FIR. So now we have 2 types of FIRs - Regular & Zero. My questions are – Instead of introducing another type, why didn’t we make amendments to the definition of existing FIR to accommodate scenarios such as these? Why can we simply not call it an FIR - something that can be filed anywhere irrespective of jurisdiction? Is Zero FIR limited to only certain crimes? Such as sexual assault etc. History repeating right now for WFI Cheif, seers from Ayodhya supporting this scum like nothing ever happened. Bandaa movie showing same as its based in that bapu case He practically runs a cult its no wonder that his followers support his every word. My roommate in college was a follower of the dera sacha sauda which is basically the ram raheem guy who also ended up in jail for rape and it was the most embarrassing thing for him that his parents still supported the dera after all that. After which he became a hardcore atheist probably not the best transition but this is what generally happens. You either buy into this stuff harder or you become completely disillusioned. Ram Rajya becoming Ravan Rajya. Kalyug is here as they say. Been alive for 31 years now. I am yet to meet an honest cop. God I hate them. I don't even feel afraid of them anymore. They're so cheap and easily bought. People who don't know him ,see spot on with Zero FIR. Useful when local police is useless. PS: Please forgive me if I have mansplained something. ???"
}