{
    "id": "16yndbs",
    "title": "So many arrests; even more distractions",
    "url": "https://www.reddit.com/r/india/comments/16yndbs/so_many_arrests_even_more_distractions/",
    "selftext": "Okay. Since morning, we’ve been seeing reports of several activists being arrested or detained across India. \n\nhttps://thewire.in/rights/nia-raids-62-andhra-pradesh-telangana-maoist\n\nhttps://www.thequint.com/news/india/delhi-police-raids-journalists-newsclick-probe-phones-laptop-seized\n\nThis literally happened the day after Gandhi Jayanthi. Such naked display of fear disguised as arrogance. \n\nApparently, there’s arguments that this was done to distract from the issues of caste census. \n\nhttps://www.thequint.com/news/politics/fascism-distraction-from-bihar-caste-survey-india-bloc-reacts-newsclick-raids\n\nThe dispensation was assuming that by distracting the people they would be able to skim through their failures. But like, people come on, be distracted by something like intentional wardrobe malfunctions of hot celebs, not flexing of state power on useless students and activists.\n\nAnyway, let’s make a list of better things to be distracted by.\n\n /rant",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696326078.0,
    "convurl": "https://external-preview.redd.it/NpLVtN94703uvKdwcvhvdEGtThE7U-uBme07wPveXV8.jpg?auto=webp&s=c480cf018aebe34ce4f166dc48549b2538db3ff8",
    "comments": [],
    "cleaned_text": "many arrests even distractions okay since morning weve seeing reports several activists arrested detained across india literally happened day gandhi jayanthi naked display fear disguised arrogance apparently theres arguments done distract issues caste census dispensation assuming distracting people would able skim failures like people come distracted something like intentional wardrobe malfunctions hot celebs flexing state power useless students activists anyway lets make list better things distracted rant ",
    "cleaned_title": "many arrests even distractions",
    "cleaned_selftext": "okay since morning weve seeing reports several activists arrested detained across india literally happened day gandhi jayanthi naked display fear disguised arrogance apparently theres arguments done distract issues caste census dispensation assuming distracting people would able skim failures like people come distracted something like intentional wardrobe malfunctions hot celebs flexing state power useless students activists anyway lets make list better things distracted rant",
    "cleaned_comments": "",
    "light_cleaned_title": "So many arrests; even more distractions",
    "light_cleaned_selftext": "Okay. Since morning, we’ve been seeing reports of several activists being arrested or detained across India. This literally happened the day after Gandhi Jayanthi. Such naked display of fear disguised as arrogance. Apparently, there’s arguments that this was done to distract from the issues of caste census. The dispensation was assuming that by distracting the people they would be able to skim through their failures. But like, people come on, be distracted by something like intentional wardrobe malfunctions of hot celebs, not flexing of state power on useless students and activists. Anyway, let’s make a list of better things to be distracted by. /rant",
    "light_cleaned_comments": ""
}