{
    "id": "1edyxzb",
    "title": "Missing woman, 20, found stabbed to death on Maha road.",
    "url": "https://timesofindia.indiatimes.com/city/navi-mumbai/missing-woman-20-found-stabbed-to-death-on-maha-road/articleshow/112072638.cms",
    "selftext": "A 20-year-old woman from Uran, Yashashri Shinde, was found murdered near a petrol pump. She had informed her parents she was visiting a friend. Her parents suspect Dawood Shaikh, previously accused of molestation by Shinde, as the culprit. Police are treating the case as a murder by an unidentified person.",
    "flair": "Crime",
    "score": 141,
    "num_comments": 5,
    "created_utc": 1722140002.0,
    "convurl": "https://external-preview.redd.it/dV53LoprFolg6ORLub0UrojROo18RvvQD1JT2MbyaI4.jpg?auto=webp&s=a850416dfa75610d98b55ef4473fa6922f2a040a",
    "comments": [
        "Definitely a guy who was obsessing over her.",
        "RIP, she deserves better",
        "Peaceful community  at it again. Gandmasti",
        "Men? Yes.",
        "The Bangalore incident happened just like yesterday. Please do comment on the religion of that person too. \n\nA criminal is a criminal irrespective of their religion. When are you guys going to understand this?"
    ],
    "cleaned_text": "missing woman found stabbed death maha road yearold woman uran yashashri shinde found murdered near petrol pump informed parents visiting friend parents suspect dawood shaikh previously accused molestation shinde culprit police treating case murder unidentified person ",
    "cleaned_title": "missing woman found stabbed death maha road",
    "cleaned_selftext": "yearold woman uran yashashri shinde found murdered near petrol pump informed parents visiting friend parents suspect dawood shaikh previously accused molestation shinde culprit police treating case murder unidentified person",
    "cleaned_comments": "definitely guy obsessing rip deserves better peaceful community gandmasti men yes bangalore incident happened like yesterday please comment religion person criminal criminal irrespective religion guys going understand",
    "light_cleaned_title": "Missing woman, 20, found stabbed to death on Maha road.",
    "light_cleaned_selftext": "A 20-year-old woman from Uran, Yashashri Shinde, was found murdered near a petrol pump. She had informed her parents she was visiting a friend. Her parents suspect Dawood Shaikh, previously accused of molestation by Shinde, as the culprit. Police are treating the case as a murder by an unidentified person.",
    "light_cleaned_comments": "Definitely a guy who was obsessing over her. RIP, she deserves better Peaceful community at it again. Gandmasti Men? Yes. The Bangalore incident happened just like yesterday. Please do comment on the religion of that person too. A criminal is a criminal irrespective of their religion. When are you guys going to understand this?"
}