{
    "id": "16vasa8",
    "title": "UPDATE: the 12 y/o girl who got raped in ujjain is currently in arvindo hospital in indore",
    "url": "https://www.reddit.com/r/india/comments/16vasa8/update_the_12_yo_girl_who_got_raped_in_ujjain_is/",
    "selftext": "[https://timesofindia.indiatimes.com/city/indore/madhya-pradesh-four-more-detained-in-ujjain-rape-case/articleshow/104013706.cms?from=mdr](https://timesofindia.indiatimes.com/city/indore/madhya-pradesh-four-more-detained-in-ujjain-rape-case/articleshow/104013706.cms?from=mdr) \\- TOI's update report  \n\n\n[https://www.youtube.com/watch?v=TIynNFZdY44](https://www.youtube.com/watch?v=TIynNFZdY44) \\- priest's (who helped her and took her to police) interview  \n\n\nGirl is from satna who was reported missing by her grandfather. her mother doesn't live with the family since her childhood, father is mentally unstable. local police inspector has taken up the responsibilty for her treatment, further studies, marriage (adopted her).\n\nread TOI's report for further details.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695991773.0,
    "convurl": "https://external-preview.redd.it/UlXh0sx3XC1vi5uVnGr9VgFFJyH9GzXUv58Efzx-oGQ.jpg?auto=webp&s=7816e120b4ae43f290598f4739f864e4dd64f538",
    "comments": [],
    "cleaned_text": "update yo girl got raped ujjain currently arvindo hospital indore httpstimesofindiaindiatimescomcityindoremadhyapradeshfourmoredetainedinujjainrapecasearticleshowcmsfrommdrhttpstimesofindiaindiatimescomcityindoremadhyapradeshfourmoredetainedinujjainrapecasearticleshowcmsfrommdr tois update report httpswwwyoutubecomwatchvtiynnfzdyhttpswwwyoutubecomwatchvtiynnfzdy priests helped took police interview girl satna reported missing grandfather mother doesnt live family since childhood father mentally unstable local police inspector taken responsibilty treatment studies marriage adopted read tois report details ",
    "cleaned_title": "update yo girl got raped ujjain currently arvindo hospital indore",
    "cleaned_selftext": "httpstimesofindiaindiatimescomcityindoremadhyapradeshfourmoredetainedinujjainrapecasearticleshowcmsfrommdrhttpstimesofindiaindiatimescomcityindoremadhyapradeshfourmoredetainedinujjainrapecasearticleshowcmsfrommdr tois update report httpswwwyoutubecomwatchvtiynnfzdyhttpswwwyoutubecomwatchvtiynnfzdy priests helped took police interview girl satna reported missing grandfather mother doesnt live family since childhood father mentally unstable local police inspector taken responsibilty treatment studies marriage adopted read tois report details",
    "cleaned_comments": "",
    "light_cleaned_title": "UPDATE: the 12 y/o girl who got raped in ujjain is currently in arvindo hospital in indore",
    "light_cleaned_selftext": "[https://timesofindia.indiatimes.com/city/indore/madhya-pradesh-four-more-detained-in-ujjain-rape-case/articleshow/104013706.cms?from=mdr](https://timesofindia.indiatimes.com/city/indore/madhya-pradesh-four-more-detained-in-ujjain-rape-case/articleshow/104013706.cms?from=mdr) \\- TOI's update report [https://www.youtube.com/watch?v=TIynNFZdY44](https://www.youtube.com/watch?v=TIynNFZdY44) \\- priest's (who helped her and took her to police) interview Girl is from satna who was reported missing by her grandfather. her mother doesn't live with the family since her childhood, father is mentally unstable. local police inspector has taken up the responsibilty for her treatment, further studies, marriage (adopted her). read TOI's report for further details.",
    "light_cleaned_comments": ""
}