{
    "id": "13wnb9u",
    "title": "Complete Transcript of Rahul Gandhi's address in America today",
    "url": "https://www.reddit.com/r/india/comments/13wnb9u/complete_transcript_of_rahul_gandhis_address_in/",
    "selftext": "Video link: https://www.youtube.com/watch?v=Yzr1u7fdqAQ\n\n**Note:** Rough transcript was taken from Youtube, edited heavily by me. Transcript is very close to complete, although there may be some minuscule parts which were incoherent and hence not part of it.\n\n### Transcript\n\nBrothers and sisters, friends and I don't see the children who sang but, where are they, yeah I'd like to welcome all of you and thank all of you for coming here and also thank the wonderful children for the song they sang it was sung very movingly and very well.\n\nSome months ago, we started a walk from Kanyakumari to Kashmir. Prior to walking, we were finding that the normal tools that we used to use for politics, conversations like this public meetings was simply not working anymore. All the instruments that we needed to do politics in India - they were controlled by the BJP and the RSS. You know people are threatened, this is (important?) people, agencies are used on people. So, we were also finding that in some way it had become quite difficult to act politically and that's why we decided to walk from southernmost tip of India to Srinagar. \n\nWhen we started, I thought okay. After five or six days, we realized that actually walking four thousand kilometers is not an easy thing you know and and I had an old knee injury that started to act-up. So I said now I’m in real trouble because there's no choice - one has to walk and I'm having quite a lot of pain then quite a surprising thing happened just I started noticing that after walking 25 kilometers - 25 kilometers is more than half a marathon - after walking three weeks every day 25 kilometers I suddenly felt one afternoon that it's strange that I'm not feeling tired at all. I get up in the morning six o'clock - we used to start and we used to end walking at about 7.30-8 in the evening. I was like, this is very strange - I'm not feeling tired at all, What is this? then I started asking people around if they are feeling tired, everybody is saying it's very strange that they're not feeling tired as well. \n\nSo I started to think about it and I realized that actually what was going on was that it was not us who were walking, it was India that was walking with us, right, and the large mass of people who are coming from all religions, all communities, everybody, kids - they were creating an atmosphere of love and affection where nobody was feeling tired. Almost as if, everybody was walking together, helping each other, and that's where we came up with the idea - Nafrat ke bazaar mein mohabbat ki dukaan kholi (*We opened a shop of love amidst the market of hate*).\n\n[Applause]welcome welcome[Music][Applause][Music][Applause][Music]\n\n[Commotion in the back of the conference]\n\nSee, the interesting thing about us, about the congress party, is we have affection towards everybody - if someone wants to come, and say something - regardless of what they're saying, we're happy to listen to it. We are not going to get angry, we're not going to get aggressive, we'll nicely listen to it. In fact, we'll be affectionate to them we'll be loving to them because that's our nature.\n\nSo, we found that when everybody started walking together - completely different type of energy started coming and I noticed that the government tried everything. [*I mean, they tried all their might in stopping the yatra. They used police - but it didn't work - but the effect of Yatra was constantly rising. Why it happened was because you all helped us.*] Not only in India, Bharat Jodo is an idea that is in all your hearts. And, it is about respecting each other and being affectionate to each other, it is about being not being violent towards each other, not being arrogant. I can see my Sikh Brothers here. Your Guru nanakji - his entire life was about this only. That, be humble, right, be humble, be affectionate and we walked nothing compared to Guru Nanakji. I read somewhere that Guru nanakji had gone all the way to Mecca, Saudi Arabia, he had gone to Thailand, he head gone to Sri Lanka. So, these Giants were doing Bharat Jodo much before we were born, right? And I can say the same for my friends from Karnataka - Basavanaji, friends from Kerala - Narayana Guruji. \n\nYeah so every state in India has had these Giants everywhere. I mean and every single one of them said listen to each other, be respectful - not just of your own religion, not just of your own language, not just of your own culture - but be respectful towards all cultures, all religions, all languages because they are in fact the same. And, the assault that is taking place in India - it's taking place on our way of life. Sam Petrodaji said that he grew up with all people living happily - different languages, different religions and that is what is being attacked. Also, the tradition in India and again something like GurunanakJi, Basavanaji, Gandhiji emphasized that not to be under the impression that you know everything that the world is too big too complicated for any one person to think that he understands everything and he knows everything. And so really that is the disease that Sam outlined that that is the disease that we have a group of people in India who are absolutely convinced that they know everything. In fact I think they think maybe they know even more than God. They could they could sit down with God and have a conversation and explain to him you know about what is going on and of course our prime minister is one such specimen. \n\n[Applause]\n\nI think I think if you if you sat Modiji down next to God Modiji would start explaining to God how the universe works. And, God would get confused that what have I created. So these are these are funny things but but really this is what is going on we have a group of people you know who understand everything. They can speak to scientists and explain science to them. They can you know speak to historians and explain history to them. They can explain Warfare to the Army and flying to the Air Force. Whatever they want, they can you know and at the heart of it is mediocrity. That they actually don't understand anything because because in life you cannot understand anything if you are not ready to listen. That's something the biggest - lesson I learned from Bharat Jodo yatra that there is something to learn from everybody. We are much older than those children but I can guarantee you they can teach us all how to sing. I was looking at them and I was thinking you know I can't sing like that. It's impossible, so when you look at another person, you have to appreciate that they have an experience, they have a life, they have seen things and maybe you can learn a lot from them. Maybe if you open your ears, you will listen to them and learn from them. And that is actually the Indian tradition. If you look if you look at our country, you will find that our country has the ability to absorb any idea that comes. India has never rejected any idea. Everybody who has come to India - has been received with open arms and their ideas have been absorbed in India. And that is the India that we like - India that respects the rest of the world, India that is humble, India that listens, India that is affectionate. \n\nAnd that is the India that you represent. You would not be here if you do not if you did not agree with these values. If you if you believed in anger, hatred, arrogance - you'd be sitting in a BJP meeting. And, I would be doing Mann ki Baat.\n\n[Applause]\n\nThank you very much for holding up the Indian flag in America. Showing the American people, what it means to be Indian, respecting them, respecting their culture, learning from them and also allowing them to learn from you. You make us all proud. And, when we think of our country, you're all our ambassadors. When America says Indian people are extremely intelligent, Indian people or masters of IT, Indian people are respectful - all these ideas that have come, they've come because of you and because of your actions and your behaviors. So I thank you very much for that.\n\nI came here this morning, Sam organized the flight - I arrived after 16 hours of flying - 6.30 in the morning - I thought I'd be tired but I'm not tired at all because of the energy that you have given me. Thank you.\n\n[After a break]\n\nThey've asked me to answer your questions. See that that also would not happen in a BJP meeting.\n\n\n**Question 1** - So I would like to ask you two questions - regarding this woman bill that has been uh you know in the court for almost more than half a century, so when the Congress comes in power - bill about woman's reservation rights - so that bill has been there for more than a quarter Century. So as a congress leader,  what are your thoughts on it and how are you gonna deal with it? That's my first question. The second question is - In India, it's very hard for a woman - as a safety issue - so what are we going to you know offer our next generation of the girls in India. Thank you.\n\n**Rahul Gandhi** - So on the women's reservation Bill - we are committed to that. We wanted to pass it in the last government but some of our allies were not too happy with it and they didn't give us the support for that bill. But I'm confident when we come to power we'll pass that bill. I think part of the answer to your second question lies in the first question itself. If we empower women, if we involve women in the political system, if we give women space in the governance of the country, if we give women space in the businesses of the country, we will automatically make them safer. So I think involving them in politics, involving them in business, involving them in running the country are the way to give them power. Thank you. \n\n**Question 2** - Hello Rahul ji, my name is Pugal. I'm the president of indo-american society for science, reason and free-thought. I also represent tamils who live in Bay Area. On behalf of our people and on behalf of people who believe in science, reason and free-thought, I would like to point out the we are honored, humbled and most truly, proud of your journey about opening up the shops of Love on the streets of hate all over the India. Tamils have long tradition of harboring Brotherhood mindset throughout their civilization - three thousand years ago our forefathers said\n\n[Speaks in Tamil]\n\n[Applause]\n\nTranslation - All human beings are created equal and every town is our town, everybody is our relative. \n\nTo us, India is like European Union with each state having its own language, its own tradition, its own festivals, its own Cuisine, dress code, way of living etc etc. They are all different, yet we live under one country called India therefore it is deeply saddening to us when someone from the Union Government try to impose one language one culture, one tradition, one religion, one school Etc. Recognizing this diversity to make a robust country, our beloved leader - the Dravidian icon former Chief Minister proclaimed, both in Parliament and in public forums, [Speaks in tamil] which means autonomous rule at the state level and federal rule at the union level.\n\nDear Rahulji, you have studied in America and you have traveled within United States extensively and you know much better than anyone else in this room that America is the best example of federalism. Each state has its own Constitution. It's one Supreme Court apart from federal laws. Whereas in India, congress party did have its own share of problems in the past but the times have changed the new thinking has emerged and you are the epitome of the new thinking. You are they new Hope and the streets of hate in India - my question to you is that like United States of America what's your thought on making India as a true United States of India. Thank you[Applause]\n\n**Rahul Gandhi** - If you read our constitution, the definition of India in the constitution is a union of states and within our constitution is the idea that the languages, cultures, histories of each one of our states has to be protected under the union. So what you're talking about, is already incorporated in our constitution, it's already there. The BJP and the RSS are attacking that idea that you mentioned and also the constitution of India. That is fact now. For me personally, I understand that the Tamil language is more than a language to Tamil people, right? It is not just a language, it is their history, it is their culture, it is their way of life and I will never ever allow Tamil language to be threatened. [Applause] \n\nThreatening the Tamil language is to threaten the idea of India just like threatening Bengali or threatening kannada or threatening Hindi or threatening Punjabi are all attacks on India. So our strength unlike many other countries, our strength comes from our diversity, our strength comes from accepting that we are all different, but we can work together and that is an idea that I'm sure you and the congress party are protecting. Thank you. \n\n**Question 3** - Hello Rahulji, I am Ganapathy. We welcome you here. We wholeheartedly thank you for taking up the fight against the fascism. So this rise of fascism is not a mere coincidence - and we believe in the social and the economic equality in the society and the inequality actually creates a conducive environment for fascism to emerge. So my question is like what is the plan of the Indian National Congress to improve the economic and the social inequality which creates this condition for fascism in the Indian subcontinent and also at the global level. \n\n**Rahul Gandhi** - One of the things that we are suggesting is when we were in government we had carried out a caste census and the idea behind the caste senses was to take an x-ray of Indian Society - to find out what are the exact demographics of our country, what are the different communities, what are the different costs, how many people in each community, how many people in each caste, because without understanding our demographics and without understanding who is who, it is very difficult to distribute wealth, distribute power effectively.\n\nSo that was one idea that we had and we've been putting pressure on the BJP to release the caste census, the numbers and they are of course not doing it and we'll continue to apply pressure and if we come to power we will do that but we are committed as the congress party to make India a fair place and we understand deeply that India today in terms of its treatment of dalits, tribals, poor people, minorities is not a fair place. And, there are many many things that can be done - there is the Nyay scheme that we had which was aimed at providing a minimum income to all Indians, there are ideas like MNREGA. I think an increase in public education, increase in public health care - I thinkthese are all things that can be done to make India a much more equal and fair place. Thank you.\n\n\n**Question 4** - Rahulji, now the parliament Lok Sabha seats are increasing to 888 - what's your take on it? There's a proposal that you know Modiji is actually working on-  it is going to be entirely based on population. It is going to tilt you know the orientation towards the highly popular states getting more and more Lion Share of the revenues and everything - so it's going to change everything you know - minorities are going to get even more depressed, you know majorities are going to be you know making everybody vulnerable - so what's your take on it?\n\n**Rahul Gandhi** - Exactly how they're thinking about doingit - but I think one has to be very very carefully - when one change changes the representative structure of a country. So I'd be quite interested in understanding exactly how they've comeup with the number 800 [sic] and what are the criteria that they're using - these things should not be done flippantly. India is a conversation, India is a negotiation between its languages, between its people, between its histories and cultures and that negotiation has to be fair - meaning all parts of India, all the states of India should feel that there is fairness in the process of negotiation. If I see exactly how they are coming up with 800 and what is the design then I would be able to answer whether I agree with the number 800 but I haven't seen the way they're calculating it [Inaudible audio in the background], but it depends how they how the ratios change- yeah it is currently based on the population but you'll have to see how the ratios change. \n\nI think the Parliament House - these are the distractions - the real issues in India are unemployment, price rise, spread of anger and hatred , crumbling education system, price of Education, price of Health Care - these are the real issues. BJP can't really discuss them, so then they have to do the whole skepter thing, you know lying down and doing all that aren't you happy I'm not lying down? Thank you.\n\n**Question 5** - Rahulji, Thank you so much for coming all the way here. I think this is something which we were starving for as Muslims from the Bay Area. We all want to thank you for your time and for your efforts in coming all the way here. As you know that you know Muslims have the security threat today like it was never before. The way we see today, like whenever we call and talk to anybody, it's like what's going on. There are so many different laws which are getting implemented which were not even implemented earlier - if it is just about the security it's okay, but then if it goes on and they are putting Muslim kids in the jails for the crime they have not committed - what strategy will you adopt or what hope are you giving to Indian Muslims which is going to change the whole thing back to the point where we were and get back to the normal stream to develop India the the best way?\n\n**Rahul Gandhi** - For me to explain that is the line - Nafrat ke bazaar mein mohabbat ki dukaan kholi (*We opened a shop of love amidst the market of hate*) - that is the best way I can say it which is that it is felt most strongly by the Muslim Community. Okay, because it is done most directly to them but in fact it is being done to all minorities - I can guarantee you that the same way you're feeling attacked, I can guarantee you my Sikh brothers are feeling the same thing, I can guarantee you my Christian brothers are feeling the same, I can guarantee you, the dalit community is feeling the same thing tribal communities feeling the same thing right - in fact anybody who is poor in India today - when he looks at the extreme wealth that a limited number of people have, in some way, he feels the same thing that you feel that what is going on? How is it that these five people have lakhs of crores and I have nothing to eat? So, you feel it most because it is directed at you most aggressively but it is a phenomena that is taking place against everybody in India right and you cannot cut hatred with hatred. It's impossible. You know that. You can only cut hatred with love and affection.\n\nI was surprised at how easy it was to erase hatred in India. I was shocked. I didn't imagine that [speaks in hindi] - *walking from one place to another could make such a great difference.* I didn't imagine it. Indian people, as you yourself have said, they don't believe in this stuff, they don't believe in hating each other, they don't believe in killing each other. This is a small group of people who have got control of the system, who've got control of the media and who are fully supported by you know - big money. But this is not the large mass of Indian people - I can guarantee you. I walked from Kanyakumari to Kashmir, I can guarantee you there are more people who believe in love and affection than hatred - millions and millions more.\n\nSo, don't be pessimistic. Also, I'd like to point out another thing. This happens periodically in India. What is happening for example to the Muslim Community in India today - happened to the dalit community in the 80s. If you went up to them in the 80s - what is happening with the Muslims is what was happening with the Dalits. So, periodically, this type of stuff happens and we have to challenge it, we have to fight it and we have to fight it with affection and not fight it with hatred. We will do that. Thank you. \n\n**Question 6** - Welcome Rahul sir and thank you so much for your win in Karnataka. You've made a lot of people very very happy. We've literally cried tears of joy - so thank you. My question for you would be that we have a lot of students who helped out here today - we really feel passionately for your cause and which is our cause now but what would you say to us if we want to go back to India - we want to represent our country - but we see how the athletes, the youth, the wrestlers there in recent times are being treated, it's very undignified - we feel very discouraged. So, what would you say to us to kind of bring the sense of wanting to go back out there for our country? \n\n**Rahul Gandhi** - Please realize that there's a huge distortion - India is not what the media shows - the media likes to show you a particular narrative - it likes to promote a particular narrative that is actually not what is going on in India. It was very clear to me in the yatra that it's in the media's interest to project these things. It helps the BJP. So, don't think that everything you see in the media is the truth and as a young person, your country needs you - your skills and your energy will be very useful to your country. So if you feel like going back, do go back and help out. Thank you.\n\n**Concluding remarks** - You are all ambassadors of a particular vision of our country - you believe in humility, you believe in respect, you believe in being affectionate to each other - so do not answer with anger and hatred - with love and affection, show them that you are not like them [Applause] you should support the ideas that will defeat the BJP. Thank you very much.",
    "flair": "Politics",
    "score": 47,
    "num_comments": 5,
    "created_utc": 1685542073.0,
    "convurl": "https://external-preview.redd.it/14dTeijWXMPLZfy3B8rsmoGlgNfF-nDvV6Kl8ZYAfEg.jpg?auto=webp&v=enabled&s=4e3786e403afbaae4ce2710950de942f1443ecb4",
    "comments": [
        "it was in Stanford?\nthis should be highlighted too.",
        "Wow. It has been quite a long time that I read a sane replies from a politician.",
        "Love this Rahul",
        "Good one."
    ],
    "cleaned_text": "complete transcript rahul gandhis address america today video link note rough transcript taken youtube edited heavily transcript close complete although may minuscule parts incoherent hence part transcript brothers sisters friends dont see children sang yeah id like welcome thank coming also thank wonderful children song sang sung movingly well months ago started walk kanyakumari kashmir prior walking finding normal tools used use politics conversations like public meetings simply working anymore instruments needed politics india controlled bjp rss know people threatened important people agencies used people also finding way become quite difficult act politically thats decided walk southernmost tip india srinagar started thought okay five six days realized actually walking four thousand kilometers easy thing know old knee injury started actup said im real trouble theres choice one walk im quite lot pain quite surprising thing happened started noticing walking kilometers kilometers half marathon walking three weeks every day kilometers suddenly felt one afternoon strange im feeling tired get morning six oclock used start used end walking evening like strange im feeling tired started asking people around feeling tired everybody saying strange theyre feeling tired well started think realized actually going us walking india walking us right large mass people coming religions communities everybody kids creating atmosphere love affection nobody feeling tired almost everybody walking together helping thats came idea nafrat ke bazaar mein mohabbat ki dukaan kholi opened shop love amidst market hate applausewelcome welcomemusicapplausemusicapplausemusic commotion back conference see interesting thing us congress party affection towards everybody someone wants come say something regardless theyre saying happy listen going get angry going get aggressive well nicely listen fact well affectionate well loving thats nature found everybody started walking together completely different type energy started coming noticed government tried everything mean tried might stopping yatra used police didnt work effect yatra constantly rising happened helped us india bharat jodo idea hearts respecting affectionate violent towards arrogant see sikh brothers guru nanakji entire life humble right humble affectionate walked nothing compared guru nanakji read somewhere guru nanakji gone way mecca saudi arabia gone thailand head gone sri lanka giants bharat jodo much born right say friends karnataka basavanaji friends kerala narayana guruji yeah every state india giants everywhere mean every single one said listen respectful religion language culture respectful towards cultures religions languages fact assault taking place india taking place way life sam petrodaji said grew people living happily different languages different religions attacked also tradition india something like gurunanakji basavanaji gandhiji emphasized impression know everything world big complicated one person think understands everything knows everything really disease sam outlined disease group people india absolutely convinced know everything fact think think maybe know even god could could sit god conversation explain know going course prime minister one specimen applause think think sat modiji next god modiji would start explaining god universe works god would get confused created funny things really going group people know understand everything speak scientists explain science know speak historians explain history explain warfare army flying air force whatever want know heart mediocrity actually dont understand anything life understand anything ready listen thats something biggest lesson learned bharat jodo yatra something learn everybody much older children guarantee teach us sing looking thinking know cant sing like impossible look another person appreciate experience life seen things maybe learn lot maybe open ears listen learn actually indian tradition look look country find country ability absorb idea comes india never rejected idea everybody come india received open arms ideas absorbed india india like india respects rest world india humble india listens india affectionate india represent would agree values believed anger hatred arrogance youd sitting bjp meeting would mann ki baat applause thank much holding indian flag america showing american people means indian respecting respecting culture learning also allowing learn make us proud think country youre ambassadors america says indian people extremely intelligent indian people masters indian people respectful ideas come theyve come actions behaviors thank much came morning sam organized flight arrived hours flying morning thought id tired im tired energy given thank break theyve asked answer questions see also would happen bjp meeting question would like ask two questions regarding woman bill uh know court almost half century congress comes power bill womans reservation rights bill quarter century congress leader thoughts gon na deal thats first question second question india hard woman safety issue going know offer next generation girls india thank rahul gandhi womens reservation bill committed wanted pass last government allies happy didnt give us support bill im confident come power well pass bill think part answer second question lies first question empower women involve women political system give women space governance country give women space businesses country automatically make safer think involving politics involving business involving running country way give power thank question hello rahul ji name pugal im president indoamerican society science reason freethought also represent tamils live bay area behalf people behalf people believe science reason freethought would like point honored humbled truly proud journey opening shops love streets hate india tamils long tradition harboring brotherhood mindset throughout civilization three thousand years ago forefathers said speaks tamil applause translation human beings created equal every town town everybody relative us india like european union state language tradition festivals cuisine dress code way living etc etc different yet live one country called india therefore deeply saddening us someone union government try impose one language one culture one tradition one religion one school etc recognizing diversity make robust country beloved leader dravidian icon former chief minister proclaimed parliament public forums speaks tamil means autonomous rule state level federal rule union level dear rahulji studied america traveled within united states extensively know much better anyone else room america best example federalism state constitution one supreme court apart federal laws whereas india congress party share problems past times changed new thinking emerged epitome new thinking new hope streets hate india question like united states america whats thought making india true united states india thank youapplause rahul gandhi read constitution definition india constitution union states within constitution idea languages cultures histories one states protected union youre talking already incorporated constitution already bjp rss attacking idea mentioned also constitution india fact personally understand tamil language language tamil people right language history culture way life never ever allow tamil language threatened applause threatening tamil language threaten idea india like threatening bengali threatening kannada threatening hindi threatening punjabi attacks india strength unlike many countries strength comes diversity strength comes accepting different work together idea im sure congress party protecting thank question hello rahulji ganapathy welcome wholeheartedly thank taking fight fascism rise fascism mere coincidence believe social economic equality society inequality actually creates conducive environment fascism emerge question like plan indian national congress improve economic social inequality creates condition fascism indian subcontinent also global level rahul gandhi one things suggesting government carried caste census idea behind caste senses take xray indian society find exact demographics country different communities different costs many people community many people caste without understanding demographics without understanding difficult distribute wealth distribute power effectively one idea weve putting pressure bjp release caste census numbers course well continue apply pressure come power committed congress party make india fair place understand deeply india today terms treatment dalits tribals poor people minorities fair place many many things done nyay scheme aimed providing minimum income indians ideas like mnrega think increase public education increase public health care thinkthese things done make india much equal fair place thank question rahulji parliament lok sabha seats increasing whats take theres proposal know modiji actually working going entirely based population going tilt know orientation towards highly popular states getting lion share revenues everything going change everything know minorities going get even depressed know majorities going know making everybody vulnerable whats take rahul gandhi exactly theyre thinking doingit think one carefully one change changes representative structure country id quite interested understanding exactly theyve comeup number sic criteria theyre using things done flippantly india conversation india negotiation languages people histories cultures negotiation fair meaning parts india states india feel fairness process negotiation see exactly coming design would able answer whether agree number havent seen way theyre calculating inaudible audio background depends ratios change yeah currently based population youll see ratios change think parliament house distractions real issues india unemployment price rise spread anger hatred crumbling education system price education price health care real issues bjp cant really discuss whole skepter thing know lying arent happy im lying thank question rahulji thank much coming way think something starving muslims bay area want thank time efforts coming way know know muslims security threat today like never way see today like whenever call talk anybody like whats going many different laws getting implemented even implemented earlier security okay goes putting muslim kids jails crime committed strategy adopt hope giving indian muslims going change whole thing back point get back normal stream develop india best way rahul gandhi explain line nafrat ke bazaar mein mohabbat ki dukaan kholi opened shop love amidst market hate best way say felt strongly muslim community okay done directly fact done minorities guarantee way youre feeling attacked guarantee sikh brothers feeling thing guarantee christian brothers feeling guarantee dalit community feeling thing tribal communities feeling thing right fact anybody poor india today looks extreme wealth limited number people way feels thing feel going five people lakhs crores nothing eat feel directed aggressively phenomena taking place everybody india right cut hatred hatred impossible know cut hatred love affection surprised easy erase hatred india shocked didnt imagine speaks hindi walking one place another could make great difference didnt imagine indian people said dont believe stuff dont believe hating dont believe killing small group people got control system whove got control media fully supported know big money large mass indian people guarantee walked kanyakumari kashmir guarantee people believe love affection hatred millions millions dont pessimistic also id like point another thing happens periodically india happening example muslim community india today happened dalit community went happening muslims happening dalits periodically type stuff happens challenge fight fight affection fight hatred thank question welcome rahul sir thank much win karnataka youve made lot people happy weve literally cried tears joy thank question would lot students helped today really feel passionately cause cause would say us want go back india want represent country see athletes youth wrestlers recent times treated undignified feel discouraged would say us kind bring sense wanting go back country rahul gandhi please realize theres huge distortion india media shows media likes show particular narrative likes promote particular narrative actually going india clear yatra medias interest project things helps bjp dont think everything see media truth young person country needs skills energy useful country feel like going back go back help thank concluding remarks ambassadors particular vision country believe humility believe respect believe affectionate answer anger hatred love affection show like applause support ideas defeat bjp thank much ",
    "cleaned_title": "complete transcript rahul gandhis address america today",
    "cleaned_selftext": "video link note rough transcript taken youtube edited heavily transcript close complete although may minuscule parts incoherent hence part transcript brothers sisters friends dont see children sang yeah id like welcome thank coming also thank wonderful children song sang sung movingly well months ago started walk kanyakumari kashmir prior walking finding normal tools used use politics conversations like public meetings simply working anymore instruments needed politics india controlled bjp rss know people threatened important people agencies used people also finding way become quite difficult act politically thats decided walk southernmost tip india srinagar started thought okay five six days realized actually walking four thousand kilometers easy thing know old knee injury started actup said im real trouble theres choice one walk im quite lot pain quite surprising thing happened started noticing walking kilometers kilometers half marathon walking three weeks every day kilometers suddenly felt one afternoon strange im feeling tired get morning six oclock used start used end walking evening like strange im feeling tired started asking people around feeling tired everybody saying strange theyre feeling tired well started think realized actually going us walking india walking us right large mass people coming religions communities everybody kids creating atmosphere love affection nobody feeling tired almost everybody walking together helping thats came idea nafrat ke bazaar mein mohabbat ki dukaan kholi opened shop love amidst market hate applausewelcome welcomemusicapplausemusicapplausemusic commotion back conference see interesting thing us congress party affection towards everybody someone wants come say something regardless theyre saying happy listen going get angry going get aggressive well nicely listen fact well affectionate well loving thats nature found everybody started walking together completely different type energy started coming noticed government tried everything mean tried might stopping yatra used police didnt work effect yatra constantly rising happened helped us india bharat jodo idea hearts respecting affectionate violent towards arrogant see sikh brothers guru nanakji entire life humble right humble affectionate walked nothing compared guru nanakji read somewhere guru nanakji gone way mecca saudi arabia gone thailand head gone sri lanka giants bharat jodo much born right say friends karnataka basavanaji friends kerala narayana guruji yeah every state india giants everywhere mean every single one said listen respectful religion language culture respectful towards cultures religions languages fact assault taking place india taking place way life sam petrodaji said grew people living happily different languages different religions attacked also tradition india something like gurunanakji basavanaji gandhiji emphasized impression know everything world big complicated one person think understands everything knows everything really disease sam outlined disease group people india absolutely convinced know everything fact think think maybe know even god could could sit god conversation explain know going course prime minister one specimen applause think think sat modiji next god modiji would start explaining god universe works god would get confused created funny things really going group people know understand everything speak scientists explain science know speak historians explain history explain warfare army flying air force whatever want know heart mediocrity actually dont understand anything life understand anything ready listen thats something biggest lesson learned bharat jodo yatra something learn everybody much older children guarantee teach us sing looking thinking know cant sing like impossible look another person appreciate experience life seen things maybe learn lot maybe open ears listen learn actually indian tradition look look country find country ability absorb idea comes india never rejected idea everybody come india received open arms ideas absorbed india india like india respects rest world india humble india listens india affectionate india represent would agree values believed anger hatred arrogance youd sitting bjp meeting would mann ki baat applause thank much holding indian flag america showing american people means indian respecting respecting culture learning also allowing learn make us proud think country youre ambassadors america says indian people extremely intelligent indian people masters indian people respectful ideas come theyve come actions behaviors thank much came morning sam organized flight arrived hours flying morning thought id tired im tired energy given thank break theyve asked answer questions see also would happen bjp meeting question would like ask two questions regarding woman bill uh know court almost half century congress comes power bill womans reservation rights bill quarter century congress leader thoughts gon na deal thats first question second question india hard woman safety issue going know offer next generation girls india thank rahul gandhi womens reservation bill committed wanted pass last government allies happy didnt give us support bill im confident come power well pass bill think part answer second question lies first question empower women involve women political system give women space governance country give women space businesses country automatically make safer think involving politics involving business involving running country way give power thank question hello rahul ji name pugal im president indoamerican society science reason freethought also represent tamils live bay area behalf people behalf people believe science reason freethought would like point honored humbled truly proud journey opening shops love streets hate india tamils long tradition harboring brotherhood mindset throughout civilization three thousand years ago forefathers said speaks tamil applause translation human beings created equal every town town everybody relative us india like european union state language tradition festivals cuisine dress code way living etc etc different yet live one country called india therefore deeply saddening us someone union government try impose one language one culture one tradition one religion one school etc recognizing diversity make robust country beloved leader dravidian icon former chief minister proclaimed parliament public forums speaks tamil means autonomous rule state level federal rule union level dear rahulji studied america traveled within united states extensively know much better anyone else room america best example federalism state constitution one supreme court apart federal laws whereas india congress party share problems past times changed new thinking emerged epitome new thinking new hope streets hate india question like united states america whats thought making india true united states india thank youapplause rahul gandhi read constitution definition india constitution union states within constitution idea languages cultures histories one states protected union youre talking already incorporated constitution already bjp rss attacking idea mentioned also constitution india fact personally understand tamil language language tamil people right language history culture way life never ever allow tamil language threatened applause threatening tamil language threaten idea india like threatening bengali threatening kannada threatening hindi threatening punjabi attacks india strength unlike many countries strength comes diversity strength comes accepting different work together idea im sure congress party protecting thank question hello rahulji ganapathy welcome wholeheartedly thank taking fight fascism rise fascism mere coincidence believe social economic equality society inequality actually creates conducive environment fascism emerge question like plan indian national congress improve economic social inequality creates condition fascism indian subcontinent also global level rahul gandhi one things suggesting government carried caste census idea behind caste senses take xray indian society find exact demographics country different communities different costs many people community many people caste without understanding demographics without understanding difficult distribute wealth distribute power effectively one idea weve putting pressure bjp release caste census numbers course well continue apply pressure come power committed congress party make india fair place understand deeply india today terms treatment dalits tribals poor people minorities fair place many many things done nyay scheme aimed providing minimum income indians ideas like mnrega think increase public education increase public health care thinkthese things done make india much equal fair place thank question rahulji parliament lok sabha seats increasing whats take theres proposal know modiji actually working going entirely based population going tilt know orientation towards highly popular states getting lion share revenues everything going change everything know minorities going get even depressed know majorities going know making everybody vulnerable whats take rahul gandhi exactly theyre thinking doingit think one carefully one change changes representative structure country id quite interested understanding exactly theyve comeup number sic criteria theyre using things done flippantly india conversation india negotiation languages people histories cultures negotiation fair meaning parts india states india feel fairness process negotiation see exactly coming design would able answer whether agree number havent seen way theyre calculating inaudible audio background depends ratios change yeah currently based population youll see ratios change think parliament house distractions real issues india unemployment price rise spread anger hatred crumbling education system price education price health care real issues bjp cant really discuss whole skepter thing know lying arent happy im lying thank question rahulji thank much coming way think something starving muslims bay area want thank time efforts coming way know know muslims security threat today like never way see today like whenever call talk anybody like whats going many different laws getting implemented even implemented earlier security okay goes putting muslim kids jails crime committed strategy adopt hope giving indian muslims going change whole thing back point get back normal stream develop india best way rahul gandhi explain line nafrat ke bazaar mein mohabbat ki dukaan kholi opened shop love amidst market hate best way say felt strongly muslim community okay done directly fact done minorities guarantee way youre feeling attacked guarantee sikh brothers feeling thing guarantee christian brothers feeling guarantee dalit community feeling thing tribal communities feeling thing right fact anybody poor india today looks extreme wealth limited number people way feels thing feel going five people lakhs crores nothing eat feel directed aggressively phenomena taking place everybody india right cut hatred hatred impossible know cut hatred love affection surprised easy erase hatred india shocked didnt imagine speaks hindi walking one place another could make great difference didnt imagine indian people said dont believe stuff dont believe hating dont believe killing small group people got control system whove got control media fully supported know big money large mass indian people guarantee walked kanyakumari kashmir guarantee people believe love affection hatred millions millions dont pessimistic also id like point another thing happens periodically india happening example muslim community india today happened dalit community went happening muslims happening dalits periodically type stuff happens challenge fight fight affection fight hatred thank question welcome rahul sir thank much win karnataka youve made lot people happy weve literally cried tears joy thank question would lot students helped today really feel passionately cause cause would say us want go back india want represent country see athletes youth wrestlers recent times treated undignified feel discouraged would say us kind bring sense wanting go back country rahul gandhi please realize theres huge distortion india media shows media likes show particular narrative likes promote particular narrative actually going india clear yatra medias interest project things helps bjp dont think everything see media truth young person country needs skills energy useful country feel like going back go back help thank concluding remarks ambassadors particular vision country believe humility believe respect believe affectionate answer anger hatred love affection show like applause support ideas defeat bjp thank much",
    "cleaned_comments": "stanford highlighted wow quite long time read sane replies politician love rahul good one",
    "light_cleaned_title": "Complete Transcript of Rahul Gandhi's address in America today",
    "light_cleaned_selftext": "Video link: **Note:** Rough transcript was taken from Youtube, edited heavily by me. Transcript is very close to complete, although there may be some minuscule parts which were incoherent and hence not part of it. ### Transcript Brothers and sisters, friends and I don't see the children who sang but, where are they, yeah I'd like to welcome all of you and thank all of you for coming here and also thank the wonderful children for the song they sang it was sung very movingly and very well. Some months ago, we started a walk from Kanyakumari to Kashmir. Prior to walking, we were finding that the normal tools that we used to use for politics, conversations like this public meetings was simply not working anymore. All the instruments that we needed to do politics in India - they were controlled by the BJP and the RSS. You know people are threatened, this is (important?) people, agencies are used on people. So, we were also finding that in some way it had become quite difficult to act politically and that's why we decided to walk from southernmost tip of India to Srinagar. When we started, I thought okay. After five or six days, we realized that actually walking four thousand kilometers is not an easy thing you know and and I had an old knee injury that started to act-up. So I said now I’m in real trouble because there's no choice - one has to walk and I'm having quite a lot of pain then quite a surprising thing happened just I started noticing that after walking 25 kilometers - 25 kilometers is more than half a marathon - after walking three weeks every day 25 kilometers I suddenly felt one afternoon that it's strange that I'm not feeling tired at all. I get up in the morning six o'clock - we used to start and we used to end walking at about 7.30-8 in the evening. I was like, this is very strange - I'm not feeling tired at all, What is this? then I started asking people around if they are feeling tired, everybody is saying it's very strange that they're not feeling tired as well. So I started to think about it and I realized that actually what was going on was that it was not us who were walking, it was India that was walking with us, right, and the large mass of people who are coming from all religions, all communities, everybody, kids - they were creating an atmosphere of love and affection where nobody was feeling tired. Almost as if, everybody was walking together, helping each other, and that's where we came up with the idea - Nafrat ke bazaar mein mohabbat ki dukaan kholi (*We opened a shop of love amidst the market of hate*). [Applause]welcome welcome[Music][Applause][Music][Applause][Music] [Commotion in the back of the conference] See, the interesting thing about us, about the congress party, is we have affection towards everybody - if someone wants to come, and say something - regardless of what they're saying, we're happy to listen to it. We are not going to get angry, we're not going to get aggressive, we'll nicely listen to it. In fact, we'll be affectionate to them we'll be loving to them because that's our nature. So, we found that when everybody started walking together - completely different type of energy started coming and I noticed that the government tried everything. [*I mean, they tried all their might in stopping the yatra. They used police - but it didn't work - but the effect of Yatra was constantly rising. Why it happened was because you all helped us.*] Not only in India, Bharat Jodo is an idea that is in all your hearts. And, it is about respecting each other and being affectionate to each other, it is about being not being violent towards each other, not being arrogant. I can see my Sikh Brothers here. Your Guru nanakji - his entire life was about this only. That, be humble, right, be humble, be affectionate and we walked nothing compared to Guru Nanakji. I read somewhere that Guru nanakji had gone all the way to Mecca, Saudi Arabia, he had gone to Thailand, he head gone to Sri Lanka. So, these Giants were doing Bharat Jodo much before we were born, right? And I can say the same for my friends from Karnataka - Basavanaji, friends from Kerala - Narayana Guruji. Yeah so every state in India has had these Giants everywhere. I mean and every single one of them said listen to each other, be respectful - not just of your own religion, not just of your own language, not just of your own culture - but be respectful towards all cultures, all religions, all languages because they are in fact the same. And, the assault that is taking place in India - it's taking place on our way of life. Sam Petrodaji said that he grew up with all people living happily - different languages, different religions and that is what is being attacked. Also, the tradition in India and again something like GurunanakJi, Basavanaji, Gandhiji emphasized that not to be under the impression that you know everything that the world is too big too complicated for any one person to think that he understands everything and he knows everything. And so really that is the disease that Sam outlined that that is the disease that we have a group of people in India who are absolutely convinced that they know everything. In fact I think they think maybe they know even more than God. They could they could sit down with God and have a conversation and explain to him you know about what is going on and of course our prime minister is one such specimen. [Applause] I think I think if you if you sat Modiji down next to God Modiji would start explaining to God how the universe works. And, God would get confused that what have I created. So these are these are funny things but but really this is what is going on we have a group of people you know who understand everything. They can speak to scientists and explain science to them. They can you know speak to historians and explain history to them. They can explain Warfare to the Army and flying to the Air Force. Whatever they want, they can you know and at the heart of it is mediocrity. That they actually don't understand anything because because in life you cannot understand anything if you are not ready to listen. That's something the biggest - lesson I learned from Bharat Jodo yatra that there is something to learn from everybody. We are much older than those children but I can guarantee you they can teach us all how to sing. I was looking at them and I was thinking you know I can't sing like that. It's impossible, so when you look at another person, you have to appreciate that they have an experience, they have a life, they have seen things and maybe you can learn a lot from them. Maybe if you open your ears, you will listen to them and learn from them. And that is actually the Indian tradition. If you look if you look at our country, you will find that our country has the ability to absorb any idea that comes. India has never rejected any idea. Everybody who has come to India - has been received with open arms and their ideas have been absorbed in India. And that is the India that we like - India that respects the rest of the world, India that is humble, India that listens, India that is affectionate. And that is the India that you represent. You would not be here if you do not if you did not agree with these values. If you if you believed in anger, hatred, arrogance - you'd be sitting in a BJP meeting. And, I would be doing Mann ki Baat. [Applause] Thank you very much for holding up the Indian flag in America. Showing the American people, what it means to be Indian, respecting them, respecting their culture, learning from them and also allowing them to learn from you. You make us all proud. And, when we think of our country, you're all our ambassadors. When America says Indian people are extremely intelligent, Indian people or masters of IT, Indian people are respectful - all these ideas that have come, they've come because of you and because of your actions and your behaviors. So I thank you very much for that. I came here this morning, Sam organized the flight - I arrived after 16 hours of flying - 6.30 in the morning - I thought I'd be tired but I'm not tired at all because of the energy that you have given me. Thank you. [After a break] They've asked me to answer your questions. See that that also would not happen in a BJP meeting. **Question 1** - So I would like to ask you two questions - regarding this woman bill that has been uh you know in the court for almost more than half a century, so when the Congress comes in power - bill about woman's reservation rights - so that bill has been there for more than a quarter Century. So as a congress leader, what are your thoughts on it and how are you gonna deal with it? That's my first question. The second question is - In India, it's very hard for a woman - as a safety issue - so what are we going to you know offer our next generation of the girls in India. Thank you. **Rahul Gandhi** - So on the women's reservation Bill - we are committed to that. We wanted to pass it in the last government but some of our allies were not too happy with it and they didn't give us the support for that bill. But I'm confident when we come to power we'll pass that bill. I think part of the answer to your second question lies in the first question itself. If we empower women, if we involve women in the political system, if we give women space in the governance of the country, if we give women space in the businesses of the country, we will automatically make them safer. So I think involving them in politics, involving them in business, involving them in running the country are the way to give them power. Thank you. **Question 2** - Hello Rahul ji, my name is Pugal. I'm the president of indo-american society for science, reason and free-thought. I also represent tamils who live in Bay Area. On behalf of our people and on behalf of people who believe in science, reason and free-thought, I would like to point out the we are honored, humbled and most truly, proud of your journey about opening up the shops of Love on the streets of hate all over the India. Tamils have long tradition of harboring Brotherhood mindset throughout their civilization - three thousand years ago our forefathers said [Speaks in Tamil] [Applause] Translation - All human beings are created equal and every town is our town, everybody is our relative. To us, India is like European Union with each state having its own language, its own tradition, its own festivals, its own Cuisine, dress code, way of living etc etc. They are all different, yet we live under one country called India therefore it is deeply saddening to us when someone from the Union Government try to impose one language one culture, one tradition, one religion, one school Etc. Recognizing this diversity to make a robust country, our beloved leader - the Dravidian icon former Chief Minister proclaimed, both in Parliament and in public forums, [Speaks in tamil] which means autonomous rule at the state level and federal rule at the union level. Dear Rahulji, you have studied in America and you have traveled within United States extensively and you know much better than anyone else in this room that America is the best example of federalism. Each state has its own Constitution. It's one Supreme Court apart from federal laws. Whereas in India, congress party did have its own share of problems in the past but the times have changed the new thinking has emerged and you are the epitome of the new thinking. You are they new Hope and the streets of hate in India - my question to you is that like United States of America what's your thought on making India as a true United States of India. Thank you[Applause] **Rahul Gandhi** - If you read our constitution, the definition of India in the constitution is a union of states and within our constitution is the idea that the languages, cultures, histories of each one of our states has to be protected under the union. So what you're talking about, is already incorporated in our constitution, it's already there. The BJP and the RSS are attacking that idea that you mentioned and also the constitution of India. That is fact now. For me personally, I understand that the Tamil language is more than a language to Tamil people, right? It is not just a language, it is their history, it is their culture, it is their way of life and I will never ever allow Tamil language to be threatened. [Applause] Threatening the Tamil language is to threaten the idea of India just like threatening Bengali or threatening kannada or threatening Hindi or threatening Punjabi are all attacks on India. So our strength unlike many other countries, our strength comes from our diversity, our strength comes from accepting that we are all different, but we can work together and that is an idea that I'm sure you and the congress party are protecting. Thank you. **Question 3** - Hello Rahulji, I am Ganapathy. We welcome you here. We wholeheartedly thank you for taking up the fight against the fascism. So this rise of fascism is not a mere coincidence - and we believe in the social and the economic equality in the society and the inequality actually creates a conducive environment for fascism to emerge. So my question is like what is the plan of the Indian National Congress to improve the economic and the social inequality which creates this condition for fascism in the Indian subcontinent and also at the global level. **Rahul Gandhi** - One of the things that we are suggesting is when we were in government we had carried out a caste census and the idea behind the caste senses was to take an x-ray of Indian Society - to find out what are the exact demographics of our country, what are the different communities, what are the different costs, how many people in each community, how many people in each caste, because without understanding our demographics and without understanding who is who, it is very difficult to distribute wealth, distribute power effectively. So that was one idea that we had and we've been putting pressure on the BJP to release the caste census, the numbers and they are of course not doing it and we'll continue to apply pressure and if we come to power we will do that but we are committed as the congress party to make India a fair place and we understand deeply that India today in terms of its treatment of dalits, tribals, poor people, minorities is not a fair place. And, there are many many things that can be done - there is the Nyay scheme that we had which was aimed at providing a minimum income to all Indians, there are ideas like MNREGA. I think an increase in public education, increase in public health care - I thinkthese are all things that can be done to make India a much more equal and fair place. Thank you. **Question 4** - Rahulji, now the parliament Lok Sabha seats are increasing to 888 - what's your take on it? There's a proposal that you know Modiji is actually working on- it is going to be entirely based on population. It is going to tilt you know the orientation towards the highly popular states getting more and more Lion Share of the revenues and everything - so it's going to change everything you know - minorities are going to get even more depressed, you know majorities are going to be you know making everybody vulnerable - so what's your take on it? **Rahul Gandhi** - Exactly how they're thinking about doingit - but I think one has to be very very carefully - when one change changes the representative structure of a country. So I'd be quite interested in understanding exactly how they've comeup with the number 800 [sic] and what are the criteria that they're using - these things should not be done flippantly. India is a conversation, India is a negotiation between its languages, between its people, between its histories and cultures and that negotiation has to be fair - meaning all parts of India, all the states of India should feel that there is fairness in the process of negotiation. If I see exactly how they are coming up with 800 and what is the design then I would be able to answer whether I agree with the number 800 but I haven't seen the way they're calculating it [Inaudible audio in the background], but it depends how they how the ratios change- yeah it is currently based on the population but you'll have to see how the ratios change. I think the Parliament House - these are the distractions - the real issues in India are unemployment, price rise, spread of anger and hatred , crumbling education system, price of Education, price of Health Care - these are the real issues. BJP can't really discuss them, so then they have to do the whole skepter thing, you know lying down and doing all that aren't you happy I'm not lying down? Thank you. **Question 5** - Rahulji, Thank you so much for coming all the way here. I think this is something which we were starving for as Muslims from the Bay Area. We all want to thank you for your time and for your efforts in coming all the way here. As you know that you know Muslims have the security threat today like it was never before. The way we see today, like whenever we call and talk to anybody, it's like what's going on. There are so many different laws which are getting implemented which were not even implemented earlier - if it is just about the security it's okay, but then if it goes on and they are putting Muslim kids in the jails for the crime they have not committed - what strategy will you adopt or what hope are you giving to Indian Muslims which is going to change the whole thing back to the point where we were and get back to the normal stream to develop India the the best way? **Rahul Gandhi** - For me to explain that is the line - Nafrat ke bazaar mein mohabbat ki dukaan kholi (*We opened a shop of love amidst the market of hate*) - that is the best way I can say it which is that it is felt most strongly by the Muslim Community. Okay, because it is done most directly to them but in fact it is being done to all minorities - I can guarantee you that the same way you're feeling attacked, I can guarantee you my Sikh brothers are feeling the same thing, I can guarantee you my Christian brothers are feeling the same, I can guarantee you, the dalit community is feeling the same thing tribal communities feeling the same thing right - in fact anybody who is poor in India today - when he looks at the extreme wealth that a limited number of people have, in some way, he feels the same thing that you feel that what is going on? How is it that these five people have lakhs of crores and I have nothing to eat? So, you feel it most because it is directed at you most aggressively but it is a phenomena that is taking place against everybody in India right and you cannot cut hatred with hatred. It's impossible. You know that. You can only cut hatred with love and affection. I was surprised at how easy it was to erase hatred in India. I was shocked. I didn't imagine that [speaks in hindi] - *walking from one place to another could make such a great difference.* I didn't imagine it. Indian people, as you yourself have said, they don't believe in this stuff, they don't believe in hating each other, they don't believe in killing each other. This is a small group of people who have got control of the system, who've got control of the media and who are fully supported by you know - big money. But this is not the large mass of Indian people - I can guarantee you. I walked from Kanyakumari to Kashmir, I can guarantee you there are more people who believe in love and affection than hatred - millions and millions more. So, don't be pessimistic. Also, I'd like to point out another thing. This happens periodically in India. What is happening for example to the Muslim Community in India today - happened to the dalit community in the 80s. If you went up to them in the 80s - what is happening with the Muslims is what was happening with the Dalits. So, periodically, this type of stuff happens and we have to challenge it, we have to fight it and we have to fight it with affection and not fight it with hatred. We will do that. Thank you. **Question 6** - Welcome Rahul sir and thank you so much for your win in Karnataka. You've made a lot of people very very happy. We've literally cried tears of joy - so thank you. My question for you would be that we have a lot of students who helped out here today - we really feel passionately for your cause and which is our cause now but what would you say to us if we want to go back to India - we want to represent our country - but we see how the athletes, the youth, the wrestlers there in recent times are being treated, it's very undignified - we feel very discouraged. So, what would you say to us to kind of bring the sense of wanting to go back out there for our country? **Rahul Gandhi** - Please realize that there's a huge distortion - India is not what the media shows - the media likes to show you a particular narrative - it likes to promote a particular narrative that is actually not what is going on in India. It was very clear to me in the yatra that it's in the media's interest to project these things. It helps the BJP. So, don't think that everything you see in the media is the truth and as a young person, your country needs you - your skills and your energy will be very useful to your country. So if you feel like going back, do go back and help out. Thank you. **Concluding remarks** - You are all ambassadors of a particular vision of our country - you believe in humility, you believe in respect, you believe in being affectionate to each other - so do not answer with anger and hatred - with love and affection, show them that you are not like them [Applause] you should support the ideas that will defeat the BJP. Thank you very much.",
    "light_cleaned_comments": "it was in Stanford? this should be highlighted too. Wow. It has been quite a long time that I read a sane replies from a politician. Love this Rahul Good one."
}