{
    "id": "12gaabo",
    "title": "(17/11/2021) Sangeet Som, BJP’s leading anti-beef crusader, owned a meat exporting company",
    "url": "https://www.thehindu.com/news/national/BJP%E2%80%99s-leading-anti-beef-crusader-owned-a-meat-exporting-company/article60571650.ece",
    "selftext": "BJP MLA Sangeet Som (second from right) at Dadri where a man was lynched by mob for allegedly consuming beef. Mr. Som refused to condemn the lynching of Akhlaq and said he would try to get bail for the accused.\n\nSangeet Singh Som, the fiery BJP MLA at the forefront of the frenzied anti-beef protests and an accused in the Muzaffarnagar riots, founded one of India’s leading halal meat export companies, according to documents available with The Hindu .\n\nThe company, Al-Dua Food Processing Private Ltd, was founded by Mr. Som, along with Moinuddin Qureshi and a third partner, to deal in meat and meat products in 2005. According to Al-Dua’s website, the company is now a “leading producer and exporter of halal meat from India.”",
    "flair": "Politics",
    "score": 202,
    "num_comments": 9,
    "created_utc": 1681019111.0,
    "convurl": "https://external-preview.redd.it/Q-9w1uDKBJ5bM4CGk4MAeB-r8KAC-d8neenBz3BHOWU.jpg?auto=webp&v=enabled&s=a904f505e1e6abe8ed23ca63fd08f5e14946d431",
    "comments": [
        "Oh, are you telling me these idiots have been inflaming religious bigotry for their personal gain and they don't actually believe a word they say? 🤔",
        "People's response :\n\n![gif](giphy|7k2LoEykY5i1hfeWQB)",
        "“There was nothing about meat. I am a pure Hindu and would do nothing to hurt Hindu sentiment. You would be surprised to know that despite being a Thakur I don’t eat even egg and start my day with a havan,” he said\n\nHahhahaha. Kaise bacche hai ye log. I swear mummy i am a goodest boy ever",
        "Poor guy is just taking out the competition. Also who hates money?",
        "It's not about beef. It's about beef with Muslims."
    ],
    "cleaned_text": "sangeet som bjps leading antibeef crusader owned meat exporting company bjp mla sangeet som second right dadri man lynched mob allegedly consuming beef mr som refused condemn lynching akhlaq said would try get bail accused sangeet singh som fiery bjp mla forefront frenzied antibeef protests accused muzaffarnagar riots founded one indias leading halal meat export companies according documents available hindu company aldua food processing private ltd founded mr som along moinuddin qureshi third partner deal meat meat products according alduas website company leading producer exporter halal meat india ",
    "cleaned_title": "sangeet som bjps leading antibeef crusader owned meat exporting company",
    "cleaned_selftext": "bjp mla sangeet som second right dadri man lynched mob allegedly consuming beef mr som refused condemn lynching akhlaq said would try get bail accused sangeet singh som fiery bjp mla forefront frenzied antibeef protests accused muzaffarnagar riots founded one indias leading halal meat export companies according documents available hindu company aldua food processing private ltd founded mr som along moinuddin qureshi third partner deal meat meat products according alduas website company leading producer exporter halal meat india",
    "cleaned_comments": "oh telling idiots inflaming religious bigotry personal gain dont actually believe word say peoples response gifgiphykloeykyihfewqb nothing meat pure hindu would nothing hurt hindu sentiment would surprised know despite thakur dont eat even egg start day havan said hahhahaha kaise bacche hai ye log swear mummy goodest boy ever poor guy taking competition also hates money beef beef muslims",
    "light_cleaned_title": "(17/11/2021) Sangeet Som, BJP’s leading anti-beef crusader, owned a meat exporting company",
    "light_cleaned_selftext": "BJP MLA Sangeet Som (second from right) at Dadri where a man was lynched by mob for allegedly consuming beef. Mr. Som refused to condemn the lynching of Akhlaq and said he would try to get bail for the accused. Sangeet Singh Som, the fiery BJP MLA at the forefront of the frenzied anti-beef protests and an accused in the Muzaffarnagar riots, founded one of India’s leading halal meat export companies, according to documents available with The Hindu . The company, Al-Dua Food Processing Private Ltd, was founded by Mr. Som, along with Moinuddin Qureshi and a third partner, to deal in meat and meat products in 2005. According to Al-Dua’s website, the company is now a “leading producer and exporter of halal meat from India.”",
    "light_cleaned_comments": "Oh, are you telling me these idiots have been inflaming religious bigotry for their personal gain and they don't actually believe a word they say? 🤔 People's response : ![gif](giphy|7k2LoEykY5i1hfeWQB) “There was nothing about meat. I am a pure Hindu and would do nothing to hurt Hindu sentiment. You would be surprised to know that despite being a Thakur I don’t eat even egg and start my day with a havan,” he said Hahhahaha. Kaise bacche hai ye log. I swear mummy i am a goodest boy ever Poor guy is just taking out the competition. Also who hates money? It's not about beef. It's about beef with Muslims."
}