{
    "id": "149uijb",
    "title": "Stupidity of Republic Bharat reporting about Cyclone Biparjoy live (fake) from Dwarka, Gujarat",
    "url": "https://www.reddit.com/r/india/comments/149uijb/stupidity_of_republic_bharat_reporting_about/",
    "selftext": "Republic Bharat has done wonderful reporting. I am not sure how these people can call themselves mainstream media?\n\n[https://twitter.com/i/status/1669024120347185153](https://twitter.com/i/status/1669024120347185153)\n\nHave a look at the video. It is hilarious. ",
    "flair": "AskIndia",
    "score": 120,
    "num_comments": 20,
    "created_utc": 1686809389.0,
    "convurl": "https://external-preview.redd.it/p6ZJrkqh4OXftX6Ast0hMjJZS1ZTXsdoSyn5_kOUnGk.jpg?auto=webp&v=enabled&s=901a58d6facfd8f522f85d14c23e568bef68f9fe",
    "comments": [
        "As shared by AltNews guy Zubair,  the video Republic Bharat Actor Sweta has used in the background is of Hurricane in Florida.",
        "Stupidity is people  actually  watch this shit ..",
        "Yes. Maybe to laugh 😃😃",
        "The funniest thing is that the video is of Florida 😂😂😂\n\nhttps://twitter.com/zoo_bear/status/1669035438882045952?t=3JOg_MGA3LUaSKqxN5u8Sg&s=09",
        "I dont know how strong the hurricane will finally be but I have a feeling they are hyping it up to later show how effectively Guj Govt managed the crisis.",
        "I have seen this drama on local news channels, didn't know that even mainstream media resorts to this. I remember there was one news report in which the reporter was \"submerged\" neck deep in the water and she was warning people to stay in their homes or they would end up like her.",
        "I am surprised and speechless",
        "Could be",
        "They know what sells. They show what sells.\n\nTimes of India newspaper used to be full of Glamorous pictures of celebs and scintillating news articles. They were No 1 newspaper. \nAdvertising agencies look at TRPs; dont care how the TRPs were achieved.",
        "That's great ad placement!",
        "after the second falling bridge, they need something",
        "There is competition going on between news channels that which one can produce more shitty / cringey content . Everytime i see a stupid video there is always new one within fews days even more stupid than the previous one …media has turned into the circus and journalists acting as clowns",
        "Sweta from Republic\\_Bharat  reporting live from Dwarka, Gujarat, brought to you by Dollar Woman :chefkiss:",
        "It was a prank video in the garb of news, they will get millions of views so the mission is successful!!",
        "Ridiculous. They have made a mockery of journalism. Tilak, Gandhi and many others luminaries were once part of this vaulted profession in India. To see it reduced to theatrical gimmicks is just sad.",
        "second? you mean after morbi? which one?",
        "yep. morbi",
        "are wahi to pucha morbi ke baad dusri wali bridge accident kaun si thi.",
        "Tapi"
    ],
    "cleaned_text": "stupidity republic bharat reporting cyclone biparjoy live fake dwarka gujarat republic bharat done wonderful reporting sure people call mainstream media httpstwittercomistatushttpstwittercomistatus look video hilarious ",
    "cleaned_title": "stupidity republic bharat reporting cyclone biparjoy live fake dwarka gujarat",
    "cleaned_selftext": "republic bharat done wonderful reporting sure people call mainstream media httpstwittercomistatushttpstwittercomistatus look video hilarious",
    "cleaned_comments": "shared altnews guy zubair video republic bharat actor sweta used background hurricane florida stupidity people actually watch shit yes maybe laugh funniest thing video florida dont know strong hurricane finally feeling hyping later show effectively guj govt managed crisis seen drama local news channels didnt know even mainstream media resorts remember one news report reporter submerged neck deep water warning people stay homes would end like surprised speechless could know sells show sells times india newspaper used full glamorous pictures celebs scintillating news articles newspaper advertising agencies look trps dont care trps achieved thats great ad placement second falling bridge need something competition going news channels one produce shitty cringey content everytime see stupid video always new one within fews days even stupid previous one media turned circus journalists acting clowns sweta republicbharat reporting live dwarka gujarat brought dollar woman chefkiss prank video garb news get millions views mission successful ridiculous made mockery journalism tilak gandhi many others luminaries part vaulted profession india see reduced theatrical gimmicks sad second mean morbi one yep morbi wahi pucha morbi ke baad dusri wali bridge accident kaun si thi tapi",
    "light_cleaned_title": "Stupidity of Republic Bharat reporting about Cyclone Biparjoy live (fake) from Dwarka, Gujarat",
    "light_cleaned_selftext": "Republic Bharat has done wonderful reporting. I am not sure how these people can call themselves mainstream media? [https://twitter.com/i/status/1669024120347185153](https://twitter.com/i/status/1669024120347185153) Have a look at the video. It is hilarious.",
    "light_cleaned_comments": "As shared by AltNews guy Zubair, the video Republic Bharat Actor Sweta has used in the background is of Hurricane in Florida. Stupidity is people actually watch this shit .. Yes. Maybe to laugh 😃😃 The funniest thing is that the video is of Florida 😂😂😂 I dont know how strong the hurricane will finally be but I have a feeling they are hyping it up to later show how effectively Guj Govt managed the crisis. I have seen this drama on local news channels, didn't know that even mainstream media resorts to this. I remember there was one news report in which the reporter was \"submerged\" neck deep in the water and she was warning people to stay in their homes or they would end up like her. I am surprised and speechless Could be They know what sells. They show what sells. Times of India newspaper used to be full of Glamorous pictures of celebs and scintillating news articles. They were No 1 newspaper. Advertising agencies look at TRPs; dont care how the TRPs were achieved. That's great ad placement! after the second falling bridge, they need something There is competition going on between news channels that which one can produce more shitty / cringey content . Everytime i see a stupid video there is always new one within fews days even more stupid than the previous one …media has turned into the circus and journalists acting as clowns Sweta from Republic\\_Bharat reporting live from Dwarka, Gujarat, brought to you by Dollar Woman :chefkiss: It was a prank video in the garb of news, they will get millions of views so the mission is successful!! Ridiculous. They have made a mockery of journalism. Tilak, Gandhi and many others luminaries were once part of this vaulted profession in India. To see it reduced to theatrical gimmicks is just sad. second? you mean after morbi? which one? yep. morbi are wahi to pucha morbi ke baad dusri wali bridge accident kaun si thi. Tapi"
}