{
    "id": "17137di",
    "title": "RBI Meeting Live Updates: Few minutes to go for Guv Shaktikanta Das's speech",
    "url": "https://www.reddit.com/r/india/comments/17137di/rbi_meeting_live_updates_few_minutes_to_go_for/",
    "selftext": " The Reserve Bank of India (RBI) is likely to maintain the status quo on the benchmark interest rate at its bi-monthly monetary policy review to be announced on October 6, in view of elevated inflation and global factors, suggests CNBC-TV18's Citizens MPC poll.   \nGovernor Shaktikanta Das will begin his speech at 10 am.   \nTrack LIVE updates here👇  \n[https://www.cnbctv18.com/economy/rbi-monetary-policy-rbi-mpc-meeting-live-updates-interest-rate-hike-pause-october-governor-shaktikanta-das-17966721.htm](https://www.cnbctv18.com/economy/rbi-monetary-policy-rbi-mpc-meeting-live-updates-interest-rate-hike-pause-october-governor-shaktikanta-das-17966721.htm)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696566729.0,
    "convurl": "https://external-preview.redd.it/47D7UJhhDMP4M_C7Pl3ClNCl0NLfL7CbOURuma0Nqdk.jpg?auto=webp&s=3bda85ad1a93e67ad6ef9ae22f79b187a3022b84",
    "comments": [],
    "cleaned_text": "rbi meeting live updates minutes go guv shaktikanta dass speech reserve bank india rbi likely maintain status quo benchmark interest rate bimonthly monetary policy review announced october view elevated inflation global factors suggests cnbctvs citizens mpc poll governor shaktikanta das begin speech track live updates httpswwwcnbctvcomeconomyrbimonetarypolicyrbimpcmeetingliveupdatesinterestratehikepauseoctobergovernorshaktikantadashtmhttpswwwcnbctvcomeconomyrbimonetarypolicyrbimpcmeetingliveupdatesinterestratehikepauseoctobergovernorshaktikantadashtm ",
    "cleaned_title": "rbi meeting live updates minutes go guv shaktikanta dass speech",
    "cleaned_selftext": "reserve bank india rbi likely maintain status quo benchmark interest rate bimonthly monetary policy review announced october view elevated inflation global factors suggests cnbctvs citizens mpc poll governor shaktikanta das begin speech track live updates httpswwwcnbctvcomeconomyrbimonetarypolicyrbimpcmeetingliveupdatesinterestratehikepauseoctobergovernorshaktikantadashtmhttpswwwcnbctvcomeconomyrbimonetarypolicyrbimpcmeetingliveupdatesinterestratehikepauseoctobergovernorshaktikantadashtm",
    "cleaned_comments": "",
    "light_cleaned_title": "RBI Meeting Live Updates: Few minutes to go for Guv Shaktikanta Das's speech",
    "light_cleaned_selftext": "The Reserve Bank of India (RBI) is likely to maintain the status quo on the benchmark interest rate at its bi-monthly monetary policy review to be announced on October 6, in view of elevated inflation and global factors, suggests CNBC-TV18's Citizens MPC poll. Governor Shaktikanta Das will begin his speech at 10 am. Track LIVE updates here👇 [https://www.cnbctv18.com/economy/rbi-monetary-policy-rbi-mpc-meeting-live-updates-interest-rate-hike-pause-october-governor-shaktikanta-das-17966721.htm](https://www.cnbctv18.com/economy/rbi-monetary-policy-rbi-mpc-meeting-live-updates-interest-rate-hike-pause-october-governor-shaktikanta-das-17966721.htm)",
    "light_cleaned_comments": ""
}