{
    "id": "16ua887",
    "title": "[NSFL] unarmed Children and protesters being Gunned down again by Indian military and police. Don't we deserve freedom of expression? Never Forget these Crimes against humanity. Screw all religious Governments and parties. Only vote for well educated people.",
    "url": "https://www.reddit.com/r/india/comments/16ua887/nsfl_unarmed_children_and_protesters_being_gunned/",
    "selftext": "&#x200B;\n\nhttps://reddit.com/link/16ua887/video/f7veh5bgdyqb1/player\n\nhttps://reddit.com/link/16ua887/video/6weutiagdyqb1/player\n\nhttps://reddit.com/link/16ua887/video/31wd3x9gdyqb1/player\n\n&#x200B;\n\nhttps://reddit.com/link/16ua887/video/1mcqc3q9fyqb1/player\n\nhttps://reddit.com/link/16ua887/video/maza48q9fyqb1/player\n\n&#x200B;\n\nhttps://preview.redd.it/ndep0c6ahyqb1.png?width=510&format=png&auto=webp&s=b391f9cf2ec3663eb35a1386c4e5e4da60cf987a\n\n[Aftermath of shotgun shell.](https://preview.redd.it/ux1s0ctzgyqb1.png?width=680&format=png&auto=webp&s=18e82cd04d0c81419e77f923a494dcfbcd3b2368)\n\nNSFL warning\n\nin order\n\n[https://twitter.com/tridipkmandal/status/1707073163002302567?s=20](https://twitter.com/tridipkmandal/status/1707073163002302567?s=20)\n\n[https://x.com/tsng\\_exo/status/1707006308724150447?s=20](https://x.com/tsng_exo/status/1707006308724150447?s=20)\n\n[https://twitter.com/kirahsz/status/1707004011654906226?s=20](https://twitter.com/kirahsz/status/1707004011654906226?s=20)\n\n[https://twitter.com/Kelvishkv/status/1707134105622835463?s=20](https://twitter.com/Kelvishkv/status/1707134105622835463?s=20)\n\n[https://twitter.com/joliotlaishram/status/1707063127404343457?s=20](https://twitter.com/joliotlaishram/status/1707063127404343457?s=20)\n\nnational and international news \n\n[https://indianexpress.com/article/india/in-manipur-no-let-up-in-protests-over-killing-of-meitei-students-50-injured-8959112/](https://indianexpress.com/article/india/in-manipur-no-let-up-in-protests-over-killing-of-meitei-students-50-injured-8959112/)\n\n[https://www.thenationalnews.com/world/asia/2023/09/27/manipur-violence-teenager-hijam-linthoingambi/](https://www.thenationalnews.com/world/asia/2023/09/27/manipur-violence-teenager-hijam-linthoingambi/)\n\n[https://indianexpress.com/article/india/manipur-news-live-updates-protests-meitei-kuki-jaishankar-8958006/](https://indianexpress.com/article/india/manipur-news-live-updates-protests-meitei-kuki-jaishankar-8958006/)\n\n[https://x.com/gisa\\_rose/status/1707029139637551590?s=20](https://x.com/gisa_rose/status/1707029139637551590?s=20) (this got removed thanks to musk censorship)\n\nThis isn't the first time, according to current records, our military has been doing this since early 90's\n\n1993 Sopore massacre (43 civilians killed who were only traveling in a bus)\n\n1993 Bijbehara massacre ( Indian Army Fired in marching protesters and killed 37 protesters)\n\n1990 Zakoora and Tengpora massacre (26 protestors were  killed and 14 injured by Indian forces.)\n\n1990 Gawkadal massacre (when Indian Soldiers Fired in a crowd for protesting against their occupation)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695889271.0,
    "convurl": "https://external-preview.redd.it/L4BVe7lLpIDAvWLmVW8TtjR4z_sGDzbs8iB8QlFcguA.jpg?auto=webp&s=93ab53a4d725427cad1218d3c858565f5e9126e8",
    "comments": [
        "Guys please shift to federated websites. \n\nMusks accepts money from butcher governments. These money hoggers don't care about morality, they only talk and take money. they have no morality. i won't be surprised if this post gets removed by reddit.",
        "Mera bharat mahaan , right?",
        "They are silent in front of armed militants roaming in the hills but are brave in front of unarmed students. \nWhat a sorry state of affairs.",
        "RAF are explicitly for crowd control, they're not part of anti-insurgency operations",
        "Federated websites?",
        "Please ring the bell and subscribe to mudixi's YouTube channel.\n\nFucking disgrace",
        "Modi janta ko bajayega    \nAap ghanta ko bajao",
        "weren't these the same guys who attacked jamia millia university late 2019?",
        "I think a blood and Gore warning beside the nsfl tag would have been very helpful",
        "Mastadon servers.",
        "mastodon as an alternative for twitter.\n\nlemmy as an alternative for reddit.",
        "Cfbr",
        "Cfbr",
        "Can you crosspost this to worldnews?",
        "i got banned from there for criticizing islam.",
        "Is this in Manipur and y did criticism Islam, ps post this on anime tities which is a sister subreddit of world news funny story behind it",
        "What?!\n\nWhat's the story behind it or you are joking?",
        "See before anime tities raided world news and took it over, then world news took anime reddit over , then they agreed both will share world news",
        "yup, all who give their brains over for some national bullshit, basically these fucks have no sovereignty of their own minds, the worst kind of useful idiot is a soldier.",
        "Ohh... uhhh... well, I hope some new channels pick this up. Then the headline could be pulled there. Perhaps Combat Footage can help? Somewhere. This needs to spread.",
        "They had me banned for a while for saying rodeos where horses legs are broken then they die from it is animal abuse.\n\nTheir reason being \"Rodeo fans are a minority of which I was spreading hatred for\" LOL",
        "Sanatan Dharma is like malaria and dengue, it must be eradicated.",
        "linkedin nahi hai unkil",
        "yeah sanatan dharma and terrorist islam too both religions are like malaria and dengue",
        "I guess u will never be hired by unacademy now.",
        "Call centre terrorists hindutva worse than dog shit",
        "Bro the amount of propaganda op is spreading and u guys are actually believing it just unbelievable. First of all that is not military that is the local police and i read a comment that our military can only show its power to unarmed people dumbass do u know what are the achievements of our military. Writting bullshit abt them on reddit is very easy than actually doing the job .",
        "How come there is a difference in clarity and resolution of the video?",
        "Meitei protestors attacked and burned BJP offices so this is the aftermath. They have been given orders to shoot on sight. Vote out BJP!!",
        "Yeah Indian army is basically the best guys ever, they've never harmed/killed/raped civilians. In fact in Kashmir they're achieving so much progress with just pure love and respect to the civilians./s\n\nLaudu get your head out of your ass and look at what's been happening border states for years, do you think only radical/fringe elements are against the army/bsf ? They operate with impunity and often face zero consequences for any atrocities against unarmed civilians. Why do you think people hate the Afspa?",
        "With the police in full force in Manipur supportin the genocide. It's high time the forces restore law and order.\n\nWomen used as sheilds.\n\nInnocent people butchered\nYoung people brutally killed.\n\nDoesn't matter which side. \n\nManipur is our state in India. \n\nGood the para military is on the move.\n\n6000 automatic rifles and high calibre rifles and ammunition missing \n\nWe need peace.\n\nThe central government gave months for the warring tribes to settle.\n\nNow getting ass whooped peace will be restored."
    ],
    "cleaned_text": "nsfl unarmed children protesters gunned indian military police dont deserve freedom expression never forget crimes humanity screw religious governments parties vote well educated people xb xb xb aftermath shotgun shellhttpspreviewreddituxsctzgyqbpngwidthformatpngautowebpsecddcefadcfbcdb nsfl warning order httpstwittercomtridipkmandalstatusshttpstwittercomtridipkmandalstatuss httpsxcomtsngexostatusshttpsxcomtsngexostatuss httpstwittercomkirahszstatusshttpstwittercomkirahszstatuss httpstwittercomkelvishkvstatusshttpstwittercomkelvishkvstatuss httpstwittercomjoliotlaishramstatusshttpstwittercomjoliotlaishramstatuss national international news httpsindianexpresscomarticleindiainmanipurnoletupinprotestsoverkillingofmeiteistudentsinjuredhttpsindianexpresscomarticleindiainmanipurnoletupinprotestsoverkillingofmeiteistudentsinjured httpswwwthenationalnewscomworldasiamanipurviolenceteenagerhijamlinthoingambihttpswwwthenationalnewscomworldasiamanipurviolenceteenagerhijamlinthoingambi httpsindianexpresscomarticleindiamanipurnewsliveupdatesprotestsmeiteikukijaishankarhttpsindianexpresscomarticleindiamanipurnewsliveupdatesprotestsmeiteikukijaishankar httpsxcomgisarosestatusshttpsxcomgisarosestatuss got removed thanks musk censorship isnt first time according current records military since early sopore massacre civilians killed traveling bus bijbehara massacre indian army fired marching protesters killed protesters zakoora tengpora massacre protestors killed injured indian forces gawkadal massacre indian soldiers fired crowd protesting occupation ",
    "cleaned_title": "nsfl unarmed children protesters gunned indian military police dont deserve freedom expression never forget crimes humanity screw religious governments parties vote well educated people",
    "cleaned_selftext": "xb xb xb aftermath shotgun shellhttpspreviewreddituxsctzgyqbpngwidthformatpngautowebpsecddcefadcfbcdb nsfl warning order httpstwittercomtridipkmandalstatusshttpstwittercomtridipkmandalstatuss httpsxcomtsngexostatusshttpsxcomtsngexostatuss httpstwittercomkirahszstatusshttpstwittercomkirahszstatuss httpstwittercomkelvishkvstatusshttpstwittercomkelvishkvstatuss httpstwittercomjoliotlaishramstatusshttpstwittercomjoliotlaishramstatuss national international news httpsindianexpresscomarticleindiainmanipurnoletupinprotestsoverkillingofmeiteistudentsinjuredhttpsindianexpresscomarticleindiainmanipurnoletupinprotestsoverkillingofmeiteistudentsinjured httpswwwthenationalnewscomworldasiamanipurviolenceteenagerhijamlinthoingambihttpswwwthenationalnewscomworldasiamanipurviolenceteenagerhijamlinthoingambi httpsindianexpresscomarticleindiamanipurnewsliveupdatesprotestsmeiteikukijaishankarhttpsindianexpresscomarticleindiamanipurnewsliveupdatesprotestsmeiteikukijaishankar httpsxcomgisarosestatusshttpsxcomgisarosestatuss got removed thanks musk censorship isnt first time according current records military since early sopore massacre civilians killed traveling bus bijbehara massacre indian army fired marching protesters killed protesters zakoora tengpora massacre protestors killed injured indian forces gawkadal massacre indian soldiers fired crowd protesting occupation",
    "cleaned_comments": "guys please shift federated websites musks accepts money butcher governments money hoggers dont care morality talk take money morality wont surprised post gets removed reddit mera bharat mahaan right silent front armed militants roaming hills brave front unarmed students sorry state affairs raf explicitly crowd control theyre part antiinsurgency operations federated websites please ring bell subscribe mudixis youtube channel fucking disgrace modi janta ko bajayega aap ghanta ko bajao werent guys attacked jamia millia university late think blood gore warning beside nsfl tag would helpful mastadon servers mastodon alternative twitter lemmy alternative reddit cfbr cfbr crosspost worldnews got banned criticizing islam manipur criticism islam ps post anime tities sister subreddit world news funny story behind whats story behind joking see anime tities raided world news took world news took anime reddit agreed share world news yup give brains national bullshit basically fucks sovereignty minds worst kind useful idiot soldier ohh uhhh well hope new channels pick headline could pulled perhaps combat footage help somewhere needs spread banned saying rodeos horses legs broken die animal abuse reason rodeo fans minority spreading hatred lol sanatan dharma like malaria dengue must eradicated linkedin nahi hai unkil yeah sanatan dharma terrorist islam religions like malaria dengue guess u never hired unacademy call centre terrorists hindutva worse dog shit bro amount propaganda op spreading u guys actually believing unbelievable first military local police read comment military show power unarmed people dumbass u know achievements military writting bullshit abt reddit easy actually job come difference clarity resolution video meitei protestors attacked burned bjp offices aftermath given orders shoot sight vote bjp yeah indian army basically best guys ever theyve never harmedkilledraped civilians fact kashmir theyre achieving much progress pure love respect civilianss laudu get head ass look whats happening border states years think radicalfringe elements armybsf operate impunity often face zero consequences atrocities unarmed civilians think people hate afspa police full force manipur supportin genocide high time forces restore law order women used sheilds innocent people butchered young people brutally killed doesnt matter side manipur state india good para military move automatic rifles high calibre rifles ammunition missing need peace central government gave months warring tribes settle getting ass whooped peace restored",
    "light_cleaned_title": "[NSFL] unarmed Children and protesters being Gunned down again by Indian military and police. Don't we deserve freedom of expression? Never Forget these Crimes against humanity. Screw all religious Governments and parties. Only vote for well educated people.",
    "light_cleaned_selftext": "&#x200B; &#x200B; &#x200B; [Aftermath of shotgun shell.](https://preview.redd.it/ux1s0ctzgyqb1.png?width=680&format=png&auto=webp&s=18e82cd04d0c81419e77f923a494dcfbcd3b2368) NSFL warning in order [https://twitter.com/tridipkmandal/status/1707073163002302567?s=20](https://twitter.com/tridipkmandal/status/1707073163002302567?s=20) [https://x.com/tsng\\_exo/status/1707006308724150447?s=20](https://x.com/tsng_exo/status/1707006308724150447?s=20) [https://twitter.com/kirahsz/status/1707004011654906226?s=20](https://twitter.com/kirahsz/status/1707004011654906226?s=20) [https://twitter.com/Kelvishkv/status/1707134105622835463?s=20](https://twitter.com/Kelvishkv/status/1707134105622835463?s=20) [https://twitter.com/joliotlaishram/status/1707063127404343457?s=20](https://twitter.com/joliotlaishram/status/1707063127404343457?s=20) national and international news [https://indianexpress.com/article/india/in-manipur-no-let-up-in-protests-over-killing-of-meitei-students-50-injured-8959112/](https://indianexpress.com/article/india/in-manipur-no-let-up-in-protests-over-killing-of-meitei-students-50-injured-8959112/) [https://www.thenationalnews.com/world/asia/2023/09/27/manipur-violence-teenager-hijam-linthoingambi/](https://www.thenationalnews.com/world/asia/2023/09/27/manipur-violence-teenager-hijam-linthoingambi/) [https://indianexpress.com/article/india/manipur-news-live-updates-protests-meitei-kuki-jaishankar-8958006/](https://indianexpress.com/article/india/manipur-news-live-updates-protests-meitei-kuki-jaishankar-8958006/) [https://x.com/gisa\\_rose/status/1707029139637551590?s=20](https://x.com/gisa_rose/status/1707029139637551590?s=20) (this got removed thanks to musk censorship) This isn't the first time, according to current records, our military has been doing this since early 90's 1993 Sopore massacre (43 civilians killed who were only traveling in a bus) 1993 Bijbehara massacre ( Indian Army Fired in marching protesters and killed 37 protesters) 1990 Zakoora and Tengpora massacre (26 protestors were killed and 14 injured by Indian forces.) 1990 Gawkadal massacre (when Indian Soldiers Fired in a crowd for protesting against their occupation)",
    "light_cleaned_comments": "Guys please shift to federated websites. Musks accepts money from butcher governments. These money hoggers don't care about morality, they only talk and take money. they have no morality. i won't be surprised if this post gets removed by reddit. Mera bharat mahaan , right? They are silent in front of armed militants roaming in the hills but are brave in front of unarmed students. What a sorry state of affairs. RAF are explicitly for crowd control, they're not part of anti-insurgency operations Federated websites? Please ring the bell and subscribe to mudixi's YouTube channel. Fucking disgrace Modi janta ko bajayega Aap ghanta ko bajao weren't these the same guys who attacked jamia millia university late 2019? I think a blood and Gore warning beside the nsfl tag would have been very helpful Mastadon servers. mastodon as an alternative for twitter. lemmy as an alternative for reddit. Cfbr Cfbr Can you crosspost this to worldnews? i got banned from there for criticizing islam. Is this in Manipur and y did criticism Islam, ps post this on anime tities which is a sister subreddit of world news funny story behind it What?! What's the story behind it or you are joking? See before anime tities raided world news and took it over, then world news took anime reddit over , then they agreed both will share world news yup, all who give their brains over for some national bullshit, basically these fucks have no sovereignty of their own minds, the worst kind of useful idiot is a soldier. Ohh... uhhh... well, I hope some new channels pick this up. Then the headline could be pulled there. Perhaps Combat Footage can help? Somewhere. This needs to spread. They had me banned for a while for saying rodeos where horses legs are broken then they die from it is animal abuse. Their reason being \"Rodeo fans are a minority of which I was spreading hatred for\" LOL Sanatan Dharma is like malaria and dengue, it must be eradicated. linkedin nahi hai unkil yeah sanatan dharma and terrorist islam too both religions are like malaria and dengue I guess u will never be hired by unacademy now. Call centre terrorists hindutva worse than dog shit Bro the amount of propaganda op is spreading and u guys are actually believing it just unbelievable. First of all that is not military that is the local police and i read a comment that our military can only show its power to unarmed people dumbass do u know what are the achievements of our military. Writting bullshit abt them on reddit is very easy than actually doing the job . How come there is a difference in clarity and resolution of the video? Meitei protestors attacked and burned BJP offices so this is the aftermath. They have been given orders to shoot on sight. Vote out BJP!! Yeah Indian army is basically the best guys ever, they've never harmed/killed/raped civilians. In fact in Kashmir they're achieving so much progress with just pure love and respect to the civilians./s Laudu get your head out of your ass and look at what's been happening border states for years, do you think only radical/fringe elements are against the army/bsf ? They operate with impunity and often face zero consequences for any atrocities against unarmed civilians. Why do you think people hate the Afspa? With the police in full force in Manipur supportin the genocide. It's high time the forces restore law and order. Women used as sheilds. Innocent people butchered Young people brutally killed. Doesn't matter which side. Manipur is our state in India. Good the para military is on the move. 6000 automatic rifles and high calibre rifles and ammunition missing We need peace. The central government gave months for the warring tribes to settle. Now getting ass whooped peace will be restored."
}