{
    "id": "15hn63f",
    "title": "Help me make a choice",
    "url": "https://www.reddit.com/r/india/comments/15hn63f/help_me_make_a_choice/",
    "selftext": "Good morning everyone,\nSo I've been using the legendary poco f1 since 2018, I bought it because wanted a flagship chip & custom rom support (been using pixel experience) & It is finally dying. Now it's 2023 & my needs from a phone have changed, I'm looking for a smooth day-to-day use phone, I don't play games on my phone anymore, I use it for work apps like outlook, timesheets & figma for testing ui prototypes, sometimes Netflix & 30-40% of my sot is on reddit & Instagram. I have an busy work day so I need my Phone to last me a entire day without having to charge it multiple times.my budget is 27k & I have two choices here\r  \n\r  \n**[Poco F5](https://dl.flipkart.com/s/2Q7WEJNNNN)** \\- INR26,999 \n(ip52, great chip for the price, 12bit 120hz display, fast charging, bad to average camera no gcam ports yet, 50w fast charging with charger in the box, bloatware\\* can remove it with adb but know it was there) - poco is a subsidiary of xiaomi, infamous for their bad service & faulty motherboard.\r  \n\n**[Pixel 6a](https://dl.flipkart.com/s/L4JfAguuuN)** \\- INR25,999 (ip67, the Google experience, compact form-factor, will get 1 more year of security updates than the poco, tensor chip, good camera, + I've heard people complaining about battery & heating issues, clean & minimal experience) - im concerned about the heating issue since i live in india and it gets hot here.\n\r  \nim planning on using the phone until atleast 2027.\n& Please don't be biased❤️",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691114912.0,
    "convurl": "https://external-preview.redd.it/OY5bJzdrYlwfCCHciPEsxJwOAup6YnW0Wni1H2lVPvU.jpg?auto=webp&s=6ec96cc33f0d3c4700274b7688356e2486c0d2ed",
    "comments": [
        "buy the pixel. I use poco x3, pretty good phone. but am not a heavy user now, so I would go for a pixel or nothing phone or iphone mini or something",
        "Don't go with poco phones, they are not worth it anymore. Theres always some hardware or software issues with these.",
        "But the pixel 6a . I am still using my pixel 4a no problem at all .",
        "Do consider Samsung, mainly their FE series. S21FE is a pretty good device.",
        "don't buy pixel 6a. I have one. it has many issues. network problem is there. heating issue is there. charging is slow. Get phone with snapdragon processor if possible. Samsung modems are garbage.",
        "pixel 4a has snapdragon processor. pixel 6a has tensor which is based on exynos. it is really bad. Has heating and network issues.",
        "Do you play games? And are you talking exclusively about 5g coverage?",
        "No games. And talking about 4g network. Just search 'pixel 6a network issues'. Network is highly unreliable. It does not connect when others get good speed. Drops connection randomly. Have to turn airplane mode on/off to connect to network.",
        "It's not that Tensor and Exynos is bad, rather they have high performance ARM X1 cores (also present on recent Snapdragon SoCs) and the Pixel has insufficient cooling. This crap was designed for European countries with low ambient temps, not our hot Indian climate.",
        "even snapdragon processors made by Samsung have heating issues. Always go for TSMC made processors.",
        "It's not about TSMC vs Samsung foundry.........it's about the ARM cores used, frequency that they go upto, as well as the cooling setup used in a device.\n\nReality is that now that ARM cores have started using higher frequencies, and now their power use is also skyrocketing........leading to heat issues.\n\nEveryone loved shitting on x86 claiming that ARM was superior or whatever, but they were only ever using low power ARM CPUs without high frequency, and with special OS like Android and iOS that heavily restricted background work. Now we can see reality.",
        "TSMC processors also use x1 or x2 core. Still they have better thermals.",
        "No, those phones just have better cooling setups (especially some of those gaming phones)",
        "Check s20 (or s20 fe) with snapdragon and exynos comparison. They have everything same just different chipset.",
        "Cooling setup is also different........."
    ],
    "cleaned_text": "help make choice good morning everyone ive using legendary poco f since bought wanted flagship chip custom rom support using pixel experience finally dying needs phone changed im looking smooth daytoday use phone dont play games phone anymore use work apps like outlook timesheets figma testing ui prototypes sometimes netflix sot reddit instagram busy work day need phone last entire day without charge multiple timesmy budget k two choices poco fhttpsdlflipkartcomsqwejnnnn inr ip great chip price bit hz display fast charging bad average camera gcam ports yet w fast charging charger box bloatware remove adb know poco subsidiary xiaomi infamous bad service faulty motherboard pixel ahttpsdlflipkartcomsljfaguuun inr ip google experience compact formfactor get year security updates poco tensor chip good camera ive heard people complaining battery heating issues clean minimal experience im concerned heating issue since live india gets hot im planning using phone atleast please dont biased ",
    "cleaned_title": "help make choice",
    "cleaned_selftext": "good morning everyone ive using legendary poco f since bought wanted flagship chip custom rom support using pixel experience finally dying needs phone changed im looking smooth daytoday use phone dont play games phone anymore use work apps like outlook timesheets figma testing ui prototypes sometimes netflix sot reddit instagram busy work day need phone last entire day without charge multiple timesmy budget k two choices poco fhttpsdlflipkartcomsqwejnnnn inr ip great chip price bit hz display fast charging bad average camera gcam ports yet w fast charging charger box bloatware remove adb know poco subsidiary xiaomi infamous bad service faulty motherboard pixel ahttpsdlflipkartcomsljfaguuun inr ip google experience compact formfactor get year security updates poco tensor chip good camera ive heard people complaining battery heating issues clean minimal experience im concerned heating issue since live india gets hot im planning using phone atleast please dont biased",
    "cleaned_comments": "buy pixel use poco x pretty good phone heavy user would go pixel nothing phone iphone mini something dont go poco phones worth anymore theres always hardware software issues pixel still using pixel problem consider samsung mainly fe series sfe pretty good device dont buy pixel one many issues network problem heating issue charging slow get phone snapdragon processor possible samsung modems garbage pixel snapdragon processor pixel tensor based exynos really bad heating network issues play games talking exclusively g coverage games talking g network search pixel network issues network highly unreliable connect others get good speed drops connection randomly turn airplane mode onoff connect network tensor exynos bad rather high performance arm x cores also present recent snapdragon socs pixel insufficient cooling crap designed european countries low ambient temps hot indian climate even snapdragon processors made samsung heating issues always go tsmc made processors tsmc vs samsung foundryits arm cores used frequency go upto well cooling setup used device reality arm cores started using higher frequencies power use also skyrocketingleading heat issues everyone loved shitting x claiming arm superior whatever ever using low power arm cpus without high frequency special os like android ios heavily restricted background work see reality tsmc processors also use x x core still better thermals phones better cooling setups especially gaming phones check fe snapdragon exynos comparison everything different chipset cooling setup also different",
    "light_cleaned_title": "Help me make a choice",
    "light_cleaned_selftext": "Good morning everyone, So I've been using the legendary poco f1 since 2018, I bought it because wanted a flagship chip & custom rom support (been using pixel experience) & It is finally dying. Now it's 2023 & my needs from a phone have changed, I'm looking for a smooth day-to-day use phone, I don't play games on my phone anymore, I use it for work apps like outlook, timesheets & figma for testing ui prototypes, sometimes Netflix & 30-40% of my sot is on reddit & Instagram. I have an busy work day so I need my Phone to last me a entire day without having to charge it multiple times.my budget is 27k & I have two choices here **[Poco F5](https://dl.flipkart.com/s/2Q7WEJNNNN)** \\- INR26,999 (ip52, great chip for the price, 12bit 120hz display, fast charging, bad to average camera no gcam ports yet, 50w fast charging with charger in the box, bloatware\\* can remove it with adb but know it was there) - poco is a subsidiary of xiaomi, infamous for their bad service & faulty motherboard. **[Pixel 6a](https://dl.flipkart.com/s/L4JfAguuuN)** \\- INR25,999 (ip67, the Google experience, compact form-factor, will get 1 more year of security updates than the poco, tensor chip, good camera, + I've heard people complaining about battery & heating issues, clean & minimal experience) - im concerned about the heating issue since i live in india and it gets hot here. im planning on using the phone until atleast 2027. & Please don't be biased❤️",
    "light_cleaned_comments": "buy the pixel. I use poco x3, pretty good phone. but am not a heavy user now, so I would go for a pixel or nothing phone or iphone mini or something Don't go with poco phones, they are not worth it anymore. Theres always some hardware or software issues with these. But the pixel 6a . I am still using my pixel 4a no problem at all . Do consider Samsung, mainly their FE series. S21FE is a pretty good device. don't buy pixel 6a. I have one. it has many issues. network problem is there. heating issue is there. charging is slow. Get phone with snapdragon processor if possible. Samsung modems are garbage. pixel 4a has snapdragon processor. pixel 6a has tensor which is based on exynos. it is really bad. Has heating and network issues. Do you play games? And are you talking exclusively about 5g coverage? No games. And talking about 4g network. Just search 'pixel 6a network issues'. Network is highly unreliable. It does not connect when others get good speed. Drops connection randomly. Have to turn airplane mode on/off to connect to network. It's not that Tensor and Exynos is bad, rather they have high performance ARM X1 cores (also present on recent Snapdragon SoCs) and the Pixel has insufficient cooling. This crap was designed for European countries with low ambient temps, not our hot Indian climate. even snapdragon processors made by Samsung have heating issues. Always go for TSMC made processors. It's not about TSMC vs Samsung foundry.........it's about the ARM cores used, frequency that they go upto, as well as the cooling setup used in a device. Reality is that now that ARM cores have started using higher frequencies, and now their power use is also skyrocketing........leading to heat issues. Everyone loved shitting on x86 claiming that ARM was superior or whatever, but they were only ever using low power ARM CPUs without high frequency, and with special OS like Android and iOS that heavily restricted background work. Now we can see reality. TSMC processors also use x1 or x2 core. Still they have better thermals. No, those phones just have better cooling setups (especially some of those gaming phones) Check s20 (or s20 fe) with snapdragon and exynos comparison. They have everything same just different chipset. Cooling setup is also different........."
}