{
    "id": "166hkku",
    "title": "The BookYourShow scam: ICC Cricket World Cup 2023",
    "url": "https://www.reddit.com/gallery/166hkku",
    "selftext": "After wasting a few hours, first on Mastercard exclusive pre-sale and during general availability, it's all a disappointment.\n\nThe technical glitches and the overwhelming load on the ticketing platform is expected.\n\nBut is the BCCI really selling any considerable number of tickets to the general public through the so called official ticketing partner? \nCan fans get tickets by beating scalpers?\n\nOne waits for hours on the \"virtual queue\" just to see that all tickets are sold out. Is the current process any better than offline ticketing?\n\nWhy doesn't BCCI plan well ahead of time and have a process with equal opportunity for the fans? Public Ballot was followed for 2019 world cup and the applications were opened an year in advance.\n\nThank you for waiting!!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693503517.0,
    "convurl": "https://i.redd.it/tvcuhc5ffhlb1.jpg",
    "comments": [
        "This whole ticketing process with BCCI is a shit show and one scam. Right from the IPL to the other matches, more than 70% tickets are blocked to the sponsors and other VIPs. Only a few thousands are made available online or to show as if they are available. \n\nFor these few thousands, millions queue up online. They come back and say demand is sky high; tickets sold out in minutes while they hogwash with these BS terms. If you know your links, you will get your ticket may be even complimentary.",
        "the domain looks wrong",
        "If anyone wants IND vs Pak tickets message me, 2 tickets available, face 2 face deal"
    ],
    "cleaned_text": "bookyourshow scam icc cricket world cup wasting hours first mastercard exclusive presale general availability disappointment technical glitches overwhelming load ticketing platform expected bcci really selling considerable number tickets general public called official ticketing partner fans get tickets beating scalpers one waits hours virtual queue see tickets sold current process better offline ticketing doesnt bcci plan well ahead time process equal opportunity fans public ballot followed world cup applications opened year advance thank waiting ",
    "cleaned_title": "bookyourshow scam icc cricket world cup",
    "cleaned_selftext": "wasting hours first mastercard exclusive presale general availability disappointment technical glitches overwhelming load ticketing platform expected bcci really selling considerable number tickets general public called official ticketing partner fans get tickets beating scalpers one waits hours virtual queue see tickets sold current process better offline ticketing doesnt bcci plan well ahead time process equal opportunity fans public ballot followed world cup applications opened year advance thank waiting",
    "cleaned_comments": "whole ticketing process bcci shit show one scam right ipl matches tickets blocked sponsors vips thousands made available online show available thousands millions queue online come back say demand sky high tickets sold minutes hogwash bs terms know links get ticket may even complimentary domain looks wrong anyone wants ind vs pak tickets message tickets available face face deal",
    "light_cleaned_title": "The BookYourShow scam: ICC Cricket World Cup 2023",
    "light_cleaned_selftext": "After wasting a few hours, first on Mastercard exclusive pre-sale and during general availability, it's all a disappointment. The technical glitches and the overwhelming load on the ticketing platform is expected. But is the BCCI really selling any considerable number of tickets to the general public through the so called official ticketing partner? Can fans get tickets by beating scalpers? One waits for hours on the \"virtual queue\" just to see that all tickets are sold out. Is the current process any better than offline ticketing? Why doesn't BCCI plan well ahead of time and have a process with equal opportunity for the fans? Public Ballot was followed for 2019 world cup and the applications were opened an year in advance. Thank you for waiting!!",
    "light_cleaned_comments": "This whole ticketing process with BCCI is a shit show and one scam. Right from the IPL to the other matches, more than 70% tickets are blocked to the sponsors and other VIPs. Only a few thousands are made available online or to show as if they are available. For these few thousands, millions queue up online. They come back and say demand is sky high; tickets sold out in minutes while they hogwash with these BS terms. If you know your links, you will get your ticket may be even complimentary. the domain looks wrong If anyone wants IND vs Pak tickets message me, 2 tickets available, face 2 face deal"
}