{
    "id": "1f8qt53",
    "title": "48% GST on hybrid cars",
    "url": "https://i.redd.it/wpzpfpv82smd1.jpeg",
    "selftext": "I didn't know we had 48% GST on hybrid vehicles. That is ridiculously insane. Hybrid is the most suitable car for a country like India because of our humongous population and lack of public EV infrastructure. ",
    "flair": "Policy/Economy",
    "score": 1214,
    "num_comments": 157,
    "created_utc": 1725449168.0,
    "convurl": "https://i.redd.it/wpzpfpv82smd1.jpeg",
    "comments": [
        "Hybrids are more practical than EVs.",
        "Chutia govt dont know India = world's EV dumping ground for EV makers",
        "C*nt ? Wo kya hota hai?",
        "Lol for a while I was scratching my head",
        "I am still scratching",
        "Hey you! \n\nWanna help the mother earth heal??\n\nNot so fast \"ideal citizen\" !",
        "Lol. They just need an excuse to increase GST wherever they can. Nothing to do with the environment or sustainability.",
        "My Toyota Camry gives mileage of more than 10kpl. A comparable ICE model would give FE of only 7 or 8 at best.",
        "Hold Suzuki accountable for taking advantage of government incentives in the past by misrepresenting their vehicle as a hybrid, when in fact it didn't meet the true definition of a hybrid.",
        "Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter.\n\nAlso for further information HPCL/BPCL/IOC/etc don't own the petrol pumps themselves, and instead give franchises to dealers who are almost always private entities.\n\nIn most cases the pumps themselves do not have nearly enough space to have vehicles parked inside for 30 minutes or one hour.\n\nWhat they should instead do is offer incentives to parking lots to install EV charging equipment.",
        "What’s the rationale for 48% GST on hybrids, if the GST on ICE is 28%? What am I missing?",
        "You're that our policy makers are some of the finest stupids on earth .",
        "https://preview.redd.it/23q93soohsmd1.png?width=1080&format=pjpg&auto=webp&s=ff4a299e5d2edc6b3cd7485f1e2841029f8364a9\n\nPay 48% GST and get these kinds of roads. Literally the next post on my feed.",
        "KL 07 in Gurgaon. That guy/girl did a lot of travel.",
        "lol really hybrids are taxed more than regular cars wow",
        "> The Honda CIty eHEV gives around 13kpl real world fuel economy while the petrol version gives around 9.5.\n\nI have two friends who own Honda City hybrid and both of them consistently get around 18-19kmpl in city and an easy 23kmpl on highways. I am not really sure why you quoted such a low avg for that car. Even the Grand Vitara strong hybrid gives around 18-19kmpl in city which is Incredible for a car in that segment. In my experience, a hybrid car gives considerably higher mileage than ICE cars and are also more fun to drive because of the instant torque availability. I am actually surprised that your Camry gives you only 10kmpl because that's quite low even for a Camry.",
        "Not just more but almost double. It's unbelievable.",
        "Eff this guy. And eff this policy. \nIndia seems to be not the best place for being a petrol head.",
        "This is bullshit, because Hybrid has a positive impact too. \n\nEV's, on the other hand, consume so much resources just to build one battery",
        "Sorry I laughed so hard ,reading the headlines, i shorted out my coffee.\n\n\nPlease continue....",
        "Obviously it differs a lot based on usage since traffic conditions differ from city to city, and it's not at all unreasonable to get 18kpl if you consistently hit bumper to bumper traffic, get to take advantage of regenerative braking and your battery gets fed consistently.",
        "He is the same guy who said India is too democratic right?",
        "There's transport service that'll deliver you the car",
        "If you want to ask of the sincerest form of morally upright  uptight buggerhole stupidity, ask governments of high regualations. \n\nYou want to take diesel out for emissions - Fine!\n\nYou want to bring EVs - GOOD!\n\nBut then:\n\nYou mind normalizing petrol prices? - NO!\n\nYou mind providing a good charging network? - Not really..\n\nYou mind replacing Coal Plants with larger scale solars and Nuclear finally? - We aren't there yet. Mission 2070.\n\n  \nAll we have is idiotic small scale change that are never enough. Climate needs overhauls, not slugs pace. Invest in R&D and Support.",
        "The problem with eletric car is power cuts and power cuts Heck what about rural area even America has delayed electric promise by a lot so in natural they want us Walk or what or in floods",
        "In our country, decisions are not made with the public, the environment, or convenience in mind. \n\nInstead, they are driven by how much tax can be collected, how much companies can be pressured for bribes, and how much a minister can profit during their term.\n\nThis is not a visionary or future-oriented nation; people here are only concerned with how much they can exploit today, even if it means destroying resources or jeopardizing future generations.",
        "Probably none of their friends are in hybrid business.",
        "This goes to show all mechanical and  automobile engineers have zero voice in this country . I'm not sure if incompetence has a role to play but this effect on taxes is absurd . \nNo one , not even the IITans have any effect on the development of policies in this country . And the government has the audacity to demand hydrogen powered vehicles , without any grasp of basic thermodynamics. The entire country is only good for copy and paste , there is no innovation, just donkeys carrying dung . \nThe only form of electric vehicles that can actually make a difference in emissions are taxed the most . I salute you government .",
        "Isn't 40% the maximum GST allowed acc to the constitution?",
        "Your C*unt ?",
        "Cunt*",
        "Exactly … one way you are saying use public transport and at same time you don’t have public transportation infrastructure. No EVs are reliable, no infra of battery drained to pull over. Hybrids are way better and practical. And role of govt should to roll out electric in phases where hybrid is pre phase to total electric, which will give time to implement electric infrastructure.",
        ">Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter.\n\nIt is possible.  But that depends on the car manufacturer too.",
        "Probably lobbying by you know who.",
        "And medicine trial ground too for big pharmas",
        "Govt looks like a vampire\n\n>The Finance Ministry is considering a proposal to reduce the GST on hybrid vehicles to 5% and remove the additional 15% cess currently applied to the 28% GST. Currently, hybrid vehicles are taxed at 43 per cent GST, while internal combustion engine vehicles are taxed at 48 per cent..17 Jul 2024",
        "Next election 200 paar? nah man, 48% gst reduction to the votes they get",
        ">In our country, decisions are not made with the public, the environment, or convenience in mind. \n\nWe have a stupid form of democracy because everyone gets equal vote and only 9% have seen college.",
        "Guy came all the way from Kerala only to get his engine flooded 🥰",
        "Just gonna leave it here.\n\nhttps://www.financialexpress.com/business/banking-finance-online-banking-to-kill-physical-banks-in-5-6-yrs-amitabh-kant-708673/",
        "That's why everyone who can, leaves this shithole country",
        "Most people will charge their cars at home.",
        "Major sigh of relief from the electricity boards who are in no way ready for India to go the electric car/bike route right now.",
        "These clown policy makers of the govt very well know that the category of people they are abusing with impractical taxation will never protest on streets apart from online rants which will subside in a couple of days.",
        "Sure, but parking lots with paid charging will want to make money through an additional revenue stream.",
        "The taxes in India are horrendous. I recently bought a BMW IX here in Germany for around €80,000. I was shocked to see the same car in India costs close to €200,000 in India if you directly convert it. More than double the cost. This is a full blown electric car(not a plug in hybrid). \n\nIf this is the \"5%\" they claim will promote electric car purchases in India, I'm scared to see what the \"full\" taxation system is like on hybrids. They keep doing this and they will ensure, India's automotive sector will never grow and will never be a priority for any car maker.",
        "So much tax collection just to give freebies to vote bank",
        "Govt can be very creative with cess",
        "The rationale is simple. Toyota stands to benefit the most from hybrids duty reduction, so Mahindra, Tata and the rest are against it.\n\nPoor Policy move in my opinion",
        "There’re company owned company operated fuel stations across the country. These stations along with their private retailers should be equipped with fast charging stations. The charging network and infrastructure should be strong at least from the government’s side. They can charge for charging the vehicles but when the infrastructure itself is absent, why is the government pushing for ev?",
        "Evs are ok, its just that the lack of the engine sound is one thing that i dont like. And 48 percent tax on hybrids, like come on now.",
        "Here is the source: https://www.business-standard.com/industry/auto/48-tax-on-hybrid-cars-5-on-electric-to-continue-for-long-time-kant-124090300442_1.html\n\nOP: When you post a news clipping, please provide a source that can verify the news clipping. \n\nAlso, please note that the title of the article is \"48% GST on Hybrid cars, 5% on EVs to stay: Kant\". \n\nWe require that you always use the exact same title as the article, without any omissions or additions.",
        "The fuel stations don't have nearly enough space to keep cars in place while they are charging.\n\nCompany owned fuel stations are a much, much smaller mix compared to the vast private retailer network.",
        "And we will have people saying in reddit\n\n\"Why do we need to have educational qualifications to get elected\" ????? Hainnnnn?",
        "Pushing for pure EV instead of hybrids, which is why Hybrid GST >> EV GST.",
        "That’s the point I’m making. Why is the government pushing for something when there’s no infrastructure present at place. When there’re enough charging stations established across the country, then the government can implement these taxes.",
        "Any imported cars are double the original cost, but India always had this policy and that policy is the reason why we have home grown car companies.",
        "Why don’t I just give all my salary as tax at once instead of in instalments like this , so that the politicians and their cronies can get more rich",
        "If india didn't has such trash public transport I'd love this extreme taxation \n\n\nBut now due to this car owners feel entitled and believe they own whatever public land they occupy",
        "Worth pointing out, salaried folks who buy such Hybrids have already paid 30%+ of their earnings in IT ***BEFORE*** they go shopping for a car or anything else.",
        "Which EVs are getting dumped in India lol? We literally have the least amount of options, and ridiculously priced because almost all are imported with 70-100% import duty in addition to GST and road tax.",
        "Next time when you vote, please remember the difference between development and fake development.",
        "Taxes on both ICE and Hybrid cars is the same.\n\n28% GST + 1-4% cess: if car is less than 4m length and less than 1.2L petrol/1.5L diesel engine.\n\n28% GST + 15% cess: if car is >4m or >1.2/1.5L\n\n28% GST + 20/22% cess: if car is classified as an SUV. There are some ground clearance rules in addition.\n\nGST on both ICE and hybrid cars go upto 50%. Plus road taxes based on state which can take total tax upto 75-80%.",
        "48% GST on hybrid cars,\n\n5% on EVs to stay: Cunt",
        "Hybrids may be practical in some terms but considering even its current cost it is nowhere near practical unless you drive way more kms than an average person. Hybrids are the most logical transition to ev but looks like the current govt policies says otherwise .",
        "He surely is a ‘Kant’",
        "Heading is incorrect. GST on hybrid cars in 28%. Total taxes included GST, other Taxes and Cess is 48%.",
        "Govt is pushing for EV since it is not going to be adapted anytime soon in the country. This gives them an excuse to levy huge tax on normal vehicles.  \n  \nIf they actually cared about the environment, then there are numerous things they could have done till now.",
        "Just put my plan of buying car on backseat \nWill go back to traditional petrol now",
        "It's never about environment",
        "amitabh cunt",
        "They aren't charged higher.\nCars are charged based on their engine and lenth.\nMy car longer than 4 meters and has >1.5 litre engine so it is taxed at 40 plus percentage despite being a petrol car whereas my father's Swift is taxed lower",
        "Which gives EV manufacturers 43 more reasons to increase margins by 43%. EVs have been a major scam in the automobile industry.",
        "I don't know what you are talking about. I have a car that is greater than 4m and a 1.5 litre as well. But I didn't pay >40% tax on my car. On road price is about 25% more than the ex-showroom price. I know there are lot of tax slabs and criteria but ICE vehicles are taxed insanely only after a certain segment. Like if you are buying luxury vehicles (bmw, merc etc) or import a vehicle (100% tax).",
        "They are very expensive for the average indian population. Well, very expensive when compared to the product that you get. For example a Tata nexon EV costs >16L on road with a real world range of ~300km. 16L for a Nexon, imagine that. And has very bad resale value and you will have to change the battery after 7-8 years of use which will cost you over 4L easily. I mean wtf is the point of an EV besides lesser emissions? And in a country like India I feel EV is extremely overrated and a waste of money. We don't have public ev infra to charge if needed, no superchargers available, and if there is a power cut or you forgot to charge then Goodluck using the car.",
        "Marginally low emissions* how will an individual charge their EV? Summoning Indra Dev? Or by using the electricity available at the nearest or the convenient point? How is that electricity produced? How are the materials used in EV sourced? & yet smart & intelligent people label it as a sustainable product. Once a great man said ‘Hippo-crazy ki bhi seema hoti h’.",
        "> Hybrid is the most suitable car for a country like India because of our humongous population and lack of public EV infrastructure.\n\nAnd the powercuts even in some Metro cities during Summer months.",
        "\"48% GST on Hybrid cars, 5% on EVs to stay: Cunt\". FTFY.",
        "He kant logic. Hence the last name.",
        "Or may be they want buyers to compensate for the loss in excise revenue as hybrids are much more efficient. Chutyas.",
        "Largest open air tax jail on earth. Welcome to India.",
        "Yes",
        "Meanwhile his daughter will be driving a hybrid car in the USA..",
        "Well, that's a lot, period.",
        "Ding ding ding.\n\nThis is how to understand public policy in this government.",
        "Babu unwillingness to let go of higher taxes is exactly why India will remain a shithole for the next trillion years. Vishwaguru my unclean asshole. Neither Pappu, chaiwala or muffler man can save this country. \n\nTaxes aren’t going down in any country right now - expect the status quo in India as well.",
        "Just remembered he was the g20 sherpa, holy shit the govt needs to reconsider the sanity of it's employees",
        "Expenditure for R&D is around 0.66% in this country. No wonder we have such stupid policies lol",
        "Pay 48% gst then car gets flooded then again pay 48% gst for another car and then car gets flooded and you get the point \n\nSarkar ka paisa kamane ka scheme",
        "We've sheltered our automotive industry for decades and they're still not competitive. It's a wealth transfer from consumers to connected cronies(think of all the permits and licenses you need to make cars here and who can navigate this system).",
        "Bro that's road tax and it's different for each state. GST (the one we're talking about here) is included in ex showroom price",
        "Also there's no extra tax on buying luxury vehicles like BMW or Merc, it's always about the length, engine, ground clearance and manufacturing of a car. Most luxury vehicles are CBU and that's why they're taxed at 100%.",
        "Just checked the invoice, my car is taxed at 45% (28%GST+17% Cess) and it's included in Ex showroom. And another 15% as road tax so I've paid 60% tax on my 16 lakhs car which originally costed 9-10 lakhs.",
        "Jumla sarkar doing jumla ! And they say they will make India develloped! My foot!",
        "I'm just going to use my bicycle(unless I have luggage or passengers) till this nonsense is over someday(hopefully). Screw these people making rules about 15 year old cars, ethanol to ruin the engine, electric cars which don't have infra or good reliable cheap batteries, and Ridiculous GST",
        "Wow.. the gift keeps giving",
        "Chinese have tons of EVs to move. Most are flooding to Australia with North American 100% tariff. Why don't those come to India?.",
        " how did you check it? I tried finding my gst details but I don't see it anywhere.",
        ">Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter.\n\nBOOM goes the dynamite",
        "I will not be comfortable having huge currents flowing next to a highly flammable liquid but I guess you are more adventurous than me.",
        "These stations already operate on 3-phase 230VAC inputs so the risk of a short circuit is not meaningfully increased.\n\nI would be more worried about the battery catching fire if there is a mishap at the pump rather than electric arcs or sparking starting a fire.",
        "Not possible at all. Even the fastest charging EVs with the most capable chargers (of which there are a handful in India) would take 20-30 minutes for an 80% charge.",
        "He was talking about a reasonable range.  \n\nYou are right about 80% \n But we can charge upto 30-40% in 10 mins",
        "The whole point of a reasonable range I think should be that you don't need to fill up again. (Just like an ice car) ",
        "The correct answer. Most of people don't know the structure and harping on half truth.",
        "Can we change the title please. The taxes aren't increasing. It's just that they are not lowering those. \n\nThere are pros and cons and different firms are trying to push their agenda here. Like Toyota, Honda and Maruti are pushing for Hybrids but Tata, Mahindra and Mercedes are against any cuts for Hybrids.",
        "Yes it's more practical, but all of our dear politicians have heavily invested in EV market post Tesla success. They don't want their investment to evaporate 💀... that's the only concern for them.",
        "I haven't said anywhere that the taxes are rising. I even said that I didn't know it was 48%, which is insanely high. The government shouldn't bend and kiss ass for corporates, they should be focused on its people.",
        "Also, IMHO the govt should focus on converting all public transport systems to EV first then target the consumer personal vehicles. I live in Bangalore, I hope soon all BMTC buses, govt transport trucks will be running on EV. Majority of the pollution comes from old ICE vehicles since they don’t get serviced regularly, leaving behind a thick black veil of smoke bomb.",
        "looters"
    ],
    "cleaned_text": "gst hybrid cars didnt know gst hybrid vehicles ridiculously insane hybrid suitable car country like india humongous population lack public ev infrastructure ",
    "cleaned_title": "gst hybrid cars",
    "cleaned_selftext": "didnt know gst hybrid vehicles ridiculously insane hybrid suitable car country like india humongous population lack public ev infrastructure",
    "cleaned_comments": "hybrids practical evs chutia govt dont know india worlds ev dumping ground ev makers cnt wo kya hota hai lol scratching head still scratching hey wan na help mother earth heal fast ideal citizen lol need excuse increase gst wherever nothing environment sustainability toyota camry gives mileage kpl comparable ice model would give fe best hold suzuki accountable taking advantage government incentives past misrepresenting vehicle hybrid fact didnt meet true definition hybrid unless pay charge passenger vehicles within minutes reasonable amount range putting ev charging stations petrol pumps nonstarter also information hpclbpcliocetc dont petrol pumps instead give franchises dealers almost always private entities cases pumps nearly enough space vehicles parked inside minutes one hour instead offer incentives parking lots install ev charging equipment whats rationale gst hybrids gst ice missing youre policy makers finest stupids earth pay gst get kinds roads literally next post feed kl gurgaon guygirl lot travel lol really hybrids taxed regular cars wow honda city ehev gives around kpl real world fuel economy petrol version gives around two friends honda city hybrid consistently get around kmpl city easy kmpl highways really sure quoted low avg car even grand vitara strong hybrid gives around kmpl city incredible car segment experience hybrid car gives considerably higher mileage ice cars also fun drive instant torque availability actually surprised camry gives kmpl thats quite low even camry almost double unbelievable eff guy eff policy india seems best place petrol head bullshit hybrid positive impact evs hand consume much resources build one battery sorry laughed hard reading headlines shorted coffee please continue obviously differs lot based usage since traffic conditions differ city city unreasonable get kpl consistently hit bumper bumper traffic get take advantage regenerative braking battery gets fed consistently guy said india democratic right theres transport service thatll deliver car want ask sincerest form morally upright uptight buggerhole stupidity ask governments high regualations want take diesel emissions fine want bring evs good mind normalizing petrol prices mind providing good charging network really mind replacing coal plants larger scale solars nuclear finally arent yet mission idiotic small scale change never enough climate needs overhauls slugs pace invest rd support problem eletric car power cuts power cuts heck rural area even america delayed electric promise lot natural want us walk floods country decisions made public environment convenience mind instead driven much tax collected much companies pressured bribes much minister profit term visionary futureoriented nation people concerned much exploit today even means destroying resources jeopardizing future generations probably none friends hybrid business goes show mechanical automobile engineers zero voice country im sure incompetence role play effect taxes absurd one even iitans effect development policies country government audacity demand hydrogen powered vehicles without grasp basic thermodynamics entire country good copy paste innovation donkeys carrying dung form electric vehicles actually make difference emissions taxed salute government isnt maximum gst allowed acc constitution cunt cunt exactly one way saying use public transport time dont public transportation infrastructure evs reliable infra battery drained pull hybrids way better practical role govt roll electric phases hybrid pre phase total electric give time implement electric infrastructure unless pay charge passenger vehicles within minutes reasonable amount range putting ev charging stations petrol pumps nonstarter possible depends car manufacturer probably lobbying know medicine trial ground big pharmas govt looks like vampire finance ministry considering proposal reduce gst hybrid vehicles remove additional cess currently applied gst currently hybrid vehicles taxed per cent gst internal combustion engine vehicles taxed per cent jul next election paar nah man gst reduction votes get country decisions made public environment convenience mind stupid form democracy everyone gets equal vote seen college guy came way kerala get engine flooded gon na leave thats everyone leaves shithole country people charge cars home major sigh relief electricity boards way ready india go electric carbike route right clown policy makers govt well know category people abusing impractical taxation never protest streets apart online rants subside couple days sure parking lots paid charging want make money additional revenue stream taxes india horrendous recently bought bmw ix germany around shocked see car india costs close india directly convert double cost full blown electric carnot plug hybrid claim promote electric car purchases india im scared see full taxation system like hybrids keep ensure indias automotive sector never grow never priority car maker much tax collection give freebies vote bank govt creative cess rationale simple toyota stands benefit hybrids duty reduction mahindra tata rest poor policy move opinion therere company owned company operated fuel stations across country stations along private retailers equipped fast charging stations charging network infrastructure strong least governments side charge charging vehicles infrastructure absent government pushing ev evs ok lack engine sound one thing dont like percent tax hybrids like come source op post news clipping please provide source verify news clipping also please note title article gst hybrid cars evs stay kant require always use exact title article without omissions additions fuel stations dont nearly enough space keep cars place charging company owned fuel stations much much smaller mix compared vast private retailer network people saying reddit need educational qualifications get elected hainnnnn pushing pure ev instead hybrids hybrid gst ev gst thats point im making government pushing something theres infrastructure present place therere enough charging stations established across country government implement taxes imported cars double original cost india always policy policy reason home grown car companies dont give salary tax instead instalments like politicians cronies get rich india didnt trash public transport id love extreme taxation due car owners feel entitled believe whatever public land occupy worth pointing salaried folks buy hybrids already paid earnings go shopping car anything else evs getting dumped india lol literally least amount options ridiculously priced almost imported import duty addition gst road tax next time vote please remember difference development fake development taxes ice hybrid cars gst cess car less length less l petroll diesel engine gst cess car l gst cess car classified suv ground clearance rules addition gst ice hybrid cars go upto plus road taxes based state take total tax upto gst hybrid cars evs stay cunt hybrids may practical terms considering even current cost nowhere near practical unless drive way kms average person hybrids logical transition ev looks like current govt policies says otherwise surely kant heading incorrect gst hybrid cars total taxes included gst taxes cess govt pushing ev since going adapted anytime soon country gives excuse levy huge tax normal vehicles actually cared environment numerous things could done till put plan buying car backseat go back traditional petrol never environment amitabh cunt arent charged higher cars charged based engine lenth car longer meters litre engine taxed plus percentage despite petrol car whereas fathers swift taxed lower gives ev manufacturers reasons increase margins evs major scam automobile industry dont know talking car greater litre well didnt pay tax car road price exshowroom price know lot tax slabs criteria ice vehicles taxed insanely certain segment like buying luxury vehicles bmw merc etc import vehicle tax expensive average indian population well expensive compared product get example tata nexon ev costs l road real world range km l nexon imagine bad resale value change battery years use cost l easily mean wtf point ev besides lesser emissions country like india feel ev extremely overrated waste money dont public ev infra charge needed superchargers available power cut forgot charge goodluck using car marginally low emissions individual charge ev summoning indra dev using electricity available nearest convenient point electricity produced materials used ev sourced yet smart intelligent people label sustainable product great man said hippocrazy ki bhi seema hoti h hybrid suitable car country like india humongous population lack public ev infrastructure powercuts even metro cities summer months gst hybrid cars evs stay cunt ftfy kant logic hence last name may want buyers compensate loss excise revenue hybrids much efficient chutyas largest open air tax jail earth welcome india yes meanwhile daughter driving hybrid car usa well thats lot period ding ding ding understand public policy government babu unwillingness let go higher taxes exactly india remain shithole next trillion years vishwaguru unclean asshole neither pappu chaiwala muffler man save country taxes arent going country right expect status quo india well remembered g sherpa holy shit govt needs reconsider sanity employees expenditure rd around country wonder stupid policies lol pay gst car gets flooded pay gst another car car gets flooded get point sarkar ka paisa kamane ka scheme weve sheltered automotive industry decades theyre still competitive wealth transfer consumers connected croniesthink permits licenses need make cars navigate system bro thats road tax different state gst one talking included ex showroom price also theres extra tax buying luxury vehicles like bmw merc always length engine ground clearance manufacturing car luxury vehicles cbu thats theyre taxed checked invoice car taxed gst cess included ex showroom another road tax ive paid tax lakhs car originally costed lakhs jumla sarkar jumla say make india develloped foot im going use bicycleunless luggage passengers till nonsense somedayhopefully screw people making rules year old cars ethanol ruin engine electric cars dont infra good reliable cheap batteries ridiculous gst wow gift keeps giving chinese tons evs move flooding australia north american tariff dont come india check tried finding gst details dont see anywhere unless pay charge passenger vehicles within minutes reasonable amount range putting ev charging stations petrol pumps nonstarter boom goes dynamite comfortable huge currents flowing next highly flammable liquid guess adventurous stations already operate phase vac inputs risk short circuit meaningfully increased would worried battery catching fire mishap pump rather electric arcs sparking starting fire possible even fastest charging evs capable chargers handful india would take minutes charge talking reasonable range right charge upto mins whole point reasonable range think dont need fill like ice car correct answer people dont know structure harping half truth change title please taxes arent increasing lowering pros cons different firms trying push agenda like toyota honda maruti pushing hybrids tata mahindra mercedes cuts hybrids yes practical dear politicians heavily invested ev market post tesla success dont want investment evaporate thats concern havent said anywhere taxes rising even said didnt know insanely high government shouldnt bend kiss ass corporates focused people also imho govt focus converting public transport systems ev first target consumer personal vehicles live bangalore hope soon bmtc buses govt transport trucks running ev majority pollution comes old ice vehicles since dont get serviced regularly leaving behind thick black veil smoke bomb looters",
    "light_cleaned_title": "48% GST on hybrid cars",
    "light_cleaned_selftext": "I didn't know we had 48% GST on hybrid vehicles. That is ridiculously insane. Hybrid is the most suitable car for a country like India because of our humongous population and lack of public EV infrastructure.",
    "light_cleaned_comments": "Hybrids are more practical than EVs. Chutia govt dont know India = world's EV dumping ground for EV makers C*nt ? Wo kya hota hai? Lol for a while I was scratching my head I am still scratching Hey you! Wanna help the mother earth heal?? Not so fast \"ideal citizen\" ! Lol. They just need an excuse to increase GST wherever they can. Nothing to do with the environment or sustainability. My Toyota Camry gives mileage of more than 10kpl. A comparable ICE model would give FE of only 7 or 8 at best. Hold Suzuki accountable for taking advantage of government incentives in the past by misrepresenting their vehicle as a hybrid, when in fact it didn't meet the true definition of a hybrid. Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter. Also for further information HPCL/BPCL/IOC/etc don't own the petrol pumps themselves, and instead give franchises to dealers who are almost always private entities. In most cases the pumps themselves do not have nearly enough space to have vehicles parked inside for 30 minutes or one hour. What they should instead do is offer incentives to parking lots to install EV charging equipment. What’s the rationale for 48% GST on hybrids, if the GST on ICE is 28%? What am I missing? You're that our policy makers are some of the finest stupids on earth . Pay 48% GST and get these kinds of roads. Literally the next post on my feed. KL 07 in Gurgaon. That guy/girl did a lot of travel. lol really hybrids are taxed more than regular cars wow > The Honda CIty eHEV gives around 13kpl real world fuel economy while the petrol version gives around 9.5. I have two friends who own Honda City hybrid and both of them consistently get around 18-19kmpl in city and an easy 23kmpl on highways. I am not really sure why you quoted such a low avg for that car. Even the Grand Vitara strong hybrid gives around 18-19kmpl in city which is Incredible for a car in that segment. In my experience, a hybrid car gives considerably higher mileage than ICE cars and are also more fun to drive because of the instant torque availability. I am actually surprised that your Camry gives you only 10kmpl because that's quite low even for a Camry. Not just more but almost double. It's unbelievable. Eff this guy. And eff this policy. India seems to be not the best place for being a petrol head. This is bullshit, because Hybrid has a positive impact too. EV's, on the other hand, consume so much resources just to build one battery Sorry I laughed so hard ,reading the headlines, i shorted out my coffee. Please continue.... Obviously it differs a lot based on usage since traffic conditions differ from city to city, and it's not at all unreasonable to get 18kpl if you consistently hit bumper to bumper traffic, get to take advantage of regenerative braking and your battery gets fed consistently. He is the same guy who said India is too democratic right? There's transport service that'll deliver you the car If you want to ask of the sincerest form of morally upright uptight buggerhole stupidity, ask governments of high regualations. You want to take diesel out for emissions - Fine! You want to bring EVs - GOOD! But then: You mind normalizing petrol prices? - NO! You mind providing a good charging network? - Not really.. You mind replacing Coal Plants with larger scale solars and Nuclear finally? - We aren't there yet. Mission 2070. All we have is idiotic small scale change that are never enough. Climate needs overhauls, not slugs pace. Invest in R&D and Support. The problem with eletric car is power cuts and power cuts Heck what about rural area even America has delayed electric promise by a lot so in natural they want us Walk or what or in floods In our country, decisions are not made with the public, the environment, or convenience in mind. Instead, they are driven by how much tax can be collected, how much companies can be pressured for bribes, and how much a minister can profit during their term. This is not a visionary or future-oriented nation; people here are only concerned with how much they can exploit today, even if it means destroying resources or jeopardizing future generations. Probably none of their friends are in hybrid business. This goes to show all mechanical and automobile engineers have zero voice in this country . I'm not sure if incompetence has a role to play but this effect on taxes is absurd . No one , not even the IITans have any effect on the development of policies in this country . And the government has the audacity to demand hydrogen powered vehicles , without any grasp of basic thermodynamics. The entire country is only good for copy and paste , there is no innovation, just donkeys carrying dung . The only form of electric vehicles that can actually make a difference in emissions are taxed the most . I salute you government . Isn't 40% the maximum GST allowed acc to the constitution? Your C*unt ? Cunt* Exactly … one way you are saying use public transport and at same time you don’t have public transportation infrastructure. No EVs are reliable, no infra of battery drained to pull over. Hybrids are way better and practical. And role of govt should to roll out electric in phases where hybrid is pre phase to total electric, which will give time to implement electric infrastructure. >Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter. It is possible. But that depends on the car manufacturer too. Probably lobbying by you know who. And medicine trial ground too for big pharmas Govt looks like a vampire >The Finance Ministry is considering a proposal to reduce the GST on hybrid vehicles to 5% and remove the additional 15% cess currently applied to the 28% GST. Currently, hybrid vehicles are taxed at 43 per cent GST, while internal combustion engine vehicles are taxed at 48 per cent..17 Jul 2024 Next election 200 paar? nah man, 48% gst reduction to the votes they get >In our country, decisions are not made with the public, the environment, or convenience in mind. We have a stupid form of democracy because everyone gets equal vote and only 9% have seen college. Guy came all the way from Kerala only to get his engine flooded 🥰 Just gonna leave it here. That's why everyone who can, leaves this shithole country Most people will charge their cars at home. Major sigh of relief from the electricity boards who are in no way ready for India to go the electric car/bike route right now. These clown policy makers of the govt very well know that the category of people they are abusing with impractical taxation will never protest on streets apart from online rants which will subside in a couple of days. Sure, but parking lots with paid charging will want to make money through an additional revenue stream. The taxes in India are horrendous. I recently bought a BMW IX here in Germany for around €80,000. I was shocked to see the same car in India costs close to €200,000 in India if you directly convert it. More than double the cost. This is a full blown electric car(not a plug in hybrid). If this is the \"5%\" they claim will promote electric car purchases in India, I'm scared to see what the \"full\" taxation system is like on hybrids. They keep doing this and they will ensure, India's automotive sector will never grow and will never be a priority for any car maker. So much tax collection just to give freebies to vote bank Govt can be very creative with cess The rationale is simple. Toyota stands to benefit the most from hybrids duty reduction, so Mahindra, Tata and the rest are against it. Poor Policy move in my opinion There’re company owned company operated fuel stations across the country. These stations along with their private retailers should be equipped with fast charging stations. The charging network and infrastructure should be strong at least from the government’s side. They can charge for charging the vehicles but when the infrastructure itself is absent, why is the government pushing for ev? Evs are ok, its just that the lack of the engine sound is one thing that i dont like. And 48 percent tax on hybrids, like come on now. Here is the source: OP: When you post a news clipping, please provide a source that can verify the news clipping. Also, please note that the title of the article is \"48% GST on Hybrid cars, 5% on EVs to stay: Kant\". We require that you always use the exact same title as the article, without any omissions or additions. The fuel stations don't have nearly enough space to keep cars in place while they are charging. Company owned fuel stations are a much, much smaller mix compared to the vast private retailer network. And we will have people saying in reddit \"Why do we need to have educational qualifications to get elected\" ????? Hainnnnn? Pushing for pure EV instead of hybrids, which is why Hybrid GST >> EV GST. That’s the point I’m making. Why is the government pushing for something when there’s no infrastructure present at place. When there’re enough charging stations established across the country, then the government can implement these taxes. Any imported cars are double the original cost, but India always had this policy and that policy is the reason why we have home grown car companies. Why don’t I just give all my salary as tax at once instead of in instalments like this , so that the politicians and their cronies can get more rich If india didn't has such trash public transport I'd love this extreme taxation But now due to this car owners feel entitled and believe they own whatever public land they occupy Worth pointing out, salaried folks who buy such Hybrids have already paid 30%+ of their earnings in IT ***BEFORE*** they go shopping for a car or anything else. Which EVs are getting dumped in India lol? We literally have the least amount of options, and ridiculously priced because almost all are imported with 70-100% import duty in addition to GST and road tax. Next time when you vote, please remember the difference between development and fake development. Taxes on both ICE and Hybrid cars is the same. 28% GST + 1-4% cess: if car is less than 4m length and less than 1.2L petrol/1.5L diesel engine. 28% GST + 15% cess: if car is >4m or >1.2/1.5L 28% GST + 20/22% cess: if car is classified as an SUV. There are some ground clearance rules in addition. GST on both ICE and hybrid cars go upto 50%. Plus road taxes based on state which can take total tax upto 75-80%. 48% GST on hybrid cars, 5% on EVs to stay: Cunt Hybrids may be practical in some terms but considering even its current cost it is nowhere near practical unless you drive way more kms than an average person. Hybrids are the most logical transition to ev but looks like the current govt policies says otherwise . He surely is a ‘Kant’ Heading is incorrect. GST on hybrid cars in 28%. Total taxes included GST, other Taxes and Cess is 48%. Govt is pushing for EV since it is not going to be adapted anytime soon in the country. This gives them an excuse to levy huge tax on normal vehicles. If they actually cared about the environment, then there are numerous things they could have done till now. Just put my plan of buying car on backseat Will go back to traditional petrol now It's never about environment amitabh cunt They aren't charged higher. Cars are charged based on their engine and lenth. My car longer than 4 meters and has >1.5 litre engine so it is taxed at 40 plus percentage despite being a petrol car whereas my father's Swift is taxed lower Which gives EV manufacturers 43 more reasons to increase margins by 43%. EVs have been a major scam in the automobile industry. I don't know what you are talking about. I have a car that is greater than 4m and a 1.5 litre as well. But I didn't pay >40% tax on my car. On road price is about 25% more than the ex-showroom price. I know there are lot of tax slabs and criteria but ICE vehicles are taxed insanely only after a certain segment. Like if you are buying luxury vehicles (bmw, merc etc) or import a vehicle (100% tax). They are very expensive for the average indian population. Well, very expensive when compared to the product that you get. For example a Tata nexon EV costs >16L on road with a real world range of ~300km. 16L for a Nexon, imagine that. And has very bad resale value and you will have to change the battery after 7-8 years of use which will cost you over 4L easily. I mean wtf is the point of an EV besides lesser emissions? And in a country like India I feel EV is extremely overrated and a waste of money. We don't have public ev infra to charge if needed, no superchargers available, and if there is a power cut or you forgot to charge then Goodluck using the car. Marginally low emissions* how will an individual charge their EV? Summoning Indra Dev? Or by using the electricity available at the nearest or the convenient point? How is that electricity produced? How are the materials used in EV sourced? & yet smart & intelligent people label it as a sustainable product. Once a great man said ‘Hippo-crazy ki bhi seema hoti h’. > Hybrid is the most suitable car for a country like India because of our humongous population and lack of public EV infrastructure. And the powercuts even in some Metro cities during Summer months. \"48% GST on Hybrid cars, 5% on EVs to stay: Cunt\". FTFY. He kant logic. Hence the last name. Or may be they want buyers to compensate for the loss in excise revenue as hybrids are much more efficient. Chutyas. Largest open air tax jail on earth. Welcome to India. Yes Meanwhile his daughter will be driving a hybrid car in the USA.. Well, that's a lot, period. Ding ding ding. This is how to understand public policy in this government. Babu unwillingness to let go of higher taxes is exactly why India will remain a shithole for the next trillion years. Vishwaguru my unclean asshole. Neither Pappu, chaiwala or muffler man can save this country. Taxes aren’t going down in any country right now - expect the status quo in India as well. Just remembered he was the g20 sherpa, holy shit the govt needs to reconsider the sanity of it's employees Expenditure for R&D is around 0.66% in this country. No wonder we have such stupid policies lol Pay 48% gst then car gets flooded then again pay 48% gst for another car and then car gets flooded and you get the point Sarkar ka paisa kamane ka scheme We've sheltered our automotive industry for decades and they're still not competitive. It's a wealth transfer from consumers to connected cronies(think of all the permits and licenses you need to make cars here and who can navigate this system). Bro that's road tax and it's different for each state. GST (the one we're talking about here) is included in ex showroom price Also there's no extra tax on buying luxury vehicles like BMW or Merc, it's always about the length, engine, ground clearance and manufacturing of a car. Most luxury vehicles are CBU and that's why they're taxed at 100%. Just checked the invoice, my car is taxed at 45% (28%GST+17% Cess) and it's included in Ex showroom. And another 15% as road tax so I've paid 60% tax on my 16 lakhs car which originally costed 9-10 lakhs. Jumla sarkar doing jumla ! And they say they will make India develloped! My foot! I'm just going to use my bicycle(unless I have luggage or passengers) till this nonsense is over someday(hopefully). Screw these people making rules about 15 year old cars, ethanol to ruin the engine, electric cars which don't have infra or good reliable cheap batteries, and Ridiculous GST Wow.. the gift keeps giving Chinese have tons of EVs to move. Most are flooding to Australia with North American 100% tariff. Why don't those come to India?. how did you check it? I tried finding my gst details but I don't see it anywhere. >Unless you can pay and charge passenger vehicles within 10 minutes for a reasonable amount of range, putting EV charging stations in petrol pumps is a non-starter. BOOM goes the dynamite I will not be comfortable having huge currents flowing next to a highly flammable liquid but I guess you are more adventurous than me. These stations already operate on 3-phase 230VAC inputs so the risk of a short circuit is not meaningfully increased. I would be more worried about the battery catching fire if there is a mishap at the pump rather than electric arcs or sparking starting a fire. Not possible at all. Even the fastest charging EVs with the most capable chargers (of which there are a handful in India) would take 20-30 minutes for an 80% charge. He was talking about a reasonable range. You are right about 80% But we can charge upto 30-40% in 10 mins The whole point of a reasonable range I think should be that you don't need to fill up again. (Just like an ice car) The correct answer. Most of people don't know the structure and harping on half truth. Can we change the title please. The taxes aren't increasing. It's just that they are not lowering those. There are pros and cons and different firms are trying to push their agenda here. Like Toyota, Honda and Maruti are pushing for Hybrids but Tata, Mahindra and Mercedes are against any cuts for Hybrids. Yes it's more practical, but all of our dear politicians have heavily invested in EV market post Tesla success. They don't want their investment to evaporate 💀... that's the only concern for them. I haven't said anywhere that the taxes are rising. I even said that I didn't know it was 48%, which is insanely high. The government shouldn't bend and kiss ass for corporates, they should be focused on its people. Also, IMHO the govt should focus on converting all public transport systems to EV first then target the consumer personal vehicles. I live in Bangalore, I hope soon all BMTC buses, govt transport trucks will be running on EV. Majority of the pollution comes from old ICE vehicles since they don’t get serviced regularly, leaving behind a thick black veil of smoke bomb. looters"
}