{
    "id": "gujtdp",
    "title": "RWA uncles, please calm down about Aarogya Setu",
    "url": "https://www.reddit.com/r/india/comments/gujtdp/rwa_uncles_please_calm_down_about_aarogya_setu/",
    "selftext": "https://preview.redd.it/r6qpmj5rla251.png?width=1024&amp;format=png&amp;auto=webp&amp;s=f97d78ecb1ac40f61e139445c6aa4e41af94fc53\n\n### Tl;dr\n\nResident Welfare Associations ('RWAs') have nominated themselves as the first line of defence against the coronavirus pandemic. Media reports suggest that RWAs are going well beyond the guidelines issued by the government and mandating use of Aarogya Setu by residents and visitors including domestic workers, drivers, delivery personnel and other service providers. Such measures may be well intentioned but they are illegal because the bottom line is that RWAs are private self-administration bodies which lack the power to issue rules restricting the freedom of movement and right to livelihood of individuals. In lights of this, we wrote to the Ministry of Housing and Urban Affairs, the National Real Estate Development Council and the Ministry of Health and Family Welfare seeking issuance of an advisory which clarifies that use of the Aarogya Setu mobile app cannot be made a precondition for entering residential colonies.\n\n### Is it a bird? Is it a plane? No, it is RWAman!\n\n&amp;#x200B;\n\n[Credit: https:\\/\\/twitter.com\\/penpencildraw ](https://preview.redd.it/m3ig46jtla251.jpg?width=606&amp;format=pjpg&amp;auto=webp&amp;s=e31445c0a7eb66f6707ee84e29a7be6de93957d8)\n\nMedia reports indicate that Resident Welfare Associations (‘RWAs’) in several cities have made use of the Aarogya Setu mobile app a precondition for residents and visitors such as domestic workers, drivers, delivery persons, service providers etc. As you may know, Aarogya Setu is a COVID-19 surveillance app launched by the Indian government which has been heavily criticized for privacy, security and exclusion related concerns.  IFF has opposed mandatory imposition of Aarogya Setu on the[ **litigation**](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/),[ **policy**](https://internetfreedom.in/we-studied-the-protocol-and-no-this-doesnt-sufficiently-protect-your-privacy/),[ **RTI**](https://internetfreedom.in/aarogya-setu-through-the-right-to-information-lens/) and[ **public advocacy**](https://internetfreedom.in/45-organizations-and-105-prominent-individuals-push-back-against-the-coercion-of-aarogya-setu/)fronts. But before we delve into the legality of rules made by RWAs which mandate use of Aarogya Setu, let us first understand what is the legal status of RWAs themselves. \n\nA Resident Welfare Association is a voluntary body formed by the residents for the residents. It is a self-financed and self- managed association registered under the Society Registration Act, 1860 (subject to state-level amendments). The primary purpose of such an association is to represent the interests of residents of a specific locality/complex and perform the following illustrative functions:\n\n* Represent the residents before the governmental authorities;\n* Collect money for maintenance of common areas;\n* Establish good public infrastructure for the residents;\n* Organize workshops and cultural functions etc.\n\nThe government may also issue guidelines to RWAs as seen in the context of the [**Bhagidari Scheme**](http://www.rwabhagidari.com/registerRWA.htm) in Delhi, which aims to promote broad-based civic participation in local governance. The formation of an RWA has also been made mandatory under Section 19(9) of the Real estate (Regulations &amp; Development) Act, 2016.\n\nRWAs are governed by their Memorandum of Association (MoA)/ by laws which contain their objectives and functions. While the by-laws are binding amongst the residents, they lack statutory character and do not have the force of law as [**clarified**](https://indiankanoon.org/doc/1900075/) by the Bombay High Court. For similar reasons, RWAs cannot issue directions prohibiting residents from keeping pet animals in violation of [**guidelines**](http://www.awbi.org/awbi-pdf/pet_dog_circular_26_2_2015.pdf) issued by the Animal Welfare Board of India under the Prevention of Cruelty to Animals Act.\n\n### RWAs turn mini-sovereigns during COVID 19\n\nThe role of RWAs during the COVID-19 pandemic is crucial to ensure that residents and visitors are adhering to government guidelines relating to wearing masks and maintaining physical distance in common areas. RWAs are also responsible for maintaining sanitation of common areas and facilitating supply of essential commodities in their locality. Recognizing the importance of RWAs as stakeholders, the National Centre for Disease Control has issued an [**advisory for RWAs**](https://ncdc.gov.in/WriteReadData/l892s/3931246121585916767.pdf) to support and complement governmental efforts to contain spread of the virus. \n\nHowever, RWAs are slowly morphing from private self-administration bodies to mini-sovereigns in their own right. Several RWAs have taken it upon themselves to impose restrictions which as this [**news report**](https://timesofindia.indiatimes.com/blogs/toi-editorials/lockdown-is-easing-but-many-rwas-seem-not-to-have-noticed/) notes, *‘‘make even the stringent terms of the lockdown pale in comparison.”* For example, an RWA in [**Gurugram**](https://timesofindia.indiatimes.com/city/gurgaon/gurugram-rwa-insists-on-covid-report/articleshow/75837887.cms) has asked its residents to have their domestic help tested for COVID-19 before they can be allowed into the premises. This is clearly inconsistent with testing guidelines framed by the Indian Council for Medical Research (ICMR) - the only competent authority for frame guidelines for COVID-19 testing. In another instance in [**Noida**](https://www.newindianexpress.com/nation/2020/apr/24/denied-medicine-for-parents-claims-noida-man-as-society-seeks-aarogya-setu-2134781.html), permission to enter a housing complex will be granted only if the entrant has a ‘green’ status on the Aarogya Setu app.  \n\n\nThe most recent [**order**](https://www.mha.gov.in/sites/default/files/MHAOrderDt_30052020.pdf) issued by the Ministry of Home Affairs on 30 May 2020 states that use of Aarogya Setu should be encouraged by employers on a “best efforts” basis and district authorities may “advise” individuals to install the app. The terminology used in these guidelines makes it abundantly clear that RWAs have not been authorized by the government to mandate use of Aarogya Setu among residents and visitors, and they do not have any authority to prohibit entry to residential colonies on this ground.  \n\n\nAs we have explained earlier, COVID-19 surveillance apps are susceptible to false positives and false negatives because of inherent limitations of bluetooth technology which is not a perfect proxy for virus exposure. If RWAs were allowed to force residents and visitors to download the Aarogya Setu app and allow entry based on the status displayed on the app, it could lead to wrongful confinement of certain residents and deprivation of livelihood of working class service providers. Residents who are shown by the app to be at risk of COVID-19 could be prohibited from leaving their house or accessing common areas. Further, domestic workers, drivers, delivery persons and other service providers could also be prohibited from entering the colony to do their jobs based on their status on the app.\n\n### What can an ordinary resident do?\n\nIf you find yourself in a situation with an overzealous RWA, first ask them for a copy of the by-laws and the rules and details of the procedure by which they were adopted. The RWA’s MoA and by-laws will contain the procedure for amending existing rules or adding new rules. Generally, new rules or amendments cannot be made without a General Body Meeting. If the rule making procedure has been flouted, the rules will be invalid.\n\nWe also encourage you to have a constructive dialogue with your RWA representatives highlighting concerns about accuracy and privacy of the Aarogya Setu app and explain that official MHA guidelines do not authorize RWAs to require mandatory use of Aarogya Setu. Any rules which are inconsistent with governmental guidelines may be an abuse of power by the RWA and can be challenged in court. Any resident who is aggrieved by  arbitrary and unreasonable actions of an RWA can file a suit under Section 6 of the Societies Registration Act, 1860. The RWA can be sued in the local civil court in the name of the President or Secretary.\n\n### Representation to Government\n\nWe recognize that individual residents and working class service providers may not always have the bargaining power to negotiate with RWAs or approach courts. Therefore, we have written to the Ministry of Housing and Urban Affairs, the National Real Estate Development Council and the Ministry of Health and Family Welfare seeking issuance of an advisory which clarifies that use of the Aarogya Setu mobile app cannot be made a precondition for entering residential colonies.\n\nAs researchers at the Centre for Internet and Society note in their [**recent article**](https://cis-india.org/internet-governance/blog/essay-watching-corona-or-neighbours-introducing-2018lateral-surveillance2019-during-covid201919) on lateral surveillance, the COVID-19 pandemic has witnessed an increase in surveillance by private actors. Residential colonies cannot be controlled by RWAs as mini-sovereigns, and insofar as RWAs impose measures which are inconsistent with guidelines issued by the government, it amounts to vigilantism. During the COVID-19 crisis, the need of the hour is social solidarity and the government has a positive duty to prevent RWAs from engaging in intrusive and arbitrary practices which lack any basis in law and promote a culture of suspicion, stigma and exclusion.\n\n*(This post has been authored by Sonalakshi Naidu, a legal intern at IFF, and reviewed by IFF staffer, Devdutta.)*\n\n### Important Documents:\n\n1. Representation regarding illegal imposition of Aarogya Setu by RWAs ([**link**](https://drive.google.com/file/d/1KL23Isr2NQeEPMm4Z09TkwHqGaiK8ARB/view?usp=sharing))\n\n[***Help us continue our work against all kinds of surveillance, be it by Big Brother, Big Tech or your neighbourhood RWA. Become an IFF member today!***](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 341,
    "num_comments": 21,
    "created_utc": 1591014728,
    "convurl": "https://a.thumbs.redditmedia.com/BIUOZYmqrUKnpKMQdcEowe3xM1qpR0vCHoo5k_j_Nd0.jpg",
    "comments": [
        "Excellent writeup. Very grateful for this among other things.",
        "Somebody start a [akosha.com](https://akosha.com) type site to deal with RWA uncles, they are real pain in a$$.",
        "Great to see someone working on this. RWAs have really started to form arbitrary laws. \n\nOne another thing I would like to raise is the use of data collected by RWA through apps like MyGate, Apartment Adda etc. These apps are collecting a lot of data about residents and don't seem to have data collection and usage standards. Would be great if we can do something about this.",
        "Rwa’s are the HoAs of India.",
        "Thanks ideally we need a central advisory on this. Also, we are thinking of creating info-graphics that can be circulated with your RWA whatsapp groups. (\"Going behind lines and fighting the battle!\")",
        "Hah! This would be one truly scalable service! In the meanwhile you can consider becoming a IFF member?",
        "We are here for you, we represent you. Each IFF staffer works every day with a sense of discipline and belief to protect your fundamental rights. In the gloom and despair we have to be there for each other.",
        "I completely agree that the aarogya setu app cant be made compulsory until its made open source",
        "Does co-operative housing society come under this. They must be having similar problem.",
        "Appreciate the write up.\n\nTo the people who have concerns already - this will provide fodder for discussion.\n\nmy only worry is - these RWA Unkills &amp; Antis will not read this at all. \n\nthey will spin it around and blame you for being difficult &amp; uncooperative. \n\ntheir overzealous nature will make it easier for them to fault us for having the audacity to question the government &amp; their authority.\n\nthe culture of truth, accountability, proof &amp; scientific temper is horrendously eroded - not just for us, but world over. \n\ni say this with no joy that installing the app will be forced upon more people than respectful acknowledgement of a person's concerns. \n\n\"kya hi farak padega\"; \"what do you have to hide\"; \"you have nothing to lose\" - i can very well imagine such garbage \"viewpoints\" being offered.\n\nit's just embarrassing. \n\nGlad that people like you fight the good fight. Keep it up!",
        "That image is gold! I wish I had the guts to post it in my colony group",
        "Send it and then delete it after 2 minutes after saying, “oops”.",
        "My RWA is filled with old uncles and aunties who have closed all the locality parks since March and refuse to open them up\n\nFuckers are going to die of diabetes if not covid",
        "&gt; the culture of truth, accountability, proof &amp; scientific temper is horrendously eroded - not just for us, but world over.\n\nJust today there was a video on ndtv of a python trying to eat a deer and a man \"saving\" the deer. Literally dozens of comments on the video are cheering the man for showing kindness to the deer!\n\nThat's just the tip of the iceberg as far as the erosion of basic scientific values go. Social media has turned everyone into emotional animals who are swayed by whatever visuals can be paraded before them",
        "\"what do you have to hide\"\n\nWhenever an uncle or aunty says this to me for applocks I have in my phone, it burns me to the core.\n\nThe problem is, that these uncles and aunties do not have any concept of privacy, and identity protection.\n\n\"ThErE ShOuLd Be NoThInG To HiDe If YoU HaVe'Nt DoNe NoThInG WrOnG\"\n\nThis argument is used by a lot of people I meet, even my family members, and they all agree with it. It enrages me to the core.\n\nI would suggest you to make a fake app, with the aroyoga setu logo on it, which does nothing but opens amd then closes, and show this to those toxic uncles and aunties, so that they can shut up. Or, you could just uninstall it when they leave. Or, you could simply deny the apps permissions to do anything.",
        "In your experience, how long do these multi-letter govt. agencies, councils, or federal ministries take to reply to such letters?",
        "Seriously these RWA's are getting crazy with this Arogya setu app obsession. Excellent Writr-Up.",
        "&gt;they will spin it around and blame you for being difficult &amp; uncooperative. \n&gt;\n&gt;their overzealous nature will make it easier for them to fault us for having the audacity to question the government &amp; their authority.\n\nElders should be respected in the group.",
        "You summed my entirely winding heavily worded monologue is just 7 words.\n\nBravo my child, bravo....",
        "My apartment's RWA is filled with typical uncles, bhakts, etc., but giving credit where it's due, they organised things for our building residents very well. We had absolutely no problems whatsoever in getting supplies and other essentials, and making sure we're all safe. The only thing they lack, if I would point out, is they keep asking for praise indirectly and sometimes very directly.",
        "&gt;back\n\nBy pure logic or a historical timeline : natural rights are inherent and older than any living person.",
        "It really depends and is variable however through this pandemic we have seen government departments respond to public pressure in which such letters play some part. Some instances include the watering down or Aarogya Setu from mandatory to voluntary (atleast as per the Home Ministry) and the Ministry of Health making an advisory against the disclosure of the names of Covid Patients. \n\nWe also follow a step based escalation matrix and have at least informally developed an advocacy tool kit to apply pressure. For us its not only about responses, or acknowledgment but about positive outcomes.",
        "Thanks! We are soon making some infographics and explainers you can forward to your local, friendly RWA group!"
    ],
    "cleaned_text": "rwa uncles please calm aarogya setu tldr resident welfare associations rwas nominated first line defence coronavirus pandemic media reports suggest rwas going well beyond guidelines issued government mandating use aarogya setu residents visitors including domestic workers drivers delivery personnel service providers measures may well intentioned illegal bottom line rwas private selfadministration bodies lack power issue rules restricting freedom movement right livelihood individuals lights wrote ministry housing urban affairs national real estate development council ministry health family welfare seeking issuance advisory clarifies use aarogya setu mobile app made precondition entering residential colonies bird plane rwaman ampxb credit httpspreviewredditmigjtlajpgwidthampformatpjpgampautowebpampsecaebfeeeabeded media reports indicate resident welfare associations rwas several cities made use aarogya setu mobile app precondition residents visitors domestic workers drivers delivery persons service providers etc may know aarogya setu covid surveillance app launched indian government heavily criticized privacy security exclusion related concerns iff opposed mandatory imposition aarogya setu litigationhttpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetu policyhttpsinternetfreedominwestudiedtheprotocolandnothisdoesntsufficientlyprotectyourprivacy rtihttpsinternetfreedominaarogyasetuthroughtherighttoinformationlens public advocacyhttpsinternetfreedominorganizationsandprominentindividualspushbackagainstthecoercionofaarogyasetufronts delve legality rules made rwas mandate use aarogya setu let us first understand legal status rwas resident welfare association voluntary body formed residents residents selffinanced self managed association registered society registration act subject statelevel amendments primary purpose association represent interests residents specific localitycomplex perform following illustrative functions represent residents governmental authorities collect money maintenance common areas establish good public infrastructure residents organize workshops cultural functions etc government may also issue guidelines rwas seen context bhagidari schemehttpwwwrwabhagidaricomregisterrwahtm delhi aims promote broadbased civic participation local governance formation rwa also made mandatory section real estate regulations amp development act rwas governed memorandum association moa laws contain objectives functions bylaws binding amongst residents lack statutory character force law clarifiedhttpsindiankanoonorgdoc bombay high court similar reasons rwas issue directions prohibiting residents keeping pet animals violation guidelineshttpwwwawbiorgawbipdfpetdogcircularpdf issued animal welfare board india prevention cruelty animals act rwas turn minisovereigns covid role rwas covid pandemic crucial ensure residents visitors adhering government guidelines relating wearing masks maintaining physical distance common areas rwas also responsible maintaining sanitation common areas facilitating supply essential commodities locality recognizing importance rwas stakeholders national centre disease control issued advisory rwashttpsncdcgovinwritereaddatalspdf support complement governmental efforts contain spread virus however rwas slowly morphing private selfadministration bodies minisovereigns right several rwas taken upon impose restrictions news reporthttpstimesofindiaindiatimescomblogstoieditorialslockdowniseasingbutmanyrwasseemnottohavenoticed notes make even stringent terms lockdown pale comparison example rwa gurugramhttpstimesofindiaindiatimescomcitygurgaongurugramrwainsistsoncovidreportarticleshowcms asked residents domestic help tested covid allowed premises clearly inconsistent testing guidelines framed indian council medical research icmr competent authority frame guidelines covid testing another instance noidahttpswwwnewindianexpresscomnationaprdeniedmedicineforparentsclaimsnoidamanassocietyseeksaarogyasetuhtml permission enter housing complex granted entrant green status aarogya setu app recent orderhttpswwwmhagovinsitesdefaultfilesmhaorderdtpdf issued ministry home affairs may states use aarogya setu encouraged employers best efforts basis district authorities may advise individuals install app terminology used guidelines makes abundantly clear rwas authorized government mandate use aarogya setu among residents visitors authority prohibit entry residential colonies ground explained earlier covid surveillance apps susceptible false positives false negatives inherent limitations bluetooth technology perfect proxy virus exposure rwas allowed force residents visitors download aarogya setu app allow entry based status displayed app could lead wrongful confinement certain residents deprivation livelihood working class service providers residents shown app risk covid could prohibited leaving house accessing common areas domestic workers drivers delivery persons service providers could also prohibited entering colony jobs based status app ordinary resident find situation overzealous rwa first ask copy bylaws rules details procedure adopted rwas moa bylaws contain procedure amending existing rules adding new rules generally new rules amendments made without general body meeting rule making procedure flouted rules invalid also encourage constructive dialogue rwa representatives highlighting concerns accuracy privacy aarogya setu app explain official mha guidelines authorize rwas require mandatory use aarogya setu rules inconsistent governmental guidelines may abuse power rwa challenged court resident aggrieved arbitrary unreasonable actions rwa file suit section societies registration act rwa sued local civil court name president secretary representation government recognize individual residents working class service providers may always bargaining power negotiate rwas approach courts therefore written ministry housing urban affairs national real estate development council ministry health family welfare seeking issuance advisory clarifies use aarogya setu mobile app made precondition entering residential colonies researchers centre internet society note recent articlehttpscisindiaorginternetgovernanceblogessaywatchingcoronaorneighboursintroducinglateralsurveillanceduringcovid lateral surveillance covid pandemic witnessed increase surveillance private actors residential colonies controlled rwas minisovereigns insofar rwas impose measures inconsistent guidelines issued government amounts vigilantism covid crisis need hour social solidarity government positive duty prevent rwas engaging intrusive arbitrary practices lack basis law promote culture suspicion stigma exclusion post authored sonalakshi naidu legal intern iff reviewed iff staffer devdutta important documents representation regarding illegal imposition aarogya setu rwas linkhttpsdrivegooglecomfiledklisrnqeepmmztkwhqgaikarbviewuspsharing help us continue work kinds surveillance big brother big tech neighbourhood rwa become iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "rwa uncles please calm aarogya setu",
    "cleaned_selftext": "tldr resident welfare associations rwas nominated first line defence coronavirus pandemic media reports suggest rwas going well beyond guidelines issued government mandating use aarogya setu residents visitors including domestic workers drivers delivery personnel service providers measures may well intentioned illegal bottom line rwas private selfadministration bodies lack power issue rules restricting freedom movement right livelihood individuals lights wrote ministry housing urban affairs national real estate development council ministry health family welfare seeking issuance advisory clarifies use aarogya setu mobile app made precondition entering residential colonies bird plane rwaman ampxb credit httpspreviewredditmigjtlajpgwidthampformatpjpgampautowebpampsecaebfeeeabeded media reports indicate resident welfare associations rwas several cities made use aarogya setu mobile app precondition residents visitors domestic workers drivers delivery persons service providers etc may know aarogya setu covid surveillance app launched indian government heavily criticized privacy security exclusion related concerns iff opposed mandatory imposition aarogya setu litigationhttpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetu policyhttpsinternetfreedominwestudiedtheprotocolandnothisdoesntsufficientlyprotectyourprivacy rtihttpsinternetfreedominaarogyasetuthroughtherighttoinformationlens public advocacyhttpsinternetfreedominorganizationsandprominentindividualspushbackagainstthecoercionofaarogyasetufronts delve legality rules made rwas mandate use aarogya setu let us first understand legal status rwas resident welfare association voluntary body formed residents residents selffinanced self managed association registered society registration act subject statelevel amendments primary purpose association represent interests residents specific localitycomplex perform following illustrative functions represent residents governmental authorities collect money maintenance common areas establish good public infrastructure residents organize workshops cultural functions etc government may also issue guidelines rwas seen context bhagidari schemehttpwwwrwabhagidaricomregisterrwahtm delhi aims promote broadbased civic participation local governance formation rwa also made mandatory section real estate regulations amp development act rwas governed memorandum association moa laws contain objectives functions bylaws binding amongst residents lack statutory character force law clarifiedhttpsindiankanoonorgdoc bombay high court similar reasons rwas issue directions prohibiting residents keeping pet animals violation guidelineshttpwwwawbiorgawbipdfpetdogcircularpdf issued animal welfare board india prevention cruelty animals act rwas turn minisovereigns covid role rwas covid pandemic crucial ensure residents visitors adhering government guidelines relating wearing masks maintaining physical distance common areas rwas also responsible maintaining sanitation common areas facilitating supply essential commodities locality recognizing importance rwas stakeholders national centre disease control issued advisory rwashttpsncdcgovinwritereaddatalspdf support complement governmental efforts contain spread virus however rwas slowly morphing private selfadministration bodies minisovereigns right several rwas taken upon impose restrictions news reporthttpstimesofindiaindiatimescomblogstoieditorialslockdowniseasingbutmanyrwasseemnottohavenoticed notes make even stringent terms lockdown pale comparison example rwa gurugramhttpstimesofindiaindiatimescomcitygurgaongurugramrwainsistsoncovidreportarticleshowcms asked residents domestic help tested covid allowed premises clearly inconsistent testing guidelines framed indian council medical research icmr competent authority frame guidelines covid testing another instance noidahttpswwwnewindianexpresscomnationaprdeniedmedicineforparentsclaimsnoidamanassocietyseeksaarogyasetuhtml permission enter housing complex granted entrant green status aarogya setu app recent orderhttpswwwmhagovinsitesdefaultfilesmhaorderdtpdf issued ministry home affairs may states use aarogya setu encouraged employers best efforts basis district authorities may advise individuals install app terminology used guidelines makes abundantly clear rwas authorized government mandate use aarogya setu among residents visitors authority prohibit entry residential colonies ground explained earlier covid surveillance apps susceptible false positives false negatives inherent limitations bluetooth technology perfect proxy virus exposure rwas allowed force residents visitors download aarogya setu app allow entry based status displayed app could lead wrongful confinement certain residents deprivation livelihood working class service providers residents shown app risk covid could prohibited leaving house accessing common areas domestic workers drivers delivery persons service providers could also prohibited entering colony jobs based status app ordinary resident find situation overzealous rwa first ask copy bylaws rules details procedure adopted rwas moa bylaws contain procedure amending existing rules adding new rules generally new rules amendments made without general body meeting rule making procedure flouted rules invalid also encourage constructive dialogue rwa representatives highlighting concerns accuracy privacy aarogya setu app explain official mha guidelines authorize rwas require mandatory use aarogya setu rules inconsistent governmental guidelines may abuse power rwa challenged court resident aggrieved arbitrary unreasonable actions rwa file suit section societies registration act rwa sued local civil court name president secretary representation government recognize individual residents working class service providers may always bargaining power negotiate rwas approach courts therefore written ministry housing urban affairs national real estate development council ministry health family welfare seeking issuance advisory clarifies use aarogya setu mobile app made precondition entering residential colonies researchers centre internet society note recent articlehttpscisindiaorginternetgovernanceblogessaywatchingcoronaorneighboursintroducinglateralsurveillanceduringcovid lateral surveillance covid pandemic witnessed increase surveillance private actors residential colonies controlled rwas minisovereigns insofar rwas impose measures inconsistent guidelines issued government amounts vigilantism covid crisis need hour social solidarity government positive duty prevent rwas engaging intrusive arbitrary practices lack basis law promote culture suspicion stigma exclusion post authored sonalakshi naidu legal intern iff reviewed iff staffer devdutta important documents representation regarding illegal imposition aarogya setu rwas linkhttpsdrivegooglecomfiledklisrnqeepmmztkwhqgaikarbviewuspsharing help us continue work kinds surveillance big brother big tech neighbourhood rwa become iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "excellent writeup grateful among things somebody start akoshacomhttpsakoshacom type site deal rwa uncles real pain great see someone working rwas really started form arbitrary laws one another thing would like raise use data collected rwa apps like mygate apartment adda etc apps collecting lot data residents dont seem data collection usage standards would great something rwas hoas india thanks ideally need central advisory also thinking creating infographics circulated rwa whatsapp groups going behind lines fighting battle hah would one truly scalable service meanwhile consider becoming iff member represent iff staffer works every day sense discipline belief protect fundamental rights gloom despair completely agree aarogya setu app cant made compulsory made open source cooperative housing society come must similar problem appreciate write people concerns already provide fodder discussion worry rwa unkills amp antis read spin around blame difficult amp uncooperative overzealous nature make easier fault us audacity question government amp authority culture truth accountability proof amp scientific temper horrendously eroded us world say joy installing app forced upon people respectful acknowledgement persons concerns kya hi farak padega hide nothing lose well imagine garbage viewpoints offered embarrassing glad people like fight good fight keep image gold wish guts post colony group send delete minutes saying oops rwa filled old uncles aunties closed locality parks since march refuse open fuckers going die diabetes covid gt culture truth accountability proof amp scientific temper horrendously eroded us world today video ndtv python trying eat deer man saving deer literally dozens comments video cheering man showing kindness deer thats tip iceberg far erosion basic scientific values go social media turned everyone emotional animals swayed whatever visuals paraded hide whenever uncle aunty says applocks phone burns core problem uncles aunties concept privacy identity protection nothing hide havent done nothing wrong argument used lot people meet even family members agree enrages core would suggest make fake app aroyoga setu logo nothing opens amd closes show toxic uncles aunties shut could uninstall leave could simply deny apps permissions anything experience long multiletter govt agencies councils federal ministries take reply letters seriously rwas getting crazy arogya setu app obsession excellent writrup gtthey spin around blame difficult amp uncooperative gt gttheir overzealous nature make easier fault us audacity question government amp authority elders respected group summed entirely winding heavily worded monologue words bravo child bravo apartments rwa filled typical uncles bhakts etc giving credit due organised things building residents well absolutely problems whatsoever getting supplies essentials making sure safe thing lack would point keep asking praise indirectly sometimes directly gtback pure logic historical timeline natural rights inherent older living person really depends variable however pandemic seen government departments respond public pressure letters play part instances include watering aarogya setu mandatory voluntary atleast per home ministry ministry health making advisory disclosure names covid patients also follow step based escalation matrix least informally developed advocacy tool kit apply pressure us responses acknowledgment positive outcomes thanks soon making infographics explainers forward local friendly rwa group",
    "light_cleaned_title": "RWA uncles, please calm down about Aarogya Setu",
    "light_cleaned_selftext": "### Tl;dr Resident Welfare Associations ('RWAs') have nominated themselves as the first line of defence against the coronavirus pandemic. Media reports suggest that RWAs are going well beyond the guidelines issued by the government and mandating use of Aarogya Setu by residents and visitors including domestic workers, drivers, delivery personnel and other service providers. Such measures may be well intentioned but they are illegal because the bottom line is that RWAs are private self-administration bodies which lack the power to issue rules restricting the freedom of movement and right to livelihood of individuals. In lights of this, we wrote to the Ministry of Housing and Urban Affairs, the National Real Estate Development Council and the Ministry of Health and Family Welfare seeking issuance of an advisory which clarifies that use of the Aarogya Setu mobile app cannot be made a precondition for entering residential colonies. ### Is it a bird? Is it a plane? No, it is RWAman!  [Credit: ](https://preview.redd.it/m3ig46jtla251.jpg?width=606&amp;format=pjpg&amp;auto=webp&amp;s=e31445c0a7eb66f6707ee84e29a7be6de93957d8) Media reports indicate that Resident Welfare Associations (‘RWAs’) in several cities have made use of the Aarogya Setu mobile app a precondition for residents and visitors such as domestic workers, drivers, delivery persons, service providers etc. As you may know, Aarogya Setu is a COVID-19 surveillance app launched by the Indian government which has been heavily criticized for privacy, security and exclusion related concerns. IFF has opposed mandatory imposition of Aarogya Setu on the[ **litigation**](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/),[ **policy**](https://internetfreedom.in/we-studied-the-protocol-and-no-this-doesnt-sufficiently-protect-your-privacy/),[ **RTI**](https://internetfreedom.in/aarogya-setu-through-the-right-to-information-lens/) and[ **public advocacy**](https://internetfreedom.in/45-organizations-and-105-prominent-individuals-push-back-against-the-coercion-of-aarogya-setu/)fronts. But before we delve into the legality of rules made by RWAs which mandate use of Aarogya Setu, let us first understand what is the legal status of RWAs themselves. A Resident Welfare Association is a voluntary body formed by the residents for the residents. It is a self-financed and self- managed association registered under the Society Registration Act, 1860 (subject to state-level amendments). The primary purpose of such an association is to represent the interests of residents of a specific locality/complex and perform the following illustrative functions: * Represent the residents before the governmental authorities; * Collect money for maintenance of common areas; * Establish good public infrastructure for the residents; * Organize workshops and cultural functions etc. The government may also issue guidelines to RWAs as seen in the context of the [**Bhagidari Scheme**](http://www.rwabhagidari.com/registerRWA.htm) in Delhi, which aims to promote broad-based civic participation in local governance. The formation of an RWA has also been made mandatory under Section 19(9) of the Real estate (Regulations &amp; Development) Act, 2016. RWAs are governed by their Memorandum of Association (MoA)/ by laws which contain their objectives and functions. While the by-laws are binding amongst the residents, they lack statutory character and do not have the force of law as [**clarified**](https://indiankanoon.org/doc/1900075/) by the Bombay High Court. For similar reasons, RWAs cannot issue directions prohibiting residents from keeping pet animals in violation of [**guidelines**](http://www.awbi.org/awbi-pdf/pet_dog_circular_26_2_2015.pdf) issued by the Animal Welfare Board of India under the Prevention of Cruelty to Animals Act. ### RWAs turn mini-sovereigns during COVID 19 The role of RWAs during the COVID-19 pandemic is crucial to ensure that residents and visitors are adhering to government guidelines relating to wearing masks and maintaining physical distance in common areas. RWAs are also responsible for maintaining sanitation of common areas and facilitating supply of essential commodities in their locality. Recognizing the importance of RWAs as stakeholders, the National Centre for Disease Control has issued an [**advisory for RWAs**](https://ncdc.gov.in/WriteReadData/l892s/3931246121585916767.pdf) to support and complement governmental efforts to contain spread of the virus. However, RWAs are slowly morphing from private self-administration bodies to mini-sovereigns in their own right. Several RWAs have taken it upon themselves to impose restrictions which as this [**news report**](https://timesofindia.indiatimes.com/blogs/toi-editorials/lockdown-is-easing-but-many-rwas-seem-not-to-have-noticed/) notes, *‘‘make even the stringent terms of the lockdown pale in comparison.”* For example, an RWA in [**Gurugram**](https://timesofindia.indiatimes.com/city/gurgaon/gurugram-rwa-insists-on-covid-report/articleshow/75837887.cms) has asked its residents to have their domestic help tested for COVID-19 before they can be allowed into the premises. This is clearly inconsistent with testing guidelines framed by the Indian Council for Medical Research (ICMR) - the only competent authority for frame guidelines for COVID-19 testing. In another instance in [**Noida**](https://www.newindianexpress.com/nation/2020/apr/24/denied-medicine-for-parents-claims-noida-man-as-society-seeks-aarogya-setu-2134781.html), permission to enter a housing complex will be granted only if the entrant has a ‘green’ status on the Aarogya Setu app. The most recent [**order**](https://www.mha.gov.in/sites/default/files/MHAOrderDt_30052020.pdf) issued by the Ministry of Home Affairs on 30 May 2020 states that use of Aarogya Setu should be encouraged by employers on a “best efforts” basis and district authorities may “advise” individuals to install the app. The terminology used in these guidelines makes it abundantly clear that RWAs have not been authorized by the government to mandate use of Aarogya Setu among residents and visitors, and they do not have any authority to prohibit entry to residential colonies on this ground. As we have explained earlier, COVID-19 surveillance apps are susceptible to false positives and false negatives because of inherent limitations of bluetooth technology which is not a perfect proxy for virus exposure. If RWAs were allowed to force residents and visitors to download the Aarogya Setu app and allow entry based on the status displayed on the app, it could lead to wrongful confinement of certain residents and deprivation of livelihood of working class service providers. Residents who are shown by the app to be at risk of COVID-19 could be prohibited from leaving their house or accessing common areas. Further, domestic workers, drivers, delivery persons and other service providers could also be prohibited from entering the colony to do their jobs based on their status on the app. ### What can an ordinary resident do? If you find yourself in a situation with an overzealous RWA, first ask them for a copy of the by-laws and the rules and details of the procedure by which they were adopted. The RWA’s MoA and by-laws will contain the procedure for amending existing rules or adding new rules. Generally, new rules or amendments cannot be made without a General Body Meeting. If the rule making procedure has been flouted, the rules will be invalid. We also encourage you to have a constructive dialogue with your RWA representatives highlighting concerns about accuracy and privacy of the Aarogya Setu app and explain that official MHA guidelines do not authorize RWAs to require mandatory use of Aarogya Setu. Any rules which are inconsistent with governmental guidelines may be an abuse of power by the RWA and can be challenged in court. Any resident who is aggrieved by arbitrary and unreasonable actions of an RWA can file a suit under Section 6 of the Societies Registration Act, 1860. The RWA can be sued in the local civil court in the name of the President or Secretary. ### Representation to Government We recognize that individual residents and working class service providers may not always have the bargaining power to negotiate with RWAs or approach courts. Therefore, we have written to the Ministry of Housing and Urban Affairs, the National Real Estate Development Council and the Ministry of Health and Family Welfare seeking issuance of an advisory which clarifies that use of the Aarogya Setu mobile app cannot be made a precondition for entering residential colonies. As researchers at the Centre for Internet and Society note in their [**recent article**](https://cis-india.org/internet-governance/blog/essay-watching-corona-or-neighbours-introducing-2018lateral-surveillance2019-during-covid201919) on lateral surveillance, the COVID-19 pandemic has witnessed an increase in surveillance by private actors. Residential colonies cannot be controlled by RWAs as mini-sovereigns, and insofar as RWAs impose measures which are inconsistent with guidelines issued by the government, it amounts to vigilantism. During the COVID-19 crisis, the need of the hour is social solidarity and the government has a positive duty to prevent RWAs from engaging in intrusive and arbitrary practices which lack any basis in law and promote a culture of suspicion, stigma and exclusion. *(This post has been authored by Sonalakshi Naidu, a legal intern at IFF, and reviewed by IFF staffer, Devdutta.)* ### Important Documents: 1. Representation regarding illegal imposition of Aarogya Setu by RWAs ([**link**](https://drive.google.com/file/d/1KL23Isr2NQeEPMm4Z09TkwHqGaiK8ARB/view?usp=sharing)) [***Help us continue our work against all kinds of surveillance, be it by Big Brother, Big Tech or your neighbourhood RWA. Become an IFF member today!***](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "Excellent writeup. Very grateful for this among other things. Somebody start a [akosha.com](https://akosha.com) type site to deal with RWA uncles, they are real pain in a$$. Great to see someone working on this. RWAs have really started to form arbitrary laws. One another thing I would like to raise is the use of data collected by RWA through apps like MyGate, Apartment Adda etc. These apps are collecting a lot of data about residents and don't seem to have data collection and usage standards. Would be great if we can do something about this. Rwa’s are the HoAs of India. Thanks ideally we need a central advisory on this. Also, we are thinking of creating info-graphics that can be circulated with your RWA whatsapp groups. (\"Going behind lines and fighting the battle!\") Hah! This would be one truly scalable service! In the meanwhile you can consider becoming a IFF member? We are here for you, we represent you. Each IFF staffer works every day with a sense of discipline and belief to protect your fundamental rights. In the gloom and despair we have to be there for each other. I completely agree that the aarogya setu app cant be made compulsory until its made open source Does co-operative housing society come under this. They must be having similar problem. Appreciate the write up. To the people who have concerns already - this will provide fodder for discussion. my only worry is - these RWA Unkills &amp; Antis will not read this at all. they will spin it around and blame you for being difficult &amp; uncooperative. their overzealous nature will make it easier for them to fault us for having the audacity to question the government &amp; their authority. the culture of truth, accountability, proof &amp; scientific temper is horrendously eroded - not just for us, but world over. i say this with no joy that installing the app will be forced upon more people than respectful acknowledgement of a person's concerns. \"kya hi farak padega\"; \"what do you have to hide\"; \"you have nothing to lose\" - i can very well imagine such garbage \"viewpoints\" being offered. it's just embarrassing. Glad that people like you fight the good fight. Keep it up! That image is gold! I wish I had the guts to post it in my colony group Send it and then delete it after 2 minutes after saying, “oops”. My RWA is filled with old uncles and aunties who have closed all the locality parks since March and refuse to open them up Fuckers are going to die of diabetes if not covid &gt; the culture of truth, accountability, proof &amp; scientific temper is horrendously eroded - not just for us, but world over. Just today there was a video on ndtv of a python trying to eat a deer and a man \"saving\" the deer. Literally dozens of comments on the video are cheering the man for showing kindness to the deer! That's just the tip of the iceberg as far as the erosion of basic scientific values go. Social media has turned everyone into emotional animals who are swayed by whatever visuals can be paraded before them \"what do you have to hide\" Whenever an uncle or aunty says this to me for applocks I have in my phone, it burns me to the core. The problem is, that these uncles and aunties do not have any concept of privacy, and identity protection. \"ThErE ShOuLd Be NoThInG To HiDe If YoU HaVe'Nt DoNe NoThInG WrOnG\" This argument is used by a lot of people I meet, even my family members, and they all agree with it. It enrages me to the core. I would suggest you to make a fake app, with the aroyoga setu logo on it, which does nothing but opens amd then closes, and show this to those toxic uncles and aunties, so that they can shut up. Or, you could just uninstall it when they leave. Or, you could simply deny the apps permissions to do anything. In your experience, how long do these multi-letter govt. agencies, councils, or federal ministries take to reply to such letters? Seriously these RWA's are getting crazy with this Arogya setu app obsession. Excellent Writr-Up. &gt;they will spin it around and blame you for being difficult &amp; uncooperative. &gt; &gt;their overzealous nature will make it easier for them to fault us for having the audacity to question the government &amp; their authority. Elders should be respected in the group. You summed my entirely winding heavily worded monologue is just 7 words. Bravo my child, bravo.... My apartment's RWA is filled with typical uncles, bhakts, etc., but giving credit where it's due, they organised things for our building residents very well. We had absolutely no problems whatsoever in getting supplies and other essentials, and making sure we're all safe. The only thing they lack, if I would point out, is they keep asking for praise indirectly and sometimes very directly. &gt;back By pure logic or a historical timeline : natural rights are inherent and older than any living person. It really depends and is variable however through this pandemic we have seen government departments respond to public pressure in which such letters play some part. Some instances include the watering down or Aarogya Setu from mandatory to voluntary (atleast as per the Home Ministry) and the Ministry of Health making an advisory against the disclosure of the names of Covid Patients. We also follow a step based escalation matrix and have at least informally developed an advocacy tool kit to apply pressure. For us its not only about responses, or acknowledgment but about positive outcomes. Thanks! We are soon making some infographics and explainers you can forward to your local, friendly RWA group!"
}