{
    "id": "yxcmaq",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/yxcmaq/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 28,
    "num_comments": 33,
    "created_utc": 1668648611,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "**Are you looking for small gig work - writing blog posts and reviews?**\n\nI am looking to engage bloggers and writers for a small project \r  \n\r\r\n\n* Freelancers with background in book editing and book reviews \n* Bloggers who are social media savvy\r  \n\r\n\n&amp;#x200B;\n\nDM me with your profile and rate and we can chat further",
        "Hiring for multiple roles: \n\nSales/BDO, ReactJS, React Native \n\nFor a Product based SaaS\n\nContact at anuj [@] goaffpro.com",
        "Looking to get hired:\n\nSemi-Qualified Cost and Management Accountant with 2 years of professional working experience in Accounts Payable process, as a Finance Trainee, in Indian Oil Corporation Limited and Bharat Heavy Electricals Limited.\n\nHands on experience with SAP FICO module, WrenchENT Client (a DBMS tool), Ramco systems modules (ERP Software), and MS Office (Excel and Word).\n\nLocation: Delhi NCR (WFH/WFO/Full Time/Part Time)\n\nPlease DM me If you have any work opportunities related to my work experience and skills. I'll also share my LinkedIn profile, if it helps to know more about me. And if it's something which is not from my background, we can discuss it together to see wheather I'm the right fit for it. \n\nThank you.\n\nPS: Also, please let me know If anyone is willing to take a look at my resume to provide some suggestions. It would be a huge help.",
        "Looking for remote content writing opportunities. I used to do freelance writing a long time back in the gadgets and tech niche but switched careers. I love writing and doing researching on topics so I sort of want to get backs into the field again.  I have a masters in counselling psychology now and worked for a few years as a counsellor and in training people in basic counselling skills.  My main occupation now is my role as violinist private/violin tutor. I also game and can write gaming reviews/news.  \n\n Here’s a review I wrote recently: \n\nhttps://goodgamereviews4u.wordpress.com/2022/11/16/plague-tale-review/",
        "Looking for remote FPnA opportunities. Having 2 years of experience in MNC in revenue and financial, planning and analysis profile.",
        "**Global Tech company(Micro Focus) has massive job opportunities in India  (better with at least 2+ years experience) (most in Bangalore)**\n\nI'm an internal employee, If you are interested Please send your resume to [yanghua.hu@microfocus.com](mailto:yanghua.hu@microfocus.com), I can refer you and guide you.\n\n&amp;#x200B;\n\n\\#### The jobs are:  \n\\- Java/C/C++/Python/Front-End Engineer  \n\\- QA Engineer  \n\\- Senior Angular/Java Engineer  \n\\- Cyber Security Engineer  \n\\- Devops  \n\\- R&amp;D Manager  \n\\- HR System Engineer",
        "Can you clarify what you mean by FPna opportunities?",
        "Looking to get hired :\n\n1.Mbbs graduate in 2 months \n2. Tele Medical service \n3. Freelance voice over\n4. Word to pdf \n5. Hindi / Telugu / English translation \n6. Data entry\n7.Abacus tutor \n\nLocation : vijayawada \n\nPlease dm if you’ve any openings",
        "Guys I’m a business consultant with a world leading tech company, have done my mba from an old iim and my grad from an old nift. I have over 12 years experience and I manage about 700 people in India and Europe. I am qualified to give career counselling to people of all age group and career stages in fashion, retail, e-commerce, and tech. Let me know if someone is in need.",
        "No charge and no names, of course.",
        "After barely managing to graduate in engineering, I decided to pursue a masters degree in mass communication from Delhi, but an overview of the unregulated and unstructured manner of the industry has drained my creative interests which had made me opt for a communications degree in the first place. I simply want to earn for the sake of making ends meet.\n\nI am confused whether to start preparing for SSC exams, or if I should take up a software training course as Indian market seems to be able to support only IT jobs.\n\nI am stuck and any kind of guidance or opinion would be appreciated.",
        "Just google freecodecamp &amp; fullstackopen, click on the first links and go through the all study material, check if it interests you and if it does, complete studying it consistently. If you're able to do this, you're already in top 1 percentile of IT, atleast knowledge wise. Rest depends on your merit and bit of luck. Good luck.",
        "Abacus tutor? So cool!",
        "Looking to get hired : date, you can hire me to come along with you to wherever you want me as a date. I’ll just be sitting or moving along with you and I do nothing. I don’t talk I just listen, I want my mula at the end of the day.",
        "Thanks for this. I'll email you my CV.",
        "150 rupiya dega",
        "Let's go, tell me where to come.",
        "P. Sherman, 42 Wallaby Way, Sydney",
        "Okay but ill accept only cash so make sure you have them ready in Australia. I'll book my flight, I might be late an hour or so keep in mind.",
        "we go under ocean. finding nemo style",
        "Sweet.",
        "Looking to get hired\n\nYour skillset/experience: AI/ML Developer, ~2 years experience\n\nLocation: India\n\nPreferred way of contacting me: Public link to job application / DM",
        "It’s cool , but didn’t find anyone interested in abacus to tutor 😄",
        "I'm a Data Engineer trying to figure out career direction.\n\nHow did you get into AI/ML? Do you have a PhD? Did you do Data Science before?",
        "I did a PG diploma course.\n\nWhat kind of tasks does data engineer have?",
        "I think DE responsibilities vary slightly by company, but this is what I currently do:\n\n* create and maintain cloud data infrastructure as needed \n* create data pipelines to serve BI and DS/AI/ML teams\n* maintain data lake and data warehouse\n* I also jump in as BI dev when the BI team is overloaded\n\nI started as a BI dev and switched into DE. Trying to figure out next career moves. One thing I am potentially looking into is getting into big data positions internally at my company",
        "Can I do a full time and contract job at same time?",
        "Hey, should I PM you?",
        "Financial planning and analysis",
        "I completed MCA but have no experience, since I built blogs and websites to earn from affiliate marketing. How easy is it to get job in my condition?",
        "Should I PM you??",
        "Yeah sure",
        "Go ahead!",
        "Create a portfolio, showcase your work. If it doesn’t work, upskill with relevant certifications",
        "jyotishkumar.artstation.com",
        "Need career guidance. I am 30F residing in India, currently working for a Big4 in Government consulting. In 7 years of work ex I've held different job roles but Government was mostly part of it, directly or indirectly and I finally gave in to a corporate role. \n\nI have a bachelors in masters in social sciences and at the 6 year work ex mark decided to pursue an MBA just to move abroad. Recently however I started attending a ceramics class on the side and absolutely loved the entire process it requires. I'm beginning to think I need to have a more creative hands-on role and am having second-thoughts about my MBA goal. However, belonging to a middle class family where I need to support my parents as well, I'm not sure how to solve my confusion and plan my next year. One part of me wants to stay here, pursue ceramics with my full time job and commit to living in this city and another part of me wants to go abroad to pursue the MBA and settle there. \n\nNot looking at public policy or similar course because it would box me in this sector that I'm getting very tired and disillusioned with. I thought MBA would be a good and comfortable out for me and I'm confident of securing admission in a decent school. My wavering commitment is however delaying the process for me. Is there a way I can directly apply for a job in Europe in Government related sectors for now and pursue my creative dreams on the side from there?"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "looking small gig work writing blog posts reviews looking engage bloggers writers small project freelancers background book editing book reviews bloggers social media savvy ampxb dm profile rate chat hiring multiple roles salesbdo reactjs react native product based saas contact anuj goaffprocom looking get hired semiqualified cost management accountant years professional working experience accounts payable process finance trainee indian oil corporation limited bharat heavy electricals limited hands experience sap fico module wrenchent client dbms tool ramco systems modules erp software ms office excel word location delhi ncr wfhwfofull timepart time please dm work opportunities related work experience skills ill also share linkedin profile helps know something background discuss together see wheather im right fit thank ps also please let know anyone willing take look resume provide suggestions would huge help looking remote content writing opportunities used freelance writing long time back gadgets tech niche switched careers love writing researching topics sort want get backs field masters counselling psychology worked years counsellor training people basic counselling skills main occupation role violinist privateviolin tutor also game write gaming reviewsnews heres review wrote recently looking remote fpna opportunities years experience mnc revenue financial planning analysis profile global tech companymicro focus massive job opportunities india better least years experience bangalore im internal employee interested please send resume yanghuahumicrofocuscommailtoyanghuahumicrofocuscom refer guide ampxb jobs javaccpythonfrontend engineer qa engineer senior angularjava engineer cyber security engineer devops rampd manager hr system engineer clarify mean fpna opportunities looking get hired mbbs graduate months tele medical service freelance voice word pdf hindi telugu english translation data entry abacus tutor location vijayawada please dm youve openings guys im business consultant world leading tech company done mba old iim grad old nift years experience manage people india europe qualified give career counselling people age group career stages fashion retail ecommerce tech let know someone need charge names course barely managing graduate engineering decided pursue masters degree mass communication delhi overview unregulated unstructured manner industry drained creative interests made opt communications degree first place simply want earn sake making ends meet confused whether start preparing ssc exams take software training course indian market seems able support jobs stuck kind guidance opinion would appreciated google freecodecamp amp fullstackopen click first links go study material check interests complete studying consistently youre able youre already top percentile atleast knowledge wise rest depends merit bit luck good luck abacus tutor cool looking get hired date hire come along wherever want date ill sitting moving along nothing dont talk listen want mula end day thanks ill email cv rupiya dega lets go tell come p sherman wallaby way sydney okay ill accept cash make sure ready australia ill book flight might late hour keep mind go ocean finding nemo style sweet looking get hired skillsetexperience aiml developer years experience location india preferred way contacting public link job application dm cool didnt find anyone interested abacus tutor im data engineer trying figure career direction get aiml phd data science pg diploma course kind tasks data engineer think de responsibilities vary slightly company currently create maintain cloud data infrastructure needed create data pipelines serve bi dsaiml teams maintain data lake data warehouse also jump bi dev bi team overloaded started bi dev switched de trying figure next career moves one thing potentially looking getting big data positions internally company full time contract job time hey pm financial planning analysis completed mca experience since built blogs websites earn affiliate marketing easy get job condition pm yeah sure go ahead create portfolio showcase work doesnt work upskill relevant certifications jyotishkumarartstationcom need career guidance f residing india currently working big government consulting years work ex ive held different job roles government mostly part directly indirectly finally gave corporate role bachelors masters social sciences year work ex mark decided pursue mba move abroad recently however started attending ceramics class side absolutely loved entire process requires im beginning think need creative handson role secondthoughts mba goal however belonging middle class family need support parents well im sure solve confusion plan next year one part wants stay pursue ceramics full time job commit living city another part wants go abroad pursue mba settle looking public policy similar course would box sector im getting tired disillusioned thought mba would good comfortable im confident securing admission decent school wavering commitment however delaying process way directly apply job europe government related sectors pursue creative dreams side",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "**Are you looking for small gig work - writing blog posts and reviews?** I am looking to engage bloggers and writers for a small project * Freelancers with background in book editing and book reviews * Bloggers who are social media savvy  DM me with your profile and rate and we can chat further Hiring for multiple roles: Sales/BDO, ReactJS, React Native For a Product based SaaS Contact at anuj [@] goaffpro.com Looking to get hired: Semi-Qualified Cost and Management Accountant with 2 years of professional working experience in Accounts Payable process, as a Finance Trainee, in Indian Oil Corporation Limited and Bharat Heavy Electricals Limited. Hands on experience with SAP FICO module, WrenchENT Client (a DBMS tool), Ramco systems modules (ERP Software), and MS Office (Excel and Word). Location: Delhi NCR (WFH/WFO/Full Time/Part Time) Please DM me If you have any work opportunities related to my work experience and skills. I'll also share my LinkedIn profile, if it helps to know more about me. And if it's something which is not from my background, we can discuss it together to see wheather I'm the right fit for it. Thank you. PS: Also, please let me know If anyone is willing to take a look at my resume to provide some suggestions. It would be a huge help. Looking for remote content writing opportunities. I used to do freelance writing a long time back in the gadgets and tech niche but switched careers. I love writing and doing researching on topics so I sort of want to get backs into the field again. I have a masters in counselling psychology now and worked for a few years as a counsellor and in training people in basic counselling skills. My main occupation now is my role as violinist private/violin tutor. I also game and can write gaming reviews/news. Here’s a review I wrote recently: Looking for remote FPnA opportunities. Having 2 years of experience in MNC in revenue and financial, planning and analysis profile. **Global Tech company(Micro Focus) has massive job opportunities in India (better with at least 2+ years experience) (most in Bangalore)** I'm an internal employee, If you are interested Please send your resume to [yanghua.hu@microfocus.com](mailto:yanghua.hu@microfocus.com), I can refer you and guide you.  \\#### The jobs are: \\- Java/C/C++/Python/Front-End Engineer \\- QA Engineer \\- Senior Angular/Java Engineer \\- Cyber Security Engineer \\- Devops \\- R&amp;D Manager \\- HR System Engineer Can you clarify what you mean by FPna opportunities? Looking to get hired : 1.Mbbs graduate in 2 months 2. Tele Medical service 3. Freelance voice over 4. Word to pdf 5. Hindi / Telugu / English translation 6. Data entry 7.Abacus tutor Location : vijayawada Please dm if you’ve any openings Guys I’m a business consultant with a world leading tech company, have done my mba from an old iim and my grad from an old nift. I have over 12 years experience and I manage about 700 people in India and Europe. I am qualified to give career counselling to people of all age group and career stages in fashion, retail, e-commerce, and tech. Let me know if someone is in need. No charge and no names, of course. After barely managing to graduate in engineering, I decided to pursue a masters degree in mass communication from Delhi, but an overview of the unregulated and unstructured manner of the industry has drained my creative interests which had made me opt for a communications degree in the first place. I simply want to earn for the sake of making ends meet. I am confused whether to start preparing for SSC exams, or if I should take up a software training course as Indian market seems to be able to support only IT jobs. I am stuck and any kind of guidance or opinion would be appreciated. Just google freecodecamp &amp; fullstackopen, click on the first links and go through the all study material, check if it interests you and if it does, complete studying it consistently. If you're able to do this, you're already in top 1 percentile of IT, atleast knowledge wise. Rest depends on your merit and bit of luck. Good luck. Abacus tutor? So cool! Looking to get hired : date, you can hire me to come along with you to wherever you want me as a date. I’ll just be sitting or moving along with you and I do nothing. I don’t talk I just listen, I want my mula at the end of the day. Thanks for this. I'll email you my CV. 150 rupiya dega Let's go, tell me where to come. P. Sherman, 42 Wallaby Way, Sydney Okay but ill accept only cash so make sure you have them ready in Australia. I'll book my flight, I might be late an hour or so keep in mind. we go under ocean. finding nemo style Sweet. Looking to get hired Your skillset/experience: AI/ML Developer, ~2 years experience Location: India Preferred way of contacting me: Public link to job application / DM It’s cool , but didn’t find anyone interested in abacus to tutor 😄 I'm a Data Engineer trying to figure out career direction. How did you get into AI/ML? Do you have a PhD? Did you do Data Science before? I did a PG diploma course. What kind of tasks does data engineer have? I think DE responsibilities vary slightly by company, but this is what I currently do: * create and maintain cloud data infrastructure as needed * create data pipelines to serve BI and DS/AI/ML teams * maintain data lake and data warehouse * I also jump in as BI dev when the BI team is overloaded I started as a BI dev and switched into DE. Trying to figure out next career moves. One thing I am potentially looking into is getting into big data positions internally at my company Can I do a full time and contract job at same time? Hey, should I PM you? Financial planning and analysis I completed MCA but have no experience, since I built blogs and websites to earn from affiliate marketing. How easy is it to get job in my condition? Should I PM you?? Yeah sure Go ahead! Create a portfolio, showcase your work. If it doesn’t work, upskill with relevant certifications jyotishkumar.artstation.com Need career guidance. I am 30F residing in India, currently working for a Big4 in Government consulting. In 7 years of work ex I've held different job roles but Government was mostly part of it, directly or indirectly and I finally gave in to a corporate role. I have a bachelors in masters in social sciences and at the 6 year work ex mark decided to pursue an MBA just to move abroad. Recently however I started attending a ceramics class on the side and absolutely loved the entire process it requires. I'm beginning to think I need to have a more creative hands-on role and am having second-thoughts about my MBA goal. However, belonging to a middle class family where I need to support my parents as well, I'm not sure how to solve my confusion and plan my next year. One part of me wants to stay here, pursue ceramics with my full time job and commit to living in this city and another part of me wants to go abroad to pursue the MBA and settle there. Not looking at public policy or similar course because it would box me in this sector that I'm getting very tired and disillusioned with. I thought MBA would be a good and comfortable out for me and I'm confident of securing admission in a decent school. My wavering commitment is however delaying the process for me. Is there a way I can directly apply for a job in Europe in Government related sectors for now and pursue my creative dreams on the side from there?"
}