{
    "id": "1du99n4",
    "title": "No scientific study to blame Punjab farm fires for Delhi's pollution, says NGT member",
    "url": "https://www.deccanherald.com/india/punjab/no-scientific-study-to-blame-punjab-farm-fires-for-delhis-pollution-says-ngt-member-3089733",
    "selftext": "> \"Har bat ke liye kisan bhaiyon ko zimmedar thehrana mujhe samajh nahi aata hai (Holding farmers responsible for everything is beyond my comprehension),\" said Justice Agarwal.\n\n> He said Punjab is not even an immediate neighbour of Delhi, which shares its borders with Haryana, Uttar Pradesh and Rajasthan. Moreover, a particular wind speed and a specific direction were needed to ensure that the so-called polluted Punjab air \n\nThere is \"no\" scientific study but our justice knows what kind of winds are required for smoke to reach Delhi.\n\n> The real reason for Delhi’s air pollution is something else and the prosecution of farmers for this is wholly unjust, he said, adding \"There may be some political reasons behind such an accusation... I don’t know.\" He wondered how the polluted air from Punjab neither contaminates air in Haryana nor reaches even Ghaziabad.\n\nBut they are equally polluted. Isn't it know fact that Delhi being a city traps more air than open fields of Haryana. But smog is equally bad in such areas?\n\nThis is the rot in system. We suffer every year with that smoke but our lawmakers can't even figure out what's causing it. And now our esteem judges think there is conspiracy where Delhi automatically gets super polluted the same time farmers burn their farmland. ",
    "flair": "Law & Courts",
    "score": 46,
    "num_comments": 14,
    "created_utc": 1719994968.0,
    "convurl": "https://external-preview.redd.it/KtNrJI83Ae-ejKeUhj2iGkq3EuKU4mwyH_SeRjKO9MY.jpg?auto=webp&s=aef3e5ae870a3361f1e6f6f68a377fc776fcb8a4",
    "comments": [
        "It's so fucking infuriating because even Pakistan acknowledges that this is a problem as even their side of Punjab has this tradition of stubble burning.\n\nAnd here we have people trying to ignore the main reason.",
        "Judges are playing politics now.",
        "“Kisan bhaiyon” yep definitely not trying to side with anyone here. Very obvious. Not playing with sentiments. Very obvious. Definitely not any political motive.",
        "Did he try \n\nOPENING HIS FUCKING EYES\n\nonce?",
        "Even nasa says that punjabi farmers are causing pollution. But ngt apparently has other ideas.",
        "West Punjab is 3x the size of East Punjab. West Punjab is also the biggest province by population and second largest in terms of land mass which exacerbates the situation. Wouldn’t be fair to compare the two.",
        "You don’t understand Politics, eh! BJP wants Punjab votes and eliminate AAP in Delhi. This kills 2 birds. No blame by the central agency, hand in glove courts to the Punjabis, esp farmers and two, the responsibility now lies with the Delhi AAP to mitigate Delhi pollution which can’t be blamed on Punjab anymore. \n\nSamjho, bro!",
        "Always been.",
        "Look at their castes. You expect UC judges to belt a different tune than RSS",
        "There are layers of lies and coverups here. The judge is covering up for Punjab farmers burning parali, but a even bigger cover up is the lie that there's hardly any burning in up and haryana. Punjab burning days is at least publicly available,  showing the extent of the problem. Up and haryana data falsely shows very very few fires at the peak of the burning season. A casual drive along the highways for less than 100km shows many more farm fires in these states than the totals reported for the whole states. The whole far right bigot brigade doubles down on bursting crackers, not just in diwali, but also at any available excuse, because, apparently, it is their religious right to fuck up everyone's lungs. Government mandates puc certificates, and sleazy private operators give those to vehicles billowing black smoke for less than 100rs, without actually testing. The government itself allows diesel vehicles, even private small vehicles,  to ply. Go into the hills, and you start smelling kerosene from three wheelers. Industries pollute like there's no tomorrow. Brick kilns, thermal plants bellow ominous clouds of black smoke without any scrubbing.\n\n\nBut hey, the supreme court throws a fit about Delhi air (rest of the country be dammed, as if its the supreme court of Delhi, not India) every winter, in response the ngt bans construction (which happily continues at nights or behind screens), and Delhi government sprinkles some water on the roads and does odd even nautanki (while people drive whatever the fuck they want with fake puc papers).",
        "Exactly. ",
        "BJ wants votes in Punjab. Aap cronology samajhiye.",
        "BJ wants votes in Punjab. Aap cronology samajhiye."
    ],
    "cleaned_text": "scientific study blame punjab farm fires delhis pollution says ngt member har bat ke liye kisan bhaiyon ko zimmedar thehrana mujhe samajh nahi aata hai holding farmers responsible everything beyond comprehension said justice agarwal said punjab even immediate neighbour delhi shares borders haryana uttar pradesh rajasthan moreover particular wind speed specific direction needed ensure socalled polluted punjab air scientific study justice knows kind winds required smoke reach delhi real reason delhis air pollution something else prosecution farmers wholly unjust said adding may political reasons behind accusation dont know wondered polluted air punjab neither contaminates air haryana reaches even ghaziabad equally polluted isnt know fact delhi city traps air open fields haryana smog equally bad areas rot system suffer every year smoke lawmakers cant even figure whats causing esteem judges think conspiracy delhi automatically gets super polluted time farmers burn farmland ",
    "cleaned_title": "scientific study blame punjab farm fires delhis pollution says ngt member",
    "cleaned_selftext": "har bat ke liye kisan bhaiyon ko zimmedar thehrana mujhe samajh nahi aata hai holding farmers responsible everything beyond comprehension said justice agarwal said punjab even immediate neighbour delhi shares borders haryana uttar pradesh rajasthan moreover particular wind speed specific direction needed ensure socalled polluted punjab air scientific study justice knows kind winds required smoke reach delhi real reason delhis air pollution something else prosecution farmers wholly unjust said adding may political reasons behind accusation dont know wondered polluted air punjab neither contaminates air haryana reaches even ghaziabad equally polluted isnt know fact delhi city traps air open fields haryana smog equally bad areas rot system suffer every year smoke lawmakers cant even figure whats causing esteem judges think conspiracy delhi automatically gets super polluted time farmers burn farmland",
    "cleaned_comments": "fucking infuriating even pakistan acknowledges problem even side punjab tradition stubble burning people trying ignore main reason judges playing politics kisan bhaiyon yep definitely trying side anyone obvious playing sentiments obvious definitely political motive try opening fucking eyes even nasa says punjabi farmers causing pollution ngt apparently ideas west punjab x size east punjab west punjab also biggest province population second largest terms land mass exacerbates situation wouldnt fair compare two dont understand politics eh bjp wants punjab votes eliminate aap delhi kills birds blame central agency hand glove courts punjabis esp farmers two responsibility lies delhi aap mitigate delhi pollution cant blamed punjab anymore samjho bro always look castes expect uc judges belt different tune rss layers lies coverups judge covering punjab farmers burning parali even bigger cover lie theres hardly burning haryana punjab burning days least publicly available showing extent problem haryana data falsely shows fires peak burning season casual drive along highways less km shows many farm fires states totals reported whole states whole far right bigot brigade doubles bursting crackers diwali also available excuse apparently religious right fuck everyones lungs government mandates puc certificates sleazy private operators give vehicles billowing black smoke less rs without actually testing government allows diesel vehicles even private small vehicles ply go hills start smelling kerosene three wheelers industries pollute like theres tomorrow brick kilns thermal plants bellow ominous clouds black smoke without scrubbing hey supreme court throws fit delhi air rest country dammed supreme court delhi india every winter response ngt bans construction happily continues nights behind screens delhi government sprinkles water roads odd even nautanki people drive whatever fuck want fake puc papers exactly bj wants votes punjab aap cronology samajhiye bj wants votes punjab aap cronology samajhiye",
    "light_cleaned_title": "No scientific study to blame Punjab farm fires for Delhi's pollution, says NGT member",
    "light_cleaned_selftext": "> \"Har bat ke liye kisan bhaiyon ko zimmedar thehrana mujhe samajh nahi aata hai (Holding farmers responsible for everything is beyond my comprehension),\" said Justice Agarwal. > He said Punjab is not even an immediate neighbour of Delhi, which shares its borders with Haryana, Uttar Pradesh and Rajasthan. Moreover, a particular wind speed and a specific direction were needed to ensure that the so-called polluted Punjab air There is \"no\" scientific study but our justice knows what kind of winds are required for smoke to reach Delhi. > The real reason for Delhi’s air pollution is something else and the prosecution of farmers for this is wholly unjust, he said, adding \"There may be some political reasons behind such an accusation... I don’t know.\" He wondered how the polluted air from Punjab neither contaminates air in Haryana nor reaches even Ghaziabad. But they are equally polluted. Isn't it know fact that Delhi being a city traps more air than open fields of Haryana. But smog is equally bad in such areas? This is the rot in system. We suffer every year with that smoke but our lawmakers can't even figure out what's causing it. And now our esteem judges think there is conspiracy where Delhi automatically gets super polluted the same time farmers burn their farmland.",
    "light_cleaned_comments": "It's so fucking infuriating because even Pakistan acknowledges that this is a problem as even their side of Punjab has this tradition of stubble burning. And here we have people trying to ignore the main reason. Judges are playing politics now. “Kisan bhaiyon” yep definitely not trying to side with anyone here. Very obvious. Not playing with sentiments. Very obvious. Definitely not any political motive. Did he try OPENING HIS FUCKING EYES once? Even nasa says that punjabi farmers are causing pollution. But ngt apparently has other ideas. West Punjab is 3x the size of East Punjab. West Punjab is also the biggest province by population and second largest in terms of land mass which exacerbates the situation. Wouldn’t be fair to compare the two. You don’t understand Politics, eh! BJP wants Punjab votes and eliminate AAP in Delhi. This kills 2 birds. No blame by the central agency, hand in glove courts to the Punjabis, esp farmers and two, the responsibility now lies with the Delhi AAP to mitigate Delhi pollution which can’t be blamed on Punjab anymore. Samjho, bro! Always been. Look at their castes. You expect UC judges to belt a different tune than RSS There are layers of lies and coverups here. The judge is covering up for Punjab farmers burning parali, but a even bigger cover up is the lie that there's hardly any burning in up and haryana. Punjab burning days is at least publicly available, showing the extent of the problem. Up and haryana data falsely shows very very few fires at the peak of the burning season. A casual drive along the highways for less than 100km shows many more farm fires in these states than the totals reported for the whole states. The whole far right bigot brigade doubles down on bursting crackers, not just in diwali, but also at any available excuse, because, apparently, it is their religious right to fuck up everyone's lungs. Government mandates puc certificates, and sleazy private operators give those to vehicles billowing black smoke for less than 100rs, without actually testing. The government itself allows diesel vehicles, even private small vehicles, to ply. Go into the hills, and you start smelling kerosene from three wheelers. Industries pollute like there's no tomorrow. Brick kilns, thermal plants bellow ominous clouds of black smoke without any scrubbing. But hey, the supreme court throws a fit about Delhi air (rest of the country be dammed, as if its the supreme court of Delhi, not India) every winter, in response the ngt bans construction (which happily continues at nights or behind screens), and Delhi government sprinkles some water on the roads and does odd even nautanki (while people drive whatever the fuck they want with fake puc papers). Exactly. BJ wants votes in Punjab. Aap cronology samajhiye. BJ wants votes in Punjab. Aap cronology samajhiye."
}