{
    "id": "16hnx66",
    "title": "Understanding the refrigeration requirements of the youth",
    "url": "https://www.reddit.com/r/india/comments/16hnx66/understanding_the_refrigeration_requirements_of/",
    "selftext": "Hi guys!\n\nThis post is to understand refrigeration the requirements of the youth for my college project.\n\nTo make things easier for you guys and for me, I've made a survey form for you guys to fill.\n\nIt's a very interactive and quick form, will take you less than 4mins.\n\nHere is the link to the survey:\n\nhttps://sprw.io/stt-3CCgRiPeAKEHBwmWQUsytS\n\nI hope you guys help me out with the survey :)\nThankyou 😊",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694613905.0,
    "convurl": "https://external-preview.redd.it/xRL5XAmcJwPs228H618yvvHlAId6GPLS972okxUGU6Y.jpg?auto=webp&amp;s=b01c038a63955f829383a13be8db453e285ea350",
    "comments": [],
    "cleaned_text": "understanding refrigeration requirements youth hi guys post understand refrigeration requirements youth college project make things easier guys ive made survey form guys fill interactive quick form take less mins link survey hope guys help survey thankyou ",
    "cleaned_title": "understanding refrigeration requirements youth",
    "cleaned_selftext": "hi guys post understand refrigeration requirements youth college project make things easier guys ive made survey form guys fill interactive quick form take less mins link survey hope guys help survey thankyou",
    "cleaned_comments": "",
    "light_cleaned_title": "Understanding the refrigeration requirements of the youth",
    "light_cleaned_selftext": "Hi guys! This post is to understand refrigeration the requirements of the youth for my college project. To make things easier for you guys and for me, I've made a survey form for you guys to fill. It's a very interactive and quick form, will take you less than 4mins. Here is the link to the survey: I hope you guys help me out with the survey :) Thankyou 😊",
    "light_cleaned_comments": ""
}