{
    "id": "1h4mryp",
    "title": "Supreme Court: Don't convert civil cases into criminal, Supreme Court warns UP Police | India News - Times of India",
    "url": "https://timesofindia.indiatimes.com/india/dont-convert-civil-cases-into-criminal-supreme-court-warns-up-police/articleshow/115782172.cms",
    "selftext": "Warning the director general of UP Police to rein in his forces from routinely converting civil disputes into criminal cases to harass civilians, Supreme Court on Thursday said if the practice did not cease, it would pass orders that the DGP would \"remember his whole life\".",
    "flair": "Law & Courts",
    "score": 75,
    "num_comments": 5,
    "created_utc": 1733113744.0,
    "convurl": "https://external-preview.redd.it/OLdCHK_1KAGoHUINo4b_dJByS-h_HXG0jKRqoMzDB4I.jpg?auto=webp&s=63d8b2ef290d1d220f9be89020b95342ff7c8e0d",
    "comments": [
        ">[\"UP Police are entering into a dangerous area. You register criminal cases in purely civil disputes. Tell your DGP that if this practice does not stop immediately, we will pass such drastic orders, he will remember for his whole life,\" the bench said, expressing displeasure. Mukherjee said if police did not heed the court, then he would return the case to the govt. The bench said the remarks were aimed at police's conduct and told Mukherjee that he should use his good offices to drive home SC's message.](https://timesofindia.indiatimes.com/india/dont-convert-civil-cases-into-criminal-supreme-court-warns-up-police/articleshow/115782172.cms)",
        "https://preview.redd.it/7p9vk3a4xe4e1.jpeg?width=764&format=pjpg&auto=webp&s=99b6eafa99413b495a71d49ac2c04a1b6067ba97",
        "UP Police converting civil cases into criminal ones, because apparently, the real crime is resolving disputes without chaos. Supreme Court’s warning might finally teach them that justice isn’t a drama series where every episode needs a plot twist.",
        "I mean why warn the DGP, take the damn action already if they’re already abusing power. 100’s of lives get ruined thanks to these kinds of police officers, there’s no need to show them kindness."
    ],
    "cleaned_text": "supreme court dont convert civil cases criminal supreme court warns police india news times india warning director general police rein forces routinely converting civil disputes criminal cases harass civilians supreme court thursday said practice cease would pass orders dgp would remember whole life ",
    "cleaned_title": "supreme court dont convert civil cases criminal supreme court warns police india news times india",
    "cleaned_selftext": "warning director general police rein forces routinely converting civil disputes criminal cases harass civilians supreme court thursday said practice cease would pass orders dgp would remember whole life",
    "cleaned_comments": "police entering dangerous area register criminal cases purely civil disputes tell dgp practice stop immediately pass drastic orders remember whole life bench said expressing displeasure mukherjee said police heed court would return case govt bench said remarks aimed polices conduct told mukherjee use good offices drive home scs messagehttpstimesofindiaindiatimescomindiadontconvertcivilcasesintocriminalsupremecourtwarnsuppolicearticleshowcms police converting civil cases criminal ones apparently real crime resolving disputes without chaos supreme courts warning might finally teach justice isnt drama series every episode needs plot twist mean warn dgp take damn action already theyre already abusing power lives get ruined thanks kinds police officers theres need show kindness",
    "light_cleaned_title": "Supreme Court: Don't convert civil cases into criminal, Supreme Court warns UP Police | India News - Times of India",
    "light_cleaned_selftext": "Warning the director general of UP Police to rein in his forces from routinely converting civil disputes into criminal cases to harass civilians, Supreme Court on Thursday said if the practice did not cease, it would pass orders that the DGP would \"remember his whole life\".",
    "light_cleaned_comments": ">[\"UP Police are entering into a dangerous area. You register criminal cases in purely civil disputes. Tell your DGP that if this practice does not stop immediately, we will pass such drastic orders, he will remember for his whole life,\" the bench said, expressing displeasure. Mukherjee said if police did not heed the court, then he would return the case to the govt. The bench said the remarks were aimed at police's conduct and told Mukherjee that he should use his good offices to drive home SC's message.](https://timesofindia.indiatimes.com/india/dont-convert-civil-cases-into-criminal-supreme-court-warns-up-police/articleshow/115782172.cms) UP Police converting civil cases into criminal ones, because apparently, the real crime is resolving disputes without chaos. Supreme Court’s warning might finally teach them that justice isn’t a drama series where every episode needs a plot twist. I mean why warn the DGP, take the damn action already if they’re already abusing power. 100’s of lives get ruined thanks to these kinds of police officers, there’s no need to show them kindness."
}