{
    "id": "162lp8t",
    "title": "Flipkart Mobile Exchange Later Scam",
    "url": "https://www.reddit.com/r/india/comments/162lp8t/flipkart_mobile_exchange_later_scam/",
    "selftext": "Flipkart has mastered their skill in shady tactics.\n\nPurchased a phone through exchange later program.\n\nEvents that happened:\n\n1.The old phone got an estimate of 2750 with current state(display & body cracks). I had opted for exchange after 7 days.( Got higher value and exchange later discount )\n\n2. New phone got delivered,\n\nThis delivery agent called and said server was down and can't be processed further.Old phone was not collected even after 10days and later the order got cancelled(seller had some difficulties).A problem from seller(or flipkart)\n\n3.I reached out to flipkart, they came up with solution that I can sell phone through Sell back program.\n\nGot Email from flipkart which had this condition :\n\n[https://imgur.com/a/verzvgp](https://imgur.com/a/verzvgp)\n\n\\[\n\nIn case the Sell-back price for your old product is less than  the one you were getting as part of the Exchange later option, the  'difference amount' will be added as Gift Card within 24 hours after the  sellback pickup to your Flipkart account.\n\n\\]\n\nTo my suprise the Sell back program was cancelled twice.\n\nNow this sell back program estimated phone value to be 850(with same conditions display and body cracks acc to agent) I went ahead and sold it. As I had already got a reply from flipkart via email to match the price difference\n\n4. After all this hectic process of 20days. I have only received 850 in giftcard and now they are denying to match the price difference as stated earlier.\n\n1900 is less but still a good amount to fight back\n\nRaised 5 Complaints but they mark them as solved without proper resolution/email. \n\nCS is so terrible this lady started arguing lmao. I asked for a detailed reply though email also denied.\n\nThey are avoiding the previous mail and blaming on seller and old phone's state.\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693128262.0,
    "convurl": "https://external-preview.redd.it/33888xoh61XDZ_Y6uNAiM6UA4plReNLOdAJiQNSsCP0.jpg?auto=webp&s=7bd6c73eafb084d4a5218d07fb55e37ad2783c00",
    "comments": [
        "Never exchange your old phones online unless you are getting additional exchange bonus offer. Simply not worth it. Tried Flipkart and Cashify, they'll look so closely and find out minute flaws and immediately reduce the value of the phone. Better to sell it off yourself.",
        "I forgot to add, exchange later price(2750) is inclusive of  bonus of 1k",
        "It is becoming another Snapdeal",
        "I just want to ask one thing: Even after DOZENS AND DOZENS of these posts all over social media, why do people still keep using Flipkart? \n\nI'm not saying Amazon doesn't have its issues, but they are isolated and their support is usually pretty good.\n\nFlipkart is a pattern. Their entire business seems to be sucking out as much money from the customer as possible and spend little to no attention once the money is received by them.",
        "Just sell online on Facebook marketplace or OLX or whatever. These sellback programs are terrible anyway.\n\nLiterally got a defective Pixel 6a a few days ago, and if I see the listings for other phones, Flipkart is offering half the value of the Pixel 6a prices as exchange...........",
        "Because people don't have bad experiences, so they write it off as occasional issues faced by others. And then you get stung by the bad experience yourself and stop using them.",
        "I have started a new subreddit since I couldn’t find any place that archives all the incidents that people face with Flipkart. Be great if you could share this post on that subreddit. \nGoes by r/flopkart",
        "How does it work?\nLike whole exchange amount and additional bonus?\nDo we have to pay full price first(i want to do it with credit card offer) and then it gets refunded in to acc or what?"
    ],
    "cleaned_text": "flipkart mobile exchange later scam flipkart mastered skill shady tactics purchased phone exchange later program events happened old phone got estimate current statedisplay body cracks opted exchange days got higher value exchange later discount new phone got delivered delivery agent called said server cant processed furtherold phone collected even days later order got cancelledseller difficultiesa problem selleror flipkart reached flipkart came solution sell phone sell back program got email flipkart condition httpsimgurcomaverzvgphttpsimgurcomaverzvgp case sellback price old product less one getting part exchange later option difference amount added gift card within hours sellback pickup flipkart account suprise sell back program cancelled twice sell back program estimated phone value conditions display body cracks acc agent went ahead sold already got reply flipkart via email match price difference hectic process days received giftcard denying match price difference stated earlier less still good amount fight back raised complaints mark solved without proper resolutionemail cs terrible lady started arguing lmao asked detailed reply though email also denied avoiding previous mail blaming seller old phones state xb ",
    "cleaned_title": "flipkart mobile exchange later scam",
    "cleaned_selftext": "flipkart mastered skill shady tactics purchased phone exchange later program events happened old phone got estimate current statedisplay body cracks opted exchange days got higher value exchange later discount new phone got delivered delivery agent called said server cant processed furtherold phone collected even days later order got cancelledseller difficultiesa problem selleror flipkart reached flipkart came solution sell phone sell back program got email flipkart condition httpsimgurcomaverzvgphttpsimgurcomaverzvgp case sellback price old product less one getting part exchange later option difference amount added gift card within hours sellback pickup flipkart account suprise sell back program cancelled twice sell back program estimated phone value conditions display body cracks acc agent went ahead sold already got reply flipkart via email match price difference hectic process days received giftcard denying match price difference stated earlier less still good amount fight back raised complaints mark solved without proper resolutionemail cs terrible lady started arguing lmao asked detailed reply though email also denied avoiding previous mail blaming seller old phones state xb",
    "cleaned_comments": "never exchange old phones online unless getting additional exchange bonus offer simply worth tried flipkart cashify theyll look closely find minute flaws immediately reduce value phone better sell forgot add exchange later price inclusive bonus k becoming another snapdeal want ask one thing even dozens dozens posts social media people still keep using flipkart im saying amazon doesnt issues isolated support usually pretty good flipkart pattern entire business seems sucking much money customer possible spend little attention money received sell online facebook marketplace olx whatever sellback programs terrible anyway literally got defective pixel days ago see listings phones flipkart offering half value pixel prices exchange people dont bad experiences write occasional issues faced others get stung bad experience stop using started new subreddit since couldnt find place archives incidents people face flipkart great could share post subreddit goes rflopkart work like whole exchange amount additional bonus pay full price firsti want credit card offer gets refunded acc",
    "light_cleaned_title": "Flipkart Mobile Exchange Later Scam",
    "light_cleaned_selftext": "Flipkart has mastered their skill in shady tactics. Purchased a phone through exchange later program. Events that happened: 1.The old phone got an estimate of 2750 with current state(display & body cracks). I had opted for exchange after 7 days.( Got higher value and exchange later discount ) 2. New phone got delivered, This delivery agent called and said server was down and can't be processed further.Old phone was not collected even after 10days and later the order got cancelled(seller had some difficulties).A problem from seller(or flipkart) 3.I reached out to flipkart, they came up with solution that I can sell phone through Sell back program. Got Email from flipkart which had this condition : [https://imgur.com/a/verzvgp](https://imgur.com/a/verzvgp) \\[ In case the Sell-back price for your old product is less than the one you were getting as part of the Exchange later option, the 'difference amount' will be added as Gift Card within 24 hours after the sellback pickup to your Flipkart account. \\] To my suprise the Sell back program was cancelled twice. Now this sell back program estimated phone value to be 850(with same conditions display and body cracks acc to agent) I went ahead and sold it. As I had already got a reply from flipkart via email to match the price difference 4. After all this hectic process of 20days. I have only received 850 in giftcard and now they are denying to match the price difference as stated earlier. 1900 is less but still a good amount to fight back Raised 5 Complaints but they mark them as solved without proper resolution/email. CS is so terrible this lady started arguing lmao. I asked for a detailed reply though email also denied. They are avoiding the previous mail and blaming on seller and old phone's state. &#x200B;",
    "light_cleaned_comments": "Never exchange your old phones online unless you are getting additional exchange bonus offer. Simply not worth it. Tried Flipkart and Cashify, they'll look so closely and find out minute flaws and immediately reduce the value of the phone. Better to sell it off yourself. I forgot to add, exchange later price(2750) is inclusive of bonus of 1k It is becoming another Snapdeal I just want to ask one thing: Even after DOZENS AND DOZENS of these posts all over social media, why do people still keep using Flipkart? I'm not saying Amazon doesn't have its issues, but they are isolated and their support is usually pretty good. Flipkart is a pattern. Their entire business seems to be sucking out as much money from the customer as possible and spend little to no attention once the money is received by them. Just sell online on Facebook marketplace or OLX or whatever. These sellback programs are terrible anyway. Literally got a defective Pixel 6a a few days ago, and if I see the listings for other phones, Flipkart is offering half the value of the Pixel 6a prices as exchange........... Because people don't have bad experiences, so they write it off as occasional issues faced by others. And then you get stung by the bad experience yourself and stop using them. I have started a new subreddit since I couldn’t find any place that archives all the incidents that people face with Flipkart. Be great if you could share this post on that subreddit. Goes by r/flopkart How does it work? Like whole exchange amount and additional bonus? Do we have to pay full price first(i want to do it with credit card offer) and then it gets refunded in to acc or what?"
}