{
    "id": "17riywm",
    "title": "Heart-breaking: UP Cardiologist implants over 600 \"Low-quality\" pacemakers, soon to face trial for causing \"excess mortality\"",
    "url": "https://medicaldialogues.in/news/health/doctors/up-shocker-cardiologist-arrested-for-allegedly-implanting-low-quality-pacemakers-in-around-600-patients-119949",
    "selftext": "Thoughts ?",
    "flair": "Law & Courts",
    "score": 465,
    "num_comments": 32,
    "created_utc": 1699553001.0,
    "convurl": "https://external-preview.redd.it/BZCkhXLBTeBj0PTHWglqq7JJMuFGxGMpD5QnvYWc50A.jpg?auto=webp&s=73c28323e663c16d953c0c7cd0d3fd4d713b3569",
    "comments": [
        "Sounds like mass murder",
        "Will Bulldozer Baba send a bulldozer to his home?",
        "Why, just why are these guys so greedy, i know medical school is very costly(I have personal experience) and that he may have become apathetic through his residency but, why risk you life for some quick bucks when they most probably aren’t going to even affect your life that much. \n\n\nNeither can these guy feel for other fellow humans nor can they think to save their own asses.",
        "Man what a POS that guy is. He deserves a life sentence and more. Read the article, to see just how much crap he did.",
        "But why the low quality pacemakers were allowed in the market in the first place?",
        "Should also find and take action against the supplier of these low quality pacemakers as more doctors may be involved.",
        "Because doctors like every profession are humans. Like humans, doctors will have fair share of assholes and greedy people.",
        "Aadmi apni mbbs ki fees vasoolne ke liye kya kuch nahi karta 😔",
        "I bet that guy is already in politics. No will touch them",
        "He be like : tu jantaa nai mere contacts kaha kaha Tak hai",
        "What defines quality of medical implants ? How do one ensure best quality?",
        "Find and charge who allowed this low quuality pacemaker also.",
        "Money making",
        "Depends on the name",
        "UP being UP",
        "I normally don't care for this, but why is the doctor's name not mentioned ? \nSurely had he been a muslim, the article would have quoted \"muslim doctor\" 10 times. \n\nIrrespective of his religion, he is charged with implanting not 1 but 600 low quality pacemakers, why is his name being protected?",
        "where is the fucking bulldozer when you need it",
        "What kind of local shops sells cut-rate pacemakers??",
        "But wait...what's his religion?",
        "Bet. Kuch ni hoga. Union is very strong and court will forgive the doc for extraordinary service.",
        "Well, I guess this is truly... heartbreaking",
        "Seems you are more concerned about the name whatever it may be.\nNot the lives impacted or get the justice for them.",
        "This is shameful. He should have ask for money but the quality should never be compromised in patient care.\nFirst the dealer and the company which is producing it should be held liable to this.\nThen doctors who supported this low quality pacemaker should be charged under criminal act.",
        "Why did the government allow low quality Pace makers? Looks like they loved the tax from low quality Pace makers",
        "Sorry, surname too.",
        "Not to worry . The doctor will enjoy his ill gotten wealth, thanks to our legal system and the doctor code of supporting each other.",
        "To be specific, there's different types of pacemakers, one of the major differences being mri safe and not safe. The article says low quality but these are actually nri unsafe ones because they have metal in them, and if a person enters an mri chamber, can have fatal consequences. Since mri safe pacemakers are costly, patients are always given an option to chose from the two. Its not exactly about quality, it's about the type.",
        "If it exists, there exists a cheaper/inferior/china version of it.",
        "That makes so much more sense. Thank you",
        "The link within the article to news18 mentions the name as Samir Sarraf. Which is pretty ambiguous. Can be Muslim or Hindu.",
        "Fraud baba",
        "This greedy POS even takes out pacemaker from his deceased patients in pretext of examining the pacemaker for fault, but ends up implanting the same pacemaker to another patient. He knowingly used substandard pacemaker that caused fatality on 2 patients to make profit. For him, his profits were more important than people's life."
    ],
    "cleaned_text": "heartbreaking cardiologist implants lowquality pacemakers soon face trial causing excess mortality thoughts ",
    "cleaned_title": "heartbreaking cardiologist implants lowquality pacemakers soon face trial causing excess mortality",
    "cleaned_selftext": "thoughts",
    "cleaned_comments": "sounds like mass murder bulldozer baba send bulldozer home guys greedy know medical school costlyi personal experience may become apathetic residency risk life quick bucks probably arent going even affect life much neither guy feel fellow humans think save asses man pos guy deserves life sentence read article see much crap low quality pacemakers allowed market first place also find take action supplier low quality pacemakers doctors may involved doctors like every profession humans like humans doctors fair share assholes greedy people aadmi apni mbbs ki fees vasoolne ke liye kya kuch nahi karta bet guy already politics touch like tu jantaa nai mere contacts kaha kaha tak hai defines quality medical implants one ensure best quality find charge allowed low quuality pacemaker also money making depends name normally dont care doctors name mentioned surely muslim article would quoted muslim doctor times irrespective religion charged implanting low quality pacemakers name protected fucking bulldozer need kind local shops sells cutrate pacemakers waitwhats religion bet kuch ni hoga union strong court forgive doc extraordinary service well guess truly heartbreaking seems concerned name whatever may lives impacted get justice shameful ask money quality never compromised patient care first dealer company producing held liable doctors supported low quality pacemaker charged criminal act government allow low quality pace makers looks like loved tax low quality pace makers sorry surname worry doctor enjoy ill gotten wealth thanks legal system doctor code supporting specific theres different types pacemakers one major differences mri safe safe article says low quality actually nri unsafe ones metal person enters mri chamber fatal consequences since mri safe pacemakers costly patients always given option chose two exactly quality type exists exists cheaperinferiorchina version makes much sense thank link within article news mentions name samir sarraf pretty ambiguous muslim hindu fraud baba greedy pos even takes pacemaker deceased patients pretext examining pacemaker fault ends implanting pacemaker another patient knowingly used substandard pacemaker caused fatality patients make profit profits important peoples life",
    "light_cleaned_title": "Heart-breaking: UP Cardiologist implants over 600 \"Low-quality\" pacemakers, soon to face trial for causing \"excess mortality\"",
    "light_cleaned_selftext": "Thoughts ?",
    "light_cleaned_comments": "Sounds like mass murder Will Bulldozer Baba send a bulldozer to his home? Why, just why are these guys so greedy, i know medical school is very costly(I have personal experience) and that he may have become apathetic through his residency but, why risk you life for some quick bucks when they most probably aren’t going to even affect your life that much. Neither can these guy feel for other fellow humans nor can they think to save their own asses. Man what a POS that guy is. He deserves a life sentence and more. Read the article, to see just how much crap he did. But why the low quality pacemakers were allowed in the market in the first place? Should also find and take action against the supplier of these low quality pacemakers as more doctors may be involved. Because doctors like every profession are humans. Like humans, doctors will have fair share of assholes and greedy people. Aadmi apni mbbs ki fees vasoolne ke liye kya kuch nahi karta 😔 I bet that guy is already in politics. No will touch them He be like : tu jantaa nai mere contacts kaha kaha Tak hai What defines quality of medical implants ? How do one ensure best quality? Find and charge who allowed this low quuality pacemaker also. Money making Depends on the name UP being UP I normally don't care for this, but why is the doctor's name not mentioned ? Surely had he been a muslim, the article would have quoted \"muslim doctor\" 10 times. Irrespective of his religion, he is charged with implanting not 1 but 600 low quality pacemakers, why is his name being protected? where is the fucking bulldozer when you need it What kind of local shops sells cut-rate pacemakers?? But wait...what's his religion? Bet. Kuch ni hoga. Union is very strong and court will forgive the doc for extraordinary service. Well, I guess this is truly... heartbreaking Seems you are more concerned about the name whatever it may be. Not the lives impacted or get the justice for them. This is shameful. He should have ask for money but the quality should never be compromised in patient care. First the dealer and the company which is producing it should be held liable to this. Then doctors who supported this low quality pacemaker should be charged under criminal act. Why did the government allow low quality Pace makers? Looks like they loved the tax from low quality Pace makers Sorry, surname too. Not to worry . The doctor will enjoy his ill gotten wealth, thanks to our legal system and the doctor code of supporting each other. To be specific, there's different types of pacemakers, one of the major differences being mri safe and not safe. The article says low quality but these are actually nri unsafe ones because they have metal in them, and if a person enters an mri chamber, can have fatal consequences. Since mri safe pacemakers are costly, patients are always given an option to chose from the two. Its not exactly about quality, it's about the type. If it exists, there exists a cheaper/inferior/china version of it. That makes so much more sense. Thank you The link within the article to news18 mentions the name as Samir Sarraf. Which is pretty ambiguous. Can be Muslim or Hindu. Fraud baba This greedy POS even takes out pacemaker from his deceased patients in pretext of examining the pacemaker for fault, but ends up implanting the same pacemaker to another patient. He knowingly used substandard pacemaker that caused fatality on 2 patients to make profit. For him, his profits were more important than people's life."
}