{
    "id": "13dn3jh",
    "title": "Thrillophilia has been putting us under a lot of stress",
    "url": "https://www.reddit.com/r/india/comments/13dn3jh/thrillophilia_has_been_putting_us_under_a_lot_of/",
    "selftext": "We booked a trip to Malaysia on 13th April 2023. They sent us the flight ticket for domestic flights in Malaysia, but they never sent us anything for international trips. They have been giving various excuses every day since then. I am just tired, and so done with it. I opted for a travel agency to not worry about booking hotels, arranging flights, and e-visa. But I have been regretting ever since I booked through thrillophilia.\n\nThey have lots of advertisements but once you pay your first installment, their tone will change. They will ghost you, give excuses and delay it. I've seen some people getting tickets online at the last moment before their flights. People getting the wrong rooms. I booked the trip after a relative told me it is safe to book through them. I wish I checked on social media before booking.\n\nI am only in touch with 1 travel agent from their agency who has been doing this. He did not send me tickets despite my telling him I need international flight tickets for applying for leave at my office. I have raised a ticket and also complained on [Twitter](https://twitter.com/dr_ouken/status/1656246102344212480?s=20). But I am not sure what to do. There's 1 month left for my trip but I need at least the tickets to apply for leave at my office.\n\n&#x200B;\n\nPlease re-tweet if you are on twitter to help me out. Lastly, I'd recommend never booking through Thrillophilia at least. After this experience, I've also checked other agencies like Thomas cook, etc. They too all have similar tweets/reviews about them. I would advice you to book your own trips. It is not worth this much stress.\n\n&#x200B;\n\nUPDATE - \n\nI posted on LinkedIn as suggested by u/AnInsecureMind. Their co-founder and VP saw my post and it was forwarded to their manager. All of them are personally involved in my case now. \n\nI was assured to be provided with the ticket by tomorrow 11 am. I was told the reason for the delay was some character issues (the name was not fitting in the space provided for the ticket). I was also assured to be provided with a detailed itinerary. They asked me to archive the post and to un-archive it if I am not satisfied. \n\n  \nI didn't see the option so took a screenshot, and then removed the post. I will post again with proof of everything if needed in the future. ",
    "flair": "Rant / Vent",
    "score": 96,
    "num_comments": 23,
    "created_utc": 1683716336.0,
    "convurl": "https://external-preview.redd.it/zQ8qD60tfFZtpLm08wY8X_Yp8RqAew0vrOC4q6cpeX0.jpg?auto=webp&v=enabled&s=d028c63592a68bcc90b0a481dd0007020c9a35b0",
    "comments": [
        "That person is definitely playing with you. Once the tickets are booked, most airlines issue the PNR immediately, while in some cases it takes maximum 24 hours.\n\nIf you paid using a credit card, contact your bank and initiate a dispute under \"Goods/services not received\" clause.\n\nAvoid travel agents like Thrillophilia. If you're not willing to plan the trip by yourself, always let well known agents like MMT take care of it.",
        "I paid using UPI and net banking.   \nHe used a local travel agency or so he said to book the flights. He took money from me and told me it has been booked but kept giving excuses till now whenever I asked to send the tickets.",
        "I am hearing this company's name for the first time. When I saw your post I thought you would have a text body about some thrill seeking syndrome.",
        "Raise it on LinkedIn. That's a lot more effective than Twitter in some cases.",
        "Thank you for this suggestion. I will do it now!",
        "I thought it was a popular company among people who travel. Well, I guess I learned my mistake the hard way. \n\n  \nThomas Cook, Thrillophilia, and Pickyourtrail are some that I thought would be popular among travelers. I didn't opt for Makemytrip because I heard some bad things about it. Now, I think that might have been better.",
        "You should book with local travel agent not these online companies\n\nIt’s not uncommon that these companies hold payment from supplier until 72hrs prior hence they never give pnr",
        "Veena world and kesari are popular these days. \nI booked a europe tour for my mother pre covid. \n\nThomas Cook went bankrupt in 2019 I think. \n\nYou can lodge a police complaint and sue.",
        "Noted and learned the hard way. We had booked through 2 more travel agencies in the past that were online only but had a good experience. It never entered our heads that Thrillophilia could be like this. This is the first and last time.",
        "If it gets too hard for me to actually expect a trip, I am totally suing these people. Thanks for the suggestions with the other travel agencies.",
        ">Veena world and kesari are popular these days\n\nthey are since decades. i remember my parents going via kesari in 1990s",
        "You can still try reaching out to your bank and telling them the service was not received.",
        "THANK YOU AGAIN!\n\nI did just this. Their co-founder and VP saw my post and it was forwarded to their manager. All of them are personally involved in my case now. YOU HELPED ME A LOT!!!\n\nI was assured to be provided with the ticket by tomorrow 11 am. I was told the reason for the delay was some character issues (the name was not fitting in the space provided for the ticket). I was also assured to be provided with a detailed itinerary. They asked me to archive the post and to un-archive it if I am not satisfied.   \nI didn't see the option so took a screenshot, and then removed the post. I will post again with proof of everything if needed in future.",
        "It seems I won't require it anymore. Their VP and co-founder saw my post on linkedin and were about to fire the guy in charge of my trip. I am in contact with 2 more people now that are giving me prompt responses. I expect to get my tickets by 11am tomorrow.",
        "Next time when you are trying to book a trip checkout [https://getaway.pathfndr.io](https://getaway.pathfndr.io) . Checkout the \"Plan a Trip\" option from here.  \n\n\nYou can add your preferred destination, and you preferences and boom. You get a dynamically created trip (using AI of course). You can edit the trip as you want, you change the hotels, flights etc.   \nAnd it is completely bookable in one go.  \n\n\nYou immediately get your Booking confirmation as well.",
        "Thank you. This will help me a lot in the future. I should've done something like this from the start.",
        "I have used Thrillophilia before and here's what I found about their business model. They are basically sales people with few others as point of contact for each region. They connect with local agencies for arranging tours. Normally they post the tentative itinerary before payment but changes do occur after payment. Since their refund policy is shell credit only, pay in installments. \n\nHere's my advice for future travel. \n\nFor consumers, Buy flights/train tickets yourself. Connect with local agencies to understand the rates and possible itinerary. Then book a tour as per convenience (local agencies, mmt, thrillophilia, yatra etc etc)",
        "I'm actually done with these companies now. In future I won't pick a company which doesn't have any office in my own city.\n\nThanks to the LinkedIn post I got my flight ticket.",
        "Name too long is bullshit reason. It’s standard in ALL airlines to truncate the name if its too long. The last 3 chars of my name never get printed on the boarding pass due to lack of space",
        "Could you please mention the other agencies you had a good experience with? Also was this trip with Thrillophilia good, would love to hear your experience. I'm considering them for my upcoming tour.",
        "No, my experience with Thrillophilia was not good. Their agent booked my flight tickets through his family's travel agency. That caused me to not have luggage allowance during my return trip. Thrillophilia only refunded me, that too after approximately 20 days of the incident. They gave up and left me to my own devices during the return trip. I had to pay out of my pocket (extra) to get luggage into the flight. Their manager said that I was to blame because I should not have listened to their employee about booking methods. They also kept changing the people that I had to speak to, so it was very confusing as to whom to contact for what? Their manager Harsh was also very rude. I found out on Linkedin that he transferred out of the company, though. They only listened to me whenever I posted on Linkedin or Twitter. Especially Linkedin had been helpful.\n\nDuring the trip itself, they always argued with me regarding places we had decided to see prior to booking the trip. They also limited the cab ride to 5pm, after which they charged me extra on hourly basis. One of their cab driver did not even know what all things were included in the itinerary.\nOne of the drivers told me that Thrillophilia only contacts the local travel agency overseas and asks them to book a trip. They're just the middle men. It is better to contact local travel agencies directly, as they charge way less than what these companies charge.\nIt was not a good trip if I have to criticize their management side. \n\nI have been sticking to local travel agencies of my city whom I can personally visit to clear up doubts. They don't do this sort of scam and cause you inconvenience.",
        "Curious what was the final update here? Would you ever use them again? Not planning to book a trip but I see some entry tickets for aquarium etc in Singapore via them so wondering.",
        "Hi,so whats the best website to book a tour ? I mean the ones whom u have good experience? Do let me know",
        "I don't have any good experience with any travel company online. All of them have given some issues one way or the other. Thrillophilia stood out the most for me. My better experience has been with local travel companies whom you can visit and sit down to talk face to face to plan your trip.\n\nEven better is that you plan your own trip. It's not actually that hard. You can contact the hotel you're going to stay at to provide transportation. If they don't provide that, you can google to find out how to use the local transport. My relatives recently visited the USA and they planned it entirely by themselves. There were a few times when they missed the bus, but they always ended up getting out of the pinch with some effort. Their trip was very less stressful compared to what thrillophilia made us experience. The only problem is that you have to take your time out to plan such trips.\n\nIf you don't want to plan your trip by yourself, look for local travel companies. If that's not fine for you for any reason, then check out the local travel companies of the places you're trying to visit. Because, the travel companies in our country don't do anything but contact the local travel companies of the respective countries you're trying to visit to plan out your trip."
    ],
    "cleaned_text": "thrillophilia putting us lot stress booked trip malaysia th april sent us flight ticket domestic flights malaysia never sent us anything international trips giving various excuses every day since tired done opted travel agency worry booking hotels arranging flights evisa regretting ever since booked thrillophilia lots advertisements pay first installment tone change ghost give excuses delay ive seen people getting tickets online last moment flights people getting wrong rooms booked trip relative told safe book wish checked social media booking touch travel agent agency send tickets despite telling need international flight tickets applying leave office raised ticket also complained twitterhttpstwittercomdroukenstatuss sure theres month left trip need least tickets apply leave office xb please retweet twitter help lastly id recommend never booking thrillophilia least experience ive also checked agencies like thomas cook etc similar tweetsreviews would advice book trips worth much stress xb update posted linkedin suggested uaninsecuremind cofounder vp saw post forwarded manager personally involved case assured provided ticket tomorrow told reason delay character issues name fitting space provided ticket also assured provided detailed itinerary asked archive post unarchive satisfied didnt see option took screenshot removed post post proof everything needed future ",
    "cleaned_title": "thrillophilia putting us lot stress",
    "cleaned_selftext": "booked trip malaysia th april sent us flight ticket domestic flights malaysia never sent us anything international trips giving various excuses every day since tired done opted travel agency worry booking hotels arranging flights evisa regretting ever since booked thrillophilia lots advertisements pay first installment tone change ghost give excuses delay ive seen people getting tickets online last moment flights people getting wrong rooms booked trip relative told safe book wish checked social media booking touch travel agent agency send tickets despite telling need international flight tickets applying leave office raised ticket also complained twitterhttpstwittercomdroukenstatuss sure theres month left trip need least tickets apply leave office xb please retweet twitter help lastly id recommend never booking thrillophilia least experience ive also checked agencies like thomas cook etc similar tweetsreviews would advice book trips worth much stress xb update posted linkedin suggested uaninsecuremind cofounder vp saw post forwarded manager personally involved case assured provided ticket tomorrow told reason delay character issues name fitting space provided ticket also assured provided detailed itinerary asked archive post unarchive satisfied didnt see option took screenshot removed post post proof everything needed future",
    "cleaned_comments": "person definitely playing tickets booked airlines issue pnr immediately cases takes maximum hours paid using credit card contact bank initiate dispute goodsservices received clause avoid travel agents like thrillophilia youre willing plan trip always let well known agents like mmt take care paid using upi net banking used local travel agency said book flights took money told booked kept giving excuses till whenever asked send tickets hearing companys name first time saw post thought would text body thrill seeking syndrome raise linkedin thats lot effective twitter cases thank suggestion thought popular company among people travel well guess learned mistake hard way thomas cook thrillophilia pickyourtrail thought would popular among travelers didnt opt makemytrip heard bad things think might better book local travel agent online companies uncommon companies hold payment supplier hrs prior hence never give pnr veena world kesari popular days booked europe tour mother pre covid thomas cook went bankrupt think lodge police complaint sue noted learned hard way booked travel agencies past online good experience never entered heads thrillophilia could like first last time gets hard actually expect trip totally suing people thanks suggestions travel agencies veena world kesari popular days since decades remember parents going via kesari still try reaching bank telling service received thank cofounder vp saw post forwarded manager personally involved case helped lot assured provided ticket tomorrow told reason delay character issues name fitting space provided ticket also assured provided detailed itinerary asked archive post unarchive satisfied didnt see option took screenshot removed post post proof everything needed future seems wont require anymore vp cofounder saw post linkedin fire guy charge trip contact people giving prompt responses expect get tickets tomorrow next time trying book trip checkout httpsgetawaypathfndriohttpsgetawaypathfndrio checkout plan trip option add preferred destination preferences boom get dynamically created trip using ai course edit trip want change hotels flights etc completely bookable one go immediately get booking confirmation well thank help lot future shouldve done something like start used thrillophilia heres found business model basically sales people others point contact region connect local agencies arranging tours normally post tentative itinerary payment changes occur payment since refund policy shell credit pay installments heres advice future travel consumers buy flightstrain tickets connect local agencies understand rates possible itinerary book tour per convenience local agencies mmt thrillophilia yatra etc etc im actually done companies future wont pick company doesnt office city thanks linkedin post got flight ticket name long bullshit reason standard airlines truncate name long last chars name never get printed boarding pass due lack space could please mention agencies good experience also trip thrillophilia good would love hear experience im considering upcoming tour experience thrillophilia good agent booked flight tickets familys travel agency caused luggage allowance return trip thrillophilia refunded approximately days incident gave left devices return trip pay pocket extra get luggage flight manager said blame listened employee booking methods also kept changing people speak confusing contact manager harsh also rude found linkedin transferred company though listened whenever posted linkedin twitter especially linkedin helpful trip always argued regarding places decided see prior booking trip also limited cab ride pm charged extra hourly basis one cab driver even know things included itinerary one drivers told thrillophilia contacts local travel agency overseas asks book trip theyre middle men better contact local travel agencies directly charge way less companies charge good trip criticize management side sticking local travel agencies city personally visit clear doubts dont sort scam cause inconvenience curious final update would ever use planning book trip see entry tickets aquarium etc singapore via wondering hiso whats best website book tour mean ones u good experience let know dont good experience travel company online given issues one way thrillophilia stood better experience local travel companies visit sit talk face face plan trip even better plan trip actually hard contact hotel youre going stay provide transportation dont provide google find use local transport relatives recently visited usa planned entirely times missed bus always ended getting pinch effort trip less stressful compared thrillophilia made us experience problem take time plan trips dont want plan trip look local travel companies thats fine reason check local travel companies places youre trying visit travel companies country dont anything contact local travel companies respective countries youre trying visit plan trip",
    "light_cleaned_title": "Thrillophilia has been putting us under a lot of stress",
    "light_cleaned_selftext": "We booked a trip to Malaysia on 13th April 2023. They sent us the flight ticket for domestic flights in Malaysia, but they never sent us anything for international trips. They have been giving various excuses every day since then. I am just tired, and so done with it. I opted for a travel agency to not worry about booking hotels, arranging flights, and e-visa. But I have been regretting ever since I booked through thrillophilia. They have lots of advertisements but once you pay your first installment, their tone will change. They will ghost you, give excuses and delay it. I've seen some people getting tickets online at the last moment before their flights. People getting the wrong rooms. I booked the trip after a relative told me it is safe to book through them. I wish I checked on social media before booking. I am only in touch with 1 travel agent from their agency who has been doing this. He did not send me tickets despite my telling him I need international flight tickets for applying for leave at my office. I have raised a ticket and also complained on [Twitter](https://twitter.com/dr_ouken/status/1656246102344212480?s=20). But I am not sure what to do. There's 1 month left for my trip but I need at least the tickets to apply for leave at my office. &#x200B; Please re-tweet if you are on twitter to help me out. Lastly, I'd recommend never booking through Thrillophilia at least. After this experience, I've also checked other agencies like Thomas cook, etc. They too all have similar tweets/reviews about them. I would advice you to book your own trips. It is not worth this much stress. &#x200B; UPDATE - I posted on LinkedIn as suggested by u/AnInsecureMind. Their co-founder and VP saw my post and it was forwarded to their manager. All of them are personally involved in my case now. I was assured to be provided with the ticket by tomorrow 11 am. I was told the reason for the delay was some character issues (the name was not fitting in the space provided for the ticket). I was also assured to be provided with a detailed itinerary. They asked me to archive the post and to un-archive it if I am not satisfied. I didn't see the option so took a screenshot, and then removed the post. I will post again with proof of everything if needed in the future.",
    "light_cleaned_comments": "That person is definitely playing with you. Once the tickets are booked, most airlines issue the PNR immediately, while in some cases it takes maximum 24 hours. If you paid using a credit card, contact your bank and initiate a dispute under \"Goods/services not received\" clause. Avoid travel agents like Thrillophilia. If you're not willing to plan the trip by yourself, always let well known agents like MMT take care of it. I paid using UPI and net banking. He used a local travel agency or so he said to book the flights. He took money from me and told me it has been booked but kept giving excuses till now whenever I asked to send the tickets. I am hearing this company's name for the first time. When I saw your post I thought you would have a text body about some thrill seeking syndrome. Raise it on LinkedIn. That's a lot more effective than Twitter in some cases. Thank you for this suggestion. I will do it now! I thought it was a popular company among people who travel. Well, I guess I learned my mistake the hard way. Thomas Cook, Thrillophilia, and Pickyourtrail are some that I thought would be popular among travelers. I didn't opt for Makemytrip because I heard some bad things about it. Now, I think that might have been better. You should book with local travel agent not these online companies It’s not uncommon that these companies hold payment from supplier until 72hrs prior hence they never give pnr Veena world and kesari are popular these days. I booked a europe tour for my mother pre covid. Thomas Cook went bankrupt in 2019 I think. You can lodge a police complaint and sue. Noted and learned the hard way. We had booked through 2 more travel agencies in the past that were online only but had a good experience. It never entered our heads that Thrillophilia could be like this. This is the first and last time. If it gets too hard for me to actually expect a trip, I am totally suing these people. Thanks for the suggestions with the other travel agencies. >Veena world and kesari are popular these days they are since decades. i remember my parents going via kesari in 1990s You can still try reaching out to your bank and telling them the service was not received. THANK YOU AGAIN! I did just this. Their co-founder and VP saw my post and it was forwarded to their manager. All of them are personally involved in my case now. YOU HELPED ME A LOT!!! I was assured to be provided with the ticket by tomorrow 11 am. I was told the reason for the delay was some character issues (the name was not fitting in the space provided for the ticket). I was also assured to be provided with a detailed itinerary. They asked me to archive the post and to un-archive it if I am not satisfied. I didn't see the option so took a screenshot, and then removed the post. I will post again with proof of everything if needed in future. It seems I won't require it anymore. Their VP and co-founder saw my post on linkedin and were about to fire the guy in charge of my trip. I am in contact with 2 more people now that are giving me prompt responses. I expect to get my tickets by 11am tomorrow. Next time when you are trying to book a trip checkout [https://getaway.pathfndr.io](https://getaway.pathfndr.io) . Checkout the \"Plan a Trip\" option from here. You can add your preferred destination, and you preferences and boom. You get a dynamically created trip (using AI of course). You can edit the trip as you want, you change the hotels, flights etc. And it is completely bookable in one go. You immediately get your Booking confirmation as well. Thank you. This will help me a lot in the future. I should've done something like this from the start. I have used Thrillophilia before and here's what I found about their business model. They are basically sales people with few others as point of contact for each region. They connect with local agencies for arranging tours. Normally they post the tentative itinerary before payment but changes do occur after payment. Since their refund policy is shell credit only, pay in installments. Here's my advice for future travel. For consumers, Buy flights/train tickets yourself. Connect with local agencies to understand the rates and possible itinerary. Then book a tour as per convenience (local agencies, mmt, thrillophilia, yatra etc etc) I'm actually done with these companies now. In future I won't pick a company which doesn't have any office in my own city. Thanks to the LinkedIn post I got my flight ticket. Name too long is bullshit reason. It’s standard in ALL airlines to truncate the name if its too long. The last 3 chars of my name never get printed on the boarding pass due to lack of space Could you please mention the other agencies you had a good experience with? Also was this trip with Thrillophilia good, would love to hear your experience. I'm considering them for my upcoming tour. No, my experience with Thrillophilia was not good. Their agent booked my flight tickets through his family's travel agency. That caused me to not have luggage allowance during my return trip. Thrillophilia only refunded me, that too after approximately 20 days of the incident. They gave up and left me to my own devices during the return trip. I had to pay out of my pocket (extra) to get luggage into the flight. Their manager said that I was to blame because I should not have listened to their employee about booking methods. They also kept changing the people that I had to speak to, so it was very confusing as to whom to contact for what? Their manager Harsh was also very rude. I found out on Linkedin that he transferred out of the company, though. They only listened to me whenever I posted on Linkedin or Twitter. Especially Linkedin had been helpful. During the trip itself, they always argued with me regarding places we had decided to see prior to booking the trip. They also limited the cab ride to 5pm, after which they charged me extra on hourly basis. One of their cab driver did not even know what all things were included in the itinerary. One of the drivers told me that Thrillophilia only contacts the local travel agency overseas and asks them to book a trip. They're just the middle men. It is better to contact local travel agencies directly, as they charge way less than what these companies charge. It was not a good trip if I have to criticize their management side. I have been sticking to local travel agencies of my city whom I can personally visit to clear up doubts. They don't do this sort of scam and cause you inconvenience. Curious what was the final update here? Would you ever use them again? Not planning to book a trip but I see some entry tickets for aquarium etc in Singapore via them so wondering. Hi,so whats the best website to book a tour ? I mean the ones whom u have good experience? Do let me know I don't have any good experience with any travel company online. All of them have given some issues one way or the other. Thrillophilia stood out the most for me. My better experience has been with local travel companies whom you can visit and sit down to talk face to face to plan your trip. Even better is that you plan your own trip. It's not actually that hard. You can contact the hotel you're going to stay at to provide transportation. If they don't provide that, you can google to find out how to use the local transport. My relatives recently visited the USA and they planned it entirely by themselves. There were a few times when they missed the bus, but they always ended up getting out of the pinch with some effort. Their trip was very less stressful compared to what thrillophilia made us experience. The only problem is that you have to take your time out to plan such trips. If you don't want to plan your trip by yourself, look for local travel companies. If that's not fine for you for any reason, then check out the local travel companies of the places you're trying to visit. Because, the travel companies in our country don't do anything but contact the local travel companies of the respective countries you're trying to visit to plan out your trip."
}