{
    "id": "1cr5qce",
    "title": "Why India's new dietary guidelines limit sugar intake to 5% of daily calories, none for kids under 2.",
    "url": "https://theprint.in/health/why-indias-new-dietary-guidelines-limit-sugar-intake-to-5-of-daily-calories-none-for-kids-under-2/2081156/",
    "selftext": "Looks like recent reports worked ",
    "flair": "Policy/Economy",
    "score": 123,
    "num_comments": 5,
    "created_utc": 1715623008.0,
    "convurl": "https://external-preview.redd.it/5ih49dqDQjipYBWIocPTdPUd4ZsULeE65eivjLK3Vso.jpg?auto=webp&s=bc2d71b49d1feaf5efe589564f1ec1ad8d5d9794",
    "comments": [
        "wdy mean that i can't add 2 spoons of bournvita, one spoon of sugar and 1.5 spoon of nutella in my cold coffee, and that I cant have this concoction 4 times day.\n\nhttps://preview.redd.it/xc9rx0v3o80d1.png?width=268&format=png&auto=webp&s=224ab57a49d87c41715251e7f455ece1fc4eea16",
        "That sounds so tasty.",
        "You do you do man.. looks like you need it",
        "it is, feels like heaven, feels even better if you just use spoon (not mixer or blender) to mix the ingredients with exact 160 seconds (60-80 rpm) which discloses all the sugar, bournvita  and nutella. Gives this sugary bliss an amazing texture.",
        "atleast i am gonna stop snorting lines of powdered sugar. Thanks for the enlightenment OP. (sachh mein thanks, I truly mean it, have to cut down my sugar in all seriousness)",
        "I barely eat sugar on regular basis\n\nSalt is much harder to cut down as everything taste without it \n\nI indulge sweet stuff once a week though",
        "r/UpliftingKhabre",
        "Now to see if people will actually follow those guidelines."
    ],
    "cleaned_text": "indias new dietary guidelines limit sugar intake daily calories none kids looks like recent reports worked ",
    "cleaned_title": "indias new dietary guidelines limit sugar intake daily calories none kids",
    "cleaned_selftext": "looks like recent reports worked",
    "cleaned_comments": "wdy mean cant add spoons bournvita one spoon sugar spoon nutella cold coffee cant concoction times day sounds tasty man looks like need feels like heaven feels even better use spoon mixer blender mix ingredients exact seconds rpm discloses sugar bournvita nutella gives sugary bliss amazing texture atleast gon na stop snorting lines powdered sugar thanks enlightenment op sachh mein thanks truly mean cut sugar seriousness barely eat sugar regular basis salt much harder cut everything taste without indulge sweet stuff week though rupliftingkhabre see people actually follow guidelines",
    "light_cleaned_title": "Why India's new dietary guidelines limit sugar intake to 5% of daily calories, none for kids under 2.",
    "light_cleaned_selftext": "Looks like recent reports worked",
    "light_cleaned_comments": "wdy mean that i can't add 2 spoons of bournvita, one spoon of sugar and 1.5 spoon of nutella in my cold coffee, and that I cant have this concoction 4 times day. That sounds so tasty. You do you do man.. looks like you need it it is, feels like heaven, feels even better if you just use spoon (not mixer or blender) to mix the ingredients with exact 160 seconds (60-80 rpm) which discloses all the sugar, bournvita and nutella. Gives this sugary bliss an amazing texture. atleast i am gonna stop snorting lines of powdered sugar. Thanks for the enlightenment OP. (sachh mein thanks, I truly mean it, have to cut down my sugar in all seriousness) I barely eat sugar on regular basis Salt is much harder to cut down as everything taste without it I indulge sweet stuff once a week though r/UpliftingKhabre Now to see if people will actually follow those guidelines."
}