{
    "id": "fctcrj",
    "title": "IFF's counter comments to TRAI on net neutrality enforcement",
    "url": "https://www.reddit.com/r/india/comments/fctcrj/iffs_counter_comments_to_trai_on_net_neutrality/",
    "selftext": "https://preview.redd.it/vl9sny2v2gk41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=850c49910df201d457ac1c8f8b67ff0e469a0c6b\n\n### \n\n### Tl;dr\n\nWe remain deeply committed to net neutrality. On February 13 2020, IFF had already filed its [**main comments**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf) with TRAI on its ongoing consultation on net neutrality enforcement. However, we were troubled by the requests of large industry representatives and especially internet access providers. In essence their recommendations were geared towards acquiring discretion in terms of network management, imprecise monitoring, “light touch” enforcement and discriminatory institutional structures which would translate into limited accountability. IFF has filed [**counter comments**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf) to rebut these proposals and urge Indian authorities to develop strong mechanisms to realise its seminal net neutrality [**amendments**](https://dot.gov.in/sites/default/files/DoT%20Letter%20on%20Net%20Neutrality%20Regulatory%20Framework%20dated%2031%2007%202018_0.pdf?download=1).\n\n### Background\n\nWe were premature in our celebrations folks.\n\nWhile Indian authorities incorporated net neutrality within legal and licensing systems, the actual implementation of the framework remains largely non-existent. To remedy this on January 02 2020, the Telecom Regulatory Authority of India commenced a consultation on the scope of reasonable traffic management practices and a proposed multistakeholder body for net neutrality. The process is meant to define acceptable instances where your internet provider is allowed to block, slow down (throttle) or prioritise certain types of internet traffic. If not carefully crafted, it can lead to wide exceptions and inadvertently leave the net neutrality principle impotent. You can read an explainer drafted by IFF on the specifics of the consultation paper [**here**](https://docs.google.com/document/d/1lWma5roqYKxueely_LwN0zfxyltwnfptsUpet_stjNE/edit).\n\nIFF responded to the consultation on February 13, 2020. You can read the complete version of our submission [**here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf). Alternatively, you can read this [**blog post**](https://internetfreedom.in/on-valentines-we-send-a-love-letter-for-net-neutrality-to-trai-savetheinternet/) where we have summarised the main issues addressed by our main comments. Put briefly, our recommendations advocate for:\n\n* **Limiting scope for discretion** which prevents your internet provider from practicing class-based discimination between different types of traffic;\n* Creating frameworks which are immediately implementable and **avoiding a “wait and watch” approach** which lets telecom providers off the hook;\n* Creating **holistic disclosure frameworks** to hold internet providers accountable;\n* TRAI to **embrace technical and crowd-sourced monitoring tools** to develop comprehensive assessment frameworks; and\n* Ensuring that a **multistakeholder body is transparent and inclusive by design** to ensure it does not fall prey to industry capture-- especially telecom capture.\n\n### So what are we responding to?\n\nWe noticed that large industry stakeholders, especially telecom representatives, like **Airtel, Reliance Jio,** **Broadband India Forum** and the **Cellular Operators Association of India** were largely following the same script.\n\nAmong other things they advocated for light touch frameworks; wide exceptions in terms of what is allowed as network management practices; authorities stay away from technical monitoring tools; and a complete rejection for any inclusive multistakeholder body. These stakeholders either advocated for no advisory body or at best one which is skewed in favour of telecom players. They also requested TRAI legitimise rights restricting content filtering tools and invasive techniques to snoop network traffic called deep packet inspections (DPIs). Their arguments ranged from efficient network management to higher quality of service for the end user.\n\nSome players like Airtel even made recommendations which went beyond the scope of this consultation. Specifically, they asked TRAI to consider applying neutrality requirements on players across the internet value chain like Netflix. One could assume that such recommendations are meant to serve as a means to distract the authority from the issue at hand. What was really disturbing is that the basis for most of their submissions were on two particularly unfortunate arguments:\n\n* First, Airtel argued that the net neutrality principle ill-suited in the context of next-generation access technologies like 5G. In fact, they linked the government’s decision to implement the net neutrality principle with future investments in 5G.\n* Second, Airtel argued that current legal systems work well enough since there have been no net neutrality violations in the ecosystem since the amendments. As we mention even in our counter-comments, this is disingenuous at best. IFF has previously written to telecom authorities with its findings on crowd-sourced complaints in which the public apprised us of alleged net neutrality violations. For further texture read these blog posts [**here**](https://internetfreedom.in/what-the-block-our-net-neutrality-rules-require-a-monitoring-and-enforcement-structure/) and [**here**](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/). We have highlighted this in our counter-comments and discussed how the above representations by stakeholders like Airtel are inaccurate.\n\n### What have we said in our counter comments?\n\nMany stakeholders requested TRAI to align its eventual recommendations with the financial and/or economic health of the telecom sector. We have reminded TRAI that another key aspect of internet governance is ensuring the advance of people’s right to receive and impart information, the ability to exchange ideas, and overall diversity and plurality. Keeping this in mind we have, among other things, represented the following points:\n\n* TRAI should **narrow loopholes** like the definition of reasonable traffic management practices and specialised services. This will prevent internet providers from abusing regulatory exceptions to discriminate against certain types of internet traffic to the detriment of internet users.\n* Light touch regulations should be discarded. **Strong enforcement** is needed since telecom operators are acting in this sphere with impunity at this stage.\n* TRAI should **not fall for the 5G red herring** and create wide exceptions in the favour of providers for a technology which is ways away from rollout.\n* **Monitoring and assessment should be done with the help of technical tools** since it can help with objective benchmarking and investigations.\n* TRAI must recommend an i**nclusive multistakeholder body** which prevents industry capture, and helps raise institutional capacity within the state to catch and punish net neutrality violations.\n\nIFF will continue to keep tabs on the situation and will follow up with relevant authorities to realise an equitable internet experience which was promised out of the original net neutrality movement.\n\n### Important Documents\n\n1. Link to IFF’s counter comments to TRAI’s consultation on neutrality ([**click here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf))\n2. Link to IFF’s main submission to TRAI’s consultation on net neutrality ([**click here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf))\n3. Link to TRAI’s Consultation Paper on Traffic Management Practices and a Multi-Stakeholder Body dated 2nd January, 2020 ([**click here**](https://main.trai.gov.in/sites/default/files/CP_02012020_0.pdf))\n4. Link to our 6 page summary of TRAI’s consultation paper ([**click here**](https://docs.google.com/document/d/1lWma5roqYKxueely_LwN0zfxyltwnfptsUpet_stjNE/edit))\n\n**The Avengers had to team up to defeat Thanos. The same goes for us if we have to compete with the powerful telecom lobbies and #SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 22,
    "num_comments": 0,
    "created_utc": 1583235657,
    "convurl": "https://b.thumbs.redditmedia.com/WcLSfpDfN9PAyUia8GLef8V66FHwW7kyiPK3lHRdizw.jpg",
    "comments": [],
    "cleaned_text": "iffs counter comments trai net neutrality enforcement tldr remain deeply committed net neutrality february iff already filed main commentshttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf trai ongoing consultation net neutrality enforcement however troubled requests large industry representatives especially internet access providers essence recommendations geared towards acquiring discretion terms network management imprecise monitoring light touch enforcement discriminatory institutional structures would translate limited accountability iff filed counter commentshttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf rebut proposals urge indian authorities develop strong mechanisms realise seminal net neutrality amendmentshttpsdotgovinsitesdefaultfilesdotletteronnetneutralityregulatoryframeworkdatedpdfdownload background premature celebrations folks indian authorities incorporated net neutrality within legal licensing systems actual implementation framework remains largely nonexistent remedy january telecom regulatory authority india commenced consultation scope reasonable traffic management practices proposed multistakeholder body net neutrality process meant define acceptable instances internet provider allowed block slow throttle prioritise certain types internet traffic carefully crafted lead wide exceptions inadvertently leave net neutrality principle impotent read explainer drafted iff specifics consultation paper herehttpsdocsgooglecomdocumentdlwmaroqykxueelylwnzfxyltwnfptsupetstjneedit iff responded consultation february read complete version submission herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf alternatively read blog posthttpsinternetfreedominonvalentineswesendaloveletterfornetneutralitytotraisavetheinternet summarised main issues addressed main comments put briefly recommendations advocate limiting scope discretion prevents internet provider practicing classbased discimination different types traffic creating frameworks immediately implementable avoiding wait watch approach lets telecom providers hook creating holistic disclosure frameworks hold internet providers accountable trai embrace technical crowdsourced monitoring tools develop comprehensive assessment frameworks ensuring multistakeholder body transparent inclusive design ensure fall prey industry capture especially telecom capture responding noticed large industry stakeholders especially telecom representatives like airtel reliance jio broadband india forum cellular operators association india largely following script among things advocated light touch frameworks wide exceptions terms allowed network management practices authorities stay away technical monitoring tools complete rejection inclusive multistakeholder body stakeholders either advocated advisory body best one skewed favour telecom players also requested trai legitimise rights restricting content filtering tools invasive techniques snoop network traffic called deep packet inspections dpis arguments ranged efficient network management higher quality service end user players like airtel even made recommendations went beyond scope consultation specifically asked trai consider applying neutrality requirements players across internet value chain like netflix one could assume recommendations meant serve means distract authority issue hand really disturbing basis submissions two particularly unfortunate arguments first airtel argued net neutrality principle illsuited context nextgeneration access technologies like g fact linked governments decision implement net neutrality principle future investments g second airtel argued current legal systems work well enough since net neutrality violations ecosystem since amendments mention even countercomments disingenuous best iff previously written telecom authorities findings crowdsourced complaints public apprised us alleged net neutrality violations texture read blog posts herehttpsinternetfreedominwhattheblockournetneutralityrulesrequireamonitoringandenforcementstructure herehttpsinternetfreedominnetneutralityinindianeedstofinditsbearings highlighted countercomments discussed representations stakeholders like airtel inaccurate said counter comments many stakeholders requested trai align eventual recommendations financial andor economic health telecom sector reminded trai another key aspect internet governance ensuring advance peoples right receive impart information ability exchange ideas overall diversity plurality keeping mind among things represented following points trai narrow loopholes like definition reasonable traffic management practices specialised services prevent internet providers abusing regulatory exceptions discriminate certain types internet traffic detriment internet users light touch regulations discarded strong enforcement needed since telecom operators acting sphere impunity stage trai fall g red herring create wide exceptions favour providers technology ways away rollout monitoring assessment done help technical tools since help objective benchmarking investigations trai must recommend inclusive multistakeholder body prevents industry capture helps raise institutional capacity within state catch punish net neutrality violations iff continue keep tabs situation follow relevant authorities realise equitable internet experience promised original net neutrality movement important documents link iffs counter comments trais consultation neutrality click herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf link iffs main submission trais consultation net neutrality click herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf link trais consultation paper traffic management practices multistakeholder body dated nd january click herehttpsmaintraigovinsitesdefaultfilescppdf link page summary trais consultation paper click herehttpsdocsgooglecomdocumentdlwmaroqykxueelylwnzfxyltwnfptsupetstjneedit avengers team defeat thanos goes us compete powerful telecom lobbies savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "iffs counter comments trai net neutrality enforcement",
    "cleaned_selftext": "tldr remain deeply committed net neutrality february iff already filed main commentshttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf trai ongoing consultation net neutrality enforcement however troubled requests large industry representatives especially internet access providers essence recommendations geared towards acquiring discretion terms network management imprecise monitoring light touch enforcement discriminatory institutional structures would translate limited accountability iff filed counter commentshttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf rebut proposals urge indian authorities develop strong mechanisms realise seminal net neutrality amendmentshttpsdotgovinsitesdefaultfilesdotletteronnetneutralityregulatoryframeworkdatedpdfdownload background premature celebrations folks indian authorities incorporated net neutrality within legal licensing systems actual implementation framework remains largely nonexistent remedy january telecom regulatory authority india commenced consultation scope reasonable traffic management practices proposed multistakeholder body net neutrality process meant define acceptable instances internet provider allowed block slow throttle prioritise certain types internet traffic carefully crafted lead wide exceptions inadvertently leave net neutrality principle impotent read explainer drafted iff specifics consultation paper herehttpsdocsgooglecomdocumentdlwmaroqykxueelylwnzfxyltwnfptsupetstjneedit iff responded consultation february read complete version submission herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf alternatively read blog posthttpsinternetfreedominonvalentineswesendaloveletterfornetneutralitytotraisavetheinternet summarised main issues addressed main comments put briefly recommendations advocate limiting scope discretion prevents internet provider practicing classbased discimination different types traffic creating frameworks immediately implementable avoiding wait watch approach lets telecom providers hook creating holistic disclosure frameworks hold internet providers accountable trai embrace technical crowdsourced monitoring tools develop comprehensive assessment frameworks ensuring multistakeholder body transparent inclusive design ensure fall prey industry capture especially telecom capture responding noticed large industry stakeholders especially telecom representatives like airtel reliance jio broadband india forum cellular operators association india largely following script among things advocated light touch frameworks wide exceptions terms allowed network management practices authorities stay away technical monitoring tools complete rejection inclusive multistakeholder body stakeholders either advocated advisory body best one skewed favour telecom players also requested trai legitimise rights restricting content filtering tools invasive techniques snoop network traffic called deep packet inspections dpis arguments ranged efficient network management higher quality service end user players like airtel even made recommendations went beyond scope consultation specifically asked trai consider applying neutrality requirements players across internet value chain like netflix one could assume recommendations meant serve means distract authority issue hand really disturbing basis submissions two particularly unfortunate arguments first airtel argued net neutrality principle illsuited context nextgeneration access technologies like g fact linked governments decision implement net neutrality principle future investments g second airtel argued current legal systems work well enough since net neutrality violations ecosystem since amendments mention even countercomments disingenuous best iff previously written telecom authorities findings crowdsourced complaints public apprised us alleged net neutrality violations texture read blog posts herehttpsinternetfreedominwhattheblockournetneutralityrulesrequireamonitoringandenforcementstructure herehttpsinternetfreedominnetneutralityinindianeedstofinditsbearings highlighted countercomments discussed representations stakeholders like airtel inaccurate said counter comments many stakeholders requested trai align eventual recommendations financial andor economic health telecom sector reminded trai another key aspect internet governance ensuring advance peoples right receive impart information ability exchange ideas overall diversity plurality keeping mind among things represented following points trai narrow loopholes like definition reasonable traffic management practices specialised services prevent internet providers abusing regulatory exceptions discriminate certain types internet traffic detriment internet users light touch regulations discarded strong enforcement needed since telecom operators acting sphere impunity stage trai fall g red herring create wide exceptions favour providers technology ways away rollout monitoring assessment done help technical tools since help objective benchmarking investigations trai must recommend inclusive multistakeholder body prevents industry capture helps raise institutional capacity within state catch punish net neutrality violations iff continue keep tabs situation follow relevant authorities realise equitable internet experience promised original net neutrality movement important documents link iffs counter comments trais consultation neutrality click herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf link iffs main submission trais consultation net neutrality click herehttpsmaintraigovinsitesdefaultfilesinternetfreedomfoundationpdf link trais consultation paper traffic management practices multistakeholder body dated nd january click herehttpsmaintraigovinsitesdefaultfilescppdf link page summary trais consultation paper click herehttpsdocsgooglecomdocumentdlwmaroqykxueelylwnzfxyltwnfptsupetstjneedit avengers team defeat thanos goes us compete powerful telecom lobbies savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF's counter comments to TRAI on net neutrality enforcement",
    "light_cleaned_selftext": "### ### Tl;dr We remain deeply committed to net neutrality. On February 13 2020, IFF had already filed its [**main comments**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf) with TRAI on its ongoing consultation on net neutrality enforcement. However, we were troubled by the requests of large industry representatives and especially internet access providers. In essence their recommendations were geared towards acquiring discretion in terms of network management, imprecise monitoring, “light touch” enforcement and discriminatory institutional structures which would translate into limited accountability. IFF has filed [**counter comments**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf) to rebut these proposals and urge Indian authorities to develop strong mechanisms to realise its seminal net neutrality [**amendments**](https://dot.gov.in/sites/default/files/DoT%20Letter%20on%20Net%20Neutrality%20Regulatory%20Framework%20dated%2031%2007%202018_0.pdf?download=1). ### Background We were premature in our celebrations folks. While Indian authorities incorporated net neutrality within legal and licensing systems, the actual implementation of the framework remains largely non-existent. To remedy this on January 02 2020, the Telecom Regulatory Authority of India commenced a consultation on the scope of reasonable traffic management practices and a proposed multistakeholder body for net neutrality. The process is meant to define acceptable instances where your internet provider is allowed to block, slow down (throttle) or prioritise certain types of internet traffic. If not carefully crafted, it can lead to wide exceptions and inadvertently leave the net neutrality principle impotent. You can read an explainer drafted by IFF on the specifics of the consultation paper [**here**](https://docs.google.com/document/d/1lWma5roqYKxueely_LwN0zfxyltwnfptsUpet_stjNE/edit). IFF responded to the consultation on February 13, 2020. You can read the complete version of our submission [**here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf). Alternatively, you can read this [**blog post**](https://internetfreedom.in/on-valentines-we-send-a-love-letter-for-net-neutrality-to-trai-savetheinternet/) where we have summarised the main issues addressed by our main comments. Put briefly, our recommendations advocate for: * **Limiting scope for discretion** which prevents your internet provider from practicing class-based discimination between different types of traffic; * Creating frameworks which are immediately implementable and **avoiding a “wait and watch” approach** which lets telecom providers off the hook; * Creating **holistic disclosure frameworks** to hold internet providers accountable; * TRAI to **embrace technical and crowd-sourced monitoring tools** to develop comprehensive assessment frameworks; and * Ensuring that a **multistakeholder body is transparent and inclusive by design** to ensure it does not fall prey to industry capture-- especially telecom capture. ### So what are we responding to? We noticed that large industry stakeholders, especially telecom representatives, like **Airtel, Reliance Jio,** **Broadband India Forum** and the **Cellular Operators Association of India** were largely following the same script. Among other things they advocated for light touch frameworks; wide exceptions in terms of what is allowed as network management practices; authorities stay away from technical monitoring tools; and a complete rejection for any inclusive multistakeholder body. These stakeholders either advocated for no advisory body or at best one which is skewed in favour of telecom players. They also requested TRAI legitimise rights restricting content filtering tools and invasive techniques to snoop network traffic called deep packet inspections (DPIs). Their arguments ranged from efficient network management to higher quality of service for the end user. Some players like Airtel even made recommendations which went beyond the scope of this consultation. Specifically, they asked TRAI to consider applying neutrality requirements on players across the internet value chain like Netflix. One could assume that such recommendations are meant to serve as a means to distract the authority from the issue at hand. What was really disturbing is that the basis for most of their submissions were on two particularly unfortunate arguments: * First, Airtel argued that the net neutrality principle ill-suited in the context of next-generation access technologies like 5G. In fact, they linked the government’s decision to implement the net neutrality principle with future investments in 5G. * Second, Airtel argued that current legal systems work well enough since there have been no net neutrality violations in the ecosystem since the amendments. As we mention even in our counter-comments, this is disingenuous at best. IFF has previously written to telecom authorities with its findings on crowd-sourced complaints in which the public apprised us of alleged net neutrality violations. For further texture read these blog posts [**here**](https://internetfreedom.in/what-the-block-our-net-neutrality-rules-require-a-monitoring-and-enforcement-structure/) and [**here**](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/). We have highlighted this in our counter-comments and discussed how the above representations by stakeholders like Airtel are inaccurate. ### What have we said in our counter comments? Many stakeholders requested TRAI to align its eventual recommendations with the financial and/or economic health of the telecom sector. We have reminded TRAI that another key aspect of internet governance is ensuring the advance of people’s right to receive and impart information, the ability to exchange ideas, and overall diversity and plurality. Keeping this in mind we have, among other things, represented the following points: * TRAI should **narrow loopholes** like the definition of reasonable traffic management practices and specialised services. This will prevent internet providers from abusing regulatory exceptions to discriminate against certain types of internet traffic to the detriment of internet users. * Light touch regulations should be discarded. **Strong enforcement** is needed since telecom operators are acting in this sphere with impunity at this stage. * TRAI should **not fall for the 5G red herring** and create wide exceptions in the favour of providers for a technology which is ways away from rollout. * **Monitoring and assessment should be done with the help of technical tools** since it can help with objective benchmarking and investigations. * TRAI must recommend an i**nclusive multistakeholder body** which prevents industry capture, and helps raise institutional capacity within the state to catch and punish net neutrality violations. IFF will continue to keep tabs on the situation and will follow up with relevant authorities to realise an equitable internet experience which was promised out of the original net neutrality movement. ### Important Documents 1. Link to IFF’s counter comments to TRAI’s consultation on neutrality ([**click here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf)) 2. Link to IFF’s main submission to TRAI’s consultation on net neutrality ([**click here**](https://main.trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf)) 3. Link to TRAI’s Consultation Paper on Traffic Management Practices and a Multi-Stakeholder Body dated 2nd January, 2020 ([**click here**](https://main.trai.gov.in/sites/default/files/CP_02012020_0.pdf)) 4. Link to our 6 page summary of TRAI’s consultation paper ([**click here**](https://docs.google.com/document/d/1lWma5roqYKxueely_LwN0zfxyltwnfptsUpet_stjNE/edit)) **The Avengers had to team up to defeat Thanos. The same goes for us if we have to compete with the powerful telecom lobbies and #SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": ""
}