{
    "id": "15m8jtn",
    "title": "Is this the india we want to show ??",
    "url": "https://i.redd.it/kgvtvb2gi1hb1.png",
    "selftext": "Humko toh Seema ke baare mai dekhna hai, what a shameful event 😓😞\n\nhttps://www.google.com/amp/s/www.timesnownews.com/india/minor-gives-birth-after-rape-gets-gang-raped-again-at-rajasthan-hospital-article-102537403/amp",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691567436.0,
    "convurl": "https://i.redd.it/kgvtvb2gi1hb1.png",
    "comments": [
        "r/awfuleverything",
        "Oh it's the BIMARUs once again.",
        "If this was done by a Muslim would you say it's the Muslims again?",
        "Well it is the India there is",
        "I need a ticket to Moon or Mars 😞",
        "Can I live rent free in your head like Muslims do?\n\nCost of living has gone up quite a bit.",
        "Yes",
        "By looking at government's approach towards this type of issues. Criminals are feeling they will roam free after crime. Government should take some steps which will create fear in potential criminal's mind before doing any crime.",
        "Ofc BIMA RU.... duh",
        "All educated professionals are leaving India at a record pace.",
        "as they should",
        "Why're you asking us? We aint doing it",
        "Yes",
        "Don't you people have anything else in your donkey brain beside h-i-ndo-o & m-o-slim. It's like you consume it 24/7. That's why it called BIMARU , now also include H to that category BIMAHRU."
    ],
    "cleaned_text": "india want show humko toh seema ke baare mai dekhna hai shameful event ",
    "cleaned_title": "india want show",
    "cleaned_selftext": "humko toh seema ke baare mai dekhna hai shameful event",
    "cleaned_comments": "rawfuleverything oh bimarus done muslim would say muslims well india need ticket moon mars live rent free head like muslims cost living gone quite bit yes looking governments approach towards type issues criminals feeling roam free crime government take steps create fear potential criminals mind crime ofc bima ru duh educated professionals leaving india record pace whyre asking us aint yes dont people anything else donkey brain beside hindoo moslim like consume thats called bimaru also include h category bimahru",
    "light_cleaned_title": "Is this the india we want to show ??",
    "light_cleaned_selftext": "Humko toh Seema ke baare mai dekhna hai, what a shameful event 😓😞",
    "light_cleaned_comments": "r/awfuleverything Oh it's the BIMARUs once again. If this was done by a Muslim would you say it's the Muslims again? Well it is the India there is I need a ticket to Moon or Mars 😞 Can I live rent free in your head like Muslims do? Cost of living has gone up quite a bit. Yes By looking at government's approach towards this type of issues. Criminals are feeling they will roam free after crime. Government should take some steps which will create fear in potential criminal's mind before doing any crime. Ofc BIMA RU.... duh All educated professionals are leaving India at a record pace. as they should Why're you asking us? We aint doing it Yes Don't you people have anything else in your donkey brain beside h-i-ndo-o & m-o-slim. It's like you consume it 24/7. That's why it called BIMARU , now also include H to that category BIMAHRU."
}