{
    "id": "168sape",
    "title": "Is Applecare+ this a daylight robbery?",
    "url": "https://www.reddit.com/r/india/comments/168sape/is_applecare_this_a_daylight_robbery/",
    "selftext": "Isn't we are already paying the 24000 for the AppleCare+ , then what the point of paying for repair on top of it.  25900 Rs. for other damage , wtf!!!. The very reason we are buying there insurance is save ourself from the high repair cost. But it doesn't seem like the case. Please correct me if I misinterpret something.\n\n[https://www.apple.com/in/support/products/mac/#:\\~:text=Apple%20USB%20SuperDrive-,Unlimited%20incidents%20of%20accidental%20damage%20protection%2C%20each%20subject%20to%20a,25900%20for%20other%20accidental%20damage](https://www.apple.com/in/support/products/mac/#:~:text=Apple%20USB%20SuperDrive-,Unlimited%20incidents%20of%20accidental%20damage%20protection%2C%20each%20subject%20to%20a,25900%20for%20other%20accidental%20damage)\n\n[Applecare india](https://preview.redd.it/3xldawarb0mb1.png?width=1018&format=png&auto=webp&s=ee7baabb16b5405ce239254ed92529030d13bd52)\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693732507.0,
    "convurl": "https://external-preview.redd.it/WGsh1KENJ8lzwcTYp29QYkHp0-7lJdjHZkWukU6TUNU.jpg?auto=webp&s=0afa9b7a316a31d7eb58ccd6b5ab49b6eea07d66",
    "comments": [
        "Also does those so called \"Apple genius\" come to our location for the repair?",
        "This is because apple themselves have no confidence in their products.",
        "Seem like that is the case",
        "that's what you get for buying apple products\n\nhttps://preview.redd.it/x6ui0398v1mb1.jpeg?width=680&format=pjpg&auto=webp&s=d3a7fbb61ca922295e3dba02c88401ecbfddb4a7",
        "I don't think they have any tie ups with Zomato or Swiggy:)\n\nApple products are top of the line & everything about their purchase/ownership & maintenance is expensive.\n\nAlso, I don't believe the strength of our currency helps much when it comes to product/servicing pricing as set by Apple.",
        "But it’s for 3 years accidental damage, plus free battery replacement, all on site repair, screen damage is ₹8000. Still I agree, price is high.",
        "In accidental damage they must have included keyboard in it, and that 25000. Last time when I was cleaning my apple magic keyboard with isopropyl alcohol some goes in one button and it stop working, imagine this happening  to your MacBook pro keyboard 😥, also since I live in remote location visiting apple store itself will cost 3000-4000 rs",
        "Dell and Lenovo one comes to customer location",
        "Stop buying Apple products ffs"
    ],
    "cleaned_text": "applecare daylight robbery isnt already paying applecare point paying repair top rs damage wtf reason buying insurance save ourself high repair cost doesnt seem like case please correct misinterpret something httpswwwapplecominsupportproductsmactextappleusbsuperdriveunlimitedincidentsofaccidentaldamageprotectionceachsubjecttoaforotheraccidentaldamagehttpswwwapplecominsupportproductsmactextappleusbsuperdriveunlimitedincidentsofaccidentaldamageprotectionceachsubjecttoaforotheraccidentaldamage applecare indiahttpspreviewredditxldawarbmbpngwidthformatpngautowebpseebaabbbceeddbd xb ",
    "cleaned_title": "applecare daylight robbery",
    "cleaned_selftext": "isnt already paying applecare point paying repair top rs damage wtf reason buying insurance save ourself high repair cost doesnt seem like case please correct misinterpret something httpswwwapplecominsupportproductsmactextappleusbsuperdriveunlimitedincidentsofaccidentaldamageprotectionceachsubjecttoaforotheraccidentaldamagehttpswwwapplecominsupportproductsmactextappleusbsuperdriveunlimitedincidentsofaccidentaldamageprotectionceachsubjecttoaforotheraccidentaldamage applecare indiahttpspreviewredditxldawarbmbpngwidthformatpngautowebpseebaabbbceeddbd xb",
    "cleaned_comments": "also called apple genius come location repair apple confidence products seem like case thats get buying apple products dont think tie ups zomato swiggy apple products top line everything purchaseownership maintenance expensive also dont believe strength currency helps much comes productservicing pricing set apple years accidental damage plus free battery replacement site repair screen damage still agree price high accidental damage must included keyboard last time cleaning apple magic keyboard isopropyl alcohol goes one button stop working imagine happening macbook pro keyboard also since live remote location visiting apple store cost rs dell lenovo one comes customer location stop buying apple products ffs",
    "light_cleaned_title": "Is Applecare+ this a daylight robbery?",
    "light_cleaned_selftext": "Isn't we are already paying the 24000 for the AppleCare+ , then what the point of paying for repair on top of it. 25900 Rs. for other damage , wtf!!!. The very reason we are buying there insurance is save ourself from the high repair cost. But it doesn't seem like the case. Please correct me if I misinterpret something. [https://www.apple.com/in/support/products/mac/#:\\~:text=Apple%20USB%20SuperDrive-,Unlimited%20incidents%20of%20accidental%20damage%20protection%2C%20each%20subject%20to%20a,25900%20for%20other%20accidental%20damage](https://www.apple.com/in/support/products/mac/#:~:text=Apple%20USB%20SuperDrive-,Unlimited%20incidents%20of%20accidental%20damage%20protection%2C%20each%20subject%20to%20a,25900%20for%20other%20accidental%20damage) [Applecare india](https://preview.redd.it/3xldawarb0mb1.png?width=1018&format=png&auto=webp&s=ee7baabb16b5405ce239254ed92529030d13bd52) &#x200B;",
    "light_cleaned_comments": "Also does those so called \"Apple genius\" come to our location for the repair? This is because apple themselves have no confidence in their products. Seem like that is the case that's what you get for buying apple products I don't think they have any tie ups with Zomato or Swiggy:) Apple products are top of the line & everything about their purchase/ownership & maintenance is expensive. Also, I don't believe the strength of our currency helps much when it comes to product/servicing pricing as set by Apple. But it’s for 3 years accidental damage, plus free battery replacement, all on site repair, screen damage is ₹8000. Still I agree, price is high. In accidental damage they must have included keyboard in it, and that 25000. Last time when I was cleaning my apple magic keyboard with isopropyl alcohol some goes in one button and it stop working, imagine this happening to your MacBook pro keyboard 😥, also since I live in remote location visiting apple store itself will cost 3000-4000 rs Dell and Lenovo one comes to customer location Stop buying Apple products ffs"
}