{
    "id": "1dnbfid",
    "title": "Chilli In Eyes, Tortured For A Week: Horror For Tribal Woman In Telangana",
    "url": "https://www.reddit.com/r/india/comments/1dnbfid/chilli_in_eyes_tortured_for_a_week_horror_for/",
    "selftext": "So there are two news reports about this incident. One says it's about return of money(ToI) and other refusal to work in the field(NDTV/Uma Sudhir). \n\n1. Telangana: Tribal woman abducted, tortured for 12 days after refusal to work in fields - https://timesofindia.indiatimes.com/city/hyderabad/telangana-tribal-woman-abducted-tortured-for-12-days-after-refusal-to-work-in-fields/articleshow/111181100.cms\n\n2. Chilli In Eyes, Tortured For A Week: Horror For Tribal Woman In Telangana - https://www.ndtv.com/south/telangana-tribal-woman-kicked-slapped-stomped-on-in-money-dispute-5958624",
    "flair": "Crime",
    "score": 196,
    "num_comments": 11,
    "created_utc": 1719229319,
    "convurl": "https://external-preview.redd.it/cRXQKPWu9bMquwr8Qj3y03rOWtIExHf4MDzP03duqtk.jpg?auto=webp&s=d30417bcb76305f58bc15629169ea41c70939ef3",
    "comments": [
        "Psychopaths with a religious text.",
        "> Confined in the house for 12 days and tortured by her own family members \n\nThis seems to be something else",
        "religion is one of the worst inventions ever",
        "This should be an eye opener for all the fortunate and privileged folks who at every opportunity raise their voice against reservation. This is the sad reality of people who don’t have access to resources most people take for granted wake up and see the truth and the next time you want to join up in any stupid uproar think 10 times.",
        "But vro what about my st friend who has 20 BMWs and 25 factories?",
        "Means the selection criteria needs to be adjusted, not that the concept itself should be scrapped.",
        "Dude come on that was the most obvious sarcasm",
        "A. We have punctuation for that /s\n\nB. There are numerous people who consistently use this argument",
        "Having reservations will help uplift the population and this will empower the affected folks to push for legal action and fight back.\n \nBut it cannot be the solution. Strict law enforcement must happen for any hate crimes and crimes against humans. Punishments must be severe. Upliftment should not be a requirement to get justice.",
        "The argument isn't wrong. A guy with reservation I know has both his uncles in IAS, his father is a high ranking government official, both him and his brother got into old IITs, and now they both are IAS officers. \n\n\nAll credit to him and his family, but they have clearly reached the upper stratus of Indian society. And this pattern I see repeatedly, because people who get uplifted are now in a position to send their children to top class schools and coaching centers to repeat the cycle.\n\n\nWhen will the downtrodden people be able to make use of these benefits in a larger scale? Social and economic mobility is very poor in India, and reservations as they are implemented today are not contributing to it. Why not put a 5 LPA income limit?",
        "What will reservation do? There are laws available for protection of sc st. If you want to give reservation give it on basis of ews status maybe add a new layer of extreme poverty that will actually help those who need it"
    ],
    "cleaned_text": "chilli eyes tortured week horror tribal woman telangana two news reports incident one says return moneytoi refusal work fieldndtvuma sudhir telangana tribal woman abducted tortured days refusal work fields chilli eyes tortured week horror tribal woman telangana ",
    "cleaned_title": "chilli eyes tortured week horror tribal woman telangana",
    "cleaned_selftext": "two news reports incident one says return moneytoi refusal work fieldndtvuma sudhir telangana tribal woman abducted tortured days refusal work fields chilli eyes tortured week horror tribal woman telangana",
    "cleaned_comments": "psychopaths religious text confined house days tortured family members seems something else religion one worst inventions ever eye opener fortunate privileged folks every opportunity raise voice reservation sad reality people dont access resources people take granted wake see truth next time want join stupid uproar think times vro st friend bmws factories means selection criteria needs adjusted concept scrapped dude come obvious sarcasm punctuation b numerous people consistently use argument reservations help uplift population empower affected folks push legal action fight back solution strict law enforcement must happen hate crimes crimes humans punishments must severe upliftment requirement get justice argument isnt wrong guy reservation know uncles ias father high ranking government official brother got old iits ias officers credit family clearly reached upper stratus indian society pattern see repeatedly people get uplifted position send children top class schools coaching centers repeat cycle downtrodden people able make use benefits larger scale social economic mobility poor india reservations implemented today contributing put lpa income limit reservation laws available protection sc st want give reservation give basis ews status maybe add new layer extreme poverty actually help need",
    "light_cleaned_title": "Chilli In Eyes, Tortured For A Week: Horror For Tribal Woman In Telangana",
    "light_cleaned_selftext": "So there are two news reports about this incident. One says it's about return of money(ToI) and other refusal to work in the field(NDTV/Uma Sudhir). 1. Telangana: Tribal woman abducted, tortured for 12 days after refusal to work in fields - 2. Chilli In Eyes, Tortured For A Week: Horror For Tribal Woman In Telangana -",
    "light_cleaned_comments": "Psychopaths with a religious text. > Confined in the house for 12 days and tortured by her own family members This seems to be something else religion is one of the worst inventions ever This should be an eye opener for all the fortunate and privileged folks who at every opportunity raise their voice against reservation. This is the sad reality of people who don’t have access to resources most people take for granted wake up and see the truth and the next time you want to join up in any stupid uproar think 10 times. But vro what about my st friend who has 20 BMWs and 25 factories? Means the selection criteria needs to be adjusted, not that the concept itself should be scrapped. Dude come on that was the most obvious sarcasm A. We have punctuation for that /s B. There are numerous people who consistently use this argument Having reservations will help uplift the population and this will empower the affected folks to push for legal action and fight back. But it cannot be the solution. Strict law enforcement must happen for any hate crimes and crimes against humans. Punishments must be severe. Upliftment should not be a requirement to get justice. The argument isn't wrong. A guy with reservation I know has both his uncles in IAS, his father is a high ranking government official, both him and his brother got into old IITs, and now they both are IAS officers. All credit to him and his family, but they have clearly reached the upper stratus of Indian society. And this pattern I see repeatedly, because people who get uplifted are now in a position to send their children to top class schools and coaching centers to repeat the cycle. When will the downtrodden people be able to make use of these benefits in a larger scale? Social and economic mobility is very poor in India, and reservations as they are implemented today are not contributing to it. Why not put a 5 LPA income limit? What will reservation do? There are laws available for protection of sc st. If you want to give reservation give it on basis of ews status maybe add a new layer of extreme poverty that will actually help those who need it"
}