{
    "id": "1dvzehb",
    "title": "CCTV captures 'Nihang Sikhs' attacking descendant of martyr Sukhdev Thapar in Ludhiana",
    "url": "https://www.indiatoday.in/india/story/shiv-sena-punjab-leader-sandeep-thapar-gora-attacked-men-dressed-nihangs-ludhiana-2562776-2024-07-05",
    "selftext": "Victim (also Shiv Sena Punjab leader) Sandeep Thapar Gora was brutally attacked with swords by two men dressed as Nihang Sikhs in Ludhiana. Sandeep Thapar has been admitted to the district hospital in a critical condition.\n",
    "flair": "Crime",
    "score": 7,
    "num_comments": 3,
    "created_utc": 1720189985.0,
    "convurl": "https://external-preview.redd.it/DZmCG59A4Bwr_utEAEQQJ0iKmfpzmvdWDglhOaXcZfc.jpg?auto=webp&s=56e46df2d2ac31f4ca58bc30bd832bd79a7cee34",
    "comments": [
        "no one is safe in this country…",
        "This headline is incorrect, when Sukhdev Thapar's descendents have already told a journalist that they have absolutely no links with the guy who was attacked. Reporting it for misinformation"
    ],
    "cleaned_text": "cctv captures nihang sikhs attacking descendant martyr sukhdev thapar ludhiana victim also shiv sena punjab leader sandeep thapar gora brutally attacked swords two men dressed nihang sikhs ludhiana sandeep thapar admitted district hospital critical condition ",
    "cleaned_title": "cctv captures nihang sikhs attacking descendant martyr sukhdev thapar ludhiana",
    "cleaned_selftext": "victim also shiv sena punjab leader sandeep thapar gora brutally attacked swords two men dressed nihang sikhs ludhiana sandeep thapar admitted district hospital critical condition",
    "cleaned_comments": "one safe country headline incorrect sukhdev thapars descendents already told journalist absolutely links guy attacked reporting misinformation",
    "light_cleaned_title": "CCTV captures 'Nihang Sikhs' attacking descendant of martyr Sukhdev Thapar in Ludhiana",
    "light_cleaned_selftext": "Victim (also Shiv Sena Punjab leader) Sandeep Thapar Gora was brutally attacked with swords by two men dressed as Nihang Sikhs in Ludhiana. Sandeep Thapar has been admitted to the district hospital in a critical condition.",
    "light_cleaned_comments": "no one is safe in this country… This headline is incorrect, when Sukhdev Thapar's descendents have already told a journalist that they have absolutely no links with the guy who was attacked. Reporting it for misinformation"
}