{
    "id": "1gll0he",
    "title": "Like, Share, Prescribe? A comparative analysis of five state-level digital media/influencer policies \n",
    "url": "https://www.reddit.com/r/india/comments/1gll0he/like_share_prescribe_a_comparative_analysis_of/",
    "selftext": "[IFF needs your support now more than ever! Details at the end of the post.](https://preview.redd.it/xq17bernkfzd1.jpg?width=900&format=pjpg&auto=webp&s=28078548ef662d27d7e7afc4a4b584865351bdea)\n\n# Through a rigorous process of research and using the RTI Act we have accessed state-level digital media and influencer-centric policies of various Indian states. In this post, we attempt to critically assess the impact of state-sponsored financial incentives for digital creators and influencers on the right to free speech.Through a rigorous process of research and using the RTI Act we have accessed state-level digital media and influencer-centric policies of various Indian states. In this post, we attempt to critically assess the impact of state-sponsored financial incentives for digital creators and influencers on the right to free speech. \n\n# tl;dr\n\nThe Digital Media Policy, 2024 recently released by the Uttar Pradesh government garnered significant attention but it's not the only one which exists. This post compares and contrasts state-level digital media/influencer-centric policies of five Indian states. State governments as well as the Union government have come up with different variations of the media/ influencer policies to disseminate information about government schemes, welfare benefits, and achievements. We aim to evaluate these policies by examining their transparency, accountability, and impact on fundamental freedoms and rights within the information ecosystem. Additionally, we will consider the effect of the propagation of the government \"schemes and achievements\" through the financial incentivisation of influencers and digital creators\n\n# Important documents\n\n1. IFF’s comparative analysis of 5 state-level digital media//influencer policies ([link](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing))\n2. Uttar Pradesh Digital Media Policy, 2024 ([link](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing))\n3. Haryana Digital Media Advertisement Policy, 2023 ([link](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing))\n4. Karnataka Digital Advertising Guidelines, 2024 ([link](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing))\n5. Punjab Influencer Empanelment Policy, 2023  ([link](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing)**)**\n6. Himachal Pradesh Digital Media Policy, 2024 ([link](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing)) \n\n# Why should you care? \n\nThese policies incentivise influencers to promote state-approved narratives by using public funds. This approach can lead to self-censorship and moral policing, and stifle creativity and free speech while influencing public perceptions of government policies and welfare schemes. This inherently creates an uneven playing field, favouring empanelled influencers over those critical of the government and solely relying on platforms like Meta or YouTube as a source of income. Furthermore, the lack of transparency around paid partnerships means audiences are often unaware that they are consuming government-funded content which limits their capacity to make informed choices. Furthermore, the ambiguous definitions of what constitutes \"objectionable\" content open the door to arbitrary cancellation and legal actions against the empanelled influencers when most of these policies have no redressal system in place to defend against such actions.\n\n\n\n# Background \n\n\n\nOn August 28, 2024, [reports](https://x.com/internetfreedom/status/1828741543403860257) started surfacing about Uttar Pradesh (UP) government introducing a Digital Media Policy, 2024, with speculations that it will offer financial incentives to digital creators/influencers for promoting government schemes, and impose fines on certain objectionable content created by them. Notably, the Policy itself had not been officially placed in the public domain by the UP government but had to be obtained from unofficial channels (the original Hindi policy document is archived [here](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing)). The Policy, as reported, aims at incentivising digital influencers to promote state schemes and achievements on online platforms. This prompted a debate \\[[here](https://www.thequint.com/opinion/up-digital-media-policy-incentivises-content-creators-but-to-what-end#read-more) and [here](https://www.boomlive.in/decode/ups-new-policy-pays-content-creators-big-bucksbut-at-what-cost-26452)\\] regarding its impact on freedom of speech and expression. Following this development and the discourse around it, we attempted to analyse and research the digital media/ influencer policies of four other states namely [Haryana](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing), [Karnataka](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing), [Punjab](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing), and [Himachal](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing) Pradesh. As part of this post, we are releasing a [table](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing) summarising and comparing the policies for the aforementioned 5 states.  \n\n# Uttar Pradesh Digital Media Policy, 2024  [[Link](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing)]\n\n\n\n1. **Stated purpose/aim:** To disseminate information about various developmental, public welfare/beneficial schemes or achievements by the state and the benefits thereof to the people of the state. \n2. **Medium of dissemination:** through digital media platforms and other similar social media platforms.\n3. **Target audience for empanelment/ enlistment:** Digital media handle/page/channel/account holder/operator/ digital media influencers/content writers and related agencies or firms. \n4. **Specified criteria for empanelment**: Applicants must have been in existence for at least two years and must submit their digital media analytics reports from the last six months. Additionally, they are required to provide a self-declaration form asserting that they have no criminal cases against them, as well as another self-declaration form confirming that all information provided for the purpose of listing is true. They must also possess the necessary equipment to produce videos, posts, and other content.\n5. **Payment conditions**: Payments will depend on the number of views and reach to the general public, which will be evaluated on the basis of the metrics provided by the content creators. The content creator will have to assure the state that the views are original through an affidavit. At this stage, no transparency safeguards have been built into the Policy to ensure that creators do not file false affidavits. Limiting the information about which creator/influencer is empanelled/enlisted to the State Government restricts individuals/users or even independent authorities from conducting checks on the authenticity of the creator’s followers/subscribers and content views/engagement. Payment will be done according to the categories (A, B, C, or D), type of content, and platform. For Facebook and Instagram, longer content will get higher payments and additional bonuses for exceeding 1 lakh views. For X, influencers will be paid extra for high engagement. Each category has a maximum monthly expenditure limit for advertisements. \n6. **Grounds for cancellation**: As per the Policy, in case the information provided by the account holder/influencer is found to be incorrect/false, then the empanelment will stand cancelled. Here, it is unclear how the government (or who in the government) will ascertain that the provided information is accurate. If this role is assigned to a person from the UP government, then content produced in favour of the government (even if inaccurate or exaggerated) may be allowed. Similarly, accurate content/information about state-level schemes that do not show the government in a positive light may be falsely considered incorrect/inaccurate and thus may be used as grounds for cancellation of the enlistment contract. No safeguards or checks have been introduced in the Policy (in the form of an independent committee for content review, publication of cancellation order, or appeal/grievance redressal mechanisms for influencers) to ensure that the Policy is not (mis)used by state officials to propagate their preferred narrative online and restrict speech unpalatable to the state government. \n\n [https://x.com/internetfreedom/status/1828741543403860257](https://x.com/internetfreedom/status/1828741543403860257) \n\n# Haryana Digital Media Advertisement Policy, 2023 [[Link](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing)]\n\nThe Haryana Government shared an ‘[Invitation for Empanelment](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view)’ to invite prominent social media channels to participate in the empanelment process under the ‘Haryana Digital Media Advertisement Policy 2023’.\n\n\n\n1. **Stated purpose/aim:** To disseminate information about governmental welfare policies with the aim that it reaches the masses at an optimum level and to regulate such information/advertisement. \n2. **Medium of dissemination:** Through various digital media platforms, including social media news channels, websites, and other reputable channels.\n3. **Target audience for empanelment/ enlistment:** Legal entities owning the social media channels, websites, and reputed social media channels and the individual owners of social media channels, websites, and reputed social media channels. \n4. **Specified criteria for empanelment**: Applicants must have been operating under the same name for at least one year and are required to submit their digital media analytics reports for the last 12 months. They must also provide a self-declaration form asserting that they have never been in dispute, blacklisted, or de-empanelled, along with another self-declaration form confirming that all information provided for the listing is accurate. Additionally, applicants located outside Haryana must include a certificate issued by the Director General of Directorate of Information, Public Relations & Languages, Haryana (“DIPRL”). They must have at least 50,000 followers or subscribers and have posted a minimum of 30 times per month in the six months preceding their application.\n5. **Payment conditions**: Payments will depend on the number of views and reach. Up to 5% of the total followers/subscribers reach is required one month before the payment is made which will be evaluated on the basis of the analytics report provided by the content creators. At this stage, no transparency safeguards have been built into the Policy to ensure creators do not file false analytics reports. Relevant deductions to the advertisement rates shall be made if the content fails to reach 5 per cent of the subscribers/ followers. The Policy does not specify the rates or methods for deductions, which means that content creators may face uncertainty about the final amount they will be paid. Additionally, since the discretion for deductions lies entirely with the state, there is a risk that the state could impose significant deductions based on its personal preferences or dissatisfaction with the content creators, potentially using this as a means to pressure creators.\n6. **Grounds for cancellation:** As per the Policy, if any information provided is found to be false or incorrect, the empanelment will be immediately cancelled. However, the Policy does not clarify whether the DIPRL or the Panel Advisory Committee, which reviews applications, will determine the accuracy of the information. If a website broadcasts objectionable content—such as hate speech, pornography, violence, indecent or abusive material, drug-related content, cruel or insensitive topics, personal disputes, fake news, false propaganda, promotional interviews, or any other inappropriate content—the empanelment will be revoked/ suspended, and the channel will be blacklisted for a minimum of six months. In order to avoid revocation of their empanelment on broad and ambiguous grounds such as “false propaganda” or “insensitive topic”, influencers may lead to proactive or self-imposed censorship creating a chilling effect on online speech. Additionally, empanelment will be cancelled if the website refuses to display specified ads or if its unique user count decreases by 10% upon re-evaluation. Re-listing will be prohibited for six months following cancellation. The Policy also lacks clarity on whether the DIPRL or the state government will inform the content creator about the objectionable content, or if the state government will notify the DIPRL, which will then take appropriate action against the channel. \n\n\n\n# Karnataka Digital Advertising Guidelines, 2024 [[Link](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing)] \n\n\n\n1. **Stated purpose/ aim:** To make use of digital advertising to propagate the government’s policies and schemes to internet users. The existing traditional media advertising policy is inadequate to handle digital advertising which has a completely different set of dynamics compared to traditional mass media. \n2. **Medium of dissemination:** Through digital media entities which include social media platforms, video streaming, over-the-top (“OTT”) platforms, and influencers, as well as through a digital advertising agency. \n3. **Target audience for empanelment/ enlistment:** The guidelines list 14 categories of digital entities which are eligible for empanelment—video streaming platforms, “OTT” platforms, social media platforms, influencers, and other digital entities. \n4. **Specified criteria for empanelment**: The digital advertising agency must be either incorporated in Karnataka or must have a fully operational office in Karnataka. It should be at least 2 years old at the time of empanelling and should have a valid contract/agreement with Google, Meta or respective digital media entities to carry out digital advertising for governments on their platforms. In the case of a digital media entity, it must be a legally incorporated entity with the Registrar of Companies, Government of India. It should be at least one year old at the time of empanelling and continuously publishing content without any break for at least one year.\n5. **Payment conditions**: Prices for the guidelines will be decided as per the rates specified by the Directorate of Advertising and Visual Publicity (“DAVP”) for each individual format/category. In such cases where the prices are dynamic in nature, the guidelines allow for independent pricing to be followed on a case-by-case basis along the lines of DAVP rates for the same.\n6. **Grounds for cancellation**: The guidelines do not explicitly mention any reason for suspension of empanelment. However, in case of eligibility for digital media entity, it has been mentioned that the entity should be compliant with all statutory requirements of state or Union governments or its agencies, failing which the empanelment shall be cancelled. It should also not be publishing any content–text, visuals, audio or any such–which violates Indian law. Notably, no safeguards/checks have been introduced in the guidelines (in the form of an independent committee for content review, publication of cancellation order, or appeal/ grievance redressal mechanisms for the digital entities) to ensure that the Policy is not misused by the state to propagate their preferred narrative online and restrict speech unpalatable to the state government. \n\n# Punjab \n\nThe Punjab Influencer Empanelment Policy, 2023 \\[[**Link**](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing)\\]\n\n\n\n1. **Stated purpose/ aim:** To promote Punjab in a positive light, highlighting its governance, culture, heritage, and attractions.\n2. **Medium of dissemination:** Through various social media platforms, namely, X (formerly Twitter), Instagram, Facebook & YouTube. \n3. **Target audience for empanelment/ enlistment:** Influencers who have built a reputation for themselves on any of the social media channels where the content is published in their own name or company they own.\n4. **Specified criteria for empanelment**: The influencer shall be active on social media for a minimum period of 6 months before the start date of application and should have at least 10,000 combined subscribers on the date of submission of application for empanelment. The influencers should also not have any criminal cases against them and must adhere to ethical guidelines (Annexure A of the Policy) when promoting products or ideas. Annexure A mentions that the ‘content should promote Punjab in a positive light’. The Policy tries to impose stringent conditions on influencers such as restrictions on posting any content that is “anti-national, or against the state's interests”, leading to concerns about subjective interpretation by the state.  \n5. **Payment conditions**: Payment will be done according to the categories (A, B, C, D or E) based on a combined verified social media subscriber base. The rates for the Policy are determined on cost per view (within the prescribed time period of 4 days) for every category. Accordingly, the minimum base rate with respect to the number of views has been fixed for every category.\n6. **Grounds for cancellation**: Suspension of empanelment may be done on the grounds of hate speech, violent content, adult nudity and sexual activity, intoxicants (liquor), cruel and insensitive content, personal disputes, false news, misrepresentation, promotional interviews, or any other objectionable material, or violation of any law enforced in India leading to loss of reputation of the State Government or any of its bodies. Any of these grounds could lead to immediate suspension of empanelment and blacklisting. No penal action is explicitly mentioned in the Policy. The inclusion of terms like “false news” and “misrepresentation” lacks specificity and opens the door to potential misuse and arbitrary as well as subjective enforcement. However, the Policy provides that the influencer shall have the right to appeal before the Government, or any officer authorised by it in this regard, against any order passed by the Competent Authority under this Policy.\n\n# The Himachal Pradesh Digital Media Policy, 2024 [[Link](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing)] \n\n\n\n1. **Stated purpose/ aim:** To optimally utilise the news web channels, news web portals and social media influencers/handlers to publicise and promote the policies, programmes and development initiatives of the State Government.\n2. **Medium of dissemination:** Through digital media entities which include social media platforms, news web channels, news websites/web portals and influencers/handlers. \n3. **Target audience for empanelment/ enlistment:** The Policy lists 3 types of digital platforms which are eligible for empanelment—news web channels, news websites/portals, social media platforms and influencers/handlers. \n4. **Specified criteria for empanelment**: Social media influencers/handlers must have earned at least 50 per cent of subscribers or followers at least six months prior to the date of application for enlistment. They are segmented into 4 categories (A, B, C, D) based on the number of subscribers/ followers. \n5. **Payment conditions**: In the case of social media influencers, payment will be done according to the categories (A, B, C, D) and the maximum amount prescribed is 2 lakhs for Category A. There is further sub-classification created based on the different social media platforms (YouTube, Facebook and Instagram, Twitter), and the rates for the same are determined based on the type of content and duration of the same. \n6. **Grounds for cancellation**: Suspension of empanelment may be done on the grounds of hate speech, violent content, cruel and insensitive content, false/fake news, anti-state/anti-national content sharing, misrepresentation and any other objectionable material. Indulging in these activities after empanelment will make the entity liable for cancellation of the empanelment and penal action.\n\n\n\nGrounds for cancellation such as \"anti-state/anti-national content\" and \"false/fake News\" lack specificity and open the door to potential misuse and arbitrary as well as subjective enforcement. The Policy also lacks safeguards or checks, such as an independent committee for content review, publication of cancellation orders, or appeal/grievance redressal mechanisms for digital entities. This absence raises concerns about the Policy being misused by the state to promote its preferred narrative online and suppress speech that it finds unfavourable or unpalatable. It also includes provisions for penal action but does not provide details about the action that can be taken. Such an overreaching provision may have chilling effects on online speech and freedom of speech and expression.\n\n# States with unpublished digital media policies\n\nAs per media reports, similar initiatives to empanel social media influencers to advertise government schemes have also been undertaken by [Rajasthan](https://www.hindustantimes.com/india-news/rajasthan-government-advertises-on-social-media-influencers-for-accessibility-to-social-welfare-schemes-and-assembly-elections-101688153348586.html), [Assam](https://www.northeasttoday.in/2024/02/23/assam-government-likely-to-introduce-social-media-influencer-bill-to-collaborate-with-content-creators/), and [Sikkim](https://yojanaregistration.co.in/sikkim-creatorpreneur-yojana/). However, these policies are not available in the public domain. The failure to publicly provide accessible and comprehensive policy documents undermines the state’s transparency and accountability towards citizens. Publicly available policies are essential to ensure that such programs are implemented fairly and effectively. Clear documentation and open channels for public feedback would help mitigate its potential misuse and ensure its ethical and effective implementation. IFF has filed Right to Information (RTI) applications with [Rajasthan](https://drive.google.com/file/d/19UB3JN03Nwt0q8JDntQwwHlFCG1ljAL_/view), [Assam](https://drive.google.com/file/d/1xBkC9OKtS5mJY56s9NGqKKBd11B7Z167/view) and [Sikkim](https://drive.google.com/file/d/13PPWjf9tOGepaX_v3crON2SBrliDaEwK/view) seeking copies of the policy documents and asking whether a public consultation was conducted for these policies. \n\n# Do these models influence free speech and open internet?\n\nStates’ digital media and influencer policies must be evaluated from a user-centric and rights-based perspective, as they often prioritise government interests over those of users. By rewarding influencers solely based on follower counts and relying on broad, ambiguous contractual terms, these policies undermine expertise and objectivity, creating a biased landscape that favours state-approved narratives. This can lead to self-censorship and moral policing, and stifle creativity and free speech while influencing public perceptions of government policies and welfare schemes. Through such policies, highlighting the government's \"schemes and achievements\" is being financially incentivised and the focus is only on positive government-approved narratives. Legally, there is nothing unsound or wrong with this approach—it is similar to advertising, which government departments routinely engage in themselves. However, public funds are being used to incentivise a certain kind and category of content over the other, which is capable of going ‘viral’ (given the popularity of digital creators involved) and potentially skewing the narrative. This inherently creates an uneven playing field, favouring empanelled influencers over those critical of the government and solely relying on platforms like Meta or YouTube as a source of income. \n\nThere are a number of transparency concerns with such a model as well, like there may not be an obligation to disclose ads/paid partnerships, and thus the audience may not realise these creators are being paid by the government. While it might get revised in the future, the policies raise concerns in their current form. To ensure transparency, there should be clear disclaimers—and not only vague labels like “paid partnership”—so people clearly understand that a creator is receiving government payouts. The lack of transparency regarding the paid nature of content diminishes users’ ability to make informed choices. Further, those who critique state governments or their initiatives may be sidelined, dominated, or even subjugated, leading to a distorted public discourse where the true implications of the policies and schemes are concealed, and informed debate is stifled. \n\nIn the case of [*Common Cause v. Union of India*](https://indiankanoon.org/doc/177370809/), the Supreme Court of India laid down guidelines to restrain the Union of India and all state governments from using public funds on government advertisements which are primarily intended to project individual functionaries of the government or a political party. The Court-appointed Committee came up with ‘Guidelines on Content Regulation of Government Advertising’, which mentions 5 principles of content regulation: \n\ni) advertising campaigns are to be related to government responsibilities,\n\nii) materials should be presented in an objective, fair and accessible manner and designed to meet the objectives of the campaign,\n\niii) not directed at promoting political interests of a Party,\n\niv) campaigns must be justified and undertaken in an efficient and cost- effective manner and\n\nv) advertisements must comply with legal requirements and financial regulations and procedures.\n\nFor enforcement of these guidelines, the government set up the Committee on Content Regulation in Government Advertising and decided that their implementation would proceed proactively, *suo moto* or on a complaint. However there has been [criticism](https://caravanmagazine.in/government-policy/centre-state-governments-flouting-sc-regulations-government-ads) that the Committee has failed to enforce the guidelines regularly, with the last action probably taken back in [2020](https://pib.gov.in/PressReleasePage.aspx?PRID=1651999). This points to a lack of enforcement mechanisms, which offers no real remedy. \n\n\n\nMost of the state policies are sprinkled with a vague penalty provision (as it fails to define the terms such as immoral, objectionable etc, exhaustively) which allows for suspension/cancellation of empanelment of those who post objectionable material against the government. The inclusion of such terms creates ambiguity in the enforcement of these policies, and most of these have no redressal system in place to remedy erroneous cancellations. \n\n\n\nThe Ministry of Consumer Affairs released the [Guidelines for Prevention of Misleading Advertisements and Endorsements for Misleading Advertisements, 2022](https://consumeraffairs.nic.in/sites/default/files/file-uploads/latestnews/CCPA%20Notification.pdf), which attempts to promote ethical advertising and consumer protection. These guidelines stipulate the requirements for the content, style, and format of disclaimers that influencers must include in their product ads, introducing a much-required safeguard that furthers transparency. They also mention certain conditions for non-misleading and valid advertisements (“ads”) such as truthful and honest representation. However, is it unclear how these guidelines are operationalised and how effective they are in safeguarding transparency and accountability. \n\n\n\nThe aim of digital media/influencer policies should be to have provisions in place not only to enhance accountability but also to ensure that influencers can engage in open discourse without fear of punitive or disproportionate repercussions. States must create a transparent, equitable, and trustworthy environment that maximises the positive impact of social media influencers, ultimately fostering a healthier online information ecosystem where user interests and rights are respected. \n\n\n\n PDF: [https://drive.google.com/file/d/14mKOlY\\_oyIQfoo1\\_76O-SWwh7DgL9Fwa/view](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing)\n\n  \nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)\n\n  \n \n\n# ",
    "flair": "Policy/Economy",
    "score": 21,
    "num_comments": 2,
    "created_utc": 1730964228.0,
    "convurl": "https://b.thumbs.redditmedia.com/QgrDjdUYyRQYggGQXpr_kgRh_e-gaZ56aotFVSGmHjs.jpg",
    "comments": [
        "Not being rude but It's difficult to read it all on a working day, can you provide a carousel  post or TLDR and then for people who wanted to know more can read in detail.",
        "Hi! Thank you for the feedback and we hear you!  \nWe have helpful a carousel post on our Instagram and a short thread on Twitter (or Mastodon or BSky if those are more your thing).\n\nLinks:  \nIG: @/internetfreedom.in  \nTwitter: [https://twitter.com/internetfreedom/status/1854421555624988929](https://twitter.com/internetfreedom/status/1854421555624988929)  \nMastodon: [https://mas.to/@internetfreedom/113440430777751818](https://mas.to/@internetfreedom/113440430777751818)  \nBSky: [https://bsky.app/profile/internetfreedom.mas.to.ap.brid.gy/post/3ladpjhp6byw2](https://bsky.app/profile/internetfreedom.mas.to.ap.brid.gy/post/3ladpjhp6byw2)"
    ],
    "cleaned_text": "like share prescribe comparative analysis five statelevel digital mediainfluencer policies iff needs support ever details end posthttpspreviewredditxqbernkfzdjpgwidthformatpjpgautowebpsefddeafcabbdea rigorous process research using rti act accessed statelevel digital media influencercentric policies various indian states post attempt critically assess impact statesponsored financial incentives digital creators influencers right free speechthrough rigorous process research using rti act accessed statelevel digital media influencercentric policies various indian states post attempt critically assess impact statesponsored financial incentives digital creators influencers right free speech tldr digital media policy recently released uttar pradesh government garnered significant attention one exists post compares contrasts statelevel digital mediainfluencercentric policies five indian states state governments well union government come different variations media influencer policies disseminate information government schemes welfare benefits achievements aim evaluate policies examining transparency accountability impact fundamental freedoms rights within information ecosystem additionally consider effect propagation government schemes achievements financial incentivisation influencers digital creators important documents iffs comparative analysis statelevel digital mediainfluencer policies linkhttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing uttar pradesh digital media policy linkhttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing haryana digital media advertisement policy linkhttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing karnataka digital advertising guidelines linkhttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing punjab influencer empanelment policy linkhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing himachal pradesh digital media policy linkhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing care policies incentivise influencers promote stateapproved narratives using public funds approach lead selfcensorship moral policing stifle creativity free speech influencing public perceptions government policies welfare schemes inherently creates uneven playing field favouring empanelled influencers critical government solely relying platforms like meta youtube source income furthermore lack transparency around paid partnerships means audiences often unaware consuming governmentfunded content limits capacity make informed choices furthermore ambiguous definitions constitutes objectionable content open door arbitrary cancellation legal actions empanelled influencers policies redressal system place defend actions background august reportshttpsxcominternetfreedomstatus started surfacing uttar pradesh government introducing digital media policy speculations offer financial incentives digital creatorsinfluencers promoting government schemes impose fines certain objectionable content created notably policy officially placed public domain government obtained unofficial channels original hindi policy document archived herehttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing policy reported aims incentivising digital influencers promote state schemes achievements online platforms prompted debate herehttpswwwthequintcomopinionupdigitalmediapolicyincentivisescontentcreatorsbuttowhatendreadmore herehttpswwwboomliveindecodeupsnewpolicypayscontentcreatorsbigbucksbutatwhatcost regarding impact freedom speech expression following development discourse around attempted analyse research digital media influencer policies four states namely haryanahttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing karnatakahttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing punjabhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing himachalhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing pradesh part post releasing tablehttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing summarising comparing policies aforementioned states uttar pradesh digital media policy linkhttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing stated purposeaim disseminate information various developmental public welfarebeneficial schemes achievements state benefits thereof people state medium dissemination digital media platforms similar social media platforms target audience empanelment enlistment digital media handlepagechannelaccount holderoperator digital media influencerscontent writers related agencies firms specified criteria empanelment applicants must existence least two years must submit digital media analytics reports last six months additionally required provide selfdeclaration form asserting criminal cases well another selfdeclaration form confirming information provided purpose listing true must also possess necessary equipment produce videos posts content payment conditions payments depend number views reach general public evaluated basis metrics provided content creators content creator assure state views original affidavit stage transparency safeguards built policy ensure creators file false affidavits limiting information creatorinfluencer empanelledenlisted state government restricts individualsusers even independent authorities conducting checks authenticity creators followerssubscribers content viewsengagement payment done according categories b c type content platform facebook instagram longer content get higher payments additional bonuses exceeding lakh views x influencers paid extra high engagement category maximum monthly expenditure limit advertisements grounds cancellation per policy case information provided account holderinfluencer found incorrectfalse empanelment stand cancelled unclear government government ascertain provided information accurate role assigned person government content produced favour government even inaccurate exaggerated may allowed similarly accurate contentinformation statelevel schemes show government positive light may falsely considered incorrectinaccurate thus may used grounds cancellation enlistment contract safeguards checks introduced policy form independent committee content review publication cancellation order appealgrievance redressal mechanisms influencers ensure policy misused state officials propagate preferred narrative online restrict speech unpalatable state government httpsxcominternetfreedomstatushttpsxcominternetfreedomstatus haryana digital media advertisement policy linkhttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing haryana government shared invitation empanelmenthttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoview invite prominent social media channels participate empanelment process haryana digital media advertisement policy stated purposeaim disseminate information governmental welfare policies aim reaches masses optimum level regulate informationadvertisement medium dissemination various digital media platforms including social media news channels websites reputable channels target audience empanelment enlistment legal entities owning social media channels websites reputed social media channels individual owners social media channels websites reputed social media channels specified criteria empanelment applicants must operating name least one year required submit digital media analytics reports last months must also provide selfdeclaration form asserting never dispute blacklisted deempanelled along another selfdeclaration form confirming information provided listing accurate additionally applicants located outside haryana must include certificate issued director general directorate information public relations languages haryana diprl must least followers subscribers posted minimum times per month six months preceding application payment conditions payments depend number views reach total followerssubscribers reach required one month payment made evaluated basis analytics report provided content creators stage transparency safeguards built policy ensure creators file false analytics reports relevant deductions advertisement rates shall made content fails reach per cent subscribers followers policy specify rates methods deductions means content creators may face uncertainty final amount paid additionally since discretion deductions lies entirely state risk state could impose significant deductions based personal preferences dissatisfaction content creators potentially using means pressure creators grounds cancellation per policy information provided found false incorrect empanelment immediately cancelled however policy clarify whether diprl panel advisory committee reviews applications determine accuracy information website broadcasts objectionable contentsuch hate speech pornography violence indecent abusive material drugrelated content cruel insensitive topics personal disputes fake news false propaganda promotional interviews inappropriate contentthe empanelment revoked suspended channel blacklisted minimum six months order avoid revocation empanelment broad ambiguous grounds false propaganda insensitive topic influencers may lead proactive selfimposed censorship creating chilling effect online speech additionally empanelment cancelled website refuses display specified ads unique user count decreases upon reevaluation relisting prohibited six months following cancellation policy also lacks clarity whether diprl state government inform content creator objectionable content state government notify diprl take appropriate action channel karnataka digital advertising guidelines linkhttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing stated purpose aim make use digital advertising propagate governments policies schemes internet users existing traditional media advertising policy inadequate handle digital advertising completely different set dynamics compared traditional mass media medium dissemination digital media entities include social media platforms video streaming overthetop ott platforms influencers well digital advertising agency target audience empanelment enlistment guidelines list categories digital entities eligible empanelmentvideo streaming platforms ott platforms social media platforms influencers digital entities specified criteria empanelment digital advertising agency must either incorporated karnataka must fully operational office karnataka least years old time empanelling valid contractagreement google meta respective digital media entities carry digital advertising governments platforms case digital media entity must legally incorporated entity registrar companies government india least one year old time empanelling continuously publishing content without break least one year payment conditions prices guidelines decided per rates specified directorate advertising visual publicity davp individual formatcategory cases prices dynamic nature guidelines allow independent pricing followed casebycase basis along lines davp rates grounds cancellation guidelines explicitly mention reason suspension empanelment however case eligibility digital media entity mentioned entity compliant statutory requirements state union governments agencies failing empanelment shall cancelled also publishing contenttext visuals audio suchwhich violates indian law notably safeguardschecks introduced guidelines form independent committee content review publication cancellation order appeal grievance redressal mechanisms digital entities ensure policy misused state propagate preferred narrative online restrict speech unpalatable state government punjab punjab influencer empanelment policy linkhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing stated purpose aim promote punjab positive light highlighting governance culture heritage attractions medium dissemination various social media platforms namely x formerly twitter instagram facebook youtube target audience empanelment enlistment influencers built reputation social media channels content published name company specified criteria empanelment influencer shall active social media minimum period months start date application least combined subscribers date submission application empanelment influencers also criminal cases must adhere ethical guidelines annexure policy promoting products ideas annexure mentions content promote punjab positive light policy tries impose stringent conditions influencers restrictions posting content antinational states interests leading concerns subjective interpretation state payment conditions payment done according categories b c e based combined verified social media subscriber base rates policy determined cost per view within prescribed time period days every category accordingly minimum base rate respect number views fixed every category grounds cancellation suspension empanelment may done grounds hate speech violent content adult nudity sexual activity intoxicants liquor cruel insensitive content personal disputes false news misrepresentation promotional interviews objectionable material violation law enforced india leading loss reputation state government bodies grounds could lead immediate suspension empanelment blacklisting penal action explicitly mentioned policy inclusion terms like false news misrepresentation lacks specificity opens door potential misuse arbitrary well subjective enforcement however policy provides influencer shall right appeal government officer authorised regard order passed competent authority policy himachal pradesh digital media policy linkhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing stated purpose aim optimally utilise news web channels news web portals social media influencershandlers publicise promote policies programmes development initiatives state government medium dissemination digital media entities include social media platforms news web channels news websitesweb portals influencershandlers target audience empanelment enlistment policy lists types digital platforms eligible empanelmentnews web channels news websitesportals social media platforms influencershandlers specified criteria empanelment social media influencershandlers must earned least per cent subscribers followers least six months prior date application enlistment segmented categories b c based number subscribers followers payment conditions case social media influencers payment done according categories b c maximum amount prescribed lakhs category subclassification created based different social media platforms youtube facebook instagram twitter rates determined based type content duration grounds cancellation suspension empanelment may done grounds hate speech violent content cruel insensitive content falsefake news antistateantinational content sharing misrepresentation objectionable material indulging activities empanelment make entity liable cancellation empanelment penal action grounds cancellation antistateantinational content falsefake news lack specificity open door potential misuse arbitrary well subjective enforcement policy also lacks safeguards checks independent committee content review publication cancellation orders appealgrievance redressal mechanisms digital entities absence raises concerns policy misused state promote preferred narrative online suppress speech finds unfavourable unpalatable also includes provisions penal action provide details action taken overreaching provision may chilling effects online speech freedom speech expression states unpublished digital media policies per media reports similar initiatives empanel social media influencers advertise government schemes also undertaken rajasthanhttpswwwhindustantimescomindianewsrajasthangovernmentadvertisesonsocialmediainfluencersforaccessibilitytosocialwelfareschemesandassemblyelectionshtml assamhttpswwwnortheasttodayinassamgovernmentlikelytointroducesocialmediainfluencerbilltocollaboratewithcontentcreators sikkimhttpsyojanaregistrationcoinsikkimcreatorpreneuryojana however policies available public domain failure publicly provide accessible comprehensive policy documents undermines states transparency accountability towards citizens publicly available policies essential ensure programs implemented fairly effectively clear documentation open channels public feedback would help mitigate potential misuse ensure ethical effective implementation iff filed right information rti applications rajasthanhttpsdrivegooglecomfiledubjnnwtqjdntqwwhlfcgljalview assamhttpsdrivegooglecomfiledxbkcoktsmjysngqkkbdbzview sikkimhttpsdrivegooglecomfiledppwjftogepaxvcronsbrlidaewkview seeking copies policy documents asking whether public consultation conducted policies models influence free speech open internet states digital media influencer policies must evaluated usercentric rightsbased perspective often prioritise government interests users rewarding influencers solely based follower counts relying broad ambiguous contractual terms policies undermine expertise objectivity creating biased landscape favours stateapproved narratives lead selfcensorship moral policing stifle creativity free speech influencing public perceptions government policies welfare schemes policies highlighting governments schemes achievements financially incentivised focus positive governmentapproved narratives legally nothing unsound wrong approachit similar advertising government departments routinely engage however public funds used incentivise certain kind category content capable going viral given popularity digital creators involved potentially skewing narrative inherently creates uneven playing field favouring empanelled influencers critical government solely relying platforms like meta youtube source income number transparency concerns model well like may obligation disclose adspaid partnerships thus audience may realise creators paid government might get revised future policies raise concerns current form ensure transparency clear disclaimersand vague labels like paid partnershipso people clearly understand creator receiving government payouts lack transparency regarding paid nature content diminishes users ability make informed choices critique state governments initiatives may sidelined dominated even subjugated leading distorted public discourse true implications policies schemes concealed informed debate stifled case common cause v union indiahttpsindiankanoonorgdoc supreme court india laid guidelines restrain union india state governments using public funds government advertisements primarily intended project individual functionaries government political party courtappointed committee came guidelines content regulation government advertising mentions principles content regulation advertising campaigns related government responsibilities ii materials presented objective fair accessible manner designed meet objectives campaign iii directed promoting political interests party iv campaigns must justified undertaken efficient cost effective manner v advertisements must comply legal requirements financial regulations procedures enforcement guidelines government set committee content regulation government advertising decided implementation would proceed proactively suo moto complaint however criticismhttpscaravanmagazineingovernmentpolicycentrestategovernmentsfloutingscregulationsgovernmentads committee failed enforce guidelines regularly last action probably taken back httpspibgovinpressreleasepageaspxprid points lack enforcement mechanisms offers real remedy state policies sprinkled vague penalty provision fails define terms immoral objectionable etc exhaustively allows suspensioncancellation empanelment post objectionable material government inclusion terms creates ambiguity enforcement policies redressal system place remedy erroneous cancellations ministry consumer affairs released guidelines prevention misleading advertisements endorsements misleading advertisements httpsconsumeraffairsnicinsitesdefaultfilesfileuploadslatestnewsccpanotificationpdf attempts promote ethical advertising consumer protection guidelines stipulate requirements content style format disclaimers influencers must include product ads introducing muchrequired safeguard furthers transparency also mention certain conditions nonmisleading valid advertisements ads truthful honest representation however unclear guidelines operationalised effective safeguarding transparency accountability aim digital mediainfluencer policies provisions place enhance accountability also ensure influencers engage open discourse without fear punitive disproportionate repercussions states must create transparent equitable trustworthy environment maximises positive impact social media influencers ultimately fostering healthier online information ecosystem user interests rights respected pdf httpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewhttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "like share prescribe comparative analysis five statelevel digital mediainfluencer policies",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditxqbernkfzdjpgwidthformatpjpgautowebpsefddeafcabbdea rigorous process research using rti act accessed statelevel digital media influencercentric policies various indian states post attempt critically assess impact statesponsored financial incentives digital creators influencers right free speechthrough rigorous process research using rti act accessed statelevel digital media influencercentric policies various indian states post attempt critically assess impact statesponsored financial incentives digital creators influencers right free speech tldr digital media policy recently released uttar pradesh government garnered significant attention one exists post compares contrasts statelevel digital mediainfluencercentric policies five indian states state governments well union government come different variations media influencer policies disseminate information government schemes welfare benefits achievements aim evaluate policies examining transparency accountability impact fundamental freedoms rights within information ecosystem additionally consider effect propagation government schemes achievements financial incentivisation influencers digital creators important documents iffs comparative analysis statelevel digital mediainfluencer policies linkhttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing uttar pradesh digital media policy linkhttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing haryana digital media advertisement policy linkhttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing karnataka digital advertising guidelines linkhttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing punjab influencer empanelment policy linkhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing himachal pradesh digital media policy linkhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing care policies incentivise influencers promote stateapproved narratives using public funds approach lead selfcensorship moral policing stifle creativity free speech influencing public perceptions government policies welfare schemes inherently creates uneven playing field favouring empanelled influencers critical government solely relying platforms like meta youtube source income furthermore lack transparency around paid partnerships means audiences often unaware consuming governmentfunded content limits capacity make informed choices furthermore ambiguous definitions constitutes objectionable content open door arbitrary cancellation legal actions empanelled influencers policies redressal system place defend actions background august reportshttpsxcominternetfreedomstatus started surfacing uttar pradesh government introducing digital media policy speculations offer financial incentives digital creatorsinfluencers promoting government schemes impose fines certain objectionable content created notably policy officially placed public domain government obtained unofficial channels original hindi policy document archived herehttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing policy reported aims incentivising digital influencers promote state schemes achievements online platforms prompted debate herehttpswwwthequintcomopinionupdigitalmediapolicyincentivisescontentcreatorsbuttowhatendreadmore herehttpswwwboomliveindecodeupsnewpolicypayscontentcreatorsbigbucksbutatwhatcost regarding impact freedom speech expression following development discourse around attempted analyse research digital media influencer policies four states namely haryanahttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing karnatakahttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing punjabhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing himachalhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing pradesh part post releasing tablehttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing summarising comparing policies aforementioned states uttar pradesh digital media policy linkhttpsdrivegooglecomfiledylqfdxvfdnrchibtxojpvkugwdcviewuspsharing stated purposeaim disseminate information various developmental public welfarebeneficial schemes achievements state benefits thereof people state medium dissemination digital media platforms similar social media platforms target audience empanelment enlistment digital media handlepagechannelaccount holderoperator digital media influencerscontent writers related agencies firms specified criteria empanelment applicants must existence least two years must submit digital media analytics reports last six months additionally required provide selfdeclaration form asserting criminal cases well another selfdeclaration form confirming information provided purpose listing true must also possess necessary equipment produce videos posts content payment conditions payments depend number views reach general public evaluated basis metrics provided content creators content creator assure state views original affidavit stage transparency safeguards built policy ensure creators file false affidavits limiting information creatorinfluencer empanelledenlisted state government restricts individualsusers even independent authorities conducting checks authenticity creators followerssubscribers content viewsengagement payment done according categories b c type content platform facebook instagram longer content get higher payments additional bonuses exceeding lakh views x influencers paid extra high engagement category maximum monthly expenditure limit advertisements grounds cancellation per policy case information provided account holderinfluencer found incorrectfalse empanelment stand cancelled unclear government government ascertain provided information accurate role assigned person government content produced favour government even inaccurate exaggerated may allowed similarly accurate contentinformation statelevel schemes show government positive light may falsely considered incorrectinaccurate thus may used grounds cancellation enlistment contract safeguards checks introduced policy form independent committee content review publication cancellation order appealgrievance redressal mechanisms influencers ensure policy misused state officials propagate preferred narrative online restrict speech unpalatable state government httpsxcominternetfreedomstatushttpsxcominternetfreedomstatus haryana digital media advertisement policy linkhttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoviewuspsharing haryana government shared invitation empanelmenthttpsdrivegooglecomfiledskisnqcnqvcxfhhapeimoview invite prominent social media channels participate empanelment process haryana digital media advertisement policy stated purposeaim disseminate information governmental welfare policies aim reaches masses optimum level regulate informationadvertisement medium dissemination various digital media platforms including social media news channels websites reputable channels target audience empanelment enlistment legal entities owning social media channels websites reputed social media channels individual owners social media channels websites reputed social media channels specified criteria empanelment applicants must operating name least one year required submit digital media analytics reports last months must also provide selfdeclaration form asserting never dispute blacklisted deempanelled along another selfdeclaration form confirming information provided listing accurate additionally applicants located outside haryana must include certificate issued director general directorate information public relations languages haryana diprl must least followers subscribers posted minimum times per month six months preceding application payment conditions payments depend number views reach total followerssubscribers reach required one month payment made evaluated basis analytics report provided content creators stage transparency safeguards built policy ensure creators file false analytics reports relevant deductions advertisement rates shall made content fails reach per cent subscribers followers policy specify rates methods deductions means content creators may face uncertainty final amount paid additionally since discretion deductions lies entirely state risk state could impose significant deductions based personal preferences dissatisfaction content creators potentially using means pressure creators grounds cancellation per policy information provided found false incorrect empanelment immediately cancelled however policy clarify whether diprl panel advisory committee reviews applications determine accuracy information website broadcasts objectionable contentsuch hate speech pornography violence indecent abusive material drugrelated content cruel insensitive topics personal disputes fake news false propaganda promotional interviews inappropriate contentthe empanelment revoked suspended channel blacklisted minimum six months order avoid revocation empanelment broad ambiguous grounds false propaganda insensitive topic influencers may lead proactive selfimposed censorship creating chilling effect online speech additionally empanelment cancelled website refuses display specified ads unique user count decreases upon reevaluation relisting prohibited six months following cancellation policy also lacks clarity whether diprl state government inform content creator objectionable content state government notify diprl take appropriate action channel karnataka digital advertising guidelines linkhttpsdrivegooglecomfiledzsmutlqdjkozogwxpwkzzowalnviewuspsharing stated purpose aim make use digital advertising propagate governments policies schemes internet users existing traditional media advertising policy inadequate handle digital advertising completely different set dynamics compared traditional mass media medium dissemination digital media entities include social media platforms video streaming overthetop ott platforms influencers well digital advertising agency target audience empanelment enlistment guidelines list categories digital entities eligible empanelmentvideo streaming platforms ott platforms social media platforms influencers digital entities specified criteria empanelment digital advertising agency must either incorporated karnataka must fully operational office karnataka least years old time empanelling valid contractagreement google meta respective digital media entities carry digital advertising governments platforms case digital media entity must legally incorporated entity registrar companies government india least one year old time empanelling continuously publishing content without break least one year payment conditions prices guidelines decided per rates specified directorate advertising visual publicity davp individual formatcategory cases prices dynamic nature guidelines allow independent pricing followed casebycase basis along lines davp rates grounds cancellation guidelines explicitly mention reason suspension empanelment however case eligibility digital media entity mentioned entity compliant statutory requirements state union governments agencies failing empanelment shall cancelled also publishing contenttext visuals audio suchwhich violates indian law notably safeguardschecks introduced guidelines form independent committee content review publication cancellation order appeal grievance redressal mechanisms digital entities ensure policy misused state propagate preferred narrative online restrict speech unpalatable state government punjab punjab influencer empanelment policy linkhttpsdrivegooglecomfiledecyhnmgquhdmftpxahwkobzviewuspsharing stated purpose aim promote punjab positive light highlighting governance culture heritage attractions medium dissemination various social media platforms namely x formerly twitter instagram facebook youtube target audience empanelment enlistment influencers built reputation social media channels content published name company specified criteria empanelment influencer shall active social media minimum period months start date application least combined subscribers date submission application empanelment influencers also criminal cases must adhere ethical guidelines annexure policy promoting products ideas annexure mentions content promote punjab positive light policy tries impose stringent conditions influencers restrictions posting content antinational states interests leading concerns subjective interpretation state payment conditions payment done according categories b c e based combined verified social media subscriber base rates policy determined cost per view within prescribed time period days every category accordingly minimum base rate respect number views fixed every category grounds cancellation suspension empanelment may done grounds hate speech violent content adult nudity sexual activity intoxicants liquor cruel insensitive content personal disputes false news misrepresentation promotional interviews objectionable material violation law enforced india leading loss reputation state government bodies grounds could lead immediate suspension empanelment blacklisting penal action explicitly mentioned policy inclusion terms like false news misrepresentation lacks specificity opens door potential misuse arbitrary well subjective enforcement however policy provides influencer shall right appeal government officer authorised regard order passed competent authority policy himachal pradesh digital media policy linkhttpsdrivegooglecomfiledojzfoqvugqhxytoroxrvtewfjsviewuspsharing stated purpose aim optimally utilise news web channels news web portals social media influencershandlers publicise promote policies programmes development initiatives state government medium dissemination digital media entities include social media platforms news web channels news websitesweb portals influencershandlers target audience empanelment enlistment policy lists types digital platforms eligible empanelmentnews web channels news websitesportals social media platforms influencershandlers specified criteria empanelment social media influencershandlers must earned least per cent subscribers followers least six months prior date application enlistment segmented categories b c based number subscribers followers payment conditions case social media influencers payment done according categories b c maximum amount prescribed lakhs category subclassification created based different social media platforms youtube facebook instagram twitter rates determined based type content duration grounds cancellation suspension empanelment may done grounds hate speech violent content cruel insensitive content falsefake news antistateantinational content sharing misrepresentation objectionable material indulging activities empanelment make entity liable cancellation empanelment penal action grounds cancellation antistateantinational content falsefake news lack specificity open door potential misuse arbitrary well subjective enforcement policy also lacks safeguards checks independent committee content review publication cancellation orders appealgrievance redressal mechanisms digital entities absence raises concerns policy misused state promote preferred narrative online suppress speech finds unfavourable unpalatable also includes provisions penal action provide details action taken overreaching provision may chilling effects online speech freedom speech expression states unpublished digital media policies per media reports similar initiatives empanel social media influencers advertise government schemes also undertaken rajasthanhttpswwwhindustantimescomindianewsrajasthangovernmentadvertisesonsocialmediainfluencersforaccessibilitytosocialwelfareschemesandassemblyelectionshtml assamhttpswwwnortheasttodayinassamgovernmentlikelytointroducesocialmediainfluencerbilltocollaboratewithcontentcreators sikkimhttpsyojanaregistrationcoinsikkimcreatorpreneuryojana however policies available public domain failure publicly provide accessible comprehensive policy documents undermines states transparency accountability towards citizens publicly available policies essential ensure programs implemented fairly effectively clear documentation open channels public feedback would help mitigate potential misuse ensure ethical effective implementation iff filed right information rti applications rajasthanhttpsdrivegooglecomfiledubjnnwtqjdntqwwhlfcgljalview assamhttpsdrivegooglecomfiledxbkcoktsmjysngqkkbdbzview sikkimhttpsdrivegooglecomfiledppwjftogepaxvcronsbrlidaewkview seeking copies policy documents asking whether public consultation conducted policies models influence free speech open internet states digital media influencer policies must evaluated usercentric rightsbased perspective often prioritise government interests users rewarding influencers solely based follower counts relying broad ambiguous contractual terms policies undermine expertise objectivity creating biased landscape favours stateapproved narratives lead selfcensorship moral policing stifle creativity free speech influencing public perceptions government policies welfare schemes policies highlighting governments schemes achievements financially incentivised focus positive governmentapproved narratives legally nothing unsound wrong approachit similar advertising government departments routinely engage however public funds used incentivise certain kind category content capable going viral given popularity digital creators involved potentially skewing narrative inherently creates uneven playing field favouring empanelled influencers critical government solely relying platforms like meta youtube source income number transparency concerns model well like may obligation disclose adspaid partnerships thus audience may realise creators paid government might get revised future policies raise concerns current form ensure transparency clear disclaimersand vague labels like paid partnershipso people clearly understand creator receiving government payouts lack transparency regarding paid nature content diminishes users ability make informed choices critique state governments initiatives may sidelined dominated even subjugated leading distorted public discourse true implications policies schemes concealed informed debate stifled case common cause v union indiahttpsindiankanoonorgdoc supreme court india laid guidelines restrain union india state governments using public funds government advertisements primarily intended project individual functionaries government political party courtappointed committee came guidelines content regulation government advertising mentions principles content regulation advertising campaigns related government responsibilities ii materials presented objective fair accessible manner designed meet objectives campaign iii directed promoting political interests party iv campaigns must justified undertaken efficient cost effective manner v advertisements must comply legal requirements financial regulations procedures enforcement guidelines government set committee content regulation government advertising decided implementation would proceed proactively suo moto complaint however criticismhttpscaravanmagazineingovernmentpolicycentrestategovernmentsfloutingscregulationsgovernmentads committee failed enforce guidelines regularly last action probably taken back httpspibgovinpressreleasepageaspxprid points lack enforcement mechanisms offers real remedy state policies sprinkled vague penalty provision fails define terms immoral objectionable etc exhaustively allows suspensioncancellation empanelment post objectionable material government inclusion terms creates ambiguity enforcement policies redressal system place remedy erroneous cancellations ministry consumer affairs released guidelines prevention misleading advertisements endorsements misleading advertisements httpsconsumeraffairsnicinsitesdefaultfilesfileuploadslatestnewsccpanotificationpdf attempts promote ethical advertising consumer protection guidelines stipulate requirements content style format disclaimers influencers must include product ads introducing muchrequired safeguard furthers transparency also mention certain conditions nonmisleading valid advertisements ads truthful honest representation however unclear guidelines operationalised effective safeguarding transparency accountability aim digital mediainfluencer policies provisions place enhance accountability also ensure influencers engage open discourse without fear punitive disproportionate repercussions states must create transparent equitable trustworthy environment maximises positive impact social media influencers ultimately fostering healthier online information ecosystem user interests rights respected pdf httpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewhttpsdrivegooglecomfiledmkolyoyiqfoooswwhdglfwaviewuspsharing help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "rude difficult read working day provide carousel post tldr people wanted know read detail hi thank feedback hear helpful carousel post instagram short thread twitter mastodon bsky thing links ig internetfreedomin twitter httpstwittercominternetfreedomstatushttpstwittercominternetfreedomstatus mastodon httpsmastointernetfreedomhttpsmastointernetfreedom bsky httpsbskyappprofileinternetfreedommastoapbridgypostladpjhpbywhttpsbskyappprofileinternetfreedommastoapbridgypostladpjhpbyw",
    "light_cleaned_title": "Like, Share, Prescribe? A comparative analysis of five state-level digital media/influencer policies",
    "light_cleaned_selftext": "[IFF needs your support now more than ever! Details at the end of the post.](https://preview.redd.it/xq17bernkfzd1.jpg?width=900&format=pjpg&auto=webp&s=28078548ef662d27d7e7afc4a4b584865351bdea) # Through a rigorous process of research and using the RTI Act we have accessed state-level digital media and influencer-centric policies of various Indian states. In this post, we attempt to critically assess the impact of state-sponsored financial incentives for digital creators and influencers on the right to free speech.Through a rigorous process of research and using the RTI Act we have accessed state-level digital media and influencer-centric policies of various Indian states. In this post, we attempt to critically assess the impact of state-sponsored financial incentives for digital creators and influencers on the right to free speech. # tl;dr The Digital Media Policy, 2024 recently released by the Uttar Pradesh government garnered significant attention but it's not the only one which exists. This post compares and contrasts state-level digital media/influencer-centric policies of five Indian states. State governments as well as the Union government have come up with different variations of the media/ influencer policies to disseminate information about government schemes, welfare benefits, and achievements. We aim to evaluate these policies by examining their transparency, accountability, and impact on fundamental freedoms and rights within the information ecosystem. Additionally, we will consider the effect of the propagation of the government \"schemes and achievements\" through the financial incentivisation of influencers and digital creators # Important documents 1. IFF’s comparative analysis of 5 state-level digital media//influencer policies ([link](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing)) 2. Uttar Pradesh Digital Media Policy, 2024 ([link](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing)) 3. Haryana Digital Media Advertisement Policy, 2023 ([link](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing)) 4. Karnataka Digital Advertising Guidelines, 2024 ([link](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing)) 5. Punjab Influencer Empanelment Policy, 2023 ([link](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing)**)** 6. Himachal Pradesh Digital Media Policy, 2024 ([link](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing)) # Why should you care? These policies incentivise influencers to promote state-approved narratives by using public funds. This approach can lead to self-censorship and moral policing, and stifle creativity and free speech while influencing public perceptions of government policies and welfare schemes. This inherently creates an uneven playing field, favouring empanelled influencers over those critical of the government and solely relying on platforms like Meta or YouTube as a source of income. Furthermore, the lack of transparency around paid partnerships means audiences are often unaware that they are consuming government-funded content which limits their capacity to make informed choices. Furthermore, the ambiguous definitions of what constitutes \"objectionable\" content open the door to arbitrary cancellation and legal actions against the empanelled influencers when most of these policies have no redressal system in place to defend against such actions. # Background On August 28, 2024, [reports](https://x.com/internetfreedom/status/1828741543403860257) started surfacing about Uttar Pradesh (UP) government introducing a Digital Media Policy, 2024, with speculations that it will offer financial incentives to digital creators/influencers for promoting government schemes, and impose fines on certain objectionable content created by them. Notably, the Policy itself had not been officially placed in the public domain by the UP government but had to be obtained from unofficial channels (the original Hindi policy document is archived [here](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing)). The Policy, as reported, aims at incentivising digital influencers to promote state schemes and achievements on online platforms. This prompted a debate \\[[here](https://www.thequint.com/opinion/up-digital-media-policy-incentivises-content-creators-but-to-what-end#read-more) and [here](https://www.boomlive.in/decode/ups-new-policy-pays-content-creators-big-bucksbut-at-what-cost-26452)\\] regarding its impact on freedom of speech and expression. Following this development and the discourse around it, we attempted to analyse and research the digital media/ influencer policies of four other states namely [Haryana](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing), [Karnataka](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing), [Punjab](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing), and [Himachal](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing) Pradesh. As part of this post, we are releasing a [table](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing) summarising and comparing the policies for the aforementioned 5 states. # Uttar Pradesh Digital Media Policy, 2024 [[Link](https://drive.google.com/file/d/11ylqFd8xVfDNrc8h1ibTxoJPVkUgwd6C/view?usp=sharing)] 1. **Stated purpose/aim:** To disseminate information about various developmental, public welfare/beneficial schemes or achievements by the state and the benefits thereof to the people of the state. 2. **Medium of dissemination:** through digital media platforms and other similar social media platforms. 3. **Target audience for empanelment/ enlistment:** Digital media handle/page/channel/account holder/operator/ digital media influencers/content writers and related agencies or firms. 4. **Specified criteria for empanelment**: Applicants must have been in existence for at least two years and must submit their digital media analytics reports from the last six months. Additionally, they are required to provide a self-declaration form asserting that they have no criminal cases against them, as well as another self-declaration form confirming that all information provided for the purpose of listing is true. They must also possess the necessary equipment to produce videos, posts, and other content. 5. **Payment conditions**: Payments will depend on the number of views and reach to the general public, which will be evaluated on the basis of the metrics provided by the content creators. The content creator will have to assure the state that the views are original through an affidavit. At this stage, no transparency safeguards have been built into the Policy to ensure that creators do not file false affidavits. Limiting the information about which creator/influencer is empanelled/enlisted to the State Government restricts individuals/users or even independent authorities from conducting checks on the authenticity of the creator’s followers/subscribers and content views/engagement. Payment will be done according to the categories (A, B, C, or D), type of content, and platform. For Facebook and Instagram, longer content will get higher payments and additional bonuses for exceeding 1 lakh views. For X, influencers will be paid extra for high engagement. Each category has a maximum monthly expenditure limit for advertisements. 6. **Grounds for cancellation**: As per the Policy, in case the information provided by the account holder/influencer is found to be incorrect/false, then the empanelment will stand cancelled. Here, it is unclear how the government (or who in the government) will ascertain that the provided information is accurate. If this role is assigned to a person from the UP government, then content produced in favour of the government (even if inaccurate or exaggerated) may be allowed. Similarly, accurate content/information about state-level schemes that do not show the government in a positive light may be falsely considered incorrect/inaccurate and thus may be used as grounds for cancellation of the enlistment contract. No safeguards or checks have been introduced in the Policy (in the form of an independent committee for content review, publication of cancellation order, or appeal/grievance redressal mechanisms for influencers) to ensure that the Policy is not (mis)used by state officials to propagate their preferred narrative online and restrict speech unpalatable to the state government. [https://x.com/internetfreedom/status/1828741543403860257](https://x.com/internetfreedom/status/1828741543403860257) # Haryana Digital Media Advertisement Policy, 2023 [[Link](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view?usp=sharing)] The Haryana Government shared an ‘[Invitation for Empanelment](https://drive.google.com/file/d/12sKIS_nqcNqV5cXF7H0h4a4P23eim1O9/view)’ to invite prominent social media channels to participate in the empanelment process under the ‘Haryana Digital Media Advertisement Policy 2023’. 1. **Stated purpose/aim:** To disseminate information about governmental welfare policies with the aim that it reaches the masses at an optimum level and to regulate such information/advertisement. 2. **Medium of dissemination:** Through various digital media platforms, including social media news channels, websites, and other reputable channels. 3. **Target audience for empanelment/ enlistment:** Legal entities owning the social media channels, websites, and reputed social media channels and the individual owners of social media channels, websites, and reputed social media channels. 4. **Specified criteria for empanelment**: Applicants must have been operating under the same name for at least one year and are required to submit their digital media analytics reports for the last 12 months. They must also provide a self-declaration form asserting that they have never been in dispute, blacklisted, or de-empanelled, along with another self-declaration form confirming that all information provided for the listing is accurate. Additionally, applicants located outside Haryana must include a certificate issued by the Director General of Directorate of Information, Public Relations & Languages, Haryana (“DIPRL”). They must have at least 50,000 followers or subscribers and have posted a minimum of 30 times per month in the six months preceding their application. 5. **Payment conditions**: Payments will depend on the number of views and reach. Up to 5% of the total followers/subscribers reach is required one month before the payment is made which will be evaluated on the basis of the analytics report provided by the content creators. At this stage, no transparency safeguards have been built into the Policy to ensure creators do not file false analytics reports. Relevant deductions to the advertisement rates shall be made if the content fails to reach 5 per cent of the subscribers/ followers. The Policy does not specify the rates or methods for deductions, which means that content creators may face uncertainty about the final amount they will be paid. Additionally, since the discretion for deductions lies entirely with the state, there is a risk that the state could impose significant deductions based on its personal preferences or dissatisfaction with the content creators, potentially using this as a means to pressure creators. 6. **Grounds for cancellation:** As per the Policy, if any information provided is found to be false or incorrect, the empanelment will be immediately cancelled. However, the Policy does not clarify whether the DIPRL or the Panel Advisory Committee, which reviews applications, will determine the accuracy of the information. If a website broadcasts objectionable content—such as hate speech, pornography, violence, indecent or abusive material, drug-related content, cruel or insensitive topics, personal disputes, fake news, false propaganda, promotional interviews, or any other inappropriate content—the empanelment will be revoked/ suspended, and the channel will be blacklisted for a minimum of six months. In order to avoid revocation of their empanelment on broad and ambiguous grounds such as “false propaganda” or “insensitive topic”, influencers may lead to proactive or self-imposed censorship creating a chilling effect on online speech. Additionally, empanelment will be cancelled if the website refuses to display specified ads or if its unique user count decreases by 10% upon re-evaluation. Re-listing will be prohibited for six months following cancellation. The Policy also lacks clarity on whether the DIPRL or the state government will inform the content creator about the objectionable content, or if the state government will notify the DIPRL, which will then take appropriate action against the channel. # Karnataka Digital Advertising Guidelines, 2024 [[Link](https://drive.google.com/file/d/1Zsmu3TlqDjKo0ZogwX19_pwKZZ_OwAln/view?usp=sharing)] 1. **Stated purpose/ aim:** To make use of digital advertising to propagate the government’s policies and schemes to internet users. The existing traditional media advertising policy is inadequate to handle digital advertising which has a completely different set of dynamics compared to traditional mass media. 2. **Medium of dissemination:** Through digital media entities which include social media platforms, video streaming, over-the-top (“OTT”) platforms, and influencers, as well as through a digital advertising agency. 3. **Target audience for empanelment/ enlistment:** The guidelines list 14 categories of digital entities which are eligible for empanelment—video streaming platforms, “OTT” platforms, social media platforms, influencers, and other digital entities. 4. **Specified criteria for empanelment**: The digital advertising agency must be either incorporated in Karnataka or must have a fully operational office in Karnataka. It should be at least 2 years old at the time of empanelling and should have a valid contract/agreement with Google, Meta or respective digital media entities to carry out digital advertising for governments on their platforms. In the case of a digital media entity, it must be a legally incorporated entity with the Registrar of Companies, Government of India. It should be at least one year old at the time of empanelling and continuously publishing content without any break for at least one year. 5. **Payment conditions**: Prices for the guidelines will be decided as per the rates specified by the Directorate of Advertising and Visual Publicity (“DAVP”) for each individual format/category. In such cases where the prices are dynamic in nature, the guidelines allow for independent pricing to be followed on a case-by-case basis along the lines of DAVP rates for the same. 6. **Grounds for cancellation**: The guidelines do not explicitly mention any reason for suspension of empanelment. However, in case of eligibility for digital media entity, it has been mentioned that the entity should be compliant with all statutory requirements of state or Union governments or its agencies, failing which the empanelment shall be cancelled. It should also not be publishing any content–text, visuals, audio or any such–which violates Indian law. Notably, no safeguards/checks have been introduced in the guidelines (in the form of an independent committee for content review, publication of cancellation order, or appeal/ grievance redressal mechanisms for the digital entities) to ensure that the Policy is not misused by the state to propagate their preferred narrative online and restrict speech unpalatable to the state government. # Punjab The Punjab Influencer Empanelment Policy, 2023 \\[[**Link**](https://drive.google.com/file/d/11ECYH3NmG44-qU6Hd2mfT-PxahwkOBZ7/view?usp=sharing)\\] 1. **Stated purpose/ aim:** To promote Punjab in a positive light, highlighting its governance, culture, heritage, and attractions. 2. **Medium of dissemination:** Through various social media platforms, namely, X (formerly Twitter), Instagram, Facebook & YouTube. 3. **Target audience for empanelment/ enlistment:** Influencers who have built a reputation for themselves on any of the social media channels where the content is published in their own name or company they own. 4. **Specified criteria for empanelment**: The influencer shall be active on social media for a minimum period of 6 months before the start date of application and should have at least 10,000 combined subscribers on the date of submission of application for empanelment. The influencers should also not have any criminal cases against them and must adhere to ethical guidelines (Annexure A of the Policy) when promoting products or ideas. Annexure A mentions that the ‘content should promote Punjab in a positive light’. The Policy tries to impose stringent conditions on influencers such as restrictions on posting any content that is “anti-national, or against the state's interests”, leading to concerns about subjective interpretation by the state. 5. **Payment conditions**: Payment will be done according to the categories (A, B, C, D or E) based on a combined verified social media subscriber base. The rates for the Policy are determined on cost per view (within the prescribed time period of 4 days) for every category. Accordingly, the minimum base rate with respect to the number of views has been fixed for every category. 6. **Grounds for cancellation**: Suspension of empanelment may be done on the grounds of hate speech, violent content, adult nudity and sexual activity, intoxicants (liquor), cruel and insensitive content, personal disputes, false news, misrepresentation, promotional interviews, or any other objectionable material, or violation of any law enforced in India leading to loss of reputation of the State Government or any of its bodies. Any of these grounds could lead to immediate suspension of empanelment and blacklisting. No penal action is explicitly mentioned in the Policy. The inclusion of terms like “false news” and “misrepresentation” lacks specificity and opens the door to potential misuse and arbitrary as well as subjective enforcement. However, the Policy provides that the influencer shall have the right to appeal before the Government, or any officer authorised by it in this regard, against any order passed by the Competent Authority under this Policy. # The Himachal Pradesh Digital Media Policy, 2024 [[Link](https://drive.google.com/file/d/1ojZ7fO7qvuGQhx6YTo8RO_xRvT3ewfJS/view?usp=sharing)] 1. **Stated purpose/ aim:** To optimally utilise the news web channels, news web portals and social media influencers/handlers to publicise and promote the policies, programmes and development initiatives of the State Government. 2. **Medium of dissemination:** Through digital media entities which include social media platforms, news web channels, news websites/web portals and influencers/handlers. 3. **Target audience for empanelment/ enlistment:** The Policy lists 3 types of digital platforms which are eligible for empanelment—news web channels, news websites/portals, social media platforms and influencers/handlers. 4. **Specified criteria for empanelment**: Social media influencers/handlers must have earned at least 50 per cent of subscribers or followers at least six months prior to the date of application for enlistment. They are segmented into 4 categories (A, B, C, D) based on the number of subscribers/ followers. 5. **Payment conditions**: In the case of social media influencers, payment will be done according to the categories (A, B, C, D) and the maximum amount prescribed is 2 lakhs for Category A. There is further sub-classification created based on the different social media platforms (YouTube, Facebook and Instagram, Twitter), and the rates for the same are determined based on the type of content and duration of the same. 6. **Grounds for cancellation**: Suspension of empanelment may be done on the grounds of hate speech, violent content, cruel and insensitive content, false/fake news, anti-state/anti-national content sharing, misrepresentation and any other objectionable material. Indulging in these activities after empanelment will make the entity liable for cancellation of the empanelment and penal action. Grounds for cancellation such as \"anti-state/anti-national content\" and \"false/fake News\" lack specificity and open the door to potential misuse and arbitrary as well as subjective enforcement. The Policy also lacks safeguards or checks, such as an independent committee for content review, publication of cancellation orders, or appeal/grievance redressal mechanisms for digital entities. This absence raises concerns about the Policy being misused by the state to promote its preferred narrative online and suppress speech that it finds unfavourable or unpalatable. It also includes provisions for penal action but does not provide details about the action that can be taken. Such an overreaching provision may have chilling effects on online speech and freedom of speech and expression. # States with unpublished digital media policies As per media reports, similar initiatives to empanel social media influencers to advertise government schemes have also been undertaken by [Rajasthan](https://www.hindustantimes.com/india-news/rajasthan-government-advertises-on-social-media-influencers-for-accessibility-to-social-welfare-schemes-and-assembly-elections-101688153348586.html), [Assam](https://www.northeasttoday.in/2024/02/23/assam-government-likely-to-introduce-social-media-influencer-bill-to-collaborate-with-content-creators/), and [Sikkim](https://yojanaregistration.co.in/sikkim-creatorpreneur-yojana/). However, these policies are not available in the public domain. The failure to publicly provide accessible and comprehensive policy documents undermines the state’s transparency and accountability towards citizens. Publicly available policies are essential to ensure that such programs are implemented fairly and effectively. Clear documentation and open channels for public feedback would help mitigate its potential misuse and ensure its ethical and effective implementation. IFF has filed Right to Information (RTI) applications with [Rajasthan](https://drive.google.com/file/d/19UB3JN03Nwt0q8JDntQwwHlFCG1ljAL_/view), [Assam](https://drive.google.com/file/d/1xBkC9OKtS5mJY56s9NGqKKBd11B7Z167/view) and [Sikkim](https://drive.google.com/file/d/13PPWjf9tOGepaX_v3crON2SBrliDaEwK/view) seeking copies of the policy documents and asking whether a public consultation was conducted for these policies. # Do these models influence free speech and open internet? States’ digital media and influencer policies must be evaluated from a user-centric and rights-based perspective, as they often prioritise government interests over those of users. By rewarding influencers solely based on follower counts and relying on broad, ambiguous contractual terms, these policies undermine expertise and objectivity, creating a biased landscape that favours state-approved narratives. This can lead to self-censorship and moral policing, and stifle creativity and free speech while influencing public perceptions of government policies and welfare schemes. Through such policies, highlighting the government's \"schemes and achievements\" is being financially incentivised and the focus is only on positive government-approved narratives. Legally, there is nothing unsound or wrong with this approach—it is similar to advertising, which government departments routinely engage in themselves. However, public funds are being used to incentivise a certain kind and category of content over the other, which is capable of going ‘viral’ (given the popularity of digital creators involved) and potentially skewing the narrative. This inherently creates an uneven playing field, favouring empanelled influencers over those critical of the government and solely relying on platforms like Meta or YouTube as a source of income. There are a number of transparency concerns with such a model as well, like there may not be an obligation to disclose ads/paid partnerships, and thus the audience may not realise these creators are being paid by the government. While it might get revised in the future, the policies raise concerns in their current form. To ensure transparency, there should be clear disclaimers—and not only vague labels like “paid partnership”—so people clearly understand that a creator is receiving government payouts. The lack of transparency regarding the paid nature of content diminishes users’ ability to make informed choices. Further, those who critique state governments or their initiatives may be sidelined, dominated, or even subjugated, leading to a distorted public discourse where the true implications of the policies and schemes are concealed, and informed debate is stifled. In the case of [*Common Cause v. Union of India*](https://indiankanoon.org/doc/177370809/), the Supreme Court of India laid down guidelines to restrain the Union of India and all state governments from using public funds on government advertisements which are primarily intended to project individual functionaries of the government or a political party. The Court-appointed Committee came up with ‘Guidelines on Content Regulation of Government Advertising’, which mentions 5 principles of content regulation: i) advertising campaigns are to be related to government responsibilities, ii) materials should be presented in an objective, fair and accessible manner and designed to meet the objectives of the campaign, iii) not directed at promoting political interests of a Party, iv) campaigns must be justified and undertaken in an efficient and cost- effective manner and v) advertisements must comply with legal requirements and financial regulations and procedures. For enforcement of these guidelines, the government set up the Committee on Content Regulation in Government Advertising and decided that their implementation would proceed proactively, *suo moto* or on a complaint. However there has been [criticism](https://caravanmagazine.in/government-policy/centre-state-governments-flouting-sc-regulations-government-ads) that the Committee has failed to enforce the guidelines regularly, with the last action probably taken back in [2020](https://pib.gov.in/PressReleasePage.aspx?PRID=1651999). This points to a lack of enforcement mechanisms, which offers no real remedy. Most of the state policies are sprinkled with a vague penalty provision (as it fails to define the terms such as immoral, objectionable etc, exhaustively) which allows for suspension/cancellation of empanelment of those who post objectionable material against the government. The inclusion of such terms creates ambiguity in the enforcement of these policies, and most of these have no redressal system in place to remedy erroneous cancellations. The Ministry of Consumer Affairs released the [Guidelines for Prevention of Misleading Advertisements and Endorsements for Misleading Advertisements, 2022](https://consumeraffairs.nic.in/sites/default/files/file-uploads/latestnews/CCPA%20Notification.pdf), which attempts to promote ethical advertising and consumer protection. These guidelines stipulate the requirements for the content, style, and format of disclaimers that influencers must include in their product ads, introducing a much-required safeguard that furthers transparency. They also mention certain conditions for non-misleading and valid advertisements (“ads”) such as truthful and honest representation. However, is it unclear how these guidelines are operationalised and how effective they are in safeguarding transparency and accountability. The aim of digital media/influencer policies should be to have provisions in place not only to enhance accountability but also to ensure that influencers can engage in open discourse without fear of punitive or disproportionate repercussions. States must create a transparent, equitable, and trustworthy environment that maximises the positive impact of social media influencers, ultimately fostering a healthier online information ecosystem where user interests and rights are respected. PDF: [https://drive.google.com/file/d/14mKOlY\\_oyIQfoo1\\_76O-SWwh7DgL9Fwa/view](https://drive.google.com/file/d/14mKOlY_oyIQfoo1_76O-SWwh7DgL9Fwa/view?usp=sharing) Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/) #",
    "light_cleaned_comments": "Not being rude but It's difficult to read it all on a working day, can you provide a carousel post or TLDR and then for people who wanted to know more can read in detail. Hi! Thank you for the feedback and we hear you! We have helpful a carousel post on our Instagram and a short thread on Twitter (or Mastodon or BSky if those are more your thing). Links: IG: @/internetfreedom.in Twitter: [https://twitter.com/internetfreedom/status/1854421555624988929](https://twitter.com/internetfreedom/status/1854421555624988929) Mastodon: [https://mas.to/@internetfreedom/113440430777751818](https://mas.to/@internetfreedom/113440430777751818) BSky: [https://bsky.app/profile/internetfreedom.mas.to.ap.brid.gy/post/3ladpjhp6byw2](https://bsky.app/profile/internetfreedom.mas.to.ap.brid.gy/post/3ladpjhp6byw2)"
}