{
    "id": "154aqqq",
    "title": "Views on this. Such a high taxes in our country fair? and what is the condition in other nations?",
    "url": "https://www.businesstoday.in/amp/latest/trends/story/working-12-hours-a-day-to-pay-over-50-of-my-income-as-tax-bengaluru-based-e-commerce-employee-vents-out-frustration-390301-2023-07-18",
    "selftext": "Goyal's tweet, which garnered huge traction, read, \"Today I earned Rs 5,000. I had to give 30 percent to the government as tax.\" He further lamented about the additional 28 percent tax he had to pay when buying caffeinated beverages from his remaining income. His frustration was palpable as he stated, \"I realised I am working 12 hrs a day just to pay more than 50 percent of my income to the government.\"",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1689810016.0,
    "convurl": "https://external-preview.redd.it/a2lJuZnjmqtuF4k8BnYYSJMU1WhZHI0-BuJ7bf5mPS0.jpg?auto=webp&s=0a7931e09ce5e46b6e656b63ac359ccb077fbc67",
    "comments": [
        "Just check his other tweets .. the guy is a pure bhakt .. but now when the Bhakti is hurting his pocket .. he is doling out the gyan.\n\nYes the govt it looting us in form of high income tax, high GST, incredibly high tax on petrol .. yet he will keep voting for them. So what does he expect."
    ],
    "cleaned_text": "views high taxes country fair condition nations goyals tweet garnered huge traction read today earned rs give percent government tax lamented additional percent tax pay buying caffeinated beverages remaining income frustration palpable stated realised working hrs day pay percent income government ",
    "cleaned_title": "views high taxes country fair condition nations",
    "cleaned_selftext": "goyals tweet garnered huge traction read today earned rs give percent government tax lamented additional percent tax pay buying caffeinated beverages remaining income frustration palpable stated realised working hrs day pay percent income government",
    "cleaned_comments": "check tweets guy pure bhakt bhakti hurting pocket doling gyan yes govt looting us form high income tax high gst incredibly high tax petrol yet keep voting expect",
    "light_cleaned_title": "Views on this. Such a high taxes in our country fair? and what is the condition in other nations?",
    "light_cleaned_selftext": "Goyal's tweet, which garnered huge traction, read, \"Today I earned Rs 5,000. I had to give 30 percent to the government as tax.\" He further lamented about the additional 28 percent tax he had to pay when buying caffeinated beverages from his remaining income. His frustration was palpable as he stated, \"I realised I am working 12 hrs a day just to pay more than 50 percent of my income to the government.\"",
    "light_cleaned_comments": "Just check his other tweets .. the guy is a pure bhakt .. but now when the Bhakti is hurting his pocket .. he is doling out the gyan. Yes the govt it looting us in form of high income tax, high GST, incredibly high tax on petrol .. yet he will keep voting for them. So what does he expect."
}