{
    "id": "18u6rpu",
    "title": "Bajaj Finance faces backlash over excessive pesky calls, messages",
    "url": "https://entrackr.com/2023/03/bajaj-finance-faces-backlash-over-excessive-pesky-calls-messages/",
    "selftext": "They are pushing so much debt down people's throats, govt barely doing anything to stop these scammers",
    "flair": "Crime",
    "score": 370,
    "num_comments": 45,
    "created_utc": 1703910187.0,
    "convurl": "https://external-preview.redd.it/C2o-kr7uybdnFKwjR_QaKzsCxv2pXa8LmaIo3ktzweE.jpg?auto=webp&s=2c5945158583f41cbd935a7bb40e0f08f366f6ec",
    "comments": [
        "2 calls everyday from these scammers",
        "Gotten so used to them now if they don't call I think I'm poor or dead.",
        "Indian Fintch is a great growth story, till one looks beneath the surface - it is all about predatory lending and high rates of interest!",
        "I would like to personally punch the person in the face who decided to do that.",
        "Didn't their CEO threaten just a few months back that if people hate their cold calls so much they'll stop but then don't go back to them ever for a loan?\n\nGuess he was just full of hot air",
        "Man I recently booked a doctor's appointment on Practo and instantly received a summary of the appointment on WhatsApp through Bajaj Finserv! It's crazy how even the health data is not secure anymore",
        "I received so many calls from them but after some dodging & threatening they have stopped calling. Still receive messages though.",
        "My Blocklist is filled with Bajaj finance spam calls. But they find new numbers everyday",
        "Share their ceo phone number and let them scam him.\n\nhttps://www.aboutbajajfinserv.com/finance-investor-relations-shareholders-information-listing-on-stock-exchange",
        "I got a message from Bajaj Finance, \"Your loan application has been approved...\"\n\nI never applied for it. Naturally, I panicked, thinking someone else used my details/id for a loan application. I contacted their customer care. I was told that the loan was pre-approved in case I wanted it and that I had misunderstood the text. I insisted there was no application and the text was misguiding. I felt like suing them for causing me stress and anxiety.",
        "He's famous, owner of Bajaj finance",
        "These great stories are just that. Next they will celebrate rise of diabetes and heart attacks as great growth story for healthcare spending",
        "Haha brilliant idea",
        "Am I the only lucky one who never got a call from them? Luckily all the SMSs they sent go into my spam folder, so I nevet even get their notifications.",
        "Regular calls from past 3-4 days, and messages to so many of them.",
        "Receive these calls and put it in front of the TV.",
        "I get these calls in waves. There will be no calls for a couple of days and then non-stop calls for the next few days.\n\n\nIs there something we as consumers can do about this? I've paid off the loan I took from them over 4.5 years back and still being bombarded with calls. Anywhere we can complain? Or anything we can do to reduce the calls, if not stop them?",
        "Those approved ones are spam messages, they send you a link with which takes you to the loan application",
        "In which case I'd like to take him down into a basement, tie his hands behind his back, and make him listen to those bloody pesky calls all day long. And all night. And so on.",
        "That is a whopping revenue for telecom companies. Why do they still feel in cringy and stingy to pay the license fees and statutory demands to the government?",
        "Aren't you being cruel for/on your phone though? My block-list is always empty. However all such pesky calls are handled by handing them over to DoT India (TRAI) DND  app every night before retiring to the bed. That has become a sleep-time ritual for some time now.",
        "I pick these calls up and mute the phone. They keep chanting 'Hello Hello' from 30 seconds (minimum) to some callers who persist till 1 minute 25 seconds and then hung up.\n\nMy intent is to generate as much revenue for the telecom companies using the telemarketing organizations so that they tide over their fiscal deficits.",
        "Once I got a call from Bajaj Finance and then the call was in progress another spam call from CpGrams Feedback Solicitation came in. Just opted to merge them in as a conference call and I went muted to just sit back and watch an Audio Tom and Jerry show between the unsolicited callers.",
        "They always bypass dnd. So blocking is better.",
        "Thank God I didn't choose practo for hospital information management system",
        "Actually they don't bypass. They trespass to violate both the laws of land and individual privacy. \n\nThey have a high number of disposable numbers. So when something gets blocked just throw the SIM and put another with them. So effectively by making them talk to themselves as much as possible (pick up the call and mute yourself) to themselves without getting a reply then after a max of 75 seconds they will hang up themselves. Then you can report the same to close **that** number.\n\nThe only caveat is that more number of plastic SIM cards might get used up as degenerative trend of eco-friendliness.",
        "There is a TRAI Dnd app. Report the spam number on their app.",
        "I receive spam emails from them. Very annoying!",
        "https://play.google.com/store/apps/details?id=trai.gov.in.dnd\n\nFor Android download this app.\n\nFollow below instructions.\n\n1) register your number which you want to stop all the marketing and advertising calls\n2) Enable full DND (you will get transaction sms no problem)\n3) when ever you get a call from bank say Bajaj finance or a robo call then go to app and select the number then select the appropriate option and report it. It's bit manual but worth it.\n4) Don't expect everything will be good in few days or months. It took me a year to get rid of this.\n\n5) No when I get any call I say them that my number is full DND registered and will complaint against your number now, your services will be stopped.\n\nIt's bit time consuming but not I'm having peaceful life.",
        "Predatory lending is something most of us don't realise, unless it's too late.",
        "This reminds me, are you okay?",
        "This!",
        "They kept calling that a 5 lakh loan was approved on my name and can avail it at 12%/annum interest for 5 year term. When i visited their office, the mfer told me that I’m only eligible for 2.2 lakhs and at 38% interest per year and was forcing me to take that deal. This company and its employees are f**king predators.",
        "They should do the same for Byjus too",
        "Last month I got a few emails regarding a pre-approved loan from a company named Zype and another named Fibe.  \n\nThe email stated that I was the one who requested a loan and a certain amount is pre-approved which I can use instantly by downloading their app.\n\n\nAlso got an email regarding my credit score being pulled up...the email I'd was alerts@crifhighmark.com. \n\nI called up one of the companies Customer care to check if my details were being misused but got a response that it's a mass email sent out by their company.  \n\nCan I report them to any govt authority for pulling out my credit score without my consent?",
        "Wait till ABHA ID becomes mandatory.",
        "How's Jio not on that list?",
        "I think ABDM is a good initiative but the security aspect of it is what's most concerning to even imagine. Security aspect of it aside, it has so much uses",
        "Good luck trying to get any insurance plan once its implemented. Everyone would require you to give your lifetime medical history and they'll make you pay premiums.",
        "Nothing happens",
        "Do they do predatory lending?",
        "Bane of capitalism. They screw up healthcare and education. Two core industries that are essential and core to human development. US is a live example of this. Everyone thinks US has a great healthcare but it only works for the rich. We all know about US education, they import doctors and engineers."
    ],
    "cleaned_text": "bajaj finance faces backlash excessive pesky calls messages pushing much debt peoples throats govt barely anything stop scammers ",
    "cleaned_title": "bajaj finance faces backlash excessive pesky calls messages",
    "cleaned_selftext": "pushing much debt peoples throats govt barely anything stop scammers",
    "cleaned_comments": "calls everyday scammers gotten used dont call think im poor dead indian fintch great growth story till one looks beneath surface predatory lending high rates interest would like personally punch person face decided didnt ceo threaten months back people hate cold calls much theyll stop dont go back ever loan guess full hot air man recently booked doctors appointment practo instantly received summary appointment whatsapp bajaj finserv crazy even health data secure anymore received many calls dodging threatening stopped calling still receive messages though blocklist filled bajaj finance spam calls find new numbers everyday share ceo phone number let scam got message bajaj finance loan application approved never applied naturally panicked thinking someone else used detailsid loan application contacted customer care told loan preapproved case wanted misunderstood text insisted application text misguiding felt like suing causing stress anxiety hes famous owner bajaj finance great stories next celebrate rise diabetes heart attacks great growth story healthcare spending haha brilliant idea lucky one never got call luckily smss sent go spam folder nevet even get notifications regular calls past days messages many receive calls put front tv get calls waves calls couple days nonstop calls next days something consumers ive paid loan took years back still bombarded calls anywhere complain anything reduce calls stop approved ones spam messages send link takes loan application case id like take basement tie hands behind back make listen bloody pesky calls day long night whopping revenue telecom companies still feel cringy stingy pay license fees statutory demands government arent cruel foron phone though blocklist always empty however pesky calls handled handing dot india trai dnd app every night retiring bed become sleeptime ritual time pick calls mute phone keep chanting hello hello seconds minimum callers persist till minute seconds hung intent generate much revenue telecom companies using telemarketing organizations tide fiscal deficits got call bajaj finance call progress another spam call cpgrams feedback solicitation came opted merge conference call went muted sit back watch audio tom jerry show unsolicited callers always bypass dnd blocking better thank god didnt choose practo hospital information management system actually dont bypass trespass violate laws land individual privacy high number disposable numbers something gets blocked throw sim put another effectively making talk much possible pick call mute without getting reply max seconds hang report close number caveat number plastic sim cards might get used degenerative trend ecofriendliness trai dnd app report spam number app receive spam emails annoying android download app follow instructions register number want stop marketing advertising calls enable full dnd get transaction sms problem ever get call bank say bajaj finance robo call go app select number select appropriate option report bit manual worth dont expect everything good days months took year get rid get call say number full dnd registered complaint number services stopped bit time consuming im peaceful life predatory lending something us dont realise unless late reminds okay kept calling lakh loan approved name avail annum interest year term visited office mfer told im eligible lakhs interest per year forcing take deal company employees fking predators byjus last month got emails regarding preapproved loan company named zype another named fibe email stated one requested loan certain amount preapproved use instantly downloading app also got email regarding credit score pulled upthe email id alertscrifhighmarkcom called one companies customer care check details misused got response mass email sent company report govt authority pulling credit score without consent wait till abha id becomes mandatory hows jio list think abdm good initiative security aspect whats concerning even imagine security aspect aside much uses good luck trying get insurance plan implemented everyone would require give lifetime medical history theyll make pay premiums nothing happens predatory lending bane capitalism screw healthcare education two core industries essential core human development us live example everyone thinks us great healthcare works rich know us education import doctors engineers",
    "light_cleaned_title": "Bajaj Finance faces backlash over excessive pesky calls, messages",
    "light_cleaned_selftext": "They are pushing so much debt down people's throats, govt barely doing anything to stop these scammers",
    "light_cleaned_comments": "2 calls everyday from these scammers Gotten so used to them now if they don't call I think I'm poor or dead. Indian Fintch is a great growth story, till one looks beneath the surface - it is all about predatory lending and high rates of interest! I would like to personally punch the person in the face who decided to do that. Didn't their CEO threaten just a few months back that if people hate their cold calls so much they'll stop but then don't go back to them ever for a loan? Guess he was just full of hot air Man I recently booked a doctor's appointment on Practo and instantly received a summary of the appointment on WhatsApp through Bajaj Finserv! It's crazy how even the health data is not secure anymore I received so many calls from them but after some dodging & threatening they have stopped calling. Still receive messages though. My Blocklist is filled with Bajaj finance spam calls. But they find new numbers everyday Share their ceo phone number and let them scam him. I got a message from Bajaj Finance, \"Your loan application has been approved...\" I never applied for it. Naturally, I panicked, thinking someone else used my details/id for a loan application. I contacted their customer care. I was told that the loan was pre-approved in case I wanted it and that I had misunderstood the text. I insisted there was no application and the text was misguiding. I felt like suing them for causing me stress and anxiety. He's famous, owner of Bajaj finance These great stories are just that. Next they will celebrate rise of diabetes and heart attacks as great growth story for healthcare spending Haha brilliant idea Am I the only lucky one who never got a call from them? Luckily all the SMSs they sent go into my spam folder, so I nevet even get their notifications. Regular calls from past 3-4 days, and messages to so many of them. Receive these calls and put it in front of the TV. I get these calls in waves. There will be no calls for a couple of days and then non-stop calls for the next few days. Is there something we as consumers can do about this? I've paid off the loan I took from them over 4.5 years back and still being bombarded with calls. Anywhere we can complain? Or anything we can do to reduce the calls, if not stop them? Those approved ones are spam messages, they send you a link with which takes you to the loan application In which case I'd like to take him down into a basement, tie his hands behind his back, and make him listen to those bloody pesky calls all day long. And all night. And so on. That is a whopping revenue for telecom companies. Why do they still feel in cringy and stingy to pay the license fees and statutory demands to the government? Aren't you being cruel for/on your phone though? My block-list is always empty. However all such pesky calls are handled by handing them over to DoT India (TRAI) DND app every night before retiring to the bed. That has become a sleep-time ritual for some time now. I pick these calls up and mute the phone. They keep chanting 'Hello Hello' from 30 seconds (minimum) to some callers who persist till 1 minute 25 seconds and then hung up. My intent is to generate as much revenue for the telecom companies using the telemarketing organizations so that they tide over their fiscal deficits. Once I got a call from Bajaj Finance and then the call was in progress another spam call from CpGrams Feedback Solicitation came in. Just opted to merge them in as a conference call and I went muted to just sit back and watch an Audio Tom and Jerry show between the unsolicited callers. They always bypass dnd. So blocking is better. Thank God I didn't choose practo for hospital information management system Actually they don't bypass. They trespass to violate both the laws of land and individual privacy. They have a high number of disposable numbers. So when something gets blocked just throw the SIM and put another with them. So effectively by making them talk to themselves as much as possible (pick up the call and mute yourself) to themselves without getting a reply then after a max of 75 seconds they will hang up themselves. Then you can report the same to close **that** number. The only caveat is that more number of plastic SIM cards might get used up as degenerative trend of eco-friendliness. There is a TRAI Dnd app. Report the spam number on their app. I receive spam emails from them. Very annoying! For Android download this app. Follow below instructions. 1) register your number which you want to stop all the marketing and advertising calls 2) Enable full DND (you will get transaction sms no problem) 3) when ever you get a call from bank say Bajaj finance or a robo call then go to app and select the number then select the appropriate option and report it. It's bit manual but worth it. 4) Don't expect everything will be good in few days or months. It took me a year to get rid of this. 5) No when I get any call I say them that my number is full DND registered and will complaint against your number now, your services will be stopped. It's bit time consuming but not I'm having peaceful life. Predatory lending is something most of us don't realise, unless it's too late. This reminds me, are you okay? This! They kept calling that a 5 lakh loan was approved on my name and can avail it at 12%/annum interest for 5 year term. When i visited their office, the mfer told me that I’m only eligible for 2.2 lakhs and at 38% interest per year and was forcing me to take that deal. This company and its employees are f**king predators. They should do the same for Byjus too Last month I got a few emails regarding a pre-approved loan from a company named Zype and another named Fibe. The email stated that I was the one who requested a loan and a certain amount is pre-approved which I can use instantly by downloading their app. Also got an email regarding my credit score being pulled up...the email I'd was alerts@crifhighmark.com. I called up one of the companies Customer care to check if my details were being misused but got a response that it's a mass email sent out by their company. Can I report them to any govt authority for pulling out my credit score without my consent? Wait till ABHA ID becomes mandatory. How's Jio not on that list? I think ABDM is a good initiative but the security aspect of it is what's most concerning to even imagine. Security aspect of it aside, it has so much uses Good luck trying to get any insurance plan once its implemented. Everyone would require you to give your lifetime medical history and they'll make you pay premiums. Nothing happens Do they do predatory lending? Bane of capitalism. They screw up healthcare and education. Two core industries that are essential and core to human development. US is a live example of this. Everyone thinks US has a great healthcare but it only works for the rich. We all know about US education, they import doctors and engineers."
}