{
    "id": "165wtd3",
    "title": "Pakistan Is My Second Favourite Country Says Mani Shankar Aiyar | Karan Thapar Interview",
    "url": "https://youtu.be/H6VMu-ep37c?feature=shared",
    "selftext": "Karan Thapar handles Mani Shankar Aiyar with kid's gloves.\nForgets to ask his reaction on events when Pak backstabbed in Kargil, Pathankot, etc.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 13,
    "created_utc": 1693444625.0,
    "convurl": "https://external-preview.redd.it/UKZfHnP7TKyqEI-UkIrRrG5LvHuphrGkevzCblSbNCk.jpg?auto=webp&s=5a9661131fbdbb39acb5d528d6f9ca51e265988b",
    "comments": [
        "I like Karan Thapar's interview of Modi the most. The water drinking incident. 🤣\n\nIf you think about it, some of our neighboring countries are pretty cool places to visit for normies. If you are a cult follower of a slush flower party or drink the kool aid the media feeds you, you will have a bad time.",
        ">This time if he turns up\n\n🤣🤣",
        "What a clown",
        "During each of those incidents you mentioned- Kargil, Pathankot etc., Mani Shankar Aiyar was not involved in any official capacity within the Government nor was his party involved in the Government. \nTherefore, he will not be held to account on the action taken by the Government of the day. \n\nRun of the mill bullshit by an average Tatti Squeaks user.",
        "Maybe someone told you that Pakistan's 200 million people together attacked Kargil. And then Pathankot. \n\nBut no one told me that. I assumed that Pakistan is a country of normal people, who we have a shared history with, not to mention similar culture as well. \n\nMaybe it is natural for you to hate a whole country for the actions of its government? But Mani seems to be a normal human being, with a normal thinking capacity that he is using to reach normal conclusions.",
        "Pakistan’s relations with its neighbor remain tense, and over the last five years Pakistani attitudes towards India have become more negative. Currently, only 14% of Pakistanis see India in a positive light, while 75% give the country an unfavorable rating. A majority of Pakistanis consider India a more serious threat to their country than al Qaeda or the Taliban.\n\nPew research center. \nhttps://www.pewresearch.org/global/2011/06/21/chapter-6-how-pakistanis-and-indians-view-each-other/",
        "Same article\n\n> Likewise, Indian attitudes toward Pakistan are generally negative – 65% express an unfavorable opinion of Pakistan and a plurality considers Pakistan the greatest threat to their country.\n\n> Despite the tensions, Pakistanis and Indians agree that it is important to improve relations between the two nations. Publics in both countries are supportive of additional diplomatic talks and stronger trade ties across the border.",
        "I think every Indian should see the farce of Pakistan.\nPakistani people are friendly as long as you stay as a guest, the moment you ask them questions they will throw you out.\n\nMani Shankar mentions an incident where he would have been thrown out from Pakistan but one his colleague had to bear the brunt and later he came to know that he was spared because he stayed in his lane. \n\nWhile the whole nation of Pak  didn't attack India they wholeheartedly support Jihad, beheading kafirs and this Gaza-e-hind concepts. They donate to all these extremist groups. These attacks on India came at a time when India had extend a warm hand of friendship. ABV had gone to minar-e-pakistan and said that we acknowledge existence of Pakistan a long standing demand of Pakistanis. It is they who don't want peace. \n\nA diplomats life is highly curated, his daily schedule, people he will meet, etc is with the permission of the host nation. Aiyar has not met one Mulla and asked what he thinks of Gazwa-e-hind, or travelled in the interior parts where radicalization is very high.",
        "I'd like to see some sources for All Pakistanis supporting\n\n>  support Jihad, beheading kafirs and this Gaza-e-hind concepts. They donate to all these extremist groups\n\nFrom what I gather most muslims, leave pakistanis, have never heard of this \"gaza-e-hind\" concept.",
        "Mani Shankar Iyer trolled Narasimha Rao recently with some book, Rao saved me from a life to Iyers socialist paradise so he does not have much credibility in front of my eyes. Additionally and more controversially his relative was accused of rape in Singapore and new reports indicate heavy pressure from his cronies to free him and at one point indicating it will affect India , Singapore relations.\n\nSource:\n\nAiyar's counsel, the well-known criminal lawyer [Subhas Anandan](https://en.wikipedia.org/wiki/Subhas_Anandan),  later claimed that Aiyar's family members had \"acted like royalty\" and  threatened that the case could jeopardise relations between Singapore  and India.[\\[8\\]](https://en.wikipedia.org/wiki/Vidya_Shankar_Aiyar#cite_note-8)\n\n[https://en.wikipedia.org/wiki/Vidya\\_Shankar\\_Aiyar](https://en.wikipedia.org/wiki/Vidya_Shankar_Aiyar)",
        "Yes he use to bully Man Mohan Singh as well, it is described in his book \"Accidental PM\".",
        "Yes he use to bully Man Mohan Singh as well, it is described in his book \"Accidental PM\".",
        "https://www.youtube.com/watch?v=2314Yl_8NgA"
    ],
    "cleaned_text": "pakistan second favourite country says mani shankar aiyar karan thapar interview karan thapar handles mani shankar aiyar kids gloves forgets ask reaction events pak backstabbed kargil pathankot etc ",
    "cleaned_title": "pakistan second favourite country says mani shankar aiyar karan thapar interview",
    "cleaned_selftext": "karan thapar handles mani shankar aiyar kids gloves forgets ask reaction events pak backstabbed kargil pathankot etc",
    "cleaned_comments": "like karan thapars interview modi water drinking incident think neighboring countries pretty cool places visit normies cult follower slush flower party drink kool aid media feeds bad time time turns clown incidents mentioned kargil pathankot etc mani shankar aiyar involved official capacity within government party involved government therefore held account action taken government day run mill bullshit average tatti squeaks user maybe someone told pakistans million people together attacked kargil pathankot one told assumed pakistan country normal people shared history mention similar culture well maybe natural hate whole country actions government mani seems normal human normal thinking capacity using reach normal conclusions pakistans relations neighbor remain tense last five years pakistani attitudes towards india become negative currently pakistanis see india positive light give country unfavorable rating majority pakistanis consider india serious threat country al qaeda taliban pew research center article likewise indian attitudes toward pakistan generally negative express unfavorable opinion pakistan plurality considers pakistan greatest threat country despite tensions pakistanis indians agree important improve relations two nations publics countries supportive additional diplomatic talks stronger trade ties across border think every indian see farce pakistan pakistani people friendly long stay guest moment ask questions throw mani shankar mentions incident would thrown pakistan one colleague bear brunt later came know spared stayed lane whole nation pak didnt attack india wholeheartedly support jihad beheading kafirs gazaehind concepts donate extremist groups attacks india came time india extend warm hand friendship abv gone minarepakistan said acknowledge existence pakistan long standing demand pakistanis dont want peace diplomats life highly curated daily schedule people meet etc permission host nation aiyar met one mulla asked thinks gazwaehind travelled interior parts radicalization high id like see sources pakistanis supporting support jihad beheading kafirs gazaehind concepts donate extremist groups gather muslims leave pakistanis never heard gazaehind concept mani shankar iyer trolled narasimha rao recently book rao saved life iyers socialist paradise much credibility front eyes additionally controversially relative accused rape singapore new reports indicate heavy pressure cronies free one point indicating affect india singapore relations source aiyars counsel wellknown criminal lawyer subhas anandanhttpsenwikipediaorgwikisubhasanandan later claimed aiyars family members acted like royalty threatened case could jeopardise relations singapore indiahttpsenwikipediaorgwikividyashankaraiyarcitenote httpsenwikipediaorgwikividyashankaraiyarhttpsenwikipediaorgwikividyashankaraiyar yes use bully man mohan singh well described book accidental pm yes use bully man mohan singh well described book accidental pm",
    "light_cleaned_title": "Pakistan Is My Second Favourite Country Says Mani Shankar Aiyar | Karan Thapar Interview",
    "light_cleaned_selftext": "Karan Thapar handles Mani Shankar Aiyar with kid's gloves. Forgets to ask his reaction on events when Pak backstabbed in Kargil, Pathankot, etc.",
    "light_cleaned_comments": "I like Karan Thapar's interview of Modi the most. The water drinking incident. 🤣 If you think about it, some of our neighboring countries are pretty cool places to visit for normies. If you are a cult follower of a slush flower party or drink the kool aid the media feeds you, you will have a bad time. >This time if he turns up 🤣🤣 What a clown During each of those incidents you mentioned- Kargil, Pathankot etc., Mani Shankar Aiyar was not involved in any official capacity within the Government nor was his party involved in the Government. Therefore, he will not be held to account on the action taken by the Government of the day. Run of the mill bullshit by an average Tatti Squeaks user. Maybe someone told you that Pakistan's 200 million people together attacked Kargil. And then Pathankot. But no one told me that. I assumed that Pakistan is a country of normal people, who we have a shared history with, not to mention similar culture as well. Maybe it is natural for you to hate a whole country for the actions of its government? But Mani seems to be a normal human being, with a normal thinking capacity that he is using to reach normal conclusions. Pakistan’s relations with its neighbor remain tense, and over the last five years Pakistani attitudes towards India have become more negative. Currently, only 14% of Pakistanis see India in a positive light, while 75% give the country an unfavorable rating. A majority of Pakistanis consider India a more serious threat to their country than al Qaeda or the Taliban. Pew research center. Same article > Likewise, Indian attitudes toward Pakistan are generally negative – 65% express an unfavorable opinion of Pakistan and a plurality considers Pakistan the greatest threat to their country. > Despite the tensions, Pakistanis and Indians agree that it is important to improve relations between the two nations. Publics in both countries are supportive of additional diplomatic talks and stronger trade ties across the border. I think every Indian should see the farce of Pakistan. Pakistani people are friendly as long as you stay as a guest, the moment you ask them questions they will throw you out. Mani Shankar mentions an incident where he would have been thrown out from Pakistan but one his colleague had to bear the brunt and later he came to know that he was spared because he stayed in his lane. While the whole nation of Pak didn't attack India they wholeheartedly support Jihad, beheading kafirs and this Gaza-e-hind concepts. They donate to all these extremist groups. These attacks on India came at a time when India had extend a warm hand of friendship. ABV had gone to minar-e-pakistan and said that we acknowledge existence of Pakistan a long standing demand of Pakistanis. It is they who don't want peace. A diplomats life is highly curated, his daily schedule, people he will meet, etc is with the permission of the host nation. Aiyar has not met one Mulla and asked what he thinks of Gazwa-e-hind, or travelled in the interior parts where radicalization is very high. I'd like to see some sources for All Pakistanis supporting > support Jihad, beheading kafirs and this Gaza-e-hind concepts. They donate to all these extremist groups From what I gather most muslims, leave pakistanis, have never heard of this \"gaza-e-hind\" concept. Mani Shankar Iyer trolled Narasimha Rao recently with some book, Rao saved me from a life to Iyers socialist paradise so he does not have much credibility in front of my eyes. Additionally and more controversially his relative was accused of rape in Singapore and new reports indicate heavy pressure from his cronies to free him and at one point indicating it will affect India , Singapore relations. Source: Aiyar's counsel, the well-known criminal lawyer [Subhas Anandan](https://en.wikipedia.org/wiki/Subhas_Anandan), later claimed that Aiyar's family members had \"acted like royalty\" and threatened that the case could jeopardise relations between Singapore and India.[\\[8\\]](https://en.wikipedia.org/wiki/Vidya_Shankar_Aiyar#cite_note-8) [https://en.wikipedia.org/wiki/Vidya\\_Shankar\\_Aiyar](https://en.wikipedia.org/wiki/Vidya_Shankar_Aiyar) Yes he use to bully Man Mohan Singh as well, it is described in his book \"Accidental PM\". Yes he use to bully Man Mohan Singh as well, it is described in his book \"Accidental PM\"."
}