{
    "id": "15sj1ud",
    "title": "Need help claiming warranty on HP Laptop",
    "url": "https://twitter.com/RaoulDSouza1/status/1688821584788963329?t=4G2wzoiBoYVKHhQDCQkHnQ&s=19",
    "selftext": "My sister bought a laptop for ₹55000 in the month of June and by the end of July it suddenly stopped working. Took it to a service center here in hyderabad and they claim that there had been a \"Thermal Event\" and a warranty cannot be claimed. They instead sent us a quote for ₹43000 to replace the mother board. A basic search leads me to believe this is a common occurrence. \n\nI have put this up on twitter and they're giving me the usual run around and i have made no headway till now. At this point we cant afford to shell out another 43k and this has caused my sister to be unable to work in the mean time. \n\nIs there anyway i can get these guys to repair the laptop under warranty? \n\nLink to tweet is posted above for more information. \n\nAny help will be greatly appreciated!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692171822.0,
    "convurl": "https://external-preview.redd.it/QX6DP_c9hhuPCOUA-xehyt8PnLL9YoHFtl0JP9Acv6Q.jpg?auto=webp&s=aae47352fabb76cfdea830225fb940e78e877458",
    "comments": [
        "National Consumer Forum, visit the website or app and complain there."
    ],
    "cleaned_text": "need help claiming warranty hp laptop sister bought laptop month june end july suddenly stopped working took service center hyderabad claim thermal event warranty claimed instead sent us quote replace mother board basic search leads believe common occurrence put twitter theyre giving usual run around made headway till point cant afford shell another k caused sister unable work mean time anyway get guys repair laptop warranty link tweet posted information help greatly appreciated ",
    "cleaned_title": "need help claiming warranty hp laptop",
    "cleaned_selftext": "sister bought laptop month june end july suddenly stopped working took service center hyderabad claim thermal event warranty claimed instead sent us quote replace mother board basic search leads believe common occurrence put twitter theyre giving usual run around made headway till point cant afford shell another k caused sister unable work mean time anyway get guys repair laptop warranty link tweet posted information help greatly appreciated",
    "cleaned_comments": "national consumer forum visit website app complain",
    "light_cleaned_title": "Need help claiming warranty on HP Laptop",
    "light_cleaned_selftext": "My sister bought a laptop for ₹55000 in the month of June and by the end of July it suddenly stopped working. Took it to a service center here in hyderabad and they claim that there had been a \"Thermal Event\" and a warranty cannot be claimed. They instead sent us a quote for ₹43000 to replace the mother board. A basic search leads me to believe this is a common occurrence. I have put this up on twitter and they're giving me the usual run around and i have made no headway till now. At this point we cant afford to shell out another 43k and this has caused my sister to be unable to work in the mean time. Is there anyway i can get these guys to repair the laptop under warranty? Link to tweet is posted above for more information. Any help will be greatly appreciated!",
    "light_cleaned_comments": "National Consumer Forum, visit the website or app and complain there."
}