{
    "id": "12bq8du",
    "title": "110-year-old madrasa and library set ablaze by Hindutva mob during Ram Navami rally in Bihar",
    "url": "https://maktoobmedia.com/india/110-year-old-madrasa-and-library-set-ablaze-by-hindutva-mob-during-ram-navami-rally-in-bihar/",
    "selftext": "The madrasa contained more than 4,500 books which were destroyed in the fire, Mohammad Shahabuddin, the caretaker of the institution said to Maktoob.",
    "flair": "Crime",
    "score": 92,
    "num_comments": 15,
    "created_utc": 1680629537.0,
    "convurl": "https://external-preview.redd.it/ZtuOCREhDyw4UyVWJSwBQaw983WZGitdKjP-sUIiaD0.jpg?auto=webp&v=enabled&s=8414d6f2c6a59567e2e953decbeb415c4983df88",
    "comments": [
        "As bad as Mongols.",
        "Nitish Kumar trying too hard to please the sanghis.",
        "Just very sad the way things are going. Its in the politicians interest to keep this fire burning for political benefits which is destroying our society.. I hope Indian society rises above this..",
        "The place where they burn books, they'll burn people too -    Anonymous.",
        "CuriosAditya or Loruditya?",
        "Moguls are erased from Text books. Now erasing Urdu books.",
        "I dont see a way out anytime soon, as long as there is unemployment. People will always find time to create a ruckus. A free mind is a dangerous mind.",
        "This is so wrong on so many levels, one can't even imagine.",
        "it's just been 90 years. history is rhyming again\nno one told them about the place.where they burn the books they burn humans too.\n\nrefer https://www.ushmm.org/collections/bibliography/1933-book-burnings\n\nthe similarity is astonishing.\njust the names of actors have changed. the act is still the same\n\nexcerpt :\n\nOn May 10, 1933 student groups at universities across Germany carried out a series of book burnings of works that the students and leading Nazi party members associated with an “un-German spirit.” Enthusiastic crowds witnessed the burning of books by Brecht, Einstein, Freud, Mann and Remarque, among many other well-known intellectuals, scientists and cultural figures, many of whom were Jewish. The largest of these book bonfires occurred in Berlin, where an estimated 40,000 people gathered to hear a speech by the propaganda minister, Joseph Goebbels, in which he pronounced that “Jewish intellectualism is dead” and endorsed the students’ “right to clean up the debris of the past.” ",
        "*school books\n\n[The job of erasing Urdu books has been given to the National Council for the Promotion of Urdu Language.](https://thewire.in/government/is-there-a-conspiracy-in-the-works-to-halt-the-promotion-of-urdu)",
        "They already do.",
        "India in a nutshell."
    ],
    "cleaned_text": "yearold madrasa library set ablaze hindutva mob ram navami rally bihar madrasa contained books destroyed fire mohammad shahabuddin caretaker institution said maktoob ",
    "cleaned_title": "yearold madrasa library set ablaze hindutva mob ram navami rally bihar",
    "cleaned_selftext": "madrasa contained books destroyed fire mohammad shahabuddin caretaker institution said maktoob",
    "cleaned_comments": "bad mongols nitish kumar trying hard please sanghis sad way things going politicians interest keep fire burning political benefits destroying society hope indian society rises place burn books theyll burn people anonymous curiosaditya loruditya moguls erased text books erasing urdu books dont see way anytime soon long unemployment people always find time create ruckus free mind dangerous mind wrong many levels one cant even imagine years history rhyming one told placewhere burn books burn humans refer similarity astonishing names actors changed act still excerpt may student groups universities across germany carried series book burnings works students leading nazi party members associated ungerman spirit enthusiastic crowds witnessed burning books brecht einstein freud mann remarque among many wellknown intellectuals scientists cultural figures many jewish largest book bonfires occurred berlin estimated people gathered hear speech propaganda minister joseph goebbels pronounced jewish intellectualism dead endorsed students right clean debris past school books job erasing urdu books given national council promotion urdu languagehttpsthewireingovernmentisthereaconspiracyintheworkstohaltthepromotionofurdu already india nutshell",
    "light_cleaned_title": "110-year-old madrasa and library set ablaze by Hindutva mob during Ram Navami rally in Bihar",
    "light_cleaned_selftext": "The madrasa contained more than 4,500 books which were destroyed in the fire, Mohammad Shahabuddin, the caretaker of the institution said to Maktoob.",
    "light_cleaned_comments": "As bad as Mongols. Nitish Kumar trying too hard to please the sanghis. Just very sad the way things are going. Its in the politicians interest to keep this fire burning for political benefits which is destroying our society.. I hope Indian society rises above this.. The place where they burn books, they'll burn people too - Anonymous. CuriosAditya or Loruditya? Moguls are erased from Text books. Now erasing Urdu books. I dont see a way out anytime soon, as long as there is unemployment. People will always find time to create a ruckus. A free mind is a dangerous mind. This is so wrong on so many levels, one can't even imagine. it's just been 90 years. history is rhyming again no one told them about the place.where they burn the books they burn humans too. refer the similarity is astonishing. just the names of actors have changed. the act is still the same excerpt : On May 10, 1933 student groups at universities across Germany carried out a series of book burnings of works that the students and leading Nazi party members associated with an “un-German spirit.” Enthusiastic crowds witnessed the burning of books by Brecht, Einstein, Freud, Mann and Remarque, among many other well-known intellectuals, scientists and cultural figures, many of whom were Jewish. The largest of these book bonfires occurred in Berlin, where an estimated 40,000 people gathered to hear a speech by the propaganda minister, Joseph Goebbels, in which he pronounced that “Jewish intellectualism is dead” and endorsed the students’ “right to clean up the debris of the past.” *school books [The job of erasing Urdu books has been given to the National Council for the Promotion of Urdu Language.](https://thewire.in/government/is-there-a-conspiracy-in-the-works-to-halt-the-promotion-of-urdu) They already do. India in a nutshell."
}