{
    "id": "10g2pwc",
    "title": "Deccan herald on Anurag Thakur",
    "url": "https://www.reddit.com/r/india/comments/10g2pwc/deccan_herald_on_anurag_thakur/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/z1unfqnzc0da1.png?width=700&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=15f6dbaff2acd519d6e6780639ff5ae6326e08c1",
    "flair": "Politics",
    "score": 12,
    "num_comments": 1,
    "created_utc": 1674137602,
    "convurl": "https://b.thumbs.redditmedia.com/ePrL4Ot8cJ2NyawOgGPG7xP25frp_N-5oTlvkb0NMHk.jpg",
    "comments": [
        "It's very pathetic how RSS wants to rewrite history. During independence they thought Muslims and Christians were more of a threat to India than the Brits. They never took part in the struggle so, they don't have anyone to look up to. To entice this they make up shit about Bhagat Singh, Sardar Vallabhbhai Patel and Netaji. The things is all of them thought highly of Gandhi and Nehru even if they had disagreements.\n\nThey would have hated what we have become. They would kick RSS and Hindu nationalists scum to a curb."
    ],
    "cleaned_text": "deccan herald anurag thakur ampxb ",
    "cleaned_title": "deccan herald anurag thakur",
    "cleaned_selftext": "ampxb",
    "cleaned_comments": "pathetic rss wants rewrite history independence thought muslims christians threat india brits never took part struggle dont anyone look entice make shit bhagat singh sardar vallabhbhai patel netaji things thought highly gandhi nehru even disagreements would hated become would kick rss hindu nationalists scum curb",
    "light_cleaned_title": "Deccan herald on Anurag Thakur",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "It's very pathetic how RSS wants to rewrite history. During independence they thought Muslims and Christians were more of a threat to India than the Brits. They never took part in the struggle so, they don't have anyone to look up to. To entice this they make up shit about Bhagat Singh, Sardar Vallabhbhai Patel and Netaji. The things is all of them thought highly of Gandhi and Nehru even if they had disagreements. They would have hated what we have become. They would kick RSS and Hindu nationalists scum to a curb."
}