{
    "id": "1gskqol",
    "title": "Bookmyshow is incompetent and should be avoided. ",
    "url": "https://www.reddit.com/r/india/comments/1gskqol/bookmyshow_is_incompetent_and_should_be_avoided/",
    "selftext": "I had booked tickets for Abhishek Upmanyu's show that was supposed to be on 16th November 2024, [tickets](https://imgur.com/a/b8SFtf7). Today I check the the tickets again on the mail, to set the GPS, and thought of clicking the view tickets button. I clicked on view tickets and it said [this](https://imgur.com/a/lGUdqbV), that the show was on 15th November, and some different location. I check all the mails, and have zero mail unread. And there was no mail saying that the show dates were changed. I contacted bookmyshow and told them the issue that I was not informed about this, and they said that we sent you a SMS on 8th October, [here](https://imgur.com/a/UFQrvi1). As I am a normal human being and not a psychopath I don't read all the SMSs that I get, only the important ones like OTPs. Are we living in 2005 that they only have to updated via SMS and can't send a mail? And the tickets on the mail are still saying that the dates are 16th Novermber only. Updating such an important message that too via SMS and mailing it. \n\n  \nTL;DR Bookmyshow didn't update me via mail that the show was preponed. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1731753759.0,
    "convurl": "https://external-preview.redd.it/VzeeQQoJk6fO_EmqfKkVI5__KnG1Uu5hDvXMEP5suVI.jpg?auto=webp&s=13f7f5847447c47252b2fd373c280ae996e6dab6",
    "comments": [
        "u have a case u can easily win ..go to consumer forum ..",
        "They sent you an SMS. It's your fault here for not looking at it. How is it their fault you don't look at Text Messages? \n\nAlso you're not a \"psychopath\" for reading SMS messages. You never know if someone like your bank sends a fraud alert or any family member in case of emergency sends a message, like if they don't have access to the internet but have service.",
        "Well they did update via SMS here, so they will just say that they did their part, no?",
        "I said that I read the important messages that one gets from banks or delivery OTP, and on is excepting such messaged. And as far as bank messages go, they also send a mail regarding any debit/credit or even password change."
    ],
    "cleaned_text": "bookmyshow incompetent avoided booked tickets abhishek upmanyus show supposed th november ticketshttpsimgurcomabsftf today check tickets mail set gps thought clicking view tickets button clicked view tickets said thishttpsimgurcomalgudqbv show th november different location check mails zero mail unread mail saying show dates changed contacted bookmyshow told issue informed said sent sms th october herehttpsimgurcomaufqrvi normal human psychopath dont read smss get important ones like otps living updated via sms cant send mail tickets mail still saying dates th novermber updating important message via sms mailing tldr bookmyshow didnt update via mail show preponed ",
    "cleaned_title": "bookmyshow incompetent avoided",
    "cleaned_selftext": "booked tickets abhishek upmanyus show supposed th november ticketshttpsimgurcomabsftf today check tickets mail set gps thought clicking view tickets button clicked view tickets said thishttpsimgurcomalgudqbv show th november different location check mails zero mail unread mail saying show dates changed contacted bookmyshow told issue informed said sent sms th october herehttpsimgurcomaufqrvi normal human psychopath dont read smss get important ones like otps living updated via sms cant send mail tickets mail still saying dates th novermber updating important message via sms mailing tldr bookmyshow didnt update via mail show preponed",
    "cleaned_comments": "u case u easily win go consumer forum sent sms fault looking fault dont look text messages also youre psychopath reading sms messages never know someone like bank sends fraud alert family member case emergency sends message like dont access internet service well update via sms say part said read important messages one gets banks delivery otp excepting messaged far bank messages go also send mail regarding debitcredit even password change",
    "light_cleaned_title": "Bookmyshow is incompetent and should be avoided.",
    "light_cleaned_selftext": "I had booked tickets for Abhishek Upmanyu's show that was supposed to be on 16th November 2024, [tickets](https://imgur.com/a/b8SFtf7). Today I check the the tickets again on the mail, to set the GPS, and thought of clicking the view tickets button. I clicked on view tickets and it said [this](https://imgur.com/a/lGUdqbV), that the show was on 15th November, and some different location. I check all the mails, and have zero mail unread. And there was no mail saying that the show dates were changed. I contacted bookmyshow and told them the issue that I was not informed about this, and they said that we sent you a SMS on 8th October, [here](https://imgur.com/a/UFQrvi1). As I am a normal human being and not a psychopath I don't read all the SMSs that I get, only the important ones like OTPs. Are we living in 2005 that they only have to updated via SMS and can't send a mail? And the tickets on the mail are still saying that the dates are 16th Novermber only. Updating such an important message that too via SMS and mailing it. TL;DR Bookmyshow didn't update me via mail that the show was preponed.",
    "light_cleaned_comments": "u have a case u can easily win ..go to consumer forum .. They sent you an SMS. It's your fault here for not looking at it. How is it their fault you don't look at Text Messages? Also you're not a \"psychopath\" for reading SMS messages. You never know if someone like your bank sends a fraud alert or any family member in case of emergency sends a message, like if they don't have access to the internet but have service. Well they did update via SMS here, so they will just say that they did their part, no? I said that I read the important messages that one gets from banks or delivery OTP, and on is excepting such messaged. And as far as bank messages go, they also send a mail regarding any debit/credit or even password change."
}