{
    "id": "1btyqan",
    "title": "Scam Alert.",
    "url": "https://www.reddit.com/gallery/1btyqan",
    "selftext": "Guys, please pay attention to such scams. This guy contacted us wanting to buy our chocolates. Claims that he sent 30K rather than the 3K which he was supposed to. Later kept on following asking us to return 27K.\n\nPoints to note : \n1) No money deposited in account. Please check your statement for these things \n\n2) Do not send back money. Ask them to do so through NPCI. Or highly likely that you will find double deductions soon.\n\n3) The website is legit but the number and photos do not match.\n\n4) Plus what is with the DP? Couldn't he find anything better.\n\nReporting this number to cyber crime, loan websites, credit card websites and insurance.\n\n\nPlease be careful and take care. Think multiple times before sending strangers money. Better to take 2nd and 3rd opinion.",
    "flair": "Crime",
    "score": 39,
    "num_comments": 19,
    "created_utc": 1712064460.0,
    "convurl": "https://i.redd.it/vkquwblmi2sc1.png",
    "comments": [
        "That's the most fake dp I have ever seen. Ruk bhai Mai bhi maze leta hun 😂",
        "Feel free. Daal do jaha dalna he.",
        "I made a call, dude blocked me straight away 😂",
        "Bruh.😂",
        "30 kg chocolate??",
        "3 kg",
        "https://preview.redd.it/zxegizrtq2sc1.png?width=1080&format=pjpg&auto=webp&s=67e6d39f24f2ce7397915a6e5bedbb116cdc93dd",
        "Shared this as proof of payment. Wtf.",
        "U send him similarly in fake way and pls say what happens next will be waiting",
        "Looks like a sasta copy of Johhny sins in the DP! 😂",
        "bro you sell chocolates koi insta id? etc? are they homemade?",
        "https://preview.redd.it/rcb3izb3w2sc1.png?width=1080&format=pjpg&auto=webp&s=25d135b5e7652b99b400a1d2f1b6f616f1183976",
        "It seems he doesn't like your chocolates",
        "Challenge accepted. Give me 2-3 days. Have to prepare.",
        "Haha sending text messages with his number... You also send him and make amount 15Lac \n\nEnding with regards from Modiji",
        "RemindMe! 1 Day",
        "Brother i have only negative balance in my acc wtf are u talking about",
        "leave that, tell us more about your chocolates, where do you sell them, are they homemade, how do we buy?",
        "Lmfao. Using that fake ass dp and then writing \"wait 10 mints\" loll",
        "RCS chat 🤣🤣🤣"
    ],
    "cleaned_text": "scam alert guys please pay attention scams guy contacted us wanting buy chocolates claims sent k rather k supposed later kept following asking us return k points note money deposited account please check statement things send back money ask npci highly likely find double deductions soon website legit number photos match plus dp couldnt find anything better reporting number cyber crime loan websites credit card websites insurance please careful take care think multiple times sending strangers money better take nd rd opinion ",
    "cleaned_title": "scam alert",
    "cleaned_selftext": "guys please pay attention scams guy contacted us wanting buy chocolates claims sent k rather k supposed later kept following asking us return k points note money deposited account please check statement things send back money ask npci highly likely find double deductions soon website legit number photos match plus dp couldnt find anything better reporting number cyber crime loan websites credit card websites insurance please careful take care think multiple times sending strangers money better take nd rd opinion",
    "cleaned_comments": "thats fake dp ever seen ruk bhai mai bhi maze leta hun feel free daal jaha dalna made call dude blocked straight away bruh kg chocolate kg shared proof payment wtf u send similarly fake way pls say happens next waiting looks like sasta copy johhny sins dp bro sell chocolates koi insta id etc homemade seems doesnt like chocolates challenge accepted give days prepare haha sending text messages number also send make amount lac ending regards modiji remindme day brother negative balance acc wtf u talking leave tell us chocolates sell homemade buy lmfao using fake ass dp writing wait mints loll rcs chat",
    "light_cleaned_title": "Scam Alert.",
    "light_cleaned_selftext": "Guys, please pay attention to such scams. This guy contacted us wanting to buy our chocolates. Claims that he sent 30K rather than the 3K which he was supposed to. Later kept on following asking us to return 27K. Points to note : 1) No money deposited in account. Please check your statement for these things 2) Do not send back money. Ask them to do so through NPCI. Or highly likely that you will find double deductions soon. 3) The website is legit but the number and photos do not match. 4) Plus what is with the DP? Couldn't he find anything better. Reporting this number to cyber crime, loan websites, credit card websites and insurance. Please be careful and take care. Think multiple times before sending strangers money. Better to take 2nd and 3rd opinion.",
    "light_cleaned_comments": "That's the most fake dp I have ever seen. Ruk bhai Mai bhi maze leta hun 😂 Feel free. Daal do jaha dalna he. I made a call, dude blocked me straight away 😂 Bruh.😂 30 kg chocolate?? 3 kg Shared this as proof of payment. Wtf. U send him similarly in fake way and pls say what happens next will be waiting Looks like a sasta copy of Johhny sins in the DP! 😂 bro you sell chocolates koi insta id? etc? are they homemade? It seems he doesn't like your chocolates Challenge accepted. Give me 2-3 days. Have to prepare. Haha sending text messages with his number... You also send him and make amount 15Lac Ending with regards from Modiji RemindMe! 1 Day Brother i have only negative balance in my acc wtf are u talking about leave that, tell us more about your chocolates, where do you sell them, are they homemade, how do we buy? Lmfao. Using that fake ass dp and then writing \"wait 10 mints\" loll RCS chat 🤣🤣🤣"
}