{
    "id": "1hccosa",
    "title": "Amid Techie Atul Subhash's Suicide, Amid Techie Suicide Case, Supreme Court Lays Down 8 Factors For Deciding Alimony",
    "url": "https://www.ndtv.com/india-news/amid-techie-atul-subhashs-suicide-supreme-court-lays-down-8-factors-for-deciding-alimony-7227170#pfrom=home-ndtv_topscroll",
    "selftext": "As always we need something drastic for something to happen . This should ideally come from the lawmakers where they should ensure the law is neutral and not to be misused by any litigant",
    "flair": "Law & Courts",
    "score": 12,
    "num_comments": 5,
    "created_utc": 1733976209.0,
    "convurl": "https://external-preview.redd.it/jwjX7xBDyLHRpzyJpaXJfllzeZpKR7DfY3jVRny5nwU.jpg?auto=webp&s=c0cda3b86f2ae862323d73d837d41d5f948048e2",
    "comments": [
        "Laws are laid in India so that corrupt officers, corrupt judges can twist them and take bribes. This is India. After nirbhaya laws were made as if that has been deterrent for brutal rapes.",
        "Alimony law is indeed gender neutral, at least for Hindu and Parsi marriages. But lower courts tend to not follow through on husbands' alimony claims. In 2014 the SC also laid down a 25% of income limit on monthly alimony. Again, not sure how often that limit is maintained in judgements by lower courts. Would be good to see stats on that, actually, but I couldn't find anything.",
        "True enforcement of the law as stated should happen.. No point in just drafting and passing laws....",
        "It’s us. The problem is us citizens who vote criminals to power. They take everything downhill with them."
    ],
    "cleaned_text": "amid techie atul subhashs suicide amid techie suicide case supreme court lays factors deciding alimony always need something drastic something happen ideally come lawmakers ensure law neutral misused litigant ",
    "cleaned_title": "amid techie atul subhashs suicide amid techie suicide case supreme court lays factors deciding alimony",
    "cleaned_selftext": "always need something drastic something happen ideally come lawmakers ensure law neutral misused litigant",
    "cleaned_comments": "laws laid india corrupt officers corrupt judges twist take bribes india nirbhaya laws made deterrent brutal rapes alimony law indeed gender neutral least hindu parsi marriages lower courts tend follow husbands alimony claims sc also laid income limit monthly alimony sure often limit maintained judgements lower courts would good see stats actually couldnt find anything true enforcement law stated happen point drafting passing laws us problem us citizens vote criminals power take everything downhill",
    "light_cleaned_title": "Amid Techie Atul Subhash's Suicide, Amid Techie Suicide Case, Supreme Court Lays Down 8 Factors For Deciding Alimony",
    "light_cleaned_selftext": "As always we need something drastic for something to happen . This should ideally come from the lawmakers where they should ensure the law is neutral and not to be misused by any litigant",
    "light_cleaned_comments": "Laws are laid in India so that corrupt officers, corrupt judges can twist them and take bribes. This is India. After nirbhaya laws were made as if that has been deterrent for brutal rapes. Alimony law is indeed gender neutral, at least for Hindu and Parsi marriages. But lower courts tend to not follow through on husbands' alimony claims. In 2014 the SC also laid down a 25% of income limit on monthly alimony. Again, not sure how often that limit is maintained in judgements by lower courts. Would be good to see stats on that, actually, but I couldn't find anything. True enforcement of the law as stated should happen.. No point in just drafting and passing laws.... It’s us. The problem is us citizens who vote criminals to power. They take everything downhill with them."
}