{
    "id": "1h7h60f",
    "title": "This is Wild!! ",
    "url": "https://www.reddit.com/gallery/1h7h60f",
    "selftext": "So we're practically paying significantly more than an avarage US citizen (LITERALLY in Dollars) to drive on a road twice as slow\n\nThese \"highways\" have an avarage speed of less than 60KMPH for long distance ",
    "flair": "Policy/Economy",
    "score": 74,
    "num_comments": 30,
    "created_utc": 1733426064.0,
    "convurl": "https://i.redd.it/cl8ebyfmx25e1.png",
    "comments": [
        "I thought it's flight ticket",
        "Is this fuel cost or toll cost?",
        "Toll cost",
        "And the fuel cost will be another thriple in that case.",
        "This is too less when compare to what people usually pay , i e approx 100rs for 50km",
        "Thank you Modiji for the shitty expensive roads.",
        "why complain? Didn't we have general election this year.",
        "Take the train.",
        "Sorry complains don't accept here.",
        "criminal",
        "Let’s not forget the time cost which is already double",
        "Most of the highways in US are called Freeways because they are free to use. I am guessing that the cost that you see is if you use certain bridges to cut your trip short.",
        "Get out of here with your honest and correct solution to OP's problem! 😂",
        "They are called freeways because they are access controlled and don't have traffic signals.\nTolled roads(Pikes/Turnpikes) can also be called freeways as long as they are accsss controlled.\nIn India, the Expressways can be considered as Freeways because othe National Highways can have traffic signals and are not access controlled.",
        "Private transport is very expensive in India compared to developed economies like the west.\n\nWe pay shit ton of taxes to own a vehicle - ex showroom includes tax, then registration , insurance tax. After that comes tolls, fuel tax, maintenance, etc.",
        "Good. Move people away from roads and into trains.",
        "Why don't people think about this before election",
        "In US, Public transport is shit except the Northeast corridor area and with the lobby from Oil and Car manufacturers they want people to avoid Public transport and use cars. The Government also charges tax on Gasoline to fund the road maintenance.\nWhile in India, we have pretty decent Railway service and Interstate Bus services, many road construction projects are done in a public private partnership and the only way to recoup the cost is by charging toll.\nNot a fan of either systems, but I miss the convenience of public transport in the US.",
        "In india you'll be driving at 70kmph at night and in the US it's 70MPH - 120kmph at cruise control. \n\nIt's not wild, we dont have that developed infrastructure in India. btw, you're comparing a first world country with a third.",
        "dont believe everything GOOGLE says ... use commonsense...",
        "Madarchod they take 50% of vehicle cost as tax and still charge money to drive on the roads!",
        "It's relative, but these are all costs you pay out thr door when buying a car in the US. And every year (or two years) you have to pay to renew your car registration.",
        "Is it so because of very low numbers of highways in India, as compared to America?",
        "If you couldn't figure out by now...sigh..! Lemme help you out....india IS monetised chaos or monetised disorder ! Simple.\n\nProblems are not to be solved, BY DESIGN! cuz that's one of the ways how an overpopulated country creates money for people. Forget development..lol. its not to happen - on purpose.",
        "The railway works cuz  pre independence  and yes US  never tried to build a railway . \n\nAlso  in northern India because of hude population density the trains are all ways overcrowded also interstate public busses are shit even if compared between states the busses I have seen are like broken and always cranky\n\n the fact is us we don't do much research or accountability the argument just seats in internet or head cuz we don't have the no. where the election are  won cause of whom will get reservation which leaders will give us free xyz and how the opposition are anti religious \n\nJust 24-48hrs a south korea has an emergency declared and martial law imposed but the MPs there had enough accountability to change it again \nI don't think it can happen in India where even if it happens there will me media coverage as the people protesting are not loyal or passionate about our country",
        "Amreeka hai hi kya hamare aage",
        "Because they wanted a temple and got one.\n\nPromises fulfilled. Baaki sab anti-national hey.",
        "Who told you that US never tried to Build a railway. They were the first and they still have the Larget Rail network in the world.\nThe Passenger rail died in US because of the Lobbying by oil/car companies and with the advent of cheap flights. The distance between the cities in theUS also played a negative factor.\nAs far as Public transport goes, We have a decent Railway for a \"3rd world\" country and in my side of the country the Public busses are also very decent.\nAs far as South Korea goes, the Emergency was declared by the President and The parliament changed it with a lot of back room negotiations by the US. Although India is not perfect, with a coalition government in center, it is very difficult to do something like this.",
        "We tried everything.\n\n1) Elections - BJP who literally raised all these tolls are back.\n\n2) Protest -. Get branded as anti national",
        "USD and INR aren’t equivalent currencies, a direct comparison makes no sense. \n\n1 USD is ~84 INR, so it’s still cheaper in India. \n\nKuch bhi lauda lassun stat leke chillane lag jate hai.",
        "Relatively we are paying a lot more. \n\nFor example, 1 gallon of petrol in US is $3 avg, translates to ₹85/litre.\nIn India, average petrol costs ₹100. \n\nNow compare the per capita income in both countries, hence my point. Very expensive in India.",
        "I was referring to the passenger side only my bad I did not mention and yes I know that they have one of the best goods transport network and the distance did factor while for india we should compare it more to words european countries or east asia like SK Japan etc also I believe india can improve and will be one of the best countries it just that we people. Treat politicians as if they had born the right claim to a mp / mla seat it should have been opposite it just how we Indians have in there mind thar there will be always a king which will rule and it from the  ancient time i believe we have change this mindset"
    ],
    "cleaned_text": "wild practically paying significantly avarage us citizen literally dollars drive road twice slow highways avarage speed less kmph long distance ",
    "cleaned_title": "wild",
    "cleaned_selftext": "practically paying significantly avarage us citizen literally dollars drive road twice slow highways avarage speed less kmph long distance",
    "cleaned_comments": "thought flight ticket fuel cost toll cost toll cost fuel cost another thriple case less compare people usually pay e approx rs km thank modiji shitty expensive roads complain didnt general election year take train sorry complains dont accept criminal lets forget time cost already double highways us called freeways free use guessing cost see use certain bridges cut trip short get honest correct solution ops problem called freeways access controlled dont traffic signals tolled roadspikesturnpikes also called freeways long accsss controlled india expressways considered freeways othe national highways traffic signals access controlled private transport expensive india compared developed economies like west pay shit ton taxes vehicle ex showroom includes tax registration insurance tax comes tolls fuel tax maintenance etc good move people away roads trains dont people think election us public transport shit except northeast corridor area lobby oil car manufacturers want people avoid public transport use cars government also charges tax gasoline fund road maintenance india pretty decent railway service interstate bus services many road construction projects done public private partnership way recoup cost charging toll fan either systems miss convenience public transport us india youll driving kmph night us mph kmph cruise control wild dont developed infrastructure india btw youre comparing first world country third dont believe everything google says use commonsense madarchod take vehicle cost tax still charge money drive roads relative costs pay thr door buying car us every year two years pay renew car registration low numbers highways india compared america couldnt figure nowsigh lem help outindia monetised chaos monetised disorder simple problems solved design cuz thats one ways overpopulated country creates money people forget developmentlol happen purpose railway works cuz pre independence yes us never tried build railway also northern india hude population density trains ways overcrowded also interstate public busses shit even compared states busses seen like broken always cranky fact us dont much research accountability argument seats internet head cuz dont election cause get reservation leaders give us free xyz opposition anti religious hrs south korea emergency declared martial law imposed mps enough accountability change dont think happen india even happens media coverage people protesting loyal passionate country amreeka hai hi kya hamare aage wanted temple got one promises fulfilled baaki sab antinational hey told us never tried build railway first still larget rail network world passenger rail died us lobbying oilcar companies advent cheap flights distance cities theus also played negative factor far public transport goes decent railway rd world country side country public busses also decent far south korea goes emergency declared president parliament changed lot back room negotiations us although india perfect coalition government center difficult something like tried everything elections bjp literally raised tolls back protest get branded anti national usd inr arent equivalent currencies direct comparison makes sense usd inr still cheaper india kuch bhi lauda lassun stat leke chillane lag jate hai relatively paying lot example gallon petrol us avg translates litre india average petrol costs compare per capita income countries hence point expensive india referring passenger side bad mention yes know one best goods transport network distance factor india compare words european countries east asia like sk japan etc also believe india improve one best countries people treat politicians born right claim mp mla seat opposite indians mind thar always king rule ancient time believe change mindset",
    "light_cleaned_title": "This is Wild!!",
    "light_cleaned_selftext": "So we're practically paying significantly more than an avarage US citizen (LITERALLY in Dollars) to drive on a road twice as slow These \"highways\" have an avarage speed of less than 60KMPH for long distance",
    "light_cleaned_comments": "I thought it's flight ticket Is this fuel cost or toll cost? Toll cost And the fuel cost will be another thriple in that case. This is too less when compare to what people usually pay , i e approx 100rs for 50km Thank you Modiji for the shitty expensive roads. why complain? Didn't we have general election this year. Take the train. Sorry complains don't accept here. criminal Let’s not forget the time cost which is already double Most of the highways in US are called Freeways because they are free to use. I am guessing that the cost that you see is if you use certain bridges to cut your trip short. Get out of here with your honest and correct solution to OP's problem! 😂 They are called freeways because they are access controlled and don't have traffic signals. Tolled roads(Pikes/Turnpikes) can also be called freeways as long as they are accsss controlled. In India, the Expressways can be considered as Freeways because othe National Highways can have traffic signals and are not access controlled. Private transport is very expensive in India compared to developed economies like the west. We pay shit ton of taxes to own a vehicle - ex showroom includes tax, then registration , insurance tax. After that comes tolls, fuel tax, maintenance, etc. Good. Move people away from roads and into trains. Why don't people think about this before election In US, Public transport is shit except the Northeast corridor area and with the lobby from Oil and Car manufacturers they want people to avoid Public transport and use cars. The Government also charges tax on Gasoline to fund the road maintenance. While in India, we have pretty decent Railway service and Interstate Bus services, many road construction projects are done in a public private partnership and the only way to recoup the cost is by charging toll. Not a fan of either systems, but I miss the convenience of public transport in the US. In india you'll be driving at 70kmph at night and in the US it's 70MPH - 120kmph at cruise control. It's not wild, we dont have that developed infrastructure in India. btw, you're comparing a first world country with a third. dont believe everything GOOGLE says ... use commonsense... Madarchod they take 50% of vehicle cost as tax and still charge money to drive on the roads! It's relative, but these are all costs you pay out thr door when buying a car in the US. And every year (or two years) you have to pay to renew your car registration. Is it so because of very low numbers of highways in India, as compared to America? If you couldn't figure out by now...sigh..! Lemme help you out....india IS monetised chaos or monetised disorder ! Simple. Problems are not to be solved, BY DESIGN! cuz that's one of the ways how an overpopulated country creates money for people. Forget development..lol. its not to happen - on purpose. The railway works cuz pre independence and yes US never tried to build a railway . Also in northern India because of hude population density the trains are all ways overcrowded also interstate public busses are shit even if compared between states the busses I have seen are like broken and always cranky the fact is us we don't do much research or accountability the argument just seats in internet or head cuz we don't have the no. where the election are won cause of whom will get reservation which leaders will give us free xyz and how the opposition are anti religious Just 24-48hrs a south korea has an emergency declared and martial law imposed but the MPs there had enough accountability to change it again I don't think it can happen in India where even if it happens there will me media coverage as the people protesting are not loyal or passionate about our country Amreeka hai hi kya hamare aage Because they wanted a temple and got one. Promises fulfilled. Baaki sab anti-national hey. Who told you that US never tried to Build a railway. They were the first and they still have the Larget Rail network in the world. The Passenger rail died in US because of the Lobbying by oil/car companies and with the advent of cheap flights. The distance between the cities in theUS also played a negative factor. As far as Public transport goes, We have a decent Railway for a \"3rd world\" country and in my side of the country the Public busses are also very decent. As far as South Korea goes, the Emergency was declared by the President and The parliament changed it with a lot of back room negotiations by the US. Although India is not perfect, with a coalition government in center, it is very difficult to do something like this. We tried everything. 1) Elections - BJP who literally raised all these tolls are back. 2) Protest -. Get branded as anti national USD and INR aren’t equivalent currencies, a direct comparison makes no sense. 1 USD is ~84 INR, so it’s still cheaper in India. Kuch bhi lauda lassun stat leke chillane lag jate hai. Relatively we are paying a lot more. For example, 1 gallon of petrol in US is $3 avg, translates to ₹85/litre. In India, average petrol costs ₹100. Now compare the per capita income in both countries, hence my point. Very expensive in India. I was referring to the passenger side only my bad I did not mention and yes I know that they have one of the best goods transport network and the distance did factor while for india we should compare it more to words european countries or east asia like SK Japan etc also I believe india can improve and will be one of the best countries it just that we people. Treat politicians as if they had born the right claim to a mp / mla seat it should have been opposite it just how we Indians have in there mind thar there will be always a king which will rule and it from the ancient time i believe we have change this mindset"
}