{
    "id": "1e2z6aw",
    "title": "P Chidambaram writes: Who will answer the questions?",
    "url": "https://indianexpress.com/article/opinion/columns/p-chidambaram-writes-who-will-answer-the-questions-9451830/",
    "selftext": "(Artile In comments ⬇️) \n\nWhich is the platform to ask the questions and receive answers? No one in the government has answered the questions so far, but the questions will not go away. ",
    "flair": "Law & Courts",
    "score": 23,
    "num_comments": 1,
    "created_utc": 1720953237,
    "convurl": "https://external-preview.redd.it/BRCIYYRjabEXiQtIAqoroQ6U4gs9dqU16gOJ-A9QV-Y.jpg?auto=webp&s=ec0a7efdb4bd360e769e03feedf28e452ee9fe65",
    "comments": [
        "Article \n\nAfter a debate that the Opposition boycotted in both Houses of Parliament (for good reasons), three Bills to replace (and re-enact) the Indian Penal Code, 1860, the Criminal Procedure Code, 1973 and the Indian Evidence Act, 1872 were passed. The new Bills carried names in Hindi (or Sanskrit) even in the English versions of the Bills. The President gave her assent to the Bills and the government notified that the new laws will come into force on July 1, 2024.\n\nThere is stiff opposition to the new laws from many quarters. The government has dismissed the grounds of opposition as irrelevant and motivated. The government’s ram-through approach has not deterred the opposition to the laws. On the contrary, two state governments have declared that they will bring certain amendments in the state legislatures concerned. Tamil Nadu has appointed a one-person committee to suggest the changes within a month. Karnataka and other state governments may adopt the same route. It is therefore necessary to place the facts and the issues before the public and ask the citizens to arrive at their own conclusions.\n\n‘Criminal law’ is a subject in the Concurrent List of the Constitution. Both Parliament and state legislatures are competent to make laws on the subject. Undoubtedly, if a law made by Parliament and a law made by a state legislature are repugnant, Article 254 of the Constitution will be attracted. However, that is an issue that will arise after the state legislature made a law, there was repugnancy, and the President did not give her assent to the law passed by the state legislature.\n\nMeanwhile, the questions raised by those opposing the new laws must be heard and answered. Unfortunately, the central government has refused to answer in Parliament or outside. Here are the questions:\n\n1 Is it correct that the bulk of the provisions of the three new laws have been ‘copied and pasted’ from the three laws that were replaced? Is it correct that 90-95 per cent of the IPC and the CrPC and 95-99 per cent of the Evidence Act have been retained in the new laws and every section re-numbered? If a few additions, deletions and changes were required in the existing laws, could the same outcome not have been achieved through amendments? Is not the claim that the government has thrown out the ‘colonial legacy’ a hollow claim?\n\n2 If the intention was a thorough revision and overhaul of the criminal laws, why was the time-honoured practice to make a reference to the Law Commission not followed? Was not the Law Commission the most suitable body to consult all stakeholders and submit its recommendations, together with draft Bills, for the consideration of the government and Parliament? Why was the Law Commission by-passed and the task entrusted to a Committee that consisted of part-time members who, save one, were employed as full-time professors in various Universities?\n\n3 Are the new laws consistent with the modern principles of criminal jurisprudence? Have the new laws recognised and incorporated the progressive principles laid down by the Supreme Court in landmark judgments delivered in the last 10 years? Are several provisions of the new laws contrary to the Constitution of India as interpreted by the Supreme Court?\n\n4 Why has the new law retained ‘death penalty’ that has been abolished in many democratic countries? Why has the cruel and dehumanising punishment of ‘solitary confinement’ been introduced? Why has the offence of ‘adultery’ been brought back into the criminal law? Was it necessary to retain ‘defamation’ as a criminal offence? Was it not necessary to stipulate a period of limitation to lodge a criminal complaint of ‘defamation’? Why is same-sex relationship without the consent of the other person no longer an offence? Was it not necessary to define the punishment of ‘community service’ or, at least, give illustrations of community service?\n\n5 Why has the offence of ‘sedition’ been enlarged and retained? Why has the offence of ‘terrorism’ been brought into the general criminal law when there is a special Act called Unlawful Activities (Prevention) Act? Why have ‘electoral offences’ been included in the new law when there are special laws called Representation of the People Act, 1950 and Representation of the People Act, 1951?\n\n6 Have the new laws given greater latitude to the police to arrest a person and seek the person’s police custody? Have the new laws ignored the dictum of the Supreme Court that the power to arrest does not mean the necessity to arrest? Was it not necessary to explicitly provide in the law that ‘bail is the rule, jail is the exception’? Was it not necessary to oblige a Magistrate to examine the legality of the arrest and the need to arrest? Do the provisions for bail effectively require the Magistrate to deny bail for 40/60 days after the arrest?\n\n7 Is the provision that enables an FIR to be registered in any police station of the country, irrespective of the place of the offence, constitutional? Is the provision that empowers the police of that State to arrest the accused and investigate the offence unconstitutional in view of ‘Police’ being a subject in the State List? Are the said provisions contrary to the principle of ‘federalism’ which is a basic feature of the Constitution?\n\nThere are many more questions. Which is the platform to ask the questions and receive answers? No one in the government has answered the questions so far, but the questions will not go away. Yet the laws that are most fundamental to the administration of criminal justice in the country have ‘come into force’ — an example of government by some people and for some people.",
        "Congress needs to find a way to reach main stream media. support from TV channels will change the game significantly"
    ],
    "cleaned_text": "p chidambaram writes answer questions artile comments platform ask questions receive answers one government answered questions far questions go away ",
    "cleaned_title": "p chidambaram writes answer questions",
    "cleaned_selftext": "artile comments platform ask questions receive answers one government answered questions far questions go away",
    "cleaned_comments": "article debate opposition boycotted houses parliament good reasons three bills replace reenact indian penal code criminal procedure code indian evidence act passed new bills carried names hindi sanskrit even english versions bills president gave assent bills government notified new laws come force july stiff opposition new laws many quarters government dismissed grounds opposition irrelevant motivated governments ramthrough approach deterred opposition laws contrary two state governments declared bring certain amendments state legislatures concerned tamil nadu appointed oneperson committee suggest changes within month karnataka state governments may adopt route therefore necessary place facts issues public ask citizens arrive conclusions criminal law subject concurrent list constitution parliament state legislatures competent make laws subject undoubtedly law made parliament law made state legislature repugnant article constitution attracted however issue arise state legislature made law repugnancy president give assent law passed state legislature meanwhile questions raised opposing new laws must heard answered unfortunately central government refused answer parliament outside questions correct bulk provisions three new laws copied pasted three laws replaced correct per cent ipc crpc per cent evidence act retained new laws every section renumbered additions deletions changes required existing laws could outcome achieved amendments claim government thrown colonial legacy hollow claim intention thorough revision overhaul criminal laws timehonoured practice make reference law commission followed law commission suitable body consult stakeholders submit recommendations together draft bills consideration government parliament law commission bypassed task entrusted committee consisted parttime members save one employed fulltime professors various universities new laws consistent modern principles criminal jurisprudence new laws recognised incorporated progressive principles laid supreme court landmark judgments delivered last years several provisions new laws contrary constitution india interpreted supreme court new law retained death penalty abolished many democratic countries cruel dehumanising punishment solitary confinement introduced offence adultery brought back criminal law necessary retain defamation criminal offence necessary stipulate period limitation lodge criminal complaint defamation samesex relationship without consent person longer offence necessary define punishment community service least give illustrations community service offence sedition enlarged retained offence terrorism brought general criminal law special act called unlawful activities prevention act electoral offences included new law special laws called representation people act representation people act new laws given greater latitude police arrest person seek persons police custody new laws ignored dictum supreme court power arrest mean necessity arrest necessary explicitly provide law bail rule jail exception necessary oblige magistrate examine legality arrest need arrest provisions bail effectively require magistrate deny bail days arrest provision enables fir registered police station country irrespective place offence constitutional provision empowers police state arrest accused investigate offence unconstitutional view police subject state list said provisions contrary principle federalism basic feature constitution many questions platform ask questions receive answers one government answered questions far questions go away yet laws fundamental administration criminal justice country come force example government people people congress needs find way reach main stream media support tv channels change game significantly",
    "light_cleaned_title": "P Chidambaram writes: Who will answer the questions?",
    "light_cleaned_selftext": "(Artile In comments ⬇️) Which is the platform to ask the questions and receive answers? No one in the government has answered the questions so far, but the questions will not go away.",
    "light_cleaned_comments": "Article After a debate that the Opposition boycotted in both Houses of Parliament (for good reasons), three Bills to replace (and re-enact) the Indian Penal Code, 1860, the Criminal Procedure Code, 1973 and the Indian Evidence Act, 1872 were passed. The new Bills carried names in Hindi (or Sanskrit) even in the English versions of the Bills. The President gave her assent to the Bills and the government notified that the new laws will come into force on July 1, 2024. There is stiff opposition to the new laws from many quarters. The government has dismissed the grounds of opposition as irrelevant and motivated. The government’s ram-through approach has not deterred the opposition to the laws. On the contrary, two state governments have declared that they will bring certain amendments in the state legislatures concerned. Tamil Nadu has appointed a one-person committee to suggest the changes within a month. Karnataka and other state governments may adopt the same route. It is therefore necessary to place the facts and the issues before the public and ask the citizens to arrive at their own conclusions. ‘Criminal law’ is a subject in the Concurrent List of the Constitution. Both Parliament and state legislatures are competent to make laws on the subject. Undoubtedly, if a law made by Parliament and a law made by a state legislature are repugnant, Article 254 of the Constitution will be attracted. However, that is an issue that will arise after the state legislature made a law, there was repugnancy, and the President did not give her assent to the law passed by the state legislature. Meanwhile, the questions raised by those opposing the new laws must be heard and answered. Unfortunately, the central government has refused to answer in Parliament or outside. Here are the questions: 1 Is it correct that the bulk of the provisions of the three new laws have been ‘copied and pasted’ from the three laws that were replaced? Is it correct that 90-95 per cent of the IPC and the CrPC and 95-99 per cent of the Evidence Act have been retained in the new laws and every section re-numbered? If a few additions, deletions and changes were required in the existing laws, could the same outcome not have been achieved through amendments? Is not the claim that the government has thrown out the ‘colonial legacy’ a hollow claim? 2 If the intention was a thorough revision and overhaul of the criminal laws, why was the time-honoured practice to make a reference to the Law Commission not followed? Was not the Law Commission the most suitable body to consult all stakeholders and submit its recommendations, together with draft Bills, for the consideration of the government and Parliament? Why was the Law Commission by-passed and the task entrusted to a Committee that consisted of part-time members who, save one, were employed as full-time professors in various Universities? 3 Are the new laws consistent with the modern principles of criminal jurisprudence? Have the new laws recognised and incorporated the progressive principles laid down by the Supreme Court in landmark judgments delivered in the last 10 years? Are several provisions of the new laws contrary to the Constitution of India as interpreted by the Supreme Court? 4 Why has the new law retained ‘death penalty’ that has been abolished in many democratic countries? Why has the cruel and dehumanising punishment of ‘solitary confinement’ been introduced? Why has the offence of ‘adultery’ been brought back into the criminal law? Was it necessary to retain ‘defamation’ as a criminal offence? Was it not necessary to stipulate a period of limitation to lodge a criminal complaint of ‘defamation’? Why is same-sex relationship without the consent of the other person no longer an offence? Was it not necessary to define the punishment of ‘community service’ or, at least, give illustrations of community service? 5 Why has the offence of ‘sedition’ been enlarged and retained? Why has the offence of ‘terrorism’ been brought into the general criminal law when there is a special Act called Unlawful Activities (Prevention) Act? Why have ‘electoral offences’ been included in the new law when there are special laws called Representation of the People Act, 1950 and Representation of the People Act, 1951? 6 Have the new laws given greater latitude to the police to arrest a person and seek the person’s police custody? Have the new laws ignored the dictum of the Supreme Court that the power to arrest does not mean the necessity to arrest? Was it not necessary to explicitly provide in the law that ‘bail is the rule, jail is the exception’? Was it not necessary to oblige a Magistrate to examine the legality of the arrest and the need to arrest? Do the provisions for bail effectively require the Magistrate to deny bail for 40/60 days after the arrest? 7 Is the provision that enables an FIR to be registered in any police station of the country, irrespective of the place of the offence, constitutional? Is the provision that empowers the police of that State to arrest the accused and investigate the offence unconstitutional in view of ‘Police’ being a subject in the State List? Are the said provisions contrary to the principle of ‘federalism’ which is a basic feature of the Constitution? There are many more questions. Which is the platform to ask the questions and receive answers? No one in the government has answered the questions so far, but the questions will not go away. Yet the laws that are most fundamental to the administration of criminal justice in the country have ‘come into force’ — an example of government by some people and for some people. Congress needs to find a way to reach main stream media. support from TV channels will change the game significantly"
}