{
    "id": "12fyjgt",
    "title": "Where can I find Disney's Arjun movie?",
    "url": "https://www.reddit.com/r/india/comments/12fyjgt/where_can_i_find_disneys_arjun_movie/",
    "selftext": "I'm trying to find it with English sub or dubs but I can only find Hindi and French.  I don't speak hindi, and I'm not actually Indian.  I'm American and married to an Indian, and trying to find more Indian cartoons and books I can share with our kids. \n\nMy husband is from karnataka and doesn't really speak hindi very well, so he cannot help much here either. \n\n\nLink below to film:\nhttps://m.imdb.com/title/tt2404027/",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 4,
    "created_utc": 1680988248.0,
    "convurl": "https://external-preview.redd.it/r8WdtbTLGiH8-gtT9wqOTr9I73pfYfzUzwGJ7u0_wlA.jpg?auto=webp&v=enabled&s=ca8576a13080b18beb3338f3af4eebf9bd086bbe",
    "comments": [
        "Here - https://dignes.monster/movies/play/arjun-the-warrior-prince-2012?mid=17&sid=&sec=3fa011852a6e039897203253c8a910df1e0052eb&t=1680997196\n\nYou can choose between different languages and sources for the subtitles.",
        "https://youtu.be/lLiIWaJ6pi0 slightly low quality and Spanish subs but it is watchable\n\nAnother version on youtube https://youtu.be/Fes-kkM31nI if you want to buy or rent it. This is the official version so should have English subs."
    ],
    "cleaned_text": "find disneys arjun movie im trying find english sub dubs find hindi french dont speak hindi im actually indian im american married indian trying find indian cartoons books share kids husband karnataka doesnt really speak hindi well help much either link film ",
    "cleaned_title": "find disneys arjun movie",
    "cleaned_selftext": "im trying find english sub dubs find hindi french dont speak hindi im actually indian im american married indian trying find indian cartoons books share kids husband karnataka doesnt really speak hindi well help much either link film",
    "cleaned_comments": "choose different languages sources subtitles slightly low quality spanish subs watchable another version youtube want buy rent official version english subs",
    "light_cleaned_title": "Where can I find Disney's Arjun movie?",
    "light_cleaned_selftext": "I'm trying to find it with English sub or dubs but I can only find Hindi and French. I don't speak hindi, and I'm not actually Indian. I'm American and married to an Indian, and trying to find more Indian cartoons and books I can share with our kids. My husband is from karnataka and doesn't really speak hindi very well, so he cannot help much here either. Link below to film:",
    "light_cleaned_comments": "Here - You can choose between different languages and sources for the subtitles. slightly low quality and Spanish subs but it is watchable Another version on youtube if you want to buy or rent it. This is the official version so should have English subs."
}