{
    "id": "1bkw80f",
    "title": "A DM from the PM.... (and the storm it stirred) | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1bkw80f/a_dm_from_the_pm_and_the_storm_it_stirred/",
    "selftext": " \n\n[https:\\/\\/internetfreedom.in\\/whatsapp-message-from-meity\\/](https://preview.redd.it/qr0183qx5vpc1.jpg?width=1600&format=pjpg&auto=webp&s=dc1ee1deb61ebc5cea7f742e6f17a84ef1913534)\n\n## [Help us watch the watchmen, donate now!](https://static.internetfreedom.in/donate)\n\n## tl;dr\n\nLast week, the Ministry of  Electronics & Information Technology used a government-run account  to send a WhatsApp message to millions of users, purportedly seeking  feedback and suggestions on their governance. Although the ECI has asked  MeitY to discontinue these messages given that the Model Code of  Conduct is in force, users were quick to raise pertinent questions about  government access to such a database, the role of online communication  platforms in facilitating formal government communication, the timing of  the message in the context of the upcoming elections starting in April,  and the regulations (or lack thereof) in place to safeguard our  privacy. In this post, we unravel these questions in depth and document  the actions we have taken in search of some answers. \n\n## Background\n\nFrom  March 15, 2024 onwards, millions of WhatsApp users received a message  from a government-run account named ‘Viksit Bharat Sampark’ seeking  feedback and suggestions from Indian citizens on existing welfare  schemes, [adjoined with a letter](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/mzgrh4weafvlkta/letter_from_prime_minister_Qq58AL6naa.pdf?token=&ref=static.internetfreedom.in)  from Prime Minister Narendra Modi. The letter enumerates reform efforts  brought on by the incumbent government and their plans to “*work to fulfil the resolve of building a Viksit Bharat*”  or ‘advanced India’. This missive was sent by the Ministry of  Electronics & Information Technology (“MeitY”) and undersigned by  the Prime Minister. \n\nThere are a number of concerns and questions  that emerge from this outreach. First, questions about data privacy of  our contact information – where did MeitY secure the contact information  of such a large database of users from? When did it begin using this  information for outreach, arguably without their consent? Is any of this  in line with established data privacy norms? \n\nSecond is the  question of why WhatsApp was chosen as a medium for outreach, and what  roles and responsibilities similar platforms have in context of  political campaigns and elections. Third, we look into how the  soon-to-be-enacted Digital Personal Data Protection Act (“DPDPA”)  affects (or exempts) government actions along this line and what to  expect when it is finally operationalised. Lastly, we look at what this  means in context of the upcoming General Elections. Sent only a few days  ahead of the Election Commission of India (“ECI”) issuing its Model  Code of Conduct (“MCC”), the message may also serve as a vessel for  covert electoral campaigning in a manner that potentially flouts the  MCC.\n\nOn a positive note, on March 21, the ECI took note of the  several complaints it received stating that the message was being sent  while the Model Code of Conduct was in force, and [wrote](https://x.com/imsoumyarendra/status/1770725350596587872?s=20&ref=static.internetfreedom.in) to MeitY, instructing them to discontinue the messages and too send a compliance report at the earliest.\n\n## A peek into MeitY’s contact book \n\nThe  first and most important question that emerges from this fiasco is –  where did MeitY get my number from? It is not clear what database (one,  or many?) MeitY has relied on to send out the broadcast, further made  confusing by the fact that [individuals](https://www.livemint.com/news/india/did-you-get-pm-modi-viksit-bharat-sampark-whatsapp-letter-people-in-pakistan-dubai-uae-britain-11710777009121.html?ref=static.internetfreedom.in)  from UAE and Pakistan, who are not Indian citizens, have received it  too. This becomes more convoluted when we begin speculating upon the  intent of the government to send out the message merely a few days  before important guidelines on election campaigning over platforms come  into effect (more on this in later sections) – if the intent is  campaigning, why were individuals who are not Indian citizens targeted?  Were there criteria based on which database(s) or recipients were  chosen? What were the criteria?\n\nFurther, it may be the case that  MeitY has obtained the database from another agency/authority, either  public or private, but that raises doubts about the lawfulness of how it  was obtained, or whether privacy norms (such as the obligation to take  specific and informed consent before processing or using personal data  for a purpose other than the purpose originally consented to) were  followed. \n\nWe have asked the ministry to clarify these doubts through an [RTI request](https://drive.google.com/file/d/1U5wYAOc7EHaPpgGkh5prdyrz4oegJX--/view?usp=sharing&ref=static.internetfreedom.in),  where we seek information on, among other things, the source of contact  information, total number of messages sent, and costs incurred:  \n\n\nhttps://preview.redd.it/2r3utrgy5vpc1.png?width=904&format=png&auto=webp&s=be8627ef4dd0ea53db07b42b39ae72312adbebe7\n\n \n\n## But we have a data protection law, right? RIGHT?\n\nIt  is worth remembering that the government holds access to this extensive  database (one, or many) in the absence of an operational data  protection law. The DPDPA, 2023 is not in operation yet, but even when  it gets enacted and its procedural rules notified, it may still not be  able to adequately regulate data storage and sharing by the government.  Simply because Section 17 of the Act holds the power to exempt  government and other public authorities from its very application at any  given time. Read more about how the DPDPA fails to safeguard our  privacy [here](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in).\n\n## A government DM on WhatsApp was not on my 2024 bingo card\n\nWhile  we are accustomed to receiving messages from the government through our  telecom service providers, communication through an online  communication platform has caught us off guard – making us question what  statute/ law exactly allows this. WhatsApp’s Business Messaging Policy  clearly states that a business account may only contact people on  WhatsApp if: “*(a) they have given you their mobile phone number; and  (b) you have received opt-in permission from the recipient confirming  that they wish to receive subsequent messages from you on WhatsApp*”.  WhatsApp emphasises on the need to have informed consent of the users  receiving the message and clear communication regarding the opt-in  choice of the user. It also suggests best practices to create a  high-quality opt-in experience:\n\n&#x200B;\n\nhttps://preview.redd.it/gjpeqa316vpc1.png?width=1600&format=png&auto=webp&s=346558dc768123636fb84c49a4f08b7c4f1ba7ea\n\n \n\nDisappointingly, the message sent by the government does not declare  how and when, if at all, users shared their mobile numbers and gave  their consent/ opted-in to being contacted on WhatsApp. The policy also  states that the business account is “*responsible for and must secure  all necessary notices, permissions, and consents to collect, use, and  share people's content and information, including maintaining a  published privacy policy, and otherwise complying with applicable law*.” Since the DPDPA, 2023 is not yet operational, its provisions and limited safeguards will not apply to the government.\n\nClause  7 of the DPDPA, 2023 allows the Data Fiduciary to not obtain the  informed consent of the Data Principal and assume the consent if the  processing was considered necessary as per certain situations. It is  worth noting that the DPDPA, 2023 varied from its 2022 iteration as it  omitted  “public interest” as one of the situations wherein consent may  be deemed and data processed non-consensually. This was a positive  development since the 2022 iteration failed to strictly define the  situations in which it may be invoked and thus, could have been widely  interpreted leading to misuse. Notably, Clause 7(b) gives state  instrumentalities a concerning amount of liberty to process the personal  data of data principals if the latter has previously consented to its  processing or if such data is maintained by any instrumentality of the  State. However, at the moment we are unable to decipher if such  unsolicited and non-consensual outreach from the government would have  been a violation of Clause 7 of the Act, since it is not yet in  operation.\n\n## Outreach right before the elections? The timing is sus\n\nThe  message, broadcast to millions of people through WhatsApp, may be  viewed in the context of the upcoming elections as the communication  happened around the time the [Model Code of Conduct](https://www.eci.gov.in/mcc/?ref=static.internetfreedom.in) went into effect. [Reports](https://www.jagran.com/politics/national-pm-modi-letter-before-lok-sabha-election-2024-announcement-pm-modi-message-to-country-23675949.html?ref=static.internetfreedom.in) of the message being received by individuals surfaced as early as March 16, the same day the ECI [announced](https://www.thehindu.com/news/national/andhra-pradesh/model-code-of-conduct-to-come-into-force-soon-after-eci-announces-election-schedule/article67955521.ece?ref=static.internetfreedom.in)  the election dates. The MCC prohibits the party in power from the  misuse of official mass media during the election period for partisan  coverage of political news and publicity regarding achievements. The  ECI, through the MCC, also [prohibits](https://economictimes.indiatimes.com/news/elections/lok-sabha/india/whats-model-code-of-conduct-how-it-came-into-being-and-whats-allowed-and-whats-not/articleshow/108545901.cms?from=mdr&ref=static.internetfreedom.in)  the issuance of advertisements at the cost of the public exchequer in  newspapers and other media during the election period. This may lead us  to question - Does the timing of the communication, which happened  around the time the election dates were announced and the MCC went into  effect, have potential electoral implications? \n\nOn March 21, 2024,  the ECI wrote to MeitY, asking them to discontinue delivery of the  messages on WhatsApp. As per the letter, the ECI received several  complaints from individuals about getting the message from MeitY during  the MCC period. The letter also notes that although the Ministry sent  out the messages on March 15, the system architecture and network  limitations of the communication platform chosen by the government  delayed the delivery. The ECI also asked MeitY to send a compliance  report at the earliest. We appreciate the ECI for taking note of the  complaints, enforcing the MCC, and instructing MeitY to discontinue the  messages.   \n\n\n([https://twitter.com/Aditi\\_muses/status/1770725612514169215](https://twitter.com/Aditi_muses/status/1770725612514169215))  \n\n\nHowever, we also note that this kind of communication by MeitY is not new, especially with the general elections less than a month away. In  the months leading up to elections, electoral candidates and political  parties make large investments in campaigns, rallies, outreach, and  other modes with which they can reach voters and influence popular vote.  A prevalent way of doing this is targeted outreach or ‘[votebank politics](https://www.livemint.com/opinion/online-views/opinion-vote-bank-politics-is-not-always-bad-for-democracy-1554661359793.html?ref=static.internetfreedom.in)’,  where parties can appeal to certain socio-economic groups specifically  by outlining the kind of welfare they can bring to the groups. \n\nIn  recent years, parties have resorted to questionable means of collecting  demographic data for the purposes of targeted campaigning. By tapping  into government databases and accessing beneficiary information across  schemes, or by means of online ‘surveys’ and mobile apps, parties are  able to extract a lot of personal information about voters and create  360° profiles to run extremely targeted campaigns. [This video](https://shivamsingh.in/index.php/portfolio/fifthel-weaponizing-data-for-politics/?ref=static.internetfreedom.in)  by Shivam Shankar Singh titled ‘Weaponising Data for Politics’,  explains how precisely parties are able to draw voter profiles from data  accessed by dubious means. We are working on a detailed explainer on  how this is done, and the privacy concerns emerging from the practice.  Meanwhile, we hope the ECI keeps their momentum going after this  incident, and engages more meaningfully on how political parties access  personal data.\n\n## What has IFF done about it? \n\nMuch  like several concerned people on the internet, we too have questions  about this outreach. In the hopes for some answers, we have filed the  above mentioned [RTI application](https://drive.google.com/file/d/1U5wYAOc7EHaPpgGkh5prdyrz4oegJX--/view?usp=sharing&ref=static.internetfreedom.in). We have recently also published a [short video](https://x.com/internetfreedom/status/1770317430612447266?s=20&ref=static.internetfreedom.in)  summarising concerns and efforts. We are additionally exploring all  avenues, including potential legal challenges to the inadequate DPDPA,  2023 pushing for a rights-respecting data protection framework.  \n\n\n [Donate Now](https://static.internetfreedom.in/donate) | [Link to our website](https://internetfreedom.in/whatsapp-message-from-meity/)",
    "flair": "Policy/Economy",
    "score": 28,
    "num_comments": 2,
    "created_utc": 1711104025.0,
    "convurl": "https://b.thumbs.redditmedia.com/0sL1DIClN8VjWosJmJ4sJ4Jk5KR1Uwxoa68xBSNrKwk.jpg",
    "comments": [
        "Can a complaint be filed in the Supreme Court against the BJP for using state machinery during the moral code of conduct period?\n\nThe BJP has used a state resource not available to other political parties."
    ],
    "cleaned_text": "dm pm storm stirred internet freedom foundation httpsinternetfreedominwhatsappmessagefrommeityhttpspreviewredditqrqxvpcjpgwidthformatpjpgautowebpsdceedebebcceafefaef help us watch watchmen donate nowhttpsstaticinternetfreedomindonate tldr last week ministry electronics information technology used governmentrun account send whatsapp message millions users purportedly seeking feedback suggestions governance although eci asked meity discontinue messages given model code conduct force users quick raise pertinent questions government access database role online communication platforms facilitating formal government communication timing message context upcoming elections starting april regulations lack thereof place safeguard privacy post unravel questions depth document actions taken search answers background march onwards millions whatsapp users received message governmentrun account named viksit bharat sampark seeking feedback suggestions indian citizens existing welfare schemes adjoined letterhttpscontentinternetfreedominapifilesdivcoywedtrpemzgrhweafvlktaletterfromprimeministerqqalnaapdftokenrefstaticinternetfreedomin prime minister narendra modi letter enumerates reform efforts brought incumbent government plans work fulfil resolve building viksit bharat advanced india missive sent ministry electronics information technology meity undersigned prime minister number concerns questions emerge outreach first questions data privacy contact information meity secure contact information large database users begin using information outreach arguably without consent line established data privacy norms second question whatsapp chosen medium outreach roles responsibilities similar platforms context political campaigns elections third look soontobeenacted digital personal data protection act dpdpa affects exempts government actions along line expect finally operationalised lastly look means context upcoming general elections sent days ahead election commission india eci issuing model code conduct mcc message may also serve vessel covert electoral campaigning manner potentially flouts mcc positive note march eci took note several complaints received stating message sent model code conduct force wrotehttpsxcomimsoumyarendrastatussrefstaticinternetfreedomin meity instructing discontinue messages send compliance report earliest peek meitys contact book first important question emerges fiasco meity get number clear database one many meity relied send broadcast made confusing fact individualshttpswwwlivemintcomnewsindiadidyougetpmmodiviksitbharatsamparkwhatsappletterpeopleinpakistandubaiuaebritainhtmlrefstaticinternetfreedomin uae pakistan indian citizens received becomes convoluted begin speculating upon intent government send message merely days important guidelines election campaigning platforms come effect later sections intent campaigning individuals indian citizens targeted criteria based databases recipients chosen criteria may case meity obtained database another agencyauthority either public private raises doubts lawfulness obtained whether privacy norms obligation take specific informed consent processing using personal data purpose purpose originally consented followed asked ministry clarify doubts rti requesthttpsdrivegooglecomfileduwyaocehappggkhprdyrzoegjxviewuspsharingrefstaticinternetfreedomin seek information among things source contact information total number messages sent costs incurred data protection law right right worth remembering government holds access extensive database one many absence operational data protection law dpdpa operation yet even gets enacted procedural rules notified may still able adequately regulate data storage sharing government simply section act holds power exempt government public authorities application given time read dpdpa fails safeguard privacy herehttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin government dm whatsapp bingo card accustomed receiving messages government telecom service providers communication online communication platform caught us guard making us question statute law exactly allows whatsapps business messaging policy clearly states business account may contact people whatsapp given mobile phone number b received optin permission recipient confirming wish receive subsequent messages whatsapp whatsapp emphasises need informed consent users receiving message clear communication regarding optin choice user also suggests best practices create highquality optin experience xb disappointingly message sent government declare users shared mobile numbers gave consent optedin contacted whatsapp policy also states business account responsible must secure necessary notices permissions consents collect use share peoples content information including maintaining published privacy policy otherwise complying applicable law since dpdpa yet operational provisions limited safeguards apply government clause dpdpa allows data fiduciary obtain informed consent data principal assume consent processing considered necessary per certain situations worth noting dpdpa varied iteration omitted public interest one situations wherein consent may deemed data processed nonconsensually positive development since iteration failed strictly define situations may invoked thus could widely interpreted leading misuse notably clause b gives state instrumentalities concerning amount liberty process personal data data principals latter previously consented processing data maintained instrumentality state however moment unable decipher unsolicited nonconsensual outreach government would violation clause act since yet operation outreach right elections timing sus message broadcast millions people whatsapp may viewed context upcoming elections communication happened around time model code conducthttpswwwecigovinmccrefstaticinternetfreedomin went effect reportshttpswwwjagrancompoliticsnationalpmmodiletterbeforeloksabhaelectionannouncementpmmodimessagetocountryhtmlrefstaticinternetfreedomin message received individuals surfaced early march day eci announcedhttpswwwthehinducomnewsnationalandhrapradeshmodelcodeofconducttocomeintoforcesoonaftereciannounceselectionschedulearticleecerefstaticinternetfreedomin election dates mcc prohibits party power misuse official mass media election period partisan coverage political news publicity regarding achievements eci mcc also prohibitshttpseconomictimesindiatimescomnewselectionsloksabhaindiawhatsmodelcodeofconducthowitcameintobeingandwhatsallowedandwhatsnotarticleshowcmsfrommdrrefstaticinternetfreedomin issuance advertisements cost public exchequer newspapers media election period may lead us question timing communication happened around time election dates announced mcc went effect potential electoral implications march eci wrote meity asking discontinue delivery messages whatsapp per letter eci received several complaints individuals getting message meity mcc period letter also notes although ministry sent messages march system architecture network limitations communication platform chosen government delayed delivery eci also asked meity send compliance report earliest appreciate eci taking note complaints enforcing mcc instructing meity discontinue messages httpstwittercomaditimusesstatushttpstwittercomaditimusesstatus however also note kind communication meity new especially general elections less month away months leading elections electoral candidates political parties make large investments campaigns rallies outreach modes reach voters influence popular vote prevalent way targeted outreach votebank politicshttpswwwlivemintcomopiniononlineviewsopinionvotebankpoliticsisnotalwaysbadfordemocracyhtmlrefstaticinternetfreedomin parties appeal certain socioeconomic groups specifically outlining kind welfare bring groups recent years parties resorted questionable means collecting demographic data purposes targeted campaigning tapping government databases accessing beneficiary information across schemes means online surveys mobile apps parties able extract lot personal information voters create profiles run extremely targeted campaigns videohttpsshivamsinghinindexphpportfoliofifthelweaponizingdataforpoliticsrefstaticinternetfreedomin shivam shankar singh titled weaponising data politics explains precisely parties able draw voter profiles data accessed dubious means working detailed explainer done privacy concerns emerging practice meanwhile hope eci keeps momentum going incident engages meaningfully political parties access personal data iff done much like several concerned people internet questions outreach hopes answers filed mentioned rti applicationhttpsdrivegooglecomfileduwyaocehappggkhprdyrzoegjxviewuspsharingrefstaticinternetfreedomin recently also published short videohttpsxcominternetfreedomstatussrefstaticinternetfreedomin summarising concerns efforts additionally exploring avenues including potential legal challenges inadequate dpdpa pushing rightsrespecting data protection framework donate nowhttpsstaticinternetfreedomindonate link websitehttpsinternetfreedominwhatsappmessagefrommeity ",
    "cleaned_title": "dm pm storm stirred internet freedom foundation",
    "cleaned_selftext": "httpsinternetfreedominwhatsappmessagefrommeityhttpspreviewredditqrqxvpcjpgwidthformatpjpgautowebpsdceedebebcceafefaef help us watch watchmen donate nowhttpsstaticinternetfreedomindonate tldr last week ministry electronics information technology used governmentrun account send whatsapp message millions users purportedly seeking feedback suggestions governance although eci asked meity discontinue messages given model code conduct force users quick raise pertinent questions government access database role online communication platforms facilitating formal government communication timing message context upcoming elections starting april regulations lack thereof place safeguard privacy post unravel questions depth document actions taken search answers background march onwards millions whatsapp users received message governmentrun account named viksit bharat sampark seeking feedback suggestions indian citizens existing welfare schemes adjoined letterhttpscontentinternetfreedominapifilesdivcoywedtrpemzgrhweafvlktaletterfromprimeministerqqalnaapdftokenrefstaticinternetfreedomin prime minister narendra modi letter enumerates reform efforts brought incumbent government plans work fulfil resolve building viksit bharat advanced india missive sent ministry electronics information technology meity undersigned prime minister number concerns questions emerge outreach first questions data privacy contact information meity secure contact information large database users begin using information outreach arguably without consent line established data privacy norms second question whatsapp chosen medium outreach roles responsibilities similar platforms context political campaigns elections third look soontobeenacted digital personal data protection act dpdpa affects exempts government actions along line expect finally operationalised lastly look means context upcoming general elections sent days ahead election commission india eci issuing model code conduct mcc message may also serve vessel covert electoral campaigning manner potentially flouts mcc positive note march eci took note several complaints received stating message sent model code conduct force wrotehttpsxcomimsoumyarendrastatussrefstaticinternetfreedomin meity instructing discontinue messages send compliance report earliest peek meitys contact book first important question emerges fiasco meity get number clear database one many meity relied send broadcast made confusing fact individualshttpswwwlivemintcomnewsindiadidyougetpmmodiviksitbharatsamparkwhatsappletterpeopleinpakistandubaiuaebritainhtmlrefstaticinternetfreedomin uae pakistan indian citizens received becomes convoluted begin speculating upon intent government send message merely days important guidelines election campaigning platforms come effect later sections intent campaigning individuals indian citizens targeted criteria based databases recipients chosen criteria may case meity obtained database another agencyauthority either public private raises doubts lawfulness obtained whether privacy norms obligation take specific informed consent processing using personal data purpose purpose originally consented followed asked ministry clarify doubts rti requesthttpsdrivegooglecomfileduwyaocehappggkhprdyrzoegjxviewuspsharingrefstaticinternetfreedomin seek information among things source contact information total number messages sent costs incurred data protection law right right worth remembering government holds access extensive database one many absence operational data protection law dpdpa operation yet even gets enacted procedural rules notified may still able adequately regulate data storage sharing government simply section act holds power exempt government public authorities application given time read dpdpa fails safeguard privacy herehttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin government dm whatsapp bingo card accustomed receiving messages government telecom service providers communication online communication platform caught us guard making us question statute law exactly allows whatsapps business messaging policy clearly states business account may contact people whatsapp given mobile phone number b received optin permission recipient confirming wish receive subsequent messages whatsapp whatsapp emphasises need informed consent users receiving message clear communication regarding optin choice user also suggests best practices create highquality optin experience xb disappointingly message sent government declare users shared mobile numbers gave consent optedin contacted whatsapp policy also states business account responsible must secure necessary notices permissions consents collect use share peoples content information including maintaining published privacy policy otherwise complying applicable law since dpdpa yet operational provisions limited safeguards apply government clause dpdpa allows data fiduciary obtain informed consent data principal assume consent processing considered necessary per certain situations worth noting dpdpa varied iteration omitted public interest one situations wherein consent may deemed data processed nonconsensually positive development since iteration failed strictly define situations may invoked thus could widely interpreted leading misuse notably clause b gives state instrumentalities concerning amount liberty process personal data data principals latter previously consented processing data maintained instrumentality state however moment unable decipher unsolicited nonconsensual outreach government would violation clause act since yet operation outreach right elections timing sus message broadcast millions people whatsapp may viewed context upcoming elections communication happened around time model code conducthttpswwwecigovinmccrefstaticinternetfreedomin went effect reportshttpswwwjagrancompoliticsnationalpmmodiletterbeforeloksabhaelectionannouncementpmmodimessagetocountryhtmlrefstaticinternetfreedomin message received individuals surfaced early march day eci announcedhttpswwwthehinducomnewsnationalandhrapradeshmodelcodeofconducttocomeintoforcesoonaftereciannounceselectionschedulearticleecerefstaticinternetfreedomin election dates mcc prohibits party power misuse official mass media election period partisan coverage political news publicity regarding achievements eci mcc also prohibitshttpseconomictimesindiatimescomnewselectionsloksabhaindiawhatsmodelcodeofconducthowitcameintobeingandwhatsallowedandwhatsnotarticleshowcmsfrommdrrefstaticinternetfreedomin issuance advertisements cost public exchequer newspapers media election period may lead us question timing communication happened around time election dates announced mcc went effect potential electoral implications march eci wrote meity asking discontinue delivery messages whatsapp per letter eci received several complaints individuals getting message meity mcc period letter also notes although ministry sent messages march system architecture network limitations communication platform chosen government delayed delivery eci also asked meity send compliance report earliest appreciate eci taking note complaints enforcing mcc instructing meity discontinue messages httpstwittercomaditimusesstatushttpstwittercomaditimusesstatus however also note kind communication meity new especially general elections less month away months leading elections electoral candidates political parties make large investments campaigns rallies outreach modes reach voters influence popular vote prevalent way targeted outreach votebank politicshttpswwwlivemintcomopiniononlineviewsopinionvotebankpoliticsisnotalwaysbadfordemocracyhtmlrefstaticinternetfreedomin parties appeal certain socioeconomic groups specifically outlining kind welfare bring groups recent years parties resorted questionable means collecting demographic data purposes targeted campaigning tapping government databases accessing beneficiary information across schemes means online surveys mobile apps parties able extract lot personal information voters create profiles run extremely targeted campaigns videohttpsshivamsinghinindexphpportfoliofifthelweaponizingdataforpoliticsrefstaticinternetfreedomin shivam shankar singh titled weaponising data politics explains precisely parties able draw voter profiles data accessed dubious means working detailed explainer done privacy concerns emerging practice meanwhile hope eci keeps momentum going incident engages meaningfully political parties access personal data iff done much like several concerned people internet questions outreach hopes answers filed mentioned rti applicationhttpsdrivegooglecomfileduwyaocehappggkhprdyrzoegjxviewuspsharingrefstaticinternetfreedomin recently also published short videohttpsxcominternetfreedomstatussrefstaticinternetfreedomin summarising concerns efforts additionally exploring avenues including potential legal challenges inadequate dpdpa pushing rightsrespecting data protection framework donate nowhttpsstaticinternetfreedomindonate link websitehttpsinternetfreedominwhatsappmessagefrommeity",
    "cleaned_comments": "complaint filed supreme court bjp using state machinery moral code conduct period bjp used state resource available political parties",
    "light_cleaned_title": "A DM from the PM.... (and the storm it stirred) | Internet Freedom Foundation",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/whatsapp-message-from-meity\\/](https://preview.redd.it/qr0183qx5vpc1.jpg?width=1600&format=pjpg&auto=webp&s=dc1ee1deb61ebc5cea7f742e6f17a84ef1913534) ## [Help us watch the watchmen, donate now!](https://static.internetfreedom.in/donate) ## tl;dr Last week, the Ministry of Electronics & Information Technology used a government-run account to send a WhatsApp message to millions of users, purportedly seeking feedback and suggestions on their governance. Although the ECI has asked MeitY to discontinue these messages given that the Model Code of Conduct is in force, users were quick to raise pertinent questions about government access to such a database, the role of online communication platforms in facilitating formal government communication, the timing of the message in the context of the upcoming elections starting in April, and the regulations (or lack thereof) in place to safeguard our privacy. In this post, we unravel these questions in depth and document the actions we have taken in search of some answers. ## Background From March 15, 2024 onwards, millions of WhatsApp users received a message from a government-run account named ‘Viksit Bharat Sampark’ seeking feedback and suggestions from Indian citizens on existing welfare schemes, [adjoined with a letter](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/mzgrh4weafvlkta/letter_from_prime_minister_Qq58AL6naa.pdf?token=&ref=static.internetfreedom.in) from Prime Minister Narendra Modi. The letter enumerates reform efforts brought on by the incumbent government and their plans to “*work to fulfil the resolve of building a Viksit Bharat*” or ‘advanced India’. This missive was sent by the Ministry of Electronics & Information Technology (“MeitY”) and undersigned by the Prime Minister. There are a number of concerns and questions that emerge from this outreach. First, questions about data privacy of our contact information – where did MeitY secure the contact information of such a large database of users from? When did it begin using this information for outreach, arguably without their consent? Is any of this in line with established data privacy norms? Second is the question of why WhatsApp was chosen as a medium for outreach, and what roles and responsibilities similar platforms have in context of political campaigns and elections. Third, we look into how the soon-to-be-enacted Digital Personal Data Protection Act (“DPDPA”) affects (or exempts) government actions along this line and what to expect when it is finally operationalised. Lastly, we look at what this means in context of the upcoming General Elections. Sent only a few days ahead of the Election Commission of India (“ECI”) issuing its Model Code of Conduct (“MCC”), the message may also serve as a vessel for covert electoral campaigning in a manner that potentially flouts the MCC. On a positive note, on March 21, the ECI took note of the several complaints it received stating that the message was being sent while the Model Code of Conduct was in force, and [wrote](https://x.com/imsoumyarendra/status/1770725350596587872?s=20&ref=static.internetfreedom.in) to MeitY, instructing them to discontinue the messages and too send a compliance report at the earliest. ## A peek into MeitY’s contact book The first and most important question that emerges from this fiasco is – where did MeitY get my number from? It is not clear what database (one, or many?) MeitY has relied on to send out the broadcast, further made confusing by the fact that [individuals](https://www.livemint.com/news/india/did-you-get-pm-modi-viksit-bharat-sampark-whatsapp-letter-people-in-pakistan-dubai-uae-britain-11710777009121.html?ref=static.internetfreedom.in) from UAE and Pakistan, who are not Indian citizens, have received it too. This becomes more convoluted when we begin speculating upon the intent of the government to send out the message merely a few days before important guidelines on election campaigning over platforms come into effect (more on this in later sections) – if the intent is campaigning, why were individuals who are not Indian citizens targeted? Were there criteria based on which database(s) or recipients were chosen? What were the criteria? Further, it may be the case that MeitY has obtained the database from another agency/authority, either public or private, but that raises doubts about the lawfulness of how it was obtained, or whether privacy norms (such as the obligation to take specific and informed consent before processing or using personal data for a purpose other than the purpose originally consented to) were followed. We have asked the ministry to clarify these doubts through an [RTI request](https://drive.google.com/file/d/1U5wYAOc7EHaPpgGkh5prdyrz4oegJX--/view?usp=sharing&ref=static.internetfreedom.in), where we seek information on, among other things, the source of contact information, total number of messages sent, and costs incurred: ## But we have a data protection law, right? RIGHT? It is worth remembering that the government holds access to this extensive database (one, or many) in the absence of an operational data protection law. The DPDPA, 2023 is not in operation yet, but even when it gets enacted and its procedural rules notified, it may still not be able to adequately regulate data storage and sharing by the government. Simply because Section 17 of the Act holds the power to exempt government and other public authorities from its very application at any given time. Read more about how the DPDPA fails to safeguard our privacy [here](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in). ## A government DM on WhatsApp was not on my 2024 bingo card While we are accustomed to receiving messages from the government through our telecom service providers, communication through an online communication platform has caught us off guard – making us question what statute/ law exactly allows this. WhatsApp’s Business Messaging Policy clearly states that a business account may only contact people on WhatsApp if: “*(a) they have given you their mobile phone number; and (b) you have received opt-in permission from the recipient confirming that they wish to receive subsequent messages from you on WhatsApp*”. WhatsApp emphasises on the need to have informed consent of the users receiving the message and clear communication regarding the opt-in choice of the user. It also suggests best practices to create a high-quality opt-in experience: &#x200B; Disappointingly, the message sent by the government does not declare how and when, if at all, users shared their mobile numbers and gave their consent/ opted-in to being contacted on WhatsApp. The policy also states that the business account is “*responsible for and must secure all necessary notices, permissions, and consents to collect, use, and share people's content and information, including maintaining a published privacy policy, and otherwise complying with applicable law*.” Since the DPDPA, 2023 is not yet operational, its provisions and limited safeguards will not apply to the government. Clause 7 of the DPDPA, 2023 allows the Data Fiduciary to not obtain the informed consent of the Data Principal and assume the consent if the processing was considered necessary as per certain situations. It is worth noting that the DPDPA, 2023 varied from its 2022 iteration as it omitted “public interest” as one of the situations wherein consent may be deemed and data processed non-consensually. This was a positive development since the 2022 iteration failed to strictly define the situations in which it may be invoked and thus, could have been widely interpreted leading to misuse. Notably, Clause 7(b) gives state instrumentalities a concerning amount of liberty to process the personal data of data principals if the latter has previously consented to its processing or if such data is maintained by any instrumentality of the State. However, at the moment we are unable to decipher if such unsolicited and non-consensual outreach from the government would have been a violation of Clause 7 of the Act, since it is not yet in operation. ## Outreach right before the elections? The timing is sus The message, broadcast to millions of people through WhatsApp, may be viewed in the context of the upcoming elections as the communication happened around the time the [Model Code of Conduct](https://www.eci.gov.in/mcc/?ref=static.internetfreedom.in) went into effect. [Reports](https://www.jagran.com/politics/national-pm-modi-letter-before-lok-sabha-election-2024-announcement-pm-modi-message-to-country-23675949.html?ref=static.internetfreedom.in) of the message being received by individuals surfaced as early as March 16, the same day the ECI [announced](https://www.thehindu.com/news/national/andhra-pradesh/model-code-of-conduct-to-come-into-force-soon-after-eci-announces-election-schedule/article67955521.ece?ref=static.internetfreedom.in) the election dates. The MCC prohibits the party in power from the misuse of official mass media during the election period for partisan coverage of political news and publicity regarding achievements. The ECI, through the MCC, also [prohibits](https://economictimes.indiatimes.com/news/elections/lok-sabha/india/whats-model-code-of-conduct-how-it-came-into-being-and-whats-allowed-and-whats-not/articleshow/108545901.cms?from=mdr&ref=static.internetfreedom.in) the issuance of advertisements at the cost of the public exchequer in newspapers and other media during the election period. This may lead us to question - Does the timing of the communication, which happened around the time the election dates were announced and the MCC went into effect, have potential electoral implications? On March 21, 2024, the ECI wrote to MeitY, asking them to discontinue delivery of the messages on WhatsApp. As per the letter, the ECI received several complaints from individuals about getting the message from MeitY during the MCC period. The letter also notes that although the Ministry sent out the messages on March 15, the system architecture and network limitations of the communication platform chosen by the government delayed the delivery. The ECI also asked MeitY to send a compliance report at the earliest. We appreciate the ECI for taking note of the complaints, enforcing the MCC, and instructing MeitY to discontinue the messages. ([https://twitter.com/Aditi\\_muses/status/1770725612514169215](https://twitter.com/Aditi_muses/status/1770725612514169215)) However, we also note that this kind of communication by MeitY is not new, especially with the general elections less than a month away. In the months leading up to elections, electoral candidates and political parties make large investments in campaigns, rallies, outreach, and other modes with which they can reach voters and influence popular vote. A prevalent way of doing this is targeted outreach or ‘[votebank politics](https://www.livemint.com/opinion/online-views/opinion-vote-bank-politics-is-not-always-bad-for-democracy-1554661359793.html?ref=static.internetfreedom.in)’, where parties can appeal to certain socio-economic groups specifically by outlining the kind of welfare they can bring to the groups. In recent years, parties have resorted to questionable means of collecting demographic data for the purposes of targeted campaigning. By tapping into government databases and accessing beneficiary information across schemes, or by means of online ‘surveys’ and mobile apps, parties are able to extract a lot of personal information about voters and create 360° profiles to run extremely targeted campaigns. [This video](https://shivamsingh.in/index.php/portfolio/fifthel-weaponizing-data-for-politics/?ref=static.internetfreedom.in) by Shivam Shankar Singh titled ‘Weaponising Data for Politics’, explains how precisely parties are able to draw voter profiles from data accessed by dubious means. We are working on a detailed explainer on how this is done, and the privacy concerns emerging from the practice. Meanwhile, we hope the ECI keeps their momentum going after this incident, and engages more meaningfully on how political parties access personal data. ## What has IFF done about it? Much like several concerned people on the internet, we too have questions about this outreach. In the hopes for some answers, we have filed the above mentioned [RTI application](https://drive.google.com/file/d/1U5wYAOc7EHaPpgGkh5prdyrz4oegJX--/view?usp=sharing&ref=static.internetfreedom.in). We have recently also published a [short video](https://x.com/internetfreedom/status/1770317430612447266?s=20&ref=static.internetfreedom.in) summarising concerns and efforts. We are additionally exploring all avenues, including potential legal challenges to the inadequate DPDPA, 2023 pushing for a rights-respecting data protection framework. [Donate Now](https://static.internetfreedom.in/donate) | [Link to our website](https://internetfreedom.in/whatsapp-message-from-meity/)",
    "light_cleaned_comments": "Can a complaint be filed in the Supreme Court against the BJP for using state machinery during the moral code of conduct period? The BJP has used a state resource not available to other political parties."
}