{
    "id": "1ek3rzu",
    "title": "Taco bell free protein ",
    "url": "https://www.reddit.com/gallery/1ek3rzu",
    "selftext": "BHENCHOD!!!!? Taco bell se supreme non veg rice bowl Kara. Location- Mall of faridabad vala",
    "flair": "Crime",
    "score": 86,
    "num_comments": 20,
    "created_utc": 1722800127.0,
    "convurl": "https://i.redd.it/j0j2re0a9pgd1.jpg",
    "comments": [
        "So you asked for Non - Veg and got Non Veg?",
        "Limited edition Shraavan special only in india",
        "Food poisoning",
        "Taco bell living up to its name.",
        "More like tacky bell",
        "What is this",
        "Ye kya exotic chhipkali laaye hai apne brand ke saath? What's that color 🤡",
        "Gecko Bell",
        "Kholte hi dikh gayi, Bach gaya",
        "Baby Geco checking your food..",
        "Gecko Bhel",
        "Consumer court chla ja bhai bhaari compensation milega",
        "gecko- taco",
        "Maze aa gaye. Register a case now",
        "Posts like these make me never want to order from outside again🤮",
        "Seems to be an uncommon breed of lizard. Get it tested.",
        "Poison bell",
        "Food safety is an concern in India, no one follows standard,  no official is interested to do duty, some one report this they will collect money from restaurant and let them go, this is usually seen in Mc Donald's also",
        "Post on Twitter and tag all the authorities, including tacobell India"
    ],
    "cleaned_text": "taco bell free protein bhenchod taco bell se supreme non veg rice bowl kara location mall faridabad vala ",
    "cleaned_title": "taco bell free protein",
    "cleaned_selftext": "bhenchod taco bell se supreme non veg rice bowl kara location mall faridabad vala",
    "cleaned_comments": "asked non veg got non veg limited edition shraavan special india food poisoning taco bell living name like tacky bell ye kya exotic chhipkali laaye hai apne brand ke saath whats color gecko bell kholte hi dikh gayi bach gaya baby geco checking food gecko bhel consumer court chla ja bhai bhaari compensation milega gecko taco maze aa gaye register case posts like make never want order outside seems uncommon breed lizard get tested poison bell food safety concern india one follows standard official interested duty one report collect money restaurant let go usually seen mc donalds also post twitter tag authorities including tacobell india",
    "light_cleaned_title": "Taco bell free protein",
    "light_cleaned_selftext": "BHENCHOD!!!!? Taco bell se supreme non veg rice bowl Kara. Location- Mall of faridabad vala",
    "light_cleaned_comments": "So you asked for Non - Veg and got Non Veg? Limited edition Shraavan special only in india Food poisoning Taco bell living up to its name. More like tacky bell What is this Ye kya exotic chhipkali laaye hai apne brand ke saath? What's that color 🤡 Gecko Bell Kholte hi dikh gayi, Bach gaya Baby Geco checking your food.. Gecko Bhel Consumer court chla ja bhai bhaari compensation milega gecko- taco Maze aa gaye. Register a case now Posts like these make me never want to order from outside again🤮 Seems to be an uncommon breed of lizard. Get it tested. Poison bell Food safety is an concern in India, no one follows standard, no official is interested to do duty, some one report this they will collect money from restaurant and let them go, this is usually seen in Mc Donald's also Post on Twitter and tag all the authorities, including tacobell India"
}