{
    "id": "hom2p9",
    "title": "From, \"sheer suddenness\" to sustained deliberation. A letter to the IT Standing Committee.",
    "url": "https://www.reddit.com/r/india/comments/hom2p9/from_sheer_suddenness_to_sustained_deliberation_a/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/scbsxbcd30a51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=830a5df8d0abbb154e2f8d917be8b0c3ef3fb5a8\n\n## tl;dr\n\nOver the past few months proceedings of the IT Standing Committee despite good faith efforts have been disrupted due to the pandemic. As it looks towards holding a hearing on July 14, 2020 we bring to its notice our prior correspondence and the backlog of issues that merit extensive deliberation. We further indicate issues that merit urgent attention such as website blocking (of DuckDuckGo or Reddit), internet shutdowns and facial recognition technology.\n\n## Let us reject, \"sheer suddenness\"\n\nWe have been corresponding with the Parliamentary Standing Committee on Information Technology. It plays a vital role in our parliamentary democracy that is increasingly digital. This is evident through the sheer breadth of issues we have highlighted in the past and are presented in a tabular form below.\n\n|Date|Subject and context|Link|\n|:-|:-|:-|\n|18.09.2019|Intial letter citing the topics pending from the prior committee which includes the report on Net Neutality. Also indicates further topics including surveillance reforms, free speech and online abuse, disinformation and making large platforms accountable.|[Click Here](https://drive.google.com/file/d/0B3J0iAyRzCGxYlVrcGoyNWZwLW1vMWZUT2l3dmxTejAzczJz/view)|\n|23.10.2019|Issues to be put to MEITY include committee on non-personal data, process on the draft intermediary rules and the cambridge analytica investigation|[Click Here](https://drive.google.com/file/d/1C5ENi9qj9uVEvskP2ldGxKB6J_dUu8fB/view)|\n|20.11.2019|Letter on the issues due to the Pegasus and NSO Spware Scandal and concerns around the cyber security of activists, civil society and human rights defenders|[Click Here](https://drive.google.com/file/d/17CTVhQ0tOwI0trWwfKVbI1VOIni9IjNZ/view?usp=sharing)|\n|08.05.2020|Letter on the need to hold hearings on data privacy and security issues due to contact tracing applications including Aarogya Setu.|[Click Here](https://drive.google.com/file/d/1sowQ6eVL3th_jeFlD_n7-Q1Zq1CXavJB/view?usp=sharing)|\n|04.06.2020|Follow-up letter on with updated analysis and questions which arose specifically on Aarogya Setu. This goes beyond the madatory and voluntary nature, towards concerning issues of a potential digital health stack.|[Click Here](https://drive.google.com/file/d/1dLbEuY3VFLbSV9Mq8BKkR0-lrivjPA7A/view?usp=sharing)|\n|23.06.2020|Letter containing the breaches to our cyber security including the revelation of sensitive personal data including Aadhaar details and further investigations revealing growth of spearfishing attack firms and targets within India.|[Click Here](https://docs.google.com/document/d/1ZOWi8cgFsRY_DE4wMxe_rnXg5zt0n-6VOgW1MH7idzA/edit)|\n\nToday, we sent a letter to the IT Standing Committee with a brief of these prior issues many of which are pending consideration and reject the temptation of *ad-hocism*. Our larger ask is for regular sittings so the proper role of oversight over especially the Ministry of Electronics and IT and the Department of Telecom can be played by it.\n\n## Better foresight, not, \"unexpected nature\".\n\nTo better consider more urgent issues, better foresight and planning is needed in four vital areas. While some of them fall within pending topics such as, \"Citizens Privacy and Security\" there is need to do more as informed by our work over the past few months. This will help evidence based and considered policy making responses within legislation.\n\n* **Issue 1: Growth of mass surveillance**\n\nAfter consistent follow up, we were  able to obtain through the Right to Information the bulk requisition of CDRs of telecom subscribers in various telecom circles. As per a letter of concern by telecom operators through an industry association this would impact every subscriber including high public functionaries including High Court and Supreme Court judges and Parliamentarians. All of this correspondence is contained on the [**following link**](https://internetfreedom.in/bulk-cdr-mass-surveillance/).\n\n* **Issue 2: Indiscriminate website blocking**\n\nSecond, the blocking of websites is being done in an increasingly arbitrary manner as evidenced through the following documentation below. This is among other things a net neutrality violation but also an uncanalised and secretive use of powers under the Information Technology Act, the Telegraph Act and the UA Licenses. These include, block on the popular file sharing service WeTransfer dated June 09, 2020 ([**link**](https://internetfreedom.in/we-urge-the-dot-to-unblock-wetransfer-whattheblock/)); blocking of “Chinese apps” dated July 1, 2020 ([**link**](https://internetfreedom.in/59-apps-blocked-our-statement-and-initial-action/)); blocking of the privacy focussed search engine DuckDuckGo dated July 2, 2020 ([**link**](https://internetfreedom.in/blocking-of-duckduckgo-needs-to-be-reversed-we-wrote-to-the-government-whattheduck/)). We are at present receiving alarming reports on the SaveTheInternet inconsistent blocking of the social networking platform Reddit and New York Times.\n\n* **Issue 3: Illegal and unregulated State use of facial recognition technology**\n\nThe growth of growth of facial recognition technology in India is reaching alarming proportions. Much of this use is illegal and not sanctioned by law. It’s widespread use in policing is a matter of concern and undermines the democractic guarantees and fundamental rights guaranteed by the Constitution. We have tangibly demonstrated this through its use by the Delhi Police as available [**in a recent public post**](https://internetfreedom.in/is-the-illegal-use-of-facial-recognition-technology-by-the-delhi-police-akin-to-mass-surveillance-you-decide-project-panoptic/) dated July 3, 2020.\n\n* **Issue 4: Reforming and examining the constitutional basis of Internet Shutdowns**\n\nThe Committee may consider the absence of reform of the process and power on Internet Shutdowns as per a assurances to bring it in compliance with the Supreme Court’s Judgement in *Anuradha Bhasin v. Union of India*. This springs not only from the directions of the Hon’ble Supreme Court and an assurance by the Minister of State for Communications stated in Rajya Sabha on 06 February 2020 in response to a parliamentary question. More information on this is included with our correspondence to the proper government ministries as per[ **this public  update  dated April 4, 2020**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/).\n\nWe promise to continue engaging with all government and state institutions in good faith to advance these objectives. To us Parliamentary Committees hold special promise. We hope the meeting on July 14, 2020 leads not only to an informed interaction with the Ministry of Electronics and IT but also as an opportunity to consider issues past, present and future.\n\n## Important Documents\n\n1. Our letter to the Standing Committee on Information Technology on Substantive issues which merit detailed examination including, “Citizens Data Security and Privacy” dated July 10, 2020 ([**link**](https://drive.google.com/file/d/1AuBKkVnmdveDF0Yz1x7jaAiUdfzEzwb1/view?usp=sharing))\n2. A letter on cyber-security to the Standing Committee on IT \\[[**link**](https://internetfreedom.in/how-safe-is-your-internet-access/)\\]\n3. Committee on IT : Get up! Stand up, for our privacy rights! \\[[**link**](https://internetfreedom.in/get-up-stand-up-for-our-privacy-rights/)\\]",
    "flair": "Policy/Economy",
    "score": 237,
    "num_comments": 3,
    "created_utc": 1594374159,
    "convurl": "https://b.thumbs.redditmedia.com/GZyqzzJG-VBXspZ2PYgojyohV4niD7OPOid0F8zk7GQ.jpg",
    "comments": [
        "So pardon me for.the ignorance but what is the IT committee and who controls it.\n\n.there was a time back in the days when I was convinced that even if corruptionnis rampant.and shit, at least the Army and the judiciary will always be independent. What happened with the motherfucking cunt of an Army chief that took a 5 year job offer has completely destroyed any such motion for me.\n\nAs for Judiciary, I'm pretty sure that cat left the bag when judges for transferred midnight to all save Amit Shah from the legal proceedings that would have taken place next day.\n\nSo, I'm wondering if there would when be a point of it all given the current political climate in India where morons rule.",
        "The number of comments on this thread show that we have given up.",
        "Respect"
    ],
    "cleaned_text": "sheer suddenness sustained deliberation letter standing committee ampxb tldr past months proceedings standing committee despite good faith efforts disrupted due pandemic looks towards holding hearing july bring notice prior correspondence backlog issues merit extensive deliberation indicate issues merit urgent attention website blocking duckduckgo reddit internet shutdowns facial recognition technology let us reject sheer suddenness corresponding parliamentary standing committee information technology plays vital role parliamentary democracy increasingly digital evident sheer breadth issues highlighted past presented tabular form datesubject contextlink intial letter citing topics pending prior committee includes report net neutality also indicates topics including surveillance reforms free speech online abuse disinformation making large platforms accountableclick herehttpsdrivegooglecomfiledbjiayrzcgxylvrcgoynwzwlwvmwzutldmxtejazczjzview issues put meity include committee nonpersonal data process draft intermediary rules cambridge analytica investigationclick herehttpsdrivegooglecomfiledceniqjuvevskpldgxkbjduufbview letter issues due pegasus nso spware scandal concerns around cyber security activists civil society human rights defendersclick herehttpsdrivegooglecomfiledctvhqtowitrwwfkvbivoiniijnzviewuspsharing letter need hold hearings data privacy security issues due contact tracing applications including aarogya setuclick herehttpsdrivegooglecomfiledsowqevlthjefldnqzqcxavjbviewuspsharing followup letter updated analysis questions arose specifically aarogya setu goes beyond madatory voluntary nature towards concerning issues potential digital health stackclick herehttpsdrivegooglecomfileddlbeuyvflbsvmqbkkrlrivjpaaviewuspsharing letter containing breaches cyber security including revelation sensitive personal data including aadhaar details investigations revealing growth spearfishing attack firms targets within indiaclick herehttpsdocsgooglecomdocumentdzowicgfsrydewmxernxgztnvogwmhidzaedit today sent letter standing committee brief prior issues many pending consideration reject temptation adhocism larger ask regular sittings proper role oversight especially ministry electronics department telecom played better foresight unexpected nature better consider urgent issues better foresight planning needed four vital areas fall within pending topics citizens privacy security need informed work past months help evidence based considered policy making responses within legislation issue growth mass surveillance consistent follow able obtain right information bulk requisition cdrs telecom subscribers various telecom circles per letter concern telecom operators industry association would impact every subscriber including high public functionaries including high court supreme court judges parliamentarians correspondence contained following linkhttpsinternetfreedominbulkcdrmasssurveillance issue indiscriminate website blocking second blocking websites done increasingly arbitrary manner evidenced following documentation among things net neutrality violation also uncanalised secretive use powers information technology act telegraph act ua licenses include block popular file sharing service wetransfer dated june linkhttpsinternetfreedominweurgethedottounblockwetransferwhattheblock blocking chinese apps dated july linkhttpsinternetfreedominappsblockedourstatementandinitialaction blocking privacy focussed search engine duckduckgo dated july linkhttpsinternetfreedominblockingofduckduckgoneedstobereversedwewrotetothegovernmentwhattheduck present receiving alarming reports savetheinternet inconsistent blocking social networking platform reddit new york times issue illegal unregulated state use facial recognition technology growth growth facial recognition technology india reaching alarming proportions much use illegal sanctioned law widespread use policing matter concern undermines democractic guarantees fundamental rights guaranteed constitution tangibly demonstrated use delhi police available recent public posthttpsinternetfreedoministheillegaluseoffacialrecognitiontechnologybythedelhipoliceakintomasssurveillanceyoudecideprojectpanoptic dated july issue reforming examining constitutional basis internet shutdowns committee may consider absence reform process power internet shutdowns per assurances bring compliance supreme courts judgement anuradha bhasin v union india springs directions honble supreme court assurance minister state communications stated rajya sabha february response parliamentary question information included correspondence proper government ministries per public update dated april httpsinternetfreedomincantdroptheballoninternetshutdownreform promise continue engaging government state institutions good faith advance objectives us parliamentary committees hold special promise hope meeting july leads informed interaction ministry electronics also opportunity consider issues past present future important documents letter standing committee information technology substantive issues merit detailed examination including citizens data security privacy dated july linkhttpsdrivegooglecomfiledaubkkvnmdvedfyzxjaaiudfzezwbviewuspsharing letter cybersecurity standing committee linkhttpsinternetfreedominhowsafeisyourinternetaccess committee get stand privacy rights linkhttpsinternetfreedomingetupstandupforourprivacyrights ",
    "cleaned_title": "sheer suddenness sustained deliberation letter standing committee",
    "cleaned_selftext": "ampxb tldr past months proceedings standing committee despite good faith efforts disrupted due pandemic looks towards holding hearing july bring notice prior correspondence backlog issues merit extensive deliberation indicate issues merit urgent attention website blocking duckduckgo reddit internet shutdowns facial recognition technology let us reject sheer suddenness corresponding parliamentary standing committee information technology plays vital role parliamentary democracy increasingly digital evident sheer breadth issues highlighted past presented tabular form datesubject contextlink intial letter citing topics pending prior committee includes report net neutality also indicates topics including surveillance reforms free speech online abuse disinformation making large platforms accountableclick herehttpsdrivegooglecomfiledbjiayrzcgxylvrcgoynwzwlwvmwzutldmxtejazczjzview issues put meity include committee nonpersonal data process draft intermediary rules cambridge analytica investigationclick herehttpsdrivegooglecomfiledceniqjuvevskpldgxkbjduufbview letter issues due pegasus nso spware scandal concerns around cyber security activists civil society human rights defendersclick herehttpsdrivegooglecomfiledctvhqtowitrwwfkvbivoiniijnzviewuspsharing letter need hold hearings data privacy security issues due contact tracing applications including aarogya setuclick herehttpsdrivegooglecomfiledsowqevlthjefldnqzqcxavjbviewuspsharing followup letter updated analysis questions arose specifically aarogya setu goes beyond madatory voluntary nature towards concerning issues potential digital health stackclick herehttpsdrivegooglecomfileddlbeuyvflbsvmqbkkrlrivjpaaviewuspsharing letter containing breaches cyber security including revelation sensitive personal data including aadhaar details investigations revealing growth spearfishing attack firms targets within indiaclick herehttpsdocsgooglecomdocumentdzowicgfsrydewmxernxgztnvogwmhidzaedit today sent letter standing committee brief prior issues many pending consideration reject temptation adhocism larger ask regular sittings proper role oversight especially ministry electronics department telecom played better foresight unexpected nature better consider urgent issues better foresight planning needed four vital areas fall within pending topics citizens privacy security need informed work past months help evidence based considered policy making responses within legislation issue growth mass surveillance consistent follow able obtain right information bulk requisition cdrs telecom subscribers various telecom circles per letter concern telecom operators industry association would impact every subscriber including high public functionaries including high court supreme court judges parliamentarians correspondence contained following linkhttpsinternetfreedominbulkcdrmasssurveillance issue indiscriminate website blocking second blocking websites done increasingly arbitrary manner evidenced following documentation among things net neutrality violation also uncanalised secretive use powers information technology act telegraph act ua licenses include block popular file sharing service wetransfer dated june linkhttpsinternetfreedominweurgethedottounblockwetransferwhattheblock blocking chinese apps dated july linkhttpsinternetfreedominappsblockedourstatementandinitialaction blocking privacy focussed search engine duckduckgo dated july linkhttpsinternetfreedominblockingofduckduckgoneedstobereversedwewrotetothegovernmentwhattheduck present receiving alarming reports savetheinternet inconsistent blocking social networking platform reddit new york times issue illegal unregulated state use facial recognition technology growth growth facial recognition technology india reaching alarming proportions much use illegal sanctioned law widespread use policing matter concern undermines democractic guarantees fundamental rights guaranteed constitution tangibly demonstrated use delhi police available recent public posthttpsinternetfreedoministheillegaluseoffacialrecognitiontechnologybythedelhipoliceakintomasssurveillanceyoudecideprojectpanoptic dated july issue reforming examining constitutional basis internet shutdowns committee may consider absence reform process power internet shutdowns per assurances bring compliance supreme courts judgement anuradha bhasin v union india springs directions honble supreme court assurance minister state communications stated rajya sabha february response parliamentary question information included correspondence proper government ministries per public update dated april httpsinternetfreedomincantdroptheballoninternetshutdownreform promise continue engaging government state institutions good faith advance objectives us parliamentary committees hold special promise hope meeting july leads informed interaction ministry electronics also opportunity consider issues past present future important documents letter standing committee information technology substantive issues merit detailed examination including citizens data security privacy dated july linkhttpsdrivegooglecomfiledaubkkvnmdvedfyzxjaaiudfzezwbviewuspsharing letter cybersecurity standing committee linkhttpsinternetfreedominhowsafeisyourinternetaccess committee get stand privacy rights linkhttpsinternetfreedomingetupstandupforourprivacyrights",
    "cleaned_comments": "pardon forthe ignorance committee controls time back days convinced even corruptionnis rampantand shit least army judiciary always independent happened motherfucking cunt army chief took year job offer completely destroyed motion judiciary im pretty sure cat left bag judges transferred midnight save amit shah legal proceedings would taken place next day im wondering would point given current political climate india morons rule number comments thread show given respect",
    "light_cleaned_title": "From, \"sheer suddenness\" to sustained deliberation. A letter to the IT Standing Committee.",
    "light_cleaned_selftext": "## tl;dr Over the past few months proceedings of the IT Standing Committee despite good faith efforts have been disrupted due to the pandemic. As it looks towards holding a hearing on July 14, 2020 we bring to its notice our prior correspondence and the backlog of issues that merit extensive deliberation. We further indicate issues that merit urgent attention such as website blocking (of DuckDuckGo or Reddit), internet shutdowns and facial recognition technology. ## Let us reject, \"sheer suddenness\" We have been corresponding with the Parliamentary Standing Committee on Information Technology. It plays a vital role in our parliamentary democracy that is increasingly digital. This is evident through the sheer breadth of issues we have highlighted in the past and are presented in a tabular form below. |Date|Subject and context|Link| |:-|:-|:-| |18.09.2019|Intial letter citing the topics pending from the prior committee which includes the report on Net Neutality. Also indicates further topics including surveillance reforms, free speech and online abuse, disinformation and making large platforms accountable.|[Click Here](https://drive.google.com/file/d/0B3J0iAyRzCGxYlVrcGoyNWZwLW1vMWZUT2l3dmxTejAzczJz/view)| |23.10.2019|Issues to be put to MEITY include committee on non-personal data, process on the draft intermediary rules and the cambridge analytica investigation|[Click Here](https://drive.google.com/file/d/1C5ENi9qj9uVEvskP2ldGxKB6J_dUu8fB/view)| |20.11.2019|Letter on the issues due to the Pegasus and NSO Spware Scandal and concerns around the cyber security of activists, civil society and human rights defenders|[Click Here](https://drive.google.com/file/d/17CTVhQ0tOwI0trWwfKVbI1VOIni9IjNZ/view?usp=sharing)| |08.05.2020|Letter on the need to hold hearings on data privacy and security issues due to contact tracing applications including Aarogya Setu.|[Click Here](https://drive.google.com/file/d/1sowQ6eVL3th_jeFlD_n7-Q1Zq1CXavJB/view?usp=sharing)| |04.06.2020|Follow-up letter on with updated analysis and questions which arose specifically on Aarogya Setu. This goes beyond the madatory and voluntary nature, towards concerning issues of a potential digital health stack.|[Click Here](https://drive.google.com/file/d/1dLbEuY3VFLbSV9Mq8BKkR0-lrivjPA7A/view?usp=sharing)| |23.06.2020|Letter containing the breaches to our cyber security including the revelation of sensitive personal data including Aadhaar details and further investigations revealing growth of spearfishing attack firms and targets within India.|[Click Here](https://docs.google.com/document/d/1ZOWi8cgFsRY_DE4wMxe_rnXg5zt0n-6VOgW1MH7idzA/edit)| Today, we sent a letter to the IT Standing Committee with a brief of these prior issues many of which are pending consideration and reject the temptation of *ad-hocism*. Our larger ask is for regular sittings so the proper role of oversight over especially the Ministry of Electronics and IT and the Department of Telecom can be played by it. ## Better foresight, not, \"unexpected nature\". To better consider more urgent issues, better foresight and planning is needed in four vital areas. While some of them fall within pending topics such as, \"Citizens Privacy and Security\" there is need to do more as informed by our work over the past few months. This will help evidence based and considered policy making responses within legislation. * **Issue 1: Growth of mass surveillance** After consistent follow up, we were able to obtain through the Right to Information the bulk requisition of CDRs of telecom subscribers in various telecom circles. As per a letter of concern by telecom operators through an industry association this would impact every subscriber including high public functionaries including High Court and Supreme Court judges and Parliamentarians. All of this correspondence is contained on the [**following link**](https://internetfreedom.in/bulk-cdr-mass-surveillance/). * **Issue 2: Indiscriminate website blocking** Second, the blocking of websites is being done in an increasingly arbitrary manner as evidenced through the following documentation below. This is among other things a net neutrality violation but also an uncanalised and secretive use of powers under the Information Technology Act, the Telegraph Act and the UA Licenses. These include, block on the popular file sharing service WeTransfer dated June 09, 2020 ([**link**](https://internetfreedom.in/we-urge-the-dot-to-unblock-wetransfer-whattheblock/)); blocking of “Chinese apps” dated July 1, 2020 ([**link**](https://internetfreedom.in/59-apps-blocked-our-statement-and-initial-action/)); blocking of the privacy focussed search engine DuckDuckGo dated July 2, 2020 ([**link**](https://internetfreedom.in/blocking-of-duckduckgo-needs-to-be-reversed-we-wrote-to-the-government-whattheduck/)). We are at present receiving alarming reports on the SaveTheInternet inconsistent blocking of the social networking platform Reddit and New York Times. * **Issue 3: Illegal and unregulated State use of facial recognition technology** The growth of growth of facial recognition technology in India is reaching alarming proportions. Much of this use is illegal and not sanctioned by law. It’s widespread use in policing is a matter of concern and undermines the democractic guarantees and fundamental rights guaranteed by the Constitution. We have tangibly demonstrated this through its use by the Delhi Police as available [**in a recent public post**](https://internetfreedom.in/is-the-illegal-use-of-facial-recognition-technology-by-the-delhi-police-akin-to-mass-surveillance-you-decide-project-panoptic/) dated July 3, 2020. * **Issue 4: Reforming and examining the constitutional basis of Internet Shutdowns** The Committee may consider the absence of reform of the process and power on Internet Shutdowns as per a assurances to bring it in compliance with the Supreme Court’s Judgement in *Anuradha Bhasin v. Union of India*. This springs not only from the directions of the Hon’ble Supreme Court and an assurance by the Minister of State for Communications stated in Rajya Sabha on 06 February 2020 in response to a parliamentary question. More information on this is included with our correspondence to the proper government ministries as per[ **this public update dated April 4, 2020**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/). We promise to continue engaging with all government and state institutions in good faith to advance these objectives. To us Parliamentary Committees hold special promise. We hope the meeting on July 14, 2020 leads not only to an informed interaction with the Ministry of Electronics and IT but also as an opportunity to consider issues past, present and future. ## Important Documents 1. Our letter to the Standing Committee on Information Technology on Substantive issues which merit detailed examination including, “Citizens Data Security and Privacy” dated July 10, 2020 ([**link**](https://drive.google.com/file/d/1AuBKkVnmdveDF0Yz1x7jaAiUdfzEzwb1/view?usp=sharing)) 2. A letter on cyber-security to the Standing Committee on IT \\[[**link**](https://internetfreedom.in/how-safe-is-your-internet-access/)\\] 3. Committee on IT : Get up! Stand up, for our privacy rights! \\[[**link**](https://internetfreedom.in/get-up-stand-up-for-our-privacy-rights/)\\]",
    "light_cleaned_comments": "So pardon me for.the ignorance but what is the IT committee and who controls it. .there was a time back in the days when I was convinced that even if corruptionnis rampant.and shit, at least the Army and the judiciary will always be independent. What happened with the motherfucking cunt of an Army chief that took a 5 year job offer has completely destroyed any such motion for me. As for Judiciary, I'm pretty sure that cat left the bag when judges for transferred midnight to all save Amit Shah from the legal proceedings that would have taken place next day. So, I'm wondering if there would when be a point of it all given the current political climate in India where morons rule. The number of comments on this thread show that we have given up. Respect"
}