{
    "id": "17fpqfj",
    "title": "No dog bite marks,\" says hospital that treated Wagh Bakri chief Parag Desai",
    "url": "https://i.redd.it/uyw6guv2b8wb1.jpg",
    "selftext": "Why does the media report without verifying ?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698187422.0,
    "convurl": "https://i.redd.it/uyw6guv2b8wb1.jpg",
    "comments": [
        "Can’t genocide minorities, can’t genocide dogs. What’s going to become of this country? 😭",
        "More fuel for the dog nuts on here. If the dogs chase him and he trips and falls, it is still their fault",
        "Same energy as \"They didn'tdie of COVID, they died of pneumonia\" 🤡",
        "Wait what?",
        "/s",
        "Yes we need a Hitler. Oh wait he killed more majority people than dogs",
        "My bad",
        "No worries. That’s the state of the country that it wasn’t obvious."
    ],
    "cleaned_text": "dog bite marks says hospital treated wagh bakri chief parag desai media report without verifying ",
    "cleaned_title": "dog bite marks says hospital treated wagh bakri chief parag desai",
    "cleaned_selftext": "media report without verifying",
    "cleaned_comments": "cant genocide minorities cant genocide dogs whats going become country fuel dog nuts dogs chase trips falls still fault energy didntdie covid died pneumonia wait yes need hitler oh wait killed majority people dogs bad worries thats state country wasnt obvious",
    "light_cleaned_title": "No dog bite marks,\" says hospital that treated Wagh Bakri chief Parag Desai",
    "light_cleaned_selftext": "Why does the media report without verifying ?",
    "light_cleaned_comments": "Can’t genocide minorities, can’t genocide dogs. What’s going to become of this country? 😭 More fuel for the dog nuts on here. If the dogs chase him and he trips and falls, it is still their fault Same energy as \"They didn'tdie of COVID, they died of pneumonia\" 🤡 Wait what? /s Yes we need a Hitler. Oh wait he killed more majority people than dogs My bad No worries. That’s the state of the country that it wasn’t obvious."
}