{
    "id": "165blf2",
    "title": "PSA: Eletricity Bill Scam",
    "url": "https://www.reddit.com/r/india/comments/165blf2/psa_eletricity_bill_scam/",
    "selftext": "Hello folks.\n\nWas targeted by a whole new type of scam today. Got a message from my landlord that the electricity is about to be cut soon. Of course that had me panicking and checking the payment status. Then I realized this might be a new scam.\n\nI called the mobile number nonetheless for some much-needed entertainment. Scammer started off the call by exactly mentioning how much bill I had paid and when. Then went on to say that this bill did not get posted and therefore I would have to follow his instructions to post it. He asked me to open playstore and search quick support. Then results showed Team Viewer Quick Support.\n\n&#x200B;\n\nAt this point I could not hold it in any longer and asked what is he up to and how many people he had scammed today. This was followed by a colorful and expletive-ridden conversation by him. Sharing this great gentlemen's number here for your entertainment if you would like. \n\n8093812171\n\n&#x200B;\n\nRed flags\n\n* Mobile no. instead of helpline number\n* Getting updates on WhatsApp from a nonbusiness account\n* Lacking basic structure or punctuation\n* Asking to download any further apps that grant access to your device\n\nStay safe people and please let people who might be vulnerable know of this new modus operandi. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/xezydfs258lb1.jpg?width=720&format=pjpg&auto=webp&s=cbfbc8eb7970b864c3ff01efbb04e2342c437d24",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693393507.0,
    "convurl": "https://b.thumbs.redditmedia.com/IxZv1-nCVF_cwSSTJoEiQdhUbfRvsPIv-a_ozhYMbzI.jpg",
    "comments": [
        "My friend received a whatsapp message that the electricity will be cut-off, from mobile number 6006859146 and was told to contact number 8971857545\n\nI am mentioning numbers so someone else may not be scammed.",
        "Electricity officer?",
        "Yeah I got something along those lines as well. Blocked them immediately ofc"
    ],
    "cleaned_text": "psa eletricity bill scam hello folks targeted whole new type scam today got message landlord electricity cut soon course panicking checking payment status realized might new scam called mobile number nonetheless muchneeded entertainment scammer started call exactly mentioning much bill paid went say bill get posted therefore would follow instructions post asked open playstore search quick support results showed team viewer quick support xb point could hold longer asked many people scammed today followed colorful expletiveridden conversation sharing great gentlemens number entertainment would like xb red flags mobile instead helpline number getting updates whatsapp nonbusiness account lacking basic structure punctuation asking download apps grant access device stay safe people please let people might vulnerable know new modus operandi xb xb xb ",
    "cleaned_title": "psa eletricity bill scam",
    "cleaned_selftext": "hello folks targeted whole new type scam today got message landlord electricity cut soon course panicking checking payment status realized might new scam called mobile number nonetheless muchneeded entertainment scammer started call exactly mentioning much bill paid went say bill get posted therefore would follow instructions post asked open playstore search quick support results showed team viewer quick support xb point could hold longer asked many people scammed today followed colorful expletiveridden conversation sharing great gentlemens number entertainment would like xb red flags mobile instead helpline number getting updates whatsapp nonbusiness account lacking basic structure punctuation asking download apps grant access device stay safe people please let people might vulnerable know new modus operandi xb xb xb",
    "cleaned_comments": "friend received whatsapp message electricity cutoff mobile number told contact number mentioning numbers someone else may scammed electricity officer yeah got something along lines well blocked immediately ofc",
    "light_cleaned_title": "PSA: Eletricity Bill Scam",
    "light_cleaned_selftext": "Hello folks. Was targeted by a whole new type of scam today. Got a message from my landlord that the electricity is about to be cut soon. Of course that had me panicking and checking the payment status. Then I realized this might be a new scam. I called the mobile number nonetheless for some much-needed entertainment. Scammer started off the call by exactly mentioning how much bill I had paid and when. Then went on to say that this bill did not get posted and therefore I would have to follow his instructions to post it. He asked me to open playstore and search quick support. Then results showed Team Viewer Quick Support. &#x200B; At this point I could not hold it in any longer and asked what is he up to and how many people he had scammed today. This was followed by a colorful and expletive-ridden conversation by him. Sharing this great gentlemen's number here for your entertainment if you would like. 8093812171 &#x200B; Red flags * Mobile no. instead of helpline number * Getting updates on WhatsApp from a nonbusiness account * Lacking basic structure or punctuation * Asking to download any further apps that grant access to your device Stay safe people and please let people who might be vulnerable know of this new modus operandi. &#x200B; &#x200B; &#x200B;",
    "light_cleaned_comments": "My friend received a whatsapp message that the electricity will be cut-off, from mobile number 6006859146 and was told to contact number 8971857545 I am mentioning numbers so someone else may not be scammed. Electricity officer? Yeah I got something along those lines as well. Blocked them immediately ofc"
}