{
    "id": "1frzi5v",
    "title": "Modi Government’s Fraud, Minimum Wage increased by just Rs 3/- per day",
    "url": "https://countercurrents.org/2024/09/modi-governments-fraud-minimum-wage-increased-by-just-rs-3-per-day/",
    "selftext": "On 26 September 2024, newspapers and social media went abuzz with the headline that the Modi Government had given a massive bonanza to the workers ahead of the festivals, by revising the minimum wages. \n\nOn careful observation, it is seen that the revision was on the dearness allowance. It is further revealed that the increase is less than 1%, from ₹3 to ₹7, less than the inflation.\n\nMoreover, it is only applicable to the workers employed by the Central Government.\n\nThe statutory minimum wage still lies at ₹178, and has not been revised in 7 years.\n\n",
    "flair": "Policy/Economy",
    "score": 181,
    "num_comments": 16,
    "created_utc": 1727597370.0,
    "convurl": "https://external-preview.redd.it/0qvbpwBzno1ihelhl6ngEabXkQ7jeVlMhSqZ_HoRHqU.jpg?auto=webp&s=713f4e35a89d82f27d043db3272680dfaf84dd41",
    "comments": [
        "Ohh yes.\nThey cannot even buy a 10 rupees Frooti with this increased income.\n\nWah re waah.",
        "Bhakts will see this as an absolute win since Muslims are also affected by this.",
        "This is why, young people like you needs to get into politics and change this.",
        "I am already in politics, but the change is not so easy.",
        "Good you are in the right path, you have a whole life ahead of you. With some luck anything is possible. ",
        "It's not a matter of luck.",
        "How did you even become a politician ",
        "When that happens, they throw you in jail under false charges without trial.",
        "Frooti is a top luxury item in india, got it? /s",
        "Thanks for the reminder, increase GST for all liquids that are suspensions."
    ],
    "cleaned_text": "modi governments fraud minimum wage increased rs per day september newspapers social media went abuzz headline modi government given massive bonanza workers ahead festivals revising minimum wages careful observation seen revision dearness allowance revealed increase less less inflation moreover applicable workers employed central government statutory minimum wage still lies revised years ",
    "cleaned_title": "modi governments fraud minimum wage increased rs per day",
    "cleaned_selftext": "september newspapers social media went abuzz headline modi government given massive bonanza workers ahead festivals revising minimum wages careful observation seen revision dearness allowance revealed increase less less inflation moreover applicable workers employed central government statutory minimum wage still lies revised years",
    "cleaned_comments": "ohh yes even buy rupees frooti increased income wah waah bhakts see absolute win since muslims also affected young people like needs get politics change already politics change easy good right path whole life ahead luck anything possible matter luck even become politician happens throw jail false charges without trial frooti top luxury item india got thanks reminder increase gst liquids suspensions",
    "light_cleaned_title": "Modi Government’s Fraud, Minimum Wage increased by just Rs 3/- per day",
    "light_cleaned_selftext": "On 26 September 2024, newspapers and social media went abuzz with the headline that the Modi Government had given a massive bonanza to the workers ahead of the festivals, by revising the minimum wages. On careful observation, it is seen that the revision was on the dearness allowance. It is further revealed that the increase is less than 1%, from ₹3 to ₹7, less than the inflation. Moreover, it is only applicable to the workers employed by the Central Government. The statutory minimum wage still lies at ₹178, and has not been revised in 7 years.",
    "light_cleaned_comments": "Ohh yes. They cannot even buy a 10 rupees Frooti with this increased income. Wah re waah. Bhakts will see this as an absolute win since Muslims are also affected by this. This is why, young people like you needs to get into politics and change this. I am already in politics, but the change is not so easy. Good you are in the right path, you have a whole life ahead of you. With some luck anything is possible. It's not a matter of luck. How did you even become a politician When that happens, they throw you in jail under false charges without trial. Frooti is a top luxury item in india, got it? /s Thanks for the reminder, increase GST for all liquids that are suspensions."
}