{
    "id": "16w3ico",
    "title": "Choto maate...Hold up..wtf??",
    "url": "https://www.drishtiias.com/daily-updates/daily-news-analysis/marital-rape-in-india-1",
    "selftext": "Can a lawyer confirm any of this? \n\nSection 375 of the Indian Penal Code (IPC):\n\nException 2 of Section 375 of the Indian Penal Code states that “sexual intercourse by a man with his wife, and if the wife not being under fifteen years of age, is not rape”.\n\nSooo....if she is 15 and sbove..🤡 wot the heck...\n\nAmong other nonsense.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1696070039,
    "convurl": "https://external-preview.redd.it/qJg2lCQhsmxrTZBjKIRdUle_43-GEff6MVva151JBN8.jpg?auto=webp&s=d75ef7f0f337bad3d0e61c3622ae8ba92d0987c5",
    "comments": [
        "POCSO supersedes it. \n\nAll sexual acts with children under the age of 18 is a sexual offense.",
        "I do not understand what alarms you. \n\nThis decriminalizes marital rape for spouses above 15.\nIt was modified in 2017 to 18 to align with 18 as legal age of consent. \n\nNon-consensual sexual interaction between spouses is not considered as rape if the victim is above 18. Until 2017 it used to be 15. \n\nHowever,\n\nAny kind of sexual activity with a person under the age of 18 is a sexual offence. It has been so since the POCSO Act of 2012. \n\nAnd, what would constite a marital rape constitutes domestic abuse in the current legal framework which is a civil offense and not a criminal one.",
        "I wasn't alarmed but the below 3 points are pretty scandalous...\n\nThanks for the explanation anyway. \n\n1. This decriminalizes marital rape for spouses above 15.\nIt was modified in 2017 to 18 to align with 18 as legal age of consent. \n\n2. Non-consensual sexual interaction between spouses is not considered as rape if the victim is above 18. Until 2017 it used to be 15. \n\n3. And, what would constite a marital rape constitutes domestic abuse in the current legal framework which is a civil offense and not a criminal one.",
        "Yes.\n\nChild abuse laws were nearly absent till 2003. Later too it didn’t protect non-female victims. \n\nAnd rape was restricted to vagino-penal intercourse only. Non-vagino-penal, non-consensual intercourse would have been Unnatural Sex + Physical Assault and not Rape. \n\nHopefully the new penal code is properly streamlined, including all new acts that supersede the relevant sections of IPC."
    ],
    "cleaned_text": "choto maatehold upwtf lawyer confirm section indian penal code ipc exception section indian penal code states sexual intercourse man wife wife fifteen years age rape soooif sbove wot heck among nonsense ",
    "cleaned_title": "choto maatehold upwtf",
    "cleaned_selftext": "lawyer confirm section indian penal code ipc exception section indian penal code states sexual intercourse man wife wife fifteen years age rape soooif sbove wot heck among nonsense",
    "cleaned_comments": "pocso supersedes sexual acts children age sexual offense understand alarms decriminalizes marital rape spouses modified align legal age consent nonconsensual sexual interaction spouses considered rape victim used however kind sexual activity person age sexual offence since pocso act would constite marital rape constitutes domestic abuse current legal framework civil offense criminal one wasnt alarmed points pretty scandalous thanks explanation anyway decriminalizes marital rape spouses modified align legal age consent nonconsensual sexual interaction spouses considered rape victim used would constite marital rape constitutes domestic abuse current legal framework civil offense criminal one yes child abuse laws nearly absent till later didnt protect nonfemale victims rape restricted vaginopenal intercourse nonvaginopenal nonconsensual intercourse would unnatural sex physical assault rape hopefully new penal code properly streamlined including new acts supersede relevant sections ipc",
    "light_cleaned_title": "Choto maate...Hold up..wtf??",
    "light_cleaned_selftext": "Can a lawyer confirm any of this? Section 375 of the Indian Penal Code (IPC): Exception 2 of Section 375 of the Indian Penal Code states that “sexual intercourse by a man with his wife, and if the wife not being under fifteen years of age, is not rape”. Sooo....if she is 15 and sbove..🤡 wot the heck... Among other nonsense.",
    "light_cleaned_comments": "POCSO supersedes it. All sexual acts with children under the age of 18 is a sexual offense. I do not understand what alarms you. This decriminalizes marital rape for spouses above 15. It was modified in 2017 to 18 to align with 18 as legal age of consent. Non-consensual sexual interaction between spouses is not considered as rape if the victim is above 18. Until 2017 it used to be 15. However, Any kind of sexual activity with a person under the age of 18 is a sexual offence. It has been so since the POCSO Act of 2012. And, what would constite a marital rape constitutes domestic abuse in the current legal framework which is a civil offense and not a criminal one. I wasn't alarmed but the below 3 points are pretty scandalous... Thanks for the explanation anyway. 1. This decriminalizes marital rape for spouses above 15. It was modified in 2017 to 18 to align with 18 as legal age of consent. 2. Non-consensual sexual interaction between spouses is not considered as rape if the victim is above 18. Until 2017 it used to be 15. 3. And, what would constite a marital rape constitutes domestic abuse in the current legal framework which is a civil offense and not a criminal one. Yes. Child abuse laws were nearly absent till 2003. Later too it didn’t protect non-female victims. And rape was restricted to vagino-penal intercourse only. Non-vagino-penal, non-consensual intercourse would have been Unnatural Sex + Physical Assault and not Rape. Hopefully the new penal code is properly streamlined, including all new acts that supersede the relevant sections of IPC."
}