{
    "id": "1ffvf39",
    "title": "CBI Can't Justify Arvind Kejriwal's Arrest On His 'Evasive Replies'; Accused Has Right To Remain Silent : Justice Ujjal Bhuyan",
    "url": "https://www.livelaw.in/top-stories/cbi-cant-justify-arvind-kejriwals-arrest-on-his-evasive-replies-accused-has-right-to-remain-silent-justice-ujjal-bhuyan-269539",
    "selftext": "Justice Bhuyan wrote : \n\n\"The respondent is definitely wrong when it says that because the appellant was evasive in his reply, because he was not cooperating with the investigation, therefore, he was rightly arrested and now should be continued in detention. It cannot be the proposition that only when an accused answers the questions put to him by the investigation agency in the manner in which the investigating agency would like the accused to answer, would mean that the accused is cooperating with the investigation. Further, the respondent cannot justify arrest and continued detention citing evasive reply.\" \n\nReferring to Article 20(3) of the Constitution, Justice Bhuyan added : \n\n\"We should not forget the cardinal principle under Article 20(3) of the Constitution of India that no person accused of an offence shall be compelled to be a witness against himself. This Court has held that such a protection is available to a person accused of an offence not merely with respect to the evidence that may be given in the court in the course of the trial, but is also available to the accused at a previous stage if an accusation has been made against him which might in the normal course result in his prosecution. Thus, the protection is available to a person against whom a formal accusation has been made, though the actual trial may not have commenced and if such an accusation relates to the commission of an offence which in the normal course may result in prosecution. An accused has the right to remain silent; he cannot be compelled to make inculpatory statements against himself. No adverse inference can be drawn from the silence of the accused. If this is the position, then the very grounds given for arrest of the appellant would be wholly untenable. On such grounds, it would be a travesty of justice to keep the appellant in further detention in the CBI case, more so, when he has already been granted bail on the same set of allegations under the more stringent provisions of PMLA.\" \n",
    "flair": "Law & Courts",
    "score": 212,
    "num_comments": 11,
    "created_utc": 1726235927.0,
    "convurl": "https://external-preview.redd.it/SO--EG7F58WAyG-ZjUeUJihBzuQ1MIGtQez2-kVPmMo.jpg?auto=webp&s=d6c2bcbc6c9003a9995d2ec565db4712a358e202",
    "comments": [
        "Umar Khalid whem",
        "This will set a precedence for CBI and ED trying to go after opposition leaders",
        "Doesn't fulfill the requirement of belonging to the right community.",
        "They freed him because kejriwal is the 3rd contender in Haryana, possibly cutting off Congress' vote share.",
        "Well, they’d still go after who they want to, because the process itself is a punishment. In a way that AAP party leaders have already spent almost a year or sometimes two in jail was a punishment. \n\nLower Courts all the way to high courts are corrupt as hell. It takes almost 2 years for the case be appealed and heard in the SC. Depending upon who the SC judge had a tea an evening before the verdict is made. \n\nThere is no precedence and it can’t stop the govts using the laws and the agencies in their favour.",
        "Failed justice unless the officers themselves are charged for this as a crime and put behind bars",
        "Failed justice unless the officers themselves are charged for this as a crime and put behind bars",
        "Well, what purpose does it serve to punish the gun, if the one who pulled the trigger can't be?",
        "bad analogy, hired gun makes more sense",
        "The purpose will be to deter future offenses by the gun due to directions by the person who pulled the  trigger.",
        "Not just the officers, also the high court judge who gave the same damn judgement for both the ED and the CBI case, whose decision was overturned by the SC.\n\nThat too for 2 different people - AK And MS.\n\nWe really need a database of judges who is this incompetent (or corrupt)."
    ],
    "cleaned_text": "cbi cant justify arvind kejriwals arrest evasive replies accused right remain silent justice ujjal bhuyan justice bhuyan wrote respondent definitely wrong says appellant evasive reply cooperating investigation therefore rightly arrested continued detention proposition accused answers questions put investigation agency manner investigating agency would like accused answer would mean accused cooperating investigation respondent justify arrest continued detention citing evasive reply referring article constitution justice bhuyan added forget cardinal principle article constitution india person accused offence shall compelled witness court held protection available person accused offence merely respect evidence may given court course trial also available accused previous stage accusation made might normal course result prosecution thus protection available person formal accusation made though actual trial may commenced accusation relates commission offence normal course may result prosecution accused right remain silent compelled make inculpatory statements adverse inference drawn silence accused position grounds given arrest appellant would wholly untenable grounds would travesty justice keep appellant detention cbi case already granted bail set allegations stringent provisions pmla ",
    "cleaned_title": "cbi cant justify arvind kejriwals arrest evasive replies accused right remain silent justice ujjal bhuyan",
    "cleaned_selftext": "justice bhuyan wrote respondent definitely wrong says appellant evasive reply cooperating investigation therefore rightly arrested continued detention proposition accused answers questions put investigation agency manner investigating agency would like accused answer would mean accused cooperating investigation respondent justify arrest continued detention citing evasive reply referring article constitution justice bhuyan added forget cardinal principle article constitution india person accused offence shall compelled witness court held protection available person accused offence merely respect evidence may given court course trial also available accused previous stage accusation made might normal course result prosecution thus protection available person formal accusation made though actual trial may commenced accusation relates commission offence normal course may result prosecution accused right remain silent compelled make inculpatory statements adverse inference drawn silence accused position grounds given arrest appellant would wholly untenable grounds would travesty justice keep appellant detention cbi case already granted bail set allegations stringent provisions pmla",
    "cleaned_comments": "umar khalid whem set precedence cbi ed trying go opposition leaders doesnt fulfill requirement belonging right community freed kejriwal rd contender haryana possibly cutting congress vote share well theyd still go want process punishment way aap party leaders already spent almost year sometimes two jail punishment lower courts way high courts corrupt hell takes almost years case appealed heard sc depending upon sc judge tea evening verdict made precedence cant stop govts using laws agencies favour failed justice unless officers charged crime put behind bars failed justice unless officers charged crime put behind bars well purpose serve punish gun one pulled trigger cant bad analogy hired gun makes sense purpose deter future offenses gun due directions person pulled trigger officers also high court judge gave damn judgement ed cbi case whose decision overturned sc different people ak ms really need database judges incompetent corrupt",
    "light_cleaned_title": "CBI Can't Justify Arvind Kejriwal's Arrest On His 'Evasive Replies'; Accused Has Right To Remain Silent : Justice Ujjal Bhuyan",
    "light_cleaned_selftext": "Justice Bhuyan wrote : \"The respondent is definitely wrong when it says that because the appellant was evasive in his reply, because he was not cooperating with the investigation, therefore, he was rightly arrested and now should be continued in detention. It cannot be the proposition that only when an accused answers the questions put to him by the investigation agency in the manner in which the investigating agency would like the accused to answer, would mean that the accused is cooperating with the investigation. Further, the respondent cannot justify arrest and continued detention citing evasive reply.\" Referring to Article 20(3) of the Constitution, Justice Bhuyan added : \"We should not forget the cardinal principle under Article 20(3) of the Constitution of India that no person accused of an offence shall be compelled to be a witness against himself. This Court has held that such a protection is available to a person accused of an offence not merely with respect to the evidence that may be given in the court in the course of the trial, but is also available to the accused at a previous stage if an accusation has been made against him which might in the normal course result in his prosecution. Thus, the protection is available to a person against whom a formal accusation has been made, though the actual trial may not have commenced and if such an accusation relates to the commission of an offence which in the normal course may result in prosecution. An accused has the right to remain silent; he cannot be compelled to make inculpatory statements against himself. No adverse inference can be drawn from the silence of the accused. If this is the position, then the very grounds given for arrest of the appellant would be wholly untenable. On such grounds, it would be a travesty of justice to keep the appellant in further detention in the CBI case, more so, when he has already been granted bail on the same set of allegations under the more stringent provisions of PMLA.\"",
    "light_cleaned_comments": "Umar Khalid whem This will set a precedence for CBI and ED trying to go after opposition leaders Doesn't fulfill the requirement of belonging to the right community. They freed him because kejriwal is the 3rd contender in Haryana, possibly cutting off Congress' vote share. Well, they’d still go after who they want to, because the process itself is a punishment. In a way that AAP party leaders have already spent almost a year or sometimes two in jail was a punishment. Lower Courts all the way to high courts are corrupt as hell. It takes almost 2 years for the case be appealed and heard in the SC. Depending upon who the SC judge had a tea an evening before the verdict is made. There is no precedence and it can’t stop the govts using the laws and the agencies in their favour. Failed justice unless the officers themselves are charged for this as a crime and put behind bars Failed justice unless the officers themselves are charged for this as a crime and put behind bars Well, what purpose does it serve to punish the gun, if the one who pulled the trigger can't be? bad analogy, hired gun makes more sense The purpose will be to deter future offenses by the gun due to directions by the person who pulled the trigger. Not just the officers, also the high court judge who gave the same damn judgement for both the ED and the CBI case, whose decision was overturned by the SC. That too for 2 different people - AK And MS. We really need a database of judges who is this incompetent (or corrupt)."
}