{
    "id": "1asgpql",
    "title": "Alexei Navalny.",
    "url": "https://i.redd.it/k78hwmv6xzic1.png",
    "selftext": "I know Indian media won't give any attention to this news whatsoever, but I want people to know who this guy was, what he fought for and who he fought against. A man so powerful, Putin had him killed in prison after multiple attempts of poisoning him. Alexei Navalny is the kind of leader India needs right now to fight the authoritarian government and its attempts to end democracy. \nRIP Navalny....",
    "flair": "Crime",
    "score": 202,
    "num_comments": 48,
    "created_utc": 1708110402.0,
    "convurl": "https://i.redd.it/k78hwmv6xzic1.png",
    "comments": [
        "Man looks like a villian but was really fighting against autocracy. \nRip",
        "Wasn't he all about islamophobia and neo-nazism?",
        "He was a true fighter, who fought valiantly against poo tin.\nPoo tin probably got him bumped off \n\nPutin and Modixi are brown nosers.",
        "Tf is that shit?",
        "You mean Modi",
        "https://preview.redd.it/z4akk3btzzic1.jpeg?width=220&format=pjpg&auto=webp&s=d3a39e957b959918365cd9b26061ecbd0ae13af4",
        "Common Putin W",
        "Putin murdered him...he didn't have to go back to russia but he did. He is a literal martyr.",
        "There is only one political leader currently in India who has a clean record, has been consistent in his ideology, doesn’t crave power, keeps fighting for injustice against the citizens and doesn’t accept defeat. Guess who?\nHope people realize this before he too is dealt with.",
        "Who ?",
        "Kejriwal?",
        "Who ??",
        "Sad ending",
        "The world will remember how we helped make Putin the turd he is today.",
        "Who will be equivalent to him in India and America? I'm curious.",
        "We didn't help anyone",
        "Shivaji Rao Gaekwad?",
        "RIP dude!! \n\nThe man with balls of steels!\n\nThis was a huge shock- despite all I was somehow optimistic -sad to hear",
        "Khadge ?",
        "D.B. Cooper?",
        "Its updog",
        "https://preview.redd.it/p3tzv15640jc1.png?width=1080&format=pjpg&auto=webp&s=cdd2424bc23eecf0b98dd18a11e94d86b4159c13",
        "Chandrasekhar azad ?",
        "India buys weapons and oil from russia. He controls the companies selling them.",
        "🤡🤡",
        "Bat man?",
        "Bhai kisi ko nhi pata tu kiska baat kar rha hai 🤣",
        "Nitish Kumar /s",
        "Navalny’s video on Putin’s house is so good that i crave to watch it some times.",
        "One simple question iska india se kya lena dena ??",
        "Pawan Kalyan",
        "Why does India and US need their equivalent of Navalny? \n\nBoth countries had elections and leaders that willingly left office, unlike russia where the same guy is 20+ year in office, changed constitution to allow it, killed opposition and is probably gonna be president till his death",
        "Putin keeps winning he got rid of opposition he conquered avdivka and west can only talk at best.",
        "As expected.\n\nThe only surprising thing here is that it took this long.",
        "He's only in your imagination then",
        "Mudi izz lichrally Putin vrooo /s",
        "There are none.",
        "India should not buy anything Russian specially tech from Russia is of low quality.",
        "Isn't this happening since 2014 and coming election it will definitely make this true.",
        "Avg indian leftist ☕️☕️\nIf i am not wrong this navelry was the main face of russian opposition right ??\nSo have modi imprisoned rahul gandhi or any other major or minor face of opposition?? infact bjp workers are f0cked up in bengal and in southern state \nUse some brain my friend",
        "https://preview.redd.it/x480t2yf80jc1.jpeg?width=609&format=pjpg&auto=webp&s=12bd8a26d91fc7a81aecaf359672db1695efa01e",
        "Many here think RaGa is Indian Navalny. And Modi is Putin. \n\nNot recognising, RaGa is incompetent.",
        "Around 8 years ago, this guy said in an interview in reply to a question about his attitude towards minorities in Russia-\"I hate the Subhuman races\". Nazis don't deserve to be remembered! They deserve to be forgotten!"
    ],
    "cleaned_text": "alexei navalny know indian media wont give attention news whatsoever want people know guy fought fought man powerful putin killed prison multiple attempts poisoning alexei navalny kind leader india needs right fight authoritarian government attempts end democracy rip navalny ",
    "cleaned_title": "alexei navalny",
    "cleaned_selftext": "know indian media wont give attention news whatsoever want people know guy fought fought man powerful putin killed prison multiple attempts poisoning alexei navalny kind leader india needs right fight authoritarian government attempts end democracy rip navalny",
    "cleaned_comments": "man looks like villian really fighting autocracy rip wasnt islamophobia neonazism true fighter fought valiantly poo tin poo tin probably got bumped putin modixi brown nosers tf shit mean modi common putin w putin murdered himhe didnt go back russia literal martyr one political leader currently india clean record consistent ideology doesnt crave power keeps fighting injustice citizens doesnt accept defeat guess hope people realize dealt kejriwal sad ending world remember helped make putin turd today equivalent india america im curious didnt help anyone shivaji rao gaekwad rip dude man balls steels huge shock despite somehow optimistic sad hear khadge db cooper updog chandrasekhar azad india buys weapons oil russia controls companies selling bat man bhai kisi ko nhi pata tu kiska baat kar rha hai nitish kumar navalnys video putins house good crave watch times one simple question iska india se kya lena dena pawan kalyan india us need equivalent navalny countries elections leaders willingly left office unlike russia guy year office changed constitution allow killed opposition probably gon na president till death putin keeps winning got rid opposition conquered avdivka west talk best expected surprising thing took long hes imagination mudi izz lichrally putin vrooo none india buy anything russian specially tech russia low quality isnt happening since coming election definitely make true avg indian leftist wrong navelry main face russian opposition right modi imprisoned rahul gandhi major minor face opposition infact bjp workers fcked bengal southern state use brain friend many think raga indian navalny modi putin recognising raga incompetent around years ago guy said interview reply question attitude towards minorities russiai hate subhuman races nazis dont deserve remembered deserve forgotten",
    "light_cleaned_title": "Alexei Navalny.",
    "light_cleaned_selftext": "I know Indian media won't give any attention to this news whatsoever, but I want people to know who this guy was, what he fought for and who he fought against. A man so powerful, Putin had him killed in prison after multiple attempts of poisoning him. Alexei Navalny is the kind of leader India needs right now to fight the authoritarian government and its attempts to end democracy. RIP Navalny....",
    "light_cleaned_comments": "Man looks like a villian but was really fighting against autocracy. Rip Wasn't he all about islamophobia and neo-nazism? He was a true fighter, who fought valiantly against poo tin. Poo tin probably got him bumped off Putin and Modixi are brown nosers. Tf is that shit? You mean Modi Common Putin W Putin murdered him...he didn't have to go back to russia but he did. He is a literal martyr. There is only one political leader currently in India who has a clean record, has been consistent in his ideology, doesn’t crave power, keeps fighting for injustice against the citizens and doesn’t accept defeat. Guess who? Hope people realize this before he too is dealt with. Who ? Kejriwal? Who ?? Sad ending The world will remember how we helped make Putin the turd he is today. Who will be equivalent to him in India and America? I'm curious. We didn't help anyone Shivaji Rao Gaekwad? RIP dude!! The man with balls of steels! This was a huge shock- despite all I was somehow optimistic -sad to hear Khadge ? D.B. Cooper? Its updog Chandrasekhar azad ? India buys weapons and oil from russia. He controls the companies selling them. 🤡🤡 Bat man? Bhai kisi ko nhi pata tu kiska baat kar rha hai 🤣 Nitish Kumar /s Navalny’s video on Putin’s house is so good that i crave to watch it some times. One simple question iska india se kya lena dena ?? Pawan Kalyan Why does India and US need their equivalent of Navalny? Both countries had elections and leaders that willingly left office, unlike russia where the same guy is 20+ year in office, changed constitution to allow it, killed opposition and is probably gonna be president till his death Putin keeps winning he got rid of opposition he conquered avdivka and west can only talk at best. As expected. The only surprising thing here is that it took this long. He's only in your imagination then Mudi izz lichrally Putin vrooo /s There are none. India should not buy anything Russian specially tech from Russia is of low quality. Isn't this happening since 2014 and coming election it will definitely make this true. Avg indian leftist ☕️☕️ If i am not wrong this navelry was the main face of russian opposition right ?? So have modi imprisoned rahul gandhi or any other major or minor face of opposition?? infact bjp workers are f0cked up in bengal and in southern state Use some brain my friend Many here think RaGa is Indian Navalny. And Modi is Putin. Not recognising, RaGa is incompetent. Around 8 years ago, this guy said in an interview in reply to a question about his attitude towards minorities in Russia-\"I hate the Subhuman races\". Nazis don't deserve to be remembered! They deserve to be forgotten!"
}