{
    "id": "1edjd2k",
    "title": "Corporate Hospitals in Delhi NCR Denying me a Job because of my Gender ",
    "url": "https://www.reddit.com/gallery/1edjd2k",
    "selftext": "Why are we still recruiting on the basis of gender, specially in the medical field. In this field, it is important to prioritize qualifications over gender because human lives are at stake and no compromises should be made.\n\nI am a proud male gynecologist. I've dedicated over 10 years of my life to studying and training, learning how to be empathetic towards my patients and providing them with high-quality care. I would like to share my experiences on how big corporations, specially in Northern parts of India,denied me from doing a job, not on the basis of merit, but merely on the basis of my gender. Despite their obsession with having a male child, hiring a male gynaecologist is still a forbidden concept in Delhi NCR. I have been a part of several groups on WhatsApp that notify me when there is a requirement for gynaecologists. I contact the recruiters and finish all the necessary procedures. Upon informing them of my gender, they either deny me outright, ghost me, or stop replying to me completely. I have seen them giving jobs to someone less qualified compromising on care but not employ someone competent just because of their gender.\n\nDenying jobs to male gynaecologists violates the basic principles of gender equality. \nHiring should be based on qualifications, skills and experience, not gender. \n\nMany male gynaecologists, that I know of, are exceptionally qualified and capable of providing high-quality care to their patients. Medical professionals, regardless of their gender, are trained to provide sensitive and respectful care. \n\nI can assure you that I am amongst least judgemental bunch of gynaecologist.\n\nDiscriminating, merely on the basis of gender implies a lack of trust in our professional capabilities.\n\nIndia is already facing a massive shortage of doctors. I see everyday on WhatsApp groups, the drastic gap between demand and supply of qualified doctors. Now on top of that we are excluding half the population from this field which not only exacerbates this problem but also reduces access to essential healthcare services. \nUpholding equality in employment opportunities is crucial for a fair and effective healthcare system.",
    "flair": "Rant / Vent",
    "score": 933,
    "num_comments": 409,
    "created_utc": 1722095148.0,
    "convurl": "https://i.redd.it/vyi6dkh013fd1.jpg",
    "comments": [
        "Really a shameful scenario\nDid not expect this from Hospital like Medanta",
        "Let's face the reality how many in-laws are comfortable their bahu opening legs for male gyno.\n\nUsually this hospital also get rich conservative people a lot i guess.",
        "I assumed you were a newbie and hence the rejection (still doesn't justify). But with the amount of experience you have and still experiencing discriminatory behavior is crazy. More power to you, OP",
        "If you’re able. Start applying for jobs in foreign countries. Your specialty will be in high demand.",
        "It might be the case that the duty require care of female patients and its best handled by a female doctor because of the comfoet of the patient.",
        " Bro playing real life Doctor G",
        "They are doing this because most female patients in India feel uncomfortable with a male gynaecologist doing their checkups. Better to look for opportunities in this field in other countries where the gender norms are not as traditional as in India.",
        "Hesitate little bit 😭🙏",
        "\nThe same female patients complain about being judged by their respective gynaecologists. We have 1000s of anonymous such posts on reddit.\nAnd i am here to do my job. Everyone knows how having a female attendant present at all times is mandatory when being examined by a male doctor.",
        "Never hesitate with sed ed\n                                           ~NCERT",
        "Read the messages. He's a gynaecologist.",
        "Bro, you should try private practice in you own home city. I have a few male gynaecologists in my city, and they do good. I mean they don't get as much as attention or patients as female doctors, but you know, they are able to successfully run their practice. Also, try rich liberal areas, or rural areas where people know and trust you. There is no in between, conservative families will never send their women to a male gynae, not in a 100 years, especially someone, who they don't know or trust.",
        "i applied for dominos , pizzahut outlets for frontend desk jobs all of them rejected me, saying they wanted females as they can't be harassed easily by customers.\n\nthis is very common practice to hire females as they can be easily dealth with as compared to males.",
        "Bro he is talking about Delhi Ncr- medanta, apollo, cloud nine.",
        "The possibility of sexual assault is not the main issue here. Most Indian women just don't feel comfortable explaining their menstrual or reproductive health problems to a man who isn't their partner. Some are very conservative (especially in-laws) and they would rather not receive treatment at all than visit a male gyno. Our country is not that open-minded yet. It will take years of sexual education for society to get rid of this mindset.",
        "Thank you bro, for telling me, such good soul like you, guiding illiterate people like me through the clouds of darkness. Would you like to perhaps contest elections someday, I might be way too much inclined to vote for you, now that you have provided me with enlightenment.",
        "A doctor’s job is to provide good quality treatment. Caring and handling of female patients are done by the nursing staff. There’s always going to be a female attendant present at all times while the doctor is examining the patient. These guidelines are mentioned in the code of conduct.",
        "Crazy how big corporate hospitals mint money for the smallest of things, yet won’t provide doctors with equal opportunities. Despite having a significant shortage of qualified doctors, we continue to deny qualified individuals access to basic rights and support an orthodox mindset, even in 2024. This is really shameful!!",
        "Hi\nI'm a Doctor myself. \n\n\nIf given a choice between a Male & a female OBG for my family members, I'll always & always choose a female OBG. Same with my friends. \n\n\nNo hate to your gender. It's just personal preference. \n\n\nIt's just much more comfortable that female parts be examined by females. \n\n\nThat's how the world is currently ",
        "Honestly, no one ik is comfortable with a male gynaecologist. Sorry.",
        "what they actually mean is if there is a problem, they won't be able to complain to and gnaw at the frontdesk but that's where they are wrong, I always try to squeeze every ounce of my money if the company/brand does something wrong...\n\nEqual rights = Equal fights",
        "Justifying your username. I guess it’s that time of the night where you can’t comprehend simple sentences, not your fault my friend alcohol does that to your brain. It is a depressant after all. I would like to simply it for you since you are slow. What I meant was only rich families are able to spend lacs of rupees on deliveries and stuff since even health insurances don’t cover maternity benefits. Middle class peeps would rather go to a nearby nursing home.",
        "For real. This 10th class girl few year ago in my tuition asked the girl beside me for an answer to a biology test question related menstruation and I answered her word to word. The look on her face was...not nice 😭\n\nLike \"boy you arent invited\"",
        "You have to understand the patients perspective, it’s not the hospital that doesn’t want you, imagine they put you on night duty and a patient comes up and says she is not comfortable to be treated by a male gynec what will they do ! Call a female gynec to stand substitute after her days work ? It’s not sexual harassment that a girl might be worried overall the patient has to be comfortable. Argue how much ever you want , these are practical aspects of life , basic human feelings .",
        "Lol what I would have agreed with you on other jobs but not a gyno lol",
        "It's more about demand-supply. Majority of people, even  now 'explicitly ask' or the least 'prefer' a Female Gynec",
        "It doesn't matter what you say",
        "I have seen a similar thing happen somewhere I worked, there was a male gynae doctor, extremely skilled and experienced, nearing retirement but some woman would feel uncomfortable being examined by him. It was a government set up so at the end of the day they didn’t have much of a say but there was always a bit of a hesitation. Idk if this is the route you want to take but male gynacs don’t face as much problem in govt setups.",
        "Medical field doesn't work this bro ki apply kia to job mil jaye😅.",
        "I know about medical licensing in different countries. But he can go for fellowship programs.",
        "And now, what exactly did I write? Can your coherent brain understand that? Maybe your soberness a little too much.\n\nWell, I agree on the health insurance part. And no, your sentence does not helps, as I also did the same: gave the guy, a pathway and understanding of society and condition.\n\nPS: <insert mild cuss word> <change attention> thank you",
        "> Medical professionals, regardless of their gender, are trained to provide sensitive and respectful care. \n\nBut also:\n> The same female patients complain about being judged by their respective gynaecologists. \n\nSo, clearly, training doesn't mean much. \n\nFrom a patient pov, it's reasonable to assume that if even women gynaecs are so judgmental, male ones will probably be even more so. Especially, in our culture. How can any patient know you're not a creep, not judgmental, etc.\n\nYou're in the wrong specialization in the wrong place at the wrong time. \n\nThat said, the hospital is also wrong not to hire you just because you're a male gynaec. Aren't there other roles in your line of specialization? Not directly interacting with patients but perhaps diagnosis based on tests, managing a gynaec dept, research, etc?",
        "Bhai Desh chhod do dusri desh me achhi payment leke naukri kar lo, india ke g pe laat padegi na tab saari hekadi nikal aayegi in future.",
        "Ur a male gynecologist please try to understand. No female will want a male gyno. They r fair to ask for female gyno.",
        "During my internship, not once I was told to go away by any female patient in gyne department.\nAnd I have seen male residents doing check ups and MOST of patients are okay..\n\nPeople in comments are acting like this is still 2000s. \nI think north south ka problem h.... South m people are more educated that ki doctor hai, chahe male ho ya female.",
        "A person I know who are a female, chose Medanta because they had female gynecologist for exact reasons.\n\nTo be honest, I would probably would be more comfortable with male gynecologist than female (I am a male).",
        "But then he'll have to return here after some time, fir se vohi problem.",
        "She’s cute and kind whats her number ?💀",
        "Man, you chose it .\n\nFighting for it is your prerogative , I don't find anything compelling to not say that you have a higher probability of being a creep than I am okay with it.\n\nVery bad move on your part , a drop would have been better for you .",
        "Can't complain if patient or their partners/relatives are uncomfortable. You can try to change the mentality of india but I think you're better off working somewhere where they are comfortable with a male gynac",
        "You wouldn’t need a gynaecologist tho",
        "Is money shameful",
        "You wrote “try rich liberal areas.” That’s what he did and he is sharing those experiences. My coherent brain works just fine. I guess yours keeps forgetting what exactly you wrote. Try taking thiamine supplements. We don’t want to precipitate Wernicke’s encephalopathy.",
        "I think what he meant to say was a male \"andrologist\" (they specialize in male reproductive health)",
        "will you be comfortable when going to a female doc for circumcision?",
        "Bro you might not like to hear it, but in a country like India, except maybe some particular cities or localities, people will ALWAYS prefer a female gyno over a male one. I am not very happy about this too as I simply detest any hint of sexism in job hunting at all, but that’s the harsh truth. \n\nIt will take eons and eons of awareness and a 180 change in people’s POV about sexual health to even think about such a change.",
        "I'm curious, what made you want to become a gynaecologist as a male? I would ask this same question to a woman that became an andrologist.",
        "yes. It is not out of the ordinary to see posts about male doctors disregarding concerns that turn out serious later. I am not saying everyone is like that though",
        "Liberal countrys have prejudice against male gynos still, youre living in india\n\nThis is an uphill battle for you whether you like it or not\n\nIm really sorry that we arent accepting and open enough for this to not matter but alas",
        ">I don't find anything compelling not to say that you have a higher probability of being a creep than I am okay with it.\n\nI read this 3 times and I couldn't understand it, could you simplify it?",
        "I don't trust him enough",
        "I see",
        "Manufacturing mein ghusna shuru karo.",
        "I wouldn’t be comfortable consulting a male gynaecologist.",
        "Most of the people I know won't be comfortable with a male gynecologist.",
        "Just go trans bro…then they can’t technically deny you.",
        "Assuming you are not trolling, by applying through WhatsApp, really???\n\n\n\n\nGrow up. Female patients don't want to see a male gynaecologist. Hospitals won't pay you to sit around. Set up your own practice.\n\n\nHow proud you are is irrelevant. Actually, you are just trolling, so whatever.",
        "Urologists are more common",
        "My neighbour's kid did 😞",
        "This is modern day Feminism where these Sicko Feminazis spread propoganda and rule the world.",
        "Man I'm dumb.\n\nThis reminded me when I made similar mistake. \n\nFor some reason I forgot about wombs and thought when woman is pregnant the baby is in stomach.",
        "You can choose to apply somewhere else. I would want my gynac to be a woman to be on the safer side",
        "Take the L lil bro",
        "I wouldn’t want my wife mother or sister to be ‘checked’ by a male gyno.",
        "It sucks and is unfair but people have the right to choose from whom they get their care. Remember those ethics classes in medschool where they drilled in patient autonomy? This applies in all cases- a person might refuse care for all sorts of reasons- it could be a racist saying they don’t want a doctor of colour, it could be an orthodox person based on religion/ social beliefs etc. . It is what it is, sadly. \n\nPersonally I couldn’t give 2 shits about the gender of my gynae but that’s not the case for everyone.",
        "U could have chosen a better career , 95% women wouldn’t be comfortable with a male Gyno",
        "I am not saying this is right, but i understand.\nMost women dont prefer male gynecologist.",
        "As a woman going to a male gynac wouldn’t be my first choice tbh.. i doubt this is discrimination more like a supply and demand situation.. most females look for female gynac.. was it difficult to get previous jobs as well? Or did something change",
        "There's nothing about feminism in this, Indian women are not comfortable around a male gynaecologist. It's just a fact. We can do anything about it.",
        "Try gangaram..",
        "she can fix me",
        "1. You can go for private practice.\n2. If you can, move to the US. Doctors there mint money, post specialization. Gynecology is a demanding discipline and has both high career & financial prospects. There's no use begging for a chance to showcase your potential if there are other nations ready to look beyond your gender into what you bring to the table.",
        "I wonder if you and others like you will have the opinion when a female urologist is discrimated upon coz male patients are not comfortable with her.",
        "I remember going to see a male general physician for a small lump in my underarm. I was literally ok with him to check it but he was uncomfortable & did other checkups but told me to see gynecologist for that. It didn't even need any undressing as I wore sleeveless top. \n\nI was confused as gynac might be female but the issue i had didn't seem like a 'gynecology' issue 🤷‍♀️",
        "Aur lado maja aaria h",
        "Going trans is ok…you can always switch back.",
        "https://preview.redd.it/gv8htjkbq3fd1.jpeg?width=314&format=pjpg&auto=webp&s=67f5432681a6a8e95f8a8da22d0bf743b55d95f6",
        "https://preview.redd.it/hmqbjdqcr3fd1.jpeg?width=828&format=pjpg&auto=webp&s=fb5731972053b14dca7f3b19a9b575657daf4b3e",
        "Again in that case we can't do anything about it. If the male patient is not comfortable with the female doctor he can request male doctor as simple as that.",
        "at least it makes sense for a gynecologist.\n\ni got rejected twice because im both clinics only wanted female dentists. \n\nwtf?",
        "During my Internship , the OG unit I was in had a male chief . He was one of the best .",
        "Maybe it's because they're corporate.. Most of the gynecologists I know of are male and are very good at their job.",
        "tbh even hospitals can't do anything. goodluck for private practice.",
        "I think that's a similar situation, female patients (or their husband/parents) wouldn't want male dentists so close to their open mouths lmao",
        "It is the same everywhere. It's normal casual, women prefer women for gynaecological tests. Their first preference is always a woman. Bro, you screwed yourself.",
        ">I am a proud male gynecologist\n\nI mean its nor ur fault but the  females feel uncomfortable with that so thats why they prob rejected u :(",
        "Gyne is one of those roles where preference of gender is kind of important for the patients comfort. They may already have a few male doctors, but in India some women may prefer other women and there's not enough currently.",
        "Come to Kolkata, we don’t have such strong notions. Doctors’ skillset matters, not gender",
        "Reminds me of the film Dr. G",
        "😝🤞 seriously ? 🥲",
        "I don’t think that’s a well known branch in India.",
        "r/halloffame",
        "I don’t know any practicing andrologist in my circle? Do you mean urologist?",
        "Research and corporate hospitals? Enough said.",
        "Isn't gynaec considered the worst department in medical colleges and hospitals because female gynaec doctors and nurses treat people like shit? I've heard that people don't even want to walk near that area. No idea about male gynaecs.",
        "Bro has learnt Good Clinical Practice thoroughly it seems",
        "Didn't they also make a movie about this a male gynec",
        "Now what should he do ? His life is screwed. He’ll earn lesser than an MBBS doctor even",
        "First of all, what was the reason to get this department bro? \nAs many female would prefer a female doctor and not a male examining them plus most of the guys won't let the wife go to a male gynae",
        "No wonder Tesla is thriving. Elon Musk had the balls to fire 90% of the workforce, which included 'diversity hiring', thus ensuring only the best were retained. \n\nRather than India's moronic system of quotas/reservations etc",
        "And I, a female urologist",
        "Why not ? If she is skilled",
        "> rural areas where people know and trust you\n\nAhn... I won't do that\n\nHeard more tales of that going wrong than I can count.",
        "They banned girls from mining.\n\nIdeally equal rights , but law enforcement is so weak that why even risk it in the first place.",
        "He has to do his residency again there lol. USA has no regard for India’s PG degree",
        "How is it relevant to this post? Seems like you’re just pissed off and trying to make it about equality",
        "Then it will be news and he will be canceled by the media due to chauvinism",
        "Bro, come to Kolkata. An extremely open minded city. Women go to male gynaecs and there’s no discrimination",
        "Not relevant, but justifying the stance of the corporate hospitals. I am a heavy investor in stocks of these hospitals, got to defend them with sound logic.",
        "Then news outlets are to blame for such news. Don't let misleading news and stuff blind you. Think wisely and see other perspectives too :)",
        "Good advice",
        "Yeah man see it's a thing. People are open minded enough in some parts of India.. I don't know about Kolkata so i didn't say it, but it's good to know Kolkata is also not discriminating in doctors.",
        "being a male gynaecologist does not mean you can't be judgemental. hell, in patients' perspective, you're likely to be even more judgemental. i'm not saying it's right, but it is the reality.",
        "Should have thought of that before. you wouldn't start a newspaper company in this age of digital era knowing it won't do well would you?",
        "That’s so sad. 😞 Tough luck OP.",
        "👑👑👑",
        "Sorry no sympathy for male obgyns. \nyou had a choice to become any other specialty but You chose the one field as a man all you know is bad theory.",
        "To change your gender legally requires atleast 3-4 years. And it involves a lot of steps which have to be verified with proof. But go on with your dear mongering and misinformation.",
        "Hello bhaiya,\nA fellow dentist here. I really hope people and the future generations understand the reality and hardships of medical careers. \nSometimes the obsession of people even in the younger generation really just despises me. \n\nI hope you find a good lead soon. ",
        "WhatsApp is used for hiring in the medical field. His screenshots look legitimate.",
        "This is your privilege really. If we had proper nationalised healthcare like the UK does you wouldn’t really have a choice in who your doctor would be.",
        "It's unfortunate that this happens and like other commentors said, this might not the country you should look for this job. India is very conservative and with the political and communal situation, it might progressively become more conservative. It's also a very Asian/Indian stigma for women to overcome to go to male gynae. I know the women in my life have always preferred women gynae but there have been a couple of them who are not fazed by male gynae. As much as i don't want to say this, there is a very slim chance for you to prosper in this field in India (i would love for you to prove me wrong).\n\nYou might be better off building your career in a country where this is accepted and then come back to India once you have some experience. I would assume hospitals don't see it good for their business to give you a job and privat practice will eventually need you to invest and gains will be very slow since people will \"scroll away\" seeing a male gynae on the list.\n\nDon't lose hope and don't let this situation pull you down, you know what's it like in India and fighting against a stigma that strong may not be an ideal way forward depending on whatever your situation is in life. You have the problem, try to circumvent it with the solutions that can afford you to gain more experience",
        "I don't know what you were expecting tbh. Living in India as a male and still going for gynaec specialization, I'd be more inclined to believe you are a total and utter creep.",
        "Female attendant present is mandatory? What funny rule is this? i‘m german, tho.",
        "Being a girl and I live in Delhi, I would prefer Female gynaecologist any day. Delhi is most famous for its women safety /s\n\nOn top of that, you think I'll feel comfortable going to a male gynaecologist. Not at all. I know a female attendant is always there. But still a big NO. A female gynaecologist is my comfort zone.\n\nSorry if I sounded rude.",
        "In germany we have the opposite complain, haha. I am a man but many friends told me about the experience and on reddit and so on and many woman say female doctors have sometimes less respect, are more harsh and have more this „don‘t be weak, i‘m a woman, too“ attitude, while male doctors are often seen as nicer.",
        "Bro irrelevant in this post but can you please share the the contact of the HR you using\nNeed to apply for SR Gen surg",
        "I'm glad somebody gets it. It's easy for nurses to move abroad. But for doctors it's very difficult.",
        "Why not? Male and female surgeons are taught the same ways to do circumcision. I assure you that female doctor has seen several male genitalia the same way a male doctor has seen several female genitalia. It's all the same. Atleast in the medical profession.",
        "Out of interest, why choose gynaecology as a specialisation when you had dozens of options to choose from?\n\n\nI mean i have nothing against male gynaecologists in general but its an irrefutable fact that a lot of women in India and even abroad feel a bit uncomfortable with male gynaecologists.\n\n\nIt is what it is, unfortunately.",
        "Forgive my ignorance, are you implying that people in the UK DON'T have a choice?",
        "Why? The only possible reason I can think of is because you feel male doctors are perverts just because they are male. With that logic aren't you a perv as well? All doctors (whether male or female) are taught the same human anatomy and physiology. They're trained to treat and care for HUMANS. (Not man or woman)",
        "I have read all your comments and I would like to clarify few things.\n\n1. I should have chosen a different field/ i should have taken a drop and opt for something else.\n\nClearly, none of you know how medical education works. I worked my arse off to clear the qualifying exam. Went to med school for 5 and half years, did my MBBS. Again spent my golden years studying for my Post graduations. Getting a seat in NEET-PG is hard enough. I am just grateful for what I have.  While the majority of the population was busy enjoying their 20s, I spent my time working really hard to achieve my goals. So I really don’t have any regrets nor did I bring this bad luck upon myself by choosing this field.\n\nSome of you have been patronising me. If a man starts mansplaining, half of the population would be offended by now. The focus of this discussion should on promoting equality at workplace and not denying anyone from doing their jobs.\n\n2. The stigma around male gynaecologist/why did i choose to become a male gynaecologist \nMy guide/mentor is a male gynaecologist. He was interviewed by some famous media houses when a film inspired by a similar topic was released. HoD of my department is a male gynaecologist. And let me be very clear, I am not being biased here, but they are extremely good at their jobs as compared to their female counterparts. \n\nWe have to do compulsory rotation in every department during our internship. So when i did my rotation in OBGYN,\nThe feelings I experienced while delivering babies and bringing joys  to families was nothing short of heroic which is why i chose this field.",
        "He can always go for another specialisation. ",
        "Actually I have seen the opposite in some posts. That women gynae are usually judgemental and they prefer male ones.\n\nBut yeah u r right. The Doctor G movie is a very good representation of this problem.",
        "Kuchi bhi. \nGoing trans doesn’t take 3-4 years. \nYou are confusing with a full transformation.\n\nBro just put a wig, tuck in your kela/gotti, wear a dress and start behaving like a chick.\n\nDon’t overthink bro",
        "Yes he can do that. A non-clinical degree would suffice",
        "3. Not comfortable with male gynaecologist \nHalf of you said that we aren’t comfortable with a male examining us. One of you even questioned my character. Fair enough.\nLet me be very clear, I am bound by medical ethics and I have to abide by the rules. I cannot examine any one of you without your consent and as I have mentioned earlier I have to always examine you in presence of a female attendant.\n I don’t wake up everyday with the intention of taking undue advantages of my patients. You don’t shit where you eat. I can’t put my whole career in a jeopardy and risk my license being cancelled for few minutes of pleasure.\nFemales are more likely to be exploited by their friends, relatives, coworkers or bosses than by doctors. Doctors crossing boundaries are relatively unheard of. \n\n4. Can’t explain our issues openly\n\nI have spent half of my life studying about diseases pertaining to female anatomy. I believe I would be one of the few individuals who would openly understand your concerns. I am not like your partner or your in-laws for whom female well-being is foreign concept. I am qualified enough to crack the code.\n\n5. Open up a private practice \nThat is the plan. Every doctor wants to open up their own practice after a certain amount of time but I can’t directly jump to that. I need to think this through. Opening up a practice isn’t a cakewalk. You have to put everything into consideration.",
        "Get into fetal medicine... Look for a fellowship... It has good pay, a better non emergency lifestyle and minimal gender bias",
        "The idea is to reduce chances of asault or misdemeanor of any kind (on one extreme), to simply making the patient feel comfortable. \n\nEven if you are arrested as a female, a female police officer has to be there",
        "wasnt rajesh koothrappali father a gynocologist , wonder if he faced these problems lol",
        "Even another medical specialisation is viable.\n\n\nAll doctors have an MBBS.\n\n\nEven mire diagnostics based gynaecology instead of direct patient consultation would be great.",
        "That sounds also weird. But thanks for the explanation.",
        "I agree.☝️",
        "No I mean he can take MD Anatomy/Physiology/Biochemistry and take the job of a professor",
        "Believe it or not, we are still pretty backwards in a lot of aspects as a nation. I have seen islamic scholars from my state having speech with a huge crowd asking only to go to a male gyno as the last resort. I am pretty sure a lot of the general population have a similar consensus.\n\nI have seen people bashing him for selecting gyno here. That's pretty shit. Blame the attitude of the public instead. Ideally your doctor shouldn't be based on their gender.",
        "Kuchh nahi, just a guy who chose to pursue his passion and interest. I wish OP all the best. Here, with tears in my eyes, I leave my pursuit of becoming an ObGyn even though I know I'd probably best be an ObGyn and nothing else ever makes more sense to me than this, but I guess we can't have all the things we want in life :''(",
        "The last I checked, the way you earn it does have some shame and ethics attached to it.",
        "OP abhi kahin aur ghusna shuru kar raha hai",
        "We have 1000s of those posts because most of the gynaecologists are female. How do you know we won't have the same posts if there are more male gynaecologists? These are usually older doctors with conservative upbringing. I would expect similar judgement from male doctors with similar upbringing. On top of that, there is an extra chance of some of them being creeps.",
        "They're just justifying that they presume everyone to be as perverted as they themselves are.",
        "Bro go to Canada, you’ll be worshipped there. The whole country will consider you its son-in-law.",
        "1) why don't you consult online.\n2) Setup your own clinic - as in PG you got around 1 lpm you must have saving.\n3) visit rural areas or class -2 town and try to set up something..\n4) Go for normal delivery rather than operation.\n5) Start some kind of awareness program on Instagram or YouTube..",
        "Not comfortable with male gynecologists.\n\nThat's what the main reason is and you might have thought about it too while you were studying. \n\nYou can't just change the way people think overnight. Also, the clinics or hospitals are running a business, and they know how the market works which is why they want a female gynecologist.\n\nWe can debate all we want but there's no point.",
        "Prejudices!",
        ">they are extremely good at their jobs as compared to their female counterparts. \n\nYou can defend your profession without putting down women. You can just say they're good gynecologists and leave it at that. I'm sorry you're having trouble finding a job, it's not ok that you're not being hired for being a man. Could your hod or mentor not guide you about places hiring, since they must be practicing as male gynobs?",
        "I love how when it comes to men, women expect them to be progressive and understanding, but when it comes to them, they just say they're not comfortable sharing their private parts issues with a person who's literally the most relevant to actually talk to just because he's a man.",
        "Yo, regardless of that, this is almost always going to happen. I myself was uncomfortable around a male gynae when I had to get a usg done for PCOD. But he was quite experienced than most and rid of any kind of judgement, so that helped a ton. We try to ignore judgements but ofc, there’s tons of female gynaes who are unnecessarily judgemental, which is something that hampers a patients ideal behaviour. Maybe try to put this point across? Idk if it would be of any help, but maybe it just might. I hope you land a huge gig soon, good luck!",
        "usually I'm all for gender equality but most women/girls (me included) are not comfortable with a male gynac and I think it's fair enough. there's many cases of r*pe by male gynacs as well but let's not go onto that topic. as a girl all imma say is that u may good at what u do but man I do not want u or any other man to be my gynac and neither do most women, like even if I trust u its uncomfortable af \n\n so many career options but you chose this...",
        ">You don’t shit where you eat. I can’t put my whole career in a jeopardy and risk my license being cancelled for few minutes of pleasure.\n\nKinda concerning that your stance isn't \"I wouldn't assault my patients because that's heinous behavior\" but \"eh it's notnworth it probably\". \n\n>I am qualified enough to crack the code.\n\nWhen people say they don't feel comfortable explaining their issues to a man it's not that they're doubting your qualifications but that they're a) reticent due to social and cultural norms and b) regardless of your training you will not have the lived experience of a patient with the organs and hormonal axis you are treating. \n\nI get that you're frustrated by the response here not being what you expected but you don't need to defend yourself to redditors. Like you know you. Great. We don't know you. We will be doubtful only. Take lite.",
        "This was a terrible choice of specialty for a conservative/culturally-backward country.",
        "Indigo also hires only female flight attendants. They openly advertise this in their magazines.",
        "It’s so obvious why they would want a female gynecologist in India….",
        "My apologise my friend. I can understand how much you are qualified and yet the broader society is still not ready to accept it.",
        "i would never go to a male gynac unless i have absolutely no other option ngl and i don’t know any woman who would irl either lmaooo it is what it is",
        "No offence doctor. Most of the replies are from men. May be I can give the female perspective.\nI would visit a male gynec in an ER. Infact I visited one few months ago. I was definitely not comfortable. \nI had vaginal delivery few years ago but still appointments scare me. Pap smear, embryo cycle routine, vaginal US nothing is comfortable even with female doctors.\nI would be ok to visit a male gynec if there is an emergency but not for my routine. \nPersonally I know a woman who lost her baby in a miscarriage because she did not want to visit a male gynec in ER (she  lives in Sweden)",
        "So cute 😭",
        "Women feel more comfortable with female gynae. That's all.",
        "I want to start it off by saying that I truly sympathize with your situation, doc. \n\n>Let me be very clear, I am bound by medical ethics and I have to abide by the rules.\n\nHowever as a woman, I want to point out that you shouldn't take women's hesitancy as a personal jab. \nSadly, these binding medical ethics haven't stopped certain male docs from abusing their power and mistreating female patients in the past so naturally, no women will buy this reason. Again, nothing personal but the self preservation kicks in and women would rather opt for prevention over cure, pun intended.\n\nI think things would have been a lot different for both you as a male gynecologist and me as a young woman in this country if India had low to no crimes against women by men.",
        "So you’re saying women doctors are bad compared to male doctors?",
        "I’m a doctor and even I won’t be comfortable going to a male doctor. Firstly, they just don’t get women problems and second, I cannot risk being assaulted",
        "Highly agreed, I have read all sorts of horror stories from so many female patients about how a LOT of male doctors treated them, I mean at least have some brains to not go into this field specifically. There's a reason why women will always prefer women when it comes to discussin of intimate matters. And why would any company want to go into losses when women will opt to be treated by other women, unless it is really an emergency. He may not be a creep, but this perception is understandable.",
        "As a woman, from all the stuff I have experienced with all the men I’ve met , personally I wouldn’t go to a male gyne. Just my personal opinion.",
        "I am sorry mam if what i said offended you in the wrong way. Ofcourse I wouldn’t be assaulting anyone. That is completely abhorrent and most disgusting thing to do. I respect females and after working in this department my respect for females has increased many folds. \n\nb) regardless of your training you will not have the lived experience of a patient with the organs and hormonal axis you are treating.\n\nI may not experience the same hormonal axis as you but I have been trained to be compassionate enough to hear out your problems out and provide you with correct solutions.",
        "Ok i understand now.\n\n\nFair enough.",
        "Yeah I mean doc here just points out gender discrimination saying I put a lot of care, and got an education worth of 10 years? \n\nWould men seriously like it we put a highly qualified, the best and super experienced female umpire in charge of men's cricket world cup final?\n\nBoth are high stress fields with emotions and stigmas attached.",
        "If the medical field was based on gender or looks instead of qualifications then everyone would have to worry.",
        "Absolutely as long as she is skilled for the job I wouldn’t even doubt for a second.",
        "Excuse me mam, I haven’t mentioned any where that female doctors are bad. That’s just your assumption. I have compared my mentor and HoD with their co-workers. Please don’t put words in my mouth. When you compare two things, it’s completely natural that one of them will  be slightly superior than the other but that doesn’t mean the other thing being compared is bad.",
        "Honestly I am happy you were able to take specialization in a field which you have found passion in.",
        "I'm pregnant right now, I live abroad and I've had a nightmare with having my symptoms being taken seriously by male gynacs. Theres always two sides of the story. \n\nSecondly, please understand the cultural context we are in. Of course there is preference for female gynacs, but I see plenty of well established male gynacs. Long term, you'll fare better, especially in obst. \n\nThirdly, you're getting the recruiter into seriously trouble. If you're highlighting the hospital, it won't be hard for his/ her supervisors to understand who the person in charge is.",
        "So male doctors are superior? Why?",
        "Honestly I would try recommending practicing in europe, some countries here let’s say Czech Republic for example; care more about if your skilled for the job than anything else, and I haven’t seen any preferences for choosing doctors. Try making more connections and going for fellowships.",
        "I am all for that. \nI just wanted to emphasise that, eventhough people in the west don't mind a male gynaecologist, they absolutely have the right to consult/ask for a different physician if they aren't comfortable, except in emergencies. Even in nationalized healthcare systems like the NHS.",
        "Again mam, in no way i am putting any one down. If anyone is being put down here, it has to be me. Some of the commentators even assassinated my character without even knowing me. I don’t have to show the world whether I respect women or not. People around me and most importantly the patients that I have earned through my hard-work know that. This is a free space and I am just sharing my experiences here.",
        " \"Spread their legs\"? is this how you would refer to a family member visiting a gynac?",
        "Honestly yes it seems to be a more north Indian thing, usually in South gender isn’t an issue or at least in parts where I have been to.",
        "It's interesting. Conversely would men have a problem with going to a female urologist/sexual health doctor?",
        "Nope, two separate girls have told me that they always prefer male gynos as against female. They say most female gynos are too judgemental and shamelessly start intruding on personal stuff for no valid reason. Male gynos are a lot more cognizant in how and what they talk to their patients and generally never get into uncomfortable conversations.",
        "Absolutely but the backlog in appointments usually makes it a tricky situation and I think most times than not, you have to book a new appointment. If I’m not wrong; other redditors please correct me if I’m wrong here.",
        "Again mam? Where did I mention that ALL male doctors are superior? I would like to request you to re-read my reply. I am talking about two groups of co-workers. I have nothing against any gender. That would be quite ironic since I am facing a similar discriminatory situation.",
        "maybe the code of conduct is being followed in an “ideal india”. currently, heck no brother",
        "Girls who're open about this stuff tell me they actually prefer male gynos because they don't act judgemental and get into uncomfortable conversations like (older) female gynos",
        "Hmm, I am a woman and i completely empathize with you. However, the hospital seems to be just complying with the needs of the society since they are there to make their profits also. Is it possible for you to find successful male gynaecologists and speak to them about how they overcame this?",
        "Good for you. My wife prefers a female gynac and so do many women. Ultimately that's what decides whether you get a job. You should have become an ortho surgeon. They're bringing in the moolah",
        "But, unlike gynaecologists, dentists treat people of all genders.",
        "How would you or for the matter of fact anyone would know whether or not I am judgemental when I am not being given a chance because of my gender? Shouldn’t hiring be based on skills and not on gender?",
        "I always consider getting judged by a random lady Dr than to get raped by a D man.",
        "Yeah. You are right there.",
        "The ”Dr” prefix is given irrespective of gender. It is equivalent for both the gender. I would rather look at her qualifications than her degrees",
        "True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist.\n\nJust to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic",
        "This stupid advice helps no one.",
        "As a woman, I've never been taken seriously by general doctors and endocrinologists (for my thyroid) when I talk about my severe mood swings. They are all male.\n\nThe most they've recommended is to take vitamin panel tests and prescribe me vitamin d and iron supplements.\n\nThey didn't understand how it affects my life. Just tried to tell me how it's normal and I should endure and live with it, when I lose my rationality for half a month. \n\nNot only that, during Corona, I felt the shortness of breath. I just endured while talking to the male general doctor to talk properly and he laughed at my face when I told it is not that. Then he put on a stethoscope and observed that he changed his face and admitted that I had exactly that. Now I wanted to curse at him, but didn't want to create a scene and left.\n\nSo now I don't wanna go to a male general doctor itself to treat small things like fever. But I would if it is an emergency, but hell no for any other thing.\n\nIn fact, It is not to say that female doctors are better. They also don't take my mood swings that seriously to recommend birth control pills and only care if I have irregular periods. But they at least don't laugh at my symptoms or lecture me on how I should do yoga.\n\nSo, I don't think I'll ever go to a male gynaecologist when I don't know if they'll listen to my symptoms and take me seriously or they are going to just dismiss it by saying it happens to every female.",
        "Dude, just set up an abortion clinic in top cities of India and market yourself as a liberal non judgemental person.\n\nYou would definitely get a lot of clients especially with premarital sex on the rise.",
        "You could do the same logic to almost anything.\n\nThis is just discrimination plain and simple.",
        "I wonder how people would react if gender was replaced by \"caste/religion\" in the above scenario.",
        "Why shouldn't there be female umpires ?\n\nNot understanding the logic here.",
        "I am pretty sure the same logic is used to discriminate against minorities in this country.",
        "There should be, but Indian men will blame her gender and the entire female gender for being horrible umpires any decision they think is wrong. She will get harassed left and right.\n\nIf this doctor sahab can argue why he faces discrimination in a primarily diagnostic, judgement oriented, really intimate and purely female focused environment. Obviously we should have a female umpire anytime soon.",
        "I am girl, all my besties girls. Idk what sort of girls you hang out with fam that they just opened up to you about being comfortable visiting male gynos. Stop fabricating shit. Girls???",
        "Fun fact nobody talks about is : something fishy always happens between nurses &docters at night.....u know wat i mean haha!",
        "Maybe look for opportunities in government hospitals. \n\nI have seen male OB GYN only in govt hospitals.",
        "Bank of america also hires questionable women over qualified males too. Its common in India with all the woke culture.",
        "Hi. I’m a ob/gyn in the EU. Not only I am shocked by the hospitals’ responses, but even more by the majority of the comments on here. What a horrible mentality. I am sorry this is happening to you. Are there any syndicates or on/gyn associations you could complain to? Could you see legal action against those hospitals for this? \n\nI only worked in public hospitals. Here, if they refuse the care from a male physician, they are quickly being shown the door, refused any further care and the whole staff would talk about them like they were raised in the woods. \n\nTo everyone saying he chose the wrong career path, etc - shame on you, you’re a disgrace.",
        ">There should be, but Indian men will blame her gender and the entire female gender for being horrib\n\nSure, but that's not the issue here.\n\nDoes any cricketing body explicitly not hire women umpires for a match, that's the question here.\n\n>Obviously we should have a female umpire anytime soon.\n\nYes, I am okay with it.\n\nPeople used to say the same things when women started serving in the army ???\n\nAren't women now successfully serving in the army.\n\nYou can't fight discrimination with more discrimination and win.\n\nThat's what my whole point is about.\n\n>Just wait 2 minutes and let someone post a story of a girl being raped and left pregnant, the entire crowd will pounce and call it \"fake pregnant belly\".\n\nWhat ???",
        "Get experience in ngo type hospitals.  Save enough to start your own clinic.",
        "OBGYN. It is a very intimate field, I personally would net want to discuss these issues with any man. I played a male dominated sport too, with boys, I never really faced an issue ever. But it is an intimate field. And let's say umpiring is open to all public. Naturally men have an upper hand. This subreddit sympathises with men on ideas and concepts they don't know a ground reality of, but accuses women of all sorts of things whenever any news regarding them circulate. It is a man woman issue, it is about intimate problems. But it is as much a a demand supply issue.",
        ">OBGYN. It is a very intimate field, I personally would net want to discuss these issues with any man.\n\nThat is fine, personal choice matters.\n\nI know of people who won't eat vegetarian food from non veg hotels because they believe the plates get mixed and it's impure, to each their own\n\nBut no institution should be able to outrightly not hire males or females or whatever that's textbook discrimination.\n\n>it is as much a a demand supply issue.\n\nIt is always a demand supply issue.\n\nIf the number of OB GYNs are less, he would get hired in an instance.\n\n>And let's say umpiring is open to all public. Naturally men have an upper hand\n\nThat is what you need to provide more accommodations to women, like giving them matches in the evening or T20 matches etc.",
        "Its a serious question.. considering this scenario why didn't you do any other specialization? The situation hasn't arisen overnight all of a sudden. Did you just rebel without a cause? Will you change the whole society thinking and change mindsets by being a male gynaecologist? I truly don't understand why you would put your leg on an axe yourself? Please help me understand why you made your own life difficult like this?",
        "India is backward, in Australia, we have laws against this.",
        "I've read stories of male dentists drugging their patients and assaulting them. Convince your fellow men to have some self control and then maybe their won't be preferences for women as gynecologists/dentists/morticians etc",
        "No one said outright yaar, it is preferential. \n\nHow can I provide accomodations, I don't watch cricket\n 😂\n\nPlease grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries.\n\nI'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive.",
        "No one said outright yaar, it is preferential. \n\nHow can I provide accomodations, I don't watch cricket\n 😂\n\nPlease grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries.\n\nI'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive.",
        "No one said outright yaar, it is preferential. \n\nHow can I provide accomodations, I don't watch cricket\n 😂\n\nPlease grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries.\n\nI'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive",
        ">How can I provide accomodations, I don't watch cricket \n\nAccommodations are provided by the cricket board not spectators.\n\n>No one said outright yaar, it is preferential. \n\nWe are talking about the hospital outright rejecting men, this is not difficult to understand.\n\n>Please grow up and realise that women have a preference, this field came into existence because women always had\n\nAgain, where did I mention personal choice is wrong ?\n\nYou don't even seem to be reading my replies.\n\n>I'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive.\n\nTry again, I am much older than that.",
        "Homeboy there thinks he's spitting facts while being crude and uncultured af.",
        "I read and replied exactly how I know. Would any hospital want to kill its demand? Naturally they mentioned female so male applicants don't have to bother with all the hardwork submitting resumés and doing all formalities. That isn't outrightly discriminating against anyone.\n\nNo one questioned his expertise. But does his expertise have a supply? Do men watch the women's world cup as much as they watch the men's? Nope. Naturally if there is a sponsor like dream 11 they will invest into the men's team. Doesn't mean women aren't good enough. \n\nFun discussion tho.",
        ">Would any hospital want to kill its demand? \n\nThe same logic could be extended to hiring minorities since a lot of people in India would only want someone from the same religion to treat them.\n\nSo are you okay with the hospital outright rejecting minorities ?\n\n>No one questioned his expertise. But does his expertise have a supply?\n\nDepends, maybe for his earlier years he can go to cities like Kolkata or a Tier 2 city and hope for the best where competition is much less.\n\nMaybe he could switch to private practice in Mumbai after a decade.\n\nHis expertise is Gynaecology and that definitely has a demand.\n\n>Naturally if there is a sponsor like dream 11 they will invest into the men's team. Doesn't mean women aren't good enough. \n\nWe are not talking about men and women sports\n\nThat's a whole new discussion.\n\nI am okay with continuing the umpire discussion if you want to.",
        "The fact that you make such a comment. Unable to properly acknowledge why female patients would prefer a female doctor proves their point. I’m sure a lot of woman are happy they don’t have a male doctor who can’t sympathize with them.\n\nI do sympathize with you though, it’s tough not finding a job. Especially after such a long and expansive studies.",
        "I mean it's gyne, wtf do you expect?",
        "I have written this as a satire to people who think visiting a male gybac is uncultured or taboo.",
        "Just apply for jobs outside India, the demand for qualified Healthcare professionals is extreme and you'll get paid 10x of what you get paid here",
        "what exactly sounds funny about it?😂 this is the most logical move",
        "af is polite and cultured?",
        "male doctors don’t get i to uncomfortable convos? what utopia is this😂😭 india mein hat doctor male ya female usually judgemental hi hota hai",
        "so how people would react if the criteria made 0 difference to the comfort of the patient? i wonder how people would react.",
        "how can it be discrimination if it’s about your own comfort? you’re paying them for their service, you allowed to choose exactly who you want. there’s no discrimination when you’re making personal choices about your health lol",
        "Its not discrimination if the individual doesn't go.\n\nIts discriminatory when the institution does it.\n\nHow would you feel if a software company refuses to hire you because of your race as an example ?",
        "Most male gynecologists i know are into infertility or gynec oncology",
        "Basic reading comprehension. The af is used to accentuate the crudeness and unculturedness of your statement unlike yours wannabe edgy one. \n\nAlso do you really think pointing out the 'irony' is doing something to your cause for use of such phrase!?\n\nP. S. Nice job with the edit there, atleast own up to your bullshit while you're making a case for it.",
        "We don’t have this, and don’t need it. It‘s a bit sexist. Dude just doing his job and if you studied this job, you didn’t do it to be predator.",
        "ok? you do understand there are women who have been SA’d in the past and have trauma about being this intimately vulnerable with ANY men? trauma doesn’t care about sexism or whatever ism\n\nif you guys don’t care about women’s mental well being, especially women who have been sexually harassed in the past, then how is that our problem? you guys don’t have any women only shelters either for DA victims? i wouldn’t be surprised lmao in the name of equality making lives harder for women",
        "Also particularly in private clinics in Delhi NCR and Middle East, they ask for a Female Dermatologists in advertisements.",
        "That argument makes no sense: woman doctors exist, too. SA victims just go to whatever gender they are comfortable with. But if a regular woman goes to the doc, there doesn’t need to be a woman, too. \n\nWe do care a lot, actually. You seem very aggressive?",
        "How can you be downvoted? It IS discrimination and isn’t it illegal to discriminate in india, too?",
        "@[Appropriate\\_Log\\_1695](https://www.reddit.com/user/Appropriate_Log_1695/) This is sad. Also in a way now we know the true reason.  It is not because of anything else.  Most of time Hospital HR will give some shi\\*t like - need more exp, need lower salary expectation etc - here they were foolish, but honest with the reason.\n\nThis sort of discrimination is widespread among doctors. Also in some more like nurses and professor.  People always remain silent when this happens.\n\nI suggest you slowly setup your own and until you do that, get posted wherever you can.  Save money and in parallel - start your own.  For long term, depending on a hospital is a risk.  They will use this same reason  anytime they want.",
        "I would suggest u took look in other States such as maharashtra like ladies do prefer male gynech if he good at it over a female one less discrimination on gender basis",
        "Agree",
        "You are in the wrong country. You keep defending yourself here, but you are not going to change people's mindset just by yourself. It will take years for that to happen.\n\nI have a male OB. I am currently pregnant with my second baby and he was amazing with my first pregnancy. However, I live in Canada where there is less stigma. The other female OBs in his office have worse reviews than he does. He has amazing reviews on RateMDs because despite not having female organs, he is capable of showing empathy. I believe you, dude. I know you are fully capable of doing your job and you are probably very good at it, but you are in the wrong place at the wrong time.",
        "You chose wrong profession buddy its very difficult in india, try to move abroad",
        "It’s the same outside India as well. I have 9 gynaecologists at my hospital and all are females and I live in west.",
        "idk why i read every text with the word \"doc\" in it with bugs bunny voice \n\nhope u find a job soon, but yea, male gyne in india is tough",
        "A friend's dad exclusively hires female dentists because they're less likely to become competition by opening up a clinic nearby",
        "Well gynaecologist is a sensitive area and is a mainly female practice because it's customers are 100% female.",
        "Yeah. Chandigarh Kare ashiqui I think or may be Bala.",
        "Not completely blaming them. I wouldn't want my wife go to male gynaecologist as well.",
        "i think female andrologists would be quite popular-",
        "Yes, I personally was in a bike crash and I hurt my testicles and I asked for a male doctor. The thought of showing my bruised balls to a woman kinda felt embarrassing as I knew a male doctor would understand. These kind of intimate medical issues should always be dealt with a similar gender doctor as atleast they can empathise.",
        "Lots of women are uncomfortable with a male gynaec and specifically call up to find out which hospital/clinic near them has a female gynaec. I don't think it's about the company being discriminatory but more like, they know the requirements of their patients and are trying to cater to it.\n\nWe can argue about stereotypes, and doctor to doctor hota hai, I am qualified etc but you cannot make someone comfortable when they are not.",
        "There were some cases recently where male dentists gave anesthesia to their patients and then r@ped them. After reading those cases, my Dad started accompanying me to my dentist and told me that if he's not available on some day, I should visit the female dentist instead. Idk about others, but it's possible that some other people also have these concerns. You have no conrrol over what happens to you while you're under anaesthesia. \n\nYou guys are getting screwed bcuz of the actions of other men, not bcuz of employers being discriminatory. 🤷",
        "I was at a diagnostic center in NCR yesterday waiting for an ultrasound. A lady came in for level 2 pregnancy ultrasound but didn't go ahead because they didn't have a female doctor to conduct the ultrasound. \n\nIt's not the hospital, it's the patients who don't want a male doc",
        "Ayushman Khuranna ki movie thi na ispe",
        "This is a case of how men ruin things for men. Especially true with indian men. \n\nSure, you might never misuse your position, and would never assault anyone. \n\nBut statistically? The odds aren't looking good for your patients, worsened by the fact that women gynaecologists would simply not have this issue entirely. \n\nA lot of indian men are fucking animals, and so many women might be uncomfortable around men in general, let alone a male gynacologist. It's unfair for you, but at least understand why.",
        "then remove all female doctors from checking males as well isnt this double standard?",
        "It goes both ways. A male patient hardly ever prefers a female urologist. Similarly, if a woman prefers a female gynaecologist, it’s really the question of comfort. We in the medical field are very immune to diseases and male/female body parts. But we forget how most of the people are uncomfortable. I am myself a female doctor and I would still prefer getting checked by a female gynaecologist. \nThat’s why you’d see how most urologists are male. There is really no point in blaming the hospitals here, it’s not their fault. It’s just a tricky, slightly gender biased speciality branch.",
        "Bro... I didn't know it was this big problem.I am a girl and i have visited almost 5 gynecologists and all were male and all from rural areas or town.\n\nI thought we were in 2024 not in the 19th century.\n\nDon't lose hope,but you should try in a private hospital.",
        "Congratulations. You just played yourself.",
        "Bro, nothing against you. I am a woman living in the US. I just said my style.. I would assume all women out there are like me.",
        "I'd say gather some resources and leave India. The country has a shithole mentality and won't recognise talent/ hardwork because they are too busy rotting in their age old social norms.",
        ">Are yaar",
        "Mam going by your logic, vets should be out of their jobs because how can a human make animals comfortable? 70% of breast surgeons/oncologists are male. And they chose to super specialise in that field. Despite breast cancer being the leading cause of cancer in females, women shouldn’t consult these breast surgeon since majority of them are males. How are they going to understand  your issues when they don’t have the organ in the first place?",
        "Just in case you ever felt the need to drill your female patients some other way.",
        "i think your “vet” logic is really an ignorant and nonsensical  comment. Anyway gynaecologists are the first doctors a female goes to for reproductive issues. so when she first goes to that particular doctor she’d want to be very comfortable and choose a female. By the time another doctor diagnoses breast cancer, she will definitely go to whoever is the best out there. I think there’s a certain difference between an oncosurgeon and a gynaecologist. Nevertheless, this was just my personal opinion and you can clearly see how it’s the question of comfort for the individual patient here and not the question of you being worthy or not. i am sure you are a very capable doctor, it’s the field that is biased just like urology.",
        "Oh god, I relate to you so much. I went to a male gynae at first, but was super extremely uncomfortable and unsafe. But the dude did try to help but my mom didn't like it. She pulled me off after one visit and took me to a female gynae. This female gynae says, \"Oh, this is normal period pain, it'll go away after you get married and have a child\". \n\nMind you, it was extremely painful and not normal. I was pretty much immobile with pain and losing my consciousness. So I know that most women don't get taken seriously just because it's normal for them to live with so much pain... In my experience tho, it was both, female and male doctors (except that one male gynae that actually tried to help, he was one of the good ones and I'd put his name here but I don't remember cause my mom pulled me off after one visit) so I pretty much just avoid doctors and chug painkillers to survive. (Still undiagnosed but I'd rather just suffer than waste money to be told it'll go away after I marry, bitch I was 14, what am I supposed to do?? Wait in misery until my knight in shining armour comes to me?? Wtf kinda crap— the sheer absurdity of that statement itself ugh 💀) \n\nEven my mood swings (depression, high end anxiety etc) are so extreme through the 2-3 weeks. It fucks up your quality of life and then the doctors don't take you seriously. It sucks. Finding a good gynae male or female is like looking for a needle in haystack 🤡",
        "Hey, I can understand your pain. My doctor wife is already shy/uncomfortable having a gynaec checkup from her female doc and would faint/have a panic attack at just the thought of a male doc examining her. She clearly has confided in me that in this situation, all professional logic is thrown out of the window and emotions take over.\n\n\nBut there is a (non-ideal but acceptable) solution a few of my male gynaec acquantainces have done- become gynaec oncosurgeons. Get complex referrals, operate for others etc. Minimal opd interactions/pv examinations with any patients. \n\n\n100% of robotic gynaec, 50% of lap gynaec and gynaec oncology surgeries in most big hospitals r not done by the admitting doctor but by a superspecialist called by them.",
        "Typical feminazi\n\nAnd then they will cry if not hired as an ortho or a surgeon because they need 6 days off every month.\n\nBe a real woman for once and stop denigrating the male gender.",
        "That's why I miss calcutta.\n\nOne of the most open minded liberal cities in North India.",
        "Professional pussy examiner",
        "A male gynec delivered me and my elder sister, and my cousins too, and this was in late nineties when he was already in his fifties. He was well reputed and his daughter who was also a gynaec was the second choice of my mom as she felt her inexperienced. Thats what patients care at the end of the day. Experienced female gynaecs will obviously have the topmost priority unfortunately. So I believe its only about reputation and years of experience at the end of the day, and factors such as location. As someone said, networking and building your name with the help of other male gynaecs for another decade seems to be a good way forward for you. Good luck!!",
        "This!! \n\nI’m a women and one of the best gynaecologist I’ve come across was male gynaecologist! \n\nNon judgemental, actually valued my opinion, talked about my pain and pain management over fertility like other gynaecologist I’ve visited.",
        "But dentistry involves local anaesthesia?",
        "You see, gender discrimination is only illegal when it’s happening to women. Truly a marvel of our modern society",
        "Lol there are levels to sexism and uncle looks down on all of them.",
        "Patients are not comfortable with male gynaecologists lol. it’s not discrimination.",
        "Same with race and skin color.  I know dark people who only want light doctors.  Should hospitals only hire light skinned doctors in those areas?",
        "We still have lot of gender bias in society which is increasing with current religio-socio-political scenario. \n\nPeople prefer female drs to examine their female relatives. Even though the women themselves may be willing for a male dr. So, a private corporate hospital, with eye on nothing but financial bottom line WILL refuse you.\n\nIronically, the bias should work in favor of male drs, because same mentality states that male drs are 'better' than female ones in terms of skills.  (You HAVE seen your female colleagues addressed as 'sister' -meaning nurse- haven't you?) Still, this is how it works when choosing a obgyn is concerned for so called educated layman.\n\nTry government hospitals (you do have a bond to complete, don't you?) or go for private practice. Going to a tier 2/3 city is a good idea. Metros are overcrowded with competition.",
        "Definitely, females have a higher probability of getting assaulted, it's such double standards, why only females? Males be feeling so left out, It's so fucking unfair womp womp bro",
        "Whats this gender thing? In a country where rapes are so prominent it’s absolutely okay and right for a woman to only go to women gynaecs. I would never go to a man  gynaecs sorry not sorry !!!",
        "Maharashtra mein aao, stereotype thoda kam hai",
        "How is this even related to feminism 😭 I am just not comfortable with a male gynaecologist. I am not a real woman because I don’t go to a male gynaecologist? Heights of stupidity",
        "Kisne bola tha gynaecologist banne ko ?",
        "Bhai bachpan me sir ke bal gir gye the kya",
        "yeah be so for real any female would prefer going to a female gyno ...",
        "I just don't understand this bias. Not everyone chooses to become gyne? Your score determines that. Sometimes your score gives you an option between Gyne and Derma. I don't think most would wanna choose derma over gyne. Because gyne pays better. So don't guilt trap him and other male gynes with this gaslighted asf comment. \n\nPS: I am not a gyne. Not even a doc.\n\nPps: You are clearly not for gender equality",
        "Welcome to India, here it's better to be born as a cat or a dog than a man, hope you enjoy ur stay here",
        "Eh ?\n\nYou probably need an endocrinologist. That actually knows his shit",
        "OP put this on Twitter and maybe try in Bangalore or Bombay.",
        "gynae to ladkiyon ko hi karne de bhai kyu dusro ki field me jara, koi lady kyu male gynae se karayegi? tu apne ghar pe puch koi male gynae pe jayege?",
        "No one is worried about sexual assault by docs in cities. It's not that. What it is, is a matter of comfort. I'm not comfortable going to a male gynac either. Out of 7 of my female friends, one has a male gynac.\n\nIs it fair to you? No. But it is what it is. And the hospital is a business, unfortunately.",
        "90+% docs who get a chance to choose between derma and gynae, end up choosing derma. Radiodiagnosis and Dermatology are the top 2 most in demand branches btw.",
        "It's not just conservative families. I wouldn't call myself conservative. My partner won't care if I went to a male gynae. But I don't feel comfortable. I couldn't debate it with logic or reason. But it is what it is.",
        "Cant really blame the hospitals / patients either , most women dont feel comfortable with a male gynaecologist",
        "Makes sense. These fields have better work life balance. No Er rounds etc. \nNow that I chose a wrong example due to being outdated with current medical trends, I don't want to devalue my point. Which is gender should have nothing to do with academia and profession.",
        "First of all, stop shaming him for choosing this specialisation. That is horrible of some of you. He worked hard to get here.\n\nSecondly, OP it is nothing personal against you. There is a preference for female gynacs and not because of a negative bias but keeping safety at the centre. \nI am not aware of you PQE, but I would say get in touch with other practising male gynacs, and they will help you navigate the situation better.",
        "but hospitals would consider doctors who patients prefer right? I'm myself open minded and fairly liberal but if i have to consult a gynaec... i would PREFER a female doc",
        "all this still doesnt change the fact that patients have a choice to choose their doc.",
        "I have a friend who's working as an obstetrician in the town along with his wife (MBBS), they are doing pretty well, biases are common in our society at every domain, but I thought a corporate hospital in a metropolitan culture would have evolved.",
        "The sad truth is many women in India would be ostracized for consulting a male gynecologist. Many others will simply be uncomfortable. \n\nI feel for your predicament, but I can't blame the hospitals in this case. They are simply doing right by their patients.",
        "Exactly, I mean being done mbbs for 5.5 years,dude already had an idea about the situation,this he choses obgy , why dude why?\n\nI'm gonna choose surgery next year , obgy never crossed my mind",
        ">Convince your fellow men \n\n\nYou say it as if he is responsible for the behaviour of all men",
        "Try government hospital, their patients don't have a choice for male or female gynaecologist, bro give up in private hospitals\n\nEven in government hospital, you will face discrimination and it also depends on how you look and dress, I'm pretty muscular and seeing me examining them make them uncomfortable...... feminine looking male and feminist voice , personality helps or you have hardly chance",
        "> Convince your fellow men \n\nwhy the fuck is it my job lol",
        "Relax man",
        "A very small percentage of doctors do rapes at least in America\n\nSource: Am doctor, have not had self or colleagues do even one rape to my knowledge",
        "I'm sorry they don't appreciate your edginess here it's probably because they are upset about you talking about their bahu in this manner \n\nAt least that's what your bahu told me in bed last night",
        "You know women don't generally have to take time off to menstruate right",
        "I applied for an HR intern role a few years back, I knew I fit perfectly, everything went well but the HR there wanted only a female candidate. Equality my friends.",
        "And I would tell you to go and meet the nearby doctor in emergency room and see how many females come and blatantly ask for certificates to show the same so they can take sick leave etc \n\nIn my own hospital they made it mandatory for all sick leaves to be issued by the MS due to this issue.",
        "Lol what? The question isn't whether or not you mentioned all male doctors being superior, it's that you decided to make a comparison solely based on gender. And you think you have nothing against any gender? Think again, your bias is actually quite unsubtle and it is showing.",
        "Once when I was little someone threw a ball right at my crotch and a little boy said \"oooof ouch\" and I was like \"huh?\" \n\nBut to get back to your question, this is a common problem but not necessarily universal. I've had cervix surgery where the anesthesia started to wear off, and I know testicular injuries are at least 100 times more painful than that. A kind and empathetic person is gonna be kind and empathetic regardless of gender, and sometimes you don't have a choice as to the gender of the doctor and it's better to have medical care from anyone than to lose your testicles at a young age.",
        "If you have or can get the cash take the usmles and move to the US, or move to Kolkata as someone suggested, or do fellowship in maternal fetal medicine",
        "And it's perfectly understandable from a woman's perspective why is it so. I completely empathize with them. Safety is not ensured as crimes such as this are not punished at all in India.",
        "There is a stark difference between knowing someone and then passing a fair judgement and simply jumping to conclusions which you are doing at the moment. I am not basing my argument solely on gender. There are numerous factors involved and since I have worked closely with them, it is justified to have an opinion. And if you would go and ask them they would happily agree with me. But having said that, I would like to repeat myself that I am not disrespecting them in any way and I have immense respect for my female seniors. They have made me what I am today. They have nutured me like their little brother which is why I have some of the closest relationship with them. \n\nTheory is something I can read from textbooks but to have an understanding about female perspective and emotions is something I learnt from them.",
        "Come to South India. I have never seen any male gynaecologist facing any issue problem here. Our obgyn HOD is a male. Ppl aren’t that hesitant here as far as I have seen.",
        "I know you just want to look at pussy.\nGood try buddy, this isn't gonna take you anywhere.",
        "look i will be honest, personally as a woman i am not comfortable to let a male gynecologist touch me. I don't have trust in most men because of obvious reasons. that's probably why female gynecologists are in more demand.",
        "this is india though... you would be surprised how common sexual harassment is here",
        "uhh yeah there are some examinations which require the woman to actually spread her legs.",
        "Where did this pervert mindset of yours lead you? I would still be in a noble profession, I would still be respected and I would still make a lot more money than you ever would. Which is why I am where I am today and you are where you are. People like you pose as a risk for women and as a hurdle for good men. We can say ”not all men” all we want but nameless, faceless perverted trolls like you negate our points.",
        "Most of the commenters here are acting like male ob-gyns have never existed in the history of India until OP became the first one. What do you think the situation was 10 years ago? 20? 50? There were not always so many women going into medicine in India as there are today. The field of gynecology was created by a male doctor in the US, and for many decades it was pediatrics, not gynecology, that had the highest % of women doctors. I myself was delivered by a male gynecologist and my parents ever expressed any reservations about this choice when talking about it.\n\nBy the way, Princess Kate’s children were delivered by male gynecologists, and if there’s anyone who had the ability to select exactly which doctor they wanted to see, it would be a royal family member. https://www.usatoday.com/story/life/people/2013/07/22/duchess-kates-medical-team-has-delivered-other-royal-babies/2573987/",
        "you are lucky women don't sexually harass men as much.",
        "Basic economics at play here, patients want female gyno as a result hospitals wants to hire female doctors as only they’ll be able to generate revenue",
        "Most female patients in India are not comfortable with a male gynecologist.",
        "Happens more so in the North side of India, having worked in all regions of India (North, South East & West) for over 20 years as a medico. North people are super judgmental even the educated ones regarding how their doc looks.\n\nFor example I am 40+ and still looking relative young (thanks to good genes) , I have handled at least 25k (thousand) plus surgeries and consulted more than double that number, but coming North people still want a second opinion to another \"senior looking\" doctor after consulting me. I have purposely let my hair greyed to \"look\" more senior/older and now that trend has stopped.\n\nSo do not give up hopes just coz of one set back, just do what you are good at and keep aside some capital for marketing..the same people later will be come begging at your door/clinic step.",
        "It's not about you though. Some women will simply not go for the checkup if they are forced to see a male gynac. If the point of having gynaecology as a speciality is better health outcomes for women, then in india at least you'll have to understand why you are being rejected by some practices and understand that its necessary discrimination.",
        "Can't believe dummies are down voting this",
        "If you're not willing to bring about the solution don't complain about the problem ",
        "Yeah, female gynaecologists were also not better.  But at least the ones I went to didn't say that it happens to every female, I would have hated  if they said that seriously.\n\nBut they didn't prescribe anything because they also thought it was due to thyroid. And since I was already taking medicine for that, they just said mood swings are due to thyroid. They told birth control pills might fuck up hormones and they won't suggest it.\n\n I do suspect that I have PMDD and I don't know if any doctor would take it seriously and listen to me.\n\nThe more I research, the lack of information about the female body is astonishing.",
        "That and the fact that even doctors who are supposed to be scientific will dismiss patients' concerns and not take them seriously. Even if they are women specific doctors.\n\nFemale patients were often disbelieved in the past (and technically still are now). Of course, it's more than just female patients who suffer from this.",
        "Well, that’s what you do. Legs up, feet in stirrups and spread wide. Humiliating; I’d never put myself in such a submissive position with a male doctor.",
        "You’re the one hating on women for no reason. No one is against men. We are just saying that we aren’t comfortable with male gynaecologists. Please don’t make it about feminism and shit. Your comments history and downvotes on your comments speaks for itself",
        "It kinda reminds me of that Ayushmaan Khurana Movie... 😅",
        "I'm not saying anything about you but I have lurked around a lot in subs that are not composed of Indians and revolve around female health issues like PCOS and all. And even in their countries they complain how their male doctors don't seem to take their symptoms seriously and were unable to diagnose their issues and would just tell them to lose weight or something. I know it is anecdotal but a lot of them said they would get shamed and judged a lot and would be in so much pain and things only got better when either they went a specialist or a female doctor. Just my two cents. Sucks to be you though, pls keep trying in some other hospital. I'm sure u will find one in NCR or a private clinic",
        "What makes you think that having an extra person observing a most intimate exam of very private parts would somehow make a woman magically he okay with a male gynecologist? A “chaperone” would annoy me. \n\nSo grateful to have my exams in private; just my gynecologist, a lovely woman close to my age who even has the sane first name,  and me. No observer to make me even more mortified.",
        "Not regularly but certain procedures like root canal I guess. I have no knowledge of dentistry, just read about the cases in the newspaper.",
        "Same situation in the U.S. where  there are plenty of non religious, liberal, educated women  who prefer female obgyns. For obvious reasons. \n\n87% of obgyn residencies in the U.S. are filled by women. For the past two hundred years, men dominated not only gynecology, but all of medicine. Women had no choice. It’s about time that we do.",
        "That's... not how it works. A preference for fair skinned doctors is just clear prejudice and isn't related to those doctors' qualifications or any health/security risks. In contrast, female patients choosing a male gynaec (who literally has to see their private parts) or people opting for a female dentist due to concerns about what could happen to them under anaesthesia is directly related to the patient's safety. Security concerns are not the same as preferences that have no reasonable basis.",
        "Andrology is a subspecialty of urology, unlike gynaecology with usually counts as its own specialty",
        "Hooters, the crazy restaurant chain in the U.S. only hires women servers. For obvious reasons; it’s what their business model requires ( women in skimpy outfits ) and men are not “qualified”. It’s understood and not challenged.",
        "It’s about demand; if the patients (customers) prefer female obgyns, then it behooves their bottom line to hire women to fill those positions.",
        "I've seen enuff. \n\nAnd tumhare jaise log hi samaj mein gandi vichardhara faila rahe hain.\n\nJaake apne munh bole mod papa ke paas rodo block karwaane ke liye.",
        "May I just say that no way would a man apologize for his personal opinion/preference. You do not owe an  apology for what’s best for your mental, emotional and physical well being.",
        "Maybe he intended to study surgery after and become an obstetrician but the family ran out of money. \n\nMost gynaecologists & obstetricians doing c-sections I know are men.",
        "its not my problem. and its definitely not the solution.\n\ngood lord feminazis make everything about their narrative",
        "Nobody is suggesting banning men from the specialty of obgyn. They may choose the speciality and patients will choose which doctor they will see. \n\nSame with urology in that both men and women have the option of choosing the speciality. Remember though that urology treats both men and women. We all have urethras, bladders, kidneys, etc. In many cases men prefer same sex urologists as do women. Certainly not surprising.",
        "Wanting gender concordant care for genitals is recognized, and understood as the right to privacy and bodily autonomy. Race is another story and you know that there is a difference. It’s disingenuous to compare the two issues.",
        "Your “analogies” are absurd.",
        "Righto; it’s 2024 and finally women have choice! For the past two hundred years men have dominated gynecology and women had no choice. They suffered at the hands of men who barged into the field and kicked out midwives. \n\nThere is nothing backwards about wanting a woman to care for your sexual and reproductive health.",
        "Actually, at least one of her deliveries was\n\nhttps://preview.redd.it/gbeyqq7m58fd1.jpeg?width=1108&format=pjpg&auto=webp&s=3c7a4c62707a3ba933552b505e42bafb708b0b38\n\nhandled by the top midwife in the UK while the male obgyn consultants were nearby in the event of a problem.",
        "So India is backwards because, gasp, they dare to allow grown women to choose who they prefer as their obgyn? Fact is most women prefer female obstetrician/gynecologists and because you know, women have rights these days, they aren’t forced into anything that they’re not comfortable with. What’s backwards is telling women who should have access to their bodies.",
        "It’s really not about you and your passion for seeing vulvas and vaginas all day everyday. It’s about what the patients feel comfortable with; frankly there is nothing more revolting than the thought of some strange man sticking tools and his fingers into your body. Hard no.",
        "Not just Indian women. There is nothing wrong  with preferring  female doctors.. or lawyers, or nail techs, or hair stylists, or trainers, or accountants or dentists. I pick who I want to cut my hair, polish my nails, do my taxes, fix my car, check my teeth, clean my house. Nobody bats an eyelash.",
        "Our previous hod was male. He is one of the most renowned obgyn in my state. Patient from even far used to flock to the op requesting to see him. Patient say that in case of high risk pregnancies they are relieved to have him as their doctor. Another senior male obgyn is called to the ot by all other female obgyns in case of complicated cases like PPH and PAS. \nAnother male obgn has a roaring private practice as well.",
        "The female urologist also sees women patients. Most men prefer same sex urologists and most women also prefer same sex urologists. No big surprise. Any good doctor is not personally offended by these preferences. They want their patients to feel comfortable.",
        "Stop it. That’s just ridiculous.",
        "India has a lot of creepy men lets be honest. Women in India aren't ready for male gynecologists. Any woman in here can reply to me and tell me I'm wrong?",
        "Ok now thats weird lol",
        "They are backward because they don't have laws to stop obvious discrimination in job adverts. In Australia women having rights in their health care is expected too, there are laws to ensure that women are not forced to do anything they don't want to including forced marriage. Interestingly we are not overly fussed about the gender of Drs more look for their qualifications and experience, yes some women may prefer a female but not all. I know plenty of people who have had male Drs who have delivered their babies and had great experiences. In my experience, male gynecologists are more gentle compared to females. I am not female-hating as I am a female but don't agree with excluding an applicant due to them being a male.",
        "That is you, not everyone it is sick that you think that is why a male Dr would do this job, maybe they actually want to help patients. You are entitled to your opinion but I think you need to understand that some patients don't mind.",
        "I dont think Indian men gynaecologists will be in demand overseas either.",
        "\n\nnow i know why people hate feminism thanks for clearing it out \n\n\n>Males be feeling so left out, It's so fucking unfair womp womp bro\n\nsay this when women tell u they feel unsafe",
        "you are lucky women can atleast report sexual assault and then get 27 privileges",
        "i am not saying women should be forced to go to the male but at least get the male guy a fucking job? women doctors also get jobs in circumcision",
        "OP I can't solve your problems but I honestly would love have a male gyn because all the female ones I've been to are judgey and rude T\\_T I hope you find something that works for you",
        "You should consider pivoting into IVF. The stereotype of male/female is barely there, seen this first hand as most of the top clinicals in the field of IVF are men. It’s also a booming industry, growing 20% organically YoY. Lots of opportunities there",
        "I don't know much but it's probably because u r a GYNECOLOGIST. N hospitals prefer female ones for obvious reasons.",
        "I'm a male radiologist who was trained and first practiced in South India and basically focused on ultrasound and I had a big line of patients for ultrasound where is use to transvaginal and even breast ultrasound and nobody had an issue, even though majority patients were Muslims. Later i moved to North because of my marriage, not only patients were uncomfortable even my wife didn't want me to (who is a North Indian), so I focused only on CT /MRI and interventions. Heck I left India.",
        "Thanks. I appreciate it.",
        "*North India*",
        "Bro women would always prefer women gyno. I know it's a matter of capabilities. Humans are emotional and not rational.",
        "don't worry bro same is in IT sector also",
        "Pasting my other comment here\n\n> True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist.\n\n> Just to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic",
        "Pasting my other comment here\n\n> True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist.\n\n> Just to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic",
        "But the logic is easy to understand and needs no explanation. This is why discrimination laws exists. You will be always have a harder time with someone who has an indian name and looks indian, it still is discrimination to not give an indian person a job here in Germany or not give them a place to live because of that. \n\nThat‘s the point, there may be reasons, but you have to ignore them!",
        "Try Private and be non judgemental",
        "do women really get justice though? nirbhaya's rapist got hanged after almost a decade and one still is roaming free.. there are endless number of such cases where rapists weren't even arrested. what privileges are you talking about?",
        "privileges include the one being discussed in post\n\nfree money from pension\n\nreserved bus seats\n\n\nreserved seats in a metro (only talking about reserved in mens compartment)\n\n\nfavour in divorce\n\nfavoured in all cases in court\n\n\n>do women really get justice though?\n\nif the criminal hides then its hard for police to catch him and if he is rich he can outplay the system .\n\n>there are endless number of such cases where rapists weren't even arrested.\n\nthe no. of those who werent arrested is less than those who were\n\nalso men also get harrased but there isnt literally any law to protect there was long ago but it removed? tf",
        "Duuude!! A MALE gynec in a rural area !?!?! Extremely difficult considering the Indian mindset.....\n\nStart private practice and build a name for yourself, or join a private hospital in T1 city.....",
        "Why the F*** does it makes sense for male gynaecologist and not for male dentist? There should be no discrimination based on caste/gender/religion/colour of an individual. That guy also went through all the thicks and thins to learn all the f***ing things that a female gynaecologist would have gone through. Same goes for you. \nMales visit female dermatologist for genitalia related derma issues if the doctor is well qualified and practically sound. \nMay you both get what you deserve 🙌🏻",
        "North Indian females are not comfortable in front of a male gynaecologist, so why make it a fuss about gender.\nEither join a government hospital or amedical college or go to places like West Bengal.",
        "> root canal \n\nwrong. \n\nthe only time general anesthesia is used is for major jaw surgery or when extracting very complicated impacted 3rd molars [usually people do it when they do 4 of them at the same time]\n\neven for normal impaction, LA is sufficient.",
        "The hospital will look to hire doctors whose merit meets a certain standard and they also want the patients to be comfortable with the doctor. Why would they prioritize you if a lot of women have a strong preference for a female gynacologist?\nIf you have any problem with their preference, then ask the female patients in the whole region why they don't want to show their private parts to a male gynacologist and convince them. If they don't mind getting checked at a male gynacologist, the hospital will be ready to hire you.\nYou have anger towards the patients for not prefering you and you're directing that towards the hospitals, which are just trying to meet the demand of the patients in the region.\nYou're playing the victim even though you've willingly become a gynacologist despite being aware of the lack of demand for male gynacologists and now you have a surprised pikachu face.\nStop b****ing on others for your own reckless life decisions.",
        "Patients choice and perspective does matter. But also remember it you are highly skilled, patients will come to you. Ask yourself what's ur USP. \nAQUIRE NEW SKILLS, do fellowship/ super speciality course- if necessary move to a tier two city, where few possess your skills\n\nAll the best",
        "Bhai ek baat bolu, leave this country.",
        "Even so, she is not going to be seeing a midwife for all her prenatal appointments. And she chose to have male doctors when she could have easily picked female doctors.",
        "\"A regular woman\"... implying, what, SA victims aren't regular women? Besides your *very* off wording, I have not been SAed but I would very much want there to be a woman present if my gyeno is a male. Why are you so adamant that women shouldn't be comfortable in such vulnerable positions? Why is this concept so \"weird\" to you? Honestly a very strange stance...",
        "Are you incapable of critical thinking?",
        "You are incapable of critical thinking\n\nBlanket banning anyone on the basis of gender, religion, caste, sexual orientation etc is discrimination.\n\nThe reason being that these are things not under the control of the individual.\n\nMaybe read EEO laws of the USA before jumping to personal attacks eh ?",
        "Sorry for the wording, you really attack this now? I ment it in a way from a statistical group. It's not \"very\" off wording. English is also not my first language.\n\nWhy is it weird? Because we can have a whole country without this concept at all. It seems sexist to me.",
        "Using somebody else's comment to drive the point through :\n\n>But the logic is easy to understand and needs no explanation. This is why discrimination laws exists. You will be always have a harder time with someone who has an indian name and looks indian, it still is discrimination to not give an indian person a job here in Germany or not give them a place to live because of that. \n\n>That‘s the point, there may be reasons, but you have to ignore them!",
        "The reason they are working in govt setup ,they didn't find jobs too\nMost government hospital has male gynaecologist as hou and hod , my college has....",
        "You know,why you took obgy ,creep ,just don't deny that and rant about how hard u work , you would have took surgery, anesthesia,entry ,opthal or other ms branch",
        "alright but the fact that most girls complain about the gyne being male doesn't change lol",
        "Don't act like a 15 yrs old, what is your age?",
        "This is horrible.",
        "Really not much of a choice.She was told which doctors to use by the Firm/Queen, who also used those doctors.  Meagan on the other hand, did indeed choose her own doctors; women.",
        "It seems sexist to you that women want to feel comfortable when having their genitalia on display? Okay.",
        "No. Why you take one part of what i said and combine it like that. You not discussing in good faith, i saw your other comments. You just want to \"win\" with arguments. This communication is over with you :)",
        "Meanwhile the 50 female obsgyn (Zero male gynacs)  exclusively employed by Artemis, max saket, fmri gurgaon, ck birla gurgaon would beg to disagree and would also like to tell you that their muhurat delivery c-section rates start from 2 lakhs cash payable directly to the doctor under the table out of which 20% cut is given to anesthesia to manage ot schedule.",
        "dont change the topic, i am 19",
        "Since you have no idea about how medical system works let me break it down for you\n \n1. Obgyn is an end branch which means I don’t have to study for 3 more years to get a specialisation unlike surgery where it is mandatory to get a super speciality degree.\n2. Anaesthesia is the lowest branch in the hierarchy of clinical branches, so simply put in layman language, why would anyone go for chemical engineering when they are getting CSE?\n3. Ophthal is highly saturated with even lesser job opportunities.\n\nDo your homework before calling anyone names. That’s just your perverted mindset and shows your upbringing. Since you couldn’t crack the medical entrance exams, you are just projecting out your insecurities on others.",
        "Username checks out",
        "Do you have any idea about how an operation theatre operates? There are atleast 15 staff members continuously in the other when the patient is under anesthesia and if you think some male doctor is going to try assaulting a patient infront of all his colleagues risking the decades he spent getting where he is, then you have an extremely irrational fear. There have been far more common occurrence of female gynacs slapping the patient during delivery, slutshaming an unmarried female in a crowded opd, doing pervaginal examination on underage girls without consent. And this is all that is have seen the female obgyns do during my training. The way they talk about patients behind closed doors is another level of crass and rude. But sure, go ahead with your sexist notion that male obgyns are there to assault the women every chance they get.",
        "Did he have a female chaperone present with him? No male doctor would risk his career examining a female without the presence of a female chaperone",
        "Do you think he would have a passion for seeing vulvas. Obgyn is one of the most magical branches where you get the privilege of bringing life into this world and helping a family achieve their dream. The surgeries are extremely rewarding and interesting for someone with an inclination for surgery. But someone with a perverted mind like you wont get that. You definitely need to go talk to a psychologist for these extremely disturbing thoughts",
        "They slap patients, abuse them , some have even refused to see the patient because they’re not in the mood. Slutshaming unmarried females who are sexually active is a norm. But i guess all that is fine as long as the doctor isn’t a guy",
        "We're not talking about operation theatres here, are we? The question was about a dentist, who will at max have 2 assistants whom he can easily send out on some tasks. Also, I did not cook up an imaginary r@pe situation in my head, it has happened several times, been reported in the newspaper, that's how I came to know that \"okay, abse is cheez ka bhi dhyaan rakhna hai.\" Also, if the assistant/nurse etc are also male, the odds are stacked against the female patient who is unconscious.\n\nInstead of arguing with me or other girls online and questioning why we don't feel safe being naked before a male gynaec/being unconscious with male doctors, use that energy to fight against rape culture and you might actually see a change in these \"sexist\" notions. \n\nAlso, women bickering/saying something stupid is something that hurts in the moment but we all get over it within an hour. Getting assaulted results in lifelong trauma so don't even try to compare the two incidents or try to point out the supposed \"disadvantages\" of female gynaecs when you also know that those cons do not matter in the long run.",
        "Here is a case of a woman who was raped while undergoing a root canal  procedure -  https://www.google.com/amp/s/m.news24online.com/article/india/rajasthan-horror-dentist-rapes-patient-7-times-after-clicking-her-explicit-images-while-treatment/230877/amp\n\nIt doesn't matter what the \"official\" procedure is, a person with malicious intentions can inject the patient with any substance under the guise of performing a regular procedure.",
        "Bold of you to assume that I’m not doing my best to improve the conditions for female patients in real life.",
        "Bold of you to assume that complete strangers on the internet are \"sexist\" merely bcuz they were trying to explain to OP that the hiring decisions were in part, due to society/patients' comfort and probably not bcuz of the hospital itself. You assume others are sexist, others will also assume you are sexist, simple :)",
        "Yes, that's what I expect when you run out of arguments.",
        "You see, you just want to win. I stay to it, it‘s sexist and one day, indian society will not need it.",
        "Sorry OP but you sound so tone deaf. I am a woman. I do not want a man that is not my partner seeing or touching my genitals, it is really as simple as that. You say you want to work with women, but you do not understand something so simple. I also do not want a 'female attendant' there, it is just one extra person, I do not want two random people to look at my vagina etc., one is bad enough. It is worrying that you are not willing to understand this. This is not about what you want, it is about what patients want.",
        "The situation in the past was bad for women, they were treated - often very badly - by male doctors. Now the situation has improved immensely because female doctors are available and the vast majority of women prefer them. Re: Kate, she absolutely gets no say in the hospital or doctor, it is all decided by men that make decisions for her.",
        "Unfortunately no, he didn't request any female nurses but he did leave the door wide open when I started discussing my issues.",
        "Try to find an ObGyn who specializes in conditions like endometriosis, fibroids, PCOS, etc. There are a few empowered ObGyns in Delhi etc. that post about these topics and the importance of listening to their patients. I can’t think of the accounts off the top of my head cuz I follow many ObGyns globally. But I suggest asking a regional  subReddit in your area for ObGyn recommendations for your XYZ symptoms"
    ],
    "cleaned_text": "corporate hospitals delhi ncr denying job gender still recruiting basis gender specially medical field field important prioritize qualifications gender human lives stake compromises made proud male gynecologist ive dedicated years life studying training learning empathetic towards patients providing highquality care would like share experiences big corporations specially northern parts indiadenied job basis merit merely basis gender despite obsession male child hiring male gynaecologist still forbidden concept delhi ncr part several groups whatsapp notify requirement gynaecologists contact recruiters finish necessary procedures upon informing gender either deny outright ghost stop replying completely seen giving jobs someone less qualified compromising care employ someone competent gender denying jobs male gynaecologists violates basic principles gender equality hiring based qualifications skills experience gender many male gynaecologists know exceptionally qualified capable providing highquality care patients medical professionals regardless gender trained provide sensitive respectful care assure amongst least judgemental bunch gynaecologist discriminating merely basis gender implies lack trust professional capabilities india already facing massive shortage doctors see everyday whatsapp groups drastic gap demand supply qualified doctors top excluding half population field exacerbates problem also reduces access essential healthcare services upholding equality employment opportunities crucial fair effective healthcare system ",
    "cleaned_title": "corporate hospitals delhi ncr denying job gender",
    "cleaned_selftext": "still recruiting basis gender specially medical field field important prioritize qualifications gender human lives stake compromises made proud male gynecologist ive dedicated years life studying training learning empathetic towards patients providing highquality care would like share experiences big corporations specially northern parts indiadenied job basis merit merely basis gender despite obsession male child hiring male gynaecologist still forbidden concept delhi ncr part several groups whatsapp notify requirement gynaecologists contact recruiters finish necessary procedures upon informing gender either deny outright ghost stop replying completely seen giving jobs someone less qualified compromising care employ someone competent gender denying jobs male gynaecologists violates basic principles gender equality hiring based qualifications skills experience gender many male gynaecologists know exceptionally qualified capable providing highquality care patients medical professionals regardless gender trained provide sensitive respectful care assure amongst least judgemental bunch gynaecologist discriminating merely basis gender implies lack trust professional capabilities india already facing massive shortage doctors see everyday whatsapp groups drastic gap demand supply qualified doctors top excluding half population field exacerbates problem also reduces access essential healthcare services upholding equality employment opportunities crucial fair effective healthcare system",
    "cleaned_comments": "really shameful scenario expect hospital like medanta lets face reality many inlaws comfortable bahu opening legs male gyno usually hospital also get rich conservative people lot guess assumed newbie hence rejection still doesnt justify amount experience still experiencing discriminatory behavior crazy power op youre able start applying jobs foreign countries specialty high demand might case duty require care female patients best handled female doctor comfoet patient bro playing real life doctor g female patients india feel uncomfortable male gynaecologist checkups better look opportunities field countries gender norms traditional india hesitate little bit female patients complain judged respective gynaecologists anonymous posts reddit job everyone knows female attendant present times mandatory examined male doctor never hesitate sed ed ncert read messages hes gynaecologist bro try private practice home city male gynaecologists city good mean dont get much attention patients female doctors know able successfully run practice also try rich liberal areas rural areas people know trust conservative families never send women male gynae years especially someone dont know trust applied dominos pizzahut outlets frontend desk jobs rejected saying wanted females cant harassed easily customers common practice hire females easily dealth compared males bro talking delhi ncr medanta apollo cloud nine possibility sexual assault main issue indian women dont feel comfortable explaining menstrual reproductive health problems man isnt partner conservative especially inlaws would rather receive treatment visit male gyno country openminded yet take years sexual education society get rid mindset thank bro telling good soul like guiding illiterate people like clouds darkness would like perhaps contest elections someday might way much inclined vote provided enlightenment doctors job provide good quality treatment caring handling female patients done nursing staff theres always going female attendant present times doctor examining patient guidelines mentioned code conduct crazy big corporate hospitals mint money smallest things yet wont provide doctors equal opportunities despite significant shortage qualified doctors continue deny qualified individuals access basic rights support orthodox mindset even really shameful hi im doctor given choice male female obg family members ill always always choose female obg friends hate gender personal preference much comfortable female parts examined females thats world currently honestly one ik comfortable male gynaecologist sorry actually mean problem wont able complain gnaw frontdesk thats wrong always try squeeze every ounce money companybrand something wrong equal rights equal fights justifying username guess time night cant comprehend simple sentences fault friend alcohol brain depressant would like simply since slow meant rich families able spend lacs rupees deliveries stuff since even health insurances dont cover maternity benefits middle class peeps would rather go nearby nursing home real th class girl year ago tuition asked girl beside answer biology test question related menstruation answered word word look face wasnot nice like boy arent invited understand patients perspective hospital doesnt want imagine put night duty patient comes says comfortable treated male gynec call female gynec stand substitute days work sexual harassment girl might worried overall patient comfortable argue much ever want practical aspects life basic human feelings lol would agreed jobs gyno lol demandsupply majority people even explicitly ask least prefer female gynec doesnt matter say seen similar thing happen somewhere worked male gynae doctor extremely skilled experienced nearing retirement woman would feel uncomfortable examined government set end day didnt much say always bit hesitation idk route want take male gynacs dont face much problem govt setups medical field doesnt work bro ki apply kia job mil jaye know medical licensing different countries go fellowship programs exactly write coherent brain understand maybe soberness little much well agree health insurance part sentence helps also gave guy pathway understanding society condition ps insert mild cuss word change attention thank medical professionals regardless gender trained provide sensitive respectful care also female patients complain judged respective gynaecologists clearly training doesnt mean much patient pov reasonable assume even women gynaecs judgmental male ones probably even especially culture patient know youre creep judgmental etc youre wrong specialization wrong place wrong time said hospital also wrong hire youre male gynaec arent roles line specialization directly interacting patients perhaps diagnosis based tests managing gynaec dept research etc bhai desh chhod dusri desh achhi payment leke naukri kar lo india ke g pe laat padegi na tab saari hekadi nikal aayegi future ur male gynecologist please try understand female want male gyno r fair ask female gyno internship told go away female patient gyne department seen male residents check ups patients okay people comments acting like still think north south ka problem h south people educated ki doctor hai chahe male ho ya female person know female chose medanta female gynecologist exact reasons honest would probably would comfortable male gynecologist female male hell return time fir se vohi problem shes cute kind whats number man chose fighting prerogative dont find anything compelling say higher probability creep okay bad move part drop would better cant complain patient partnersrelatives uncomfortable try change mentality india think youre better working somewhere comfortable male gynac wouldnt need gynaecologist tho money shameful wrote try rich liberal areas thats sharing experiences coherent brain works fine guess keeps forgetting exactly wrote try taking thiamine supplements dont want precipitate wernickes encephalopathy think meant say male andrologist specialize male reproductive health comfortable going female doc circumcision bro might like hear country like india except maybe particular cities localities people always prefer female gyno male one happy simply detest hint sexism job hunting thats harsh truth take eons eons awareness change peoples pov sexual health even think change im curious made want become gynaecologist male would ask question woman became andrologist yes ordinary see posts male doctors disregarding concerns turn serious later saying everyone like though liberal countrys prejudice male gynos still youre living india uphill battle whether like im really sorry arent accepting open enough matter alas dont find anything compelling say higher probability creep okay read times couldnt understand could simplify dont trust enough see manufacturing mein ghusna shuru karo wouldnt comfortable consulting male gynaecologist people know wont comfortable male gynecologist go trans brothen cant technically deny assuming trolling applying whatsapp really grow female patients dont want see male gynaecologist hospitals wont pay sit around set practice proud irrelevant actually trolling whatever urologists common neighbours kid modern day feminism sicko feminazis spread propoganda rule world man im dumb reminded made similar mistake reason forgot wombs thought woman pregnant baby stomach choose apply somewhere else would want gynac woman safer side take l lil bro wouldnt want wife mother sister checked male gyno sucks unfair people right choose get care remember ethics classes medschool drilled patient autonomy applies cases person might refuse care sorts reasons could racist saying dont want doctor colour could orthodox person based religion social beliefs etc sadly personally couldnt give shits gender gynae thats case everyone u could chosen better career women wouldnt comfortable male gyno saying right understand women dont prefer male gynecologist woman going male gynac wouldnt first choice tbh doubt discrimination like supply demand situation females look female gynac difficult get previous jobs well something change theres nothing feminism indian women comfortable around male gynaecologist fact anything try gangaram fix go private practice move us doctors mint money post specialization gynecology demanding discipline high career financial prospects theres use begging chance showcase potential nations ready look beyond gender bring table wonder others like opinion female urologist discrimated upon coz male patients comfortable remember going see male general physician small lump underarm literally ok check uncomfortable checkups told see gynecologist didnt even need undressing wore sleeveless top confused gynac might female issue didnt seem like gynecology issue aur lado maja aaria h going trans okyou always switch back case cant anything male patient comfortable female doctor request male doctor simple least makes sense gynecologist got rejected twice im clinics wanted female dentists wtf internship og unit male chief one best maybe theyre corporate gynecologists know male good job tbh even hospitals cant anything goodluck private practice think thats similar situation female patients husbandparents wouldnt want male dentists close open mouths lmao everywhere normal casual women prefer women gynaecological tests first preference always woman bro screwed proud male gynecologist mean ur fault females feel uncomfortable thats prob rejected u gyne one roles preference gender kind important patients comfort may already male doctors india women may prefer women theres enough currently come kolkata dont strong notions doctors skillset matters gender reminds film dr g seriously dont think thats well known branch india rhalloffame dont know practicing andrologist circle mean urologist research corporate hospitals enough said isnt gynaec considered worst department medical colleges hospitals female gynaec doctors nurses treat people like shit ive heard people dont even want walk near area idea male gynaecs bro learnt good clinical practice thoroughly seems didnt also make movie male gynec life screwed hell earn lesser mbbs doctor even first reason get department bro many female would prefer female doctor male examining plus guys wont let wife go male gynae wonder tesla thriving elon musk balls fire workforce included diversity hiring thus ensuring best retained rather indias moronic system quotasreservations etc female urologist skilled rural areas people know trust ahn wont heard tales going wrong count banned girls mining ideally equal rights law enforcement weak even risk first place residency lol usa regard indias pg degree relevant post seems like youre pissed trying make equality news canceled media due chauvinism bro come kolkata extremely open minded city women go male gynaecs theres discrimination relevant justifying stance corporate hospitals heavy investor stocks hospitals got defend sound logic news outlets blame news dont let misleading news stuff blind think wisely see perspectives good advice yeah man see thing people open minded enough parts india dont know kolkata didnt say good know kolkata also discriminating doctors male gynaecologist mean cant judgemental hell patients perspective youre likely even judgemental im saying right reality thought wouldnt start newspaper company age digital era knowing wont well would thats sad tough luck op sorry sympathy male obgyns choice become specialty chose one field man know bad theory change gender legally requires atleast years involves lot steps verified proof go dear mongering misinformation hello bhaiya fellow dentist really hope people future generations understand reality hardships medical careers sometimes obsession people even younger generation really despises hope find good lead soon whatsapp used hiring medical field screenshots look legitimate privilege really proper nationalised healthcare like uk wouldnt really choice doctor would unfortunate happens like commentors said might country look job india conservative political communal situation might progressively become conservative also asianindian stigma women overcome go male gynae know women life always preferred women gynae couple fazed male gynae much dont want say slim chance prosper field india would love prove wrong might better building career country accepted come back india experience would assume hospitals dont see good business give job privat practice eventually need invest gains slow since people scroll away seeing male gynae list dont lose hope dont let situation pull know whats like india fighting stigma strong may ideal way forward depending whatever situation life problem try circumvent solutions afford gain experience dont know expecting tbh living india male still going gynaec specialization id inclined believe total utter creep female attendant present mandatory funny rule im german tho girl live delhi would prefer female gynaecologist day delhi famous women safety top think ill feel comfortable going male gynaecologist know female attendant always still big female gynaecologist comfort zone sorry sounded rude germany opposite complain haha man many friends told experience reddit many woman say female doctors sometimes less respect harsh dont weak im woman attitude male doctors often seen nicer bro irrelevant post please share contact hr using need apply sr gen surg im glad somebody gets easy nurses move abroad doctors difficult male female surgeons taught ways circumcision assure female doctor seen several male genitalia way male doctor seen several female genitalia atleast medical profession interest choose gynaecology specialisation dozens options choose mean nothing male gynaecologists general irrefutable fact lot women india even abroad feel bit uncomfortable male gynaecologists unfortunately forgive ignorance implying people uk dont choice possible reason think feel male doctors perverts male logic arent perv well doctors whether male female taught human anatomy physiology theyre trained treat care humans man woman read comments would like clarify things chosen different field taken drop opt something else clearly none know medical education works worked arse clear qualifying exam went med school half years mbbs spent golden years studying post graduations getting seat neetpg hard enough grateful majority population busy enjoying spent time working really hard achieve goals really dont regrets bring bad luck upon choosing field patronising man starts mansplaining half population would offended focus discussion promoting equality workplace denying anyone jobs stigma around male gynaecologistwhy choose become male gynaecologist guidementor male gynaecologist interviewed famous media houses film inspired similar topic released hod department male gynaecologist let clear biased extremely good jobs compared female counterparts compulsory rotation every department internship rotation obgyn feelings experienced delivering babies bringing joys families nothing short heroic chose field always go another specialisation actually seen opposite posts women gynae usually judgemental prefer male ones yeah u r right doctor g movie good representation problem kuchi bhi going trans doesnt take years confusing full transformation bro put wig tuck kelagotti wear dress start behaving like chick dont overthink bro yes nonclinical degree would suffice comfortable male gynaecologist half said arent comfortable male examining us one even questioned character fair enough let clear bound medical ethics abide rules examine one without consent mentioned earlier always examine presence female attendant dont wake everyday intention taking undue advantages patients dont shit eat cant put whole career jeopardy risk license cancelled minutes pleasure females likely exploited friends relatives coworkers bosses doctors doctors crossing boundaries relatively unheard cant explain issues openly spent half life studying diseases pertaining female anatomy believe would one individuals would openly understand concerns like partner inlaws female wellbeing foreign concept qualified enough crack code open private practice plan every doctor wants open practice certain amount time cant directly jump need think opening practice isnt cakewalk put everything consideration get fetal medicine look fellowship good pay better non emergency lifestyle minimal gender bias idea reduce chances asault misdemeanor kind one extreme simply making patient feel comfortable even arrested female female police officer wasnt rajesh koothrappali father gynocologist wonder faced problems lol even another medical specialisation viable doctors mbbs even mire diagnostics based gynaecology instead direct patient consultation would great sounds also weird thanks explanation agree mean take md anatomyphysiologybiochemistry take job professor believe still pretty backwards lot aspects nation seen islamic scholars state speech huge crowd asking go male gyno last resort pretty sure lot general population similar consensus seen people bashing selecting gyno thats pretty shit blame attitude public instead ideally doctor shouldnt based gender kuchh nahi guy chose pursue passion interest wish op best tears eyes leave pursuit becoming obgyn even though know id probably best obgyn nothing else ever makes sense guess cant things want life last checked way earn shame ethics attached op abhi kahin aur ghusna shuru kar raha hai posts gynaecologists female know wont posts male gynaecologists usually older doctors conservative upbringing would expect similar judgement male doctors similar upbringing top extra chance creeps theyre justifying presume everyone perverted bro go canada youll worshipped whole country consider soninlaw dont consult online setup clinic pg got around lpm must saving visit rural areas class town try set something go normal delivery rather operation start kind awareness program instagram youtube comfortable male gynecologists thats main reason might thought studying cant change way people think overnight also clinics hospitals running business know market works want female gynecologist debate want theres point prejudices extremely good jobs compared female counterparts defend profession without putting women say theyre good gynecologists leave im sorry youre trouble finding job ok youre hired man could hod mentor guide places hiring since must practicing male gynobs love comes men women expect progressive understanding comes say theyre comfortable sharing private parts issues person whos literally relevant actually talk hes man yo regardless almost always going happen uncomfortable around male gynae get usg done pcod quite experienced rid kind judgement helped ton try ignore judgements ofc theres tons female gynaes unnecessarily judgemental something hampers patients ideal behaviour maybe try put point across idk would help maybe might hope land huge gig soon good luck usually im gender equality womengirls included comfortable male gynac think fair enough theres many cases rpe male gynacs well lets go onto topic girl imma say u may good u man want u man gynac neither women like even trust u uncomfortable af many career options chose dont shit eat cant put whole career jeopardy risk license cancelled minutes pleasure kinda concerning stance isnt wouldnt assault patients thats heinous behavior eh notnworth probably qualified enough crack code people say dont feel comfortable explaining issues man theyre doubting qualifications theyre reticent due social cultural norms b regardless training lived experience patient organs hormonal axis treating get youre frustrated response expected dont need defend redditors like know great dont know doubtful take lite terrible choice specialty conservativeculturallybackward country indigo also hires female flight attendants openly advertise magazines obvious would want female gynecologist india apologise friend understand much qualified yet broader society still ready accept would never go male gynac unless absolutely option ngl dont know woman would irl either lmaooo offence doctor replies men may give female perspective would visit male gynec er infact visited one months ago definitely comfortable vaginal delivery years ago still appointments scare pap smear embryo cycle routine vaginal us nothing comfortable even female doctors would ok visit male gynec emergency routine personally know woman lost baby miscarriage want visit male gynec er lives sweden cute women feel comfortable female gynae thats want start saying truly sympathize situation doc let clear bound medical ethics abide rules however woman want point shouldnt take womens hesitancy personal jab sadly binding medical ethics havent stopped certain male docs abusing power mistreating female patients past naturally women buy reason nothing personal self preservation kicks women would rather opt prevention cure pun intended think things would lot different male gynecologist young woman country india low crimes women men youre saying women doctors bad compared male doctors im doctor even wont comfortable going male doctor firstly dont get women problems second risk assaulted highly agreed read sorts horror stories many female patients lot male doctors treated mean least brains go field specifically theres reason women always prefer women comes discussin intimate matters would company want go losses women opt treated women unless really emergency may creep perception understandable woman stuff experienced men ive met personally wouldnt go male gyne personal opinion sorry mam said offended wrong way ofcourse wouldnt assaulting anyone completely abhorrent disgusting thing respect females working department respect females increased many folds b regardless training lived experience patient organs hormonal axis treating may experience hormonal axis trained compassionate enough hear problems provide correct solutions ok understand fair enough yeah mean doc points gender discrimination saying put lot care got education worth years would men seriously like put highly qualified best super experienced female umpire charge mens cricket world cup final high stress fields emotions stigmas attached medical field based gender looks instead qualifications everyone would worry absolutely long skilled job wouldnt even doubt second excuse mam havent mentioned female doctors bad thats assumption compared mentor hod coworkers please dont put words mouth compare two things completely natural one slightly superior doesnt mean thing compared bad honestly happy able take specialization field found passion im pregnant right live abroad ive nightmare symptoms taken seriously male gynacs theres always two sides story secondly please understand cultural context course preference female gynacs see plenty well established male gynacs long term youll fare better especially obst thirdly youre getting recruiter seriously trouble youre highlighting hospital wont hard supervisors understand person charge male doctors superior honestly would try recommending practicing europe countries lets say czech republic example care skilled job anything else havent seen preferences choosing doctors try making connections going fellowships wanted emphasise eventhough people west dont mind male gynaecologist absolutely right consultask different physician arent comfortable except emergencies even nationalized healthcare systems like nhs mam way putting one anyone put commentators even assassinated character without even knowing dont show world whether respect women people around importantly patients earned hardwork know free space sharing experiences spread legs would refer family member visiting gynac honestly yes seems north indian thing usually south gender isnt issue least parts interesting conversely would men problem going female urologistsexual health doctor nope two separate girls told always prefer male gynos female say female gynos judgemental shamelessly start intruding personal stuff valid reason male gynos lot cognizant talk patients generally never get uncomfortable conversations absolutely backlog appointments usually makes tricky situation think times book new appointment im wrong redditors please correct im wrong mam mention male doctors superior would like request reread reply talking two groups coworkers nothing gender would quite ironic since facing similar discriminatory situation maybe code conduct followed ideal india currently heck brother girls whore open stuff tell actually prefer male gynos dont act judgemental get uncomfortable conversations like older female gynos hmm woman completely empathize however hospital seems complying needs society since make profits also possible find successful male gynaecologists speak overcame good wife prefers female gynac many women ultimately thats decides whether get job become ortho surgeon theyre bringing moolah unlike gynaecologists dentists treat people genders would matter fact anyone would know whether judgemental given chance gender shouldnt hiring based skills gender always consider getting judged random lady dr get raped man yeah right dr prefix given irrespective gender equivalent gender would rather look qualifications degrees true hiring someone useful situation possibility however small woman patient may refuse male dentist hire women never prepare contingency cant imagine guy refuse woman dentist clear dont condone hiring practices pov business prioritises profits see logic stupid advice helps one woman ive never taken seriously general doctors endocrinologists thyroid talk severe mood swings male theyve recommended take vitamin panel tests prescribe vitamin iron supplements didnt understand affects life tried tell normal endure live lose rationality half month corona felt shortness breath endured talking male general doctor talk properly laughed face told put stethoscope observed changed face admitted exactly wanted curse didnt want create scene left dont wan na go male general doctor treat small things like fever would emergency hell thing fact say female doctors better also dont take mood swings seriously recommend birth control pills care irregular periods least dont laugh symptoms lecture yoga dont think ill ever go male gynaecologist dont know theyll listen symptoms take seriously going dismiss saying happens every female dude set abortion clinic top cities india market liberal non judgemental person would definitely get lot clients especially premarital sex rise could logic almost anything discrimination plain simple wonder people would react gender replaced castereligion scenario shouldnt female umpires understanding logic pretty sure logic used discriminate minorities country indian men blame gender entire female gender horrible umpires decision think wrong get harassed left right doctor sahab argue faces discrimination primarily diagnostic judgement oriented really intimate purely female focused environment obviously female umpire anytime soon girl besties girls idk sort girls hang fam opened comfortable visiting male gynos stop fabricating shit girls fun fact nobody talks something fishy always happens nurses docters nightu know wat mean haha maybe look opportunities government hospitals seen male ob gyn govt hospitals bank america also hires questionable women qualified males common india woke culture hi im obgyn eu shocked hospitals responses even majority comments horrible mentality sorry happening syndicates ongyn associations could complain could see legal action hospitals worked public hospitals refuse care male physician quickly shown door refused care whole staff would talk like raised woods everyone saying chose wrong career path etc shame youre disgrace indian men blame gender entire female gender horrib sure thats issue cricketing body explicitly hire women umpires match thats question obviously female umpire anytime soon yes okay people used say things women started serving army arent women successfully serving army cant fight discrimination discrimination win thats whole point wait minutes let someone post story girl raped left pregnant entire crowd pounce call fake pregnant belly get experience ngo type hospitals save enough start clinic obgyn intimate field personally would net want discuss issues man played male dominated sport boys never really faced issue ever intimate field lets say umpiring open public naturally men upper hand subreddit sympathises men ideas concepts dont know ground reality accuses women sorts things whenever news regarding circulate man woman issue intimate problems much demand supply issue obgyn intimate field personally would net want discuss issues man fine personal choice matters know people wont eat vegetarian food non veg hotels believe plates get mixed impure institution able outrightly hire males females whatever thats textbook discrimination much demand supply issue always demand supply issue number ob gyns less would get hired instance lets say umpiring open public naturally men upper hand need provide accommodations women like giving matches evening matches etc serious question considering scenario didnt specialization situation hasnt arisen overnight sudden rebel without cause change whole society thinking change mindsets male gynaecologist truly dont understand would put leg axe please help understand made life difficult like india backward australia laws ive read stories male dentists drugging patients assaulting convince fellow men self control maybe wont preferences women gynecologistsdentistsmorticians etc one said outright yaar preferential provide accomodations dont watch cricket please grow realise women preference field came existence women always issues men understanding dismissing pain wonder take female doctors doctors brutal women throughout centuries im convinced youre one day youll walk real world good luck keep inquisitive one said outright yaar preferential provide accomodations dont watch cricket please grow realise women preference field came existence women always issues men understanding dismissing pain wonder take female doctors doctors brutal women throughout centuries im convinced youre one day youll walk real world good luck keep inquisitive one said outright yaar preferential provide accomodations dont watch cricket please grow realise women preference field came existence women always issues men understanding dismissing pain wonder take female doctors doctors brutal women throughout centuries im convinced youre one day youll walk real world good luck keep inquisitive provide accomodations dont watch cricket accommodations provided cricket board spectators one said outright yaar preferential talking hospital outright rejecting men difficult understand please grow realise women preference field came existence women always mention personal choice wrong dont even seem reading replies im convinced youre one day youll walk real world good luck keep inquisitive try much older homeboy thinks hes spitting facts crude uncultured af read replied exactly know would hospital want kill demand naturally mentioned female male applicants dont bother hardwork submitting resums formalities isnt outrightly discriminating anyone one questioned expertise expertise supply men watch womens world cup much watch mens nope naturally sponsor like dream invest mens team doesnt mean women arent good enough fun discussion tho would hospital want kill demand logic could extended hiring minorities since lot people india would want someone religion treat okay hospital outright rejecting minorities one questioned expertise expertise supply depends maybe earlier years go cities like kolkata tier city hope best competition much less maybe could switch private practice mumbai decade expertise gynaecology definitely demand naturally sponsor like dream invest mens team doesnt mean women arent good enough talking men women sports thats whole new discussion okay continuing umpire discussion want fact make comment unable properly acknowledge female patients would prefer female doctor proves point im sure lot woman happy dont male doctor cant sympathize sympathize though tough finding job especially long expansive studies mean gyne wtf expect written satire people think visiting male gybac uncultured taboo apply jobs outside india demand qualified healthcare professionals extreme youll get paid x get paid exactly sounds funny logical move af polite cultured male doctors dont get uncomfortable convos utopia india mein hat doctor male ya female usually judgemental hi hota hai people would react criteria made difference comfort patient wonder people would react discrimination comfort youre paying service allowed choose exactly want theres discrimination youre making personal choices health lol discrimination individual doesnt go discriminatory institution would feel software company refuses hire race example male gynecologists know infertility gynec oncology basic reading comprehension af used accentuate crudeness unculturedness statement unlike wannabe edgy one also really think pointing irony something cause use phrase p nice job edit atleast bullshit youre making case dont dont need bit sexist dude job studied job didnt predator ok understand women sad past trauma intimately vulnerable men trauma doesnt care sexism whatever ism guys dont care womens mental well especially women sexually harassed past problem guys dont women shelters either da victims wouldnt surprised lmao name equality making lives harder women also particularly private clinics delhi ncr middle east ask female dermatologists advertisements argument makes sense woman doctors exist sa victims go whatever gender comfortable regular woman goes doc doesnt need woman care lot actually seem aggressive downvoted discrimination isnt illegal discriminate india appropriateloghttpswwwredditcomuserappropriatelog sad also way know true reason anything else time hospital hr give shit like need exp need lower salary expectation etc foolish honest reason sort discrimination widespread among doctors also like nurses professor people always remain silent happens suggest slowly setup get posted wherever save money parallel start long term depending hospital risk use reason anytime want would suggest u took look states maharashtra like ladies prefer male gynech good female one less discrimination gender basis agree wrong country keep defending going change peoples mindset take years happen male ob currently pregnant second baby amazing first pregnancy however live canada less stigma female obs office worse reviews amazing reviews ratemds despite female organs capable showing empathy believe dude know fully capable job probably good wrong place wrong time chose wrong profession buddy difficult india try move abroad outside india well gynaecologists hospital females live west idk read every text word doc bugs bunny voice hope u find job soon yea male gyne india tough friends dad exclusively hires female dentists theyre less likely become competition opening clinic nearby well gynaecologist sensitive area mainly female practice customers female yeah chandigarh kare ashiqui think may bala completely blaming wouldnt want wife go male gynaecologist well think female andrologists would quite popular yes personally bike crash hurt testicles asked male doctor thought showing bruised balls woman kinda felt embarrassing knew male doctor would understand kind intimate medical issues always dealt similar gender doctor atleast empathise lots women uncomfortable male gynaec specifically call find hospitalclinic near female gynaec dont think company discriminatory like know requirements patients trying cater argue stereotypes doctor doctor hota hai qualified etc make someone comfortable cases recently male dentists gave anesthesia patients rped reading cases dad started accompanying dentist told hes available day visit female dentist instead idk others possible people also concerns conrrol happens youre anaesthesia guys getting screwed bcuz actions men bcuz employers discriminatory diagnostic center ncr yesterday waiting ultrasound lady came level pregnancy ultrasound didnt go ahead didnt female doctor conduct ultrasound hospital patients dont want male doc ayushman khuranna ki movie thi na ispe case men ruin things men especially true indian men sure might never misuse position would never assault anyone statistically odds arent looking good patients worsened fact women gynaecologists would simply issue entirely lot indian men fucking animals many women might uncomfortable around men general let alone male gynacologist unfair least understand remove female doctors checking males well isnt double standard goes ways male patient hardly ever prefers female urologist similarly woman prefers female gynaecologist really question comfort medical field immune diseases malefemale body parts forget people uncomfortable female doctor would still prefer getting checked female gynaecologist thats youd see urologists male really point blaming hospitals fault tricky slightly gender biased speciality branch bro didnt know big problemi girl visited almost gynecologists male rural areas town thought th century dont lose hopebut try private hospital congratulations played bro nothing woman living us said style would assume women like id say gather resources leave india country shithole mentality wont recognise talent hardwork busy rotting age old social norms yaar mam going logic vets jobs human make animals comfortable breast surgeonsoncologists male chose super specialise field despite breast cancer leading cause cancer females women shouldnt consult breast surgeon since majority males going understand issues dont organ first place case ever felt need drill female patients way think vet logic really ignorant nonsensical comment anyway gynaecologists first doctors female goes reproductive issues first goes particular doctor shed want comfortable choose female time another doctor diagnoses breast cancer definitely go whoever best think theres certain difference oncosurgeon gynaecologist nevertheless personal opinion clearly see question comfort individual patient question worthy sure capable doctor field biased like urology oh god relate much went male gynae first super extremely uncomfortable unsafe dude try help mom didnt like pulled one visit took female gynae female gynae says oh normal period pain itll go away get married child mind extremely painful normal pretty much immobile pain losing consciousness know women dont get taken seriously normal live much pain experience tho female male doctors except one male gynae actually tried help one good ones id put name dont remember cause mom pulled one visit pretty much avoid doctors chug painkillers survive still undiagnosed id rather suffer waste money told itll go away marry bitch supposed wait misery knight shining armour comes wtf kinda crap sheer absurdity statement ugh even mood swings depression high end anxiety etc extreme weeks fucks quality life doctors dont take seriously sucks finding good gynae male female like looking needle haystack hey understand pain doctor wife already shyuncomfortable gynaec checkup female doc would fainthave panic attack thought male doc examining clearly confided situation professional logic thrown window emotions take nonideal acceptable solution male gynaec acquantainces done become gynaec oncosurgeons get complex referrals operate others etc minimal opd interactionspv examinations patients robotic gynaec lap gynaec gynaec oncology surgeries big hospitals r done admitting doctor superspecialist called typical feminazi cry hired ortho surgeon need days every month real woman stop denigrating male gender thats miss calcutta one open minded liberal cities north india professional pussy examiner male gynec delivered elder sister cousins late nineties already fifties well reputed daughter also gynaec second choice mom felt inexperienced thats patients care end day experienced female gynaecs obviously topmost priority unfortunately believe reputation years experience end day factors location someone said networking building name help male gynaecs another decade seems good way forward good luck im women one best gynaecologist ive come across male gynaecologist non judgemental actually valued opinion talked pain pain management fertility like gynaecologist ive visited dentistry involves local anaesthesia see gender discrimination illegal happening women truly marvel modern society lol levels sexism uncle looks patients comfortable male gynaecologists lol discrimination race skin color know dark people want light doctors hospitals hire light skinned doctors areas still lot gender bias society increasing current religiosociopolitical scenario people prefer female drs examine female relatives even though women may willing male dr private corporate hospital eye nothing financial bottom line refuse ironically bias work favor male drs mentality states male drs better female ones terms skills seen female colleagues addressed sister meaning nurse havent still works choosing obgyn concerned called educated layman try government hospitals bond complete dont go private practice going tier city good idea metros overcrowded competition definitely females higher probability getting assaulted double standards females males feeling left fucking unfair womp womp bro whats gender thing country rapes prominent absolutely okay right woman go women gynaecs would never go man gynaecs sorry sorry maharashtra mein aao stereotype thoda kam hai even related feminism comfortable male gynaecologist real woman dont go male gynaecologist heights stupidity kisne bola tha gynaecologist banne ko bhai bachpan sir ke bal gir gye kya yeah real female would prefer going female gyno dont understand bias everyone chooses become gyne score determines sometimes score gives option gyne derma dont think would wan na choose derma gyne gyne pays better dont guilt trap male gynes gaslighted asf comment ps gyne even doc pps clearly gender equality welcome india better born cat dog man hope enjoy ur stay eh probably need endocrinologist actually knows shit op put twitter maybe try bangalore bombay gynae ladkiyon ko hi karne de bhai kyu dusro ki field jara koi lady kyu male gynae se karayegi tu apne ghar pe puch koi male gynae pe jayege one worried sexual assault docs cities matter comfort im comfortable going male gynac either female friends one male gynac fair hospital business unfortunately docs get chance choose derma gynae end choosing derma radiodiagnosis dermatology top demand branches btw conservative families wouldnt call conservative partner wont care went male gynae dont feel comfortable couldnt debate logic reason cant really blame hospitals patients either women dont feel comfortable male gynaecologist makes sense fields better work life balance er rounds etc chose wrong example due outdated current medical trends dont want devalue point gender nothing academia profession first stop shaming choosing specialisation horrible worked hard get secondly op nothing personal preference female gynacs negative bias keeping safety centre aware pqe would say get touch practising male gynacs help navigate situation better hospitals would consider doctors patients prefer right im open minded fairly liberal consult gynaec would prefer female doc still doesnt change fact patients choice choose doc friend whos working obstetrician town along wife mbbs pretty well biases common society every domain thought corporate hospital metropolitan culture would evolved sad truth many women india would ostracized consulting male gynecologist many others simply uncomfortable feel predicament cant blame hospitals case simply right patients exactly mean done mbbs yearsdude already idea situationthis choses obgy dude im gon na choose surgery next year obgy never crossed mind convince fellow men say responsible behaviour men try government hospital patients dont choice male female gynaecologist bro give private hospitals even government hospital face discrimination also depends look dress im pretty muscular seeing examining make uncomfortable feminine looking male feminist voice personality helps hardly chance convince fellow men fuck job lol relax man small percentage doctors rapes least america source doctor self colleagues even one rape knowledge im sorry dont appreciate edginess probably upset talking bahu manner least thats bahu told bed last night know women dont generally take time menstruate right applied hr intern role years back knew fit perfectly everything went well hr wanted female candidate equality friends would tell go meet nearby doctor emergency room see many females come blatantly ask certificates show take sick leave etc hospital made mandatory sick leaves issued ms due issue lol question isnt whether mentioned male doctors superior decided make comparison solely based gender think nothing gender think bias actually quite unsubtle showing little someone threw ball right crotch little boy said oooof ouch like huh get back question common problem necessarily universal ive cervix surgery anesthesia started wear know testicular injuries least times painful kind empathetic person gon na kind empathetic regardless gender sometimes dont choice gender doctor better medical care anyone lose testicles young age get cash take usmles move us move kolkata someone suggested fellowship maternal fetal medicine perfectly understandable womans perspective completely empathize safety ensured crimes punished india stark difference knowing someone passing fair judgement simply jumping conclusions moment basing argument solely gender numerous factors involved since worked closely justified opinion would go ask would happily agree said would like repeat disrespecting way immense respect female seniors made today nutured like little brother closest relationship theory something read textbooks understanding female perspective emotions something learnt come south india never seen male gynaecologist facing issue problem obgyn hod male ppl arent hesitant far seen know want look pussy good try buddy isnt gon na take anywhere look honest personally woman comfortable let male gynecologist touch dont trust men obvious reasons thats probably female gynecologists demand india though would surprised common sexual harassment uhh yeah examinations require woman actually spread legs pervert mindset lead would still noble profession would still respected would still make lot money ever would today people like pose risk women hurdle good men say men want nameless faceless perverted trolls like negate points commenters acting like male obgyns never existed history india op became first one think situation years ago always many women going medicine india today field gynecology created male doctor us many decades pediatrics gynecology highest women doctors delivered male gynecologist parents ever expressed reservations choice talking way princess kates children delivered male gynecologists theres anyone ability select exactly doctor wanted see would royal family member lucky women dont sexually harass men much basic economics play patients want female gyno result hospitals wants hire female doctors theyll able generate revenue female patients india comfortable male gynecologist happens north side india worked regions india north south east west years medico north people super judgmental even educated ones regarding doc looks example still looking relative young thanks good genes handled least k thousand plus surgeries consulted double number coming north people still want second opinion another senior looking doctor consulting purposely let hair greyed look seniorolder trend stopped give hopes coz one set back good keep aside capital marketingthe people later come begging doorclinic step though women simply go checkup forced see male gynac point gynaecology speciality better health outcomes women india least youll understand rejected practices understand necessary discrimination cant believe dummies voting youre willing bring solution dont complain problem yeah female gynaecologists also better least ones went didnt say happens every female would hated said seriously didnt prescribe anything also thought due thyroid since already taking medicine said mood swings due thyroid told birth control pills might fuck hormones wont suggest suspect pmdd dont know doctor would take seriously listen research lack information female body astonishing fact even doctors supposed scientific dismiss patients concerns take seriously even women specific doctors female patients often disbelieved past technically still course female patients suffer well thats legs feet stirrups spread wide humiliating id never put submissive position male doctor youre one hating women reason one men saying arent comfortable male gynaecologists please dont make feminism shit comments history downvotes comments speaks kinda reminds ayushmaan khurana movie im saying anything lurked around lot subs composed indians revolve around female health issues like pcos even countries complain male doctors dont seem take symptoms seriously unable diagnose issues would tell lose weight something know anecdotal lot said would get shamed judged lot would much pain things got better either went specialist female doctor two cents sucks though pls keep trying hospital im sure u find one ncr private clinic makes think extra person observing intimate exam private parts would somehow make woman magically okay male gynecologist chaperone would annoy grateful exams private gynecologist lovely woman close age even sane first name observer make even mortified regularly certain procedures like root canal guess knowledge dentistry read cases newspaper situation us plenty non religious liberal educated women prefer female obgyns obvious reasons obgyn residencies us filled women past two hundred years men dominated gynecology medicine women choice time thats works preference fair skinned doctors clear prejudice isnt related doctors qualifications healthsecurity risks contrast female patients choosing male gynaec literally see private parts people opting female dentist due concerns could happen anaesthesia directly related patients safety security concerns preferences reasonable basis andrology subspecialty urology unlike gynaecology usually counts specialty hooters crazy restaurant chain us hires women servers obvious reasons business model requires women skimpy outfits men qualified understood challenged demand patients customers prefer female obgyns behooves bottom line hire women fill positions ive seen enuff tumhare jaise log hi samaj mein gandi vichardhara faila rahe hain jaake apne munh bole mod papa ke paas rodo block karwaane ke liye may say way would man apologize personal opinionpreference owe apology whats best mental emotional physical well maybe intended study surgery become obstetrician family ran money gynaecologists obstetricians csections know men problem definitely solution good lord feminazis make everything narrative nobody suggesting banning men specialty obgyn may choose speciality patients choose doctor see urology men women option choosing speciality remember though urology treats men women urethras bladders kidneys etc many cases men prefer sex urologists women certainly surprising wanting gender concordant care genitals recognized understood right privacy bodily autonomy race another story know difference disingenuous compare two issues analogies absurd righto finally women choice past two hundred years men dominated gynecology women choice suffered hands men barged field kicked midwives nothing backwards wanting woman care sexual reproductive health actually least one deliveries handled top midwife uk male obgyn consultants nearby event problem india backwards gasp dare allow grown women choose prefer obgyn fact women prefer female obstetriciangynecologists know women rights days arent forced anything theyre comfortable whats backwards telling women access bodies really passion seeing vulvas vaginas day everyday patients feel comfortable frankly nothing revolting thought strange man sticking tools fingers body hard indian women nothing wrong preferring female doctors lawyers nail techs hair stylists trainers accountants dentists pick want cut hair polish nails taxes fix car check teeth clean house nobody bats eyelash previous hod male one renowned obgyn state patient even far used flock op requesting see patient say case high risk pregnancies relieved doctor another senior male obgyn called ot female obgyns case complicated cases like pph pas another male obgn roaring private practice well female urologist also sees women patients men prefer sex urologists women also prefer sex urologists big surprise good doctor personally offended preferences want patients feel comfortable stop thats ridiculous india lot creepy men lets honest women india arent ready male gynecologists woman reply tell im wrong ok thats weird lol backward dont laws stop obvious discrimination job adverts australia women rights health care expected laws ensure women forced anything dont want including forced marriage interestingly overly fussed gender drs look qualifications experience yes women may prefer female know plenty people male drs delivered babies great experiences experience male gynecologists gentle compared females femalehating female dont agree excluding applicant due male everyone sick think male dr would job maybe actually want help patients entitled opinion think need understand patients dont mind dont think indian men gynaecologists demand overseas either know people hate feminism thanks clearing males feeling left fucking unfair womp womp bro say women tell u feel unsafe lucky women atleast report sexual assault get privileges saying women forced go male least get male guy fucking job women doctors also get jobs circumcision op cant solve problems honestly would love male gyn female ones ive judgey rude tt hope find something works consider pivoting ivf stereotype malefemale barely seen first hand top clinicals field ivf men also booming industry growing organically yoy lots opportunities dont know much probably u r gynecologist n hospitals prefer female ones obvious reasons im male radiologist trained first practiced south india basically focused ultrasound big line patients ultrasound use transvaginal even breast ultrasound nobody issue even though majority patients muslims later moved north marriage patients uncomfortable even wife didnt want north indian focused ct mri interventions heck left india thanks appreciate north india bro women would always prefer women gyno know matter capabilities humans emotional rational dont worry bro sector also pasting comment true hiring someone useful situation possibility however small woman patient may refuse male dentist hire women never prepare contingency cant imagine guy refuse woman dentist clear dont condone hiring practices pov business prioritises profits see logic pasting comment true hiring someone useful situation possibility however small woman patient may refuse male dentist hire women never prepare contingency cant imagine guy refuse woman dentist clear dont condone hiring practices pov business prioritises profits see logic logic easy understand needs explanation discrimination laws exists always harder time someone indian name looks indian still discrimination give indian person job germany give place live thats point may reasons ignore try private non judgemental women really get justice though nirbhayas rapist got hanged almost decade one still roaming free endless number cases rapists werent even arrested privileges talking privileges include one discussed post free money pension reserved bus seats reserved seats metro talking reserved mens compartment favour divorce favoured cases court women really get justice though criminal hides hard police catch rich outplay system endless number cases rapists werent even arrested werent arrested less also men also get harrased isnt literally law protect long ago removed tf duuude male gynec rural area extremely difficult considering indian mindset start private practice build name join private hospital city f makes sense male gynaecologist male dentist discrimination based castegenderreligioncolour individual guy also went thicks thins learn fing things female gynaecologist would gone goes males visit female dermatologist genitalia related derma issues doctor well qualified practically sound may get deserve north indian females comfortable front male gynaecologist make fuss gender either join government hospital amedical college go places like west bengal root canal wrong time general anesthesia used major jaw surgery extracting complicated impacted rd molars usually people time even normal impaction la sufficient hospital look hire doctors whose merit meets certain standard also want patients comfortable doctor would prioritize lot women strong preference female gynacologist problem preference ask female patients whole region dont want show private parts male gynacologist convince dont mind getting checked male gynacologist hospital ready hire anger towards patients prefering youre directing towards hospitals trying meet demand patients region youre playing victim even though youve willingly become gynacologist despite aware lack demand male gynacologists surprised pikachu face stop bing others reckless life decisions patients choice perspective matter also remember highly skilled patients come ask whats ur usp aquire new skills fellowship super speciality course necessary move tier two city possess skills best bhai ek baat bolu leave country even going seeing midwife prenatal appointments chose male doctors could easily picked female doctors regular woman implying sa victims arent regular women besides wording saed would much want woman present gyeno male adamant women shouldnt comfortable vulnerable positions concept weird honestly strange stance incapable critical thinking incapable critical thinking blanket banning anyone basis gender religion caste sexual orientation etc discrimination reason things control individual maybe read eeo laws usa jumping personal attacks eh sorry wording really attack ment way statistical group wording english also first language weird whole country without concept seems sexist using somebody elses comment drive point logic easy understand needs explanation discrimination laws exists always harder time someone indian name looks indian still discrimination give indian person job germany give place live thats point may reasons ignore reason working govt setup didnt find jobs government hospital male gynaecologist hou hod college knowwhy took obgy creep dont deny rant hard u work would took surgery anesthesiaentry opthal ms branch alright fact girls complain gyne male doesnt change lol dont act like yrs old age horrible really much choiceshe told doctors use firmqueen also used doctors meagan hand indeed choose doctors women seems sexist women want feel comfortable genitalia display okay take one part said combine like discussing good faith saw comments want win arguments communication meanwhile female obsgyn zero male gynacs exclusively employed artemis max saket fmri gurgaon ck birla gurgaon would beg disagree would also like tell muhurat delivery csection rates start lakhs cash payable directly doctor table cut given anesthesia manage ot schedule dont change topic since idea medical system works let break obgyn end branch means dont study years get specialisation unlike surgery mandatory get super speciality degree anaesthesia lowest branch hierarchy clinical branches simply put layman language would anyone go chemical engineering getting cse ophthal highly saturated even lesser job opportunities homework calling anyone names thats perverted mindset shows upbringing since couldnt crack medical entrance exams projecting insecurities others username checks idea operation theatre operates atleast staff members continuously patient anesthesia think male doctor going try assaulting patient infront colleagues risking decades spent getting extremely irrational fear far common occurrence female gynacs slapping patient delivery slutshaming unmarried female crowded opd pervaginal examination underage girls without consent seen female obgyns training way talk patients behind closed doors another level crass rude sure go ahead sexist notion male obgyns assault women every chance get female chaperone present male doctor would risk career examining female without presence female chaperone think would passion seeing vulvas obgyn one magical branches get privilege bringing life world helping family achieve dream surgeries extremely rewarding interesting someone inclination surgery someone perverted mind like wont get definitely need go talk psychologist extremely disturbing thoughts slap patients abuse even refused see patient theyre mood slutshaming unmarried females sexually active norm guess fine long doctor isnt guy talking operation theatres question dentist max assistants easily send tasks also cook imaginary rpe situation head happened several times reported newspaper thats came know okay abse cheez ka bhi dhyaan rakhna hai also assistantnurse etc also male odds stacked female patient unconscious instead arguing girls online questioning dont feel safe naked male gynaecbeing unconscious male doctors use energy fight rape culture might actually see change sexist notions also women bickeringsaying something stupid something hurts moment get within hour getting assaulted results lifelong trauma dont even try compare two incidents try point supposed disadvantages female gynaecs also know cons matter long run case woman raped undergoing root canal procedure doesnt matter official procedure person malicious intentions inject patient substance guise performing regular procedure bold assume im best improve conditions female patients real life bold assume complete strangers internet sexist merely bcuz trying explain op hiring decisions part due societypatients comfort probably bcuz hospital assume others sexist others also assume sexist simple yes thats expect run arguments see want win stay sexist one day indian society need sorry op sound tone deaf woman want man partner seeing touching genitals really simple say want work women understand something simple also want female attendant one extra person want two random people look vagina etc one bad enough worrying willing understand want patients want situation past bad women treated often badly male doctors situation improved immensely female doctors available vast majority women prefer kate absolutely gets say hospital doctor decided men make decisions unfortunately didnt request female nurses leave door wide open started discussing issues try find obgyn specializes conditions like endometriosis fibroids pcos etc empowered obgyns delhi etc post topics importance listening patients cant think accounts top head cuz follow many obgyns globally suggest asking regional subreddit area obgyn recommendations xyz symptoms",
    "light_cleaned_title": "Corporate Hospitals in Delhi NCR Denying me a Job because of my Gender",
    "light_cleaned_selftext": "Why are we still recruiting on the basis of gender, specially in the medical field. In this field, it is important to prioritize qualifications over gender because human lives are at stake and no compromises should be made. I am a proud male gynecologist. I've dedicated over 10 years of my life to studying and training, learning how to be empathetic towards my patients and providing them with high-quality care. I would like to share my experiences on how big corporations, specially in Northern parts of India,denied me from doing a job, not on the basis of merit, but merely on the basis of my gender. Despite their obsession with having a male child, hiring a male gynaecologist is still a forbidden concept in Delhi NCR. I have been a part of several groups on WhatsApp that notify me when there is a requirement for gynaecologists. I contact the recruiters and finish all the necessary procedures. Upon informing them of my gender, they either deny me outright, ghost me, or stop replying to me completely. I have seen them giving jobs to someone less qualified compromising on care but not employ someone competent just because of their gender. Denying jobs to male gynaecologists violates the basic principles of gender equality. Hiring should be based on qualifications, skills and experience, not gender. Many male gynaecologists, that I know of, are exceptionally qualified and capable of providing high-quality care to their patients. Medical professionals, regardless of their gender, are trained to provide sensitive and respectful care. I can assure you that I am amongst least judgemental bunch of gynaecologist. Discriminating, merely on the basis of gender implies a lack of trust in our professional capabilities. India is already facing a massive shortage of doctors. I see everyday on WhatsApp groups, the drastic gap between demand and supply of qualified doctors. Now on top of that we are excluding half the population from this field which not only exacerbates this problem but also reduces access to essential healthcare services. Upholding equality in employment opportunities is crucial for a fair and effective healthcare system.",
    "light_cleaned_comments": "Really a shameful scenario Did not expect this from Hospital like Medanta Let's face the reality how many in-laws are comfortable their bahu opening legs for male gyno. Usually this hospital also get rich conservative people a lot i guess. I assumed you were a newbie and hence the rejection (still doesn't justify). But with the amount of experience you have and still experiencing discriminatory behavior is crazy. More power to you, OP If you’re able. Start applying for jobs in foreign countries. Your specialty will be in high demand. It might be the case that the duty require care of female patients and its best handled by a female doctor because of the comfoet of the patient. Bro playing real life Doctor G They are doing this because most female patients in India feel uncomfortable with a male gynaecologist doing their checkups. Better to look for opportunities in this field in other countries where the gender norms are not as traditional as in India. Hesitate little bit 😭🙏 The same female patients complain about being judged by their respective gynaecologists. We have 1000s of anonymous such posts on reddit. And i am here to do my job. Everyone knows how having a female attendant present at all times is mandatory when being examined by a male doctor. Never hesitate with sed ed ~NCERT Read the messages. He's a gynaecologist. Bro, you should try private practice in you own home city. I have a few male gynaecologists in my city, and they do good. I mean they don't get as much as attention or patients as female doctors, but you know, they are able to successfully run their practice. Also, try rich liberal areas, or rural areas where people know and trust you. There is no in between, conservative families will never send their women to a male gynae, not in a 100 years, especially someone, who they don't know or trust. i applied for dominos , pizzahut outlets for frontend desk jobs all of them rejected me, saying they wanted females as they can't be harassed easily by customers. this is very common practice to hire females as they can be easily dealth with as compared to males. Bro he is talking about Delhi Ncr- medanta, apollo, cloud nine. The possibility of sexual assault is not the main issue here. Most Indian women just don't feel comfortable explaining their menstrual or reproductive health problems to a man who isn't their partner. Some are very conservative (especially in-laws) and they would rather not receive treatment at all than visit a male gyno. Our country is not that open-minded yet. It will take years of sexual education for society to get rid of this mindset. Thank you bro, for telling me, such good soul like you, guiding illiterate people like me through the clouds of darkness. Would you like to perhaps contest elections someday, I might be way too much inclined to vote for you, now that you have provided me with enlightenment. A doctor’s job is to provide good quality treatment. Caring and handling of female patients are done by the nursing staff. There’s always going to be a female attendant present at all times while the doctor is examining the patient. These guidelines are mentioned in the code of conduct. Crazy how big corporate hospitals mint money for the smallest of things, yet won’t provide doctors with equal opportunities. Despite having a significant shortage of qualified doctors, we continue to deny qualified individuals access to basic rights and support an orthodox mindset, even in 2024. This is really shameful!! Hi I'm a Doctor myself. If given a choice between a Male & a female OBG for my family members, I'll always & always choose a female OBG. Same with my friends. No hate to your gender. It's just personal preference. It's just much more comfortable that female parts be examined by females. That's how the world is currently Honestly, no one ik is comfortable with a male gynaecologist. Sorry. what they actually mean is if there is a problem, they won't be able to complain to and gnaw at the frontdesk but that's where they are wrong, I always try to squeeze every ounce of my money if the company/brand does something wrong... Equal rights = Equal fights Justifying your username. I guess it’s that time of the night where you can’t comprehend simple sentences, not your fault my friend alcohol does that to your brain. It is a depressant after all. I would like to simply it for you since you are slow. What I meant was only rich families are able to spend lacs of rupees on deliveries and stuff since even health insurances don’t cover maternity benefits. Middle class peeps would rather go to a nearby nursing home. For real. This 10th class girl few year ago in my tuition asked the girl beside me for an answer to a biology test question related menstruation and I answered her word to word. The look on her face was...not nice 😭 Like \"boy you arent invited\" You have to understand the patients perspective, it’s not the hospital that doesn’t want you, imagine they put you on night duty and a patient comes up and says she is not comfortable to be treated by a male gynec what will they do ! Call a female gynec to stand substitute after her days work ? It’s not sexual harassment that a girl might be worried overall the patient has to be comfortable. Argue how much ever you want , these are practical aspects of life , basic human feelings . Lol what I would have agreed with you on other jobs but not a gyno lol It's more about demand-supply. Majority of people, even now 'explicitly ask' or the least 'prefer' a Female Gynec It doesn't matter what you say I have seen a similar thing happen somewhere I worked, there was a male gynae doctor, extremely skilled and experienced, nearing retirement but some woman would feel uncomfortable being examined by him. It was a government set up so at the end of the day they didn’t have much of a say but there was always a bit of a hesitation. Idk if this is the route you want to take but male gynacs don’t face as much problem in govt setups. Medical field doesn't work this bro ki apply kia to job mil jaye😅. I know about medical licensing in different countries. But he can go for fellowship programs. And now, what exactly did I write? Can your coherent brain understand that? Maybe your soberness a little too much. Well, I agree on the health insurance part. And no, your sentence does not helps, as I also did the same: gave the guy, a pathway and understanding of society and condition. PS: <insert mild cuss word> <change attention> thank you > Medical professionals, regardless of their gender, are trained to provide sensitive and respectful care. But also: > The same female patients complain about being judged by their respective gynaecologists. So, clearly, training doesn't mean much. From a patient pov, it's reasonable to assume that if even women gynaecs are so judgmental, male ones will probably be even more so. Especially, in our culture. How can any patient know you're not a creep, not judgmental, etc. You're in the wrong specialization in the wrong place at the wrong time. That said, the hospital is also wrong not to hire you just because you're a male gynaec. Aren't there other roles in your line of specialization? Not directly interacting with patients but perhaps diagnosis based on tests, managing a gynaec dept, research, etc? Bhai Desh chhod do dusri desh me achhi payment leke naukri kar lo, india ke g pe laat padegi na tab saari hekadi nikal aayegi in future. Ur a male gynecologist please try to understand. No female will want a male gyno. They r fair to ask for female gyno. During my internship, not once I was told to go away by any female patient in gyne department. And I have seen male residents doing check ups and MOST of patients are okay.. People in comments are acting like this is still 2000s. I think north south ka problem h.... South m people are more educated that ki doctor hai, chahe male ho ya female. A person I know who are a female, chose Medanta because they had female gynecologist for exact reasons. To be honest, I would probably would be more comfortable with male gynecologist than female (I am a male). But then he'll have to return here after some time, fir se vohi problem. She’s cute and kind whats her number ?💀 Man, you chose it . Fighting for it is your prerogative , I don't find anything compelling to not say that you have a higher probability of being a creep than I am okay with it. Very bad move on your part , a drop would have been better for you . Can't complain if patient or their partners/relatives are uncomfortable. You can try to change the mentality of india but I think you're better off working somewhere where they are comfortable with a male gynac You wouldn’t need a gynaecologist tho Is money shameful You wrote “try rich liberal areas.” That’s what he did and he is sharing those experiences. My coherent brain works just fine. I guess yours keeps forgetting what exactly you wrote. Try taking thiamine supplements. We don’t want to precipitate Wernicke’s encephalopathy. I think what he meant to say was a male \"andrologist\" (they specialize in male reproductive health) will you be comfortable when going to a female doc for circumcision? Bro you might not like to hear it, but in a country like India, except maybe some particular cities or localities, people will ALWAYS prefer a female gyno over a male one. I am not very happy about this too as I simply detest any hint of sexism in job hunting at all, but that’s the harsh truth. It will take eons and eons of awareness and a 180 change in people’s POV about sexual health to even think about such a change. I'm curious, what made you want to become a gynaecologist as a male? I would ask this same question to a woman that became an andrologist. yes. It is not out of the ordinary to see posts about male doctors disregarding concerns that turn out serious later. I am not saying everyone is like that though Liberal countrys have prejudice against male gynos still, youre living in india This is an uphill battle for you whether you like it or not Im really sorry that we arent accepting and open enough for this to not matter but alas >I don't find anything compelling not to say that you have a higher probability of being a creep than I am okay with it. I read this 3 times and I couldn't understand it, could you simplify it? I don't trust him enough I see Manufacturing mein ghusna shuru karo. I wouldn’t be comfortable consulting a male gynaecologist. Most of the people I know won't be comfortable with a male gynecologist. Just go trans bro…then they can’t technically deny you. Assuming you are not trolling, by applying through WhatsApp, really??? Grow up. Female patients don't want to see a male gynaecologist. Hospitals won't pay you to sit around. Set up your own practice. How proud you are is irrelevant. Actually, you are just trolling, so whatever. Urologists are more common My neighbour's kid did 😞 This is modern day Feminism where these Sicko Feminazis spread propoganda and rule the world. Man I'm dumb. This reminded me when I made similar mistake. For some reason I forgot about wombs and thought when woman is pregnant the baby is in stomach. You can choose to apply somewhere else. I would want my gynac to be a woman to be on the safer side Take the L lil bro I wouldn’t want my wife mother or sister to be ‘checked’ by a male gyno. It sucks and is unfair but people have the right to choose from whom they get their care. Remember those ethics classes in medschool where they drilled in patient autonomy? This applies in all cases- a person might refuse care for all sorts of reasons- it could be a racist saying they don’t want a doctor of colour, it could be an orthodox person based on religion/ social beliefs etc. . It is what it is, sadly. Personally I couldn’t give 2 shits about the gender of my gynae but that’s not the case for everyone. U could have chosen a better career , 95% women wouldn’t be comfortable with a male Gyno I am not saying this is right, but i understand. Most women dont prefer male gynecologist. As a woman going to a male gynac wouldn’t be my first choice tbh.. i doubt this is discrimination more like a supply and demand situation.. most females look for female gynac.. was it difficult to get previous jobs as well? Or did something change There's nothing about feminism in this, Indian women are not comfortable around a male gynaecologist. It's just a fact. We can do anything about it. Try gangaram.. she can fix me 1. You can go for private practice. 2. If you can, move to the US. Doctors there mint money, post specialization. Gynecology is a demanding discipline and has both high career & financial prospects. There's no use begging for a chance to showcase your potential if there are other nations ready to look beyond your gender into what you bring to the table. I wonder if you and others like you will have the opinion when a female urologist is discrimated upon coz male patients are not comfortable with her. I remember going to see a male general physician for a small lump in my underarm. I was literally ok with him to check it but he was uncomfortable & did other checkups but told me to see gynecologist for that. It didn't even need any undressing as I wore sleeveless top. I was confused as gynac might be female but the issue i had didn't seem like a 'gynecology' issue 🤷‍♀️ Aur lado maja aaria h Going trans is ok…you can always switch back. Again in that case we can't do anything about it. If the male patient is not comfortable with the female doctor he can request male doctor as simple as that. at least it makes sense for a gynecologist. i got rejected twice because im both clinics only wanted female dentists. wtf? During my Internship , the OG unit I was in had a male chief . He was one of the best . Maybe it's because they're corporate.. Most of the gynecologists I know of are male and are very good at their job. tbh even hospitals can't do anything. goodluck for private practice. I think that's a similar situation, female patients (or their husband/parents) wouldn't want male dentists so close to their open mouths lmao It is the same everywhere. It's normal casual, women prefer women for gynaecological tests. Their first preference is always a woman. Bro, you screwed yourself. >I am a proud male gynecologist I mean its nor ur fault but the females feel uncomfortable with that so thats why they prob rejected u :( Gyne is one of those roles where preference of gender is kind of important for the patients comfort. They may already have a few male doctors, but in India some women may prefer other women and there's not enough currently. Come to Kolkata, we don’t have such strong notions. Doctors’ skillset matters, not gender Reminds me of the film Dr. G 😝🤞 seriously ? 🥲 I don’t think that’s a well known branch in India. r/halloffame I don’t know any practicing andrologist in my circle? Do you mean urologist? Research and corporate hospitals? Enough said. Isn't gynaec considered the worst department in medical colleges and hospitals because female gynaec doctors and nurses treat people like shit? I've heard that people don't even want to walk near that area. No idea about male gynaecs. Bro has learnt Good Clinical Practice thoroughly it seems Didn't they also make a movie about this a male gynec Now what should he do ? His life is screwed. He’ll earn lesser than an MBBS doctor even First of all, what was the reason to get this department bro? As many female would prefer a female doctor and not a male examining them plus most of the guys won't let the wife go to a male gynae No wonder Tesla is thriving. Elon Musk had the balls to fire 90% of the workforce, which included 'diversity hiring', thus ensuring only the best were retained. Rather than India's moronic system of quotas/reservations etc And I, a female urologist Why not ? If she is skilled > rural areas where people know and trust you Ahn... I won't do that Heard more tales of that going wrong than I can count. They banned girls from mining. Ideally equal rights , but law enforcement is so weak that why even risk it in the first place. He has to do his residency again there lol. USA has no regard for India’s PG degree How is it relevant to this post? Seems like you’re just pissed off and trying to make it about equality Then it will be news and he will be canceled by the media due to chauvinism Bro, come to Kolkata. An extremely open minded city. Women go to male gynaecs and there’s no discrimination Not relevant, but justifying the stance of the corporate hospitals. I am a heavy investor in stocks of these hospitals, got to defend them with sound logic. Then news outlets are to blame for such news. Don't let misleading news and stuff blind you. Think wisely and see other perspectives too :) Good advice Yeah man see it's a thing. People are open minded enough in some parts of India.. I don't know about Kolkata so i didn't say it, but it's good to know Kolkata is also not discriminating in doctors. being a male gynaecologist does not mean you can't be judgemental. hell, in patients' perspective, you're likely to be even more judgemental. i'm not saying it's right, but it is the reality. Should have thought of that before. you wouldn't start a newspaper company in this age of digital era knowing it won't do well would you? That’s so sad. 😞 Tough luck OP. 👑👑👑 Sorry no sympathy for male obgyns. you had a choice to become any other specialty but You chose the one field as a man all you know is bad theory. To change your gender legally requires atleast 3-4 years. And it involves a lot of steps which have to be verified with proof. But go on with your dear mongering and misinformation. Hello bhaiya, A fellow dentist here. I really hope people and the future generations understand the reality and hardships of medical careers. Sometimes the obsession of people even in the younger generation really just despises me. I hope you find a good lead soon. WhatsApp is used for hiring in the medical field. His screenshots look legitimate. This is your privilege really. If we had proper nationalised healthcare like the UK does you wouldn’t really have a choice in who your doctor would be. It's unfortunate that this happens and like other commentors said, this might not the country you should look for this job. India is very conservative and with the political and communal situation, it might progressively become more conservative. It's also a very Asian/Indian stigma for women to overcome to go to male gynae. I know the women in my life have always preferred women gynae but there have been a couple of them who are not fazed by male gynae. As much as i don't want to say this, there is a very slim chance for you to prosper in this field in India (i would love for you to prove me wrong). You might be better off building your career in a country where this is accepted and then come back to India once you have some experience. I would assume hospitals don't see it good for their business to give you a job and privat practice will eventually need you to invest and gains will be very slow since people will \"scroll away\" seeing a male gynae on the list. Don't lose hope and don't let this situation pull you down, you know what's it like in India and fighting against a stigma that strong may not be an ideal way forward depending on whatever your situation is in life. You have the problem, try to circumvent it with the solutions that can afford you to gain more experience I don't know what you were expecting tbh. Living in India as a male and still going for gynaec specialization, I'd be more inclined to believe you are a total and utter creep. Female attendant present is mandatory? What funny rule is this? i‘m german, tho. Being a girl and I live in Delhi, I would prefer Female gynaecologist any day. Delhi is most famous for its women safety /s On top of that, you think I'll feel comfortable going to a male gynaecologist. Not at all. I know a female attendant is always there. But still a big NO. A female gynaecologist is my comfort zone. Sorry if I sounded rude. In germany we have the opposite complain, haha. I am a man but many friends told me about the experience and on reddit and so on and many woman say female doctors have sometimes less respect, are more harsh and have more this „don‘t be weak, i‘m a woman, too“ attitude, while male doctors are often seen as nicer. Bro irrelevant in this post but can you please share the the contact of the HR you using Need to apply for SR Gen surg I'm glad somebody gets it. It's easy for nurses to move abroad. But for doctors it's very difficult. Why not? Male and female surgeons are taught the same ways to do circumcision. I assure you that female doctor has seen several male genitalia the same way a male doctor has seen several female genitalia. It's all the same. Atleast in the medical profession. Out of interest, why choose gynaecology as a specialisation when you had dozens of options to choose from? I mean i have nothing against male gynaecologists in general but its an irrefutable fact that a lot of women in India and even abroad feel a bit uncomfortable with male gynaecologists. It is what it is, unfortunately. Forgive my ignorance, are you implying that people in the UK DON'T have a choice? Why? The only possible reason I can think of is because you feel male doctors are perverts just because they are male. With that logic aren't you a perv as well? All doctors (whether male or female) are taught the same human anatomy and physiology. They're trained to treat and care for HUMANS. (Not man or woman) I have read all your comments and I would like to clarify few things. 1. I should have chosen a different field/ i should have taken a drop and opt for something else. Clearly, none of you know how medical education works. I worked my arse off to clear the qualifying exam. Went to med school for 5 and half years, did my MBBS. Again spent my golden years studying for my Post graduations. Getting a seat in NEET-PG is hard enough. I am just grateful for what I have. While the majority of the population was busy enjoying their 20s, I spent my time working really hard to achieve my goals. So I really don’t have any regrets nor did I bring this bad luck upon myself by choosing this field. Some of you have been patronising me. If a man starts mansplaining, half of the population would be offended by now. The focus of this discussion should on promoting equality at workplace and not denying anyone from doing their jobs. 2. The stigma around male gynaecologist/why did i choose to become a male gynaecologist My guide/mentor is a male gynaecologist. He was interviewed by some famous media houses when a film inspired by a similar topic was released. HoD of my department is a male gynaecologist. And let me be very clear, I am not being biased here, but they are extremely good at their jobs as compared to their female counterparts. We have to do compulsory rotation in every department during our internship. So when i did my rotation in OBGYN, The feelings I experienced while delivering babies and bringing joys to families was nothing short of heroic which is why i chose this field. He can always go for another specialisation. Actually I have seen the opposite in some posts. That women gynae are usually judgemental and they prefer male ones. But yeah u r right. The Doctor G movie is a very good representation of this problem. Kuchi bhi. Going trans doesn’t take 3-4 years. You are confusing with a full transformation. Bro just put a wig, tuck in your kela/gotti, wear a dress and start behaving like a chick. Don’t overthink bro Yes he can do that. A non-clinical degree would suffice 3. Not comfortable with male gynaecologist Half of you said that we aren’t comfortable with a male examining us. One of you even questioned my character. Fair enough. Let me be very clear, I am bound by medical ethics and I have to abide by the rules. I cannot examine any one of you without your consent and as I have mentioned earlier I have to always examine you in presence of a female attendant. I don’t wake up everyday with the intention of taking undue advantages of my patients. You don’t shit where you eat. I can’t put my whole career in a jeopardy and risk my license being cancelled for few minutes of pleasure. Females are more likely to be exploited by their friends, relatives, coworkers or bosses than by doctors. Doctors crossing boundaries are relatively unheard of. 4. Can’t explain our issues openly I have spent half of my life studying about diseases pertaining to female anatomy. I believe I would be one of the few individuals who would openly understand your concerns. I am not like your partner or your in-laws for whom female well-being is foreign concept. I am qualified enough to crack the code. 5. Open up a private practice That is the plan. Every doctor wants to open up their own practice after a certain amount of time but I can’t directly jump to that. I need to think this through. Opening up a practice isn’t a cakewalk. You have to put everything into consideration. Get into fetal medicine... Look for a fellowship... It has good pay, a better non emergency lifestyle and minimal gender bias The idea is to reduce chances of asault or misdemeanor of any kind (on one extreme), to simply making the patient feel comfortable. Even if you are arrested as a female, a female police officer has to be there wasnt rajesh koothrappali father a gynocologist , wonder if he faced these problems lol Even another medical specialisation is viable. All doctors have an MBBS. Even mire diagnostics based gynaecology instead of direct patient consultation would be great. That sounds also weird. But thanks for the explanation. I agree.☝️ No I mean he can take MD Anatomy/Physiology/Biochemistry and take the job of a professor Believe it or not, we are still pretty backwards in a lot of aspects as a nation. I have seen islamic scholars from my state having speech with a huge crowd asking only to go to a male gyno as the last resort. I am pretty sure a lot of the general population have a similar consensus. I have seen people bashing him for selecting gyno here. That's pretty shit. Blame the attitude of the public instead. Ideally your doctor shouldn't be based on their gender. Kuchh nahi, just a guy who chose to pursue his passion and interest. I wish OP all the best. Here, with tears in my eyes, I leave my pursuit of becoming an ObGyn even though I know I'd probably best be an ObGyn and nothing else ever makes more sense to me than this, but I guess we can't have all the things we want in life :''( The last I checked, the way you earn it does have some shame and ethics attached to it. OP abhi kahin aur ghusna shuru kar raha hai We have 1000s of those posts because most of the gynaecologists are female. How do you know we won't have the same posts if there are more male gynaecologists? These are usually older doctors with conservative upbringing. I would expect similar judgement from male doctors with similar upbringing. On top of that, there is an extra chance of some of them being creeps. They're just justifying that they presume everyone to be as perverted as they themselves are. Bro go to Canada, you’ll be worshipped there. The whole country will consider you its son-in-law. 1) why don't you consult online. 2) Setup your own clinic - as in PG you got around 1 lpm you must have saving. 3) visit rural areas or class -2 town and try to set up something.. 4) Go for normal delivery rather than operation. 5) Start some kind of awareness program on Instagram or YouTube.. Not comfortable with male gynecologists. That's what the main reason is and you might have thought about it too while you were studying. You can't just change the way people think overnight. Also, the clinics or hospitals are running a business, and they know how the market works which is why they want a female gynecologist. We can debate all we want but there's no point. Prejudices! >they are extremely good at their jobs as compared to their female counterparts. You can defend your profession without putting down women. You can just say they're good gynecologists and leave it at that. I'm sorry you're having trouble finding a job, it's not ok that you're not being hired for being a man. Could your hod or mentor not guide you about places hiring, since they must be practicing as male gynobs? I love how when it comes to men, women expect them to be progressive and understanding, but when it comes to them, they just say they're not comfortable sharing their private parts issues with a person who's literally the most relevant to actually talk to just because he's a man. Yo, regardless of that, this is almost always going to happen. I myself was uncomfortable around a male gynae when I had to get a usg done for PCOD. But he was quite experienced than most and rid of any kind of judgement, so that helped a ton. We try to ignore judgements but ofc, there’s tons of female gynaes who are unnecessarily judgemental, which is something that hampers a patients ideal behaviour. Maybe try to put this point across? Idk if it would be of any help, but maybe it just might. I hope you land a huge gig soon, good luck! usually I'm all for gender equality but most women/girls (me included) are not comfortable with a male gynac and I think it's fair enough. there's many cases of r*pe by male gynacs as well but let's not go onto that topic. as a girl all imma say is that u may good at what u do but man I do not want u or any other man to be my gynac and neither do most women, like even if I trust u its uncomfortable af so many career options but you chose this... >You don’t shit where you eat. I can’t put my whole career in a jeopardy and risk my license being cancelled for few minutes of pleasure. Kinda concerning that your stance isn't \"I wouldn't assault my patients because that's heinous behavior\" but \"eh it's notnworth it probably\". >I am qualified enough to crack the code. When people say they don't feel comfortable explaining their issues to a man it's not that they're doubting your qualifications but that they're a) reticent due to social and cultural norms and b) regardless of your training you will not have the lived experience of a patient with the organs and hormonal axis you are treating. I get that you're frustrated by the response here not being what you expected but you don't need to defend yourself to redditors. Like you know you. Great. We don't know you. We will be doubtful only. Take lite. This was a terrible choice of specialty for a conservative/culturally-backward country. Indigo also hires only female flight attendants. They openly advertise this in their magazines. It’s so obvious why they would want a female gynecologist in India…. My apologise my friend. I can understand how much you are qualified and yet the broader society is still not ready to accept it. i would never go to a male gynac unless i have absolutely no other option ngl and i don’t know any woman who would irl either lmaooo it is what it is No offence doctor. Most of the replies are from men. May be I can give the female perspective. I would visit a male gynec in an ER. Infact I visited one few months ago. I was definitely not comfortable. I had vaginal delivery few years ago but still appointments scare me. Pap smear, embryo cycle routine, vaginal US nothing is comfortable even with female doctors. I would be ok to visit a male gynec if there is an emergency but not for my routine. Personally I know a woman who lost her baby in a miscarriage because she did not want to visit a male gynec in ER (she lives in Sweden) So cute 😭 Women feel more comfortable with female gynae. That's all. I want to start it off by saying that I truly sympathize with your situation, doc. >Let me be very clear, I am bound by medical ethics and I have to abide by the rules. However as a woman, I want to point out that you shouldn't take women's hesitancy as a personal jab. Sadly, these binding medical ethics haven't stopped certain male docs from abusing their power and mistreating female patients in the past so naturally, no women will buy this reason. Again, nothing personal but the self preservation kicks in and women would rather opt for prevention over cure, pun intended. I think things would have been a lot different for both you as a male gynecologist and me as a young woman in this country if India had low to no crimes against women by men. So you’re saying women doctors are bad compared to male doctors? I’m a doctor and even I won’t be comfortable going to a male doctor. Firstly, they just don’t get women problems and second, I cannot risk being assaulted Highly agreed, I have read all sorts of horror stories from so many female patients about how a LOT of male doctors treated them, I mean at least have some brains to not go into this field specifically. There's a reason why women will always prefer women when it comes to discussin of intimate matters. And why would any company want to go into losses when women will opt to be treated by other women, unless it is really an emergency. He may not be a creep, but this perception is understandable. As a woman, from all the stuff I have experienced with all the men I’ve met , personally I wouldn’t go to a male gyne. Just my personal opinion. I am sorry mam if what i said offended you in the wrong way. Ofcourse I wouldn’t be assaulting anyone. That is completely abhorrent and most disgusting thing to do. I respect females and after working in this department my respect for females has increased many folds. b) regardless of your training you will not have the lived experience of a patient with the organs and hormonal axis you are treating. I may not experience the same hormonal axis as you but I have been trained to be compassionate enough to hear out your problems out and provide you with correct solutions. Ok i understand now. Fair enough. Yeah I mean doc here just points out gender discrimination saying I put a lot of care, and got an education worth of 10 years? Would men seriously like it we put a highly qualified, the best and super experienced female umpire in charge of men's cricket world cup final? Both are high stress fields with emotions and stigmas attached. If the medical field was based on gender or looks instead of qualifications then everyone would have to worry. Absolutely as long as she is skilled for the job I wouldn’t even doubt for a second. Excuse me mam, I haven’t mentioned any where that female doctors are bad. That’s just your assumption. I have compared my mentor and HoD with their co-workers. Please don’t put words in my mouth. When you compare two things, it’s completely natural that one of them will be slightly superior than the other but that doesn’t mean the other thing being compared is bad. Honestly I am happy you were able to take specialization in a field which you have found passion in. I'm pregnant right now, I live abroad and I've had a nightmare with having my symptoms being taken seriously by male gynacs. Theres always two sides of the story. Secondly, please understand the cultural context we are in. Of course there is preference for female gynacs, but I see plenty of well established male gynacs. Long term, you'll fare better, especially in obst. Thirdly, you're getting the recruiter into seriously trouble. If you're highlighting the hospital, it won't be hard for his/ her supervisors to understand who the person in charge is. So male doctors are superior? Why? Honestly I would try recommending practicing in europe, some countries here let’s say Czech Republic for example; care more about if your skilled for the job than anything else, and I haven’t seen any preferences for choosing doctors. Try making more connections and going for fellowships. I am all for that. I just wanted to emphasise that, eventhough people in the west don't mind a male gynaecologist, they absolutely have the right to consult/ask for a different physician if they aren't comfortable, except in emergencies. Even in nationalized healthcare systems like the NHS. Again mam, in no way i am putting any one down. If anyone is being put down here, it has to be me. Some of the commentators even assassinated my character without even knowing me. I don’t have to show the world whether I respect women or not. People around me and most importantly the patients that I have earned through my hard-work know that. This is a free space and I am just sharing my experiences here. \"Spread their legs\"? is this how you would refer to a family member visiting a gynac? Honestly yes it seems to be a more north Indian thing, usually in South gender isn’t an issue or at least in parts where I have been to. It's interesting. Conversely would men have a problem with going to a female urologist/sexual health doctor? Nope, two separate girls have told me that they always prefer male gynos as against female. They say most female gynos are too judgemental and shamelessly start intruding on personal stuff for no valid reason. Male gynos are a lot more cognizant in how and what they talk to their patients and generally never get into uncomfortable conversations. Absolutely but the backlog in appointments usually makes it a tricky situation and I think most times than not, you have to book a new appointment. If I’m not wrong; other redditors please correct me if I’m wrong here. Again mam? Where did I mention that ALL male doctors are superior? I would like to request you to re-read my reply. I am talking about two groups of co-workers. I have nothing against any gender. That would be quite ironic since I am facing a similar discriminatory situation. maybe the code of conduct is being followed in an “ideal india”. currently, heck no brother Girls who're open about this stuff tell me they actually prefer male gynos because they don't act judgemental and get into uncomfortable conversations like (older) female gynos Hmm, I am a woman and i completely empathize with you. However, the hospital seems to be just complying with the needs of the society since they are there to make their profits also. Is it possible for you to find successful male gynaecologists and speak to them about how they overcame this? Good for you. My wife prefers a female gynac and so do many women. Ultimately that's what decides whether you get a job. You should have become an ortho surgeon. They're bringing in the moolah But, unlike gynaecologists, dentists treat people of all genders. How would you or for the matter of fact anyone would know whether or not I am judgemental when I am not being given a chance because of my gender? Shouldn’t hiring be based on skills and not on gender? I always consider getting judged by a random lady Dr than to get raped by a D man. Yeah. You are right there. The ”Dr” prefix is given irrespective of gender. It is equivalent for both the gender. I would rather look at her qualifications than her degrees True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist. Just to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic This stupid advice helps no one. As a woman, I've never been taken seriously by general doctors and endocrinologists (for my thyroid) when I talk about my severe mood swings. They are all male. The most they've recommended is to take vitamin panel tests and prescribe me vitamin d and iron supplements. They didn't understand how it affects my life. Just tried to tell me how it's normal and I should endure and live with it, when I lose my rationality for half a month. Not only that, during Corona, I felt the shortness of breath. I just endured while talking to the male general doctor to talk properly and he laughed at my face when I told it is not that. Then he put on a stethoscope and observed that he changed his face and admitted that I had exactly that. Now I wanted to curse at him, but didn't want to create a scene and left. So now I don't wanna go to a male general doctor itself to treat small things like fever. But I would if it is an emergency, but hell no for any other thing. In fact, It is not to say that female doctors are better. They also don't take my mood swings that seriously to recommend birth control pills and only care if I have irregular periods. But they at least don't laugh at my symptoms or lecture me on how I should do yoga. So, I don't think I'll ever go to a male gynaecologist when I don't know if they'll listen to my symptoms and take me seriously or they are going to just dismiss it by saying it happens to every female. Dude, just set up an abortion clinic in top cities of India and market yourself as a liberal non judgemental person. You would definitely get a lot of clients especially with premarital sex on the rise. You could do the same logic to almost anything. This is just discrimination plain and simple. I wonder how people would react if gender was replaced by \"caste/religion\" in the above scenario. Why shouldn't there be female umpires ? Not understanding the logic here. I am pretty sure the same logic is used to discriminate against minorities in this country. There should be, but Indian men will blame her gender and the entire female gender for being horrible umpires any decision they think is wrong. She will get harassed left and right. If this doctor sahab can argue why he faces discrimination in a primarily diagnostic, judgement oriented, really intimate and purely female focused environment. Obviously we should have a female umpire anytime soon. I am girl, all my besties girls. Idk what sort of girls you hang out with fam that they just opened up to you about being comfortable visiting male gynos. Stop fabricating shit. Girls??? Fun fact nobody talks about is : something fishy always happens between nurses &docters at night.....u know wat i mean haha! Maybe look for opportunities in government hospitals. I have seen male OB GYN only in govt hospitals. Bank of america also hires questionable women over qualified males too. Its common in India with all the woke culture. Hi. I’m a ob/gyn in the EU. Not only I am shocked by the hospitals’ responses, but even more by the majority of the comments on here. What a horrible mentality. I am sorry this is happening to you. Are there any syndicates or on/gyn associations you could complain to? Could you see legal action against those hospitals for this? I only worked in public hospitals. Here, if they refuse the care from a male physician, they are quickly being shown the door, refused any further care and the whole staff would talk about them like they were raised in the woods. To everyone saying he chose the wrong career path, etc - shame on you, you’re a disgrace. >There should be, but Indian men will blame her gender and the entire female gender for being horrib Sure, but that's not the issue here. Does any cricketing body explicitly not hire women umpires for a match, that's the question here. >Obviously we should have a female umpire anytime soon. Yes, I am okay with it. People used to say the same things when women started serving in the army ??? Aren't women now successfully serving in the army. You can't fight discrimination with more discrimination and win. That's what my whole point is about. >Just wait 2 minutes and let someone post a story of a girl being raped and left pregnant, the entire crowd will pounce and call it \"fake pregnant belly\". What ??? Get experience in ngo type hospitals. Save enough to start your own clinic. OBGYN. It is a very intimate field, I personally would net want to discuss these issues with any man. I played a male dominated sport too, with boys, I never really faced an issue ever. But it is an intimate field. And let's say umpiring is open to all public. Naturally men have an upper hand. This subreddit sympathises with men on ideas and concepts they don't know a ground reality of, but accuses women of all sorts of things whenever any news regarding them circulate. It is a man woman issue, it is about intimate problems. But it is as much a a demand supply issue. >OBGYN. It is a very intimate field, I personally would net want to discuss these issues with any man. That is fine, personal choice matters. I know of people who won't eat vegetarian food from non veg hotels because they believe the plates get mixed and it's impure, to each their own But no institution should be able to outrightly not hire males or females or whatever that's textbook discrimination. >it is as much a a demand supply issue. It is always a demand supply issue. If the number of OB GYNs are less, he would get hired in an instance. >And let's say umpiring is open to all public. Naturally men have an upper hand That is what you need to provide more accommodations to women, like giving them matches in the evening or T20 matches etc. Its a serious question.. considering this scenario why didn't you do any other specialization? The situation hasn't arisen overnight all of a sudden. Did you just rebel without a cause? Will you change the whole society thinking and change mindsets by being a male gynaecologist? I truly don't understand why you would put your leg on an axe yourself? Please help me understand why you made your own life difficult like this? India is backward, in Australia, we have laws against this. I've read stories of male dentists drugging their patients and assaulting them. Convince your fellow men to have some self control and then maybe their won't be preferences for women as gynecologists/dentists/morticians etc No one said outright yaar, it is preferential. How can I provide accomodations, I don't watch cricket 😂 Please grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries. I'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive. No one said outright yaar, it is preferential. How can I provide accomodations, I don't watch cricket 😂 Please grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries. I'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive. No one said outright yaar, it is preferential. How can I provide accomodations, I don't watch cricket 😂 Please grow up and realise that women have a preference, this field came into existence because women always had issues with men not understanding and dismissing their pain. No wonder they take female doctors. Doctors have been brutal to women throughout centuries. I'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive >How can I provide accomodations, I don't watch cricket Accommodations are provided by the cricket board not spectators. >No one said outright yaar, it is preferential. We are talking about the hospital outright rejecting men, this is not difficult to understand. >Please grow up and realise that women have a preference, this field came into existence because women always had Again, where did I mention personal choice is wrong ? You don't even seem to be reading my replies. >I'm convinced you're a 15-16. One day you'll walk into the real world. Good luck, keep being inquisitive. Try again, I am much older than that. Homeboy there thinks he's spitting facts while being crude and uncultured af. I read and replied exactly how I know. Would any hospital want to kill its demand? Naturally they mentioned female so male applicants don't have to bother with all the hardwork submitting resumés and doing all formalities. That isn't outrightly discriminating against anyone. No one questioned his expertise. But does his expertise have a supply? Do men watch the women's world cup as much as they watch the men's? Nope. Naturally if there is a sponsor like dream 11 they will invest into the men's team. Doesn't mean women aren't good enough. Fun discussion tho. >Would any hospital want to kill its demand? The same logic could be extended to hiring minorities since a lot of people in India would only want someone from the same religion to treat them. So are you okay with the hospital outright rejecting minorities ? >No one questioned his expertise. But does his expertise have a supply? Depends, maybe for his earlier years he can go to cities like Kolkata or a Tier 2 city and hope for the best where competition is much less. Maybe he could switch to private practice in Mumbai after a decade. His expertise is Gynaecology and that definitely has a demand. >Naturally if there is a sponsor like dream 11 they will invest into the men's team. Doesn't mean women aren't good enough. We are not talking about men and women sports That's a whole new discussion. I am okay with continuing the umpire discussion if you want to. The fact that you make such a comment. Unable to properly acknowledge why female patients would prefer a female doctor proves their point. I’m sure a lot of woman are happy they don’t have a male doctor who can’t sympathize with them. I do sympathize with you though, it’s tough not finding a job. Especially after such a long and expansive studies. I mean it's gyne, wtf do you expect? I have written this as a satire to people who think visiting a male gybac is uncultured or taboo. Just apply for jobs outside India, the demand for qualified Healthcare professionals is extreme and you'll get paid 10x of what you get paid here what exactly sounds funny about it?😂 this is the most logical move af is polite and cultured? male doctors don’t get i to uncomfortable convos? what utopia is this😂😭 india mein hat doctor male ya female usually judgemental hi hota hai so how people would react if the criteria made 0 difference to the comfort of the patient? i wonder how people would react. how can it be discrimination if it’s about your own comfort? you’re paying them for their service, you allowed to choose exactly who you want. there’s no discrimination when you’re making personal choices about your health lol Its not discrimination if the individual doesn't go. Its discriminatory when the institution does it. How would you feel if a software company refuses to hire you because of your race as an example ? Most male gynecologists i know are into infertility or gynec oncology Basic reading comprehension. The af is used to accentuate the crudeness and unculturedness of your statement unlike yours wannabe edgy one. Also do you really think pointing out the 'irony' is doing something to your cause for use of such phrase!? P. S. Nice job with the edit there, atleast own up to your bullshit while you're making a case for it. We don’t have this, and don’t need it. It‘s a bit sexist. Dude just doing his job and if you studied this job, you didn’t do it to be predator. ok? you do understand there are women who have been SA’d in the past and have trauma about being this intimately vulnerable with ANY men? trauma doesn’t care about sexism or whatever ism if you guys don’t care about women’s mental well being, especially women who have been sexually harassed in the past, then how is that our problem? you guys don’t have any women only shelters either for DA victims? i wouldn’t be surprised lmao in the name of equality making lives harder for women Also particularly in private clinics in Delhi NCR and Middle East, they ask for a Female Dermatologists in advertisements. That argument makes no sense: woman doctors exist, too. SA victims just go to whatever gender they are comfortable with. But if a regular woman goes to the doc, there doesn’t need to be a woman, too. We do care a lot, actually. You seem very aggressive? How can you be downvoted? It IS discrimination and isn’t it illegal to discriminate in india, too? @[Appropriate\\_Log\\_1695](https://www.reddit.com/user/Appropriate_Log_1695/) This is sad. Also in a way now we know the true reason. It is not because of anything else. Most of time Hospital HR will give some shi\\*t like - need more exp, need lower salary expectation etc - here they were foolish, but honest with the reason. This sort of discrimination is widespread among doctors. Also in some more like nurses and professor. People always remain silent when this happens. I suggest you slowly setup your own and until you do that, get posted wherever you can. Save money and in parallel - start your own. For long term, depending on a hospital is a risk. They will use this same reason anytime they want. I would suggest u took look in other States such as maharashtra like ladies do prefer male gynech if he good at it over a female one less discrimination on gender basis Agree You are in the wrong country. You keep defending yourself here, but you are not going to change people's mindset just by yourself. It will take years for that to happen. I have a male OB. I am currently pregnant with my second baby and he was amazing with my first pregnancy. However, I live in Canada where there is less stigma. The other female OBs in his office have worse reviews than he does. He has amazing reviews on RateMDs because despite not having female organs, he is capable of showing empathy. I believe you, dude. I know you are fully capable of doing your job and you are probably very good at it, but you are in the wrong place at the wrong time. You chose wrong profession buddy its very difficult in india, try to move abroad It’s the same outside India as well. I have 9 gynaecologists at my hospital and all are females and I live in west. idk why i read every text with the word \"doc\" in it with bugs bunny voice hope u find a job soon, but yea, male gyne in india is tough A friend's dad exclusively hires female dentists because they're less likely to become competition by opening up a clinic nearby Well gynaecologist is a sensitive area and is a mainly female practice because it's customers are 100% female. Yeah. Chandigarh Kare ashiqui I think or may be Bala. Not completely blaming them. I wouldn't want my wife go to male gynaecologist as well. i think female andrologists would be quite popular- Yes, I personally was in a bike crash and I hurt my testicles and I asked for a male doctor. The thought of showing my bruised balls to a woman kinda felt embarrassing as I knew a male doctor would understand. These kind of intimate medical issues should always be dealt with a similar gender doctor as atleast they can empathise. Lots of women are uncomfortable with a male gynaec and specifically call up to find out which hospital/clinic near them has a female gynaec. I don't think it's about the company being discriminatory but more like, they know the requirements of their patients and are trying to cater to it. We can argue about stereotypes, and doctor to doctor hota hai, I am qualified etc but you cannot make someone comfortable when they are not. There were some cases recently where male dentists gave anesthesia to their patients and then r@ped them. After reading those cases, my Dad started accompanying me to my dentist and told me that if he's not available on some day, I should visit the female dentist instead. Idk about others, but it's possible that some other people also have these concerns. You have no conrrol over what happens to you while you're under anaesthesia. You guys are getting screwed bcuz of the actions of other men, not bcuz of employers being discriminatory. 🤷 I was at a diagnostic center in NCR yesterday waiting for an ultrasound. A lady came in for level 2 pregnancy ultrasound but didn't go ahead because they didn't have a female doctor to conduct the ultrasound. It's not the hospital, it's the patients who don't want a male doc Ayushman Khuranna ki movie thi na ispe This is a case of how men ruin things for men. Especially true with indian men. Sure, you might never misuse your position, and would never assault anyone. But statistically? The odds aren't looking good for your patients, worsened by the fact that women gynaecologists would simply not have this issue entirely. A lot of indian men are fucking animals, and so many women might be uncomfortable around men in general, let alone a male gynacologist. It's unfair for you, but at least understand why. then remove all female doctors from checking males as well isnt this double standard? It goes both ways. A male patient hardly ever prefers a female urologist. Similarly, if a woman prefers a female gynaecologist, it’s really the question of comfort. We in the medical field are very immune to diseases and male/female body parts. But we forget how most of the people are uncomfortable. I am myself a female doctor and I would still prefer getting checked by a female gynaecologist. That’s why you’d see how most urologists are male. There is really no point in blaming the hospitals here, it’s not their fault. It’s just a tricky, slightly gender biased speciality branch. Bro... I didn't know it was this big problem.I am a girl and i have visited almost 5 gynecologists and all were male and all from rural areas or town. I thought we were in 2024 not in the 19th century. Don't lose hope,but you should try in a private hospital. Congratulations. You just played yourself. Bro, nothing against you. I am a woman living in the US. I just said my style.. I would assume all women out there are like me. I'd say gather some resources and leave India. The country has a shithole mentality and won't recognise talent/ hardwork because they are too busy rotting in their age old social norms. >Are yaar Mam going by your logic, vets should be out of their jobs because how can a human make animals comfortable? 70% of breast surgeons/oncologists are male. And they chose to super specialise in that field. Despite breast cancer being the leading cause of cancer in females, women shouldn’t consult these breast surgeon since majority of them are males. How are they going to understand your issues when they don’t have the organ in the first place? Just in case you ever felt the need to drill your female patients some other way. i think your “vet” logic is really an ignorant and nonsensical comment. Anyway gynaecologists are the first doctors a female goes to for reproductive issues. so when she first goes to that particular doctor she’d want to be very comfortable and choose a female. By the time another doctor diagnoses breast cancer, she will definitely go to whoever is the best out there. I think there’s a certain difference between an oncosurgeon and a gynaecologist. Nevertheless, this was just my personal opinion and you can clearly see how it’s the question of comfort for the individual patient here and not the question of you being worthy or not. i am sure you are a very capable doctor, it’s the field that is biased just like urology. Oh god, I relate to you so much. I went to a male gynae at first, but was super extremely uncomfortable and unsafe. But the dude did try to help but my mom didn't like it. She pulled me off after one visit and took me to a female gynae. This female gynae says, \"Oh, this is normal period pain, it'll go away after you get married and have a child\". Mind you, it was extremely painful and not normal. I was pretty much immobile with pain and losing my consciousness. So I know that most women don't get taken seriously just because it's normal for them to live with so much pain... In my experience tho, it was both, female and male doctors (except that one male gynae that actually tried to help, he was one of the good ones and I'd put his name here but I don't remember cause my mom pulled me off after one visit) so I pretty much just avoid doctors and chug painkillers to survive. (Still undiagnosed but I'd rather just suffer than waste money to be told it'll go away after I marry, bitch I was 14, what am I supposed to do?? Wait in misery until my knight in shining armour comes to me?? Wtf kinda crap— the sheer absurdity of that statement itself ugh 💀) Even my mood swings (depression, high end anxiety etc) are so extreme through the 2-3 weeks. It fucks up your quality of life and then the doctors don't take you seriously. It sucks. Finding a good gynae male or female is like looking for a needle in haystack 🤡 Hey, I can understand your pain. My doctor wife is already shy/uncomfortable having a gynaec checkup from her female doc and would faint/have a panic attack at just the thought of a male doc examining her. She clearly has confided in me that in this situation, all professional logic is thrown out of the window and emotions take over. But there is a (non-ideal but acceptable) solution a few of my male gynaec acquantainces have done- become gynaec oncosurgeons. Get complex referrals, operate for others etc. Minimal opd interactions/pv examinations with any patients. 100% of robotic gynaec, 50% of lap gynaec and gynaec oncology surgeries in most big hospitals r not done by the admitting doctor but by a superspecialist called by them. Typical feminazi And then they will cry if not hired as an ortho or a surgeon because they need 6 days off every month. Be a real woman for once and stop denigrating the male gender. That's why I miss calcutta. One of the most open minded liberal cities in North India. Professional pussy examiner A male gynec delivered me and my elder sister, and my cousins too, and this was in late nineties when he was already in his fifties. He was well reputed and his daughter who was also a gynaec was the second choice of my mom as she felt her inexperienced. Thats what patients care at the end of the day. Experienced female gynaecs will obviously have the topmost priority unfortunately. So I believe its only about reputation and years of experience at the end of the day, and factors such as location. As someone said, networking and building your name with the help of other male gynaecs for another decade seems to be a good way forward for you. Good luck!! This!! I’m a women and one of the best gynaecologist I’ve come across was male gynaecologist! Non judgemental, actually valued my opinion, talked about my pain and pain management over fertility like other gynaecologist I’ve visited. But dentistry involves local anaesthesia? You see, gender discrimination is only illegal when it’s happening to women. Truly a marvel of our modern society Lol there are levels to sexism and uncle looks down on all of them. Patients are not comfortable with male gynaecologists lol. it’s not discrimination. Same with race and skin color. I know dark people who only want light doctors. Should hospitals only hire light skinned doctors in those areas? We still have lot of gender bias in society which is increasing with current religio-socio-political scenario. People prefer female drs to examine their female relatives. Even though the women themselves may be willing for a male dr. So, a private corporate hospital, with eye on nothing but financial bottom line WILL refuse you. Ironically, the bias should work in favor of male drs, because same mentality states that male drs are 'better' than female ones in terms of skills. (You HAVE seen your female colleagues addressed as 'sister' -meaning nurse- haven't you?) Still, this is how it works when choosing a obgyn is concerned for so called educated layman. Try government hospitals (you do have a bond to complete, don't you?) or go for private practice. Going to a tier 2/3 city is a good idea. Metros are overcrowded with competition. Definitely, females have a higher probability of getting assaulted, it's such double standards, why only females? Males be feeling so left out, It's so fucking unfair womp womp bro Whats this gender thing? In a country where rapes are so prominent it’s absolutely okay and right for a woman to only go to women gynaecs. I would never go to a man gynaecs sorry not sorry !!! Maharashtra mein aao, stereotype thoda kam hai How is this even related to feminism 😭 I am just not comfortable with a male gynaecologist. I am not a real woman because I don’t go to a male gynaecologist? Heights of stupidity Kisne bola tha gynaecologist banne ko ? Bhai bachpan me sir ke bal gir gye the kya yeah be so for real any female would prefer going to a female gyno ... I just don't understand this bias. Not everyone chooses to become gyne? Your score determines that. Sometimes your score gives you an option between Gyne and Derma. I don't think most would wanna choose derma over gyne. Because gyne pays better. So don't guilt trap him and other male gynes with this gaslighted asf comment. PS: I am not a gyne. Not even a doc. Pps: You are clearly not for gender equality Welcome to India, here it's better to be born as a cat or a dog than a man, hope you enjoy ur stay here Eh ? You probably need an endocrinologist. That actually knows his shit OP put this on Twitter and maybe try in Bangalore or Bombay. gynae to ladkiyon ko hi karne de bhai kyu dusro ki field me jara, koi lady kyu male gynae se karayegi? tu apne ghar pe puch koi male gynae pe jayege? No one is worried about sexual assault by docs in cities. It's not that. What it is, is a matter of comfort. I'm not comfortable going to a male gynac either. Out of 7 of my female friends, one has a male gynac. Is it fair to you? No. But it is what it is. And the hospital is a business, unfortunately. 90+% docs who get a chance to choose between derma and gynae, end up choosing derma. Radiodiagnosis and Dermatology are the top 2 most in demand branches btw. It's not just conservative families. I wouldn't call myself conservative. My partner won't care if I went to a male gynae. But I don't feel comfortable. I couldn't debate it with logic or reason. But it is what it is. Cant really blame the hospitals / patients either , most women dont feel comfortable with a male gynaecologist Makes sense. These fields have better work life balance. No Er rounds etc. Now that I chose a wrong example due to being outdated with current medical trends, I don't want to devalue my point. Which is gender should have nothing to do with academia and profession. First of all, stop shaming him for choosing this specialisation. That is horrible of some of you. He worked hard to get here. Secondly, OP it is nothing personal against you. There is a preference for female gynacs and not because of a negative bias but keeping safety at the centre. I am not aware of you PQE, but I would say get in touch with other practising male gynacs, and they will help you navigate the situation better. but hospitals would consider doctors who patients prefer right? I'm myself open minded and fairly liberal but if i have to consult a gynaec... i would PREFER a female doc all this still doesnt change the fact that patients have a choice to choose their doc. I have a friend who's working as an obstetrician in the town along with his wife (MBBS), they are doing pretty well, biases are common in our society at every domain, but I thought a corporate hospital in a metropolitan culture would have evolved. The sad truth is many women in India would be ostracized for consulting a male gynecologist. Many others will simply be uncomfortable. I feel for your predicament, but I can't blame the hospitals in this case. They are simply doing right by their patients. Exactly, I mean being done mbbs for 5.5 years,dude already had an idea about the situation,this he choses obgy , why dude why? I'm gonna choose surgery next year , obgy never crossed my mind >Convince your fellow men You say it as if he is responsible for the behaviour of all men Try government hospital, their patients don't have a choice for male or female gynaecologist, bro give up in private hospitals Even in government hospital, you will face discrimination and it also depends on how you look and dress, I'm pretty muscular and seeing me examining them make them uncomfortable...... feminine looking male and feminist voice , personality helps or you have hardly chance > Convince your fellow men why the fuck is it my job lol Relax man A very small percentage of doctors do rapes at least in America Source: Am doctor, have not had self or colleagues do even one rape to my knowledge I'm sorry they don't appreciate your edginess here it's probably because they are upset about you talking about their bahu in this manner At least that's what your bahu told me in bed last night You know women don't generally have to take time off to menstruate right I applied for an HR intern role a few years back, I knew I fit perfectly, everything went well but the HR there wanted only a female candidate. Equality my friends. And I would tell you to go and meet the nearby doctor in emergency room and see how many females come and blatantly ask for certificates to show the same so they can take sick leave etc In my own hospital they made it mandatory for all sick leaves to be issued by the MS due to this issue. Lol what? The question isn't whether or not you mentioned all male doctors being superior, it's that you decided to make a comparison solely based on gender. And you think you have nothing against any gender? Think again, your bias is actually quite unsubtle and it is showing. Once when I was little someone threw a ball right at my crotch and a little boy said \"oooof ouch\" and I was like \"huh?\" But to get back to your question, this is a common problem but not necessarily universal. I've had cervix surgery where the anesthesia started to wear off, and I know testicular injuries are at least 100 times more painful than that. A kind and empathetic person is gonna be kind and empathetic regardless of gender, and sometimes you don't have a choice as to the gender of the doctor and it's better to have medical care from anyone than to lose your testicles at a young age. If you have or can get the cash take the usmles and move to the US, or move to Kolkata as someone suggested, or do fellowship in maternal fetal medicine And it's perfectly understandable from a woman's perspective why is it so. I completely empathize with them. Safety is not ensured as crimes such as this are not punished at all in India. There is a stark difference between knowing someone and then passing a fair judgement and simply jumping to conclusions which you are doing at the moment. I am not basing my argument solely on gender. There are numerous factors involved and since I have worked closely with them, it is justified to have an opinion. And if you would go and ask them they would happily agree with me. But having said that, I would like to repeat myself that I am not disrespecting them in any way and I have immense respect for my female seniors. They have made me what I am today. They have nutured me like their little brother which is why I have some of the closest relationship with them. Theory is something I can read from textbooks but to have an understanding about female perspective and emotions is something I learnt from them. Come to South India. I have never seen any male gynaecologist facing any issue problem here. Our obgyn HOD is a male. Ppl aren’t that hesitant here as far as I have seen. I know you just want to look at pussy. Good try buddy, this isn't gonna take you anywhere. look i will be honest, personally as a woman i am not comfortable to let a male gynecologist touch me. I don't have trust in most men because of obvious reasons. that's probably why female gynecologists are in more demand. this is india though... you would be surprised how common sexual harassment is here uhh yeah there are some examinations which require the woman to actually spread her legs. Where did this pervert mindset of yours lead you? I would still be in a noble profession, I would still be respected and I would still make a lot more money than you ever would. Which is why I am where I am today and you are where you are. People like you pose as a risk for women and as a hurdle for good men. We can say ”not all men” all we want but nameless, faceless perverted trolls like you negate our points. Most of the commenters here are acting like male ob-gyns have never existed in the history of India until OP became the first one. What do you think the situation was 10 years ago? 20? 50? There were not always so many women going into medicine in India as there are today. The field of gynecology was created by a male doctor in the US, and for many decades it was pediatrics, not gynecology, that had the highest % of women doctors. I myself was delivered by a male gynecologist and my parents ever expressed any reservations about this choice when talking about it. By the way, Princess Kate’s children were delivered by male gynecologists, and if there’s anyone who had the ability to select exactly which doctor they wanted to see, it would be a royal family member. you are lucky women don't sexually harass men as much. Basic economics at play here, patients want female gyno as a result hospitals wants to hire female doctors as only they’ll be able to generate revenue Most female patients in India are not comfortable with a male gynecologist. Happens more so in the North side of India, having worked in all regions of India (North, South East & West) for over 20 years as a medico. North people are super judgmental even the educated ones regarding how their doc looks. For example I am 40+ and still looking relative young (thanks to good genes) , I have handled at least 25k (thousand) plus surgeries and consulted more than double that number, but coming North people still want a second opinion to another \"senior looking\" doctor after consulting me. I have purposely let my hair greyed to \"look\" more senior/older and now that trend has stopped. So do not give up hopes just coz of one set back, just do what you are good at and keep aside some capital for marketing..the same people later will be come begging at your door/clinic step. It's not about you though. Some women will simply not go for the checkup if they are forced to see a male gynac. If the point of having gynaecology as a speciality is better health outcomes for women, then in india at least you'll have to understand why you are being rejected by some practices and understand that its necessary discrimination. Can't believe dummies are down voting this If you're not willing to bring about the solution don't complain about the problem Yeah, female gynaecologists were also not better. But at least the ones I went to didn't say that it happens to every female, I would have hated if they said that seriously. But they didn't prescribe anything because they also thought it was due to thyroid. And since I was already taking medicine for that, they just said mood swings are due to thyroid. They told birth control pills might fuck up hormones and they won't suggest it. I do suspect that I have PMDD and I don't know if any doctor would take it seriously and listen to me. The more I research, the lack of information about the female body is astonishing. That and the fact that even doctors who are supposed to be scientific will dismiss patients' concerns and not take them seriously. Even if they are women specific doctors. Female patients were often disbelieved in the past (and technically still are now). Of course, it's more than just female patients who suffer from this. Well, that’s what you do. Legs up, feet in stirrups and spread wide. Humiliating; I’d never put myself in such a submissive position with a male doctor. You’re the one hating on women for no reason. No one is against men. We are just saying that we aren’t comfortable with male gynaecologists. Please don’t make it about feminism and shit. Your comments history and downvotes on your comments speaks for itself It kinda reminds me of that Ayushmaan Khurana Movie... 😅 I'm not saying anything about you but I have lurked around a lot in subs that are not composed of Indians and revolve around female health issues like PCOS and all. And even in their countries they complain how their male doctors don't seem to take their symptoms seriously and were unable to diagnose their issues and would just tell them to lose weight or something. I know it is anecdotal but a lot of them said they would get shamed and judged a lot and would be in so much pain and things only got better when either they went a specialist or a female doctor. Just my two cents. Sucks to be you though, pls keep trying in some other hospital. I'm sure u will find one in NCR or a private clinic What makes you think that having an extra person observing a most intimate exam of very private parts would somehow make a woman magically he okay with a male gynecologist? A “chaperone” would annoy me. So grateful to have my exams in private; just my gynecologist, a lovely woman close to my age who even has the sane first name, and me. No observer to make me even more mortified. Not regularly but certain procedures like root canal I guess. I have no knowledge of dentistry, just read about the cases in the newspaper. Same situation in the U.S. where there are plenty of non religious, liberal, educated women who prefer female obgyns. For obvious reasons. 87% of obgyn residencies in the U.S. are filled by women. For the past two hundred years, men dominated not only gynecology, but all of medicine. Women had no choice. It’s about time that we do. That's... not how it works. A preference for fair skinned doctors is just clear prejudice and isn't related to those doctors' qualifications or any health/security risks. In contrast, female patients choosing a male gynaec (who literally has to see their private parts) or people opting for a female dentist due to concerns about what could happen to them under anaesthesia is directly related to the patient's safety. Security concerns are not the same as preferences that have no reasonable basis. Andrology is a subspecialty of urology, unlike gynaecology with usually counts as its own specialty Hooters, the crazy restaurant chain in the U.S. only hires women servers. For obvious reasons; it’s what their business model requires ( women in skimpy outfits ) and men are not “qualified”. It’s understood and not challenged. It’s about demand; if the patients (customers) prefer female obgyns, then it behooves their bottom line to hire women to fill those positions. I've seen enuff. And tumhare jaise log hi samaj mein gandi vichardhara faila rahe hain. Jaake apne munh bole mod papa ke paas rodo block karwaane ke liye. May I just say that no way would a man apologize for his personal opinion/preference. You do not owe an apology for what’s best for your mental, emotional and physical well being. Maybe he intended to study surgery after and become an obstetrician but the family ran out of money. Most gynaecologists & obstetricians doing c-sections I know are men. its not my problem. and its definitely not the solution. good lord feminazis make everything about their narrative Nobody is suggesting banning men from the specialty of obgyn. They may choose the speciality and patients will choose which doctor they will see. Same with urology in that both men and women have the option of choosing the speciality. Remember though that urology treats both men and women. We all have urethras, bladders, kidneys, etc. In many cases men prefer same sex urologists as do women. Certainly not surprising. Wanting gender concordant care for genitals is recognized, and understood as the right to privacy and bodily autonomy. Race is another story and you know that there is a difference. It’s disingenuous to compare the two issues. Your “analogies” are absurd. Righto; it’s 2024 and finally women have choice! For the past two hundred years men have dominated gynecology and women had no choice. They suffered at the hands of men who barged into the field and kicked out midwives. There is nothing backwards about wanting a woman to care for your sexual and reproductive health. Actually, at least one of her deliveries was handled by the top midwife in the UK while the male obgyn consultants were nearby in the event of a problem. So India is backwards because, gasp, they dare to allow grown women to choose who they prefer as their obgyn? Fact is most women prefer female obstetrician/gynecologists and because you know, women have rights these days, they aren’t forced into anything that they’re not comfortable with. What’s backwards is telling women who should have access to their bodies. It’s really not about you and your passion for seeing vulvas and vaginas all day everyday. It’s about what the patients feel comfortable with; frankly there is nothing more revolting than the thought of some strange man sticking tools and his fingers into your body. Hard no. Not just Indian women. There is nothing wrong with preferring female doctors.. or lawyers, or nail techs, or hair stylists, or trainers, or accountants or dentists. I pick who I want to cut my hair, polish my nails, do my taxes, fix my car, check my teeth, clean my house. Nobody bats an eyelash. Our previous hod was male. He is one of the most renowned obgyn in my state. Patient from even far used to flock to the op requesting to see him. Patient say that in case of high risk pregnancies they are relieved to have him as their doctor. Another senior male obgyn is called to the ot by all other female obgyns in case of complicated cases like PPH and PAS. Another male obgn has a roaring private practice as well. The female urologist also sees women patients. Most men prefer same sex urologists and most women also prefer same sex urologists. No big surprise. Any good doctor is not personally offended by these preferences. They want their patients to feel comfortable. Stop it. That’s just ridiculous. India has a lot of creepy men lets be honest. Women in India aren't ready for male gynecologists. Any woman in here can reply to me and tell me I'm wrong? Ok now thats weird lol They are backward because they don't have laws to stop obvious discrimination in job adverts. In Australia women having rights in their health care is expected too, there are laws to ensure that women are not forced to do anything they don't want to including forced marriage. Interestingly we are not overly fussed about the gender of Drs more look for their qualifications and experience, yes some women may prefer a female but not all. I know plenty of people who have had male Drs who have delivered their babies and had great experiences. In my experience, male gynecologists are more gentle compared to females. I am not female-hating as I am a female but don't agree with excluding an applicant due to them being a male. That is you, not everyone it is sick that you think that is why a male Dr would do this job, maybe they actually want to help patients. You are entitled to your opinion but I think you need to understand that some patients don't mind. I dont think Indian men gynaecologists will be in demand overseas either. now i know why people hate feminism thanks for clearing it out >Males be feeling so left out, It's so fucking unfair womp womp bro say this when women tell u they feel unsafe you are lucky women can atleast report sexual assault and then get 27 privileges i am not saying women should be forced to go to the male but at least get the male guy a fucking job? women doctors also get jobs in circumcision OP I can't solve your problems but I honestly would love have a male gyn because all the female ones I've been to are judgey and rude T\\_T I hope you find something that works for you You should consider pivoting into IVF. The stereotype of male/female is barely there, seen this first hand as most of the top clinicals in the field of IVF are men. It’s also a booming industry, growing 20% organically YoY. Lots of opportunities there I don't know much but it's probably because u r a GYNECOLOGIST. N hospitals prefer female ones for obvious reasons. I'm a male radiologist who was trained and first practiced in South India and basically focused on ultrasound and I had a big line of patients for ultrasound where is use to transvaginal and even breast ultrasound and nobody had an issue, even though majority patients were Muslims. Later i moved to North because of my marriage, not only patients were uncomfortable even my wife didn't want me to (who is a North Indian), so I focused only on CT /MRI and interventions. Heck I left India. Thanks. I appreciate it. *North India* Bro women would always prefer women gyno. I know it's a matter of capabilities. Humans are emotional and not rational. don't worry bro same is in IT sector also Pasting my other comment here > True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist. > Just to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic Pasting my other comment here > True, but it's about hiring someone who will be useful in any situation. There is a possibility, however small, that a woman patient may refuse a male dentist, so just hire women so that you never have to prepare for that contingency. And i can't imagine that a guy will refuse a woman dentist. > Just to be clear, I don't condone any such hiring practices. But from the pov of a business which prioritises profits, I can see the logic But the logic is easy to understand and needs no explanation. This is why discrimination laws exists. You will be always have a harder time with someone who has an indian name and looks indian, it still is discrimination to not give an indian person a job here in Germany or not give them a place to live because of that. That‘s the point, there may be reasons, but you have to ignore them! Try Private and be non judgemental do women really get justice though? nirbhaya's rapist got hanged after almost a decade and one still is roaming free.. there are endless number of such cases where rapists weren't even arrested. what privileges are you talking about? privileges include the one being discussed in post free money from pension reserved bus seats reserved seats in a metro (only talking about reserved in mens compartment) favour in divorce favoured in all cases in court >do women really get justice though? if the criminal hides then its hard for police to catch him and if he is rich he can outplay the system . >there are endless number of such cases where rapists weren't even arrested. the no. of those who werent arrested is less than those who were also men also get harrased but there isnt literally any law to protect there was long ago but it removed? tf Duuude!! A MALE gynec in a rural area !?!?! Extremely difficult considering the Indian mindset..... Start private practice and build a name for yourself, or join a private hospital in T1 city..... Why the F*** does it makes sense for male gynaecologist and not for male dentist? There should be no discrimination based on caste/gender/religion/colour of an individual. That guy also went through all the thicks and thins to learn all the f***ing things that a female gynaecologist would have gone through. Same goes for you. Males visit female dermatologist for genitalia related derma issues if the doctor is well qualified and practically sound. May you both get what you deserve 🙌🏻 North Indian females are not comfortable in front of a male gynaecologist, so why make it a fuss about gender. Either join a government hospital or amedical college or go to places like West Bengal. > root canal wrong. the only time general anesthesia is used is for major jaw surgery or when extracting very complicated impacted 3rd molars [usually people do it when they do 4 of them at the same time] even for normal impaction, LA is sufficient. The hospital will look to hire doctors whose merit meets a certain standard and they also want the patients to be comfortable with the doctor. Why would they prioritize you if a lot of women have a strong preference for a female gynacologist? If you have any problem with their preference, then ask the female patients in the whole region why they don't want to show their private parts to a male gynacologist and convince them. If they don't mind getting checked at a male gynacologist, the hospital will be ready to hire you. You have anger towards the patients for not prefering you and you're directing that towards the hospitals, which are just trying to meet the demand of the patients in the region. You're playing the victim even though you've willingly become a gynacologist despite being aware of the lack of demand for male gynacologists and now you have a surprised pikachu face. Stop b****ing on others for your own reckless life decisions. Patients choice and perspective does matter. But also remember it you are highly skilled, patients will come to you. Ask yourself what's ur USP. AQUIRE NEW SKILLS, do fellowship/ super speciality course- if necessary move to a tier two city, where few possess your skills All the best Bhai ek baat bolu, leave this country. Even so, she is not going to be seeing a midwife for all her prenatal appointments. And she chose to have male doctors when she could have easily picked female doctors. \"A regular woman\"... implying, what, SA victims aren't regular women? Besides your *very* off wording, I have not been SAed but I would very much want there to be a woman present if my gyeno is a male. Why are you so adamant that women shouldn't be comfortable in such vulnerable positions? Why is this concept so \"weird\" to you? Honestly a very strange stance... Are you incapable of critical thinking? You are incapable of critical thinking Blanket banning anyone on the basis of gender, religion, caste, sexual orientation etc is discrimination. The reason being that these are things not under the control of the individual. Maybe read EEO laws of the USA before jumping to personal attacks eh ? Sorry for the wording, you really attack this now? I ment it in a way from a statistical group. It's not \"very\" off wording. English is also not my first language. Why is it weird? Because we can have a whole country without this concept at all. It seems sexist to me. Using somebody else's comment to drive the point through : >But the logic is easy to understand and needs no explanation. This is why discrimination laws exists. You will be always have a harder time with someone who has an indian name and looks indian, it still is discrimination to not give an indian person a job here in Germany or not give them a place to live because of that. >That‘s the point, there may be reasons, but you have to ignore them! The reason they are working in govt setup ,they didn't find jobs too Most government hospital has male gynaecologist as hou and hod , my college has.... You know,why you took obgy ,creep ,just don't deny that and rant about how hard u work , you would have took surgery, anesthesia,entry ,opthal or other ms branch alright but the fact that most girls complain about the gyne being male doesn't change lol Don't act like a 15 yrs old, what is your age? This is horrible. Really not much of a choice.She was told which doctors to use by the Firm/Queen, who also used those doctors. Meagan on the other hand, did indeed choose her own doctors; women. It seems sexist to you that women want to feel comfortable when having their genitalia on display? Okay. No. Why you take one part of what i said and combine it like that. You not discussing in good faith, i saw your other comments. You just want to \"win\" with arguments. This communication is over with you :) Meanwhile the 50 female obsgyn (Zero male gynacs) exclusively employed by Artemis, max saket, fmri gurgaon, ck birla gurgaon would beg to disagree and would also like to tell you that their muhurat delivery c-section rates start from 2 lakhs cash payable directly to the doctor under the table out of which 20% cut is given to anesthesia to manage ot schedule. dont change the topic, i am 19 Since you have no idea about how medical system works let me break it down for you 1. Obgyn is an end branch which means I don’t have to study for 3 more years to get a specialisation unlike surgery where it is mandatory to get a super speciality degree. 2. Anaesthesia is the lowest branch in the hierarchy of clinical branches, so simply put in layman language, why would anyone go for chemical engineering when they are getting CSE? 3. Ophthal is highly saturated with even lesser job opportunities. Do your homework before calling anyone names. That’s just your perverted mindset and shows your upbringing. Since you couldn’t crack the medical entrance exams, you are just projecting out your insecurities on others. Username checks out Do you have any idea about how an operation theatre operates? There are atleast 15 staff members continuously in the other when the patient is under anesthesia and if you think some male doctor is going to try assaulting a patient infront of all his colleagues risking the decades he spent getting where he is, then you have an extremely irrational fear. There have been far more common occurrence of female gynacs slapping the patient during delivery, slutshaming an unmarried female in a crowded opd, doing pervaginal examination on underage girls without consent. And this is all that is have seen the female obgyns do during my training. The way they talk about patients behind closed doors is another level of crass and rude. But sure, go ahead with your sexist notion that male obgyns are there to assault the women every chance they get. Did he have a female chaperone present with him? No male doctor would risk his career examining a female without the presence of a female chaperone Do you think he would have a passion for seeing vulvas. Obgyn is one of the most magical branches where you get the privilege of bringing life into this world and helping a family achieve their dream. The surgeries are extremely rewarding and interesting for someone with an inclination for surgery. But someone with a perverted mind like you wont get that. You definitely need to go talk to a psychologist for these extremely disturbing thoughts They slap patients, abuse them , some have even refused to see the patient because they’re not in the mood. Slutshaming unmarried females who are sexually active is a norm. But i guess all that is fine as long as the doctor isn’t a guy We're not talking about operation theatres here, are we? The question was about a dentist, who will at max have 2 assistants whom he can easily send out on some tasks. Also, I did not cook up an imaginary r@pe situation in my head, it has happened several times, been reported in the newspaper, that's how I came to know that \"okay, abse is cheez ka bhi dhyaan rakhna hai.\" Also, if the assistant/nurse etc are also male, the odds are stacked against the female patient who is unconscious. Instead of arguing with me or other girls online and questioning why we don't feel safe being naked before a male gynaec/being unconscious with male doctors, use that energy to fight against rape culture and you might actually see a change in these \"sexist\" notions. Also, women bickering/saying something stupid is something that hurts in the moment but we all get over it within an hour. Getting assaulted results in lifelong trauma so don't even try to compare the two incidents or try to point out the supposed \"disadvantages\" of female gynaecs when you also know that those cons do not matter in the long run. Here is a case of a woman who was raped while undergoing a root canal procedure - It doesn't matter what the \"official\" procedure is, a person with malicious intentions can inject the patient with any substance under the guise of performing a regular procedure. Bold of you to assume that I’m not doing my best to improve the conditions for female patients in real life. Bold of you to assume that complete strangers on the internet are \"sexist\" merely bcuz they were trying to explain to OP that the hiring decisions were in part, due to society/patients' comfort and probably not bcuz of the hospital itself. You assume others are sexist, others will also assume you are sexist, simple :) Yes, that's what I expect when you run out of arguments. You see, you just want to win. I stay to it, it‘s sexist and one day, indian society will not need it. Sorry OP but you sound so tone deaf. I am a woman. I do not want a man that is not my partner seeing or touching my genitals, it is really as simple as that. You say you want to work with women, but you do not understand something so simple. I also do not want a 'female attendant' there, it is just one extra person, I do not want two random people to look at my vagina etc., one is bad enough. It is worrying that you are not willing to understand this. This is not about what you want, it is about what patients want. The situation in the past was bad for women, they were treated - often very badly - by male doctors. Now the situation has improved immensely because female doctors are available and the vast majority of women prefer them. Re: Kate, she absolutely gets no say in the hospital or doctor, it is all decided by men that make decisions for her. Unfortunately no, he didn't request any female nurses but he did leave the door wide open when I started discussing my issues. Try to find an ObGyn who specializes in conditions like endometriosis, fibroids, PCOS, etc. There are a few empowered ObGyns in Delhi etc. that post about these topics and the importance of listening to their patients. I can’t think of the accounts off the top of my head cuz I follow many ObGyns globally. But I suggest asking a regional subReddit in your area for ObGyn recommendations for your XYZ symptoms"
}