{
    "id": "1b7yk0v",
    "title": "Correspondence over comments & consent: MIB’s pursuit of permission for releasing comments on the Broadcasting Bill",
    "url": "https://www.reddit.com/r/india/comments/1b7yk0v/correspondence_over_comments_consent_mibs_pursuit/",
    "selftext": " \n\n[https:\\/\\/internetfreedom.in\\/mib-seeks-consent-for-releasing-comments-on-the-broadcasting-bill\\/](https://preview.redd.it/hysrx906kpmc1.png?width=1600&format=png&auto=webp&s=7e9eea8035287cd5ac612322d544265d59f02403)\n\n## tl;dr\n\nThe Ministry of Information and Broadcasting  (“MIB”) had received requests under the Right to Information (“RTI”)  Act, 2005 to share the responses or copies of the responses it received  on the  Broadcasting Services (Regulation) Bill, 2023 (“Broadcasting  Bill”). Following this, MIB wrote to several individuals and  organisations seeking their permission to share their consultation  response with the applicant requesting it. As one of the participants  and invested stakeholders, we wrote to the MIB giving our consent and  asking them to make these responses public proactively. \n\n## Chronology of correspondence\n\n* On November 10, 2023, MIB [published](https://mib.gov.in/sites/default/files/Public%20Notice_0.pdf?ref=static.internetfreedom.in) the draft Broadcasting Bill on its website and invited comments on it from the public.  \n* On December 07, 2023, we shared our [comments](https://drive.google.com/file/d/13Pog8Lj-fIeCHnNRQ8-SFClUV4ZxSI6d/view?usp=sharing&ref=static.internetfreedom.in) on the Broadcasting Bill.\n* On February 23, 2024, we [wrote](https://drive.google.com/file/d/1UBiA0S2uzKbtAU5BGTyEqxJPhCxiA1kF/view?ref=static.internetfreedom.in)  to MIB requesting publication of all the comments received on the  Broadcasting Bill on the Ministry’s website, with individual  respondents' personally identifiable information (“PII”) redacted.\n* On February 23, 2024, we also filed an [RTI application](https://drive.google.com/file/d/1LTvYQ8qu9ppBGRAbbyX-Wy3Z_O3_CzM2/view?ref=static.internetfreedom.in)  (Reference no.: MOIAB/R/E/24/00111) with the MIB requesting details  about and copies of the consultation responses received for the  Broadcasting Bill.\n* On March 01, 2024, the office of MIB wrote to  us, and some of the other stakeholders who participated in the  consultation process as well, informing us that the Ministry was being  requested to share our comments or its copies on the Broadcasting Bill  under the RTI Act, 2005. On this request, they asked us to share our  consent within 10 days of receiving the email. (We presume that MIB is  in the process of writing to each stakeholder who participated).\n* On March 01, 2024, we [provided](https://drive.google.com/file/d/1J25QPGV07B_7TgQQjBo4ZtFwo0lrPVNr/view?ref=static.internetfreedom.in) our consent to the Ministry. \n* On March 04, 2024, we [wrote](https://drive.google.com/file/d/1gZ8xaLCgo81vteW8jFdVNLAUn2Zu9CJz/view?usp=sharing&ref=static.internetfreedom.in)  to them once again, reiterating the importance of making all  consultation responses public. We emphasised on the need to sensitively  handle the personal details of individuals who participated in the  consultation process and suggested redacting their names, email IDs,  numbers, and other PIIs before making the documents public. \n\n## Redact and reveal\n\nConsultations  are important for democratic decision-making, and the publication of  responses is a step towards increasing transparency standards in the  consultation process. Allowing stakeholders access to the responses as  well as an opportunity to engage with them through counter-comments will  foster a meaningful debate and dialogue on the subject in question.  Publication of responses will increase organisational accountability and  also allow for better analysis, understanding, and fair critique of the  various perspectives put forward. Thus, we urge MIB to proactively  release comments received during any consultation while also redacting  the PIIs of individual stakeholders. While the Ministry needs to do so  to ensure that privacy is protected, they must endeavour to retain the  names of organisations along with their comments, so that the public is  aware of an organisation’s policy positions on matters that affect  them. \n\n## Important documents\n\n1. Draft Broadcasting Services (Regulation) Bill, 2023 ([link](https://mib.gov.in/sites/default/files/Public%20Notice_0.pdf?ref=static.internetfreedom.in))\n2. Our consultation response on the Broadcasting Bill ([link](https://drive.google.com/file/d/13Pog8Lj-fIeCHnNRQ8-SFClUV4ZxSI6d/view?usp=sharing&ref=static.internetfreedom.in))\n3. Letter to MIB seeking publication of comments ([link](https://drive.google.com/file/d/1UBiA0S2uzKbtAU5BGTyEqxJPhCxiA1kF/view?ref=static.internetfreedom.in))\n4. RTI application seeking copies of consultation responses ([link](https://drive.google.com/file/d/1LTvYQ8qu9ppBGRAbbyX-Wy3Z_O3_CzM2/view?ref=static.internetfreedom.in))\n5. Letter to MIB providing consent for sharing our comments ([link](https://drive.google.com/file/d/1J25QPGV07B_7TgQQjBo4ZtFwo0lrPVNr/view?ref=static.internetfreedom.in))\n6. Letter to MIB regarding their email seeking consent ([link](https://drive.google.com/file/d/1gZ8xaLCgo81vteW8jFdVNLAUn2Zu9CJz/view?usp=sharing&ref=static.internetfreedom.in))\n\n[Donate Now](https://static.internetfreedom.in/donate) ",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1709728358.0,
    "convurl": "https://b.thumbs.redditmedia.com/1GjIj1PmRd1hCJRW9W7yOV2_mTY5kipvE39fQ8RkMXE.jpg",
    "comments": [],
    "cleaned_text": "correspondence comments consent mibs pursuit permission releasing comments broadcasting bill httpsinternetfreedominmibseeksconsentforreleasingcommentsonthebroadcastingbillhttpspreviewreddithysrxkpmcpngwidthformatpngautowebpseeeacdacddf tldr ministry information broadcasting mib received requests right information rti act share responses copies responses received broadcasting services regulation bill broadcasting bill following mib wrote several individuals organisations seeking permission share consultation response applicant requesting one participants invested stakeholders wrote mib giving consent asking make responses public proactively chronology correspondence november mib publishedhttpsmibgovinsitesdefaultfilespublicnoticepdfrefstaticinternetfreedomin draft broadcasting bill website invited comments public december shared commentshttpsdrivegooglecomfiledpogljfiechnnrqsfcluvzxsidviewuspsharingrefstaticinternetfreedomin broadcasting bill february wrotehttpsdrivegooglecomfiledubiasuzkbtaubgtyeqxjphcxiakfviewrefstaticinternetfreedomin mib requesting publication comments received broadcasting bill ministrys website individual respondents personally identifiable information pii redacted february also filed rti applicationhttpsdrivegooglecomfiledltvyqquppbgrabbyxwyzoczmviewrefstaticinternetfreedomin reference moiabre mib requesting details copies consultation responses received broadcasting bill march office mib wrote us stakeholders participated consultation process well informing us ministry requested share comments copies broadcasting bill rti act request asked us share consent within days receiving email presume mib process writing stakeholder participated march providedhttpsdrivegooglecomfiledjqpgvbtgqqjboztfwolrpvnrviewrefstaticinternetfreedomin consent ministry march wrotehttpsdrivegooglecomfiledgzxalcgovtewjfdvnlaunzucjzviewuspsharingrefstaticinternetfreedomin reiterating importance making consultation responses public emphasised need sensitively handle personal details individuals participated consultation process suggested redacting names email ids numbers piis making documents public redact reveal consultations important democratic decisionmaking publication responses step towards increasing transparency standards consultation process allowing stakeholders access responses well opportunity engage countercomments foster meaningful debate dialogue subject question publication responses increase organisational accountability also allow better analysis understanding fair critique various perspectives put forward thus urge mib proactively release comments received consultation also redacting piis individual stakeholders ministry needs ensure privacy protected must endeavour retain names organisations along comments public aware organisations policy positions matters affect important documents draft broadcasting services regulation bill linkhttpsmibgovinsitesdefaultfilespublicnoticepdfrefstaticinternetfreedomin consultation response broadcasting bill linkhttpsdrivegooglecomfiledpogljfiechnnrqsfcluvzxsidviewuspsharingrefstaticinternetfreedomin letter mib seeking publication comments linkhttpsdrivegooglecomfiledubiasuzkbtaubgtyeqxjphcxiakfviewrefstaticinternetfreedomin rti application seeking copies consultation responses linkhttpsdrivegooglecomfiledltvyqquppbgrabbyxwyzoczmviewrefstaticinternetfreedomin letter mib providing consent sharing comments linkhttpsdrivegooglecomfiledjqpgvbtgqqjboztfwolrpvnrviewrefstaticinternetfreedomin letter mib regarding email seeking consent linkhttpsdrivegooglecomfiledgzxalcgovtewjfdvnlaunzucjzviewuspsharingrefstaticinternetfreedomin donate nowhttpsstaticinternetfreedomindonate ",
    "cleaned_title": "correspondence comments consent mibs pursuit permission releasing comments broadcasting bill",
    "cleaned_selftext": "httpsinternetfreedominmibseeksconsentforreleasingcommentsonthebroadcastingbillhttpspreviewreddithysrxkpmcpngwidthformatpngautowebpseeeacdacddf tldr ministry information broadcasting mib received requests right information rti act share responses copies responses received broadcasting services regulation bill broadcasting bill following mib wrote several individuals organisations seeking permission share consultation response applicant requesting one participants invested stakeholders wrote mib giving consent asking make responses public proactively chronology correspondence november mib publishedhttpsmibgovinsitesdefaultfilespublicnoticepdfrefstaticinternetfreedomin draft broadcasting bill website invited comments public december shared commentshttpsdrivegooglecomfiledpogljfiechnnrqsfcluvzxsidviewuspsharingrefstaticinternetfreedomin broadcasting bill february wrotehttpsdrivegooglecomfiledubiasuzkbtaubgtyeqxjphcxiakfviewrefstaticinternetfreedomin mib requesting publication comments received broadcasting bill ministrys website individual respondents personally identifiable information pii redacted february also filed rti applicationhttpsdrivegooglecomfiledltvyqquppbgrabbyxwyzoczmviewrefstaticinternetfreedomin reference moiabre mib requesting details copies consultation responses received broadcasting bill march office mib wrote us stakeholders participated consultation process well informing us ministry requested share comments copies broadcasting bill rti act request asked us share consent within days receiving email presume mib process writing stakeholder participated march providedhttpsdrivegooglecomfiledjqpgvbtgqqjboztfwolrpvnrviewrefstaticinternetfreedomin consent ministry march wrotehttpsdrivegooglecomfiledgzxalcgovtewjfdvnlaunzucjzviewuspsharingrefstaticinternetfreedomin reiterating importance making consultation responses public emphasised need sensitively handle personal details individuals participated consultation process suggested redacting names email ids numbers piis making documents public redact reveal consultations important democratic decisionmaking publication responses step towards increasing transparency standards consultation process allowing stakeholders access responses well opportunity engage countercomments foster meaningful debate dialogue subject question publication responses increase organisational accountability also allow better analysis understanding fair critique various perspectives put forward thus urge mib proactively release comments received consultation also redacting piis individual stakeholders ministry needs ensure privacy protected must endeavour retain names organisations along comments public aware organisations policy positions matters affect important documents draft broadcasting services regulation bill linkhttpsmibgovinsitesdefaultfilespublicnoticepdfrefstaticinternetfreedomin consultation response broadcasting bill linkhttpsdrivegooglecomfiledpogljfiechnnrqsfcluvzxsidviewuspsharingrefstaticinternetfreedomin letter mib seeking publication comments linkhttpsdrivegooglecomfiledubiasuzkbtaubgtyeqxjphcxiakfviewrefstaticinternetfreedomin rti application seeking copies consultation responses linkhttpsdrivegooglecomfiledltvyqquppbgrabbyxwyzoczmviewrefstaticinternetfreedomin letter mib providing consent sharing comments linkhttpsdrivegooglecomfiledjqpgvbtgqqjboztfwolrpvnrviewrefstaticinternetfreedomin letter mib regarding email seeking consent linkhttpsdrivegooglecomfiledgzxalcgovtewjfdvnlaunzucjzviewuspsharingrefstaticinternetfreedomin donate nowhttpsstaticinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Correspondence over comments & consent: MIB’s pursuit of permission for releasing comments on the Broadcasting Bill",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/mib-seeks-consent-for-releasing-comments-on-the-broadcasting-bill\\/](https://preview.redd.it/hysrx906kpmc1.png?width=1600&format=png&auto=webp&s=7e9eea8035287cd5ac612322d544265d59f02403) ## tl;dr The Ministry of Information and Broadcasting (“MIB”) had received requests under the Right to Information (“RTI”) Act, 2005 to share the responses or copies of the responses it received on the Broadcasting Services (Regulation) Bill, 2023 (“Broadcasting Bill”). Following this, MIB wrote to several individuals and organisations seeking their permission to share their consultation response with the applicant requesting it. As one of the participants and invested stakeholders, we wrote to the MIB giving our consent and asking them to make these responses public proactively. ## Chronology of correspondence * On November 10, 2023, MIB [published](https://mib.gov.in/sites/default/files/Public%20Notice_0.pdf?ref=static.internetfreedom.in) the draft Broadcasting Bill on its website and invited comments on it from the public. * On December 07, 2023, we shared our [comments](https://drive.google.com/file/d/13Pog8Lj-fIeCHnNRQ8-SFClUV4ZxSI6d/view?usp=sharing&ref=static.internetfreedom.in) on the Broadcasting Bill. * On February 23, 2024, we [wrote](https://drive.google.com/file/d/1UBiA0S2uzKbtAU5BGTyEqxJPhCxiA1kF/view?ref=static.internetfreedom.in) to MIB requesting publication of all the comments received on the Broadcasting Bill on the Ministry’s website, with individual respondents' personally identifiable information (“PII”) redacted. * On February 23, 2024, we also filed an [RTI application](https://drive.google.com/file/d/1LTvYQ8qu9ppBGRAbbyX-Wy3Z_O3_CzM2/view?ref=static.internetfreedom.in) (Reference no.: MOIAB/R/E/24/00111) with the MIB requesting details about and copies of the consultation responses received for the Broadcasting Bill. * On March 01, 2024, the office of MIB wrote to us, and some of the other stakeholders who participated in the consultation process as well, informing us that the Ministry was being requested to share our comments or its copies on the Broadcasting Bill under the RTI Act, 2005. On this request, they asked us to share our consent within 10 days of receiving the email. (We presume that MIB is in the process of writing to each stakeholder who participated). * On March 01, 2024, we [provided](https://drive.google.com/file/d/1J25QPGV07B_7TgQQjBo4ZtFwo0lrPVNr/view?ref=static.internetfreedom.in) our consent to the Ministry. * On March 04, 2024, we [wrote](https://drive.google.com/file/d/1gZ8xaLCgo81vteW8jFdVNLAUn2Zu9CJz/view?usp=sharing&ref=static.internetfreedom.in) to them once again, reiterating the importance of making all consultation responses public. We emphasised on the need to sensitively handle the personal details of individuals who participated in the consultation process and suggested redacting their names, email IDs, numbers, and other PIIs before making the documents public. ## Redact and reveal Consultations are important for democratic decision-making, and the publication of responses is a step towards increasing transparency standards in the consultation process. Allowing stakeholders access to the responses as well as an opportunity to engage with them through counter-comments will foster a meaningful debate and dialogue on the subject in question. Publication of responses will increase organisational accountability and also allow for better analysis, understanding, and fair critique of the various perspectives put forward. Thus, we urge MIB to proactively release comments received during any consultation while also redacting the PIIs of individual stakeholders. While the Ministry needs to do so to ensure that privacy is protected, they must endeavour to retain the names of organisations along with their comments, so that the public is aware of an organisation’s policy positions on matters that affect them. ## Important documents 1. Draft Broadcasting Services (Regulation) Bill, 2023 ([link](https://mib.gov.in/sites/default/files/Public%20Notice_0.pdf?ref=static.internetfreedom.in)) 2. Our consultation response on the Broadcasting Bill ([link](https://drive.google.com/file/d/13Pog8Lj-fIeCHnNRQ8-SFClUV4ZxSI6d/view?usp=sharing&ref=static.internetfreedom.in)) 3. Letter to MIB seeking publication of comments ([link](https://drive.google.com/file/d/1UBiA0S2uzKbtAU5BGTyEqxJPhCxiA1kF/view?ref=static.internetfreedom.in)) 4. RTI application seeking copies of consultation responses ([link](https://drive.google.com/file/d/1LTvYQ8qu9ppBGRAbbyX-Wy3Z_O3_CzM2/view?ref=static.internetfreedom.in)) 5. Letter to MIB providing consent for sharing our comments ([link](https://drive.google.com/file/d/1J25QPGV07B_7TgQQjBo4ZtFwo0lrPVNr/view?ref=static.internetfreedom.in)) 6. Letter to MIB regarding their email seeking consent ([link](https://drive.google.com/file/d/1gZ8xaLCgo81vteW8jFdVNLAUn2Zu9CJz/view?usp=sharing&ref=static.internetfreedom.in)) [Donate Now](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}