{
    "id": "1awbyu5",
    "title": "Goons backed by local polititions attacked intern doctors in LLRM Medical College Meerut UP.",
    "url": "https://www.reddit.com/gallery/1awbyu5",
    "selftext": "We are receiving death threat calls daily , even after multiple attempts to have authorities on our side it's been 3 days since the incident and the person involved on 20th Feb night came to the campus with around 50 people planning an attack but tte students called on 112 . He's gathering false political support to harass and is seeking an opportunity to strike at hostels no one is safe can't perform daily activities mental harassment is on peak.",
    "flair": "Crime",
    "score": 17,
    "num_comments": 4,
    "created_utc": 1708521911.0,
    "convurl": "https://i.redd.it/z8f9qrvswxjc1.jpg",
    "comments": [
        "How or why did it start?",
        "They were roaming in campus 2-3 days before and were threatening students inside campus like \" give ragging on the road\" \"tum jante nhi ho hum kon hai\" . That lead to an argument between the students and those goons",
        "UP being UP 😔. Hope students get justice"
    ],
    "cleaned_text": "goons backed local polititions attacked intern doctors llrm medical college meerut receiving death threat calls daily even multiple attempts authorities side days since incident person involved th feb night came campus around people planning attack tte students called hes gathering false political support harass seeking opportunity strike hostels one safe cant perform daily activities mental harassment peak ",
    "cleaned_title": "goons backed local polititions attacked intern doctors llrm medical college meerut",
    "cleaned_selftext": "receiving death threat calls daily even multiple attempts authorities side days since incident person involved th feb night came campus around people planning attack tte students called hes gathering false political support harass seeking opportunity strike hostels one safe cant perform daily activities mental harassment peak",
    "cleaned_comments": "start roaming campus days threatening students inside campus like give ragging road tum jante nhi ho hum kon hai lead argument students goons hope students get justice",
    "light_cleaned_title": "Goons backed by local polititions attacked intern doctors in LLRM Medical College Meerut UP.",
    "light_cleaned_selftext": "We are receiving death threat calls daily , even after multiple attempts to have authorities on our side it's been 3 days since the incident and the person involved on 20th Feb night came to the campus with around 50 people planning an attack but tte students called on 112 . He's gathering false political support to harass and is seeking an opportunity to strike at hostels no one is safe can't perform daily activities mental harassment is on peak.",
    "light_cleaned_comments": "How or why did it start? They were roaming in campus 2-3 days before and were threatening students inside campus like \" give ragging on the road\" \"tum jante nhi ho hum kon hai\" . That lead to an argument between the students and those goons UP being UP 😔. Hope students get justice"
}