{
    "id": "rhf19p",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/rhf19p/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 24,
    "num_comments": 12,
    "created_utc": 1639618217,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "If anyone has questions about MBA in the US I would be happy to answer.",
        "For someone who has done MBA in India and is earning around 30L per annum (2 yr exp), is it worth it? The equivalent salary for my role in my company in US is around 150k.\n\nAlso working for a global corp, so there are opportunities to go outside India.\n\nThe reason I'm asking this is that I see some of my college seniors go out still. \n\nAlso, what advantage does a US MBA provide compared to elite European MBA (INSEAD, LBS, Oxford, Cambridge)? What's the case for choosing INSEAD rather than a T15 in US? (apart from 1 yr vs 2 yr)",
        "We are a small team working in Financial domain based out of Gurugram. We are hiring for roles across tech &amp; content.\n\n**Tech** :\nFrontend/Backend/Mobile\n\nIf you are someone who have some experience in building websites/mobile apps or backend services in Javscript or Python then DM me. (freshers are welcome)\n\n**Content** : \n\n- SEO Manager\n\n- Research Analyst ( Mutual Funds / Stocks )",
        "Does anyone know how much Google pays a person who has around 4.5 years experience who is making 18lpa in a different company. \n\nEither Hyderabad or Bangalore office",
        "Lots of good questions. \n\nIn my opinion is not worth doing another mba - good schools won’t particularly entertain it unless the candidate has some other exceptional qualities in their resume. \n\n\nElite European MBAs have cachet in the US - I personally know people/friends that have MBAs from INSEAD and LBS that are working in FAANG or investment banks. That said US MBAs even from non elite schools have cachet all over the US and can help in securing good jobs and immigrating here.",
        "I'm working in customer services from last 5 yrs. I've enhanced my speaking nd writing skills , and got placed in ome of the biggest giant in this field that offers good salary. But issue is that it is a 200 yrs old company that falls under fortune 500. They seems to promote people with a decade of experience as there's alot of competition. Also, there's no outside scope for someone who's in customer services as salaries are too low. \n\nI don't know how to proceed further from this point. I'm ready to learn new skill, but I just don't know the direction. I love to write nd interact with people. Any genuine suggestion pls.",
        "Looking to get hired:\r  \n\r  \nSkillset &amp; experience: Technical writer and Junior Business Analyst. Technical documentation. Have 1 year of corporate experience. Also good with SEO writing, technical article writing.\r  \n\r  \nTwo year of job gap, though I'm open to learning.\r I'm curious and good at what i do.\r  \n\r  \nLocation: Pune, Maharashtra. Bangalore. Gujarat. Or Remote\r  \n\r  \nPreferred way of contact: DM\r  \n\r  \nAny other suggestions are welcome.",
        "Hi. Do you have knowledge/experience of writing content for blockchain or crypto?",
        "We are a blockchain dev company. \nLooking for \n1. MERN Stack developers \n2. Blockchain developers \n3. HR manager \n4. Crypto Trader/Analyst\nAnd various other profiles. \n\nWFH currently. Office in Delhi/NCR. \n\nPlease DM if interested.",
        "If you can speak Italian, Russian, or Arabic and interested in a job in telesales, cold calling, lead generation, please DM me. Job location: Manesar (near Gurugram). With a global manufacturer of building material. Salary: 8-10 LPA.\n\nAlso looking for a Regional Manager for the same company to be based in Malaysia. Must have industry experience in Malaysia, Singapore, Indonesia and neighboring countries.",
        "&gt; Content :\n&gt; \n&gt; SEO Manager\n&gt; \n&gt; Research Analyst ( Mutual Funds / Stocks )\n\nCopywriter here. Are you remote-friendly &amp; is it a FT or PT gig?",
        "Do you think MBA is worth doing if someone can't clear CAT? And just gets an MBA in a private college by just paying for it.  \n\n\nAlso do you think HR has scope? I know its not a field where I'll see fast growth, but is it good if I'm good at conflict resolution, and I'm cool headed, and I like working with people? And I like following rules?   \n\n\nI'm in 12th right now.  \n\n\nAlso does it matter if I do BA then MBA, rather than BBA and MBA to employers? Thank you!"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "anyone questions mba us would happy answer someone done mba india earning around l per annum yr exp worth equivalent salary role company us around k also working global corp opportunities go outside india reason im asking see college seniors go still also advantage us mba provide compared elite european mba insead lbs oxford cambridge whats case choosing insead rather us apart yr vs yr small team working financial domain based gurugram hiring roles across tech amp content tech frontendbackendmobile someone experience building websitesmobile apps backend services javscript python dm freshers welcome content seo manager research analyst mutual funds stocks anyone know much google pays person around years experience making lpa different company either hyderabad bangalore office lots good questions opinion worth another mba good schools wont particularly entertain unless candidate exceptional qualities resume elite european mbas cachet us personally know peoplefriends mbas insead lbs working faang investment banks said us mbas even non elite schools cachet us help securing good jobs immigrating im working customer services last yrs ive enhanced speaking nd writing skills got placed ome biggest giant field offers good salary issue yrs old company falls fortune seems promote people decade experience theres alot competition also theres outside scope someone whos customer services salaries low dont know proceed point im ready learn new skill dont know direction love write nd interact people genuine suggestion pls looking get hired skillset amp experience technical writer junior business analyst technical documentation year corporate experience also good seo writing technical article writing two year job gap though im open learning im curious good location pune maharashtra bangalore gujarat remote preferred way contact dm suggestions welcome hi knowledgeexperience writing content blockchain crypto blockchain dev company looking mern stack developers blockchain developers hr manager crypto traderanalyst various profiles wfh currently office delhincr please dm interested speak italian russian arabic interested job telesales cold calling lead generation please dm job location manesar near gurugram global manufacturer building material salary lpa also looking regional manager company based malaysia must industry experience malaysia singapore indonesia neighboring countries gt content gt gt seo manager gt gt research analyst mutual funds stocks copywriter remotefriendly amp ft pt gig think mba worth someone cant clear cat gets mba private college paying also think hr scope know field ill see fast growth good im good conflict resolution im cool headed like working people like following rules im th right also matter ba mba rather bba mba employers thank",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "If anyone has questions about MBA in the US I would be happy to answer. For someone who has done MBA in India and is earning around 30L per annum (2 yr exp), is it worth it? The equivalent salary for my role in my company in US is around 150k. Also working for a global corp, so there are opportunities to go outside India. The reason I'm asking this is that I see some of my college seniors go out still. Also, what advantage does a US MBA provide compared to elite European MBA (INSEAD, LBS, Oxford, Cambridge)? What's the case for choosing INSEAD rather than a T15 in US? (apart from 1 yr vs 2 yr) We are a small team working in Financial domain based out of Gurugram. We are hiring for roles across tech &amp; content. **Tech** : Frontend/Backend/Mobile If you are someone who have some experience in building websites/mobile apps or backend services in Javscript or Python then DM me. (freshers are welcome) **Content** : - SEO Manager - Research Analyst ( Mutual Funds / Stocks ) Does anyone know how much Google pays a person who has around 4.5 years experience who is making 18lpa in a different company. Either Hyderabad or Bangalore office Lots of good questions. In my opinion is not worth doing another mba - good schools won’t particularly entertain it unless the candidate has some other exceptional qualities in their resume. Elite European MBAs have cachet in the US - I personally know people/friends that have MBAs from INSEAD and LBS that are working in FAANG or investment banks. That said US MBAs even from non elite schools have cachet all over the US and can help in securing good jobs and immigrating here. I'm working in customer services from last 5 yrs. I've enhanced my speaking nd writing skills , and got placed in ome of the biggest giant in this field that offers good salary. But issue is that it is a 200 yrs old company that falls under fortune 500. They seems to promote people with a decade of experience as there's alot of competition. Also, there's no outside scope for someone who's in customer services as salaries are too low. I don't know how to proceed further from this point. I'm ready to learn new skill, but I just don't know the direction. I love to write nd interact with people. Any genuine suggestion pls. Looking to get hired: Skillset &amp; experience: Technical writer and Junior Business Analyst. Technical documentation. Have 1 year of corporate experience. Also good with SEO writing, technical article writing. Two year of job gap, though I'm open to learning. I'm curious and good at what i do. Location: Pune, Maharashtra. Bangalore. Gujarat. Or Remote Preferred way of contact: DM Any other suggestions are welcome. Hi. Do you have knowledge/experience of writing content for blockchain or crypto? We are a blockchain dev company. Looking for 1. MERN Stack developers 2. Blockchain developers 3. HR manager 4. Crypto Trader/Analyst And various other profiles. WFH currently. Office in Delhi/NCR. Please DM if interested. If you can speak Italian, Russian, or Arabic and interested in a job in telesales, cold calling, lead generation, please DM me. Job location: Manesar (near Gurugram). With a global manufacturer of building material. Salary: 8-10 LPA. Also looking for a Regional Manager for the same company to be based in Malaysia. Must have industry experience in Malaysia, Singapore, Indonesia and neighboring countries. &gt; Content : &gt; &gt; SEO Manager &gt; &gt; Research Analyst ( Mutual Funds / Stocks ) Copywriter here. Are you remote-friendly &amp; is it a FT or PT gig? Do you think MBA is worth doing if someone can't clear CAT? And just gets an MBA in a private college by just paying for it. Also do you think HR has scope? I know its not a field where I'll see fast growth, but is it good if I'm good at conflict resolution, and I'm cool headed, and I like working with people? And I like following rules? I'm in 12th right now. Also does it matter if I do BA then MBA, rather than BBA and MBA to employers? Thank you!"
}