{
    "id": "1435wfh",
    "title": "Leader of Meitei Leepun, Pramot Singh threatening Civil war in Manipur unless Government intervens",
    "url": "https://youtu.be/VDJnPewUhmU",
    "selftext": "\nThis is a long video but  please do watch it. There are more interviews with leaders from both communities(Kukis and Meities )on the YouTube channel.. There is no hiding for his hatred. To have the audacity to threaten a wipe out of an entire community on camera is scary. Check out the last 10 min of the  video atleast.",
    "flair": "Crime",
    "score": 24,
    "num_comments": 3,
    "created_utc": 1686120934.0,
    "convurl": "https://external-preview.redd.it/9KV9kUzvTaeqG16qEM1PfMMq8ZhTbabo_qyguRAS-4k.jpg",
    "comments": [
        "“How this man is not behind bars?”\n\nWaves saffron muffler.\n\n“Oh! That’s how..”",
        "Kuknalim"
    ],
    "cleaned_text": "leader meitei leepun pramot singh threatening civil war manipur unless government intervens long video please watch interviews leaders communitieskukis meities youtube channel hiding hatred audacity threaten wipe entire community camera scary check last min video atleast ",
    "cleaned_title": "leader meitei leepun pramot singh threatening civil war manipur unless government intervens",
    "cleaned_selftext": "long video please watch interviews leaders communitieskukis meities youtube channel hiding hatred audacity threaten wipe entire community camera scary check last min video atleast",
    "cleaned_comments": "man behind bars waves saffron muffler oh thats kuknalim",
    "light_cleaned_title": "Leader of Meitei Leepun, Pramot Singh threatening Civil war in Manipur unless Government intervens",
    "light_cleaned_selftext": "This is a long video but please do watch it. There are more interviews with leaders from both communities(Kukis and Meities )on the YouTube channel.. There is no hiding for his hatred. To have the audacity to threaten a wipe out of an entire community on camera is scary. Check out the last 10 min of the video atleast.",
    "light_cleaned_comments": "“How this man is not behind bars?” Waves saffron muffler. “Oh! That’s how..” Kuknalim"
}