{
    "id": "10vweof",
    "title": "Gaana Plus Subscription - How to log complaints ?",
    "url": "https://www.reddit.com/r/india/comments/10vweof/gaana_plus_subscription_how_to_log_complaints/",
    "selftext": "  There was this offer listed in Sodexo offers and discounts section: **12 months gaana plus subscription**. \n\nUpon signing up with phone number and following below steps to redeem, there was payment link to enable auto payment. I assumed the paid subscription will be effective after 12 months and provided my UPI details. It deducted Rs.499 immediately (yes, I entered my UPI PIN with wrong assumption) .  \nLater realised, actual annual subscription charge is Rs. 299. \n\nAfter this, I can’t see my Gaana Plus subscription anywhere, and Rs.499 is lost .\n\nCouldn't find any direct support/support contact in their website, logging a support request just accepts the complaint and no reference or tracking mechanism to follow up. Seen them responding in social media posts, and contacted there, but no luck. \n\ncan someone suggest how we can contact Gaana?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/02n8qt7b0qga1.png?width=617&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=389a3914daa4c1645435c41de05ab8fc2ef9c922",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1675756983,
    "convurl": "https://a.thumbs.redditmedia.com/jpMqZdhHJAn-qJuCQk9Oiwok9y0kNBpBcImlsR0BHB4.jpg",
    "comments": [
        "Why would you ever put upi pin?\nOnce oin is given nothing can be done. No vank will help you.",
        "I understand that and would not worry if I had got something in return.\nUnfortunately the subscription was also not given"
    ],
    "cleaned_text": "gaana plus subscription log complaints offer listed sodexo offers discounts section months gaana plus subscription upon signing phone number following steps redeem payment link enable auto payment assumed paid subscription effective months provided upi details deducted rs immediately yes entered upi pin wrong assumption later realised actual annual subscription charge rs cant see gaana plus subscription anywhere rs lost couldnt find direct supportsupport contact website logging support request accepts complaint reference tracking mechanism follow seen responding social media posts contacted luck someone suggest contact gaana ampxb ",
    "cleaned_title": "gaana plus subscription log complaints",
    "cleaned_selftext": "offer listed sodexo offers discounts section months gaana plus subscription upon signing phone number following steps redeem payment link enable auto payment assumed paid subscription effective months provided upi details deducted rs immediately yes entered upi pin wrong assumption later realised actual annual subscription charge rs cant see gaana plus subscription anywhere rs lost couldnt find direct supportsupport contact website logging support request accepts complaint reference tracking mechanism follow seen responding social media posts contacted luck someone suggest contact gaana ampxb",
    "cleaned_comments": "would ever put upi pin oin given nothing done vank help understand would worry got something return unfortunately subscription also given",
    "light_cleaned_title": "Gaana Plus Subscription - How to log complaints ?",
    "light_cleaned_selftext": "There was this offer listed in Sodexo offers and discounts section: **12 months gaana plus subscription**. Upon signing up with phone number and following below steps to redeem, there was payment link to enable auto payment. I assumed the paid subscription will be effective after 12 months and provided my UPI details. It deducted Rs.499 immediately (yes, I entered my UPI PIN with wrong assumption) . Later realised, actual annual subscription charge is Rs. 299. After this, I can’t see my Gaana Plus subscription anywhere, and Rs.499 is lost . Couldn't find any direct support/support contact in their website, logging a support request just accepts the complaint and no reference or tracking mechanism to follow up. Seen them responding in social media posts, and contacted there, but no luck. can someone suggest how we can contact Gaana?",
    "light_cleaned_comments": "Why would you ever put upi pin? Once oin is given nothing can be done. No vank will help you. I understand that and would not worry if I had got something in return. Unfortunately the subscription was also not given"
}