{
    "id": "16wqjqg",
    "title": "Canadian with a Nijjar conspiracy theory",
    "url": "https://www.reddit.com/r/india/comments/16wqjqg/canadian_with_a_nijjar_conspiracy_theory/",
    "selftext": "Everybody LOVES conspiracy theories right? So what if the Nijjar killing wasn't really the Indian government, but anti-immigration forces within Canada? To me it seems like Trudeau found the culprit way to easily - if it had been the Indian government, it probably wouldn't have even been the Indian government, but their friends, and the trail probably would have been hidden so much better. False trails are a thing.\n\nThe classic question is who benefits, and India is the number one source of immigrants to Canada right now. That's probably going to slow down. Also really plays into the narrative of how immigration is dangerous, we are importing other country's problems.. I get the impression that Sikhs in India aren't really pushing for Khalistan right now, so it doesn't seem like a priority issue.. Maybe Nijjar was chosen simply because his name would be funny to alt-right goons?\n\nThe assassination happened in Surrey, a city where the RCMP entrapped John Nuttal and Amandy Korody into planting a fake bomb outside the BC legislature ([https://thetyee.ca/Culture/2022/09/13/Love-Story-With-Bombs/](https://thetyee.ca/Culture/2022/09/13/Love-Story-With-Bombs/)). There is actually also a big controversy right now about Surrey switching from the RCMP to a local police force, which would probably be made up of a lot of Sikhs..\n\nI'm not sure how exactly this connects to hiding the true location of Atlantis, but I feel like I'm close to connecting all the dots...",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696131201.0,
    "convurl": "https://external-preview.redd.it/MoO5S1zRr2ogDDCI-0vRn-MVPbksbd7p7Cw6StDZRLY.jpg?auto=webp&s=ec09a6fce9e84168ad0a1d5bd53c339b7e3c4bac",
    "comments": [],
    "cleaned_text": "canadian nijjar conspiracy theory everybody loves conspiracy theories right nijjar killing wasnt really indian government antiimmigration forces within canada seems like trudeau found culprit way easily indian government probably wouldnt even indian government friends trail probably would hidden much better false trails thing classic question benefits india number one source immigrants canada right thats probably going slow also really plays narrative immigration dangerous importing countrys problems get impression sikhs india arent really pushing khalistan right doesnt seem like priority issue maybe nijjar chosen simply name would funny altright goons assassination happened surrey city rcmp entrapped john nuttal amandy korody planting fake bomb outside bc legislature httpsthetyeecaculturelovestorywithbombshttpsthetyeecaculturelovestorywithbombs actually also big controversy right surrey switching rcmp local police force would probably made lot sikhs im sure exactly connects hiding true location atlantis feel like im close connecting dots ",
    "cleaned_title": "canadian nijjar conspiracy theory",
    "cleaned_selftext": "everybody loves conspiracy theories right nijjar killing wasnt really indian government antiimmigration forces within canada seems like trudeau found culprit way easily indian government probably wouldnt even indian government friends trail probably would hidden much better false trails thing classic question benefits india number one source immigrants canada right thats probably going slow also really plays narrative immigration dangerous importing countrys problems get impression sikhs india arent really pushing khalistan right doesnt seem like priority issue maybe nijjar chosen simply name would funny altright goons assassination happened surrey city rcmp entrapped john nuttal amandy korody planting fake bomb outside bc legislature httpsthetyeecaculturelovestorywithbombshttpsthetyeecaculturelovestorywithbombs actually also big controversy right surrey switching rcmp local police force would probably made lot sikhs im sure exactly connects hiding true location atlantis feel like im close connecting dots",
    "cleaned_comments": "",
    "light_cleaned_title": "Canadian with a Nijjar conspiracy theory",
    "light_cleaned_selftext": "Everybody LOVES conspiracy theories right? So what if the Nijjar killing wasn't really the Indian government, but anti-immigration forces within Canada? To me it seems like Trudeau found the culprit way to easily - if it had been the Indian government, it probably wouldn't have even been the Indian government, but their friends, and the trail probably would have been hidden so much better. False trails are a thing. The classic question is who benefits, and India is the number one source of immigrants to Canada right now. That's probably going to slow down. Also really plays into the narrative of how immigration is dangerous, we are importing other country's problems.. I get the impression that Sikhs in India aren't really pushing for Khalistan right now, so it doesn't seem like a priority issue.. Maybe Nijjar was chosen simply because his name would be funny to alt-right goons? The assassination happened in Surrey, a city where the RCMP entrapped John Nuttal and Amandy Korody into planting a fake bomb outside the BC legislature ([https://thetyee.ca/Culture/2022/09/13/Love-Story-With-Bombs/](https://thetyee.ca/Culture/2022/09/13/Love-Story-With-Bombs/)). There is actually also a big controversy right now about Surrey switching from the RCMP to a local police force, which would probably be made up of a lot of Sikhs.. I'm not sure how exactly this connects to hiding the true location of Atlantis, but I feel like I'm close to connecting all the dots...",
    "light_cleaned_comments": ""
}