{
    "id": "1d6e2vr",
    "title": "India to increase road toll charges from Monday",
    "url": "https://www.hindustantimes.com/india-news/india-to-increase-road-toll-charges-from-monday-101717331163726.html",
    "selftext": "5 percent increase on already high toll charges. ",
    "flair": "Policy/Economy",
    "score": 285,
    "num_comments": 34,
    "created_utc": 1717337213.0,
    "convurl": "https://external-preview.redd.it/jER7sNrZqenhgse-E3DeXyRdgQHVemHBRuX-uE65nWQ.jpg",
    "comments": [
        "People did this to themselves by voting for \"You Know Who\". Enjoy.",
        "Election over \n\nTime to bleed us",
        "Not only the road tax, but also the prices of most commodities will increase after 4th June.",
        "When you can buy rs 500 pop corn then why don't you Pakistan",
        "MORE ACHE DIN",
        "Sher ko pala hai. /s",
        "Petrol diesel LPG bhar lo",
        "You get what you deserve \n\nThis is the result",
        "Good job people voting for the self proclaimed god. You all deserve this.",
        "A lovely shoutout for people who posted, voted for dictatorship.",
        "Ha, the fuck you note arrived early this time.",
        "Election over!\n\nTime to roll us over!",
        "Good thing India voted for BJP, here is the prize. Enjoy.",
        "Lol enjoy the next term everyone.",
        "Arre bhai, koi hamare burre din lauta do!",
        "but we put leftists in place bro. liberal MeLTdOwN on June 4th bro. voted for dictatorship /s",
        "Amrit kaal",
        "Election over! \n\nFor the last time.",
        "Sher paala hai toh kharche honge! \n\n/s ofc",
        "Is there a website, where I can browse the historical taxes for a given toll plaza?",
        "Time to \"bless\" us",
        "a gaya modi…phirse",
        "I don’t travel by road so I don’t care if toll price is increased /s",
        "Dollar will also increase.",
        "Chickens for KFC",
        "Viksit Bharat",
        "Give that car to me /s"
    ],
    "cleaned_text": "india increase road toll charges monday percent increase already high toll charges ",
    "cleaned_title": "india increase road toll charges monday",
    "cleaned_selftext": "percent increase already high toll charges",
    "cleaned_comments": "people voting know enjoy election time bleed us road tax also prices commodities increase th june buy rs pop corn dont pakistan ache din sher ko pala hai petrol diesel lpg bhar lo get deserve result good job people voting self proclaimed god deserve lovely shoutout people posted voted dictatorship ha fuck note arrived early time election time roll us good thing india voted bjp prize enjoy lol enjoy next term everyone arre bhai koi hamare burre din lauta put leftists place bro liberal meltdown june th bro voted dictatorship amrit kaal election last time sher paala hai toh kharche honge ofc website browse historical taxes given toll plaza time bless us gaya modiphirse dont travel road dont care toll price increased dollar also increase chickens kfc viksit bharat give car",
    "light_cleaned_title": "India to increase road toll charges from Monday",
    "light_cleaned_selftext": "5 percent increase on already high toll charges.",
    "light_cleaned_comments": "People did this to themselves by voting for \"You Know Who\". Enjoy. Election over Time to bleed us Not only the road tax, but also the prices of most commodities will increase after 4th June. When you can buy rs 500 pop corn then why don't you Pakistan MORE ACHE DIN Sher ko pala hai. /s Petrol diesel LPG bhar lo You get what you deserve This is the result Good job people voting for the self proclaimed god. You all deserve this. A lovely shoutout for people who posted, voted for dictatorship. Ha, the fuck you note arrived early this time. Election over! Time to roll us over! Good thing India voted for BJP, here is the prize. Enjoy. Lol enjoy the next term everyone. Arre bhai, koi hamare burre din lauta do! but we put leftists in place bro. liberal MeLTdOwN on June 4th bro. voted for dictatorship /s Amrit kaal Election over! For the last time. Sher paala hai toh kharche honge! /s ofc Is there a website, where I can browse the historical taxes for a given toll plaza? Time to \"bless\" us a gaya modi…phirse I don’t travel by road so I don’t care if toll price is increased /s Dollar will also increase. Chickens for KFC Viksit Bharat Give that car to me /s"
}