{
    "id": "15o241d",
    "title": "That's it. This is the end of me.",
    "url": "https://www.reddit.com/r/india/comments/15o241d/thats_it_this_is_the_end_of_me/",
    "selftext": "&#x200B;\n\nhttps://i.redd.it/tls2mgp7jfhb1.gif\n\nI am not one to cry that often. I just say 'It is what it is' and move on.   \n\n\n\\[Im 23 female by the way\\]\n\nBut I think I NEED to vent to fellow Indians since in real life .... none of you would give me the time of the day. Not even my parents. \n\nI promise I wont take much of your time, there are more intresting and more tragic and heartbreaking  posts than this and Im sure u'd rather read those than read about the life of a loner. \n\n&#x200B;\n\n* Gave NEET 5 fucking times. Failed. \n* Desi parents hain na..... they got upset. Started flashing photos of cousins with IIT placements in my face.\n* Gave CUET-PG this year. \n* Is not eligible for Msc zoology in DU. (Low marks)\n\n&#x200B;\n\nhttps://preview.redd.it/sojelzmwlfhb1.png?width=1849&format=png&auto=webp&s=8e6b8fdb5ab695b2246eefe406a49583fede190b\n\n* JNU dosent have a pg program in this subject.\n* All other colleges that lie under CUET-PG  are either-- **a)** T000 costly (Im talking 80000/- per semester) **b)** Have engg. /management (I dont like either) **c)** Are too far away (Manipur and Keral Telangana, Uttrakhand, Rajasthan) \n* Registration date of many collges has already passed.\n* I am fighting with my parents everyday. One of these days If i let my intrusive thoughts win, I fear that I might run away or I might end everything.🟥\n* I only have a menial [B.Sc](https://B.Sc) in zoology from CJMU (Not classroom, but long distance)\n* I have no skill (unless u count reading books as a skill ...which in fact, isint)\n* I have no job prospects.\n* My parents hate me. DEEPLY LOATHE me. \n* I havent been out of my house for 5 years since I was preparing, so now I feel like ..... i feel this insane urge to get away and get outside from everything.\n* All I do at home is eat, sleep, yell at my parents. \n* See my cousins acing every fucking thing. And then crying to sleep.\n\nAre there any colleges I can still apply to?I need to get away from these people. or I wil go crazy. Insanity during solitary confinement is a real thing. No friends. No phone. No social life. \n\nThis is the list of colleges--\n\n[https://university.careers360.com/articles/cuet-pg-participating-universities](https://university.careers360.com/articles/cuet-pg-participating-universities) ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691739368.0,
    "convurl": "https://b.thumbs.redditmedia.com/PFdL_7DCmXetTTOiEATrgH9k7kOvtlFMpZDnBvSeauE.jpg",
    "comments": [
        "Post something derogatory against the government and then apply for political asylum with European embassies, Canada, NZ, Aus etc. Profit.",
        "You can take up a part time job for now in the bpo industry. These jobs mainly require communication skills. The pay won't be much but it's better than nothing.",
        "I'm so sorry. I know how it feels.",
        "I don't know about colleges or anything but don't talk about ending things ma'am and i believe you will do good soon. I wish you luck happiness and success"
    ],
    "cleaned_text": "thats end xb one cry often say move im female way think need vent fellow indians since real life none would give time day even parents promise wont take much time intresting tragic heartbreaking posts im sure ud rather read read life loner xb gave neet fucking times failed desi parents hain na got upset started flashing photos cousins iit placements face gave cuetpg year eligible msc zoology du low marks xb jnu dosent pg program subject colleges lie cuetpg either costly im talking per semester b engg management dont like either c far away manipur keral telangana uttrakhand rajasthan registration date many collges already passed fighting parents everyday one days let intrusive thoughts win fear might run away might end everything menial bschttpsbsc zoology cjmu classroom long distance skill unless u count reading books skill fact isint job prospects parents hate deeply loathe havent house years since preparing feel like feel insane urge get away get outside everything home eat sleep yell parents see cousins acing every fucking thing crying sleep colleges still apply toi need get away people wil go crazy insanity solitary confinement real thing friends phone social life list colleges httpsuniversitycareerscomarticlescuetpgparticipatinguniversitieshttpsuniversitycareerscomarticlescuetpgparticipatinguniversities ",
    "cleaned_title": "thats end",
    "cleaned_selftext": "xb one cry often say move im female way think need vent fellow indians since real life none would give time day even parents promise wont take much time intresting tragic heartbreaking posts im sure ud rather read read life loner xb gave neet fucking times failed desi parents hain na got upset started flashing photos cousins iit placements face gave cuetpg year eligible msc zoology du low marks xb jnu dosent pg program subject colleges lie cuetpg either costly im talking per semester b engg management dont like either c far away manipur keral telangana uttrakhand rajasthan registration date many collges already passed fighting parents everyday one days let intrusive thoughts win fear might run away might end everything menial bschttpsbsc zoology cjmu classroom long distance skill unless u count reading books skill fact isint job prospects parents hate deeply loathe havent house years since preparing feel like feel insane urge get away get outside everything home eat sleep yell parents see cousins acing every fucking thing crying sleep colleges still apply toi need get away people wil go crazy insanity solitary confinement real thing friends phone social life list colleges httpsuniversitycareerscomarticlescuetpgparticipatinguniversitieshttpsuniversitycareerscomarticlescuetpgparticipatinguniversities",
    "cleaned_comments": "post something derogatory government apply political asylum european embassies canada nz aus etc profit take part time job bpo industry jobs mainly require communication skills pay wont much better nothing im sorry know feels dont know colleges anything dont talk ending things maam believe good soon wish luck happiness success",
    "light_cleaned_title": "That's it. This is the end of me.",
    "light_cleaned_selftext": "&#x200B; I am not one to cry that often. I just say 'It is what it is' and move on. \\[Im 23 female by the way\\] But I think I NEED to vent to fellow Indians since in real life .... none of you would give me the time of the day. Not even my parents. I promise I wont take much of your time, there are more intresting and more tragic and heartbreaking posts than this and Im sure u'd rather read those than read about the life of a loner. &#x200B; * Gave NEET 5 fucking times. Failed. * Desi parents hain na..... they got upset. Started flashing photos of cousins with IIT placements in my face. * Gave CUET-PG this year. * Is not eligible for Msc zoology in DU. (Low marks) &#x200B; * JNU dosent have a pg program in this subject. * All other colleges that lie under CUET-PG are either-- **a)** T000 costly (Im talking 80000/- per semester) **b)** Have engg. /management (I dont like either) **c)** Are too far away (Manipur and Keral Telangana, Uttrakhand, Rajasthan) * Registration date of many collges has already passed. * I am fighting with my parents everyday. One of these days If i let my intrusive thoughts win, I fear that I might run away or I might end everything.🟥 * I only have a menial [B.Sc](https://B.Sc) in zoology from CJMU (Not classroom, but long distance) * I have no skill (unless u count reading books as a skill ...which in fact, isint) * I have no job prospects. * My parents hate me. DEEPLY LOATHE me. * I havent been out of my house for 5 years since I was preparing, so now I feel like ..... i feel this insane urge to get away and get outside from everything. * All I do at home is eat, sleep, yell at my parents. * See my cousins acing every fucking thing. And then crying to sleep. Are there any colleges I can still apply to?I need to get away from these people. or I wil go crazy. Insanity during solitary confinement is a real thing. No friends. No phone. No social life. This is the list of colleges-- [https://university.careers360.com/articles/cuet-pg-participating-universities](https://university.careers360.com/articles/cuet-pg-participating-universities)",
    "light_cleaned_comments": "Post something derogatory against the government and then apply for political asylum with European embassies, Canada, NZ, Aus etc. Profit. You can take up a part time job for now in the bpo industry. These jobs mainly require communication skills. The pay won't be much but it's better than nothing. I'm so sorry. I know how it feels. I don't know about colleges or anything but don't talk about ending things ma'am and i believe you will do good soon. I wish you luck happiness and success"
}