{
    "id": "1178o7d",
    "title": "Hathway Torture",
    "url": "https://www.reddit.com/r/india/comments/1178o7d/hathway_torture/",
    "selftext": "I have been receiving multiple calls every single day from ***Hathway broadband*** even after permanently disconnecting my internet connection. Its been 4 months now.\n\nI mailed them multiple times, no reply.\n\nI raised a complaint at [https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/) regarding this issue,\n\nI attached a copy of the complaint and send the email to Hathway team,\n\nand to my surprise I got an immediately reply saying they won't call me again and marked me under *'Do Not Disturb'.*\n\nI hope they wont call me anymore, I will wait and watch.\n\nI hope this post can help my fellow hathway sufferers and follow this strategy and let me know if this works.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ojjo0xbiycja1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=8190e3361c93af7418dcef69e85aab52cb37ffc7\n\nhttps://preview.redd.it/ondl28ciycja1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cd17dd4d865e6d6f8b1d8ffcb45319e5b6b87fa9",
    "flair": "Rant / Vent",
    "score": 35,
    "num_comments": 13,
    "created_utc": 1676905155,
    "convurl": "https://b.thumbs.redditmedia.com/uLdl-IOOc7Cf3D6TgNH4w3r_86F0sKV46OWLzKuqHRE.jpg",
    "comments": [
        "Went through the same , only thing you can do is change the number on your hathway account. Which again is difficult task",
        "Did that too. No luck.",
        "They are a nuisance. They won't close your account for a reason to show number if subscribers. Block and ignore them.",
        "I can understand , call the hathway guy of your locality and tell him to update your number , without telling him the real reason . \n\n\nUnethical trick is to get the company ID of the person calling you and threaten or scare him saying you will complain in his name of he doesn't update the number. Worked for my lawyer friend",
        "My friend was getting installed a new. Hathway connection. Everything was confirmed he was just paying when I reached there.\nI asked what it's about he told that it's a hathway I said a blunt no and explained him the reason. He didn't listened to me. He disconnected the connection after few months. It's been two years he gets the call daily and he cries and I laugh.",
        "more than 3 years, they still call me. I cut immediately whenever I hear \"hathway\", but they still call me",
        "Same here, can't change my number",
        "Anne Hathaway should really do something about these reprehensible business practices\n\n![gif](giphy|3oz8xtu7GFYQmBnWlG)",
        "What they say",
        "Same here. Tweeted to them to stop that shit, they stopped it. Anyone closing their Hathaway account make sure you get a receipt when giving up the router.",
        "Same with Airtel DTH. Just made a query and I get calls every other day and have blocked almost 30 numbers 🥹",
        "Change ur phone number, thats the only way out bro",
        "Email their nodal officer. You can easily find it on google. I went through what you're going through on and off for 6 years. Once I got calls for 5 days straight and snapped on the caller, they started messaging me on WhatsApp too.\nI finally wrote an email to their nodal officer and they assured me they'll handle it. After a couple of emails back and forth, it finally stopped. Haven't gotten a call in the past year."
    ],
    "cleaned_text": "hathway torture receiving multiple calls every single day hathway broadband even permanently disconnecting internet connection months mailed multiple times reply raised complaint httpsconsumerhelplinegovinhttpsconsumerhelplinegovin regarding issue attached copy complaint send email hathway team surprise got immediately reply saying wont call marked disturb hope wont call anymore wait watch hope post help fellow hathway sufferers follow strategy let know works ampxb ",
    "cleaned_title": "hathway torture",
    "cleaned_selftext": "receiving multiple calls every single day hathway broadband even permanently disconnecting internet connection months mailed multiple times reply raised complaint httpsconsumerhelplinegovinhttpsconsumerhelplinegovin regarding issue attached copy complaint send email hathway team surprise got immediately reply saying wont call marked disturb hope wont call anymore wait watch hope post help fellow hathway sufferers follow strategy let know works ampxb",
    "cleaned_comments": "went thing change number hathway account difficult task luck nuisance wont close account reason show number subscribers block ignore understand call hathway guy locality tell update number without telling real reason unethical trick get company id person calling threaten scare saying complain name doesnt update number worked lawyer friend friend getting installed new hathway connection everything confirmed paying reached asked told hathway said blunt explained reason didnt listened disconnected connection months two years gets call daily cries laugh years still call cut immediately whenever hear hathway still call cant change number anne hathaway really something reprehensible business practices gifgiphyozxtugfyqmbnwlg say tweeted stop shit stopped anyone closing hathaway account make sure get receipt giving router airtel dth made query get calls every day blocked almost numbers change ur phone number thats way bro email nodal officer easily find google went youre going years got calls days straight snapped caller started messaging whatsapp finally wrote email nodal officer assured theyll handle couple emails back forth finally stopped havent gotten call past year",
    "light_cleaned_title": "Hathway Torture",
    "light_cleaned_selftext": "I have been receiving multiple calls every single day from ***Hathway broadband*** even after permanently disconnecting my internet connection. Its been 4 months now. I mailed them multiple times, no reply. I raised a complaint at [https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/) regarding this issue, I attached a copy of the complaint and send the email to Hathway team, and to my surprise I got an immediately reply saying they won't call me again and marked me under *'Do Not Disturb'.* I hope they wont call me anymore, I will wait and watch. I hope this post can help my fellow hathway sufferers and follow this strategy and let me know if this works.",
    "light_cleaned_comments": "Went through the same , only thing you can do is change the number on your hathway account. Which again is difficult task Did that too. No luck. They are a nuisance. They won't close your account for a reason to show number if subscribers. Block and ignore them. I can understand , call the hathway guy of your locality and tell him to update your number , without telling him the real reason . Unethical trick is to get the company ID of the person calling you and threaten or scare him saying you will complain in his name of he doesn't update the number. Worked for my lawyer friend My friend was getting installed a new. Hathway connection. Everything was confirmed he was just paying when I reached there. I asked what it's about he told that it's a hathway I said a blunt no and explained him the reason. He didn't listened to me. He disconnected the connection after few months. It's been two years he gets the call daily and he cries and I laugh. more than 3 years, they still call me. I cut immediately whenever I hear \"hathway\", but they still call me Same here, can't change my number Anne Hathaway should really do something about these reprehensible business practices ![gif](giphy|3oz8xtu7GFYQmBnWlG) What they say Same here. Tweeted to them to stop that shit, they stopped it. Anyone closing their Hathaway account make sure you get a receipt when giving up the router. Same with Airtel DTH. Just made a query and I get calls every other day and have blocked almost 30 numbers 🥹 Change ur phone number, thats the only way out bro Email their nodal officer. You can easily find it on google. I went through what you're going through on and off for 6 years. Once I got calls for 5 days straight and snapped on the caller, they started messaging me on WhatsApp too. I finally wrote an email to their nodal officer and they assured me they'll handle it. After a couple of emails back and forth, it finally stopped. Haven't gotten a call in the past year."
}