{
    "id": "16lt2nf",
    "title": "Over-apartmentalization! Another urban planning problem taking root in India",
    "url": "https://www.reddit.com/r/india/comments/16lt2nf/overapartmentalization_another_urban_planning/",
    "selftext": "Hello,  \nLately i have noticed a trend (at least in Delhi-NCR, dunno how) of residential plots which used to be duplex houses or single homes being converted into apartments (by local builders mostly)\n\nUsually, someone's parents or grandparents bought the land or got the house in 90's or 80's and now once they have passed away, the children decide they don't want to live together ( mostly after marriage) and decide to sell the house or plot to a builder to split the money earned from selling it. \n\nThe builders then take this plot and build an apartment over it. Sometimes the plot is cut into small pieces and then several different apartment units are built over it ( i have seen a 150-200 Guz plot being split into three 1bhk apartments next to each other).\n\nNow, in a way this is good for middle class folks, they get to buy a \"decent home\" within the city this way (I'm middle class and did buy a home like this) but the problem is the unregulated and rapid building of such apartments --\n\nLike, when i was in school, there were areas with a lush green park in the center that used to be surrounded by single homes and a single road surrounding the park have now turned ENTIRELY into apartments from 1bhk to 3bhk side by side -- wall to ass. Not even one large home remains.\n\nNow i have no special fetish for large single homes.\n\nThis is bad because of a simple reason, on a piece of land where 5 people used to live, now 60 people live in the same space. An area which used to have 15 families in total has now almost a couple hundred of family living in the same place, more if the plots are cut into smaller plots.\n\nThis puts a lot of pressure on the internal single lane roads -- they're almost always choked. Parks are overburdened and dirty. Electricity transformers keep blowing up. Sewage overflow issues.  Parking conflicts. Too many dumbass idiot feeding the street dogs. Never ending traffic on internal roads that used to empty in the surrounding areas are now almost too busy and stuck with traffic. Mesh of power and internet lines overhead. Endless noise pollution. Waste management issues. Most of these apartments are built haphazardly with no concern for aesthetics and look ugly as hell next to each other, like ghettos often with no to insufficient parking -- leading to people parking on the roads.\n\nThese areas and roads were usually build in the 90s, 80s or earlier and weren't designed for so many people living there. The builders and people want to earn a quick buck. Government doesn't give a shit. \n\nSome people in areas that used to have single homes started selling once apartmentalization started there because either tall apartments would block sunlight and wind into their homes or parking issues started popping up or they felt a lack of privacy with suddenly so many people into a small spot in the same area.\n\nThis same stuff was starting to happen in Chandigarh until a man took it to court and stopped it --[https://realty.economictimes.indiatimes.com/news/regulatory/sc-bars-apartmentalization-of-residential-units-in-chandigarh/96900014](https://realty.economictimes.indiatimes.com/news/regulatory/sc-bars-apartmentalization-of-residential-units-in-chandigarh/96900014)\n\nDon't know what the solution for this is...limiting apartmentalization to a certain number? Developing suburban areas ...?  \n",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695036922.0,
    "convurl": "https://external-preview.redd.it/N1W7uOlXF78GPifb3ZmfhBjBmsj5zdZzh4BReEv_MnA.jpg?auto=webp&s=2db953a2b2300ab3dc4aacfd339c68bc2fc8517d",
    "comments": [
        "Take them to court and be like the man from Chandigarh.",
        "Happens in Bangalore as well. From what I have seen, the people who live in these apartments are mostly tenants, and the landlords are either the original owners who owned the independent house, or the builder. There is no point buying apartments like this, because you neither get the freedom of an independent house, nor have the common facilities (gym, walking area, play area) etc. of a proper apartment block.  \n\nA street that is inhabited mostly by tenants changes the character of the locality, because tenants rarely have the incentive to look at things from a long term, leading to the problems that you mentioned (parking, noise etc.)",
        "Yeah i agree with your point about buying. While this is better than the last place i was in by a big mile, all these problems do make me think of selling the house as soon as i can.",
        "I fear the day when Earthquake comes.\n\nSeeing Turkey apartments crumble to floor, I've decided to never ever live in an apartment.\n\nBut apartments are efficient way to provide for housing needs of a huge working population as of now.",
        "The problem had just begun to show up in Chandigarh when the uncle litigated and kicked all the builder's and owner's asses.\n\nHere the problem is already root deep. \n\nLitigating it would mean taking on the might and pride of local builders ( who have lots of political connections and thugs on their side), rich house owners and the government who gets to earn fat taxes from the registeries of such apartments. I only have my cat on my side.",
        "Millions of people live in slums due to this elitist attitude of the government. Apartmentalisation must happen. Only this can help everyone get a decent home. In fact we need higher apartments. An artificial scarcity is being created due to these elite uncles. People are forced to live in far off places and then emit CO2 to commute.",
        "Apartmentalization is fine to a certain extent. Agree with need for higher apartments. Over and unregulated apartmentalisation is bad. \n\nDid you not read the stuff about how over-apartmentalisation is choking the area that wasn't designed for it? \n\nThere you go again with your blind hate for the rich. Yes, a lot of the rich are corrupt , elitist assholes but a lot of the not so wealthy are also corrupt, elitist assholes, the rich only have the means to express it better. \n\nIn the article, that Chandigarh man has spent all his retirement money to buy a decent home and started facing problems due to apartmentalisation, but i guess he was \"elitist\"\n\nYou must see how unbridled apartmentalization turns the area to crap compared to when there used to be single homes around it.",
        "it shouldn't be apartments as described by OP. Its should be more of 5-6 floors flats with underground parking and shops at the ground floor.",
        "Without the supporting infrastructure to handle the increased density of people living, this just ruins the land. Look at Bangalore for an example. It used to be called garden City. It's now a concrete jungle. There has to be strict building regulations to control this. Increased apartment buildings also causes more heat to be retained, obstructing wind flow. Concrete itself retains heat and makes living conditions worse. Instead of vertical growth why not expand horizontally. There's nothing elitist about it. These apartments aren't going up due to an altruistic desire for other people. It's fuelled by greed from the seller and the builder.",
        "That ain't the problem. It's the lack of urban planning",
        "Let's say a family was leaving in a single home/duplex. Family has three sons. They want to stay in united family. What option do they have apart from apartmentalising their single home? Now we can argue that it is a very small subset of people, maximum are builders but it doesn't matter because root problem is lack of affordable housing within city. Even family leaving in these apartment will require bigger or more floors after 15-20 years. \n\nIt's necessity. I believe govt should start creating multi storey societies within city as well which will reduce residential land requirement and free up space for parking, parks and other amenities.\n\nIdk even why Chandigarh didn't create lot's of multi storey societies when it was a planned city."
    ],
    "cleaned_text": "overapartmentalization another urban planning problem taking root india hello lately noticed trend least delhincr dunno residential plots used duplex houses single homes converted apartments local builders mostly usually someones parents grandparents bought land got house passed away children decide dont want live together mostly marriage decide sell house plot builder split money earned selling builders take plot build apartment sometimes plot cut small pieces several different apartment units built seen guz plot split three bhk apartments next way good middle class folks get buy decent home within city way im middle class buy home like problem unregulated rapid building apartments like school areas lush green park center used surrounded single homes single road surrounding park turned entirely apartments bhk bhk side side wall ass even one large home remains special fetish large single homes bad simple reason piece land people used live people live space area used families total almost couple hundred family living place plots cut smaller plots puts lot pressure internal single lane roads theyre almost always choked parks overburdened dirty electricity transformers keep blowing sewage overflow issues parking conflicts many dumbass idiot feeding street dogs never ending traffic internal roads used empty surrounding areas almost busy stuck traffic mesh power internet lines overhead endless noise pollution waste management issues apartments built haphazardly concern aesthetics look ugly hell next like ghettos often insufficient parking leading people parking roads areas roads usually build earlier werent designed many people living builders people want earn quick buck government doesnt give shit people areas used single homes started selling apartmentalization started either tall apartments would block sunlight wind homes parking issues started popping felt lack privacy suddenly many people small spot area stuff starting happen chandigarh man took court stopped httpsrealtyeconomictimesindiatimescomnewsregulatoryscbarsapartmentalizationofresidentialunitsinchandigarhhttpsrealtyeconomictimesindiatimescomnewsregulatoryscbarsapartmentalizationofresidentialunitsinchandigarh dont know solution islimiting apartmentalization certain number developing suburban areas ",
    "cleaned_title": "overapartmentalization another urban planning problem taking root india",
    "cleaned_selftext": "hello lately noticed trend least delhincr dunno residential plots used duplex houses single homes converted apartments local builders mostly usually someones parents grandparents bought land got house passed away children decide dont want live together mostly marriage decide sell house plot builder split money earned selling builders take plot build apartment sometimes plot cut small pieces several different apartment units built seen guz plot split three bhk apartments next way good middle class folks get buy decent home within city way im middle class buy home like problem unregulated rapid building apartments like school areas lush green park center used surrounded single homes single road surrounding park turned entirely apartments bhk bhk side side wall ass even one large home remains special fetish large single homes bad simple reason piece land people used live people live space area used families total almost couple hundred family living place plots cut smaller plots puts lot pressure internal single lane roads theyre almost always choked parks overburdened dirty electricity transformers keep blowing sewage overflow issues parking conflicts many dumbass idiot feeding street dogs never ending traffic internal roads used empty surrounding areas almost busy stuck traffic mesh power internet lines overhead endless noise pollution waste management issues apartments built haphazardly concern aesthetics look ugly hell next like ghettos often insufficient parking leading people parking roads areas roads usually build earlier werent designed many people living builders people want earn quick buck government doesnt give shit people areas used single homes started selling apartmentalization started either tall apartments would block sunlight wind homes parking issues started popping felt lack privacy suddenly many people small spot area stuff starting happen chandigarh man took court stopped httpsrealtyeconomictimesindiatimescomnewsregulatoryscbarsapartmentalizationofresidentialunitsinchandigarhhttpsrealtyeconomictimesindiatimescomnewsregulatoryscbarsapartmentalizationofresidentialunitsinchandigarh dont know solution islimiting apartmentalization certain number developing suburban areas",
    "cleaned_comments": "take court like man chandigarh happens bangalore well seen people live apartments mostly tenants landlords either original owners owned independent house builder point buying apartments like neither get freedom independent house common facilities gym walking area play area etc proper apartment block street inhabited mostly tenants changes character locality tenants rarely incentive look things long term leading problems mentioned parking noise etc yeah agree point buying better last place big mile problems make think selling house soon fear day earthquake comes seeing turkey apartments crumble floor ive decided never ever live apartment apartments efficient way provide housing needs huge working population problem begun show chandigarh uncle litigated kicked builders owners asses problem already root deep litigating would mean taking might pride local builders lots political connections thugs side rich house owners government gets earn fat taxes registeries apartments cat side millions people live slums due elitist attitude government apartmentalisation must happen help everyone get decent home fact need higher apartments artificial scarcity created due elite uncles people forced live far places emit co commute apartmentalization fine certain extent agree need higher apartments unregulated apartmentalisation bad read stuff overapartmentalisation choking area wasnt designed go blind hate rich yes lot rich corrupt elitist assholes lot wealthy also corrupt elitist assholes rich means express better article chandigarh man spent retirement money buy decent home started facing problems due apartmentalisation guess elitist must see unbridled apartmentalization turns area crap compared used single homes around shouldnt apartments described op floors flats underground parking shops ground floor without supporting infrastructure handle increased density people living ruins land look bangalore example used called garden city concrete jungle strict building regulations control increased apartment buildings also causes heat retained obstructing wind flow concrete retains heat makes living conditions worse instead vertical growth expand horizontally theres nothing elitist apartments arent going due altruistic desire people fuelled greed seller builder aint problem lack urban planning lets say family leaving single homeduplex family three sons want stay united family option apart apartmentalising single home argue small subset people maximum builders doesnt matter root problem lack affordable housing within city even family leaving apartment require bigger floors years necessity believe govt start creating multi storey societies within city well reduce residential land requirement free space parking parks amenities idk even chandigarh didnt create lots multi storey societies planned city",
    "light_cleaned_title": "Over-apartmentalization! Another urban planning problem taking root in India",
    "light_cleaned_selftext": "Hello, Lately i have noticed a trend (at least in Delhi-NCR, dunno how) of residential plots which used to be duplex houses or single homes being converted into apartments (by local builders mostly) Usually, someone's parents or grandparents bought the land or got the house in 90's or 80's and now once they have passed away, the children decide they don't want to live together ( mostly after marriage) and decide to sell the house or plot to a builder to split the money earned from selling it. The builders then take this plot and build an apartment over it. Sometimes the plot is cut into small pieces and then several different apartment units are built over it ( i have seen a 150-200 Guz plot being split into three 1bhk apartments next to each other). Now, in a way this is good for middle class folks, they get to buy a \"decent home\" within the city this way (I'm middle class and did buy a home like this) but the problem is the unregulated and rapid building of such apartments -- Like, when i was in school, there were areas with a lush green park in the center that used to be surrounded by single homes and a single road surrounding the park have now turned ENTIRELY into apartments from 1bhk to 3bhk side by side -- wall to ass. Not even one large home remains. Now i have no special fetish for large single homes. This is bad because of a simple reason, on a piece of land where 5 people used to live, now 60 people live in the same space. An area which used to have 15 families in total has now almost a couple hundred of family living in the same place, more if the plots are cut into smaller plots. This puts a lot of pressure on the internal single lane roads -- they're almost always choked. Parks are overburdened and dirty. Electricity transformers keep blowing up. Sewage overflow issues. Parking conflicts. Too many dumbass idiot feeding the street dogs. Never ending traffic on internal roads that used to empty in the surrounding areas are now almost too busy and stuck with traffic. Mesh of power and internet lines overhead. Endless noise pollution. Waste management issues. Most of these apartments are built haphazardly with no concern for aesthetics and look ugly as hell next to each other, like ghettos often with no to insufficient parking -- leading to people parking on the roads. These areas and roads were usually build in the 90s, 80s or earlier and weren't designed for so many people living there. The builders and people want to earn a quick buck. Government doesn't give a shit. Some people in areas that used to have single homes started selling once apartmentalization started there because either tall apartments would block sunlight and wind into their homes or parking issues started popping up or they felt a lack of privacy with suddenly so many people into a small spot in the same area. This same stuff was starting to happen in Chandigarh until a man took it to court and stopped it --[https://realty.economictimes.indiatimes.com/news/regulatory/sc-bars-apartmentalization-of-residential-units-in-chandigarh/96900014](https://realty.economictimes.indiatimes.com/news/regulatory/sc-bars-apartmentalization-of-residential-units-in-chandigarh/96900014) Don't know what the solution for this is...limiting apartmentalization to a certain number? Developing suburban areas ...?",
    "light_cleaned_comments": "Take them to court and be like the man from Chandigarh. Happens in Bangalore as well. From what I have seen, the people who live in these apartments are mostly tenants, and the landlords are either the original owners who owned the independent house, or the builder. There is no point buying apartments like this, because you neither get the freedom of an independent house, nor have the common facilities (gym, walking area, play area) etc. of a proper apartment block. A street that is inhabited mostly by tenants changes the character of the locality, because tenants rarely have the incentive to look at things from a long term, leading to the problems that you mentioned (parking, noise etc.) Yeah i agree with your point about buying. While this is better than the last place i was in by a big mile, all these problems do make me think of selling the house as soon as i can. I fear the day when Earthquake comes. Seeing Turkey apartments crumble to floor, I've decided to never ever live in an apartment. But apartments are efficient way to provide for housing needs of a huge working population as of now. The problem had just begun to show up in Chandigarh when the uncle litigated and kicked all the builder's and owner's asses. Here the problem is already root deep. Litigating it would mean taking on the might and pride of local builders ( who have lots of political connections and thugs on their side), rich house owners and the government who gets to earn fat taxes from the registeries of such apartments. I only have my cat on my side. Millions of people live in slums due to this elitist attitude of the government. Apartmentalisation must happen. Only this can help everyone get a decent home. In fact we need higher apartments. An artificial scarcity is being created due to these elite uncles. People are forced to live in far off places and then emit CO2 to commute. Apartmentalization is fine to a certain extent. Agree with need for higher apartments. Over and unregulated apartmentalisation is bad. Did you not read the stuff about how over-apartmentalisation is choking the area that wasn't designed for it? There you go again with your blind hate for the rich. Yes, a lot of the rich are corrupt , elitist assholes but a lot of the not so wealthy are also corrupt, elitist assholes, the rich only have the means to express it better. In the article, that Chandigarh man has spent all his retirement money to buy a decent home and started facing problems due to apartmentalisation, but i guess he was \"elitist\" You must see how unbridled apartmentalization turns the area to crap compared to when there used to be single homes around it. it shouldn't be apartments as described by OP. Its should be more of 5-6 floors flats with underground parking and shops at the ground floor. Without the supporting infrastructure to handle the increased density of people living, this just ruins the land. Look at Bangalore for an example. It used to be called garden City. It's now a concrete jungle. There has to be strict building regulations to control this. Increased apartment buildings also causes more heat to be retained, obstructing wind flow. Concrete itself retains heat and makes living conditions worse. Instead of vertical growth why not expand horizontally. There's nothing elitist about it. These apartments aren't going up due to an altruistic desire for other people. It's fuelled by greed from the seller and the builder. That ain't the problem. It's the lack of urban planning Let's say a family was leaving in a single home/duplex. Family has three sons. They want to stay in united family. What option do they have apart from apartmentalising their single home? Now we can argue that it is a very small subset of people, maximum are builders but it doesn't matter because root problem is lack of affordable housing within city. Even family leaving in these apartment will require bigger or more floors after 15-20 years. It's necessity. I believe govt should start creating multi storey societies within city as well which will reduce residential land requirement and free up space for parking, parks and other amenities. Idk even why Chandigarh didn't create lot's of multi storey societies when it was a planned city."
}