{
    "id": "1881wtk",
    "title": "Rs. 18.85 Crore looted from PNB Ukhrul, Manipur.",
    "url": "https://youtu.be/Ubx13FKulAw?si=Im6pMuLcNVRALNOv",
    "selftext": "Ukhrul: In a Netflix style Heist series, Rs. 18.85 crore was looted from a Punjab National Bank today at the heart of Ukhrul town, as per reliable sources. \n\nThe PNB situated in Viewland-I, one of the main bazaars of Ukhrul town was looted at around 5:40 pm on Thursday by around ten unidentified masked men carrying sophisticated weapons.\n\nUkhrul Times has learnt that around 8 personnel from the 6th Manipur Rifles were mending the PNB bank. The Punjab National Bank was formerly known as United Bank of India and was converted to PNB recently. So far, no one has claimed responsibility while filing this report. No arrest has been made so far by the local authority. This is the first time such incident of bank robbery has happened in Ukhrul town. Ukhrul Police has began probe into one of the biggest bank robberies in recent memory. \n\nIt may be mentioned that a Churachandpur Axis Bank branch in July 2023, located at Teddim Road and Thangzam Road’s junction at Churachadpur town was found looted of over Rs. 1 crore by staff of the bank after it reopened for the first time since Manipur conflict erupted on May 3, 2023 in Manipur\n\nAdditional Source: https://ukhrultimes.com/rs-18-85-crore-looted-from-pnb-ukhrul-town/",
    "flair": "Crime",
    "score": 144,
    "num_comments": 22,
    "created_utc": 1701401705.0,
    "convurl": "https://external-preview.redd.it/OVqvUrb_UKIId4OChj_53PhA17VQWCJIv7C-c7nSVxU.jpg?auto=webp&s=109cafbe6656b6a2f83bb8506c531ac2b0cfbdb4",
    "comments": [
        "Hope the staff are ok",
        "No reports of deaths or injuries of Bank Staffs and Security personnels.",
        "18 crores in cash? I am sure they won't be allowed to keep that much cash in any branch",
        "I don't know how Bank works. But it's Holiday season, so the bank could be anticipating for it. Could also be an inside job too.",
        "Isn’t money only insured for each depositor upto 5 lakhs? Or is this some insurance the bank takes for the deposits at the branch as a whole?",
        "5 L is for Depositors I.e. customers. The bank has different insurance.",
        "That's for bankruptcy by a bank. This has no impact on the deposits. This is the cash with teller that will be insured separately by Bank",
        "Bank robbery isn’t a cake walk. This is an inside job I’m sure.",
        "Doesn't the bank have a panic button or something? The senior staff usually work till late.",
        "From an unconfirmed local source, the robbers who are better equipped and more in numbers than the bank security guard quickly neutralised the guard first at gunpoint, and tie up all the staffs inside a room. They then forced the manager-in-charge to open the vault where the money was kept. \n\nAll this was said to be done in about 10 minutes duration. But, that's likely an exaggeration.",
        "Not really worried. We are wasting 40 crores on renaming PHCs. What's another 19?",
        "Someone from the bank is involved. They  knew a big cash was arriving there at the Bank on that day.",
        "It is highly unlikely that the amount is so high. No single branch holds that much amount of cash at a time.",
        "Hmnn.. The classic tale of Bank robbers stealing 30 Lakhs. But the Bank Manager and staffs insisting it's 75 Lakhs. LOL",
        "It could be a currency chest branch. Other branches are guarded by only 1 guard not 6 guards.",
        "That makes sense. Thanks for pointing it out.",
        "Currency chest branches keep a lot of cash as they are the main distributors of cash to other branches in their area. They also provide cash to outsourced and white label ATMs.",
        "Currency chest branches hold much higher amount.",
        "Not at all..No bank branch is allowed to keep that much cash as RBI has set limit for every bank as per their CRR i.e cash reserve ratio and similarly bank divide that cash retention limit among it's branches according to their business figures.\n\nAlthough this could be currency chest which supplies cash to branches in the zone or you could say serving to the cash need of 80-100 branches , data and number of branches differs depending on numerous factors.",
        "Netflix style heist, what heist gotta do with Netflix. Is a well made movie or show synonymous with Netflix now.",
        "That music though lol",
        "Each rupee is counted for in a branch. There is no chance of such bs happening."
    ],
    "cleaned_text": "rs crore looted pnb ukhrul manipur ukhrul netflix style heist series rs crore looted punjab national bank today heart ukhrul town per reliable sources pnb situated viewlandi one main bazaars ukhrul town looted around pm thursday around ten unidentified masked men carrying sophisticated weapons ukhrul times learnt around personnel th manipur rifles mending pnb bank punjab national bank formerly known united bank india converted pnb recently far one claimed responsibility filing report arrest made far local authority first time incident bank robbery happened ukhrul town ukhrul police began probe one biggest bank robberies recent memory may mentioned churachandpur axis bank branch july located teddim road thangzam roads junction churachadpur town found looted rs crore staff bank reopened first time since manipur conflict erupted may manipur additional source ",
    "cleaned_title": "rs crore looted pnb ukhrul manipur",
    "cleaned_selftext": "ukhrul netflix style heist series rs crore looted punjab national bank today heart ukhrul town per reliable sources pnb situated viewlandi one main bazaars ukhrul town looted around pm thursday around ten unidentified masked men carrying sophisticated weapons ukhrul times learnt around personnel th manipur rifles mending pnb bank punjab national bank formerly known united bank india converted pnb recently far one claimed responsibility filing report arrest made far local authority first time incident bank robbery happened ukhrul town ukhrul police began probe one biggest bank robberies recent memory may mentioned churachandpur axis bank branch july located teddim road thangzam roads junction churachadpur town found looted rs crore staff bank reopened first time since manipur conflict erupted may manipur additional source",
    "cleaned_comments": "hope staff ok reports deaths injuries bank staffs security personnels crores cash sure wont allowed keep much cash branch dont know bank works holiday season bank could anticipating could also inside job isnt money insured depositor upto lakhs insurance bank takes deposits branch whole l depositors ie customers bank different insurance thats bankruptcy bank impact deposits cash teller insured separately bank bank robbery isnt cake walk inside job im sure doesnt bank panic button something senior staff usually work till late unconfirmed local source robbers better equipped numbers bank security guard quickly neutralised guard first gunpoint tie staffs inside room forced managerincharge open vault money kept said done minutes duration thats likely exaggeration really worried wasting crores renaming phcs whats another someone bank involved knew big cash arriving bank day highly unlikely amount high single branch holds much amount cash time hmnn classic tale bank robbers stealing lakhs bank manager staffs insisting lakhs lol could currency chest branch branches guarded guard guards makes sense thanks pointing currency chest branches keep lot cash main distributors cash branches area also provide cash outsourced white label atms currency chest branches hold much higher amount allno bank branch allowed keep much cash rbi set limit every bank per crr ie cash reserve ratio similarly bank divide cash retention limit among branches according business figures although could currency chest supplies cash branches zone could say serving cash need branches data number branches differs depending numerous factors netflix style heist heist got ta netflix well made movie show synonymous netflix music though lol rupee counted branch chance bs happening",
    "light_cleaned_title": "Rs. 18.85 Crore looted from PNB Ukhrul, Manipur.",
    "light_cleaned_selftext": "Ukhrul: In a Netflix style Heist series, Rs. 18.85 crore was looted from a Punjab National Bank today at the heart of Ukhrul town, as per reliable sources. The PNB situated in Viewland-I, one of the main bazaars of Ukhrul town was looted at around 5:40 pm on Thursday by around ten unidentified masked men carrying sophisticated weapons. Ukhrul Times has learnt that around 8 personnel from the 6th Manipur Rifles were mending the PNB bank. The Punjab National Bank was formerly known as United Bank of India and was converted to PNB recently. So far, no one has claimed responsibility while filing this report. No arrest has been made so far by the local authority. This is the first time such incident of bank robbery has happened in Ukhrul town. Ukhrul Police has began probe into one of the biggest bank robberies in recent memory. It may be mentioned that a Churachandpur Axis Bank branch in July 2023, located at Teddim Road and Thangzam Road’s junction at Churachadpur town was found looted of over Rs. 1 crore by staff of the bank after it reopened for the first time since Manipur conflict erupted on May 3, 2023 in Manipur Additional Source:",
    "light_cleaned_comments": "Hope the staff are ok No reports of deaths or injuries of Bank Staffs and Security personnels. 18 crores in cash? I am sure they won't be allowed to keep that much cash in any branch I don't know how Bank works. But it's Holiday season, so the bank could be anticipating for it. Could also be an inside job too. Isn’t money only insured for each depositor upto 5 lakhs? Or is this some insurance the bank takes for the deposits at the branch as a whole? 5 L is for Depositors I.e. customers. The bank has different insurance. That's for bankruptcy by a bank. This has no impact on the deposits. This is the cash with teller that will be insured separately by Bank Bank robbery isn’t a cake walk. This is an inside job I’m sure. Doesn't the bank have a panic button or something? The senior staff usually work till late. From an unconfirmed local source, the robbers who are better equipped and more in numbers than the bank security guard quickly neutralised the guard first at gunpoint, and tie up all the staffs inside a room. They then forced the manager-in-charge to open the vault where the money was kept. All this was said to be done in about 10 minutes duration. But, that's likely an exaggeration. Not really worried. We are wasting 40 crores on renaming PHCs. What's another 19? Someone from the bank is involved. They knew a big cash was arriving there at the Bank on that day. It is highly unlikely that the amount is so high. No single branch holds that much amount of cash at a time. Hmnn.. The classic tale of Bank robbers stealing 30 Lakhs. But the Bank Manager and staffs insisting it's 75 Lakhs. LOL It could be a currency chest branch. Other branches are guarded by only 1 guard not 6 guards. That makes sense. Thanks for pointing it out. Currency chest branches keep a lot of cash as they are the main distributors of cash to other branches in their area. They also provide cash to outsourced and white label ATMs. Currency chest branches hold much higher amount. Not at all..No bank branch is allowed to keep that much cash as RBI has set limit for every bank as per their CRR i.e cash reserve ratio and similarly bank divide that cash retention limit among it's branches according to their business figures. Although this could be currency chest which supplies cash to branches in the zone or you could say serving to the cash need of 80-100 branches , data and number of branches differs depending on numerous factors. Netflix style heist, what heist gotta do with Netflix. Is a well made movie or show synonymous with Netflix now. That music though lol Each rupee is counted for in a branch. There is no chance of such bs happening."
}