{
    "id": "168w3o7",
    "title": "Please help me by filling this form",
    "url": "https://www.reddit.com/r/india/comments/168w3o7/please_help_me_by_filling_this_form/",
    "selftext": " \n\nGreetings! I'm conducting a survey to understand the impact of user perception, trust in payment systems, and experience of online fraud on the choice of mode of payment as a part of my multidisciplinary studies(MDS) course assignment. The data collected in this form will be used for academic research purposes only, and no personal identification of any sort will be asked. This questionnaire will take approximately 5-10 minutes to complete.\n\nLink of the survey form: [https://forms.gle/Jfo9DoLsiZ7Zpmpt7](https://forms.gle/Jfo9DoLsiZ7Zpmpt7)\n\nYour contribution to this study would be highly valued. Thank you and have a great day!",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1693745153.0,
    "convurl": "https://external-preview.redd.it/nZk6uiK0JBo6SPyoznaPmtRI4vFbyN8B1R8h9UoWvH4.jpg?auto=webp&s=db8bdcc68e3c3a9003993f6d0bdeb166fc3af33e",
    "comments": [],
    "cleaned_text": "please help filling form greetings im conducting survey understand impact user perception trust payment systems experience online fraud choice mode payment part multidisciplinary studiesmds course assignment data collected form used academic research purposes personal identification sort asked questionnaire take approximately minutes complete link survey form httpsformsglejfodolsizzpmpthttpsformsglejfodolsizzpmpt contribution study would highly valued thank great day ",
    "cleaned_title": "please help filling form",
    "cleaned_selftext": "greetings im conducting survey understand impact user perception trust payment systems experience online fraud choice mode payment part multidisciplinary studiesmds course assignment data collected form used academic research purposes personal identification sort asked questionnaire take approximately minutes complete link survey form httpsformsglejfodolsizzpmpthttpsformsglejfodolsizzpmpt contribution study would highly valued thank great day",
    "cleaned_comments": "",
    "light_cleaned_title": "Please help me by filling this form",
    "light_cleaned_selftext": "Greetings! I'm conducting a survey to understand the impact of user perception, trust in payment systems, and experience of online fraud on the choice of mode of payment as a part of my multidisciplinary studies(MDS) course assignment. The data collected in this form will be used for academic research purposes only, and no personal identification of any sort will be asked. This questionnaire will take approximately 5-10 minutes to complete. Link of the survey form: [https://forms.gle/Jfo9DoLsiZ7Zpmpt7](https://forms.gle/Jfo9DoLsiZ7Zpmpt7) Your contribution to this study would be highly valued. Thank you and have a great day!",
    "light_cleaned_comments": ""
}