{
    "id": "14weds8",
    "title": "Brij Bhushan molested, stalked… liable to be prosecuted, punished: Delhi Police",
    "url": "https://indianexpress.com/article/india/brij-bhushan-molested-stalked-liable-to-be-prosecuted-punished-delhi-police-8825037/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Findia%2Fbrij-bhushan-molested-stalked-liable-to-be-prosecuted-punished-delhi-police-8825037%2F",
    "flair": "Crime",
    "score": 1,
    "num_comments": 35,
    "created_utc": 1689043020.0,
    "convurl": "https://external-preview.redd.it/1k_Cg0y0uL_-to3J6b2HApUkVFpOk4ejKKNN2nQRQ7k.jpg?auto=webp&v=enabled&s=d04ebfb411b65bfea8a0aaefa30ff5127afffdf8",
    "comments": [
        "Then fucking do something about you cunts.",
        "Nice Paywall bypass OP. Everyone should know more about https://12ft.io\n\n>The chargesheet adds that the investigators spoke to 108 witnesses of whom 15, including wrestlers, coaches and referees, corroborated the allegations made by the wrestlers.\n\n>Singh was unavailable for comment. However, according to an annexure in the chargesheet, in his questioning by the Delhi Police, Singh denied all allegations and claimed he had never met the wrestlers and didn’t have their phone numbers.\n\nIf he walks free after this, there is no hope or faith in the judicial system. It is already established that Delhi Police has no spine.",
        "what are they doing till now.punish him",
        "Hope this guy rots in jail",
        "Encounter, let's go.",
        "Let’s hope he gets punished for what he has done, as he’s member of ruling party both at state and centre and also a very powerful leader and a mass leader of his community.",
        "Jail? You mean hotel? This too, shall pass.",
        "To all those assholes (including women or rather especially women) who stood in support of this abomination for want of proof despite overwhelming confessions by victims and relentless protests by wrestlers.\n\nImagine or rather recall what protesting wrestlers had to endure for bravely standing up to the powers that be.",
        "That would be fake though. BJP would turn him to a legend who is falsely accused.",
        "Till ruling party is in power, nothing will happen.",
        "I guess BJP has found a way around it, otherwise they wouldn't have let him take the fall wether or not he committed those crimes....",
        "Justice mf!",
        "For a minute i thought someone molested and stalked Brij Bhushan lol.",
        "just ice",
        "Lol me too. For a moment I even pictured him crying in the shower.",
        "/r/titlegore",
        "Eli 5\nWhat is pay wall bypass do",
        "From Google:\n\nPaywall is a system that prevents Internet users from accessing certain Web content without a paid subscription",
        "This is just another game for BJP to change public's perception of them.",
        "Doesn't really work on most paywalls. But worth a try nonetheless",
        "At long last! Hope he gets put behind bars forever and ever.",
        "There were quite a lot of women who supported him.",
        "Delhi police is otherwise so active in arresting. What’s stopping them now.\n\nLike exactly what are these stalwart defenders of law waiting for",
        "Yeah, patriarchy and bigotry can be a poisonous combination.",
        "Too busy spending resources on Umar khalid.",
        "Nah he'll take the fall and go to jail. But this is the good thing for him. They silenced the family who had submitted the POCSO charge, a minor was molested and he will walk free without consequences, the father of the minor removed his initial FIR Statement, later stated off screen to a journalist that he was being threatened. On screen, the minor said that she was not selected in the finals and wanted to take badla for that and had recorded that statement.",
        "Well, you must have heard the term \"women bring down women\". Sometimes it could be true. \nThe thing I have seen is that the less educate and literate the person is the more resistant to change they are. You could convince them whether it's good or not but they would resist with their utmost power. This applies to people of all gender, caste, race, country, etc.",
        "Yaar itne wrestlers aur athletes ke naak me dum kar rakha hai isne koi aake iski hattya kar do jaise moosewala ka kiya tha. Iske jaise keedo ko toh kabka maar dena chiye.",
        "I am shocked!\n\nNot about convicting brij bhushan, but delhi police doing their work against a powerful person! Well, there is a first time for everything.\n\nIt is good to see people do what they are supposed to do."
    ],
    "cleaned_text": "brij bhushan molested stalked liable prosecuted punished delhi police  ",
    "cleaned_title": "brij bhushan molested stalked liable prosecuted punished delhi police",
    "cleaned_selftext": "",
    "cleaned_comments": "fucking something cunts nice paywall bypass op everyone know chargesheet adds investigators spoke witnesses including wrestlers coaches referees corroborated allegations made wrestlers singh unavailable comment however according annexure chargesheet questioning delhi police singh denied allegations claimed never met wrestlers didnt phone numbers walks free hope faith judicial system already established delhi police spine till nowpunish hope guy rots jail encounter lets go lets hope gets punished done hes member ruling party state centre also powerful leader mass leader community jail mean hotel shall pass assholes including women rather especially women stood support abomination want proof despite overwhelming confessions victims relentless protests wrestlers imagine rather recall protesting wrestlers endure bravely standing powers would fake though bjp would turn legend falsely accused till ruling party power nothing happen guess bjp found way around otherwise wouldnt let take fall wether committed crimes justice mf minute thought someone molested stalked brij bhushan lol ice lol moment even pictured crying shower rtitlegore eli pay wall bypass google paywall system prevents internet users accessing certain web content without paid subscription another game bjp change publics perception doesnt really work paywalls worth try nonetheless long last hope gets put behind bars forever ever quite lot women supported delhi police otherwise active arresting whats stopping like exactly stalwart defenders law waiting yeah patriarchy bigotry poisonous combination busy spending resources umar khalid nah hell take fall go jail good thing silenced family submitted pocso charge minor molested walk free without consequences father minor removed initial fir statement later stated screen journalist threatened screen minor said selected finals wanted take badla recorded statement well must heard term women bring women sometimes could true thing seen less educate literate person resistant change could convince whether good would resist utmost power applies people gender caste race country etc yaar itne wrestlers aur athletes ke naak dum kar rakha hai isne koi aake iski hattya kar jaise moosewala ka kiya tha iske jaise keedo ko toh kabka maar dena chiye shocked convicting brij bhushan delhi police work powerful person well first time everything good see people supposed",
    "light_cleaned_title": "Brij Bhushan molested, stalked… liable to be prosecuted, punished: Delhi Police",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Then fucking do something about you cunts. Nice Paywall bypass OP. Everyone should know more about >The chargesheet adds that the investigators spoke to 108 witnesses of whom 15, including wrestlers, coaches and referees, corroborated the allegations made by the wrestlers. >Singh was unavailable for comment. However, according to an annexure in the chargesheet, in his questioning by the Delhi Police, Singh denied all allegations and claimed he had never met the wrestlers and didn’t have their phone numbers. If he walks free after this, there is no hope or faith in the judicial system. It is already established that Delhi Police has no spine. what are they doing till now.punish him Hope this guy rots in jail Encounter, let's go. Let’s hope he gets punished for what he has done, as he’s member of ruling party both at state and centre and also a very powerful leader and a mass leader of his community. Jail? You mean hotel? This too, shall pass. To all those assholes (including women or rather especially women) who stood in support of this abomination for want of proof despite overwhelming confessions by victims and relentless protests by wrestlers. Imagine or rather recall what protesting wrestlers had to endure for bravely standing up to the powers that be. That would be fake though. BJP would turn him to a legend who is falsely accused. Till ruling party is in power, nothing will happen. I guess BJP has found a way around it, otherwise they wouldn't have let him take the fall wether or not he committed those crimes.... Justice mf! For a minute i thought someone molested and stalked Brij Bhushan lol. just ice Lol me too. For a moment I even pictured him crying in the shower. /r/titlegore Eli 5 What is pay wall bypass do From Google: Paywall is a system that prevents Internet users from accessing certain Web content without a paid subscription This is just another game for BJP to change public's perception of them. Doesn't really work on most paywalls. But worth a try nonetheless At long last! Hope he gets put behind bars forever and ever. There were quite a lot of women who supported him. Delhi police is otherwise so active in arresting. What’s stopping them now. Like exactly what are these stalwart defenders of law waiting for Yeah, patriarchy and bigotry can be a poisonous combination. Too busy spending resources on Umar khalid. Nah he'll take the fall and go to jail. But this is the good thing for him. They silenced the family who had submitted the POCSO charge, a minor was molested and he will walk free without consequences, the father of the minor removed his initial FIR Statement, later stated off screen to a journalist that he was being threatened. On screen, the minor said that she was not selected in the finals and wanted to take badla for that and had recorded that statement. Well, you must have heard the term \"women bring down women\". Sometimes it could be true. The thing I have seen is that the less educate and literate the person is the more resistant to change they are. You could convince them whether it's good or not but they would resist with their utmost power. This applies to people of all gender, caste, race, country, etc. Yaar itne wrestlers aur athletes ke naak me dum kar rakha hai isne koi aake iski hattya kar do jaise moosewala ka kiya tha. Iske jaise keedo ko toh kabka maar dena chiye. I am shocked! Not about convicting brij bhushan, but delhi police doing their work against a powerful person! Well, there is a first time for everything. It is good to see people do what they are supposed to do."
}