{
    "id": "14s2u33",
    "title": "Indian railway and its reality.",
    "url": "https://i.redd.it/kykf8miy3bab1.jpg",
    "selftext": "While we see every now and then launching new train by GOI but do we know at what cost. The less famous trains have become cattleyard and some trains are canceled mysteriously. There is a read where i read Bhopal to Indore vande mataram train didnt get the expected response due to high fare.on the same route thr are some trains are available with cheap fare. Whats going on. Do read up..",
    "flair": "AskIndia",
    "score": 56,
    "num_comments": 13,
    "created_utc": 1688632691.0,
    "convurl": "https://i.redd.it/kykf8miy3bab1.jpg",
    "comments": [
        "Source : https://www.business-standard.com/amp/india-news/over-67-000-trains-cancelled-in-south-east-central-zone-in-3-years-rti-123070500448_1.html",
        "Source : https://www.business-standard.com/amp/india-news/over-67-000-trains-cancelled-in-south-east-central-zone-in-3-years-rti-123070500448_1.html",
        "Let's in this list remove the trains cancelled during Covid, both 2021 and 2020 had major travel restrictions. \n\nThe source does not mention the figures separately so the number itself is meaningless unless we have the bifurcation of Covid and non Covid cancellation.\n\nThat said , SECR is notorious for their cavalier attitude in delaying trains in their section. Recently the Azad hind express reached Pune just a few minutes past it's normal arrival time, great to hear except that it was the previous days train delayed by 24 hours. The section from Nagpur to Bilaspur is a black hole or rather the Bermuda triangle.",
        "If the report had added the covid trsin cancelation numbers, then railway ministry would have done dozen of pc already. NsA would have been slapped against the report.😂 such cute and innocent man you r.. lol..",
        "I mean,just look at the numbers from 2020 ,2021 and compare them with 2022,2023. It doesn't take a genius to figure out something was going on in those years that improved/stopped being a problem from 2022.",
        "The Nagpur-Bilaspur section is a pain in the head. Once my parents travelled from Raipur to Nagpur. They were supposed to reach Nagpur at afternoon time, which is the normal time of that train. Except they reached at 11:30 night. That section is fucked since 3 years or so.",
        "Corporations want railways for cheap, and muddyji is destroying it to make it palatable to sell. Simple as that.",
        "all these vande bharat trains are increasing the congestion in an already congested network. what is the need for vande bharat mumbai-goa route when you already have so many trains on the route, even tejas iirc. Another problem is their research on time-tables. chennai-mysore shatabdi and chennai-mysore vande bharat leave almost at the same time on same days and reach 30mins or so apart. Absolutely no effort is made to atleast have one in down direction. My father travelled in sc-vskp vande bharat, the incoming train (vskp-sc) was late and so no one bothered to  clean and maintain the rake. this will continue down the years and cost everyone",
        "2020 and 21 trains were cancelled en masse due to covid",
        "This is so click baity. Selective Stats are the wordy. It would make more sense to compare numbers from 2019 and 2022, the years without pandemic disruptions. The drastic drop from 2021 to 2022 shows the numbers can't be compared. And the 2023 trend looks more in line with 2022.\n\nAlso, for statistical comparison, it's more imperative to have percentage of trains cancelled.",
        ">  great to hear except that it was the previous days train delayed by 24 hours.\n\nnever though that joke would come true....",
        "Out of what?"
    ],
    "cleaned_text": "indian railway reality see every launching new train goi know cost less famous trains become cattleyard trains canceled mysteriously read read bhopal indore vande mataram train didnt get expected response due high fareon route thr trains available cheap fare whats going read ",
    "cleaned_title": "indian railway reality",
    "cleaned_selftext": "see every launching new train goi know cost less famous trains become cattleyard trains canceled mysteriously read read bhopal indore vande mataram train didnt get expected response due high fareon route thr trains available cheap fare whats going read",
    "cleaned_comments": "source source lets list remove trains cancelled covid major travel restrictions source mention figures separately number meaningless unless bifurcation covid non covid cancellation said secr notorious cavalier attitude delaying trains section recently azad hind express reached pune minutes past normal arrival time great hear except previous days train delayed hours section nagpur bilaspur black hole rather bermuda triangle report added covid trsin cancelation numbers railway ministry would done dozen pc already nsa would slapped report cute innocent man r lol meanjust look numbers compare doesnt take genius figure something going years improvedstopped problem nagpurbilaspur section pain head parents travelled raipur nagpur supposed reach nagpur afternoon time normal time train except reached night section fucked since years corporations want railways cheap muddyji destroying make palatable sell simple vande bharat trains increasing congestion already congested network need vande bharat mumbaigoa route already many trains route even tejas iirc another problem research timetables chennaimysore shatabdi chennaimysore vande bharat leave almost time days reach mins apart absolutely effort made atleast one direction father travelled scvskp vande bharat incoming train vskpsc late one bothered clean maintain rake continue years cost everyone trains cancelled en masse due covid click baity selective stats wordy would make sense compare numbers years without pandemic disruptions drastic drop shows numbers cant compared trend looks line also statistical comparison imperative percentage trains cancelled great hear except previous days train delayed hours never though joke would come true",
    "light_cleaned_title": "Indian railway and its reality.",
    "light_cleaned_selftext": "While we see every now and then launching new train by GOI but do we know at what cost. The less famous trains have become cattleyard and some trains are canceled mysteriously. There is a read where i read Bhopal to Indore vande mataram train didnt get the expected response due to high fare.on the same route thr are some trains are available with cheap fare. Whats going on. Do read up..",
    "light_cleaned_comments": "Source : Source : Let's in this list remove the trains cancelled during Covid, both 2021 and 2020 had major travel restrictions. The source does not mention the figures separately so the number itself is meaningless unless we have the bifurcation of Covid and non Covid cancellation. That said , SECR is notorious for their cavalier attitude in delaying trains in their section. Recently the Azad hind express reached Pune just a few minutes past it's normal arrival time, great to hear except that it was the previous days train delayed by 24 hours. The section from Nagpur to Bilaspur is a black hole or rather the Bermuda triangle. If the report had added the covid trsin cancelation numbers, then railway ministry would have done dozen of pc already. NsA would have been slapped against the report.😂 such cute and innocent man you r.. lol.. I mean,just look at the numbers from 2020 ,2021 and compare them with 2022,2023. It doesn't take a genius to figure out something was going on in those years that improved/stopped being a problem from 2022. The Nagpur-Bilaspur section is a pain in the head. Once my parents travelled from Raipur to Nagpur. They were supposed to reach Nagpur at afternoon time, which is the normal time of that train. Except they reached at 11:30 night. That section is fucked since 3 years or so. Corporations want railways for cheap, and muddyji is destroying it to make it palatable to sell. Simple as that. all these vande bharat trains are increasing the congestion in an already congested network. what is the need for vande bharat mumbai-goa route when you already have so many trains on the route, even tejas iirc. Another problem is their research on time-tables. chennai-mysore shatabdi and chennai-mysore vande bharat leave almost at the same time on same days and reach 30mins or so apart. Absolutely no effort is made to atleast have one in down direction. My father travelled in sc-vskp vande bharat, the incoming train (vskp-sc) was late and so no one bothered to clean and maintain the rake. this will continue down the years and cost everyone 2020 and 21 trains were cancelled en masse due to covid This is so click baity. Selective Stats are the wordy. It would make more sense to compare numbers from 2019 and 2022, the years without pandemic disruptions. The drastic drop from 2021 to 2022 shows the numbers can't be compared. And the 2023 trend looks more in line with 2022. Also, for statistical comparison, it's more imperative to have percentage of trains cancelled. > great to hear except that it was the previous days train delayed by 24 hours. never though that joke would come true.... Out of what?"
}