{
    "id": "16phcp8",
    "title": "To all self righteous Canada supporters!",
    "url": "https://www.reddit.com/r/india/comments/16phcp8/to_all_self_righteous_canada_supporters/",
    "selftext": "I don't condone any alleged activities by any govt and not a Modi Bhakt or West hater. But this hypocrisy has to stop. Each country acts in self Interest.\n\nHere is a Canadian article which talks about Canadian intelligence allowing assassinations by a foreign agency in their own land! \n\nhttps://www.aptnnews.ca/national-news/csis-allowed-targeted-assassination-2-residents-canadian-soil-says-ex-spy-court-docs/\n\nAnd these things are not limited to Canada or India.not everything is Black and white.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695406621.0,
    "convurl": "https://external-preview.redd.it/-C6qcykp1C7474narVPlRxqmE8S4OtdA8rZnn1e_BCk.jpg?auto=webp&s=60a9e6fa3e99302a33e123c66f11f4217f8eac09",
    "comments": [
        "I had learned very early that not getting caught was just about the solution to every problem. If you were caught then those who hadn't yet been caught had to make an example of you, unless of course you knew the right people.\nChristopher S. Hyatt",
        "You literally said it. It’s not black or white. Agencies and governments work in the gray but they have to do that within the lines of law. And if they do it outside the lines, then don’t get caught. \n\nThe notion that the unsubstantiated assassinations of two Canadians nations by foreign agencies does **not** refute or excuse the assassination of Nijjar in an extrajudicial manner. \n\nThe legal proceedings news article you referenced talks about the unreported 9/11 threats by CSIS and Palmer’s, once again unsubstantiated, claims of two people being killed are DAY AND NIGHT to the broad daylight killing of Nijjar that has now been reportedly investigated by agencies of the Five Eyes and the Surrey RCMP are all but admitting that the investigation results in india being implicated. \n\nYou think a world leader would first talk to Modi about the killing along with Biden at G20 privately without any damn proof? It would be comical for that to happen. Biden’s direct involvement suggests that his own security and intelligence services advised him of the assassination and India’s hand in the matter. Furthermore, Trudeau stuck his reputation on the line and keeps pressing the notion, with the Five Eyes intelligence agencies being involved to provide evidence and intelligence for this affair. \n\nIf you’re refuting CSE, NZSIS, GCHQ, ASIO **and NSA** and not seeing things for what they are, that’s on you. No world leader in their sane mind would do this without vetted evidence and the fact that Jack Sullivan confirmed that they will continue working on this regardless of country, all but saying that it doesn’t matter that india is our trade partner, this is important and we have to investigate and work with Canada on this. \n\nIn contrast, your notion of Canada allowing the two killings are bloody piss in the wind. Some people even tried to argue that USA killed UBL in Pakistan and that was extrajudicial. **No** UBL was stateless and verifiably known as a terrorist that was unwittingly harboured by Pakistan. That is miles away from killing a Canadian man on Canadian soil because your government deems him a terrorist. Terrorist or not, extrajudicial killings aren’t at all allowable. It sets a standard that freedom of speech can be skirted by nations to persecute and kill people across borders. If you can grasp that, man idk what to tell you.",
        "You don't condone the activities ... Do you condemn them?"
    ],
    "cleaned_text": "self righteous canada supporters dont condone alleged activities govt modi bhakt west hater hypocrisy stop country acts self interest canadian article talks canadian intelligence allowing assassinations foreign agency land things limited canada indianot everything black white ",
    "cleaned_title": "self righteous canada supporters",
    "cleaned_selftext": "dont condone alleged activities govt modi bhakt west hater hypocrisy stop country acts self interest canadian article talks canadian intelligence allowing assassinations foreign agency land things limited canada indianot everything black white",
    "cleaned_comments": "learned early getting caught solution every problem caught hadnt yet caught make example unless course knew right people christopher hyatt literally said black white agencies governments work gray within lines law outside lines dont get caught notion unsubstantiated assassinations two canadians nations foreign agencies refute excuse assassination nijjar extrajudicial manner legal proceedings news article referenced talks unreported threats csis palmers unsubstantiated claims two people killed day night broad daylight killing nijjar reportedly investigated agencies five eyes surrey rcmp admitting investigation results india implicated think world leader would first talk modi killing along biden g privately without damn proof would comical happen bidens direct involvement suggests security intelligence services advised assassination indias hand matter furthermore trudeau stuck reputation line keeps pressing notion five eyes intelligence agencies involved provide evidence intelligence affair youre refuting cse nzsis gchq asio nsa seeing things thats world leader sane mind would without vetted evidence fact jack sullivan confirmed continue working regardless country saying doesnt matter india trade partner important investigate work canada contrast notion canada allowing two killings bloody piss wind people even tried argue usa killed ubl pakistan extrajudicial ubl stateless verifiably known terrorist unwittingly harboured pakistan miles away killing canadian man canadian soil government deems terrorist terrorist extrajudicial killings arent allowable sets standard freedom speech skirted nations persecute kill people across borders grasp man idk tell dont condone activities condemn",
    "light_cleaned_title": "To all self righteous Canada supporters!",
    "light_cleaned_selftext": "I don't condone any alleged activities by any govt and not a Modi Bhakt or West hater. But this hypocrisy has to stop. Each country acts in self Interest. Here is a Canadian article which talks about Canadian intelligence allowing assassinations by a foreign agency in their own land! And these things are not limited to Canada or India.not everything is Black and white.",
    "light_cleaned_comments": "I had learned very early that not getting caught was just about the solution to every problem. If you were caught then those who hadn't yet been caught had to make an example of you, unless of course you knew the right people. Christopher S. Hyatt You literally said it. It’s not black or white. Agencies and governments work in the gray but they have to do that within the lines of law. And if they do it outside the lines, then don’t get caught. The notion that the unsubstantiated assassinations of two Canadians nations by foreign agencies does **not** refute or excuse the assassination of Nijjar in an extrajudicial manner. The legal proceedings news article you referenced talks about the unreported 9/11 threats by CSIS and Palmer’s, once again unsubstantiated, claims of two people being killed are DAY AND NIGHT to the broad daylight killing of Nijjar that has now been reportedly investigated by agencies of the Five Eyes and the Surrey RCMP are all but admitting that the investigation results in india being implicated. You think a world leader would first talk to Modi about the killing along with Biden at G20 privately without any damn proof? It would be comical for that to happen. Biden’s direct involvement suggests that his own security and intelligence services advised him of the assassination and India’s hand in the matter. Furthermore, Trudeau stuck his reputation on the line and keeps pressing the notion, with the Five Eyes intelligence agencies being involved to provide evidence and intelligence for this affair. If you’re refuting CSE, NZSIS, GCHQ, ASIO **and NSA** and not seeing things for what they are, that’s on you. No world leader in their sane mind would do this without vetted evidence and the fact that Jack Sullivan confirmed that they will continue working on this regardless of country, all but saying that it doesn’t matter that india is our trade partner, this is important and we have to investigate and work with Canada on this. In contrast, your notion of Canada allowing the two killings are bloody piss in the wind. Some people even tried to argue that USA killed UBL in Pakistan and that was extrajudicial. **No** UBL was stateless and verifiably known as a terrorist that was unwittingly harboured by Pakistan. That is miles away from killing a Canadian man on Canadian soil because your government deems him a terrorist. Terrorist or not, extrajudicial killings aren’t at all allowable. It sets a standard that freedom of speech can be skirted by nations to persecute and kill people across borders. If you can grasp that, man idk what to tell you. You don't condone the activities ... Do you condemn them?"
}