{
    "id": "1bx8s91",
    "title": "31 years after man was kidnapped, CBI court sends former Punjab Police officer to 10 years in jail",
    "url": "https://indianexpress.com/article/cities/chandigarh/cbi-punjab-police-mohali-rigourous-imprisonment-9242085/",
    "selftext": "A chargesheet was filed against both the accused persons on September 16, 1999.",
    "flair": "Law & Courts",
    "score": 45,
    "num_comments": 2,
    "created_utc": 1712401022.0,
    "convurl": "https://external-preview.redd.it/yRp6sHwbUexvbULTHWtc3Wc2SMJEfWuPTmvpyiMG4IA.jpg?auto=webp&s=1bac11fff321c50bfee9e4390493b272a64567ec",
    "comments": [
        "A special court of the Central Bureau of Investigation (CBI) on Saturday sentenced a former Punjab Police officer to ten years of rigorous imprisonment (RI) in a 31-year-old case of kidnapping. The court also imposed a fine of Rs. 1 lakh, failure to pay which will lead to one-year additional jail term.\n\nThe court of special CBI judge Manjot Kaur convicted Amarjit Singh, the then SHO posted at Jhabal police station in Tarn Taran district under Section 120-B (criminal conspiracy) read with 364 (kidnapping) of the Indian Penal Code (IPC).\n\nAccused Ashok Kumar, the then DSP, died during the trial and proceedings against him were abated. A chargesheet was filed against both the accused persons on September 16, 1999.\n\nThe case\n\nOn October 4, 1992, the police, led by Singh and Kumar, picked up two women, Rajwant Kaur and her mother-in-law Gurbachan Kaur. On the same day, Rajwant’s husband Balwinder Singh was also picked up. The police had alleged that Balwinder has ties with terrorists.\n\nAfter keeping Rajwant and Gurbachan at the Jhabhal police station for a few days, the police released the two women. Meanwhile, Balwinder was taken to Ferozepur. Ever since, nobody knows about the whereabouts of Balwinder, the CBI said.\n\nOn November 15, 1996, the Supreme Court directed the CBI to conduct a preliminary inquiry into the cremation of large scale unclaimed dead bodies in three districts of Punjab. The CBI subsequently submitted its report before the apex court and on December 12, 1996, the investigation into the matter was entrusted to the CBI.\n\nThe CBI recorded Rajwant’s statement during a preliminary inquiry and thereafter, registered a regular case on February 27, 1997. The CBI completed the investigation and filed a charge sheet in 1999 and charges were framed in 2000 but the trial remained stayed from 2002 to 2022 on the basis of petitions of the accused which were dismissed later.",
        "What the actual fuck!"
    ],
    "cleaned_text": "years man kidnapped cbi court sends former punjab police officer years jail chargesheet filed accused persons september ",
    "cleaned_title": "years man kidnapped cbi court sends former punjab police officer years jail",
    "cleaned_selftext": "chargesheet filed accused persons september",
    "cleaned_comments": "special court central bureau investigation cbi saturday sentenced former punjab police officer ten years rigorous imprisonment ri yearold case kidnapping court also imposed fine rs lakh failure pay lead oneyear additional jail term court special cbi judge manjot kaur convicted amarjit singh sho posted jhabal police station tarn taran district section b criminal conspiracy read kidnapping indian penal code ipc accused ashok kumar dsp died trial proceedings abated chargesheet filed accused persons september case october police led singh kumar picked two women rajwant kaur motherinlaw gurbachan kaur day rajwants husband balwinder singh also picked police alleged balwinder ties terrorists keeping rajwant gurbachan jhabhal police station days police released two women meanwhile balwinder taken ferozepur ever since nobody knows whereabouts balwinder cbi said november supreme court directed cbi conduct preliminary inquiry cremation large scale unclaimed dead bodies three districts punjab cbi subsequently submitted report apex court december investigation matter entrusted cbi cbi recorded rajwants statement preliminary inquiry thereafter registered regular case february cbi completed investigation filed charge sheet charges framed trial remained stayed basis petitions accused dismissed later actual fuck",
    "light_cleaned_title": "31 years after man was kidnapped, CBI court sends former Punjab Police officer to 10 years in jail",
    "light_cleaned_selftext": "A chargesheet was filed against both the accused persons on September 16, 1999.",
    "light_cleaned_comments": "A special court of the Central Bureau of Investigation (CBI) on Saturday sentenced a former Punjab Police officer to ten years of rigorous imprisonment (RI) in a 31-year-old case of kidnapping. The court also imposed a fine of Rs. 1 lakh, failure to pay which will lead to one-year additional jail term. The court of special CBI judge Manjot Kaur convicted Amarjit Singh, the then SHO posted at Jhabal police station in Tarn Taran district under Section 120-B (criminal conspiracy) read with 364 (kidnapping) of the Indian Penal Code (IPC). Accused Ashok Kumar, the then DSP, died during the trial and proceedings against him were abated. A chargesheet was filed against both the accused persons on September 16, 1999. The case On October 4, 1992, the police, led by Singh and Kumar, picked up two women, Rajwant Kaur and her mother-in-law Gurbachan Kaur. On the same day, Rajwant’s husband Balwinder Singh was also picked up. The police had alleged that Balwinder has ties with terrorists. After keeping Rajwant and Gurbachan at the Jhabhal police station for a few days, the police released the two women. Meanwhile, Balwinder was taken to Ferozepur. Ever since, nobody knows about the whereabouts of Balwinder, the CBI said. On November 15, 1996, the Supreme Court directed the CBI to conduct a preliminary inquiry into the cremation of large scale unclaimed dead bodies in three districts of Punjab. The CBI subsequently submitted its report before the apex court and on December 12, 1996, the investigation into the matter was entrusted to the CBI. The CBI recorded Rajwant’s statement during a preliminary inquiry and thereafter, registered a regular case on February 27, 1997. The CBI completed the investigation and filed a charge sheet in 1999 and charges were framed in 2000 but the trial remained stayed from 2002 to 2022 on the basis of petitions of the accused which were dismissed later. What the actual fuck!"
}