{
    "id": "18it1la",
    "title": "'Animal': Why the Film Needed to Have a 'Muslim Villain'",
    "url": "https://www.reddit.com/r/india/comments/18it1la/animal_why_the_film_needed_to_have_a_muslim/",
    "selftext": "https://www.thequint.com/entertainment/animal-ranbir-kapoor-muslims-bobby-deol-islamophobia-sandeep-reddy-vanga",
    "flair": "Politics",
    "score": 1,
    "num_comments": 10,
    "created_utc": 1702619071.0,
    "convurl": "https://external-preview.redd.it/cISwWjPau9qbg_INc_N4p9R5Sd4lBWY8-OvvF7cim-g.jpg?auto=webp&s=983d7042d279b27a7f52794b8cc983da07e385bc",
    "comments": [
        "As a Muslim, I did not find Abrar's characterization to be representative of the average Muslim in India. I find it more problematic that op-eds and intellectuals jumped on this outrage bandwagon that reinforces a stereotype among non-Muslims who probably never paid attention to Abrar's religion in the first place.",
        "Hipocrosy. \n\nnext will be why every terrorist in Movies are muslim?",
        "What's big deal in it, there are countless hindu villain not just ordinary one but Relgious\n\nHere at least he is ordinary muslim",
        "It is already there Naseerudin shah and farah khan said this\n\nFarah went ahead and even made a film showing hindu terrorist to prove her point",
        "She made movie in 2004. 26/11 happened in 2008"
    ],
    "cleaned_text": "animal film needed muslim villain  ",
    "cleaned_title": "animal film needed muslim villain",
    "cleaned_selftext": "",
    "cleaned_comments": "muslim find abrars characterization representative average muslim india find problematic opeds intellectuals jumped outrage bandwagon reinforces stereotype among nonmuslims probably never paid attention abrars religion first place hipocrosy next every terrorist movies muslim whats big deal countless hindu villain ordinary one relgious least ordinary muslim already naseerudin shah farah khan said farah went ahead even made film showing hindu terrorist prove point made movie happened",
    "light_cleaned_title": "'Animal': Why the Film Needed to Have a 'Muslim Villain'",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "As a Muslim, I did not find Abrar's characterization to be representative of the average Muslim in India. I find it more problematic that op-eds and intellectuals jumped on this outrage bandwagon that reinforces a stereotype among non-Muslims who probably never paid attention to Abrar's religion in the first place. Hipocrosy. next will be why every terrorist in Movies are muslim? What's big deal in it, there are countless hindu villain not just ordinary one but Relgious Here at least he is ordinary muslim It is already there Naseerudin shah and farah khan said this Farah went ahead and even made a film showing hindu terrorist to prove her point She made movie in 2004. 26/11 happened in 2008"
}