{
    "id": "16ih4nz",
    "title": "Am I breaking any law related to stock market SEBI guidelines? I do promise gigantic returns in short time but also deliver on my promise and don't charge anyone anything for using my service, hence I don't think I should be charged with any crime.",
    "url": "https://www.reddit.com/r/india/comments/16ih4nz/am_i_breaking_any_law_related_to_stock_market/",
    "selftext": "Hi all,\n\nI've developed a software which allows me to predict which stock is going to move up before it actually starts to move up so far it has delivered great returns to anyone who has bought stocks based on my recommendations as can be evidenced by this video [https://www.youtube.com/watch?v=vtfktYo-upA&t=148s](https://www.youtube.com/watch?v=vtfktYo-upA&t=148s), I haven't made a video related to my recent recommendations but they too have achieved their target in time. The last stock I recommended got doubled in a month. The stock I'm recommending today would meet with the same fate, infact that stock is the **most undervalued stock in the Indian stock market today**, It is a debt free, pledge free company with very high promoter holding that is trading much below its book value while being extremely profitable, **I'm investing my entire net worth in that one stock** this is how much I believe in it, my software helps me identify such opportunities before anyone else and whenever I recommend any stock on my youtube channel it goes up with surety.\n\nI don't think I am breaking any law since I make this videos for free just to help people out, I haven't made even a single dime through these videos, heck my channel isn't even monetized, however people who are watching it have made the killing and some of them have personally called and messaged me to make more such videos which I wouldn't mind but one of my friends who is a chartered accountant recently told me that what I am doing falls under the category of cyber crime and I can get jailed for that hence I should stop making more such videos and delete my youtube channel for good.\n\nI wouldn't mind deleting my youtube channel since I haven't made any money through it anyway, it is just something I do for fun, but before that I want to ask for advice of any of you guys who deals with cyber law, am I breaking any law? If yes, I would delete my channel right away.\n\nI've talent of finding extremely undervalued stocks which are neglected by Dalal street,  I've dozens of such stocks filtered in my software, when these stocks go through any important activity like increase in delivery and volume percentage or a significant corporate action which can skyrocket their price, I receive a notification of that on my pc and cellphone via my software, then I double check to make sure whether this stock can go up or not using the knowledge I've acquired after reading dozens of books and trading multiple stocks, then I myself buy that stock and recommend that stock to my viewers which help all of us in making big bucks.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694694505.0,
    "convurl": "https://external-preview.redd.it/x8M1BRvpyMNqUcEi6u3gFrZJerRYDK2X1cpWNTBoMBg.jpg",
    "comments": [
        "Good try conman. It's because of people like you that RBI is coming up with guidelines on financial influencers.",
        "is this a shameless plug for your channel disguised as a question?",
        "If you are worried about it, why not register with SEBI?",
        "The moment you use the word \"promise\" it's illegal and you are liable for fines and ban from the market."
    ],
    "cleaned_text": "breaking law related stock market sebi guidelines promise gigantic returns short time also deliver promise dont charge anyone anything using service hence dont think charged crime hi ive developed software allows predict stock going move actually starts move far delivered great returns anyone bought stocks based recommendations evidenced video httpswwwyoutubecomwatchvvtfktyoupatshttpswwwyoutubecomwatchvvtfktyoupats havent made video related recent recommendations achieved target time last stock recommended got doubled month stock im recommending today would meet fate infact stock undervalued stock indian stock market today debt free pledge free company high promoter holding trading much book value extremely profitable im investing entire net worth one stock much believe software helps identify opportunities anyone else whenever recommend stock youtube channel goes surety dont think breaking law since make videos free help people havent made even single dime videos heck channel isnt even monetized however people watching made killing personally called messaged make videos wouldnt mind one friends chartered accountant recently told falls category cyber crime get jailed hence stop making videos delete youtube channel good wouldnt mind deleting youtube channel since havent made money anyway something fun want ask advice guys deals cyber law breaking law yes would delete channel right away ive talent finding extremely undervalued stocks neglected dalal street ive dozens stocks filtered software stocks go important activity like increase delivery volume percentage significant corporate action skyrocket price receive notification pc cellphone via software double check make sure whether stock go using knowledge ive acquired reading dozens books trading multiple stocks buy stock recommend stock viewers help us making big bucks ",
    "cleaned_title": "breaking law related stock market sebi guidelines promise gigantic returns short time also deliver promise dont charge anyone anything using service hence dont think charged crime",
    "cleaned_selftext": "hi ive developed software allows predict stock going move actually starts move far delivered great returns anyone bought stocks based recommendations evidenced video httpswwwyoutubecomwatchvvtfktyoupatshttpswwwyoutubecomwatchvvtfktyoupats havent made video related recent recommendations achieved target time last stock recommended got doubled month stock im recommending today would meet fate infact stock undervalued stock indian stock market today debt free pledge free company high promoter holding trading much book value extremely profitable im investing entire net worth one stock much believe software helps identify opportunities anyone else whenever recommend stock youtube channel goes surety dont think breaking law since make videos free help people havent made even single dime videos heck channel isnt even monetized however people watching made killing personally called messaged make videos wouldnt mind one friends chartered accountant recently told falls category cyber crime get jailed hence stop making videos delete youtube channel good wouldnt mind deleting youtube channel since havent made money anyway something fun want ask advice guys deals cyber law breaking law yes would delete channel right away ive talent finding extremely undervalued stocks neglected dalal street ive dozens stocks filtered software stocks go important activity like increase delivery volume percentage significant corporate action skyrocket price receive notification pc cellphone via software double check make sure whether stock go using knowledge ive acquired reading dozens books trading multiple stocks buy stock recommend stock viewers help us making big bucks",
    "cleaned_comments": "good try conman people like rbi coming guidelines financial influencers shameless plug channel disguised question worried register sebi moment use word promise illegal liable fines ban market",
    "light_cleaned_title": "Am I breaking any law related to stock market SEBI guidelines? I do promise gigantic returns in short time but also deliver on my promise and don't charge anyone anything for using my service, hence I don't think I should be charged with any crime.",
    "light_cleaned_selftext": "Hi all, I've developed a software which allows me to predict which stock is going to move up before it actually starts to move up so far it has delivered great returns to anyone who has bought stocks based on my recommendations as can be evidenced by this video [https://www.youtube.com/watch?v=vtfktYo-upA&t=148s](https://www.youtube.com/watch?v=vtfktYo-upA&t=148s), I haven't made a video related to my recent recommendations but they too have achieved their target in time. The last stock I recommended got doubled in a month. The stock I'm recommending today would meet with the same fate, infact that stock is the **most undervalued stock in the Indian stock market today**, It is a debt free, pledge free company with very high promoter holding that is trading much below its book value while being extremely profitable, **I'm investing my entire net worth in that one stock** this is how much I believe in it, my software helps me identify such opportunities before anyone else and whenever I recommend any stock on my youtube channel it goes up with surety. I don't think I am breaking any law since I make this videos for free just to help people out, I haven't made even a single dime through these videos, heck my channel isn't even monetized, however people who are watching it have made the killing and some of them have personally called and messaged me to make more such videos which I wouldn't mind but one of my friends who is a chartered accountant recently told me that what I am doing falls under the category of cyber crime and I can get jailed for that hence I should stop making more such videos and delete my youtube channel for good. I wouldn't mind deleting my youtube channel since I haven't made any money through it anyway, it is just something I do for fun, but before that I want to ask for advice of any of you guys who deals with cyber law, am I breaking any law? If yes, I would delete my channel right away. I've talent of finding extremely undervalued stocks which are neglected by Dalal street, I've dozens of such stocks filtered in my software, when these stocks go through any important activity like increase in delivery and volume percentage or a significant corporate action which can skyrocket their price, I receive a notification of that on my pc and cellphone via my software, then I double check to make sure whether this stock can go up or not using the knowledge I've acquired after reading dozens of books and trading multiple stocks, then I myself buy that stock and recommend that stock to my viewers which help all of us in making big bucks.",
    "light_cleaned_comments": "Good try conman. It's because of people like you that RBI is coming up with guidelines on financial influencers. is this a shameless plug for your channel disguised as a question? If you are worried about it, why not register with SEBI? The moment you use the word \"promise\" it's illegal and you are liable for fines and ban from the market."
}