{
    "id": "15kcvw4",
    "title": "[OLD] Entire Gurugram will have to be demolished: Haryana govt on ‘forest’ land",
    "url": "https://www.reddit.com/r/india/comments/15kcvw4/old_entire_gurugram_will_have_to_be_demolished/",
    "selftext": "Apparently, the entire city of Gurgaon is illegally built on a protected forest land. If you own a house in Gurgaon, the State can legally send you a notice and demolish your house whenever it pleases. But don't worry, because demolitions are only for poor people and Muslims. For now.\n\n[https://www.hindustantimes.com/cities/gurugram-news/entire-gurugram-will-have-to-be-demolished-haryana-govt-on-forest-land-101634925042131.html](https://www.hindustantimes.com/cities/gurugram-news/entire-gurugram-will-have-to-be-demolished-haryana-govt-on-forest-land-101634925042131.html)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691391099.0,
    "convurl": "https://external-preview.redd.it/3VYa6u-t3YtOPZ2ym_blbgNDVv7oeooIZmG_TyRBhHE.jpg?auto=webp&s=9619a031156257529673ccaba460a8d2f61829f0",
    "comments": [
        "Lmao. Gurugram was almost completely planned by the private sector. Didn't know they didn't even take approvals.",
        "They took “approvals”",
        "Gurugram or gurgaon? Headlines is something else your comment mentions different.",
        "They're the same. Gurgaon was officially renamed to Gurugram",
        "Oh, happy cake day!",
        "Literally unreadable!",
        "The f*ck? Since when does BJP care about forest land? They just passed a bill that’ll allow deforestation to unprecedented levels. Make up your minds, for god’s sa-\n\nOhhhh, this “forest land” is occupied by Muslims? That makes sense then. Carry on."
    ],
    "cleaned_text": "old entire gurugram demolished haryana govt forest land apparently entire city gurgaon illegally built protected forest land house gurgaon state legally send notice demolish house whenever pleases dont worry demolitions poor people muslims httpswwwhindustantimescomcitiesgurugramnewsentiregurugramwillhavetobedemolishedharyanagovtonforestlandhtmlhttpswwwhindustantimescomcitiesgurugramnewsentiregurugramwillhavetobedemolishedharyanagovtonforestlandhtml ",
    "cleaned_title": "old entire gurugram demolished haryana govt forest land",
    "cleaned_selftext": "apparently entire city gurgaon illegally built protected forest land house gurgaon state legally send notice demolish house whenever pleases dont worry demolitions poor people muslims httpswwwhindustantimescomcitiesgurugramnewsentiregurugramwillhavetobedemolishedharyanagovtonforestlandhtmlhttpswwwhindustantimescomcitiesgurugramnewsentiregurugramwillhavetobedemolishedharyanagovtonforestlandhtml",
    "cleaned_comments": "lmao gurugram almost completely planned private sector didnt know didnt even take approvals took approvals gurugram gurgaon headlines something else comment mentions different theyre gurgaon officially renamed gurugram oh happy cake day literally unreadable fck since bjp care forest land passed bill thatll allow deforestation unprecedented levels make minds gods sa ohhhh forest land occupied muslims makes sense carry",
    "light_cleaned_title": "[OLD] Entire Gurugram will have to be demolished: Haryana govt on ‘forest’ land",
    "light_cleaned_selftext": "Apparently, the entire city of Gurgaon is illegally built on a protected forest land. If you own a house in Gurgaon, the State can legally send you a notice and demolish your house whenever it pleases. But don't worry, because demolitions are only for poor people and Muslims. For now. [https://www.hindustantimes.com/cities/gurugram-news/entire-gurugram-will-have-to-be-demolished-haryana-govt-on-forest-land-101634925042131.html](https://www.hindustantimes.com/cities/gurugram-news/entire-gurugram-will-have-to-be-demolished-haryana-govt-on-forest-land-101634925042131.html)",
    "light_cleaned_comments": "Lmao. Gurugram was almost completely planned by the private sector. Didn't know they didn't even take approvals. They took “approvals” Gurugram or gurgaon? Headlines is something else your comment mentions different. They're the same. Gurgaon was officially renamed to Gurugram Oh, happy cake day! Literally unreadable! The f*ck? Since when does BJP care about forest land? They just passed a bill that’ll allow deforestation to unprecedented levels. Make up your minds, for god’s sa- Ohhhh, this “forest land” is occupied by Muslims? That makes sense then. Carry on."
}