{
    "id": "15mpbmj",
    "title": "1 Lakh Hindus Converted to Christianity in 1 Week | Forced Religious Conversions & Constitution",
    "url": "https://youtu.be/A8G20ARadJ8",
    "selftext": "Found this video lecture of UPSC on YouTube. What do you guys think about this? Also, demographic change in India could only be measured after the next Census.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 13,
    "created_utc": 1691610209.0,
    "convurl": "https://external-preview.redd.it/EnapHwSFkVi_gP_pabeVWDRT1EEGTN6zLSZkLMsuJC4.jpg?auto=webp&s=866393beacd73276d7b8de5bf7ff00d9e2d25631",
    "comments": [
        "How dare they? Let’s arrange a riot! Dikha denge gaddaron ko keya hota hai.",
        "People in the whole world say that indian men are disgusting filthy animals. This is not right in my opinion and i distance myself from this statement. Whats your opinion, people of india",
        "Why is this the content discussed on an educational channel for UPSC exam. Fear mongering, communal instigation and propoganda at it's finest.",
        "Nah dude. Such are some of the topics of discussion in exams like UPSC. I think this question should be discussed, how bad it may sound. These things do affect a social order. Geopolitical behaviour changes with demographic changes. Many things.",
        "Why is this considered as a social issue? If it was forceful conversion, then by all means it's an issue. \n\nWould a video on the conversion of Muslims to Hindus have or vice versa or as a matter of fact any other religion carry the same weight? \n\nThe very fact that this will affect \"geopolitics\" is the very problem of Indian politics. The line between religion and nation's politics has vanished.",
        "Be Dalit, get oppressed for thousands of years, not allowed to read, write etc for most of that time. Followers of a carpenter from middle east promise me respect and education. Show hope to get away from millenia for servitude.\n\n  \n\n\nBaman: why hindus are converting to Christianity. Who will do my menial work for whi h in too pure to do.",
        "Dude, you're all just uneducated f---s. I asked for your opinions. You took it to some other way, and so did i. I Never mentioned it as a Hindu-Muslim thing. Now give me some downvotes, go on.",
        "You've spoken like a true uneducated cunt. Congratulations!! \n\nYou say I brought up Hindu-Muslim huh? So then how are you fine with hindu-christian? Would you have been fine it was hindu-spaghetti monster conversion dumbass? \n\nOr do you only get butthurt when your little andhbhakt feelings get offended?\n\nYou asked for opinion, I gave you facts. \n\nYou didn't like it? Suck my balls benchod",
        "You've spoken like a true uneducated cunt. Congratulations!! \n\nYou say I brought up Hindu-Muslim huh? So then how are you fine with hindu-christian? Would you have been fine it was hindu-spaghetti monster conversion dumbass? \n\nOr do you only get butthurt when your little andhbhakt feelings get offended?\n\nYou asked for opinion, I gave you facts. \n\nYou didn't like it? Suck my balls benchod",
        "Putting aside the idiocy of this right-wing conspiracy theory, what's it say about a religion if a native-born practitioner's faith can be swayed with a bag of rice?",
        "I think they belong to dalit community that's why they convert",
        "Whenever one uses Hindu scriptures to display discrepancies in the Hindu religion, Hindus quickly claim that scriptures mean nothing and a Hindu can believe or worship whoever he/she wants to believe in or worship.\n\nThen, they ban beef and cry about conversions.\nI am now convinced that most Hindus are completely clueless of their own religion/scripture and such conversions are partially their own faults.\n\nWhen was the last time a Hindu got into a debate regarding Hinduism and didn't get wrecked? \n\nMuslims are always open for discussions and Christians also have room for such discussions.\n\nHindus, in such discussions, often either discuss about everything else other than Hinduism or behave in a dodgy manner by simply rejecting their own scriptures instead of defending them.\n\nAnyone who wishes to find the truth knows that following a religion simply because their parents followed it isn't reason enough.\n\nHowever, not hating on Hindus. Solution is, learn your own religion, have scholars debate and preach and at the very least, try to discuss about Hinduism for 2 minutes without using whataboutery towards Islam."
    ],
    "cleaned_text": "lakh hindus converted christianity week forced religious conversions constitution found video lecture upsc youtube guys think also demographic change india could measured next census ",
    "cleaned_title": "lakh hindus converted christianity week forced religious conversions constitution",
    "cleaned_selftext": "found video lecture upsc youtube guys think also demographic change india could measured next census",
    "cleaned_comments": "dare lets arrange riot dikha denge gaddaron ko keya hota hai people whole world say indian men disgusting filthy animals right opinion distance statement whats opinion people india content discussed educational channel upsc exam fear mongering communal instigation propoganda finest nah dude topics discussion exams like upsc think question discussed bad may sound things affect social order geopolitical behaviour changes demographic changes many things considered social issue forceful conversion means issue would video conversion muslims hindus vice versa matter fact religion carry weight fact affect geopolitics problem indian politics line religion nations politics vanished dalit get oppressed thousands years allowed read write etc time followers carpenter middle east promise respect education show hope get away millenia servitude baman hindus converting christianity menial work whi h pure dude youre uneducated fs asked opinions took way never mentioned hindumuslim thing give downvotes go youve spoken like true uneducated cunt congratulations say brought hindumuslim huh fine hinduchristian would fine hinduspaghetti monster conversion dumbass get butthurt little andhbhakt feelings get offended asked opinion gave facts didnt like suck balls benchod youve spoken like true uneducated cunt congratulations say brought hindumuslim huh fine hinduchristian would fine hinduspaghetti monster conversion dumbass get butthurt little andhbhakt feelings get offended asked opinion gave facts didnt like suck balls benchod putting aside idiocy rightwing conspiracy theory whats say religion nativeborn practitioners faith swayed bag rice think belong dalit community thats convert whenever one uses hindu scriptures display discrepancies hindu religion hindus quickly claim scriptures mean nothing hindu believe worship whoever heshe wants believe worship ban beef cry conversions convinced hindus completely clueless religionscripture conversions partially faults last time hindu got debate regarding hinduism didnt get wrecked muslims always open discussions christians also room discussions hindus discussions often either discuss everything else hinduism behave dodgy manner simply rejecting scriptures instead defending anyone wishes find truth knows following religion simply parents followed isnt reason enough however hating hindus solution learn religion scholars debate preach least try discuss hinduism minutes without using whataboutery towards islam",
    "light_cleaned_title": "1 Lakh Hindus Converted to Christianity in 1 Week | Forced Religious Conversions & Constitution",
    "light_cleaned_selftext": "Found this video lecture of UPSC on YouTube. What do you guys think about this? Also, demographic change in India could only be measured after the next Census.",
    "light_cleaned_comments": "How dare they? Let’s arrange a riot! Dikha denge gaddaron ko keya hota hai. People in the whole world say that indian men are disgusting filthy animals. This is not right in my opinion and i distance myself from this statement. Whats your opinion, people of india Why is this the content discussed on an educational channel for UPSC exam. Fear mongering, communal instigation and propoganda at it's finest. Nah dude. Such are some of the topics of discussion in exams like UPSC. I think this question should be discussed, how bad it may sound. These things do affect a social order. Geopolitical behaviour changes with demographic changes. Many things. Why is this considered as a social issue? If it was forceful conversion, then by all means it's an issue. Would a video on the conversion of Muslims to Hindus have or vice versa or as a matter of fact any other religion carry the same weight? The very fact that this will affect \"geopolitics\" is the very problem of Indian politics. The line between religion and nation's politics has vanished. Be Dalit, get oppressed for thousands of years, not allowed to read, write etc for most of that time. Followers of a carpenter from middle east promise me respect and education. Show hope to get away from millenia for servitude. Baman: why hindus are converting to Christianity. Who will do my menial work for whi h in too pure to do. Dude, you're all just uneducated f---s. I asked for your opinions. You took it to some other way, and so did i. I Never mentioned it as a Hindu-Muslim thing. Now give me some downvotes, go on. You've spoken like a true uneducated cunt. Congratulations!! You say I brought up Hindu-Muslim huh? So then how are you fine with hindu-christian? Would you have been fine it was hindu-spaghetti monster conversion dumbass? Or do you only get butthurt when your little andhbhakt feelings get offended? You asked for opinion, I gave you facts. You didn't like it? Suck my balls benchod You've spoken like a true uneducated cunt. Congratulations!! You say I brought up Hindu-Muslim huh? So then how are you fine with hindu-christian? Would you have been fine it was hindu-spaghetti monster conversion dumbass? Or do you only get butthurt when your little andhbhakt feelings get offended? You asked for opinion, I gave you facts. You didn't like it? Suck my balls benchod Putting aside the idiocy of this right-wing conspiracy theory, what's it say about a religion if a native-born practitioner's faith can be swayed with a bag of rice? I think they belong to dalit community that's why they convert Whenever one uses Hindu scriptures to display discrepancies in the Hindu religion, Hindus quickly claim that scriptures mean nothing and a Hindu can believe or worship whoever he/she wants to believe in or worship. Then, they ban beef and cry about conversions. I am now convinced that most Hindus are completely clueless of their own religion/scripture and such conversions are partially their own faults. When was the last time a Hindu got into a debate regarding Hinduism and didn't get wrecked? Muslims are always open for discussions and Christians also have room for such discussions. Hindus, in such discussions, often either discuss about everything else other than Hinduism or behave in a dodgy manner by simply rejecting their own scriptures instead of defending them. Anyone who wishes to find the truth knows that following a religion simply because their parents followed it isn't reason enough. However, not hating on Hindus. Solution is, learn your own religion, have scholars debate and preach and at the very least, try to discuss about Hinduism for 2 minutes without using whataboutery towards Islam."
}