{
    "id": "1bfkgku",
    "title": "India, we have a rape problem. What are we doing about it?",
    "url": "https://www.hindustantimes.com/opinion/india-we-have-a-rape-problem-what-are-we-doing-about-it-101710043585557.html",
    "selftext": "It’s about time the response to news of rape stops being about anything but changing our culture to stop hating on, exerting power over and controlling women. The only tangible difference anyone can make is to accept we have a problem and try and end this cycle of perpetuating rape culture. It has to do with the way all of us look at and value women as human beings, at every socioeconomic level, in every state and of every religion. Rapists aren’t boogie men that jump out at night, out of nowhere. They’re the people around us, our families, friends and colleagues, all set on the belief that women are commodities that they have a right over.\n\nThinking the way we do has made it acceptable for our government to respond to news of rape by voicing concerns about tourism or the coast guard to cover their liability in the recent news of child rape, rather than focusing on preventing things like this happening in the future and genuinely apologising for their part in allowing predators to slip under the cracks. ",
    "flair": "Crime",
    "score": 84,
    "num_comments": 62,
    "created_utc": 1710526341.0,
    "convurl": "https://external-preview.redd.it/bpaeCXLC6C5FlG_Yf5txSJJzluqF_hOgXIkhToWpXxE.jpg?auto=webp&s=c631a36d513cc7e662e9d50a83af50a76ed283af",
    "comments": [
        "https://youtu.be/-P_Kn5dQuOo?si=oWdjXyq1NhDoGmx_",
        "Same for womens to. I had seen in many video that women directly hit the men slap or kick. Actions should also be taken against them.",
        "https://preview.redd.it/61enrn14ljoc1.jpeg?width=840&format=pjpg&auto=webp&s=5c20403ac5ee6eb99c05cff754c6d578ab9a5456",
        ">They’re the people around us, our families, friends and colleagues, all set on the belief that women are commodities that they have a right over.\n\nWe need sex ed so bad in this country, we need them in government schools as much as we do in international schools. We also probably need cultural sensitivity training as onboarding in companies, including gig workers. We need to tell our population what consent is, what undiscovered entitlement they might have and how in a civilized society those are extremely wrong and problematic.\n\nWe need to tell our friends (irrespective of gender) when they are being sexist. No, we don't necessarily need to call them out, rather have a conversation about it. If you see something, say something applies everywhere.",
        "See Deepika bhardwaj mam one video on raj shamani. you will realise what is happening in the country.",
        "we are whining on an anonymous platform rather than holding politicians accountable for not doing any good to protect the citizens.",
        "Are there reports of men being gang raped daily? Over 50% of Indian men think its OK to beat their wives. You can look this up. This isn't an equal problem and if it is to YOU then you can make a separate post",
        "Over 50%? Don't attribute your family numbers to the whole country",
        "Tired of these men invalidating women's issues. Their ability to make evth about themselves astounds me. Accountability is sth they've never been taught.",
        "I'm breaking down rn💔",
        "The house on the LHS stays cool tho. /s",
        "Honestly, you guys are naive af. Rapists are in general psychopaths/sadists (1 in 100 people), they feel no remorse on others sadness. There’s no amount of sexEd or anything of this sort that’s gonna prevent this. It happens in all countries and has been happening since humanity existed.\n\nNow I’m not saying we give up, but the best way to tackle this is make the punishment as strict as possible and make it viewable to the entire nation. This is THE ONLY WAY to prevent this. (Ex Saudi)\n\nIs other way is to change people? People who want to rape will exist no matter what we do. Unless we find gene editing or some shit to make everyone an empath by default, this issue won’t be solved",
        "Only going to get worse.",
        "Answer:- asking girls not to leave the house without  their 10 year old brother.\n\nLogic: that 10 year will protect her from bad guys.",
        "Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby. \n\nWith this teach kids from school to respect others. \n\nMake parents aware to take extra care & keep a watch in there neighbourhood. \n\n80% of cases victim is from surroundings so staying alert & showing any kind of signs need to be alerted immediately.",
        "While you are absolutely right in pointing out the lack of accountability from any government, the rot runs deeper . The parenting , the man in the center of the patriarchal, misogynistic structures, the retarded religious taboos , mothers raising girls as a weaker sex, the media content around us, all contributes to the epidemic which is only getting worse.\n\nEven in the best educated families , patriarchy, misogyny and sexism runs deep. \n\nThere is not much to repair in an already morally corrupt world",
        "It may be beneficial for human beings to progressively modify their genetic makeup to increasingly adopt asexuality over time.",
        "[India is #95 on this list of global rape rates.](https://www.datapandas.org/ranking/rape-statistics-by-country)\n\nEach case is being widely exposed here on the internet, but globally India is doing better than most in this area. Obviously zero rapes would be ideal, but it may be rash to think India is worse than others.",
        "Hear me out! If India was not conservative, we wouldn't have so many cases. People would be liberated and it won't be a taboo so they won't resort to getting it the evil way",
        "76% rape cases are fake only LMAO  \nnow you will counter with some women retake the offer but even some other report says around 50% are fake.",
        "even around 30-35% women think its ok to get beaten by hubsand/",
        "Over 70% of rapes don't even get reported.",
        "India reported less than 1000 rapes of those under 18 in 2022. There were 30000 or so reported rapes in 2022. \r\n\r\nThese are reported official numbers. Anyone who believes this number is ...",
        "India reported less than 1000 rapes of those under 18 in 2022. There were 30000 or so reported rapes in 2022. A lot of states like Gujarat, MH reported 0 under 18 rapes. \r\n\r\nThese are reported official numbers. Anyone who believes this number is ...",
        "The main culprits are lack of education, items songs objectifying women basically 90% of songs in our movies, lack of law enforcement and access to porn. We need to address these on war footing. Even then it will take years before we see any drop in numbers.",
        "Our society has to reform from the bottom-line. Education should be the first step. Especially focusing on young adults and children. Teach them to communicate with women and girls within the same age group also teach them to understand about the opposite gender.",
        "We lack understanding towards the opposite gender, especially for males to females. Only communication and interaction towards each other can we understand both. Many have misconceptions towards each other. Like objectification, in my opinion, is a misconception because men don't understand women by a large margin. \n\nFor example, You can only understand this much from books or references and the rest should be experienced or practiced. Like being a mother or father, doctors and parents can teach you something but the rest you have to experience (these are all examples, I don't have any better example to give).",
        "Pepper spray is a must! ",
        "Don't why you are getting down voted. Many rapists are indeed psychopathic and sadistic in nature. They have no empathy that causes them to even feel a little bit of what the victim is going through. They also take delight in making the victim go through pain. \n\n\nThe suggestions given by the other commenter are also good, but we have to look at this aspect as well. The psychological aspect to it.  A lot of rape also happens due to power dynamics. Many predators get off to the fact that they have control over an entire person's body. Necrophilia, to some extent, has motives like this.",
        "Well, Society in short 🥲.",
        "Castration to rapists",
        "honestly i dont think it has anything to do with being conservative or not in american here where its pretyy liberal have very high rape cases too expecially in colleges where its moslty liberal , i think there needs to be very strict punishement and also criminal need to stop being protocted and why is there identity being hidden",
        "All of this reminds me of a particular song I heard a while back. In it, there was a line that goes \"not all men, yes all men, need all men for what we're solving\". This directly calls out people who subvert the issue by saying that not all men are rapists.\n\nThe thing is, this problem is deep-rooted in our society. And unless each and every man takes responsibility, it won't be solved. Plain and simple.",
        "Many cases reported in ame Uni are just fake. It's when people get drunk and perform the act and regret it the next morning so they label it as non consensual. Rape is a serious offence even in the United States they have the whole rape culture thing going on. \nAlso, for valentine's day they give away free protection to students for std awareness. If a country is liberal where everyone sees sex at its face value and does not hide from it shy away from it, see it as a disgust, refrain from talking about it etc it becomes normal and people don't resort to violence. \nIndia is too backward when it comes to this aspect, parents dont communicate about physical needs, they refrain from sex education to their kids, if a school teach it, they ban and silence the school in the name of innocence.\n\nIt is a basic human need and if everyone is so secret about it, some minority who are evil and vile will resort to it to fulfill their needs in an unconventional manner. I don't sympathise with evil, they are wrong but society is also wrong for provoking the evil",
        "It is about the system too. Police aren't trained to handle evidence properly. A rape and murder case dna evidence was unintentionally destroyed by police. The murders even confessed but that was overruled by supreme court and now they are free and raped another girl.",
        "> Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby.\n\nLocal Govts can't keep traffic CCTVs running. Either they don't get or it gets eaten up earlier. We have numerous CCTVs that are non operational. \n\n> pepper spray and Alarm whistle to alert people nearby.\n\nApart from like 1 or 2% cases, pepper spray and alarm whistle wouldn't really help. Of the high profile cases, how many are you going to be able to hit with pepper spray in 1vx scenarios.\n\n> With this teach kids from school to respect others.\n\nSchool already try to do it. It is the families and friends that fail.\n\n> 80% of cases the accused is from surroundings so staying alert & showing any kind of signs need to be alerted immediately.\n\n[94% of cases perpetrator known.](https://www.indiatoday.in/india/story/rapes-in-india-offenders-victim-minor-data-ncrb-1635691-2020-01-10) \n\n> In 15,972 of the total 33,356 rape cases, the offenders were either family friends or neighbour or employer or other known person, while in 12,568 cases, the offenders were friends or online friends or live-in partner on pretext of marriage or separated husband, the data stated.\n\n> In 2,780 cases, the victims were violated by their own family members, while only in 2,036 cases the offenders were unknown to them, according to the statistics.\n\nMajority of rape cases don't really happen where other people can help. And, you won't have pepper spray in hand unless you are already scared, not the case with people you know.",
        "Start brothels.",
        "And you seriously think that's a good thing. I pity the women in your life. No-one is saying man rape does not happen but here we are talking about rape against women and it does not make sense to talk about men when talking about women",
        "We are currently playing \"Hindu khatre me hai\"\n\nWill play this in the next term",
        ">India, we have a rape problem. What are we doing about it?\n\nWhataboutism",
        "> Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby.\n\n> Make parents aware to take extra care & keep a watch in there neighbourhood.\n\n> 80% of cases the accused is from surroundings so staying alert & showing any kind of signs need to be alerted immediately.\n\nThe stopgap seems to be living in a police state, where we are constantly driven by fear of our surroundings and people in it.\n\n> With this teach kids from school to respect others.\n\nWe keep insisting this even today. What exactly different do you want to teach ?\n\n> Villages & Rural area need education & teach them to change mentality.\n\nUmmm a lot of violence happens in urban areas. I don’t think it’s a village & rural area problem.\n\n\nI personally think we need throw our entire Indian cultural norms and society in the garbage and start afresh. The only thing that will actually help solve the problem is a massive cultural revolution, where people start questioning our societal structures and belief systems.",
        "Socio-Cultural Norms: Traditional patriarchal norms often place women in subordinate positions in society. These norms can manifest in gender discrimination, including preferences for male children, which undermines the value and autonomy of women and girls.\n\nEconomic Factors: Economic dependency on male family members can leave women with limited personal freedom and decision-making power. This dependency is exacerbated by lower literacy and employment rates among women in certain areas, making it difficult for them to seek independence or escape abusive situations.\n\nLegal and Institutional Challenges: While India has robust laws aimed at protecting women's rights, the implementation and enforcement of these laws can be inconsistent. Delays in the legal process, under-reporting of crimes against women due to social stigma, and lack of trust in the police force contribute to a sense of impunity for perpetrators.\n\nEducation and Awareness: Limited access to education for women and girls, particularly in rural areas, restricts their socioeconomic opportunities and awareness of their rights. Education is a key factor in empowering women to stand up against abuses and discrimination.\n\nViolence and Harassment: Women in India face various forms of violence and harassment, including domestic violence, sexual assault, honor killings, and acid attacks. These acts are not only perpetrated by family members but also by others within the community, often reflecting deeper societal issues regarding gender norms and the value of women.\n\nPublic Safety and Infrastructure: Inadequate public safety measures, poor urban planning, and lack of secure transportation contribute to the vulnerability of women in public spaces. The fear of sexual harassment in public places limits women's mobility and their ability to participate fully in society.\n\nMedia and Representation: The portrayal of women in Indian media often reinforces stereotypes that can contribute to the normalization of violence against women. While there is a growing awareness and effort to challenge these portrayals, change is gradual.\n\nPolitical Representation: Although there have been significant strides in increasing women's representation in politics, women are still underrepresented in legislative bodies. Greater representation could lead to more focus on issues affecting women and more effective policies to address those issues.\n\nIt's crucial to note that these factors are deeply interrelated, and addressing the dangers faced by women in India requires a multifaceted approach that involves legal reform, education, economic empowerment, and societal change. The situation varies widely across different parts of the country, influenced by local cultural norms, economic conditions, and the effectiveness of law enforcement and social services.",
        "Stricter punishment and cctv camera SOS boxes that contact police like in korea and bengalore are some mandatory requirements",
        "Sex Ed, high surveillance",
        "India has a poverty problem, drop a trillion dollars on indian and most of these issues will vanish overnight",
        ">The parenting , the man in the center of the patriarchal, misogynistic structures, the retarded religious taboos , mothers raising girls as a weaker sex, the media content around us, all contributes to the epidemic which is only getting worse.\n\nI really believe mandating sex education in schools and taking actions against influencers who promote misogynistic content will help to some extent. and only government can do it.",
        "All the men in my family are super respectful and considerate. But you can look it up and there's NUMEROUS surveys. Most popular article by deccan herald",
        "Unpopular opinion: do not travel alone or at night to unfamiliar areas. Do not leave your daughter and women alone with men even if they are relative.\n\nPrevention is better than cure, where rape is prevalent. There's no point waiting for the society to change. Just protect yourself.",
        "Almost every woman knows this and does this already, so this being a solution for rape prevention is like beating a dead horse. \n\nEven if women did exclusively this, at what point do we curb our existence? Normalising ‘women shouldn’t exist’ is the end goal of a suggestion like this. It’s also then the responsibility of the victim to prevent rape and not society as a whole. \n\nIf never seeing women (like in middle eastern cultures and to a lesser but abnormal level in India) out and about living their lives becomes the cultural norm, women that do so become ‘abnormal’ and worthy of mistreatment.\n\nIt’s the places and cultures where women don’t exist unless shrouded by men where rape culture is strongest. \n\nSo yea, we’ll be safe, but also moving backwards and giving half the population even less autonomy than before.",
        "Society won't change so just protect yourself. These discussions are futile.",
        "This discussions are necessary, regardless of how futile they appear in the short term. If your solution is to never speak up, you're pandering to a defective society.",
        "Society is rotten. You'll still be having this same discussion in 2047.",
        "Are you trying to say nobody should discuss it because it bothers you? Or that nobody should discuss changes we need just because they seem impossible? Either is a shitty outlook. The whole 'look the other way and don't get involved' is either a privileged or perpetuating stance.",
        "> Honestly, you guys are naive af. Rapists are in general psychopaths/sadists (1 in 100 people), they feel no remorse on others sadness. There’s no amount of sexEd or anything of this sort that’s gonna prevent this.\n\nExactly.",
        "It doesn't bother me. My comment was towards individuals. Protect your daughters, wives, sisters, and mothers. Society is rotten to the core, and don't wait for it to reform. Prevention is better than cure."
    ],
    "cleaned_text": "india rape problem time response news rape stops anything changing culture stop hating exerting power controlling women tangible difference anyone make accept problem try end cycle perpetuating rape culture way us look value women human beings every socioeconomic level every state every religion rapists arent boogie men jump night nowhere theyre people around us families friends colleagues set belief women commodities right thinking way made acceptable government respond news rape voicing concerns tourism coast guard cover liability recent news child rape rather focusing preventing things like happening future genuinely apologising part allowing predators slip cracks ",
    "cleaned_title": "india rape problem",
    "cleaned_selftext": "time response news rape stops anything changing culture stop hating exerting power controlling women tangible difference anyone make accept problem try end cycle perpetuating rape culture way us look value women human beings every socioeconomic level every state every religion rapists arent boogie men jump night nowhere theyre people around us families friends colleagues set belief women commodities right thinking way made acceptable government respond news rape voicing concerns tourism coast guard cover liability recent news child rape rather focusing preventing things like happening future genuinely apologising part allowing predators slip cracks",
    "cleaned_comments": "womens seen many video women directly hit men slap kick actions also taken theyre people around us families friends colleagues set belief women commodities right need sex ed bad country need government schools much international schools also probably need cultural sensitivity training onboarding companies including gig workers need tell population consent undiscovered entitlement might civilized society extremely wrong problematic need tell friends irrespective gender sexist dont necessarily need call rather conversation see something say something applies everywhere see deepika bhardwaj mam one video raj shamani realise happening country whining anonymous platform rather holding politicians accountable good protect citizens reports men gang raped daily indian men think ok beat wives look isnt equal problem make separate post dont attribute family numbers whole country tired men invalidating womens issues ability make evth astounds accountability sth theyve never taught im breaking rn house lhs stays cool tho honestly guys naive af rapists general psychopathssadists people feel remorse others sadness theres amount sexed anything sort thats gon na prevent happens countries happening since humanity existed im saying give best way tackle make punishment strict possible make viewable entire nation way prevent ex saudi way change people people want rape exist matter unless find gene editing shit make everyone empath default issue wont solved going get worse answer asking girls leave house without year old brother logic year protect bad guys cctv everywhere possible give women free training self defence pepper spray alarm whistle alert people nearby teach kids school respect others make parents aware take extra care keep watch neighbourhood cases victim surroundings staying alert showing kind signs need alerted immediately absolutely right pointing lack accountability government rot runs deeper parenting man center patriarchal misogynistic structures retarded religious taboos mothers raising girls weaker sex media content around us contributes epidemic getting worse even best educated families patriarchy misogyny sexism runs deep much repair already morally corrupt world may beneficial human beings progressively modify genetic makeup increasingly adopt asexuality time india list global rape rateshttpswwwdatapandasorgrankingrapestatisticsbycountry case widely exposed internet globally india better area obviously zero rapes would ideal may rash think india worse others hear india conservative wouldnt many cases people would liberated wont taboo wont resort getting evil way rape cases fake lmao counter women retake offer even report says around fake even around women think ok get beaten hubsand rapes dont even get reported india reported less rapes reported rapes reported official numbers anyone believes number india reported less rapes reported rapes lot states like gujarat mh reported rapes reported official numbers anyone believes number main culprits lack education items songs objectifying women basically songs movies lack law enforcement access porn need address war footing even take years see drop numbers society reform bottomline education first step especially focusing young adults children teach communicate women girls within age group also teach understand opposite gender lack understanding towards opposite gender especially males females communication interaction towards understand many misconceptions towards like objectification opinion misconception men dont understand women large margin example understand much books references rest experienced practiced like mother father doctors parents teach something rest experience examples dont better example give pepper spray must dont getting voted many rapists indeed psychopathic sadistic nature empathy causes even feel little bit victim going also take delight making victim go pain suggestions given commenter also good look aspect well psychological aspect lot rape also happens due power dynamics many predators get fact control entire persons body necrophilia extent motives like well society short castration rapists honestly dont think anything conservative american pretyy liberal high rape cases expecially colleges moslty liberal think needs strict punishement also criminal need stop protocted identity hidden reminds particular song heard back line goes men yes men need men solving directly calls people subvert issue saying men rapists thing problem deeprooted society unless every man takes responsibility wont solved plain simple many cases reported ame uni fake people get drunk perform act regret next morning label non consensual rape serious offence even united states whole rape culture thing going also valentines day give away free protection students std awareness country liberal everyone sees sex face value hide shy away see disgust refrain talking etc becomes normal people dont resort violence india backward comes aspect parents dont communicate physical needs refrain sex education kids school teach ban silence school name innocence basic human need everyone secret minority evil vile resort fulfill needs unconventional manner dont sympathise evil wrong society also wrong provoking evil system police arent trained handle evidence properly rape murder case dna evidence unintentionally destroyed police murders even confessed overruled supreme court free raped another girl cctv everywhere possible give women free training self defence pepper spray alarm whistle alert people nearby local govts cant keep traffic cctvs running either dont get gets eaten earlier numerous cctvs non operational pepper spray alarm whistle alert people nearby apart like cases pepper spray alarm whistle wouldnt really help high profile cases many going able hit pepper spray vx scenarios teach kids school respect others school already try families friends fail cases accused surroundings staying alert showing kind signs need alerted immediately cases perpetrator knownhttpswwwindiatodayinindiastoryrapesinindiaoffendersvictimminordatancrb total rape cases offenders either family friends neighbour employer known person cases offenders friends online friends livein partner pretext marriage separated husband data stated cases victims violated family members cases offenders unknown according statistics majority rape cases dont really happen people help wont pepper spray hand unless already scared case people know start brothels seriously think thats good thing pity women life noone saying man rape happen talking rape women make sense talk men talking women currently playing hindu khatre hai play next term india rape problem whataboutism cctv everywhere possible give women free training self defence pepper spray alarm whistle alert people nearby make parents aware take extra care keep watch neighbourhood cases accused surroundings staying alert showing kind signs need alerted immediately stopgap seems living police state constantly driven fear surroundings people teach kids school respect others keep insisting even today exactly different want teach villages rural area need education teach change mentality ummm lot violence happens urban areas dont think village rural area problem personally think need throw entire indian cultural norms society garbage start afresh thing actually help solve problem massive cultural revolution people start questioning societal structures belief systems sociocultural norms traditional patriarchal norms often place women subordinate positions society norms manifest gender discrimination including preferences male children undermines value autonomy women girls economic factors economic dependency male family members leave women limited personal freedom decisionmaking power dependency exacerbated lower literacy employment rates among women certain areas making difficult seek independence escape abusive situations legal institutional challenges india robust laws aimed protecting womens rights implementation enforcement laws inconsistent delays legal process underreporting crimes women due social stigma lack trust police force contribute sense impunity perpetrators education awareness limited access education women girls particularly rural areas restricts socioeconomic opportunities awareness rights education key factor empowering women stand abuses discrimination violence harassment women india face various forms violence harassment including domestic violence sexual assault honor killings acid attacks acts perpetrated family members also others within community often reflecting deeper societal issues regarding gender norms value women public safety infrastructure inadequate public safety measures poor urban planning lack secure transportation contribute vulnerability women public spaces fear sexual harassment public places limits womens mobility ability participate fully society media representation portrayal women indian media often reinforces stereotypes contribute normalization violence women growing awareness effort challenge portrayals change gradual political representation although significant strides increasing womens representation politics women still underrepresented legislative bodies greater representation could lead focus issues affecting women effective policies address issues crucial note factors deeply interrelated addressing dangers faced women india requires multifaceted approach involves legal reform education economic empowerment societal change situation varies widely across different parts country influenced local cultural norms economic conditions effectiveness law enforcement social services stricter punishment cctv camera sos boxes contact police like korea bengalore mandatory requirements sex ed high surveillance india poverty problem drop trillion dollars indian issues vanish overnight parenting man center patriarchal misogynistic structures retarded religious taboos mothers raising girls weaker sex media content around us contributes epidemic getting worse really believe mandating sex education schools taking actions influencers promote misogynistic content help extent government men family super respectful considerate look theres numerous surveys popular article deccan herald unpopular opinion travel alone night unfamiliar areas leave daughter women alone men even relative prevention better cure rape prevalent theres point waiting society change protect almost every woman knows already solution rape prevention like beating dead horse even women exclusively point curb existence normalising women shouldnt exist end goal suggestion like also responsibility victim prevent rape society whole never seeing women like middle eastern cultures lesser abnormal level india living lives becomes cultural norm women become abnormal worthy mistreatment places cultures women dont exist unless shrouded men rape culture strongest yea well safe also moving backwards giving half population even less autonomy society wont change protect discussions futile discussions necessary regardless futile appear short term solution never speak youre pandering defective society society rotten youll still discussion trying say nobody discuss bothers nobody discuss changes need seem impossible either shitty outlook whole look way dont get involved either privileged perpetuating stance honestly guys naive af rapists general psychopathssadists people feel remorse others sadness theres amount sexed anything sort thats gon na prevent exactly doesnt bother comment towards individuals protect daughters wives sisters mothers society rotten core dont wait reform prevention better cure",
    "light_cleaned_title": "India, we have a rape problem. What are we doing about it?",
    "light_cleaned_selftext": "It’s about time the response to news of rape stops being about anything but changing our culture to stop hating on, exerting power over and controlling women. The only tangible difference anyone can make is to accept we have a problem and try and end this cycle of perpetuating rape culture. It has to do with the way all of us look at and value women as human beings, at every socioeconomic level, in every state and of every religion. Rapists aren’t boogie men that jump out at night, out of nowhere. They’re the people around us, our families, friends and colleagues, all set on the belief that women are commodities that they have a right over. Thinking the way we do has made it acceptable for our government to respond to news of rape by voicing concerns about tourism or the coast guard to cover their liability in the recent news of child rape, rather than focusing on preventing things like this happening in the future and genuinely apologising for their part in allowing predators to slip under the cracks.",
    "light_cleaned_comments": "Same for womens to. I had seen in many video that women directly hit the men slap or kick. Actions should also be taken against them. >They’re the people around us, our families, friends and colleagues, all set on the belief that women are commodities that they have a right over. We need sex ed so bad in this country, we need them in government schools as much as we do in international schools. We also probably need cultural sensitivity training as onboarding in companies, including gig workers. We need to tell our population what consent is, what undiscovered entitlement they might have and how in a civilized society those are extremely wrong and problematic. We need to tell our friends (irrespective of gender) when they are being sexist. No, we don't necessarily need to call them out, rather have a conversation about it. If you see something, say something applies everywhere. See Deepika bhardwaj mam one video on raj shamani. you will realise what is happening in the country. we are whining on an anonymous platform rather than holding politicians accountable for not doing any good to protect the citizens. Are there reports of men being gang raped daily? Over 50% of Indian men think its OK to beat their wives. You can look this up. This isn't an equal problem and if it is to YOU then you can make a separate post Over 50%? Don't attribute your family numbers to the whole country Tired of these men invalidating women's issues. Their ability to make evth about themselves astounds me. Accountability is sth they've never been taught. I'm breaking down rn💔 The house on the LHS stays cool tho. /s Honestly, you guys are naive af. Rapists are in general psychopaths/sadists (1 in 100 people), they feel no remorse on others sadness. There’s no amount of sexEd or anything of this sort that’s gonna prevent this. It happens in all countries and has been happening since humanity existed. Now I’m not saying we give up, but the best way to tackle this is make the punishment as strict as possible and make it viewable to the entire nation. This is THE ONLY WAY to prevent this. (Ex Saudi) Is other way is to change people? People who want to rape will exist no matter what we do. Unless we find gene editing or some shit to make everyone an empath by default, this issue won’t be solved Only going to get worse. Answer:- asking girls not to leave the house without their 10 year old brother. Logic: that 10 year will protect her from bad guys. Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby. With this teach kids from school to respect others. Make parents aware to take extra care & keep a watch in there neighbourhood. 80% of cases victim is from surroundings so staying alert & showing any kind of signs need to be alerted immediately. While you are absolutely right in pointing out the lack of accountability from any government, the rot runs deeper . The parenting , the man in the center of the patriarchal, misogynistic structures, the retarded religious taboos , mothers raising girls as a weaker sex, the media content around us, all contributes to the epidemic which is only getting worse. Even in the best educated families , patriarchy, misogyny and sexism runs deep. There is not much to repair in an already morally corrupt world It may be beneficial for human beings to progressively modify their genetic makeup to increasingly adopt asexuality over time. [India is #95 on this list of global rape rates.](https://www.datapandas.org/ranking/rape-statistics-by-country) Each case is being widely exposed here on the internet, but globally India is doing better than most in this area. Obviously zero rapes would be ideal, but it may be rash to think India is worse than others. Hear me out! If India was not conservative, we wouldn't have so many cases. People would be liberated and it won't be a taboo so they won't resort to getting it the evil way 76% rape cases are fake only LMAO now you will counter with some women retake the offer but even some other report says around 50% are fake. even around 30-35% women think its ok to get beaten by hubsand/ Over 70% of rapes don't even get reported. India reported less than 1000 rapes of those under 18 in 2022. There were 30000 or so reported rapes in 2022. These are reported official numbers. Anyone who believes this number is ... India reported less than 1000 rapes of those under 18 in 2022. There were 30000 or so reported rapes in 2022. A lot of states like Gujarat, MH reported 0 under 18 rapes. These are reported official numbers. Anyone who believes this number is ... The main culprits are lack of education, items songs objectifying women basically 90% of songs in our movies, lack of law enforcement and access to porn. We need to address these on war footing. Even then it will take years before we see any drop in numbers. Our society has to reform from the bottom-line. Education should be the first step. Especially focusing on young adults and children. Teach them to communicate with women and girls within the same age group also teach them to understand about the opposite gender. We lack understanding towards the opposite gender, especially for males to females. Only communication and interaction towards each other can we understand both. Many have misconceptions towards each other. Like objectification, in my opinion, is a misconception because men don't understand women by a large margin. For example, You can only understand this much from books or references and the rest should be experienced or practiced. Like being a mother or father, doctors and parents can teach you something but the rest you have to experience (these are all examples, I don't have any better example to give). Pepper spray is a must! Don't why you are getting down voted. Many rapists are indeed psychopathic and sadistic in nature. They have no empathy that causes them to even feel a little bit of what the victim is going through. They also take delight in making the victim go through pain. The suggestions given by the other commenter are also good, but we have to look at this aspect as well. The psychological aspect to it. A lot of rape also happens due to power dynamics. Many predators get off to the fact that they have control over an entire person's body. Necrophilia, to some extent, has motives like this. Well, Society in short 🥲. Castration to rapists honestly i dont think it has anything to do with being conservative or not in american here where its pretyy liberal have very high rape cases too expecially in colleges where its moslty liberal , i think there needs to be very strict punishement and also criminal need to stop being protocted and why is there identity being hidden All of this reminds me of a particular song I heard a while back. In it, there was a line that goes \"not all men, yes all men, need all men for what we're solving\". This directly calls out people who subvert the issue by saying that not all men are rapists. The thing is, this problem is deep-rooted in our society. And unless each and every man takes responsibility, it won't be solved. Plain and simple. Many cases reported in ame Uni are just fake. It's when people get drunk and perform the act and regret it the next morning so they label it as non consensual. Rape is a serious offence even in the United States they have the whole rape culture thing going on. Also, for valentine's day they give away free protection to students for std awareness. If a country is liberal where everyone sees sex at its face value and does not hide from it shy away from it, see it as a disgust, refrain from talking about it etc it becomes normal and people don't resort to violence. India is too backward when it comes to this aspect, parents dont communicate about physical needs, they refrain from sex education to their kids, if a school teach it, they ban and silence the school in the name of innocence. It is a basic human need and if everyone is so secret about it, some minority who are evil and vile will resort to it to fulfill their needs in an unconventional manner. I don't sympathise with evil, they are wrong but society is also wrong for provoking the evil It is about the system too. Police aren't trained to handle evidence properly. A rape and murder case dna evidence was unintentionally destroyed by police. The murders even confessed but that was overruled by supreme court and now they are free and raped another girl. > Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby. Local Govts can't keep traffic CCTVs running. Either they don't get or it gets eaten up earlier. We have numerous CCTVs that are non operational. > pepper spray and Alarm whistle to alert people nearby. Apart from like 1 or 2% cases, pepper spray and alarm whistle wouldn't really help. Of the high profile cases, how many are you going to be able to hit with pepper spray in 1vx scenarios. > With this teach kids from school to respect others. School already try to do it. It is the families and friends that fail. > 80% of cases the accused is from surroundings so staying alert & showing any kind of signs need to be alerted immediately. [94% of cases perpetrator known.](https://www.indiatoday.in/india/story/rapes-in-india-offenders-victim-minor-data-ncrb-1635691-2020-01-10) > In 15,972 of the total 33,356 rape cases, the offenders were either family friends or neighbour or employer or other known person, while in 12,568 cases, the offenders were friends or online friends or live-in partner on pretext of marriage or separated husband, the data stated. > In 2,780 cases, the victims were violated by their own family members, while only in 2,036 cases the offenders were unknown to them, according to the statistics. Majority of rape cases don't really happen where other people can help. And, you won't have pepper spray in hand unless you are already scared, not the case with people you know. Start brothels. And you seriously think that's a good thing. I pity the women in your life. No-one is saying man rape does not happen but here we are talking about rape against women and it does not make sense to talk about men when talking about women We are currently playing \"Hindu khatre me hai\" Will play this in the next term >India, we have a rape problem. What are we doing about it? Whataboutism > Cctv everywhere possible and give women free training on self defence ,pepper spray and Alarm whistle to alert people nearby. > Make parents aware to take extra care & keep a watch in there neighbourhood. > 80% of cases the accused is from surroundings so staying alert & showing any kind of signs need to be alerted immediately. The stopgap seems to be living in a police state, where we are constantly driven by fear of our surroundings and people in it. > With this teach kids from school to respect others. We keep insisting this even today. What exactly different do you want to teach ? > Villages & Rural area need education & teach them to change mentality. Ummm a lot of violence happens in urban areas. I don’t think it’s a village & rural area problem. I personally think we need throw our entire Indian cultural norms and society in the garbage and start afresh. The only thing that will actually help solve the problem is a massive cultural revolution, where people start questioning our societal structures and belief systems. Socio-Cultural Norms: Traditional patriarchal norms often place women in subordinate positions in society. These norms can manifest in gender discrimination, including preferences for male children, which undermines the value and autonomy of women and girls. Economic Factors: Economic dependency on male family members can leave women with limited personal freedom and decision-making power. This dependency is exacerbated by lower literacy and employment rates among women in certain areas, making it difficult for them to seek independence or escape abusive situations. Legal and Institutional Challenges: While India has robust laws aimed at protecting women's rights, the implementation and enforcement of these laws can be inconsistent. Delays in the legal process, under-reporting of crimes against women due to social stigma, and lack of trust in the police force contribute to a sense of impunity for perpetrators. Education and Awareness: Limited access to education for women and girls, particularly in rural areas, restricts their socioeconomic opportunities and awareness of their rights. Education is a key factor in empowering women to stand up against abuses and discrimination. Violence and Harassment: Women in India face various forms of violence and harassment, including domestic violence, sexual assault, honor killings, and acid attacks. These acts are not only perpetrated by family members but also by others within the community, often reflecting deeper societal issues regarding gender norms and the value of women. Public Safety and Infrastructure: Inadequate public safety measures, poor urban planning, and lack of secure transportation contribute to the vulnerability of women in public spaces. The fear of sexual harassment in public places limits women's mobility and their ability to participate fully in society. Media and Representation: The portrayal of women in Indian media often reinforces stereotypes that can contribute to the normalization of violence against women. While there is a growing awareness and effort to challenge these portrayals, change is gradual. Political Representation: Although there have been significant strides in increasing women's representation in politics, women are still underrepresented in legislative bodies. Greater representation could lead to more focus on issues affecting women and more effective policies to address those issues. It's crucial to note that these factors are deeply interrelated, and addressing the dangers faced by women in India requires a multifaceted approach that involves legal reform, education, economic empowerment, and societal change. The situation varies widely across different parts of the country, influenced by local cultural norms, economic conditions, and the effectiveness of law enforcement and social services. Stricter punishment and cctv camera SOS boxes that contact police like in korea and bengalore are some mandatory requirements Sex Ed, high surveillance India has a poverty problem, drop a trillion dollars on indian and most of these issues will vanish overnight >The parenting , the man in the center of the patriarchal, misogynistic structures, the retarded religious taboos , mothers raising girls as a weaker sex, the media content around us, all contributes to the epidemic which is only getting worse. I really believe mandating sex education in schools and taking actions against influencers who promote misogynistic content will help to some extent. and only government can do it. All the men in my family are super respectful and considerate. But you can look it up and there's NUMEROUS surveys. Most popular article by deccan herald Unpopular opinion: do not travel alone or at night to unfamiliar areas. Do not leave your daughter and women alone with men even if they are relative. Prevention is better than cure, where rape is prevalent. There's no point waiting for the society to change. Just protect yourself. Almost every woman knows this and does this already, so this being a solution for rape prevention is like beating a dead horse. Even if women did exclusively this, at what point do we curb our existence? Normalising ‘women shouldn’t exist’ is the end goal of a suggestion like this. It’s also then the responsibility of the victim to prevent rape and not society as a whole. If never seeing women (like in middle eastern cultures and to a lesser but abnormal level in India) out and about living their lives becomes the cultural norm, women that do so become ‘abnormal’ and worthy of mistreatment. It’s the places and cultures where women don’t exist unless shrouded by men where rape culture is strongest. So yea, we’ll be safe, but also moving backwards and giving half the population even less autonomy than before. Society won't change so just protect yourself. These discussions are futile. This discussions are necessary, regardless of how futile they appear in the short term. If your solution is to never speak up, you're pandering to a defective society. Society is rotten. You'll still be having this same discussion in 2047. Are you trying to say nobody should discuss it because it bothers you? Or that nobody should discuss changes we need just because they seem impossible? Either is a shitty outlook. The whole 'look the other way and don't get involved' is either a privileged or perpetuating stance. > Honestly, you guys are naive af. Rapists are in general psychopaths/sadists (1 in 100 people), they feel no remorse on others sadness. There’s no amount of sexEd or anything of this sort that’s gonna prevent this. Exactly. It doesn't bother me. My comment was towards individuals. Protect your daughters, wives, sisters, and mothers. Society is rotten to the core, and don't wait for it to reform. Prevention is better than cure."
}