{
    "id": "1f9hhpn",
    "title": "Modern Indian Gangster ",
    "url": "https://www.reddit.com/gallery/1f9hhpn",
    "selftext": "\n> Traveling from Ayodhya to Lucknow  \n> Suddenly, these RELIGIOUS GUNDAS show up  \n> Holding a **danda** like they’re some kind of gangsters 😎  \n> Flexing hard, Saw them using their Danda in 3-4 vehicle.\n>Even police doesn't use danda on car.\n> No one dares to mess with them, crowd's too big and intimidating  \n> Can't do sh*t.  \n> Just another day on the highway...\n",
    "flair": "Rant / Vent",
    "score": 3713,
    "num_comments": 508,
    "created_utc": 1725525236.0,
    "convurl": "https://i.redd.it/j8tuo41fcymd1.jpg",
    "comments": [
        "Are they terrorists or rebels ?",
        "No scientific temperament in this country",
        "BJP, VHP, Bajrang Dal all wants you address now",
        "Gundas, mobsters, hooligans. The riff-raff bottom trash of a nation wide gangster organization.",
        "Depends upon the side you are in",
        "state sponsored thugs",
        "Go gta on them bro",
        "We need Selmon bhoi now💀",
        "the amount of time i feel scared by their presence is insane, these are boys who are usually from middle to lower class houses, with no faith or an identity, hence they join these kind of herd and think they are contributing towards something. the worst thing is they are weaponised, extremely, and a single offence to them can lead towards your death. they are extremely scary, vile, and often creeps too",
        "Only if Gods could speak",
        "Wow",
        "can't you give yr life for Hindu rashtra ?",
        "lol",
        "Very well put!",
        "Wow",
        "Respect for Selom bhoi 💯",
        "Channel Your Inner Selmon Bhai and Blame it on them !",
        "Terrible",
        "I am wondering if you will do the same to the others",
        "Yassss \n\nI am not racist man\n\nI hate all of them",
        "What!",
        "Bhai kuch hua kya gaadi ko? Ya apke aapko bacha liya? (Genuine)",
        "But realistically, one jacked up gym bro is enough for all of them. How much damage can you even do with twigs.",
        "In the long run the imbeciles from both sides Muslims and Hindus will gain nothing and their lives will be a total waste because they are so drunk on religion they won’t do anything for betterment of themselves or their family so in a way i pity them it’s the educated and well off people who have similar mindset or ideology worries me.",
        "Very astute observation",
        "Rebels usually have a cause and aims. These are just thugs.",
        "🎵They not like u/s",
        "This one is just potent without an omni",
        "They have to exist for that",
        "What does this have to do with scientific temperament?",
        "Welp! Time for lifelong prison/death sentence.",
        "kbhi tajia pe ghar se bahar niklo",
        "Which organisation do they belong to?",
        "Yeah I can't believe they were randomly hitting cars and people weren't doing shit.",
        "You seriously underestimate the power of a stick.",
        "This is why politicians want to play the religion card all the time while the loot the fuck out of every indian institution and leave the middle class to go pray for food",
        "Don't forget the Christian terrorists in the North East!",
        "Wait till you will witness Islamists mob like Bangladesh",
        "Oh really, so you're calling to murder innocent people... I hope police takes a note",
        "You're a Hater with bad ideas 😡",
        "GTA is not all about murda man.",
        "lmao why you people have to bring islam everytime in equation when theres talk about hindu mobs? yeah yeah im sorry there wont be 'islamist' mobs in a country that is saffronised through hindutva",
        "Same happens during Muharram",
        "Now say that to Khalsa's carrying swords or muslims carrying sticks during Muharram. As much as you hear shit on news, pointlessly calling group names would rile them up. This arrogance alone fuels people to hold their believes even closer.",
        "Ye muslim or hindu ke extremists na hote toh accha rehta life peaceful x100 jati",
        "False, \nDon't blame every Kanwar group",
        "\"Ye saala bahut aage jaayega\"\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nMera matlab Jail",
        "muharram happens once in a year (or twice, idk) and khalsa also happens rarely, and they are both done for religious purposes, and you will ever, rarely hear them threatning or klling anyone. h*nd* mobs have klled and thrashed people way too much, this is not arrogance level. these people are often out in mobs, if you live in north india specially UP you will know how nuisance they have created",
        "Dharam k terrorist",
        "Yeah I agree and people who don’t understand and accept this fact are living a delusional life. I just can’t bear it when BJP seeks refuge in the name of patriotism or religion and Congress is not too far behind, they do the same shit in the name of social justice and equality so basically we are screwed and India is creating more political zombies.",
        "Stop livinh under a rock.",
        "i think you replied the wrong person",
        "You need to have his resources as well. If not for his social standing in his own case would be stuck in the aching judiciary’s backdoors. But boi got clean chit in the eyes of non-biological.",
        "nice try, I love my life, I will not take any baits!",
        "Let's not forget why majority of them actually join  🚬🍁",
        "This happens almost every year in Thane Maharashtra During Janmastami as these guys are in a large group there is lots of intimidating and eve teasing.\n I remember I was with my sister and there was a kid maybe in 9-10 grade passing sexual comments. He only did it as it was a group would not have balls to do it otherwise.",
        "Exactly they are what brown army was to Nazis",
        "Beneath their hooliganism, I see a total lack of awareness and - quite ironically - malnutrition, which should tell you exactly where India fucks up its priorities.",
        "Whenever I see these mobs I get scared They are capable of horrifying violence. And I am a Hindu.",
        "Joblessness is the main culprit",
        "Sticks and Stones make them barbarians. \n\nGangsters wear suit and use guns. I have seen in movies.",
        "Nah that’s not the only time they use it, remember kanhaiya lal from bhilwara rajasthan ?",
        "Rebels require you to be against a system. These goons are supported by the system. They are nothing but a semi marshal extremist faction meant to flex religion and state muscle",
        "I still remember muharram processions the first time I saw it I was traumatised, was so scared can’t even-",
        "Pata nahi bhai bhajrang dal abb bramahan ko bhi marene lag gayi hai kya pata do din baad yea mandir mea jake Murti hata de",
        "Just shows you how much education can change a person. These poor chaps don't reason or challenge any superficial facts spouted by their leaders.  \n\nPlease educate yourselves about  morals,religion,codes,society,etc. If these people had a tiny bit of critical thinking, they would be crying themselves to sleep every night thinking about how they behaviour affect others like in OP's picture.\n\nEducate yourself and hopefully others too.",
        "Perfect observation",
        "peaceful peaceful religion karte rehte kuch to sikh lete us peaceful religion se bsdwl",
        "Yes so truw..these fukers gather every friday and do randome shit on roads parks and what not",
        "Great observation 👍",
        "Can someone give context? I am not from India. Who are these and what are they doing",
        "law and order is joke in this county",
        "Every morning I go out for walk with a stick. Damn never knew I was a gangster.",
        "Some time it lead to accident due to such action",
        "Reminds me of that scene in Derry Girls where Claire's family tries to drive through the Orange March by Protestants - except this is much scarier.",
        "Let me put it here before someone drags Muslims/Islam here as usual - Pagan obsession of Islam represents their deep rooted insecurity and lack of faith. The hatred is nothing but fear and survival mechanism which stems from intellectual bankruptcy, lack of understanding of Islam and especially lack of a strong faith in their own beliefs and Gods. They are more prone to gravitating towards Islam once they decide to gain actual knowledge beyond propaganda than the an average Hindu who is driven with faith than hatred against other religion.",
        "Carrying out a religious yatra is within the constitutional rights it does not make anyone gangster",
        "Idk why people are downvoting it was personal experience rather I should say trauma😔😔",
        "😂😂",
        "Crowd has no face!!! In a crowd everyone becomes gangster this implies to any and every crowd",
        "Inke saath rajat dalal ko bhidado",
        "In india, people respect who has the bigger stick. Brandish an automatic rifle infront of them and watch them scatter. Its not a question about who is right or wrong, or rights and duties.",
        "I don't think they are from middle class.\n\n\nMiddle class boys and girls have incentives to try and improve their financial condition. They won't waste much time in this shit.\n\n\nI guess they are from middle lower class to lower/poor ass families.\n\n\nThey need a sense of pride. So this becomes a sense of pride for them.\n\n\nI wonder if thier parents are equally violent or not.",
        "The former. They aren't rebelling against anything. They think they are but they're not. If they were you'd see fewer issues in the country by now.",
        "Everything. This has reached a point where something as silly as beef consumption is considered to be a reason for cow vigilantes to murder people. Anyone with decent scientific temperament wouldn't even think this way. Some of the greatest scientific minds throughout history have all questioned religious practices that are absurd. No one with scientific temperament would ever keep religion as their top priority outside the 4 walls of their house.",
        "...and paw paw has the biggest gun !",
        "I... Wait... Are you the Nazis in this situation?",
        "That's the funniest part. It's sad people won't know in the end there is no God. What they could've done during their lifetime is practice what they believe within the confines of their own lives, places of worship and house. But no. They won't do that.",
        "lets be honest, I see naive and ill advised young citizens. We talk about Brain Drain into foreign countries while half of them end up like what we can see here.",
        "Reading the comments on this thread I feel a liitle comforted to see so many sensible like minded Indians voice their opinion. Religion as we all know is opium for the masses & sadly in India the 'addiction' is worsening. So even though India might be improving its GDP numbers & becoming an economic powerhouse...is it really progressing at the grassroots level??",
        "nope, you can’t generalize all chuslims as terrorists but you can generalise all kanwars as gangsters",
        "NEVER underestimate the strength of mobs that can go wild. \n\nOff-topic, but this is similar to [pack of stray dogs that attack and maul people - like the recent story in Bengaluru](https://www.youtube.com/shorts/sYgeubhPkyQ)",
        "Didn’t some BJP guy beat the [shit](https://indianexpress.com/article/cities/lucknow/bjp-up-kanwariyas-muslims-police-9547584/) out of some hooligan kanvariyas just this week? I mean how does one even confuse a group of orange people with Muslims? (Not implying actual Muslims should be beaten up)…",
        "People are just commenting, when they see safron clothes, taking their preconceived perception. Some of people that I know attend this kavad, this are  some of the best people I know, careing,humble and helpfull.  The people that are front and back carrying sticks guide traffic sometimes they may obstruct traffic, which  is wrong, apart from that I find no problem in above photo.",
        "This is called self protection, there are many incidents where stone pelting happens, I am not justifying this but this is the reason. And now it's cyclic you can't blame one to throw stones and one to use a stick.\n\nBJP call themselves hindu party but they are not, they did not provide any type of protection during hindu festivals.\n\nNo changes in old rules\n\nTemples and land donated are in gov clutches, often misused by gov\n\nNow BJP is crying over WAQF board but many does not know BJP is the one who made WAQF more powerful.\nIf you give benefits to one community donyou really think anyone will give up ? Just like quota system ?\n\nBJP absolutely did nothing regarding the Bangladesh border, now saying they need NRC after letting illegal people come to India, you really think indeginous people will tolerate ? This will cause hate in both community.\n\nBJP can fix almost most of the things but they choose not to do unless election time, it's like people of India forget so better not show their cards, show it one by one during dire need.\n\nWe are in dire need of healthy opposition who need to raise the right questions.",
        "Idk about UP, Come to Maharashtra especially in Marathwada region you will find more big kawad than this, like the other guy mentioned this guys  belong to very lower middle class OBC families they usually work under political leaders this is their high time to show up",
        "Subhuman trash, no life no money no joy so they engaged in this short of shit to escape from life kind of like modern day \"Opium of the masses\" My pet dog got a life better than them, good food, good lodging heck even a medical attention when they fall sick which those things will never get in their miserable life.",
        "Walking barefoot in religious procession",
        "They had to become like this for several reasons.",
        "As long as you are not wearing orange clothes even with gun you are not a gangster.",
        "In Bihar, we have this Kanwar yatra of 110km approx. Don't think others face similar issue as government have made seperate route for 90% of journey and for 10% we have seperation between road, which I have seen people following without being GUNDAS.",
        "As a Muslim, this really scares me. Even if they do not have such intentions, they are becoming stereotyped, similar to what Muslims have been facing because of terror attacks around the world.",
        "Kabhi itni taarif ram navmi wale din pathar fekne walon ki kaar dia kaar , Saar tan se juda pe aap kha hote hai janab , mahuram , bakra eid slaughter they didn't even throw anything on your vehicle and they let u pass by giving u aside still they are Gunda what about you spitting shit on social media about anything u need ....",
        "all are potential rapists",
        "It's not that deep bro... We hate u because the moment u gain substantial numbers u try to kill every minority left right centre ... And if someone reverts back u claim to be victim",
        "They always behave rudely on the road",
        "Skull cap with a bomb is also for his self protection bro",
        "This is hindu terrorism, these pictures created bad effect on our hindu community!",
        "Just be proud for your religion, u don't need food, you don't need money for basic facilities. Let your hate for others feed and satisfy you.",
        "Same bro I feel shit scared during Muharram processions as well",
        "See the downvotes and understand that no one can be wrong except the hindus",
        "Pick any one of them for a one on one fight, let’s see who actually is malnourished, that’d be fun 😆",
        "No one did anything they just saw a bunch of people wearing orange and felt scared",
        "Haan bhai Muharram ki tarh hi toh hai ye?",
        "Model state is modeling under vin ghaslet raj. ",
        "Bhai hindu hai toh wrong hi hoga... Muslims road block krke namaz bhi kre toh shi rehta, Sikhs sword carry kare wo bhi theekh rehta hai",
        ">[Comment](https://www.reddit.com/r/india/comments/1f9hhpn/comment/lllwne5/)  \nby[u/Better-Jury-2782](https://www.reddit.com/user/Better-Jury-2782/) from discussion  \nin[india](https://www.reddit.com/r/india/)\n\nSee this, People posting on reddit are likely to be at least middle class . But you can see the mentality",
        "Bhai muslims good hindus bad ye kab sikhenge aap",
        "What even, is this mindset",
        "BJP has no idea of law and order. LOL. North India is going down the drain.",
        "I am sure, man. But we need to work towards getting rid of these. Its not helping anyone or any religion.",
        "Exactly!",
        "If they could, then also they would abhor what they are doing. Mahadev is an extremely patient god mostly. He is pleased with less and doesn’t condone whatever these guys are doing in the name of Kanwar yatra",
        "Money Channel: TG-@CLUB1697",
        "😂",
        "You mean the people whose homes and churches are being burnt down by the Hindus? whose women are being paraded naked by Hindu men? Right they are the terrorists in this scenario.",
        "Based guys, doing God's work in keeping investments away from UP",
        "The end up being tools and manipulated and they realise this in their old age but by then it's all too late. ",
        "They are just like bees. Just prick one others spread to attack without knowing reason. Just maintain distance.",
        "this happen when your parents didn't tell you any thing about this Kavad yatra . If you are from other religious the n i am sorry it is not your problem",
        "There is some psychology behind it. More than often these are absolute cowards on their own. So if you are ever in a confrontation with them, pick one guy and try to beat the ever living shit out of him, others will most likely freeze\n\nhttps://www.waldenu.edu/online-masters-programs/ms-in-psychology/resource/why-do-people-act-differently-in-groups-than-they-do-alone",
        "The reason for the majority of them to actually want intoxicants is because their life sucks and use these as an escape. \n\nThe bigger problem is the population being so poor, youth not having any jobs etc etc.",
        "You are missing the point completely. They might defeat any of us in a street fight. The point is that there is a high possibilty that their strength and brain power will not be used for anything that will contribute toward the development of our country and the world.",
        "Totally ..the goons ..",
        "The facy that you consider a persons ability to fight to be a parameter of health explains exactly what is wrong with this nation.",
        "orange ***IS*** the new black",
        "Kya bhai pehle pata karle kya hota fir gyan pelena",
        "honestly though, nothing scares me like the colour orange these days.  hindutva has made it a colour of fear and terror!",
        "Running over hindutva fascists is not only morally justified, it is also incredibly satisfying.",
        "I hope the same comment goes for peaceful community too 😅…. Who are displaying their peaceful gestures all over Europe and other parts of world. \nPeace to WOKE people 😂",
        "Why so Anti Nasnal saar /s",
        "Where is selmon when we need him the most /s",
        "It give them some.sense of belonging and a goal",
        "They are the new terror sensation with JSR being their go to slogan.",
        "Atleast they are better than the gundas who throws stones🤡💀. Aa jao congress walo gyan dene 😂",
        "Lack of awareness is not something I would say they have as they know impunity and enjoy it.",
        "India has turned its dividend of a large, young, able bodied demographic into a catastrophe of uneducated/poorly educated, underemployed, malnourished young people with no moorings in the present or hope for the future.",
        "They don’t know shit about their religion, they are just following the herd.",
        "r/angryupvote",
        "They're going to assault him!!!",
        "Indeed, they are the ones raising \"Sir tan se juda\" slogans everywhere",
        "Beautifully written 🥹",
        "These skinny guys will be the first to leave the battlefield if war ever break out with.. say China. \n\nAnd those of us called Anti national would be at the forefront to defend it.\n\nWe fought the British and we will fight others as well in future. And chaddis will support the enemy, as always.",
        "https://preview.redd.it/h1g3t7llezmd1.png?width=402&format=png&auto=webp&s=94abef734a3dcea695f4942bd395554a4fb85b6f\n\nHistory repeats ....",
        "Yup, you won’t expect these clowns in Japan.",
        "Ik buddy . Ik they are cowards. If they had balls they’d not lick boots of the same mughls/british/ post independent congress govts/indira gandhis emergency congress etc . Thats what they do, the lick to survive. Do one side’s violence to put others down. If there ever was a two way fight, these jokers would run to save their hide. COWARDICE is a generational trait",
        " Whatsapp university gyan. How many have you seen people of such description? I bet none in all your small teenage life",
        "https://preview.redd.it/2nygf9hgfzmd1.jpeg?width=640&format=pjpg&auto=webp&s=4b98c4c83404405a9ad4b1a7144df3b9db2f5169\n\nYeah. Many such gangster families.",
        "Any long religious procession should be banned.",
        "I believe even if there were enough jobs through some miracle, these people wouldn't be able to secure one lol",
        "I mean, if you’re starving, it’s easier to find comfort in religion and then you can say it’s upavasam",
        "True. But also, the lack of awareness towards this. They don't have life goals or are not aware of it. The ecosystem around them makes them concentrate on this religion, Hindu Muslim, us vs them. \nIf these people someday woke up and realised, that politicians used religion for their use and they didn't get anything.",
        "In a country where farmers protesting corporations are seen as terrorists but these are peaceful religious attendees.",
        "These people need to get a job",
        "Terrorists",
        "Just like any other terrorist camp",
        "Exactly, If they had hope for their future they wouldn’t be doing this.",
        "How are you so sure about that, that’s some nazi level stereotyping. \n\nMany of those will go on to great colleges and universities, and go on to get good posts in good organization. This, I am not stereotyping but sure about it, as I have also completed Kanwad yatra after my 12th class with many of my friends and We all are doing way better than many.",
        "🐏 them",
        "wtf is the “brown army” are you talking about brown shirts ?? the stormtroopers ??? be clear because you’ve called them the “brown army” like they were brown ppl and that’s why the person below has asked the q like they are so confused",
        "Atleast this is far better than the 'JACKET'  boy",
        "Don't forgot religion is one hell of a drug too",
        "Great comment",
        "Care to explain?? How come it is wrong with the nation?? \n\nThe guy looked at their frail figure and passed a judgement that they are malnourished, so, a frail body isn’t a malnourished body, I can show you obese people with a battery of malnourishment.\n\nSee bro, I don’t know what is wrong with the nation but there is definitely wrong with stereotyping nazi pigs.",
        "people whose passing by are with their cars, are brave",
        "But they will harm people minding their own businesses.",
        "Nope, time and again we have seen that the fire of hatred spares none. Recent example of that Mishra boy killed by \"gau sevaks\" or whatever they call themselves.\n\nThey are terrorists and jobless. Plain and simple",
        "Ohh definitely this is Hindu terrorism. Fuck them!\nWe can only feel safe during Muharrram procession.",
        "It's a mob at most",
        "That's why, I always keep a Indian billhook with me in my car, ALWAYS.",
        "Shows clearly that politicians are winning.., brain washing works..,",
        "I meant Brownshirts I should’ve been clearer. Thanks for clarifying.",
        "Lot of middle class people do pilgrimage and kanwad yatra, I being one of them whi went along with 11 of my friends. It is a spiritual experience walking across the country and meeting people from all walks of life, I met a guy from sonipat who was well to do and rich. \n\nPeople stereotype kanwariyas as poor and uneducated because the way they look, they wear simple saffron clothes and seem frail, poor and tired because of the long treacherous walk. \nThe fact is Lot of poor people go on this pilgrimage but many of them are middle class and rich as well.",
        "Send them to border to defend the nation and see how they come running back to their Mommy",
        "Also all desperately seeking love, sex and touch.",
        "If you wanna run the Muharaam argument then that shit runs for a day. These chewtiyas occupy city roads and highways for entire month and are a public nuisance.",
        "He wouldn’t be feeling very gangsta in America with a stick.",
        "Yet if their moms or aunties caught them, they'd cower from the wrath those women would give them",
        "Need some context please…who are they? And why have I seen so many videos of them destroying cars on twitter?",
        "Do you hv guts to the post the pics of real one’s who behead people for no reason just becoz it is like cutting vegetable for thm",
        "I know, but not in a way these intoxicants work on your brain. These incite chemical processes in your brain to subside pain. \n\nOr maybe it's me and I don't know how religion works.",
        "Yes! Same kind of scene I have seen while muharram tajiya are happening..!! Goons are everywhere.! Isn’t it?",
        "Yes! Same kind of scene I have seen while muharram tajiya are happening..!! Goons are everywhere.! Isn’t it?",
        "Hideous hooligans",
        "That's why we need Allah. Come to Isla m",
        ">Many of those will go on to great colleges and universities\n\nPress (X) to doubt",
        "Gonna see more of this in near future ig, especially when the Central Govt is on that side",
        "Faith has nothing to do with it. People with faith persecute and kill for stupid reasons",
        "Lower and middle class OBCs are the foot soldiers of the Hindutva project.",
        "Yeah the same thing is happening from the other side as well, you thing the Christian are the victims? Open your biased blindfold",
        "Brain drain to the West and brain death here",
        "Waiting for a post on Islamic Terrorism. Oh wait that's happening from many many decades but people don't have the balls to call it Islamic Terrorism because Terrorism doesn't have any religion correct?\nStop this hypocrite behaviour.",
        "XXXXXXXXXXXXXX",
        "Sometimes it hurts to listen and see these pictures and comments, when me and my cousin go for कांवर , we all walk on the roadside , not doing these types of extra irrespective things .\nNowadays all these become fashion or a type of joy not a sacrosanct prayer.",
        "Indeed! Very astute one might even claim ******phobia immediately after skimming through the words!",
        "Shhh. You are being far right now",
        "In 1975, a compulsory sterilization program was introduced by then Prime Minister Mrs Indira Gandhi, so that Indian Citizens of India do not have to come across such items on streets of the nation.",
        "Owaisi Bhai..... Real ID me aayiye",
        "I could be wrong but holding a danda is part of the procession I think",
        "What about muslims who block the road and pray…bet u dont feel they are like gangsters😂😂😂",
        "Islamic terrorism is obvious thing, terrorism is related to islam, but as a hindu I don't want my religion become one face of terrorism.",
        "Classic r/india post.",
        "Peaceful religious walk. Our country is ruined by religion.",
        "And it won't become, and it will not become, because people don't support this kind of processions. Like they are blocking roads, playing heavy base music that too at night, and more importantly causing problems for ordinary Hindus like us.\nWe don't support this kind of shit and nowhere in the Vedas it's written to blast music with full bass and go bonkers on road to please Mahadev.",
        "अशी महिना भर चालणारी कावड यात्रा कुठे पहिली, मी ही मराठवाड्यात राहतो कधी पहिली नाही. सगळे कार्यकर्ते हे ओबीसी समाजातून येतात हा जावईशोध कुठून लावला आपण?",
        "I wish someone just goes bonkers and runs a SUV over them.",
        "Nahi",
        "Funny how it's only people following Hinduism that keep investment away. 🙂",
        "What the hell did he do to you to even consider him a gangster?? And let me tell you why that danda is for. I live in Mumbai. We were walking towards Shirdi and I saw with my eyes how padyatras are treated by so-called elite car owners. I had a group member killed by a truck in daylight while going to Shirdi and the worst part is the truck did even stop and the truck driver was never caught even after FIRs and what not. Hence, now padyatries have started to use danda. Jain's yatra, Buddhist yatra and many more hire men for safety or keep dandas while waking. It always feels good to sit in an ac car and lecture the world when you don't even know the truth.",
        "I’m sorry, but we shouldn’t assume that only middle-class or lower-middle-class people are involved in something like this. The perspective feels privileged. Many educated and well-off individuals have been responsible for some of the most heinous tragedies. I’m not trying to call you out or anything, but it feels necessary for all of us to change this mindset.",
        "More like bullies.",
        "Yeah I agree the \"Hindutva project\", is more likely a vote bank",
        "Reddit kangaroo court assemble.",
        "Gang gang",
        "survival is the cause cause others are doing the same even tho they are in minority",
        "For every group of terrorists there will be group of gundas.\nTerrorists is a threat to the whole nation but yet people have problem with them only",
        "the privilege class is the one dominating these people. you wont see modi and yogi or anyone lavishly living in their house going on their street, but support them. the whole goon culture is endorsed by the privileged themselves, but they often dont come to the street and do this. why are you seeing my comment as a stereotype? every class participate in different ways, its just that these kind of mob culture, most participants are from middle to lower class.",
        "Still better than , beheading an old man in broad daylight",
        "Kon manhe \"mahina bhar chal na ri  kawad ??????\"\n\n\nAni \"karyakarte\" hya shab da cha prayog mi kuthe kel aadhi mala kalva mag mi tumhala जावईशोध कुठून लावला he sangto",
        "Varkari are good people. I never felt threatened by them. And I never heard complaints.",
        "thats not faith",
        "Can someone be so kind and help a clueless European understand what is happening there?",
        "I apologise you sir, I didn't mentioned Varkari, yeah indeed they are good people infact they are the one who follow pure religious rituals and practices in a way that everyone should follow the OP describes some teen guys who acts like gangster or try to show rowdy nature under kawad yatra I am talking about this chapri goons",
        "Those people that go to other countries also become extremely conservative for some reason. They cling to their religion and caste like they are life jackets.",
        "Yes, but why? I feel like the middle class and lower middle class have become everyone’s punching bag. For someone who has actually grown up in a slum, there’s a reason for this. There’s no hope. You see people around you struggle every day, and you’re filled with rage. The system is designed to keep you there. There are no good schools, hospitals, or even toilets. There’s no dignity in being born, living, or even dying. You witness all of this and are just angry I suppose. Then, they misguide that rage. Again, please don’t take this as an attack. My point is that there are more nuanced layers to this. A blanket statement like that does nothing but spread more hate.",
        "great now people just walking have become gundas and what have they done wrong by having a danda in their hand the walk for 100s of km and they sometime need it as a walking stick sometime to scare off stray animals ... ohh but no... they are hindu thats why they are gunda...... great observations everyone if in Nuh a horde of mob showers rocks over normal guys on road then they are no gunda but some people just walking are gundas XD",
        "i did point out in my comment..that theres less of faith, hope, an identity to relate to, deprivation and so much. that being said- what makes indian lower and middle class unique is also a huge variation in their cultural and political prefrences. idk why are you conducting that im spreading hate even though you agree with me as well, im just pointing out that political extremism in this country in weaponised form comes from those whom the system mostly fails. it is sad, it is not my rage",
        "Owaisi bhai visionary hai. India’s per capita will be of a developed nation with 25 crore population",
        "If that’s what you’re trying to say, then I’m sorry, my bad.",
        "Wait until you see real gangster holding knives and shouting STSJ, but that post will never see the light of the day on the sub. So for now I will assume that this is the most extremism India has faced in the past 5 years.",
        "Naming someone without knowing or understanding is a fashion I suppose. Most of our urban youth are out of touch of their own culture. They only know CNN, Netflix etc culture…pity",
        "Some of my Hindu 12th class friends are karyakarta for bjp all middle class one of them even booked for attempted murder this year",
        "Not terrorist .. they shout something else before blasting ✌️",
        "It's all a vicious circle, more nutrition leads to higher IQ.\n\nThis helps a lot of people to go to college and independent thought.\n\nLower IQ people are easier to manipulate and more susceptible to propaganda.\n\nIt's a vicious cycle.",
        "Can’t name them as “religious gundas”. People who actually follow religion, do not indulge in stupidity. Let it be hinduism, islam, sikhism or Christianity, people who claim themselves to be the so called flag bearer of religion, in reality, are the ones who are farthest away from the very basic ideals of the religion.",
        "Disposables.",
        "I’m a Muslim and I call for it to be banned.",
        "I just feel that these people don't know shit about religion all they care about is how to gain fame and power and crush and suppress others \nAs a Hindu I am really ashamed of these people \nSome will abuse me , but really do these guys even pray or have ethics because I don't remember carrying weapons like this is needed in a highway even if u say self defence",
        "Mai kuch nhi bolu ga\n\nhttps://preview.redd.it/4kahsept40nd1.jpeg?width=619&format=pjpg&auto=webp&s=f3c4ac73b044bf48a459262d50640b5d8211548d",
        "U should be thankful these are sticks not ak 46 and swords. Yaha sab Gyan chodne sa jaate hai.",
        "Ye ek dharm ke khilaf nafrt phelana nhi hai 😂",
        "Strange, that you didn't click their pictures while you \"saw\" them *using* their dandas. And they are not showing up suddenly this is called a rally it does not have a teleport ability of this magnitude. Hope you farmed sufficient karma though. :)",
        "I’d be happy if Muharram procession is banned. I’m a Muslim.",
        "Just what we need to keep the other herd in check you can cry all about feeling unsafe but when the roles are switched you people will not even acknowledge it let alone condemn it",
        "Terrorists",
        "Idiots are those who post like this shit. What if you go somewhere on the highway. Won't you try to be safe ? Or anyone can run their vehicle on you or if you are with your family members on highways do you not try to keep them safe \n🤡🤡",
        "Yes but please also mention what Muslim majority countries have done to their minorities. Neither is right, both are in the wrong. I feel multiple countries would behave differently towards Islam if Muslims didn’t have a “we are right and others wrong attitude”. The attitude isn’t the problem, it’s the violence that has ensued for millennia as a result of that attitude. Again, this goes for everyone, not trying to single out Islam but just trying to hopefully convey to you that nobody can cry victim, when everyone has blood on their hands (some more than others but not the point).",
        "wo gunda nhi wo bas car and bike walo ko side kar rhe hai wo koi patthar nhi fek rhe hai toh religious gunda ya kuch mat bola karo jo patthar fekte hai uske bare me bolne ki himmat nhi hai teri",
        "All religions are fucked up but some are more fucked up than the others .",
        "Cameraman - modern Indian pussy",
        "Labourers who work daily for long hours might be physically stronger but many of them would be malnourished. Strength doesn't necessarily translate into good nourishment.",
        "XXXXX",
        "They don't belong to a reserved caste, at least.",
        "I saw kavariyas eating gutka , spitting everywhere, no civics sense, using vulgar words to each other loudly in front of school kids . Fuck these assholes, mahadev should open his third eye and burn these bhakti asses.",
        "This is kind of biased i think, all year you could run into a much more violent group of wedding goers but kawad is pretty much limited to one month a year, however you will see them at any time... Just give them their space on the road,  it's theirs as well as yours... \n\nIf you're close enough for one of them to hit your car then you're probably driving too close to them and trying to use your vehicle to move them out of the way... They are people not a group of buffalo. Getting too close for you means a dent in your car but getting too close for them means a broken foot or leg.\n\nI'm saying this as someone who has done kanwar yatra from haridwar to Delhi as well as dak kanwar from haridwar to Kashipur.... These are not groups of thugs but people that are walking 30+40 km a day in the heat and are tired of people trying to crush them while they drive by in the ac....",
        "“Patriotism is the last refuge of the scoundrel.”\n\nThis phrase fits them perfectly. This religious nationalism has given all these low life unemployed losers and thugs a false sense of pride. They’re no different from Islamic thugs.",
        "Absolutely, they’re just ignoring real problems , similar to Islamic thugs.",
        "Someone,feed these gangsters,they look anemic.",
        "fwiw, they have always been alittle intimidating the way they behave on the road. For years, I have dealt with their hooliganism. The graph has risen quite steep in the last few years and they have been feeling more emboldened and justified in what they are doing. I'm not religious but I respect every religion and their right to practice it in our country but their has to be a decorum, standard for all, to follow. You can't uproot other's lives and day-to-day just because you decided to take up 1/2 of the road and \"allow\" the cars to pass. I have stood in traffic for anywhere between 1-4 hrs during kawar yatra or rath yatra every year and I can't begin to tell how it has affected my life, both professionally and personally",
        "They are gundas because they have danda.\n\n\n What about these peaceful peoples who walk with swords and stones?",
        "India becoming next Afghanistan soon",
        "run them over",
        "kyu bhai teri mummy ki mar kr chale gye the jo tuje inse dar lag raha h",
        "Perhaps you have never seen a moharram procession!",
        "Never seen a picture of people from a certain peaceful community praying on the roads and blocking traffic being called out here but ok!",
        "Idk, middle class has a lot to lose for them to even get involved with murder/politics.\nNot to offend you but you might wanna check if you study in a government school.",
        "Slightly better than allahu akbar gang",
        "That’s a lot of really small sticks to be acting so tough.\n\n“Speak softly and carry a big stick”",
        "Tabhi to mujhe koi specific group se dikhta hai main ddur hi rehta hun kya pata kab phatt jaye",
        "Can someone give context? I am not from India. Who are these and what are they doing",
        "Technically so does terrorists",
        "Bahahahaha walking on the road with sticks and thinking they're hard 🤣",
        "People waste their time with  this crap and india will become bishwaguru ?",
        "Aw man are you afraid🥹🥹🥹!",
        "I am sure you know this but the statement that Religion is the opium of the masses was not used in the context you have used.\n\n>Religion is the sigh of the oppressed creature, the heart of a heartless world, and the soul of soulless conditions. It is the opium of the people.",
        "https://preview.redd.it/o1rg7kw4i0nd1.jpeg?width=1069&format=pjpg&auto=webp&s=7b9dbb21c62f4875044e0f7fa81c2008a7d03c2f\n\nIndeed, a similar case happened with me once I was traveling via Patna during some processions similar to this, had to take village roads due to nuisance. Idiocracy is at next level in this country irrespective of RELIGION. 🤦‍♂️",
        "When young people don’t have any prospects, they usually fall back on group affiliation to give them a an identity and a sense of purpose.\n\nWhile they are reprehensible, it’s is society that has failed them and allowed them to turn into this.",
        "It's st.domnic sovious sr sec high school and to not see something that is real doesn't make less real sorry for truth if it hurts",
        "When you have never seen real gang then this type of stupidity is expected!",
        "Ok let me try. I am also not a South Asian but have stayed in India, Nepal, Bhutan, Sri Lanka enough to understand local customs, religions, problems, politics etc. Still, forgive me if I miss small details here and there.\n\nThese are religious processions called Kawad Yatra. This is a continuous tradition of states along the river Ganges since \nmore than 2000 years, where sages would walk for 100s of kilometers as a dedication to lord Shiva, offering water from holy river to statue of Shiva in different temples across North India.\n\nIn recent years after freedom from Islamic and British rules this tradition has regained popularity and not only sages but also common devotees have started following this tradition, in beliefs of getting blessings from Lord Shiva. Mostly, male members of those families who had a bad year or two of problematic economic, health situation or death in family, take a vow to dedicate lord Shiva for the whole month, arrange a leave from their jobs and walk barefoot, eat simple vegetarian plain food etc, while visiting all major temples in the path.\n\nThe one holding sticks are volunteers organizing the crowd march. Stick is their defense against animals like dogs, idiotic drivers, attackers from the Islamists, and politically motivated goons which is quite common in this part of India. Those attacking this procession here on this reddit are mostly from the Islamic community and leftists who are against the current ruling party and some non Muslim kids who follow one sided secularism blindly.",
        "Use of danda\n\n1. kill snake\n\n2. elders use it to walk\n\n3. kawariyas use it to take 2 water matka on it.\n\n  \nBut as you trash, your ideas are also trash",
        "Welcome to orange bhaarat",
        "ya the sexual exploitation of females in corporate world is done by so called educated",
        "isro head didnt went to ram temple, or abdul kalam did not talk about bhagvat geeta?",
        "Interesting, thank you for sharing your perspective.",
        "These are gundas and someone chant a.........h hu a,,,,,,r and blast himself is a school teachers son \n\n\n\nBloody hyppocrates",
        "It was a general statement bud.\n\n\nMight be rich to not really care about consequences?",
        "bro these people are just carrying a danda which they use for carraying 2 matkas. How did you judge them by this image? Some days back also kawariyas broke someones car because that guy hit the matkas which they were carrying from more than 100 or 200kms that also barefoot, you assume people will not show anger as well. If education really make a person good human being then why are there happening sexual exploitation in corporates? Why some very educated ones in usa are phe\\*ophiles.",
        "yes sleep on street he will be on the way",
        "what they doing in this image?",
        "ofcourse religion is\\[RELIGION\\]",
        "Abe jaa be lodu",
        "Maybe ultra rich",
        "You are almost or clearly an atheist, and i appreciate that.",
        "If you are referring to Pakistan and Bangladesh, then it makes sense but using that as a representative of all Muslim-majority countries is inaccurate, as many nations in the GCC, such as the UAE, Bahrain, and Oman, have historically hosted large non-Muslim expatriate populations, sometimes exceeding their local populations, and managed religious diversity peacefully. Similarly, North African countries like Morocco, Tunisia, and Algeria, along with Far Eastern Muslim-majority nations such as Brunei, Indonesia and Malaysia, have long histories of pluralism and coexistence with various religious communities. This broader perspective challenges the oversimplified notion that Muslim-majority countries inherently struggle with religious coexistence or violence.",
        "You guessed right.",
        "I think it’s a procession where devotees go to water bodies barefoot to fetch water to be offered to lord shiva on every monday of hindu lunar month of shravan",
        "no I mean they are not doing any weird thing which I can see in image. That danda is used to take the matka of water right, i think they are returning now. I am asking why this image was just takes and started fear mongering.",
        "Why does it matter if the ISRO head went to Ram temple? Or if Abdul Kalam spoke about Bhagvat Gita? Those are their personal beliefs and they aren't forcing anyone to believe in what they believe. I'm genuinely curious as to what your point even is over here. \n\nIt's hilarious how very simple statements go through the heads of so many people. It's not that deep.",
        "Well I think\n\nMost of the time, Academically-declined (both education and behaviour wise) people’s desire towards power of authority attracts them to the religion.\nTheir initial thoughts are to initiate authority towards religious people or people who want to avoid conflict. But their lack of sensibilities and education instigate the hooliganism, recklessness, terribly distasteful mindset.\nThere’s not much going on in their life without this.\n\nWhile educated ones who genuinely believe and care about religion are with calm demeanour and respectful and responsible. Also, they mind their own business. They are seldom seen in these types of events. \n\nAnd, Yes This is quite true **regardless of the religion.**",
        "so people who gets settled in abroad should stop following their religion and should speak foreign language only .... nice",
        "I wonder if the same words would have been used for followers of Middle Eastern cults.",
        "Thank you for that, I was not trying to say that it was representative of all Muslim countries. I think I was more focused on the perspectives",
        "Honestly that’s true. We don’t have any evidence if they used the stick or not. OP could be exaggerating",
        "Its the SA, which was an organized brutes in the name of the NSDAP.\nThey had become famous for beeing the strong arm of the nazis, harassing jews and fighting kommunists and other political enemys.\nThey had been cut down in the end, forced to join other Nazi-organisations, because hitler felt endangered by the SA-leader Ernst Röhm.\n\n\nSo those guys are beating up political enemys?",
        "Fair enough. Noble aims is a better phrase I guess.",
        "I can give several examples how cows were used as a tool by muslim invaders so that indian kings go backfoot.",
        "I mean if that was what caused *THIS* in their country….\n\nIt seems like a good idea…….yeah….",
        "The whole planet consumes beef. Why is this even relevant in the current context? You've been stating things that back nothing up to your claims. The whole thing was about science yet you somehow made it about cows.",
        "[https://www.vice.com/en/article/us-america-customs-cow-dung-cakes-india-covid/](https://www.vice.com/en/article/us-america-customs-cow-dung-cakes-india-covid/)",
        "bro OP is trying to spread hate nothing else. Similar case happened with me in a new city I visited, my friend I was going on a bike ride at 10PM, he said look there there are whores standing there you can get 1 in x amount. Bro I was like ye pahle se hi manke baitha hai, ese to koi jake normal ladki to problem create kar dega.",
        ">They cling to their religion and caste like they are life jackets.\n\nPeople who got there through refferals from their caste or family will hold its value high",
        "I made 2 comments, the main comment got deleted I guess, it was long one, now cant type that again. Anyways bro look at your previous comment who brought cows first",
        "Yes muslims are way better, right? They protect us ? And it doesn't matter if all the terrorists are muslims we still believe them.",
        "and do whole planets eats pork also? or dog and cats?",
        "lol keep seething, muslims do nothing wrong in this country in comparison to these goons",
        "for knowing what happened in indian subcontient you need to know history. I am just tired of seeing how some people are completely ignorant",
        "sad thing is such people justify their actions in the name of religions",
        "Hindus( in kavad Yatra) saved me from an accident.",
        "Again why the stereotype of labors only being kanwariyas, my argument was not actually regarding nourishment or strength to be precise, i just highlighted that all of them are not malnourished. Hope you got it",
        "Im from Poland, seen a lot of these guys marching on my trip to India, can someone explain who are they?",
        "Now when you write it, I get it. You didn't say this in prev comment, that you mean to highlight that all aren't malnourished. \n\nAlso I'm not stereotyping, mostly labours are malnourished so used their example.",
        "Like a bag of oranges",
        "Well I was reacting to this guys blind and blanket judgement of all of them being malnourished.",
        "Ofcourse 🙂",
        "NRIs view religion as a connection to their home. Uneducated people view it as political tool.",
        "Hey, guys. How to increase my comment karna?",
        "shame on you",
        "“Sunday ho ya Monday, roz khao dande”",
        "Yeah the whole planet eats pork as well. I eat pork and beef as well. No, not everyone eats dogs and cats.\n\nThis isn't the gotcha moment you think it is. You thought only Muslims eat beef right? 😂\n\nLiterally every community in India has sufficient beef consumers. If you don't like it don't eat it. Don't go around justifying killing people in the name of beef.",
        "BJP has never done anything to provide special protection for Hindus?",
        "Pretty sure hitting cars and bikes with sticks is damage to personal property",
        "The premise of my comment was to show religious indoctrination has caused a lot of issues with critical thinking. There are plenty of things apart from beef I can pick up as well.",
        "Tell me why it's relevant in the current context. I'll tell you why you're bringing it up. You're basically insinuating all Muslims are bad because Muslim invaders came to India in the past. Man it's so easy to see through your argument. Don't hide behind fancy words. You're trying to justify why you don't like Muslims. Just say it as it is instead of beating around the bush 😂",
        "Exactly happened with me, I live in ayodhya and was going to Lko for some work and some of these hooligans were showing there dandas to the passing-by cars.",
        "Except white shirt, he might be the gunda boss, looks too well fed",
        "The chairman Mao philosophy! Keep 'em starving so that they remain stupid.",
        "Modi’s India. Where all mighty gods supposedly need to be protected by low IQ unemployed scum.",
        "I don't even understand why should one be proud of their religion or language etc. We were born into it as a default setting. It like saying I'm proud I have two eyes.",
        "yes too bad,safron gundas.\nha hasan ho hasan Muharram gang is love.",
        "Why do they join?",
        "This is a religious gathering/ March known as \"Kanwar Yatra\".\nThe Kanwar Yatra is an annual Hindu pilgrimage in India, where millions of devotees, known as \"Kanwariyas\", walk to fetch sacred water from the river Ganga.\n\nThe water is then offered at Shiva temples, especially during the holy month of \"Shravan\" (July-August).\n\nThis practice is to worship/honor Lord Shiva, and the pilgrims carry the water in Kanwars/decorated poles with pots.\n\nThe journey involves walking hundreds of kilometers, with some pilgrims even covering distances barefoot.\n\nLocal governments often provide facilities, including security and medical aid.",
        "These kids are really brainwashed by cult religious goons. Everything in the name of God  blah",
        "The world would be a better place with these people removed.....",
        "Necessity is the mother of invention. If these individuals hadn’t been suppressed for decades due to THE appeasement, they would have naturally remained the cheerful and vibrant group they were meant to be.",
        "Lolz weak crowd of sheeps",
        "Hello",
        "Good",
        "My uttar pradesh is a sad sad sad story; hopeless the eastward one goes, me living at the precipe of where the sh\\*\\*t start to hit the fan; can only imagine what happens in such areas; there is extreme poverty with functional anarchy you have to be utterly vigilant just  to survive.",
        "Is everyone from the yatra hitting people with sticks, there are some bad apples everywhere",
        "There is no prospect brother for them; both the major religions and major castes just wait for their turn at government to become the so called Bahubali that;s the best they can hope for in their life in youth and family and familial politics in middle and old age",
        "I feel you bro. Same feels as Muharram.",
        "Bro issue is (or rather the tradegy is) due to poor economic status their lives would amount to nothing anyway",
        "Tere kaun se makkan chura lia, jo tere ko itni jal rahi hai.",
        "Issue is (or rather the tradegy is) due to poor economic status their lives would amount to nothing anyway; this is just the anger venting route. Life sucks hard in UP and those with resources have to be utterly vigilant.",
        "Typical communist logic my friend 😁",
        "Are you a funded person from congress or \nGeorge shuru    !!!??? Because you don’t find madarsa chap are teaching radical Islam (which is actually real) and spreading violence, rap, blasphemy chamche",
        "Yes sir here is victim card use it eveytime sir . I can see mass cult mob during muhorm time and ramzan time also when they ocupy roads and do prayers they block roads use high sound mix's daily such a sound pollution",
        "Wrong people dude they usually spread peace all time 🌚🌚💣",
        "One terrorist spread so much peace she was elected to the lok sabha 💣🔥☠️",
        "That's not possible. They won't be walking on the streets. I've never seen one. Ever.",
        "Gaadi kabhi bhi tod skte hai yeh log 😂",
        "can someone tell what's the context of this image?",
        "That's radicalization in a nutshell and the government turns a blind eye",
        "How can u judge the whole crowd because someone  has a danda in his hand .\n\nAlso such crowds pass through our locality.\nDuring sawan and none of them harm anyone.\n\nAlso during muslim festive Muharram theee is muslim julus and they dont even harm anyone.\n\nI can see guys like u are real problem for society.",
        "I run away from these people",
        "You mean fascists",
        "From protection I mean, security during festivals specially in areas where often 2 community fights.",
        "This looks like rebuttle for other community that involves in fights of an individual from the same community. If you ever observed that happening.",
        "💀",
        ">No scientific temperament in this country\n\nJust my opinion but I don't think them knowing all the laws of Thermodynamics would change much!",
        "God forbid someone follows a different religion 💀",
        "Back in my day, bait used to be believable.",
        "And ppl will still call out Muslims who just want to go to the mosque every Friday just to pray.",
        "Kavariyas as gangsters.... Such a lame point, that's too for satisfying ego.\nPhotographs itself says people are walking on sides and letting other pass, if sticks are we concerned then in India it's common to have sticks by guides when there is crowd....it is not for fight or to defend, it's just...\nHopefully we need to know much than to just wake up from bed and start assuming 😉",
        "What about Muharram then",
        "U need to be proud to become a foot soldier. Fight for your masters and stay poor for generations to come.",
        "Best strategy is to not be blind supporter. It's your job to criticize your government because the mass media has their hands tied.",
        "You are starving, it's ok. \n\nHouse has no electricity, no issue just use wood. \n\nNo good schools, no problem just join whatsapp university. \n\nAll these problems exist because people from other religions are responsible for it. Don't forget to vote for me  next election ok.",
        "Tred Carefully !",
        "Illiterate POS people",
        "That's what happens due to unemployment + hidden unemployment and low quality education plus. \n\nIt's as they say \"an empty head is a devil's workshop\". I hope Indian education system undergoes some much needed reforms.",
        "Islamic thugs, Hindu thugs they’re all the same.",
        "now reverse the religion and dare speak on them",
        "Ok, This is really stupid, but I read \"gangster\" as \"gamer\" and seeing the picture I immediately thought of GTA 1. \n\nGod, I hope I'm the only one.",
        "I see a guy on religious march holding a stock(probably in self defence or guiding traffic) that is not going to hurt a dog but see people here branding him hooligan, terrorist and what not. People here are acting like they own the country and guy like him should not have a right to live.",
        "Which type of Muslim?",
        "It's either this or we'll be the next Bangladesh. People have voted for this in the last 3 elections.",
        "What is gangster about this? They are on their yatra. Funny thing is y'all will justify every other road blocking and think this is wrong.",
        "You should be proud of your eyes buddy.\n\nSo should you about yr religion and language.\n\nIt's your identity. Hating it is hating ur own existence and showing weakness for tribal evil to prey upon.",
        "Just talk about North India, i belong to OBC but my clan is Kshatriya. In Kerala caste doesn’t make any sense because caste is literally inexistent in Kerala",
        "Isi tarha k group se PM bna hai India ka. Or support kro inki.",
        "Idk man looks tamer than the farmer protests 🤣",
        "Why should that be his identity ? Create your own identity and then be proud of it.",
        "They are carrying only wooden stick which is required in inght time for safety against strret dogs",
        "That's a good example of selective amnesia.\n\nYou didn't read about those guys hitting cars, did you? What rituals and yatra needs violence? Does God gives you better \"punya\"?",
        "they beat you ? they attacked your Car ? if no then how you declaring them Gunda ? they have wood sticks for self defence because they get attacked sometimes by peiceful communities ! go search on google !",
        "For Gods Sake we are happy with these Gangster. Atleast they won’t kill Hindus.\n\nAfraid of Muzlims who convert, behead, bomb and rape",
        "What’s the threat here? I’m sorry I either see them with a stick or looking in the opposite direction. Where’s the threat or gangster-ness here. I’m genuinely curious",
        "True",
        "I see them as terrorist, the definition of terrorism is using unlawful violence and intimidation against civilians.. people think its only bombing..these people are also terrorist..I will not use any less word than this",
        "religious fanatics ruining shit for everyone since religion",
        "bro ye boht dur se ate jate they use these sticks for supports even i have done this w them har cheez galt nhi sochna chaiye",
        "People like these actually don't know much about their religion. They are mostly busy in showing off that they are the greatest devotee, instead of actually working on improving their character as well as their deeds. They don't have rationality in them.",
        "They are just protecting sacred water from basterds",
        "a religious procession where people from all castes come together and go on pilgrimage they eat together, sleep together and walk together \n\n> gets termed as gangster by brainded person for going on a pilgrimage \n\nwow\n\nbtw other then a few incidents here and there I don't think kawads have ever caused any problem they do these processions every year \n\nbut I think ik why you are so scared lmao\n\nfyi most of the kawads are from bahujan samaj are you trying to be a casteist op lmao\n\nI bet you think the PFI as peaceful people and rss as a terrorist org lmao",
        "I am a very very religious guy and even a RW still I hate these people... Like bro get a fucking job!",
        "Clowns more like it.",
        "Our leaders (specially our PM) are responsible for this. Instead of focusing on Education, they are openly spreading hatred and youth is following.",
        "You can love and still be not-proud of something. Parents love their kids and at the same time not be proud of them.",
        "The root cause of problems in any religion is extremism.",
        "Abb obc boldiya toh abb koi ayega aur bolega jatiwad 🤡 lekin inko reality samjh nhi ayega kair choro mai toh desh chordunga ( brahmin hokr befaltu ka hate le chuka hu bhout ) jaalte hai sale",
        "UP always suck",
        "This is an example of jobless people.",
        "They will say they are religious but when they see a woman they will harass her without any fear.",
        "Bro never saw tajia holders or bakra cutters with skull cap ... they are Terro.. ahm ahm ... 🤧🤡🤣",
        "More like a syndicate.",
        "The stone pelters won't realise that. They will live in filth and call it a lifestyle.",
        "Hahahahahhaha",
        "You’d be surprised how much caste is still a factor abroad. I’ve seen it myself. It’s pretty evident. \nFollow your religion, but skip parts of it that aren’t really modern world worthy. Adapt, for the best. \n\nCaste is an inherently crappy concept, and so is arranged marriage. And still fing common anywhere we Indians are in the world.",
        "Ab urban naxals bhi gyaan denge...?",
        "even a love marriage is an arrange marriage itself ... the thing in India that dowry involves in this pratice and even i saw in love marriages ... dowry is taking place",
        "This seems like a religious procession. Usually it happens at end of Sravan (sawan ka mahina) month end. This is where devotees visit Shiv ling to put water by foot.",
        "It's too intimidating, you have to follow their orders to go safely. It took me 2 hours to cover 1 hour drive last August.\n\nAnd original kavar who do it for their religious believe has small 1-2 (kg load. These idiots carry 25 kg in group to boast hey I carried this much. They have added so much toxicity to the religion",
        "Really or just to insult you're saying it. Then where is the pic of that act. They could just be shouting to make everyone hear that go that side or let us pass. Logic rip. Interestingly you're saying it, then there's religious angle, other side road blocks pics will start coming, which are true as well",
        "Dowry is a different matter altogether.",
        "Have you ever seen a real gangster?",
        "Imagine a Muslim family driving through this.",
        "Thats not very gangster.\n\nMore like chichorey tapori",
        "Yes, have you not seen the videos of them assaulting police officers and destroying cars? It's not just a few bad apples, it's the whole orchard.",
        "The reason these goons operate like this is because of the protection that the police and government give to them. Try to find any other religious group that does this without heavy police around them.",
        "bhai sambhal kar rahiyo koi bharosa nahi inka mob lynching hojayega. RIP Aryan Mishra",
        "Gangsters or terrorists?",
        "Easy run over",
        "Now you know why savarnas oppose feeding eggs and meat to poor kids.",
        "Iss desh ke log education employment par kyu nhi bolte ?",
        "The root cause of all this is corruption. Have you ever cheated in your school exam or not completed your work? If yes, then you don't have the right to ask for good roads and  traffic management. If no, then you can find more people who have never done a bad thing in their lives and form a govt. And then fix all this that you don't like.",
        "And you people find muslims with swords very safe 😂😂😂",
        "Unfortunately I do not believe in god that much otherwise if God really existed with the whole heaven and hell concept, these fools would be the first to be thrown in hell and suffer for the rest of their life. If god really existed as how they depict god to be, then God probably hates them with all that god has. They literally go against anything hinduism preaches.",
        "As a Hindu I agree with this",
        "Majorly broken or semi broken homes.... Abusive or drunk father's.",
        "Funny thing is they get donations and support from educated people as well to fuel their hatred. But none of these sponsors never send their child to run a march and yell at others. And their excuse, “Saving God, Saving Hindus, Saving India”. Are they really saving anything?",
        "Still better than sitting on the road with the asses up and blocking it. Try touching them and see what they do, guys here are just carrying a stick!",
        "Well.. y’all empowered these behaviours in this particular for past 8 years. You might as well experience some of it.",
        "The kind that follows teachings and not a random baba. Islam tells us to follow the law of the land. Having processions and disturbing the peace of others isn’t an Islamic practice or an ideal.",
        "They mean scientific curiosity and a habit of questioning things and critical thinking",
        "Lack of education make you goons",
        "I meant Shia or Sunni",
        "Lets see their love for the land and Hinduism, send them to the borders haha",
        "Few questions….\n1. Why are they holding Danda??\n2. Does it have any religious/ritualistic significance?\n3. Are they using it to protect themselves?\n4. Are they using it to intimidate others? If someone gets intimidated unnecessarily, whose problem is it anyway?",
        "Atleast they aren't Muslims",
        "*Terrorists",
        "By the way, where are they going? and what will they achieve after this? Will they get gold coins after all this?",
        "For these stupid pepole and trying to be cool they will not even think twice before doing something wrong .",
        "I wish they understood how adorably stupid this looks to the rest of the world.",
        "Ladies and gentlemen, the anpadh kuposhit gawars of the world, right in front of you.",
        "Istg we need more jobs in the country",
        "This Looks like a kaavar yatra, not sure if the person posted is high or always has hate for hindus. when people come up on streets in muharram with knives and shelves and show blood shed all around, then these people are busy sucking their partners pu**y/d*ck. God help you.",
        "UP is doomed",
        "Modi was one of these guys when he was younger. Do some research idiot.",
        "Kanhaiya Lal is killed by ....",
        "I live in chattisgarh, here I have seen what happens during, muslim festival kids have knives with them, hindu festivals stine pelted, only happen during idol is taken to rivers, later people news and gov claim it's due to DJ or lour noise bro why ? The government is BJP here mostly police give them protection too. It's a cycle you can't blame one side.\n\nThis needs to be stopped but the question is how no one trusts each other here.",
        "Same thing happened to me when I was going through car and this kawad yatra was going on they behaves like gundas they are not letting my vehicle to go and over take showing lathis and danda while traveling on bikes and showing that they are bigger than u \nU have follow the order of these bahubali when they are on road driving rashly and becoming threat to other people's\nAnd one more thing is that if ur car touches to them they will become violant beats u on road and total damges ur car \nWhat the fuck is this happening in our society",
        "Danda pakadne se koi gangsters nhi ban jata 🤡🤡🤡...",
        "True. Hindu extremists won't exist if Muslim extremists didn't exist.",
        "Lol fair enough",
        "You don't have to be an atheist to not force religion on others.",
        "Agreed. Tbf scientific temperament didn't exist even when Congress was in power.",
        "It wasn't there back then but with the BJP we're going further backwards.",
        "Idk man. I don't think BJP is any worse than Congress.",
        "That's your personal opinion but from what I see the only party getting triggered over superficial things like non vegetarian food, place of worship, superstition and a bunch of other backward practices mostly come from the BJP. But sure believe what you want to believe.",
        "Minorities do all of the above and they vote for Congress.",
        "Yeah but majority is majority",
        "Ideally yes but Congress loves to appease Minorities.",
        "That doesn't change the fact that the BJP influences the majority of the countrymen.",
        "Exactly 💯💯",
        "You\"ve Mean Islam by That",
        "Too much of hate which isn't needed at all.\n\nI agree this creates a problem in traffic and frustrated us.\n\nBut don't just criminalise what you see in the first instance.\n\nThat stick is to keep their mates in a limit and in a line such that they do not cross over to the middle of the road, their intention isn't to intimidate someone, but yeah that is a mob and things do escalate but stop looking at them in this way. Government couldn't mobilise this zeal and passion and they are unemployed hence doing what they find reassuring and satisfactory (religious hardships). They aren't brandishing weapons like swords. \n\nThey are aware about what they are causing hence looking at the passing by cars and they keep check on themselves by holding a stick in their hands they never intend to create law and order problem(I'm talking about majority of people in there)",
        "Political supported goons",
        "I remember watching them when I was kid from my school bus thinking this is cool, you go on a trek around the country, get to have food and no work. \nLater I realised this is a cycle of poverty clinging onto religion.",
        "I remember watching them when I was kid from my school bus thinking this is cool, you go on a trek around the country, get to have food and no work. \nLater I realised this is a cycle of poverty clinging onto religion.",
        "Gangster. Don’t degrade the word gangster. They are pests.",
        "Been living in Abroad since 2018 and i saw no one protecting churches.",
        "Hater is a converted ramdika",
        "True but things wouldn't get better if Congress had that kind of influence either.",
        "Luckily they don't and neither are their followers as stupid",
        "Congress members and minorities are diehard Gandhi family fans and they're pretty stupid (not all minorities obviously).",
        "Nope. Minorities just want to live without getting lynched by the sangh.",
        "The sane ones, yes. There are minorities who want to lynch Hindus though (Supporters of Muslim parties, Christian terrorists, etc.)\n\nThere are sane BJP supporters as well (like me).",
        "Christian terrorists? Lol you've been brainwashed by the sangh \n\nYou might be the sane one but the PM is Modi and he orchestrated the Gujarat 2002 riots.",
        "http://news.bbc.co.uk/2/hi/world/south_asia/717775.stm\n\nIs BBC a Sanghi source?\n\nAgreed, the problem only exists in the North East but to claim that Christian terrorism doesn't exist in India is objectively false.\n\nThe PM did orchestrate the riots but in his defence, there haven't been any riots since.\n\nThere have been lesser riots under BJP rule than under Congress rule.",
        "\n> Is BBC a Sanghi source?\n\nWell I'll give it to that this is legitimate but no where close to what the sangh has done in India. \n\n> The PM did orchestrate the riots but in his defence, there haven't been any riots since.\n\nSo if a rapist says he raped once but never again that's alright? I'm surprised at the fact that you admitted that he actually did orchestra the 2002 riots but still went ahead with voting for him and still call yourself a sane BJP supporter. It's sane to back up enablers of riots, rapes and murders?\n\n> There have been lesser riots under BJP rule than under Congress rule.\n\nThis is objectively false. There have been far more riots and religious attacks after the sangh came to power. Something as little as eating beef can get you killed now.",
        "I feel the same scared when people are out on streets with swords🤡",
        "Ever heard of ‘Edappal Ottam’? 😂",
        "If a rapist raped once and all rapes on Earth stopped ever since, I do feel sorry for his victim but things are objectively better in the bigger scale of things.\n\nAll political parties enable riots, rapes, and murders. \n\nI'm going to need a source for more riots since BJP came to power.\n\nYes, the vigilantism is getting out of hand but I blame the courts not BJP. People have gotten impatient with how slow courts are. It takes 20 years to get justice. Justice delayed is justice denied.",
        "> If a rapist raped once and all rapes on Earth stopped ever since, I do feel sorry for his victim but things are objectively better in the bigger scale of things.\n\nThat is on very fucked up take. Justice wasn't served and you're relying on the fact that the perpetrator will not do it again. Also sets the wrong precedent. What if a person sees this commits rape and says he won't do it again? It's beyond me how you can even think they can't be held accountable and this is pretty much why the country never progresses.\n\n> All political parties enable riots, rapes, and murders. \n\nThe preparators are usually reprimanded in other parties but with the BJP they're given a hero's welcome and get their feet touched. With the Bilkis Bano case a significant portion of the sangh praised the rapists. No this is disproportionate in the BJP. After seeing Kathua, Unnao, Hathras, Bilkis Bano, Brij Bhushan and a lot of other cases I can safely tell BJP not only turns a blind eye but also facilitates rape.\n\n> I'm going to need a source for more riots since BJP came to power.\n\nhttps://factly.in/the-intriguing-case-of-data-on-communal-incidents-in-india/\n\nYou can also do a simple wikipedia search and see by the year how many riots were there. \n\n> Yes, the vigilantism is getting out of hand but I blame the courts not BJP. \n\n\nHow do you blame the government for stuff cow vigilantes? The issue people can't tolerate different ideologies and culture and resort to violence to prove their point.\n\n\n> People have gotten impatient with how slow courts are. It takes 20 years to get justice. Justice delayed is justice denied.\n\nIronic you say this since in the previous paragraph you literally said if a rapist commits rape only once and never you're fine with the person being let go and with situations like Modi orchestrating riots you're even fine with him being the PM.",
        "TLP, Indian version",
        "Looks like an orange squad protest",
        "They Travel in from many forests and night, That's why they carry a Danda for scaring those animals."
    ],
    "cleaned_text": "modern indian gangster traveling ayodhya lucknow suddenly religious gundas show holding danda like theyre kind gangsters flexing hard saw using danda vehicle even police doesnt use danda car one dares mess crowds big intimidating cant sht another day highway ",
    "cleaned_title": "modern indian gangster",
    "cleaned_selftext": "traveling ayodhya lucknow suddenly religious gundas show holding danda like theyre kind gangsters flexing hard saw using danda vehicle even police doesnt use danda car one dares mess crowds big intimidating cant sht another day highway",
    "cleaned_comments": "terrorists rebels scientific temperament country bjp vhp bajrang dal wants address gundas mobsters hooligans riffraff bottom trash nation wide gangster organization depends upon side state sponsored thugs go gta bro need selmon bhoi amount time feel scared presence insane boys usually middle lower class houses faith identity hence join kind herd think contributing towards something worst thing weaponised extremely single offence lead towards death extremely scary vile often creeps gods could speak wow cant give yr life hindu rashtra lol well put wow respect selom bhoi channel inner selmon bhai blame terrible wondering others yassss racist man hate bhai kuch hua kya gaadi ko ya apke aapko bacha liya genuine realistically one jacked gym bro enough much damage even twigs long run imbeciles sides muslims hindus gain nothing lives total waste drunk religion wont anything betterment family way pity educated well people similar mindset ideology worries astute observation rebels usually cause aims thugs like us one potent without omni exist scientific temperament welp time lifelong prisondeath sentence kbhi tajia pe ghar se bahar niklo organisation belong yeah cant believe randomly hitting cars people werent shit seriously underestimate power stick politicians want play religion card time loot fuck every indian institution leave middle class go pray food dont forget christian terrorists north east wait till witness islamists mob like bangladesh oh really youre calling murder innocent people hope police takes note youre hater bad ideas gta murda man lmao people bring islam everytime equation theres talk hindu mobs yeah yeah im sorry wont islamist mobs country saffronised hindutva happens muharram say khalsas carrying swords muslims carrying sticks muharram much hear shit news pointlessly calling group names would rile arrogance alone fuels people hold believes even closer ye muslim hindu ke extremists na hote toh accha rehta life peaceful x jati false dont blame every kanwar group ye saala bahut aage jaayega mera matlab jail muharram happens year twice idk khalsa also happens rarely done religious purposes ever rarely hear threatning klling anyone hnd mobs klled thrashed people way much arrogance level people often mobs live north india specially know nuisance created dharam k terrorist yeah agree people dont understand accept fact living delusional life cant bear bjp seeks refuge name patriotism religion congress far behind shit name social justice equality basically screwed india creating political zombies stop livinh rock think replied wrong person need resources well social standing case would stuck aching judiciarys backdoors boi got clean chit eyes nonbiological nice try love life take baits lets forget majority actually join happens almost every year thane maharashtra janmastami guys large group lots intimidating eve teasing remember sister kid maybe grade passing sexual comments group would balls otherwise exactly brown army nazis beneath hooliganism see total lack awareness quite ironically malnutrition tell exactly india fucks priorities whenever see mobs get scared capable horrifying violence hindu joblessness main culprit sticks stones make barbarians gangsters wear suit use guns seen movies nah thats time use remember kanhaiya lal bhilwara rajasthan rebels require system goons supported system nothing semi marshal extremist faction meant flex religion state muscle still remember muharram processions first time saw traumatised scared cant even pata nahi bhai bhajrang dal abb bramahan ko bhi marene lag gayi hai kya pata din baad yea mandir mea jake murti hata de shows much education change person poor chaps dont reason challenge superficial facts spouted leaders please educate moralsreligioncodessocietyetc people tiny bit critical thinking would crying sleep every night thinking behaviour affect others like ops picture educate hopefully others perfect observation peaceful peaceful religion karte rehte kuch sikh lete us peaceful religion se bsdwl yes truwthese fukers gather every friday randome shit roads parks great observation someone give context india law order joke county every morning go walk stick damn never knew gangster time lead accident due action reminds scene derry girls claires family tries drive orange march protestants except much scarier let put someone drags muslimsislam usual pagan obsession islam represents deep rooted insecurity lack faith hatred nothing fear survival mechanism stems intellectual bankruptcy lack understanding islam especially lack strong faith beliefs gods prone gravitating towards islam decide gain actual knowledge beyond propaganda average hindu driven faith hatred religion carrying religious yatra within constitutional rights make anyone gangster idk people downvoting personal experience rather say trauma crowd face crowd everyone becomes gangster implies every crowd inke saath rajat dalal ko bhidado india people respect bigger stick brandish automatic rifle infront watch scatter question right wrong rights duties dont think middle class middle class boys girls incentives try improve financial condition wont waste much time shit guess middle lower class lowerpoor ass families need sense pride becomes sense pride wonder thier parents equally violent former arent rebelling anything think theyre youd see fewer issues country everything reached point something silly beef consumption considered reason cow vigilantes murder people anyone decent scientific temperament wouldnt even think way greatest scientific minds throughout history questioned religious practices absurd one scientific temperament would ever keep religion top priority outside walls house paw paw biggest gun wait nazis situation thats funniest part sad people wont know end god couldve done lifetime practice believe within confines lives places worship house wont lets honest see naive ill advised young citizens talk brain drain foreign countries half end like see reading comments thread feel liitle comforted see many sensible like minded indians voice opinion religion know opium masses sadly india addiction worsening even though india might improving gdp numbers becoming economic powerhouseis really progressing grassroots level nope cant generalize chuslims terrorists generalise kanwars gangsters never underestimate strength mobs go wild offtopic similar pack stray dogs attack maul people like recent story bengaluruhttpswwwyoutubecomshortssygeubhpkyq didnt bjp guy beat shithttpsindianexpresscomarticlecitieslucknowbjpupkanwariyasmuslimspolice hooligan kanvariyas week mean one even confuse group orange people muslims implying actual muslims beaten people commenting see safron clothes taking preconceived perception people know attend kavad best people know careinghumble helpfull people front back carrying sticks guide traffic sometimes may obstruct traffic wrong apart find problem photo called self protection many incidents stone pelting happens justifying reason cyclic cant blame one throw stones one use stick bjp call hindu party provide type protection hindu festivals changes old rules temples land donated gov clutches often misused gov bjp crying waqf board many know bjp one made waqf powerful give benefits one community donyou really think anyone give like quota system bjp absolutely nothing regarding bangladesh border saying need nrc letting illegal people come india really think indeginous people tolerate cause hate community bjp fix almost things choose unless election time like people india forget better show cards show one one dire need dire need healthy opposition need raise right questions idk come maharashtra especially marathwada region find big kawad like guy mentioned guys belong lower middle class obc families usually work political leaders high time show subhuman trash life money joy engaged short shit escape life kind like modern day opium masses pet dog got life better good food good lodging heck even medical attention fall sick things never get miserable life walking barefoot religious procession become like several reasons long wearing orange clothes even gun gangster bihar kanwar yatra km approx dont think others face similar issue government made seperate route journey seperation road seen people following without gundas muslim really scares even intentions becoming stereotyped similar muslims facing terror attacks around world kabhi itni taarif ram navmi wale din pathar fekne walon ki kaar dia kaar saar tan se juda pe aap kha hote hai janab mahuram bakra eid slaughter didnt even throw anything vehicle let u pass giving u aside still gunda spitting shit social media anything u need potential rapists deep bro hate u moment u gain substantial numbers u try kill every minority left right centre someone reverts back u claim victim always behave rudely road skull cap bomb also self protection bro hindu terrorism pictures created bad effect hindu community proud religion u dont need food dont need money basic facilities let hate others feed satisfy bro feel shit scared muharram processions well see downvotes understand one wrong except hindus pick one one one fight lets see actually malnourished thatd fun one anything saw bunch people wearing orange felt scared haan bhai muharram ki tarh hi toh hai ye model state modeling vin ghaslet raj bhai hindu hai toh wrong hi hoga muslims road block krke namaz bhi kre toh shi rehta sikhs sword carry kare wo bhi theekh rehta hai commenthttpswwwredditcomrindiacommentsfhhpncommentlllwne byubetterjuryhttpswwwredditcomuserbetterjury discussion inindiahttpswwwredditcomrindia see people posting reddit likely least middle class see mentality bhai muslims good hindus bad ye kab sikhenge aap even mindset bjp idea law order lol north india going drain sure man need work towards getting rid helping anyone religion exactly could also would abhor mahadev extremely patient god mostly pleased less doesnt condone whatever guys name kanwar yatra money channel tgclub mean people whose homes churches burnt hindus whose women paraded naked hindu men right terrorists scenario based guys gods work keeping investments away end tools manipulated realise old age late like bees prick one others spread attack without knowing reason maintain distance happen parents didnt tell thing kavad yatra religious n sorry problem psychology behind often absolute cowards ever confrontation pick one guy try beat ever living shit others likely freeze reason majority actually want intoxicants life sucks use escape bigger problem population poor youth jobs etc etc missing point completely might defeat us street fight point high possibilty strength brain power used anything contribute toward development country world totally goons facy consider persons ability fight parameter health explains exactly wrong nation orange new black kya bhai pehle pata karle kya hota fir gyan pelena honestly though nothing scares like colour orange days hindutva made colour fear terror running hindutva fascists morally justified also incredibly satisfying hope comment goes peaceful community displaying peaceful gestures europe parts world peace woke people anti nasnal saar selmon need give somesense belonging goal new terror sensation jsr go slogan atleast better gundas throws stones aa jao congress walo gyan dene lack awareness something would say know impunity enjoy india turned dividend large young able bodied demographic catastrophe uneducatedpoorly educated underemployed malnourished young people moorings present hope future dont know shit religion following herd rangryupvote theyre going assault indeed ones raising sir tan se juda slogans everywhere beautifully written skinny guys first leave battlefield war ever break say china us called anti national would forefront defend fought british fight others well future chaddis support enemy always history repeats yup wont expect clowns japan ik buddy ik cowards balls theyd lick boots mughlsbritish post independent congress govtsindira gandhis emergency congress etc thats lick survive one sides violence put others ever two way fight jokers would run save hide cowardice generational trait whatsapp university gyan many seen people description bet none small teenage life yeah many gangster families long religious procession banned believe even enough jobs miracle people wouldnt able secure one lol mean youre starving easier find comfort religion say upavasam true also lack awareness towards dont life goals aware ecosystem around makes concentrate religion hindu muslim us vs people someday woke realised politicians used religion use didnt get anything country farmers protesting corporations seen terrorists peaceful religious attendees people need get job terrorists like terrorist camp exactly hope future wouldnt sure thats nazi level stereotyping many go great colleges universities go get good posts good organization stereotyping sure also completed kanwad yatra th class many friends way better many wtf brown army talking brown shirts stormtroopers clear youve called brown army like brown ppl thats person asked q like confused atleast far better jacket boy dont forgot religion one hell drug great comment care explain come wrong nation guy looked frail figure passed judgement malnourished frail body isnt malnourished body show obese people battery malnourishment see bro dont know wrong nation definitely wrong stereotyping nazi pigs people whose passing cars brave harm people minding businesses nope time seen fire hatred spares none recent example mishra boy killed gau sevaks whatever call terrorists jobless plain simple ohh definitely hindu terrorism fuck feel safe muharrram procession mob thats always keep indian billhook car always shows clearly politicians winning brain washing works meant brownshirts shouldve clearer thanks clarifying lot middle class people pilgrimage kanwad yatra one whi went along friends spiritual experience walking across country meeting people walks life met guy sonipat well rich people stereotype kanwariyas poor uneducated way look wear simple saffron clothes seem frail poor tired long treacherous walk fact lot poor people go pilgrimage many middle class rich well send border defend nation see come running back mommy also desperately seeking love sex touch wan na run muharaam argument shit runs day chewtiyas occupy city roads highways entire month public nuisance wouldnt feeling gangsta america stick yet moms aunties caught theyd cower wrath women would give need context pleasewho seen many videos destroying cars twitter hv guts post pics real ones behead people reason becoz like cutting vegetable thm know way intoxicants work brain incite chemical processes brain subside pain maybe dont know religion works yes kind scene seen muharram tajiya happening goons everywhere isnt yes kind scene seen muharram tajiya happening goons everywhere isnt hideous hooligans thats need allah come isla many go great colleges universities press x doubt gon na see near future ig especially central govt side faith nothing people faith persecute kill stupid reasons lower middle class obcs foot soldiers hindutva project yeah thing happening side well thing christian victims open biased blindfold brain drain west brain death waiting post islamic terrorism oh wait thats happening many many decades people dont balls call islamic terrorism terrorism doesnt religion correct stop hypocrite behaviour xxxxxxxxxxxxxx sometimes hurts listen see pictures comments cousin go walk roadside types extra irrespective things nowadays become fashion type joy sacrosanct prayer indeed astute one might even claim phobia immediately skimming words shhh far right compulsory sterilization program introduced prime minister mrs indira gandhi indian citizens india come across items streets nation owaisi bhai real id aayiye could wrong holding danda part procession think muslims block road praybet u dont feel like gangsters islamic terrorism obvious thing terrorism related islam hindu dont want religion become one face terrorism classic rindia post peaceful religious walk country ruined religion wont become become people dont support kind processions like blocking roads playing heavy base music night importantly causing problems ordinary hindus like us dont support kind shit nowhere vedas written blast music full bass go bonkers road please mahadev wish someone goes bonkers runs suv nahi funny people following hinduism keep investment away hell even consider gangster let tell danda live mumbai walking towards shirdi saw eyes padyatras treated socalled elite car owners group member killed truck daylight going shirdi worst part truck even stop truck driver never caught even firs hence padyatries started use danda jains yatra buddhist yatra many hire men safety keep dandas waking always feels good sit ac car lecture world dont even know truth im sorry shouldnt assume middleclass lowermiddleclass people involved something like perspective feels privileged many educated welloff individuals responsible heinous tragedies im trying call anything feels necessary us change mindset like bullies yeah agree hindutva project likely vote bank reddit kangaroo court assemble gang gang survival cause cause others even tho minority every group terrorists group gundas terrorists threat whole nation yet people problem privilege class one dominating people wont see modi yogi anyone lavishly living house going street support whole goon culture endorsed privileged often dont come street seeing comment stereotype every class participate different ways kind mob culture participants middle lower class still better beheading old man broad daylight kon manhe mahina bhar chal na ri kawad ani karyakarte hya shab da cha prayog mi kuthe kel aadhi mala kalva mag mi tumhala sangto varkari good people never felt threatened never heard complaints thats faith someone kind help clueless european understand happening apologise sir didnt mentioned varkari yeah indeed good people infact one follow pure religious rituals practices way everyone follow op describes teen guys acts like gangster try show rowdy nature kawad yatra talking chapri goons people go countries also become extremely conservative reason cling religion caste like life jackets yes feel like middle class lower middle class become everyones punching bag someone actually grown slum theres reason theres hope see people around struggle every day youre filled rage system designed keep good schools hospitals even toilets theres dignity born living even dying witness angry suppose misguide rage please dont take attack point nuanced layers blanket statement like nothing spread hate great people walking become gundas done wrong danda hand walk km sometime need walking stick sometime scare stray animals ohh hindu thats gunda great observations everyone nuh horde mob showers rocks normal guys road gunda people walking gundas xd point commentthat theres less faith hope identity relate deprivation much said makes indian lower middle class unique also huge variation cultural political prefrences idk conducting im spreading hate even though agree well im pointing political extremism country weaponised form comes system mostly fails sad rage owaisi bhai visionary hai indias per capita developed nation crore population thats youre trying say im sorry bad wait see real gangster holding knives shouting stsj post never see light day sub assume extremism india faced past years naming someone without knowing understanding fashion suppose urban youth touch culture know cnn netflix etc culturepity hindu th class friends karyakarta bjp middle class one even booked attempted murder year terrorist shout something else blasting vicious circle nutrition leads higher iq helps lot people go college independent thought lower iq people easier manipulate susceptible propaganda vicious cycle cant name religious gundas people actually follow religion indulge stupidity let hinduism islam sikhism christianity people claim called flag bearer religion reality ones farthest away basic ideals religion disposables im muslim call banned feel people dont know shit religion care gain fame power crush suppress others hindu really ashamed people abuse really guys even pray ethics dont remember carrying weapons like needed highway even u say self defence mai kuch nhi bolu ga u thankful sticks ak swords yaha sab gyan chodne sa jaate hai ye ek dharm ke khilaf nafrt phelana nhi hai strange didnt click pictures saw using dandas showing suddenly called rally teleport ability magnitude hope farmed sufficient karma though id happy muharram procession banned im muslim need keep herd check cry feeling unsafe roles switched people even acknowledge let alone condemn terrorists idiots post like shit go somewhere highway wont try safe anyone run vehicle family members highways try keep safe yes please also mention muslim majority countries done minorities neither right wrong feel multiple countries would behave differently towards islam muslims didnt right others wrong attitude attitude isnt problem violence ensued millennia result attitude goes everyone trying single islam trying hopefully convey nobody cry victim everyone blood hands others point wo gunda nhi wo bas car bike walo ko side kar rhe hai wo koi patthar nhi fek rhe hai toh religious gunda ya kuch mat bola karo jo patthar fekte hai uske bare bolne ki himmat nhi hai teri religions fucked fucked others cameraman modern indian pussy labourers work daily long hours might physically stronger many would malnourished strength doesnt necessarily translate good nourishment xxxxx dont belong reserved caste least saw kavariyas eating gutka spitting everywhere civics sense using vulgar words loudly front school kids fuck assholes mahadev open third eye burn bhakti asses kind biased think year could run much violent group wedding goers kawad pretty much limited one month year however see time give space road well youre close enough one hit car youre probably driving close trying use vehicle move way people group buffalo getting close means dent car getting close means broken foot leg im saying someone done kanwar yatra haridwar delhi well dak kanwar haridwar kashipur groups thugs people walking km day heat tired people trying crush drive ac patriotism last refuge scoundrel phrase fits perfectly religious nationalism given low life unemployed losers thugs false sense pride theyre different islamic thugs absolutely theyre ignoring real problems similar islamic thugs someonefeed gangstersthey look anemic fwiw always alittle intimidating way behave road years dealt hooliganism graph risen quite steep last years feeling emboldened justified im religious respect every religion right practice country decorum standard follow cant uproot others lives daytoday decided take road allow cars pass stood traffic anywhere hrs kawar yatra rath yatra every year cant begin tell affected life professionally personally gundas danda peaceful peoples walk swords stones india becoming next afghanistan soon run kyu bhai teri mummy ki mar kr chale gye jo tuje inse dar lag raha h perhaps never seen moharram procession never seen picture people certain peaceful community praying roads blocking traffic called ok idk middle class lot lose even get involved murderpolitics offend might wan na check study government school slightly better allahu akbar gang thats lot really small sticks acting tough speak softly carry big stick tabhi mujhe koi specific group se dikhta hai main ddur hi rehta hun kya pata kab phatt jaye someone give context india technically terrorists bahahahaha walking road sticks thinking theyre hard people waste time crap india become bishwaguru aw man afraid sure know statement religion opium masses used context used religion sigh oppressed creature heart heartless world soul soulless conditions opium people indeed similar case happened traveling via patna processions similar take village roads due nuisance idiocracy next level country irrespective religion young people dont prospects usually fall back group affiliation give identity sense purpose reprehensible society failed allowed turn stdomnic sovious sr sec high school see something real doesnt make less real sorry truth hurts never seen real gang type stupidity expected ok let try also south asian stayed india nepal bhutan sri lanka enough understand local customs religions problems politics etc still forgive miss small details religious processions called kawad yatra continuous tradition states along river ganges since years sages would walk kilometers dedication lord shiva offering water holy river statue shiva different temples across north india recent years freedom islamic british rules tradition regained popularity sages also common devotees started following tradition beliefs getting blessings lord shiva mostly male members families bad year two problematic economic health situation death family take vow dedicate lord shiva whole month arrange leave jobs walk barefoot eat simple vegetarian plain food etc visiting major temples path one holding sticks volunteers organizing crowd march stick defense animals like dogs idiotic drivers attackers islamists politically motivated goons quite common part india attacking procession reddit mostly islamic community leftists current ruling party non muslim kids follow one sided secularism blindly use danda kill snake elders use walk kawariyas use take water matka trash ideas also trash welcome orange bhaarat ya sexual exploitation females corporate world done called educated isro head didnt went ram temple abdul kalam talk bhagvat geeta interesting thank sharing perspective gundas someone chant ah hu ar blast school teachers son bloody hyppocrates general statement bud might rich really care consequences bro people carrying danda use carraying matkas judge image days back also kawariyas broke someones car guy hit matkas carrying kms also barefoot assume people show anger well education really make person good human happening sexual exploitation corporates educated ones usa pheophiles yes sleep street way image ofcourse religion isreligion abe jaa lodu maybe ultra rich almost clearly atheist appreciate referring pakistan bangladesh makes sense using representative muslimmajority countries inaccurate many nations gcc uae bahrain oman historically hosted large nonmuslim expatriate populations sometimes exceeding local populations managed religious diversity peacefully similarly north african countries like morocco tunisia algeria along far eastern muslimmajority nations brunei indonesia malaysia long histories pluralism coexistence various religious communities broader perspective challenges oversimplified notion muslimmajority countries inherently struggle religious coexistence violence guessed right think procession devotees go water bodies barefoot fetch water offered lord shiva every monday hindu lunar month shravan mean weird thing see image danda used take matka water right think returning asking image takes started fear mongering matter isro head went ram temple abdul kalam spoke bhagvat gita personal beliefs arent forcing anyone believe believe im genuinely curious point even hilarious simple statements go heads many people deep well think time academicallydeclined education behaviour wise peoples desire towards power authority attracts religion initial thoughts initiate authority towards religious people people want avoid conflict lack sensibilities education instigate hooliganism recklessness terribly distasteful mindset theres much going life without educated ones genuinely believe care religion calm demeanour respectful responsible also mind business seldom seen types events yes quite true regardless religion people gets settled abroad stop following religion speak foreign language nice wonder words would used followers middle eastern cults thank trying say representative muslim countries think focused perspectives honestly thats true dont evidence used stick op could exaggerating sa organized brutes name nsdap become famous beeing strong arm nazis harassing jews fighting kommunists political enemys cut end forced join naziorganisations hitler felt endangered saleader ernst rhm guys beating political enemys fair enough noble aims better phrase guess give several examples cows used tool muslim invaders indian kings go backfoot mean caused country seems like good ideayeah whole planet consumes beef even relevant current context youve stating things back nothing claims whole thing science yet somehow made cows httpswwwvicecomenarticleusamericacustomscowdungcakesindiacovidhttpswwwvicecomenarticleusamericacustomscowdungcakesindiacovid bro op trying spread hate nothing else similar case happened new city visited friend going bike ride pm said look whores standing get x amount bro like ye pahle se hi manke baitha hai ese koi jake normal ladki problem create kar dega cling religion caste like life jackets people got refferals caste family hold value high made comments main comment got deleted guess long one cant type anyways bro look previous comment brought cows first yes muslims way better right protect us doesnt matter terrorists muslims still believe whole planets eats pork also dog cats lol keep seething muslims nothing wrong country comparison goons knowing happened indian subcontient need know history tired seeing people completely ignorant sad thing people justify actions name religions hindus kavad yatra saved accident stereotype labors kanwariyas argument actually regarding nourishment strength precise highlighted malnourished hope got im poland seen lot guys marching trip india someone explain write get didnt say prev comment mean highlight arent malnourished also im stereotyping mostly labours malnourished used example like bag oranges well reacting guys blind blanket judgement malnourished ofcourse nris view religion connection home uneducated people view political tool hey guys increase comment karna shame sunday ho ya monday roz khao dande yeah whole planet eats pork well eat pork beef well everyone eats dogs cats isnt gotcha moment think thought muslims eat beef right literally every community india sufficient beef consumers dont like dont eat dont go around justifying killing people name beef bjp never done anything provide special protection hindus pretty sure hitting cars bikes sticks damage personal property premise comment show religious indoctrination caused lot issues critical thinking plenty things apart beef pick well tell relevant current context ill tell youre bringing youre basically insinuating muslims bad muslim invaders came india past man easy see argument dont hide behind fancy words youre trying justify dont like muslims say instead beating around bush exactly happened live ayodhya going lko work hooligans showing dandas passingby cars except white shirt might gunda boss looks well fed chairman mao philosophy keep em starving remain stupid modis india mighty gods supposedly need protected low iq unemployed scum dont even understand one proud religion language etc born default setting like saying im proud two eyes yes badsafron gundas ha hasan ho hasan muharram gang love join religious gathering march known kanwar yatra kanwar yatra annual hindu pilgrimage india millions devotees known kanwariyas walk fetch sacred water river ganga water offered shiva temples especially holy month shravan julyaugust practice worshiphonor lord shiva pilgrims carry water kanwarsdecorated poles pots journey involves walking hundreds kilometers pilgrims even covering distances barefoot local governments often provide facilities including security medical aid kids really brainwashed cult religious goons everything name god blah world would better place people removed necessity mother invention individuals hadnt suppressed decades due appeasement would naturally remained cheerful vibrant group meant lolz weak crowd sheeps hello good uttar pradesh sad sad sad story hopeless eastward one goes living precipe sht start hit fan imagine happens areas extreme poverty functional anarchy utterly vigilant survive everyone yatra hitting people sticks bad apples everywhere prospect brother major religions major castes wait turn government become called bahubali thats best hope life youth family familial politics middle old age feel bro feels muharram bro issue rather tradegy due poor economic status lives would amount nothing anyway tere kaun se makkan chura lia jo tere ko itni jal rahi hai issue rather tradegy due poor economic status lives would amount nothing anyway anger venting route life sucks hard resources utterly vigilant typical communist logic friend funded person congress george shuru dont find madarsa chap teaching radical islam actually real spreading violence rap blasphemy chamche yes sir victim card use eveytime sir see mass cult mob muhorm time ramzan time also ocupy roads prayers block roads use high sound mixs daily sound pollution wrong people dude usually spread peace time one terrorist spread much peace elected lok sabha thats possible wont walking streets ive never seen one ever gaadi kabhi bhi tod skte hai yeh log someone tell whats context image thats radicalization nutshell government turns blind eye u judge whole crowd someone danda hand also crowds pass locality sawan none harm anyone also muslim festive muharram theee muslim julus dont even harm anyone see guys like u real problem society run away people mean fascists protection mean security festivals specially areas often community fights looks like rebuttle community involves fights individual community ever observed happening scientific temperament country opinion dont think knowing laws thermodynamics would change much god forbid someone follows different religion back day bait used believable ppl still call muslims want go mosque every friday pray kavariyas gangsters lame point thats satisfying ego photographs says people walking sides letting pass sticks concerned india common sticks guides crowdit fight defend hopefully need know much wake bed start assuming muharram u need proud become foot soldier fight masters stay poor generations come best strategy blind supporter job criticize government mass media hands tied starving ok house electricity issue use wood good schools problem join whatsapp university problems exist people religions responsible dont forget vote next election ok tred carefully illiterate pos people thats happens due unemployment hidden unemployment low quality education plus say empty head devils workshop hope indian education system undergoes much needed reforms islamic thugs hindu thugs theyre reverse religion dare speak ok really stupid read gangster gamer seeing picture immediately thought gta god hope im one see guy religious march holding stockprobably self defence guiding traffic going hurt dog see people branding hooligan terrorist people acting like country guy like right live type muslim either well next bangladesh people voted last elections gangster yatra funny thing yall justify every road blocking think wrong proud eyes buddy yr religion language identity hating hating ur existence showing weakness tribal evil prey upon talk north india belong obc clan kshatriya kerala caste doesnt make sense caste literally inexistent kerala isi tarha k group se pm bna hai india ka support kro inki idk man looks tamer farmer protests identity create identity proud carrying wooden stick required inght time safety strret dogs thats good example selective amnesia didnt read guys hitting cars rituals yatra needs violence god gives better punya beat attacked car declaring gunda wood sticks self defence get attacked sometimes peiceful communities go search google gods sake happy gangster atleast wont kill hindus afraid muzlims convert behead bomb rape whats threat im sorry either see stick looking opposite direction wheres threat gangsterness im genuinely curious true see terrorist definition terrorism using unlawful violence intimidation civilians people think bombingthese people also terroristi use less word religious fanatics ruining shit everyone since religion bro ye boht dur se ate jate use sticks supports even done w har cheez galt nhi sochna chaiye people like actually dont know much religion mostly busy showing greatest devotee instead actually working improving character well deeds dont rationality protecting sacred water basterds religious procession people castes come together go pilgrimage eat together sleep together walk together gets termed gangster brainded person going pilgrimage wow btw incidents dont think kawads ever caused problem processions every year think ik scared lmao fyi kawads bahujan samaj trying casteist op lmao bet think pfi peaceful people rss terrorist org lmao religious guy even rw still hate people like bro get fucking job clowns like leaders specially pm responsible instead focusing education openly spreading hatred youth following love still notproud something parents love kids time proud root cause problems religion extremism abb obc boldiya toh abb koi ayega aur bolega jatiwad lekin inko reality samjh nhi ayega kair choro mai toh desh chordunga brahmin hokr befaltu ka hate le chuka hu bhout jaalte hai sale always suck example jobless people say religious see woman harass without fear bro never saw tajia holders bakra cutters skull cap terro ahm ahm like syndicate stone pelters wont realise live filth call lifestyle hahahahahhaha youd surprised much caste still factor abroad ive seen pretty evident follow religion skip parts arent really modern world worthy adapt best caste inherently crappy concept arranged marriage still fing common anywhere indians world ab urban naxals bhi gyaan denge even love marriage arrange marriage thing india dowry involves pratice even saw love marriages dowry taking place seems like religious procession usually happens end sravan sawan ka mahina month end devotees visit shiv ling put water foot intimidating follow orders go safely took hours cover hour drive last august original kavar religious believe small kg load idiots carry kg group boast hey carried much added much toxicity religion really insult youre saying pic act could shouting make everyone hear go side let us pass logic rip interestingly youre saying theres religious angle side road blocks pics start coming true well dowry different matter altogether ever seen real gangster imagine muslim family driving thats gangster like chichorey tapori yes seen videos assaulting police officers destroying cars bad apples whole orchard reason goons operate like protection police government give try find religious group without heavy police around bhai sambhal kar rahiyo koi bharosa nahi inka mob lynching hojayega rip aryan mishra gangsters terrorists easy run know savarnas oppose feeding eggs meat poor kids iss desh ke log education employment par kyu nhi bolte root cause corruption ever cheated school exam completed work yes dont right ask good roads traffic management find people never done bad thing lives form govt fix dont like people find muslims swords safe unfortunately believe god much otherwise god really existed whole heaven hell concept fools would first thrown hell suffer rest life god really existed depict god god probably hates god literally go anything hinduism preaches hindu agree majorly broken semi broken homes abusive drunk fathers funny thing get donations support educated people well fuel hatred none sponsors never send child run march yell others excuse saving god saving hindus saving india really saving anything still better sitting road asses blocking try touching see guys carrying stick well yall empowered behaviours particular past years might well experience kind follows teachings random baba islam tells us follow law land processions disturbing peace others isnt islamic practice ideal mean scientific curiosity habit questioning things critical thinking lack education make goons meant shia sunni lets see love land hinduism send borders haha questions holding danda religiousritualistic significance using protect using intimidate others someone gets intimidated unnecessarily whose problem anyway atleast arent muslims terrorists way going achieve get gold coins stupid pepole trying cool even think twice something wrong wish understood adorably stupid looks rest world ladies gentlemen anpadh kuposhit gawars world right front istg need jobs country looks like kaavar yatra sure person posted high always hate hindus people come streets muharram knives shelves show blood shed around people busy sucking partners puydck god help doomed modi one guys younger research idiot kanhaiya lal killed live chattisgarh seen happens muslim festival kids knives hindu festivals stine pelted happen idol taken rivers later people news gov claim due dj lour noise bro government bjp mostly police give protection cycle cant blame one side needs stopped question one trusts thing happened going car kawad yatra going behaves like gundas letting vehicle go take showing lathis danda traveling bikes showing bigger u u follow order bahubali road driving rashly becoming threat peoples one thing ur car touches become violant beats u road total damges ur car fuck happening society danda pakadne se koi gangsters nhi ban jata true hindu extremists wont exist muslim extremists didnt exist lol fair enough dont atheist force religion others agreed tbf scientific temperament didnt exist even congress power wasnt back bjp going backwards idk man dont think bjp worse congress thats personal opinion see party getting triggered superficial things like non vegetarian food place worship superstition bunch backward practices mostly come bjp sure believe want believe minorities vote congress yeah majority majority ideally yes congress loves appease minorities doesnt change fact bjp influences majority countrymen exactly youve mean islam much hate isnt needed agree creates problem traffic frustrated us dont criminalise see first instance stick keep mates limit line cross middle road intention isnt intimidate someone yeah mob things escalate stop looking way government couldnt mobilise zeal passion unemployed hence find reassuring satisfactory religious hardships arent brandishing weapons like swords aware causing hence looking passing cars keep check holding stick hands never intend create law order problemim talking majority people political supported goons remember watching kid school bus thinking cool go trek around country get food work later realised cycle poverty clinging onto religion remember watching kid school bus thinking cool go trek around country get food work later realised cycle poverty clinging onto religion gangster dont degrade word gangster pests living abroad since saw one protecting churches hater converted ramdika true things wouldnt get better congress kind influence either luckily dont neither followers stupid congress members minorities diehard gandhi family fans theyre pretty stupid minorities obviously nope minorities want live without getting lynched sangh sane ones yes minorities want lynch hindus though supporters muslim parties christian terrorists etc sane bjp supporters well like christian terrorists lol youve brainwashed sangh might sane one pm modi orchestrated gujarat riots bbc sanghi source agreed problem exists north east claim christian terrorism doesnt exist india objectively false pm orchestrate riots defence havent riots since lesser riots bjp rule congress rule bbc sanghi source well ill give legitimate close sangh done india pm orchestrate riots defence havent riots since rapist says raped never thats alright im surprised fact admitted actually orchestra riots still went ahead voting still call sane bjp supporter sane back enablers riots rapes murders lesser riots bjp rule congress rule objectively false far riots religious attacks sangh came power something little eating beef get killed feel scared people streets swords ever heard edappal ottam rapist raped rapes earth stopped ever since feel sorry victim things objectively better bigger scale things political parties enable riots rapes murders im going need source riots since bjp came power yes vigilantism getting hand blame courts bjp people gotten impatient slow courts takes years get justice justice delayed justice denied rapist raped rapes earth stopped ever since feel sorry victim things objectively better bigger scale things fucked take justice wasnt served youre relying fact perpetrator also sets wrong precedent person sees commits rape says wont beyond even think cant held accountable pretty much country never progresses political parties enable riots rapes murders preparators usually reprimanded parties bjp theyre given heros welcome get feet touched bilkis bano case significant portion sangh praised rapists disproportionate bjp seeing kathua unnao hathras bilkis bano brij bhushan lot cases safely tell bjp turns blind eye also facilitates rape im going need source riots since bjp came power also simple wikipedia search see year many riots yes vigilantism getting hand blame courts bjp blame government stuff cow vigilantes issue people cant tolerate different ideologies culture resort violence prove point people gotten impatient slow courts takes years get justice justice delayed justice denied ironic say since previous paragraph literally said rapist commits rape never youre fine person let go situations like modi orchestrating riots youre even fine pm tlp indian version looks like orange squad protest travel many forests night thats carry danda scaring animals",
    "light_cleaned_title": "Modern Indian Gangster",
    "light_cleaned_selftext": "> Traveling from Ayodhya to Lucknow > Suddenly, these RELIGIOUS GUNDAS show up > Holding a **danda** like they’re some kind of gangsters 😎 > Flexing hard, Saw them using their Danda in 3-4 vehicle. >Even police doesn't use danda on car. > No one dares to mess with them, crowd's too big and intimidating > Can't do sh*t. > Just another day on the highway...",
    "light_cleaned_comments": "Are they terrorists or rebels ? No scientific temperament in this country BJP, VHP, Bajrang Dal all wants you address now Gundas, mobsters, hooligans. The riff-raff bottom trash of a nation wide gangster organization. Depends upon the side you are in state sponsored thugs Go gta on them bro We need Selmon bhoi now💀 the amount of time i feel scared by their presence is insane, these are boys who are usually from middle to lower class houses, with no faith or an identity, hence they join these kind of herd and think they are contributing towards something. the worst thing is they are weaponised, extremely, and a single offence to them can lead towards your death. they are extremely scary, vile, and often creeps too Only if Gods could speak Wow can't you give yr life for Hindu rashtra ? lol Very well put! Wow Respect for Selom bhoi 💯 Channel Your Inner Selmon Bhai and Blame it on them ! Terrible I am wondering if you will do the same to the others Yassss I am not racist man I hate all of them What! Bhai kuch hua kya gaadi ko? Ya apke aapko bacha liya? (Genuine) But realistically, one jacked up gym bro is enough for all of them. How much damage can you even do with twigs. In the long run the imbeciles from both sides Muslims and Hindus will gain nothing and their lives will be a total waste because they are so drunk on religion they won’t do anything for betterment of themselves or their family so in a way i pity them it’s the educated and well off people who have similar mindset or ideology worries me. Very astute observation Rebels usually have a cause and aims. These are just thugs. 🎵They not like u/s This one is just potent without an omni They have to exist for that What does this have to do with scientific temperament? Welp! Time for lifelong prison/death sentence. kbhi tajia pe ghar se bahar niklo Which organisation do they belong to? Yeah I can't believe they were randomly hitting cars and people weren't doing shit. You seriously underestimate the power of a stick. This is why politicians want to play the religion card all the time while the loot the fuck out of every indian institution and leave the middle class to go pray for food Don't forget the Christian terrorists in the North East! Wait till you will witness Islamists mob like Bangladesh Oh really, so you're calling to murder innocent people... I hope police takes a note You're a Hater with bad ideas 😡 GTA is not all about murda man. lmao why you people have to bring islam everytime in equation when theres talk about hindu mobs? yeah yeah im sorry there wont be 'islamist' mobs in a country that is saffronised through hindutva Same happens during Muharram Now say that to Khalsa's carrying swords or muslims carrying sticks during Muharram. As much as you hear shit on news, pointlessly calling group names would rile them up. This arrogance alone fuels people to hold their believes even closer. Ye muslim or hindu ke extremists na hote toh accha rehta life peaceful x100 jati False, Don't blame every Kanwar group \"Ye saala bahut aage jaayega\" . . . . . . . . . . . . Mera matlab Jail muharram happens once in a year (or twice, idk) and khalsa also happens rarely, and they are both done for religious purposes, and you will ever, rarely hear them threatning or klling anyone. h*nd* mobs have klled and thrashed people way too much, this is not arrogance level. these people are often out in mobs, if you live in north india specially UP you will know how nuisance they have created Dharam k terrorist Yeah I agree and people who don’t understand and accept this fact are living a delusional life. I just can’t bear it when BJP seeks refuge in the name of patriotism or religion and Congress is not too far behind, they do the same shit in the name of social justice and equality so basically we are screwed and India is creating more political zombies. Stop livinh under a rock. i think you replied the wrong person You need to have his resources as well. If not for his social standing in his own case would be stuck in the aching judiciary’s backdoors. But boi got clean chit in the eyes of non-biological. nice try, I love my life, I will not take any baits! Let's not forget why majority of them actually join 🚬🍁 This happens almost every year in Thane Maharashtra During Janmastami as these guys are in a large group there is lots of intimidating and eve teasing. I remember I was with my sister and there was a kid maybe in 9-10 grade passing sexual comments. He only did it as it was a group would not have balls to do it otherwise. Exactly they are what brown army was to Nazis Beneath their hooliganism, I see a total lack of awareness and - quite ironically - malnutrition, which should tell you exactly where India fucks up its priorities. Whenever I see these mobs I get scared They are capable of horrifying violence. And I am a Hindu. Joblessness is the main culprit Sticks and Stones make them barbarians. Gangsters wear suit and use guns. I have seen in movies. Nah that’s not the only time they use it, remember kanhaiya lal from bhilwara rajasthan ? Rebels require you to be against a system. These goons are supported by the system. They are nothing but a semi marshal extremist faction meant to flex religion and state muscle I still remember muharram processions the first time I saw it I was traumatised, was so scared can’t even- Pata nahi bhai bhajrang dal abb bramahan ko bhi marene lag gayi hai kya pata do din baad yea mandir mea jake Murti hata de Just shows you how much education can change a person. These poor chaps don't reason or challenge any superficial facts spouted by their leaders. Please educate yourselves about morals,religion,codes,society,etc. If these people had a tiny bit of critical thinking, they would be crying themselves to sleep every night thinking about how they behaviour affect others like in OP's picture. Educate yourself and hopefully others too. Perfect observation peaceful peaceful religion karte rehte kuch to sikh lete us peaceful religion se bsdwl Yes so truw..these fukers gather every friday and do randome shit on roads parks and what not Great observation 👍 Can someone give context? I am not from India. Who are these and what are they doing law and order is joke in this county Every morning I go out for walk with a stick. Damn never knew I was a gangster. Some time it lead to accident due to such action Reminds me of that scene in Derry Girls where Claire's family tries to drive through the Orange March by Protestants - except this is much scarier. Let me put it here before someone drags Muslims/Islam here as usual - Pagan obsession of Islam represents their deep rooted insecurity and lack of faith. The hatred is nothing but fear and survival mechanism which stems from intellectual bankruptcy, lack of understanding of Islam and especially lack of a strong faith in their own beliefs and Gods. They are more prone to gravitating towards Islam once they decide to gain actual knowledge beyond propaganda than the an average Hindu who is driven with faith than hatred against other religion. Carrying out a religious yatra is within the constitutional rights it does not make anyone gangster Idk why people are downvoting it was personal experience rather I should say trauma😔😔 😂😂 Crowd has no face!!! In a crowd everyone becomes gangster this implies to any and every crowd Inke saath rajat dalal ko bhidado In india, people respect who has the bigger stick. Brandish an automatic rifle infront of them and watch them scatter. Its not a question about who is right or wrong, or rights and duties. I don't think they are from middle class. Middle class boys and girls have incentives to try and improve their financial condition. They won't waste much time in this shit. I guess they are from middle lower class to lower/poor ass families. They need a sense of pride. So this becomes a sense of pride for them. I wonder if thier parents are equally violent or not. The former. They aren't rebelling against anything. They think they are but they're not. If they were you'd see fewer issues in the country by now. Everything. This has reached a point where something as silly as beef consumption is considered to be a reason for cow vigilantes to murder people. Anyone with decent scientific temperament wouldn't even think this way. Some of the greatest scientific minds throughout history have all questioned religious practices that are absurd. No one with scientific temperament would ever keep religion as their top priority outside the 4 walls of their house. ...and paw paw has the biggest gun ! I... Wait... Are you the Nazis in this situation? That's the funniest part. It's sad people won't know in the end there is no God. What they could've done during their lifetime is practice what they believe within the confines of their own lives, places of worship and house. But no. They won't do that. lets be honest, I see naive and ill advised young citizens. We talk about Brain Drain into foreign countries while half of them end up like what we can see here. Reading the comments on this thread I feel a liitle comforted to see so many sensible like minded Indians voice their opinion. Religion as we all know is opium for the masses & sadly in India the 'addiction' is worsening. So even though India might be improving its GDP numbers & becoming an economic powerhouse...is it really progressing at the grassroots level?? nope, you can’t generalize all chuslims as terrorists but you can generalise all kanwars as gangsters NEVER underestimate the strength of mobs that can go wild. Off-topic, but this is similar to [pack of stray dogs that attack and maul people - like the recent story in Bengaluru](https://www.youtube.com/shorts/sYgeubhPkyQ) Didn’t some BJP guy beat the [shit](https://indianexpress.com/article/cities/lucknow/bjp-up-kanwariyas-muslims-police-9547584/) out of some hooligan kanvariyas just this week? I mean how does one even confuse a group of orange people with Muslims? (Not implying actual Muslims should be beaten up)… People are just commenting, when they see safron clothes, taking their preconceived perception. Some of people that I know attend this kavad, this are some of the best people I know, careing,humble and helpfull. The people that are front and back carrying sticks guide traffic sometimes they may obstruct traffic, which is wrong, apart from that I find no problem in above photo. This is called self protection, there are many incidents where stone pelting happens, I am not justifying this but this is the reason. And now it's cyclic you can't blame one to throw stones and one to use a stick. BJP call themselves hindu party but they are not, they did not provide any type of protection during hindu festivals. No changes in old rules Temples and land donated are in gov clutches, often misused by gov Now BJP is crying over WAQF board but many does not know BJP is the one who made WAQF more powerful. If you give benefits to one community donyou really think anyone will give up ? Just like quota system ? BJP absolutely did nothing regarding the Bangladesh border, now saying they need NRC after letting illegal people come to India, you really think indeginous people will tolerate ? This will cause hate in both community. BJP can fix almost most of the things but they choose not to do unless election time, it's like people of India forget so better not show their cards, show it one by one during dire need. We are in dire need of healthy opposition who need to raise the right questions. Idk about UP, Come to Maharashtra especially in Marathwada region you will find more big kawad than this, like the other guy mentioned this guys belong to very lower middle class OBC families they usually work under political leaders this is their high time to show up Subhuman trash, no life no money no joy so they engaged in this short of shit to escape from life kind of like modern day \"Opium of the masses\" My pet dog got a life better than them, good food, good lodging heck even a medical attention when they fall sick which those things will never get in their miserable life. Walking barefoot in religious procession They had to become like this for several reasons. As long as you are not wearing orange clothes even with gun you are not a gangster. In Bihar, we have this Kanwar yatra of 110km approx. Don't think others face similar issue as government have made seperate route for 90% of journey and for 10% we have seperation between road, which I have seen people following without being GUNDAS. As a Muslim, this really scares me. Even if they do not have such intentions, they are becoming stereotyped, similar to what Muslims have been facing because of terror attacks around the world. Kabhi itni taarif ram navmi wale din pathar fekne walon ki kaar dia kaar , Saar tan se juda pe aap kha hote hai janab , mahuram , bakra eid slaughter they didn't even throw anything on your vehicle and they let u pass by giving u aside still they are Gunda what about you spitting shit on social media about anything u need .... all are potential rapists It's not that deep bro... We hate u because the moment u gain substantial numbers u try to kill every minority left right centre ... And if someone reverts back u claim to be victim They always behave rudely on the road Skull cap with a bomb is also for his self protection bro This is hindu terrorism, these pictures created bad effect on our hindu community! Just be proud for your religion, u don't need food, you don't need money for basic facilities. Let your hate for others feed and satisfy you. Same bro I feel shit scared during Muharram processions as well See the downvotes and understand that no one can be wrong except the hindus Pick any one of them for a one on one fight, let’s see who actually is malnourished, that’d be fun 😆 No one did anything they just saw a bunch of people wearing orange and felt scared Haan bhai Muharram ki tarh hi toh hai ye? Model state is modeling under vin ghaslet raj. Bhai hindu hai toh wrong hi hoga... Muslims road block krke namaz bhi kre toh shi rehta, Sikhs sword carry kare wo bhi theekh rehta hai >[Comment](https://www.reddit.com/r/india/comments/1f9hhpn/comment/lllwne5/) by[u/Better-Jury-2782](https://www.reddit.com/user/Better-Jury-2782/) from discussion in[india](https://www.reddit.com/r/india/) See this, People posting on reddit are likely to be at least middle class . But you can see the mentality Bhai muslims good hindus bad ye kab sikhenge aap What even, is this mindset BJP has no idea of law and order. LOL. North India is going down the drain. I am sure, man. But we need to work towards getting rid of these. Its not helping anyone or any religion. Exactly! If they could, then also they would abhor what they are doing. Mahadev is an extremely patient god mostly. He is pleased with less and doesn’t condone whatever these guys are doing in the name of Kanwar yatra Money Channel: TG-@CLUB1697 😂 You mean the people whose homes and churches are being burnt down by the Hindus? whose women are being paraded naked by Hindu men? Right they are the terrorists in this scenario. Based guys, doing God's work in keeping investments away from UP The end up being tools and manipulated and they realise this in their old age but by then it's all too late. They are just like bees. Just prick one others spread to attack without knowing reason. Just maintain distance. this happen when your parents didn't tell you any thing about this Kavad yatra . If you are from other religious the n i am sorry it is not your problem There is some psychology behind it. More than often these are absolute cowards on their own. So if you are ever in a confrontation with them, pick one guy and try to beat the ever living shit out of him, others will most likely freeze The reason for the majority of them to actually want intoxicants is because their life sucks and use these as an escape. The bigger problem is the population being so poor, youth not having any jobs etc etc. You are missing the point completely. They might defeat any of us in a street fight. The point is that there is a high possibilty that their strength and brain power will not be used for anything that will contribute toward the development of our country and the world. Totally ..the goons .. The facy that you consider a persons ability to fight to be a parameter of health explains exactly what is wrong with this nation. orange ***IS*** the new black Kya bhai pehle pata karle kya hota fir gyan pelena honestly though, nothing scares me like the colour orange these days. hindutva has made it a colour of fear and terror! Running over hindutva fascists is not only morally justified, it is also incredibly satisfying. I hope the same comment goes for peaceful community too 😅…. Who are displaying their peaceful gestures all over Europe and other parts of world. Peace to WOKE people 😂 Why so Anti Nasnal saar /s Where is selmon when we need him the most /s It give them some.sense of belonging and a goal They are the new terror sensation with JSR being their go to slogan. Atleast they are better than the gundas who throws stones🤡💀. Aa jao congress walo gyan dene 😂 Lack of awareness is not something I would say they have as they know impunity and enjoy it. India has turned its dividend of a large, young, able bodied demographic into a catastrophe of uneducated/poorly educated, underemployed, malnourished young people with no moorings in the present or hope for the future. They don’t know shit about their religion, they are just following the herd. r/angryupvote They're going to assault him!!! Indeed, they are the ones raising \"Sir tan se juda\" slogans everywhere Beautifully written 🥹 These skinny guys will be the first to leave the battlefield if war ever break out with.. say China. And those of us called Anti national would be at the forefront to defend it. We fought the British and we will fight others as well in future. And chaddis will support the enemy, as always. History repeats .... Yup, you won’t expect these clowns in Japan. Ik buddy . Ik they are cowards. If they had balls they’d not lick boots of the same mughls/british/ post independent congress govts/indira gandhis emergency congress etc . Thats what they do, the lick to survive. Do one side’s violence to put others down. If there ever was a two way fight, these jokers would run to save their hide. COWARDICE is a generational trait Whatsapp university gyan. How many have you seen people of such description? I bet none in all your small teenage life Yeah. Many such gangster families. Any long religious procession should be banned. I believe even if there were enough jobs through some miracle, these people wouldn't be able to secure one lol I mean, if you’re starving, it’s easier to find comfort in religion and then you can say it’s upavasam True. But also, the lack of awareness towards this. They don't have life goals or are not aware of it. The ecosystem around them makes them concentrate on this religion, Hindu Muslim, us vs them. If these people someday woke up and realised, that politicians used religion for their use and they didn't get anything. In a country where farmers protesting corporations are seen as terrorists but these are peaceful religious attendees. These people need to get a job Terrorists Just like any other terrorist camp Exactly, If they had hope for their future they wouldn’t be doing this. How are you so sure about that, that’s some nazi level stereotyping. Many of those will go on to great colleges and universities, and go on to get good posts in good organization. This, I am not stereotyping but sure about it, as I have also completed Kanwad yatra after my 12th class with many of my friends and We all are doing way better than many. 🐏 them wtf is the “brown army” are you talking about brown shirts ?? the stormtroopers ??? be clear because you’ve called them the “brown army” like they were brown ppl and that’s why the person below has asked the q like they are so confused Atleast this is far better than the 'JACKET' boy Don't forgot religion is one hell of a drug too Great comment Care to explain?? How come it is wrong with the nation?? The guy looked at their frail figure and passed a judgement that they are malnourished, so, a frail body isn’t a malnourished body, I can show you obese people with a battery of malnourishment. See bro, I don’t know what is wrong with the nation but there is definitely wrong with stereotyping nazi pigs. people whose passing by are with their cars, are brave But they will harm people minding their own businesses. Nope, time and again we have seen that the fire of hatred spares none. Recent example of that Mishra boy killed by \"gau sevaks\" or whatever they call themselves. They are terrorists and jobless. Plain and simple Ohh definitely this is Hindu terrorism. Fuck them! We can only feel safe during Muharrram procession. It's a mob at most That's why, I always keep a Indian billhook with me in my car, ALWAYS. Shows clearly that politicians are winning.., brain washing works.., I meant Brownshirts I should’ve been clearer. Thanks for clarifying. Lot of middle class people do pilgrimage and kanwad yatra, I being one of them whi went along with 11 of my friends. It is a spiritual experience walking across the country and meeting people from all walks of life, I met a guy from sonipat who was well to do and rich. People stereotype kanwariyas as poor and uneducated because the way they look, they wear simple saffron clothes and seem frail, poor and tired because of the long treacherous walk. The fact is Lot of poor people go on this pilgrimage but many of them are middle class and rich as well. Send them to border to defend the nation and see how they come running back to their Mommy Also all desperately seeking love, sex and touch. If you wanna run the Muharaam argument then that shit runs for a day. These chewtiyas occupy city roads and highways for entire month and are a public nuisance. He wouldn’t be feeling very gangsta in America with a stick. Yet if their moms or aunties caught them, they'd cower from the wrath those women would give them Need some context please…who are they? And why have I seen so many videos of them destroying cars on twitter? Do you hv guts to the post the pics of real one’s who behead people for no reason just becoz it is like cutting vegetable for thm I know, but not in a way these intoxicants work on your brain. These incite chemical processes in your brain to subside pain. Or maybe it's me and I don't know how religion works. Yes! Same kind of scene I have seen while muharram tajiya are happening..!! Goons are everywhere.! Isn’t it? Yes! Same kind of scene I have seen while muharram tajiya are happening..!! Goons are everywhere.! Isn’t it? Hideous hooligans That's why we need Allah. Come to Isla m >Many of those will go on to great colleges and universities Press (X) to doubt Gonna see more of this in near future ig, especially when the Central Govt is on that side Faith has nothing to do with it. People with faith persecute and kill for stupid reasons Lower and middle class OBCs are the foot soldiers of the Hindutva project. Yeah the same thing is happening from the other side as well, you thing the Christian are the victims? Open your biased blindfold Brain drain to the West and brain death here Waiting for a post on Islamic Terrorism. Oh wait that's happening from many many decades but people don't have the balls to call it Islamic Terrorism because Terrorism doesn't have any religion correct? Stop this hypocrite behaviour. XXXXXXXXXXXXXX Sometimes it hurts to listen and see these pictures and comments, when me and my cousin go for कांवर , we all walk on the roadside , not doing these types of extra irrespective things . Nowadays all these become fashion or a type of joy not a sacrosanct prayer. Indeed! Very astute one might even claim ******phobia immediately after skimming through the words! Shhh. You are being far right now In 1975, a compulsory sterilization program was introduced by then Prime Minister Mrs Indira Gandhi, so that Indian Citizens of India do not have to come across such items on streets of the nation. Owaisi Bhai..... Real ID me aayiye I could be wrong but holding a danda is part of the procession I think What about muslims who block the road and pray…bet u dont feel they are like gangsters😂😂😂 Islamic terrorism is obvious thing, terrorism is related to islam, but as a hindu I don't want my religion become one face of terrorism. Classic r/india post. Peaceful religious walk. Our country is ruined by religion. And it won't become, and it will not become, because people don't support this kind of processions. Like they are blocking roads, playing heavy base music that too at night, and more importantly causing problems for ordinary Hindus like us. We don't support this kind of shit and nowhere in the Vedas it's written to blast music with full bass and go bonkers on road to please Mahadev. अशी महिना भर चालणारी कावड यात्रा कुठे पहिली, मी ही मराठवाड्यात राहतो कधी पहिली नाही. सगळे कार्यकर्ते हे ओबीसी समाजातून येतात हा जावईशोध कुठून लावला आपण? I wish someone just goes bonkers and runs a SUV over them. Nahi Funny how it's only people following Hinduism that keep investment away. 🙂 What the hell did he do to you to even consider him a gangster?? And let me tell you why that danda is for. I live in Mumbai. We were walking towards Shirdi and I saw with my eyes how padyatras are treated by so-called elite car owners. I had a group member killed by a truck in daylight while going to Shirdi and the worst part is the truck did even stop and the truck driver was never caught even after FIRs and what not. Hence, now padyatries have started to use danda. Jain's yatra, Buddhist yatra and many more hire men for safety or keep dandas while waking. It always feels good to sit in an ac car and lecture the world when you don't even know the truth. I’m sorry, but we shouldn’t assume that only middle-class or lower-middle-class people are involved in something like this. The perspective feels privileged. Many educated and well-off individuals have been responsible for some of the most heinous tragedies. I’m not trying to call you out or anything, but it feels necessary for all of us to change this mindset. More like bullies. Yeah I agree the \"Hindutva project\", is more likely a vote bank Reddit kangaroo court assemble. Gang gang survival is the cause cause others are doing the same even tho they are in minority For every group of terrorists there will be group of gundas. Terrorists is a threat to the whole nation but yet people have problem with them only the privilege class is the one dominating these people. you wont see modi and yogi or anyone lavishly living in their house going on their street, but support them. the whole goon culture is endorsed by the privileged themselves, but they often dont come to the street and do this. why are you seeing my comment as a stereotype? every class participate in different ways, its just that these kind of mob culture, most participants are from middle to lower class. Still better than , beheading an old man in broad daylight Kon manhe \"mahina bhar chal na ri kawad ??????\" Ani \"karyakarte\" hya shab da cha prayog mi kuthe kel aadhi mala kalva mag mi tumhala जावईशोध कुठून लावला he sangto Varkari are good people. I never felt threatened by them. And I never heard complaints. thats not faith Can someone be so kind and help a clueless European understand what is happening there? I apologise you sir, I didn't mentioned Varkari, yeah indeed they are good people infact they are the one who follow pure religious rituals and practices in a way that everyone should follow the OP describes some teen guys who acts like gangster or try to show rowdy nature under kawad yatra I am talking about this chapri goons Those people that go to other countries also become extremely conservative for some reason. They cling to their religion and caste like they are life jackets. Yes, but why? I feel like the middle class and lower middle class have become everyone’s punching bag. For someone who has actually grown up in a slum, there’s a reason for this. There’s no hope. You see people around you struggle every day, and you’re filled with rage. The system is designed to keep you there. There are no good schools, hospitals, or even toilets. There’s no dignity in being born, living, or even dying. You witness all of this and are just angry I suppose. Then, they misguide that rage. Again, please don’t take this as an attack. My point is that there are more nuanced layers to this. A blanket statement like that does nothing but spread more hate. great now people just walking have become gundas and what have they done wrong by having a danda in their hand the walk for 100s of km and they sometime need it as a walking stick sometime to scare off stray animals ... ohh but no... they are hindu thats why they are gunda...... great observations everyone if in Nuh a horde of mob showers rocks over normal guys on road then they are no gunda but some people just walking are gundas XD i did point out in my comment..that theres less of faith, hope, an identity to relate to, deprivation and so much. that being said- what makes indian lower and middle class unique is also a huge variation in their cultural and political prefrences. idk why are you conducting that im spreading hate even though you agree with me as well, im just pointing out that political extremism in this country in weaponised form comes from those whom the system mostly fails. it is sad, it is not my rage Owaisi bhai visionary hai. India’s per capita will be of a developed nation with 25 crore population If that’s what you’re trying to say, then I’m sorry, my bad. Wait until you see real gangster holding knives and shouting STSJ, but that post will never see the light of the day on the sub. So for now I will assume that this is the most extremism India has faced in the past 5 years. Naming someone without knowing or understanding is a fashion I suppose. Most of our urban youth are out of touch of their own culture. They only know CNN, Netflix etc culture…pity Some of my Hindu 12th class friends are karyakarta for bjp all middle class one of them even booked for attempted murder this year Not terrorist .. they shout something else before blasting ✌️ It's all a vicious circle, more nutrition leads to higher IQ. This helps a lot of people to go to college and independent thought. Lower IQ people are easier to manipulate and more susceptible to propaganda. It's a vicious cycle. Can’t name them as “religious gundas”. People who actually follow religion, do not indulge in stupidity. Let it be hinduism, islam, sikhism or Christianity, people who claim themselves to be the so called flag bearer of religion, in reality, are the ones who are farthest away from the very basic ideals of the religion. Disposables. I’m a Muslim and I call for it to be banned. I just feel that these people don't know shit about religion all they care about is how to gain fame and power and crush and suppress others As a Hindu I am really ashamed of these people Some will abuse me , but really do these guys even pray or have ethics because I don't remember carrying weapons like this is needed in a highway even if u say self defence Mai kuch nhi bolu ga U should be thankful these are sticks not ak 46 and swords. Yaha sab Gyan chodne sa jaate hai. Ye ek dharm ke khilaf nafrt phelana nhi hai 😂 Strange, that you didn't click their pictures while you \"saw\" them *using* their dandas. And they are not showing up suddenly this is called a rally it does not have a teleport ability of this magnitude. Hope you farmed sufficient karma though. :) I’d be happy if Muharram procession is banned. I’m a Muslim. Just what we need to keep the other herd in check you can cry all about feeling unsafe but when the roles are switched you people will not even acknowledge it let alone condemn it Terrorists Idiots are those who post like this shit. What if you go somewhere on the highway. Won't you try to be safe ? Or anyone can run their vehicle on you or if you are with your family members on highways do you not try to keep them safe 🤡🤡 Yes but please also mention what Muslim majority countries have done to their minorities. Neither is right, both are in the wrong. I feel multiple countries would behave differently towards Islam if Muslims didn’t have a “we are right and others wrong attitude”. The attitude isn’t the problem, it’s the violence that has ensued for millennia as a result of that attitude. Again, this goes for everyone, not trying to single out Islam but just trying to hopefully convey to you that nobody can cry victim, when everyone has blood on their hands (some more than others but not the point). wo gunda nhi wo bas car and bike walo ko side kar rhe hai wo koi patthar nhi fek rhe hai toh religious gunda ya kuch mat bola karo jo patthar fekte hai uske bare me bolne ki himmat nhi hai teri All religions are fucked up but some are more fucked up than the others . Cameraman - modern Indian pussy Labourers who work daily for long hours might be physically stronger but many of them would be malnourished. Strength doesn't necessarily translate into good nourishment. XXXXX They don't belong to a reserved caste, at least. I saw kavariyas eating gutka , spitting everywhere, no civics sense, using vulgar words to each other loudly in front of school kids . Fuck these assholes, mahadev should open his third eye and burn these bhakti asses. This is kind of biased i think, all year you could run into a much more violent group of wedding goers but kawad is pretty much limited to one month a year, however you will see them at any time... Just give them their space on the road, it's theirs as well as yours... If you're close enough for one of them to hit your car then you're probably driving too close to them and trying to use your vehicle to move them out of the way... They are people not a group of buffalo. Getting too close for you means a dent in your car but getting too close for them means a broken foot or leg. I'm saying this as someone who has done kanwar yatra from haridwar to Delhi as well as dak kanwar from haridwar to Kashipur.... These are not groups of thugs but people that are walking 30+40 km a day in the heat and are tired of people trying to crush them while they drive by in the ac.... “Patriotism is the last refuge of the scoundrel.” This phrase fits them perfectly. This religious nationalism has given all these low life unemployed losers and thugs a false sense of pride. They’re no different from Islamic thugs. Absolutely, they’re just ignoring real problems , similar to Islamic thugs. Someone,feed these gangsters,they look anemic. fwiw, they have always been alittle intimidating the way they behave on the road. For years, I have dealt with their hooliganism. The graph has risen quite steep in the last few years and they have been feeling more emboldened and justified in what they are doing. I'm not religious but I respect every religion and their right to practice it in our country but their has to be a decorum, standard for all, to follow. You can't uproot other's lives and day-to-day just because you decided to take up 1/2 of the road and \"allow\" the cars to pass. I have stood in traffic for anywhere between 1-4 hrs during kawar yatra or rath yatra every year and I can't begin to tell how it has affected my life, both professionally and personally They are gundas because they have danda. What about these peaceful peoples who walk with swords and stones? India becoming next Afghanistan soon run them over kyu bhai teri mummy ki mar kr chale gye the jo tuje inse dar lag raha h Perhaps you have never seen a moharram procession! Never seen a picture of people from a certain peaceful community praying on the roads and blocking traffic being called out here but ok! Idk, middle class has a lot to lose for them to even get involved with murder/politics. Not to offend you but you might wanna check if you study in a government school. Slightly better than allahu akbar gang That’s a lot of really small sticks to be acting so tough. “Speak softly and carry a big stick” Tabhi to mujhe koi specific group se dikhta hai main ddur hi rehta hun kya pata kab phatt jaye Can someone give context? I am not from India. Who are these and what are they doing Technically so does terrorists Bahahahaha walking on the road with sticks and thinking they're hard 🤣 People waste their time with this crap and india will become bishwaguru ? Aw man are you afraid🥹🥹🥹! I am sure you know this but the statement that Religion is the opium of the masses was not used in the context you have used. >Religion is the sigh of the oppressed creature, the heart of a heartless world, and the soul of soulless conditions. It is the opium of the people. Indeed, a similar case happened with me once I was traveling via Patna during some processions similar to this, had to take village roads due to nuisance. Idiocracy is at next level in this country irrespective of RELIGION. 🤦‍♂️ When young people don’t have any prospects, they usually fall back on group affiliation to give them a an identity and a sense of purpose. While they are reprehensible, it’s is society that has failed them and allowed them to turn into this. It's st.domnic sovious sr sec high school and to not see something that is real doesn't make less real sorry for truth if it hurts When you have never seen real gang then this type of stupidity is expected! Ok let me try. I am also not a South Asian but have stayed in India, Nepal, Bhutan, Sri Lanka enough to understand local customs, religions, problems, politics etc. Still, forgive me if I miss small details here and there. These are religious processions called Kawad Yatra. This is a continuous tradition of states along the river Ganges since more than 2000 years, where sages would walk for 100s of kilometers as a dedication to lord Shiva, offering water from holy river to statue of Shiva in different temples across North India. In recent years after freedom from Islamic and British rules this tradition has regained popularity and not only sages but also common devotees have started following this tradition, in beliefs of getting blessings from Lord Shiva. Mostly, male members of those families who had a bad year or two of problematic economic, health situation or death in family, take a vow to dedicate lord Shiva for the whole month, arrange a leave from their jobs and walk barefoot, eat simple vegetarian plain food etc, while visiting all major temples in the path. The one holding sticks are volunteers organizing the crowd march. Stick is their defense against animals like dogs, idiotic drivers, attackers from the Islamists, and politically motivated goons which is quite common in this part of India. Those attacking this procession here on this reddit are mostly from the Islamic community and leftists who are against the current ruling party and some non Muslim kids who follow one sided secularism blindly. Use of danda 1. kill snake 2. elders use it to walk 3. kawariyas use it to take 2 water matka on it. But as you trash, your ideas are also trash Welcome to orange bhaarat ya the sexual exploitation of females in corporate world is done by so called educated isro head didnt went to ram temple, or abdul kalam did not talk about bhagvat geeta? Interesting, thank you for sharing your perspective. These are gundas and someone chant a.........h hu a,,,,,,r and blast himself is a school teachers son Bloody hyppocrates It was a general statement bud. Might be rich to not really care about consequences? bro these people are just carrying a danda which they use for carraying 2 matkas. How did you judge them by this image? Some days back also kawariyas broke someones car because that guy hit the matkas which they were carrying from more than 100 or 200kms that also barefoot, you assume people will not show anger as well. If education really make a person good human being then why are there happening sexual exploitation in corporates? Why some very educated ones in usa are phe\\*ophiles. yes sleep on street he will be on the way what they doing in this image? ofcourse religion is\\[RELIGION\\] Abe jaa be lodu Maybe ultra rich You are almost or clearly an atheist, and i appreciate that. If you are referring to Pakistan and Bangladesh, then it makes sense but using that as a representative of all Muslim-majority countries is inaccurate, as many nations in the GCC, such as the UAE, Bahrain, and Oman, have historically hosted large non-Muslim expatriate populations, sometimes exceeding their local populations, and managed religious diversity peacefully. Similarly, North African countries like Morocco, Tunisia, and Algeria, along with Far Eastern Muslim-majority nations such as Brunei, Indonesia and Malaysia, have long histories of pluralism and coexistence with various religious communities. This broader perspective challenges the oversimplified notion that Muslim-majority countries inherently struggle with religious coexistence or violence. You guessed right. I think it’s a procession where devotees go to water bodies barefoot to fetch water to be offered to lord shiva on every monday of hindu lunar month of shravan no I mean they are not doing any weird thing which I can see in image. That danda is used to take the matka of water right, i think they are returning now. I am asking why this image was just takes and started fear mongering. Why does it matter if the ISRO head went to Ram temple? Or if Abdul Kalam spoke about Bhagvat Gita? Those are their personal beliefs and they aren't forcing anyone to believe in what they believe. I'm genuinely curious as to what your point even is over here. It's hilarious how very simple statements go through the heads of so many people. It's not that deep. Well I think Most of the time, Academically-declined (both education and behaviour wise) people’s desire towards power of authority attracts them to the religion. Their initial thoughts are to initiate authority towards religious people or people who want to avoid conflict. But their lack of sensibilities and education instigate the hooliganism, recklessness, terribly distasteful mindset. There’s not much going on in their life without this. While educated ones who genuinely believe and care about religion are with calm demeanour and respectful and responsible. Also, they mind their own business. They are seldom seen in these types of events. And, Yes This is quite true **regardless of the religion.** so people who gets settled in abroad should stop following their religion and should speak foreign language only .... nice I wonder if the same words would have been used for followers of Middle Eastern cults. Thank you for that, I was not trying to say that it was representative of all Muslim countries. I think I was more focused on the perspectives Honestly that’s true. We don’t have any evidence if they used the stick or not. OP could be exaggerating Its the SA, which was an organized brutes in the name of the NSDAP. They had become famous for beeing the strong arm of the nazis, harassing jews and fighting kommunists and other political enemys. They had been cut down in the end, forced to join other Nazi-organisations, because hitler felt endangered by the SA-leader Ernst Röhm. So those guys are beating up political enemys? Fair enough. Noble aims is a better phrase I guess. I can give several examples how cows were used as a tool by muslim invaders so that indian kings go backfoot. I mean if that was what caused *THIS* in their country…. It seems like a good idea…….yeah…. The whole planet consumes beef. Why is this even relevant in the current context? You've been stating things that back nothing up to your claims. The whole thing was about science yet you somehow made it about cows. [https://www.vice.com/en/article/us-america-customs-cow-dung-cakes-india-covid/](https://www.vice.com/en/article/us-america-customs-cow-dung-cakes-india-covid/) bro OP is trying to spread hate nothing else. Similar case happened with me in a new city I visited, my friend I was going on a bike ride at 10PM, he said look there there are whores standing there you can get 1 in x amount. Bro I was like ye pahle se hi manke baitha hai, ese to koi jake normal ladki to problem create kar dega. >They cling to their religion and caste like they are life jackets. People who got there through refferals from their caste or family will hold its value high I made 2 comments, the main comment got deleted I guess, it was long one, now cant type that again. Anyways bro look at your previous comment who brought cows first Yes muslims are way better, right? They protect us ? And it doesn't matter if all the terrorists are muslims we still believe them. and do whole planets eats pork also? or dog and cats? lol keep seething, muslims do nothing wrong in this country in comparison to these goons for knowing what happened in indian subcontient you need to know history. I am just tired of seeing how some people are completely ignorant sad thing is such people justify their actions in the name of religions Hindus( in kavad Yatra) saved me from an accident. Again why the stereotype of labors only being kanwariyas, my argument was not actually regarding nourishment or strength to be precise, i just highlighted that all of them are not malnourished. Hope you got it Im from Poland, seen a lot of these guys marching on my trip to India, can someone explain who are they? Now when you write it, I get it. You didn't say this in prev comment, that you mean to highlight that all aren't malnourished. Also I'm not stereotyping, mostly labours are malnourished so used their example. Like a bag of oranges Well I was reacting to this guys blind and blanket judgement of all of them being malnourished. Ofcourse 🙂 NRIs view religion as a connection to their home. Uneducated people view it as political tool. Hey, guys. How to increase my comment karna? shame on you “Sunday ho ya Monday, roz khao dande” Yeah the whole planet eats pork as well. I eat pork and beef as well. No, not everyone eats dogs and cats. This isn't the gotcha moment you think it is. You thought only Muslims eat beef right? 😂 Literally every community in India has sufficient beef consumers. If you don't like it don't eat it. Don't go around justifying killing people in the name of beef. BJP has never done anything to provide special protection for Hindus? Pretty sure hitting cars and bikes with sticks is damage to personal property The premise of my comment was to show religious indoctrination has caused a lot of issues with critical thinking. There are plenty of things apart from beef I can pick up as well. Tell me why it's relevant in the current context. I'll tell you why you're bringing it up. You're basically insinuating all Muslims are bad because Muslim invaders came to India in the past. Man it's so easy to see through your argument. Don't hide behind fancy words. You're trying to justify why you don't like Muslims. Just say it as it is instead of beating around the bush 😂 Exactly happened with me, I live in ayodhya and was going to Lko for some work and some of these hooligans were showing there dandas to the passing-by cars. Except white shirt, he might be the gunda boss, looks too well fed The chairman Mao philosophy! Keep 'em starving so that they remain stupid. Modi’s India. Where all mighty gods supposedly need to be protected by low IQ unemployed scum. I don't even understand why should one be proud of their religion or language etc. We were born into it as a default setting. It like saying I'm proud I have two eyes. yes too bad,safron gundas. ha hasan ho hasan Muharram gang is love. Why do they join? This is a religious gathering/ March known as \"Kanwar Yatra\". The Kanwar Yatra is an annual Hindu pilgrimage in India, where millions of devotees, known as \"Kanwariyas\", walk to fetch sacred water from the river Ganga. The water is then offered at Shiva temples, especially during the holy month of \"Shravan\" (July-August). This practice is to worship/honor Lord Shiva, and the pilgrims carry the water in Kanwars/decorated poles with pots. The journey involves walking hundreds of kilometers, with some pilgrims even covering distances barefoot. Local governments often provide facilities, including security and medical aid. These kids are really brainwashed by cult religious goons. Everything in the name of God blah The world would be a better place with these people removed..... Necessity is the mother of invention. If these individuals hadn’t been suppressed for decades due to THE appeasement, they would have naturally remained the cheerful and vibrant group they were meant to be. Lolz weak crowd of sheeps Hello Good My uttar pradesh is a sad sad sad story; hopeless the eastward one goes, me living at the precipe of where the sh\\*\\*t start to hit the fan; can only imagine what happens in such areas; there is extreme poverty with functional anarchy you have to be utterly vigilant just to survive. Is everyone from the yatra hitting people with sticks, there are some bad apples everywhere There is no prospect brother for them; both the major religions and major castes just wait for their turn at government to become the so called Bahubali that;s the best they can hope for in their life in youth and family and familial politics in middle and old age I feel you bro. Same feels as Muharram. Bro issue is (or rather the tradegy is) due to poor economic status their lives would amount to nothing anyway Tere kaun se makkan chura lia, jo tere ko itni jal rahi hai. Issue is (or rather the tradegy is) due to poor economic status their lives would amount to nothing anyway; this is just the anger venting route. Life sucks hard in UP and those with resources have to be utterly vigilant. Typical communist logic my friend 😁 Are you a funded person from congress or George shuru !!!??? Because you don’t find madarsa chap are teaching radical Islam (which is actually real) and spreading violence, rap, blasphemy chamche Yes sir here is victim card use it eveytime sir . I can see mass cult mob during muhorm time and ramzan time also when they ocupy roads and do prayers they block roads use high sound mix's daily such a sound pollution Wrong people dude they usually spread peace all time 🌚🌚💣 One terrorist spread so much peace she was elected to the lok sabha 💣🔥☠️ That's not possible. They won't be walking on the streets. I've never seen one. Ever. Gaadi kabhi bhi tod skte hai yeh log 😂 can someone tell what's the context of this image? That's radicalization in a nutshell and the government turns a blind eye How can u judge the whole crowd because someone has a danda in his hand . Also such crowds pass through our locality. During sawan and none of them harm anyone. Also during muslim festive Muharram theee is muslim julus and they dont even harm anyone. I can see guys like u are real problem for society. I run away from these people You mean fascists From protection I mean, security during festivals specially in areas where often 2 community fights. This looks like rebuttle for other community that involves in fights of an individual from the same community. If you ever observed that happening. 💀 >No scientific temperament in this country Just my opinion but I don't think them knowing all the laws of Thermodynamics would change much! God forbid someone follows a different religion 💀 Back in my day, bait used to be believable. And ppl will still call out Muslims who just want to go to the mosque every Friday just to pray. Kavariyas as gangsters.... Such a lame point, that's too for satisfying ego. Photographs itself says people are walking on sides and letting other pass, if sticks are we concerned then in India it's common to have sticks by guides when there is crowd....it is not for fight or to defend, it's just... Hopefully we need to know much than to just wake up from bed and start assuming 😉 What about Muharram then U need to be proud to become a foot soldier. Fight for your masters and stay poor for generations to come. Best strategy is to not be blind supporter. It's your job to criticize your government because the mass media has their hands tied. You are starving, it's ok. House has no electricity, no issue just use wood. No good schools, no problem just join whatsapp university. All these problems exist because people from other religions are responsible for it. Don't forget to vote for me next election ok. Tred Carefully ! Illiterate POS people That's what happens due to unemployment + hidden unemployment and low quality education plus. It's as they say \"an empty head is a devil's workshop\". I hope Indian education system undergoes some much needed reforms. Islamic thugs, Hindu thugs they’re all the same. now reverse the religion and dare speak on them Ok, This is really stupid, but I read \"gangster\" as \"gamer\" and seeing the picture I immediately thought of GTA 1. God, I hope I'm the only one. I see a guy on religious march holding a stock(probably in self defence or guiding traffic) that is not going to hurt a dog but see people here branding him hooligan, terrorist and what not. People here are acting like they own the country and guy like him should not have a right to live. Which type of Muslim? It's either this or we'll be the next Bangladesh. People have voted for this in the last 3 elections. What is gangster about this? They are on their yatra. Funny thing is y'all will justify every other road blocking and think this is wrong. You should be proud of your eyes buddy. So should you about yr religion and language. It's your identity. Hating it is hating ur own existence and showing weakness for tribal evil to prey upon. Just talk about North India, i belong to OBC but my clan is Kshatriya. In Kerala caste doesn’t make any sense because caste is literally inexistent in Kerala Isi tarha k group se PM bna hai India ka. Or support kro inki. Idk man looks tamer than the farmer protests 🤣 Why should that be his identity ? Create your own identity and then be proud of it. They are carrying only wooden stick which is required in inght time for safety against strret dogs That's a good example of selective amnesia. You didn't read about those guys hitting cars, did you? What rituals and yatra needs violence? Does God gives you better \"punya\"? they beat you ? they attacked your Car ? if no then how you declaring them Gunda ? they have wood sticks for self defence because they get attacked sometimes by peiceful communities ! go search on google ! For Gods Sake we are happy with these Gangster. Atleast they won’t kill Hindus. Afraid of Muzlims who convert, behead, bomb and rape What’s the threat here? I’m sorry I either see them with a stick or looking in the opposite direction. Where’s the threat or gangster-ness here. I’m genuinely curious True I see them as terrorist, the definition of terrorism is using unlawful violence and intimidation against civilians.. people think its only bombing..these people are also terrorist..I will not use any less word than this religious fanatics ruining shit for everyone since religion bro ye boht dur se ate jate they use these sticks for supports even i have done this w them har cheez galt nhi sochna chaiye People like these actually don't know much about their religion. They are mostly busy in showing off that they are the greatest devotee, instead of actually working on improving their character as well as their deeds. They don't have rationality in them. They are just protecting sacred water from basterds a religious procession where people from all castes come together and go on pilgrimage they eat together, sleep together and walk together > gets termed as gangster by brainded person for going on a pilgrimage wow btw other then a few incidents here and there I don't think kawads have ever caused any problem they do these processions every year but I think ik why you are so scared lmao fyi most of the kawads are from bahujan samaj are you trying to be a casteist op lmao I bet you think the PFI as peaceful people and rss as a terrorist org lmao I am a very very religious guy and even a RW still I hate these people... Like bro get a fucking job! Clowns more like it. Our leaders (specially our PM) are responsible for this. Instead of focusing on Education, they are openly spreading hatred and youth is following. You can love and still be not-proud of something. Parents love their kids and at the same time not be proud of them. The root cause of problems in any religion is extremism. Abb obc boldiya toh abb koi ayega aur bolega jatiwad 🤡 lekin inko reality samjh nhi ayega kair choro mai toh desh chordunga ( brahmin hokr befaltu ka hate le chuka hu bhout ) jaalte hai sale UP always suck This is an example of jobless people. They will say they are religious but when they see a woman they will harass her without any fear. Bro never saw tajia holders or bakra cutters with skull cap ... they are Terro.. ahm ahm ... 🤧🤡🤣 More like a syndicate. The stone pelters won't realise that. They will live in filth and call it a lifestyle. Hahahahahhaha You’d be surprised how much caste is still a factor abroad. I’ve seen it myself. It’s pretty evident. Follow your religion, but skip parts of it that aren’t really modern world worthy. Adapt, for the best. Caste is an inherently crappy concept, and so is arranged marriage. And still fing common anywhere we Indians are in the world. Ab urban naxals bhi gyaan denge...? even a love marriage is an arrange marriage itself ... the thing in India that dowry involves in this pratice and even i saw in love marriages ... dowry is taking place This seems like a religious procession. Usually it happens at end of Sravan (sawan ka mahina) month end. This is where devotees visit Shiv ling to put water by foot. It's too intimidating, you have to follow their orders to go safely. It took me 2 hours to cover 1 hour drive last August. And original kavar who do it for their religious believe has small 1-2 (kg load. These idiots carry 25 kg in group to boast hey I carried this much. They have added so much toxicity to the religion Really or just to insult you're saying it. Then where is the pic of that act. They could just be shouting to make everyone hear that go that side or let us pass. Logic rip. Interestingly you're saying it, then there's religious angle, other side road blocks pics will start coming, which are true as well Dowry is a different matter altogether. Have you ever seen a real gangster? Imagine a Muslim family driving through this. Thats not very gangster. More like chichorey tapori Yes, have you not seen the videos of them assaulting police officers and destroying cars? It's not just a few bad apples, it's the whole orchard. The reason these goons operate like this is because of the protection that the police and government give to them. Try to find any other religious group that does this without heavy police around them. bhai sambhal kar rahiyo koi bharosa nahi inka mob lynching hojayega. RIP Aryan Mishra Gangsters or terrorists? Easy run over Now you know why savarnas oppose feeding eggs and meat to poor kids. Iss desh ke log education employment par kyu nhi bolte ? The root cause of all this is corruption. Have you ever cheated in your school exam or not completed your work? If yes, then you don't have the right to ask for good roads and traffic management. If no, then you can find more people who have never done a bad thing in their lives and form a govt. And then fix all this that you don't like. And you people find muslims with swords very safe 😂😂😂 Unfortunately I do not believe in god that much otherwise if God really existed with the whole heaven and hell concept, these fools would be the first to be thrown in hell and suffer for the rest of their life. If god really existed as how they depict god to be, then God probably hates them with all that god has. They literally go against anything hinduism preaches. As a Hindu I agree with this Majorly broken or semi broken homes.... Abusive or drunk father's. Funny thing is they get donations and support from educated people as well to fuel their hatred. But none of these sponsors never send their child to run a march and yell at others. And their excuse, “Saving God, Saving Hindus, Saving India”. Are they really saving anything? Still better than sitting on the road with the asses up and blocking it. Try touching them and see what they do, guys here are just carrying a stick! Well.. y’all empowered these behaviours in this particular for past 8 years. You might as well experience some of it. The kind that follows teachings and not a random baba. Islam tells us to follow the law of the land. Having processions and disturbing the peace of others isn’t an Islamic practice or an ideal. They mean scientific curiosity and a habit of questioning things and critical thinking Lack of education make you goons I meant Shia or Sunni Lets see their love for the land and Hinduism, send them to the borders haha Few questions…. 1. Why are they holding Danda?? 2. Does it have any religious/ritualistic significance? 3. Are they using it to protect themselves? 4. Are they using it to intimidate others? If someone gets intimidated unnecessarily, whose problem is it anyway? Atleast they aren't Muslims *Terrorists By the way, where are they going? and what will they achieve after this? Will they get gold coins after all this? For these stupid pepole and trying to be cool they will not even think twice before doing something wrong . I wish they understood how adorably stupid this looks to the rest of the world. Ladies and gentlemen, the anpadh kuposhit gawars of the world, right in front of you. Istg we need more jobs in the country This Looks like a kaavar yatra, not sure if the person posted is high or always has hate for hindus. when people come up on streets in muharram with knives and shelves and show blood shed all around, then these people are busy sucking their partners pu**y/d*ck. God help you. UP is doomed Modi was one of these guys when he was younger. Do some research idiot. Kanhaiya Lal is killed by .... I live in chattisgarh, here I have seen what happens during, muslim festival kids have knives with them, hindu festivals stine pelted, only happen during idol is taken to rivers, later people news and gov claim it's due to DJ or lour noise bro why ? The government is BJP here mostly police give them protection too. It's a cycle you can't blame one side. This needs to be stopped but the question is how no one trusts each other here. Same thing happened to me when I was going through car and this kawad yatra was going on they behaves like gundas they are not letting my vehicle to go and over take showing lathis and danda while traveling on bikes and showing that they are bigger than u U have follow the order of these bahubali when they are on road driving rashly and becoming threat to other people's And one more thing is that if ur car touches to them they will become violant beats u on road and total damges ur car What the fuck is this happening in our society Danda pakadne se koi gangsters nhi ban jata 🤡🤡🤡... True. Hindu extremists won't exist if Muslim extremists didn't exist. Lol fair enough You don't have to be an atheist to not force religion on others. Agreed. Tbf scientific temperament didn't exist even when Congress was in power. It wasn't there back then but with the BJP we're going further backwards. Idk man. I don't think BJP is any worse than Congress. That's your personal opinion but from what I see the only party getting triggered over superficial things like non vegetarian food, place of worship, superstition and a bunch of other backward practices mostly come from the BJP. But sure believe what you want to believe. Minorities do all of the above and they vote for Congress. Yeah but majority is majority Ideally yes but Congress loves to appease Minorities. That doesn't change the fact that the BJP influences the majority of the countrymen. Exactly 💯💯 You\"ve Mean Islam by That Too much of hate which isn't needed at all. I agree this creates a problem in traffic and frustrated us. But don't just criminalise what you see in the first instance. That stick is to keep their mates in a limit and in a line such that they do not cross over to the middle of the road, their intention isn't to intimidate someone, but yeah that is a mob and things do escalate but stop looking at them in this way. Government couldn't mobilise this zeal and passion and they are unemployed hence doing what they find reassuring and satisfactory (religious hardships). They aren't brandishing weapons like swords. They are aware about what they are causing hence looking at the passing by cars and they keep check on themselves by holding a stick in their hands they never intend to create law and order problem(I'm talking about majority of people in there) Political supported goons I remember watching them when I was kid from my school bus thinking this is cool, you go on a trek around the country, get to have food and no work. Later I realised this is a cycle of poverty clinging onto religion. I remember watching them when I was kid from my school bus thinking this is cool, you go on a trek around the country, get to have food and no work. Later I realised this is a cycle of poverty clinging onto religion. Gangster. Don’t degrade the word gangster. They are pests. Been living in Abroad since 2018 and i saw no one protecting churches. Hater is a converted ramdika True but things wouldn't get better if Congress had that kind of influence either. Luckily they don't and neither are their followers as stupid Congress members and minorities are diehard Gandhi family fans and they're pretty stupid (not all minorities obviously). Nope. Minorities just want to live without getting lynched by the sangh. The sane ones, yes. There are minorities who want to lynch Hindus though (Supporters of Muslim parties, Christian terrorists, etc.) There are sane BJP supporters as well (like me). Christian terrorists? Lol you've been brainwashed by the sangh You might be the sane one but the PM is Modi and he orchestrated the Gujarat 2002 riots. Is BBC a Sanghi source? Agreed, the problem only exists in the North East but to claim that Christian terrorism doesn't exist in India is objectively false. The PM did orchestrate the riots but in his defence, there haven't been any riots since. There have been lesser riots under BJP rule than under Congress rule. > Is BBC a Sanghi source? Well I'll give it to that this is legitimate but no where close to what the sangh has done in India. > The PM did orchestrate the riots but in his defence, there haven't been any riots since. So if a rapist says he raped once but never again that's alright? I'm surprised at the fact that you admitted that he actually did orchestra the 2002 riots but still went ahead with voting for him and still call yourself a sane BJP supporter. It's sane to back up enablers of riots, rapes and murders? > There have been lesser riots under BJP rule than under Congress rule. This is objectively false. There have been far more riots and religious attacks after the sangh came to power. Something as little as eating beef can get you killed now. I feel the same scared when people are out on streets with swords🤡 Ever heard of ‘Edappal Ottam’? 😂 If a rapist raped once and all rapes on Earth stopped ever since, I do feel sorry for his victim but things are objectively better in the bigger scale of things. All political parties enable riots, rapes, and murders. I'm going to need a source for more riots since BJP came to power. Yes, the vigilantism is getting out of hand but I blame the courts not BJP. People have gotten impatient with how slow courts are. It takes 20 years to get justice. Justice delayed is justice denied. > If a rapist raped once and all rapes on Earth stopped ever since, I do feel sorry for his victim but things are objectively better in the bigger scale of things. That is on very fucked up take. Justice wasn't served and you're relying on the fact that the perpetrator will not do it again. Also sets the wrong precedent. What if a person sees this commits rape and says he won't do it again? It's beyond me how you can even think they can't be held accountable and this is pretty much why the country never progresses. > All political parties enable riots, rapes, and murders. The preparators are usually reprimanded in other parties but with the BJP they're given a hero's welcome and get their feet touched. With the Bilkis Bano case a significant portion of the sangh praised the rapists. No this is disproportionate in the BJP. After seeing Kathua, Unnao, Hathras, Bilkis Bano, Brij Bhushan and a lot of other cases I can safely tell BJP not only turns a blind eye but also facilitates rape. > I'm going to need a source for more riots since BJP came to power. You can also do a simple wikipedia search and see by the year how many riots were there. > Yes, the vigilantism is getting out of hand but I blame the courts not BJP. How do you blame the government for stuff cow vigilantes? The issue people can't tolerate different ideologies and culture and resort to violence to prove their point. > People have gotten impatient with how slow courts are. It takes 20 years to get justice. Justice delayed is justice denied. Ironic you say this since in the previous paragraph you literally said if a rapist commits rape only once and never you're fine with the person being let go and with situations like Modi orchestrating riots you're even fine with him being the PM. TLP, Indian version Looks like an orange squad protest They Travel in from many forests and night, That's why they carry a Danda for scaring those animals."
}