{
    "id": "16mmyjr",
    "title": "As a foreigner coming to India, is the 500 INR still be used to buy food and other amenities?",
    "url": "https://www.reddit.com/gallery/16mmyjr",
    "selftext": "Hi, I am an Australian guy travelling to India in a week. To prepare, I bought some INR from a currency exchange and mostly gave me 500 INR notes. I have been reading some conflicting information online about to 500 INR note. I know that this note is apart of the new series but I have been reading some conflicting information online. So, what's the deal with the 500 INR note and can I use this including the other notes to buy anything when I am over there?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695118038.0,
    "convurl": "https://i.redd.it/7njharq6s6pb1.jpg",
    "comments": [
        "Yup, these should work fine.\nPreferably by vendors,  you might need smaller denominations.",
        "Yes, This “500” note is acceptable. \n\nIf you are converting currently at any registered exchanges or banks, you don’t need to be worried about receiving demonetised currency",
        "Thank you for the help.\n\nIn hindsight, I should have researched the current circulation of a country's currency rather than knowing the currency code.",
        "Yup, you will be fine with these.  Also check out digital payments UPI for foreigners.  This is a cashless wallet that needs to be filled up with, say, USD to Rupees.  They’ve recently started this at certain airports. I understand that you can get the balance refunded on your way out back in USD.",
        "I guess I can break down the 500 notes into smaller denominationa at restaurants or supermarkets right?",
        "I am Australian, would this apply to me?",
        "Yup, you can surely do that.\nEnjoy your vacay",
        "Yes.",
        "You'll have no issue with those 500 INR notes here. I hope you enjoy your stay in India :)",
        "yes you can. It has not been Demonitizated yet.",
        "Yes.",
        "A few years ago the older \"500\" rupees notes were discontinued. The one you've shown in the picture is the only 500 note in circulation today.",
        "Yes this note will work.   \n\n\nAlso just FYI, 500 is a big note for smaller vendors.   \n\n\nSo get the change and keep these with you.   \n\n\n2-3 : 100 Rs   \n2-3 : 200 Rs   \n1-2 : 500 Rs   \n\n\nThese should get you through the day. Unless you are going somewhere fancy, in that case keep more 500s with you.",
        "NO, UPI only works with Indians or NRIs who have Bank accounts here and their mobile numbers linked with it.",
        "https://www.zeebiz.com/personal-finance/news-upi-how-foreign-nationals-nris-visiting-india-can-make-payments-using-unified-payments-interface-stst-247065",
        "That's what I am saying, you need an NRE/NRO account linked with your mobile number here.",
        "Just make sure the bill is printed on or after year 2019 (printed on the back left side) + don't take a 2,000 rupee bill of whatsoever print date. It is gonna be demonitized within a month.",
        "Bruh that's just the auto rent for 5kms",
        "Cash isn't accepted easily anymore. Try and.get UPI somehow.",
        "If you are NOT a backpacker intent on exploring street food, why bother with currency exchange?  Simply use your credit card. Visa and Mastercard are accepted at almost all organized retail joints and mid/larger restaurants across metro cities. \n\nI would do the same when I was an Indian Expat living abroad and visiting India. \n\nPro tip: For an extended trip, get a throwaway SIM with Indian phone-number and stick to UPI /PayTm or other online payments by linking your cards. Saves the hassle of making change and counting 'foreign' currency.",
        "Foreigners can't use UPI, it's as simple as that, but most Indians don't believe me when I say that. Also most businesses in India, including Zomato and Swiggy etc don't accept foreign bank cards so foreigners in India totally need cash to survive.",
        "Yeah currently this is the highest denomination available cause it won't be easy to get the 2000 bill.",
        "There are few Australian banks that issue international fee free cards, e.g. Macquarie bank. Get one of them and withdraw cash from ATMs as long as you are sticking to Tier 1 or 2 cities. Most shops in these cities, except small streetside ones will accept card payments. \n\nhttps://www.ozbargain.com.au/wiki/cards_with_no_overseas_transaction_fees",
        "'yet' lmao",
        "To add, try UPI when you arrive at the airport. Almost everyone accepts it, even local street vendors. And you won’t have to bother with cash much.",
        "For now yes, but you never know",
        "Not easy for NRIs.",
        "You need an Indian Bank account for UPI",
        "NRIs can use, foreigners?",
        "Works for now be sure to keep some change",
        "Bruh if you find a place where they still easily transact in cash, let me know. Had a rough time visiting India lately. Get yourself some UPI app. No one uses cash anymore damn!",
        "With enough of that you can literally buy peope here in india lol.",
        "Pretty sure UPI requires an Indian bank account",
        "Better to exchange for UPI at airport instead of currency if visiting a city.",
        "There’s a procedure in place for tourists. At select airports, they have kiosks which allow foreign tourists to register on the Fave app, deposit money into its wallet and use UPI.",
        "Yup, you will be fine. But as suggested by others, download the UPI app also.",
        "ahh..",
        "Only the 2000 rs notes have gone out of circulation \nNo problem with the 500 rs notes",
        "no. please give it us.",
        "You will be fine, this are not the largest currency we have, any vendor will be able to break this for you.\n\nHere is some tips,\n1. Transport: uber, ola, you can pay using your bank card\n2. Food delivery: swiggy, zomato, again you can pay using bank bards\n3. Shopping malls, large vendors, restaurants again you can mostly pay using your cards.",
        "Omg. I don't know if that's a genuine one or you're just trolling the currency!!!",
        "🙂",
        "You should be fine.",
        "Who is rejecting cash?",
        "almost everyone in bangalore atleast, they tell to just do UPI.",
        "What really? Who is rejecting cash? Where did you go?",
        "Damn, that’s quite a surprise to hear",
        "The keyword being \"yet\" but you never know.",
        "500 is totally fine. It’s a bit large, like paying for small items with a $50 bill but no issues with validity",
        "Yes :P",
        "I’m not saying rejecting. But it’s not preferred for sure. I went to Bangalore, Kolkata and other places in West Bengal it was the same everywhere. Grocery stores, sweet shops, hell even the lunch homes everyone had the QR code up. If your non-Indian credit card didn’t work, in many cases you are stuck. Also you don’t always have change. I went to fill air in my car, don’t have 10 RS change, don’t have UPI, it’s not easy. All I’m saying is compared to 6-7 years ago, it’s a totally different situation. UPI is sort of primary and cash secondary which is absolutely crazy in a good way.",
        "You could have loaded your upi wallet instead upon entering india that way could have made all transactions online, it would help you avoid carrying the physical currency and also the hassle of breaking such a large sum when paying for small purchases",
        "Ye these tripped out people keep changing currency, like they just got new notes and now one those new notes can no longer be used. Only 500 is the highest, like wtf man",
        "Yes, but be ware as auto drivers and street food places likely won't have that much change. Try to cut down the denominations at an upscale establishment.",
        "Right, that makes sense. Thank you for elaborating.",
        "Why Rupee will not replace the dollar as a global currency unless this guy is gone.",
        "Modi effect",
        "No, give me all of those that you have, they are illegal to have, let me help you stay out of trouble /s",
        "Yeah, it some sort of temp digi bank account .",
        "OMG, is this possible to do outside of the airport?\n\nI'm living in India temporarily and I've found it impossible to get any UPI to work because it won't link to my bank account - it's an Indian bank account but because it's a joint account with my husband it apparently doesn't work. Or possibly my Indian bank isn't Indian enough - it's DBS which is apparently a foreign bank even though they have branches in India. Wish I'd known that BEFORE we decided to bank with them.",
        "Sorry, I don’t know about that but try contacting Fave. They might be able to help you.\n\nBut if your husband is Indian and has an Aadhaar Card and PAN card, you can just open a new online account with Jupiter Money under his name.",
        "A tip, add money to ur UPI wallet at the airport. India will seem a little too digital to outsiders, u will hear a lot of \"No change\" if u give cash",
        "I guess 500 is the largest currency note currently.",
        "After demonetization I keep tabs of all the notes I have, in case I need to exchange them again.🥲",
        "Thank you for replying! I'll get in touch with Fave and see what they say. \n\nAlas, my husband is also foreign, otherwise that might have been a solution.",
        "Somewhere fancy will have cards. So that should be covered.",
        "Even Indians wouldn't know really. Our illiterate PM randomly chooses to discontinue the most circulated currency, within a matter of hours.\n\nSo...your guess is as good as ours.",
        "# arrest the dark-lord. Just kidding.\nIt's banned",
        "Just download paytm and apply for kyc, a person will come to your home and take ur thumb impressions and Aadhar card. As long as u have an aadhar card it’s an easy process",
        "2000 have not been demonetised. The banks are taking them out of circulation. They are perfectly valid currency.",
        "No it doesn't work :( . Give me the note, I'll give you a 100 for it and take my losses",
        "This is not true. Cash is accepted in most places. Establishments do reject cash.",
        "Somebody having to worry about this shows how stupid the whole original circus was.",
        "Send me some first, I'll have to look....",
        "Off topic but be careful of scammers in India",
        "It’s ‘still’ a legal tender. But I have heard that there is a chip embedded into it and could tracked. So that’s that",
        "NRI can use, if they have linked number with their NRE/NRO accounts.   \n\n\nI don't see any suitable option for foreigners, apart from cards enabled with wifi, they work at petrol pumps and hotles, but smaller vendors who use UPI won't have card POS so cash is advised.",
        "Yes, it would work but most of the transactions happen in India digitally so you might have to use your card more or less. Unless you want to get a PPI account on arrival. Then you can scan and pay for even a 5 rupee tea with an app like Google Pay, PhonePe or Paytm. \n\nYou can find more info here. \n\n[https://www.npci.org.in/what-we-do/upi-one-world](https://www.npci.org.in/what-we-do/upi-one-world)",
        "There is no global currency still yet apart from dollar! Other countries don't have the guy you hate, and seeing the current trends, that guy isn't gonna go. So, bad time for you!",
        "If you are asking that if it's acceptable than yes. Or if you are asking that it's feasible to buy food in 500, it depends.",
        "You can try this .. [https://www.chequpi.com/](https://www.chequpi.com/)",
        "No, you don't need any Indian account. [https://www.chequpi.com/](https://www.chequpi.com/)",
        "I guess you can download Paytm and have some 5000 Rs transferred into your wallet.\nThat will help you immensely paying change.\nElse you may end up with a lot of Rs 1/2 candies.🌞",
        "Thank you, I'll check it out!",
        "It's been like 8 years now so any old note that was in circulation has been effectively removed",
        "laughing in bitcoin, monero, etherium and polygon",
        "Do you think the Indian government has 600 billion dollars worth of physical currency notes as its forex reserve and RBI governor dives in it Scrooge McDuck style?",
        "Yes a valid currency",
        "If I am not mistaken, paytm is not accepting new customers atm",
        "Ya... it is a bit hard to tell from the image. OP, mail it to us and we will verify. If it can be used, we will send it back to you...",
        "This note will work perfectly fine, though most street vendors don't like bigger notes. If you can break some of 500s down into smaller ones, like 100s, 200s it would make your life much more simpler if you want to buy something from road side vendors.",
        "https://www.livemint.com/news/india/german-minister-uses-upi-to-make-payment-in-india-embassy-lauds-shares-video/amp-11692541352948.html",
        "\"This\" 500",
        "I still have a few, my mom hid them in a saree in the closet and forgot about it. We found it almost 2 years after demonetisation. ¯\\\\\\_(ツ)\\_/¯",
        "Sell it after 30 years as an antic product for 30k... Profits",
        "Yes",
        "Fucccck 8 years",
        "Just tear the note up into smaller size. \n\n/s",
        "Use UPI and forex/credit cards majorly…keep cash mainly for emergencies and immediate use",
        "There's a difference between being a minister and normal foreign nationals\n\nI am saying this from recent personal experience, it doesn't work.\n\nDon't get all patriotic about it.\n\nTry this on your own\n\nNo bank account in India\n\nand \n\nNo number linked\n\n\ntry it out",
        "Yes you can do whatever you want with this note",
        "There’s also upi for foreigners, where u can do scan to pay at any PoS, vendors. You can get more info at airport",
        "Are you talking just for the sake of talking!! Bffr \n\nBeing a minister and being a foreign national of a foreign country (Germany) makes them both foreign nationals. Now don’t tell me if Harris and Biden visit India, only Harris can use UPI and Biden cannot. You can’t be serious about your comment lmfao",
        "Bhai, use your aussie dollar, big shops will accept that as well",
        "May not be as powerful as before with so much inflation, not just in India but globally, the buying power has reduced 500 is the new 100 for commute, food.",
        "Wait what... 8 years!",
        "It would be better to bring some lower denomination notes such as 200, 100, 50, and 20. Most people are always asking for a change of 500 rs notes. LOL",
        "Change your source of news ASAP",
        "Try using your credit card. Send us photos, we will tell you if you can use your card here or not 😌",
        "No",
        "Hahaha foreigners will have a lot of questions like this in future. \n\"Can i still carry currency from the Reserve Bank of India? As India is Bharat?\"",
        "Go back to your country\n\n Lol. Joking aside. Yes. Enjoy and stay safe.",
        "Do read a bit about UPI. \nIn short, It's a scan QR code of a vendor to pay to his bank account directly. For foreigners you could have a preload an app wallet possibly at the airport, then go on happy scanning the QR codes to pay. \n\n\nWe pay with upi for as small as 10₹ to as large as ₹ 20k with UPI. \n\nEliminates the break for change issues.",
        "Maybe it's made possible just for them (them being the minister) \n\nIt's still not doable for regular foreign nationals.\n\nThey still can't do it despite the process outlined.\n\nIT DOESN'T WORK.\n\nAnd for your 5 year old brain.\n\nUPI NO WORK FOR Foreign Nationals.",
        "1. For your caps lock issue: Get your phone checked \n2. When you are debating on a topic, stop name calling. It only shows that you have no valid answer and that’s the reason you are resorting to cheap tactics.\n3. Indian government does not have separate rules for different foreign individuals.\n4. You lack a serious reading and comprehension and should stick to reading rhymes book of kindergarten level.\n5. You are a grown adult with an IQ lower than that of a mushroom plant. \n6. You are using “maybe” in your sentence which confirms that you are not sure about the terms of using UPI and talking out of your 🍑",
        "yes. u can use it to buy food and amenities. look for lower denominations. helps with shopping.",
        "Don’t get caught bringing it in unless you’re an oci/nri. There’s a belief that you can carry up to 25k in as a foreigner but it’s currently illegal. I put mine in my sock but I’ve never really been searched. For the record it’s pretty unnecessary these days. Maybe a bit for emergencies but there’s atm’s at the airport, SIM cards & Uber etc. When I started travelling it’s was a fucking great wedge of cash & travellers cheques in as discreet a money belt as poss and a whole lot of luck.",
        "6. 2017 Nov",
        "Yes it will work.",
        "Can't assure you man, our psychotic PM can demonetize it anytime",
        "At airport forex counter, you can get the UPI app and load inr in that to pay digitally as most payments are digital. You can pay them in AUD and they will load equivalent INR and remaining balance when u go back to Australia can be withdrawn back as AUD.",
        "They started it for foreigners recently. Only at internet national airports.",
        "You should look into UPI. Every airport has money exchange counters that can help you and you don't have to carry around so much physical currency.",
        "They will work if you go to that link the Modi government sends you after you pay for something here and snatch your whereabouts.",
        "Pinacle of TRUST.....",
        "Wasn’t it 2016?",
        "You're good to go",
        "yes . I do not understand why 1 rupee small coin  , 10 rupee coin was rejected in some part of India in the market .  RBI should clarify on this to general public and release a circular .",
        "2016 nov",
        "I said the same and people are sending me links of a minister doing it and what not.\n\nIn future foreigners maybe able to do it, and UPI has started steps for it.\n\nBut as of now it doesn't work for non Indians",
        "shudders",
        "Yes and I get downvoted for something that is my daily experience lol. Typical Reddit. Actually even in real life people simply refuse to believe me when I say I can't use UPI and almost no business accepts my non Indian bank cards, online or offline.",
        "Yes, also use uber or airport cab service for going to your hotel, and there is no rally or police order of closing any road. So travel freely",
        "Absolutely usable",
        "This 500-rupee note is absolutely accepted legal tender. You can use it across India.",
        "Also do not get the pink color 2000₹ note",
        "I would recommend trying our UPI. You wouldn't need cash then. But foreigners can only avail this service if they register for it at airport itself I think. So a bit of research would is recommended in this regard.",
        "What happened to the old bills?",
        "Try your luck. But we might change it later",
        "RBI did, every coin in circulation is legal tender, but local shopwallas act outside RBI's sultanate.",
        "Arre baba… read the shared artivle above in detail… an NRE/NRO account is needed",
        "L + gpay better",
        "Well, it doesn't have a wallet tho, so you need an Indian Bank account to use it.",
        "Let me clarify it. The RBI is now demonitizing the 2000 INR and cannot be used after 30 Sept. and the 500 INR note can be used and there is no news related to the 500 INR.\n\nNote: Do not accept any 2000 INR anywhere as it will be invalid after 30 September",
        "Foreigners can activate UPI at certain international airports like Delhi.",
        "In India they always announce these things that are going to work in theory but in practice they don't, 99% of the time. How many foreigners arriving at international airports after a long haul flight, when most of them don't even have an Indian sim card, are going to go through the process to set up UPI, even if it does work?",
        "[https://tenor.com/bop1l.gif](https://tenor.com/bop1l.gif)[jab tak chal raha hai chal raha hai , magar kab tak chalega hai iski guarantee nahi nahi hai](https://tenor.com/bop1l.gif)",
        "99% is wrong. Awareness of these features are needed.  Airport is one of the best places to have this. So many foreigners do foreign exchange at aiport, there this can be done as well. Having cash ready is great but getting change of 500 rupees every time if so frustrating too and then carrying cash is also risky due to probable theft. Dont doubt that these things won't work. People doubted digital payments so much but now it works so well. Its with use that things improve.",
        "Yes, of course, why wouldn't it be",
        "Nobody really does 'foreign exchange' in 2023. People use ATMs or pay by card everywhere. But unlike in most other countries, in India it's almost impossible to pay with international bank cards.",
        "Foreigners can't get UPI. Everyone accepts cash, I don't know what you're talking about. I live in India and practically pay for everything in cash in and around Delhi, never had anyone say they don't accept cash. Only private hospitals have some limits, I think over 20k they don't accept cash but that's not something that would affect an average tourist.",
        "Its also a way but given how our street food and street market culture is high, a card machine is an additional investment for all small vendors. Why do that when digital payments from phones are working flawless anyway. Investing only because some foreigner someday will visit ur shop and not have upi is stupid. Instead foreigners can also get to experience the upi culture of India. Digital payments are not as advanced as India anywhere, as far as I know. Also foreign bank cards in any country charge an extra conversion charge or international transaction charge everytime u pay by card whereas in upi its one time just like forex. But yeah its personal pref at the end. May u prefer card more than mobile digital payments. Thats ok too.",
        "Lol, the problem isn't foreigners not being able to pay for street food :). It is that several hotels, airlines, Zomato, Swiggy, Zepto, hospitals etc etc don't accept foreign bank cards."
    ],
    "cleaned_text": "foreigner coming india inr still used buy food amenities hi australian guy travelling india week prepare bought inr currency exchange mostly gave inr notes reading conflicting information online inr note know note apart new series reading conflicting information online whats deal inr note use including notes buy anything ",
    "cleaned_title": "foreigner coming india inr still used buy food amenities",
    "cleaned_selftext": "hi australian guy travelling india week prepare bought inr currency exchange mostly gave inr notes reading conflicting information online inr note know note apart new series reading conflicting information online whats deal inr note use including notes buy anything",
    "cleaned_comments": "yup work fine preferably vendors might need smaller denominations yes note acceptable converting currently registered exchanges banks dont need worried receiving demonetised currency thank help hindsight researched current circulation countrys currency rather knowing currency code yup fine also check digital payments upi foreigners cashless wallet needs filled say usd rupees theyve recently started certain airports understand get balance refunded way back usd guess break notes smaller denominationa restaurants supermarkets right australian would apply yup surely enjoy vacay yes youll issue inr notes hope enjoy stay india yes demonitizated yet yes years ago older rupees notes discontinued one youve shown picture note circulation today yes note work also fyi big note smaller vendors get change keep rs rs rs get day unless going somewhere fancy case keep upi works indians nris bank accounts mobile numbers linked thats saying need nrenro account linked mobile number make sure bill printed year printed back left side dont take rupee bill whatsoever print date gon na demonitized within month bruh thats auto rent kms cash isnt accepted easily anymore try andget upi somehow backpacker intent exploring street food bother currency exchange simply use credit card visa mastercard accepted almost organized retail joints midlarger restaurants across metro cities would indian expat living abroad visiting india pro tip extended trip get throwaway sim indian phonenumber stick upi paytm online payments linking cards saves hassle making change counting foreign currency foreigners cant use upi simple indians dont believe say also businesses india including zomato swiggy etc dont accept foreign bank cards foreigners india totally need cash survive yeah currently highest denomination available cause wont easy get bill australian banks issue international fee free cards eg macquarie bank get one withdraw cash atms long sticking tier cities shops cities except small streetside ones accept card payments yet lmao add try upi arrive airport almost everyone accepts even local street vendors wont bother cash much yes never know easy nris need indian bank account upi nris use foreigners works sure keep change bruh find place still easily transact cash let know rough time visiting india lately get upi app one uses cash anymore damn enough literally buy peope india lol pretty sure upi requires indian bank account better exchange upi airport instead currency visiting city theres procedure place tourists select airports kiosks allow foreign tourists register fave app deposit money wallet use upi yup fine suggested others download upi app also ahh rs notes gone circulation problem rs notes please give us fine largest currency vendor able break tips transport uber ola pay using bank card food delivery swiggy zomato pay using bank bards shopping malls large vendors restaurants mostly pay using cards omg dont know thats genuine one youre trolling currency fine rejecting cash almost everyone bangalore atleast tell upi really rejecting cash go damn thats quite surprise hear keyword yet never know totally fine bit large like paying small items bill issues validity yes p im saying rejecting preferred sure went bangalore kolkata places west bengal everywhere grocery stores sweet shops hell even lunch homes everyone qr code nonindian credit card didnt work many cases stuck also dont always change went fill air car dont rs change dont upi easy im saying compared years ago totally different situation upi sort primary cash secondary absolutely crazy good way could loaded upi wallet instead upon entering india way could made transactions online would help avoid carrying physical currency also hassle breaking large sum paying small purchases ye tripped people keep changing currency like got new notes one new notes longer used highest like wtf man yes ware auto drivers street food places likely wont much change try cut denominations upscale establishment right makes sense thank elaborating rupee replace dollar global currency unless guy gone modi effect give illegal let help stay trouble yeah sort temp digi bank account omg possible outside airport im living india temporarily ive found impossible get upi work wont link bank account indian bank account joint account husband apparently doesnt work possibly indian bank isnt indian enough dbs apparently foreign bank even though branches india wish id known decided bank sorry dont know try contacting fave might able help husband indian aadhaar card pan card open new online account jupiter money name tip add money ur upi wallet airport india seem little digital outsiders u hear lot change u give cash guess largest currency note currently demonetization keep tabs notes case need exchange thank replying ill get touch fave see say alas husband also foreign otherwise might solution somewhere fancy cards covered even indians wouldnt know really illiterate pm randomly chooses discontinue circulated currency within matter hours soyour guess good arrest darklord kidding banned download paytm apply kyc person come home take ur thumb impressions aadhar card long u aadhar card easy process demonetised banks taking circulation perfectly valid currency doesnt work give note ill give take losses true cash accepted places establishments reject cash somebody worry shows stupid whole original circus send first ill look topic careful scammers india still legal tender heard chip embedded could tracked thats nri use linked number nrenro accounts dont see suitable option foreigners apart cards enabled wifi work petrol pumps hotles smaller vendors use upi wont card pos cash advised yes would work transactions happen india digitally might use card less unless want get ppi account arrival scan pay even rupee tea app like google pay phonepe paytm find info httpswwwnpciorginwhatwedoupioneworldhttpswwwnpciorginwhatwedoupioneworld global currency still yet apart dollar countries dont guy hate seeing current trends guy isnt gon na go bad time asking acceptable yes asking feasible buy food depends try httpswwwchequpicomhttpswwwchequpicom dont need indian account httpswwwchequpicomhttpswwwchequpicom guess download paytm rs transferred wallet help immensely paying change else may end lot rs candies thank ill check like years old note circulation effectively removed laughing bitcoin monero etherium polygon think indian government billion dollars worth physical currency notes forex reserve rbi governor dives scrooge mcduck style yes valid currency mistaken paytm accepting new customers atm ya bit hard tell image op mail us verify used send back note work perfectly fine though street vendors dont like bigger notes break smaller ones like would make life much simpler want buy something road side vendors still mom hid saree closet forgot found almost years demonetisation sell years antic product k profits yes fucccck years tear note smaller size use upi forexcredit cards majorlykeep cash mainly emergencies immediate use theres difference minister normal foreign nationals saying recent personal experience doesnt work dont get patriotic try bank account india number linked try yes whatever want note theres also upi foreigners u scan pay pos vendors get info airport talking sake talking bffr minister foreign national foreign country germany makes foreign nationals dont tell harris biden visit india harris use upi biden cant serious comment lmfao bhai use aussie dollar big shops accept well may powerful much inflation india globally buying power reduced new commute food wait years would better bring lower denomination notes people always asking change rs notes lol change source news asap try using credit card send us photos tell use card hahaha foreigners lot questions like future still carry currency reserve bank india india bharat go back country lol joking aside yes enjoy stay safe read bit upi short scan qr code vendor pay bank account directly foreigners could preload app wallet possibly airport go happy scanning qr codes pay pay upi small large k upi eliminates break change issues maybe made possible minister still doable regular foreign nationals still cant despite process outlined doesnt work year old brain upi work foreign nationals caps lock issue get phone checked debating topic stop name calling shows valid answer thats reason resorting cheap tactics indian government separate rules different foreign individuals lack serious reading comprehension stick reading rhymes book kindergarten level grown adult iq lower mushroom plant using maybe sentence confirms sure terms using upi talking yes u use buy food amenities look lower denominations helps shopping dont get caught bringing unless youre ocinri theres belief carry k foreigner currently illegal put mine sock ive never really searched record pretty unnecessary days maybe bit emergencies theres atms airport sim cards uber etc started travelling fucking great wedge cash travellers cheques discreet money belt poss whole lot luck nov yes work cant assure man psychotic pm demonetize anytime airport forex counter get upi app load inr pay digitally payments digital pay aud load equivalent inr remaining balance u go back australia withdrawn back aud started foreigners recently internet national airports look upi every airport money exchange counters help dont carry around much physical currency work go link modi government sends pay something snatch whereabouts pinacle trust wasnt youre good go yes understand rupee small coin rupee coin rejected part india market rbi clarify general public release circular nov said people sending links minister future foreigners maybe able upi started steps doesnt work non indians shudders yes get downvoted something daily experience lol typical reddit actually even real life people simply refuse believe say cant use upi almost business accepts non indian bank cards online offline yes also use uber airport cab service going hotel rally police order closing road travel freely absolutely usable rupee note absolutely accepted legal tender use across india also get pink color note would recommend trying upi wouldnt need cash foreigners avail service register airport think bit research would recommended regard happened old bills try luck might change later rbi every coin circulation legal tender local shopwallas act outside rbis sultanate arre baba read shared artivle detail nrenro account needed l gpay better well doesnt wallet tho need indian bank account use let clarify rbi demonitizing inr used sept inr note used news related inr note accept inr anywhere invalid september foreigners activate upi certain international airports like delhi india always announce things going work theory practice dont time many foreigners arriving international airports long haul flight dont even indian sim card going go process set upi even work httpstenorcomboplgifhttpstenorcomboplgifjab tak chal raha hai chal raha hai magar kab tak chalega hai iski guarantee nahi nahi haihttpstenorcomboplgif wrong awareness features needed airport one best places many foreigners foreign exchange aiport done well cash ready great getting change rupees every time frustrating carrying cash also risky due probable theft dont doubt things wont work people doubted digital payments much works well use things improve yes course wouldnt nobody really foreign exchange people use atms pay card everywhere unlike countries india almost impossible pay international bank cards foreigners cant get upi everyone accepts cash dont know youre talking live india practically pay everything cash around delhi never anyone say dont accept cash private hospitals limits think k dont accept cash thats something would affect average tourist also way given street food street market culture high card machine additional investment small vendors digital payments phones working flawless anyway investing foreigner someday visit ur shop upi stupid instead foreigners also get experience upi culture india digital payments advanced india anywhere far know also foreign bank cards country charge extra conversion charge international transaction charge everytime u pay card whereas upi one time like forex yeah personal pref end may u prefer card mobile digital payments thats ok lol problem isnt foreigners able pay street food several hotels airlines zomato swiggy zepto hospitals etc etc dont accept foreign bank cards",
    "light_cleaned_title": "As a foreigner coming to India, is the 500 INR still be used to buy food and other amenities?",
    "light_cleaned_selftext": "Hi, I am an Australian guy travelling to India in a week. To prepare, I bought some INR from a currency exchange and mostly gave me 500 INR notes. I have been reading some conflicting information online about to 500 INR note. I know that this note is apart of the new series but I have been reading some conflicting information online. So, what's the deal with the 500 INR note and can I use this including the other notes to buy anything when I am over there?",
    "light_cleaned_comments": "Yup, these should work fine. Preferably by vendors, you might need smaller denominations. Yes, This “500” note is acceptable. If you are converting currently at any registered exchanges or banks, you don’t need to be worried about receiving demonetised currency Thank you for the help. In hindsight, I should have researched the current circulation of a country's currency rather than knowing the currency code. Yup, you will be fine with these. Also check out digital payments UPI for foreigners. This is a cashless wallet that needs to be filled up with, say, USD to Rupees. They’ve recently started this at certain airports. I understand that you can get the balance refunded on your way out back in USD. I guess I can break down the 500 notes into smaller denominationa at restaurants or supermarkets right? I am Australian, would this apply to me? Yup, you can surely do that. Enjoy your vacay Yes. You'll have no issue with those 500 INR notes here. I hope you enjoy your stay in India :) yes you can. It has not been Demonitizated yet. Yes. A few years ago the older \"500\" rupees notes were discontinued. The one you've shown in the picture is the only 500 note in circulation today. Yes this note will work. Also just FYI, 500 is a big note for smaller vendors. So get the change and keep these with you. 2-3 : 100 Rs 2-3 : 200 Rs 1-2 : 500 Rs These should get you through the day. Unless you are going somewhere fancy, in that case keep more 500s with you. NO, UPI only works with Indians or NRIs who have Bank accounts here and their mobile numbers linked with it. That's what I am saying, you need an NRE/NRO account linked with your mobile number here. Just make sure the bill is printed on or after year 2019 (printed on the back left side) + don't take a 2,000 rupee bill of whatsoever print date. It is gonna be demonitized within a month. Bruh that's just the auto rent for 5kms Cash isn't accepted easily anymore. Try and.get UPI somehow. If you are NOT a backpacker intent on exploring street food, why bother with currency exchange? Simply use your credit card. Visa and Mastercard are accepted at almost all organized retail joints and mid/larger restaurants across metro cities. I would do the same when I was an Indian Expat living abroad and visiting India. Pro tip: For an extended trip, get a throwaway SIM with Indian phone-number and stick to UPI /PayTm or other online payments by linking your cards. Saves the hassle of making change and counting 'foreign' currency. Foreigners can't use UPI, it's as simple as that, but most Indians don't believe me when I say that. Also most businesses in India, including Zomato and Swiggy etc don't accept foreign bank cards so foreigners in India totally need cash to survive. Yeah currently this is the highest denomination available cause it won't be easy to get the 2000 bill. There are few Australian banks that issue international fee free cards, e.g. Macquarie bank. Get one of them and withdraw cash from ATMs as long as you are sticking to Tier 1 or 2 cities. Most shops in these cities, except small streetside ones will accept card payments. 'yet' lmao To add, try UPI when you arrive at the airport. Almost everyone accepts it, even local street vendors. And you won’t have to bother with cash much. For now yes, but you never know Not easy for NRIs. You need an Indian Bank account for UPI NRIs can use, foreigners? Works for now be sure to keep some change Bruh if you find a place where they still easily transact in cash, let me know. Had a rough time visiting India lately. Get yourself some UPI app. No one uses cash anymore damn! With enough of that you can literally buy peope here in india lol. Pretty sure UPI requires an Indian bank account Better to exchange for UPI at airport instead of currency if visiting a city. There’s a procedure in place for tourists. At select airports, they have kiosks which allow foreign tourists to register on the Fave app, deposit money into its wallet and use UPI. Yup, you will be fine. But as suggested by others, download the UPI app also. ahh.. Only the 2000 rs notes have gone out of circulation No problem with the 500 rs notes no. please give it us. You will be fine, this are not the largest currency we have, any vendor will be able to break this for you. Here is some tips, 1. Transport: uber, ola, you can pay using your bank card 2. Food delivery: swiggy, zomato, again you can pay using bank bards 3. Shopping malls, large vendors, restaurants again you can mostly pay using your cards. Omg. I don't know if that's a genuine one or you're just trolling the currency!!! 🙂 You should be fine. Who is rejecting cash? almost everyone in bangalore atleast, they tell to just do UPI. What really? Who is rejecting cash? Where did you go? Damn, that’s quite a surprise to hear The keyword being \"yet\" but you never know. 500 is totally fine. It’s a bit large, like paying for small items with a $50 bill but no issues with validity Yes :P I’m not saying rejecting. But it’s not preferred for sure. I went to Bangalore, Kolkata and other places in West Bengal it was the same everywhere. Grocery stores, sweet shops, hell even the lunch homes everyone had the QR code up. If your non-Indian credit card didn’t work, in many cases you are stuck. Also you don’t always have change. I went to fill air in my car, don’t have 10 RS change, don’t have UPI, it’s not easy. All I’m saying is compared to 6-7 years ago, it’s a totally different situation. UPI is sort of primary and cash secondary which is absolutely crazy in a good way. You could have loaded your upi wallet instead upon entering india that way could have made all transactions online, it would help you avoid carrying the physical currency and also the hassle of breaking such a large sum when paying for small purchases Ye these tripped out people keep changing currency, like they just got new notes and now one those new notes can no longer be used. Only 500 is the highest, like wtf man Yes, but be ware as auto drivers and street food places likely won't have that much change. Try to cut down the denominations at an upscale establishment. Right, that makes sense. Thank you for elaborating. Why Rupee will not replace the dollar as a global currency unless this guy is gone. Modi effect No, give me all of those that you have, they are illegal to have, let me help you stay out of trouble /s Yeah, it some sort of temp digi bank account . OMG, is this possible to do outside of the airport? I'm living in India temporarily and I've found it impossible to get any UPI to work because it won't link to my bank account - it's an Indian bank account but because it's a joint account with my husband it apparently doesn't work. Or possibly my Indian bank isn't Indian enough - it's DBS which is apparently a foreign bank even though they have branches in India. Wish I'd known that BEFORE we decided to bank with them. Sorry, I don’t know about that but try contacting Fave. They might be able to help you. But if your husband is Indian and has an Aadhaar Card and PAN card, you can just open a new online account with Jupiter Money under his name. A tip, add money to ur UPI wallet at the airport. India will seem a little too digital to outsiders, u will hear a lot of \"No change\" if u give cash I guess 500 is the largest currency note currently. After demonetization I keep tabs of all the notes I have, in case I need to exchange them again.🥲 Thank you for replying! I'll get in touch with Fave and see what they say. Alas, my husband is also foreign, otherwise that might have been a solution. Somewhere fancy will have cards. So that should be covered. Even Indians wouldn't know really. Our illiterate PM randomly chooses to discontinue the most circulated currency, within a matter of hours. So...your guess is as good as ours. # arrest the dark-lord. Just kidding. It's banned Just download paytm and apply for kyc, a person will come to your home and take ur thumb impressions and Aadhar card. As long as u have an aadhar card it’s an easy process 2000 have not been demonetised. The banks are taking them out of circulation. They are perfectly valid currency. No it doesn't work :( . Give me the note, I'll give you a 100 for it and take my losses This is not true. Cash is accepted in most places. Establishments do reject cash. Somebody having to worry about this shows how stupid the whole original circus was. Send me some first, I'll have to look.... Off topic but be careful of scammers in India It’s ‘still’ a legal tender. But I have heard that there is a chip embedded into it and could tracked. So that’s that NRI can use, if they have linked number with their NRE/NRO accounts. I don't see any suitable option for foreigners, apart from cards enabled with wifi, they work at petrol pumps and hotles, but smaller vendors who use UPI won't have card POS so cash is advised. Yes, it would work but most of the transactions happen in India digitally so you might have to use your card more or less. Unless you want to get a PPI account on arrival. Then you can scan and pay for even a 5 rupee tea with an app like Google Pay, PhonePe or Paytm. You can find more info here. [https://www.npci.org.in/what-we-do/upi-one-world](https://www.npci.org.in/what-we-do/upi-one-world) There is no global currency still yet apart from dollar! Other countries don't have the guy you hate, and seeing the current trends, that guy isn't gonna go. So, bad time for you! If you are asking that if it's acceptable than yes. Or if you are asking that it's feasible to buy food in 500, it depends. You can try this .. [https://www.chequpi.com/](https://www.chequpi.com/) No, you don't need any Indian account. [https://www.chequpi.com/](https://www.chequpi.com/) I guess you can download Paytm and have some 5000 Rs transferred into your wallet. That will help you immensely paying change. Else you may end up with a lot of Rs 1/2 candies.🌞 Thank you, I'll check it out! It's been like 8 years now so any old note that was in circulation has been effectively removed laughing in bitcoin, monero, etherium and polygon Do you think the Indian government has 600 billion dollars worth of physical currency notes as its forex reserve and RBI governor dives in it Scrooge McDuck style? Yes a valid currency If I am not mistaken, paytm is not accepting new customers atm Ya... it is a bit hard to tell from the image. OP, mail it to us and we will verify. If it can be used, we will send it back to you... This note will work perfectly fine, though most street vendors don't like bigger notes. If you can break some of 500s down into smaller ones, like 100s, 200s it would make your life much more simpler if you want to buy something from road side vendors. \"This\" 500 I still have a few, my mom hid them in a saree in the closet and forgot about it. We found it almost 2 years after demonetisation. ¯\\\\\\_(ツ)\\_/¯ Sell it after 30 years as an antic product for 30k... Profits Yes Fucccck 8 years Just tear the note up into smaller size. /s Use UPI and forex/credit cards majorly…keep cash mainly for emergencies and immediate use There's a difference between being a minister and normal foreign nationals I am saying this from recent personal experience, it doesn't work. Don't get all patriotic about it. Try this on your own No bank account in India and No number linked try it out Yes you can do whatever you want with this note There’s also upi for foreigners, where u can do scan to pay at any PoS, vendors. You can get more info at airport Are you talking just for the sake of talking!! Bffr Being a minister and being a foreign national of a foreign country (Germany) makes them both foreign nationals. Now don’t tell me if Harris and Biden visit India, only Harris can use UPI and Biden cannot. You can’t be serious about your comment lmfao Bhai, use your aussie dollar, big shops will accept that as well May not be as powerful as before with so much inflation, not just in India but globally, the buying power has reduced 500 is the new 100 for commute, food. Wait what... 8 years! It would be better to bring some lower denomination notes such as 200, 100, 50, and 20. Most people are always asking for a change of 500 rs notes. LOL Change your source of news ASAP Try using your credit card. Send us photos, we will tell you if you can use your card here or not 😌 No Hahaha foreigners will have a lot of questions like this in future. \"Can i still carry currency from the Reserve Bank of India? As India is Bharat?\" Go back to your country Lol. Joking aside. Yes. Enjoy and stay safe. Do read a bit about UPI. In short, It's a scan QR code of a vendor to pay to his bank account directly. For foreigners you could have a preload an app wallet possibly at the airport, then go on happy scanning the QR codes to pay. We pay with upi for as small as 10₹ to as large as ₹ 20k with UPI. Eliminates the break for change issues. Maybe it's made possible just for them (them being the minister) It's still not doable for regular foreign nationals. They still can't do it despite the process outlined. IT DOESN'T WORK. And for your 5 year old brain. UPI NO WORK FOR Foreign Nationals. 1. For your caps lock issue: Get your phone checked 2. When you are debating on a topic, stop name calling. It only shows that you have no valid answer and that’s the reason you are resorting to cheap tactics. 3. Indian government does not have separate rules for different foreign individuals. 4. You lack a serious reading and comprehension and should stick to reading rhymes book of kindergarten level. 5. You are a grown adult with an IQ lower than that of a mushroom plant. 6. You are using “maybe” in your sentence which confirms that you are not sure about the terms of using UPI and talking out of your 🍑 yes. u can use it to buy food and amenities. look for lower denominations. helps with shopping. Don’t get caught bringing it in unless you’re an oci/nri. There’s a belief that you can carry up to 25k in as a foreigner but it’s currently illegal. I put mine in my sock but I’ve never really been searched. For the record it’s pretty unnecessary these days. Maybe a bit for emergencies but there’s atm’s at the airport, SIM cards & Uber etc. When I started travelling it’s was a fucking great wedge of cash & travellers cheques in as discreet a money belt as poss and a whole lot of luck. 6. 2017 Nov Yes it will work. Can't assure you man, our psychotic PM can demonetize it anytime At airport forex counter, you can get the UPI app and load inr in that to pay digitally as most payments are digital. You can pay them in AUD and they will load equivalent INR and remaining balance when u go back to Australia can be withdrawn back as AUD. They started it for foreigners recently. Only at internet national airports. You should look into UPI. Every airport has money exchange counters that can help you and you don't have to carry around so much physical currency. They will work if you go to that link the Modi government sends you after you pay for something here and snatch your whereabouts. Pinacle of TRUST..... Wasn’t it 2016? You're good to go yes . I do not understand why 1 rupee small coin , 10 rupee coin was rejected in some part of India in the market . RBI should clarify on this to general public and release a circular . 2016 nov I said the same and people are sending me links of a minister doing it and what not. In future foreigners maybe able to do it, and UPI has started steps for it. But as of now it doesn't work for non Indians shudders Yes and I get downvoted for something that is my daily experience lol. Typical Reddit. Actually even in real life people simply refuse to believe me when I say I can't use UPI and almost no business accepts my non Indian bank cards, online or offline. Yes, also use uber or airport cab service for going to your hotel, and there is no rally or police order of closing any road. So travel freely Absolutely usable This 500-rupee note is absolutely accepted legal tender. You can use it across India. Also do not get the pink color 2000₹ note I would recommend trying our UPI. You wouldn't need cash then. But foreigners can only avail this service if they register for it at airport itself I think. So a bit of research would is recommended in this regard. What happened to the old bills? Try your luck. But we might change it later RBI did, every coin in circulation is legal tender, but local shopwallas act outside RBI's sultanate. Arre baba… read the shared artivle above in detail… an NRE/NRO account is needed L + gpay better Well, it doesn't have a wallet tho, so you need an Indian Bank account to use it. Let me clarify it. The RBI is now demonitizing the 2000 INR and cannot be used after 30 Sept. and the 500 INR note can be used and there is no news related to the 500 INR. Note: Do not accept any 2000 INR anywhere as it will be invalid after 30 September Foreigners can activate UPI at certain international airports like Delhi. In India they always announce these things that are going to work in theory but in practice they don't, 99% of the time. How many foreigners arriving at international airports after a long haul flight, when most of them don't even have an Indian sim card, are going to go through the process to set up UPI, even if it does work? [https://tenor.com/bop1l.gif](https://tenor.com/bop1l.gif)[jab tak chal raha hai chal raha hai , magar kab tak chalega hai iski guarantee nahi nahi hai](https://tenor.com/bop1l.gif) 99% is wrong. Awareness of these features are needed. Airport is one of the best places to have this. So many foreigners do foreign exchange at aiport, there this can be done as well. Having cash ready is great but getting change of 500 rupees every time if so frustrating too and then carrying cash is also risky due to probable theft. Dont doubt that these things won't work. People doubted digital payments so much but now it works so well. Its with use that things improve. Yes, of course, why wouldn't it be Nobody really does 'foreign exchange' in 2023. People use ATMs or pay by card everywhere. But unlike in most other countries, in India it's almost impossible to pay with international bank cards. Foreigners can't get UPI. Everyone accepts cash, I don't know what you're talking about. I live in India and practically pay for everything in cash in and around Delhi, never had anyone say they don't accept cash. Only private hospitals have some limits, I think over 20k they don't accept cash but that's not something that would affect an average tourist. Its also a way but given how our street food and street market culture is high, a card machine is an additional investment for all small vendors. Why do that when digital payments from phones are working flawless anyway. Investing only because some foreigner someday will visit ur shop and not have upi is stupid. Instead foreigners can also get to experience the upi culture of India. Digital payments are not as advanced as India anywhere, as far as I know. Also foreign bank cards in any country charge an extra conversion charge or international transaction charge everytime u pay by card whereas in upi its one time just like forex. But yeah its personal pref at the end. May u prefer card more than mobile digital payments. Thats ok too. Lol, the problem isn't foreigners not being able to pay for street food :). It is that several hotels, airlines, Zomato, Swiggy, Zepto, hospitals etc etc don't accept foreign bank cards."
}