{
    "id": "16mopkr",
    "title": "‘God has chosen me to empower women,’ says Modi as govt tables Women’s Reservation Bill in LS",
    "url": "https://theprint.in/politics/god-has-chosen-me-to-empower-women-says-modi-as-govt-tables-womens-reservation-bill-in-ls/1768472/",
    "selftext": "“Perhaps God has chosen me for this sacred work, to empower women and harness their power. Once again, our government has taken steps in this direction,” he said.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 122,
    "created_utc": 1695123761.0,
    "convurl": "https://external-preview.redd.it/a_xBkp70LWuxMoOydgPG5rjGKNVHcW9sDt7RkITHN9A.jpg?auto=webp&s=20b887a45afd6c9e711ceed33e59f93795d62f9c",
    "comments": [
        "Self anointment soon after 24 elections",
        "Jashoda ben agrees?",
        "मणिपुर में कोई महिला नहीं है?",
        "Yeah... please do something on rape crimes.. they are women not buffalos",
        "sry  no can't do, , God did not say anything about that 😜",
        "Modiji even Brij Bhushan's laughing .Aur please apna standup jokes weekend khe liye rakho na ..",
        "He started empowering women when he left his wife and used his mother for political brownie points. Such empowerment, much appreciation.",
        "The credit goes to **Perhaps God**.",
        "Fucking insane amount of shamelessness my word hahahaha. This dude and his dogs are laughing at us Indians.",
        "Somebody say manipur women ?",
        "> मणिपुर में कोई महिला नहीं है?\n\nThere are no women in Manipur?",
        "No need to wait for self anointment. Some are already seeing him as god:\n\nhttps://old.reddit.com/r/india/comments/16k7xvr/modiadani_love_affair_remark_supreme_court/",
        "First Empowered Woman - His wife - jasodaben, whom he denied as wife and claimed himself as Bramhachari.",
        "Women everywhere are vigilant. Women in India are hyper-vigilant. They see through these empty words far better than his male andh-bhakt following.",
        "I thought he was the god",
        "https://preview.redd.it/1gh2kfshs7pb1.jpeg?width=360&format=pjpg&auto=webp&s=54df1781f6ecf0f2593b6b8d4bb13627cec539a2",
        "His wife was empowered after he left her .... \n\nHe is right god chose him to empower women",
        "r/shitmodijisays",
        "Crazy talk, but I guess womens reservation will finally become a reality.",
        "Modi ji ki wife ka kay? Shaddi kar ke, nikaal liye Himalayas.",
        "Lord Vishnu cosplay in next parliament session?",
        "2024: God has chosen me to wear this golden crown.",
        "Don't forget his blindness towards Manipur victims.",
        "Fuckin shameless",
        "Ahh, where did I hear this before?",
        "Such a drama queen !!",
        "Women wrestlers might be shedding tears of joy and thanking god./s",
        "Kuki women who were protesting outside Amit Shah's residence say hi",
        "Which means he thinks he has chosen himself.",
        "While Manipur victims, Bilkis Bano etc watch in silence and tears.",
        "This is certainly a sentence.",
        "If only they were cows /s",
        "100s of women were gangraped in the post Godhra riots while the CM played the fiddle. Wish God had chosen him then to empower women. \n\nOne does pity the morons who believe this level of rando BS.",
        "https://preview.redd.it/4zdbzi9be8pb1.jpeg?width=1080&format=pjpg&auto=webp&s=97459f25d3ee2f7a41a7ff601fe5794a0ab54d0d",
        "Words of wisdom by a person who planned early acquittal of rapists and mass murderers.",
        "This guy is on some other high",
        "A+ grade shameless hypocrite.",
        "Do they? My best friend is a woman, she does not comment about this but still votes for them because Sitaraman is the best FM we have ever had and above all she is a woman.  If she was praising Sushma Swaraj I could at least accept it, but Sitaraman. My God.",
        "What an egomaniac this man has become. All the bhakti from his bhakta gan has gone to head.",
        "I read that as clown.",
        "Just not Bilkis and the million other women who have been tormented by evil men and the government",
        "I know it wont come into effect until 2029 etc etc…but this is indeed a positive step. The moment we have more women in the legislature, I expect the efficiency and sensibility of the lawmakers as a whole to receive a boost no matter what their party affiliations are.",
        "I know it wont come into effect until 2029 etc etc…but this is indeed a positive step. The moment we have more women in the legislature, I expect the efficiency and sensibility of the lawmakers as a whole to receive a boost no matter what their party affiliations are.",
        "SS Rajamouli taking notes for next movie dialogues",
        "I, like others calling this move a bluff, don't understand why is a census needed for this? And they've said after delimitation as well, which is definitely going to be fought tooth and nail by the southern states",
        "Kabhi kabhi lagta hai apunich bhagwan hai",
        "Stupids have chosen you to drain India for Adani",
        "Women's reservation though looks good not sure if it serves in purpose in India. \n\nAtleast with corporation elections, women's reservation exists. I am a Bangalorean and been in multiple wards with women corporators.\nWhen seats get women's seat it's the wife of ex-corporator who contests, the labels on boards don't change, you never get to meet these women, it's their Husbands rule all the way.\nNow it will be wives/daughters of ex-MPs.",
        "More power to Jashodaben !",
        "Jab chicha ne ghar walio ko he nahi chora to bahar wali ki kya izzat.<br>\nWhen he didn't spare his close one, how can you expect any empathy from him for unknowns.",
        "Just make him a saint already.",
        "At this rate he might end in mental asylum soon .",
        "https://preview.redd.it/32n1lu5hk9pb1.jpeg?width=600&format=pjpg&auto=webp&s=9f277617f98d87eb4438378070db70bd631bdb94\n\nOne of those empowered women by Modi",
        "George W Bush?",
        "Guest is like god, your parents are like God, modiji is like God.\n\nYour parent who happens to be modiji is like God and happens to be a guest.",
        "Even middle aged and elderly women have the chalta hai attitude. They don’t want to punish those in power for their blunders because “the other parties are just as bad”.  \nNo wonder Indians can’t even train their dogs. They give positive reinforcement to the government for doing substandard work instead of giving negative reinforcement by changing the elected government and demanding better standards",
        "His wife also chose him as a husband. And still he abandoned her!!!",
        "The man abandoned his wife and made his 90 year old mother stand in queue for a photo-op. \n\nHe going to bring back manusmriti and sati!",
        "There will always be anecdotal anomalies.\n\nAnd there are of course a percentage of women who due to conditioning identify more with their superficial social groupings which makes them vote for the party.\n\nHowever, the women who don’t vote for the party, whom the party is trying to influence with these moves, won’t fall for such tactics.",
        "Start with financially compensating your wife for abandoning her.",
        "He is very modiest about it.",
        "Oh I see what you mean. No new people will be wooed. That I would agree with lol.",
        "Come on. How much narcissistic one person can be?",
        "yeh kaisa neech insaan hai. Apni hi chatte chatte thakta nahi.",
        "Beti bachao beti patao",
        "Of course god would choose a man to empower women.",
        "Didn't somebody rape a cow in haryana or something , even cows aren't safe apparently",
        "They’re sad, so Mudiji is doing his best to give them something to laugh about.",
        "unfair to say he played fiddle. he got the rapists released!",
        "She is though victim of Modi and her parents though. Mudi uncle was a kid when he got married off",
        "Which god though?",
        "Did he say that in English? If he spoke in Hindi, what was the Hindi statement?",
        "एकपापी धूर्त मक्कार शातिर कमीना आत्ममुग्ध\nघटिया सेभी घटिया आदमी जो बीबी को निस्सहाय छोड़ कर भागगया हो वो बहुतही बेशर्मी से संसद में कहता है\nकि भगवान नेमुझे महिला उद्धार के लिये भेजा है किसी ने उसे टोका नहीं कि अबे\nचादरमोद पहले अपनी बीबी को तो अपना ले फिर बाक़ी महिलाओं की बात करना"
    ],
    "cleaned_text": "god chosen empower women says modi govt tables womens reservation bill ls perhaps god chosen sacred work empower women harness power government taken steps direction said ",
    "cleaned_title": "god chosen empower women says modi govt tables womens reservation bill ls",
    "cleaned_selftext": "perhaps god chosen sacred work empower women harness power government taken steps direction said",
    "cleaned_comments": "self anointment soon elections jashoda ben agrees yeah please something rape crimes women buffalos sry cant god say anything modiji even brij bhushans laughing aur please apna standup jokes weekend khe liye rakho na started empowering women left wife used mother political brownie points empowerment much appreciation credit goes perhaps god fucking insane amount shamelessness word hahahaha dude dogs laughing us indians somebody say manipur women women manipur need wait self anointment already seeing god first empowered woman wife jasodaben denied wife claimed bramhachari women everywhere vigilant women india hypervigilant see empty words far better male andhbhakt following thought god wife empowered left right god chose empower women rshitmodijisays crazy talk guess womens reservation finally become reality modi ji ki wife ka kay shaddi kar ke nikaal liye himalayas lord vishnu cosplay next parliament session god chosen wear golden crown dont forget blindness towards manipur victims fuckin shameless ahh hear drama queen women wrestlers might shedding tears joy thanking gods kuki women protesting outside amit shahs residence say hi means thinks chosen manipur victims bilkis bano etc watch silence tears certainly sentence cows women gangraped post godhra riots cm played fiddle wish god chosen empower women one pity morons believe level rando bs words wisdom person planned early acquittal rapists mass murderers guy high grade shameless hypocrite best friend woman comment still votes sitaraman best fm ever woman praising sushma swaraj could least accept sitaraman god egomaniac man become bhakti bhakta gan gone head read clown bilkis million women tormented evil men government know wont come effect etc etcbut indeed positive step moment women legislature expect efficiency sensibility lawmakers whole receive boost matter party affiliations know wont come effect etc etcbut indeed positive step moment women legislature expect efficiency sensibility lawmakers whole receive boost matter party affiliations ss rajamouli taking notes next movie dialogues like others calling move bluff dont understand census needed theyve said delimitation well definitely going fought tooth nail southern states kabhi kabhi lagta hai apunich bhagwan hai stupids chosen drain india adani womens reservation though looks good sure serves purpose india atleast corporation elections womens reservation exists bangalorean multiple wards women corporators seats get womens seat wife excorporator contests labels boards dont change never get meet women husbands rule way wivesdaughters exmps power jashodaben jab chicha ne ghar walio ko nahi chora bahar wali ki kya izzatbr didnt spare close one expect empathy unknowns make saint already rate might end mental asylum soon one empowered women modi george w bush guest like god parents like god modiji like god parent happens modiji like god happens guest even middle aged elderly women chalta hai attitude dont want punish power blunders parties bad wonder indians cant even train dogs give positive reinforcement government substandard work instead giving negative reinforcement changing elected government demanding better standards wife also chose husband still abandoned man abandoned wife made year old mother stand queue photoop going bring back manusmriti sati always anecdotal anomalies course percentage women due conditioning identify superficial social groupings makes vote party however women dont vote party party trying influence moves wont fall tactics start financially compensating wife abandoning modiest oh see mean new people wooed would agree lol come much narcissistic one person yeh kaisa neech insaan hai apni hi chatte chatte thakta nahi beti bachao beti patao course god would choose man empower women didnt somebody rape cow haryana something even cows arent safe apparently theyre sad mudiji best give something laugh unfair say played fiddle got rapists released though victim modi parents though mudi uncle kid got married god though say english spoke hindi hindi statement",
    "light_cleaned_title": "‘God has chosen me to empower women,’ says Modi as govt tables Women’s Reservation Bill in LS",
    "light_cleaned_selftext": "“Perhaps God has chosen me for this sacred work, to empower women and harness their power. Once again, our government has taken steps in this direction,” he said.",
    "light_cleaned_comments": "Self anointment soon after 24 elections Jashoda ben agrees? मणिपुर में कोई महिला नहीं है? Yeah... please do something on rape crimes.. they are women not buffalos sry no can't do, , God did not say anything about that 😜 Modiji even Brij Bhushan's laughing .Aur please apna standup jokes weekend khe liye rakho na .. He started empowering women when he left his wife and used his mother for political brownie points. Such empowerment, much appreciation. The credit goes to **Perhaps God**. Fucking insane amount of shamelessness my word hahahaha. This dude and his dogs are laughing at us Indians. Somebody say manipur women ? > मणिपुर में कोई महिला नहीं है? There are no women in Manipur? No need to wait for self anointment. Some are already seeing him as god: First Empowered Woman - His wife - jasodaben, whom he denied as wife and claimed himself as Bramhachari. Women everywhere are vigilant. Women in India are hyper-vigilant. They see through these empty words far better than his male andh-bhakt following. I thought he was the god His wife was empowered after he left her .... He is right god chose him to empower women r/shitmodijisays Crazy talk, but I guess womens reservation will finally become a reality. Modi ji ki wife ka kay? Shaddi kar ke, nikaal liye Himalayas. Lord Vishnu cosplay in next parliament session? 2024: God has chosen me to wear this golden crown. Don't forget his blindness towards Manipur victims. Fuckin shameless Ahh, where did I hear this before? Such a drama queen !! Women wrestlers might be shedding tears of joy and thanking god./s Kuki women who were protesting outside Amit Shah's residence say hi Which means he thinks he has chosen himself. While Manipur victims, Bilkis Bano etc watch in silence and tears. This is certainly a sentence. If only they were cows /s 100s of women were gangraped in the post Godhra riots while the CM played the fiddle. Wish God had chosen him then to empower women. One does pity the morons who believe this level of rando BS. Words of wisdom by a person who planned early acquittal of rapists and mass murderers. This guy is on some other high A+ grade shameless hypocrite. Do they? My best friend is a woman, she does not comment about this but still votes for them because Sitaraman is the best FM we have ever had and above all she is a woman. If she was praising Sushma Swaraj I could at least accept it, but Sitaraman. My God. What an egomaniac this man has become. All the bhakti from his bhakta gan has gone to head. I read that as clown. Just not Bilkis and the million other women who have been tormented by evil men and the government I know it wont come into effect until 2029 etc etc…but this is indeed a positive step. The moment we have more women in the legislature, I expect the efficiency and sensibility of the lawmakers as a whole to receive a boost no matter what their party affiliations are. I know it wont come into effect until 2029 etc etc…but this is indeed a positive step. The moment we have more women in the legislature, I expect the efficiency and sensibility of the lawmakers as a whole to receive a boost no matter what their party affiliations are. SS Rajamouli taking notes for next movie dialogues I, like others calling this move a bluff, don't understand why is a census needed for this? And they've said after delimitation as well, which is definitely going to be fought tooth and nail by the southern states Kabhi kabhi lagta hai apunich bhagwan hai Stupids have chosen you to drain India for Adani Women's reservation though looks good not sure if it serves in purpose in India. Atleast with corporation elections, women's reservation exists. I am a Bangalorean and been in multiple wards with women corporators. When seats get women's seat it's the wife of ex-corporator who contests, the labels on boards don't change, you never get to meet these women, it's their Husbands rule all the way. Now it will be wives/daughters of ex-MPs. More power to Jashodaben ! Jab chicha ne ghar walio ko he nahi chora to bahar wali ki kya izzat.<br> When he didn't spare his close one, how can you expect any empathy from him for unknowns. Just make him a saint already. At this rate he might end in mental asylum soon . One of those empowered women by Modi George W Bush? Guest is like god, your parents are like God, modiji is like God. Your parent who happens to be modiji is like God and happens to be a guest. Even middle aged and elderly women have the chalta hai attitude. They don’t want to punish those in power for their blunders because “the other parties are just as bad”. No wonder Indians can’t even train their dogs. They give positive reinforcement to the government for doing substandard work instead of giving negative reinforcement by changing the elected government and demanding better standards His wife also chose him as a husband. And still he abandoned her!!! The man abandoned his wife and made his 90 year old mother stand in queue for a photo-op. He going to bring back manusmriti and sati! There will always be anecdotal anomalies. And there are of course a percentage of women who due to conditioning identify more with their superficial social groupings which makes them vote for the party. However, the women who don’t vote for the party, whom the party is trying to influence with these moves, won’t fall for such tactics. Start with financially compensating your wife for abandoning her. He is very modiest about it. Oh I see what you mean. No new people will be wooed. That I would agree with lol. Come on. How much narcissistic one person can be? yeh kaisa neech insaan hai. Apni hi chatte chatte thakta nahi. Beti bachao beti patao Of course god would choose a man to empower women. Didn't somebody rape a cow in haryana or something , even cows aren't safe apparently They’re sad, so Mudiji is doing his best to give them something to laugh about. unfair to say he played fiddle. he got the rapists released! She is though victim of Modi and her parents though. Mudi uncle was a kid when he got married off Which god though? Did he say that in English? If he spoke in Hindi, what was the Hindi statement? एकपापी धूर्त मक्कार शातिर कमीना आत्ममुग्ध घटिया सेभी घटिया आदमी जो बीबी को निस्सहाय छोड़ कर भागगया हो वो बहुतही बेशर्मी से संसद में कहता है कि भगवान नेमुझे महिला उद्धार के लिये भेजा है किसी ने उसे टोका नहीं कि अबे चादरमोद पहले अपनी बीबी को तो अपना ले फिर बाक़ी महिलाओं की बात करना"
}