{
    "id": "1bwepys",
    "title": "Gang rape survivor shunned from school, denied boards admit card",
    "url": "https://i.redd.it/lzs3c4702nsc1.jpeg",
    "selftext": "She had been enduring this pain and humiliation for 5 months. Being born a woman in India is a curse.",
    "flair": "Crime",
    "score": 10013,
    "num_comments": 500,
    "created_utc": 1712313119,
    "convurl": "https://i.redd.it/lzs3c4702nsc1.jpeg",
    "comments": [
        "Man that's fucked up",
        "This school needs to be shut down.",
        "and its principal publicly executed",
        "I swear this country hits new low every day",
        "This is the perfect answer to why are sexual assaults in India underreported.",
        "There's lots to unpack in all this... but the principal should be especially ashamed of herself with how she's dealt with this whole thing.",
        "Bc bulldozer laao, aur school gayab.bade aaye saale ghatiya mentality",
        "Principal is a woman. Shouldn't she be supportive of the girl?",
        "“School” is a funny a funny name to spell “panchayat”.",
        "Being born in India is a curse, coz either you'll be born a woman, or someday have a woman in your life in whom your life lives. \n\n\nIt is just shameful, just pathetic and shameful\nFirst a traumatized child, and now they wanna exclude her from society, take her right of education. What are you trying to turn them into??? \nSuch pathetic mentality",
        "Not surprised. This Is what BJP wants",
        "r/facepalm",
        "Such a shame. I agree. The school needs to be shut down after public humiliation.",
        "By this logic, humans should never have wars, never commit crimes.\nMother-in-laws and daughter-in-laws should never have issues between them.\nVictim-blaming and shaming should never happen.\n\n\nDoesn't work like that. I wish it did, but it never does.",
        "This is horrifying on so many levels. We call these places \"schools\"? \n\nNo wonder that so many people turn out to be like this, always victim shaming. Always trying to ignore the real problem. Always making the life of an SA survivor much worse. A principal like that should not be anywhere near the education system.",
        "Collector of the city should take action on school",
        "What the actual fuck. Please shut down the school and throw the principal out",
        "Name them, shame them and get them fired. Motherless dogs.",
        "India needs to be shut down. smh",
        "Because she is a woman? What logic is this? By this logic, any man should not get lynched by a mob full of stinky men?",
        "The school authorities have rapist mentality.",
        "Why cause women = good ?",
        "Looks like you haven't seen some of the women judges' decisions on rape survivors.\n\nI have personally seen money blocking any sense of morality/humanity/ethics. It's all good unless it's your kid.",
        "It's Normal. Ramrajya chal raha hai udhar. Now she have to give agnipariksha, then board exams.",
        "Bloody we as a society have failed!!!\nShameless people who are unable to emathise the poor girl, the least they could do is treat her fair.\n\nThey don't deserve to be humans, forget being headmaster/principal!!",
        "I am just baffled, man. What the actual fuck.\n\nHow can you see someone go through something this traumatic and basically go, Yeah, let's make it worse for them.\"",
        "That's because humans divide themselves in groups and view the other groups as something not human, as animals. \n\nIf everyone view everybody else in the same calibre as they view their own family and friends, we wouldn't have man on man violence. \n\nBut caste, gender, religion, race prevents us to view the other human being as a human being. It'll change.",
        "It's like we live with animals. Things like emotions or compassion or basic human decency are foreign concept inke liye.",
        "Relegios cunts hit new low",
        "The solution to mediaeval practices and thinking is not mediaeval punishment",
        "because empathy",
        "\"May spoil the atmosphere\"\n\n\nWe always teach the world that Indians have Cultural, Ethics and Morality I think we have a lot to learn",
        "how is bjp at fault here?",
        "School administration should not be allowed in school as \"they are spoiling the atmosphere\".",
        "Peak Rajasthan moment.",
        "Off karke on karo, dekho kuch kaam kare.",
        "The fuck bro this shit is serious, fuck that school",
        "The school's actions necessitate prompt governmental intervention.",
        "Lodu is mein religion kaha se aagaya",
        "But men have empathy as well",
        "And a male principal can't show empathy?\n\nSex of the principal doesn't matter. They are a shitty person.",
        "First of all, why the fuck does it matter if she is a rape survivor or not, education is for all, whatever legal battle they may be going through.\nSecond of all, why is the victim being boycotted by the school? What kind if mentality do they have, i want to hear their excuse. This treatment should be given to those disgusting men who did this.",
        "India seems like the most pro-rape country in the world. It's so messed up.",
        "When people ask why don’t victims come forward? This is why, cause telling the world and society will only shame them and treat it as if it’s their fault. Fuck this society",
        "they do, not denying that. the person you replied to meant that since such a huge number of women face sexual assaults on varying levels on a daily basis (not saying that men dont face it), you would expect a woman to be automatically empathic towards a rape victim.",
        "blud i clarified this in another comment, women are expected to be more empathic towards rape victims, which is why the commenter said what they did. never said men cant show empathy",
        "or because they know what the condition of students in their school is. have you seen 16 year olds on instagram calling anyone anything? they don't know the weight of their slurs and abuses and how it impacts someone. what if they did more harm to the girl who just survived? i know that she should be allowed and there must be a way to make her comfortable again but what i'm saying is also not wrong. i'm ready to be downvoted.",
        "What can we indians do to make the change we want to see man? Sick and tired seeing articles like these. There are some inherent and serious societal/cultural problems with this country (and statistically stemming from the north aka dumpster land).",
        "As a woman, from my experience, they can be the biggest cunts when trying to uphold sanskaari life. Most of the cultural shaming and schooling I've faced are from women. Men aren't  good either but it hurts and enrages you more when women pull the \"sanskaar\"tag on you. Ask any Indian women, most of them would share the same opinion.\n\nSo never understood this B&W, women-victim/men- aggressors binary concept Western feminists try to push. Patriarchy favours men and gives them power, yes, but it is upheld and defended by both men and women",
        "Ek ladki ki to jindagi barbaad ho gayi, baaki ke students ko kyun punish kar rahe ho bhai?",
        "So no Beti bachao and no Beti padao",
        "so its her fault she got raped?",
        " now u will blame her clothes?",
        "Only in India,\n\nRape happens throughout the world but it is only in India where the victim is blamed and shammed.",
        "Ok, if that's what you meant, I can understand. \n\nYou can edit your comment clarifying this so no one else misunderstands 👍",
        "You underestimate how misogynistic women can be toward other women. The patriarchy and power exists because these older females assume themselves to be the bastion of \"culture\" reserving the right to shame women. It's wild. These very women will suck up to men, tolerate being taken advantage of by their husbands and yet still punch the victim. Older women are THE worst when it comes to pampering men.",
        ">Ek ladki ki to jindagi barbaad ho gayi\n\nZindagi barbaad kardiya gaya because of no justice provided by courts and education system. A very strict action must be taken so that schools takes these matters seriously.",
        "Pandey first. Woman second.",
        "Agreed",
        "No longer wanted to live in country fool of such people. Will definitely move out from India.",
        "The lesson for young girls is if you’ve not finished school yet and you get raped, don’t complain. Think about it next time someone talks about men’s rights and how the law is against men.",
        "Google Maps link to Acme Academy Ajmer? Wanted to leave a shit review but I can't find it",
        "100% agree. The amount of internalised misogyny they have is insane. They desperately need therapy because each of these women is hateful to a point where they need to be institutionalised.",
        "Maybe it's time to get out of your phone and explore the rest of the world",
        "\"laws are in favor of women\" crowd is always eerily silent when something like this happens. Where is the law protecting this girl and her rights?",
        "Lol, sad",
        "How exactly are the other students being punished? How stupid you have to be to blurt out such things without thinking!? \n\n>to jindagi barbaad ho gayi,\n\nFirstly, how did you come to this conclusion? \n\nJust because the girl has been raped, it shouldn't  mean that her whole life should come to a standstill. Very clearly, her family is supporting the girl. \n\nThe one who's image and life should be ruined is her fucking uncle, who raped a minor girl.",
        "Get the principal arrested",
        "Laws only favour those who are rich or work in the ruling party",
        "Exactly.!",
        "Isme bhi religion le aaya bhai?",
        "India is not for anybody",
        "School is meant to boost students esteem n not to show back when some crime takes place !🤷‍♀️",
        "Most of parents force schools to do this",
        "Family is quite subjective... Given the highlight here that her own perverted blot uncle committed the crime...",
        ">Acme Academy\n\nKaisa Looney Tunes wala school banaya hain?",
        "What the hell!. What's her fault.? Are they even serious. Is it what they are teaching in their school.Like India is really not for beginners. This statement is making more sense day by day. I feel so bad for her.",
        "To be honest , yes. As a woman, you have to be more conscious of what's happening around you. Todays modern women wear revealing clothes, try to expose themselves more etc that they dont see the consequences. Men are shameless creatures, if they find anything attractive they will tear them up.",
        "Kya bakwas hai ye! There is no such stats or research. Automatically empathetic sounds like some syndrome.",
        "Exactly and principal and other authorities need to be fired and held accountable",
        "Country is filled with shameless misogynistic cunts(especially in powerful positions). Nothing short of a cultural revolution can fix shit.",
        "Its a FR Violation. Way to sc.",
        "What a convenient way for people to commit such atrocious crimes. If the woman says it out loud her whole life will be ruined, what a great set of morals we have.",
        "And then they ask women to report about it! It's fkn disgusting",
        "Goddamn,the rage I am feeling against that school... Schools aise hai toh bc ... Bache toh,kya hi sikhate honge ye log...",
        "Scah hi tho bol raha hu hindu Muslim chodne vale hi yah rape victims ko victim blame karthe Hai \nProve me otherwise",
        "Indians are pro at victim blaming",
        "This is highly ridiculous, when will education institutions realize that they have been set up to provide education and not to fulfil unrequired roles of moral police, and tbh there lies no proportionality of the victim's presence in spoiling the atmosphere, rather the principle should be kicked out for her presence in the school is the actual question. Education is supposed to bring about a change in the society, it is supposed to give social equality to everyone regardless of anything. This pathetic behaviour pretty much sums up why there are so many underreported cases of not just sexual assualts but so many other things too in India.   \nI wonder where this country is heading.",
        "Yes, Rajasthan",
        "India moment. All this while you have a space program",
        "Just tell me you wrote that as sarcasm or something...becoz if not, I can't tell you how sick that comment made me feel.... 17 sal ki bachi kachra fenkne gayi thi, uske UNCLE utha k leke gaye usko.. But the girl is at fault becoz she should be conscious about her surroundings, her clothes, how much she's exposing, right???... Wtffff",
        "Ram rajya",
        "I knew this was India without any other information than the title.",
        "This political drama about temples and all of it is total crap and India can not see daylight unless she worships the GOD of Righteousness.",
        "And stealing and all sorts of crimes.",
        "Can't disagree",
        "Agreed, maybe staying out of school was for the best but not giviny board exams? There's no logical justification for that.",
        "They should be suing the school for all it's worth",
        "plot twist principle is booman.",
        "Older generation were the peak pick-mes, resulting in these current generation of miserable pickmeishas. I swear women like these are our own enemy.",
        "Sare jaahan se acha ********",
        "How is it sarcasm? Im not joking, as a man, I understand what other men like. Ofcourse I would never do something like that but you have to see from a mans perspective. Jyada flaunt karne se yahi hota hai. You never know how the girl would have behaved or what the girl did to make the uncle react like that.",
        "Boomen being other boomen's worst enemy.",
        "Meanwhile the the rapists are probably on their way to become politicians",
        "Ha.. 🤦🏻and people say we’re moving towards a developed country.",
        "Toh bhai ye batao uska board ka admit card rok ke kaunse student ko aap punishment se bacha rhe ho. \n\nReally no logic that kid is already suffering okie dokie lets take education away from her. Such down abysmal mentality. Bhai time machine banao aur khud ko 200 saal pehle pohoucha do ye thinking 2024 ki ho hi nhi sakti. Should be ashamed of yourself",
        "I remember when I was a kid in the 6th std, the principal made an announcement during the morning assembly that if any student had anything to do with the courts or the police would be expelled without notice. 2 teachers were later found to be child rapists and were arrested (whole 2 years after the incident) . It was the best school in the area and hence had unquestioned power. The same principal was later found to be a serial rapist and had sexually harassed female teachers. He was ousted by the board but never arrested.",
        "It always works",
        "Kyonki they are at risk. This is not the kind of school anyone should be sending their school too.",
        "Behenchod challang marle building se",
        "I think woh kehna chahata hai ki agar school band ho jayega toh baki ke bacho ki life pe asar padega for some reason.",
        ">So never understood this B&W, women-victim/men- aggressors binary concept Western feminists try to push.\n\n'Extreme Feminine' , not Feminism.",
        "\"Blame every atrocity on religion for some reason\"",
        "You underestimate the misogyny of Indian women. Many times men don't have to do anything to abuse and control women and enforce patriarchy, because other women will do it for them. ",
        "What the comment is trying to say is she wouldve understood the pain the student is going through better",
        "true",
        "feelings dont need to have stats or research.",
        "Man there’s no winning, is there? Forget progress, the country is running backwards.",
        "Moreove the principal is female, maybe that's the reason feminists are quite till now",
        "Sorry to say but animals are way better than us",
        "Yea mb",
        "This is the kind of people who will be provoked by my comment.",
        "It's not about punishment.",
        "Principal needs to be beaten",
        "im not indian, east european but my grandma grew up in a basement with her family and lived like a dog so she has seen life and she told me when dad told her i was gonna be born a girl that she cried and weeped because she thought i was gonna get so abused. i live in the capital so im sheltered of abuse in many ways, i didnt have the bad life she had. I thought she was just crazy and misogynistic but she didnt hate me to cry i was gon be female because of the gender. And she cried because it was the truth im just privileged class. i didnt know.",
        "My cousin got sexually molested for a couple of years by one of the contractual staff of a very famous school in Mumbai. The one where multiple famous Indian sportsmen are alumni. Still, she had to change the school even though the perpetrator was in Jail.",
        "It's 2024 ffs, when will things change? After 500 years?",
        "Istg these people are everywhere",
        "It was her uncle.",
        "If you don’t like this, vote for Congress in this election. \n\nBJP promotes and encourages rapists. They need to be taught a lesson.",
        "This makes me wanna break my phone 📱",
        "The biggest hindrance to progress comes from women who want to continue to upload patriarchy.",
        "Twitter",
        "im eastern european but had a female teacher with joy every time she brang me to tears. like males beat other males females beat other females but mental terror is more frequent because our proportions are bad for fighting with an untrained body",
        "First 12th boards already ho chuke he read the article she already missed 12th board that were held in march. Meaning this was a supplementary exam and not many students give supplementary exams how difficult it is to accommodate one girl. She would not have met ANYBODY from her school. \n\nThis 12th board is what will set her life if she is not given this opportunity there will be no college or employment options for her. \n\n12th board exam centres are literal schools if she cannot sit with other students they can let her sit and write in the school library where no student could meet her. The thing is solutions are there but because of the misogynistic mentality of people this poor kid would lose her opportunity. At this point you are not looking out for her you are leaving her to suffer.",
        "Anyone knows Google Maps link for the school?",
        "That's a shame on our society 🥺",
        "people act stupid there are evolutional reasons for that i wont get into because i have a headache",
        "Western feminism doesn't claim that women are innocent in patriarchy. What do you think the term \"pickme\" means?",
        "Bro any fucking sane person will be provoked by your comment.",
        "It's Misandry now not feminism",
        "Typical Indian moment",
        "Ask in Ajmer or Jaipur's subreddit.",
        "Maybe it's time for you to fix ur dying economy driven by immigrants than commenting about our space mission",
        "What's going on man.... Is this the new world we livin",
        "Patriarchy is designed to give a FEW men power, the dominating ones or the elders....men and women both are affected due to patriarchy men are affected due to certain expectations of how men should behave how they should man up and not show emotions, how they should provide and that's all a man is supposed to do..it deteriorates mental health and its oppressive to both men and women",
        "In cases like this, I'm completely in favor of the name and shame strategy. Blast this school on social media, and let people see just how shit they are, and how scummy people like this are. Maybe then they'll get their heads out of their own asses",
        "YES, BULLDOZER!",
        "Ah yes, no surprises here. It's India after all.\n\nThe biggest shithole on the planet, full of smelly, disgusting pajeets.",
        "there is no need to demolish school , it the staff member and principal that have pseudo thinking and should be punished",
        "Okay, don't get carried away in the moon mentality. I think bulldozing the school sends the message 😁",
        "Le Reddit moment",
        "Should have worded it better.",
        "The kids still need a place to learn, however punitive punishment should be dealt to the principal.",
        "But aren’t rape and misogyny genderless?",
        "Another typical day in india",
        "This makes me want to kill myself just from reading it  \nfuck is wrong with this world",
        "India is fucked up. Natural selection where are you?",
        "We don’t need any religion",
        "Why does this keep happening",
        "This school should shut down and the administration needs to be prosecuted for being abhorrent monsters.",
        "School ke administration pe action hona hi chahiye, but the school also supports a lot of other kids, unke career ko daanv pe lagana chahte ho apna gussa nikaalne ke liye? \n\nJaahilon jaisi harkat to school admin ne Kiya hai, apne gusse ke sailab me baaki students ka career barbad hoga. \n\nSchool closed means the other student also suffer. Purge the admin rather than close the school is my point.",
        "Day by day, this country is becoming more uncivilized.\nHow sad this is. She is facing too much, literally too much. \nThis is a clear violation of her fundamental rights.",
        "yeah i did not read the article. i read the headline only. just read that the school did not give her admit card, they did wrong. they should be punished for that and the punishment should be long because not sitting in exams means two years of life went to waste. i talked only about the five month matter. them not allowing her to be in school since five months. and i wrote what i saw in it which is not wrong. the kids these days don't know what they are saying until they face the consequences. they should have given her the admit card if they wished good for her",
        "Aapki Ghar mei roti fir , china degi kya .",
        "Why? And what do you mean by shutting down India? Like how does that work?",
        "School name - Acme Academy\n\nThere's a YouTube channel managed by its principal.\n\nhttps://m.youtube.com/@amitapandey2129/playlists",
        "https://m.youtube.com/@amitapandey2129/playlists",
        "Her uncle orchestrated this, omg",
        "100000000% this. I’ve been asserting this point since I was a teen !!",
        "I don't understand the rationale behind such disgusting behaviour from society. What do they think? Why do they blame the victim?",
        "So, just India being India, OK",
        "Bruh , as if Congress is any good . Don't try to put politics into everything.",
        "Fuxkthis shit bro . I hate this society. Fuck them",
        "Is anyone really surprised it's India",
        "How stupid do YOU have to be to give a knee jerk reaction without understanding the impact of your proposed action??\n\nSchool closed means the other kids suffer, specially if it's a rural school with no other nearby alternative for miles, which it appears to be... what about THEIR education?\nSablog tumhare jaise city ke chode nahi hote Hain na ke 2 kms ki radius mein 10-20 school mil jaayenge? \nSchool admin gets arrested, shamed, fined and jailed to the full extent of the law means they and they alone are punished for their retarded action. That would be a better punishment with no collateral damage.\n\nRemember these 2 words: understand their meaning and absorb their value, it will HELP in adulting:\n*Knee Jerk Reaction* \n*Collateral Damage*\nTry to avoid or lessen both.\n \nWell meaning Assholes are Assholes still. Don't be the asshole that burns down a school with innocent kids still inside it, just to punish the school's owner.\n\n\nAs for the jindagi barbaad thing that's clearly a figure of speech and often the truth with SA survivors. Unfortunately that girl may be bearing the brunt of the trauma for a long time, i wish her best wishes but she is fighting an uphill battle very bravely. They often don't end well.",
        ">this world\n\nNo, only India is \\****this\\**** fucked up and shit.",
        "Just Bharat things.",
        "Maine Aisa kuch bola kya? \n\n>Really no logic that kid is already suffering okie dokie lets take education away from her. Such down abysmal mentality. Bhai time machine banao aur khud ko 200 saal pehle pohoucha do ye thinking 2024 ki ho hi nhi sakti. Should be ashamed of yourself\n\nSchool ko jala hi do banjo, with the kids still inside, gussa shaant ho jayega, baaki ke students ko jindagi kharab ho to ho...",
        "Are isse jcb nay, dynamite se, aise bekar schools shouldn't exist",
        "Yay! Genocide! Right?",
        "The clachiol currently is Toxic af. The administration and more importantly this mentality is toxic. All such people if removed will render the school useful still for other students.",
        "I don’t know whether prohibited by law or some big goons (politicians) have there hand in management of these schools or colleges, but really the name of such places shall be mentioned publicly. So that people should know “konsi building aaj rat ko jalani h”. And m being reqlly serious.",
        "What the fuck is happening to our people???",
        "Iran, Afghanistan, Pakistan, etc also exist.",
        "As I said you should have worded your statement in a better way. The downvotes explain what any normal person might think.\n\n& coming to school being shut down, I didn't say anything about it. There's a very low chance that this might actually happen but change in administration is a MUST. \n\nNext time, choose better words.",
        "Man, India seems like a hell hole.",
        "Just watch this Oscar nominated documentary on Netflix \"To Kill a Tiger\".",
        "it’s so crazy how normal that is and how the men just get away with that type of shit",
        "So you're saying bulldoze them",
        "I have worked in the school.. and it’s probably the parents doing it. And tbh,  boys parents who are saying that the girl is now going to attract bad attention and distract them from studying.",
        "Rajasthan is the worst state in India for women",
        "That girl might have lost faith in her own family and people outside in world too. Shame on us.",
        "Women basically become the promoters of misogyny in return of the power/respect etc they get for  upholding patriarchy. This is so common (remember our chairperson of NCW downplaying the Jharkhand rape case?)",
        "This shit is beyond therapy",
        "lol so many women who aren't pick me's uphold the patriarchy. ik it makes you feel better if you think otherwise but there's a reasonit snot going anywhere",
        "Next time read the context of the comment too. I was telling the person who said the school must be shut down,that shutting it down is gonna hurt the other students who are ,like her , innocent kids. That's the entirety of the comment summarised. \nAnd all y'all knee-jerk warriors downvoted THAT.\n\nThat's on your conscience!! Not my \"word-choosery\"\n(See, I am bad at it!)",
        "Burn the school down.  Scorched earth.  Where is the fire starter when you need her?",
        "What the fuck",
        "WTF! No seriously WTF!!!!",
        "I hate this place. Will we ever stop reaching new lows?",
        "india moment",
        "I hope the remainder of those men's lives are filled with pain, suffering, and an agonizing death. \n\nHow can someone do such atrocities to a child. Then there's the school everyone involved with that ruling should lose their jobs.",
        "Sounds like Taliban ruled Afghanistan.",
        "Seems like a wonderful country.",
        "American here, but parents are from India. People say Americans are litigious, and maybe they're right, but litigiousness would end this really soon. There was a case of a rape in a Virginia school the district tried to cover up. The parents sued and immediately the tune changes. When the superintendent realizes the state will confiscate his entire life savings and all his assets for the stupid decision, people tend to shape up quickly. Just a thought.",
        "Yes https://www.google.com/maps/place/Central+Academy+School+Kotra+Ajmer,+Pragati+Nagar,+Kotra,+Ajmer,+Rajasthan+305004,+India/@26.4765774,74.5965328,16z/data=!4m6!3m5!1s0x396be780c0000001:0xd8386b98be1efc51!8m2!3d26.4775394!4d74.5964351!16s%2Fg%2F11c70fl548",
        "Well you have a point that other students life may also suffer. If boards are flexible enough to deny admit card to a student then they must be flexible enough to postpone or change exam dates. \n\nEven if that school gets demolished suddenly, those higher ups are not that poor to transfer students to other campuses. Ofc I don't support demolition but this school should be name shamed and must be bought to limelight. Serious action should be taken against this school.\n\nAnd yeah make sure that other student's lives are not disturbed as well.",
        "Never going to India, ever.",
        "The Enormous gap between How the world is vs How the world should be.",
        "as an outsider, what is happening with India? its such a tarnishment on the rich culture and history. its all ruined because of the men there. and when I think of India I no longer think of the beauty but the ugly. why do the men want to ruin women and everything.",
        "Humanity died a dozen more times simply by this callous response. Pathetic, if this is the state of our educators then not even god can help our children.",
        "Sensible comment, have a donut 🍩 on me",
        "Hopefully this will bring attention to India’s massive rape culture. They are number 1 in the world when it comes to this and it’s something that has had zero traction whatsoever. More stories like this need to come to light so that their government can actually do something about that and the myriad of other religious/political clashing they are dealing with as well.",
        "Juanita Broadrrick for your consideration",
        "What the hell! Is there no place for empathy in this world? Good that they filed a petition. The school and the good for nothing principal should face the consequences for their inability to administer properly.",
        "Now I just want to drive a bulldozer through the school.",
        "This is a reductive statement, but the concept of binary aggressors and victims comes from the subsections of radical feminist movements. Also, I should note that feminism is a school of thought and multiple movements; it wasn't and isn't a single entity and a cohesion. There were many subsections and feminist theories/movements that contradicted each other, and there have been in-fighting too within that group, like, for example, the inclusion of lesbians, which took an absurd amount of time in the feminist movements.\n \nand the redfem has a lot of problematic meterials with them too, like, for example, being anti-sex or sex-negative to the point that they act like fundamental religious groups (or even collaborate with them), and then there's the idea of \"lesbianism,\" a concept that makes sexuality a political movement. In which they say that women can only achieve liberation if they remove and segregate themselves from all men, as within patriarchy, every choice they make is rape because, from the nature of that system, they can't consent to anything. \n\nthe whole thing was disregarded by larger movements and feminist within the western feminist movements",
        "My other post will help you understand the cultural context and why this keeps happening.\n\nhttps://www.reddit.com/r/india/s/5UE0tn5VlV",
        "My other post will help you understand the cultural context and why this keeps happening.\n\nhttps://www.reddit.com/r/india/s/5UE0tn5VlV",
        "What a shit hole.",
        "My other post will help you understand the cultural context and why this keeps happening.\n\nhttps://www.reddit.com/r/india/s/5UE0tn5VlV",
        "in madarchodo ko naukri pe rakh kaise sakte hai haramkhor",
        "I was educated in a rural school, one of its kind in that it was the only one in a 20+ km radius, I had a relatively small commute: 6kms. Some had to fare far worse.\n\nIf it's a rural one, the kids and their parents may not have a comfortable choice, from the news it sounded like a village school.\n\nThe article said the education minister had taken note as well as the board and a few officials too and they are looking into how to enable her to give late exams etc.. so some hope. But no punishment has happened as yet for the school administration.",
        "Urban india is only slightly better tbh, but ya, we are miles if not light years away from any gender equality ideal",
        "It would appear they do blame the victim.",
        "Thank you, will take a look. I’m sure it’ll piss me off even more because no culture should allow this bs.",
        "My other post will help you understand the cultural context and why this keeps happening.\n\nhttps://www.reddit.com/r/india/s/5UE0tn5VlV",
        "India is a pig sty of a country.",
        "To do what? Nothing that can you say will get in their heads. Some cultures are FUBAR.",
        "Congress considers rapists as criminals atleast and doesn’t garland them or release them from prison misusing their powers.",
        "They \n\n>a few officials too and they are looking into how to enable her to give late exams etc.. so some hope. But no punishment has happened as yet for the school administration.\n\nHoping for the punishment of corrupt administration.\n\n>I was educated in a rural school, one of its kind in that it was the only one in a 20+ km radius, I had a relatively small commute: 6kms. Some had to fare far worse.\n\n>If it's a rural one, the kids and their parents may not have a comfortable choice, from the news it sounded like a village school.\n\nThanks for this Pov man 👍.",
        "To all the stupid people saying America is bad and unfair. Go live in these places. ",
        "And to all those who were involved in the decision and in shaming the girl for being gang-raped.",
        "Why do you think so many educated Indians are moving overseas? They don't wish to share the same country with these animals.",
        "Bro really, r u that delusional",
        "Hey can you provide dates for a link? The article does mentioned certain months and dates but no year so I don’t have context. In case your just trying to be awareness to the injustice happening it would benefit us to be able to reference the information .",
        "so so true my mom was doing job but she had to leave it not because my nani side of family and nani herself were ill talking about her leaving me at home. my nani also once told my sister not to read much no need to aim high as you are a girl",
        "I can't believe she was gang raped and people are being mean to her??? Not the people who raped her?? How cruel",
        "That’s on my list to watch",
        "/r/LostRedditors\n\nUnless of course you’re trying to blame the rape victim for her rape based on the assumption that she just wasn’t religious enough for divine protection. If that’s the case:\n\n/r/IAmATotalPieceOfShit",
        "Ro mat bhai. BJP ki yehi sacchai hai. Aur tujhe koi khatra nahi muslims se jo BJP ne tere mind me feed kiya hai. Tu chill kar but know that you sided with those who encourage rape and reward rapists.",
        "Why is that your answer ? You think India has another school if that one shuts down ?",
        "India is a sad excuse of a country inhabited by sad excuse of people.",
        "F India.",
        "This is not that school. That school is in chachiawas area in ajmer. It's a small school.",
        "You sure punitive punishment? Maybe that classic non-punitive punishment ",
        "It was in the papers today\n\n\nhttps://www.pressreader.com/india/hindustan-times-st-mumbai-ht-navi-mumbai-live/20240405/281947432869971\n\nhttps://www.livemint.com/news/india/rajasthan-school-refused-rape-survivor-from-taking-class-12-board-exams-heres-why-11712296223484.html\n\nAlso its not a one off, like this one from dehradun-\n\nhttps://www.hindustantimes.com/dehradun/can-t-admit-rape-survivor-dehradun-school-allegedly-told-girl-s-parents/story-zFaQhQcFRSwvyAHdLI2CSP.html\n\nIn this case, a magistrate asked a gang rape survivor to strip in court-\n\nhttps://www.hindustantimes.com/cities/jaipur-news/magistrate-booked-for-allegedly-asking-gang-rape-survivor-to-strip-in-court-101712151629135.html\n\nImagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape.",
        "When religion stops being the cause for so many atrocities, I'm sure people will stop blaming it. ",
        "its not a one off, like this one from dehradun-\n\nhttps://www.hindustantimes.com/dehradun/can-t-admit-rape-survivor-dehradun-school-allegedly-told-girl-s-parents/story-zFaQhQcFRSwvyAHdLI2CSP.html\n\nIn this case, a magistrate asked a gang rape survivor to strip in court-\n\nhttps://www.hindustantimes.com/cities/jaipur-news/magistrate-booked-for-allegedly-asking-gang-rape-survivor-to-strip-in-court-101712151629135.html\n\nImagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape.",
        "its not a one off, like this one from dehradun-\n\nhttps://www.hindustantimes.com/dehradun/can-t-admit-rape-survivor-dehradun-school-allegedly-told-girl-s-parents/story-zFaQhQcFRSwvyAHdLI2CSP.html\n\nIn this case, a magistrate asked a gang rape survivor to strip in court-\n\nhttps://www.hindustantimes.com/cities/jaipur-news/magistrate-booked-for-allegedly-asking-gang-rape-survivor-to-strip-in-court-101712151629135.html\n\nImagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape.",
        "its not a one off, like this one from dehradun-\n\nhttps://www.hindustantimes.com/dehradun/can-t-admit-rape-survivor-dehradun-school-allegedly-told-girl-s-parents/story-zFaQhQcFRSwvyAHdLI2CSP.html\n\nIn this case, a magistrate asked a gang rape survivor to strip in court-\n\nhttps://www.hindustantimes.com/cities/jaipur-news/magistrate-booked-for-allegedly-asking-gang-rape-survivor-to-strip-in-court-101712151629135.html\n\nImagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape.\n\n\nAt this point only a grassroots cultural revolution can stop this.",
        "Oh, do you know the exact school? I can’t find it but I don’t really care",
        "fr, India is so messed up",
        "This happens all the time in even 'big shot' schools in urban india.",
        "Her own family",
        "You should delete that school link as people will end up screwing its rating on Google maps.",
        "👍",
        "Thank you very much OP.",
        "Shame on the school district for not letting the student continue their studies",
        "Prosecute the school for denying her education.",
        "When my father worked a job in India, the locals were congratulating him on not having any daughters as much as they congratulated him on having two sons. Maybe even more. I kinda understand why. This shit was probably worse 20 years ago.",
        "India has a serious problem.",
        "I would love to bring the KOS culture for rapists.",
        "Just India things 🤷🏻‍♂️\n\nIt’s part of the culture at this point. Not a true Indian if you haven’t been or participated in a gang rape.",
        "If it were any other country, I'd agree.\n\nBut there, it's the national sport.  You'd be hard-pressed to find a school there where this exact scenario DIDN'T happen.  They'd have to shut down EVERY school.",
        "I have to say: I enjoyed my childhood in India and have happy memories. But am very glad, as an adult, that I live in the US. \n\nThe US has a lot of problems. But not compared to India. People out here complain a lot, they have no idea how good they have it.",
        "Honestly, there’s not much to unpack; this is just how things are in ass fucking backwards India.\n\nKidding, obviously there are things to unpack, and you have some fair points, but we still get to make fun of India for being backwards and rapey like other countries make fun of the U.S. for being obese among many things.",
        "not that u need to me tell u but please dont listen to those kinds of people , if u have potential please do aim high",
        "i mean...that works yeah",
        "Ah yes good old victim blaming and ostracization - nobody does it better than us. This is why so much of rape goes underreported and they need to suffer silently.",
        "Most of Asia, not just India.",
        "not sure how that works but yeah theres need for some massive change in peoples mentality which i doubt is coming any time soon unfortuantely",
        "yeah but..this atrocity was not committed on the basis of religion",
        "There should be enough evidence here too sue the owners of that school so bad that they'll have to grovel in front of that girl and beg her for mercy.",
        "Worst country for women",
        "I feel physically sick.",
        "I wish that whole school goes down and every single piece of shit who is involved in this go though hell",
        "and The whole administeration should be fired and banned from joining any education institution or any job.",
        "And also why it doesn't matter how many rapes other countries have and why I say that India has a deep rooted rape culture.\n\nBecause not only are the rapes commonplace and trivialized, the victims are actually shamed and mocked though out their life and made to suffer so that they silent. What's even worse is this expectation that somehow a rape survivor should be willing to sleep with anybody because they are already \"tainted\". Rape victims are frequently the subject of further rapes and rape attempts because of this reason.\n\nSeveral years ago, there was an article on the life of rape survivors. There was one story about a 14 year old girl  whose family was way laid by some goons while they were traveling and she was gang raped by them. Her school threw her out because the parents of other kids vehemently objected to her presence in the school. Her family had to relocate after that and after she joined a new school, somehow somebody recognized her has a rape survivor and spread it around and everyday she is mocked and taunted about her rape on her way to school.",
        "this backward mentality just cant be helped it seems , the older generations do love blaming this new one for all sorts of things and turns around and does this kinda stuff",
        "You're not wrong, but no political party alone can fix this. Misogyny is too ingrained in our culture.",
        "Leaving the poor to get assaulted taking out the trash.  ",
        "Yeah. But why?? Do they think the woman did it to herself with consent?! Don't they understand the definition of r*pe? Is it the malnutrition in India causing the lack of brain cells in these people?",
        "It's india so I'm not surprised, all they do over there is r@pe",
        "Worst country on earth",
        "The principal of the school in this case is a woman which makes this all the more wierd.",
        "Reasons No. 1001 why girls and their families don't report rape cases to the police!! If cases like this go on and people's attitude don't change regarding rape victims and they continued to be shunned then the future of this country is in real danger fr!",
        "waah! ye chu\\*\\*\\* padhaenge bacho ko! sharm honi chahiye puri staff ko iss college ki.",
        "Small minded people",
        "I disagree. Most of the discrimination against rape victims is because they're seen as sinners or as \"impure\". All religious hogwash",
        "> laws are in favor of women\n\nThey don't understand that even if this is true, it means absolutely nothing. In a conservative country like ours where the victim will be ruthlessly blamed and shamed for the crime, 99.9% of women just won't report it, so the laws are useless.\n\nLegally speaking, Islamic countries have some of the strictest penalties for rape, but no one would argue that these countries are a paradise for women. Society and culture influence your life a lot more than laws do.",
        "I knew this was r/India just from the headline",
        "Trust me when I say it's hopeless. The people in power are no different. There is currently not a single rational human up there and will never be.",
        "This is the world we live in. I watched a movie from India, and the girls were kidnapped and forced to be prostitutes. And the one lady who comes to talk to the girl go, what are you going to do? You can't go home, they would kill you for the shame, even if you come home untouched. So you will die if you go back, and if you don't work you will die here. So basically these Indian girls even though they are kidnapped and assaulted would be killed for allowing this to happen?! Like wtf?! Poor girls.",
        "What a horrific fucking mindset! I don’t know why I am this surprised when I should be expecting it. Fuck, these people will never let her mentally heal, ever.",
        "I once got into a debate with my older hair stylist arguing that women should be able to be president, while my hair stylist argued that women are unsuitable. I'm a guy, she's woman. It was really weird to be arguing to someone that they are my equal and for them to insist that they are not.",
        "I feel this. I remember a conversation with my grandma where she told me (verbatim) sons are better than daughters/ boys are better than girls.. I said to her “but you’re a woman! How can you think that?” Doubt I even got a response to this. I was seriously flabbergasted at that point.\n\nBut tbh over the years we were able to change her views, which was the best part❤️",
        "Of course but Congress atleast doesn’t encourage or support rapists.\n\nWe cannot remove misogyny from India overnight but we can change to govt that atleast thinks rape is wrong and rapists are criminals that they won’t release because they’re are from a particular community.",
        "India needs to be shut down, it's not just this school",
        "The school administrator or whom ever denied her, should spend the rest of their life locked away. They do not treat her as a human with compassion, why should we them.",
        "Return it to civilized British control, are any white western power.",
        "This is why I won’t go near India.",
        "Oh you mentioned Indians in a bad light. I’m surprised it isn’t being bombarded by Indian dudes who are immediately offended",
        "That's stupid af. Closing a centre of education rather than the person who did it?",
        "they r just puppets with no moral grounds. Selfish and despicable",
        "So much racism. All this while you have a space program.",
        "Classic behaviour",
        "Don't be silly, some of us pajeets smell great! Come sniff me!",
        "Sad to see.",
        "As a medical intern seeing how OBG doctors (usually women) treat their patients was very surprising. \n\nSeeing how they treat rape victims coming for medicolegal examination just makes me cry.",
        "Already know its India without looking at the sub",
        "harsash sajut singh kabal garesh no jit hit!",
        "Common misconception, misogyny has no gender",
        "Every time I hear about this country it’s something rape-related. Never stepping foot into this shithole.",
        "\"Uncle\" Not stranger, an UNCLE and his friends. \n \nAfter a year - Has the uncle or the aides been arrested? Have they had any legal actions taken against them? Has anything been done to them?",
        "Username checks out.\n\nOn a serious note, yeah this school needs to be shut down or atleast the principle deserves to be behind the bars and publicly shamed for her actions",
        "Indian dudes favorite team sport",
        "Haha, that's disgusting.",
        "Indian culture at its finest national sport rape",
        "Because people in here are majority level one reflexive thinkers that don’t think about consequences of certain “solutions”",
        "I'm all about freedom of religion and spiritual faith, but this isn't religious or faithful, it's a miserable fucking excuse of a brainwash culture that stays afloat off rape babies and weak minded men who prey on children.\n\nBut since their personal pedophile prophet condones it, that apparently means they can just escape all the consequences of their karma and not get reincarnated as what they hate most or have their actions reflected on them in the most ironic way.",
        "I read the title then saw \"Jaipur\"\nWhat a shock😐",
        "Dang India sucks and not safe for females.",
        "Its in India, check out.",
        "The whole country is not like that. Y the fek does Rajasthan and Jharkhand is always top on grapes? And india is diverse with several communities with different view as a society but because of some assholes disregarding women and conducting crime all the indian people who dont even have a say in their community has to take the blame! All we can say is stop harassment but the societal view has to change. And the state govt has to take control. There are several feminist organisations in the country do some counselling in villages and stop just barking on social media and say india is bad. Im from kerala but mu society dont even have this level of sexual harrasment against women but because of these mfs i have to face backlash as an indian in foreign land and media.",
        "Get some big strong gay dudes and let them rape the guys that did it.",
        "am boy though i was talking about my sister and mom",
        "They didn’t say India is bad. They said India hits a new low everyday. \n\nIn recent news two tourists were raped in India. The male was beaten and the women was gang raped. \n\nAre you forgetting when few men gang raped a women and shoved a rod in her and pulled her intestines out? And then left her naked, tossed her in the cold night? \n\nIndia needs to do more to protect women.",
        "You spelt burnt down wrong there my friend.",
        "I cant even imagine what she is going through mentally. Imagine having no friends, no focus for academics and not even being allowed into an institution where people who look just like you externally are accepted and due to no fault of your own. She probably had to force herself to study, with the dream of moving on with life but no, its too dangerous for other students and faculty to be in an innocent child's presence. What motivation she is going to have? Now that she is not even being allowed to take her exams. And we wonder why this country has gone to shit. If innocence of children is the price to be paid for humans to accept other humans and co exist, I say it must be paid.",
        "finally the real solution.  \nI was done when the tourist got raped when she decided to visit india after visiting so many countries unharmed.",
        "I was just thinking of leaving a shit review",
        "Yeah I too can't find the exact listing for the name that's mentioned in the article. I see some coaching class as nearest match but that looks doubtful.",
        "LOL try my school and you'll get the same result",
        "It’s India. Why are we even surprised by any of this ?",
        "Exactly. Why the heck do i have to take blame for something happened in 2000 km away from me . Plus i don’t support these assholes raping women like wtf. All i said is that there is a list of harassment happening in one or two states particularly in the north. I am from the south  all i can do for these harassed women from south is using my voice to get this on the law enforcements ears. But doing so why the heck do i have to take blame as a an Indian and have to deal with racist comments on my country.",
        "'Spoil the atmosphere'? By what fucking logic? That principal should resign asap if she has even a bit of conscience left in her",
        "I wanna burn that whole place down. In more realistic terms, that place and every authority figure involved needs to be bulldozed.",
        "That culture is a cesspool towards women",
        "This is fu*king disgusting!",
        "Headline was horrible, I was shocked until I saw where this occurred.",
        "I suggest you reread my statement. It does not suggest that pickmes are the only type of women who work to perpetuate the patriarchy. It was simply an example.",
        "The more I learn about India, the more disgusted I am.  \n\n  \nHow these fuckers have a space program....",
        "AFAIK the Magistrate got his ass sued",
        "This is sad to read like school is doing this then what should we expect from society",
        "Reason 4,000,000,001 not to ever visit that shithole, no?",
        "Have you tried turning India off and then back on again?",
        "I'm sorry you indian chicks ( and any other chicks for that matter ) have to go through shit like that, shit will get better, it always does, it just takes a while, all of this will be in the past at some point, I hope the cunts that did that get \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* let your imagination guide you with filling the spaces",
        "this country hits a new low everyday. Fuck this shithole of a place. All people do is think abt themselves and religion. Idc but the religious brainwashing in this country is out of hand. Downvote me but thats the truth. Shunning a child from school cause she was raped,  absolutely disgusting behavior by that school. Atmosphere my ass, half the kids in school are lost in their own world, atmosphere it seems.\n\nWe keep preaching about our morals and ethics and so called \"sanskaar\" or wtv the fuck it is. All talk but no action.",
        "How dare she get raped. Hope the rapists get justice.",
        "We celebrate the rapist release from jail. The victim pays a heavy price for the crime which she didn't even commit.\nWhat kind of humans are we? Are we even human?",
        "You mean Stockholm syndrome on steroids? Why?",
        "Shame on this mental attitude.",
        "\"May spoil the atmosphere\"\n\n.... i dont know what to say....",
        "When some people say rape culture does not exist just show them such incidents",
        "Cause that’s her fault, right? /s",
        "Yeah perfect solution for everything /s",
        "Safer and better for western interests",
        "That’s disgusting. Poor girl",
        "That's not a good look for the school\n\nOh, it's India",
        "Does India deeply hate women?",
        "I'm so amazed Rajasthan does not garner enough criticism for being one of the most mysogynistic and anti-woman state in india like Bihar and uttarpradesh do, probably because it doesn't have as many people or bc it has a \"unique culture\" bc of the desert and forts. But it's undoubtedly on the same fucked up level as Bihar and uttarpradesh. Even when it doesn't have the overpopulation and poverty problem, the cultural attitudes towards women en masse are extremely regressive. \n\n\nAnyways, if I was this girl i would end up hating the country, culture whatever makes india, india my entire life. She deserves to gtfo off here, marry a foreigner and spread hate and propoganda about india being the worst country for women there is on foreign podcasts. At this point, I feel like all the hate that india gets on international platforms is soo valid. ",
        "Wtf",
        "Wishing anyone who would shame or discriminate against a rape victim gets a visit from Kali.",
        "India strikes again",
        "India may be in need of a few nukes",
        "Didn't the police, in some recent incident where a foreigner got raped, asked her to remove the post, to preserve the international Image? I guess that how our fame of cultural ethics and morality was maintained since past few decades.",
        "Agreed about mob mentality, I don't believe in executions I was just very emotionally unstable when I made that comment.",
        "You are right, I was wrong. I never supported executions or retributive justice in my life, I was just very emotionally unstable when I made that comment. Still, tells you a lot about our country's mediaeval punishment mentality considering how many upvotes my underthought comment got ",
        "What",
        "What kind of incentive structure is this?",
        "Acme Academy? So this is where the Coyote orders his stuff from.",
        "Honest question- is this a newer development. I see this type of thing all the time recently but don't recall hearing about it before. Is it a lack of reporting or are things getting worse?",
        "She was brave already to face the school nd those dumbass people denied her. Most of victims are not able to face the world afterwards. The trauma stays with them forever.",
        "Wow. Just wow. No words.",
        "Isn’t there a whole class of people in Indian caste called “the undesirables” or something that are basically treated as subhumans",
        "Actually it is deeply embedded in our society which has always been there but we hide it in the name of culture\nShahbaz Ansari did an interview for The Print \"Know why Delhi is called the r*pe capital\" You will be surprised to see the thinking of an average Indian about why r*pes happen. And it is not limited to the elderly only thousands of dank memes and dark comments also exists in social media by youths",
        "Imagine the pain and struggle. Probably we should all be grateful to God today as her pain and struggle is much more than what we face.",
        "Not sure why I keep getting r/India suggested to me (not India) but holy fuck what is happening in India. The only posts I ever see are these",
        "bewakoofo ki kami nhi hai.. \nthey just want to avoid trouble (if there's any) and Don't even consider the victim's pov.. truly weird times",
        "We live in a place where being r@ped has become more of a crime than r@pe itself congrats for the progress india today finally I'm shamed to call myself an indian 👏",
        "The entire administration needs to be booted. Why is there no legal action taken against this school by education department?",
        "I feel terrible for girls and women in India",
        "We were all thinking it",
        "This is a very old low",
        "Now school will be fu*ked by people and govt.",
        "https://preview.redd.it/vtpqyccskrsc1.jpeg?width=1410&format=pjpg&auto=webp&s=88e50a556f51917915956f964fe610cad645e794",
        "Oof",
        "Yeah! We can import them to the west",
        "I will be ashamed to even stay in that school my blood would boil in pain and agony , what if the same thing happened with one of the school's authority closed one will they do the same we failed as human beings",
        "Bulldozers is only for people opposing government agenda, not people welfare",
        "I read the title before seeing the subreddit, and some how knew it was india. Sorry, not sorry.",
        "I'm a white Canadian but my wife is from India and she told me her grandmother refused tk ever touch or interact with her and this blew my mind because the grandmother is obviously also a girl. Was quite the shock to me.",
        "This is just so fucked up on so many levels. Imagine what the kid went through with the rape ordeal and now again being humiliated. The so-called adults in that school don't have an ounce of humanity.",
        "I do not want talk about those uncivilized cultures",
        "oh u mean it like that , i thought u were implying the rape was done on the basis of religion",
        "Educated Indian here.\n\nAt some point nothing one does is gonna work. Unfortunately, the country is ruled by old people that have generationally traumatized the Millennials and Gen Zs into submission and obedience, and the cycle is just gonna keep continuing.\n\n  \nThe people that are jumping ship are doing so because the ship has too much water at this point. It's pointless to try draining it of water. Instead we wait to salvage after the ship has sunk and turned into a wreck.",
        "And taking credits for other people's inventions",
        "No, the schools actions",
        "Not from India. I keep getting recommended gang rape posts here and on twitter.. Jusf saw a post about a monitor lizard got g raped . Now this. Why is a victim of a horrible crime being treated this way. This is so wild to me.",
        "Ah, just another normal day in India, am suprised they even launched an investigation.",
        "Principal needs to be gang r*%^#*",
        "wow india, you make me ashamed to have you as my home country yet again",
        "Blame those people for racism because you’re not a spokesperson for the entire country and regardless of what their views are about India, it doesn’t entitle them to be racist. Also while they are right that India has a rape culture, many use it as an excuse to exercise their general bias and hate for Indians. \n\nThat said, sure India is diverse, but it’s also one of the worst places to live as a woman and this news is just a needle in a haystack. Also, stop speaking for women in general. Tons of women in kerala face sexual harassment and it’s a part of their daily lives as well. No state here is magically exempt from this crap. Being a rape apologist is synonymous with Indian culture as it stands. And you’re displaying that here. I say that as an Indian woman living in one of the most metropolitan cities in India which is better accordingly to _men_. \n\nWhat parts of our culture are truly redeemable when women (so many are underage and children) are treated like this by their ‘own people’ because of that culture? It’s a nationwide problem.\n\nEdit after seeing your other comment: I am a South Indian woman and know many that would disagree (very angrily and be justified to do so) with you about ‘safety’ here.",
        "Fuck is wrong with people?",
        "The thing is in India government is corrupt and doesnt give a shit and so these things may not work in India unless you are from a high-class background",
        "Wth\nIs happening in this country???",
        "Women is the biggest enemy of women",
        "As a person who is middle class living in India, i also agree with you. Wanna get out of this shithole garbage dumping country and go elsewhere where people have basic common sense and civic sense but unfortunately for now im stuck here 🥲",
        "Sorry that's not gonna happen in Modi's India",
        "Those schools have connections it's ain't that easy if it's comnected with some politican",
        "Huh? How many rights are they violating here? Legally speaking, but then morally speaking, they don't deserve to live. Not only are you prohibiting a rape survivor from her education, but also from her chance to rehabilitation. BECAUSE she was raped??? 'it would soil the atmosphere'.  What the actual fuck.",
        "You mean she refused to touch her own granddaughter? That’s weird even by Indian standards - her grandmother has some mental problems.",
        "Or the principal fired at the least.",
        "such a sad state of affairs, if there is next birth for me, may god send me to a very poor family as a man but not as a women in india.",
        "Fk man, abhi recently ek maxican ka bhi rape hua tha Jharkhand me, ye kya ho raha he bc desh ko",
        "Congress ruled state. Nothing better to expect.",
        "Accha hua ...",
        "Cant even begine to imagine what that little girl is going through right now",
        "So true. Often older women and yesteryear feminists are some of the biggest allies of sexism. The \"feminism these days is baad coz of so and so...\" crowd only vouche for performative activism like education or job at max and think they'll achieve equality when patriarchy itself is literally a thought process that's nowhere weeded out.",
        "Like what? The usb which joseph stalin made?",
        "I mean why",
        "I read few news articles where women plan rape of other women as revenge. Fucking disgusting",
        "Hello!\n\nPlease name the school and Google maps link if possible. I would like to take this up from them and make them responsible.",
        "Human rights and india? Two opposite things",
        "Sale bsk",
        "Rajasthan : We defeat even the Stone Age people in barbarian terms",
        "Don't you have any shame? Bringing up politics here too?",
        "It’s her fault for tempting men to rape her.Afterall we women aren’t human beings./s",
        "Bhai tum itna frustrated nahi ho rape se. It shows. \n\nThe government is responsible for all the rapes that happens in India. \n\nIf you won’t hold them accountable, you are complicit.",
        "Men are second class citizen, all laws are anti men!! False rapes cases!!!!",
        "I love this country and all but shit like this makes me want to leave this cesspool of a country.",
        "There are a bunch of Indians who claim they invented the internet, airplane, cars, scientific theories during the ancient times.",
        "Many of them even claimed that Jesus came to India and learned from a guru lol",
        "Someone tell this to Modi on Man ki bat.",
        "That first sentence in the article is just one big run on sentence",
        "agreed. I'm indian but born in america. India's poor law system essentially means that people have to take the law into their own hands. \n\nAnd obviously, the poor personal freedoms and lack of media coverage means no accountability. While I am proud of my heritage, India is embarrassing as a country.\n\nWe got problems in the US, but India makes us look like heaven.",
        "It's always the fault of the victim ! How shameful",
        "I’m sorry but… this academy ALREADDYY sounds like a complete fucking joke, and not only THAT… BUT if also called freakin\n“ACME Academy??”Lmfao WTFFFF 🤣🤣😆😆😂😂😆😆😅😅\nWHAAAT IN THA Tom&jerry… BuggsBunny…RoadRunner&Wile E. Coyote JOKE OF A FUCKINN “SCHOOL”  IS THIS PLACE??? \nThis is a SORRY ASS EXCUSE of a supposed “Highly Esteemed Academy” …",
        "Sorry but bulldozer only for religious purposes",
        "I really hope this is addressed on a bigger scale this can’t be forgotten, the victim and her family and countless others who’ve been through the same NEED justice. Get these guys and the principal off the streets and into prison, life sentence.",
        "Being born in India is a curse.",
        "Meanwhile, the guys that raped her would be enjoying their lives... \n\nEvery rapist must be kept between life and death, make them suffer but don't give them the freedom of death. They should yearn for death, they should feel the pain that their victim has endured for eternity. Just lock them up with a big dude who will constantly rape them, just so they know how she felt, fucking bastards.",
        "Worse, other parents would probably support the school. "
    ],
    "cleaned_text": "gang rape survivor shunned school denied boards admit card enduring pain humiliation months born woman india curse ",
    "cleaned_title": "gang rape survivor shunned school denied boards admit card",
    "cleaned_selftext": "enduring pain humiliation months born woman india curse",
    "cleaned_comments": "man thats fucked school needs shut principal publicly executed swear country hits new low every day perfect answer sexual assaults india underreported theres lots unpack principal especially ashamed shes dealt whole thing bc bulldozer laao aur school gayabbade aaye saale ghatiya mentality principal woman shouldnt supportive girl school funny funny name spell panchayat born india curse coz either youll born woman someday woman life life lives shameful pathetic shameful first traumatized child wan na exclude society take right education trying turn pathetic mentality surprised bjp wants rfacepalm shame agree school needs shut public humiliation logic humans never wars never commit crimes motherinlaws daughterinlaws never issues victimblaming shaming never happen doesnt work like wish never horrifying many levels call places schools wonder many people turn like always victim shaming always trying ignore real problem always making life sa survivor much worse principal like anywhere near education system collector city take action school actual fuck please shut school throw principal name shame get fired motherless dogs india needs shut smh woman logic logic man get lynched mob full stinky men school authorities rapist mentality cause women good looks like havent seen women judges decisions rape survivors personally seen money blocking sense moralityhumanityethics good unless kid normal ramrajya chal raha hai udhar give agnipariksha board exams bloody society failed shameless people unable emathise poor girl least could treat fair dont deserve humans forget headmasterprincipal baffled man actual fuck see someone go something traumatic basically go yeah lets make worse thats humans divide groups view groups something human animals everyone view everybody else calibre view family friends wouldnt man man violence caste gender religion race prevents us view human human itll change like live animals things like emotions compassion basic human decency foreign concept inke liye relegios cunts hit new low solution mediaeval practices thinking mediaeval punishment empathy may spoil atmosphere always teach world indians cultural ethics morality think lot learn bjp fault school administration allowed school spoiling atmosphere peak rajasthan moment karke karo dekho kuch kaam kare fuck bro shit serious fuck school schools actions necessitate prompt governmental intervention lodu mein religion kaha se aagaya men empathy well male principal cant show empathy sex principal doesnt matter shitty person first fuck matter rape survivor education whatever legal battle may going second victim boycotted school kind mentality want hear excuse treatment given disgusting men india seems like prorape country world messed people ask dont victims come forward cause telling world society shame treat fault fuck society denying person replied meant since huge number women face sexual assaults varying levels daily basis saying men dont face would expect woman automatically empathic towards rape victim blud clarified another comment women expected empathic towards rape victims commenter said never said men cant show empathy know condition students school seen year olds instagram calling anyone anything dont know weight slurs abuses impacts someone harm girl survived know allowed must way make comfortable im saying also wrong im ready downvoted indians make change want see man sick tired seeing articles like inherent serious societalcultural problems country statistically stemming north aka dumpster land woman experience biggest cunts trying uphold sanskaari life cultural shaming schooling ive faced women men arent good either hurts enrages women pull sanskaartag ask indian women would share opinion never understood bw womenvictimmen aggressors binary concept western feminists try push patriarchy favours men gives power yes upheld defended men women ek ladki ki jindagi barbaad ho gayi baaki ke students ko kyun punish kar rahe ho bhai beti bachao beti padao fault got raped u blame clothes india rape happens throughout world india victim blamed shammed ok thats meant understand edit comment clarifying one else misunderstands underestimate misogynistic women toward women patriarchy power exists older females assume bastion culture reserving right shame women wild women suck men tolerate taken advantage husbands yet still punch victim older women worst comes pampering men ek ladki ki jindagi barbaad ho gayi zindagi barbaad kardiya gaya justice provided courts education system strict action must taken schools takes matters seriously pandey first woman second agreed longer wanted live country fool people definitely move india lesson young girls youve finished school yet get raped dont complain think next time someone talks mens rights law men google maps link acme academy ajmer wanted leave shit review cant find agree amount internalised misogyny insane desperately need therapy women hateful point need institutionalised maybe time get phone explore rest world laws favor women crowd always eerily silent something like happens law protecting girl rights lol sad exactly students punished stupid blurt things without thinking jindagi barbaad ho gayi firstly come conclusion girl raped shouldnt mean whole life come standstill clearly family supporting girl one whos image life ruined fucking uncle raped minor girl get principal arrested laws favour rich work ruling party exactly isme bhi religion le aaya bhai india anybody school meant boost students esteem n show back crime takes place parents force schools family quite subjective given highlight perverted blot uncle committed crime acme academy kaisa looney tunes wala school banaya hain hell whats fault even serious teaching schoollike india really beginners statement making sense day day feel bad honest yes woman conscious whats happening around todays modern women wear revealing clothes try expose etc dont see consequences men shameless creatures find anything attractive tear kya bakwas hai ye stats research automatically empathetic sounds like syndrome exactly principal authorities need fired held accountable country filled shameless misogynistic cuntsespecially powerful positions nothing short cultural revolution fix shit fr violation way sc convenient way people commit atrocious crimes woman says loud whole life ruined great set morals ask women report fkn disgusting goddamnthe rage feeling school schools aise hai toh bc bache tohkya hi sikhate honge ye log scah hi tho bol raha hu hindu muslim chodne vale hi yah rape victims ko victim blame karthe hai prove otherwise indians pro victim blaming highly ridiculous education institutions realize set provide education fulfil unrequired roles moral police tbh lies proportionality victims presence spoiling atmosphere rather principle kicked presence school actual question education supposed bring change society supposed give social equality everyone regardless anything pathetic behaviour pretty much sums many underreported cases sexual assualts many things india wonder country heading yes rajasthan india moment space program tell wrote sarcasm somethingbecoz cant tell sick comment made feel sal ki bachi kachra fenkne gayi thi uske uncle utha k leke gaye usko girl fault becoz conscious surroundings clothes much shes exposing right wtffff ram rajya knew india without information title political drama temples total crap india see daylight unless worships god righteousness stealing sorts crimes cant disagree agreed maybe staying school best giviny board exams theres logical justification suing school worth plot twist principle booman older generation peak pickmes resulting current generation miserable pickmeishas swear women like enemy sare jaahan se acha sarcasm im joking man understand men like ofcourse would never something like see mans perspective jyada flaunt karne se yahi hota hai never know girl would behaved girl make uncle react like boomen boomens worst enemy meanwhile rapists probably way become politicians ha people say moving towards developed country toh bhai ye batao uska board ka admit card rok ke kaunse student ko aap punishment se bacha rhe ho really logic kid already suffering okie dokie lets take education away abysmal mentality bhai time machine banao aur khud ko saal pehle pohoucha ye thinking ki ho hi nhi sakti ashamed remember kid th std principal made announcement morning assembly student anything courts police would expelled without notice teachers later found child rapists arrested whole years incident best school area hence unquestioned power principal later found serial rapist sexually harassed female teachers ousted board never arrested always works kyonki risk kind school anyone sending school behenchod challang marle building se think woh kehna chahata hai ki agar school band ho jayega toh baki ke bacho ki life pe asar padega reason never understood bw womenvictimmen aggressors binary concept western feminists try push extreme feminine feminism blame every atrocity religion reason underestimate misogyny indian women many times men dont anything abuse control women enforce patriarchy women comment trying say wouldve understood pain student going better true feelings dont need stats research man theres winning forget progress country running backwards moreove principal female maybe thats reason feminists quite till sorry say animals way better us yea mb kind people provoked comment punishment principal needs beaten im indian east european grandma grew basement family lived like dog seen life told dad told gon na born girl cried weeped thought gon na get abused live capital im sheltered abuse many ways didnt bad life thought crazy misogynistic didnt hate cry gon female gender cried truth im privileged class didnt know cousin got sexually molested couple years one contractual staff famous school mumbai one multiple famous indian sportsmen alumni still change school even though perpetrator jail ffs things change years istg people everywhere uncle dont like vote congress election bjp promotes encourages rapists need taught lesson makes wan na break phone biggest hindrance progress comes women want continue upload patriarchy twitter im eastern european female teacher joy every time brang tears like males beat males females beat females mental terror frequent proportions bad fighting untrained body first th boards already ho chuke read article already missed th board held march meaning supplementary exam many students give supplementary exams difficult accommodate one girl would met anybody school th board set life given opportunity college employment options th board exam centres literal schools sit students let sit write school library student could meet thing solutions misogynistic mentality people poor kid would lose opportunity point looking leaving suffer anyone knows google maps link school thats shame society people act stupid evolutional reasons wont get headache western feminism doesnt claim women innocent patriarchy think term pickme means bro fucking sane person provoked comment misandry feminism typical indian moment ask ajmer jaipurs subreddit maybe time fix ur dying economy driven immigrants commenting space mission whats going man new world livin patriarchy designed give men power dominating ones eldersmen women affected due patriarchy men affected due certain expectations men behave man show emotions provide thats man supposed doit deteriorates mental health oppressive men women cases like im completely favor name shame strategy blast school social media let people see shit scummy people like maybe theyll get heads asses yes bulldozer ah yes surprises india biggest shithole planet full smelly disgusting pajeets need demolish school staff member principal pseudo thinking punished okay dont get carried away moon mentality think bulldozing school sends message le reddit moment worded better kids still need place learn however punitive punishment dealt principal arent rape misogyny genderless another typical day india makes want kill reading fuck wrong world india fucked natural selection dont need religion keep happening school shut administration needs prosecuted abhorrent monsters school ke administration pe action hona hi chahiye school also supports lot kids unke career ko daanv pe lagana chahte ho apna gussa nikaalne ke liye jaahilon jaisi harkat school admin ne kiya hai apne gusse ke sailab baaki students ka career barbad hoga school closed means student also suffer purge admin rather close school point day day country becoming uncivilized sad facing much literally much clear violation fundamental rights yeah read article read headline read school give admit card wrong punished punishment long sitting exams means two years life went waste talked five month matter allowing school since five months wrote saw wrong kids days dont know saying face consequences given admit card wished good aapki ghar mei roti fir china degi kya mean shutting india like work school name acme academy theres youtube channel managed principal uncle orchestrated omg ive asserting point since teen dont understand rationale behind disgusting behaviour society think blame victim india india ok bruh congress good dont try put politics everything fuxkthis shit bro hate society fuck anyone really surprised india stupid give knee jerk reaction without understanding impact proposed action school closed means kids suffer specially rural school nearby alternative miles appears education sablog tumhare jaise city ke chode nahi hote hain na ke kms ki radius mein school mil jaayenge school admin gets arrested shamed fined jailed full extent law means alone punished retarded action would better punishment collateral damage remember words understand meaning absorb value help adulting knee jerk reaction collateral damage try avoid lessen well meaning assholes assholes still dont asshole burns school innocent kids still inside punish schools owner jindagi barbaad thing thats clearly figure speech often truth sa survivors unfortunately girl may bearing brunt trauma long time wish best wishes fighting uphill battle bravely often dont end well world india fucked shit bharat things maine aisa kuch bola kya really logic kid already suffering okie dokie lets take education away abysmal mentality bhai time machine banao aur khud ko saal pehle pohoucha ye thinking ki ho hi nhi sakti ashamed school ko jala hi banjo kids still inside gussa shaant ho jayega baaki ke students ko jindagi kharab ho ho isse jcb nay dynamite se aise bekar schools shouldnt exist yay genocide right clachiol currently toxic af administration importantly mentality toxic people removed render school useful still students dont know whether prohibited law big goons politicians hand management schools colleges really name places shall mentioned publicly people know konsi building aaj rat ko jalani h reqlly serious fuck happening people iran afghanistan pakistan etc also exist said worded statement better way downvotes explain normal person might think coming school shut didnt say anything theres low chance might actually happen change administration must next time choose better words man india seems like hell hole watch oscar nominated documentary netflix kill tiger crazy normal men get away type shit youre saying bulldoze worked school probably parents tbh boys parents saying girl going attract bad attention distract studying rajasthan worst state india women girl might lost faith family people outside world shame us women basically become promoters misogyny return powerrespect etc get upholding patriarchy common remember chairperson ncw downplaying jharkhand rape case shit beyond therapy lol many women arent pick mes uphold patriarchy ik makes feel better think otherwise theres reasonit snot going anywhere next time read context comment telling person said school must shut downthat shutting gon na hurt students like innocent kids thats entirety comment summarised yall kneejerk warriors downvoted thats conscience wordchoosery see bad burn school scorched earth fire starter need fuck wtf seriously wtf hate place ever stop reaching new lows india moment hope remainder mens lives filled pain suffering agonizing death someone atrocities child theres school everyone involved ruling lose jobs sounds like taliban ruled afghanistan seems like wonderful country american parents india people say americans litigious maybe theyre right litigiousness would end really soon case rape virginia school district tried cover parents sued immediately tune changes superintendent realizes state confiscate entire life savings assets stupid decision people tend shape quickly thought yes well point students life may also suffer boards flexible enough deny admit card student must flexible enough postpone change exam dates even school gets demolished suddenly higher ups poor transfer students campuses ofc dont support demolition school name shamed must bought limelight serious action taken school yeah make sure students lives disturbed well never going india ever enormous gap world vs world outsider happening india tarnishment rich culture history ruined men think india longer think beauty ugly men want ruin women everything humanity died dozen times simply callous response pathetic state educators even god help children sensible comment donut hopefully bring attention indias massive rape culture number world comes something zero traction whatsoever stories like need come light government actually something myriad religiouspolitical clashing dealing well juanita broadrrick consideration hell place empathy world good filed petition school good nothing principal face consequences inability administer properly want drive bulldozer school reductive statement concept binary aggressors victims comes subsections radical feminist movements also note feminism school thought multiple movements wasnt isnt single entity cohesion many subsections feminist theoriesmovements contradicted infighting within group like example inclusion lesbians took absurd amount time feminist movements redfem lot problematic meterials like example antisex sexnegative point act like fundamental religious groups even collaborate theres idea lesbianism concept makes sexuality political movement say women achieve liberation remove segregate men within patriarchy every choice make rape nature system cant consent anything whole thing disregarded larger movements feminist within western feminist movements post help understand cultural context keeps happening post help understand cultural context keeps happening shit hole post help understand cultural context keeps happening madarchodo ko naukri pe rakh kaise sakte hai haramkhor educated rural school one kind one km radius relatively small commute kms fare far worse rural one kids parents may comfortable choice news sounded like village school article said education minister taken note well board officials looking enable give late exams etc hope punishment happened yet school administration urban india slightly better tbh ya miles light years away gender equality ideal would appear blame victim thank take look im sure itll piss even culture allow bs post help understand cultural context keeps happening india pig sty country nothing say get heads cultures fubar congress considers rapists criminals atleast doesnt garland release prison misusing powers officials looking enable give late exams etc hope punishment happened yet school administration hoping punishment corrupt administration educated rural school one kind one km radius relatively small commute kms fare far worse rural one kids parents may comfortable choice news sounded like village school thanks pov man stupid people saying america bad unfair go live places involved decision shaming girl gangraped think many educated indians moving overseas dont wish share country animals bro really r u delusional hey provide dates link article mentioned certain months dates year dont context case trying awareness injustice happening would benefit us able reference information true mom job leave nani side family nani ill talking leaving home nani also told sister read much need aim high girl cant believe gang raped people mean people raped cruel thats list watch rlostredditors unless course youre trying blame rape victim rape based assumption wasnt religious enough divine protection thats case riamatotalpieceofshit ro mat bhai bjp ki yehi sacchai hai aur tujhe koi khatra nahi muslims se jo bjp ne tere mind feed kiya hai tu chill kar know sided encourage rape reward rapists answer think india another school one shuts india sad excuse country inhabited sad excuse people f india school school chachiawas area ajmer small school sure punitive punishment maybe classic nonpunitive punishment papers today also one like one dehradun case magistrate asked gang rape survivor strip court imagine pain trauma ptsd told strip front everyone especially going rape religion stops cause many atrocities im sure people stop blaming one like one dehradun case magistrate asked gang rape survivor strip court imagine pain trauma ptsd told strip front everyone especially going rape one like one dehradun case magistrate asked gang rape survivor strip court imagine pain trauma ptsd told strip front everyone especially going rape one like one dehradun case magistrate asked gang rape survivor strip court imagine pain trauma ptsd told strip front everyone especially going rape point grassroots cultural revolution stop oh know exact school cant find dont really care fr india messed happens time even big shot schools urban india family delete school link people end screwing rating google maps thank much op shame school district letting student continue studies prosecute school denying education father worked job india locals congratulating daughters much congratulated two sons maybe even kinda understand shit probably worse years ago india serious problem would love bring kos culture rapists india things part culture point true indian havent participated gang rape country id agree national sport youd hardpressed find school exact scenario didnt happen theyd shut every school say enjoyed childhood india happy memories glad adult live us us lot problems compared india people complain lot idea good honestly theres much unpack things ass fucking backwards india kidding obviously things unpack fair points still get make fun india backwards rapey like countries make fun us obese among many things u need tell u please dont listen kinds people u potential please aim high meanthat works yeah ah yes good old victim blaming ostracization nobody better us much rape goes underreported need suffer silently asia india sure works yeah theres need massive change peoples mentality doubt coming time soon unfortuantely yeah butthis atrocity committed basis religion enough evidence sue owners school bad theyll grovel front girl beg mercy worst country women feel physically sick wish whole school goes every single piece shit involved go though hell whole administeration fired banned joining education institution job also doesnt matter many rapes countries say india deep rooted rape culture rapes commonplace trivialized victims actually shamed mocked though life made suffer silent whats even worse expectation somehow rape survivor willing sleep anybody already tainted rape victims frequently subject rapes rape attempts reason several years ago article life rape survivors one story year old girl whose family way laid goons traveling gang raped school threw parents kids vehemently objected presence school family relocate joined new school somehow somebody recognized rape survivor spread around everyday mocked taunted rape way school backward mentality cant helped seems older generations love blaming new one sorts things turns around kinda stuff youre wrong political party alone fix misogyny ingrained culture leaving poor get assaulted taking trash yeah think woman consent dont understand definition rpe malnutrition india causing lack brain cells people india im surprised rpe worst country earth principal school case woman makes wierd reasons girls families dont report rape cases police cases like go peoples attitude dont change regarding rape victims continued shunned future country real danger fr waah ye chu padhaenge bacho ko sharm honi chahiye puri staff ko iss college ki small minded people disagree discrimination rape victims theyre seen sinners impure religious hogwash laws favor women dont understand even true means absolutely nothing conservative country like victim ruthlessly blamed shamed crime women wont report laws useless legally speaking islamic countries strictest penalties rape one would argue countries paradise women society culture influence life lot laws knew rindia headline trust say hopeless people power different currently single rational human never world live watched movie india girls kidnapped forced prostitutes one lady comes talk girl go going cant go home would kill shame even come home untouched die go back dont work die basically indian girls even though kidnapped assaulted would killed allowing happen like wtf poor girls horrific fucking mindset dont know surprised expecting fuck people never let mentally heal ever got debate older hair stylist arguing women able president hair stylist argued women unsuitable im guy shes woman really weird arguing someone equal insist feel remember conversation grandma told verbatim sons better daughters boys better girls said youre woman think doubt even got response seriously flabbergasted point tbh years able change views best part course congress atleast doesnt encourage support rapists remove misogyny india overnight change govt atleast thinks rape wrong rapists criminals wont release theyre particular community india needs shut school school administrator ever denied spend rest life locked away treat human compassion return civilized british control white western power wont go near india oh mentioned indians bad light im surprised isnt bombarded indian dudes immediately offended thats stupid af closing centre education rather person r puppets moral grounds selfish despicable much racism space program classic behaviour dont silly us pajeets smell great come sniff sad see medical intern seeing obg doctors usually women treat patients surprising seeing treat rape victims coming medicolegal examination makes cry already know india without looking sub harsash sajut singh kabal garesh jit hit common misconception misogyny gender every time hear country something raperelated never stepping foot shithole uncle stranger uncle friends year uncle aides arrested legal actions taken anything done username checks serious note yeah school needs shut atleast principle deserves behind bars publicly shamed actions indian dudes favorite team sport haha thats disgusting indian culture finest national sport rape people majority level one reflexive thinkers dont think consequences certain solutions im freedom religion spiritual faith isnt religious faithful miserable fucking excuse brainwash culture stays afloat rape babies weak minded men prey children since personal pedophile prophet condones apparently means escape consequences karma get reincarnated hate actions reflected ironic way read title saw jaipur shock dang india sucks safe females india check whole country like fek rajasthan jharkhand always top grapes india diverse several communities different view society assholes disregarding women conducting crime indian people dont even say community take blame say stop harassment societal view change state govt take control several feminist organisations country counselling villages stop barking social media say india bad im kerala mu society dont even level sexual harrasment women mfs face backlash indian foreign land media get big strong gay dudes let rape guys boy though talking sister mom didnt say india bad said india hits new low everyday recent news two tourists raped india male beaten women gang raped forgetting men gang raped women shoved rod pulled intestines left naked tossed cold night india needs protect women spelt burnt wrong friend cant even imagine going mentally imagine friends focus academics even allowed institution people look like externally accepted due fault probably force study dream moving life dangerous students faculty innocent childs presence motivation going even allowed take exams wonder country gone shit innocence children price paid humans accept humans co exist say must paid finally real solution done tourist got raped decided visit india visiting many countries unharmed thinking leaving shit review yeah cant find exact listing name thats mentioned article see coaching class nearest match looks doubtful lol try school youll get result india even surprised exactly heck take blame something happened km away plus dont support assholes raping women like wtf said list harassment happening one two states particularly north south harassed women south using voice get law enforcements ears heck take blame indian deal racist comments country spoil atmosphere fucking logic principal resign asap even bit conscience left wan na burn whole place realistic terms place every authority figure involved needs bulldozed culture cesspool towards women fuking disgusting headline horrible shocked saw occurred suggest reread statement suggest pickmes type women work perpetuate patriarchy simply example learn india disgusted fuckers space program afaik magistrate got ass sued sad read like school expect society reason ever visit shithole tried turning india back im sorry indian chicks chicks matter go shit like shit get better always takes past point hope cunts get let imagination guide filling spaces country hits new low everyday fuck shithole place people think abt religion idc religious brainwashing country hand downvote thats truth shunning child school cause raped absolutely disgusting behavior school atmosphere ass half kids school lost world atmosphere seems keep preaching morals ethics called sanskaar wtv fuck talk action dare get raped hope rapists get justice celebrate rapist release jail victim pays heavy price crime didnt even commit kind humans even human mean stockholm syndrome steroids shame mental attitude may spoil atmosphere dont know say people say rape culture exist show incidents cause thats fault right yeah perfect solution everything safer better western interests thats disgusting poor girl thats good look school oh india india deeply hate women im amazed rajasthan garner enough criticism one mysogynistic antiwoman state india like bihar uttarpradesh probably doesnt many people bc unique culture bc desert forts undoubtedly fucked level bihar uttarpradesh even doesnt overpopulation poverty problem cultural attitudes towards women en masse extremely regressive anyways girl would end hating country culture whatever makes india india entire life deserves gtfo marry foreigner spread hate propoganda india worst country women foreign podcasts point feel like hate india gets international platforms soo valid wtf wishing anyone would shame discriminate rape victim gets visit kali india strikes india may need nukes didnt police recent incident foreigner got raped asked remove post preserve international image guess fame cultural ethics morality maintained since past decades agreed mob mentality dont believe executions emotionally unstable made comment right wrong never supported executions retributive justice life emotionally unstable made comment still tells lot countrys mediaeval punishment mentality considering many upvotes underthought comment got kind incentive structure acme academy coyote orders stuff honest question newer development see type thing time recently dont recall hearing lack reporting things getting worse brave already face school nd dumbass people denied victims able face world afterwards trauma stays forever wow wow words isnt whole class people indian caste called undesirables something basically treated subhumans actually deeply embedded society always hide name culture shahbaz ansari interview print know delhi called rpe capital surprised see thinking average indian rpes happen limited elderly thousands dank memes dark comments also exists social media youths imagine pain struggle probably grateful god today pain struggle much face sure keep getting rindia suggested india holy fuck happening india posts ever see bewakoofo ki kami nhi hai want avoid trouble theres dont even consider victims pov truly weird times live place rped become crime rpe congrats progress india today finally im shamed call indian entire administration needs booted legal action taken school education department feel terrible girls women india thinking old low school fuked people govt oof yeah import west ashamed even stay school blood would boil pain agony thing happened one schools authority closed one failed human beings bulldozers people opposing government agenda people welfare read title seeing subreddit knew india sorry sorry im white canadian wife india told grandmother refused tk ever touch interact blew mind grandmother obviously also girl quite shock fucked many levels imagine kid went rape ordeal humiliated socalled adults school dont ounce humanity want talk uncivilized cultures oh u mean like thought u implying rape done basis religion educated indian point nothing one gon na work unfortunately country ruled old people generationally traumatized millennials gen zs submission obedience cycle gon na keep continuing people jumping ship ship much water point pointless try draining water instead wait salvage ship sunk turned wreck taking credits peoples inventions schools actions india keep getting recommended gang rape posts twitter jusf saw post monitor lizard got g raped victim horrible crime treated way wild ah another normal day india suprised even launched investigation principal needs gang r wow india make ashamed home country yet blame people racism youre spokesperson entire country regardless views india doesnt entitle racist also right india rape culture many use excuse exercise general bias hate indians said sure india diverse also one worst places live woman news needle haystack also stop speaking women general tons women kerala face sexual harassment part daily lives well state magically exempt crap rape apologist synonymous indian culture stands youre displaying say indian woman living one metropolitan cities india better accordingly men parts culture truly redeemable women many underage children treated like people culture nationwide problem edit seeing comment south indian woman know many would disagree angrily justified safety fuck wrong people thing india government corrupt doesnt give shit things may work india unless highclass background wth happening country women biggest enemy women person middle class living india also agree wan na get shithole garbage dumping country go elsewhere people basic common sense civic sense unfortunately im stuck sorry thats gon na happen modis india schools connections aint easy comnected politican huh many rights violating legally speaking morally speaking dont deserve live prohibiting rape survivor education also chance rehabilitation raped would soil atmosphere actual fuck mean refused touch granddaughter thats weird even indian standards grandmother mental problems principal fired least sad state affairs next birth may god send poor family man women india fk man abhi recently ek maxican ka bhi rape hua tha jharkhand ye kya ho raha bc desh ko congress ruled state nothing better expect accha hua cant even begine imagine little girl going right true often older women yesteryear feminists biggest allies sexism feminism days baad coz crowd vouche performative activism like education job max think theyll achieve equality patriarchy literally thought process thats nowhere weeded like usb joseph stalin made mean read news articles women plan rape women revenge fucking disgusting hello please name school google maps link possible would like take make responsible human rights india two opposite things sale bsk rajasthan defeat even stone age people barbarian terms dont shame bringing politics fault tempting men rape herafterall women arent human beingss bhai tum itna frustrated nahi ho rape se shows government responsible rapes happens india wont hold accountable complicit men second class citizen laws anti men false rapes cases love country shit like makes want leave cesspool country bunch indians claim invented internet airplane cars scientific theories ancient times many even claimed jesus came india learned guru lol someone tell modi man ki bat first sentence article one big run sentence agreed im indian born america indias poor law system essentially means people take law hands obviously poor personal freedoms lack media coverage means accountability proud heritage india embarrassing country got problems us india makes us look like heaven always fault victim shameful im sorry academy alreaddyy sounds like complete fucking joke also called freakin acme academylmfao wtffff whaaat tha tomjerry buggsbunnyroadrunnerwile e coyote joke fuckinn school place sorry ass excuse supposed highly esteemed academy sorry bulldozer religious purposes really hope addressed bigger scale cant forgotten victim family countless others whove need justice get guys principal streets prison life sentence born india curse meanwhile guys raped would enjoying lives every rapist must kept life death make suffer dont give freedom death yearn death feel pain victim endured eternity lock big dude constantly rape know felt fucking bastards worse parents would probably support school",
    "light_cleaned_title": "Gang rape survivor shunned from school, denied boards admit card",
    "light_cleaned_selftext": "She had been enduring this pain and humiliation for 5 months. Being born a woman in India is a curse.",
    "light_cleaned_comments": "Man that's fucked up This school needs to be shut down. and its principal publicly executed I swear this country hits new low every day This is the perfect answer to why are sexual assaults in India underreported. There's lots to unpack in all this... but the principal should be especially ashamed of herself with how she's dealt with this whole thing. Bc bulldozer laao, aur school gayab.bade aaye saale ghatiya mentality Principal is a woman. Shouldn't she be supportive of the girl? “School” is a funny a funny name to spell “panchayat”. Being born in India is a curse, coz either you'll be born a woman, or someday have a woman in your life in whom your life lives. It is just shameful, just pathetic and shameful First a traumatized child, and now they wanna exclude her from society, take her right of education. What are you trying to turn them into??? Such pathetic mentality Not surprised. This Is what BJP wants r/facepalm Such a shame. I agree. The school needs to be shut down after public humiliation. By this logic, humans should never have wars, never commit crimes. Mother-in-laws and daughter-in-laws should never have issues between them. Victim-blaming and shaming should never happen. Doesn't work like that. I wish it did, but it never does. This is horrifying on so many levels. We call these places \"schools\"? No wonder that so many people turn out to be like this, always victim shaming. Always trying to ignore the real problem. Always making the life of an SA survivor much worse. A principal like that should not be anywhere near the education system. Collector of the city should take action on school What the actual fuck. Please shut down the school and throw the principal out Name them, shame them and get them fired. Motherless dogs. India needs to be shut down. smh Because she is a woman? What logic is this? By this logic, any man should not get lynched by a mob full of stinky men? The school authorities have rapist mentality. Why cause women = good ? Looks like you haven't seen some of the women judges' decisions on rape survivors. I have personally seen money blocking any sense of morality/humanity/ethics. It's all good unless it's your kid. It's Normal. Ramrajya chal raha hai udhar. Now she have to give agnipariksha, then board exams. Bloody we as a society have failed!!! Shameless people who are unable to emathise the poor girl, the least they could do is treat her fair. They don't deserve to be humans, forget being headmaster/principal!! I am just baffled, man. What the actual fuck. How can you see someone go through something this traumatic and basically go, Yeah, let's make it worse for them.\" That's because humans divide themselves in groups and view the other groups as something not human, as animals. If everyone view everybody else in the same calibre as they view their own family and friends, we wouldn't have man on man violence. But caste, gender, religion, race prevents us to view the other human being as a human being. It'll change. It's like we live with animals. Things like emotions or compassion or basic human decency are foreign concept inke liye. Relegios cunts hit new low The solution to mediaeval practices and thinking is not mediaeval punishment because empathy \"May spoil the atmosphere\" We always teach the world that Indians have Cultural, Ethics and Morality I think we have a lot to learn how is bjp at fault here? School administration should not be allowed in school as \"they are spoiling the atmosphere\". Peak Rajasthan moment. Off karke on karo, dekho kuch kaam kare. The fuck bro this shit is serious, fuck that school The school's actions necessitate prompt governmental intervention. Lodu is mein religion kaha se aagaya But men have empathy as well And a male principal can't show empathy? Sex of the principal doesn't matter. They are a shitty person. First of all, why the fuck does it matter if she is a rape survivor or not, education is for all, whatever legal battle they may be going through. Second of all, why is the victim being boycotted by the school? What kind if mentality do they have, i want to hear their excuse. This treatment should be given to those disgusting men who did this. India seems like the most pro-rape country in the world. It's so messed up. When people ask why don’t victims come forward? This is why, cause telling the world and society will only shame them and treat it as if it’s their fault. Fuck this society they do, not denying that. the person you replied to meant that since such a huge number of women face sexual assaults on varying levels on a daily basis (not saying that men dont face it), you would expect a woman to be automatically empathic towards a rape victim. blud i clarified this in another comment, women are expected to be more empathic towards rape victims, which is why the commenter said what they did. never said men cant show empathy or because they know what the condition of students in their school is. have you seen 16 year olds on instagram calling anyone anything? they don't know the weight of their slurs and abuses and how it impacts someone. what if they did more harm to the girl who just survived? i know that she should be allowed and there must be a way to make her comfortable again but what i'm saying is also not wrong. i'm ready to be downvoted. What can we indians do to make the change we want to see man? Sick and tired seeing articles like these. There are some inherent and serious societal/cultural problems with this country (and statistically stemming from the north aka dumpster land). As a woman, from my experience, they can be the biggest cunts when trying to uphold sanskaari life. Most of the cultural shaming and schooling I've faced are from women. Men aren't good either but it hurts and enrages you more when women pull the \"sanskaar\"tag on you. Ask any Indian women, most of them would share the same opinion. So never understood this B&W, women-victim/men- aggressors binary concept Western feminists try to push. Patriarchy favours men and gives them power, yes, but it is upheld and defended by both men and women Ek ladki ki to jindagi barbaad ho gayi, baaki ke students ko kyun punish kar rahe ho bhai? So no Beti bachao and no Beti padao so its her fault she got raped? now u will blame her clothes? Only in India, Rape happens throughout the world but it is only in India where the victim is blamed and shammed. Ok, if that's what you meant, I can understand. You can edit your comment clarifying this so no one else misunderstands 👍 You underestimate how misogynistic women can be toward other women. The patriarchy and power exists because these older females assume themselves to be the bastion of \"culture\" reserving the right to shame women. It's wild. These very women will suck up to men, tolerate being taken advantage of by their husbands and yet still punch the victim. Older women are THE worst when it comes to pampering men. >Ek ladki ki to jindagi barbaad ho gayi Zindagi barbaad kardiya gaya because of no justice provided by courts and education system. A very strict action must be taken so that schools takes these matters seriously. Pandey first. Woman second. Agreed No longer wanted to live in country fool of such people. Will definitely move out from India. The lesson for young girls is if you’ve not finished school yet and you get raped, don’t complain. Think about it next time someone talks about men’s rights and how the law is against men. Google Maps link to Acme Academy Ajmer? Wanted to leave a shit review but I can't find it 100% agree. The amount of internalised misogyny they have is insane. They desperately need therapy because each of these women is hateful to a point where they need to be institutionalised. Maybe it's time to get out of your phone and explore the rest of the world \"laws are in favor of women\" crowd is always eerily silent when something like this happens. Where is the law protecting this girl and her rights? Lol, sad How exactly are the other students being punished? How stupid you have to be to blurt out such things without thinking!? >to jindagi barbaad ho gayi, Firstly, how did you come to this conclusion? Just because the girl has been raped, it shouldn't mean that her whole life should come to a standstill. Very clearly, her family is supporting the girl. The one who's image and life should be ruined is her fucking uncle, who raped a minor girl. Get the principal arrested Laws only favour those who are rich or work in the ruling party Exactly.! Isme bhi religion le aaya bhai? India is not for anybody School is meant to boost students esteem n not to show back when some crime takes place !🤷‍♀️ Most of parents force schools to do this Family is quite subjective... Given the highlight here that her own perverted blot uncle committed the crime... >Acme Academy Kaisa Looney Tunes wala school banaya hain? What the hell!. What's her fault.? Are they even serious. Is it what they are teaching in their school.Like India is really not for beginners. This statement is making more sense day by day. I feel so bad for her. To be honest , yes. As a woman, you have to be more conscious of what's happening around you. Todays modern women wear revealing clothes, try to expose themselves more etc that they dont see the consequences. Men are shameless creatures, if they find anything attractive they will tear them up. Kya bakwas hai ye! There is no such stats or research. Automatically empathetic sounds like some syndrome. Exactly and principal and other authorities need to be fired and held accountable Country is filled with shameless misogynistic cunts(especially in powerful positions). Nothing short of a cultural revolution can fix shit. Its a FR Violation. Way to sc. What a convenient way for people to commit such atrocious crimes. If the woman says it out loud her whole life will be ruined, what a great set of morals we have. And then they ask women to report about it! It's fkn disgusting Goddamn,the rage I am feeling against that school... Schools aise hai toh bc ... Bache toh,kya hi sikhate honge ye log... Scah hi tho bol raha hu hindu Muslim chodne vale hi yah rape victims ko victim blame karthe Hai Prove me otherwise Indians are pro at victim blaming This is highly ridiculous, when will education institutions realize that they have been set up to provide education and not to fulfil unrequired roles of moral police, and tbh there lies no proportionality of the victim's presence in spoiling the atmosphere, rather the principle should be kicked out for her presence in the school is the actual question. Education is supposed to bring about a change in the society, it is supposed to give social equality to everyone regardless of anything. This pathetic behaviour pretty much sums up why there are so many underreported cases of not just sexual assualts but so many other things too in India. I wonder where this country is heading. Yes, Rajasthan India moment. All this while you have a space program Just tell me you wrote that as sarcasm or something...becoz if not, I can't tell you how sick that comment made me feel.... 17 sal ki bachi kachra fenkne gayi thi, uske UNCLE utha k leke gaye usko.. But the girl is at fault becoz she should be conscious about her surroundings, her clothes, how much she's exposing, right???... Wtffff Ram rajya I knew this was India without any other information than the title. This political drama about temples and all of it is total crap and India can not see daylight unless she worships the GOD of Righteousness. And stealing and all sorts of crimes. Can't disagree Agreed, maybe staying out of school was for the best but not giviny board exams? There's no logical justification for that. They should be suing the school for all it's worth plot twist principle is booman. Older generation were the peak pick-mes, resulting in these current generation of miserable pickmeishas. I swear women like these are our own enemy. Sare jaahan se acha ******** How is it sarcasm? Im not joking, as a man, I understand what other men like. Ofcourse I would never do something like that but you have to see from a mans perspective. Jyada flaunt karne se yahi hota hai. You never know how the girl would have behaved or what the girl did to make the uncle react like that. Boomen being other boomen's worst enemy. Meanwhile the the rapists are probably on their way to become politicians Ha.. 🤦🏻and people say we’re moving towards a developed country. Toh bhai ye batao uska board ka admit card rok ke kaunse student ko aap punishment se bacha rhe ho. Really no logic that kid is already suffering okie dokie lets take education away from her. Such down abysmal mentality. Bhai time machine banao aur khud ko 200 saal pehle pohoucha do ye thinking 2024 ki ho hi nhi sakti. Should be ashamed of yourself I remember when I was a kid in the 6th std, the principal made an announcement during the morning assembly that if any student had anything to do with the courts or the police would be expelled without notice. 2 teachers were later found to be child rapists and were arrested (whole 2 years after the incident) . It was the best school in the area and hence had unquestioned power. The same principal was later found to be a serial rapist and had sexually harassed female teachers. He was ousted by the board but never arrested. It always works Kyonki they are at risk. This is not the kind of school anyone should be sending their school too. Behenchod challang marle building se I think woh kehna chahata hai ki agar school band ho jayega toh baki ke bacho ki life pe asar padega for some reason. >So never understood this B&W, women-victim/men- aggressors binary concept Western feminists try to push. 'Extreme Feminine' , not Feminism. \"Blame every atrocity on religion for some reason\" You underestimate the misogyny of Indian women. Many times men don't have to do anything to abuse and control women and enforce patriarchy, because other women will do it for them. What the comment is trying to say is she wouldve understood the pain the student is going through better true feelings dont need to have stats or research. Man there’s no winning, is there? Forget progress, the country is running backwards. Moreove the principal is female, maybe that's the reason feminists are quite till now Sorry to say but animals are way better than us Yea mb This is the kind of people who will be provoked by my comment. It's not about punishment. Principal needs to be beaten im not indian, east european but my grandma grew up in a basement with her family and lived like a dog so she has seen life and she told me when dad told her i was gonna be born a girl that she cried and weeped because she thought i was gonna get so abused. i live in the capital so im sheltered of abuse in many ways, i didnt have the bad life she had. I thought she was just crazy and misogynistic but she didnt hate me to cry i was gon be female because of the gender. And she cried because it was the truth im just privileged class. i didnt know. My cousin got sexually molested for a couple of years by one of the contractual staff of a very famous school in Mumbai. The one where multiple famous Indian sportsmen are alumni. Still, she had to change the school even though the perpetrator was in Jail. It's 2024 ffs, when will things change? After 500 years? Istg these people are everywhere It was her uncle. If you don’t like this, vote for Congress in this election. BJP promotes and encourages rapists. They need to be taught a lesson. This makes me wanna break my phone 📱 The biggest hindrance to progress comes from women who want to continue to upload patriarchy. Twitter im eastern european but had a female teacher with joy every time she brang me to tears. like males beat other males females beat other females but mental terror is more frequent because our proportions are bad for fighting with an untrained body First 12th boards already ho chuke he read the article she already missed 12th board that were held in march. Meaning this was a supplementary exam and not many students give supplementary exams how difficult it is to accommodate one girl. She would not have met ANYBODY from her school. This 12th board is what will set her life if she is not given this opportunity there will be no college or employment options for her. 12th board exam centres are literal schools if she cannot sit with other students they can let her sit and write in the school library where no student could meet her. The thing is solutions are there but because of the misogynistic mentality of people this poor kid would lose her opportunity. At this point you are not looking out for her you are leaving her to suffer. Anyone knows Google Maps link for the school? That's a shame on our society 🥺 people act stupid there are evolutional reasons for that i wont get into because i have a headache Western feminism doesn't claim that women are innocent in patriarchy. What do you think the term \"pickme\" means? Bro any fucking sane person will be provoked by your comment. It's Misandry now not feminism Typical Indian moment Ask in Ajmer or Jaipur's subreddit. Maybe it's time for you to fix ur dying economy driven by immigrants than commenting about our space mission What's going on man.... Is this the new world we livin Patriarchy is designed to give a FEW men power, the dominating ones or the elders....men and women both are affected due to patriarchy men are affected due to certain expectations of how men should behave how they should man up and not show emotions, how they should provide and that's all a man is supposed to do..it deteriorates mental health and its oppressive to both men and women In cases like this, I'm completely in favor of the name and shame strategy. Blast this school on social media, and let people see just how shit they are, and how scummy people like this are. Maybe then they'll get their heads out of their own asses YES, BULLDOZER! Ah yes, no surprises here. It's India after all. The biggest shithole on the planet, full of smelly, disgusting pajeets. there is no need to demolish school , it the staff member and principal that have pseudo thinking and should be punished Okay, don't get carried away in the moon mentality. I think bulldozing the school sends the message 😁 Le Reddit moment Should have worded it better. The kids still need a place to learn, however punitive punishment should be dealt to the principal. But aren’t rape and misogyny genderless? Another typical day in india This makes me want to kill myself just from reading it fuck is wrong with this world India is fucked up. Natural selection where are you? We don’t need any religion Why does this keep happening This school should shut down and the administration needs to be prosecuted for being abhorrent monsters. School ke administration pe action hona hi chahiye, but the school also supports a lot of other kids, unke career ko daanv pe lagana chahte ho apna gussa nikaalne ke liye? Jaahilon jaisi harkat to school admin ne Kiya hai, apne gusse ke sailab me baaki students ka career barbad hoga. School closed means the other student also suffer. Purge the admin rather than close the school is my point. Day by day, this country is becoming more uncivilized. How sad this is. She is facing too much, literally too much. This is a clear violation of her fundamental rights. yeah i did not read the article. i read the headline only. just read that the school did not give her admit card, they did wrong. they should be punished for that and the punishment should be long because not sitting in exams means two years of life went to waste. i talked only about the five month matter. them not allowing her to be in school since five months. and i wrote what i saw in it which is not wrong. the kids these days don't know what they are saying until they face the consequences. they should have given her the admit card if they wished good for her Aapki Ghar mei roti fir , china degi kya . Why? And what do you mean by shutting down India? Like how does that work? School name - Acme Academy There's a YouTube channel managed by its principal. Her uncle orchestrated this, omg 100000000% this. I’ve been asserting this point since I was a teen !! I don't understand the rationale behind such disgusting behaviour from society. What do they think? Why do they blame the victim? So, just India being India, OK Bruh , as if Congress is any good . Don't try to put politics into everything. Fuxkthis shit bro . I hate this society. Fuck them Is anyone really surprised it's India How stupid do YOU have to be to give a knee jerk reaction without understanding the impact of your proposed action?? School closed means the other kids suffer, specially if it's a rural school with no other nearby alternative for miles, which it appears to be... what about THEIR education? Sablog tumhare jaise city ke chode nahi hote Hain na ke 2 kms ki radius mein 10-20 school mil jaayenge? School admin gets arrested, shamed, fined and jailed to the full extent of the law means they and they alone are punished for their retarded action. That would be a better punishment with no collateral damage. Remember these 2 words: understand their meaning and absorb their value, it will HELP in adulting: *Knee Jerk Reaction* *Collateral Damage* Try to avoid or lessen both. Well meaning Assholes are Assholes still. Don't be the asshole that burns down a school with innocent kids still inside it, just to punish the school's owner. As for the jindagi barbaad thing that's clearly a figure of speech and often the truth with SA survivors. Unfortunately that girl may be bearing the brunt of the trauma for a long time, i wish her best wishes but she is fighting an uphill battle very bravely. They often don't end well. >this world No, only India is \\****this\\**** fucked up and shit. Just Bharat things. Maine Aisa kuch bola kya? >Really no logic that kid is already suffering okie dokie lets take education away from her. Such down abysmal mentality. Bhai time machine banao aur khud ko 200 saal pehle pohoucha do ye thinking 2024 ki ho hi nhi sakti. Should be ashamed of yourself School ko jala hi do banjo, with the kids still inside, gussa shaant ho jayega, baaki ke students ko jindagi kharab ho to ho... Are isse jcb nay, dynamite se, aise bekar schools shouldn't exist Yay! Genocide! Right? The clachiol currently is Toxic af. The administration and more importantly this mentality is toxic. All such people if removed will render the school useful still for other students. I don’t know whether prohibited by law or some big goons (politicians) have there hand in management of these schools or colleges, but really the name of such places shall be mentioned publicly. So that people should know “konsi building aaj rat ko jalani h”. And m being reqlly serious. What the fuck is happening to our people??? Iran, Afghanistan, Pakistan, etc also exist. As I said you should have worded your statement in a better way. The downvotes explain what any normal person might think. & coming to school being shut down, I didn't say anything about it. There's a very low chance that this might actually happen but change in administration is a MUST. Next time, choose better words. Man, India seems like a hell hole. Just watch this Oscar nominated documentary on Netflix \"To Kill a Tiger\". it’s so crazy how normal that is and how the men just get away with that type of shit So you're saying bulldoze them I have worked in the school.. and it’s probably the parents doing it. And tbh, boys parents who are saying that the girl is now going to attract bad attention and distract them from studying. Rajasthan is the worst state in India for women That girl might have lost faith in her own family and people outside in world too. Shame on us. Women basically become the promoters of misogyny in return of the power/respect etc they get for upholding patriarchy. This is so common (remember our chairperson of NCW downplaying the Jharkhand rape case?) This shit is beyond therapy lol so many women who aren't pick me's uphold the patriarchy. ik it makes you feel better if you think otherwise but there's a reasonit snot going anywhere Next time read the context of the comment too. I was telling the person who said the school must be shut down,that shutting it down is gonna hurt the other students who are ,like her , innocent kids. That's the entirety of the comment summarised. And all y'all knee-jerk warriors downvoted THAT. That's on your conscience!! Not my \"word-choosery\" (See, I am bad at it!) Burn the school down. Scorched earth. Where is the fire starter when you need her? What the fuck WTF! No seriously WTF!!!! I hate this place. Will we ever stop reaching new lows? india moment I hope the remainder of those men's lives are filled with pain, suffering, and an agonizing death. How can someone do such atrocities to a child. Then there's the school everyone involved with that ruling should lose their jobs. Sounds like Taliban ruled Afghanistan. Seems like a wonderful country. American here, but parents are from India. People say Americans are litigious, and maybe they're right, but litigiousness would end this really soon. There was a case of a rape in a Virginia school the district tried to cover up. The parents sued and immediately the tune changes. When the superintendent realizes the state will confiscate his entire life savings and all his assets for the stupid decision, people tend to shape up quickly. Just a thought. Yes Well you have a point that other students life may also suffer. If boards are flexible enough to deny admit card to a student then they must be flexible enough to postpone or change exam dates. Even if that school gets demolished suddenly, those higher ups are not that poor to transfer students to other campuses. Ofc I don't support demolition but this school should be name shamed and must be bought to limelight. Serious action should be taken against this school. And yeah make sure that other student's lives are not disturbed as well. Never going to India, ever. The Enormous gap between How the world is vs How the world should be. as an outsider, what is happening with India? its such a tarnishment on the rich culture and history. its all ruined because of the men there. and when I think of India I no longer think of the beauty but the ugly. why do the men want to ruin women and everything. Humanity died a dozen more times simply by this callous response. Pathetic, if this is the state of our educators then not even god can help our children. Sensible comment, have a donut 🍩 on me Hopefully this will bring attention to India’s massive rape culture. They are number 1 in the world when it comes to this and it’s something that has had zero traction whatsoever. More stories like this need to come to light so that their government can actually do something about that and the myriad of other religious/political clashing they are dealing with as well. Juanita Broadrrick for your consideration What the hell! Is there no place for empathy in this world? Good that they filed a petition. The school and the good for nothing principal should face the consequences for their inability to administer properly. Now I just want to drive a bulldozer through the school. This is a reductive statement, but the concept of binary aggressors and victims comes from the subsections of radical feminist movements. Also, I should note that feminism is a school of thought and multiple movements; it wasn't and isn't a single entity and a cohesion. There were many subsections and feminist theories/movements that contradicted each other, and there have been in-fighting too within that group, like, for example, the inclusion of lesbians, which took an absurd amount of time in the feminist movements. and the redfem has a lot of problematic meterials with them too, like, for example, being anti-sex or sex-negative to the point that they act like fundamental religious groups (or even collaborate with them), and then there's the idea of \"lesbianism,\" a concept that makes sexuality a political movement. In which they say that women can only achieve liberation if they remove and segregate themselves from all men, as within patriarchy, every choice they make is rape because, from the nature of that system, they can't consent to anything. the whole thing was disregarded by larger movements and feminist within the western feminist movements My other post will help you understand the cultural context and why this keeps happening. My other post will help you understand the cultural context and why this keeps happening. What a shit hole. My other post will help you understand the cultural context and why this keeps happening. in madarchodo ko naukri pe rakh kaise sakte hai haramkhor I was educated in a rural school, one of its kind in that it was the only one in a 20+ km radius, I had a relatively small commute: 6kms. Some had to fare far worse. If it's a rural one, the kids and their parents may not have a comfortable choice, from the news it sounded like a village school. The article said the education minister had taken note as well as the board and a few officials too and they are looking into how to enable her to give late exams etc.. so some hope. But no punishment has happened as yet for the school administration. Urban india is only slightly better tbh, but ya, we are miles if not light years away from any gender equality ideal It would appear they do blame the victim. Thank you, will take a look. I’m sure it’ll piss me off even more because no culture should allow this bs. My other post will help you understand the cultural context and why this keeps happening. India is a pig sty of a country. To do what? Nothing that can you say will get in their heads. Some cultures are FUBAR. Congress considers rapists as criminals atleast and doesn’t garland them or release them from prison misusing their powers. They >a few officials too and they are looking into how to enable her to give late exams etc.. so some hope. But no punishment has happened as yet for the school administration. Hoping for the punishment of corrupt administration. >I was educated in a rural school, one of its kind in that it was the only one in a 20+ km radius, I had a relatively small commute: 6kms. Some had to fare far worse. >If it's a rural one, the kids and their parents may not have a comfortable choice, from the news it sounded like a village school. Thanks for this Pov man 👍. To all the stupid people saying America is bad and unfair. Go live in these places. And to all those who were involved in the decision and in shaming the girl for being gang-raped. Why do you think so many educated Indians are moving overseas? They don't wish to share the same country with these animals. Bro really, r u that delusional Hey can you provide dates for a link? The article does mentioned certain months and dates but no year so I don’t have context. In case your just trying to be awareness to the injustice happening it would benefit us to be able to reference the information . so so true my mom was doing job but she had to leave it not because my nani side of family and nani herself were ill talking about her leaving me at home. my nani also once told my sister not to read much no need to aim high as you are a girl I can't believe she was gang raped and people are being mean to her??? Not the people who raped her?? How cruel That’s on my list to watch /r/LostRedditors Unless of course you’re trying to blame the rape victim for her rape based on the assumption that she just wasn’t religious enough for divine protection. If that’s the case: /r/IAmATotalPieceOfShit Ro mat bhai. BJP ki yehi sacchai hai. Aur tujhe koi khatra nahi muslims se jo BJP ne tere mind me feed kiya hai. Tu chill kar but know that you sided with those who encourage rape and reward rapists. Why is that your answer ? You think India has another school if that one shuts down ? India is a sad excuse of a country inhabited by sad excuse of people. F India. This is not that school. That school is in chachiawas area in ajmer. It's a small school. You sure punitive punishment? Maybe that classic non-punitive punishment It was in the papers today Also its not a one off, like this one from dehradun- In this case, a magistrate asked a gang rape survivor to strip in court- Imagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape. When religion stops being the cause for so many atrocities, I'm sure people will stop blaming it. its not a one off, like this one from dehradun- In this case, a magistrate asked a gang rape survivor to strip in court- Imagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape. its not a one off, like this one from dehradun- In this case, a magistrate asked a gang rape survivor to strip in court- Imagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape. its not a one off, like this one from dehradun- In this case, a magistrate asked a gang rape survivor to strip in court- Imagine the pain, trauma and PTSD to be told to strip in front of everyone especially after going through rape. At this point only a grassroots cultural revolution can stop this. Oh, do you know the exact school? I can’t find it but I don’t really care fr, India is so messed up This happens all the time in even 'big shot' schools in urban india. Her own family You should delete that school link as people will end up screwing its rating on Google maps. 👍 Thank you very much OP. Shame on the school district for not letting the student continue their studies Prosecute the school for denying her education. When my father worked a job in India, the locals were congratulating him on not having any daughters as much as they congratulated him on having two sons. Maybe even more. I kinda understand why. This shit was probably worse 20 years ago. India has a serious problem. I would love to bring the KOS culture for rapists. Just India things 🤷🏻‍♂️ It’s part of the culture at this point. Not a true Indian if you haven’t been or participated in a gang rape. If it were any other country, I'd agree. But there, it's the national sport. You'd be hard-pressed to find a school there where this exact scenario DIDN'T happen. They'd have to shut down EVERY school. I have to say: I enjoyed my childhood in India and have happy memories. But am very glad, as an adult, that I live in the US. The US has a lot of problems. But not compared to India. People out here complain a lot, they have no idea how good they have it. Honestly, there’s not much to unpack; this is just how things are in ass fucking backwards India. Kidding, obviously there are things to unpack, and you have some fair points, but we still get to make fun of India for being backwards and rapey like other countries make fun of the U.S. for being obese among many things. not that u need to me tell u but please dont listen to those kinds of people , if u have potential please do aim high i mean...that works yeah Ah yes good old victim blaming and ostracization - nobody does it better than us. This is why so much of rape goes underreported and they need to suffer silently. Most of Asia, not just India. not sure how that works but yeah theres need for some massive change in peoples mentality which i doubt is coming any time soon unfortuantely yeah but..this atrocity was not committed on the basis of religion There should be enough evidence here too sue the owners of that school so bad that they'll have to grovel in front of that girl and beg her for mercy. Worst country for women I feel physically sick. I wish that whole school goes down and every single piece of shit who is involved in this go though hell and The whole administeration should be fired and banned from joining any education institution or any job. And also why it doesn't matter how many rapes other countries have and why I say that India has a deep rooted rape culture. Because not only are the rapes commonplace and trivialized, the victims are actually shamed and mocked though out their life and made to suffer so that they silent. What's even worse is this expectation that somehow a rape survivor should be willing to sleep with anybody because they are already \"tainted\". Rape victims are frequently the subject of further rapes and rape attempts because of this reason. Several years ago, there was an article on the life of rape survivors. There was one story about a 14 year old girl whose family was way laid by some goons while they were traveling and she was gang raped by them. Her school threw her out because the parents of other kids vehemently objected to her presence in the school. Her family had to relocate after that and after she joined a new school, somehow somebody recognized her has a rape survivor and spread it around and everyday she is mocked and taunted about her rape on her way to school. this backward mentality just cant be helped it seems , the older generations do love blaming this new one for all sorts of things and turns around and does this kinda stuff You're not wrong, but no political party alone can fix this. Misogyny is too ingrained in our culture. Leaving the poor to get assaulted taking out the trash. Yeah. But why?? Do they think the woman did it to herself with consent?! Don't they understand the definition of r*pe? Is it the malnutrition in India causing the lack of brain cells in these people? It's india so I'm not surprised, all they do over there is r@pe Worst country on earth The principal of the school in this case is a woman which makes this all the more wierd. Reasons No. 1001 why girls and their families don't report rape cases to the police!! If cases like this go on and people's attitude don't change regarding rape victims and they continued to be shunned then the future of this country is in real danger fr! waah! ye chu\\*\\*\\* padhaenge bacho ko! sharm honi chahiye puri staff ko iss college ki. Small minded people I disagree. Most of the discrimination against rape victims is because they're seen as sinners or as \"impure\". All religious hogwash > laws are in favor of women They don't understand that even if this is true, it means absolutely nothing. In a conservative country like ours where the victim will be ruthlessly blamed and shamed for the crime, 99.9% of women just won't report it, so the laws are useless. Legally speaking, Islamic countries have some of the strictest penalties for rape, but no one would argue that these countries are a paradise for women. Society and culture influence your life a lot more than laws do. I knew this was r/India just from the headline Trust me when I say it's hopeless. The people in power are no different. There is currently not a single rational human up there and will never be. This is the world we live in. I watched a movie from India, and the girls were kidnapped and forced to be prostitutes. And the one lady who comes to talk to the girl go, what are you going to do? You can't go home, they would kill you for the shame, even if you come home untouched. So you will die if you go back, and if you don't work you will die here. So basically these Indian girls even though they are kidnapped and assaulted would be killed for allowing this to happen?! Like wtf?! Poor girls. What a horrific fucking mindset! I don’t know why I am this surprised when I should be expecting it. Fuck, these people will never let her mentally heal, ever. I once got into a debate with my older hair stylist arguing that women should be able to be president, while my hair stylist argued that women are unsuitable. I'm a guy, she's woman. It was really weird to be arguing to someone that they are my equal and for them to insist that they are not. I feel this. I remember a conversation with my grandma where she told me (verbatim) sons are better than daughters/ boys are better than girls.. I said to her “but you’re a woman! How can you think that?” Doubt I even got a response to this. I was seriously flabbergasted at that point. But tbh over the years we were able to change her views, which was the best part❤️ Of course but Congress atleast doesn’t encourage or support rapists. We cannot remove misogyny from India overnight but we can change to govt that atleast thinks rape is wrong and rapists are criminals that they won’t release because they’re are from a particular community. India needs to be shut down, it's not just this school The school administrator or whom ever denied her, should spend the rest of their life locked away. They do not treat her as a human with compassion, why should we them. Return it to civilized British control, are any white western power. This is why I won’t go near India. Oh you mentioned Indians in a bad light. I’m surprised it isn’t being bombarded by Indian dudes who are immediately offended That's stupid af. Closing a centre of education rather than the person who did it? they r just puppets with no moral grounds. Selfish and despicable So much racism. All this while you have a space program. Classic behaviour Don't be silly, some of us pajeets smell great! Come sniff me! Sad to see. As a medical intern seeing how OBG doctors (usually women) treat their patients was very surprising. Seeing how they treat rape victims coming for medicolegal examination just makes me cry. Already know its India without looking at the sub harsash sajut singh kabal garesh no jit hit! Common misconception, misogyny has no gender Every time I hear about this country it’s something rape-related. Never stepping foot into this shithole. \"Uncle\" Not stranger, an UNCLE and his friends. After a year - Has the uncle or the aides been arrested? Have they had any legal actions taken against them? Has anything been done to them? Username checks out. On a serious note, yeah this school needs to be shut down or atleast the principle deserves to be behind the bars and publicly shamed for her actions Indian dudes favorite team sport Haha, that's disgusting. Indian culture at its finest national sport rape Because people in here are majority level one reflexive thinkers that don’t think about consequences of certain “solutions” I'm all about freedom of religion and spiritual faith, but this isn't religious or faithful, it's a miserable fucking excuse of a brainwash culture that stays afloat off rape babies and weak minded men who prey on children. But since their personal pedophile prophet condones it, that apparently means they can just escape all the consequences of their karma and not get reincarnated as what they hate most or have their actions reflected on them in the most ironic way. I read the title then saw \"Jaipur\" What a shock😐 Dang India sucks and not safe for females. Its in India, check out. The whole country is not like that. Y the fek does Rajasthan and Jharkhand is always top on grapes? And india is diverse with several communities with different view as a society but because of some assholes disregarding women and conducting crime all the indian people who dont even have a say in their community has to take the blame! All we can say is stop harassment but the societal view has to change. And the state govt has to take control. There are several feminist organisations in the country do some counselling in villages and stop just barking on social media and say india is bad. Im from kerala but mu society dont even have this level of sexual harrasment against women but because of these mfs i have to face backlash as an indian in foreign land and media. Get some big strong gay dudes and let them rape the guys that did it. am boy though i was talking about my sister and mom They didn’t say India is bad. They said India hits a new low everyday. In recent news two tourists were raped in India. The male was beaten and the women was gang raped. Are you forgetting when few men gang raped a women and shoved a rod in her and pulled her intestines out? And then left her naked, tossed her in the cold night? India needs to do more to protect women. You spelt burnt down wrong there my friend. I cant even imagine what she is going through mentally. Imagine having no friends, no focus for academics and not even being allowed into an institution where people who look just like you externally are accepted and due to no fault of your own. She probably had to force herself to study, with the dream of moving on with life but no, its too dangerous for other students and faculty to be in an innocent child's presence. What motivation she is going to have? Now that she is not even being allowed to take her exams. And we wonder why this country has gone to shit. If innocence of children is the price to be paid for humans to accept other humans and co exist, I say it must be paid. finally the real solution. I was done when the tourist got raped when she decided to visit india after visiting so many countries unharmed. I was just thinking of leaving a shit review Yeah I too can't find the exact listing for the name that's mentioned in the article. I see some coaching class as nearest match but that looks doubtful. LOL try my school and you'll get the same result It’s India. Why are we even surprised by any of this ? Exactly. Why the heck do i have to take blame for something happened in 2000 km away from me . Plus i don’t support these assholes raping women like wtf. All i said is that there is a list of harassment happening in one or two states particularly in the north. I am from the south all i can do for these harassed women from south is using my voice to get this on the law enforcements ears. But doing so why the heck do i have to take blame as a an Indian and have to deal with racist comments on my country. 'Spoil the atmosphere'? By what fucking logic? That principal should resign asap if she has even a bit of conscience left in her I wanna burn that whole place down. In more realistic terms, that place and every authority figure involved needs to be bulldozed. That culture is a cesspool towards women This is fu*king disgusting! Headline was horrible, I was shocked until I saw where this occurred. I suggest you reread my statement. It does not suggest that pickmes are the only type of women who work to perpetuate the patriarchy. It was simply an example. The more I learn about India, the more disgusted I am. How these fuckers have a space program.... AFAIK the Magistrate got his ass sued This is sad to read like school is doing this then what should we expect from society Reason 4,000,000,001 not to ever visit that shithole, no? Have you tried turning India off and then back on again? I'm sorry you indian chicks ( and any other chicks for that matter ) have to go through shit like that, shit will get better, it always does, it just takes a while, all of this will be in the past at some point, I hope the cunts that did that get \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* and \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* let your imagination guide you with filling the spaces this country hits a new low everyday. Fuck this shithole of a place. All people do is think abt themselves and religion. Idc but the religious brainwashing in this country is out of hand. Downvote me but thats the truth. Shunning a child from school cause she was raped, absolutely disgusting behavior by that school. Atmosphere my ass, half the kids in school are lost in their own world, atmosphere it seems. We keep preaching about our morals and ethics and so called \"sanskaar\" or wtv the fuck it is. All talk but no action. How dare she get raped. Hope the rapists get justice. We celebrate the rapist release from jail. The victim pays a heavy price for the crime which she didn't even commit. What kind of humans are we? Are we even human? You mean Stockholm syndrome on steroids? Why? Shame on this mental attitude. \"May spoil the atmosphere\" .... i dont know what to say.... When some people say rape culture does not exist just show them such incidents Cause that’s her fault, right? /s Yeah perfect solution for everything /s Safer and better for western interests That’s disgusting. Poor girl That's not a good look for the school Oh, it's India Does India deeply hate women? I'm so amazed Rajasthan does not garner enough criticism for being one of the most mysogynistic and anti-woman state in india like Bihar and uttarpradesh do, probably because it doesn't have as many people or bc it has a \"unique culture\" bc of the desert and forts. But it's undoubtedly on the same fucked up level as Bihar and uttarpradesh. Even when it doesn't have the overpopulation and poverty problem, the cultural attitudes towards women en masse are extremely regressive. Anyways, if I was this girl i would end up hating the country, culture whatever makes india, india my entire life. She deserves to gtfo off here, marry a foreigner and spread hate and propoganda about india being the worst country for women there is on foreign podcasts. At this point, I feel like all the hate that india gets on international platforms is soo valid. Wtf Wishing anyone who would shame or discriminate against a rape victim gets a visit from Kali. India strikes again India may be in need of a few nukes Didn't the police, in some recent incident where a foreigner got raped, asked her to remove the post, to preserve the international Image? I guess that how our fame of cultural ethics and morality was maintained since past few decades. Agreed about mob mentality, I don't believe in executions I was just very emotionally unstable when I made that comment. You are right, I was wrong. I never supported executions or retributive justice in my life, I was just very emotionally unstable when I made that comment. Still, tells you a lot about our country's mediaeval punishment mentality considering how many upvotes my underthought comment got What What kind of incentive structure is this? Acme Academy? So this is where the Coyote orders his stuff from. Honest question- is this a newer development. I see this type of thing all the time recently but don't recall hearing about it before. Is it a lack of reporting or are things getting worse? She was brave already to face the school nd those dumbass people denied her. Most of victims are not able to face the world afterwards. The trauma stays with them forever. Wow. Just wow. No words. Isn’t there a whole class of people in Indian caste called “the undesirables” or something that are basically treated as subhumans Actually it is deeply embedded in our society which has always been there but we hide it in the name of culture Shahbaz Ansari did an interview for The Print \"Know why Delhi is called the r*pe capital\" You will be surprised to see the thinking of an average Indian about why r*pes happen. And it is not limited to the elderly only thousands of dank memes and dark comments also exists in social media by youths Imagine the pain and struggle. Probably we should all be grateful to God today as her pain and struggle is much more than what we face. Not sure why I keep getting r/India suggested to me (not India) but holy fuck what is happening in India. The only posts I ever see are these bewakoofo ki kami nhi hai.. they just want to avoid trouble (if there's any) and Don't even consider the victim's pov.. truly weird times We live in a place where being r@ped has become more of a crime than r@pe itself congrats for the progress india today finally I'm shamed to call myself an indian 👏 The entire administration needs to be booted. Why is there no legal action taken against this school by education department? I feel terrible for girls and women in India We were all thinking it This is a very old low Now school will be fu*ked by people and govt. Oof Yeah! We can import them to the west I will be ashamed to even stay in that school my blood would boil in pain and agony , what if the same thing happened with one of the school's authority closed one will they do the same we failed as human beings Bulldozers is only for people opposing government agenda, not people welfare I read the title before seeing the subreddit, and some how knew it was india. Sorry, not sorry. I'm a white Canadian but my wife is from India and she told me her grandmother refused tk ever touch or interact with her and this blew my mind because the grandmother is obviously also a girl. Was quite the shock to me. This is just so fucked up on so many levels. Imagine what the kid went through with the rape ordeal and now again being humiliated. The so-called adults in that school don't have an ounce of humanity. I do not want talk about those uncivilized cultures oh u mean it like that , i thought u were implying the rape was done on the basis of religion Educated Indian here. At some point nothing one does is gonna work. Unfortunately, the country is ruled by old people that have generationally traumatized the Millennials and Gen Zs into submission and obedience, and the cycle is just gonna keep continuing. The people that are jumping ship are doing so because the ship has too much water at this point. It's pointless to try draining it of water. Instead we wait to salvage after the ship has sunk and turned into a wreck. And taking credits for other people's inventions No, the schools actions Not from India. I keep getting recommended gang rape posts here and on twitter.. Jusf saw a post about a monitor lizard got g raped . Now this. Why is a victim of a horrible crime being treated this way. This is so wild to me. Ah, just another normal day in India, am suprised they even launched an investigation. Principal needs to be gang r*%^#* wow india, you make me ashamed to have you as my home country yet again Blame those people for racism because you’re not a spokesperson for the entire country and regardless of what their views are about India, it doesn’t entitle them to be racist. Also while they are right that India has a rape culture, many use it as an excuse to exercise their general bias and hate for Indians. That said, sure India is diverse, but it’s also one of the worst places to live as a woman and this news is just a needle in a haystack. Also, stop speaking for women in general. Tons of women in kerala face sexual harassment and it’s a part of their daily lives as well. No state here is magically exempt from this crap. Being a rape apologist is synonymous with Indian culture as it stands. And you’re displaying that here. I say that as an Indian woman living in one of the most metropolitan cities in India which is better accordingly to _men_. What parts of our culture are truly redeemable when women (so many are underage and children) are treated like this by their ‘own people’ because of that culture? It’s a nationwide problem. Edit after seeing your other comment: I am a South Indian woman and know many that would disagree (very angrily and be justified to do so) with you about ‘safety’ here. Fuck is wrong with people? The thing is in India government is corrupt and doesnt give a shit and so these things may not work in India unless you are from a high-class background Wth Is happening in this country??? Women is the biggest enemy of women As a person who is middle class living in India, i also agree with you. Wanna get out of this shithole garbage dumping country and go elsewhere where people have basic common sense and civic sense but unfortunately for now im stuck here 🥲 Sorry that's not gonna happen in Modi's India Those schools have connections it's ain't that easy if it's comnected with some politican Huh? How many rights are they violating here? Legally speaking, but then morally speaking, they don't deserve to live. Not only are you prohibiting a rape survivor from her education, but also from her chance to rehabilitation. BECAUSE she was raped??? 'it would soil the atmosphere'. What the actual fuck. You mean she refused to touch her own granddaughter? That’s weird even by Indian standards - her grandmother has some mental problems. Or the principal fired at the least. such a sad state of affairs, if there is next birth for me, may god send me to a very poor family as a man but not as a women in india. Fk man, abhi recently ek maxican ka bhi rape hua tha Jharkhand me, ye kya ho raha he bc desh ko Congress ruled state. Nothing better to expect. Accha hua ... Cant even begine to imagine what that little girl is going through right now So true. Often older women and yesteryear feminists are some of the biggest allies of sexism. The \"feminism these days is baad coz of so and so...\" crowd only vouche for performative activism like education or job at max and think they'll achieve equality when patriarchy itself is literally a thought process that's nowhere weeded out. Like what? The usb which joseph stalin made? I mean why I read few news articles where women plan rape of other women as revenge. Fucking disgusting Hello! Please name the school and Google maps link if possible. I would like to take this up from them and make them responsible. Human rights and india? Two opposite things Sale bsk Rajasthan : We defeat even the Stone Age people in barbarian terms Don't you have any shame? Bringing up politics here too? It’s her fault for tempting men to rape her.Afterall we women aren’t human beings./s Bhai tum itna frustrated nahi ho rape se. It shows. The government is responsible for all the rapes that happens in India. If you won’t hold them accountable, you are complicit. Men are second class citizen, all laws are anti men!! False rapes cases!!!! I love this country and all but shit like this makes me want to leave this cesspool of a country. There are a bunch of Indians who claim they invented the internet, airplane, cars, scientific theories during the ancient times. Many of them even claimed that Jesus came to India and learned from a guru lol Someone tell this to Modi on Man ki bat. That first sentence in the article is just one big run on sentence agreed. I'm indian but born in america. India's poor law system essentially means that people have to take the law into their own hands. And obviously, the poor personal freedoms and lack of media coverage means no accountability. While I am proud of my heritage, India is embarrassing as a country. We got problems in the US, but India makes us look like heaven. It's always the fault of the victim ! How shameful I’m sorry but… this academy ALREADDYY sounds like a complete fucking joke, and not only THAT… BUT if also called freakin “ACME Academy??”Lmfao WTFFFF 🤣🤣😆😆😂😂😆😆😅😅 WHAAAT IN THA Tom&jerry… BuggsBunny…RoadRunner&Wile E. Coyote JOKE OF A FUCKINN “SCHOOL” IS THIS PLACE??? This is a SORRY ASS EXCUSE of a supposed “Highly Esteemed Academy” … Sorry but bulldozer only for religious purposes I really hope this is addressed on a bigger scale this can’t be forgotten, the victim and her family and countless others who’ve been through the same NEED justice. Get these guys and the principal off the streets and into prison, life sentence. Being born in India is a curse. Meanwhile, the guys that raped her would be enjoying their lives... Every rapist must be kept between life and death, make them suffer but don't give them the freedom of death. They should yearn for death, they should feel the pain that their victim has endured for eternity. Just lock them up with a big dude who will constantly rape them, just so they know how she felt, fucking bastards. Worse, other parents would probably support the school."
}