{
    "id": "1425amz",
    "title": "Anyone else sick and tired of amazon sending books with no protective packaging? Damaging books in transit is an outrage and is deeply offensive to people who paid for those books.",
    "url": "https://www.reddit.com/r/india/comments/1425amz/anyone_else_sick_and_tired_of_amazon_sending/",
    "selftext": "Edit: I have wrote to amazon and included this post link in the mail, I hope this would be enough to trigger some policy change for BOOKS SAKES\n\nI order many books online and I order after searching for the best deal, I have recently noticed that Amazon has been consistently damaging my books by packing it in nothing but a paper bag (seriously, nothing else). I remember when amazon used to at least pack the books in bubblewrap, but after there was an outrage directed at amazon for using too much packing material, they have reduced it to a bare minimum. Now, I am not a fan of plastic, but if that's what it takes to keep my books safe, then I don't mind it the least. \n\nThe frustrating thing tho, is knowing that you don't need plastic bubblewrap to wrap books safely. Flipkart.com does a very good of packing their books. They use [these cardboard boxes](https://imgur.com/a/VpTtAg8) to carefully wrap my books and they reach me without a fuss and in mint condition. Has anyone else been having this issue on Amazon? Seriously, I am thinking about never ever buying books from amazon if they keep up with this.",
    "flair": "Rant / Vent",
    "score": 446,
    "num_comments": 101,
    "created_utc": 1686030255.0,
    "convurl": "https://external-preview.redd.it/kVzc-Kvy2bE6L9lM7M4bYmzuoPNUnJ_l7UQXsdRfYbw.jpg?auto=webp&v=enabled&s=13d539caff4cf1e1f2c628893bf67e01000c634a",
    "comments": [
        "They send most of thing which you order in these paper bag, I have received my smart watch, Bluetooth neckband, speaker in these type of packaging items but they were not damaged except the outer box of neckband was a bit damaged, i don't like to order things from Flipkart because they have introduced handling charge of n (charge varies) per CoD order which is weird because so far I have seen that only they are charging it and are most irresponsible with the orders.",
        "smart watch obviously has brand packaging and cover. They are packed pretty well by brand itself, so I don't see how they could be damaged in transit. But books, without any protection can and very often do get damaged in transit. I don't care if they send my phones with brand packaging and cover that with amazon logo paper bag, phones are kept in place and there is a slim chance of damage. But the same thing is not true for books.\n\nedit: I am yet to hear about the handling charge on flipkart. I am not a fan of flipkart or anything, but is it possible that they are charging handling fees for only a few order or orders below a certain minimum amount? Because I think amazon does that too.",
        "I know this is irrelevant but goddamn y’all use the word offensive too much.",
        "I don't particularly like the word offensive as well. But in certain contexts. \n\n\"Your speech is offensive\" is not a valid argument against what I am saying.\n\nBut I would say, as amazon is supposed to care about what their customers feel like and that's good for their own buttomlines and for their customers' satisfaction, I feel like in this context, the word offensive is somewhat relevant.\n\nAnd yes, perhaps you are right about the word offensive, perhaps I should not have mentioned it here.",
        "Offensive, in the social media context, means that amazon is attacking a demographic that you pertain to with an action of theirs.\n\nThey are being assholes with their packaging. I completely agree. Offensive is just not the word to use here. Because they’re doing it to everyone, and they’re not doing it for any reason against you, it’s just to pad their bottom line.\n\nAssholes? Absolutely. Offensive? No",
        "Only in the social media context is it thought of as that way and I will agree that in social media context what you are saying abt attacking demographic might be true (although I don't feel like it's actual meaning has to do something with demographics). But, yes, a point well done. I would say the word is spoiled. I probably won't use it again. Heck, I was not sure if to use it while typing it :')",
        "True, the use silly bubble wrapped plastic bags or sometimes just paper bags, for other goods it's a casing but there is no casing for books so they get damage. The can use something better, earlier it used to be a hard cardboard pack but they discontinued citing logistical and environment concerns, it is believable, but book do get damage.",
        "I have worked in Amazon but not in India, I have seen books with no wraps whatsoever just stuffed in a small cardboard like box, toilet paper with no wraps whatsoever, open parcels containing phones, coke cans with no wraps just the one which comes from the manufacturer, threw multiple smart TVs down a chute from first floor, handled smart TVs or GPUs or monitors like shit, threw them all over the place, broke glass bottles containing various liquids, etc. \n\nIt's not feasible for them to make sure that all the products are handled properly, even if there is some damage the seller has to pay for it, Amazon won't pay a dime in damages to the seller.",
        "> stuffed in a small cardboard like box\n\nbeats the hell out of paper bro, like seriously, they sent it in a paper bag. \n\nAlso, I am pretty sure what you are mentioning is all true. But, I feel like there might be a bias here since you have bad things more frequently.\n\nedit: it's a dick move to make the buyers pay for the books you damaged in transit, but I wonder why even the sellers don't pack it well tho.",
        "I want to laugh but i can't. Just getting books is hard enough. Just bought books for studying and they gave me wrong ones. What can I say",
        "Nope, what they both do is charge delivery charge for the order value which is either not fullfield by them or does not reach a minimum order value.\nFlipkart do however charge you an extra Secure packaging fee of 59/- for orders which requires them whereas Amazon does not.\nIt seems that Flipkart has removed the handling charges.\nI do understand and hope that any item which is ordered should be packaged with care and not just wrapped in a paper bag at least for items which can be damaged like electronics, books.\n\nEdit 1: the handling charges are still there in Flipkart.\nChoose Cash on Delivery in Payment option and you can see it.",
        "I am , i have returned more books then what i have bought . Complained time and time again to customer case, even rating them as low as possible .   \nBull shit practice",
        "I agree with you. Frustrating. \n\nI've switched to just buying from local bookstores. If I'm not able to go there, I just call them and dunzo it from there. Buying 4-5 books at a time makes it worth the delivery cost anyway. + get to support real bookstores instead of amazon.",
        "> I am , i have returned more books then what i have bought . Complained time and time again to customer case, even rating them as low as possible \n\nshit, I hope they take steps to solve this. Or else, maybe I will just buy on flipkart",
        "dunzo han? it's available in India. I didn't know. I don't live in a metropolitan",
        "Local bookshops are the best way to get books. Even if they do not have the book you need with them, they'll help you to get it. Hell I often order from the bookshop in jorbagh Delhi and they are pretty good with the packing. And if you don't know what you're looking for, they too help with that. I wanted to read a good historical fiction, set at least a thousand years ago. I asked them for a suggestion and that's how I found out about the Rome series. Absolutely brilliant series.\n\nI usually don't buy from Amazon unless it's too expensive offline. :)",
        "But they charge double of what Amazon charges.",
        "Stopped buying from Amazon.",
        "Two days back got my book with a torn spine at the top, asked for replacement, guy picked it from me yesterday and now they're saying I'll get the replacement in another week! Imagine paying for prime and being punished for it while it was the seller at fault all along, and added to this there is no guarantee that the replacement would be up to the mark.",
        "depends on the book i guess. i'm in bangalore, and lots of good 2nd hand bookstores here. so usually not much of an issue on price, since i don't care if its new.. just if its in a decent condition.",
        "What are you talking about? I always got my books in a bubble rap",
        "Once I orderd a jewellery set and I got it in its own box and a sticker on top saying product has its own packaging,  now I can't use that box because it's all damaged",
        "I use flipkart for books, they have a nice sturdy cardboard box and i haven't received a damaged product yet",
        "Nope, books get delivered directly to my kindle….instantly. 🤓",
        "Call the customer support and request them to take the item back with your justification. Escalate it further if required. Knowing how good Amazon's customer support is, I feel you might get a replacement.",
        "One good thing about Amazon is they replace without any drama if there’s slightest of damage with books. That being said I’m just going to Crossword/Book shops nowadays so I can get book quickly and I can inspect quality there.",
        "The seller is trying to save money by not purchasing the Amazon shipping boxes. I am pretty sure that they have to use Amazon labeled boxes for shipping and they are expensive since it's another source of revenue for Amazon.\n\nI have destroyed multiple smart TVs as big as 50 inches, monitors with 240Hz refresh rate or 4K resolution,etc. Amazon supervisors don't care about the parcels they have targets which they need to achieve and sellers like to keep their profit to maximum by minimum packaging.",
        "Yes. But sometimes, bookstore retailers ship such qualities.\n\nOnce I purchased a book from the offline market and it's quality was awful.",
        "Its frustrating. I always order books from Amazon because of good discounts but they pack them in such boxes and because of that the books delivered are damaged or folded and I return them because noway I can stand those books. I have written an email and even left a feedback saying the same thing but no change. They even sent me duplicate copies a few times and it is easier to tell that. I place a return everytime they do this. I remember once i ordered 10 books out of which 9 got delivered in 3 shipments and they delivered the other book somewhere else only. Idk how the hell that happened. After alot of calling the courier company and complaining at amazon they refunded the amount after a period of one month. They were like it shows delivered to u we cannot do anything and cannot offer refund blah blah. After telling them of consumer complaints they refunded my amount. Amaozon needs to up their UI as well as their service and packaging ffs.",
        "They rarely have the collection though.",
        "They started off as book shipping companies, and don't care much about books :/",
        "Use padega india for your book purchase next time...",
        "They even send items with transparent packaging, like the whole society will know what item you have ordered. \n\nOne of worst move , profitable for them to make save big bucks in the name of environment",
        "I use Bookswagon or Flipkart (or actual bookshops). BW is also significantly cheaper than Amazon. Only issue is that they take 10-15 days to deliver.",
        "Also fake books",
        "That's sad. \n\nConsider buying books from independent bookshops if they are in your city, if not many from delhi, Pune etc ship pan-india. These issues don't happen in those cases, although the prices might be higher side. \nThese are for fiction and non fiction tho. Academic books are available on Amazon only mostly. But Amazon sells cheap quality copies too.\n\nTell me if you need a list of independent bookstores",
        "I bought boxset of LoTR from Amazon which was torn in every possible way ...... \n\n\nStopped buying books from Amazon altogether....",
        "This morning I happened to see people sorting Amazon.in packages by delivery address at a sorting facility. They had a huge pile of packages at the center of the room and just throwing them to all corners as per the addresses. Just utter disregard to the items in the boxes. I then understood why my packages look like trash when they arrived.",
        "Support your local bookstores",
        "I better keep off these websites rather i owe time and my patience in traffic to buy from nearest city on weekends. \n\nFew of my pals reported and got into dark agony missing pages - torn - damaged products.",
        "Returned 6 textbooks this summer because of this. They cost between ₹1000 - 8000; I thought they'd at least wrap them in bubble wrap as they were expensive, but no, just plain brown paper bags.",
        "I’m satisfied with Amazon’s service. I’ve never seen a online shopping giant be so effective and trust worthy. \n\nTheir service is being exploited by many and people suddenly get super angry about certain niche problems. \n\nI’m just happy they still stay afloat even though people exploit their professional behavior",
        "kya farak padta hai waise bhi wo original book thodi bhejte hai",
        "To think I got a sun screen in a Air Conditoner size box. SMH",
        "Tell me about Bookswagon though. I actually came to know about it while I was searching for alternatives to Amazon. How has your experience been so far?",
        "I would like the seller to atleast care about his/her own buttomline tho. If I receive the books in a bad enough condition, I won't be keeping it and he will end up with the book which has been in transit twice.",
        "> logistical and environment concerns\n\nnot very consumer centric of them",
        "Sorry, this doesn't make sense. Why did you buy it from the offline market if it was awful?",
        "> guy picked it from me yesterday and now they're saying I'll get the replacement in another week!\n\nInteresting, I got to keep the book until the replacement arrived. I didn't try to read it tho. Even accidental damage might spell a loss for the seller (imagining anyone would buy damaged books). I am scared of replacement not being upto mark too. Ughh.... get better amazon!",
        "On the bright side, you have more of that jewellery than you previously would have had :')\n\nI hope you got it replaced tho!",
        "Love Flipkart for this reason! Will keep buying from them even if they have higher prices. Seeing a book in it's pristine condition is worth it.",
        "Kindle, well, I prefer physical books, especially for academic books\n\nBut yeah, Kindle is amazing.",
        "Yeah, they booked a replacement, but I think you would agree that no man who loves books would like to see books damaged in the first place. Plus, there is no guarantee that the replacement would be any better.",
        "lol Ikr! I thought the same when I got my torn book :')",
        "nice Thank you!!",
        "> They even send items with transparent packaging, like the whole society will know what item you have ordered.\n\nAs long as you are buying academic books, this is not a problem. What did you order lol",
        "Some of em. Ughh....",
        "Pleaseeee... I need a list of independent bookstores. Infact I made a post few days ago asking that.",
        "where do you buy from now tho?",
        "Once they stop acting like they own me :'(",
        "how do you get a replacement if you have missing pages if you are say ordering from the local city store?",
        "> I thought they'd at least wrap them in bubble wrap as they were expensive, but no, just plain brown paper bags.\n\nThis shit is depressing, I know exactly how you feel",
        "Customer Care said the same thing, that I was supposed to get a replacement the same time when my pickup was scheduled but apparently that didn't go as planned. Atleast my app now says that my return has reached the seller but I'm still stuck in limbo as the app still says \"Preparing for Dispatch\" for my replacement, with no specific delivery date or window, let's see what happens.",
        "No only box was damaged",
        "Transparent? I guess, what you mean is, they don't use any packaging at all these days.\n\nIn the past, worse, they used to hang the invoice loose outside the packaging, and if left with the neighbour, they'd know what you ordered.",
        "Because it was urgent. There was no time to wait for an online order.",
        "I've been shopping from Amazon.in since 2013 and most often they'd pack the books badly. I don't remember how many engineering college textbooks I had to return back in 2014-18 just because they would come folded from corners even if packed with a cardboard.",
        "Avoid Amazon when it comes to purchasing books. I have always received damaged books from Amazon. Personally I have found that out of every 10 books that I order from Amazon, 8 end up being duplicate. A better alternative is Flipkart where I find 1 to 2 books being duplicate for every 10 books that I order. Flipkart’s packaging too is better than Amazon.",
        "how to check the legitimacy of a book tho?",
        "Pros: cheaper, will import books not available in India, good packaging\n\nCons: takes 1-2 weeks to deliver, searching catalog by title is difficult (searching by author works better).",
        "Pls dont say this i have ordered a few books all on the way",
        "Here.\n\nhttps://www.reddit.com/r/Indianbooks/comments/rvsuwg/support_independent_bookshops/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nFrom my old ac",
        "Then stop complaining\nThe world doesn't revolve around you",
        "considering there is no centre of the universe, I can very well think that the world does revolve around me.",
        "What handling charge ? I am not seeing anything",
        "thank you!!!",
        "you have got a few paper bags coming your way. I won't care if they are not textbooks. i.e., If you are gonna only read it once, I won't care much about it. But, if they are textbooks, get ready to exchange them",
        "you get what you pay for.",
        "I didn't pay for a torn book. \n\nedit: Just confirmed, the amazon agent said I didn't indeed pay for a torn book",
        "Ina way that is good. We should not buy books online. Books should be bought in physical shops and lend from libraries.",
        "You're welcome",
        "Nooo they are novels",
        "I repeat never ever buy any ELECTRONIC items from FLIPKART.\n\nThey will send you a defective product and then send some 6th fail technician to check it and then won't even give you replacement and refund",
        "It is there. Choose Cash on Delivery in Payment option and you will see a Payment Handling Charge. See below screenshot, this order qualifies for Free Delivery yet a handling charges of 10 is being placed for CoD option.\n\nhttps://preview.redd.it/i16s1jib4j4b1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=e889ccbc16ae41cc3f693202f162ecc3dfd36705",
        "Just returned another book from Amazon because it was damaged .\n\nI ordered twice of the same book . Posting picture of the same .\n\nhttps://preview.redd.it/nri7trdz8j4b1.jpeg?width=1800&format=pjpg&auto=webp&v=enabled&s=e9b48ddc99aa7366406ef04414455c828bdf0876\n\nand returned all the time because everytime, I got a damaged copy .",
        "Got a kindle to get away from physical books. You should try it as well. The e reader has a really good battery life as well. All physical books bought from there is packaged terribly.",
        "Ok it's on cod. Haven't used cod in many years.\n\nAnd it's 10rs, not 50 like you mentioned in original comment\n\nThey might want to discourage cod while losing some business then",
        "No",
        "Sure it's 10 but it is not fixed it can be 5,10 or even more.\n\nI just mentioned because I was charged 50 on my order.\n\nDon't know what's the reason but so far I have only seen Flipkart charging it.",
        ":(",
        "Lol go to a bookstore and buy the books. Don't be so lazy",
        "My books arrived in perfect condition",
        "Never had happened till date. Books are mostly checked and bought from legitimate sources afaik.",
        "book stores didn't have the books I wanted.",
        "oh",
        "Local Bookshops. Also checkout Bookswagon, their delivery wait time is way too high. 15 to 18 days. \n\nBut never received a damaged book till now from Bookswagon.",
        "I determine whether the book is a pirated copy or not mostly from the look and feel of the book. The ink used for the text must be jet black and uniform instead of light and patchy. The text must be printed well and uniform. The pages must be of appreciable quality. This is a hard one to ascertain. The pages if beige in colour shouldn’t be brown. If the pages are white then they must be a uniform white. The texture of the pages must also be uniform. Lastly the binding, cover, overall look and in hand feel of the book must be good. In short avoid Amazon and take your chances with Flipkart.",
        "I know it has been a while, but I thought I replied. \n\nSomething similar happened to me, but I kept the book and tried to wrap it with tape to protect it, because I didn't have the patience to return it. I am pretty sure they were counting on it.",
        "> Support your local bookstores\n\nI tried to buy a book at the local store heeding to your advice, he didn't have any other books that I wanted, only 1 and he sold me the book without talking a word, he behaved as if he was deaf and dumb, totally indifferent and incompetent.",
        "That depends. Bookswagon is cheap for international editions but for those printed in India it's expensive than amazon.",
        "Yes I am fed up of getting damaged books since Amazon.in gave them in paper packaging, moreover when I purchased the ack ultimate collection they had sent it to me as it is in the original box without any extra outer box to protect the product, this was not the case with Amazon earlier but of lately this seems to be pattern and is pathetic. In the name of saving nature they are just reducing any sort of box packaging which is absurd as my items were all damaged why would someone accept damaged articles, seriously they ought to change their packaging. Earlier they were giving an option about packaging feedback now that option is also gone it seems.",
        "Two later and nothing has changed. I still receive damaged books on the regular because they are only placed in a paper bag. The dust cover on the latest book I ordered looks like it's been through a war. How am I supposed to gift this book now?  I'm sure the author of this book would also not want their book returned because of backend inefficiency. Sigh."
    ],
    "cleaned_text": "anyone else sick tired amazon sending books protective packaging damaging books transit outrage deeply offensive people paid books edit wrote amazon included post link mail hope would enough trigger policy change books sakes order many books online order searching best deal recently noticed amazon consistently damaging books packing nothing paper bag seriously nothing else remember amazon used least pack books bubblewrap outrage directed amazon using much packing material reduced bare minimum fan plastic thats takes keep books safe dont mind least frustrating thing tho knowing dont need plastic bubblewrap wrap books safely flipkartcom good packing books use cardboard boxeshttpsimgurcomavpttag carefully wrap books reach without fuss mint condition anyone else issue amazon seriously thinking never ever buying books amazon keep ",
    "cleaned_title": "anyone else sick tired amazon sending books protective packaging damaging books transit outrage deeply offensive people paid books",
    "cleaned_selftext": "edit wrote amazon included post link mail hope would enough trigger policy change books sakes order many books online order searching best deal recently noticed amazon consistently damaging books packing nothing paper bag seriously nothing else remember amazon used least pack books bubblewrap outrage directed amazon using much packing material reduced bare minimum fan plastic thats takes keep books safe dont mind least frustrating thing tho knowing dont need plastic bubblewrap wrap books safely flipkartcom good packing books use cardboard boxeshttpsimgurcomavpttag carefully wrap books reach without fuss mint condition anyone else issue amazon seriously thinking never ever buying books amazon keep",
    "cleaned_comments": "send thing order paper bag received smart watch bluetooth neckband speaker type packaging items damaged except outer box neckband bit damaged dont like order things flipkart introduced handling charge n charge varies per cod order weird far seen charging irresponsible orders smart watch obviously brand packaging cover packed pretty well brand dont see could damaged transit books without protection often get damaged transit dont care send phones brand packaging cover amazon logo paper bag phones kept place slim chance damage thing true books edit yet hear handling charge flipkart fan flipkart anything possible charging handling fees order orders certain minimum amount think amazon know irrelevant goddamn yall use word offensive much dont particularly like word offensive well certain contexts speech offensive valid argument saying would say amazon supposed care customers feel like thats good buttomlines customers satisfaction feel like context word offensive somewhat relevant yes perhaps right word offensive perhaps mentioned offensive social media context means amazon attacking demographic pertain action assholes packaging completely agree offensive word use theyre everyone theyre reason pad bottom line assholes absolutely offensive social media context thought way agree social media context saying abt attacking demographic might true although dont feel like actual meaning something demographics yes point well done would say word spoiled probably wont use heck sure use typing true use silly bubble wrapped plastic bags sometimes paper bags goods casing casing books get damage use something better earlier used hard cardboard pack discontinued citing logistical environment concerns believable book get damage worked amazon india seen books wraps whatsoever stuffed small cardboard like box toilet paper wraps whatsoever open parcels containing phones coke cans wraps one comes manufacturer threw multiple smart tvs chute first floor handled smart tvs gpus monitors like shit threw place broke glass bottles containing various liquids etc feasible make sure products handled properly even damage seller pay amazon wont pay dime damages seller stuffed small cardboard like box beats hell paper bro like seriously sent paper bag also pretty sure mentioning true feel like might bias since bad things frequently edit dick move make buyers pay books damaged transit wonder even sellers dont pack well tho want laugh cant getting books hard enough bought books studying gave wrong ones say nope charge delivery charge order value either fullfield reach minimum order value flipkart however charge extra secure packaging fee orders requires whereas amazon seems flipkart removed handling charges understand hope item ordered packaged care wrapped paper bag least items damaged like electronics books edit handling charges still flipkart choose cash delivery payment option see returned books bought complained time time customer case even rating low possible bull shit practice agree frustrating ive switched buying local bookstores im able go call dunzo buying books time makes worth delivery cost anyway get support real bookstores instead amazon returned books bought complained time time customer case even rating low possible shit hope take steps solve else maybe buy flipkart dunzo han available india didnt know dont live metropolitan local bookshops best way get books even book need theyll help get hell often order bookshop jorbagh delhi pretty good packing dont know youre looking help wanted read good historical fiction set least thousand years ago asked suggestion thats found rome series absolutely brilliant series usually dont buy amazon unless expensive offline charge double amazon charges stopped buying amazon two days back got book torn spine top asked replacement guy picked yesterday theyre saying ill get replacement another week imagine paying prime punished seller fault along added guarantee replacement would mark depends book guess im bangalore lots good nd hand bookstores usually much issue price since dont care new decent condition talking always got books bubble rap orderd jewellery set got box sticker top saying product packaging cant use box damaged use flipkart books nice sturdy cardboard box havent received damaged product yet nope books get delivered directly kindleinstantly call customer support request take item back justification escalate required knowing good amazons customer support feel might get replacement one good thing amazon replace without drama theres slightest damage books said im going crosswordbook shops nowadays get book quickly inspect quality seller trying save money purchasing amazon shipping boxes pretty sure use amazon labeled boxes shipping expensive since another source revenue amazon destroyed multiple smart tvs big inches monitors hz refresh rate k resolutionetc amazon supervisors dont care parcels targets need achieve sellers like keep profit maximum minimum packaging yes sometimes bookstore retailers ship qualities purchased book offline market quality awful frustrating always order books amazon good discounts pack boxes books delivered damaged folded return noway stand books written email even left feedback saying thing change even sent duplicate copies times easier tell place return everytime remember ordered books got delivered shipments delivered book somewhere else idk hell happened alot calling courier company complaining amazon refunded amount period one month like shows delivered u anything offer refund blah blah telling consumer complaints refunded amount amaozon needs ui well service packaging ffs rarely collection though started book shipping companies dont care much books use padega india book purchase next time even send items transparent packaging like whole society know item ordered one worst move profitable make save big bucks name environment use bookswagon flipkart actual bookshops bw also significantly cheaper amazon issue take days deliver also fake books thats sad consider buying books independent bookshops city many delhi pune etc ship panindia issues dont happen cases although prices might higher side fiction non fiction tho academic books available amazon mostly amazon sells cheap quality copies tell need list independent bookstores bought boxset lotr amazon torn every possible way stopped buying books amazon altogether morning happened see people sorting amazonin packages delivery address sorting facility huge pile packages center room throwing corners per addresses utter disregard items boxes understood packages look like trash arrived support local bookstores better keep websites rather owe time patience traffic buy nearest city weekends pals reported got dark agony missing pages torn damaged products returned textbooks summer cost thought theyd least wrap bubble wrap expensive plain brown paper bags im satisfied amazons service ive never seen online shopping giant effective trust worthy service exploited many people suddenly get super angry certain niche problems im happy still stay afloat even though people exploit professional behavior kya farak padta hai waise bhi wo original book thodi bhejte hai think got sun screen air conditoner size box smh tell bookswagon though actually came know searching alternatives amazon experience far would like seller atleast care hisher buttomline tho receive books bad enough condition wont keeping end book transit twice logistical environment concerns consumer centric sorry doesnt make sense buy offline market awful guy picked yesterday theyre saying ill get replacement another week interesting got keep book replacement arrived didnt try read tho even accidental damage might spell loss seller imagining anyone would buy damaged books scared replacement upto mark ughh get better amazon bright side jewellery previously would hope got replaced tho love flipkart reason keep buying even higher prices seeing book pristine condition worth kindle well prefer physical books especially academic books yeah kindle amazing yeah booked replacement think would agree man loves books would like see books damaged first place plus guarantee replacement would better lol ikr thought got torn book nice thank even send items transparent packaging like whole society know item ordered long buying academic books problem order lol em ughh pleaseeee need list independent bookstores infact made post days ago asking buy tho stop acting like get replacement missing pages say ordering local city store thought theyd least wrap bubble wrap expensive plain brown paper bags shit depressing know exactly feel customer care said thing supposed get replacement time pickup scheduled apparently didnt go planned atleast app says return reached seller im still stuck limbo app still says preparing dispatch replacement specific delivery date window lets see happens box damaged transparent guess mean dont use packaging days past worse used hang invoice loose outside packaging left neighbour theyd know ordered urgent time wait online order ive shopping amazonin since often theyd pack books badly dont remember many engineering college textbooks return back would come folded corners even packed cardboard avoid amazon comes purchasing books always received damaged books amazon personally found every books order amazon end duplicate better alternative flipkart find books duplicate every books order flipkarts packaging better amazon check legitimacy book tho pros cheaper import books available india good packaging cons takes weeks deliver searching catalog title difficult searching author works better pls dont say ordered books way old ac stop complaining world doesnt revolve around considering centre universe well think world revolve around handling charge seeing anything thank got paper bags coming way wont care textbooks ie gon na read wont care much textbooks get ready exchange get pay didnt pay torn book edit confirmed amazon agent said didnt indeed pay torn book ina way good buy books online books bought physical shops lend libraries youre welcome nooo novels repeat never ever buy electronic items flipkart send defective product send th fail technician check wont even give replacement refund choose cash delivery payment option see payment handling charge see screenshot order qualifies free delivery yet handling charges placed cod option returned another book amazon damaged ordered twice book posting picture returned time everytime got damaged copy got kindle get away physical books try well e reader really good battery life well physical books bought packaged terribly ok cod havent used cod many years rs like mentioned original comment might want discourage cod losing business sure fixed even mentioned charged order dont know whats reason far seen flipkart charging lol go bookstore buy books dont lazy books arrived perfect condition never happened till date books mostly checked bought legitimate sources afaik book stores didnt books wanted oh local bookshops also checkout bookswagon delivery wait time way high days never received damaged book till bookswagon determine whether book pirated copy mostly look feel book ink used text must jet black uniform instead light patchy text must printed well uniform pages must appreciable quality hard one ascertain pages beige colour shouldnt brown pages white must uniform white texture pages must also uniform lastly binding cover overall look hand feel book must good short avoid amazon take chances flipkart know thought replied something similar happened kept book tried wrap tape protect didnt patience return pretty sure counting support local bookstores tried buy book local store heeding advice didnt books wanted sold book without talking word behaved deaf dumb totally indifferent incompetent depends bookswagon cheap international editions printed india expensive amazon yes fed getting damaged books since amazonin gave paper packaging moreover purchased ack ultimate collection sent original box without extra outer box protect product case amazon earlier lately seems pattern pathetic name saving nature reducing sort box packaging absurd items damaged would someone accept damaged articles seriously ought change packaging earlier giving option packaging feedback option also gone seems two later nothing changed still receive damaged books regular placed paper bag dust cover latest book ordered looks like war supposed gift book im sure author book would also want book returned backend inefficiency sigh",
    "light_cleaned_title": "Anyone else sick and tired of amazon sending books with no protective packaging? Damaging books in transit is an outrage and is deeply offensive to people who paid for those books.",
    "light_cleaned_selftext": "Edit: I have wrote to amazon and included this post link in the mail, I hope this would be enough to trigger some policy change for BOOKS SAKES I order many books online and I order after searching for the best deal, I have recently noticed that Amazon has been consistently damaging my books by packing it in nothing but a paper bag (seriously, nothing else). I remember when amazon used to at least pack the books in bubblewrap, but after there was an outrage directed at amazon for using too much packing material, they have reduced it to a bare minimum. Now, I am not a fan of plastic, but if that's what it takes to keep my books safe, then I don't mind it the least. The frustrating thing tho, is knowing that you don't need plastic bubblewrap to wrap books safely. Flipkart.com does a very good of packing their books. They use [these cardboard boxes](https://imgur.com/a/VpTtAg8) to carefully wrap my books and they reach me without a fuss and in mint condition. Has anyone else been having this issue on Amazon? Seriously, I am thinking about never ever buying books from amazon if they keep up with this.",
    "light_cleaned_comments": "They send most of thing which you order in these paper bag, I have received my smart watch, Bluetooth neckband, speaker in these type of packaging items but they were not damaged except the outer box of neckband was a bit damaged, i don't like to order things from Flipkart because they have introduced handling charge of n (charge varies) per CoD order which is weird because so far I have seen that only they are charging it and are most irresponsible with the orders. smart watch obviously has brand packaging and cover. They are packed pretty well by brand itself, so I don't see how they could be damaged in transit. But books, without any protection can and very often do get damaged in transit. I don't care if they send my phones with brand packaging and cover that with amazon logo paper bag, phones are kept in place and there is a slim chance of damage. But the same thing is not true for books. edit: I am yet to hear about the handling charge on flipkart. I am not a fan of flipkart or anything, but is it possible that they are charging handling fees for only a few order or orders below a certain minimum amount? Because I think amazon does that too. I know this is irrelevant but goddamn y’all use the word offensive too much. I don't particularly like the word offensive as well. But in certain contexts. \"Your speech is offensive\" is not a valid argument against what I am saying. But I would say, as amazon is supposed to care about what their customers feel like and that's good for their own buttomlines and for their customers' satisfaction, I feel like in this context, the word offensive is somewhat relevant. And yes, perhaps you are right about the word offensive, perhaps I should not have mentioned it here. Offensive, in the social media context, means that amazon is attacking a demographic that you pertain to with an action of theirs. They are being assholes with their packaging. I completely agree. Offensive is just not the word to use here. Because they’re doing it to everyone, and they’re not doing it for any reason against you, it’s just to pad their bottom line. Assholes? Absolutely. Offensive? No Only in the social media context is it thought of as that way and I will agree that in social media context what you are saying abt attacking demographic might be true (although I don't feel like it's actual meaning has to do something with demographics). But, yes, a point well done. I would say the word is spoiled. I probably won't use it again. Heck, I was not sure if to use it while typing it :') True, the use silly bubble wrapped plastic bags or sometimes just paper bags, for other goods it's a casing but there is no casing for books so they get damage. The can use something better, earlier it used to be a hard cardboard pack but they discontinued citing logistical and environment concerns, it is believable, but book do get damage. I have worked in Amazon but not in India, I have seen books with no wraps whatsoever just stuffed in a small cardboard like box, toilet paper with no wraps whatsoever, open parcels containing phones, coke cans with no wraps just the one which comes from the manufacturer, threw multiple smart TVs down a chute from first floor, handled smart TVs or GPUs or monitors like shit, threw them all over the place, broke glass bottles containing various liquids, etc. It's not feasible for them to make sure that all the products are handled properly, even if there is some damage the seller has to pay for it, Amazon won't pay a dime in damages to the seller. > stuffed in a small cardboard like box beats the hell out of paper bro, like seriously, they sent it in a paper bag. Also, I am pretty sure what you are mentioning is all true. But, I feel like there might be a bias here since you have bad things more frequently. edit: it's a dick move to make the buyers pay for the books you damaged in transit, but I wonder why even the sellers don't pack it well tho. I want to laugh but i can't. Just getting books is hard enough. Just bought books for studying and they gave me wrong ones. What can I say Nope, what they both do is charge delivery charge for the order value which is either not fullfield by them or does not reach a minimum order value. Flipkart do however charge you an extra Secure packaging fee of 59/- for orders which requires them whereas Amazon does not. It seems that Flipkart has removed the handling charges. I do understand and hope that any item which is ordered should be packaged with care and not just wrapped in a paper bag at least for items which can be damaged like electronics, books. Edit 1: the handling charges are still there in Flipkart. Choose Cash on Delivery in Payment option and you can see it. I am , i have returned more books then what i have bought . Complained time and time again to customer case, even rating them as low as possible . Bull shit practice I agree with you. Frustrating. I've switched to just buying from local bookstores. If I'm not able to go there, I just call them and dunzo it from there. Buying 4-5 books at a time makes it worth the delivery cost anyway. + get to support real bookstores instead of amazon. > I am , i have returned more books then what i have bought . Complained time and time again to customer case, even rating them as low as possible shit, I hope they take steps to solve this. Or else, maybe I will just buy on flipkart dunzo han? it's available in India. I didn't know. I don't live in a metropolitan Local bookshops are the best way to get books. Even if they do not have the book you need with them, they'll help you to get it. Hell I often order from the bookshop in jorbagh Delhi and they are pretty good with the packing. And if you don't know what you're looking for, they too help with that. I wanted to read a good historical fiction, set at least a thousand years ago. I asked them for a suggestion and that's how I found out about the Rome series. Absolutely brilliant series. I usually don't buy from Amazon unless it's too expensive offline. :) But they charge double of what Amazon charges. Stopped buying from Amazon. Two days back got my book with a torn spine at the top, asked for replacement, guy picked it from me yesterday and now they're saying I'll get the replacement in another week! Imagine paying for prime and being punished for it while it was the seller at fault all along, and added to this there is no guarantee that the replacement would be up to the mark. depends on the book i guess. i'm in bangalore, and lots of good 2nd hand bookstores here. so usually not much of an issue on price, since i don't care if its new.. just if its in a decent condition. What are you talking about? I always got my books in a bubble rap Once I orderd a jewellery set and I got it in its own box and a sticker on top saying product has its own packaging, now I can't use that box because it's all damaged I use flipkart for books, they have a nice sturdy cardboard box and i haven't received a damaged product yet Nope, books get delivered directly to my kindle….instantly. 🤓 Call the customer support and request them to take the item back with your justification. Escalate it further if required. Knowing how good Amazon's customer support is, I feel you might get a replacement. One good thing about Amazon is they replace without any drama if there’s slightest of damage with books. That being said I’m just going to Crossword/Book shops nowadays so I can get book quickly and I can inspect quality there. The seller is trying to save money by not purchasing the Amazon shipping boxes. I am pretty sure that they have to use Amazon labeled boxes for shipping and they are expensive since it's another source of revenue for Amazon. I have destroyed multiple smart TVs as big as 50 inches, monitors with 240Hz refresh rate or 4K resolution,etc. Amazon supervisors don't care about the parcels they have targets which they need to achieve and sellers like to keep their profit to maximum by minimum packaging. Yes. But sometimes, bookstore retailers ship such qualities. Once I purchased a book from the offline market and it's quality was awful. Its frustrating. I always order books from Amazon because of good discounts but they pack them in such boxes and because of that the books delivered are damaged or folded and I return them because noway I can stand those books. I have written an email and even left a feedback saying the same thing but no change. They even sent me duplicate copies a few times and it is easier to tell that. I place a return everytime they do this. I remember once i ordered 10 books out of which 9 got delivered in 3 shipments and they delivered the other book somewhere else only. Idk how the hell that happened. After alot of calling the courier company and complaining at amazon they refunded the amount after a period of one month. They were like it shows delivered to u we cannot do anything and cannot offer refund blah blah. After telling them of consumer complaints they refunded my amount. Amaozon needs to up their UI as well as their service and packaging ffs. They rarely have the collection though. They started off as book shipping companies, and don't care much about books :/ Use padega india for your book purchase next time... They even send items with transparent packaging, like the whole society will know what item you have ordered. One of worst move , profitable for them to make save big bucks in the name of environment I use Bookswagon or Flipkart (or actual bookshops). BW is also significantly cheaper than Amazon. Only issue is that they take 10-15 days to deliver. Also fake books That's sad. Consider buying books from independent bookshops if they are in your city, if not many from delhi, Pune etc ship pan-india. These issues don't happen in those cases, although the prices might be higher side. These are for fiction and non fiction tho. Academic books are available on Amazon only mostly. But Amazon sells cheap quality copies too. Tell me if you need a list of independent bookstores I bought boxset of LoTR from Amazon which was torn in every possible way ...... Stopped buying books from Amazon altogether.... This morning I happened to see people sorting Amazon.in packages by delivery address at a sorting facility. They had a huge pile of packages at the center of the room and just throwing them to all corners as per the addresses. Just utter disregard to the items in the boxes. I then understood why my packages look like trash when they arrived. Support your local bookstores I better keep off these websites rather i owe time and my patience in traffic to buy from nearest city on weekends. Few of my pals reported and got into dark agony missing pages - torn - damaged products. Returned 6 textbooks this summer because of this. They cost between ₹1000 - 8000; I thought they'd at least wrap them in bubble wrap as they were expensive, but no, just plain brown paper bags. I’m satisfied with Amazon’s service. I’ve never seen a online shopping giant be so effective and trust worthy. Their service is being exploited by many and people suddenly get super angry about certain niche problems. I’m just happy they still stay afloat even though people exploit their professional behavior kya farak padta hai waise bhi wo original book thodi bhejte hai To think I got a sun screen in a Air Conditoner size box. SMH Tell me about Bookswagon though. I actually came to know about it while I was searching for alternatives to Amazon. How has your experience been so far? I would like the seller to atleast care about his/her own buttomline tho. If I receive the books in a bad enough condition, I won't be keeping it and he will end up with the book which has been in transit twice. > logistical and environment concerns not very consumer centric of them Sorry, this doesn't make sense. Why did you buy it from the offline market if it was awful? > guy picked it from me yesterday and now they're saying I'll get the replacement in another week! Interesting, I got to keep the book until the replacement arrived. I didn't try to read it tho. Even accidental damage might spell a loss for the seller (imagining anyone would buy damaged books). I am scared of replacement not being upto mark too. Ughh.... get better amazon! On the bright side, you have more of that jewellery than you previously would have had :') I hope you got it replaced tho! Love Flipkart for this reason! Will keep buying from them even if they have higher prices. Seeing a book in it's pristine condition is worth it. Kindle, well, I prefer physical books, especially for academic books But yeah, Kindle is amazing. Yeah, they booked a replacement, but I think you would agree that no man who loves books would like to see books damaged in the first place. Plus, there is no guarantee that the replacement would be any better. lol Ikr! I thought the same when I got my torn book :') nice Thank you!! > They even send items with transparent packaging, like the whole society will know what item you have ordered. As long as you are buying academic books, this is not a problem. What did you order lol Some of em. Ughh.... Pleaseeee... I need a list of independent bookstores. Infact I made a post few days ago asking that. where do you buy from now tho? Once they stop acting like they own me :'( how do you get a replacement if you have missing pages if you are say ordering from the local city store? > I thought they'd at least wrap them in bubble wrap as they were expensive, but no, just plain brown paper bags. This shit is depressing, I know exactly how you feel Customer Care said the same thing, that I was supposed to get a replacement the same time when my pickup was scheduled but apparently that didn't go as planned. Atleast my app now says that my return has reached the seller but I'm still stuck in limbo as the app still says \"Preparing for Dispatch\" for my replacement, with no specific delivery date or window, let's see what happens. No only box was damaged Transparent? I guess, what you mean is, they don't use any packaging at all these days. In the past, worse, they used to hang the invoice loose outside the packaging, and if left with the neighbour, they'd know what you ordered. Because it was urgent. There was no time to wait for an online order. I've been shopping from Amazon.in since 2013 and most often they'd pack the books badly. I don't remember how many engineering college textbooks I had to return back in 2014-18 just because they would come folded from corners even if packed with a cardboard. Avoid Amazon when it comes to purchasing books. I have always received damaged books from Amazon. Personally I have found that out of every 10 books that I order from Amazon, 8 end up being duplicate. A better alternative is Flipkart where I find 1 to 2 books being duplicate for every 10 books that I order. Flipkart’s packaging too is better than Amazon. how to check the legitimacy of a book tho? Pros: cheaper, will import books not available in India, good packaging Cons: takes 1-2 weeks to deliver, searching catalog by title is difficult (searching by author works better). Pls dont say this i have ordered a few books all on the way Here. From my old ac Then stop complaining The world doesn't revolve around you considering there is no centre of the universe, I can very well think that the world does revolve around me. What handling charge ? I am not seeing anything thank you!!! you have got a few paper bags coming your way. I won't care if they are not textbooks. i.e., If you are gonna only read it once, I won't care much about it. But, if they are textbooks, get ready to exchange them you get what you pay for. I didn't pay for a torn book. edit: Just confirmed, the amazon agent said I didn't indeed pay for a torn book Ina way that is good. We should not buy books online. Books should be bought in physical shops and lend from libraries. You're welcome Nooo they are novels I repeat never ever buy any ELECTRONIC items from FLIPKART. They will send you a defective product and then send some 6th fail technician to check it and then won't even give you replacement and refund It is there. Choose Cash on Delivery in Payment option and you will see a Payment Handling Charge. See below screenshot, this order qualifies for Free Delivery yet a handling charges of 10 is being placed for CoD option. Just returned another book from Amazon because it was damaged . I ordered twice of the same book . Posting picture of the same . and returned all the time because everytime, I got a damaged copy . Got a kindle to get away from physical books. You should try it as well. The e reader has a really good battery life as well. All physical books bought from there is packaged terribly. Ok it's on cod. Haven't used cod in many years. And it's 10rs, not 50 like you mentioned in original comment They might want to discourage cod while losing some business then No Sure it's 10 but it is not fixed it can be 5,10 or even more. I just mentioned because I was charged 50 on my order. Don't know what's the reason but so far I have only seen Flipkart charging it. :( Lol go to a bookstore and buy the books. Don't be so lazy My books arrived in perfect condition Never had happened till date. Books are mostly checked and bought from legitimate sources afaik. book stores didn't have the books I wanted. oh Local Bookshops. Also checkout Bookswagon, their delivery wait time is way too high. 15 to 18 days. But never received a damaged book till now from Bookswagon. I determine whether the book is a pirated copy or not mostly from the look and feel of the book. The ink used for the text must be jet black and uniform instead of light and patchy. The text must be printed well and uniform. The pages must be of appreciable quality. This is a hard one to ascertain. The pages if beige in colour shouldn’t be brown. If the pages are white then they must be a uniform white. The texture of the pages must also be uniform. Lastly the binding, cover, overall look and in hand feel of the book must be good. In short avoid Amazon and take your chances with Flipkart. I know it has been a while, but I thought I replied. Something similar happened to me, but I kept the book and tried to wrap it with tape to protect it, because I didn't have the patience to return it. I am pretty sure they were counting on it. > Support your local bookstores I tried to buy a book at the local store heeding to your advice, he didn't have any other books that I wanted, only 1 and he sold me the book without talking a word, he behaved as if he was deaf and dumb, totally indifferent and incompetent. That depends. Bookswagon is cheap for international editions but for those printed in India it's expensive than amazon. Yes I am fed up of getting damaged books since Amazon.in gave them in paper packaging, moreover when I purchased the ack ultimate collection they had sent it to me as it is in the original box without any extra outer box to protect the product, this was not the case with Amazon earlier but of lately this seems to be pattern and is pathetic. In the name of saving nature they are just reducing any sort of box packaging which is absurd as my items were all damaged why would someone accept damaged articles, seriously they ought to change their packaging. Earlier they were giving an option about packaging feedback now that option is also gone it seems. Two later and nothing has changed. I still receive damaged books on the regular because they are only placed in a paper bag. The dust cover on the latest book I ordered looks like it's been through a war. How am I supposed to gift this book now? I'm sure the author of this book would also not want their book returned because of backend inefficiency. Sigh."
}