{
    "id": "14grzt4",
    "title": "Even with a Teleprompter, PM cannot speak properly. Calls Investigating in a girl child instead of Investing. ",
    "url": "https://v.redd.it/1ogaiy540q7b1",
    "selftext": "Video credits\nhttps://twitter.com/Witty_Ayush/status/1672137963680194561?t=2cK-YwwwLHgMXTxoThyaWg&s=19\n",
    "flair": "Politics",
    "score": 827,
    "num_comments": 512,
    "created_utc": 1687505457.0,
    "convurl": "https://external-preview.redd.it/M2J2dnI1eDMwcTdiMTQ52Vq7HUS97E58eVSQIfNjiWaTpB4jVkv-0to3FA6x.png?format=pjpg&auto=webp&v=enabled&s=2f95d11d9193dfe3870aaa44f343f80d3b9b06a4",
    "comments": [
        "Mat bol bhai, kahi toh thodi izzat chod do.\n\nHe's like one of those uncles who does a weird dance at the party thinking they are cool and whose family members stand embarrassed.",
        "See, Modi is nothing like Hitler. \n\nAt least that POS, genocidal maniac could actually speak coherently.",
        "Chatur Ramalingam",
        "Saheb made a Freudian slip.",
        "Same energy as \"what's worse than a rapist?  .... a child\"",
        "The day Biden comes to India and speaks in any other language than English, I would probably agree with you.",
        "Same energy as \"what's worse than a rapist?  .... a child\"",
        "Thoda thoda english aata ji",
        "Didn't he groom a girl sometime and she said no?",
        "And here it is,\n\nपिछले नो साल से इन्होने निरंतर इस देश में बलत्कार पे बलत्कार किये, उम्मीद है आगे बी करते रहेगे ]\n\nहमें तो आश्चर्य होता है कि एक इंसान अपने जीवन काल में इतनी बलत्कार कैसी कर सकता है| इन्होने कड़ी तपस्या से अपने आपको इस काबिल बुनाया है।",
        "OP are you a 5 yo? It’s not his first language. This is just nitpicking for the sake of it.",
        "I am kinda curious, is it mandatory to speak in English there?  Can they not talk in their mother tongue?",
        "TBH, he is not the strongest in Engliah and did a commendable job giving this speech. The audience was in rapt attention and these minor snafus don't diminish the importance of the moment.",
        "Lips up the en taar phamily",
        "Narendra ramlingum",
        "I don't like Modi but I don't think it is fair to make fun of him for his english when there are a million actual things to criticise him for.",
        "Mansi soni",
        "LMAO",
        "Little little English coming G",
        "Kahan hai teleprompter idhar?",
        "I would say \"such hi to hai\" .",
        "You got me in the 2/3 part of the comment",
        "Don’t keep so much hate inside you my friend, it will rot you from inside out. English is not his first language and still he is speaking in English.\nYou can criticise him as much as you want, because of his policies and political decisions.",
        "They can. But it's good pr in India if Modi ji speaks in English. They can show it on the TV that look how smart he is.",
        "Reminds me of when he said \"Beti Bachao, Beti Patao\"",
        "Shut the fuck up. What an embarrassment of a prime minister.",
        "Wow. I mean not supporting him or opposing his party is completely ok because it’s a democracy but come on. \n\nA slip with one word when talking in a foreign language? \nAnd that too standing on such a podium?\n\nWe need to stop confusing fluency in English with intelligence.",
        "He makes a mistake in his non native language. It's fine. People do make mistakes while speaking.",
        "Isn't English his second language ?",
        "That is fair, however he is constantly propped up by lies of him being a \"charismatic leader\", \"great speaker\" etc so it is important to point these out",
        "It's actually stupid and dumb to nitpick on this, English is not his first language, many non-english speaking leaders slip like this, just listen to Macron for once lol.",
        "Yeah right as if every non native leader speaks proper English, tf is wrong with you people?",
        "Talks about girl child, 0 comment made on wrestler protests where girl child was asking for justice. No comment made on hathras case. Always reads some random inspirational and motivational shit.",
        "People hate now for the sake of hating.",
        "Well, even investigating sounds correct doesn't it 😉😏",
        "Not after that blunder tho.",
        "I'd say the opposite. We were taught and were genuinely impressed when Atal Bihari Vajpayee addressed the UN in Hindi. That's more of a punch. Our leader went to the US and addressed their Congress in Hindi. This is more memorable and historical.",
        "The reason people don't care about the above point is due to the fact that IT Cell of BJP for years have been character assassinating RG calling him \"pappu\".\n\nSuddenly the tables have turned and they have the audacity to act surprised and call it slip of tongue......",
        "I mean we are already are a big enough country now. So we shouldn't give that much fucks.",
        "For everyone who says that we should not criticize him for the mistake in teleprompter...Can you please explain what investigating in a girl child means ??\nIsn't he a graduate ?? Doesn't he know basic English ??\nHe may have completed his graduation in political science with Hindi as a medium right ??",
        "English is not his first language, and humans make silly mistakes all the time. \n\nHOWEVER, his party and the media have been constantly mocking his political opponents for the same all these years.",
        "More like third language.",
        "Sorry, disagree with you strongly. We have certain educational requirements for every profession and why shouldn't we have that for our politicians? The entire nation melted over the fact that he was chai wala and not much educated. Lol. \n\nBtw, I find it shameful that we have to go to some Western country to tell how feel about investing in girl child...in this day!!",
        "Biden can't even speak his 1st language and you are criticising for his third language. Many graduates makes mistakes.",
        "Hindi is not an International language and so it okay for Biden not to speak in our regional language.  I think we should make English as our first language because most of us South Indians are better at English than Hindi.",
        "Phir Tweet kyu Angrezi m karte hai???",
        "I wouldn't criticize him for his accent, but \"words do matter \"",
        "Guys chill, even the BJP IT cell does not spare Rahul Gandhi's slips of tongue.",
        "I am fine even if he speaks in any other language. As I mentioned, when he comes to India, and speaks in *any language* other than English perfectly.",
        "Exactly, most leaders speak their own mother tongue. That's what the interpreters are for. \n\nDiplomats and politicians Take pride in their country's language (s) especially when abroad.",
        "Well if we can nitpick the oratory skills of other Indian politicians (e.g. raga) for decades then why not him?\n\nHe is after all the top representative of India, he's expected to deliver a flawless speech 🤭",
        "The US is majorly a english speaking country. India is multilingual and well, knowing english should be very important for an Indian responsible for ruling the country. So my braincells died reading your comment",
        "Give him a break! English is like his third or forth language. These Americans call rugby football for fuck's sake!",
        "bhai wo investing to investigating bol rha hai, poora matlab change ho rha hai sentence ka.",
        "I agree, but Biden didn't make fun of Modi. So,  your comment is irrelevant .\n\nHowever, all of our education is in English , esp Law (considering he is a politician). So, it all shows how uneducated Modi is to not to know the difference between \"Investigate\" and \"invest\" and no wonder he don't hold press meetings. Probably , he will not understand most of the questions and has no reasonable logic or reasoning capabilities to handle it with grace.",
        "Making fun of someone not speaking a foreign language well is stupid and elitist, OP.",
        "Bold of you to assume you had any.",
        "You haven't seen Biden speak lmao",
        "Vishwaguru just proved to the world that India is full of uneducated people.",
        "This is why we need an educated PM like MMS.",
        "Absolutely, this is why we have foreign affairs ministers who can speak English fluently. But, Gobijee wants all the limelight for himself. \n\nSo stop confusing intelligence with propoganda.",
        "Hindi me bhi to 'beti bachao beti patao' aata hai zubaan pe. Freudian slips hain re baba! Brij Bhushan case me bhi to ulta female wrestlers ko hi investigate kar daala.",
        "Why should speaking ~~good~~ basic English in particular be a requirement for politicians? What purpose does it serve for say a MLA from rural Bihar or Orissa, where barely 5% of his constituents would understand English?\n\nNot defending Modi here, but people like you who are so out of touch from the ground reality of our country should read more and give less unsolicited opinions about politics.",
        "I am sorry but why is english the scale to judge for being a \"charismatic leader\" or a \"great speaker\"?",
        "It's okay. Let's not be critical of everything. There are a lot of genuine issues to criticise him for and these petty things will only dilute them.",
        "When he gave his address with Pres. Biden, he spoke in Hindi and used an interpreter, including for questions and answers. I think as others said, world leaders tend to address the US Congress in English if they can, for optics, but they could use an interpreter.",
        "Good is different from basic.",
        "Which foreign minister is invited to speak in another country’s parliament? If US invites Indian leader to address Congress and we send the FM instead of either PM or President then it would be a grave diplomatic faux pass.",
        "Updated the comment. You still didn't answer the question.",
        ">However, all of our education is in English\n\nHere, right here is the fault with your argument. You are assuming the education system and social construct of obsession towards english is a good thing, which it is not. That is why everyone is saying that nkt knowing english is not a big deal just because our system tells us to do so",
        "He never was the \"big shit\" he was made out to be, dumb Indians are just slowly realizing it.",
        "Dude he can't even read properly. Is that too much to expect?",
        "I wasn't aware of your expectation, I thought we were talking about speaking in english?",
        "Did ya just say Freud? Oh yeah",
        "Real men don't investigate a minor girl🗿",
        "When I criticize him. It’s holistic not specifically for his English but the million things he’s done.",
        "How can you be a great speaker if you cannot express your ideas properly?",
        "What else to expect from a primary school dropper?",
        "Hey I am not saying he is one, I am just saying english should not be the scale to judge intelligence, charismatic leader or anything at all, it's not his first language, the dude can have a room temperature IQ but I am not gonna come to that conclusion just after hearing him/her/them/they speak in their second language yeah?",
        "I see people taking offence that english is not his first language and which is fair but also its his party who want everyone in india to speak Hindi and impose their language so fuck him",
        "why would he speak in any other language than English",
        "anyone can mispronounce a word , i wouldn't blame or criticise him for these petty issues , and its not fair either for someone whose mother tongue is not English.",
        "This is like when a correct word is replaced with another correct word, and even autocorrect fails to detect it.",
        "She is in the US I heard/read. BTW.",
        "It helps so that people in poor states can't understand what he is talking about. Otherwise people would ask about women wrestlers.",
        "Fault? As a citizen of India, my expectation of highest elected body would not budge unless he/she has skills that can override the ability to address in English.\n\nThis is not obsession about English because it seems like looking into past PM's of country i.e. Nehru, Indira, Vajpai, P.V.Narasimharao..kind of people, it is obvious that they are well read people. Being well read, I mean to say that someone who has read enough that they have clear understanding of history and law and hence have the finest reasoning skills to address questions and challenges posed at them. Such people will not resort to cheap tricks to cover up their shortcomings..\n\nTo this day, I have not seen any diplomat who do not speak in English(in India) with the kind of expectations I have.\n\nDidn't our past PMs speak in regional languages too? Modi, clearly is not a well read person , just a street thug. That is the reason why he will not have progressive thoughts.\n\nIf you think these are all not linked to education...then fine. Whom am i to argue against it?\n\nBtw, I would like to see a PM who doesn't speak in Hindi and English.\n\nThe hatred against English here is really laughable....esp, when we are all communicating in that.\n\nI think I have stated my views here very clearly. I am no more giving reasons here. Go ahead  and keep electing those who barely finished high school but are good at Yoga and dressing.",
        "But Atal was actually a better English speaker, he just choose to Speak in Hindi at UN. UN is different where most people speak in Mother tounge and then they always have a interpreter. UN is where people come from many type of languages. Can't compare UN with US.",
        "It's fiar, when he uses such things for his PR and all those Godi media presents him as a Charismatic leader.",
        "You really wrote an essay just to say that you don't have problem with him not speaking english but him not being a good pm.\n\nThe problem is the person you tried to argue with was never making the point you are trying to argue against. The commentor you replied to was addressing the person who made this post calling him out on \"bad english=dumb person\" mentality.",
        "Bhaiyo aur behno, kal se “investigating” “investing” hoga, aur “investing” “investigating” hoga. Supreme leader ki jai!",
        "Sorry, your comprehension skills are very low. I did not say he not knowing English is okay. In fact, I gave a reason that which everyone here are bashing me about. \n\nI would not have cared, but , all these people here having low standards on whom they elect is very sad. Because in most countries , diplomats of high caliber attend greatest universities and are required to know well.",
        "English is definitely no scale to judge a great speaker. And there is no doubt that Modi has greater oratory skills. The issue here is that he could've easily spoken Hindi and used an interpreter. But he chose to speak English for better PR and that is why it's important to criticize in this instance.",
        "I'm only commenting on the \"great speaker\" part. You should be able to have a good command over the language that you wish to express your ideas in if you want to be considered as a great speaker (amongst other qualities) . Not commenting on the person or his IQ here.",
        ">Sorry, your comprehension skills are very low\n\nThis statement is so ironic i am actually laughing right now. You articulated your comment so poorly that you needed to edit your own comment and change the entire narrative so that anybody who reads the \"edited\" comment seem like my reply is not making sense.\n\nSorry man i can't really argue further with a guy who uses pathetic things like editing the comment to make the replying person look dumb",
        "Yeah but for man claiming to be perfect and viswaguru, we need to criticize and show his place wherever possible",
        "And football soccer",
        "This is childish. There are real and important things to focus on and roast Modi. Not this",
        "Tharki unkill meant it the way he said it.",
        "Being able to speak properly in whichever language he chooses to speak in is kinda the bare minimum to judge for being a \"charismatic leader\" or a \"great speaker\". No one forced him to speak in English. \n\nAlso, it's not like he doesn't often put both his feet in his mouth when he speaks in hindi. For example,  'beti bachao beti patao' .",
        "This is the way",
        "https://preview.redd.it/yybbi795os7b1.jpeg?width=554&format=pjpg&auto=webp&v=enabled&s=11213cf0ecc679cdbf2f7bd5c2cd37091be8124f",
        "This just shows your dishonesty and I don't even understand the need for it.\n\nYou just saw that I edited and then went ahead with your accusation. Wow!!\n\nBtw, Nowhere I intended not knowing English = dumb. You want to argue over nothing I guess.",
        "Yes, he should have spoken in Gujarati.",
        "I mean also have you considered the possibility [he meant what he said and said what he meant.](https://www.indiatoday.in/india/north/story/modis-confidant-amit-shah-accused-of-illegal-snooping-of-woman-in-bangalore-217623-2013-11-14)",
        "It's his ideology. The BJP goons don't invest in girl child but they INVESTIGATE and INTIMIDATE girl who speaks the truth to the country. ( Brj Busn and many other cases)",
        "Well, maybe that was a Freudian skip. Iykyk.",
        "Tbh people should give him a break. It's not like he has been RBI governor or something. He is a chaiwala with bogus political science degree, so should not be judged for his english.",
        "Many comments here are calling out OP on using PM Modi's mistake in spoken English. I understand where they are coming from.\n\nFor any other common person, I would've stood with those comments in their OP's critique. But this is our country's PM. And English is a key language for global communication. I think wishing for some command of such an important language is not too much to expect from the most important person of this country who seems to be doing everything everywhere all at once (judging by everyone attributing all success to Modi).",
        "Well US forced him to take questions from press. Could have easily demanded that the adress should then be in our language. You get a positive we get a positive.",
        "Fuck🤣",
        "To be fair it's not his first language , so it's understandable.",
        "This is our representative on the global stage!",
        "Modiji should have stuck to Hindi in that case!",
        "Then dont make speeches in shit English in an English speaking country lmao.",
        "Lol, what questions? It was a pre-decided question because it's works great for his PR. The person who couldn't do an open press conference in India. Did took a singal question from US media?? \n\nJust look at other world leaders answering questions in US, this is a joke compare to them.",
        "He is reading off a teleprompter.",
        "Look, he's not wrong, you're all brain washed. We really should investigate them. I mean... am i the only one who wants to know why \"the girl child\" is the parent's favorate? Why does she always score better marks than me and why can't I have the bigger room! She even get's like that extra scoop of icecream bECauSe sHe's sMoLl. Modi's right, I don't buy it..",
        "Ironically Modi is only the 3rd world leader (after Winston Churchill and Nelson Mandela)to address the US Congress twice and co incidentally both were under the Democrats",
        "Biden makes mistakes even in his native language lol",
        "Hindi isn't his first language either",
        "What's your point? If you followed before the trip, the Indian diaspora didn't want to take that single question also. So the US did force him to take that question. I know that it was a single question but it wasn't for his PR. It was for Bidens in his country. \n\nI know this is a joke. The person I replied to said cant compare UN to US. I was saying for that matter. He could have surely asked for the adress to be in Hindi. He was forced to take questions.\n\nEdit: If you guys are getting angry that I said questions instead of question. Grow up. I use predictive text keyboard. Dont type it all out.",
        "I thought what he said about investigating was correct.\n\nhttps://www.indiatoday.in/india/north/story/modis-confidant-amit-shah-accused-of-illegal-snooping-of-woman-in-bangalore-217623-2013-11-14",
        "No it's not, its about ego to show he can speak English.",
        "Memorable to who? Upper half of India?",
        "This is what I like about liberals. We don't stoop down to their level. This kind of sympathy will never be extended to RG by the conservatives.",
        "Upper half? They have breached till Karnataka. So complete India. \n\nAlso, I was talking in hypotheticals. Please read again properly.",
        "I am talking about Hindi being a North Indian thing. The south doesn't care or can't even understand if Vajpayee speaks in Hindi.\n\nThe south won't fall for the \"Hindi, Hindu, Hindustan\" shtick.",
        "You completely missed the point. This isn't about Modi. It's about whether any politician in India SHOULD be able to speak basic English.",
        "Oh you guys missed \"I don't have any continent left\" - Basically reading continent instead of content.",
        "So the Prime Minister of your country goes and addresses UN or US in a native language and you won't be proud of him or consider it historic? \n\nLeave the Hindi part aside. You seem to be too hostile towards it.",
        "Why speak Hindi when Vajpayee can perfectly speak in English which will have much better impact on international stage?\n\nWHO IS HE REPRESENTING? \n\nOf course if PM is not comfortable in English I will NEVER hold it against them.",
        "It’s fine to mispronounce. But for the great orator to so blatantly use two teleprompters while addressing the US congress is a bit much. Practice your speech man.",
        "Who is he representing? India. \n\nThe language he spoke? Indian language. \n\nFuck off with your propoganda that speaking Hindi is a disrespect to other languages of India. Get lost. \n\nWant RRR to be called Tollywood exclusively because it is but the Prime minister speaking Hindi? No no that's bad. Speak English.",
        "Why can't some people get it into their head that Hindi != India?\n\n> propoganda that speaking Hindi is a disrespect to other languages of India\n\nI NEVER said that. But I will repeat my question, **who is he representing?**\n\n\nHindi, Hindu, Hindustan ☕",
        "The country should not investigate in him anymore.",
        "He should have spoken in Hindi. If Trump can Converse with Kim Jong Un then so can he. After all Indians are one of the prominent minorties over there. Also it would have been less embarassing.",
        "I never said Hindi= India. You seem to be taking it that way. Show me where I said that. \n\nAnd what is the point of repeating the question? I said India. If you equate it to that, you are in the wrong not me.",
        "This is one of the many reasons why Modi wins. The common man of this country is tired of the entitled nepotistic elite looking down on them. Modi has grown based on his own skills and hardwork from a poor humble background, and it seems a lot of people aren't able to digest it and want a sauve looking walking thesaurus who is one of them.",
        "Yehi mistake ko dekh ke andh bhkts ladkiyo ko actually investigate karenge because “muddy said so” \n\nAll the people defending him saying he is speaking in a foreign language, yes he is being he is also in a foreign country and as the representative of our country with all resources at the palm of his hand I think speaking correctly is the least the old man can do when there are millions watching him\n\nKinda disappointing",
        "Investigating in the girl child? Kya bak rha hai ye bawasir. We saw so many cases of your Beti bachao aur padhao failing to provide education as well as protection now it's taking a bad turn. Brij Bhushan should've been in your place. I wanted to see how a rapist reacts to the live public for their crimes and also in English.",
        "Tab gaya kyu bolne ke liye? Failed miserably to present a factual idea about his work for the country.  At least in his own language he could've mesmerized the crowd by producing \"good but useless\" speech to people and that could be translated.",
        "Dude stop insulting Chai wala,  they are far more intelligent than this cretin. \n\nPlus he probably lied about being a Chai wala as no Chai wala can afford to visit the US during 80s.",
        "Given the number of times moditards make pappu jokes, including often by removing context, it's fair to say, Modi deserves to be mocked for this.\n\nOfcourse it's not as important as the many of his absolute wrong doings.",
        "He said exactly what he meant. What's here to see?",
        "OP how about you post a video of yourself giving a speech in your 3rd language?\n\nWhat a stupidly immature post.",
        "I mean, Hindi isn't even a real language, it arose out of a hodgepodge of N Indian languages, and wasn't anyone's native language until the 1700s.",
        "I’m really conflicted on one hand no should be made fun of for their English on the other hand any competent leader should know the global language",
        "I think Zelenskie stuck with his mothertongue",
        "What a perv!!",
        "south **indian** here.\n\nhe spoke in hindi, which is one of the 22 official languages of the country. \n\nwhile i am also against the imposition of hindi on us, i applaud the fact that someone from **my** **country** spoke one of **our** official languages in the UN. it is memorable and historical.",
        "Oh please. These days, even the people who got actually English education struggle to speak and articulate stuff and you have a problem with a completely uneducated guy making a mistake?\n\nWhile I agree that, it's a very important place and a PM of a country should not make mistakes like these; I am fine with him being a visionary and not so fluent (but can still manage to communicate in English person) and someone who can speak good English and is dumb as fuck (you know who I am talking about).",
        "Just came down to comment this lol",
        "Somebody has investigations on his mind. Only the wrong kind, sadly.",
        "And who made you the representative of all Southern Indian states. \nTalk about yourself.",
        "He's not wrong. That's what happens in UP, Bihar, Haryana, and Rajasthan",
        "> Hindi, Hindu, Hindustan\n\nI think you are failing to understand the subtle propaganda in play here. The problem is they ***always*** choose Hindi out of the 22 official languages.",
        "Always messes up when coming to girl child. Remember \"Beti Patao\"?",
        "And that's ok. After all, Hindi is the 4th most spoken language in the world. But this does not mean that we should take to it, because this will mean cancelling our individual culture.\n\nWe should spend more time supporting our languages- this means investing time to protest against the department of education that unfairly awards the teachers of Hindi, donating money to support artists of our local language and so on and so forth.\n\nSupport the country as a whole, but work to keep our individual culture alive.",
        "This is just honest mistake he knows English very well here he has to keep the tone.. watch early 2000 videos of him speaking English you will be shocked",
        "It’s not his native language so it’s not really an issue.\n\nBut, when one of his competitors (if at all we can consider him so) fumbles or misspeaks something like this, we make fun of that guy.\n\nQuite a hypocrisy! Doglapan",
        "It is for gujjus and bhakts mainly who would go mad seeing their saheb speaking english in the US. People living in Pushkar Rajasthan speak brtter english than most gujjus living in the US.",
        "The hidden deep meaning being .. that anyone who wants to determine the sex of an unborn child, to see if it’s a girl, ((investigating a girl child) will be arrested  by the Police along with the whole family (lifts the entire  family)"
    ],
    "cleaned_text": "even teleprompter pm speak properly calls investigating girl child instead investing video credits ",
    "cleaned_title": "even teleprompter pm speak properly calls investigating girl child instead investing",
    "cleaned_selftext": "video credits",
    "cleaned_comments": "mat bol bhai kahi toh thodi izzat chod hes like one uncles weird dance party thinking cool whose family members stand embarrassed see modi nothing like hitler least pos genocidal maniac could actually speak coherently chatur ramalingam saheb made freudian slip energy whats worse rapist child day biden comes india speaks language english would probably agree energy whats worse rapist child thoda thoda english aata ji didnt groom girl sometime said op yo first language nitpicking sake kinda curious mandatory speak english talk mother tongue tbh strongest engliah commendable job giving speech audience rapt attention minor snafus dont diminish importance moment lips en taar phamily narendra ramlingum dont like modi dont think fair make fun english million actual things criticise mansi soni lmao little little english coming g kahan hai teleprompter idhar would say hi hai got part comment dont keep much hate inside friend rot inside english first language still speaking english criticise much want policies political decisions good pr india modi ji speaks english show tv look smart reminds said beti bachao beti patao shut fuck embarrassment prime minister wow mean supporting opposing party completely ok democracy come slip one word talking foreign language standing podium need stop confusing fluency english intelligence makes mistake non native language fine people make mistakes speaking isnt english second language fair however constantly propped lies charismatic leader great speaker etc important point actually stupid dumb nitpick english first language many nonenglish speaking leaders slip like listen macron lol yeah right every non native leader speaks proper english tf wrong people talks girl child comment made wrestler protests girl child asking justice comment made hathras case always reads random inspirational motivational shit people hate sake hating well even investigating sounds correct doesnt blunder tho id say opposite taught genuinely impressed atal bihari vajpayee addressed un hindi thats punch leader went us addressed congress hindi memorable historical reason people dont care point due fact cell bjp years character assassinating rg calling pappu suddenly tables turned audacity act surprised call slip tongue mean already big enough country shouldnt give much fucks everyone says criticize mistake telepromptercan please explain investigating girl child means isnt graduate doesnt know basic english may completed graduation political science hindi medium right english first language humans make silly mistakes time however party media constantly mocking political opponents years like third language sorry disagree strongly certain educational requirements every profession shouldnt politicians entire nation melted fact chai wala much educated lol btw find shameful go western country tell feel investing girl childin day biden cant even speak st language criticising third language many graduates makes mistakes hindi international language okay biden speak regional language think make english first language us south indians better english hindi phir tweet kyu angrezi karte hai wouldnt criticize accent words matter guys chill even bjp cell spare rahul gandhis slips tongue fine even speaks language mentioned comes india speaks language english perfectly exactly leaders speak mother tongue thats interpreters diplomats politicians take pride countrys language especially abroad well nitpick oratory skills indian politicians eg raga decades top representative india hes expected deliver flawless speech us majorly english speaking country india multilingual well knowing english important indian responsible ruling country braincells died reading comment give break english like third forth language americans call rugby football fucks sake bhai wo investing investigating bol rha hai poora matlab change ho rha hai sentence ka agree biden didnt make fun modi comment irrelevant however education english esp law considering politician shows uneducated modi know difference investigate invest wonder dont hold press meetings probably understand questions reasonable logic reasoning capabilities handle grace making fun someone speaking foreign language well stupid elitist op bold assume havent seen biden speak lmao vishwaguru proved world india full uneducated people need educated pm like mms absolutely foreign affairs ministers speak english fluently gobijee wants limelight stop confusing intelligence propoganda hindi bhi beti bachao beti patao aata hai zubaan pe freudian slips hain baba brij bhushan case bhi ulta female wrestlers ko hi investigate kar daala speaking good basic english particular requirement politicians purpose serve say mla rural bihar orissa barely constituents would understand english defending modi people like touch ground reality country read give less unsolicited opinions politics sorry english scale judge charismatic leader great speaker okay lets critical everything lot genuine issues criticise petty things dilute gave address pres biden spoke hindi used interpreter including questions answers think others said world leaders tend address us congress english optics could use interpreter good different basic foreign minister invited speak another countrys parliament us invites indian leader address congress send fm instead either pm president would grave diplomatic faux pass updated comment still didnt answer question however education english right fault argument assuming education system social construct obsession towards english good thing everyone saying nkt knowing english big deal system tells us never big shit made dumb indians slowly realizing dude cant even read properly much expect wasnt aware expectation thought talking speaking english ya say freud oh yeah real men dont investigate minor girl criticize holistic specifically english million things hes done great speaker express ideas properly else expect primary school dropper hey saying one saying english scale judge intelligence charismatic leader anything first language dude room temperature iq gon na come conclusion hearing himherthemthey speak second language yeah see people taking offence english first language fair also party want everyone india speak hindi impose language fuck would speak language english anyone mispronounce word wouldnt blame criticise petty issues fair either someone whose mother tongue english like correct word replaced another correct word even autocorrect fails detect us heardread btw helps people poor states cant understand talking otherwise people would ask women wrestlers fault citizen india expectation highest elected body would budge unless heshe skills override ability address english obsession english seems like looking past pms country ie nehru indira vajpai pvnarasimharaokind people obvious well read people well read mean say someone read enough clear understanding history law hence finest reasoning skills address questions challenges posed people resort cheap tricks cover shortcomings day seen diplomat speak englishin india kind expectations didnt past pms speak regional languages modi clearly well read person street thug reason progressive thoughts think linked educationthen fine argue btw would like see pm doesnt speak hindi english hatred english really laughableesp communicating think stated views clearly giving reasons go ahead keep electing barely finished high school good yoga dressing atal actually better english speaker choose speak hindi un un different people speak mother tounge always interpreter un people come many type languages cant compare un us fiar uses things pr godi media presents charismatic leader really wrote essay say dont problem speaking english good pm problem person tried argue never making point trying argue commentor replied addressing person made post calling bad englishdumb person mentality bhaiyo aur behno kal se investigating investing hoga aur investing investigating hoga supreme leader ki jai sorry comprehension skills low say knowing english okay fact gave reason everyone bashing would cared people low standards elect sad countries diplomats high caliber attend greatest universities required know well english definitely scale judge great speaker doubt modi greater oratory skills issue couldve easily spoken hindi used interpreter chose speak english better pr important criticize instance im commenting great speaker part able good command language wish express ideas want considered great speaker amongst qualities commenting person iq sorry comprehension skills low statement ironic actually laughing right articulated comment poorly needed edit comment change entire narrative anybody reads edited comment seem like reply making sense sorry man cant really argue guy uses pathetic things like editing comment make replying person look dumb yeah man claiming perfect viswaguru need criticize show place wherever possible football soccer childish real important things focus roast modi tharki unkill meant way said able speak properly whichever language chooses speak kinda bare minimum judge charismatic leader great speaker one forced speak english also like doesnt often put feet mouth speaks hindi example beti bachao beti patao way shows dishonesty dont even understand need saw edited went ahead accusation wow btw nowhere intended knowing english dumb want argue nothing guess yes spoken gujarati mean also considered possibility meant said said meanthttpswwwindiatodayinindianorthstorymodisconfidantamitshahaccusedofillegalsnoopingofwomaninbangalore ideology bjp goons dont invest girl child investigate intimidate girl speaks truth country brj busn many cases well maybe freudian skip iykyk tbh people give break like rbi governor something chaiwala bogus political science degree judged english many comments calling op using pm modis mistake spoken english understand coming common person wouldve stood comments ops critique countrys pm english key language global communication think wishing command important language much expect important person country seems everything everywhere judging everyone attributing success modi well us forced take questions press could easily demanded adress language get positive get positive fuck fair first language understandable representative global stage modiji stuck hindi case dont make speeches shit english english speaking country lmao lol questions predecided question works great pr person couldnt open press conference india took singal question us media look world leaders answering questions us joke compare reading teleprompter look hes wrong youre brain washed really investigate mean one wants know girl child parents favorate always score better marks cant bigger room even gets like extra scoop icecream shes smoll modis right dont buy ironically modi rd world leader winston churchill nelson mandelato address us congress twice co incidentally democrats biden makes mistakes even native language lol hindi isnt first language either whats point followed trip indian diaspora didnt want take single question also us force take question know single question wasnt pr bidens country know joke person replied said cant compare un us saying matter could surely asked adress hindi forced take questions edit guys getting angry said questions instead question grow use predictive text keyboard dont type thought said investigating correct ego show speak english memorable upper half india like liberals dont stoop level kind sympathy never extended rg conservatives upper half breached till karnataka complete india also talking hypotheticals please read properly talking hindi north indian thing south doesnt care cant even understand vajpayee speaks hindi south wont fall hindi hindu hindustan shtick completely missed point isnt modi whether politician india able speak basic english oh guys missed dont continent left basically reading continent instead content prime minister country goes addresses un us native language wont proud consider historic leave hindi part aside seem hostile towards speak hindi vajpayee perfectly speak english much better impact international stage representing course pm comfortable english never hold fine mispronounce great orator blatantly use two teleprompters addressing us congress bit much practice speech man representing india language spoke indian language fuck propoganda speaking hindi disrespect languages india get lost want rrr called tollywood exclusively prime minister speaking hindi thats bad speak english cant people get head hindi india propoganda speaking hindi disrespect languages india never said repeat question representing hindi hindu hindustan country investigate anymore spoken hindi trump converse kim jong un indians one prominent minorties also would less embarassing never said hindi india seem taking way show said point repeating question said india equate wrong one many reasons modi wins common man country tired entitled nepotistic elite looking modi grown based skills hardwork poor humble background seems lot people arent able digest want sauve looking walking thesaurus one yehi mistake ko dekh ke andh bhkts ladkiyo ko actually investigate karenge muddy said people defending saying speaking foreign language yes also foreign country representative country resources palm hand think speaking correctly least old man millions watching kinda disappointing investigating girl child kya bak rha hai ye bawasir saw many cases beti bachao aur padhao failing provide education well protection taking bad turn brij bhushan shouldve place wanted see rapist reacts live public crimes also english tab gaya kyu bolne ke liye failed miserably present factual idea work country least language couldve mesmerized crowd producing good useless speech people could translated dude stop insulting chai wala far intelligent cretin plus probably lied chai wala chai wala afford visit us given number times moditards make pappu jokes including often removing context fair say modi deserves mocked ofcourse important many absolute wrong doings said exactly meant whats see op post video giving speech rd language stupidly immature post mean hindi isnt even real language arose hodgepodge n indian languages wasnt anyones native language im really conflicted one hand made fun english hand competent leader know global language think zelenskie stuck mothertongue perv south indian spoke hindi one official languages country also imposition hindi us applaud fact someone country spoke one official languages un memorable historical oh please days even people got actually english education struggle speak articulate stuff problem completely uneducated guy making mistake agree important place pm country make mistakes like fine visionary fluent still manage communicate english person someone speak good english dumb fuck know talking came comment lol somebody investigations mind wrong kind sadly made representative southern indian states talk hes wrong thats happens bihar haryana rajasthan hindi hindu hindustan think failing understand subtle propaganda play problem always choose hindi official languages always messes coming girl child remember beti patao thats ok hindi th spoken language world mean take mean cancelling individual culture spend time supporting languages means investing time protest department education unfairly awards teachers hindi donating money support artists local language forth support country whole work keep individual culture alive honest mistake knows english well keep tone watch early videos speaking english shocked native language really issue one competitors consider fumbles misspeaks something like make fun guy quite hypocrisy doglapan gujjus bhakts mainly would go mad seeing saheb speaking english us people living pushkar rajasthan speak brtter english gujjus living us hidden deep meaning anyone wants determine sex unborn child see girl investigating girl child arrested police along whole family lifts entire family",
    "light_cleaned_title": "Even with a Teleprompter, PM cannot speak properly. Calls Investigating in a girl child instead of Investing.",
    "light_cleaned_selftext": "Video credits",
    "light_cleaned_comments": "Mat bol bhai, kahi toh thodi izzat chod do. He's like one of those uncles who does a weird dance at the party thinking they are cool and whose family members stand embarrassed. See, Modi is nothing like Hitler. At least that POS, genocidal maniac could actually speak coherently. Chatur Ramalingam Saheb made a Freudian slip. Same energy as \"what's worse than a rapist? .... a child\" The day Biden comes to India and speaks in any other language than English, I would probably agree with you. Same energy as \"what's worse than a rapist? .... a child\" Thoda thoda english aata ji Didn't he groom a girl sometime and she said no? And here it is, पिछले नो साल से इन्होने निरंतर इस देश में बलत्कार पे बलत्कार किये, उम्मीद है आगे बी करते रहेगे ] हमें तो आश्चर्य होता है कि एक इंसान अपने जीवन काल में इतनी बलत्कार कैसी कर सकता है| इन्होने कड़ी तपस्या से अपने आपको इस काबिल बुनाया है। OP are you a 5 yo? It’s not his first language. This is just nitpicking for the sake of it. I am kinda curious, is it mandatory to speak in English there? Can they not talk in their mother tongue? TBH, he is not the strongest in Engliah and did a commendable job giving this speech. The audience was in rapt attention and these minor snafus don't diminish the importance of the moment. Lips up the en taar phamily Narendra ramlingum I don't like Modi but I don't think it is fair to make fun of him for his english when there are a million actual things to criticise him for. Mansi soni LMAO Little little English coming G Kahan hai teleprompter idhar? I would say \"such hi to hai\" . You got me in the 2/3 part of the comment Don’t keep so much hate inside you my friend, it will rot you from inside out. English is not his first language and still he is speaking in English. You can criticise him as much as you want, because of his policies and political decisions. They can. But it's good pr in India if Modi ji speaks in English. They can show it on the TV that look how smart he is. Reminds me of when he said \"Beti Bachao, Beti Patao\" Shut the fuck up. What an embarrassment of a prime minister. Wow. I mean not supporting him or opposing his party is completely ok because it’s a democracy but come on. A slip with one word when talking in a foreign language? And that too standing on such a podium? We need to stop confusing fluency in English with intelligence. He makes a mistake in his non native language. It's fine. People do make mistakes while speaking. Isn't English his second language ? That is fair, however he is constantly propped up by lies of him being a \"charismatic leader\", \"great speaker\" etc so it is important to point these out It's actually stupid and dumb to nitpick on this, English is not his first language, many non-english speaking leaders slip like this, just listen to Macron for once lol. Yeah right as if every non native leader speaks proper English, tf is wrong with you people? Talks about girl child, 0 comment made on wrestler protests where girl child was asking for justice. No comment made on hathras case. Always reads some random inspirational and motivational shit. People hate now for the sake of hating. Well, even investigating sounds correct doesn't it 😉😏 Not after that blunder tho. I'd say the opposite. We were taught and were genuinely impressed when Atal Bihari Vajpayee addressed the UN in Hindi. That's more of a punch. Our leader went to the US and addressed their Congress in Hindi. This is more memorable and historical. The reason people don't care about the above point is due to the fact that IT Cell of BJP for years have been character assassinating RG calling him \"pappu\". Suddenly the tables have turned and they have the audacity to act surprised and call it slip of tongue...... I mean we are already are a big enough country now. So we shouldn't give that much fucks. For everyone who says that we should not criticize him for the mistake in teleprompter...Can you please explain what investigating in a girl child means ?? Isn't he a graduate ?? Doesn't he know basic English ?? He may have completed his graduation in political science with Hindi as a medium right ?? English is not his first language, and humans make silly mistakes all the time. HOWEVER, his party and the media have been constantly mocking his political opponents for the same all these years. More like third language. Sorry, disagree with you strongly. We have certain educational requirements for every profession and why shouldn't we have that for our politicians? The entire nation melted over the fact that he was chai wala and not much educated. Lol. Btw, I find it shameful that we have to go to some Western country to tell how feel about investing in girl child...in this day!! Biden can't even speak his 1st language and you are criticising for his third language. Many graduates makes mistakes. Hindi is not an International language and so it okay for Biden not to speak in our regional language. I think we should make English as our first language because most of us South Indians are better at English than Hindi. Phir Tweet kyu Angrezi m karte hai??? I wouldn't criticize him for his accent, but \"words do matter \" Guys chill, even the BJP IT cell does not spare Rahul Gandhi's slips of tongue. I am fine even if he speaks in any other language. As I mentioned, when he comes to India, and speaks in *any language* other than English perfectly. Exactly, most leaders speak their own mother tongue. That's what the interpreters are for. Diplomats and politicians Take pride in their country's language (s) especially when abroad. Well if we can nitpick the oratory skills of other Indian politicians (e.g. raga) for decades then why not him? He is after all the top representative of India, he's expected to deliver a flawless speech 🤭 The US is majorly a english speaking country. India is multilingual and well, knowing english should be very important for an Indian responsible for ruling the country. So my braincells died reading your comment Give him a break! English is like his third or forth language. These Americans call rugby football for fuck's sake! bhai wo investing to investigating bol rha hai, poora matlab change ho rha hai sentence ka. I agree, but Biden didn't make fun of Modi. So, your comment is irrelevant . However, all of our education is in English , esp Law (considering he is a politician). So, it all shows how uneducated Modi is to not to know the difference between \"Investigate\" and \"invest\" and no wonder he don't hold press meetings. Probably , he will not understand most of the questions and has no reasonable logic or reasoning capabilities to handle it with grace. Making fun of someone not speaking a foreign language well is stupid and elitist, OP. Bold of you to assume you had any. You haven't seen Biden speak lmao Vishwaguru just proved to the world that India is full of uneducated people. This is why we need an educated PM like MMS. Absolutely, this is why we have foreign affairs ministers who can speak English fluently. But, Gobijee wants all the limelight for himself. So stop confusing intelligence with propoganda. Hindi me bhi to 'beti bachao beti patao' aata hai zubaan pe. Freudian slips hain re baba! Brij Bhushan case me bhi to ulta female wrestlers ko hi investigate kar daala. Why should speaking ~~good~~ basic English in particular be a requirement for politicians? What purpose does it serve for say a MLA from rural Bihar or Orissa, where barely 5% of his constituents would understand English? Not defending Modi here, but people like you who are so out of touch from the ground reality of our country should read more and give less unsolicited opinions about politics. I am sorry but why is english the scale to judge for being a \"charismatic leader\" or a \"great speaker\"? It's okay. Let's not be critical of everything. There are a lot of genuine issues to criticise him for and these petty things will only dilute them. When he gave his address with Pres. Biden, he spoke in Hindi and used an interpreter, including for questions and answers. I think as others said, world leaders tend to address the US Congress in English if they can, for optics, but they could use an interpreter. Good is different from basic. Which foreign minister is invited to speak in another country’s parliament? If US invites Indian leader to address Congress and we send the FM instead of either PM or President then it would be a grave diplomatic faux pass. Updated the comment. You still didn't answer the question. >However, all of our education is in English Here, right here is the fault with your argument. You are assuming the education system and social construct of obsession towards english is a good thing, which it is not. That is why everyone is saying that nkt knowing english is not a big deal just because our system tells us to do so He never was the \"big shit\" he was made out to be, dumb Indians are just slowly realizing it. Dude he can't even read properly. Is that too much to expect? I wasn't aware of your expectation, I thought we were talking about speaking in english? Did ya just say Freud? Oh yeah Real men don't investigate a minor girl🗿 When I criticize him. It’s holistic not specifically for his English but the million things he’s done. How can you be a great speaker if you cannot express your ideas properly? What else to expect from a primary school dropper? Hey I am not saying he is one, I am just saying english should not be the scale to judge intelligence, charismatic leader or anything at all, it's not his first language, the dude can have a room temperature IQ but I am not gonna come to that conclusion just after hearing him/her/them/they speak in their second language yeah? I see people taking offence that english is not his first language and which is fair but also its his party who want everyone in india to speak Hindi and impose their language so fuck him why would he speak in any other language than English anyone can mispronounce a word , i wouldn't blame or criticise him for these petty issues , and its not fair either for someone whose mother tongue is not English. This is like when a correct word is replaced with another correct word, and even autocorrect fails to detect it. She is in the US I heard/read. BTW. It helps so that people in poor states can't understand what he is talking about. Otherwise people would ask about women wrestlers. Fault? As a citizen of India, my expectation of highest elected body would not budge unless he/she has skills that can override the ability to address in English. This is not obsession about English because it seems like looking into past PM's of country i.e. Nehru, Indira, Vajpai, P.V.Narasimharao..kind of people, it is obvious that they are well read people. Being well read, I mean to say that someone who has read enough that they have clear understanding of history and law and hence have the finest reasoning skills to address questions and challenges posed at them. Such people will not resort to cheap tricks to cover up their shortcomings.. To this day, I have not seen any diplomat who do not speak in English(in India) with the kind of expectations I have. Didn't our past PMs speak in regional languages too? Modi, clearly is not a well read person , just a street thug. That is the reason why he will not have progressive thoughts. If you think these are all not linked to education...then fine. Whom am i to argue against it? Btw, I would like to see a PM who doesn't speak in Hindi and English. The hatred against English here is really laughable....esp, when we are all communicating in that. I think I have stated my views here very clearly. I am no more giving reasons here. Go ahead and keep electing those who barely finished high school but are good at Yoga and dressing. But Atal was actually a better English speaker, he just choose to Speak in Hindi at UN. UN is different where most people speak in Mother tounge and then they always have a interpreter. UN is where people come from many type of languages. Can't compare UN with US. It's fiar, when he uses such things for his PR and all those Godi media presents him as a Charismatic leader. You really wrote an essay just to say that you don't have problem with him not speaking english but him not being a good pm. The problem is the person you tried to argue with was never making the point you are trying to argue against. The commentor you replied to was addressing the person who made this post calling him out on \"bad english=dumb person\" mentality. Bhaiyo aur behno, kal se “investigating” “investing” hoga, aur “investing” “investigating” hoga. Supreme leader ki jai! Sorry, your comprehension skills are very low. I did not say he not knowing English is okay. In fact, I gave a reason that which everyone here are bashing me about. I would not have cared, but , all these people here having low standards on whom they elect is very sad. Because in most countries , diplomats of high caliber attend greatest universities and are required to know well. English is definitely no scale to judge a great speaker. And there is no doubt that Modi has greater oratory skills. The issue here is that he could've easily spoken Hindi and used an interpreter. But he chose to speak English for better PR and that is why it's important to criticize in this instance. I'm only commenting on the \"great speaker\" part. You should be able to have a good command over the language that you wish to express your ideas in if you want to be considered as a great speaker (amongst other qualities) . Not commenting on the person or his IQ here. >Sorry, your comprehension skills are very low This statement is so ironic i am actually laughing right now. You articulated your comment so poorly that you needed to edit your own comment and change the entire narrative so that anybody who reads the \"edited\" comment seem like my reply is not making sense. Sorry man i can't really argue further with a guy who uses pathetic things like editing the comment to make the replying person look dumb Yeah but for man claiming to be perfect and viswaguru, we need to criticize and show his place wherever possible And football soccer This is childish. There are real and important things to focus on and roast Modi. Not this Tharki unkill meant it the way he said it. Being able to speak properly in whichever language he chooses to speak in is kinda the bare minimum to judge for being a \"charismatic leader\" or a \"great speaker\". No one forced him to speak in English. Also, it's not like he doesn't often put both his feet in his mouth when he speaks in hindi. For example, 'beti bachao beti patao' . This is the way This just shows your dishonesty and I don't even understand the need for it. You just saw that I edited and then went ahead with your accusation. Wow!! Btw, Nowhere I intended not knowing English = dumb. You want to argue over nothing I guess. Yes, he should have spoken in Gujarati. I mean also have you considered the possibility [he meant what he said and said what he meant.](https://www.indiatoday.in/india/north/story/modis-confidant-amit-shah-accused-of-illegal-snooping-of-woman-in-bangalore-217623-2013-11-14) It's his ideology. The BJP goons don't invest in girl child but they INVESTIGATE and INTIMIDATE girl who speaks the truth to the country. ( Brj Busn and many other cases) Well, maybe that was a Freudian skip. Iykyk. Tbh people should give him a break. It's not like he has been RBI governor or something. He is a chaiwala with bogus political science degree, so should not be judged for his english. Many comments here are calling out OP on using PM Modi's mistake in spoken English. I understand where they are coming from. For any other common person, I would've stood with those comments in their OP's critique. But this is our country's PM. And English is a key language for global communication. I think wishing for some command of such an important language is not too much to expect from the most important person of this country who seems to be doing everything everywhere all at once (judging by everyone attributing all success to Modi). Well US forced him to take questions from press. Could have easily demanded that the adress should then be in our language. You get a positive we get a positive. Fuck🤣 To be fair it's not his first language , so it's understandable. This is our representative on the global stage! Modiji should have stuck to Hindi in that case! Then dont make speeches in shit English in an English speaking country lmao. Lol, what questions? It was a pre-decided question because it's works great for his PR. The person who couldn't do an open press conference in India. Did took a singal question from US media?? Just look at other world leaders answering questions in US, this is a joke compare to them. He is reading off a teleprompter. Look, he's not wrong, you're all brain washed. We really should investigate them. I mean... am i the only one who wants to know why \"the girl child\" is the parent's favorate? Why does she always score better marks than me and why can't I have the bigger room! She even get's like that extra scoop of icecream bECauSe sHe's sMoLl. Modi's right, I don't buy it.. Ironically Modi is only the 3rd world leader (after Winston Churchill and Nelson Mandela)to address the US Congress twice and co incidentally both were under the Democrats Biden makes mistakes even in his native language lol Hindi isn't his first language either What's your point? If you followed before the trip, the Indian diaspora didn't want to take that single question also. So the US did force him to take that question. I know that it was a single question but it wasn't for his PR. It was for Bidens in his country. I know this is a joke. The person I replied to said cant compare UN to US. I was saying for that matter. He could have surely asked for the adress to be in Hindi. He was forced to take questions. Edit: If you guys are getting angry that I said questions instead of question. Grow up. I use predictive text keyboard. Dont type it all out. I thought what he said about investigating was correct. No it's not, its about ego to show he can speak English. Memorable to who? Upper half of India? This is what I like about liberals. We don't stoop down to their level. This kind of sympathy will never be extended to RG by the conservatives. Upper half? They have breached till Karnataka. So complete India. Also, I was talking in hypotheticals. Please read again properly. I am talking about Hindi being a North Indian thing. The south doesn't care or can't even understand if Vajpayee speaks in Hindi. The south won't fall for the \"Hindi, Hindu, Hindustan\" shtick. You completely missed the point. This isn't about Modi. It's about whether any politician in India SHOULD be able to speak basic English. Oh you guys missed \"I don't have any continent left\" - Basically reading continent instead of content. So the Prime Minister of your country goes and addresses UN or US in a native language and you won't be proud of him or consider it historic? Leave the Hindi part aside. You seem to be too hostile towards it. Why speak Hindi when Vajpayee can perfectly speak in English which will have much better impact on international stage? WHO IS HE REPRESENTING? Of course if PM is not comfortable in English I will NEVER hold it against them. It’s fine to mispronounce. But for the great orator to so blatantly use two teleprompters while addressing the US congress is a bit much. Practice your speech man. Who is he representing? India. The language he spoke? Indian language. Fuck off with your propoganda that speaking Hindi is a disrespect to other languages of India. Get lost. Want RRR to be called Tollywood exclusively because it is but the Prime minister speaking Hindi? No no that's bad. Speak English. Why can't some people get it into their head that Hindi != India? > propoganda that speaking Hindi is a disrespect to other languages of India I NEVER said that. But I will repeat my question, **who is he representing?** Hindi, Hindu, Hindustan ☕ The country should not investigate in him anymore. He should have spoken in Hindi. If Trump can Converse with Kim Jong Un then so can he. After all Indians are one of the prominent minorties over there. Also it would have been less embarassing. I never said Hindi= India. You seem to be taking it that way. Show me where I said that. And what is the point of repeating the question? I said India. If you equate it to that, you are in the wrong not me. This is one of the many reasons why Modi wins. The common man of this country is tired of the entitled nepotistic elite looking down on them. Modi has grown based on his own skills and hardwork from a poor humble background, and it seems a lot of people aren't able to digest it and want a sauve looking walking thesaurus who is one of them. Yehi mistake ko dekh ke andh bhkts ladkiyo ko actually investigate karenge because “muddy said so” All the people defending him saying he is speaking in a foreign language, yes he is being he is also in a foreign country and as the representative of our country with all resources at the palm of his hand I think speaking correctly is the least the old man can do when there are millions watching him Kinda disappointing Investigating in the girl child? Kya bak rha hai ye bawasir. We saw so many cases of your Beti bachao aur padhao failing to provide education as well as protection now it's taking a bad turn. Brij Bhushan should've been in your place. I wanted to see how a rapist reacts to the live public for their crimes and also in English. Tab gaya kyu bolne ke liye? Failed miserably to present a factual idea about his work for the country. At least in his own language he could've mesmerized the crowd by producing \"good but useless\" speech to people and that could be translated. Dude stop insulting Chai wala, they are far more intelligent than this cretin. Plus he probably lied about being a Chai wala as no Chai wala can afford to visit the US during 80s. Given the number of times moditards make pappu jokes, including often by removing context, it's fair to say, Modi deserves to be mocked for this. Ofcourse it's not as important as the many of his absolute wrong doings. He said exactly what he meant. What's here to see? OP how about you post a video of yourself giving a speech in your 3rd language? What a stupidly immature post. I mean, Hindi isn't even a real language, it arose out of a hodgepodge of N Indian languages, and wasn't anyone's native language until the 1700s. I’m really conflicted on one hand no should be made fun of for their English on the other hand any competent leader should know the global language I think Zelenskie stuck with his mothertongue What a perv!! south **indian** here. he spoke in hindi, which is one of the 22 official languages of the country. while i am also against the imposition of hindi on us, i applaud the fact that someone from **my** **country** spoke one of **our** official languages in the UN. it is memorable and historical. Oh please. These days, even the people who got actually English education struggle to speak and articulate stuff and you have a problem with a completely uneducated guy making a mistake? While I agree that, it's a very important place and a PM of a country should not make mistakes like these; I am fine with him being a visionary and not so fluent (but can still manage to communicate in English person) and someone who can speak good English and is dumb as fuck (you know who I am talking about). Just came down to comment this lol Somebody has investigations on his mind. Only the wrong kind, sadly. And who made you the representative of all Southern Indian states. Talk about yourself. He's not wrong. That's what happens in UP, Bihar, Haryana, and Rajasthan > Hindi, Hindu, Hindustan I think you are failing to understand the subtle propaganda in play here. The problem is they ***always*** choose Hindi out of the 22 official languages. Always messes up when coming to girl child. Remember \"Beti Patao\"? And that's ok. After all, Hindi is the 4th most spoken language in the world. But this does not mean that we should take to it, because this will mean cancelling our individual culture. We should spend more time supporting our languages- this means investing time to protest against the department of education that unfairly awards the teachers of Hindi, donating money to support artists of our local language and so on and so forth. Support the country as a whole, but work to keep our individual culture alive. This is just honest mistake he knows English very well here he has to keep the tone.. watch early 2000 videos of him speaking English you will be shocked It’s not his native language so it’s not really an issue. But, when one of his competitors (if at all we can consider him so) fumbles or misspeaks something like this, we make fun of that guy. Quite a hypocrisy! Doglapan It is for gujjus and bhakts mainly who would go mad seeing their saheb speaking english in the US. People living in Pushkar Rajasthan speak brtter english than most gujjus living in the US. The hidden deep meaning being .. that anyone who wants to determine the sex of an unborn child, to see if it’s a girl, ((investigating a girl child) will be arrested by the Police along with the whole family (lifts the entire family)"
}