{
    "id": "1fr6rz4",
    "title": "Kerala HC Cautions Parents Against Taking Tender Age Children To Protests For Grabbing Attention, 'Wilful Neglect' Will Attract Strict Action",
    "url": "https://www.reddit.com/r/india/comments/1fr6rz4/kerala_hc_cautions_parents_against_taking_tender/",
    "selftext": "The Court stated that parents must not take their small children to protest, dharna, satyagraha to gain attention. Further, elaborating on the harms of taking small children to such places, the Court said, “Exposure to extreme temperatures without sanitation and crowded conditions can lead to illness in children. The agitations can disrupt the child's regular routine including meals, sleep, play, education etc. If a child is taken to a protest, there are chance for violence in the protest putting the child at the risk of physical harm. Moreover, loud noises, crowds and conflicts can cause emotional trauma to a child. When the parents are participating in agitations, protest, dharna, satyagraha etc, they may be distracted and unable to provide proper care during the agitations.”\n\nIn the present case, the Court observed that the petitioners had lost their another child due to medical negligence and noted although the government had sanctioned financial aid, the funds had not been disbursed to them.\n\nThe Court stated that to attract an offence under Section 23 of the JJ Act, there must be 'wilful neglect' against the juvenile or cause or procure the child to be assaulted, abandoned, exposed, or neglected to cause mental or physical suffering upon the child. \n\nIn the facts of the case, Court stated that *death of another child* might have forced the parents to conduct the protest. The Court took the view that it cannot be said that the petitioners had an 'intent' to inflict unnecessary mental or physical suffering to the 3-year-old. It thus concluded that criminal prosecution against the parents was not warranted, however, the Court emphasized that this decision should not be regarded as a precedent and if such incidents happen in future, the law enforcing machinery can take strict action in accordance with the law.",
    "flair": "Law & Courts",
    "score": 28,
    "num_comments": 3,
    "created_utc": 1727499138.0,
    "convurl": "https://external-preview.redd.it/HGnP_8lFNbWMw_QrtJqRVRyGkj8jd7Ivc6AeHYwxPWI.jpg?auto=webp&s=73beee7ef829545752b6bc5c60cf8a6ab7e39691",
    "comments": [
        "Absolutely agreed. \n\nEducate children.\n\nLeave the agitate and organize for when they are adults.",
        "Does the court think protesters will leave kids with nannies? ROFL.",
        "Does the same apply to taking “tender aged kids” to religious processions? Melas? Kumbhas?"
    ],
    "cleaned_text": "kerala hc cautions parents taking tender age children protests grabbing attention wilful neglect attract strict action court stated parents must take small children protest dharna satyagraha gain attention elaborating harms taking small children places court said exposure extreme temperatures without sanitation crowded conditions lead illness children agitations disrupt childs regular routine including meals sleep play education etc child taken protest chance violence protest putting child risk physical harm moreover loud noises crowds conflicts cause emotional trauma child parents participating agitations protest dharna satyagraha etc may distracted unable provide proper care agitations present case court observed petitioners lost another child due medical negligence noted although government sanctioned financial aid funds disbursed court stated attract offence section jj act must wilful neglect juvenile cause procure child assaulted abandoned exposed neglected cause mental physical suffering upon child facts case court stated death another child might forced parents conduct protest court took view said petitioners intent inflict unnecessary mental physical suffering yearold thus concluded criminal prosecution parents warranted however court emphasized decision regarded precedent incidents happen future law enforcing machinery take strict action accordance law ",
    "cleaned_title": "kerala hc cautions parents taking tender age children protests grabbing attention wilful neglect attract strict action",
    "cleaned_selftext": "court stated parents must take small children protest dharna satyagraha gain attention elaborating harms taking small children places court said exposure extreme temperatures without sanitation crowded conditions lead illness children agitations disrupt childs regular routine including meals sleep play education etc child taken protest chance violence protest putting child risk physical harm moreover loud noises crowds conflicts cause emotional trauma child parents participating agitations protest dharna satyagraha etc may distracted unable provide proper care agitations present case court observed petitioners lost another child due medical negligence noted although government sanctioned financial aid funds disbursed court stated attract offence section jj act must wilful neglect juvenile cause procure child assaulted abandoned exposed neglected cause mental physical suffering upon child facts case court stated death another child might forced parents conduct protest court took view said petitioners intent inflict unnecessary mental physical suffering yearold thus concluded criminal prosecution parents warranted however court emphasized decision regarded precedent incidents happen future law enforcing machinery take strict action accordance law",
    "cleaned_comments": "absolutely agreed educate children leave agitate organize adults court think protesters leave kids nannies rofl apply taking tender aged kids religious processions melas kumbhas",
    "light_cleaned_title": "Kerala HC Cautions Parents Against Taking Tender Age Children To Protests For Grabbing Attention, 'Wilful Neglect' Will Attract Strict Action",
    "light_cleaned_selftext": "The Court stated that parents must not take their small children to protest, dharna, satyagraha to gain attention. Further, elaborating on the harms of taking small children to such places, the Court said, “Exposure to extreme temperatures without sanitation and crowded conditions can lead to illness in children. The agitations can disrupt the child's regular routine including meals, sleep, play, education etc. If a child is taken to a protest, there are chance for violence in the protest putting the child at the risk of physical harm. Moreover, loud noises, crowds and conflicts can cause emotional trauma to a child. When the parents are participating in agitations, protest, dharna, satyagraha etc, they may be distracted and unable to provide proper care during the agitations.” In the present case, the Court observed that the petitioners had lost their another child due to medical negligence and noted although the government had sanctioned financial aid, the funds had not been disbursed to them. The Court stated that to attract an offence under Section 23 of the JJ Act, there must be 'wilful neglect' against the juvenile or cause or procure the child to be assaulted, abandoned, exposed, or neglected to cause mental or physical suffering upon the child. In the facts of the case, Court stated that *death of another child* might have forced the parents to conduct the protest. The Court took the view that it cannot be said that the petitioners had an 'intent' to inflict unnecessary mental or physical suffering to the 3-year-old. It thus concluded that criminal prosecution against the parents was not warranted, however, the Court emphasized that this decision should not be regarded as a precedent and if such incidents happen in future, the law enforcing machinery can take strict action in accordance with the law.",
    "light_cleaned_comments": "Absolutely agreed. Educate children. Leave the agitate and organize for when they are adults. Does the court think protesters will leave kids with nannies? ROFL. Does the same apply to taking “tender aged kids” to religious processions? Melas? Kumbhas?"
}