{
    "id": "1hibq2q",
    "title": "Women Need To Realise That Beneficial Laws Aren't Means To Threaten, Domineer Or Extort From Their Husbands : Supreme Court",
    "url": "https://www.livelaw.in/amp/top-stories/women-need-to-realise-that-beneficial-laws-arent-means-to-threaten-domineer-or-extort-from-their-husbands-supreme-court-278932",
    "selftext": "The Court observed that more often than not, provisions like Section 498A (cruelty), \n376(rape), \n377(unnatural sex), and \n506(criminal intimidation) of the Indian Penal Code are invoked as a *\"combined package\"* to pressurise the husband to accede to the demands of the wife in matrimonial cases.\n\n\n> *\"The provisions in the criminal law are for the protection and empowerment of women but sometimes are used by certain women more for purposes that they are never meant for. In recent times, the invocation of Sections 498A, 376, 377, 506 of the IPC as a combined package in most of the complaints related to matrimonial disputes is a practice which has been condemned by this Court on several occasions.\"*\n\n*\"In certain cases, the wife and her family tend to use a criminal complaint with all the above serious offences as a platform for negotiation and as a mechanism and a tool to get the husband and his family to comply with their demands, which are mostly monetary in nature,\"*\n-the Court added. Sometimes this is done in a fit of rage, while at times, it is a \"planned strategy.\"",
    "flair": "Law & Courts",
    "score": 90,
    "num_comments": 23,
    "created_utc": 1734668478.0,
    "convurl": "https://external-preview.redd.it/P11pdtgYP4bX5V5zbTMnHIgsQanfAJiKWX76J74WfZg.jpg?auto=webp&s=62b459c4be100b51d4667992786312bb4395a5b0",
    "comments": [
        "Women need to realize that marriage is not a profession. \nYou become a housewife, work like a maid in husband's house. You don't get paid, unlike a professional job where you can get paid. \nHe can abuse you. The so-called laws that you can use like 498a will now onwards become extremely difficult to use so your husband can torture and abuse you, cheat on you and he will still refuse to pay you alimony or give you any rights on residential property (empowered by the likes of Deepika bhardwaj). \nSo women need to get serious about career. Do not be a housewife. If you like cooking, become a home chef , don't work like a free maid for the in-laws.\nBuy your own fucking house. \nAnd don't get swayed by the media frenzy around ma ki mamta. If you birth a child, remember that men's right movement will ensure that only father has right on child. No child support will be given. Your job will be that of surrogate and financier for your child, nothing else.",
        "It takes the Supreme Court to remind \"A woman scorned\" that vengeance is not always sweet.",
        "It's the women who want to be house wifes, right. As if they have not been conditioned from childhood by their families and society. It's the women who need to wake up. /S",
        "i would really like people to stop this dowry system and then we can get rid of alimony too.",
        "whats your answer for women who arent capable of having a job?",
        "Alimony where it is deserved should be paid appropriately.",
        "Ah yes the classic comments and observations specialist Supreme Court of India. Can we have some actual judgements punishing those who are misusing these laws ?",
        "That’s an admission that the laws are lopsided so they are unconstitutional",
        "These are nonsense useless statements. Stop the cruel  absurd alimony concept. things will automatically fall in their right places.",
        "Alimony should be gender neutral",
        "it is on paper(for hindus), judges dont honor it, thats a different issue that needs to be dealt with",
        "That's the issue, it's not different. Also religion should not matter here.",
        "Lol they just narrowly dodged admitting that the laws are lopsided and need amendments. This is just the SC acknowledging the current reality we're living in without providing any solutions of what can be done to avoid getting booked under these \"packages\". They didn't pass a judgement declaring them unconstitutional so it's not like these fake cases are going away any time soon.",
        "These are nonsense useless statements. Stop the cruel  absurd alimony concept. things will automatically fall in their right places.",
        "Are you a sufferer like atul?",
        "That's the job of the legislature. SC shouldn't be in the business of nulling laws just because people want it.",
        "Like they don't understand that 😂, if you will leave a law that can be taken advantage of it will be taken advantage of, hoping that people wont misuse them is downright dumb, women aren't some angels, they are human too lmfao, these kind of laws shouldn't exist in the first place, we need to scrap these laws and find actual solutions to the problems these so called laws were supposed to \"fix\".",
        "Yep, why the concept of alimony still exists in a world where women can easily go out and earn a living is insane, and these still exist even in western countries, thats why i always call bs on their \"equality\" claims, they just want advantage.",
        "Why one at a time, why not get rid of both of them together.",
        "It shouldn't exist unless the other person is really unable to provide for themselves and it should still be very temporary, so the other person doesn't just sit on their arse and actually try to become independent.",
        "Become capable of providing for yourself, what else?\nI mean howtf is it supposed to be of any relevance to the provider after divorce and is still considered fair is beyond me, but lets say for arguments sake the assumed women is truly incapable of feeding herself, then after investigating that shes truly incapable or just wants to leech off, if truly incapable gets fair alimony amount for like a year in which shes supposed to become capable or get married to someone else (dont even try to come up with excuse like one year isn't enough to start earning its flatly false), if shes just trying to leech off tell her to f off, that way its actually fair and useful.",
        "And its the working/literate and \"modern\" women who almost always misuse these laws so your argument is mostly invalid 😂.",
        "These are nonsense useless statements. Stop the cruel  absurd alimony concept. things will automatically fall in their right places.",
        "so why no action on the wife for filing those fake cases",
        "That’s true. But courts can recommend laws"
    ],
    "cleaned_text": "women need realise beneficial laws arent means threaten domineer extort husbands supreme court court observed often provisions like section cruelty rape unnatural sex criminal intimidation indian penal code invoked combined package pressurise husband accede demands wife matrimonial cases provisions criminal law protection empowerment women sometimes used certain women purposes never meant recent times invocation sections ipc combined package complaints related matrimonial disputes practice condemned court several occasions certain cases wife family tend use criminal complaint serious offences platform negotiation mechanism tool get husband family comply demands mostly monetary nature court added sometimes done fit rage times planned strategy ",
    "cleaned_title": "women need realise beneficial laws arent means threaten domineer extort husbands supreme court",
    "cleaned_selftext": "court observed often provisions like section cruelty rape unnatural sex criminal intimidation indian penal code invoked combined package pressurise husband accede demands wife matrimonial cases provisions criminal law protection empowerment women sometimes used certain women purposes never meant recent times invocation sections ipc combined package complaints related matrimonial disputes practice condemned court several occasions certain cases wife family tend use criminal complaint serious offences platform negotiation mechanism tool get husband family comply demands mostly monetary nature court added sometimes done fit rage times planned strategy",
    "cleaned_comments": "women need realize marriage profession become housewife work like maid husbands house dont get paid unlike professional job get paid abuse socalled laws use like onwards become extremely difficult use husband torture abuse cheat still refuse pay alimony give rights residential property empowered likes deepika bhardwaj women need get serious career housewife like cooking become home chef dont work like free maid inlaws buy fucking house dont get swayed media frenzy around ki mamta birth child remember mens right movement ensure father right child child support given job surrogate financier child nothing else takes supreme court remind woman scorned vengeance always sweet women want house wifes right conditioned childhood families society women need wake would really like people stop dowry system get rid alimony whats answer women arent capable job alimony deserved paid appropriately ah yes classic comments observations specialist supreme court india actual judgements punishing misusing laws thats admission laws lopsided unconstitutional nonsense useless statements stop cruel absurd alimony concept things automatically fall right places alimony gender neutral paperfor hindus judges dont honor thats different issue needs dealt thats issue different also religion matter lol narrowly dodged admitting laws lopsided need amendments sc acknowledging current reality living without providing solutions done avoid getting booked packages didnt pass judgement declaring unconstitutional like fake cases going away time soon nonsense useless statements stop cruel absurd alimony concept things automatically fall right places sufferer like atul thats job legislature sc shouldnt business nulling laws people want like dont understand leave law taken advantage taken advantage hoping people wont misuse downright dumb women arent angels human lmfao kind laws shouldnt exist first place need scrap laws find actual solutions problems called laws supposed fix yep concept alimony still exists world women easily go earn living insane still exist even western countries thats always call bs equality claims want advantage one time get rid together shouldnt exist unless person really unable provide still temporary person doesnt sit arse actually try become independent become capable providing else mean howtf supposed relevance provider divorce still considered fair beyond lets say arguments sake assumed women truly incapable feeding investigating shes truly incapable wants leech truly incapable gets fair alimony amount like year shes supposed become capable get married someone else dont even try come excuse like one year isnt enough start earning flatly false shes trying leech tell f way actually fair useful workingliterate modern women almost always misuse laws argument mostly invalid nonsense useless statements stop cruel absurd alimony concept things automatically fall right places action wife filing fake cases thats true courts recommend laws",
    "light_cleaned_title": "Women Need To Realise That Beneficial Laws Aren't Means To Threaten, Domineer Or Extort From Their Husbands : Supreme Court",
    "light_cleaned_selftext": "The Court observed that more often than not, provisions like Section 498A (cruelty), 376(rape), 377(unnatural sex), and 506(criminal intimidation) of the Indian Penal Code are invoked as a *\"combined package\"* to pressurise the husband to accede to the demands of the wife in matrimonial cases. > *\"The provisions in the criminal law are for the protection and empowerment of women but sometimes are used by certain women more for purposes that they are never meant for. In recent times, the invocation of Sections 498A, 376, 377, 506 of the IPC as a combined package in most of the complaints related to matrimonial disputes is a practice which has been condemned by this Court on several occasions.\"* *\"In certain cases, the wife and her family tend to use a criminal complaint with all the above serious offences as a platform for negotiation and as a mechanism and a tool to get the husband and his family to comply with their demands, which are mostly monetary in nature,\"* -the Court added. Sometimes this is done in a fit of rage, while at times, it is a \"planned strategy.\"",
    "light_cleaned_comments": "Women need to realize that marriage is not a profession. You become a housewife, work like a maid in husband's house. You don't get paid, unlike a professional job where you can get paid. He can abuse you. The so-called laws that you can use like 498a will now onwards become extremely difficult to use so your husband can torture and abuse you, cheat on you and he will still refuse to pay you alimony or give you any rights on residential property (empowered by the likes of Deepika bhardwaj). So women need to get serious about career. Do not be a housewife. If you like cooking, become a home chef , don't work like a free maid for the in-laws. Buy your own fucking house. And don't get swayed by the media frenzy around ma ki mamta. If you birth a child, remember that men's right movement will ensure that only father has right on child. No child support will be given. Your job will be that of surrogate and financier for your child, nothing else. It takes the Supreme Court to remind \"A woman scorned\" that vengeance is not always sweet. It's the women who want to be house wifes, right. As if they have not been conditioned from childhood by their families and society. It's the women who need to wake up. /S i would really like people to stop this dowry system and then we can get rid of alimony too. whats your answer for women who arent capable of having a job? Alimony where it is deserved should be paid appropriately. Ah yes the classic comments and observations specialist Supreme Court of India. Can we have some actual judgements punishing those who are misusing these laws ? That’s an admission that the laws are lopsided so they are unconstitutional These are nonsense useless statements. Stop the cruel absurd alimony concept. things will automatically fall in their right places. Alimony should be gender neutral it is on paper(for hindus), judges dont honor it, thats a different issue that needs to be dealt with That's the issue, it's not different. Also religion should not matter here. Lol they just narrowly dodged admitting that the laws are lopsided and need amendments. This is just the SC acknowledging the current reality we're living in without providing any solutions of what can be done to avoid getting booked under these \"packages\". They didn't pass a judgement declaring them unconstitutional so it's not like these fake cases are going away any time soon. These are nonsense useless statements. Stop the cruel absurd alimony concept. things will automatically fall in their right places. Are you a sufferer like atul? That's the job of the legislature. SC shouldn't be in the business of nulling laws just because people want it. Like they don't understand that 😂, if you will leave a law that can be taken advantage of it will be taken advantage of, hoping that people wont misuse them is downright dumb, women aren't some angels, they are human too lmfao, these kind of laws shouldn't exist in the first place, we need to scrap these laws and find actual solutions to the problems these so called laws were supposed to \"fix\". Yep, why the concept of alimony still exists in a world where women can easily go out and earn a living is insane, and these still exist even in western countries, thats why i always call bs on their \"equality\" claims, they just want advantage. Why one at a time, why not get rid of both of them together. It shouldn't exist unless the other person is really unable to provide for themselves and it should still be very temporary, so the other person doesn't just sit on their arse and actually try to become independent. Become capable of providing for yourself, what else? I mean howtf is it supposed to be of any relevance to the provider after divorce and is still considered fair is beyond me, but lets say for arguments sake the assumed women is truly incapable of feeding herself, then after investigating that shes truly incapable or just wants to leech off, if truly incapable gets fair alimony amount for like a year in which shes supposed to become capable or get married to someone else (dont even try to come up with excuse like one year isn't enough to start earning its flatly false), if shes just trying to leech off tell her to f off, that way its actually fair and useful. And its the working/literate and \"modern\" women who almost always misuse these laws so your argument is mostly invalid 😂. These are nonsense useless statements. Stop the cruel absurd alimony concept. things will automatically fall in their right places. so why no action on the wife for filing those fake cases That’s true. But courts can recommend laws"
}