{
    "id": "1ddfdvo",
    "title": "Missing little girl in India, Mumbai",
    "url": "https://www.reddit.com/gallery/1ddfdvo",
    "selftext": "I just came across a woman on Tiktok who is searching for her missing daughter in Mumbai, India. There is not much I can do, but I’ll give this a try.\n\nI copied and pasted a summary from Google \n\nIn September 2016, Insiya was abducted to India at the age of two, where she still resides. Insiya's father is said to have hired several men to kidnap his daughter abroad. Insiya's wealthy father Shehzad H. is seen as the originator of the child abduction. He and his ex-partner Nadia Rashid are embroiled in a divorce.27 Jun 2018\n\nShe was kidnapped from the country she was born in by her mother’s abusive ex husband (Insiya’s father). Insiya has a dutch passport and was kidnapped to India..  She is apparently living with her father in Mumbai who kidnapped her from her mother in the Netherlands. I’m not sure why India is not helping? I’ve read that the Indian government just sees it as a father who took is daughter to his own country and I’ve read that the father is \nrich and everyone knows him? \n\nI also read that two of the kidnappers were sentenced to 8.5 years in prison. \n\nPlease take a look at the link and spread awareness in your community 🙏🏻\n\nhttps://www.bringinsiyaback.nl/about-the-case/\n\nhttps://www.tiktok.com/@bringinsiyaback?_t=8n72pNbnppt&_r=1\n\n",
    "flair": "Law & Courts",
    "score": 368,
    "num_comments": 18,
    "created_utc": 1718115859.0,
    "convurl": "https://i.redd.it/dkl5hjzjcy5d1.jpg",
    "comments": [
        "It's heartbreaking 💔",
        "If she was 2 when she was kidnapped in 2016, she would be around 10 years old now - old enough to reach out to her mother. I hope she somehow gets to read about this ordeal online and finds a way round connect with her mother.",
        "These is an international treaty that prevent such kidnapping of children by their own parents. Countries cooperate and help return kids to the parent who has the legal custody. Unfortunately, India is one of the few countries who is not a part of the treaty. Its unlikely anything can be legally done here.\n\n[https://en.wikipedia.org/wiki/Hague\\_Convention\\_on\\_the\\_Civil\\_Aspects\\_of\\_International\\_Child\\_Abduction](https://en.wikipedia.org/wiki/Hague_Convention_on_the_Civil_Aspects_of_International_Child_Abduction)",
        "Whoa",
        "Maybe the mother would have better luck getting her daughter back if she filed for custody in an Indian court, rather than social media drama.\n\n\n\n\nThere's no abduction here, it's a family situation that's gone south. There are courts to resolve these matters. Social media likes and tears can do absolutely nothing here.",
        "She likely has another mother and won't either know about her biological mother or won't have any affection or connection to her by now.",
        "Why are parents kidnapping their own children?",
        "What makes you think someone would do this for likes?",
        "What else will this person get from social media, except for likes and sympathy or money via donations?\n\n\n\n\nShe's not getting her kid by ranting on the internet. She needs to go to the local Indian courts and that's the only way back.",
        "Look, as much as harsh as he sounds, he’s lowkey right yall, india won’t do shit, look at the top comment as someone said, india ain’t a part of the treaty which isn’t surprising, nothing really can be done on social media, she needs to go herself and get it done with her family or the support that she has ig for now, that’s the only right way for now",
        "I’ve been following this case from the start on Facebook.. till now there’s no progress",
        "Isn't Japan also one who isn't in one of those treaties, i remember being disgusted watching a documentary where Japanese parents kidnap kids from the other parents and their govt not giving a shit. We are also doing the same",
        "Japan became a part of it in 2014.",
        "I usually dont say this, but this particular case sounds fishy. \n\nShe can fly down to Mumbai or at least hire a lawyer, contact the police or the embassy(10 years probably a citizen). No one’s stopping her from doing that. "
    ],
    "cleaned_text": "missing little girl india mumbai came across woman tiktok searching missing daughter mumbai india much ill give try copied pasted summary google september insiya abducted india age two still resides insiyas father said hired several men kidnap daughter abroad insiyas wealthy father shehzad h seen originator child abduction expartner nadia rashid embroiled divorce jun kidnapped country born mothers abusive ex husband insiyas father insiya dutch passport kidnapped india apparently living father mumbai kidnapped mother netherlands im sure india helping ive read indian government sees father took daughter country ive read father rich everyone knows also read two kidnappers sentenced years prison please take look link spread awareness community ",
    "cleaned_title": "missing little girl india mumbai",
    "cleaned_selftext": "came across woman tiktok searching missing daughter mumbai india much ill give try copied pasted summary google september insiya abducted india age two still resides insiyas father said hired several men kidnap daughter abroad insiyas wealthy father shehzad h seen originator child abduction expartner nadia rashid embroiled divorce jun kidnapped country born mothers abusive ex husband insiyas father insiya dutch passport kidnapped india apparently living father mumbai kidnapped mother netherlands im sure india helping ive read indian government sees father took daughter country ive read father rich everyone knows also read two kidnappers sentenced years prison please take look link spread awareness community",
    "cleaned_comments": "heartbreaking kidnapped would around years old old enough reach mother hope somehow gets read ordeal online finds way round connect mother international treaty prevent kidnapping children parents countries cooperate help return kids parent legal custody unfortunately india one countries part treaty unlikely anything legally done httpsenwikipediaorgwikihagueconventiononthecivilaspectsofinternationalchildabductionhttpsenwikipediaorgwikihagueconventiononthecivilaspectsofinternationalchildabduction whoa maybe mother would better luck getting daughter back filed custody indian court rather social media drama theres abduction family situation thats gone south courts resolve matters social media likes tears absolutely nothing likely another mother wont either know biological mother wont affection connection parents kidnapping children makes think someone would likes else person get social media except likes sympathy money via donations shes getting kid ranting internet needs go local indian courts thats way back look much harsh sounds hes lowkey right yall india wont shit look top comment someone said india aint part treaty isnt surprising nothing really done social media needs go get done family support ig thats right way ive following case start facebook till theres progress isnt japan also one isnt one treaties remember disgusted watching documentary japanese parents kidnap kids parents govt giving shit also japan became part usually dont say particular case sounds fishy fly mumbai least hire lawyer contact police embassy years probably citizen ones stopping",
    "light_cleaned_title": "Missing little girl in India, Mumbai",
    "light_cleaned_selftext": "I just came across a woman on Tiktok who is searching for her missing daughter in Mumbai, India. There is not much I can do, but I’ll give this a try. I copied and pasted a summary from Google In September 2016, Insiya was abducted to India at the age of two, where she still resides. Insiya's father is said to have hired several men to kidnap his daughter abroad. Insiya's wealthy father Shehzad H. is seen as the originator of the child abduction. He and his ex-partner Nadia Rashid are embroiled in a divorce.27 Jun 2018 She was kidnapped from the country she was born in by her mother’s abusive ex husband (Insiya’s father). Insiya has a dutch passport and was kidnapped to India.. She is apparently living with her father in Mumbai who kidnapped her from her mother in the Netherlands. I’m not sure why India is not helping? I’ve read that the Indian government just sees it as a father who took is daughter to his own country and I’ve read that the father is rich and everyone knows him? I also read that two of the kidnappers were sentenced to 8.5 years in prison. Please take a look at the link and spread awareness in your community 🙏🏻",
    "light_cleaned_comments": "It's heartbreaking 💔 If she was 2 when she was kidnapped in 2016, she would be around 10 years old now - old enough to reach out to her mother. I hope she somehow gets to read about this ordeal online and finds a way round connect with her mother. These is an international treaty that prevent such kidnapping of children by their own parents. Countries cooperate and help return kids to the parent who has the legal custody. Unfortunately, India is one of the few countries who is not a part of the treaty. Its unlikely anything can be legally done here. [https://en.wikipedia.org/wiki/Hague\\_Convention\\_on\\_the\\_Civil\\_Aspects\\_of\\_International\\_Child\\_Abduction](https://en.wikipedia.org/wiki/Hague_Convention_on_the_Civil_Aspects_of_International_Child_Abduction) Whoa Maybe the mother would have better luck getting her daughter back if she filed for custody in an Indian court, rather than social media drama. There's no abduction here, it's a family situation that's gone south. There are courts to resolve these matters. Social media likes and tears can do absolutely nothing here. She likely has another mother and won't either know about her biological mother or won't have any affection or connection to her by now. Why are parents kidnapping their own children? What makes you think someone would do this for likes? What else will this person get from social media, except for likes and sympathy or money via donations? She's not getting her kid by ranting on the internet. She needs to go to the local Indian courts and that's the only way back. Look, as much as harsh as he sounds, he’s lowkey right yall, india won’t do shit, look at the top comment as someone said, india ain’t a part of the treaty which isn’t surprising, nothing really can be done on social media, she needs to go herself and get it done with her family or the support that she has ig for now, that’s the only right way for now I’ve been following this case from the start on Facebook.. till now there’s no progress Isn't Japan also one who isn't in one of those treaties, i remember being disgusted watching a documentary where Japanese parents kidnap kids from the other parents and their govt not giving a shit. We are also doing the same Japan became a part of it in 2014. I usually dont say this, but this particular case sounds fishy. She can fly down to Mumbai or at least hire a lawyer, contact the police or the embassy(10 years probably a citizen). No one’s stopping her from doing that."
}