{
    "id": "13paoho",
    "title": "Hi guys, please take some time to help me by filling this out!",
    "url": "https://www.reddit.com/r/india/comments/13paoho/hi_guys_please_take_some_time_to_help_me_by/",
    "selftext": "Hi, I'm from India and am doing my MBBS. I am conducting this study to understand the Public Perception of Information Regarding Mental Health Issues on Social Media in India. \n\nNO PERSONAL IDENTIFYING INFORMATION WILL BE ASKED/TAKEN \n\n\nYou're eligible for this study if:\n\n1. You're above 18 years old\n2. You use social media.\n\nThis questionnaire will take you approximately 10-15 minutes to complete.\n\nThank you for taking the time to fill [Google Form](https://forms.gle/YgZMYNapxtpgkxbn6)this questionnaire!\n\nI would be really grateful if you guys could take some time to fill this for me, as this paper would really help my career. Thank you!",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1684807200.0,
    "convurl": "https://external-preview.redd.it/wa0BPikLaHJrw50b_AekdkJXxCbWySnL_3NFstjxQO4.jpg?auto=webp&v=enabled&s=4da90d87b5ffcf230b55d53249d59b48b3e3b581",
    "comments": [],
    "cleaned_text": "hi guys please take time help filling hi im india mbbs conducting study understand public perception information regarding mental health issues social media india personal identifying information askedtaken youre eligible study youre years old use social media questionnaire take approximately minutes complete thank taking time fill google formhttpsformsgleygzmynapxtpgkxbnthis questionnaire would really grateful guys could take time fill paper would really help career thank ",
    "cleaned_title": "hi guys please take time help filling",
    "cleaned_selftext": "hi im india mbbs conducting study understand public perception information regarding mental health issues social media india personal identifying information askedtaken youre eligible study youre years old use social media questionnaire take approximately minutes complete thank taking time fill google formhttpsformsgleygzmynapxtpgkxbnthis questionnaire would really grateful guys could take time fill paper would really help career thank",
    "cleaned_comments": "",
    "light_cleaned_title": "Hi guys, please take some time to help me by filling this out!",
    "light_cleaned_selftext": "Hi, I'm from India and am doing my MBBS. I am conducting this study to understand the Public Perception of Information Regarding Mental Health Issues on Social Media in India. NO PERSONAL IDENTIFYING INFORMATION WILL BE ASKED/TAKEN You're eligible for this study if: 1. You're above 18 years old 2. You use social media. This questionnaire will take you approximately 10-15 minutes to complete. Thank you for taking the time to fill [Google Form](https://forms.gle/YgZMYNapxtpgkxbn6)this questionnaire! I would be really grateful if you guys could take some time to fill this for me, as this paper would really help my career. Thank you!",
    "light_cleaned_comments": ""
}