{
    "id": "13igip1",
    "title": "Is this wrong? (Virama at the end of a word transliterated from English)",
    "url": "https://www.reddit.com/r/india/comments/13igip1/is_this_wrong_virama_at_the_end_of_a_word/",
    "selftext": "I saw this last week in Mumbai:\n\n[\\(photo taken by author\\)](https://preview.redd.it/z2ppv22gf10b1.jpg?width=1020&format=pjpg&auto=webp&v=enabled&s=5a513dfb9d7e20b5801eff6153e993063a33931b)\n\nI'd read that as मँक्डोनल्डस् with a virama on the स to prevent \"McDonalds\" from being read as \"McDonaldsa\". But as I understand it, you only need that for Sanskrit, not modern Hindi or Marathi. Is that right?\n\nIf so, I imagine somebody from McDonand's Corp. called up a professor of Oriental Studies at a western university when they needed a transliteration, rather than asking anybody in India, which would be mildly amusing...",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 4,
    "created_utc": 1684176243.0,
    "convurl": "https://b.thumbs.redditmedia.com/elfo5sqnzhHURl587A7aIFNDhMmztgyObhPz9L5eNLs.jpg",
    "comments": [
        "Since the word MacDonalds does end in a consonant, using the virama/halanta symbol is not strictly speaking incorrect. &nbsp; Hindi, the major langauge that employes the Devanagari script has near-universal final schwa deletion but not all Indo-aryan languages do. &nbsp; To be clear I'm not sayinf no other Indo-aryan langauge has final schwa deletion, just that they're not as extensive as in Hindi. &nbsp; And I'm not sure to what extent schwa deletion exists in Marathi specifically. &nbsp; So whether including that halanta is necessary to avoid mispronunciation is debatable. &nbsp; However, if halanta was the way they were going, they should have added a halanta under ड too: मॅक्डोनल्ड्स् .\n\nAlso, I'm pretty sure any competent professor of Oriental studies would be aware of schwa deletion.",
        ">Also, I'm pretty sure any competent professor of Oriental studies would be aware of schwa deletion.\n\n:)  Sure, I was imagining someone being telephoned and not knowing the context. \"Translate 'McDonald's' into Sanskrit...\"\n\n>Hindi, the major langauge that employes the Devanagari script has near-universal final schwa deletion but not all Indo-aryan languages do.\n\nThen I guess they were just being careful. That makes sense.",
        "In general, Hindi has Schwa deletion, so in many cases the halanta is optional. But it’s not wrong, because Devanagari is also used to write Sanskrit, and Hindi inherits the halanta and its rules as well.\n\nAlso: it’s worth remembering Hindi/Hindustani is a dialect continuum with many dialects, so there isn’t just “one” way Hindi is spoken. Devanagari as a writing system has to work for everyone.\n\nIn fact, Hindi retains Schwa in a small but significant set of cases, eg many dialects will say Krishna not Krishn. If anything some dialects  may *insert* a Schwa and make it Krishan. So Schwa deletion isn’t a uniform rule for the Hindi dialect continuum — in fact it’s quite a complex set of rules! But of course it’s quite common to remove the Schwa of the last character.\n\nBut in *this* particular case, there’s another, better, reason as well. The end characters (ल्डस्) should really be **triple-conjoined** to make the “donaLDS” sound, but that’d be hard to type and read (can you actually type that easily? I don’t know!)\n\nThis is more of a problem with borrowed words from other languages.\n\nTechnically, if you knew nothing about the strange foreign word called McDonalds, ल्डस could also be pronounced like like LD-joined, followed by S (ie, McDonald-us). Compare another English word ending in -s … इन्डियन्स vs इन्डियनस (Indians vs Indian-us)\n\nSo ल्डस् is a good compromise, and if I remember right, for triple-conjoined sounds like this, the halanta is “proper” Hindi.\n\nPS. डॉनल्ड might have been better than डोन…, but I guess McDs was okay with डो."
    ],
    "cleaned_text": "wrong virama end word transliterated english saw last week mumbai photo taken authorhttpspreviewredditzppvgfbjpgwidthformatpjpgautowebpvenabledsadfbdebeffeab id read virama prevent mcdonalds read mcdonaldsa understand need sanskrit modern hindi marathi right imagine somebody mcdonands corp called professor oriental studies western university needed transliteration rather asking anybody india would mildly amusing ",
    "cleaned_title": "wrong virama end word transliterated english",
    "cleaned_selftext": "saw last week mumbai photo taken authorhttpspreviewredditzppvgfbjpgwidthformatpjpgautowebpvenabledsadfbdebeffeab id read virama prevent mcdonalds read mcdonaldsa understand need sanskrit modern hindi marathi right imagine somebody mcdonands corp called professor oriental studies western university needed transliteration rather asking anybody india would mildly amusing",
    "cleaned_comments": "since word macdonalds end consonant using viramahalanta symbol strictly speaking incorrect nbsp hindi major langauge employes devanagari script nearuniversal final schwa deletion indoaryan languages nbsp clear im sayinf indoaryan langauge final schwa deletion theyre extensive hindi nbsp im sure extent schwa deletion exists marathi specifically nbsp whether including halanta necessary avoid mispronunciation debatable nbsp however halanta way going added halanta also im pretty sure competent professor oriental studies would aware schwa deletion also im pretty sure competent professor oriental studies would aware schwa deletion sure imagining someone telephoned knowing context translate mcdonalds sanskrit hindi major langauge employes devanagari script nearuniversal final schwa deletion indoaryan languages guess careful makes sense general hindi schwa deletion many cases halanta optional wrong devanagari also used write sanskrit hindi inherits halanta rules well also worth remembering hindihindustani dialect continuum many dialects isnt one way hindi spoken devanagari writing system work everyone fact hindi retains schwa small significant set cases eg many dialects say krishna krishn anything dialects may insert schwa make krishan schwa deletion isnt uniform rule hindi dialect continuum fact quite complex set rules course quite common remove schwa last character particular case theres another better reason well end characters really tripleconjoined make donalds sound thatd hard type read actually type easily dont know problem borrowed words languages technically knew nothing strange foreign word called mcdonalds could also pronounced like like ldjoined followed ie mcdonaldus compare another english word ending vs indians vs indianus good compromise remember right tripleconjoined sounds like halanta proper hindi ps might better guess mcds okay",
    "light_cleaned_title": "Is this wrong? (Virama at the end of a word transliterated from English)",
    "light_cleaned_selftext": "I saw this last week in Mumbai: [\\(photo taken by author\\)](https://preview.redd.it/z2ppv22gf10b1.jpg?width=1020&format=pjpg&auto=webp&v=enabled&s=5a513dfb9d7e20b5801eff6153e993063a33931b) I'd read that as मँक्डोनल्डस् with a virama on the स to prevent \"McDonalds\" from being read as \"McDonaldsa\". But as I understand it, you only need that for Sanskrit, not modern Hindi or Marathi. Is that right? If so, I imagine somebody from McDonand's Corp. called up a professor of Oriental Studies at a western university when they needed a transliteration, rather than asking anybody in India, which would be mildly amusing...",
    "light_cleaned_comments": "Since the word MacDonalds does end in a consonant, using the virama/halanta symbol is not strictly speaking incorrect. &nbsp; Hindi, the major langauge that employes the Devanagari script has near-universal final schwa deletion but not all Indo-aryan languages do. &nbsp; To be clear I'm not sayinf no other Indo-aryan langauge has final schwa deletion, just that they're not as extensive as in Hindi. &nbsp; And I'm not sure to what extent schwa deletion exists in Marathi specifically. &nbsp; So whether including that halanta is necessary to avoid mispronunciation is debatable. &nbsp; However, if halanta was the way they were going, they should have added a halanta under ड too: मॅक्डोनल्ड्स् . Also, I'm pretty sure any competent professor of Oriental studies would be aware of schwa deletion. >Also, I'm pretty sure any competent professor of Oriental studies would be aware of schwa deletion. :) Sure, I was imagining someone being telephoned and not knowing the context. \"Translate 'McDonald's' into Sanskrit...\" >Hindi, the major langauge that employes the Devanagari script has near-universal final schwa deletion but not all Indo-aryan languages do. Then I guess they were just being careful. That makes sense. In general, Hindi has Schwa deletion, so in many cases the halanta is optional. But it’s not wrong, because Devanagari is also used to write Sanskrit, and Hindi inherits the halanta and its rules as well. Also: it’s worth remembering Hindi/Hindustani is a dialect continuum with many dialects, so there isn’t just “one” way Hindi is spoken. Devanagari as a writing system has to work for everyone. In fact, Hindi retains Schwa in a small but significant set of cases, eg many dialects will say Krishna not Krishn. If anything some dialects may *insert* a Schwa and make it Krishan. So Schwa deletion isn’t a uniform rule for the Hindi dialect continuum — in fact it’s quite a complex set of rules! But of course it’s quite common to remove the Schwa of the last character. But in *this* particular case, there’s another, better, reason as well. The end characters (ल्डस्) should really be **triple-conjoined** to make the “donaLDS” sound, but that’d be hard to type and read (can you actually type that easily? I don’t know!) This is more of a problem with borrowed words from other languages. Technically, if you knew nothing about the strange foreign word called McDonalds, ल्डस could also be pronounced like like LD-joined, followed by S (ie, McDonald-us). Compare another English word ending in -s … इन्डियन्स vs इन्डियनस (Indians vs Indian-us) So ल्डस् is a good compromise, and if I remember right, for triple-conjoined sounds like this, the halanta is “proper” Hindi. PS. डॉनल्ड might have been better than डोन…, but I guess McDs was okay with डो."
}