{
    "id": "1ckpwb5",
    "title": "The impunity with which state can carry these atrocities should put everyone to share ",
    "url": "https://behanbox.com/2024/04/18/those-killed-include-innocents-say-adivasis-of-recent-anti-naxal-operation-in-bastar/",
    "selftext": " Heart wrenching read but do read \n",
    "flair": "Crime",
    "score": 18,
    "num_comments": 6,
    "created_utc": 1714911223.0,
    "convurl": "https://external-preview.redd.it/SxaC96ShymCXabrWAgTVJ0mq2ZwVoXf6RKQek7MgXJ8.jpg?auto=webp&s=a13c58328ab8b1b283a5c34003bfb77b22da529d",
    "comments": [
        "Yes, it's important to read and it's equally important to feel ashamed that a lot of us are directly and indirectly contributing to this situation. First the Indian State and its oppressor caste bureaucrat-comprador capitalist and big landlord ruling classes sell off the land and its resources that rightfully belong to the Adivasi peoples to domestic and international corporations, the latter of whom would destroy the environment and ecology of these lands by undertaking extractive industrial processes such as mining. In order to have complete control over this land, the Indian State and its uniformed thugs in the police and army force the Adivasi peoples to abandon the land that their ancestors had communally owned for centuries, leading the Adivasi masses to experience high levels of poverty and malnutrition as they don't have the possession over the land that their ancestors used to sustain themselves. And when the Communist Party of India (Maoist) comes forth with a revolutionary program that talks of land redistribution and the abolishment of semi-feudal relations of production, it's natural for the Adivasi peoples to exercise their agency and join the Party or the People's Army to seek justice for themselves and their families, besides being the part of the force that fights for the collective liberation of everyone in this country. \n\nBut the Indian State and its oppressor caste bureaucrat-comprador capitalist and big landlord ruling classes, following the dictates of their imperialist masters in Washington and London, have no qualms about gunning down any opposition to their respective money making machine - even if it means the murdering of innocents that have nothing to do with the Party and the People's Army. Unfortunately for the Indian State and its assortment of profit hungry reactionaries, the murdering of innocents shall inspire more and more Adivasi peoples and other marginalised sections of the toiling masses to join with the New Democratic Revolution, to the point where destruction of the Indian State is a question of when and not a question of if.",
        "**This is very sad.**",
        "> fortnight before polling in Bastar, security forces killed 13 persons in what it called the biggest anti-Naxal operation since 2017. But at least two of those were Adivasi villagers, one of them a young deaf girl\n\nHeart breaking brutality and silence of mainstream media"
    ],
    "cleaned_text": "impunity state carry atrocities put everyone share heart wrenching read read ",
    "cleaned_title": "impunity state carry atrocities put everyone share",
    "cleaned_selftext": "heart wrenching read read",
    "cleaned_comments": "yes important read equally important feel ashamed lot us directly indirectly contributing situation first indian state oppressor caste bureaucratcomprador capitalist big landlord ruling classes sell land resources rightfully belong adivasi peoples domestic international corporations latter would destroy environment ecology lands undertaking extractive industrial processes mining order complete control land indian state uniformed thugs police army force adivasi peoples abandon land ancestors communally owned centuries leading adivasi masses experience high levels poverty malnutrition dont possession land ancestors used sustain communist party india maoist comes forth revolutionary program talks land redistribution abolishment semifeudal relations production natural adivasi peoples exercise agency join party peoples army seek justice families besides part force fights collective liberation everyone country indian state oppressor caste bureaucratcomprador capitalist big landlord ruling classes following dictates imperialist masters washington london qualms gunning opposition respective money making machine even means murdering innocents nothing party peoples army unfortunately indian state assortment profit hungry reactionaries murdering innocents shall inspire adivasi peoples marginalised sections toiling masses join new democratic revolution point destruction indian state question question sad fortnight polling bastar security forces killed persons called biggest antinaxal operation since least two adivasi villagers one young deaf girl heart breaking brutality silence mainstream media",
    "light_cleaned_title": "The impunity with which state can carry these atrocities should put everyone to share",
    "light_cleaned_selftext": "Heart wrenching read but do read",
    "light_cleaned_comments": "Yes, it's important to read and it's equally important to feel ashamed that a lot of us are directly and indirectly contributing to this situation. First the Indian State and its oppressor caste bureaucrat-comprador capitalist and big landlord ruling classes sell off the land and its resources that rightfully belong to the Adivasi peoples to domestic and international corporations, the latter of whom would destroy the environment and ecology of these lands by undertaking extractive industrial processes such as mining. In order to have complete control over this land, the Indian State and its uniformed thugs in the police and army force the Adivasi peoples to abandon the land that their ancestors had communally owned for centuries, leading the Adivasi masses to experience high levels of poverty and malnutrition as they don't have the possession over the land that their ancestors used to sustain themselves. And when the Communist Party of India (Maoist) comes forth with a revolutionary program that talks of land redistribution and the abolishment of semi-feudal relations of production, it's natural for the Adivasi peoples to exercise their agency and join the Party or the People's Army to seek justice for themselves and their families, besides being the part of the force that fights for the collective liberation of everyone in this country. But the Indian State and its oppressor caste bureaucrat-comprador capitalist and big landlord ruling classes, following the dictates of their imperialist masters in Washington and London, have no qualms about gunning down any opposition to their respective money making machine - even if it means the murdering of innocents that have nothing to do with the Party and the People's Army. Unfortunately for the Indian State and its assortment of profit hungry reactionaries, the murdering of innocents shall inspire more and more Adivasi peoples and other marginalised sections of the toiling masses to join with the New Democratic Revolution, to the point where destruction of the Indian State is a question of when and not a question of if. **This is very sad.** > fortnight before polling in Bastar, security forces killed 13 persons in what it called the biggest anti-Naxal operation since 2017. But at least two of those were Adivasi villagers, one of them a young deaf girl Heart breaking brutality and silence of mainstream media"
}