{
    "id": "16i6rku",
    "title": "INDIA to start seat-sharing talks in states sans uniform formula; caste census high on agenda",
    "url": "https://indianexpress.com/article/political-pulse/india-bloc-seat-sharing-states-sans-uniform-formula-caste-census-high-on-agenda-8938864/",
    "selftext": "Oppn bloc panel authorises their 'sub-group on media to decide upon the names of the anchors on whose shows none of the INDIA parties will send their representatives'",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1694659761.0,
    "convurl": "https://external-preview.redd.it/zEM_F3ZSqLvU_5zZvNfXE-fXsf0hcVYWnYkr4R3xiQ0.jpg?auto=webp&s=fe88ff27fe1473acdede24eab23d69c596867a15",
    "comments": [
        ">Opposition INDIA bloc Wednesday decided to start the difficult process of electoral seat-sharing at the state level without any across-the-board or uniform formula. The disparate parties appeared to be banking on their chemistry to get their arithmetic right.\n\n>The choice of Bhopal as the venue of the bloc’s first rally is interesting given that the parties have not worked out any seat-sharing arrangement for MP so far.\n\n>The Aam Aadmi Party (AAP), one of the alliance members, has already announced its first list of ten candidates for the MP Assembly polls. It is to be seen whether the Congress – a dominant player in MP which is fighting a “do-or-die” battle in a bid to oust the BJP from power – will agree to offer some seats to the AAP, which despite its virtual non-existence in the state is keen to make inroads there. In fact, the situation is the same in another poll-bound state, Chhattisgarh, where the Congress is the incumbent party.\n\n>The parties, however, decided to take up the demand for the caste census in the coming days as a possible counter to the BJP’s Hindutva narrative. The TMC had expressed some reservations on the issue at the alliance’s Mumbai meeting. The joint statement issued Wednesday said “the parties present in the meeting” agreed to take up the caste census issue. Asked about the TMC’s stand over the demand, senior Congress leader K C Venugopal said, “No, those who are present here… decide these things. We are going to talk to them (TMC).”"
    ],
    "cleaned_text": "india start seatsharing talks states sans uniform formula caste census high agenda oppn bloc panel authorises subgroup media decide upon names anchors whose shows none india parties send representatives ",
    "cleaned_title": "india start seatsharing talks states sans uniform formula caste census high agenda",
    "cleaned_selftext": "oppn bloc panel authorises subgroup media decide upon names anchors whose shows none india parties send representatives",
    "cleaned_comments": "opposition india bloc wednesday decided start difficult process electoral seatsharing state level without acrosstheboard uniform formula disparate parties appeared banking chemistry get arithmetic right choice bhopal venue blocs first rally interesting given parties worked seatsharing arrangement mp far aam aadmi party aap one alliance members already announced first list ten candidates mp assembly polls seen whether congress dominant player mp fighting doordie battle bid oust bjp power agree offer seats aap despite virtual nonexistence state keen make inroads fact situation another pollbound state chhattisgarh congress incumbent party parties however decided take demand caste census coming days possible counter bjps hindutva narrative tmc expressed reservations issue alliances mumbai meeting joint statement issued wednesday said parties present meeting agreed take caste census issue asked tmcs stand demand senior congress leader k c venugopal said present decide things going talk tmc",
    "light_cleaned_title": "INDIA to start seat-sharing talks in states sans uniform formula; caste census high on agenda",
    "light_cleaned_selftext": "Oppn bloc panel authorises their 'sub-group on media to decide upon the names of the anchors on whose shows none of the INDIA parties will send their representatives'",
    "light_cleaned_comments": ">Opposition INDIA bloc Wednesday decided to start the difficult process of electoral seat-sharing at the state level without any across-the-board or uniform formula. The disparate parties appeared to be banking on their chemistry to get their arithmetic right. >The choice of Bhopal as the venue of the bloc’s first rally is interesting given that the parties have not worked out any seat-sharing arrangement for MP so far. >The Aam Aadmi Party (AAP), one of the alliance members, has already announced its first list of ten candidates for the MP Assembly polls. It is to be seen whether the Congress – a dominant player in MP which is fighting a “do-or-die” battle in a bid to oust the BJP from power – will agree to offer some seats to the AAP, which despite its virtual non-existence in the state is keen to make inroads there. In fact, the situation is the same in another poll-bound state, Chhattisgarh, where the Congress is the incumbent party. >The parties, however, decided to take up the demand for the caste census in the coming days as a possible counter to the BJP’s Hindutva narrative. The TMC had expressed some reservations on the issue at the alliance’s Mumbai meeting. The joint statement issued Wednesday said “the parties present in the meeting” agreed to take up the caste census issue. Asked about the TMC’s stand over the demand, senior Congress leader K C Venugopal said, “No, those who are present here… decide these things. We are going to talk to them (TMC).”"
}