{
    "id": "17beqsa",
    "title": "Appreciate if you could stop lifting Israel’s balls.",
    "url": "https://www.reddit.com/gallery/17beqsa",
    "selftext": "How low can you be to be meat riding one country who doesn’t even wants anything to do with you. Just because relegion is involved.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697706154.0,
    "convurl": "https://i.redd.it/pcgt2is0k4vb1.jpg",
    "comments": [
        "The Twitter account of this supposed Israeli is suspended .",
        "Why does it looks like that shubham guy is being sarcastic",
        "Which one supposed Israeli are you talking about?",
        "Benjamin Rivlin",
        "Videshiyon ki chaatne me apna ustaad h✌️",
        "First screenshot has both fake accounts. It's an old screenshot from 2 years ago. If you search that username (benjaminrivlin) you'll find a debunking of that, seems both \"shubham tripathi\" and \"benjamin rivlin\" have been made by the same guy. \n\nSecond screenshot also is fake account that was earlier criticising Indian government for farmers protest so is clearly not an israeli account.\n\nAll three of these above are accounts made by Indians or Pakistanis.\n\nThird screenshot woman could be genuine but the Israeli that responded is left-aligned. Considering that it's a reasonable comment from him.",
        "It doesn’t actually."
    ],
    "cleaned_text": "appreciate could stop lifting israels balls low meat riding one country doesnt even wants anything relegion involved ",
    "cleaned_title": "appreciate could stop lifting israels balls",
    "cleaned_selftext": "low meat riding one country doesnt even wants anything relegion involved",
    "cleaned_comments": "twitter account supposed israeli suspended looks like shubham guy sarcastic one supposed israeli talking benjamin rivlin videshiyon ki chaatne apna ustaad h first screenshot fake accounts old screenshot years ago search username benjaminrivlin youll find debunking seems shubham tripathi benjamin rivlin made guy second screenshot also fake account earlier criticising indian government farmers protest clearly israeli account three accounts made indians pakistanis third screenshot woman could genuine israeli responded leftaligned considering reasonable comment doesnt actually",
    "light_cleaned_title": "Appreciate if you could stop lifting Israel’s balls.",
    "light_cleaned_selftext": "How low can you be to be meat riding one country who doesn’t even wants anything to do with you. Just because relegion is involved.",
    "light_cleaned_comments": "The Twitter account of this supposed Israeli is suspended . Why does it looks like that shubham guy is being sarcastic Which one supposed Israeli are you talking about? Benjamin Rivlin Videshiyon ki chaatne me apna ustaad h✌️ First screenshot has both fake accounts. It's an old screenshot from 2 years ago. If you search that username (benjaminrivlin) you'll find a debunking of that, seems both \"shubham tripathi\" and \"benjamin rivlin\" have been made by the same guy. Second screenshot also is fake account that was earlier criticising Indian government for farmers protest so is clearly not an israeli account. All three of these above are accounts made by Indians or Pakistanis. Third screenshot woman could be genuine but the Israeli that responded is left-aligned. Considering that it's a reasonable comment from him. It doesn’t actually."
}