{
    "id": "14txs2b",
    "title": "Is Plazzo Chennai IMAX has Dual Laser 2 projectors?",
    "url": "https://www.reddit.com/r/india/comments/14txs2b/is_plazzo_chennai_imax_has_dual_laser_2_projectors/",
    "selftext": " Best possible way to watch Oppenheimer in Chennai? This article - [https://www.businessinsider.in/advertising/brands/article/imax-triples-its-network-in-india-plans-to-expand-further-to-tier-ii-and-iii-cities/articleshow/74014204.cms](https://www.businessinsider.in/advertising/brands/article/imax-triples-its-network-in-india-plans-to-expand-further-to-tier-ii-and-iii-cities/articleshow/74014204.cms) \\- from business insider is confusing whether Plazzo has DL2 projector or not. Can someone clear this up? Thanks! ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1688803254.0,
    "convurl": "https://external-preview.redd.it/uTq4E5PjIN3psiQYyp1D5T1Hl81ushphpD-gQ-dEanw.jpg?auto=webp&s=9149280ef2b85addee9fab20e1e550530b065a3c",
    "comments": [
        "its a 2K projector, nonetheless. the only 4K IMAX projectors in India are in Delhi and Mumbai, and even so they're LIEMAX and not IMAX film projectors. when you say the best way to watch Oppenheimer i assume you mean the resolution and not the aspect ratio. sure the LIEMAX (IMAX digital/laser) projectors offer a bigger aspect ratio than you're average theater but in the end its not even that big of a difference.\n\ni'll refer to LIEMAX as IMAX and 70mm IMAX film projector as 70mm  here on.\n\nIMAX is just a rip off these days, only a few venues in the world even have the 70mm dome screen size of 5 stories in height. yes you heard it right, a screen as tall as 5 floors. it towers any other screen in comparison by a very humongous margin and can show upto 16K ( though usually its around 8K and we can't really assign a resolution to film stock) footage. it does take a lot electric power to show an movie with an 70mm sequence because of its sheer size, meaning not cost efficient for the theater to show a film with a part 70mm sequence (due to the constraints of the 70mm IMAX camera only a portion of films are shot with that camera, for most films). my point being that the IMAX company had to come with a way to make their products more profitable and not just die out, so they introduced IMAX laser projectors or LIEMAX.\n\nreportedly, Oppenheimer (2023) film stock is 11 miles long and its probably entirely shot with the newly developed IMAX 70mm film cameras, yes, but in the end, all LIEMAX projectors will have to digitalize the film stock to show it using the 'cost effective' laser projectors and by doing that they are in a sense degrading the quality. even the actual height and width of an 70mm frame is trimmed fit in the IMAX frame, and by trim i mean \"cutting\" away massive portions of each frame and being no different from a frame shot using any other digital or film camera.\n\nyou're effectively paying a lot more in an IMAX theater than in any other 'premium' theater like Satyam for effectively the same movies with barely any difference. even if you had the money to go a 70mm IMAX screen in Aussie/canada/US you won't inherently get a totally different, out of the world experience but its still fascinating experience nevertheless. there are a lot of aspects to a better \"viewing experience,\" namely, resolution of the projectors, atmosphere in the theater , screen size and most importantly of prestige (which theaters cash on).\n\n* if you want to see Opp in 4K, go for the pvr laser screen in **VR anna nagar**.according to my knowledge only that screen shows 4K english movies and the rest of the 4K screen don't screen english movies (Sangam i think) and the remaining majority only show 2K.\n* if you want biggest screen size, go for **Satyam, Royapetta**.one of the screen other than Seasons has an absurd amount of seats with balcony, retro style, hence with a lot bigger screen with a 2K projector. baclony is better i suppose anf then there might be heckling (i did face some during a screening of avatar 2 but i doubt it will present for Opp of all movies). there is a chance it might not even screen Opp in the wide screen of theirs since Opp isn't a crowd puller like avatar 2 but check it out i suppose.\n* if its either prestige or a good atmosphere among the crowd of the fellow patrons, then go for any  one of the **Satyam** chains, and yes they're also owned mr monopoly PVR. palazo imax comes under the satyam chain.\n\nin my humble and honest opinion, watching a 4K HDR blu ray remux copy in a 4K HDR tv in the comfort of your home is the best options, no matter what PR bs these corporate firms push.\n\nbut all things considered since you want to watch it now and can't wait for 3 more months from 21st july, its only logically that you go to theater instead, or watch a bootleg version, if your anything like me.",
        "all these \"technical terms\" like shot using IMAX camera, dual laser projector, proprietary sound surround are all PR bs made specially to fool the costumer and make them pay a lot more for a product. IMAX proprietary surround sound is not inherently better than dolby's nor is making the IMAX screen really brighter any better. when a movie says its shot using/filmed for imax film camers (like nolan movies most inception, Nope, No time to die, Catching Fire etc) they shot using the 70mm imax film cameras which is what imax excels at. if the movies says anything other that like filmed for imax (like mcu post infinity war, Dune etc) its just a knock off camera which imax made for marketing ordinary films. they intentionally use these to trick you into buying these fake standards and impart indea of the imax brand the sense of pride that comes with it. they are expensive theaters with no just justification for their prices, a capitalist wet dream.  \n\n\n70mm imax film cameras were invented in the 70s or something, so the technology is not a modern marvel, but what would a technological feat would be a 70mm digital 18K (or more) IMAX which is cheap and easy to use. even if such camera were in the market, most DPs (cinematographer, the guy with authority over the camera) wouldn't choose a large format camera such as IMAX 70mm, may even don't like large formats.  \n\n\ni do see that 70mm, format, resolution, film stock and all these terms are overwhelming for a question about a good to watch Oppenheimer and i'm sorry for that, and i'm all sorry for not explaining everything in detail and typing big ass paras which aren't exactly comprehensible. but do ask question regarding your queries and clarification that you might have. and all also for all the typos, i've a learning disability which sorta is like dyslexia.",
        "Many Thanks!! dude, firstly I read through all passage and didn't felt overwhelmed, I quite like this details (more brain food to me yay). Secondly, I got your point, all IMAX in India are LieMax and I probably prefer P[XL] here after. Finally I am hyped, also taking my parents too to the movie. They are comfortable only with Plazzo in Forum-mall, since they have been there many times. So I booked the tickets for Oppenheimer on Sunday.\n\nA 1.43 IMAX screens needs to be 5 Stories tall? If yes I don't think India will get one in like ever. Thanks! again.",
        "Many Thanks!! dude, firstly I read through all passage and didn't felt overwhelmed, I quite like this details (more brain food to me yay). Secondly, I got your point, all IMAX in India are LieMax and I probably prefer P[XL] here after. Finally I am hyped, also taking my parents too to the movie. They are comfortable only with Plazzo in Forum-mall, since they have been there many times. So I booked the tickets for Oppenheimer on Sunday.\n\nA 1.43 IMAX screens needs to be 5 Stories tall? If yes I don't think India will get one in like ever. Thanks! again.",
        "> yes I don't think India will get one in like ever\n\nIndia does have those tall screens, Prasads in Hyderabad and a science center in Ahmedabad come to my mind rn. Prasads imax only has digital projectors like its peers so it makes no sense to see a 1.43 movie which will be cropped to fit a 1.90  all the while screened in a 1.43 screen. the ahmedabad is not in use i think or it just shows documentary or something i'm not really sure. we just don't have movies shown in 70mm film projector is all. they might even remove all 70mm screens in the world, lets see how nolan will cope with that, if that at all that should ever happen in the future. and yes they need to be atleast around 5 stories tall  \n\n\nhere is comparision  \n[the empire 25 imax is a liemax screen and lincoln sq is 70mm imax screen](https://www.thestreet.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_400/MTY4NjI0MTk1NjEyNjQ5MzY3/image-placeholder-title.webp)  \n\n\nPlazzo isn't a bad choice, i mean PVR couldn't compete with satyam so they just bought it out, i've never gone before though, expect for the phoenix palladium   \n4K lazer imax in Mumbai, which alright but not worth the money at all. i've not tried the PXL screen for myself yet, so i can't give my seal of approval, but if at all i were to go there, i'll let you know.",
        "Prasads IMAX is closed right? anyway thanks! for the reply.\n\nPer your user name you read \"Berserk\"?",
        ">you read \"Berserk\"\n\nyes, i do.  \n\n\nPrasads is functional i suppose, one of my peers from Hyd, exclusively watches in Prasads IMAX , last i heard, he watched nwh there. but stills its a liemax with a comparatively smaller 70mm IMAX screen, but a big ass screen nonetheless.",
        ">prefer P\\[XL\\] here after\n\nnot really sure about that either, to be honest. there are around 7 P\\[XL\\] screens in India and the P\\[XL\\] screen in surat didn't convince me that someone should prefer P\\[XL\\] over LIEMAX or any other 2k theater. LIEMAX is still better than PXL i suppose, as much as i hate to admit it but personally i'd still not prefer LIEMAX."
    ],
    "cleaned_text": "plazzo chennai imax dual laser projectors best possible way watch oppenheimer chennai article httpswwwbusinessinsiderinadvertisingbrandsarticleimaxtriplesitsnetworkinindiaplanstoexpandfurthertotieriiandiiicitiesarticleshowcmshttpswwwbusinessinsiderinadvertisingbrandsarticleimaxtriplesitsnetworkinindiaplanstoexpandfurthertotieriiandiiicitiesarticleshowcms business insider confusing whether plazzo dl projector someone clear thanks ",
    "cleaned_title": "plazzo chennai imax dual laser projectors",
    "cleaned_selftext": "best possible way watch oppenheimer chennai article httpswwwbusinessinsiderinadvertisingbrandsarticleimaxtriplesitsnetworkinindiaplanstoexpandfurthertotieriiandiiicitiesarticleshowcmshttpswwwbusinessinsiderinadvertisingbrandsarticleimaxtriplesitsnetworkinindiaplanstoexpandfurthertotieriiandiiicitiesarticleshowcms business insider confusing whether plazzo dl projector someone clear thanks",
    "cleaned_comments": "k projector nonetheless k imax projectors india delhi mumbai even theyre liemax imax film projectors say best way watch oppenheimer assume mean resolution aspect ratio sure liemax imax digitallaser projectors offer bigger aspect ratio youre average theater end even big difference ill refer liemax imax mm imax film projector mm imax rip days venues world even mm dome screen size stories height yes heard right screen tall floors towers screen comparison humongous margin show upto k though usually around k cant really assign resolution film stock footage take lot electric power show movie mm sequence sheer size meaning cost efficient theater show film part mm sequence due constraints mm imax camera portion films shot camera films point imax company come way make products profitable die introduced imax laser projectors liemax reportedly oppenheimer film stock miles long probably entirely shot newly developed imax mm film cameras yes end liemax projectors digitalize film stock show using cost effective laser projectors sense degrading quality even actual height width mm frame trimmed fit imax frame trim mean cutting away massive portions frame different frame shot using digital film camera youre effectively paying lot imax theater premium theater like satyam effectively movies barely difference even money go mm imax screen aussiecanadaus wont inherently get totally different world experience still fascinating experience nevertheless lot aspects better viewing experience namely resolution projectors atmosphere theater screen size importantly prestige theaters cash want see opp k go pvr laser screen vr anna nagaraccording knowledge screen shows k english movies rest k screen dont screen english movies sangam think remaining majority show k want biggest screen size go satyam royapettaone screen seasons absurd amount seats balcony retro style hence lot bigger screen k projector baclony better suppose anf might heckling face screening avatar doubt present opp movies chance might even screen opp wide screen since opp isnt crowd puller like avatar check suppose either prestige good atmosphere among crowd fellow patrons go one satyam chains yes theyre also owned mr monopoly pvr palazo imax comes satyam chain humble honest opinion watching k hdr blu ray remux copy k hdr tv comfort home best options matter pr bs corporate firms push things considered since want watch cant wait months st july logically go theater instead watch bootleg version anything like technical terms like shot using imax camera dual laser projector proprietary sound surround pr bs made specially fool costumer make pay lot product imax proprietary surround sound inherently better dolbys making imax screen really brighter better movie says shot usingfilmed imax film camers like nolan movies inception nope time die catching fire etc shot using mm imax film cameras imax excels movies says anything like filmed imax like mcu post infinity war dune etc knock camera imax made marketing ordinary films intentionally use trick buying fake standards impart indea imax brand sense pride comes expensive theaters justification prices capitalist wet dream mm imax film cameras invented something technology modern marvel would technological feat would mm digital k imax cheap easy use even camera market dps cinematographer guy authority camera wouldnt choose large format camera imax mm may even dont like large formats see mm format resolution film stock terms overwhelming question good watch oppenheimer im sorry im sorry explaining everything detail typing big ass paras arent exactly comprehensible ask question regarding queries clarification might also typos ive learning disability sorta like dyslexia many thanks dude firstly read passage didnt felt overwhelmed quite like details brain food yay secondly got point imax india liemax probably prefer pxl finally hyped also taking parents movie comfortable plazzo forummall since many times booked tickets oppenheimer sunday imax screens needs stories tall yes dont think india get one like ever thanks many thanks dude firstly read passage didnt felt overwhelmed quite like details brain food yay secondly got point imax india liemax probably prefer pxl finally hyped also taking parents movie comfortable plazzo forummall since many times booked tickets oppenheimer sunday imax screens needs stories tall yes dont think india get one like ever thanks yes dont think india get one like ever india tall screens prasads hyderabad science center ahmedabad come mind rn prasads imax digital projectors like peers makes sense see movie cropped fit screened screen ahmedabad use think shows documentary something im really sure dont movies shown mm film projector might even remove mm screens world lets see nolan cope ever happen future yes need atleast around stories tall comparision empire imax liemax screen lincoln sq mm imax screenhttpswwwthestreetcomimageclimitccssrgbcqautogoodcwmtynjimtknjeynjqmzyimageplaceholdertitlewebp plazzo isnt bad choice mean pvr couldnt compete satyam bought ive never gone though expect phoenix palladium k lazer imax mumbai alright worth money ive tried pxl screen yet cant give seal approval go ill let know prasads imax closed right anyway thanks reply per user name read berserk read berserk yes prasads functional suppose one peers hyd exclusively watches prasads imax last heard watched nwh stills liemax comparatively smaller mm imax screen big ass screen nonetheless prefer pxl really sure either honest around pxl screens india pxl screen surat didnt convince someone prefer pxl liemax k theater liemax still better pxl suppose much hate admit personally id still prefer liemax",
    "light_cleaned_title": "Is Plazzo Chennai IMAX has Dual Laser 2 projectors?",
    "light_cleaned_selftext": "Best possible way to watch Oppenheimer in Chennai? This article - [https://www.businessinsider.in/advertising/brands/article/imax-triples-its-network-in-india-plans-to-expand-further-to-tier-ii-and-iii-cities/articleshow/74014204.cms](https://www.businessinsider.in/advertising/brands/article/imax-triples-its-network-in-india-plans-to-expand-further-to-tier-ii-and-iii-cities/articleshow/74014204.cms) \\- from business insider is confusing whether Plazzo has DL2 projector or not. Can someone clear this up? Thanks!",
    "light_cleaned_comments": "its a 2K projector, nonetheless. the only 4K IMAX projectors in India are in Delhi and Mumbai, and even so they're LIEMAX and not IMAX film projectors. when you say the best way to watch Oppenheimer i assume you mean the resolution and not the aspect ratio. sure the LIEMAX (IMAX digital/laser) projectors offer a bigger aspect ratio than you're average theater but in the end its not even that big of a difference. i'll refer to LIEMAX as IMAX and 70mm IMAX film projector as 70mm here on. IMAX is just a rip off these days, only a few venues in the world even have the 70mm dome screen size of 5 stories in height. yes you heard it right, a screen as tall as 5 floors. it towers any other screen in comparison by a very humongous margin and can show upto 16K ( though usually its around 8K and we can't really assign a resolution to film stock) footage. it does take a lot electric power to show an movie with an 70mm sequence because of its sheer size, meaning not cost efficient for the theater to show a film with a part 70mm sequence (due to the constraints of the 70mm IMAX camera only a portion of films are shot with that camera, for most films). my point being that the IMAX company had to come with a way to make their products more profitable and not just die out, so they introduced IMAX laser projectors or LIEMAX. reportedly, Oppenheimer (2023) film stock is 11 miles long and its probably entirely shot with the newly developed IMAX 70mm film cameras, yes, but in the end, all LIEMAX projectors will have to digitalize the film stock to show it using the 'cost effective' laser projectors and by doing that they are in a sense degrading the quality. even the actual height and width of an 70mm frame is trimmed fit in the IMAX frame, and by trim i mean \"cutting\" away massive portions of each frame and being no different from a frame shot using any other digital or film camera. you're effectively paying a lot more in an IMAX theater than in any other 'premium' theater like Satyam for effectively the same movies with barely any difference. even if you had the money to go a 70mm IMAX screen in Aussie/canada/US you won't inherently get a totally different, out of the world experience but its still fascinating experience nevertheless. there are a lot of aspects to a better \"viewing experience,\" namely, resolution of the projectors, atmosphere in the theater , screen size and most importantly of prestige (which theaters cash on). * if you want to see Opp in 4K, go for the pvr laser screen in **VR anna nagar**.according to my knowledge only that screen shows 4K english movies and the rest of the 4K screen don't screen english movies (Sangam i think) and the remaining majority only show 2K. * if you want biggest screen size, go for **Satyam, Royapetta**.one of the screen other than Seasons has an absurd amount of seats with balcony, retro style, hence with a lot bigger screen with a 2K projector. baclony is better i suppose anf then there might be heckling (i did face some during a screening of avatar 2 but i doubt it will present for Opp of all movies). there is a chance it might not even screen Opp in the wide screen of theirs since Opp isn't a crowd puller like avatar 2 but check it out i suppose. * if its either prestige or a good atmosphere among the crowd of the fellow patrons, then go for any one of the **Satyam** chains, and yes they're also owned mr monopoly PVR. palazo imax comes under the satyam chain. in my humble and honest opinion, watching a 4K HDR blu ray remux copy in a 4K HDR tv in the comfort of your home is the best options, no matter what PR bs these corporate firms push. but all things considered since you want to watch it now and can't wait for 3 more months from 21st july, its only logically that you go to theater instead, or watch a bootleg version, if your anything like me. all these \"technical terms\" like shot using IMAX camera, dual laser projector, proprietary sound surround are all PR bs made specially to fool the costumer and make them pay a lot more for a product. IMAX proprietary surround sound is not inherently better than dolby's nor is making the IMAX screen really brighter any better. when a movie says its shot using/filmed for imax film camers (like nolan movies most inception, Nope, No time to die, Catching Fire etc) they shot using the 70mm imax film cameras which is what imax excels at. if the movies says anything other that like filmed for imax (like mcu post infinity war, Dune etc) its just a knock off camera which imax made for marketing ordinary films. they intentionally use these to trick you into buying these fake standards and impart indea of the imax brand the sense of pride that comes with it. they are expensive theaters with no just justification for their prices, a capitalist wet dream. 70mm imax film cameras were invented in the 70s or something, so the technology is not a modern marvel, but what would a technological feat would be a 70mm digital 18K (or more) IMAX which is cheap and easy to use. even if such camera were in the market, most DPs (cinematographer, the guy with authority over the camera) wouldn't choose a large format camera such as IMAX 70mm, may even don't like large formats. i do see that 70mm, format, resolution, film stock and all these terms are overwhelming for a question about a good to watch Oppenheimer and i'm sorry for that, and i'm all sorry for not explaining everything in detail and typing big ass paras which aren't exactly comprehensible. but do ask question regarding your queries and clarification that you might have. and all also for all the typos, i've a learning disability which sorta is like dyslexia. Many Thanks!! dude, firstly I read through all passage and didn't felt overwhelmed, I quite like this details (more brain food to me yay). Secondly, I got your point, all IMAX in India are LieMax and I probably prefer P[XL] here after. Finally I am hyped, also taking my parents too to the movie. They are comfortable only with Plazzo in Forum-mall, since they have been there many times. So I booked the tickets for Oppenheimer on Sunday. A 1.43 IMAX screens needs to be 5 Stories tall? If yes I don't think India will get one in like ever. Thanks! again. Many Thanks!! dude, firstly I read through all passage and didn't felt overwhelmed, I quite like this details (more brain food to me yay). Secondly, I got your point, all IMAX in India are LieMax and I probably prefer P[XL] here after. Finally I am hyped, also taking my parents too to the movie. They are comfortable only with Plazzo in Forum-mall, since they have been there many times. So I booked the tickets for Oppenheimer on Sunday. A 1.43 IMAX screens needs to be 5 Stories tall? If yes I don't think India will get one in like ever. Thanks! again. > yes I don't think India will get one in like ever India does have those tall screens, Prasads in Hyderabad and a science center in Ahmedabad come to my mind rn. Prasads imax only has digital projectors like its peers so it makes no sense to see a 1.43 movie which will be cropped to fit a 1.90 all the while screened in a 1.43 screen. the ahmedabad is not in use i think or it just shows documentary or something i'm not really sure. we just don't have movies shown in 70mm film projector is all. they might even remove all 70mm screens in the world, lets see how nolan will cope with that, if that at all that should ever happen in the future. and yes they need to be atleast around 5 stories tall here is comparision [the empire 25 imax is a liemax screen and lincoln sq is 70mm imax screen](https://www.thestreet.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_400/MTY4NjI0MTk1NjEyNjQ5MzY3/image-placeholder-title.webp) Plazzo isn't a bad choice, i mean PVR couldn't compete with satyam so they just bought it out, i've never gone before though, expect for the phoenix palladium 4K lazer imax in Mumbai, which alright but not worth the money at all. i've not tried the PXL screen for myself yet, so i can't give my seal of approval, but if at all i were to go there, i'll let you know. Prasads IMAX is closed right? anyway thanks! for the reply. Per your user name you read \"Berserk\"? >you read \"Berserk\" yes, i do. Prasads is functional i suppose, one of my peers from Hyd, exclusively watches in Prasads IMAX , last i heard, he watched nwh there. but stills its a liemax with a comparatively smaller 70mm IMAX screen, but a big ass screen nonetheless. >prefer P\\[XL\\] here after not really sure about that either, to be honest. there are around 7 P\\[XL\\] screens in India and the P\\[XL\\] screen in surat didn't convince me that someone should prefer P\\[XL\\] over LIEMAX or any other 2k theater. LIEMAX is still better than PXL i suppose, as much as i hate to admit it but personally i'd still not prefer LIEMAX."
}