{
    "id": "16pyqfq",
    "title": "Supreme Court acquits 2 death row convicts; says high time to have investigation code for police",
    "url": "https://www.barandbench.com/amp/story/news/supreme-court-acquits-death-row-convicts-murder-case-investigation-code-police",
    "selftext": "It's amazing how the case reached to Supreme Court because even a little questioning by lower courts could have burst the police investigation. SC has really pointed out each and everything that is wrong with police investigations. And now wonder they are asking for investigation code as our police are very incompetent.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695456720.0,
    "convurl": "https://external-preview.redd.it/A0N-2jDmtoNvXoZykqKLCYp_ApcRtc-bGsl4rM6MKbU.jpg?auto=webp&s=b25e8343ba49621baf93acf549bebd062d3cfc6d",
    "comments": [
        "We have CVC/State Vigilance to look into police corruption. We have a police complaint authority who looks into complaints against police. Those two agencies are heavily underfunded. Lower courts rarely question police and senior police officials protect low-level police officers. There are also commissions who look into police behavior, but they do case by case basis and rarely question the entire police department.\n\nWe need to have an agency that looks into police conduct, their promotion/demotion, and training."
    ],
    "cleaned_text": "supreme court acquits death row convicts says high time investigation code police amazing case reached supreme court even little questioning lower courts could burst police investigation sc really pointed everything wrong police investigations wonder asking investigation code police incompetent ",
    "cleaned_title": "supreme court acquits death row convicts says high time investigation code police",
    "cleaned_selftext": "amazing case reached supreme court even little questioning lower courts could burst police investigation sc really pointed everything wrong police investigations wonder asking investigation code police incompetent",
    "cleaned_comments": "cvcstate vigilance look police corruption police complaint authority looks complaints police two agencies heavily underfunded lower courts rarely question police senior police officials protect lowlevel police officers also commissions look police behavior case case basis rarely question entire police department need agency looks police conduct promotiondemotion training",
    "light_cleaned_title": "Supreme Court acquits 2 death row convicts; says high time to have investigation code for police",
    "light_cleaned_selftext": "It's amazing how the case reached to Supreme Court because even a little questioning by lower courts could have burst the police investigation. SC has really pointed out each and everything that is wrong with police investigations. And now wonder they are asking for investigation code as our police are very incompetent.",
    "light_cleaned_comments": "We have CVC/State Vigilance to look into police corruption. We have a police complaint authority who looks into complaints against police. Those two agencies are heavily underfunded. Lower courts rarely question police and senior police officials protect low-level police officers. There are also commissions who look into police behavior, but they do case by case basis and rarely question the entire police department. We need to have an agency that looks into police conduct, their promotion/demotion, and training."
}