{
    "id": "1cs3gdx",
    "title": "UN-Linked Body Defers NHRC India's Accreditation for Second Year Running",
    "url": "https://m.thewire.in/article/rights/un-linked-body-defers-nhrc-indias-accreditation-for-second-year-running",
    "selftext": "This decision was taken on May 1, and could affect India’s ability to vote at the Human Rights Council and some UN General Assembly bodies.",
    "flair": "Law & Courts",
    "score": 17,
    "num_comments": 3,
    "created_utc": 1715721417,
    "convurl": "https://external-preview.redd.it/pWGhl9G8yTn7ufoGxluvLCKBQD0LE6x7E8tRYVrsVwg.jpg?auto=webp&s=1c466799c2aa5cefcf02e1dd6c30b576024970fe",
    "comments": [
        "New Delhi: The Geneva-based United Nations-linked Global Alliance of National Human Rights Institutions (GANHRI), which is “one of the largest human rights networks worldwide”, has deferred granting accreditation to India’s National Human Rights Commission (NHRC) for the second year in a row. \n\nAccording to The Hindu, this decision was taken on May 1 during the meeting of the Sub Committee on Accreditation, and could affect India’s ability to vote at the Human Rights Council and some UN General Assembly bodies.",
        "Okay, let's begin.\n\nConspiracy. \nGeorge Soros.\nLiberal agenda.\nTarnishing India's image. \nModi saved Manipur."
    ],
    "cleaned_text": "unlinked body defers nhrc indias accreditation second year running decision taken may could affect indias ability vote human rights council un general assembly bodies ",
    "cleaned_title": "unlinked body defers nhrc indias accreditation second year running",
    "cleaned_selftext": "decision taken may could affect indias ability vote human rights council un general assembly bodies",
    "cleaned_comments": "new delhi genevabased united nationslinked global alliance national human rights institutions ganhri one largest human rights networks worldwide deferred granting accreditation indias national human rights commission nhrc second year row according hindu decision taken may meeting sub committee accreditation could affect indias ability vote human rights council un general assembly bodies okay lets begin conspiracy george soros liberal agenda tarnishing indias image modi saved manipur",
    "light_cleaned_title": "UN-Linked Body Defers NHRC India's Accreditation for Second Year Running",
    "light_cleaned_selftext": "This decision was taken on May 1, and could affect India’s ability to vote at the Human Rights Council and some UN General Assembly bodies.",
    "light_cleaned_comments": "New Delhi: The Geneva-based United Nations-linked Global Alliance of National Human Rights Institutions (GANHRI), which is “one of the largest human rights networks worldwide”, has deferred granting accreditation to India’s National Human Rights Commission (NHRC) for the second year in a row. According to The Hindu, this decision was taken on May 1 during the meeting of the Sub Committee on Accreditation, and could affect India’s ability to vote at the Human Rights Council and some UN General Assembly bodies. Okay, let's begin. Conspiracy. George Soros. Liberal agenda. Tarnishing India's image. Modi saved Manipur."
}