{
    "id": "1dgbd0h",
    "title": "Amazon return pick up getting canceled without my consent multiple times",
    "url": "https://www.reddit.com/gallery/1dgbd0h",
    "selftext": "I ordered this [dumbbell set](https://amzn.in/d/2u41gy2) of 2 from Amazon on 29th May, 2024. It was delivered on 6th June. I immediately tested them item. One of the dumbbells was in perfect condition. It looked completely new. The other dumbbell however was so dirty and so scratches on it. It also got jammed when I was trying to adjust the weight. I initiated a return on that day was pick up request was created on “Delhivery” by Amazon. The pick up got delayed again and again so I contacted Amazon support and they created a new pick up request. Each new request is getting canceled in the Delhivery app. When I check with Delhivery, they say that the client canceled the pick up. But I never received a call from them. This happened back and forth for multiple pick up requests. Here are screenshots of some of the chat with the Amazon customer team.\n\nI called the Amazon customer service agent today and they created another pick up request on Monday. What are my options to get the refund if the pick up still gets canceled by Delhivery?\n",
    "flair": "Rant / Vent",
    "score": 20,
    "num_comments": 12,
    "created_utc": 1718431619,
    "convurl": "https://i.redd.it/4flhpatgfo6d1.jpg",
    "comments": [
        "First it's a common tactic by pickup guys as they want to avoid more loads.\n\nSecond After 3 consecutive pickups cancelled by the pickup guy, Amazon will initiate the refund of the amount. It's their policy, I got most of the amount refunded using this policy and they will arrange the pickup by themselves. You must arrange pickup by calling Amazon support.\n\nThird and most important: Even if you get the refund amount you should return the product by taking the initiative. Otherwise in your next return OFM or Account specialist will block your account for further order and whatever reason you give they don't reinstate your account.",
        "Yea they mentioned the second point when I called the agent today. But she said since the item has a “high price”, she could not see an option for setting up advance refund. Not sure what to do if even after Monday it is not picked up. Whenever I call Amazon, their response is “Let me create a new pick up request”",
        "National Consumer Helpline - 8800001915 \n\nJust send them a message on whatsapp and express your grievance. They’ll take over. Hope this helps.",
        "Thanks will try this",
        "Tell them you to escalate the matter and talk to the manager.  File a complaint on the consumer forum.",
        "Happening with me as well. Pickup canceled  thrice",
        "The delivery guys at Amazon has lot of discretion. Plus there is close to zero accountability. Worst is they will try to pin it on you",
        "Wait for the pickup to happen if it doesn’t happen, connect with amazon via call talk with them if you’re not satisfied escalate twice then connect with senior team even if they say they will create ror ask them to create a follow up + follow up mail and wait for it, it will be done",
        "Take your item directly to the Amazon warehouse and return in.",
        "Tempting, please keep us updated on what happens in the next episode. 🤟",
        "Happened with me many times. When the final pick up was cancelled, I got the refund automatically. The next morning, the delivery boy came to pick up the product.",
        "I raised a complaint in the consumer helpline. Do you know much time it will take for the complaint to get addressed?",
        "Happened to me. They kept cancelling like 6 times in a row. After that, I chatted with them very agitated and then they refunded me the money and didn't pickup the item as well. win-win lol",
        "I called the customer support agent and spoke to the manager. I got a mail confirming the refund in 2-3 days.",
        "They finally sent a confirmation mail for refund and that the item will be picked up in 3-5 days. But they said that if the pick up is not done, i cannot initiate a pick up again because refund is already provided. Is that true?",
        "that's how you bring it home. \n\ntake that amazon!",
        "They are usually quick, just see for a week, few people got there problem resolved in 2-3 days also.",
        "Hello I'm facing the same issue rn my pickup got cancelled 3 times already and when I call the customer care number they are not answering my call. Can you pls walk me through the process and tell me what to do to get my refund back as idk how all This customer forum work.",
        "Even Iam facing the same problem .already happened with me 3 times . The customer care is each time creating a re auest and there is no proper response from Amazon.how do we get this resolved",
        "Call Amazon customer care and keep asking for someone higher up the chain: https://www.reddit.com/r/india/s/1wgncpxsVU",
        "I have already done that but amazon supervisor is giving the same status and not assisting to resolve the pick up .i will never buy products from amazon after seeing such service levels",
        "Yeah you will have to call them multiple times. It took me days of calls for them to finally resolve the issue",
        "So far I have done about 5 times and they have initiated 3 return requests so far . Not sure what more can I do . Iam even ready to go and give the product back to he courier office . Even that they are not supporting it",
        "3 auto reschedules later they launch a 4 day investigation to get you a refund. It's frustrating as fuck. It's their tactic to avoid giving you a refund. Scummy bastards.",
        "Will they seriously block my account? I just went through hell to finally get the refund. This is my first return in 2 years (8years Amazon customer).",
        "Did your account get blocked?",
        "Nope. Still going strong."
    ],
    "cleaned_text": "amazon return pick getting canceled without consent multiple times ordered dumbbell sethttpsamznindugy amazon th may delivered th june immediately tested item one dumbbells perfect condition looked completely new dumbbell however dirty scratches also got jammed trying adjust weight initiated return day pick request created delhivery amazon pick got delayed contacted amazon support created new pick request new request getting canceled delhivery app check delhivery say client canceled pick never received call happened back forth multiple pick requests screenshots chat amazon customer team called amazon customer service agent today created another pick request monday options get refund pick still gets canceled delhivery ",
    "cleaned_title": "amazon return pick getting canceled without consent multiple times",
    "cleaned_selftext": "ordered dumbbell sethttpsamznindugy amazon th may delivered th june immediately tested item one dumbbells perfect condition looked completely new dumbbell however dirty scratches also got jammed trying adjust weight initiated return day pick request created delhivery amazon pick got delayed contacted amazon support created new pick request new request getting canceled delhivery app check delhivery say client canceled pick never received call happened back forth multiple pick requests screenshots chat amazon customer team called amazon customer service agent today created another pick request monday options get refund pick still gets canceled delhivery",
    "cleaned_comments": "first common tactic pickup guys want avoid loads second consecutive pickups cancelled pickup guy amazon initiate refund amount policy got amount refunded using policy arrange pickup must arrange pickup calling amazon support third important even get refund amount return product taking initiative otherwise next return ofm account specialist block account order whatever reason give dont reinstate account yea mentioned second point called agent today said since item high price could see option setting advance refund sure even monday picked whenever call amazon response let create new pick request national consumer helpline send message whatsapp express grievance theyll take hope helps thanks try tell escalate matter talk manager file complaint consumer forum happening well pickup canceled thrice delivery guys amazon lot discretion plus close zero accountability worst try pin wait pickup happen doesnt happen connect amazon via call talk youre satisfied escalate twice connect senior team even say create ror ask create follow follow mail wait done take item directly amazon warehouse return tempting please keep us updated happens next episode happened many times final pick cancelled got refund automatically next morning delivery boy came pick product raised complaint consumer helpline know much time take complaint get addressed happened kept cancelling like times row chatted agitated refunded money didnt pickup item well winwin lol called customer support agent spoke manager got mail confirming refund days finally sent confirmation mail refund item picked days said pick done initiate pick refund already provided true thats bring home take amazon usually quick see week people got problem resolved days also hello im facing issue rn pickup got cancelled times already call customer care number answering call pls walk process tell get refund back idk customer forum work even iam facing problem already happened times customer care time creating auest proper response amazonhow get resolved call amazon customer care keep asking someone higher chain already done amazon supervisor giving status assisting resolve pick never buy products amazon seeing service levels yeah call multiple times took days calls finally resolve issue far done times initiated return requests far sure iam even ready go give product back courier office even supporting auto reschedules later launch day investigation get refund frustrating fuck tactic avoid giving refund scummy bastards seriously block account went hell finally get refund first return years years amazon customer account get blocked nope still going strong",
    "light_cleaned_title": "Amazon return pick up getting canceled without my consent multiple times",
    "light_cleaned_selftext": "I ordered this [dumbbell set](https://amzn.in/d/2u41gy2) of 2 from Amazon on 29th May, 2024. It was delivered on 6th June. I immediately tested them item. One of the dumbbells was in perfect condition. It looked completely new. The other dumbbell however was so dirty and so scratches on it. It also got jammed when I was trying to adjust the weight. I initiated a return on that day was pick up request was created on “Delhivery” by Amazon. The pick up got delayed again and again so I contacted Amazon support and they created a new pick up request. Each new request is getting canceled in the Delhivery app. When I check with Delhivery, they say that the client canceled the pick up. But I never received a call from them. This happened back and forth for multiple pick up requests. Here are screenshots of some of the chat with the Amazon customer team. I called the Amazon customer service agent today and they created another pick up request on Monday. What are my options to get the refund if the pick up still gets canceled by Delhivery?",
    "light_cleaned_comments": "First it's a common tactic by pickup guys as they want to avoid more loads. Second After 3 consecutive pickups cancelled by the pickup guy, Amazon will initiate the refund of the amount. It's their policy, I got most of the amount refunded using this policy and they will arrange the pickup by themselves. You must arrange pickup by calling Amazon support. Third and most important: Even if you get the refund amount you should return the product by taking the initiative. Otherwise in your next return OFM or Account specialist will block your account for further order and whatever reason you give they don't reinstate your account. Yea they mentioned the second point when I called the agent today. But she said since the item has a “high price”, she could not see an option for setting up advance refund. Not sure what to do if even after Monday it is not picked up. Whenever I call Amazon, their response is “Let me create a new pick up request” National Consumer Helpline - 8800001915 Just send them a message on whatsapp and express your grievance. They’ll take over. Hope this helps. Thanks will try this Tell them you to escalate the matter and talk to the manager. File a complaint on the consumer forum. Happening with me as well. Pickup canceled thrice The delivery guys at Amazon has lot of discretion. Plus there is close to zero accountability. Worst is they will try to pin it on you Wait for the pickup to happen if it doesn’t happen, connect with amazon via call talk with them if you’re not satisfied escalate twice then connect with senior team even if they say they will create ror ask them to create a follow up + follow up mail and wait for it, it will be done Take your item directly to the Amazon warehouse and return in. Tempting, please keep us updated on what happens in the next episode. 🤟 Happened with me many times. When the final pick up was cancelled, I got the refund automatically. The next morning, the delivery boy came to pick up the product. I raised a complaint in the consumer helpline. Do you know much time it will take for the complaint to get addressed? Happened to me. They kept cancelling like 6 times in a row. After that, I chatted with them very agitated and then they refunded me the money and didn't pickup the item as well. win-win lol I called the customer support agent and spoke to the manager. I got a mail confirming the refund in 2-3 days. They finally sent a confirmation mail for refund and that the item will be picked up in 3-5 days. But they said that if the pick up is not done, i cannot initiate a pick up again because refund is already provided. Is that true? that's how you bring it home. take that amazon! They are usually quick, just see for a week, few people got there problem resolved in 2-3 days also. Hello I'm facing the same issue rn my pickup got cancelled 3 times already and when I call the customer care number they are not answering my call. Can you pls walk me through the process and tell me what to do to get my refund back as idk how all This customer forum work. Even Iam facing the same problem .already happened with me 3 times . The customer care is each time creating a re auest and there is no proper response from Amazon.how do we get this resolved Call Amazon customer care and keep asking for someone higher up the chain: I have already done that but amazon supervisor is giving the same status and not assisting to resolve the pick up .i will never buy products from amazon after seeing such service levels Yeah you will have to call them multiple times. It took me days of calls for them to finally resolve the issue So far I have done about 5 times and they have initiated 3 return requests so far . Not sure what more can I do . Iam even ready to go and give the product back to he courier office . Even that they are not supporting it 3 auto reschedules later they launch a 4 day investigation to get you a refund. It's frustrating as fuck. It's their tactic to avoid giving you a refund. Scummy bastards. Will they seriously block my account? I just went through hell to finally get the refund. This is my first return in 2 years (8years Amazon customer). Did your account get blocked? Nope. Still going strong."
}