{
    "id": "18l55h5",
    "title": "came to notice how zomato gives false ratings with bot accounts.",
    "url": "https://www.reddit.com/r/india/comments/18l55h5/came_to_notice_how_zomato_gives_false_ratings/",
    "selftext": "so there was this restaurant i was getting food from, i understand food doesnt have to perfect every time one orders. but it should be at least eatable right? so every time i ordered from this restaurant, the food isnt eatable at all. i see the ratings it says 3.8 or something around that. it fluctuates.\n\nI kinda got so disappointed by the food i ordered yesterday, i just wanted to see what others are getting and how they are reacting. while going through a ton of negative reviews, i found these 2 accounts. here is the [SS](https://ibb.co/YQR4X9J) of 1 account and [the](https://ibb.co/3YYS9gR) other account for the same restaurant where the food is just pathetic.\n\nso basically every review these ppl give is 5 star and they comment on their reviews and also mark helpful to their own review. out of the 97 reviews mentioned in one of the bot account i almost went through 20-25 reviews for the same restaurant in a very periodical manner with 5 stars. (a new 5 star review every ~~2 weeks~~ 4 days or so) its quiet shocking to the very least.\n\nvery unsure about who is behind this. whether the restaurant or zomato itself. since every order tehy give reviews are verified orders, i am not sure how this works. its either to show revenue for their own restuarants or to make sure your restaurant meets some kind of monthly zomato deliveries. and also there isnt any way to report any kinda reviews in zomato let alone bot reviews like these.\n\nhas anyone noticed things like this?",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 3,
    "created_utc": 1702893513.0,
    "convurl": "https://external-preview.redd.it/L03ruA44dZmFkC9cGRa1FdOuQ4s-A9FpZruqXCc4KxM.jpg?auto=webp&s=a7b34dff57acfb0cff70d3e5f52258a5f250fe5b",
    "comments": [
        "It's not just limited to zomato. \n\nAlways trust your gut feeling.",
        "Yupp.  Still disappointing",
        "Unrelated but I had received chicken momos instead of vegetarian momos back in September. I had quit eating non-vegetarian at the start of the year. So, I accidentally ate one of the chicken momos. \n\nContacted zomato support and asked for an honest apology from the management and the restaurant owner. What I received is an apology from customer support over voice call and email. I didn't want any coupon or monetary compensation, I just wanted people to realise their mistake and not take it as a joke. But it didn't happen.\n\nThe lesson I learnt is to stop ordering online. Cannot stop using some packed ingredients like salt, milk, spices etc yet, but I do not order food online and also do not eat outside food. Online delivery of clothes also is a big no for me now. Brain dead people promoting inferior quality clothes and keeping everyone in the matrix. I buy at small cloth shops. \n\nMoral of the story: The world we live in is run on deception and information asymmetry. The level and extent of deception and asymmetry is upto the individual to grasp. As said in the movie matrix: \"No one can tell you how and what this matrix is. You have to find out yourself. Take the red pill and know how deep the rabbit hole is or take the blue and remain content in the ordinary reality.\"\n\nI took the red pill.",
        "Upload this on twitter (X) we will viral this"
    ],
    "cleaned_text": "came notice zomato gives false ratings bot accounts restaurant getting food understand food doesnt perfect every time one orders least eatable right every time ordered restaurant food isnt eatable see ratings says something around fluctuates kinda got disappointed food ordered yesterday wanted see others getting reacting going ton negative reviews found accounts sshttpsibbcoyqrxj account thehttpsibbcoyysgr account restaurant food pathetic basically every review ppl give star comment reviews also mark helpful review reviews mentioned one bot account almost went reviews restaurant periodical manner stars new star review every weeks days quiet shocking least unsure behind whether restaurant zomato since every order tehy give reviews verified orders sure works either show revenue restuarants make sure restaurant meets kind monthly zomato deliveries also isnt way report kinda reviews zomato let alone bot reviews like anyone noticed things like ",
    "cleaned_title": "came notice zomato gives false ratings bot accounts",
    "cleaned_selftext": "restaurant getting food understand food doesnt perfect every time one orders least eatable right every time ordered restaurant food isnt eatable see ratings says something around fluctuates kinda got disappointed food ordered yesterday wanted see others getting reacting going ton negative reviews found accounts sshttpsibbcoyqrxj account thehttpsibbcoyysgr account restaurant food pathetic basically every review ppl give star comment reviews also mark helpful review reviews mentioned one bot account almost went reviews restaurant periodical manner stars new star review every weeks days quiet shocking least unsure behind whether restaurant zomato since every order tehy give reviews verified orders sure works either show revenue restuarants make sure restaurant meets kind monthly zomato deliveries also isnt way report kinda reviews zomato let alone bot reviews like anyone noticed things like",
    "cleaned_comments": "limited zomato always trust gut feeling yupp still disappointing unrelated received chicken momos instead vegetarian momos back september quit eating nonvegetarian start year accidentally ate one chicken momos contacted zomato support asked honest apology management restaurant owner received apology customer support voice call email didnt want coupon monetary compensation wanted people realise mistake take joke didnt happen lesson learnt stop ordering online stop using packed ingredients like salt milk spices etc yet order food online also eat outside food online delivery clothes also big brain dead people promoting inferior quality clothes keeping everyone matrix buy small cloth shops moral story world live run deception information asymmetry level extent deception asymmetry upto individual grasp said movie matrix one tell matrix find take red pill know deep rabbit hole take blue remain content ordinary reality took red pill upload twitter x viral",
    "light_cleaned_title": "came to notice how zomato gives false ratings with bot accounts.",
    "light_cleaned_selftext": "so there was this restaurant i was getting food from, i understand food doesnt have to perfect every time one orders. but it should be at least eatable right? so every time i ordered from this restaurant, the food isnt eatable at all. i see the ratings it says 3.8 or something around that. it fluctuates. I kinda got so disappointed by the food i ordered yesterday, i just wanted to see what others are getting and how they are reacting. while going through a ton of negative reviews, i found these 2 accounts. here is the [SS](https://ibb.co/YQR4X9J) of 1 account and [the](https://ibb.co/3YYS9gR) other account for the same restaurant where the food is just pathetic. so basically every review these ppl give is 5 star and they comment on their reviews and also mark helpful to their own review. out of the 97 reviews mentioned in one of the bot account i almost went through 20-25 reviews for the same restaurant in a very periodical manner with 5 stars. (a new 5 star review every ~~2 weeks~~ 4 days or so) its quiet shocking to the very least. very unsure about who is behind this. whether the restaurant or zomato itself. since every order tehy give reviews are verified orders, i am not sure how this works. its either to show revenue for their own restuarants or to make sure your restaurant meets some kind of monthly zomato deliveries. and also there isnt any way to report any kinda reviews in zomato let alone bot reviews like these. has anyone noticed things like this?",
    "light_cleaned_comments": "It's not just limited to zomato. Always trust your gut feeling. Yupp. Still disappointing Unrelated but I had received chicken momos instead of vegetarian momos back in September. I had quit eating non-vegetarian at the start of the year. So, I accidentally ate one of the chicken momos. Contacted zomato support and asked for an honest apology from the management and the restaurant owner. What I received is an apology from customer support over voice call and email. I didn't want any coupon or monetary compensation, I just wanted people to realise their mistake and not take it as a joke. But it didn't happen. The lesson I learnt is to stop ordering online. Cannot stop using some packed ingredients like salt, milk, spices etc yet, but I do not order food online and also do not eat outside food. Online delivery of clothes also is a big no for me now. Brain dead people promoting inferior quality clothes and keeping everyone in the matrix. I buy at small cloth shops. Moral of the story: The world we live in is run on deception and information asymmetry. The level and extent of deception and asymmetry is upto the individual to grasp. As said in the movie matrix: \"No one can tell you how and what this matrix is. You have to find out yourself. Take the red pill and know how deep the rabbit hole is or take the blue and remain content in the ordinary reality.\" I took the red pill. Upload this on twitter (X) we will viral this"
}