{
    "id": "14cn8fh",
    "title": "Help Change a Life: Join Our Fundraising Campaign for Hritik's(a fellow gamer) Hand Transplant Surgery!",
    "url": "https://www.reddit.com/r/india/comments/14cn8fh/help_change_a_life_join_our_fundraising_campaign/",
    "selftext": "Hi folks! I've never done this before, but I wanted to share the story of my friend Hritik from college, who lost both of his hands in a train accident seven years ago. After waiting for so many years, he finally has a life-changing opportunity to undergo a hand transplant surgery. However, the surgery requires around $41,000 (approximately 33 lakh INR), which is very expensive for him. So, we have started a fundraising campaign to raise money for his surgery. I'm not asking you for money here, but if you could please share his story.\n\nHritik has always been a fighter. Despite his accident in the first year of college, he pulled through, excelled academically, and persevered. I'm kindly asking you to please share the story of my best friend and fellow gamer, so he can have a chance at a normal life  \n[https://www.impactguru.com/fundraiser/help-hritik-singh-parihar?fbclid=PAAaYY82pjh\\_--pnPp-BJx-HuFzZA3YMnKL10pxwzXn285PGvCHxa6y5u75Pk](https://www.impactguru.com/fundraiser/help-hritik-singh-parihar?fbclid=PAAaYY82pjh_--pnPp-BJx-HuFzZA3YMnKL10pxwzXn285PGvCHxa6y5u75Pk)",
    "flair": "AskIndia",
    "score": 26,
    "num_comments": 1,
    "created_utc": 1687102149.0,
    "convurl": "https://external-preview.redd.it/cMFUOjE-b9sNTempEOU9nfH1HFMfVu99KyR7E0JtdBY.jpg?auto=webp&v=enabled&s=abf1ab69142523fa94faa7d807865bcf9b644b12",
    "comments": [],
    "cleaned_text": "help change life join fundraising campaign hritiksa fellow gamer hand transplant surgery hi folks ive never done wanted share story friend hritik college lost hands train accident seven years ago waiting many years finally lifechanging opportunity undergo hand transplant surgery however surgery requires around approximately lakh inr expensive started fundraising campaign raise money surgery im asking money could please share story hritik always fighter despite accident first year college pulled excelled academically persevered im kindly asking please share story best friend fellow gamer chance normal life httpswwwimpactgurucomfundraiserhelphritiksinghpariharfbclidpaaayypjhpnppbjxhufzzaymnklpxwzxnpgvchxayupkhttpswwwimpactgurucomfundraiserhelphritiksinghpariharfbclidpaaayypjhpnppbjxhufzzaymnklpxwzxnpgvchxayupk ",
    "cleaned_title": "help change life join fundraising campaign hritiksa fellow gamer hand transplant surgery",
    "cleaned_selftext": "hi folks ive never done wanted share story friend hritik college lost hands train accident seven years ago waiting many years finally lifechanging opportunity undergo hand transplant surgery however surgery requires around approximately lakh inr expensive started fundraising campaign raise money surgery im asking money could please share story hritik always fighter despite accident first year college pulled excelled academically persevered im kindly asking please share story best friend fellow gamer chance normal life httpswwwimpactgurucomfundraiserhelphritiksinghpariharfbclidpaaayypjhpnppbjxhufzzaymnklpxwzxnpgvchxayupkhttpswwwimpactgurucomfundraiserhelphritiksinghpariharfbclidpaaayypjhpnppbjxhufzzaymnklpxwzxnpgvchxayupk",
    "cleaned_comments": "",
    "light_cleaned_title": "Help Change a Life: Join Our Fundraising Campaign for Hritik's(a fellow gamer) Hand Transplant Surgery!",
    "light_cleaned_selftext": "Hi folks! I've never done this before, but I wanted to share the story of my friend Hritik from college, who lost both of his hands in a train accident seven years ago. After waiting for so many years, he finally has a life-changing opportunity to undergo a hand transplant surgery. However, the surgery requires around $41,000 (approximately 33 lakh INR), which is very expensive for him. So, we have started a fundraising campaign to raise money for his surgery. I'm not asking you for money here, but if you could please share his story. Hritik has always been a fighter. Despite his accident in the first year of college, he pulled through, excelled academically, and persevered. I'm kindly asking you to please share the story of my best friend and fellow gamer, so he can have a chance at a normal life [https://www.impactguru.com/fundraiser/help-hritik-singh-parihar?fbclid=PAAaYY82pjh\\_--pnPp-BJx-HuFzZA3YMnKL10pxwzXn285PGvCHxa6y5u75Pk](https://www.impactguru.com/fundraiser/help-hritik-singh-parihar?fbclid=PAAaYY82pjh_--pnPp-BJx-HuFzZA3YMnKL10pxwzXn285PGvCHxa6y5u75Pk)",
    "light_cleaned_comments": ""
}