{
    "id": "1exokrn",
    "title": "Item missing from my order from Amazon, and they would not refund/replace.",
    "url": "https://www.reddit.com/gallery/1exokrn",
    "selftext": " ordered a book and a memory card from Amazon on\n14 Aug. Both were packed in a single box and I recieved\nthe order on 16th Aug. Upon arrival, the box was\ntrumpled and damaged(looked like delivery damage).\nhave included images. There were some openings too\nin on the edges. I got skeptical, but did not pay much\nattention to it, which is my fault. I asked the delivery\nguy to wait for a minute as I check, but I guess he did\nnot listen and did not wait as I took the package inside\n\nUpon opening the package I found that the memory\ncard was missing from the package. I went to look for\nthe delivery guy but he wasnt there. I raised a complaint\non amazon immediately regarding the same and was\nasked to upload the pictures which I did. They asked\nthat it would take 4 days for the complaint to get\nprocessed and for them to complete an 'investigation\nand asked me to come for final update on 21st Aug\n\nToday I contacted the customer service and was told\nthat the order was successfully delivered and they wont\ndo anything about it. I have been an Amazon customer\nfor almost a decade now. And this is the first time such\na thing has happened. I did not do due diligence at the\ntime of delivery as I never had faced any issue before, I\nike amazon for their deliver and customer suppor\n\nThe card was 128GB Samsung microSD card priced at\nRs 1049, ima college kid and used my savings to buy\nthat for my phone and am feeling really frustated at the\nmoment. The other order was my course book which\narrived in an okayish condition apart from the poor\npackaging. What can I do now to possibly get a refund\nor replacement for the same? I am not active on twitter\nand i guess I wont have much time to go through\nconsumer court. As much as this is about Rs 1049 this\nis also about feeling cheated. I would be highly thankful\nfor suggestions..\n\nTL/DR: An order missing from the delivery box, box\narrived in crumbled state. Now amazon is refusing\nreplacement or refund. What to do?",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 13,
    "created_utc": 1724243997,
    "convurl": "https://i.redd.it/p3iuhkoji0kd1.jpg",
    "comments": [
        "Sue them for breach of contract (only if the policies they have mentioned state that they will absolutely compensate for any loss incurred due to negligence from their side or due to failure to deliver order)",
        "Says correct order from fulfillment center. Check what are those. Is that the closest dispatch station to you.\n\nIt could be the main distribution center from where it went to the local neighborhood center. From there it was stolen. Or it was stolen while on delivery.\n\nAsk if if they checked the item was not damaged from the point of collection by the delivery man from the local store and its handover to you. Somebody from the local store could have stolen it.\n\nAsk for proof of investigation with this thing in picture.\n\nAlso, email other amazon email ids if any, apart from customer care.",
        "Consumer court and Twitter is the way to go.",
        "https://x.com/Mush_abd/status/1826303792582693134?t=Ta5UZjuyTBni4vdCBal8Sg&s=19\n\n\nI have made a twitter thread",
        "If you have contacted customer service through email/messages and not through a call, do that. I’m also a long time Amazon user like yourself and I’ve been refunded thrice for missing items whose individual values were below 1000.",
        "Well talk to a lawyer for customer court case",
        "I just had a call, and they provided me with the same update. That they will not be providing any refund or update.",
        "I am a college kid i dont know how and if i could afford a lawyer.",
        "I asked them a proof of investigation and they denied, further when I asked if I could ask for a reinvestigation, they denied it again. They said they have done the ultimate thing and nothing more could be done about it.",
        "lawyer would not charge you for your first meeting kid",
        "If you have the time and energy, you could call them and raise the issue again from the start when you received the damaged package. Try to escalate it to a senior. For the future, if you have the money, get a prime subscription. You’ll be a priority customer for them. And the next time you deal with customer care, call them with the issue asap after you get a package.",
        "I am a prime customer already, I raised the issue as soon as I got the package. I asked to escalate it to a senior desk, but they denied saying that the ticket has been resolved(investigation completed and they can not do anything about it)",
        "Then I doubt anything can be done except take the hit or take it to the consumer court as others have mentioned.",
        "I guess this will be a lesson. I should have checked the packege after seeing its condition, its just that something like this has never happened in a decade that I have used amazon.. should have been more vigilant.",
        "can you give some more info about this, like the procedure to file a complaint in consumer court please?",
        "This is becoming a common occurrence. I received my order yesterday and it had an item missing.  They have initiated an investigation but seeing your verdict i have no hope for it. I'll use my credit card charge back and if they block my account,  so be it. Wouldn't want to use their service after this kind of experience anyway.",
        "I was able to get a refund. I made a tweet and that helped me to connect with the 'leadership' desk. They too initially denied refund, but they said that they were able to make an exception for me for being a long time customer.",
        "Did you chargeback?",
        "Nah. It was a 150/- roll on. Amazon permanently blocks your account,  both retail one and AWS one, after you charge back. I wanted to keep my options open because i live in a small town and there are still products that are unavailable over here locally. I stopped buying high value items though. And i video record every time i unbox a package. I would have charged back if it were something expensive."
    ],
    "cleaned_text": "item missing order amazon would refundreplace ordered book memory card amazon aug packed single box recieved order th aug upon arrival box trumpled damagedlooked like delivery damage included images openings edges got skeptical pay much attention fault asked delivery guy wait minute check guess listen wait took package inside upon opening package found memory card missing package went look delivery guy wasnt raised complaint amazon immediately regarding asked upload pictures asked would take days complaint get processed complete investigation asked come final update st aug today contacted customer service told order successfully delivered wont anything amazon customer almost decade first time thing happened due diligence time delivery never faced issue ike amazon deliver customer suppor card gb samsung microsd card priced rs ima college kid used savings buy phone feeling really frustated moment order course book arrived okayish condition apart poor packaging possibly get refund replacement active twitter guess wont much time go consumer court much rs also feeling cheated would highly thankful suggestions tldr order missing delivery box box arrived crumbled state amazon refusing replacement refund ",
    "cleaned_title": "item missing order amazon would refundreplace",
    "cleaned_selftext": "ordered book memory card amazon aug packed single box recieved order th aug upon arrival box trumpled damagedlooked like delivery damage included images openings edges got skeptical pay much attention fault asked delivery guy wait minute check guess listen wait took package inside upon opening package found memory card missing package went look delivery guy wasnt raised complaint amazon immediately regarding asked upload pictures asked would take days complaint get processed complete investigation asked come final update st aug today contacted customer service told order successfully delivered wont anything amazon customer almost decade first time thing happened due diligence time delivery never faced issue ike amazon deliver customer suppor card gb samsung microsd card priced rs ima college kid used savings buy phone feeling really frustated moment order course book arrived okayish condition apart poor packaging possibly get refund replacement active twitter guess wont much time go consumer court much rs also feeling cheated would highly thankful suggestions tldr order missing delivery box box arrived crumbled state amazon refusing replacement refund",
    "cleaned_comments": "sue breach contract policies mentioned state absolutely compensate loss incurred due negligence side due failure deliver order says correct order fulfillment center check closest dispatch station could main distribution center went local neighborhood center stolen stolen delivery ask checked item damaged point collection delivery man local store handover somebody local store could stolen ask proof investigation thing picture also email amazon email ids apart customer care consumer court twitter way go made twitter thread contacted customer service emailmessages call im also long time amazon user like ive refunded thrice missing items whose individual values well talk lawyer customer court case call provided update providing refund update college kid dont know could afford lawyer asked proof investigation denied asked could ask reinvestigation denied said done ultimate thing nothing could done lawyer would charge first meeting kid time energy could call raise issue start received damaged package try escalate senior future money get prime subscription youll priority customer next time deal customer care call issue asap get package prime customer already raised issue soon got package asked escalate senior desk denied saying ticket resolvedinvestigation completed anything doubt anything done except take hit take consumer court others mentioned guess lesson checked packege seeing condition something like never happened decade used amazon vigilant give info like procedure file complaint consumer court please becoming common occurrence received order yesterday item missing initiated investigation seeing verdict hope ill use credit card charge back block account wouldnt want use service kind experience anyway able get refund made tweet helped connect leadership desk initially denied refund said able make exception long time customer chargeback nah roll amazon permanently blocks account retail one aws one charge back wanted keep options open live small town still products unavailable locally stopped buying high value items though video record every time unbox package would charged back something expensive",
    "light_cleaned_title": "Item missing from my order from Amazon, and they would not refund/replace.",
    "light_cleaned_selftext": "ordered a book and a memory card from Amazon on 14 Aug. Both were packed in a single box and I recieved the order on 16th Aug. Upon arrival, the box was trumpled and damaged(looked like delivery damage). have included images. There were some openings too in on the edges. I got skeptical, but did not pay much attention to it, which is my fault. I asked the delivery guy to wait for a minute as I check, but I guess he did not listen and did not wait as I took the package inside Upon opening the package I found that the memory card was missing from the package. I went to look for the delivery guy but he wasnt there. I raised a complaint on amazon immediately regarding the same and was asked to upload the pictures which I did. They asked that it would take 4 days for the complaint to get processed and for them to complete an 'investigation and asked me to come for final update on 21st Aug Today I contacted the customer service and was told that the order was successfully delivered and they wont do anything about it. I have been an Amazon customer for almost a decade now. And this is the first time such a thing has happened. I did not do due diligence at the time of delivery as I never had faced any issue before, I ike amazon for their deliver and customer suppor The card was 128GB Samsung microSD card priced at Rs 1049, ima college kid and used my savings to buy that for my phone and am feeling really frustated at the moment. The other order was my course book which arrived in an okayish condition apart from the poor packaging. What can I do now to possibly get a refund or replacement for the same? I am not active on twitter and i guess I wont have much time to go through consumer court. As much as this is about Rs 1049 this is also about feeling cheated. I would be highly thankful for suggestions.. TL/DR: An order missing from the delivery box, box arrived in crumbled state. Now amazon is refusing replacement or refund. What to do?",
    "light_cleaned_comments": "Sue them for breach of contract (only if the policies they have mentioned state that they will absolutely compensate for any loss incurred due to negligence from their side or due to failure to deliver order) Says correct order from fulfillment center. Check what are those. Is that the closest dispatch station to you. It could be the main distribution center from where it went to the local neighborhood center. From there it was stolen. Or it was stolen while on delivery. Ask if if they checked the item was not damaged from the point of collection by the delivery man from the local store and its handover to you. Somebody from the local store could have stolen it. Ask for proof of investigation with this thing in picture. Also, email other amazon email ids if any, apart from customer care. Consumer court and Twitter is the way to go. I have made a twitter thread If you have contacted customer service through email/messages and not through a call, do that. I’m also a long time Amazon user like yourself and I’ve been refunded thrice for missing items whose individual values were below 1000. Well talk to a lawyer for customer court case I just had a call, and they provided me with the same update. That they will not be providing any refund or update. I am a college kid i dont know how and if i could afford a lawyer. I asked them a proof of investigation and they denied, further when I asked if I could ask for a reinvestigation, they denied it again. They said they have done the ultimate thing and nothing more could be done about it. lawyer would not charge you for your first meeting kid If you have the time and energy, you could call them and raise the issue again from the start when you received the damaged package. Try to escalate it to a senior. For the future, if you have the money, get a prime subscription. You’ll be a priority customer for them. And the next time you deal with customer care, call them with the issue asap after you get a package. I am a prime customer already, I raised the issue as soon as I got the package. I asked to escalate it to a senior desk, but they denied saying that the ticket has been resolved(investigation completed and they can not do anything about it) Then I doubt anything can be done except take the hit or take it to the consumer court as others have mentioned. I guess this will be a lesson. I should have checked the packege after seeing its condition, its just that something like this has never happened in a decade that I have used amazon.. should have been more vigilant. can you give some more info about this, like the procedure to file a complaint in consumer court please? This is becoming a common occurrence. I received my order yesterday and it had an item missing. They have initiated an investigation but seeing your verdict i have no hope for it. I'll use my credit card charge back and if they block my account, so be it. Wouldn't want to use their service after this kind of experience anyway. I was able to get a refund. I made a tweet and that helped me to connect with the 'leadership' desk. They too initially denied refund, but they said that they were able to make an exception for me for being a long time customer. Did you chargeback? Nah. It was a 150/- roll on. Amazon permanently blocks your account, both retail one and AWS one, after you charge back. I wanted to keep my options open because i live in a small town and there are still products that are unavailable over here locally. I stopped buying high value items though. And i video record every time i unbox a package. I would have charged back if it were something expensive."
}