{
    "id": "1ac51aa",
    "title": "Mumbai Rape Case. Hope the girl gets the justice.",
    "url": "https://m.economictimes.com/news/new-updates/mumbai-woman-reports-alleged-drugging-rape-by-instagram-friend/articleshow/107171960.cms",
    "selftext": "In Mumbai, a 21-year-old woman has reported a distressing incident of suspected drugging and sexual assault by Heetik Shah and his friends she connected with on social media. The Worli police in south Mumbai are currently investigating the incident that occurred on January 13. The victim shared her harrowing experience on Instagram, sparking a discussion on the risks of online interactions and emphasizing the critical importance of safety measures in the digital era.",
    "flair": "Crime",
    "score": 291,
    "num_comments": 46,
    "created_utc": 1706339187.0,
    "convurl": "https://external-preview.redd.it/vS8Rk9MRClY7Zes6RSOV7-H2CjtaszbF6YNGiCNBHQ8.jpg?auto=webp&s=96d1cf47a1201e8e541d620361b9e2610c229be2",
    "comments": [
        "There is no Hope in Hell for rape victims in our India today.",
        "Even after multiple girls have come forward accusing Heetik Shah of being a repeat offender, some people are still doubting the girl, questioning if she’s doing this to malign the accused’s reputation. \n\nShows how our society thinks & the environment we create for the victims who do choose to come forward.",
        "Those people are idiots . I’m from Mumbai and this Heetik shah asshole has no reputation . Just a rich brat who thinks he’s above the law and is a repeat sex offender",
        "9 out of 10 rich Maharashtrians are sexual offenders. People misuse wealth",
        "Yeah agree but the difference is , this dude was known in sobo circles as a sexual offender from as early as middle school . Had been kicked out of school and stuff .everyone knew he was a perv but hung out with him for his money anyway",
        ">some people are still doubting the girl,\n\nTo be honest, this is mostly because of false rape cases. People can no longer trust women by default.\n\nThis case looks quite straight forward. The guy is apparently known to do this.",
        "We gotta take it to the streets and protest till justice is delivered.",
        "There aren't even so many fake rape cases. It's a myth perpetrated by Men's rights activists. In fact, there are way more unreported rape cases that nobody talks about. 🙏",
        "Justice is a joke in India. The guy has powerful connections. Watch this case slowly be swept under the carpet.",
        "Oh fff off Man. \n\nGo to legal advice India. See the amount of post by men who have been falsely accused. May be not false rape case but so many false accusations. \n\nI personally know 4 people whose lives have been destroyed by women marrying and then filing different cases just to take the property away.",
        "Also, I read some horrible comments blaming the victim for going out with a stranger and having drinks with him. Is this how people think? A victim is coming forward to get justice and the first thing people do is point the finger AT HER? Shame.",
        "I understand where you’re coming from but shut the fuck up man. This is NOT THE TIME to cry about the rights of men. Have some fucking respect for the victim. THIS IS ABOUT WOMEN. You’re an embarrassment.",
        "It's crazy that for a huge chunk of people their first instinct is to question the victim rather than the accused. It's the very definition of rape culture.",
        "Trust straight men for making everything about themselves.",
        "Fake rape and false domestic abuse cases aren't the same though",
        "You mentioned some are doubting the girl I gave you the reason why. I never mentioned men's rights.",
        "Are you now going to cry about it? Read the comments first.",
        "True, I meant more about why people are doubting the girl. Not that I agree. \n\nThis case seems pretty clear.",
        "Then don't cry not all men when women say we can't trust men. Because fake cases are recent but real rapes and many such things have been happening since eternity. So yes we don't trust men",
        "I’m from Mumbai too but had never heard of him! Although I’ve heard of the co-accused (the boys who threatened & intimidated the girl). One of them is Raja Dhody’s & Queenie Singh’s son. Just hope justice is delivered to the girl even if it isn’t swift!",
        "No. The victim deserves justice and the perpetrator punishment. \n \nBut people still shouldn't put themselves in potentially very unsafe situations.",
        "There is a difference between victim blaming and bringing up awareness. I hope you understand that.",
        "I saw few messages too. Horrible. Why would they start blaming women here. I understand she let her guard down but that happens to all of us and obviously by mistake. But that doesn’t give right to the guy to rape her or force her. \n\nWhat people don’t understand is often when you question the victim, you are standing in support of rapist. Nobody should go through these kinda loops for justice.",
        "sshh this is not the right place to talk senses. We are a misogynist and cunt and cry baby when we try to talk about being factual.",
        "It's like.. sharing your OTP with scammers and then saying it's not my fault. Definitely the scammers should be caught and charged, but why do people think there's no accountability for being stupid enough to share OTP??",
        "Are you fucking stupid? First we compare women with objects (ants are attracted to unwrapped candy, key and lock wala bullshit, etc) and now we’re comparing giving an OTP to a girl going out for a night out and getting roofied and raped? Bhai, usko sapna aaya tha kya ki normally bahar jaake she’d get assaulted? What sort of comparison is this?",
        "Hope whoever is telling the truth gets justice.",
        "The fact that any random man can turn out to be a rapist is a bigger issue than being stupid.",
        "While I agree that one must not be immediately assumed guilty, there should be a formal investigation conducted against the perpetrators, they deserve to be tried in the court of law and the victim needs to get her justice.",
        "For justice there has to be a public outcry to prevent judiciary and police to take 'Gobar' or bribe and ensure that the common man is watching this case closely.\n\n\nYou won't see public outcry in such cases at Large level like nirbhaya case etc. because the victim is considered responsible for what happened to her by a huge section of Mumbai level middle class as ' Why she took drinks, why she considered safe to go with a internet online stranger etc.etc.'.\n\n\nThe people who are making noise on internet forums don't usually go out and protest and are also  a minority. \n\n\nPolitical parties won't take interest because there is no specific caste/ religious angle to this case.\n\n\nSo at the end victim is on her own until some big lawyer takes this case probono( last mein woh bhi setting hi karte hai )\n\n\n\n\nI really hope this Shah's and dhody get what they deserved .",
        "Hope this isn't another false case",
        "None of the perpetrators is a Marathi, all are gujrati sindi",
        "Not guilty until proven 🥲 we have seen many cases where few girls falsely accused and inocent lost the life hope this is not the same case hope she provides legit evidence",
        "What happened to that bureaucrat son who try to kill his girlfriend nothing, he is enjoying his lavish life and that girl is suffering. This is only 1 month old news we all forget.",
        "Indians are now doing what they do best, blaming victims of sexual assault and rape. I read some comments on Instagram where they said both the guy and the girl in the wrong. I had no idea that a woman drinking alcohol was equivalent to a man being a serial rapist. Love my country and our wonderful Indian Kulcha, instead of doing anything to fix the inherent evil in our society we will blame victims and force them to live in hiding as if the rape was their fault. In a lot of sexual assault and rape cases the accused gets acquitted because it is extremely hard to prove crimes of a sexual nature, and all the MRAs think that means the case was fake. Acquittal does not equate to innocence.",
        "For a reason abroad calls India a rapist county",
        "💯 as inhuman as this night sound to the real victim, the society is so fucked up that this is needed.",
        "'Justice'? \nIn this nation? That too in Maharashtra?",
        "yeah there should be proper and FAIR investigation , to make sure whether the possible wrongdoer is actually guilty or not, AND NOT based on improper evidence and random accusations NOR based on the fact that such cases can be rigged....",
        "I have myself stayed in Pune for several years and I am very well aware what a Marathi with several apartments and land does. Only the working middle class Marathi people are decent and sincere."
    ],
    "cleaned_text": "mumbai rape case hope girl gets justice mumbai yearold woman reported distressing incident suspected drugging sexual assault heetik shah friends connected social media worli police south mumbai currently investigating incident occurred january victim shared harrowing experience instagram sparking discussion risks online interactions emphasizing critical importance safety measures digital era ",
    "cleaned_title": "mumbai rape case hope girl gets justice",
    "cleaned_selftext": "mumbai yearold woman reported distressing incident suspected drugging sexual assault heetik shah friends connected social media worli police south mumbai currently investigating incident occurred january victim shared harrowing experience instagram sparking discussion risks online interactions emphasizing critical importance safety measures digital era",
    "cleaned_comments": "hope hell rape victims india today even multiple girls come forward accusing heetik shah repeat offender people still doubting girl questioning shes malign accuseds reputation shows society thinks environment create victims choose come forward people idiots im mumbai heetik shah asshole reputation rich brat thinks hes law repeat sex offender rich maharashtrians sexual offenders people misuse wealth yeah agree difference dude known sobo circles sexual offender early middle school kicked school stuff everyone knew perv hung money anyway people still doubting girl honest mostly false rape cases people longer trust women default case looks quite straight forward guy apparently known got ta take streets protest till justice delivered arent even many fake rape cases myth perpetrated mens rights activists fact way unreported rape cases nobody talks justice joke india guy powerful connections watch case slowly swept carpet oh fff man go legal advice india see amount post men falsely accused may false rape case many false accusations personally know people whose lives destroyed women marrying filing different cases take property away also read horrible comments blaming victim going stranger drinks people think victim coming forward get justice first thing people point finger shame understand youre coming shut fuck man time cry rights men fucking respect victim women youre embarrassment crazy huge chunk people first instinct question victim rather accused definition rape culture trust straight men making everything fake rape false domestic abuse cases arent though mentioned doubting girl gave reason never mentioned mens rights going cry read comments first true meant people doubting girl agree case seems pretty clear dont cry men women say cant trust men fake cases recent real rapes many things happening since eternity yes dont trust men im mumbai never heard although ive heard coaccused boys threatened intimidated girl one raja dhodys queenie singhs son hope justice delivered girl even isnt swift victim deserves justice perpetrator punishment people still shouldnt put potentially unsafe situations difference victim blaming bringing awareness hope understand saw messages horrible would start blaming women understand let guard happens us obviously mistake doesnt give right guy rape force people dont understand often question victim standing support rapist nobody go kinda loops justice sshh right place talk senses misogynist cunt cry baby try talk factual like sharing otp scammers saying fault definitely scammers caught charged people think theres accountability stupid enough share otp fucking stupid first compare women objects ants attracted unwrapped candy key lock wala bullshit etc comparing giving otp girl going night getting roofied raped bhai usko sapna aaya tha kya ki normally bahar jaake shed get assaulted sort comparison hope whoever telling truth gets justice fact random man turn rapist bigger issue stupid agree one must immediately assumed guilty formal investigation conducted perpetrators deserve tried court law victim needs get justice justice public outcry prevent judiciary police take gobar bribe ensure common man watching case closely wont see public outcry cases large level like nirbhaya case etc victim considered responsible happened huge section mumbai level middle class took drinks considered safe go internet online stranger etcetc people making noise internet forums dont usually go protest also minority political parties wont take interest specific caste religious angle case end victim big lawyer takes case probono last mein woh bhi setting hi karte hai really hope shahs dhody get deserved hope isnt another false case none perpetrators marathi gujrati sindi guilty proven seen many cases girls falsely accused inocent lost life hope case hope provides legit evidence happened bureaucrat son try kill girlfriend nothing enjoying lavish life girl suffering month old news forget indians best blaming victims sexual assault rape read comments instagram said guy girl wrong idea woman drinking alcohol equivalent man serial rapist love country wonderful indian kulcha instead anything fix inherent evil society blame victims force live hiding rape fault lot sexual assault rape cases accused gets acquitted extremely hard prove crimes sexual nature mras think means case fake acquittal equate innocence reason abroad calls india rapist county inhuman night sound real victim society fucked needed justice nation maharashtra yeah proper fair investigation make sure whether possible wrongdoer actually guilty based improper evidence random accusations based fact cases rigged stayed pune several years well aware marathi several apartments land working middle class marathi people decent sincere",
    "light_cleaned_title": "Mumbai Rape Case. Hope the girl gets the justice.",
    "light_cleaned_selftext": "In Mumbai, a 21-year-old woman has reported a distressing incident of suspected drugging and sexual assault by Heetik Shah and his friends she connected with on social media. The Worli police in south Mumbai are currently investigating the incident that occurred on January 13. The victim shared her harrowing experience on Instagram, sparking a discussion on the risks of online interactions and emphasizing the critical importance of safety measures in the digital era.",
    "light_cleaned_comments": "There is no Hope in Hell for rape victims in our India today. Even after multiple girls have come forward accusing Heetik Shah of being a repeat offender, some people are still doubting the girl, questioning if she’s doing this to malign the accused’s reputation. Shows how our society thinks & the environment we create for the victims who do choose to come forward. Those people are idiots . I’m from Mumbai and this Heetik shah asshole has no reputation . Just a rich brat who thinks he’s above the law and is a repeat sex offender 9 out of 10 rich Maharashtrians are sexual offenders. People misuse wealth Yeah agree but the difference is , this dude was known in sobo circles as a sexual offender from as early as middle school . Had been kicked out of school and stuff .everyone knew he was a perv but hung out with him for his money anyway >some people are still doubting the girl, To be honest, this is mostly because of false rape cases. People can no longer trust women by default. This case looks quite straight forward. The guy is apparently known to do this. We gotta take it to the streets and protest till justice is delivered. There aren't even so many fake rape cases. It's a myth perpetrated by Men's rights activists. In fact, there are way more unreported rape cases that nobody talks about. 🙏 Justice is a joke in India. The guy has powerful connections. Watch this case slowly be swept under the carpet. Oh fff off Man. Go to legal advice India. See the amount of post by men who have been falsely accused. May be not false rape case but so many false accusations. I personally know 4 people whose lives have been destroyed by women marrying and then filing different cases just to take the property away. Also, I read some horrible comments blaming the victim for going out with a stranger and having drinks with him. Is this how people think? A victim is coming forward to get justice and the first thing people do is point the finger AT HER? Shame. I understand where you’re coming from but shut the fuck up man. This is NOT THE TIME to cry about the rights of men. Have some fucking respect for the victim. THIS IS ABOUT WOMEN. You’re an embarrassment. It's crazy that for a huge chunk of people their first instinct is to question the victim rather than the accused. It's the very definition of rape culture. Trust straight men for making everything about themselves. Fake rape and false domestic abuse cases aren't the same though You mentioned some are doubting the girl I gave you the reason why. I never mentioned men's rights. Are you now going to cry about it? Read the comments first. True, I meant more about why people are doubting the girl. Not that I agree. This case seems pretty clear. Then don't cry not all men when women say we can't trust men. Because fake cases are recent but real rapes and many such things have been happening since eternity. So yes we don't trust men I’m from Mumbai too but had never heard of him! Although I’ve heard of the co-accused (the boys who threatened & intimidated the girl). One of them is Raja Dhody’s & Queenie Singh’s son. Just hope justice is delivered to the girl even if it isn’t swift! No. The victim deserves justice and the perpetrator punishment. But people still shouldn't put themselves in potentially very unsafe situations. There is a difference between victim blaming and bringing up awareness. I hope you understand that. I saw few messages too. Horrible. Why would they start blaming women here. I understand she let her guard down but that happens to all of us and obviously by mistake. But that doesn’t give right to the guy to rape her or force her. What people don’t understand is often when you question the victim, you are standing in support of rapist. Nobody should go through these kinda loops for justice. sshh this is not the right place to talk senses. We are a misogynist and cunt and cry baby when we try to talk about being factual. It's like.. sharing your OTP with scammers and then saying it's not my fault. Definitely the scammers should be caught and charged, but why do people think there's no accountability for being stupid enough to share OTP?? Are you fucking stupid? First we compare women with objects (ants are attracted to unwrapped candy, key and lock wala bullshit, etc) and now we’re comparing giving an OTP to a girl going out for a night out and getting roofied and raped? Bhai, usko sapna aaya tha kya ki normally bahar jaake she’d get assaulted? What sort of comparison is this? Hope whoever is telling the truth gets justice. The fact that any random man can turn out to be a rapist is a bigger issue than being stupid. While I agree that one must not be immediately assumed guilty, there should be a formal investigation conducted against the perpetrators, they deserve to be tried in the court of law and the victim needs to get her justice. For justice there has to be a public outcry to prevent judiciary and police to take 'Gobar' or bribe and ensure that the common man is watching this case closely. You won't see public outcry in such cases at Large level like nirbhaya case etc. because the victim is considered responsible for what happened to her by a huge section of Mumbai level middle class as ' Why she took drinks, why she considered safe to go with a internet online stranger etc.etc.'. The people who are making noise on internet forums don't usually go out and protest and are also a minority. Political parties won't take interest because there is no specific caste/ religious angle to this case. So at the end victim is on her own until some big lawyer takes this case probono( last mein woh bhi setting hi karte hai ) I really hope this Shah's and dhody get what they deserved . Hope this isn't another false case None of the perpetrators is a Marathi, all are gujrati sindi Not guilty until proven 🥲 we have seen many cases where few girls falsely accused and inocent lost the life hope this is not the same case hope she provides legit evidence What happened to that bureaucrat son who try to kill his girlfriend nothing, he is enjoying his lavish life and that girl is suffering. This is only 1 month old news we all forget. Indians are now doing what they do best, blaming victims of sexual assault and rape. I read some comments on Instagram where they said both the guy and the girl in the wrong. I had no idea that a woman drinking alcohol was equivalent to a man being a serial rapist. Love my country and our wonderful Indian Kulcha, instead of doing anything to fix the inherent evil in our society we will blame victims and force them to live in hiding as if the rape was their fault. In a lot of sexual assault and rape cases the accused gets acquitted because it is extremely hard to prove crimes of a sexual nature, and all the MRAs think that means the case was fake. Acquittal does not equate to innocence. For a reason abroad calls India a rapist county 💯 as inhuman as this night sound to the real victim, the society is so fucked up that this is needed. 'Justice'? In this nation? That too in Maharashtra? yeah there should be proper and FAIR investigation , to make sure whether the possible wrongdoer is actually guilty or not, AND NOT based on improper evidence and random accusations NOR based on the fact that such cases can be rigged.... I have myself stayed in Pune for several years and I am very well aware what a Marathi with several apartments and land does. Only the working middle class Marathi people are decent and sincere."
}