{
    "id": "1hc7r2j",
    "title": "Concern in Govt: Private sector profit at 15-year high but salaries stagnant",
    "url": "https://indianexpress.com/article/business/concern-in-govt-private-sector-profit-at-15-year-high-but-salaries-stagnant-9719816/?ref=hometop_hp",
    "selftext": "Chief Economic Advisor V Anantha Nageswaran referred to the FICCI-Quess report in at least a couple of his addresses in corporate gatherings, and suggested India Inc needs to look within, and probably do something about it.",
    "flair": "Policy/Economy",
    "score": 220,
    "num_comments": 9,
    "created_utc": 1733960966.0,
    "convurl": "https://external-preview.redd.it/N5CEnitaxW8KTg3woKjfr-9gR-jaVrfdvsNIS_uITlM.jpg?auto=webp&s=9f8262dc051c49fabcb080e0aff54f712a75f272",
    "comments": [
        "What shameless people. People have been made to suffer from stagnant salaries and pay cuts, and these people are accepting it now !",
        "https://preview.redd.it/7iv4vrrg7c6e1.jpeg?width=1019&format=pjpg&auto=webp&s=aea99377b56b8ec5f7b605b2b8ec4e392d5ba9d8",
        "Ah the American corporate playbook globalizes.",
        "Isn't this the case with every country, Inflation is way ahead of wages. In UK along with taxes, inflation and COL is also increasing",
        "As a person having to slog all day for chump change, can confirm.",
        "Feeling helpless for u my guy 🥲.",
        "You are right. Doesn’t make this trend less concerning or unfair.",
        "It is different here. The UK has had a stagnant gdp since 15 years and an aging population kept afloat by foreign workers. Even the firms in the UK havent seen extreme gains in profits in last 15 years exceot during the covid wealth transfer. India has however grown 250% in last 15 years. However wages have declined by 10- 50% in white collar jobs after adjusted for inflation and tax. The blue collar jobs were dependent on govt handouts 15 years back but now earn more than white collar folks and are eating their tax money. The corporate orgs are refusing to pay inflation linked wages because they need to keep investors and political parties happy. The education sector never decreases their costs to keep real estate sector happy. Overall common man who pays taxes is bring silently killed in Indua by providing 4th eotkd services after looting his money.",
        "The private sector has its own agenda. Issue is how the government is so fully reliant on the private sector to create jobs and put money in the hands of the working class. Ain’t happening. This is in direct conflict with the private sector’s goal of profit maximisation. The day we all realise this and vote for a government that will take responsibility will be the day we change for the better."
    ],
    "cleaned_text": "concern govt private sector profit year high salaries stagnant chief economic advisor v anantha nageswaran referred ficciquess report least couple addresses corporate gatherings suggested india inc needs look within probably something ",
    "cleaned_title": "concern govt private sector profit year high salaries stagnant",
    "cleaned_selftext": "chief economic advisor v anantha nageswaran referred ficciquess report least couple addresses corporate gatherings suggested india inc needs look within probably something",
    "cleaned_comments": "shameless people people made suffer stagnant salaries pay cuts people accepting ah american corporate playbook globalizes isnt case every country inflation way ahead wages uk along taxes inflation col also increasing person slog day chump change confirm feeling helpless u guy right doesnt make trend less concerning unfair different uk stagnant gdp since years aging population kept afloat foreign workers even firms uk havent seen extreme gains profits last years exceot covid wealth transfer india however grown last years however wages declined white collar jobs adjusted inflation tax blue collar jobs dependent govt handouts years back earn white collar folks eating tax money corporate orgs refusing pay inflation linked wages need keep investors political parties happy education sector never decreases costs keep real estate sector happy overall common man pays taxes bring silently killed indua providing th eotkd services looting money private sector agenda issue government fully reliant private sector create jobs put money hands working class aint happening direct conflict private sectors goal profit maximisation day realise vote government take responsibility day change better",
    "light_cleaned_title": "Concern in Govt: Private sector profit at 15-year high but salaries stagnant",
    "light_cleaned_selftext": "Chief Economic Advisor V Anantha Nageswaran referred to the FICCI-Quess report in at least a couple of his addresses in corporate gatherings, and suggested India Inc needs to look within, and probably do something about it.",
    "light_cleaned_comments": "What shameless people. People have been made to suffer from stagnant salaries and pay cuts, and these people are accepting it now ! Ah the American corporate playbook globalizes. Isn't this the case with every country, Inflation is way ahead of wages. In UK along with taxes, inflation and COL is also increasing As a person having to slog all day for chump change, can confirm. Feeling helpless for u my guy 🥲. You are right. Doesn’t make this trend less concerning or unfair. It is different here. The UK has had a stagnant gdp since 15 years and an aging population kept afloat by foreign workers. Even the firms in the UK havent seen extreme gains in profits in last 15 years exceot during the covid wealth transfer. India has however grown 250% in last 15 years. However wages have declined by 10- 50% in white collar jobs after adjusted for inflation and tax. The blue collar jobs were dependent on govt handouts 15 years back but now earn more than white collar folks and are eating their tax money. The corporate orgs are refusing to pay inflation linked wages because they need to keep investors and political parties happy. The education sector never decreases their costs to keep real estate sector happy. Overall common man who pays taxes is bring silently killed in Indua by providing 4th eotkd services after looting his money. The private sector has its own agenda. Issue is how the government is so fully reliant on the private sector to create jobs and put money in the hands of the working class. Ain’t happening. This is in direct conflict with the private sector’s goal of profit maximisation. The day we all realise this and vote for a government that will take responsibility will be the day we change for the better."
}