{
    "id": "1cwax0j",
    "title": "Minor Who Killed Two With Father's Porsche Granted Bail; Asked To Volunteer With Traffic Police, Write Essay",
    "url": "https://english.jagran.com/india/pune-porsche-accident-minor-killed-two-with-fathers-porsche-granted-bail-court-volunteer-traffic-police-write-essay-10161577",
    "selftext": "Do we need to lower the age bar for criminal proceedings?  ",
    "flair": "Law & Courts",
    "score": 131,
    "num_comments": 8,
    "created_utc": 1716195311.0,
    "convurl": "https://external-preview.redd.it/POhBiD-6a8-zen7-lCXUcvE1hNcg4HHOPs4XQ6MsQf0.jpg?auto=webp&s=972ba473e188b84a625158e0a4aef2cd11fa8cd9",
    "comments": [
        "FYI the minor is 17. So yeah, not that young. He should be in lockup.",
        "Underage driving\n\nNo number plate on the vehicle\n\n2 murders\n\nHow the fuck bail is given to this guy is justice system only for poor people.",
        "Son of some big builder.",
        "Das should be in lock up too for being an irresponsible parent",
        "money practically solves all your problem, if you have social credit (reputation) then you can get away with any crime",
        "There should be some sort of multiplier for Juveniles as they get closer to adulthood starting from 12 years of age.\n\nExample:\n\n17 year olds get 0.9x to 0.95x the punishment of what an adult equivalent will receive.\n\n 0.8x to 0.9x for 16 year olds, 0.7x to 0.8x for 15 year olds and so on"
    ],
    "cleaned_text": "minor killed two fathers porsche granted bail asked volunteer traffic police write essay need lower age bar criminal proceedings ",
    "cleaned_title": "minor killed two fathers porsche granted bail asked volunteer traffic police write essay",
    "cleaned_selftext": "need lower age bar criminal proceedings",
    "cleaned_comments": "fyi minor yeah young lockup underage driving number plate vehicle murders fuck bail given guy justice system poor people son big builder das lock irresponsible parent money practically solves problem social credit reputation get away crime sort multiplier juveniles get closer adulthood starting years age example year olds get x x punishment adult equivalent receive x x year olds x x year olds",
    "light_cleaned_title": "Minor Who Killed Two With Father's Porsche Granted Bail; Asked To Volunteer With Traffic Police, Write Essay",
    "light_cleaned_selftext": "Do we need to lower the age bar for criminal proceedings?",
    "light_cleaned_comments": "FYI the minor is 17. So yeah, not that young. He should be in lockup. Underage driving No number plate on the vehicle 2 murders How the fuck bail is given to this guy is justice system only for poor people. Son of some big builder. Das should be in lock up too for being an irresponsible parent money practically solves all your problem, if you have social credit (reputation) then you can get away with any crime There should be some sort of multiplier for Juveniles as they get closer to adulthood starting from 12 years of age. Example: 17 year olds get 0.9x to 0.95x the punishment of what an adult equivalent will receive. 0.8x to 0.9x for 16 year olds, 0.7x to 0.8x for 15 year olds and so on"
}