{
    "id": "16vynh2",
    "title": "Other ministers should take example of this guy.",
    "url": "https://i.redd.it/ljjc22uvxbrb1.png",
    "selftext": "Especially our PM should consider about the banner remark! ;-)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696052172.0,
    "convurl": "https://i.redd.it/ljjc22uvxbrb1.png",
    "comments": [
        "https://x.com/ANI/status/1707806329916764208?s=20",
        "Counter is closed.",
        "Don't give any politician full credit just for statements related to elections unless we see the actual implementation. They will say anything for votes.",
        "I have robbed your home before but will not rob it again , trust me.",
        "You'd be stupid if you believed this.",
        "Modi meanwhile, Nitin ji, can you put my posters instead?",
        "Nitin Gadkari is one of the rarest politicians I like. His work has been commendable and he is always willing to work rather than wasting time in anything else.",
        "Don't believe it unless its seen on a practical basis. They'll even talk about donating their kidneys during election times.",
        "Irrespective of this being true or not, Gadkari is the only good guy in BJ party.",
        "He's from Nagpur constituency. Does he need to give bribes to win from there? lmao",
        "That is a must, right? After modi came to power, I haven't seen a single BJP poster, where there's isn't a photo of him.",
        "Did he take bribe before? Or is he focusing only on this Lok Sabha?",
        "Atleast he is saying that. Have you heard something like that before? Admire him for his service to the nation.",
        "Kya mast joke mara re baba",
        "Nagpur selects many from opposition parties as well though not in loksabha",
        "As per Nitin Gadkari's election affidavit, he filed ITR stating his total annual income as below\n\n|Financial Year|Income|\n|:-|:-|\n|2013-14|2,66,390|\n|2014-15|6,01,450|\n|2015-16|8,07,300|\n|2016-17|7,65,730|\n|2017-18|6,40,700|\n\nHis declared assets are \\~18 crore and liabilities are 4 crore.\n\nDuring demonetization in 2016, while people were suffering trying to get their money and even marriages had a 2.5 lac bank limit, Nitin Gadkari performed a lavish wedding with an estimated expense that ran into hundreds of crores. Back in 2009, he filed an election affidavit stating total income less than 50k for 2008. He performed an equally lavish wedding for his son at the time.\n\nGuess what, while 85% of the population has income less than 10k/month and a small chunk of salaried folk are being fleeced with taxes like there is no tomorrow, these politicians are having a merry time and preaching to others what they don't practice. \n\nPeople need to stop praising these corrupt politicians just because they said something good during election season.",
        "I want him as the next prime minister",
        "If he keeps on giving such comments, it would be more n more unlikely ;-)",
        "Someone wrote this as a comment: [https://www.reddit.com/r/india/comments/16vynh2/comment/k2u3kvx/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/16vynh2/comment/k2u3kvx/?utm_source=share&utm_medium=web2x&context=3) \n\nMy question to you: What constitutes a good guy? Is it one who openly does not call for beheadings?",
        "Hahaha, in the current scenario maybe yes.\n\nJokes aside, he at least did some good work with his ministry.",
        "So he's admitted he took bribes in the previous elections",
        "Electoral bonds are legal anyways.",
        "A classic example is RTO. One of the most corrupt departments under Ministry of Road Transport & Highways.",
        "Reminder of Gadkari's honesty\n\nhttps://www.firstpost.com/politics/gadkaris-purti-group-gets-murkier-driver-is-director-of-six-companies-499380.html",
        "There will always be income disparity. I am not of the opinion that people should not adopt luxury thinking about people who are suffering. If one can afford luxury in a legal way, he/she is welcome to do that (from my POV).\n\nWhether the income avenue is legal and whether he preaches and practices something different is a completely different question though.",
        " Thotha chana baaje Ghana",
        "Isn't Nithin Gadkaris driver who was very rich ??",
        "Forget BJP, the Covid Certificate had his photo (≧∀≦)",
        "This comment should be on top before OP’s post become WhatsApp forwards.",
        "Meanwhile Nitin Ji “ Scania ki bus doge to chalega”"
    ],
    "cleaned_text": "ministers take example guy especially pm consider banner remark ",
    "cleaned_title": "ministers take example guy",
    "cleaned_selftext": "especially pm consider banner remark",
    "cleaned_comments": "counter closed dont give politician full credit statements related elections unless see actual implementation say anything votes robbed home rob trust youd stupid believed modi meanwhile nitin ji put posters instead nitin gadkari one rarest politicians like work commendable always willing work rather wasting time anything else dont believe unless seen practical basis theyll even talk donating kidneys election times irrespective true gadkari good guy bj party hes nagpur constituency need give bribes win lmao must right modi came power havent seen single bjp poster theres isnt photo take bribe focusing lok sabha atleast saying heard something like admire service nation kya mast joke mara baba nagpur selects many opposition parties well though loksabha per nitin gadkaris election affidavit filed itr stating total annual income financial yearincome declared assets crore liabilities crore demonetization people suffering trying get money even marriages lac bank limit nitin gadkari performed lavish wedding estimated expense ran hundreds crores back filed election affidavit stating total income less k performed equally lavish wedding son time guess population income less kmonth small chunk salaried folk fleeced taxes like tomorrow politicians merry time preaching others dont practice people need stop praising corrupt politicians said something good election season want next prime minister keeps giving comments would n unlikely someone wrote comment httpswwwredditcomrindiacommentsvynhcommentkukvxutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsvynhcommentkukvxutmsourceshareutmmediumwebxcontext question constitutes good guy one openly call beheadings hahaha current scenario maybe yes jokes aside least good work ministry hes admitted took bribes previous elections electoral bonds legal anyways classic example rto one corrupt departments ministry road transport highways reminder gadkaris honesty always income disparity opinion people adopt luxury thinking people suffering one afford luxury legal way heshe welcome pov whether income avenue legal whether preaches practices something different completely different question though thotha chana baaje ghana isnt nithin gadkaris driver rich forget bjp covid certificate photo comment top ops post become whatsapp forwards meanwhile nitin ji scania ki bus doge chalega",
    "light_cleaned_title": "Other ministers should take example of this guy.",
    "light_cleaned_selftext": "Especially our PM should consider about the banner remark! ;-)",
    "light_cleaned_comments": "Counter is closed. Don't give any politician full credit just for statements related to elections unless we see the actual implementation. They will say anything for votes. I have robbed your home before but will not rob it again , trust me. You'd be stupid if you believed this. Modi meanwhile, Nitin ji, can you put my posters instead? Nitin Gadkari is one of the rarest politicians I like. His work has been commendable and he is always willing to work rather than wasting time in anything else. Don't believe it unless its seen on a practical basis. They'll even talk about donating their kidneys during election times. Irrespective of this being true or not, Gadkari is the only good guy in BJ party. He's from Nagpur constituency. Does he need to give bribes to win from there? lmao That is a must, right? After modi came to power, I haven't seen a single BJP poster, where there's isn't a photo of him. Did he take bribe before? Or is he focusing only on this Lok Sabha? Atleast he is saying that. Have you heard something like that before? Admire him for his service to the nation. Kya mast joke mara re baba Nagpur selects many from opposition parties as well though not in loksabha As per Nitin Gadkari's election affidavit, he filed ITR stating his total annual income as below |Financial Year|Income| |:-|:-| |2013-14|2,66,390| |2014-15|6,01,450| |2015-16|8,07,300| |2016-17|7,65,730| |2017-18|6,40,700| His declared assets are \\~18 crore and liabilities are 4 crore. During demonetization in 2016, while people were suffering trying to get their money and even marriages had a 2.5 lac bank limit, Nitin Gadkari performed a lavish wedding with an estimated expense that ran into hundreds of crores. Back in 2009, he filed an election affidavit stating total income less than 50k for 2008. He performed an equally lavish wedding for his son at the time. Guess what, while 85% of the population has income less than 10k/month and a small chunk of salaried folk are being fleeced with taxes like there is no tomorrow, these politicians are having a merry time and preaching to others what they don't practice. People need to stop praising these corrupt politicians just because they said something good during election season. I want him as the next prime minister If he keeps on giving such comments, it would be more n more unlikely ;-) Someone wrote this as a comment: [https://www.reddit.com/r/india/comments/16vynh2/comment/k2u3kvx/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/16vynh2/comment/k2u3kvx/?utm_source=share&utm_medium=web2x&context=3) My question to you: What constitutes a good guy? Is it one who openly does not call for beheadings? Hahaha, in the current scenario maybe yes. Jokes aside, he at least did some good work with his ministry. So he's admitted he took bribes in the previous elections Electoral bonds are legal anyways. A classic example is RTO. One of the most corrupt departments under Ministry of Road Transport & Highways. Reminder of Gadkari's honesty There will always be income disparity. I am not of the opinion that people should not adopt luxury thinking about people who are suffering. If one can afford luxury in a legal way, he/she is welcome to do that (from my POV). Whether the income avenue is legal and whether he preaches and practices something different is a completely different question though. Thotha chana baaje Ghana Isn't Nithin Gadkaris driver who was very rich ?? Forget BJP, the Covid Certificate had his photo (≧∀≦) This comment should be on top before OP’s post become WhatsApp forwards. Meanwhile Nitin Ji “ Scania ki bus doge to chalega”"
}