{
    "id": "15wuqw4",
    "title": "Men Don't Cry Part-2 | Tomato Crisis India ",
    "url": "https://v.redd.it/1igznv58ldjb1",
    "selftext": "Recently, Lallantop had covered vegetable vendor Rameswar in Delhi who was unable to make ends meet, specially due to rising Tomato prices. His story received a lot of attention when he was trying very hard to control his tears on camera. (Original Post attached)\n\nSurprisingly, he recently sat down with Rahul Gandhi for a chat, talking about his struggles and family.\n\nEven though I agree there is definitely a political angle here with RaGa's involvement but I'm happy that his story reached out to the people.\n\nOriginal Post - https://www.reddit.com/r/delhi/comments/15mbdqu/men_dont_cry_tomato_crisis_india_the_lallantop/ \n\nSource : Rahul Gandhi YouTube Channel ( https://youtu.be/kxO2XGgRRF4) ",
    "flair": "Politics",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1692585348.0,
    "convurl": "https://external-preview.redd.it/eTR5cDloMjhsZGpiMU3ch2q2k_6ajrTDP_msGOVUclbrNM9AEfk24Lbz2n4B.png?format=pjpg&auto=webp&s=a12af7cd0cfb39c33f1f30dd85582fce7d691ca8",
    "comments": [],
    "cleaned_text": "men dont cry part tomato crisis india recently lallantop covered vegetable vendor rameswar delhi unable make ends meet specially due rising tomato prices story received lot attention trying hard control tears camera original post attached surprisingly recently sat rahul gandhi chat talking struggles family even though agree definitely political angle ragas involvement im happy story reached people original post source rahul gandhi youtube channel ",
    "cleaned_title": "men dont cry part tomato crisis india",
    "cleaned_selftext": "recently lallantop covered vegetable vendor rameswar delhi unable make ends meet specially due rising tomato prices story received lot attention trying hard control tears camera original post attached surprisingly recently sat rahul gandhi chat talking struggles family even though agree definitely political angle ragas involvement im happy story reached people original post source rahul gandhi youtube channel",
    "cleaned_comments": "",
    "light_cleaned_title": "Men Don't Cry Part-2 | Tomato Crisis India",
    "light_cleaned_selftext": "Recently, Lallantop had covered vegetable vendor Rameswar in Delhi who was unable to make ends meet, specially due to rising Tomato prices. His story received a lot of attention when he was trying very hard to control his tears on camera. (Original Post attached) Surprisingly, he recently sat down with Rahul Gandhi for a chat, talking about his struggles and family. Even though I agree there is definitely a political angle here with RaGa's involvement but I'm happy that his story reached out to the people. Original Post - Source : Rahul Gandhi YouTube Channel (",
    "light_cleaned_comments": ""
}