{
    "id": "179rlst",
    "title": "Same Sex Marriage Live: Supreme Court can't make law, can only interpret it, says CJI on same sex marriage verdict",
    "url": "https://timesofindia.indiatimes.com/india/same-sex-marriage-verdict-live-updates-supreme-court-judgement-special-marriage-act-lgbtqia-cji-chandrachud/liveblog/104482363.cms",
    "selftext": "Choosing life partner is integral part of life however, court cannot make laws it can only interpret it.\n\nCJI has drawn a clear line on basic human rights and limitations of the court.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 156,
    "created_utc": 1697522765.0,
    "convurl": "https://external-preview.redd.it/f8Cm5MZjMZOafzZDOYCgLVPFp7glvHgaf5WAo4fXEiE.jpg?auto=webp&s=17becd4dc1d87c411ee40c2f10f1d042c6e91769",
    "comments": [
        "This is actually a great verdict. I would suggest everyone to read it.",
        "It's like we know that your constitutional right is violated and you are treated as a second class citizen but we will do nothing about it.",
        "tldr: Can't give you marriage status.Will think of giving you certain social benefits of marriage.Goodbye.",
        "No, it's not.",
        "Why is it not?",
        "Because it doesn't change anything.",
        "Because it doesn't give any rights, no adoption rights, no rights for getting the same benefits if you are in a partnership like a married couple. It leaves all these things to parlieament which under BJP and NDA will never do anything.",
        "this is the most shittiest verdict you can think of.He just opened a can of worms that he wont be able to close.",
        "Please read the judgement in entirety and not just the news headlines. The court has struck down discriminatory sections of the Adoption Regulations and allowed Adoption by unmarried couples irrespective of whether heterosexual or homosexual. \n\nThe court has also lead down conditions for the Parliamentary Committee which includes that unions between homosexual couples have the same rights regarding succession, joint finance, Income Tax Benefits, Employer Gratuity, Medical Power of Attorney etc. \n\nIt's upto to the Parliament to lay down the law however the court has provided the judgement that the right to a civil Union is ensured via different sections of the constitution and discrimination based on sex includes sexual orientation. In due time, the parliament will have to recognize these rights for a civil union between homosexual couples.",
        "That's not good then. So him coming out and saying this is useless?\n\n[https://twitter.com/LiveLawIndia/status/1714160712463867939](https://twitter.com/LiveLawIndia/status/1714160712463867939)",
        "so is it just showing \"laal ankh\" to state ?",
        "I think adoption rights are there but apart from that, I cant see much.",
        "Yeah this was the most likely scenario to happen. Parliament has to take over. At least adoption rights are not restricted.\n\nEdit:\n\nSeems adoption is still not on the table. Thanks for the heads-up.",
        "W court 💪🏽",
        "Adoption rights lol, try renting a house as a queer couple with an adopted child.",
        "Whatever the court said isn't it already there? As a society most of us already respect the same sex couples. What was needed was to legalise the marriage. So, I don't think court has done anything extraordinary here.",
        "To people saying it changes nothing, here's why the judgement is very important.\n\nFirst it has put a full stop on police brutality on the same sex relationship.\n\nSecond the judgement has brought the issue to the main course of discussion, i.e. civil rights of same-sex folks. So legislation specific discussions now have a solid foundation. It gives opportunity to pro same-sex legislators ability to pen down bills with technical references. \n\nLaws in democracy don't happen in a day. It happens in stages over a period of time when majority is on the same page. The CJI has treaded the thin rope of civil rights and limitations of SC.",
        "Ok.. What is the ideal judgement.. Please give proper citations to constitutional provisions..",
        "That's really a society problem, not a judicial or even a government problem.",
        ">As a society most of us already respect the same sex couples\n\nThey are very less respected educated people respect them sure but i belive majority Indians dont respect same sex couples hell a lot of them dont respect anyone from lgbtq",
        "Bro if I start to refer you wont be able to understand.This is thing I do for living.Also i teach.\n\nI will explain it a little more.What was asked was marriage equality.Given that it was never possible to recognize that in the first place,He tried to give candies by clearly broadening the ambit of gender identity without much thought.Now the thing  is Indian law is not gender neutral.So when liberal concept of gender identity will be applied to Indian setting this will lead to outcomes which we cant even understand yet.\n\nThink of domestic violence cases,where The dude decides to show GI certificate.Which is easily available.I got one.I am Technically trans under [CJI.Now](https://CJI.Now) can you see the consequences under Indian law if I marry a girl.Can you accuse me of DV???",
        "Installment mai equality milna kab band hogi iss Desh mai ?",
        "Exactly.",
        "Dissapointing verdict but expected, I guess. Hopefully, at least the Parliament will approve same sex marriage in the future soon.",
        "Installment mein bhi nahi mili hai, the verdict has been defeated by 3:2.",
        "Smh",
        "But it won't stop without all three. A change in cultural perceptions and societal acceptance, government legislation to stymie discrimination, and enforcement of the legislation by the courts.",
        "What does it mean? Does it mean as the law is non existent court can't do anything? Is there any law at present which says same sex marriage is illegal? If the government brings such law (once the law becomes existent not matter whether it's for or against the same sex marriage) then can the court change it?",
        "This verdict is so dumb.",
        "That TOI article is empty. [This Bar & Bench article](https://www.barandbench.com/news/supreme-court-says-no-same-sex-marriage-civil-union-cji-civil-unions-same-sex-couples-minority-opinion) has a pretty good summary of the majority & minority opinions of the judgement.\n\nAnd to the people getting upset over the verdict, it would not have been prudent to recognise same sex marriage in the current framework of laws that we have as it would have resulted in chaos. Such a huge undertaking of restructuring the legal framework involving 100s of acts can only be done through parliament. \n\nThe reasoning given is sound as well since recognition of marriage is not a fundamental right. SC has been an ally to the queer movement in its limited capacity \"- Queer persons have the right to choose their own partner and they must be protected to enjoy such rights.\" It is not open to state to oppress or discriminate against queer folks. \n\nAdditionally, future development in this sphere was also suggested by the court \"- Central government shall set up a high-powered committee to undertake study of all relevant factors associated with same-sex marriage.\"",
        "That's why anti discrimination laws are necessary",
        "There's so much difference in people on instagram(comment sections and trolls) and people on reddit. Instagram gave me anxiety issues, and thank god I shifted myself from that negative platform to reddit.",
        "It means that court won't make any law for adding provisions of same sex marriage or making it recognized neither it will make any laws that will recognize their relationship as union with benefits and neither it will make law to allow adoption of kids for homosexual couple.\n\nAll this things are reserved for parliament to work upon and make laws if they feel the right to do so. SC can only ask parliament to make a committee which can think about giving some benefits to same sex couples like joint bank accounts, ration cards, insurance and pension but suggestions of that committee are also on will of parliament to accept or follow.\n\nCurrently there are no provisions which declare same-sex marriage illegal but there are no provisions which recognize it under any marriage act in constitution and court doesn't has the ability to modify or strike down acts in constitution because they are not the body who should do so.",
        "About fucking time. If SC continues to run ramshod and do whatever they want the centre is going to go after them.",
        "People will be upset over this but that is mainly due to them being politically uneducated and not grasping the structure of our judicial & legislative framework. If one expected one ruling to reorient the entire legislative system where all language is binarily gendered, he was being naive. \n\nBut still as you said, this is the best that could have happened.",
        "Bruh what kind of bubble do you live in? Most people actively dislike homosexuality let alone support same sex couples.",
        "I remember reading somewhere that there is a very thin line between caution and cowardice. While SC can't form legislation, it can direct parliament to do so. Anyway. Atleast this provides some precedence against state brutality and opens up some roads to equality.",
        "That too while wearing a sunglass.",
        "Give us rights to bring the landlord to court based on discrimination then",
        "Sanghis oppose it.",
        "Constitution law doesn't allow it.",
        "Username checks out!",
        "True. At this point, I am simply just relying on a little bit of hope lol.",
        ">First it has put a full stop on police brutality on the same sex relationship.\n\nlike How ?",
        "Again purview of legislature.",
        "More like \"we don't marriage is a constitutional right at all, so go ask legislative for your paperwork approval \"",
        "Well the landlord also has the right to determine the use of his private property according to his choices too. So no , a private individuals right to enjoy his own property can't also be curtailed in this manner.",
        "> joint bank accounts, insurance\n\nBoth insurance and bank accounts can be made with any person as nominee/ joint account holder no ? Only pensions and ration card is restricted to legal spouse/family i think .",
        "This.",
        "That's the thing. No constitutional right is being violated here otherwise they would easily interpret it and allowed this.",
        "A good chunk of the incels, sanghis, and those in between these have all left for other subreddits. Legaladviceindia is filled with them. Just like insta and X, of you look for them you can find them here as well.",
        "> First it has put a full stop on police brutality on the same sex relationship.\n\nYes, of course. Our police are well known for following the law and not indulging in any kind of brutality.",
        "Mao Zedong has some great thoughts on landlords",
        "Which constitutional right is being violated? If there was any the SC would have been able to intervene actually.",
        "Thanks for the wonderful explanation. I am bit ignorant about laws. Generally speaking, so the court doesn't have the authority to modify the laws passed by the parliament? Then, what if parliament by sheer power of majority make some regressive bad law? What will the court do in such cases?",
        "Great judgment. This was how it was done in Australia, not via court though. First equal rights in all respects were given to same-sex partners, including inheritance, pensions etc. Then over time the call grew louder and louder, ultimately the gov of the day held a postal plebiscite and majority of Australians supported changing the law. The gov the. Passed law to legalise it.\n\nThis verdict for all practical purpose  should remove discriminations. The implication are enormous, think a soldier dies on battlefield and if they had a same-sex partner the last rites of the body, medals and widow pensions would have to be given to them and not the family. Schools and business would not be able to discriminate same sex couples etc.",
        "Um no, you cannot discriminate even as a private business.",
        "Yes you cannot discriminate but the landlord has the right to decide who should live or not live in their private property.",
        "Nope. The last three judgments went against reading down CARA.",
        "Try renting a house as a \"non-vegetarian\" in Chennai or Bangalore.\n\nLaws can only do so much. The society has to pick up slack somewhere.",
        ">It gives opportunity to pro same-sex legislators ability to pen down bills with technical references.\n\ngenuine question, is there a likelihood of this happening in the near future? my understanding currently is that the court directed the solicitor general to form a committee and the SG... his leanings are pretty well known i think",
        "Thats the tricky part, they cannot decide legally based on what in other countries are called protected attributes like sexuality, race etc. So they won’t give any reason or a different made up reason in practice.",
        "Not nominee but joint bank accounts can be opened only by wife and husband also if I am correct term life insurance is for wife too.",
        "if sanghis opposed it they wouldnt have added Transgender option in government websites which was non existent during Secular rule.aap chronology samjhiye.",
        "> try renting a house as a minority\n\nFTFY",
        "Court can ask to modify or strike down the law if the law violates the fundamentals rights of citizen but right ti marriage isn't a fundamental right according to Constitution so it can't force parliament to make laws.",
        "If the parliament refuses to modify/scrap the law which violates the fundamental rights, what will happen? Can the court remove such law by force?",
        "The majority of J. Bhat, J. Kohli, and J. Narasimha upheld CARA Regulations, namely Reg. 5(3).",
        "Its their official statement that it interferes with sanctity of family value or some other garbage. I am not making it up",
        "If your discussion is on whether the homosexuals can get civil rights or not, it clearly assumes that homosexuality is definately not illegal.",
        "They cannot do anything about it. It's upto the Parliament. But unfortunately, the government is against it. Cannot do anything then",
        "It is the Central Government who opposed it in court.",
        "They have cited it is violative of 19(1)(a) and 21, even the judges who ruled against it acknowledged that it is violative article 21",
        "Try renting a house as Muslim queer person with an adopted child",
        "In Pune and Mumbai too.",
        "I know it's worse. I meant you don't even have to go that far to be discriminated.",
        "Because police fear courts and when courts cite this judgement of SC and IPS ranked officer receives heat from courts when wrongful arrests happens and then this heat is passed on to lower ranks.",
        "India is evolving, just backwards",
        "You are absolutely right ,but they are conservatives/ sanghis / zealots and are  expected to go along these lines ,but the question remains will Congress and Left and So called liberal parties support LGBTQ marriages ? Have you heard them ever take a stance on this",
        "There's talking and then there's doing.\n\nTechnically RSS head talked about how natural homosexuality is. But we all know how that ended UP (RSS supported govt)\n\n\nINC no different. Rajasthan Government in this case, which is a Congress government, had opposed marriage equality as well",
        "In guess you are either living in 70s or watching too many films \n\n1. Any person arrested by police has to be produced in court. So even if the police do not follow the law, a person receives a fair opportunity to represent his case in court. Police fears courts and this judgement gives power to members of lgbtq to represent their case strongly in court. Once a precent is set police will stop arresting people for same sex relationship.\n\n2. The bill is already in the Parliament filed by Supriya Sule. If not today the bill will find majority supporters when it's time will come. That is how democracy works, doesn't matter who is power bills related to popular demand will see light of the day.",
        "Haan toh tu lad elections, hame sahi direction mein leja..",
        "You ever heard of seperate but equal?",
        "Your right to swing a fist ends when someone else's face begins.\n\nYou have no right to persecute. If you wish to participate in a country then you must serve all law-abiding patrons equally.\n\nThat's morality. Not \"my grandpappy stole this land, so gays can't live here becuase I'm a crazy bronze age bigot.\"",
        "You will have to elaborate and write more than 5 6 words for it to make sense.",
        "My man what are you talking about here. I was discussing about whether people can take a landlord to court just for not renting out to specific people. No they cannot because it's his private property. I don't know what are you on about right now. It's not related to anything else but simply you cannot force someone to do what he is not legally bound to do. How hard is that to understand. Yes we as a society have long way to go and it will take time to change the perception of society about things but even then something like this just cannot be enforced.",
        "If any law violates the fundamental right of the citizen then supreme court can scrap it straightaway by force.",
        "Wait, is there a loophole here, if you really wanna get married, you claim Transgender Persons (Protection of Rights) Act, 2019, and (for the record) claim opposite gender and enter the marriage as if it was a regular male-female marriage. I mean, this is not great but if all you really want is to adopt kids / get state-recognition, there is a path way. Why have apprehension of claim trans, if that solves most of the recognition problems.",
        "Yeah it most probably will happen. Either while UCC or after 2024 elections. Nahi to 2050 tak to ho hi jayega.",
        "Off-topic.\n\nWe say separation of powers, checks and balances, etc, but most democracies have a glaring flaw : Legislature overlaps with Executive.\n\nThe NDA is both Legislature and Executive.\n\nThis is not just India, it is literally every democracy everywhere.\n\nSo, we get laws passed which benefit the Executive or associated with the Executive, not benefitting the people.\n\nThis is a huge bug in the system and is also a blind spot for the whole world.\n\nIt is a relic of flawed industrial age democracy and needs to be remedied in the information age.",
        "Possible propaganda for next elections?",
        "Bro lgbt people are just 3% please dont make us more of political thing",
        "Uninstalled insta 2 months ago now i feel 10 times mentally better",
        "Oh but you are forgetting that everything can be turned into a political issue here, it's just how this country works. :(\nSad reality.",
        "As CJI himself mentioned that these cannot be just judicial platitudes. He is very much logically as well as judicially correct when he brings up the issue of all the bouquet of rights that come up with marriage or recognition of a union. For example, during adoption, eventhough unmarried couples are not allowed to adopt, they still have the option to marry and then adopt. The same cannot be done by same sex couples since they don't have the option of marriage. Setting up a \"high level\" committee is just passing on the responsibility to the legislative which is anti-lgbtq. The courts must recognise that eventhough the policies have to come from the legislature, discrimination is being justified because of the majoritarian opinion. The courts in fact agree that there is discrimination happening and yet pass on the ambit of change to the legislature. God knows what will happen.",
        ">Any person arrested by police has to be produced in court. So even if the police do not follow the law, a person receives a fair opportunity to represent his case in court. \n\nTell this to the unnao rape victim whose father was tortured to death by cops in an attempt to get the case against BJ Party MLA withdrawn.",
        "It's not a bug, it's a feature!!\n\nThe separation of powers is not absolute or set in stone. Parliament has judicial functions. The Executive & Judiciary has legislative functions. President has all three! All these overlaps are in limited capacity. Some of these overlapping functions are constitutional, some statutory (conferred by some act), and some are interpreted to be implied. The checks & balances is supposed to be an interplay between these bodies along with the constitutional posts such as CAG, CEC etc. \n\nFirst of all you need to understand is running a civil society of humongous populations without there being a bloodbath in stages of transfer of power is has not been historically easy, and even now shouldn't be taken for granted. \n\nLegislature & Executive are political organs and India being a democratic republic, will be selected through elections only. The anomaly in our system is the judiciary which has carved itself a space where they are not directly appointed by the executive/elected bodies. Even the constitutional posts are filled up by different committees consisting of political members (which have some members of opposition as well). \n\nRunning a country is not a pure science/math which can be solved through calculations, neither can there be one solution. Sure there are fundamental problems which need to be addressed, but as it has been said \"democracy is the worst form of government – except for all the others that have been tried\" will hold true until we have a better solution on how to run countries.",
        "I don’t live in India jesus they discriminate based on whether you eat meat or not?",
        "Cheating on partner is legal. Same sex marriage is not allowed. Wow. There are a lot of laws that need to be changed in accordance with Indian culture and customs.",
        "Considering this is very much Progressive cause globally, I would expect Left liberal parties to be forefront bringing this right to reality.I am just curious why havent been more vocal about it or atleast fight for it ?",
        ">Police fears courts and this judgement gives power to members of lgbtq to represent their case strongly in court. Once a precent is set police will stop arresting people for same sex relationship.\n\n\n\nThere are multiple supreme court and high court judgements saying no one can be punished in the name of sedition simply based on their speech, and that the goverment has to prove the actions of the accused led to violence against the state. The same supreme court and high courts routinely make impotent statements about lack evidence and allow the government to continue incarcerating political opponents for years without evidence under sedition and draconian uapa. The victims eventually get acquitted, but the prices itself is punishment.",
        ">It is not open to state to oppress or discriminate against queer folks.\n\nYet, the 100s of laws thar you're talking about do exactly that, and the court has chosen to do diddly squat about that.",
        "Exactly.",
        "Please! Don't compare sedition laws with section 377 kind of laws.\n\nSedition laws have very strict provisions for bail. Hearing for bail will not even come till arguments have started and defense lawyers start plugging holes in evidence which can easily take 5-10 years. \n\nIn cases similar to 377 judges can start pasting police  from the first hearing.",
        "Bhai forget transgender if you have to pretend, you can pretend to be man and woman.. And such kind of cases have happened in the past. However, your boat hit the rock called inheritance. There would be more stakeholders in this circus and this issue will come out in the arguments.",
        "Bill is already in the Parliament, the debate was halted because of this case.. Now I think it will be brought back to the floor, but i guess it will take a lot of time to come out for debate because the bill will have to be amended based on the SC decision and reintroduced.",
        "Because there's a difference between being left and being Liberal.\n\nThe opposition, left is far from liberal, and has a big chunk of voter base which will vehemently oppose any advancements towards the recognition of same sex marriage.",
        "INC is not a left wing party. \n\nIt is not very liberal either, it's just more liberal compared to BJP.\n\nEven others like NCP, AAP are not as liberal as compared to their equivalents in the West.",
        "Yeah that’s why they’re saying it SHOULD enforced",
        ">Sedition laws have very strict provisions for bail.\n\nI repeat.  The supreme court has already passed multiple judgements reading down sedition law to decriminalise speech.",
        ">defense lawyers start plugging holes in evidence which can easily take 5-10 years.\n\nSupreme court routinely points out that the government has zero evidence, and then fails to give bail.",
        "Gotcha, thanks for the response. I've seen certain activists suggest that the case would have worked better if the community had been more involved/there were better ways to strategize and go about it. But does it push back or delay working on the bill?",
        "Compare apples with apples. Police had no role in that murder and because  of pressure of courts police had to arrest the MLA who otherwise had the police force in his pocket, this basically reiterates my point. \n\nAlso the guy who died was a carrier criminal who worked for the same MLA.",
        "> This is not just India, it is literally every democracy everywhere.\n\nNo, it is in parliamentary democracies. &nbsp; In USA for example, the legislature and executive are entirely separate.",
        "Imagine if they gave reservation to queers, everyone will lose their minds.",
        "More like can't, you can't make someone respect or even acknowledge you if they don't like it, it's their right as well.",
        "Poor women /Dalit women are often brutalised /discriminated against/ dismissed by the police.  And that's not because the courts haven't made up their minds as to whether Dalits or women have the same rights as others.  So this judgement isn't going to achieve what you're talking about anymore that the striking of 377.",
        "TIL I have a big gaping hole in my knowledge of politics. Thanks. \n\nOn basic analysis, it appears that the US system although a better nominal separation of powers, has been hijacked by the 2 party system (which I suppose is not part of the formal framework / constitution) and by lobbying, i.e. formal campaign donations to representatives as well as to governor and presidential campaigns.\n\nAlso, the head of the executive, POTUS can influence or appoint the heads of the judiciary, and there is the all-encompassing Presidential Order which makes a single man extremely powerful. \n\nThese are the glaring bugs immediately visible in that form of democracy.\n\nThere may be more, but I need to do a lot of reading.",
        "Yeh chutiyolog ko pahile sab maloom tha toh Itna din time pass kyu Kiya",
        "Hundreds of millions will declare themselves as gay or lesbians to attain jobs or seats in colleges before the outrage even happens",
        "By this logic no laws work in any country. This does not mean a country should stop redefining/creating laws.",
        "Tool",
        "Where do you draw a line for this,\nNot against same sex marriage but, \nseeing the issues in western countries, \n\nwhere do you draw a line.\n\nOnce same sex marriage is allowed then next some other right, eventually we have a minor kids undergoing sex transition.\nWant it to be part of the education system,\nWant new pronouns.\n\nWhat after giving same sex marriage rights,\nThat's my fear.",
        "Yes. But they don't discriminate based on skin color though, like in the other parts of the world. Such constructs are completely made up by society and can look totally weird for an outsider.",
        "I never said countries should stop revising laws. Never said new laws are pointless either. But the point about this one putting an end to police brutality doesn't make sense because if it has been occuring even after 377 was struck it's going to continue to occur.  When a gay couple is harassed by a cop it's not always on the grounds of 'unnatural sex'. They come up with other ways. I don't understand how this particular judgement is going to weed out homophobia anymore than the one from five years ago.",
        "Lol, no. If that was the case, police brutality would be low. Corruption within police would be low.\n\nDefinitely not the case.",
        "You'll find a bunch of BJP supporters campaigning and claiming that their beloved party supports LGBTQ community at election time.\n\nFunny, their actions don't reflect it.",
        "That actually is a judicial and government problem. Discrimination against people on the basis of their sexuality and gender can be decriminalised and enforced.",
        "If you wait around for people to approve, you'll never get anywhere.\n\n\"Better to ask for forgiveness than for permission\"\n\nOf course in reality, don't ask for forgiveness or permission, because LGBTQ people don't need other people's approval or forgiveness to exist and live their life. It is their right as humans.",
        "And judiciary. And government.",
        "Worse still, Tey renting as a cat owner........even the dog owners will be against you.",
        "No it is not. Also you are confused about your terms. Govt already includes legislature, executive and judiciary. Making laws and ‘giving rights’ is only purview of legislature.",
        "You're not wrong. But I'd argue even doing that wouldn't help. There's already discrimination against Muslims, bachelors (male and female), etc, when it comes to renting. But when you say private property owners must be forced to do something they don't want to, that opens another can of worms relating to rights.",
        "Great",
        "You’re grasping at straws bud. Take a breather.",
        ">Police had no role in that murder \n\nFfs, the cops tortured the father of the rape victim to death in police custody to try to get the victim to withdraw the rape case. Fear of court didn't stop the cops from literally killing the father. No one has been punished for that murder. The rapist was punished for the rape, because the victim continued fighting even after the father's murder. Even after the attempt on her own life, when a truck with a number plate deliberately hidden belonging to the rapist's friend ran over the car carrying her, her aunt and her lawyer. \n\n>Also the guy who died was a carrier criminal who worked for the same MLA.\n\nWhat?",
        "Thanks for pointing out the correction.\n\nBut no, renting isn't a gray issue. It is discrimination to prevent certain people from being able to rent and have a roof over their heads. House owners aren't entitled to discrimination. Renting is a commercial activity, and like all commercial activities, discrimination on any basis must be forbidden.",
        "Umm the landlord can just deny that he was discriminating and he isn't obliged to give reason why they doesn't let someone use *thier* property.",
        "\"constitunoal right\" ... that's a hollow argument.   if there was no mention of constitunoal rights in the \"constitution\" what would be your premise be for pushing this isue then?",
        "> CJI has drawn a clear line on basic human rights and limitations of the court.   \n\nIn stark contrast to BJP govt which always tries to overreach.",
        "Say something relevant or stay quiet.",
        "The other guy already said everything relevant enough yet you keep blabbering on here. Your argument sounds like this - “I never said laws bad. But police brutality doesn’t stop with a law because they will continue to do it anyway, with different citations.” \n\nWhat’s even the purpose of this argument? It’s completely a moot point. Ofcourse laws which are a figment of social construct don’t have absolute resolutions in reality. Just stick to the topic at hand instead of trying to sound smart. Bringing forth the edge case exceptions to a rule doesn’t invalidate anything.",
        "You must be terribly insecure if you can't disagree with others without being unnecessarily rude and combative. The forced condescension gives it away. \n\nThe other guy did not substantiate it with anything relevant but I can see why you'd think so . Do *you* have anything relevant to say ,or did you jump in as his lackey?\n\nI did not say this judgement is pointless because it doesn't offer absolute solutions.  The OP on the other hand claimed that its a \"full stop on police brutality \" when it comes to same sex relationships.  Do you know what full stop means ? They claimed it's if not an absolute resolution, a definitive one. Which is not true in any sense whatsoever. His explanation was that the cops 'fear' courts so the attitudes of high ranking officers are going to trickle down to the hawaldars and there would be no more harassment .  You are delusional if you think the instances of harassment of women, or LGBT folks by the police are \"edge case exceptions \" in a society with an insanely corrupt law and order system and pervasive homophobia and misogyny.  Trans people  Gay people who are not straight passing are frequently picked on by the cops.  From low key rude behaviour to full on abuse there's a range of anti LGBT behaviour from their side that hasn't changed post the 2018 judgement and it's naive to think wee platitudes from Chandrachud and Co or the right to adopt are going to fix it.  Lesbian women are often  infantalised  and told to go back to their families. When the families of gay people file fake charges of abduction against their partners ,the cops side with the families tell the gay person in question to go back or even \"get treatment\".  Trans women are stripped or prodded in the crotch area to 'reveal' their gender.  \nMy point doesn't become moot just because your delusional ass thinks so.  Some of us don't have to 'try' to sound smart but clearly that's not the case with you. That you fail even after trying is even more amusing.",
        "Blah blah blah. Stop reading into things to an excessive degree just to try and have some kind of an argument. Instead of trying to understand the gist of what someone tries to say, on the contrary you try your best to argue with a moot point, which is, Ofcourse there’s no social construct solution in absolute measure to a real world problem. \n\nAlso the cases against minorities aren’t the edge cases. But to assume that there’s no trickle down of any kind of upliftment with a law is. Which is what you’re implying in all your comments. That the law itself is useless because those in power who have to be bigoted will still be; that’s simply not true. It is a very much a definitive solution, and your disagreement on this is clearly based on your trust battery instead of any kind of reasoning. Just how many people do you need to tell you the same thing in multiple comments?",
        "I didn't 'imply' anything. I *stated* facts. Very clearly. In response to a claim which is not true. Now you've come up with another weak ass justification about the 'gist' of it. \n\nNever said the judgement is thoroughly useless and what my statement 'sounds like ' to you is your problem .  The judgement is useful within its context ,not beyond.  And not any more useful than the 2018 judgement when it comes to police brutality like I said before.  The cops are not  gonna go \" Oh ..so being gay is not just legal but now gay couples can ADOPT too, this is some eye -opening shit so let's start being nice to the gays \".  If anything it's going to make things worse, because by denying the right to marry, they've basically said gay people are beneath straight people and that would make every homophobe in the country feel at least slightly validated. \n\n\nIt is NOT a definitive solution. It is not any solution for problem the OP claims to have been solved.    Any number of people like you can make any number of half baked justifications for this absurd claim but it's not going to make any difference.  It's as ridiculous as saying the Women's Reservation Bill is going to stop the harassment of women on the streets because the change in the status quo among politicians is going to 'trickle down' and is going to wipe out the issue.  YOU are reading too much into the judgement but you're too stupid and defensive to realise that. \n \n\" Extraneous web of words \". In other words you don't understand what I've said ,and you didn't understand what the other guy had said. But you had to butt in and make a fool of yourself.",
        "Women legislators lead to more favourable policies for women that work to get equal rights for them, better enforcement of such rights, and working as a measure to stop harassment amongst other societal issues faced by them. \n\nWhat context is it that you’re speaking of? Setting up legal precedents that even recognize the LGBTQ community create top to bottom pressure in a manner of precedent. You don’t make the bad guys turn good, you just make them scared to be bad in public. That’s the context of all criminal law might I add. How is assuming this, which is something the other guy stated as well, outside whatever this supposed context is supposed to be? \n\nAlso, denied the right to marry? Read the title. While SC might be inclined towards this, it has to come from legislation, and is outside the ambit of SC. That’s the gist of it. \n\nIt’s also very easy to make tall claims like you’re stating facts, and everyone else is wrong. You should think about what you think by yourself and for yourself, while trying to keep an open mind to the other person.  I’m trying to do that to you but you come across as quite inconsistent, so perhaps stick to self reflection and re-read the whole thread with a fresh mind instead of trying to convince anyone else because you’re not doing a very good job at it.",
        "Rich of you to talk about keeping an open mind when you've been nothing but rude confrontational and dismissive right from the start. Being the insecure little hypocrite you are. You still have no clue as to what I said and in relation to what it was said but you keep droning on like I kicked you in the clit.   The conversation was about a systemic problem -harassment of vulnerable people by the police where the law and order system is extremely inefficient corrupt and understaffed.  The OP claimed a full stop has been laid to it and that's not true. And my response was that this judgement does not do anything the previous one didn't .  How hard is that for you to understand?  Do you even hear yourself? From claiming this particular judgement   IS a definitive fix for the problem you've gone to \" well eventually....because it sets a precedent \".  So now it's a precedent .  I love how you ,after four or five rants havent yet said how this particular judgement carries more weight than the previous one which failed to do what the OP says has been done. Yet I'm the one grasping for straws ? Haha. \n If you are desperate to preach about the glories of tiny legislative changes that pay off in the long run do that elsewhere ; you've squeezed yourself into the wrong thread. I didn't try to convince anyone least of all you.  I expressed my opinion about the immediate changes somebody claimed to have been brought about.  . If you can't deal with it try burying your face in sand or something. \n\nYour audacity to tell me about the need for self reflection  is laughable."
    ],
    "cleaned_text": "sex marriage live supreme court cant make law interpret says cji sex marriage verdict choosing life partner integral part life however court make laws interpret cji drawn clear line basic human rights limitations court ",
    "cleaned_title": "sex marriage live supreme court cant make law interpret says cji sex marriage verdict",
    "cleaned_selftext": "choosing life partner integral part life however court make laws interpret cji drawn clear line basic human rights limitations court",
    "cleaned_comments": "actually great verdict would suggest everyone read like know constitutional right violated treated second class citizen nothing tldr cant give marriage statuswill think giving certain social benefits marriagegoodbye doesnt change anything doesnt give rights adoption rights rights getting benefits partnership like married couple leaves things parlieament bjp nda never anything shittiest verdict think ofhe opened worms wont able close please read judgement entirety news headlines court struck discriminatory sections adoption regulations allowed adoption unmarried couples irrespective whether heterosexual homosexual court also lead conditions parliamentary committee includes unions homosexual couples rights regarding succession joint finance income tax benefits employer gratuity medical power attorney etc upto parliament lay law however court provided judgement right civil union ensured via different sections constitution discrimination based sex includes sexual orientation due time parliament recognize rights civil union homosexual couples thats good coming saying useless httpstwittercomlivelawindiastatushttpstwittercomlivelawindiastatus showing laal ankh state think adoption rights apart cant see much yeah likely scenario happen parliament take least adoption rights restricted edit seems adoption still table thanks headsup w court adoption rights lol try renting house queer couple adopted child whatever court said isnt already society us already respect sex couples needed legalise marriage dont think court done anything extraordinary people saying changes nothing heres judgement important first put full stop police brutality sex relationship second judgement brought issue main course discussion ie civil rights samesex folks legislation specific discussions solid foundation gives opportunity pro samesex legislators ability pen bills technical references laws democracy dont happen day happens stages period time majority page cji treaded thin rope civil rights limitations sc ok ideal judgement please give proper citations constitutional provisions thats really society problem judicial even government problem society us already respect sex couples less respected educated people respect sure belive majority indians dont respect sex couples hell lot dont respect anyone lgbtq bro start refer wont able understandthis thing livingalso teach explain little morewhat asked marriage equalitygiven never possible recognize first placehe tried give candies clearly broadening ambit gender identity without much thoughtnow thing indian law gender neutralso liberal concept gender identity applied indian setting lead outcomes cant even understand yet think domestic violence caseswhere dude decides show gi certificatewhich easily availablei got onei technically trans cjinowhttpscjinow see consequences indian law marry girlcan accuse dv installment mai equality milna kab band hogi iss desh mai exactly dissapointing verdict expected guess hopefully least parliament approve sex marriage future soon installment mein bhi nahi mili hai verdict defeated smh wont stop without three change cultural perceptions societal acceptance government legislation stymie discrimination enforcement legislation courts mean mean law non existent court cant anything law present says sex marriage illegal government brings law law becomes existent matter whether sex marriage court change verdict dumb toi article empty bar bench articlehttpswwwbarandbenchcomnewssupremecourtsaysnosamesexmarriagecivilunioncjicivilunionssamesexcouplesminorityopinion pretty good summary majority minority opinions judgement people getting upset verdict would prudent recognise sex marriage current framework laws would resulted chaos huge undertaking restructuring legal framework involving acts done parliament reasoning given sound well since recognition marriage fundamental right sc ally queer movement limited capacity queer persons right choose partner must protected enjoy rights open state oppress discriminate queer folks additionally future development sphere also suggested court central government shall set highpowered committee undertake study relevant factors associated samesex marriage thats anti discrimination laws necessary theres much difference people instagramcomment sections trolls people reddit instagram gave anxiety issues thank god shifted negative platform reddit means court wont make law adding provisions sex marriage making recognized neither make laws recognize relationship union benefits neither make law allow adoption kids homosexual couple things reserved parliament work upon make laws feel right sc ask parliament make committee think giving benefits sex couples like joint bank accounts ration cards insurance pension suggestions committee also parliament accept follow currently provisions declare samesex marriage illegal provisions recognize marriage act constitution court doesnt ability modify strike acts constitution body fucking time sc continues run ramshod whatever want centre going go people upset mainly due politically uneducated grasping structure judicial legislative framework one expected one ruling reorient entire legislative system language binarily gendered naive still said best could happened bruh kind bubble live people actively dislike homosexuality let alone support sex couples remember reading somewhere thin line caution cowardice sc cant form legislation direct parliament anyway atleast provides precedence state brutality opens roads equality wearing sunglass give us rights bring landlord court based discrimination sanghis oppose constitution law doesnt allow username checks true point simply relying little bit hope lol first put full stop police brutality sex relationship like purview legislature like dont marriage constitutional right go ask legislative paperwork approval well landlord also right determine use private property according choices private individuals right enjoy property cant also curtailed manner joint bank accounts insurance insurance bank accounts made person nominee joint account holder pensions ration card restricted legal spousefamily think thats thing constitutional right violated otherwise would easily interpret allowed good chunk incels sanghis left subreddits legaladviceindia filled like insta x look find well first put full stop police brutality sex relationship yes course police well known following law indulging kind brutality mao zedong great thoughts landlords constitutional right violated sc would able intervene actually thanks wonderful explanation bit ignorant laws generally speaking court doesnt authority modify laws passed parliament parliament sheer power majority make regressive bad law court cases great judgment done australia via court though first equal rights respects given samesex partners including inheritance pensions etc time call grew louder louder ultimately gov day held postal plebiscite majority australians supported changing law gov passed law legalise verdict practical purpose remove discriminations implication enormous think soldier dies battlefield samesex partner last rites body medals widow pensions would given family schools business would able discriminate sex couples etc um discriminate even private business yes discriminate landlord right decide live live private property nope last three judgments went reading cara try renting house nonvegetarian chennai bangalore laws much society pick slack somewhere gives opportunity pro samesex legislators ability pen bills technical references genuine question likelihood happening near future understanding currently court directed solicitor general form committee sg leanings pretty well known think thats tricky part decide legally based countries called protected attributes like sexuality race etc wont give reason different made reason practice nominee joint bank accounts opened wife husband also correct term life insurance wife sanghis opposed wouldnt added transgender option government websites non existent secular ruleaap chronology samjhiye try renting house minority ftfy court ask modify strike law law violates fundamentals rights citizen right ti marriage isnt fundamental right according constitution cant force parliament make laws parliament refuses modifyscrap law violates fundamental rights happen court remove law force majority j bhat j kohli j narasimha upheld cara regulations namely reg official statement interferes sanctity family value garbage making discussion whether homosexuals get civil rights clearly assumes homosexuality definately illegal anything upto parliament unfortunately government anything central government opposed court cited violative even judges ruled acknowledged violative article try renting house muslim queer person adopted child pune mumbai know worse meant dont even go far discriminated police fear courts courts cite judgement sc ips ranked officer receives heat courts wrongful arrests happens heat passed lower ranks india evolving backwards absolutely right conservatives sanghis zealots expected go along lines question remains congress left called liberal parties support lgbtq marriages heard ever take stance theres talking theres technically rss head talked natural homosexuality know ended rss supported govt inc different rajasthan government case congress government opposed marriage equality well guess either living watching many films person arrested police produced court even police follow law person receives fair opportunity represent case court police fears courts judgement gives power members lgbtq represent case strongly court precent set police stop arresting people sex relationship bill already parliament filed supriya sule today bill find majority supporters time come democracy works doesnt matter power bills related popular demand see light day haan toh tu lad elections hame sahi direction mein leja ever heard seperate equal right swing fist ends someone elses face begins right persecute wish participate country must serve lawabiding patrons equally thats morality grandpappy stole land gays cant live becuase im crazy bronze age bigot elaborate write words make sense man talking discussing whether people take landlord court renting specific people private property dont know right related anything else simply force someone legally bound hard understand yes society long way go take time change perception society things even something like enforced law violates fundamental right citizen supreme court scrap straightaway force wait loophole really wan na get married claim transgender persons protection rights act record claim opposite gender enter marriage regular malefemale marriage mean great really want adopt kids get staterecognition path way apprehension claim trans solves recognition problems yeah probably happen either ucc elections nahi tak ho hi jayega offtopic say separation powers checks balances etc democracies glaring flaw legislature overlaps executive nda legislature executive india literally every democracy everywhere get laws passed benefit executive associated executive benefitting people huge bug system also blind spot whole world relic flawed industrial age democracy needs remedied information age possible propaganda next elections bro lgbt people please dont make us political thing uninstalled insta months ago feel times mentally better oh forgetting everything turned political issue country works sad reality cji mentioned judicial platitudes much logically well judicially correct brings issue bouquet rights come marriage recognition union example adoption eventhough unmarried couples allowed adopt still option marry adopt done sex couples since dont option marriage setting high level committee passing responsibility legislative antilgbtq courts must recognise eventhough policies come legislature discrimination justified majoritarian opinion courts fact agree discrimination happening yet pass ambit change legislature god knows happen person arrested police produced court even police follow law person receives fair opportunity represent case court tell unnao rape victim whose father tortured death cops attempt get case bj party mla withdrawn bug feature separation powers absolute set stone parliament judicial functions executive judiciary legislative functions president three overlaps limited capacity overlapping functions constitutional statutory conferred act interpreted implied checks balances supposed interplay bodies along constitutional posts cag cec etc first need understand running civil society humongous populations without bloodbath stages transfer power historically easy even shouldnt taken granted legislature executive political organs india democratic republic selected elections anomaly system judiciary carved space directly appointed executiveelected bodies even constitutional posts filled different committees consisting political members members opposition well running country pure sciencemath solved calculations neither one solution sure fundamental problems need addressed said democracy worst form government except others tried hold true better solution run countries dont live india jesus discriminate based whether eat meat cheating partner legal sex marriage allowed wow lot laws need changed accordance indian culture customs considering much progressive cause globally would expect left liberal parties forefront bringing right realityi curious havent vocal atleast fight police fears courts judgement gives power members lgbtq represent case strongly court precent set police stop arresting people sex relationship multiple supreme court high court judgements saying one punished name sedition simply based speech goverment prove actions accused led violence state supreme court high courts routinely make impotent statements lack evidence allow government continue incarcerating political opponents years without evidence sedition draconian uapa victims eventually get acquitted prices punishment open state oppress discriminate queer folks yet laws thar youre talking exactly court chosen diddly squat exactly please dont compare sedition laws section kind laws sedition laws strict provisions bail hearing bail even come till arguments started defense lawyers start plugging holes evidence easily take years cases similar judges start pasting police first hearing bhai forget transgender pretend pretend man woman kind cases happened past however boat hit rock called inheritance would stakeholders circus issue come arguments bill already parliament debate halted case think brought back floor guess take lot time come debate bill amended based sc decision reintroduced theres difference left liberal opposition left far liberal big chunk voter base vehemently oppose advancements towards recognition sex marriage inc left wing party liberal either liberal compared bjp even others like ncp aap liberal compared equivalents west yeah thats theyre saying enforced sedition laws strict provisions bail repeat supreme court already passed multiple judgements reading sedition law decriminalise speech defense lawyers start plugging holes evidence easily take years supreme court routinely points government zero evidence fails give bail gotcha thanks response ive seen certain activists suggest case would worked better community involvedthere better ways strategize go push back delay working bill compare apples apples police role murder pressure courts police arrest mla otherwise police force pocket basically reiterates point also guy died carrier criminal worked mla india literally every democracy everywhere parliamentary democracies nbsp usa example legislature executive entirely separate imagine gave reservation queers everyone lose minds like cant cant make someone respect even acknowledge dont like right well poor women dalit women often brutalised discriminated dismissed police thats courts havent made minds whether dalits women rights others judgement isnt going achieve youre talking anymore striking til big gaping hole knowledge politics thanks basic analysis appears us system although better nominal separation powers hijacked party system suppose part formal framework constitution lobbying ie formal campaign donations representatives well governor presidential campaigns also head executive potus influence appoint heads judiciary allencompassing presidential order makes single man extremely powerful glaring bugs immediately visible form democracy may need lot reading yeh chutiyolog ko pahile sab maloom tha toh itna din time pass kyu kiya hundreds millions declare gay lesbians attain jobs seats colleges outrage even happens logic laws work country mean country stop redefiningcreating laws tool draw line sex marriage seeing issues western countries draw line sex marriage allowed next right eventually minor kids undergoing sex transition want part education system want new pronouns giving sex marriage rights thats fear yes dont discriminate based skin color though like parts world constructs completely made society look totally weird outsider never said countries stop revising laws never said new laws pointless either point one putting end police brutality doesnt make sense occuring even struck going continue occur gay couple harassed cop always grounds unnatural sex come ways dont understand particular judgement going weed homophobia anymore one five years ago lol case police brutality would low corruption within police would low definitely case youll find bunch bjp supporters campaigning claiming beloved party supports lgbtq community election time funny actions dont reflect actually judicial government problem discrimination people basis sexuality gender decriminalised enforced wait around people approve youll never get anywhere better ask forgiveness permission course reality dont ask forgiveness permission lgbtq people dont need peoples approval forgiveness exist live life right humans judiciary government worse still tey renting cat ownereven dog owners also confused terms govt already includes legislature executive judiciary making laws giving rights purview legislature youre wrong id argue even wouldnt help theres already discrimination muslims bachelors male female etc comes renting say private property owners must forced something dont want opens another worms relating rights great youre grasping straws bud take breather police role murder ffs cops tortured father rape victim death police custody try get victim withdraw rape case fear court didnt stop cops literally killing father one punished murder rapist punished rape victim continued fighting even fathers murder even attempt life truck number plate deliberately hidden belonging rapists friend ran car carrying aunt lawyer also guy died carrier criminal worked mla thanks pointing correction renting isnt gray issue discrimination prevent certain people able rent roof heads house owners arent entitled discrimination renting commercial activity like commercial activities discrimination basis must forbidden umm landlord deny discriminating isnt obliged give reason doesnt let someone use thier property constitunoal right thats hollow argument mention constitunoal rights constitution would premise pushing isue cji drawn clear line basic human rights limitations court stark contrast bjp govt always tries overreach say something relevant stay quiet guy already said everything relevant enough yet keep blabbering argument sounds like never said laws bad police brutality doesnt stop law continue anyway different citations whats even purpose argument completely moot point ofcourse laws figment social construct dont absolute resolutions reality stick topic hand instead trying sound smart bringing forth edge case exceptions rule doesnt invalidate anything must terribly insecure cant disagree others without unnecessarily rude combative forced condescension gives away guy substantiate anything relevant see youd think anything relevant say jump lackey say judgement pointless doesnt offer absolute solutions op hand claimed full stop police brutality comes sex relationships know full stop means claimed absolute resolution definitive one true sense whatsoever explanation cops fear courts attitudes high ranking officers going trickle hawaldars would harassment delusional think instances harassment women lgbt folks police edge case exceptions society insanely corrupt law order system pervasive homophobia misogyny trans people gay people straight passing frequently picked cops low key rude behaviour full abuse theres range anti lgbt behaviour side hasnt changed post judgement naive think wee platitudes chandrachud co right adopt going fix lesbian women often infantalised told go back families families gay people file fake charges abduction partners cops side families tell gay person question go back even get treatment trans women stripped prodded crotch area reveal gender point doesnt become moot delusional ass thinks us dont try sound smart clearly thats case fail even trying even amusing blah blah blah stop reading things excessive degree try kind argument instead trying understand gist someone tries say contrary try best argue moot point ofcourse theres social construct solution absolute measure real world problem also cases minorities arent edge cases assume theres trickle kind upliftment law youre implying comments law useless power bigoted still thats simply true much definitive solution disagreement clearly based trust battery instead kind reasoning many people need tell thing multiple comments didnt imply anything stated facts clearly response claim true youve come another weak ass justification gist never said judgement thoroughly useless statement sounds like problem judgement useful within context beyond useful judgement comes police brutality like said cops gon na go oh gay legal gay couples adopt eye opening shit lets start nice gays anything going make things worse denying right marry theyve basically said gay people beneath straight people would make every homophobe country feel least slightly validated definitive solution solution problem op claims solved number people like make number half baked justifications absurd claim going make difference ridiculous saying womens reservation bill going stop harassment women streets change status quo among politicians going trickle going wipe issue reading much judgement youre stupid defensive realise extraneous web words words dont understand ive said didnt understand guy said butt make fool women legislators lead favourable policies women work get equal rights better enforcement rights working measure stop harassment amongst societal issues faced context youre speaking setting legal precedents even recognize lgbtq community create top bottom pressure manner precedent dont make bad guys turn good make scared bad public thats context criminal law might add assuming something guy stated well outside whatever supposed context supposed also denied right marry read title sc might inclined towards come legislation outside ambit sc thats gist also easy make tall claims like youre stating facts everyone else wrong think think trying keep open mind person im trying come across quite inconsistent perhaps stick self reflection reread whole thread fresh mind instead trying convince anyone else youre good job rich talk keeping open mind youve nothing rude confrontational dismissive right start insecure little hypocrite still clue said relation said keep droning like kicked clit conversation systemic problem harassment vulnerable people police law order system extremely inefficient corrupt understaffed op claimed full stop laid thats true response judgement anything previous one didnt hard understand even hear claiming particular judgement definitive fix problem youve gone well eventuallybecause sets precedent precedent love four five rants havent yet said particular judgement carries weight previous one failed op says done yet im one grasping straws haha desperate preach glories tiny legislative changes pay long run elsewhere youve squeezed wrong thread didnt try convince anyone least expressed opinion immediate changes somebody claimed brought cant deal try burying face sand something audacity tell need self reflection laughable",
    "light_cleaned_title": "Same Sex Marriage Live: Supreme Court can't make law, can only interpret it, says CJI on same sex marriage verdict",
    "light_cleaned_selftext": "Choosing life partner is integral part of life however, court cannot make laws it can only interpret it. CJI has drawn a clear line on basic human rights and limitations of the court.",
    "light_cleaned_comments": "This is actually a great verdict. I would suggest everyone to read it. It's like we know that your constitutional right is violated and you are treated as a second class citizen but we will do nothing about it. tldr: Can't give you marriage status.Will think of giving you certain social benefits of marriage.Goodbye. No, it's not. Why is it not? Because it doesn't change anything. Because it doesn't give any rights, no adoption rights, no rights for getting the same benefits if you are in a partnership like a married couple. It leaves all these things to parlieament which under BJP and NDA will never do anything. this is the most shittiest verdict you can think of.He just opened a can of worms that he wont be able to close. Please read the judgement in entirety and not just the news headlines. The court has struck down discriminatory sections of the Adoption Regulations and allowed Adoption by unmarried couples irrespective of whether heterosexual or homosexual. The court has also lead down conditions for the Parliamentary Committee which includes that unions between homosexual couples have the same rights regarding succession, joint finance, Income Tax Benefits, Employer Gratuity, Medical Power of Attorney etc. It's upto to the Parliament to lay down the law however the court has provided the judgement that the right to a civil Union is ensured via different sections of the constitution and discrimination based on sex includes sexual orientation. In due time, the parliament will have to recognize these rights for a civil union between homosexual couples. That's not good then. So him coming out and saying this is useless? [https://twitter.com/LiveLawIndia/status/1714160712463867939](https://twitter.com/LiveLawIndia/status/1714160712463867939) so is it just showing \"laal ankh\" to state ? I think adoption rights are there but apart from that, I cant see much. Yeah this was the most likely scenario to happen. Parliament has to take over. At least adoption rights are not restricted. Edit: Seems adoption is still not on the table. Thanks for the heads-up. W court 💪🏽 Adoption rights lol, try renting a house as a queer couple with an adopted child. Whatever the court said isn't it already there? As a society most of us already respect the same sex couples. What was needed was to legalise the marriage. So, I don't think court has done anything extraordinary here. To people saying it changes nothing, here's why the judgement is very important. First it has put a full stop on police brutality on the same sex relationship. Second the judgement has brought the issue to the main course of discussion, i.e. civil rights of same-sex folks. So legislation specific discussions now have a solid foundation. It gives opportunity to pro same-sex legislators ability to pen down bills with technical references. Laws in democracy don't happen in a day. It happens in stages over a period of time when majority is on the same page. The CJI has treaded the thin rope of civil rights and limitations of SC. Ok.. What is the ideal judgement.. Please give proper citations to constitutional provisions.. That's really a society problem, not a judicial or even a government problem. >As a society most of us already respect the same sex couples They are very less respected educated people respect them sure but i belive majority Indians dont respect same sex couples hell a lot of them dont respect anyone from lgbtq Bro if I start to refer you wont be able to understand.This is thing I do for living.Also i teach. I will explain it a little more.What was asked was marriage equality.Given that it was never possible to recognize that in the first place,He tried to give candies by clearly broadening the ambit of gender identity without much thought.Now the thing is Indian law is not gender neutral.So when liberal concept of gender identity will be applied to Indian setting this will lead to outcomes which we cant even understand yet. Think of domestic violence cases,where The dude decides to show GI certificate.Which is easily available.I got one.I am Technically trans under [CJI.Now](https://CJI.Now) can you see the consequences under Indian law if I marry a girl.Can you accuse me of DV??? Installment mai equality milna kab band hogi iss Desh mai ? Exactly. Dissapointing verdict but expected, I guess. Hopefully, at least the Parliament will approve same sex marriage in the future soon. Installment mein bhi nahi mili hai, the verdict has been defeated by 3:2. Smh But it won't stop without all three. A change in cultural perceptions and societal acceptance, government legislation to stymie discrimination, and enforcement of the legislation by the courts. What does it mean? Does it mean as the law is non existent court can't do anything? Is there any law at present which says same sex marriage is illegal? If the government brings such law (once the law becomes existent not matter whether it's for or against the same sex marriage) then can the court change it? This verdict is so dumb. That TOI article is empty. [This Bar & Bench article](https://www.barandbench.com/news/supreme-court-says-no-same-sex-marriage-civil-union-cji-civil-unions-same-sex-couples-minority-opinion) has a pretty good summary of the majority & minority opinions of the judgement. And to the people getting upset over the verdict, it would not have been prudent to recognise same sex marriage in the current framework of laws that we have as it would have resulted in chaos. Such a huge undertaking of restructuring the legal framework involving 100s of acts can only be done through parliament. The reasoning given is sound as well since recognition of marriage is not a fundamental right. SC has been an ally to the queer movement in its limited capacity \"- Queer persons have the right to choose their own partner and they must be protected to enjoy such rights.\" It is not open to state to oppress or discriminate against queer folks. Additionally, future development in this sphere was also suggested by the court \"- Central government shall set up a high-powered committee to undertake study of all relevant factors associated with same-sex marriage.\" That's why anti discrimination laws are necessary There's so much difference in people on instagram(comment sections and trolls) and people on reddit. Instagram gave me anxiety issues, and thank god I shifted myself from that negative platform to reddit. It means that court won't make any law for adding provisions of same sex marriage or making it recognized neither it will make any laws that will recognize their relationship as union with benefits and neither it will make law to allow adoption of kids for homosexual couple. All this things are reserved for parliament to work upon and make laws if they feel the right to do so. SC can only ask parliament to make a committee which can think about giving some benefits to same sex couples like joint bank accounts, ration cards, insurance and pension but suggestions of that committee are also on will of parliament to accept or follow. Currently there are no provisions which declare same-sex marriage illegal but there are no provisions which recognize it under any marriage act in constitution and court doesn't has the ability to modify or strike down acts in constitution because they are not the body who should do so. About fucking time. If SC continues to run ramshod and do whatever they want the centre is going to go after them. People will be upset over this but that is mainly due to them being politically uneducated and not grasping the structure of our judicial & legislative framework. If one expected one ruling to reorient the entire legislative system where all language is binarily gendered, he was being naive. But still as you said, this is the best that could have happened. Bruh what kind of bubble do you live in? Most people actively dislike homosexuality let alone support same sex couples. I remember reading somewhere that there is a very thin line between caution and cowardice. While SC can't form legislation, it can direct parliament to do so. Anyway. Atleast this provides some precedence against state brutality and opens up some roads to equality. That too while wearing a sunglass. Give us rights to bring the landlord to court based on discrimination then Sanghis oppose it. Constitution law doesn't allow it. Username checks out! True. At this point, I am simply just relying on a little bit of hope lol. >First it has put a full stop on police brutality on the same sex relationship. like How ? Again purview of legislature. More like \"we don't marriage is a constitutional right at all, so go ask legislative for your paperwork approval \" Well the landlord also has the right to determine the use of his private property according to his choices too. So no , a private individuals right to enjoy his own property can't also be curtailed in this manner. > joint bank accounts, insurance Both insurance and bank accounts can be made with any person as nominee/ joint account holder no ? Only pensions and ration card is restricted to legal spouse/family i think . This. That's the thing. No constitutional right is being violated here otherwise they would easily interpret it and allowed this. A good chunk of the incels, sanghis, and those in between these have all left for other subreddits. Legaladviceindia is filled with them. Just like insta and X, of you look for them you can find them here as well. > First it has put a full stop on police brutality on the same sex relationship. Yes, of course. Our police are well known for following the law and not indulging in any kind of brutality. Mao Zedong has some great thoughts on landlords Which constitutional right is being violated? If there was any the SC would have been able to intervene actually. Thanks for the wonderful explanation. I am bit ignorant about laws. Generally speaking, so the court doesn't have the authority to modify the laws passed by the parliament? Then, what if parliament by sheer power of majority make some regressive bad law? What will the court do in such cases? Great judgment. This was how it was done in Australia, not via court though. First equal rights in all respects were given to same-sex partners, including inheritance, pensions etc. Then over time the call grew louder and louder, ultimately the gov of the day held a postal plebiscite and majority of Australians supported changing the law. The gov the. Passed law to legalise it. This verdict for all practical purpose should remove discriminations. The implication are enormous, think a soldier dies on battlefield and if they had a same-sex partner the last rites of the body, medals and widow pensions would have to be given to them and not the family. Schools and business would not be able to discriminate same sex couples etc. Um no, you cannot discriminate even as a private business. Yes you cannot discriminate but the landlord has the right to decide who should live or not live in their private property. Nope. The last three judgments went against reading down CARA. Try renting a house as a \"non-vegetarian\" in Chennai or Bangalore. Laws can only do so much. The society has to pick up slack somewhere. >It gives opportunity to pro same-sex legislators ability to pen down bills with technical references. genuine question, is there a likelihood of this happening in the near future? my understanding currently is that the court directed the solicitor general to form a committee and the SG... his leanings are pretty well known i think Thats the tricky part, they cannot decide legally based on what in other countries are called protected attributes like sexuality, race etc. So they won’t give any reason or a different made up reason in practice. Not nominee but joint bank accounts can be opened only by wife and husband also if I am correct term life insurance is for wife too. if sanghis opposed it they wouldnt have added Transgender option in government websites which was non existent during Secular rule.aap chronology samjhiye. > try renting a house as a minority FTFY Court can ask to modify or strike down the law if the law violates the fundamentals rights of citizen but right ti marriage isn't a fundamental right according to Constitution so it can't force parliament to make laws. If the parliament refuses to modify/scrap the law which violates the fundamental rights, what will happen? Can the court remove such law by force? The majority of J. Bhat, J. Kohli, and J. Narasimha upheld CARA Regulations, namely Reg. 5(3). Its their official statement that it interferes with sanctity of family value or some other garbage. I am not making it up If your discussion is on whether the homosexuals can get civil rights or not, it clearly assumes that homosexuality is definately not illegal. They cannot do anything about it. It's upto the Parliament. But unfortunately, the government is against it. Cannot do anything then It is the Central Government who opposed it in court. They have cited it is violative of 19(1)(a) and 21, even the judges who ruled against it acknowledged that it is violative article 21 Try renting a house as Muslim queer person with an adopted child In Pune and Mumbai too. I know it's worse. I meant you don't even have to go that far to be discriminated. Because police fear courts and when courts cite this judgement of SC and IPS ranked officer receives heat from courts when wrongful arrests happens and then this heat is passed on to lower ranks. India is evolving, just backwards You are absolutely right ,but they are conservatives/ sanghis / zealots and are expected to go along these lines ,but the question remains will Congress and Left and So called liberal parties support LGBTQ marriages ? Have you heard them ever take a stance on this There's talking and then there's doing. Technically RSS head talked about how natural homosexuality is. But we all know how that ended UP (RSS supported govt) INC no different. Rajasthan Government in this case, which is a Congress government, had opposed marriage equality as well In guess you are either living in 70s or watching too many films 1. Any person arrested by police has to be produced in court. So even if the police do not follow the law, a person receives a fair opportunity to represent his case in court. Police fears courts and this judgement gives power to members of lgbtq to represent their case strongly in court. Once a precent is set police will stop arresting people for same sex relationship. 2. The bill is already in the Parliament filed by Supriya Sule. If not today the bill will find majority supporters when it's time will come. That is how democracy works, doesn't matter who is power bills related to popular demand will see light of the day. Haan toh tu lad elections, hame sahi direction mein leja.. You ever heard of seperate but equal? Your right to swing a fist ends when someone else's face begins. You have no right to persecute. If you wish to participate in a country then you must serve all law-abiding patrons equally. That's morality. Not \"my grandpappy stole this land, so gays can't live here becuase I'm a crazy bronze age bigot.\" You will have to elaborate and write more than 5 6 words for it to make sense. My man what are you talking about here. I was discussing about whether people can take a landlord to court just for not renting out to specific people. No they cannot because it's his private property. I don't know what are you on about right now. It's not related to anything else but simply you cannot force someone to do what he is not legally bound to do. How hard is that to understand. Yes we as a society have long way to go and it will take time to change the perception of society about things but even then something like this just cannot be enforced. If any law violates the fundamental right of the citizen then supreme court can scrap it straightaway by force. Wait, is there a loophole here, if you really wanna get married, you claim Transgender Persons (Protection of Rights) Act, 2019, and (for the record) claim opposite gender and enter the marriage as if it was a regular male-female marriage. I mean, this is not great but if all you really want is to adopt kids / get state-recognition, there is a path way. Why have apprehension of claim trans, if that solves most of the recognition problems. Yeah it most probably will happen. Either while UCC or after 2024 elections. Nahi to 2050 tak to ho hi jayega. Off-topic. We say separation of powers, checks and balances, etc, but most democracies have a glaring flaw : Legislature overlaps with Executive. The NDA is both Legislature and Executive. This is not just India, it is literally every democracy everywhere. So, we get laws passed which benefit the Executive or associated with the Executive, not benefitting the people. This is a huge bug in the system and is also a blind spot for the whole world. It is a relic of flawed industrial age democracy and needs to be remedied in the information age. Possible propaganda for next elections? Bro lgbt people are just 3% please dont make us more of political thing Uninstalled insta 2 months ago now i feel 10 times mentally better Oh but you are forgetting that everything can be turned into a political issue here, it's just how this country works. :( Sad reality. As CJI himself mentioned that these cannot be just judicial platitudes. He is very much logically as well as judicially correct when he brings up the issue of all the bouquet of rights that come up with marriage or recognition of a union. For example, during adoption, eventhough unmarried couples are not allowed to adopt, they still have the option to marry and then adopt. The same cannot be done by same sex couples since they don't have the option of marriage. Setting up a \"high level\" committee is just passing on the responsibility to the legislative which is anti-lgbtq. The courts must recognise that eventhough the policies have to come from the legislature, discrimination is being justified because of the majoritarian opinion. The courts in fact agree that there is discrimination happening and yet pass on the ambit of change to the legislature. God knows what will happen. >Any person arrested by police has to be produced in court. So even if the police do not follow the law, a person receives a fair opportunity to represent his case in court. Tell this to the unnao rape victim whose father was tortured to death by cops in an attempt to get the case against BJ Party MLA withdrawn. It's not a bug, it's a feature!! The separation of powers is not absolute or set in stone. Parliament has judicial functions. The Executive & Judiciary has legislative functions. President has all three! All these overlaps are in limited capacity. Some of these overlapping functions are constitutional, some statutory (conferred by some act), and some are interpreted to be implied. The checks & balances is supposed to be an interplay between these bodies along with the constitutional posts such as CAG, CEC etc. First of all you need to understand is running a civil society of humongous populations without there being a bloodbath in stages of transfer of power is has not been historically easy, and even now shouldn't be taken for granted. Legislature & Executive are political organs and India being a democratic republic, will be selected through elections only. The anomaly in our system is the judiciary which has carved itself a space where they are not directly appointed by the executive/elected bodies. Even the constitutional posts are filled up by different committees consisting of political members (which have some members of opposition as well). Running a country is not a pure science/math which can be solved through calculations, neither can there be one solution. Sure there are fundamental problems which need to be addressed, but as it has been said \"democracy is the worst form of government – except for all the others that have been tried\" will hold true until we have a better solution on how to run countries. I don’t live in India jesus they discriminate based on whether you eat meat or not? Cheating on partner is legal. Same sex marriage is not allowed. Wow. There are a lot of laws that need to be changed in accordance with Indian culture and customs. Considering this is very much Progressive cause globally, I would expect Left liberal parties to be forefront bringing this right to reality.I am just curious why havent been more vocal about it or atleast fight for it ? >Police fears courts and this judgement gives power to members of lgbtq to represent their case strongly in court. Once a precent is set police will stop arresting people for same sex relationship. There are multiple supreme court and high court judgements saying no one can be punished in the name of sedition simply based on their speech, and that the goverment has to prove the actions of the accused led to violence against the state. The same supreme court and high courts routinely make impotent statements about lack evidence and allow the government to continue incarcerating political opponents for years without evidence under sedition and draconian uapa. The victims eventually get acquitted, but the prices itself is punishment. >It is not open to state to oppress or discriminate against queer folks. Yet, the 100s of laws thar you're talking about do exactly that, and the court has chosen to do diddly squat about that. Exactly. Please! Don't compare sedition laws with section 377 kind of laws. Sedition laws have very strict provisions for bail. Hearing for bail will not even come till arguments have started and defense lawyers start plugging holes in evidence which can easily take 5-10 years. In cases similar to 377 judges can start pasting police from the first hearing. Bhai forget transgender if you have to pretend, you can pretend to be man and woman.. And such kind of cases have happened in the past. However, your boat hit the rock called inheritance. There would be more stakeholders in this circus and this issue will come out in the arguments. Bill is already in the Parliament, the debate was halted because of this case.. Now I think it will be brought back to the floor, but i guess it will take a lot of time to come out for debate because the bill will have to be amended based on the SC decision and reintroduced. Because there's a difference between being left and being Liberal. The opposition, left is far from liberal, and has a big chunk of voter base which will vehemently oppose any advancements towards the recognition of same sex marriage. INC is not a left wing party. It is not very liberal either, it's just more liberal compared to BJP. Even others like NCP, AAP are not as liberal as compared to their equivalents in the West. Yeah that’s why they’re saying it SHOULD enforced >Sedition laws have very strict provisions for bail. I repeat. The supreme court has already passed multiple judgements reading down sedition law to decriminalise speech. >defense lawyers start plugging holes in evidence which can easily take 5-10 years. Supreme court routinely points out that the government has zero evidence, and then fails to give bail. Gotcha, thanks for the response. I've seen certain activists suggest that the case would have worked better if the community had been more involved/there were better ways to strategize and go about it. But does it push back or delay working on the bill? Compare apples with apples. Police had no role in that murder and because of pressure of courts police had to arrest the MLA who otherwise had the police force in his pocket, this basically reiterates my point. Also the guy who died was a carrier criminal who worked for the same MLA. > This is not just India, it is literally every democracy everywhere. No, it is in parliamentary democracies. &nbsp; In USA for example, the legislature and executive are entirely separate. Imagine if they gave reservation to queers, everyone will lose their minds. More like can't, you can't make someone respect or even acknowledge you if they don't like it, it's their right as well. Poor women /Dalit women are often brutalised /discriminated against/ dismissed by the police. And that's not because the courts haven't made up their minds as to whether Dalits or women have the same rights as others. So this judgement isn't going to achieve what you're talking about anymore that the striking of 377. TIL I have a big gaping hole in my knowledge of politics. Thanks. On basic analysis, it appears that the US system although a better nominal separation of powers, has been hijacked by the 2 party system (which I suppose is not part of the formal framework / constitution) and by lobbying, i.e. formal campaign donations to representatives as well as to governor and presidential campaigns. Also, the head of the executive, POTUS can influence or appoint the heads of the judiciary, and there is the all-encompassing Presidential Order which makes a single man extremely powerful. These are the glaring bugs immediately visible in that form of democracy. There may be more, but I need to do a lot of reading. Yeh chutiyolog ko pahile sab maloom tha toh Itna din time pass kyu Kiya Hundreds of millions will declare themselves as gay or lesbians to attain jobs or seats in colleges before the outrage even happens By this logic no laws work in any country. This does not mean a country should stop redefining/creating laws. Tool Where do you draw a line for this, Not against same sex marriage but, seeing the issues in western countries, where do you draw a line. Once same sex marriage is allowed then next some other right, eventually we have a minor kids undergoing sex transition. Want it to be part of the education system, Want new pronouns. What after giving same sex marriage rights, That's my fear. Yes. But they don't discriminate based on skin color though, like in the other parts of the world. Such constructs are completely made up by society and can look totally weird for an outsider. I never said countries should stop revising laws. Never said new laws are pointless either. But the point about this one putting an end to police brutality doesn't make sense because if it has been occuring even after 377 was struck it's going to continue to occur. When a gay couple is harassed by a cop it's not always on the grounds of 'unnatural sex'. They come up with other ways. I don't understand how this particular judgement is going to weed out homophobia anymore than the one from five years ago. Lol, no. If that was the case, police brutality would be low. Corruption within police would be low. Definitely not the case. You'll find a bunch of BJP supporters campaigning and claiming that their beloved party supports LGBTQ community at election time. Funny, their actions don't reflect it. That actually is a judicial and government problem. Discrimination against people on the basis of their sexuality and gender can be decriminalised and enforced. If you wait around for people to approve, you'll never get anywhere. \"Better to ask for forgiveness than for permission\" Of course in reality, don't ask for forgiveness or permission, because LGBTQ people don't need other people's approval or forgiveness to exist and live their life. It is their right as humans. And judiciary. And government. Worse still, Tey renting as a cat owner........even the dog owners will be against you. No it is not. Also you are confused about your terms. Govt already includes legislature, executive and judiciary. Making laws and ‘giving rights’ is only purview of legislature. You're not wrong. But I'd argue even doing that wouldn't help. There's already discrimination against Muslims, bachelors (male and female), etc, when it comes to renting. But when you say private property owners must be forced to do something they don't want to, that opens another can of worms relating to rights. Great You’re grasping at straws bud. Take a breather. >Police had no role in that murder Ffs, the cops tortured the father of the rape victim to death in police custody to try to get the victim to withdraw the rape case. Fear of court didn't stop the cops from literally killing the father. No one has been punished for that murder. The rapist was punished for the rape, because the victim continued fighting even after the father's murder. Even after the attempt on her own life, when a truck with a number plate deliberately hidden belonging to the rapist's friend ran over the car carrying her, her aunt and her lawyer. >Also the guy who died was a carrier criminal who worked for the same MLA. What? Thanks for pointing out the correction. But no, renting isn't a gray issue. It is discrimination to prevent certain people from being able to rent and have a roof over their heads. House owners aren't entitled to discrimination. Renting is a commercial activity, and like all commercial activities, discrimination on any basis must be forbidden. Umm the landlord can just deny that he was discriminating and he isn't obliged to give reason why they doesn't let someone use *thier* property. \"constitunoal right\" ... that's a hollow argument. if there was no mention of constitunoal rights in the \"constitution\" what would be your premise be for pushing this isue then? > CJI has drawn a clear line on basic human rights and limitations of the court. In stark contrast to BJP govt which always tries to overreach. Say something relevant or stay quiet. The other guy already said everything relevant enough yet you keep blabbering on here. Your argument sounds like this - “I never said laws bad. But police brutality doesn’t stop with a law because they will continue to do it anyway, with different citations.” What’s even the purpose of this argument? It’s completely a moot point. Ofcourse laws which are a figment of social construct don’t have absolute resolutions in reality. Just stick to the topic at hand instead of trying to sound smart. Bringing forth the edge case exceptions to a rule doesn’t invalidate anything. You must be terribly insecure if you can't disagree with others without being unnecessarily rude and combative. The forced condescension gives it away. The other guy did not substantiate it with anything relevant but I can see why you'd think so . Do *you* have anything relevant to say ,or did you jump in as his lackey? I did not say this judgement is pointless because it doesn't offer absolute solutions. The OP on the other hand claimed that its a \"full stop on police brutality \" when it comes to same sex relationships. Do you know what full stop means ? They claimed it's if not an absolute resolution, a definitive one. Which is not true in any sense whatsoever. His explanation was that the cops 'fear' courts so the attitudes of high ranking officers are going to trickle down to the hawaldars and there would be no more harassment . You are delusional if you think the instances of harassment of women, or LGBT folks by the police are \"edge case exceptions \" in a society with an insanely corrupt law and order system and pervasive homophobia and misogyny. Trans people Gay people who are not straight passing are frequently picked on by the cops. From low key rude behaviour to full on abuse there's a range of anti LGBT behaviour from their side that hasn't changed post the 2018 judgement and it's naive to think wee platitudes from Chandrachud and Co or the right to adopt are going to fix it. Lesbian women are often infantalised and told to go back to their families. When the families of gay people file fake charges of abduction against their partners ,the cops side with the families tell the gay person in question to go back or even \"get treatment\". Trans women are stripped or prodded in the crotch area to 'reveal' their gender. My point doesn't become moot just because your delusional ass thinks so. Some of us don't have to 'try' to sound smart but clearly that's not the case with you. That you fail even after trying is even more amusing. Blah blah blah. Stop reading into things to an excessive degree just to try and have some kind of an argument. Instead of trying to understand the gist of what someone tries to say, on the contrary you try your best to argue with a moot point, which is, Ofcourse there’s no social construct solution in absolute measure to a real world problem. Also the cases against minorities aren’t the edge cases. But to assume that there’s no trickle down of any kind of upliftment with a law is. Which is what you’re implying in all your comments. That the law itself is useless because those in power who have to be bigoted will still be; that’s simply not true. It is a very much a definitive solution, and your disagreement on this is clearly based on your trust battery instead of any kind of reasoning. Just how many people do you need to tell you the same thing in multiple comments? I didn't 'imply' anything. I *stated* facts. Very clearly. In response to a claim which is not true. Now you've come up with another weak ass justification about the 'gist' of it. Never said the judgement is thoroughly useless and what my statement 'sounds like ' to you is your problem . The judgement is useful within its context ,not beyond. And not any more useful than the 2018 judgement when it comes to police brutality like I said before. The cops are not gonna go \" Oh ..so being gay is not just legal but now gay couples can ADOPT too, this is some eye -opening shit so let's start being nice to the gays \". If anything it's going to make things worse, because by denying the right to marry, they've basically said gay people are beneath straight people and that would make every homophobe in the country feel at least slightly validated. It is NOT a definitive solution. It is not any solution for problem the OP claims to have been solved. Any number of people like you can make any number of half baked justifications for this absurd claim but it's not going to make any difference. It's as ridiculous as saying the Women's Reservation Bill is going to stop the harassment of women on the streets because the change in the status quo among politicians is going to 'trickle down' and is going to wipe out the issue. YOU are reading too much into the judgement but you're too stupid and defensive to realise that. \" Extraneous web of words \". In other words you don't understand what I've said ,and you didn't understand what the other guy had said. But you had to butt in and make a fool of yourself. Women legislators lead to more favourable policies for women that work to get equal rights for them, better enforcement of such rights, and working as a measure to stop harassment amongst other societal issues faced by them. What context is it that you’re speaking of? Setting up legal precedents that even recognize the LGBTQ community create top to bottom pressure in a manner of precedent. You don’t make the bad guys turn good, you just make them scared to be bad in public. That’s the context of all criminal law might I add. How is assuming this, which is something the other guy stated as well, outside whatever this supposed context is supposed to be? Also, denied the right to marry? Read the title. While SC might be inclined towards this, it has to come from legislation, and is outside the ambit of SC. That’s the gist of it. It’s also very easy to make tall claims like you’re stating facts, and everyone else is wrong. You should think about what you think by yourself and for yourself, while trying to keep an open mind to the other person. I’m trying to do that to you but you come across as quite inconsistent, so perhaps stick to self reflection and re-read the whole thread with a fresh mind instead of trying to convince anyone else because you’re not doing a very good job at it. Rich of you to talk about keeping an open mind when you've been nothing but rude confrontational and dismissive right from the start. Being the insecure little hypocrite you are. You still have no clue as to what I said and in relation to what it was said but you keep droning on like I kicked you in the clit. The conversation was about a systemic problem -harassment of vulnerable people by the police where the law and order system is extremely inefficient corrupt and understaffed. The OP claimed a full stop has been laid to it and that's not true. And my response was that this judgement does not do anything the previous one didn't . How hard is that for you to understand? Do you even hear yourself? From claiming this particular judgement IS a definitive fix for the problem you've gone to \" well eventually....because it sets a precedent \". So now it's a precedent . I love how you ,after four or five rants havent yet said how this particular judgement carries more weight than the previous one which failed to do what the OP says has been done. Yet I'm the one grasping for straws ? Haha. If you are desperate to preach about the glories of tiny legislative changes that pay off in the long run do that elsewhere ; you've squeezed yourself into the wrong thread. I didn't try to convince anyone least of all you. I expressed my opinion about the immediate changes somebody claimed to have been brought about. . If you can't deal with it try burying your face in sand or something. Your audacity to tell me about the need for self reflection is laughable."
}