{
    "id": "1bvn1ob",
    "title": "People of India , What are your opinion on philosophy of Georgism (Free Land, Free trade , Free man) ?",
    "url": "https://www.reddit.com/r/india/comments/1bvn1ob/people_of_india_what_are_your_opinion_on/",
    "selftext": "I think this post can be considered under Policy/Economy but please correct me if I had to do some other flair like political since Economy and politics are very correlated?  \n\n\nBasically Henry George was awesome guy in america who was also third most famous guy in america at that time after I think einstein and thomas ford (I suppose?)\n\nHe wrote a book called progress and poverty which I am going to read after sometime. In that George talked about a philosophy of Georgism.\n\nI came to know about georgism but I think most Indians don't know about it. I saw some recent posts on r/IndiaTax with the frustation of tax and I think that India should maybe follow some other basic tax system but that is not the topic of today's discussion.  \n\n\nHere is the definition of Georgism according to wikipedia.   \n\n\n>**Georgism**, also called in modern times **Geoism**,[\\[3\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-3)[\\[4\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-4) and known historically as the **single tax movement**, is an [economic ideology](https://en.wikipedia.org/wiki/Economic_ideology) holding that people should own the value that they produce themselves, while the [economic rent](https://en.wikipedia.org/wiki/Economic_rent) derived from [land](https://en.wikipedia.org/wiki/Land_(economics))—including from all [natural resources](https://en.wikipedia.org/wiki/Natural_resources), the [commons](https://en.wikipedia.org/wiki/Commons), and urban locations—should belong equally to all members of society.[\\[5\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-5)[\\[6\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-Heavey-6)[\\[7\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-7) Developed from the writings of American economist and social reformer [Henry George](https://en.wikipedia.org/wiki/Henry_George), the Georgist paradigm seeks solutions to [social](https://en.wikipedia.org/wiki/Social_issue) and [ecological problems](https://en.wikipedia.org/wiki/Ecological_problems), based on principles of land rights and public finance that attempt to integrate [economic efficiency](https://en.wikipedia.org/wiki/Economic_efficiency) with [social justice](https://en.wikipedia.org/wiki/Social_justice).[\\[8\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-8)[\\[9\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-9) \n\nBasically it means that there is only one tax which is on land. I know this sounds a bit weird but young generation can agree with me that we are unable to own housing because of corruption / black money and other reasons.. , most farmers are working in disguised unemployed in farming sector but are still doing it.. , I think georgism can make them increase their efficiency . Georgism isn't socialist but rather a free trade movement. Maybe instead of having no taxes other than land , we can decrease the taxes very much on things other than land to nominal like 5-6% while focus on land rent till 10-12% ? This way a lot of overvaluation of land might also be able to decrease.   \n\n\nReally interested to hear your thoughts",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1712237058.0,
    "convurl": "https://external-preview.redd.it/zTvvYaU8QHqYdt3yiRbEuzwiwEpwLsUcAeHGgomc28k.jpg?auto=webp&s=a6ea4e70fb79dc509d20b4441a86034994f3bec3",
    "comments": [
        "It doesn't take off cause all the richest and most powerful people in the land are also the biggest collectors of rent. You can imagine how the stories goes when someone tells them - hello we need some off that rent you are collecting. \n\nBanking system also benefits from low land tax/property tax cause a big source of their income is mortgages. And they play a big role in making cash flow towards areas with least land/rent tax. \n\nSo if you can find a way to get rid of the banks then you might have a shot.",
        "Some history for you - [https://michael-hudson.com/2022/06/economic-rent-and-exploitation/](https://michael-hudson.com/2022/06/economic-rent-and-exploitation/)",
        "Westan ekaanami kennot bi blindly applied to India /s",
        " George, who?",
        "Banks get a lot of money out of home loans. If home valuations fall because of the land value tax, there will be a ripple effect in the economy. \n\nHowever, I do appreciate the idea of a land value tax and think it needs to happen. Unfortunately, the ones to lose money in such a tax are the ones with the most power, so it aint happening unless there is a mass revolution for its favour.",
        "[https://en.wikipedia.org/wiki/Henry\\_George](https://en.wikipedia.org/wiki/Henry_George) This guy , he was one of the most influential man in his time. He wrote progress and poverty.",
        "Yup , it ain't happening but who said we can't revolt ? Americans are already thinking because of their sky high rent prices and taxes. We are getting pissed by taxes even more than americans while at the same time there is virtually not much being done with those taxes simply because the poor and rich don't pay much taxes but the middle class does. \n\nSo basically we are getting f\\* by all holes , We need to be radical to get even a bit of conservation change.\n\nCurrently the govt. has put 0% tax on agriculture produce , I think this needs to change. It would only impact the big players of agriculture which is nice. Another thing is to have inheritance tax on land (I think) . For start , we could have this tax on the rich people and later on introduce it to the poor while at the same time to decrease gst on things like books / medical / research instruments."
    ],
    "cleaned_text": "people india opinion philosophy georgism free land free trade free man think post considered policyeconomy please correct flair like political since economy politics correlated basically henry george awesome guy america also third famous guy america time think einstein thomas ford suppose wrote book called progress poverty going read sometime george talked philosophy georgism came know georgism think indians dont know saw recent posts rindiatax frustation tax think india maybe follow basic tax system topic todays discussion definition georgism according wikipedia georgism also called modern times geoismhttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenote known historically single tax movement economic ideologyhttpsenwikipediaorgwikieconomicideology holding people value produce economic renthttpsenwikipediaorgwikieconomicrent derived landhttpsenwikipediaorgwikilandeconomicsincluding natural resourceshttpsenwikipediaorgwikinaturalresources commonshttpsenwikipediaorgwikicommons urban locationsshould belong equally members societyhttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenoteheaveyhttpsenwikipediaorgwikigeorgismcitenote developed writings american economist social reformer henry georgehttpsenwikipediaorgwikihenrygeorge georgist paradigm seeks solutions socialhttpsenwikipediaorgwikisocialissue ecological problemshttpsenwikipediaorgwikiecologicalproblems based principles land rights public finance attempt integrate economic efficiencyhttpsenwikipediaorgwikieconomicefficiency social justicehttpsenwikipediaorgwikisocialjusticehttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenote basically means one tax land know sounds bit weird young generation agree unable housing corruption black money reasons farmers working disguised unemployed farming sector still think georgism make increase efficiency georgism isnt socialist rather free trade movement maybe instead taxes land decrease taxes much things land nominal like focus land rent till way lot overvaluation land might also able decrease really interested hear thoughts ",
    "cleaned_title": "people india opinion philosophy georgism free land free trade free man",
    "cleaned_selftext": "think post considered policyeconomy please correct flair like political since economy politics correlated basically henry george awesome guy america also third famous guy america time think einstein thomas ford suppose wrote book called progress poverty going read sometime george talked philosophy georgism came know georgism think indians dont know saw recent posts rindiatax frustation tax think india maybe follow basic tax system topic todays discussion definition georgism according wikipedia georgism also called modern times geoismhttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenote known historically single tax movement economic ideologyhttpsenwikipediaorgwikieconomicideology holding people value produce economic renthttpsenwikipediaorgwikieconomicrent derived landhttpsenwikipediaorgwikilandeconomicsincluding natural resourceshttpsenwikipediaorgwikinaturalresources commonshttpsenwikipediaorgwikicommons urban locationsshould belong equally members societyhttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenoteheaveyhttpsenwikipediaorgwikigeorgismcitenote developed writings american economist social reformer henry georgehttpsenwikipediaorgwikihenrygeorge georgist paradigm seeks solutions socialhttpsenwikipediaorgwikisocialissue ecological problemshttpsenwikipediaorgwikiecologicalproblems based principles land rights public finance attempt integrate economic efficiencyhttpsenwikipediaorgwikieconomicefficiency social justicehttpsenwikipediaorgwikisocialjusticehttpsenwikipediaorgwikigeorgismcitenotehttpsenwikipediaorgwikigeorgismcitenote basically means one tax land know sounds bit weird young generation agree unable housing corruption black money reasons farmers working disguised unemployed farming sector still think georgism make increase efficiency georgism isnt socialist rather free trade movement maybe instead taxes land decrease taxes much things land nominal like focus land rent till way lot overvaluation land might also able decrease really interested hear thoughts",
    "cleaned_comments": "doesnt take cause richest powerful people land also biggest collectors rent imagine stories goes someone tells hello need rent collecting banking system also benefits low land taxproperty tax cause big source income mortgages play big role making cash flow towards areas least landrent tax find way get rid banks might shot history httpsmichaelhudsoncomeconomicrentandexploitationhttpsmichaelhudsoncomeconomicrentandexploitation westan ekaanami kennot bi blindly applied india george banks get lot money home loans home valuations fall land value tax ripple effect economy however appreciate idea land value tax think needs happen unfortunately ones lose money tax ones power aint happening unless mass revolution favour httpsenwikipediaorgwikihenrygeorgehttpsenwikipediaorgwikihenrygeorge guy one influential man time wrote progress poverty yup aint happening said cant revolt americans already thinking sky high rent prices taxes getting pissed taxes even americans time virtually much done taxes simply poor rich dont pay much taxes middle class basically getting f holes need radical get even bit conservation change currently govt put tax agriculture produce think needs change would impact big players agriculture nice another thing inheritance tax land think start could tax rich people later introduce poor time decrease gst things like books medical research instruments",
    "light_cleaned_title": "People of India , What are your opinion on philosophy of Georgism (Free Land, Free trade , Free man) ?",
    "light_cleaned_selftext": "I think this post can be considered under Policy/Economy but please correct me if I had to do some other flair like political since Economy and politics are very correlated? Basically Henry George was awesome guy in america who was also third most famous guy in america at that time after I think einstein and thomas ford (I suppose?) He wrote a book called progress and poverty which I am going to read after sometime. In that George talked about a philosophy of Georgism. I came to know about georgism but I think most Indians don't know about it. I saw some recent posts on r/IndiaTax with the frustation of tax and I think that India should maybe follow some other basic tax system but that is not the topic of today's discussion. Here is the definition of Georgism according to wikipedia. >**Georgism**, also called in modern times **Geoism**,[\\[3\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-3)[\\[4\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-4) and known historically as the **single tax movement**, is an [economic ideology](https://en.wikipedia.org/wiki/Economic_ideology) holding that people should own the value that they produce themselves, while the [economic rent](https://en.wikipedia.org/wiki/Economic_rent) derived from [land](https://en.wikipedia.org/wiki/Land_(economics))—including from all [natural resources](https://en.wikipedia.org/wiki/Natural_resources), the [commons](https://en.wikipedia.org/wiki/Commons), and urban locations—should belong equally to all members of society.[\\[5\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-5)[\\[6\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-Heavey-6)[\\[7\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-7) Developed from the writings of American economist and social reformer [Henry George](https://en.wikipedia.org/wiki/Henry_George), the Georgist paradigm seeks solutions to [social](https://en.wikipedia.org/wiki/Social_issue) and [ecological problems](https://en.wikipedia.org/wiki/Ecological_problems), based on principles of land rights and public finance that attempt to integrate [economic efficiency](https://en.wikipedia.org/wiki/Economic_efficiency) with [social justice](https://en.wikipedia.org/wiki/Social_justice).[\\[8\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-8)[\\[9\\]](https://en.wikipedia.org/wiki/Georgism#cite_note-9) Basically it means that there is only one tax which is on land. I know this sounds a bit weird but young generation can agree with me that we are unable to own housing because of corruption / black money and other reasons.. , most farmers are working in disguised unemployed in farming sector but are still doing it.. , I think georgism can make them increase their efficiency . Georgism isn't socialist but rather a free trade movement. Maybe instead of having no taxes other than land , we can decrease the taxes very much on things other than land to nominal like 5-6% while focus on land rent till 10-12% ? This way a lot of overvaluation of land might also be able to decrease. Really interested to hear your thoughts",
    "light_cleaned_comments": "It doesn't take off cause all the richest and most powerful people in the land are also the biggest collectors of rent. You can imagine how the stories goes when someone tells them - hello we need some off that rent you are collecting. Banking system also benefits from low land tax/property tax cause a big source of their income is mortgages. And they play a big role in making cash flow towards areas with least land/rent tax. So if you can find a way to get rid of the banks then you might have a shot. Some history for you - [https://michael-hudson.com/2022/06/economic-rent-and-exploitation/](https://michael-hudson.com/2022/06/economic-rent-and-exploitation/) Westan ekaanami kennot bi blindly applied to India /s George, who? Banks get a lot of money out of home loans. If home valuations fall because of the land value tax, there will be a ripple effect in the economy. However, I do appreciate the idea of a land value tax and think it needs to happen. Unfortunately, the ones to lose money in such a tax are the ones with the most power, so it aint happening unless there is a mass revolution for its favour. [https://en.wikipedia.org/wiki/Henry\\_George](https://en.wikipedia.org/wiki/Henry_George) This guy , he was one of the most influential man in his time. He wrote progress and poverty. Yup , it ain't happening but who said we can't revolt ? Americans are already thinking because of their sky high rent prices and taxes. We are getting pissed by taxes even more than americans while at the same time there is virtually not much being done with those taxes simply because the poor and rich don't pay much taxes but the middle class does. So basically we are getting f\\* by all holes , We need to be radical to get even a bit of conservation change. Currently the govt. has put 0% tax on agriculture produce , I think this needs to change. It would only impact the big players of agriculture which is nice. Another thing is to have inheritance tax on land (I think) . For start , we could have this tax on the rich people and later on introduce it to the poor while at the same time to decrease gst on things like books / medical / research instruments."
}