{
    "id": "1avdqur",
    "title": "Chandigarh Mayor Polls Live Updates: SC says 8 'defaced' ballots to be treated as valid, orders fresh counting - The Times of India",
    "url": "https://timesofindia.indiatimes.com/india/chandigarh-mayor-polls-live-updates-sc-hearing-bjp-leader-manoj-sonkar-quits-as-chandigarh-mayor-mayoral-election-aap-defection/liveblog/107806289.cms",
    "selftext": ".",
    "flair": "Law & Courts",
    "score": 284,
    "num_comments": 21,
    "created_utc": 1708421744.0,
    "convurl": "https://external-preview.redd.it/2C-mycorCdas2Uy4JYvx8xUNc-v3GppBZv1IAcNBMoM.jpg?auto=webp&s=ae2b8b776f857676a398fabc74066d9f8292a931",
    "comments": [
        "Massive, *massive* win for AAP and opposition.",
        "NO. This is not a massive win for AAP or Cong or opposition. This is massive win for the constitution of India. Massive win for faith in supreme court. Massive win for democracy.",
        "The papers will be torn or doubly marked. Go to re-election after attempting to count. BJP wins. \n\n99.99% likely. 3 AAP members were all inspired by the hard work that Modiji has done for the poor people and the dalit and decided to join BJP.",
        "Is me bhi sudama aur Krishna ajayenge",
        "Tomorrow Modi will use another analogy to mock this too",
        "They should throw him in jail for life as well.",
        "I wonder if at such low level cheating is prevalent \n\nWhat are the chances it ain’t happening or won’t happen at centre ?",
        "The judges have seen the ballots themselves. HC will depute someone to oversee the recounting",
        "It's highly likely such things might happen for Loksabha or Bidhansabha elections also. The mayoral election might just have been test run for them to see how to manipulate the votes.",
        "Too little, too late. 3aap corporators already joined bjp.",
        "BJP won last Chandigarh polls same way as well where votes were counted as invalid.",
        "He will be addressing teachers at a school rally. He will say if teacher while evaluating answer sheet accidentally made a circle on an answer, supreme court will say you are only allowed to give marks not circle answers. And, bhakts will lap it as some absolute truth.",
        "You have no idea how various presidents of various federation are elected.",
        "NDTV abruptly cuts Kejriwal's press conference after SC verdict where he was clearly preempting that this type of election rigging will happen during general election also.",
        "Give me some idea at least",
        "I think BJP bought two AAP counsellors so they are still going to form the governing body there.\n\nBut at least SC tried to be fair this time.",
        "Probably why the court didn't order a rerun. If the ballots are counted as is, then it puts the joint AAP candidate in power.\n\nI don't know enough about how Chandigarh works to know if the corporators deflecting will other issues, but for now this will mean the AAP candidate will become mayor regardless of defections. Assuming the returning offer didn't do something strange such as destroy the defaced ballots or something",
        "This is NDTV's ache din",
        "Beyond the standard BJP gunday hain, has anyone reported on why a Chandigarh Mayoral election became such a high stakes one? Is it driven by some local mawali politicians? I can’t imagine Vomit Shah concerning himself with such low stakes bullshit when there’s a general election coming up."
    ],
    "cleaned_text": "chandigarh mayor polls live updates sc says defaced ballots treated valid orders fresh counting times india  ",
    "cleaned_title": "chandigarh mayor polls live updates sc says defaced ballots treated valid orders fresh counting times india",
    "cleaned_selftext": "",
    "cleaned_comments": "massive massive win aap opposition massive win aap cong opposition massive win constitution india massive win faith supreme court massive win democracy papers torn doubly marked go reelection attempting count bjp wins likely aap members inspired hard work modiji done poor people dalit decided join bjp bhi sudama aur krishna ajayenge tomorrow modi use another analogy mock throw jail life well wonder low level cheating prevalent chances aint happening wont happen centre judges seen ballots hc depute someone oversee recounting highly likely things might happen loksabha bidhansabha elections also mayoral election might test run see manipulate votes little late aap corporators already joined bjp bjp last chandigarh polls way well votes counted invalid addressing teachers school rally say teacher evaluating answer sheet accidentally made circle answer supreme court say allowed give marks circle answers bhakts lap absolute truth idea various presidents various federation elected ndtv abruptly cuts kejriwals press conference sc verdict clearly preempting type election rigging happen general election also give idea least think bjp bought two aap counsellors still going form governing body least sc tried fair time probably court didnt order rerun ballots counted puts joint aap candidate power dont know enough chandigarh works know corporators deflecting issues mean aap candidate become mayor regardless defections assuming returning offer didnt something strange destroy defaced ballots something ndtvs ache din beyond standard bjp gunday hain anyone reported chandigarh mayoral election became high stakes one driven local mawali politicians cant imagine vomit shah concerning low stakes bullshit theres general election coming",
    "light_cleaned_title": "Chandigarh Mayor Polls Live Updates: SC says 8 'defaced' ballots to be treated as valid, orders fresh counting - The Times of India",
    "light_cleaned_selftext": ".",
    "light_cleaned_comments": "Massive, *massive* win for AAP and opposition. NO. This is not a massive win for AAP or Cong or opposition. This is massive win for the constitution of India. Massive win for faith in supreme court. Massive win for democracy. The papers will be torn or doubly marked. Go to re-election after attempting to count. BJP wins. 99.99% likely. 3 AAP members were all inspired by the hard work that Modiji has done for the poor people and the dalit and decided to join BJP. Is me bhi sudama aur Krishna ajayenge Tomorrow Modi will use another analogy to mock this too They should throw him in jail for life as well. I wonder if at such low level cheating is prevalent What are the chances it ain’t happening or won’t happen at centre ? The judges have seen the ballots themselves. HC will depute someone to oversee the recounting It's highly likely such things might happen for Loksabha or Bidhansabha elections also. The mayoral election might just have been test run for them to see how to manipulate the votes. Too little, too late. 3aap corporators already joined bjp. BJP won last Chandigarh polls same way as well where votes were counted as invalid. He will be addressing teachers at a school rally. He will say if teacher while evaluating answer sheet accidentally made a circle on an answer, supreme court will say you are only allowed to give marks not circle answers. And, bhakts will lap it as some absolute truth. You have no idea how various presidents of various federation are elected. NDTV abruptly cuts Kejriwal's press conference after SC verdict where he was clearly preempting that this type of election rigging will happen during general election also. Give me some idea at least I think BJP bought two AAP counsellors so they are still going to form the governing body there. But at least SC tried to be fair this time. Probably why the court didn't order a rerun. If the ballots are counted as is, then it puts the joint AAP candidate in power. I don't know enough about how Chandigarh works to know if the corporators deflecting will other issues, but for now this will mean the AAP candidate will become mayor regardless of defections. Assuming the returning offer didn't do something strange such as destroy the defaced ballots or something This is NDTV's ache din Beyond the standard BJP gunday hain, has anyone reported on why a Chandigarh Mayoral election became such a high stakes one? Is it driven by some local mawali politicians? I can’t imagine Vomit Shah concerning himself with such low stakes bullshit when there’s a general election coming up."
}