{
    "id": "14xb8zh",
    "title": "'Free alcohol servings in morning, evening': Demands after Karnataka Budget",
    "url": "https://www.indiatoday.in/india/story/karnataka-udupi-free-alcohol-protest-amid-rising-prices-2405150-2023-07-11",
    "selftext": "Give a man a fish & he will ask a free fish every day",
    "flair": "Politics",
    "score": 1,
    "num_comments": 11,
    "created_utc": 1689128789.0,
    "convurl": "https://external-preview.redd.it/xjJO0y9gdG7TL4tMMO0qoIji-1uCs1iLpYk0bNQH-ZI.jpg?auto=webp&s=fac1a354ccffbbcdd7ae9c7cb4becb5d7c0dd538",
    "comments": [
        "If there can be *free speech*, why can't there be *free beer*?",
        "With so many freebies, what's one more",
        "Ambedkar jee watching this:\n\nhttps://preview.redd.it/dm08dp6f8hbb1.jpeg?width=680&format=pjpg&auto=webp&s=8baa3ff7f20a2aa6b09130d905560751f896955a",
        "Why not in lunch?",
        "Free beer is next to the ultimate freebie.\nTo top that they'll have to go to free sex. Or free money.",
        "Why not just replace it with water, we need to save water",
        "Did anyone read the article? It says there is a free liquor scheme in Karnataka. Is this true? Couldn't find anything online",
        "This comment is the ultimate example of why there shouldn't be free speech.\n\n/s",
        "Because there is no such thing as a free lunch"
    ],
    "cleaned_text": "free alcohol servings morning evening demands karnataka budget give man fish ask free fish every day ",
    "cleaned_title": "free alcohol servings morning evening demands karnataka budget",
    "cleaned_selftext": "give man fish ask free fish every day",
    "cleaned_comments": "free speech cant free beer many freebies whats one ambedkar jee watching lunch free beer next ultimate freebie top theyll go free sex free money replace water need save water anyone read article says free liquor scheme karnataka true couldnt find anything online comment ultimate example shouldnt free speech thing free lunch",
    "light_cleaned_title": "'Free alcohol servings in morning, evening': Demands after Karnataka Budget",
    "light_cleaned_selftext": "Give a man a fish & he will ask a free fish every day",
    "light_cleaned_comments": "If there can be *free speech*, why can't there be *free beer*? With so many freebies, what's one more Ambedkar jee watching this: Why not in lunch? Free beer is next to the ultimate freebie. To top that they'll have to go to free sex. Or free money. Why not just replace it with water, we need to save water Did anyone read the article? It says there is a free liquor scheme in Karnataka. Is this true? Couldn't find anything online This comment is the ultimate example of why there shouldn't be free speech. /s Because there is no such thing as a free lunch"
}