{
    "id": "1516911",
    "title": "RaGa's YouTube channel is actually getting interesting",
    "url": "https://www.reddit.com/r/india/comments/1516911/ragas_youtube_channel_is_actually_getting/",
    "selftext": "I'm not taking sides, almost don't want to tag this post as political but honestly just see the videos. Don't even have to support him, but the content is just becoming so touching. Real people real stories real events no posing. Sometimes he does ask about government and how they're doing but I guess that's alright considering the constant posing and fake stuff in mainstream media. \n\nI just want to know without taking sides, just from a content perspective what do you guys think?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689513917.0,
    "convurl": "https://external-preview.redd.it/q0fL1SU6ktB8XyluRSDTjL2QCTlBUuehiCfdh7JTRtA.jpg?auto=webp&s=6dde89cee7261a38b5d3ada18065558be71a5742",
    "comments": [
        "Where's the link ?",
        "I'm not promoting it. Somehow nowadays even speaking about any opposition candidate means I'm suddenly a flagbearer of that party",
        "It''s sad you have to give so many disclaimers in your post. \n\nThere's nothing wrong with being political and taking a side. \n\nI'd go so far as that it was the need of the hour almost a decade ago.\n\nBeing political doesn't mean the discourse has to be the uncivilized and uneducated but that's what happens when most people who are willing to be political are the uncivilized and uneducated.\n\nJust because political discourse has been dominated by the lowest common denominator doesn't mean the rest of us have to bow out.",
        "I know, but political discourse in India is dead. Somehow intellectual has become a derogatory term. So I'd rather just stay out of it all.",
        "After Karnataka elections they understood value of good/bad PR. And this is irrelevant to judge his leadership abilities, he is inexperienced twenty years back he is inexperienced today.",
        "There's nothing wrong with being political. Being political is the need of the hour in fact.",
        "The videos are really nice and well edited. I feel that He is a very down to earth guy and genuine person who wants to help. Seriously never in a million years I would have thought that Papu might be one of my favourite Indian youtubers.",
        "He sure has upped his SM game , at they end of the day u have to be a good influencer to reach to the masses which is what RAGA and his team were missing till now",
        "There is nothing wrong with taking the right (political left) side. RaGa is fighting the good fight for Muslims and Christians against the Nazis. Please spread his word far and wide. Subscribe!",
        "In the current state of our country Rahul Gandhi can try to diffuse a bomb by himself and save thousands in the process but with BJPs cash might and lacs of rabid it cell trolls, Congress won't be coming to power in 2024. All the electoral Bonds that come BJPs way are just too huge to overcome even if other parties unite",
        "He has seriously upped his SM game. His interaction feels genuine and honestly the low bar that BJP has set with their fakery, just basic human decency feels like a grand statement now. I loved the episode featuring him in Khane Main Kya Hai.",
        "Given a choice between selecting murderers, rapists, molestors, misogynists, hypocrites, bigots, selfish and illiterate politician and a normal individual, I would gladly choose an average person who can at least do 60% of the assigned job while being honest. And that person to me is Rahul Gandhi right now.",
        "Relax, it's ok to be political. How can you talk about Rahul Gandhi's YouTube channel without getting into the realm of politics? It's not like he has started a cooking vlog.",
        "Become BJP to defeat BJP - RG",
        "I am very selective in what I watch. Last week I watched his video visiting Karol Bagh mechanics. I didn't expect that to happen.",
        "This was legit very touching, I thought it's just once a while but then today my YouTube suggested a video where he visited haryana farmers, again, he's not rallying, just talking to people and asking them about their life. It's refreshing",
        "It's just the times we live in, when I was vocal it was always me against the room, pretty soon realised that I can't change the atmosphere today. So just go back to staying shush and enjoying my privilege.",
        "It's normal to be political and take sides",
        "I guess we had forgotten that we're supposed to ask questions to political leaders. The trump-Axios interview did and still does give me goosebumps of what journalism is. Then I return to my senses and see what our news channels are. That's it shut out the noise and continue enjoying life.",
        "Sadly true. Though I still don't want Rahul Gandhi as prime minister without him answering why Congress cannot find another PM candidate. But the fact that this guy is willing to be asked questions, just feels new. Especially since we've gone 10 years of only one way communication. The pm commands and everyone else obeys or praises",
        "He is a good human being.",
        "Fair, but my personal experience has been that If you don't say Rahul Gandhi without mentioning pappu, nepotism, libtard, shehzada etc etc. Then you're suddenly the torchbearer of Congress and hence an enemy of BJP, Hindus, and India.",
        "He is actually doing all the right things recently, no wonder BJP is scared. The man showing persistence, courage and is continuosly learning from his mistake. \nHoping for a good fight next year.",
        "Asli ID se aa, rahul",
        "https://www.youtube.com/@rahulgandhi/videos",
        "I think it's too much time he took to train himself, privileged but slow.\nI hope he proves himself against the opposition party and develope his constituency .",
        "I am frequently getting ads of Congress it cells handles being promoted on Twitter and recently they are doing alot of PR. But no substance.\nI won't vote for a guy who hasn't handled any position of power and responsibility to be the PM of India.",
        "Han sahi mae pakad liya Bhai tumne toh, mae Rahul Gandhi hi huun",
        "Yep. The last decade was the completely decade of influencers. I'm sure the next one would be where they roll out mechanisms to target fake or bad influencers. \nHonestly, he gotta be on every social media streaming app famous in India and not just youtube.\nPoliticians need to be on top of the famous and sensible social media trends if they want have their voice heard these days. After all average age of an Indian is still less than 30.",
        "What definition of politics you taking about.",
        "Fan pages",
        "Tell me it's an insta thing and not an OF thing",
        "Tbh its a great channel with quite touching videos as well  . There's the base level of scripting but the interaction feels genuine. Raga is quite good at communicating with people when talking in person and does offer some decent thoughts on the matter.\nIts a refreshing change seeing a politician engaging with real people at the grassroot level in contrast to the comparison in which the politicians are almost likened to be literal gods .",
        "Par ye sub pe thoda bhi right leaning kuch post kar do to ban kar dete hai",
        "I think the latest video is amazing \ncan't wait to see how the women from the haryana village came through and if they liked delhi.\nHe's a really great person hope he becomes the PM. Anyone who talks against him needs to critique themselves really well.\na gentle man like that will soften the hateful and tense air of India.",
        "He is much sane person than almost 95% politicians out there",
        "Chalo MP nahi toh Blogger hi sahi.",
        "He is genuine… makes other politicians look so feku. \n\nThe manipur video he posted. Sheer helplessness in the eyes of those women. And he just listening, no fake tears and no fake emotion, just being there. \n\nIf you are aware about the 2002 pogrom in Gujarat, you could see the parallels there. How one rakthbeej giving rise to many such vile political creatures in every state. \n\nHe is opposite of that. It makes sense if you start to remember 2011 - 12 onwards campaigns to malign his image.\n\nAnd the potency of that campaign is such that even now One feels conscious to active root for him openly on social media. Think about that.",
        "But it is between the supreme leader, who has fought crocodiles when he was young and then gave the crocodiles tea and a guy whose been disqualified from Parliament for making a pun on a name.\n\nWe've only learnt about the childhood of our vishwaguru till now. I want to know the origin story of our 56 inch half man-half lion. So it's going to be the leader of the solar system that I'll be backing in 2024 :)",
        "He's a good man but the people in power are great politicians.",
        "\\*thora",
        "\\*nahin",
        "Also, don't be so shy to take the sides any more. Taking no sides just means empowering the evil.",
        ">Real people real stories real events no posing\n\nAppeal to emotion. This is very likely done to promote him, unless he wants to be the next Sandeep maheshwari.\n\nNothing against appreciating, just don't become attached to Rahul Gandhi when you feel emotion.",
        "Seems too late now though. Since social media is his only outlet and news channels won't show him.",
        "English does not have a \"ड\", so the closest I have usually seen is people using \"d\" instead. Very rarely seen people using \"r\" for that sound.",
        "If Rahul Gandhi became PM in 2014 or 2019, I would have called it neoptism.\n\nBut, if becomes PM in 2024, I would call it a victory. The poor guy was mocked at, humiliated, but still fought, and fought a battle he did not choose.",
        "Couldn't have said it better !",
        "While RAGA is getting better , feel BJP hit a trump card when Smriti Irani, Jaishankar Prasad, and Nitin Gadkari appearing on Beer Biceps.\nWhile the podcast quality might've been low.( Extremely low IMO). The reach and penetration would be much higher.\n\nMayb RAGA approach Mostly Sane for the next interview.",
        "He is like 5 years too late. People are already brainwashed and his channel will be discriminated against by the the companies themselves. i guarantee it.",
        "Smart move by his PR to humanize him. Building on the success of the yatra. \n\nI don't like him. I want the family gone. I don't buy that he's this sensitive, relatable guy - this is a PR construction of dozens of camera guys accompanying him, and editing and music. \n\nEven if he is some nice guy, I can't have somebody parachuting into the post of the prime minister of the largest country in the world. That is just not happening. He needs to have handled real shit. He needs to have been responsible, actually responsible for something where objective measurable results have to be produced and seen. \n\nI don't care that westernised city kids, largely clueless about the country and the overall social texture of it, like him because he's this idealistic, English speaking westernised guy they can relate to. \n\nBeing a competent politician who can get shit done, a hardcore operator, often isn't the whimsical likable sensitive artsy guy that kids get attracted to on socials. Large, complex countries are run by killer sharks, people who have been around and have seen real shit in life. Not by pretentious tourists trying to create a facade of relatibility.",
        "I don't understand what you meant by \"fake influencers\". \n\nBad influencer I understand would be an influencer who's saying things you don't like / agree with / see as healthy for the country.",
        "There are plenty of fake influencers in today's social media scenario. Here I was targetting people who either show off luxurious lifestyle but may be neck deep in debt, or crypto chicks on twitter, or people who sell their formula and stuff.",
        "I like Rahul Gandhi - he's a good man but personally, I find him incompetent. I admire him as a person though, but I feel that for the INC to ultimately reform, they need to get rid of the prominence of the Gandhis.",
        "Rahul Gandhi is planning something big this time, I'm sure the way he is meeting with people.\n\nHis Social Media game, his PCs and outreach to people is phenomenal this time, seriously if congress doesn't get at least 100 seats this time, it's really 'dal me kuch kaala' {something fishy}",
        "They are 10 years late, but when you are late you are forced to be cutting edge. 2024 is going to be a battle of equals I’m the narrative wars arena.",
        "When bigtory has become synonymous to \"right leaning\" this is no surprise.",
        "The videos are wholesome. I had two thoughts on my mind:\n\n1. I hope the poor people who spoke against the government don't face any trouble from them\n2. No matter who is it, politicians can not be trusted blindly. The effort is commendable but it has to be sincere too. Somewhere, I think it still lacks, or possibly RaGa is just not a good conversationalist. He asks weird questions(when do you sleep blah blah)",
        "Too late. RaGa had potential. I can forgive the nepotism and dynasty politics if he had shown competency years ago. \n\nAll the *moments* in his video have already been covered by many others, so I am not particularly touched by his gestures. \n\nPoint is he has done good job of being sincere in his videos. But it has come too late to make a significant change. \n\nI agree I'm biased. As someone from andhra who watched the hasty bifurcation of state I have no love for congress. \n\nMaybe RaGa has a career in becoming a Youtuber/activist, but as a politician he is too late to his own party.",
        "It's not RAGA doing a great job. It's just BJP messed up big time now.\n\nToo much communalism, members involved in sexual assault cases, corruption, and idiotic ministers like tai who get angry on asking questions. These things have driven common people away from their side and have only one alternative left.\n\nIt's nice if his party can deliver, Modi has turned Indian cities into modern slums and we desperately need peace and development.",
        "You forgot that he also invented the new mechanism of Radar, Invented technique to extract gas from Nala, Stopped war in Ukraine while Manipur is still burning etc.",
        "Definitely. We need congress sm presence that is interesting and genuine. hope he continues working in this capacity and leaves politics to full time politicians",
        "Ab Hindi wale bhi spelling galat hone Lage hai",
        "It took 10 years for Rahul to realise the power of social media...anyways better late than never ... I really hope he proves all his haters wrong..all the best to him",
        "Im not a kid, I went to some of the best schools in this country. I got into one of the best consulting firms in the world. Now I've quit, with a huge loan to build my own startup. So pardon me, but I completely disagree with the \"hardcore experience\" you talk about. Most experienced folks I've met are incompetent freeloaders, koi public ka Paisa khaata hae koi company ka. There wouldn't be a management consulting industry is management experience was good. I'm gonna change the world in my way despite not being a hardcore operator.\n\nAlso, I was born in a village in Odisha, spent all my childhood in Bhubaneswar. Saw the shit, studied and got out, came to Bombay, worked all over India and even Singapore. And I DO SAY I know India better than many uncles who never left their tiny city and tiny mindset.",
        "I remember reading about Divya spandana and how rahul supported her emotionally during her father's demise. Another instance was him helping the family of nirbhaya under the radar. \n\nThe guy has seen some dark things early on and understands trauma and knows better than to give fake sympathies. \n\nI look forward to his videos on yt because you can actually see people in distress appreciating his visits. His questions at their roots are pretty simple and for most of us would seem vague but the state of the nation is such that we aren't aware of the ground reality which these videos do a decent job of telling.",
        "it's 2023. no politician is 'genuine'. everything is just marketing.",
        "Sequel abhi baaki hai mere dost, in his next tenure of 2024. Unfortunately, I still think bjp is to win :-/",
        "Yeah but this is r/india and not one of the right wing subs.",
        "I feel like he's the complete opposite to what Modi is (at least public persona). While the rest are Modi wannabes, he's a breath of fresh air. He seemed genuine and no nonsense guy with admirable sensitivity",
        "Idk why you'd that. Perhaps because he is not aggressive enough in his PR? Because he built amazing infrastructure in Amethi, and even during the pandemic, he was the no 1 parliamentarian who best used his MP fund (as per govt data). During his presidency, Congress won Raj and CG. Been quite correct in his analysis of the current govt, from economic to social issues.",
        "Yes, they are. Wait...do people really think you can spell Hindi or any Indic language words any way you want when transliterated? There are [standards](https://en.wikipedia.org/wiki/Hunterian_transliteration) for this.\n\nPS: \\*hain (plural), not \"hai\" (singular) 🤦🏻‍♂️"
    ],
    "cleaned_text": "ragas youtube channel actually getting interesting im taking sides almost dont want tag post political honestly see videos dont even support content becoming touching real people real stories real events posing sometimes ask government theyre guess thats alright considering constant posing fake stuff mainstream media want know without taking sides content perspective guys think ",
    "cleaned_title": "ragas youtube channel actually getting interesting",
    "cleaned_selftext": "im taking sides almost dont want tag post political honestly see videos dont even support content becoming touching real people real stories real events posing sometimes ask government theyre guess thats alright considering constant posing fake stuff mainstream media want know without taking sides content perspective guys think",
    "cleaned_comments": "wheres link im promoting somehow nowadays even speaking opposition candidate means im suddenly flagbearer party sad give many disclaimers post theres nothing wrong political taking side id go far need hour almost decade ago political doesnt mean discourse uncivilized uneducated thats happens people willing political uncivilized uneducated political discourse dominated lowest common denominator doesnt mean rest us bow know political discourse india dead somehow intellectual become derogatory term id rather stay karnataka elections understood value goodbad pr irrelevant judge leadership abilities inexperienced twenty years back inexperienced today theres nothing wrong political political need hour fact videos really nice well edited feel earth guy genuine person wants help seriously never million years would thought papu might one favourite indian youtubers sure upped sm game end day u good influencer reach masses raga team missing till nothing wrong taking right political left side raga fighting good fight muslims christians nazis please spread word far wide subscribe current state country rahul gandhi try diffuse bomb save thousands process bjps cash might lacs rabid cell trolls congress wont coming power electoral bonds come bjps way huge overcome even parties unite seriously upped sm game interaction feels genuine honestly low bar bjp set fakery basic human decency feels like grand statement loved episode featuring khane main kya hai given choice selecting murderers rapists molestors misogynists hypocrites bigots selfish illiterate politician normal individual would gladly choose average person least assigned job honest person rahul gandhi right relax ok political talk rahul gandhis youtube channel without getting realm politics like started cooking vlog become bjp defeat bjp rg selective watch last week watched video visiting karol bagh mechanics didnt expect happen legit touching thought today youtube suggested video visited haryana farmers hes rallying talking people asking life refreshing times live vocal always room pretty soon realised cant change atmosphere today go back staying shush enjoying privilege normal political take sides guess forgotten supposed ask questions political leaders trumpaxios interview still give goosebumps journalism return senses see news channels thats shut noise continue enjoying life sadly true though still dont want rahul gandhi prime minister without answering congress find another pm candidate fact guy willing asked questions feels new especially since weve gone years one way communication pm commands everyone else obeys praises good human fair personal experience dont say rahul gandhi without mentioning pappu nepotism libtard shehzada etc etc youre suddenly torchbearer congress hence enemy bjp hindus india actually right things recently wonder bjp scared man showing persistence courage continuosly learning mistake hoping good fight next year asli id se aa rahul think much time took train privileged slow hope proves opposition party develope constituency frequently getting ads congress cells handles promoted twitter recently alot pr substance wont vote guy hasnt handled position power responsibility pm india han sahi mae pakad liya bhai tumne toh mae rahul gandhi hi huun yep last decade completely decade influencers im sure next one would roll mechanisms target fake bad influencers honestly got ta every social media streaming app famous india youtube politicians need top famous sensible social media trends want voice heard days average age indian still less definition politics taking fan pages tell insta thing thing tbh great channel quite touching videos well theres base level scripting interaction feels genuine raga quite good communicating people talking person offer decent thoughts matter refreshing change seeing politician engaging real people grassroot level contrast comparison politicians almost likened literal gods par ye sub pe thoda bhi right leaning kuch post kar ban kar dete hai think latest video amazing cant wait see women haryana village came liked delhi hes really great person hope becomes pm anyone talks needs critique really well gentle man like soften hateful tense air india much sane person almost politicians chalo mp nahi toh blogger hi sahi genuine makes politicians look feku manipur video posted sheer helplessness eyes women listening fake tears fake emotion aware pogrom gujarat could see parallels one rakthbeej giving rise many vile political creatures every state opposite makes sense start remember onwards campaigns malign image potency campaign even one feels conscious active root openly social media think supreme leader fought crocodiles young gave crocodiles tea guy whose disqualified parliament making pun name weve learnt childhood vishwaguru till want know origin story inch half manhalf lion going leader solar system ill backing hes good man people power great politicians thora nahin also dont shy take sides taking sides means empowering evil real people real stories real events posing appeal emotion likely done promote unless wants next sandeep maheshwari nothing appreciating dont become attached rahul gandhi feel emotion seems late though since social media outlet news channels wont show english closest usually seen people using instead rarely seen people using r sound rahul gandhi became pm would called neoptism becomes pm would call victory poor guy mocked humiliated still fought fought battle choose couldnt said better raga getting better feel bjp hit trump card smriti irani jaishankar prasad nitin gadkari appearing beer biceps podcast quality mightve low extremely low imo reach penetration would much higher mayb raga approach mostly sane next interview like years late people already brainwashed channel discriminated companies guarantee smart move pr humanize building success yatra dont like want family gone dont buy hes sensitive relatable guy pr construction dozens camera guys accompanying editing music even nice guy cant somebody parachuting post prime minister largest country world happening needs handled real shit needs responsible actually responsible something objective measurable results produced seen dont care westernised city kids largely clueless country overall social texture like hes idealistic english speaking westernised guy relate competent politician get shit done hardcore operator often isnt whimsical likable sensitive artsy guy kids get attracted socials large complex countries run killer sharks people around seen real shit life pretentious tourists trying create facade relatibility dont understand meant fake influencers bad influencer understand would influencer whos saying things dont like agree see healthy country plenty fake influencers todays social media scenario targetting people either show luxurious lifestyle may neck deep debt crypto chicks twitter people sell formula stuff like rahul gandhi hes good man personally find incompetent admire person though feel inc ultimately reform need get rid prominence gandhis rahul gandhi planning something big time im sure way meeting people social media game pcs outreach people phenomenal time seriously congress doesnt get least seats time really dal kuch kaala something fishy years late late forced cutting edge going battle equals im narrative wars arena bigtory become synonymous right leaning surprise videos wholesome two thoughts mind hope poor people spoke government dont face trouble matter politicians trusted blindly effort commendable sincere somewhere think still lacks possibly raga good conversationalist asks weird questionswhen sleep blah blah late raga potential forgive nepotism dynasty politics shown competency years ago moments video already covered many others particularly touched gestures point done good job sincere videos come late make significant change agree im biased someone andhra watched hasty bifurcation state love congress maybe raga career becoming youtuberactivist politician late party raga great job bjp messed big time much communalism members involved sexual assault cases corruption idiotic ministers like tai get angry asking questions things driven common people away side one alternative left nice party deliver modi turned indian cities modern slums desperately need peace development forgot also invented new mechanism radar invented technique extract gas nala stopped war ukraine manipur still burning etc definitely need congress sm presence interesting genuine hope continues working capacity leaves politics full time politicians ab hindi wale bhi spelling galat hone lage hai took years rahul realise power social mediaanyways better late never really hope proves haters wrongall best im kid went best schools country got one best consulting firms world ive quit huge loan build startup pardon completely disagree hardcore experience talk experienced folks ive met incompetent freeloaders koi public ka paisa khaata hae koi company ka wouldnt management consulting industry management experience good im gon na change world way despite hardcore operator also born village odisha spent childhood bhubaneswar saw shit studied got came bombay worked india even singapore say know india better many uncles never left tiny city tiny mindset remember reading divya spandana rahul supported emotionally fathers demise another instance helping family nirbhaya radar guy seen dark things early understands trauma knows better give fake sympathies look forward videos yt actually see people distress appreciating visits questions roots pretty simple us would seem vague state nation arent aware ground reality videos decent job telling politician genuine everything marketing sequel abhi baaki hai mere dost next tenure unfortunately still think bjp win yeah rindia one right wing subs feel like hes complete opposite modi least public persona rest modi wannabes hes breath fresh air seemed genuine nonsense guy admirable sensitivity idk youd perhaps aggressive enough pr built amazing infrastructure amethi even pandemic parliamentarian best used mp fund per govt data presidency congress raj cg quite correct analysis current govt economic social issues yes waitdo people really think spell hindi indic language words way want transliterated standardshttpsenwikipediaorgwikihunteriantransliteration ps hain plural hai singular",
    "light_cleaned_title": "RaGa's YouTube channel is actually getting interesting",
    "light_cleaned_selftext": "I'm not taking sides, almost don't want to tag this post as political but honestly just see the videos. Don't even have to support him, but the content is just becoming so touching. Real people real stories real events no posing. Sometimes he does ask about government and how they're doing but I guess that's alright considering the constant posing and fake stuff in mainstream media. I just want to know without taking sides, just from a content perspective what do you guys think?",
    "light_cleaned_comments": "Where's the link ? I'm not promoting it. Somehow nowadays even speaking about any opposition candidate means I'm suddenly a flagbearer of that party It''s sad you have to give so many disclaimers in your post. There's nothing wrong with being political and taking a side. I'd go so far as that it was the need of the hour almost a decade ago. Being political doesn't mean the discourse has to be the uncivilized and uneducated but that's what happens when most people who are willing to be political are the uncivilized and uneducated. Just because political discourse has been dominated by the lowest common denominator doesn't mean the rest of us have to bow out. I know, but political discourse in India is dead. Somehow intellectual has become a derogatory term. So I'd rather just stay out of it all. After Karnataka elections they understood value of good/bad PR. And this is irrelevant to judge his leadership abilities, he is inexperienced twenty years back he is inexperienced today. There's nothing wrong with being political. Being political is the need of the hour in fact. The videos are really nice and well edited. I feel that He is a very down to earth guy and genuine person who wants to help. Seriously never in a million years I would have thought that Papu might be one of my favourite Indian youtubers. He sure has upped his SM game , at they end of the day u have to be a good influencer to reach to the masses which is what RAGA and his team were missing till now There is nothing wrong with taking the right (political left) side. RaGa is fighting the good fight for Muslims and Christians against the Nazis. Please spread his word far and wide. Subscribe! In the current state of our country Rahul Gandhi can try to diffuse a bomb by himself and save thousands in the process but with BJPs cash might and lacs of rabid it cell trolls, Congress won't be coming to power in 2024. All the electoral Bonds that come BJPs way are just too huge to overcome even if other parties unite He has seriously upped his SM game. His interaction feels genuine and honestly the low bar that BJP has set with their fakery, just basic human decency feels like a grand statement now. I loved the episode featuring him in Khane Main Kya Hai. Given a choice between selecting murderers, rapists, molestors, misogynists, hypocrites, bigots, selfish and illiterate politician and a normal individual, I would gladly choose an average person who can at least do 60% of the assigned job while being honest. And that person to me is Rahul Gandhi right now. Relax, it's ok to be political. How can you talk about Rahul Gandhi's YouTube channel without getting into the realm of politics? It's not like he has started a cooking vlog. Become BJP to defeat BJP - RG I am very selective in what I watch. Last week I watched his video visiting Karol Bagh mechanics. I didn't expect that to happen. This was legit very touching, I thought it's just once a while but then today my YouTube suggested a video where he visited haryana farmers, again, he's not rallying, just talking to people and asking them about their life. It's refreshing It's just the times we live in, when I was vocal it was always me against the room, pretty soon realised that I can't change the atmosphere today. So just go back to staying shush and enjoying my privilege. It's normal to be political and take sides I guess we had forgotten that we're supposed to ask questions to political leaders. The trump-Axios interview did and still does give me goosebumps of what journalism is. Then I return to my senses and see what our news channels are. That's it shut out the noise and continue enjoying life. Sadly true. Though I still don't want Rahul Gandhi as prime minister without him answering why Congress cannot find another PM candidate. But the fact that this guy is willing to be asked questions, just feels new. Especially since we've gone 10 years of only one way communication. The pm commands and everyone else obeys or praises He is a good human being. Fair, but my personal experience has been that If you don't say Rahul Gandhi without mentioning pappu, nepotism, libtard, shehzada etc etc. Then you're suddenly the torchbearer of Congress and hence an enemy of BJP, Hindus, and India. He is actually doing all the right things recently, no wonder BJP is scared. The man showing persistence, courage and is continuosly learning from his mistake. Hoping for a good fight next year. Asli ID se aa, rahul I think it's too much time he took to train himself, privileged but slow. I hope he proves himself against the opposition party and develope his constituency . I am frequently getting ads of Congress it cells handles being promoted on Twitter and recently they are doing alot of PR. But no substance. I won't vote for a guy who hasn't handled any position of power and responsibility to be the PM of India. Han sahi mae pakad liya Bhai tumne toh, mae Rahul Gandhi hi huun Yep. The last decade was the completely decade of influencers. I'm sure the next one would be where they roll out mechanisms to target fake or bad influencers. Honestly, he gotta be on every social media streaming app famous in India and not just youtube. Politicians need to be on top of the famous and sensible social media trends if they want have their voice heard these days. After all average age of an Indian is still less than 30. What definition of politics you taking about. Fan pages Tell me it's an insta thing and not an OF thing Tbh its a great channel with quite touching videos as well . There's the base level of scripting but the interaction feels genuine. Raga is quite good at communicating with people when talking in person and does offer some decent thoughts on the matter. Its a refreshing change seeing a politician engaging with real people at the grassroot level in contrast to the comparison in which the politicians are almost likened to be literal gods . Par ye sub pe thoda bhi right leaning kuch post kar do to ban kar dete hai I think the latest video is amazing can't wait to see how the women from the haryana village came through and if they liked delhi. He's a really great person hope he becomes the PM. Anyone who talks against him needs to critique themselves really well. a gentle man like that will soften the hateful and tense air of India. He is much sane person than almost 95% politicians out there Chalo MP nahi toh Blogger hi sahi. He is genuine… makes other politicians look so feku. The manipur video he posted. Sheer helplessness in the eyes of those women. And he just listening, no fake tears and no fake emotion, just being there. If you are aware about the 2002 pogrom in Gujarat, you could see the parallels there. How one rakthbeej giving rise to many such vile political creatures in every state. He is opposite of that. It makes sense if you start to remember 2011 - 12 onwards campaigns to malign his image. And the potency of that campaign is such that even now One feels conscious to active root for him openly on social media. Think about that. But it is between the supreme leader, who has fought crocodiles when he was young and then gave the crocodiles tea and a guy whose been disqualified from Parliament for making a pun on a name. We've only learnt about the childhood of our vishwaguru till now. I want to know the origin story of our 56 inch half man-half lion. So it's going to be the leader of the solar system that I'll be backing in 2024 :) He's a good man but the people in power are great politicians. \\*thora \\*nahin Also, don't be so shy to take the sides any more. Taking no sides just means empowering the evil. >Real people real stories real events no posing Appeal to emotion. This is very likely done to promote him, unless he wants to be the next Sandeep maheshwari. Nothing against appreciating, just don't become attached to Rahul Gandhi when you feel emotion. Seems too late now though. Since social media is his only outlet and news channels won't show him. English does not have a \"ड\", so the closest I have usually seen is people using \"d\" instead. Very rarely seen people using \"r\" for that sound. If Rahul Gandhi became PM in 2014 or 2019, I would have called it neoptism. But, if becomes PM in 2024, I would call it a victory. The poor guy was mocked at, humiliated, but still fought, and fought a battle he did not choose. Couldn't have said it better ! While RAGA is getting better , feel BJP hit a trump card when Smriti Irani, Jaishankar Prasad, and Nitin Gadkari appearing on Beer Biceps. While the podcast quality might've been low.( Extremely low IMO). The reach and penetration would be much higher. Mayb RAGA approach Mostly Sane for the next interview. He is like 5 years too late. People are already brainwashed and his channel will be discriminated against by the the companies themselves. i guarantee it. Smart move by his PR to humanize him. Building on the success of the yatra. I don't like him. I want the family gone. I don't buy that he's this sensitive, relatable guy - this is a PR construction of dozens of camera guys accompanying him, and editing and music. Even if he is some nice guy, I can't have somebody parachuting into the post of the prime minister of the largest country in the world. That is just not happening. He needs to have handled real shit. He needs to have been responsible, actually responsible for something where objective measurable results have to be produced and seen. I don't care that westernised city kids, largely clueless about the country and the overall social texture of it, like him because he's this idealistic, English speaking westernised guy they can relate to. Being a competent politician who can get shit done, a hardcore operator, often isn't the whimsical likable sensitive artsy guy that kids get attracted to on socials. Large, complex countries are run by killer sharks, people who have been around and have seen real shit in life. Not by pretentious tourists trying to create a facade of relatibility. I don't understand what you meant by \"fake influencers\". Bad influencer I understand would be an influencer who's saying things you don't like / agree with / see as healthy for the country. There are plenty of fake influencers in today's social media scenario. Here I was targetting people who either show off luxurious lifestyle but may be neck deep in debt, or crypto chicks on twitter, or people who sell their formula and stuff. I like Rahul Gandhi - he's a good man but personally, I find him incompetent. I admire him as a person though, but I feel that for the INC to ultimately reform, they need to get rid of the prominence of the Gandhis. Rahul Gandhi is planning something big this time, I'm sure the way he is meeting with people. His Social Media game, his PCs and outreach to people is phenomenal this time, seriously if congress doesn't get at least 100 seats this time, it's really 'dal me kuch kaala' {something fishy} They are 10 years late, but when you are late you are forced to be cutting edge. 2024 is going to be a battle of equals I’m the narrative wars arena. When bigtory has become synonymous to \"right leaning\" this is no surprise. The videos are wholesome. I had two thoughts on my mind: 1. I hope the poor people who spoke against the government don't face any trouble from them 2. No matter who is it, politicians can not be trusted blindly. The effort is commendable but it has to be sincere too. Somewhere, I think it still lacks, or possibly RaGa is just not a good conversationalist. He asks weird questions(when do you sleep blah blah) Too late. RaGa had potential. I can forgive the nepotism and dynasty politics if he had shown competency years ago. All the *moments* in his video have already been covered by many others, so I am not particularly touched by his gestures. Point is he has done good job of being sincere in his videos. But it has come too late to make a significant change. I agree I'm biased. As someone from andhra who watched the hasty bifurcation of state I have no love for congress. Maybe RaGa has a career in becoming a Youtuber/activist, but as a politician he is too late to his own party. It's not RAGA doing a great job. It's just BJP messed up big time now. Too much communalism, members involved in sexual assault cases, corruption, and idiotic ministers like tai who get angry on asking questions. These things have driven common people away from their side and have only one alternative left. It's nice if his party can deliver, Modi has turned Indian cities into modern slums and we desperately need peace and development. You forgot that he also invented the new mechanism of Radar, Invented technique to extract gas from Nala, Stopped war in Ukraine while Manipur is still burning etc. Definitely. We need congress sm presence that is interesting and genuine. hope he continues working in this capacity and leaves politics to full time politicians Ab Hindi wale bhi spelling galat hone Lage hai It took 10 years for Rahul to realise the power of social media...anyways better late than never ... I really hope he proves all his haters wrong..all the best to him Im not a kid, I went to some of the best schools in this country. I got into one of the best consulting firms in the world. Now I've quit, with a huge loan to build my own startup. So pardon me, but I completely disagree with the \"hardcore experience\" you talk about. Most experienced folks I've met are incompetent freeloaders, koi public ka Paisa khaata hae koi company ka. There wouldn't be a management consulting industry is management experience was good. I'm gonna change the world in my way despite not being a hardcore operator. Also, I was born in a village in Odisha, spent all my childhood in Bhubaneswar. Saw the shit, studied and got out, came to Bombay, worked all over India and even Singapore. And I DO SAY I know India better than many uncles who never left their tiny city and tiny mindset. I remember reading about Divya spandana and how rahul supported her emotionally during her father's demise. Another instance was him helping the family of nirbhaya under the radar. The guy has seen some dark things early on and understands trauma and knows better than to give fake sympathies. I look forward to his videos on yt because you can actually see people in distress appreciating his visits. His questions at their roots are pretty simple and for most of us would seem vague but the state of the nation is such that we aren't aware of the ground reality which these videos do a decent job of telling. it's 2023. no politician is 'genuine'. everything is just marketing. Sequel abhi baaki hai mere dost, in his next tenure of 2024. Unfortunately, I still think bjp is to win :-/ Yeah but this is r/india and not one of the right wing subs. I feel like he's the complete opposite to what Modi is (at least public persona). While the rest are Modi wannabes, he's a breath of fresh air. He seemed genuine and no nonsense guy with admirable sensitivity Idk why you'd that. Perhaps because he is not aggressive enough in his PR? Because he built amazing infrastructure in Amethi, and even during the pandemic, he was the no 1 parliamentarian who best used his MP fund (as per govt data). During his presidency, Congress won Raj and CG. Been quite correct in his analysis of the current govt, from economic to social issues. Yes, they are. Wait...do people really think you can spell Hindi or any Indic language words any way you want when transliterated? There are [standards](https://en.wikipedia.org/wiki/Hunterian_transliteration) for this. PS: \\*hain (plural), not \"hai\" (singular) 🤦🏻‍♂️"
}