{
    "id": "1csgkoa",
    "title": "Only 1,025 billboards in Mumbai are legal, but why do illegal ones exist?",
    "url": "https://www.news9live.com/india/ghatkopar-tragedy-only-1000-hoardings-in-mumbai-are-legal-but-why-do-illegal-ones-continue-to-exist-2537459",
    "selftext": ">The BMC is the nodal agency which is responsible for striking contracts with advertising firms for installing the hoardings. It should adhere to various norms and yardsticks before sealing a deal with ad agencies and companies. This involves getting no-objection certificates from various departments, including the Building Proposal Department, the Tree Authority, and the Soil Testing Department. Once these are obtained, the civic body enters into a one-year agreement with the advertiser. The agreement also mentions a fixed deposit and rental fee. But it has also come to light that the annual renewal process is often given a short shrift, due to which a number of hoardings exist with impunity. The Ghatkopar hoarding which belonged to Ego Media existed illegally.\n\n>It’s because of shoddy enforcement of guidelines, inept monitoring and poor coordination between the civic authorities that Ghatkopar-like tragedies occur, some civic activists have alleged. They alleged that many hoardings in the city are still standing even though the one-year contract has expired.",
    "flair": "Crime",
    "score": 28,
    "num_comments": 2,
    "created_utc": 1715765075.0,
    "convurl": "https://external-preview.redd.it/mLjn3qvWu68d6PVX7ugiMbxTSDtVxhii-Q7VmXxhG4o.jpg?auto=webp&s=38fe130630add714288b0f610285095c586cc69a",
    "comments": [
        "Because the trade off between accepting a bribe to turn a blind eye/regularising an illegal structure vs being punished for an accident is totally skewed towards accepting bribe/regularising illegal developments.\n\nIf the an illegal structure falls, the developer is the first one to be blamed (rightly, imho). The BMC as an org is next. The actual clerk who inspects and approves/ignores illegal structures is not even named.\n\nWhat would any rational clerk in such a set up do?",
        "> More than 10 police teams from Mumbai and Gujarat are trying to trace Bhavesh Bhinde, director of Ego Media Pvt Ltd, the advertising agency that owns the billboard that collapsed in Ghatkopar on May 13, killing 14 people and injuring 74 others. \n\n> There are two other cases registered against Bhinde in Mulund — for rape and molestation, and cheating. A woman in his office registered the rape and molestation case against him in January this year. Bhinde managed to get an anticipatory bail from the Bombay high court and was therefore not arrested by the Mulund police, although a chargesheet has been filed against him. The second case was registered in the same police station in 2016.\n\n> Apart from these cases, Bhinde was also fined 21 times for various violations under the Mumbai Municipal Corporation Act, 1888, before 2009, said an officer at the Mulund police station. Bhinde had contested the Maharashtra assembly election as an independent candidate from the Mulund constituency in 2009."
    ],
    "cleaned_text": "billboards mumbai legal illegal ones exist bmc nodal agency responsible striking contracts advertising firms installing hoardings adhere various norms yardsticks sealing deal ad agencies companies involves getting noobjection certificates various departments including building proposal department tree authority soil testing department obtained civic body enters oneyear agreement advertiser agreement also mentions fixed deposit rental fee also come light annual renewal process often given short shrift due number hoardings exist impunity ghatkopar hoarding belonged ego media existed illegally shoddy enforcement guidelines inept monitoring poor coordination civic authorities ghatkoparlike tragedies occur civic activists alleged alleged many hoardings city still standing even though oneyear contract expired ",
    "cleaned_title": "billboards mumbai legal illegal ones exist",
    "cleaned_selftext": "bmc nodal agency responsible striking contracts advertising firms installing hoardings adhere various norms yardsticks sealing deal ad agencies companies involves getting noobjection certificates various departments including building proposal department tree authority soil testing department obtained civic body enters oneyear agreement advertiser agreement also mentions fixed deposit rental fee also come light annual renewal process often given short shrift due number hoardings exist impunity ghatkopar hoarding belonged ego media existed illegally shoddy enforcement guidelines inept monitoring poor coordination civic authorities ghatkoparlike tragedies occur civic activists alleged alleged many hoardings city still standing even though oneyear contract expired",
    "cleaned_comments": "trade accepting bribe turn blind eyeregularising illegal structure vs punished accident totally skewed towards accepting briberegularising illegal developments illegal structure falls developer first one blamed rightly imho bmc org next actual clerk inspects approvesignores illegal structures even named would rational clerk set police teams mumbai gujarat trying trace bhavesh bhinde director ego media pvt ltd advertising agency owns billboard collapsed ghatkopar may killing people injuring others two cases registered bhinde mulund rape molestation cheating woman office registered rape molestation case january year bhinde managed get anticipatory bail bombay high court therefore arrested mulund police although chargesheet filed second case registered police station apart cases bhinde also fined times various violations mumbai municipal corporation act said officer mulund police station bhinde contested maharashtra assembly election independent candidate mulund constituency",
    "light_cleaned_title": "Only 1,025 billboards in Mumbai are legal, but why do illegal ones exist?",
    "light_cleaned_selftext": ">The BMC is the nodal agency which is responsible for striking contracts with advertising firms for installing the hoardings. It should adhere to various norms and yardsticks before sealing a deal with ad agencies and companies. This involves getting no-objection certificates from various departments, including the Building Proposal Department, the Tree Authority, and the Soil Testing Department. Once these are obtained, the civic body enters into a one-year agreement with the advertiser. The agreement also mentions a fixed deposit and rental fee. But it has also come to light that the annual renewal process is often given a short shrift, due to which a number of hoardings exist with impunity. The Ghatkopar hoarding which belonged to Ego Media existed illegally. >It’s because of shoddy enforcement of guidelines, inept monitoring and poor coordination between the civic authorities that Ghatkopar-like tragedies occur, some civic activists have alleged. They alleged that many hoardings in the city are still standing even though the one-year contract has expired.",
    "light_cleaned_comments": "Because the trade off between accepting a bribe to turn a blind eye/regularising an illegal structure vs being punished for an accident is totally skewed towards accepting bribe/regularising illegal developments. If the an illegal structure falls, the developer is the first one to be blamed (rightly, imho). The BMC as an org is next. The actual clerk who inspects and approves/ignores illegal structures is not even named. What would any rational clerk in such a set up do? > More than 10 police teams from Mumbai and Gujarat are trying to trace Bhavesh Bhinde, director of Ego Media Pvt Ltd, the advertising agency that owns the billboard that collapsed in Ghatkopar on May 13, killing 14 people and injuring 74 others. > There are two other cases registered against Bhinde in Mulund — for rape and molestation, and cheating. A woman in his office registered the rape and molestation case against him in January this year. Bhinde managed to get an anticipatory bail from the Bombay high court and was therefore not arrested by the Mulund police, although a chargesheet has been filed against him. The second case was registered in the same police station in 2016. > Apart from these cases, Bhinde was also fined 21 times for various violations under the Mumbai Municipal Corporation Act, 1888, before 2009, said an officer at the Mulund police station. Bhinde had contested the Maharashtra assembly election as an independent candidate from the Mulund constituency in 2009."
}