{
    "id": "13fcb73",
    "title": "Official Government website redirecting to betting websites.",
    "url": "https://www.reddit.com/r/india/comments/13fcb73/official_government_website_redirecting_to/",
    "selftext": "Example : See screenshot (Purple Coloured are the ones in question)\n\nIt can trap any layman as its human tendency to seek easy provit and that .gov.in at the end is not helping.\n\nI am not on twitter , so anyone who is should tweet and appeal the respective authorities to take corrective measure.\n\n&#x200B;\n\n(View the domain when it redirects ; For some reason if I directly open this url it gives error but when opening from google search it opens a betting site , hence the only way that I can see the link is to see the URL when redirecting or see the SS below)\n\n&#x200B;\n\nhttps://preview.redd.it/iueihw1bbcza1.png?width=2689&format=png&auto=webp&v=enabled&s=0b89b8c417e87f7e60c953a4fca5730c8ecacd08",
    "flair": "Rant / Vent",
    "score": 46,
    "num_comments": 9,
    "created_utc": 1683870819.0,
    "convurl": "https://b.thumbs.redditmedia.com/11pzbtgduJ7BSLIpmZmTP698Do7KUwdHSxx_RX8KclU.jpg",
    "comments": [
        "Tl;DR : Website's server is possibly backdoor-ed.\n\nTheory:\n\nClearly there are hidden pages on the server which is indexed by Google's search here.\n\nSeems like the websites are running on a similar backend network made by the same organisation. The organisation is using these hidden pages to redirect to their sources of income. (Betting site)\n\nThe domain is owned and controlled by the government, no doubt. But the server is not (even if they do, there is hidden code from when the organisation made the server). The betting site checks for redirects to prevent anyone actually trying to use those websites.",
        "Working as intended",
        "This is a Fricking joke 🤣🇮🇳",
        "Kickbacks are working well",
        "Government wants you to make a team on dream11.",
        "There was something similar on some czech government websites which iirc would redirect to porn",
        "Man, I really think that govt should hire some  good web developers man the govt websites today looks shit and work likes shit ( except some )",
        "Well you know what more can you expect from government led and managed by bloody banias from the G state"
    ],
    "cleaned_text": "official government website redirecting betting websites example see screenshot purple coloured ones question trap layman human tendency seek easy provit govin end helping twitter anyone tweet appeal respective authorities take corrective measure xb view domain redirects reason directly open url gives error opening google search opens betting site hence way see link see url redirecting see ss xb ",
    "cleaned_title": "official government website redirecting betting websites",
    "cleaned_selftext": "example see screenshot purple coloured ones question trap layman human tendency seek easy provit govin end helping twitter anyone tweet appeal respective authorities take corrective measure xb view domain redirects reason directly open url gives error opening google search opens betting site hence way see link see url redirecting see ss xb",
    "cleaned_comments": "tldr websites server possibly backdoored theory clearly hidden pages server indexed googles search seems like websites running similar backend network made organisation organisation using hidden pages redirect sources income betting site domain owned controlled government doubt server even hidden code organisation made server betting site checks redirects prevent anyone actually trying use websites working intended fricking joke kickbacks working well government wants make team dream something similar czech government websites iirc would redirect porn man really think govt hire good web developers man govt websites today looks shit work likes shit except well know expect government led managed bloody banias g state",
    "light_cleaned_title": "Official Government website redirecting to betting websites.",
    "light_cleaned_selftext": "Example : See screenshot (Purple Coloured are the ones in question) It can trap any layman as its human tendency to seek easy provit and that .gov.in at the end is not helping. I am not on twitter , so anyone who is should tweet and appeal the respective authorities to take corrective measure. &#x200B; (View the domain when it redirects ; For some reason if I directly open this url it gives error but when opening from google search it opens a betting site , hence the only way that I can see the link is to see the URL when redirecting or see the SS below) &#x200B;",
    "light_cleaned_comments": "Tl;DR : Website's server is possibly backdoor-ed. Theory: Clearly there are hidden pages on the server which is indexed by Google's search here. Seems like the websites are running on a similar backend network made by the same organisation. The organisation is using these hidden pages to redirect to their sources of income. (Betting site) The domain is owned and controlled by the government, no doubt. But the server is not (even if they do, there is hidden code from when the organisation made the server). The betting site checks for redirects to prevent anyone actually trying to use those websites. Working as intended This is a Fricking joke 🤣🇮🇳 Kickbacks are working well Government wants you to make a team on dream11. There was something similar on some czech government websites which iirc would redirect to porn Man, I really think that govt should hire some good web developers man the govt websites today looks shit and work likes shit ( except some ) Well you know what more can you expect from government led and managed by bloody banias from the G state"
}