{
    "id": "12nw0oe",
    "title": "What's wrong with study IQ?",
    "url": "https://www.reddit.com/r/india/comments/12nw0oe/whats_wrong_with_study_iq/",
    "selftext": "https://youtu.be/ihukGc3npSU\nDude was talking about Happiness Index and how it's flawed and why the index is controversial\n\nHe raises some good question like Small sample size and why other variables such as social mobility and income inequality weren't added.\nHe is also spitting bs at the same time\nHe mentioned that Indian Per capita GDP is low but no one mentions that India is 5th in the world in terms of GDP duh!\nHe said that Indian Per capita GDP is low because of large population\nDude it's simple most Indian population is still dart poor and income inequality is staggering.\nThat means large chunk population have low productivity.\n\nHe also mentions early freedom ( after 18 according to him) and living on your own is a bad thing while talking petriotic stance and saying 26-27 years unemployed preparing for upsc is a good thing.\nThan he went into complete dribble\nBecause he wants to add questions such as\nYour relationship with God?(wtf)\nHave you watch IPL?\nHave you gone to any Indian wedding?\nHave you celebrated Holi?.\n\nIdk for an education institution they are too biased and parrot godi media.\nI am not an USA bootlicker\nI hate them because of their foreign policy\nBut dude you have to admit that India is still preety backward and we need much more effort to develop our nation. But the govt is also trying to reject such standards in the name of western propoganda.",
    "flair": "Rant / Vent",
    "score": 10,
    "num_comments": 15,
    "created_utc": 1681621221.0,
    "convurl": "https://external-preview.redd.it/Q1mGtL2OLIXaAOFqji6qFFEhjwAKO_QU4PhPzqlI3A8.jpg?auto=webp&v=enabled&s=ca5be43455edb382c47903f89c03b469b7677528",
    "comments": [
        "Philosophically, is that second name coincidental or you become one and live upto what you are named after?",
        "That guy is sleeper cell BJP guy influencing students in his so called current affairs vids",
        "True.",
        "World Affairs Channel Guy is much more corrupt spreading BJP propaganda to young aspirants in the name of current affairs",
        "Study IQ is crap but Happiness Index is indeed a flawed index. Any self reported metric is flawed. This is why academic economics makes a distinction between revealed preferences and stated preferences",
        "What about adding questions such as\nYour relationship with God?\nThat's what he is proposing",
        "26-27 unemployed preparing for UPSC is a good thing for them indeed. That's their main source of income after all, must keep that market alive.",
        "Not agreeing with his reasons, but i still doubt india can be unhappier than a flood struck+ almost bankrupt pakistan or a war struck ukraine",
        "I can't digest the fact that we are unhappier than bankrupt Pakistan or a war torn Ukraine. This is garbage.",
        "watch dhruv rathee",
        "lol yes.",
        "It's indeed an 'unhappy' country, You can tell it by the suicide rates. 30+ STUDENTS suicide per DAY in India! Source? Wikipedia!",
        "What is this trend of calling themselves as Sir/maam after their name ?"
    ],
    "cleaned_text": "whats wrong study iq dude talking happiness index flawed index controversial raises good question like small sample size variables social mobility income inequality werent added also spitting bs time mentioned indian per capita gdp low one mentions india th world terms gdp duh said indian per capita gdp low large population dude simple indian population still dart poor income inequality staggering means large chunk population low productivity also mentions early freedom according living bad thing talking petriotic stance saying years unemployed preparing upsc good thing went complete dribble wants add questions relationship godwtf watch ipl gone indian wedding celebrated holi idk education institution biased parrot godi media usa bootlicker hate foreign policy dude admit india still preety backward need much effort develop nation govt also trying reject standards name western propoganda ",
    "cleaned_title": "whats wrong study iq",
    "cleaned_selftext": "dude talking happiness index flawed index controversial raises good question like small sample size variables social mobility income inequality werent added also spitting bs time mentioned indian per capita gdp low one mentions india th world terms gdp duh said indian per capita gdp low large population dude simple indian population still dart poor income inequality staggering means large chunk population low productivity also mentions early freedom according living bad thing talking petriotic stance saying years unemployed preparing upsc good thing went complete dribble wants add questions relationship godwtf watch ipl gone indian wedding celebrated holi idk education institution biased parrot godi media usa bootlicker hate foreign policy dude admit india still preety backward need much effort develop nation govt also trying reject standards name western propoganda",
    "cleaned_comments": "philosophically second name coincidental become one live upto named guy sleeper cell bjp guy influencing students called current affairs vids true world affairs channel guy much corrupt spreading bjp propaganda young aspirants name current affairs study iq crap happiness index indeed flawed index self reported metric flawed academic economics makes distinction revealed preferences stated preferences adding questions relationship god thats proposing unemployed preparing upsc good thing indeed thats main source income must keep market alive agreeing reasons still doubt india unhappier flood struck almost bankrupt pakistan war struck ukraine cant digest fact unhappier bankrupt pakistan war torn ukraine garbage watch dhruv rathee lol yes indeed unhappy country tell suicide rates students suicide per day india source wikipedia trend calling sirmaam name",
    "light_cleaned_title": "What's wrong with study IQ?",
    "light_cleaned_selftext": "Dude was talking about Happiness Index and how it's flawed and why the index is controversial He raises some good question like Small sample size and why other variables such as social mobility and income inequality weren't added. He is also spitting bs at the same time He mentioned that Indian Per capita GDP is low but no one mentions that India is 5th in the world in terms of GDP duh! He said that Indian Per capita GDP is low because of large population Dude it's simple most Indian population is still dart poor and income inequality is staggering. That means large chunk population have low productivity. He also mentions early freedom ( after 18 according to him) and living on your own is a bad thing while talking petriotic stance and saying 26-27 years unemployed preparing for upsc is a good thing. Than he went into complete dribble Because he wants to add questions such as Your relationship with God?(wtf) Have you watch IPL? Have you gone to any Indian wedding? Have you celebrated Holi?. Idk for an education institution they are too biased and parrot godi media. I am not an USA bootlicker I hate them because of their foreign policy But dude you have to admit that India is still preety backward and we need much more effort to develop our nation. But the govt is also trying to reject such standards in the name of western propoganda.",
    "light_cleaned_comments": "Philosophically, is that second name coincidental or you become one and live upto what you are named after? That guy is sleeper cell BJP guy influencing students in his so called current affairs vids True. World Affairs Channel Guy is much more corrupt spreading BJP propaganda to young aspirants in the name of current affairs Study IQ is crap but Happiness Index is indeed a flawed index. Any self reported metric is flawed. This is why academic economics makes a distinction between revealed preferences and stated preferences What about adding questions such as Your relationship with God? That's what he is proposing 26-27 unemployed preparing for UPSC is a good thing for them indeed. That's their main source of income after all, must keep that market alive. Not agreeing with his reasons, but i still doubt india can be unhappier than a flood struck+ almost bankrupt pakistan or a war struck ukraine I can't digest the fact that we are unhappier than bankrupt Pakistan or a war torn Ukraine. This is garbage. watch dhruv rathee lol yes. It's indeed an 'unhappy' country, You can tell it by the suicide rates. 30+ STUDENTS suicide per DAY in India! Source? Wikipedia! What is this trend of calling themselves as Sir/maam after their name ?"
}