{
    "id": "g15hll",
    "title": "Is Aarogya Setu privacy-first? Nope, but it could be-If the government wanted.",
    "url": "https://www.reddit.com/r/india/comments/g15hll/is_aarogya_setu_privacyfirst_nope_but_it_could/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/vmgjgubpbss41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=8df38fe76a58c706ec7ce91cbd1e7502243cbe48\n\n**Tl; dr**\n\nIn today’s speech announcing the extension of India’s national lockdown till 3rd May, 2020 the country’s Prime Minister requested citizens to [**download the** ***Aarogya Setu*** **application**](https://www.news18.com/news/tech/pm-modi-says-aarogya-setu-app-is-critical-in-the-fight-against-covid-here-is-how-it-works-2576857.html). Unfortunately, the application remains a privacy minefield and it does not adhere to principles of minimisation, strict purpose limitation, transparency and accountability. IFF’s Working Paper, analyses the application, highlights how it is inconsistent with the right to privacy, is conceivably a risk toward a permanent system of mass surveillance, and suggests clear recommendations to arrest these risks.\n\n**Background**\n\nOn April 13, 2020 IFF released its working paper called,  “[***Privacy Prescriptions for technology interventions on COVID-19 in India***](https://drive.google.com/file/d/1UK5rElhcdP5T3Y-8fYP6cCgQKKpQBeOX/view)”. A significant portion of this working paper is dedicated to the proliferation of experimental contact tracing applications not just in India but across the world. India has also launched its own contact tracing solution called *Aarogya Setu*.\n\nIFF’s working paper was alert to this and Chapters 5-7 devote significant space in studying the emergent government and non-government practices, standard setting processes and first principles in the space. Chapter 7 of the paper studies three specific models of contact tracing including the Singapore Government’s *Trace Together* application, MIT’s *Private Kit: Safe Paths* initiative, and *Aarogya Setu*.\n\n**What is Contact Tracing?**\n\nAccording to the WHO, contact tracing occurs in three steps namely (a) contact identification; (b) contact listing; and (c) contact follow up. In particular, contact tracing is a pillar which helps public health officials in containing and the pace of transmission of the virus. This pace of transmission is measured by the unit R0 (R naught) which essentially connotes the number of people an infected person can spread the disease onto.\n\nContact tracing has traditionally been administered through the use of on ground personnel and volunteer armies. However, with the ubiquity of smartphones, which collect vast troves of personal information, governments across the world believe surveillance can aid with rapid contact tracing. But owing to the peculiarities of the coronavirus, authorities across the world are beginning to realise the limited efficacy associated with respect to location surveillance (both with cell tower data and with GPS signals).   \n\n\nAs a result governments and other groups have either released or are developing smartphone apps that use Bluetooth beacons or GPS signals to log instances wherein a user’s device comes in contact with another user’s device. When a user of the app is detected to have Covid-19, contact tracing officers might be able to use the app to identify their close contacts in the prior days or weeks.  \n\n\n**What’s the Risk?**   \n\n\nWith the creation of such systems, come new risks of institutionalisation of mass surveillance. Critically, India lacks a comprehensive data protection law, outdated surveillance and interception laws, or any meaningful proposals for meaningful reform. In domains like disaster relief,  most apps which are purported as ‘contact tracing’ technologies, they often devolve into systems of movement control and lockdown enforcement.\n\nA lot of technology solutions with no demonstrable scientific value to the national response can be passed off as being in the public interest. It leads to poor deployment of public resources and also makes it difficult for crisis responders to discern between “snake oil” and quality technology products. These risks are exacerbated in technology markets since there are no adequate checks and balances in development phases which ensure quality.\n\nSuch systems inadvertently discriminate against regions which have fewer concentrations of smartphones. Specifically, it can lead to harmful outcomes for people residing in economically weaker areas. In countries public health systems are already creaking under the looming threat of capacity deficits. If such systems wrongly urge people to pre-emptively take tests then there is a risk that public health systems may be overwhelmed prematurely.\n\nIt may also exacerbate the risks associated with the harvesting of personal data like health information, and also see the creation of new privacy invasive systems.\n\n**How to prevent these risks?**\n\nSuch systems must consider embedding the following principles among others:\n\n1. The usage of these applications should be voluntary\n2. All data should always be stored locally on people’s devices\n3. This data must be encrypted\n4. No Government can access it at a later point, so must ensure nothing is centralised in a server\n5. Governments must appreciate that any data from location information, to proximity confirmations, to health status, to whether they have been placed in isolation is sensitive personal information.\n6. Privacy by design is more than just assurances that phone numbers are not recorded, all data is encrypted, pseudonymisation is deployed or that the use of the app is “voluntary” and based on consent. Most of these protections have known techniques of circumvention.  \n\n\nTherefore, we need to adhere to two principles:\n\n1. Strict limits  (in terms of collection and duration )every step of the way; and\n2. Comprehensive evidence-based justifications every step of the way\n\n**Aarogya Setu compares unfavourably to Singapore and MIT**\n\nhttps://preview.redd.it/0zw655ssbss41.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;s=488f2ca51d6a194e6858495a346eb42e072a2d5b\n\nConsider the following aspects.\n\n**Is this for disease control or for other purposes?**\n\nIn other countries, health authorities are leading the efforts to respond to COVID-19. For example, in Singapore only its health ministry can use these systems or have access to any limited data/interaction which is shared with them. European authorities are making similar commitments. They assure citizens that law enforcement personnel will not have access to these systems or the data therein.\n\nIn India, multiple committees have been set up in the context of *Aarogya Setu* or other technology responses to the coronavirus. But formal notifications nor press reports have any reference to major involvement of the Ministry of Health and Family Welfare. Instead health authorities are being tertiary institutional players.\n\nTo protect people’s right to privacy, countries (including Singapore) say that contact tracing will be used strictly for disease control and cannot be used to enforce lockdowns or quarantines. ***Aarogya Setu*** **retains the flexibility to do just that, or to ensure comply legal orders and so on**.\n\n**Minimisation? What Minimisation?**\n\n1. Singapore monitors people’s interactions through Bluetooth beacons, MIT does it through GPS, and **then there’s India which uses both**.\n2. Other apps just collect one data point which is subsequently replaced with a scrubbed device identifier. India’s Aarogya Setu **collects multiple data points** for personal and sensitive personal information which increases privacy risks.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zy6tp8hvbss41.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;s=d9ea4b8aca61a8e38ec771f8ad785c5211b2bf17\n\nhttps://preview.redd.it/mnrv4i6wbss41.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;s=23f8c169d0699880af385910b6ee8b4799d23955\n\n**No Transparency leads to discretion**\n\nThe only information we have of the app is its frontend and its rather pedestrian Terms of Service (TOS) and Privacy Policy. Other projects release as much information as possible in pursuit of transparency. This may include an accompanying manifesto, technical specifications, general FAQs, and even its source code. Not only does *Aarogya Setu* go the opposite route but it also prohibits external good faith actors from reverse engineering the application for further scrutiny, information security and other related research which help facilitate stability.\n\nSimilarly, the app is capable of wrongfully identifying people as COVID-19 positive as admitted in the app’s Terms of Service. We ask in our report the question in our paper, does this mean people can get diagnosed as being infected with coronavirus based on an application rather than an actual medical test? Similarly, does this mean that a false positive entails that I cannot use public transport and go to work or leave the city to visit friends? This evokes imagery of the Chinese model of surveillance during COVID-19 and we have highlighted these risks as well in the report.\n\n**No Accountability and No Auditability**\n\nThe Government has a blanket liability limitation clause inserted into its service agreements and privacy policies. This means citizens cannot hold the Government accountable or seek judicial remedy should they wish to ensure the Government’s processes are compliant with the right to privacy.\n\nSecond, the Government talks about certain obligations to delete certain personal data from its application after a 30 day time period. However, as expected this claim comes with enough exceptions which facilitate government discretion. This is compounded with the fact that both researchers and individual users cannot actually check if the Government has deleted people’s personal information and has no means of transparently auditing what the app is doing in the backend.\n\n**Risk of Permanence and Compromises to Autonomy | The Anonymisation Gambit**\n\nFinally, the app runs very palpable risks of either expanding in scope or becoming a permanent surveillance architecture. People are describing the current times as 9/11 on steroids. And with 9/11 we saw the creation and proliferation of mass interception capabilities for some governments. The Government has failed to provide any defined period by when it intends to review, delete and ultimately destroy its systems and data which is collected under the *Aarogya Setu* project. Second, there are already reports which confirm that this server is being linked with other government datasets. Such linking increases risks of permanent systems of mass surveillance.\n\nFinally, the Government says that the TOS and Privacy Policy do not apply in any capacity to what falls under the category of anonymised data sets. The government cannot just say something is anonymised and aggregated so no longer personally identifiable without showing its citizens how it is ensuring this. This level of transparency is a minimum, since the vulnerability of anonymised datasets to people’s informational privacy and security is well documented in information security communities. Considering the risk of these anonymised data sets becoming permanent systems of data analysis, the Government has to keep itself accountable to public scrutiny.\n\n**Conclusion**\n\nIFF has addressed all of these challenges and many more when undertaking its case studies, and the paper eventually sets out a series of 17 recommendations to ensure people’s informational privacy are protected even in these uncertain times, wherein Indian authorities are viewing civil liberties as an afterthought.\n\n**Links to IFF’s COVID-19 Related Work**\n\n1. Working paper \"Privacy prescriptions for technology interventions around Covid-19 in India\"  dated April 13, 2020 ([**Google Docs version**](https://docs.google.com/document/d/1nDoPzygQyTetEguOlzula5O9y5f3f5YJDsA2Pd99O6U/edit?usp=sharing) / [**PDF Version**](https://drive.google.com/file/d/1UK5rElhcdP5T3Y-8fYP6cCgQKKpQBeOX/view?usp=sharing))\n2. Representation to the Department for Telecom on ensuring connectivity and protecting net neutrality due to higher dependency on telecom networks ([**link**](https://internetfreedom.in/urgent-steps-to-be-taken-by-the-department-of-telecom-due-to-the-covid/))\n3. Representation to the Ministry of Health to issue an advisory against the disclosure of the names of persons placed under quarantine ([**link**](https://internetfreedom.in/quarantine-list/))\n4. Petition before the Supreme Court to restore 4G connectivity in Jammu and Kashmir to properly equip healthcare professional around Covid-19 ([**link**](https://internetfreedom.in/sc-issues-notice-in-fmps-petition-seeking-restoration-of-4g-internet-services-in-jammu-kashmir-during-covid-19-crisis/))\n\n[***The Corona virus is not only a threat to our health. Don’t let COVID-19 become 9/11 on steroids. We need your help now more than ever. Please donate to IFF today and become a member***](https://internetfreedom.in/donate/).",
    "flair": "Policy/Economy",
    "score": 152,
    "num_comments": 25,
    "created_utc": 1586870768,
    "convurl": "https://b.thumbs.redditmedia.com/dRwzS1jIVQJGqShGXJSgj7NI9n0mHT5FrLzPb20xYJw.jpg",
    "comments": [
        "1. This is gold mine of data, likes of chaddichandan will get these data by hook or crook and sell it to highest bidder, if required by passing another aadhaar scam act(wait, data protection scam bill already allows government to own your data and sell it to private players).\n   1. It is indeed encrypted using AES 256 protocol and uploaded to servers, but the decryption key will be known to hundreds of engineers and bureaucrats, who can sell it for a price.\n2. Arogya Setu app supports Russian, Japanese and Mandarin, this is a global app, someone just changed the package name and application name to make it Indianized\n3. Check the apk analysis for \"Arogya Sethu\" app [https://www.reddit.com/r/india/comments/g0ql25/askindia\\_is\\_arogya\\_setu\\_built\\_by\\_whoworld/](https://www.reddit.com/r/india/comments/g0ql25/askindia_is_arogya_setu_built_by_whoworld/)\n\n\\#infosys",
        "So is it safe to say this app is a big no no?",
        "Yes, our recommendation is not to install Aarogya Setu in it's present form without an audit of it's source code and legal protections as highlighted above. It puts people to risk.",
        "Source code is not owned by government, can not be audited.",
        "Hi! Can you please explain this to us?",
        "I was part of a team building a contact tracing app that would have used Bluetooth low energy to detect contacts. The data would have stayed on the users device and if and when they got infected, only then it would be uploaded to the server. I believe same was done in the case of TrueTrace the Singapore governments app. But after arogya setu was lunched we stopped working on it with the belief that when there are more apps on the market, it will hamper the tracing rather than aiding to it. \n\nThat being said, only tracing Bluetooth contacts is enough for detecting possible infections. For figuring out places where people might have chances of infection, government can use the location history export from maps of a infected person or simply ask the infected person about the places they visited. By obtaining that list govt. could easily notify people about possible risk of infection to people who have visited these places during this time. This way there is no need of tracking the location of each individual app user and the data remains in users hand. \n\nBut as the govt app is out now, many team's who were working on the same might have already dropped the work citing similar reasons. We also made a video about the drawback of GPS tracing. Let's hope the policymakers listen and remove location tracking.",
        "My thoughts on this\n\n1. The app asks for 2 pieces of information - Name and Phone Number. Both of these are possibly already available to the government, thanks to the innumerable id's we have gotten - Aadhar, PAN, etc.\n2. It then asks to give permission to use Bluetooth and location. Ok. So, now the government knows where I am.\n\nBut, the fact is that we are living under a lockdown - and, are at home (or should be for the most part). The government already knows where we live. If I do go out (which I haven't so far, thanks to Dunzo and other eCommerce apps), it will be only for emergency purposes. So, the government could know which grocery store/medical shop I am going to. If I do want to go someplace, where I don't want the government to track me, I can always turn off permissions or uninstall the app.\n\nOn the upside, I do (in theory) get notified if I come in range of another user, who is later identified as COVID-19 positive. And I could possibly get tested, monitored earlier. Personally, to me this outweighs the limited loss in privacy - which is temporary. At the end of the crisis, we can all just delete the app, and, regain our privacy in full.",
        "Can you please explain how this tech works, especially the Bluetooth tracing part?",
        "Interesting. I wonder what OP's take is on this.",
        "Decompile the apk and check res and src folder, it supports all languages in the world and no Indian company can write such clean code.\n\nMay be file a RTI(not sure whether it works now) requesting  for details of vendor who developed Arogya Setu.",
        "RTIs have already been filed. Awaiting responses. We will publish and disclose all developments publicly and transparently.",
        "That's quite a stretch.",
        "https://indianexpress.com/article/coronavirus/nso-israeli-firm-that-built-spyware-pegasus-testing-corona-tracker-6348929/",
        "Bluetooth uses packets known as beacons. These beacons when not paired will send request signals and accepts response signals in the form of packets from the neighbouring devices. As each device has a unique Bluetooth Mac address the app will make a list of device which was in a range and will upload there and then (I guess).",
        "RemindMe! 1 day",
        "Pretty much what u/Imdr4cu74 said. Each mobile device will use it's Bluetooth to scan other devices in its range (just like what you do to pair with other devices, but no pairing will take place here). It will keep doing this in the background all the time using a background service. If the service finds a device that has the same service broadcasting similar credentials running in its background, it will capture the UID of that device and store it locally. The same thing will happen on the other device.\n\nNow if in the future, one of them gets infected, the list of UUIDs of the user devices will be used to notify them about coming in contact with an infected person and about further steps.",
        "1. So our Bluetooth will be on all the time?\n2. The person coming near to us also needs to have installed this app?",
        "Yes, and it sucks when and only when this app uploads data right away to the gov servers with the precise GPS location.",
        "1. Yes. The new Bluetooth 4 specs, I.e. the Bluetooth low energy consumes low power than what your GPS consumes. Blue tooth classic used to be an energy sucker, things have changed but people need to be made aware of it. Take for instance the arogya app, which uses Bluetooth and GPS, I have not witnessed any significant change in my discharge cycle.\n\n2. Yes, which is why it is less useful given the Indian context. Countries with significant smartphone penetration will benefit the most. For India, it will no doubt aid in contact tracing, but it will also need additional methods. \n\nI believe a tracing mechanism that utilizes cell phone triangulation is in works. Every cellphone will be tracked based on its network signal and a central database will be maintained. It is possible, check the \"Where is my train\" app, but in that app, tracking is done from the user device. I have some hints of this being on the government's cards now after arogya app was launched.\n\nNow that is mass surveillance, but the question is, is a common man bothered by it? Will common man care in this state of pandemic? What will happen to this tech after all of this is over?",
        "The app was developed with support from MakeMyTrip I think.\n\n[Source](https://www.youtube.com/watch?v=fau9MqmSi0g&amp;feature=youtu.be)\n\n\nIn the video the co-founder of MakeMyTrip explains that the app was developed in partnership with them and he also tries to explain the basic functionality and the privacy concerns behind using this app. Key points to take away:\n\n\n1. Uses Bluetooth pinging to check for a close proximity to an actual patient provided he also had the app installed. So it's only effective if most of the population has it installed.\n\n2. Uses GPS information to tell the user if he had been in a designated hot spot.\n\n3. Every mobile is assigned a UID and it keeps a record of all UIDs who were in within the Bluetooth range (~10m). If an UID is found positive later, then all the UIDs who have been in close proximity to the positive UID will get a notification.\n\n4. Makes contact tracing process much faster .\n\n5. Data is wiped off from the servers after 30 days at the moment. This is based on the ICMR directions but it something that can change as their directives change. \n\n6. **MakeMyTrip founder says, that you are free to delete the app and you should definitely delete the app once Covid-19 blows over**.",
        "The app was developed with support from MakeMyTrip I think.\n\n[Source](https://www.youtube.com/watch?v=fau9MqmSi0g&amp;feature=youtu.be)",
        "I just dont understand the fuzz over this. Modi has just asked to download this app. If you dont register and remove all app permissions, THEN TECHNICALLY THEY CANT USE ANYTHING. Please correct me if I am wrong.",
        "I will rather die from corona than install an app made by this fascist govt.",
        "We would recommend going through the working paper from Page 59 onwards. But just to wrap this up quicker for you: \n\n1/ Deleting the app does not delete your data which is gathered at the back-end which is gathered in a centralised manner. \n\n2/ The statements in the Privacy Policy and Terms of Use do not help in meaningful ways since the code is not auditable and further there is no data protection authority to verify.",
        "Removal of the App will not be decrease all risks because:\n\n1/ They policy states deletion in 30 days but still maintain carve outs for extended retention which are vague. Hence, server side data remains. \n\n2/ Govt can retain all anonymized and aggregated datasets indefinitely since none of the privacy safeguards or TOS apply.  This would necessarily include the underlying data of the anonymized data (such as location data) set as well which can easily be used to re-identify you. \n\n3/ Assessments will continue to be done based on these data sets. There are no legislative checks or balances. A data protection authority. Hence, unverifiable safe-gaurds to ensure that deletion actually takes place. \n\n4/ The source code, design architecture documents are not public and the systems by itself is not auditable. Hence, to a large degree there is a expectation of trust without the ability to verify. \n\nWe have factored these issues in the longer working paper but understand its bulky and wordy for common audiences. Hopefully some of these issues can be fixed.",
        "15 days later - gov gonna make it mandatory on devices. Help",
        "We are working towards the whole mandatory/voluntary issue starting tomorrow. Do follow us for regular updates. We will try our best to ensure user choice and consent is maintained :)"
    ],
    "cleaned_text": "aarogya setu privacyfirst nope could beif government wanted ampxb tl dr todays speech announcing extension indias national lockdown till rd may countrys prime minister requested citizens download aarogya setu applicationhttpswwwnewscomnewstechpmmodisaysaarogyasetuappiscriticalinthefightagainstcovidhereishowitworkshtml unfortunately application remains privacy minefield adhere principles minimisation strict purpose limitation transparency accountability iffs working paper analyses application highlights inconsistent right privacy conceivably risk toward permanent system mass surveillance suggests clear recommendations arrest risks background april iff released working paper called privacy prescriptions technology interventions covid indiahttpsdrivegooglecomfiledukrelhcdptyfypccgqkkpqbeoxview significant portion working paper dedicated proliferation experimental contact tracing applications india across world india also launched contact tracing solution called aarogya setu iffs working paper alert chapters devote significant space studying emergent government nongovernment practices standard setting processes first principles space chapter paper studies three specific models contact tracing including singapore governments trace together application mits private kit safe paths initiative aarogya setu contact tracing according contact tracing occurs three steps namely contact identification b contact listing c contact follow particular contact tracing pillar helps public health officials containing pace transmission virus pace transmission measured unit r r naught essentially connotes number people infected person spread disease onto contact tracing traditionally administered use ground personnel volunteer armies however ubiquity smartphones collect vast troves personal information governments across world believe surveillance aid rapid contact tracing owing peculiarities coronavirus authorities across world beginning realise limited efficacy associated respect location surveillance cell tower data gps signals result governments groups either released developing smartphone apps use bluetooth beacons gps signals log instances wherein users device comes contact another users device user app detected covid contact tracing officers might able use app identify close contacts prior days weeks whats risk creation systems come new risks institutionalisation mass surveillance critically india lacks comprehensive data protection law outdated surveillance interception laws meaningful proposals meaningful reform domains like disaster relief apps purported contact tracing technologies often devolve systems movement control lockdown enforcement lot technology solutions demonstrable scientific value national response passed public interest leads poor deployment public resources also makes difficult crisis responders discern snake oil quality technology products risks exacerbated technology markets since adequate checks balances development phases ensure quality systems inadvertently discriminate regions fewer concentrations smartphones specifically lead harmful outcomes people residing economically weaker areas countries public health systems already creaking looming threat capacity deficits systems wrongly urge people preemptively take tests risk public health systems may overwhelmed prematurely may also exacerbate risks associated harvesting personal data like health information also see creation new privacy invasive systems prevent risks systems must consider embedding following principles among others usage applications voluntary data always stored locally peoples devices data must encrypted government access later point must ensure nothing centralised server governments must appreciate data location information proximity confirmations health status whether placed isolation sensitive personal information privacy design assurances phone numbers recorded data encrypted pseudonymisation deployed use app voluntary based consent protections known techniques circumvention therefore need adhere two principles strict limits terms collection duration every step way comprehensive evidencebased justifications every step way aarogya setu compares unfavourably singapore mit consider following aspects disease control purposes countries health authorities leading efforts respond covid example singapore health ministry use systems access limited datainteraction shared european authorities making similar commitments assure citizens law enforcement personnel access systems data therein india multiple committees set context aarogya setu technology responses coronavirus formal notifications press reports reference major involvement ministry health family welfare instead health authorities tertiary institutional players protect peoples right privacy countries including singapore say contact tracing used strictly disease control used enforce lockdowns quarantines aarogya setu retains flexibility ensure comply legal orders minimisation minimisation singapore monitors peoples interactions bluetooth beacons mit gps theres india uses apps collect one data point subsequently replaced scrubbed device identifier indias aarogya setu collects multiple data points personal sensitive personal information increases privacy risks ampxb transparency leads discretion information app frontend rather pedestrian terms service tos privacy policy projects release much information possible pursuit transparency may include accompanying manifesto technical specifications general faqs even source code aarogya setu go opposite route also prohibits external good faith actors reverse engineering application scrutiny information security related research help facilitate stability similarly app capable wrongfully identifying people covid positive admitted apps terms service ask report question paper mean people get diagnosed infected coronavirus based application rather actual medical test similarly mean false positive entails use public transport go work leave city visit friends evokes imagery chinese model surveillance covid highlighted risks well report accountability auditability government blanket liability limitation clause inserted service agreements privacy policies means citizens hold government accountable seek judicial remedy wish ensure governments processes compliant right privacy second government talks certain obligations delete certain personal data application day time period however expected claim comes enough exceptions facilitate government discretion compounded fact researchers individual users actually check government deleted peoples personal information means transparently auditing app backend risk permanence compromises autonomy anonymisation gambit finally app runs palpable risks either expanding scope becoming permanent surveillance architecture people describing current times steroids saw creation proliferation mass interception capabilities governments government failed provide defined period intends review delete ultimately destroy systems data collected aarogya setu project second already reports confirm server linked government datasets linking increases risks permanent systems mass surveillance finally government says tos privacy policy apply capacity falls category anonymised data sets government say something anonymised aggregated longer personally identifiable without showing citizens ensuring level transparency minimum since vulnerability anonymised datasets peoples informational privacy security well documented information security communities considering risk anonymised data sets becoming permanent systems data analysis government keep accountable public scrutiny conclusion iff addressed challenges many undertaking case studies paper eventually sets series recommendations ensure peoples informational privacy protected even uncertain times wherein indian authorities viewing civil liberties afterthought links iffs covid related work working paper privacy prescriptions technology interventions around covid india dated april google docs versionhttpsdocsgooglecomdocumentdndopzygqyteteguolzulaoyffyjdsapdouedituspsharing pdf versionhttpsdrivegooglecomfiledukrelhcdptyfypccgqkkpqbeoxviewuspsharing representation department telecom ensuring connectivity protecting net neutrality due higher dependency telecom networks linkhttpsinternetfreedominurgentstepstobetakenbythedepartmentoftelecomduetothecovid representation ministry health issue advisory disclosure names persons placed quarantine linkhttpsinternetfreedominquarantinelist petition supreme court restore g connectivity jammu kashmir properly equip healthcare professional around covid linkhttpsinternetfreedominscissuesnoticeinfmpspetitionseekingrestorationofginternetservicesinjammukashmirduringcovidcrisis corona virus threat health dont let covid become steroids need help ever please donate iff today become memberhttpsinternetfreedomindonate ",
    "cleaned_title": "aarogya setu privacyfirst nope could beif government wanted",
    "cleaned_selftext": "ampxb tl dr todays speech announcing extension indias national lockdown till rd may countrys prime minister requested citizens download aarogya setu applicationhttpswwwnewscomnewstechpmmodisaysaarogyasetuappiscriticalinthefightagainstcovidhereishowitworkshtml unfortunately application remains privacy minefield adhere principles minimisation strict purpose limitation transparency accountability iffs working paper analyses application highlights inconsistent right privacy conceivably risk toward permanent system mass surveillance suggests clear recommendations arrest risks background april iff released working paper called privacy prescriptions technology interventions covid indiahttpsdrivegooglecomfiledukrelhcdptyfypccgqkkpqbeoxview significant portion working paper dedicated proliferation experimental contact tracing applications india across world india also launched contact tracing solution called aarogya setu iffs working paper alert chapters devote significant space studying emergent government nongovernment practices standard setting processes first principles space chapter paper studies three specific models contact tracing including singapore governments trace together application mits private kit safe paths initiative aarogya setu contact tracing according contact tracing occurs three steps namely contact identification b contact listing c contact follow particular contact tracing pillar helps public health officials containing pace transmission virus pace transmission measured unit r r naught essentially connotes number people infected person spread disease onto contact tracing traditionally administered use ground personnel volunteer armies however ubiquity smartphones collect vast troves personal information governments across world believe surveillance aid rapid contact tracing owing peculiarities coronavirus authorities across world beginning realise limited efficacy associated respect location surveillance cell tower data gps signals result governments groups either released developing smartphone apps use bluetooth beacons gps signals log instances wherein users device comes contact another users device user app detected covid contact tracing officers might able use app identify close contacts prior days weeks whats risk creation systems come new risks institutionalisation mass surveillance critically india lacks comprehensive data protection law outdated surveillance interception laws meaningful proposals meaningful reform domains like disaster relief apps purported contact tracing technologies often devolve systems movement control lockdown enforcement lot technology solutions demonstrable scientific value national response passed public interest leads poor deployment public resources also makes difficult crisis responders discern snake oil quality technology products risks exacerbated technology markets since adequate checks balances development phases ensure quality systems inadvertently discriminate regions fewer concentrations smartphones specifically lead harmful outcomes people residing economically weaker areas countries public health systems already creaking looming threat capacity deficits systems wrongly urge people preemptively take tests risk public health systems may overwhelmed prematurely may also exacerbate risks associated harvesting personal data like health information also see creation new privacy invasive systems prevent risks systems must consider embedding following principles among others usage applications voluntary data always stored locally peoples devices data must encrypted government access later point must ensure nothing centralised server governments must appreciate data location information proximity confirmations health status whether placed isolation sensitive personal information privacy design assurances phone numbers recorded data encrypted pseudonymisation deployed use app voluntary based consent protections known techniques circumvention therefore need adhere two principles strict limits terms collection duration every step way comprehensive evidencebased justifications every step way aarogya setu compares unfavourably singapore mit consider following aspects disease control purposes countries health authorities leading efforts respond covid example singapore health ministry use systems access limited datainteraction shared european authorities making similar commitments assure citizens law enforcement personnel access systems data therein india multiple committees set context aarogya setu technology responses coronavirus formal notifications press reports reference major involvement ministry health family welfare instead health authorities tertiary institutional players protect peoples right privacy countries including singapore say contact tracing used strictly disease control used enforce lockdowns quarantines aarogya setu retains flexibility ensure comply legal orders minimisation minimisation singapore monitors peoples interactions bluetooth beacons mit gps theres india uses apps collect one data point subsequently replaced scrubbed device identifier indias aarogya setu collects multiple data points personal sensitive personal information increases privacy risks ampxb transparency leads discretion information app frontend rather pedestrian terms service tos privacy policy projects release much information possible pursuit transparency may include accompanying manifesto technical specifications general faqs even source code aarogya setu go opposite route also prohibits external good faith actors reverse engineering application scrutiny information security related research help facilitate stability similarly app capable wrongfully identifying people covid positive admitted apps terms service ask report question paper mean people get diagnosed infected coronavirus based application rather actual medical test similarly mean false positive entails use public transport go work leave city visit friends evokes imagery chinese model surveillance covid highlighted risks well report accountability auditability government blanket liability limitation clause inserted service agreements privacy policies means citizens hold government accountable seek judicial remedy wish ensure governments processes compliant right privacy second government talks certain obligations delete certain personal data application day time period however expected claim comes enough exceptions facilitate government discretion compounded fact researchers individual users actually check government deleted peoples personal information means transparently auditing app backend risk permanence compromises autonomy anonymisation gambit finally app runs palpable risks either expanding scope becoming permanent surveillance architecture people describing current times steroids saw creation proliferation mass interception capabilities governments government failed provide defined period intends review delete ultimately destroy systems data collected aarogya setu project second already reports confirm server linked government datasets linking increases risks permanent systems mass surveillance finally government says tos privacy policy apply capacity falls category anonymised data sets government say something anonymised aggregated longer personally identifiable without showing citizens ensuring level transparency minimum since vulnerability anonymised datasets peoples informational privacy security well documented information security communities considering risk anonymised data sets becoming permanent systems data analysis government keep accountable public scrutiny conclusion iff addressed challenges many undertaking case studies paper eventually sets series recommendations ensure peoples informational privacy protected even uncertain times wherein indian authorities viewing civil liberties afterthought links iffs covid related work working paper privacy prescriptions technology interventions around covid india dated april google docs versionhttpsdocsgooglecomdocumentdndopzygqyteteguolzulaoyffyjdsapdouedituspsharing pdf versionhttpsdrivegooglecomfiledukrelhcdptyfypccgqkkpqbeoxviewuspsharing representation department telecom ensuring connectivity protecting net neutrality due higher dependency telecom networks linkhttpsinternetfreedominurgentstepstobetakenbythedepartmentoftelecomduetothecovid representation ministry health issue advisory disclosure names persons placed quarantine linkhttpsinternetfreedominquarantinelist petition supreme court restore g connectivity jammu kashmir properly equip healthcare professional around covid linkhttpsinternetfreedominscissuesnoticeinfmpspetitionseekingrestorationofginternetservicesinjammukashmirduringcovidcrisis corona virus threat health dont let covid become steroids need help ever please donate iff today become memberhttpsinternetfreedomindonate",
    "cleaned_comments": "gold mine data likes chaddichandan get data hook crook sell highest bidder required passing another aadhaar scam actwait data protection scam bill already allows government data sell private players indeed encrypted using aes protocol uploaded servers decryption key known hundreds engineers bureaucrats sell price arogya setu app supports russian japanese mandarin global app someone changed package name application name make indianized check apk analysis arogya sethu app httpswwwredditcomrindiacommentsgqlaskindiaisarogyasetubuiltbywhoworldhttpswwwredditcomrindiacommentsgqlaskindiaisarogyasetubuiltbywhoworld infosys safe say app big yes recommendation install aarogya setu present form without audit source code legal protections highlighted puts people risk source code owned government audited hi please explain us part team building contact tracing app would used bluetooth low energy detect contacts data would stayed users device got infected would uploaded server believe done case truetrace singapore governments app arogya setu lunched stopped working belief apps market hamper tracing rather aiding said tracing bluetooth contacts enough detecting possible infections figuring places people might chances infection government use location history export maps infected person simply ask infected person places visited obtaining list govt could easily notify people possible risk infection people visited places time way need tracking location individual app user data remains users hand govt app many teams working might already dropped work citing similar reasons also made video drawback gps tracing lets hope policymakers listen remove location tracking thoughts app asks pieces information name phone number possibly already available government thanks innumerable ids gotten aadhar pan etc asks give permission use bluetooth location ok government knows fact living lockdown home part government already knows live go havent far thanks dunzo ecommerce apps emergency purposes government could know grocery storemedical shop going want go someplace dont want government track always turn permissions uninstall app upside theory get notified come range another user later identified covid positive could possibly get tested monitored earlier personally outweighs limited loss privacy temporary end crisis delete app regain privacy full please explain tech works especially bluetooth tracing part interesting wonder ops take decompile apk check res src folder supports languages world indian company write clean code may file rtinot sure whether works requesting details vendor developed arogya setu rtis already filed awaiting responses publish disclose developments publicly transparently thats quite stretch bluetooth uses packets known beacons beacons paired send request signals accepts response signals form packets neighbouring devices device unique bluetooth mac address app make list device range upload guess remindme day pretty much uimdrcu said mobile device use bluetooth scan devices range like pair devices pairing take place keep background time using background service service finds device service broadcasting similar credentials running background capture uid device store locally thing happen device future one gets infected list uuids user devices used notify coming contact infected person steps bluetooth time person coming near us also needs installed app yes sucks app uploads data right away gov servers precise gps location yes new bluetooth specs ie bluetooth low energy consumes low power gps consumes blue tooth classic used energy sucker things changed people need made aware take instance arogya app uses bluetooth gps witnessed significant change discharge cycle yes less useful given indian context countries significant smartphone penetration benefit india doubt aid contact tracing also need additional methods believe tracing mechanism utilizes cell phone triangulation works every cellphone tracked based network signal central database maintained possible check train app app tracking done user device hints governments cards arogya app launched mass surveillance question common man bothered common man care state pandemic happen tech app developed support makemytrip think sourcehttpswwwyoutubecomwatchvfaumqmsigampfeatureyoutube video cofounder makemytrip explains app developed partnership also tries explain basic functionality privacy concerns behind using app key points take away uses bluetooth pinging check close proximity actual patient provided also app installed effective population installed uses gps information tell user designated hot spot every mobile assigned uid keeps record uids within bluetooth range uid found positive later uids close proximity positive uid get notification makes contact tracing process much faster data wiped servers days moment based icmr directions something change directives change makemytrip founder says free delete app definitely delete app covid blows app developed support makemytrip think sourcehttpswwwyoutubecomwatchvfaumqmsigampfeatureyoutube dont understand fuzz modi asked download app dont register remove app permissions technically cant use anything please correct wrong rather die corona install app made fascist govt would recommend going working paper page onwards wrap quicker deleting app delete data gathered backend gathered centralised manner statements privacy policy terms use help meaningful ways since code auditable data protection authority verify removal app decrease risks policy states deletion days still maintain carve outs extended retention vague hence server side data remains govt retain anonymized aggregated datasets indefinitely since none privacy safeguards tos apply would necessarily include underlying data anonymized data location data set well easily used reidentify assessments continue done based data sets legislative checks balances data protection authority hence unverifiable safegaurds ensure deletion actually takes place source code design architecture documents public systems auditable hence large degree expectation trust without ability verify factored issues longer working paper understand bulky wordy common audiences hopefully issues fixed days later gov gon na make mandatory devices help working towards whole mandatoryvoluntary issue starting tomorrow follow us regular updates try best ensure user choice consent maintained",
    "light_cleaned_title": "Is Aarogya Setu privacy-first? Nope, but it could be-If the government wanted.",
    "light_cleaned_selftext": "**Tl; dr** In today’s speech announcing the extension of India’s national lockdown till 3rd May, 2020 the country’s Prime Minister requested citizens to [**download the** ***Aarogya Setu*** **application**](https://www.news18.com/news/tech/pm-modi-says-aarogya-setu-app-is-critical-in-the-fight-against-covid-here-is-how-it-works-2576857.html). Unfortunately, the application remains a privacy minefield and it does not adhere to principles of minimisation, strict purpose limitation, transparency and accountability. IFF’s Working Paper, analyses the application, highlights how it is inconsistent with the right to privacy, is conceivably a risk toward a permanent system of mass surveillance, and suggests clear recommendations to arrest these risks. **Background** On April 13, 2020 IFF released its working paper called, “[***Privacy Prescriptions for technology interventions on COVID-19 in India***](https://drive.google.com/file/d/1UK5rElhcdP5T3Y-8fYP6cCgQKKpQBeOX/view)”. A significant portion of this working paper is dedicated to the proliferation of experimental contact tracing applications not just in India but across the world. India has also launched its own contact tracing solution called *Aarogya Setu*. IFF’s working paper was alert to this and Chapters 5-7 devote significant space in studying the emergent government and non-government practices, standard setting processes and first principles in the space. Chapter 7 of the paper studies three specific models of contact tracing including the Singapore Government’s *Trace Together* application, MIT’s *Private Kit: Safe Paths* initiative, and *Aarogya Setu*. **What is Contact Tracing?** According to the WHO, contact tracing occurs in three steps namely (a) contact identification; (b) contact listing; and (c) contact follow up. In particular, contact tracing is a pillar which helps public health officials in containing and the pace of transmission of the virus. This pace of transmission is measured by the unit R0 (R naught) which essentially connotes the number of people an infected person can spread the disease onto. Contact tracing has traditionally been administered through the use of on ground personnel and volunteer armies. However, with the ubiquity of smartphones, which collect vast troves of personal information, governments across the world believe surveillance can aid with rapid contact tracing. But owing to the peculiarities of the coronavirus, authorities across the world are beginning to realise the limited efficacy associated with respect to location surveillance (both with cell tower data and with GPS signals). As a result governments and other groups have either released or are developing smartphone apps that use Bluetooth beacons or GPS signals to log instances wherein a user’s device comes in contact with another user’s device. When a user of the app is detected to have Covid-19, contact tracing officers might be able to use the app to identify their close contacts in the prior days or weeks. **What’s the Risk?** With the creation of such systems, come new risks of institutionalisation of mass surveillance. Critically, India lacks a comprehensive data protection law, outdated surveillance and interception laws, or any meaningful proposals for meaningful reform. In domains like disaster relief, most apps which are purported as ‘contact tracing’ technologies, they often devolve into systems of movement control and lockdown enforcement. A lot of technology solutions with no demonstrable scientific value to the national response can be passed off as being in the public interest. It leads to poor deployment of public resources and also makes it difficult for crisis responders to discern between “snake oil” and quality technology products. These risks are exacerbated in technology markets since there are no adequate checks and balances in development phases which ensure quality. Such systems inadvertently discriminate against regions which have fewer concentrations of smartphones. Specifically, it can lead to harmful outcomes for people residing in economically weaker areas. In countries public health systems are already creaking under the looming threat of capacity deficits. If such systems wrongly urge people to pre-emptively take tests then there is a risk that public health systems may be overwhelmed prematurely. It may also exacerbate the risks associated with the harvesting of personal data like health information, and also see the creation of new privacy invasive systems. **How to prevent these risks?** Such systems must consider embedding the following principles among others: 1. The usage of these applications should be voluntary 2. All data should always be stored locally on people’s devices 3. This data must be encrypted 4. No Government can access it at a later point, so must ensure nothing is centralised in a server 5. Governments must appreciate that any data from location information, to proximity confirmations, to health status, to whether they have been placed in isolation is sensitive personal information. 6. Privacy by design is more than just assurances that phone numbers are not recorded, all data is encrypted, pseudonymisation is deployed or that the use of the app is “voluntary” and based on consent. Most of these protections have known techniques of circumvention. Therefore, we need to adhere to two principles: 1. Strict limits (in terms of collection and duration )every step of the way; and 2. Comprehensive evidence-based justifications every step of the way **Aarogya Setu compares unfavourably to Singapore and MIT** Consider the following aspects. **Is this for disease control or for other purposes?** In other countries, health authorities are leading the efforts to respond to COVID-19. For example, in Singapore only its health ministry can use these systems or have access to any limited data/interaction which is shared with them. European authorities are making similar commitments. They assure citizens that law enforcement personnel will not have access to these systems or the data therein. In India, multiple committees have been set up in the context of *Aarogya Setu* or other technology responses to the coronavirus. But formal notifications nor press reports have any reference to major involvement of the Ministry of Health and Family Welfare. Instead health authorities are being tertiary institutional players. To protect people’s right to privacy, countries (including Singapore) say that contact tracing will be used strictly for disease control and cannot be used to enforce lockdowns or quarantines. ***Aarogya Setu*** **retains the flexibility to do just that, or to ensure comply legal orders and so on**. **Minimisation? What Minimisation?** 1. Singapore monitors people’s interactions through Bluetooth beacons, MIT does it through GPS, and **then there’s India which uses both**. 2. Other apps just collect one data point which is subsequently replaced with a scrubbed device identifier. India’s Aarogya Setu **collects multiple data points** for personal and sensitive personal information which increases privacy risks.  **No Transparency leads to discretion** The only information we have of the app is its frontend and its rather pedestrian Terms of Service (TOS) and Privacy Policy. Other projects release as much information as possible in pursuit of transparency. This may include an accompanying manifesto, technical specifications, general FAQs, and even its source code. Not only does *Aarogya Setu* go the opposite route but it also prohibits external good faith actors from reverse engineering the application for further scrutiny, information security and other related research which help facilitate stability. Similarly, the app is capable of wrongfully identifying people as COVID-19 positive as admitted in the app’s Terms of Service. We ask in our report the question in our paper, does this mean people can get diagnosed as being infected with coronavirus based on an application rather than an actual medical test? Similarly, does this mean that a false positive entails that I cannot use public transport and go to work or leave the city to visit friends? This evokes imagery of the Chinese model of surveillance during COVID-19 and we have highlighted these risks as well in the report. **No Accountability and No Auditability** The Government has a blanket liability limitation clause inserted into its service agreements and privacy policies. This means citizens cannot hold the Government accountable or seek judicial remedy should they wish to ensure the Government’s processes are compliant with the right to privacy. Second, the Government talks about certain obligations to delete certain personal data from its application after a 30 day time period. However, as expected this claim comes with enough exceptions which facilitate government discretion. This is compounded with the fact that both researchers and individual users cannot actually check if the Government has deleted people’s personal information and has no means of transparently auditing what the app is doing in the backend. **Risk of Permanence and Compromises to Autonomy | The Anonymisation Gambit** Finally, the app runs very palpable risks of either expanding in scope or becoming a permanent surveillance architecture. People are describing the current times as 9/11 on steroids. And with 9/11 we saw the creation and proliferation of mass interception capabilities for some governments. The Government has failed to provide any defined period by when it intends to review, delete and ultimately destroy its systems and data which is collected under the *Aarogya Setu* project. Second, there are already reports which confirm that this server is being linked with other government datasets. Such linking increases risks of permanent systems of mass surveillance. Finally, the Government says that the TOS and Privacy Policy do not apply in any capacity to what falls under the category of anonymised data sets. The government cannot just say something is anonymised and aggregated so no longer personally identifiable without showing its citizens how it is ensuring this. This level of transparency is a minimum, since the vulnerability of anonymised datasets to people’s informational privacy and security is well documented in information security communities. Considering the risk of these anonymised data sets becoming permanent systems of data analysis, the Government has to keep itself accountable to public scrutiny. **Conclusion** IFF has addressed all of these challenges and many more when undertaking its case studies, and the paper eventually sets out a series of 17 recommendations to ensure people’s informational privacy are protected even in these uncertain times, wherein Indian authorities are viewing civil liberties as an afterthought. **Links to IFF’s COVID-19 Related Work** 1. Working paper \"Privacy prescriptions for technology interventions around Covid-19 in India\" dated April 13, 2020 ([**Google Docs version**](https://docs.google.com/document/d/1nDoPzygQyTetEguOlzula5O9y5f3f5YJDsA2Pd99O6U/edit?usp=sharing) / [**PDF Version**](https://drive.google.com/file/d/1UK5rElhcdP5T3Y-8fYP6cCgQKKpQBeOX/view?usp=sharing)) 2. Representation to the Department for Telecom on ensuring connectivity and protecting net neutrality due to higher dependency on telecom networks ([**link**](https://internetfreedom.in/urgent-steps-to-be-taken-by-the-department-of-telecom-due-to-the-covid/)) 3. Representation to the Ministry of Health to issue an advisory against the disclosure of the names of persons placed under quarantine ([**link**](https://internetfreedom.in/quarantine-list/)) 4. Petition before the Supreme Court to restore 4G connectivity in Jammu and Kashmir to properly equip healthcare professional around Covid-19 ([**link**](https://internetfreedom.in/sc-issues-notice-in-fmps-petition-seeking-restoration-of-4g-internet-services-in-jammu-kashmir-during-covid-19-crisis/)) [***The Corona virus is not only a threat to our health. Don’t let COVID-19 become 9/11 on steroids. We need your help now more than ever. Please donate to IFF today and become a member***](https://internetfreedom.in/donate/).",
    "light_cleaned_comments": "1. This is gold mine of data, likes of chaddichandan will get these data by hook or crook and sell it to highest bidder, if required by passing another aadhaar scam act(wait, data protection scam bill already allows government to own your data and sell it to private players). 1. It is indeed encrypted using AES 256 protocol and uploaded to servers, but the decryption key will be known to hundreds of engineers and bureaucrats, who can sell it for a price. 2. Arogya Setu app supports Russian, Japanese and Mandarin, this is a global app, someone just changed the package name and application name to make it Indianized 3. Check the apk analysis for \"Arogya Sethu\" app [https://www.reddit.com/r/india/comments/g0ql25/askindia\\_is\\_arogya\\_setu\\_built\\_by\\_whoworld/](https://www.reddit.com/r/india/comments/g0ql25/askindia_is_arogya_setu_built_by_whoworld/) \\#infosys So is it safe to say this app is a big no no? Yes, our recommendation is not to install Aarogya Setu in it's present form without an audit of it's source code and legal protections as highlighted above. It puts people to risk. Source code is not owned by government, can not be audited. Hi! Can you please explain this to us? I was part of a team building a contact tracing app that would have used Bluetooth low energy to detect contacts. The data would have stayed on the users device and if and when they got infected, only then it would be uploaded to the server. I believe same was done in the case of TrueTrace the Singapore governments app. But after arogya setu was lunched we stopped working on it with the belief that when there are more apps on the market, it will hamper the tracing rather than aiding to it. That being said, only tracing Bluetooth contacts is enough for detecting possible infections. For figuring out places where people might have chances of infection, government can use the location history export from maps of a infected person or simply ask the infected person about the places they visited. By obtaining that list govt. could easily notify people about possible risk of infection to people who have visited these places during this time. This way there is no need of tracking the location of each individual app user and the data remains in users hand. But as the govt app is out now, many team's who were working on the same might have already dropped the work citing similar reasons. We also made a video about the drawback of GPS tracing. Let's hope the policymakers listen and remove location tracking. My thoughts on this 1. The app asks for 2 pieces of information - Name and Phone Number. Both of these are possibly already available to the government, thanks to the innumerable id's we have gotten - Aadhar, PAN, etc. 2. It then asks to give permission to use Bluetooth and location. Ok. So, now the government knows where I am. But, the fact is that we are living under a lockdown - and, are at home (or should be for the most part). The government already knows where we live. If I do go out (which I haven't so far, thanks to Dunzo and other eCommerce apps), it will be only for emergency purposes. So, the government could know which grocery store/medical shop I am going to. If I do want to go someplace, where I don't want the government to track me, I can always turn off permissions or uninstall the app. On the upside, I do (in theory) get notified if I come in range of another user, who is later identified as COVID-19 positive. And I could possibly get tested, monitored earlier. Personally, to me this outweighs the limited loss in privacy - which is temporary. At the end of the crisis, we can all just delete the app, and, regain our privacy in full. Can you please explain how this tech works, especially the Bluetooth tracing part? Interesting. I wonder what OP's take is on this. Decompile the apk and check res and src folder, it supports all languages in the world and no Indian company can write such clean code. May be file a RTI(not sure whether it works now) requesting for details of vendor who developed Arogya Setu. RTIs have already been filed. Awaiting responses. We will publish and disclose all developments publicly and transparently. That's quite a stretch. Bluetooth uses packets known as beacons. These beacons when not paired will send request signals and accepts response signals in the form of packets from the neighbouring devices. As each device has a unique Bluetooth Mac address the app will make a list of device which was in a range and will upload there and then (I guess). RemindMe! 1 day Pretty much what u/Imdr4cu74 said. Each mobile device will use it's Bluetooth to scan other devices in its range (just like what you do to pair with other devices, but no pairing will take place here). It will keep doing this in the background all the time using a background service. If the service finds a device that has the same service broadcasting similar credentials running in its background, it will capture the UID of that device and store it locally. The same thing will happen on the other device. Now if in the future, one of them gets infected, the list of UUIDs of the user devices will be used to notify them about coming in contact with an infected person and about further steps. 1. So our Bluetooth will be on all the time? 2. The person coming near to us also needs to have installed this app? Yes, and it sucks when and only when this app uploads data right away to the gov servers with the precise GPS location. 1. Yes. The new Bluetooth 4 specs, I.e. the Bluetooth low energy consumes low power than what your GPS consumes. Blue tooth classic used to be an energy sucker, things have changed but people need to be made aware of it. Take for instance the arogya app, which uses Bluetooth and GPS, I have not witnessed any significant change in my discharge cycle. 2. Yes, which is why it is less useful given the Indian context. Countries with significant smartphone penetration will benefit the most. For India, it will no doubt aid in contact tracing, but it will also need additional methods. I believe a tracing mechanism that utilizes cell phone triangulation is in works. Every cellphone will be tracked based on its network signal and a central database will be maintained. It is possible, check the \"Where is my train\" app, but in that app, tracking is done from the user device. I have some hints of this being on the government's cards now after arogya app was launched. Now that is mass surveillance, but the question is, is a common man bothered by it? Will common man care in this state of pandemic? What will happen to this tech after all of this is over? The app was developed with support from MakeMyTrip I think. [Source](https://www.youtube.com/watch?v=fau9MqmSi0g&amp;feature=youtu.be) In the video the co-founder of MakeMyTrip explains that the app was developed in partnership with them and he also tries to explain the basic functionality and the privacy concerns behind using this app. Key points to take away: 1. Uses Bluetooth pinging to check for a close proximity to an actual patient provided he also had the app installed. So it's only effective if most of the population has it installed. 2. Uses GPS information to tell the user if he had been in a designated hot spot. 3. Every mobile is assigned a UID and it keeps a record of all UIDs who were in within the Bluetooth range (~10m). If an UID is found positive later, then all the UIDs who have been in close proximity to the positive UID will get a notification. 4. Makes contact tracing process much faster . 5. Data is wiped off from the servers after 30 days at the moment. This is based on the ICMR directions but it something that can change as their directives change. 6. **MakeMyTrip founder says, that you are free to delete the app and you should definitely delete the app once Covid-19 blows over**. The app was developed with support from MakeMyTrip I think. [Source](https://www.youtube.com/watch?v=fau9MqmSi0g&amp;feature=youtu.be) I just dont understand the fuzz over this. Modi has just asked to download this app. If you dont register and remove all app permissions, THEN TECHNICALLY THEY CANT USE ANYTHING. Please correct me if I am wrong. I will rather die from corona than install an app made by this fascist govt. We would recommend going through the working paper from Page 59 onwards. But just to wrap this up quicker for you: 1/ Deleting the app does not delete your data which is gathered at the back-end which is gathered in a centralised manner. 2/ The statements in the Privacy Policy and Terms of Use do not help in meaningful ways since the code is not auditable and further there is no data protection authority to verify. Removal of the App will not be decrease all risks because: 1/ They policy states deletion in 30 days but still maintain carve outs for extended retention which are vague. Hence, server side data remains. 2/ Govt can retain all anonymized and aggregated datasets indefinitely since none of the privacy safeguards or TOS apply. This would necessarily include the underlying data of the anonymized data (such as location data) set as well which can easily be used to re-identify you. 3/ Assessments will continue to be done based on these data sets. There are no legislative checks or balances. A data protection authority. Hence, unverifiable safe-gaurds to ensure that deletion actually takes place. 4/ The source code, design architecture documents are not public and the systems by itself is not auditable. Hence, to a large degree there is a expectation of trust without the ability to verify. We have factored these issues in the longer working paper but understand its bulky and wordy for common audiences. Hopefully some of these issues can be fixed. 15 days later - gov gonna make it mandatory on devices. Help We are working towards the whole mandatory/voluntary issue starting tomorrow. Do follow us for regular updates. We will try our best to ensure user choice and consent is maintained :)"
}