{
    "id": "16mg56g",
    "title": "Women’s Bill Buzz: Rollout likely after delimitation, probably in 2029",
    "url": "https://indianexpress.com/article/political-pulse/womens-reservation-bill-buzz-rollout-likely-after-delimitation-probably-in-2029-8945865/",
    "selftext": "The Union Cabinet, which held an unscheduled meeting Monday evening, is said to have cleared the path-breaking legislation, sources said.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695094093.0,
    "convurl": "https://external-preview.redd.it/xfoA-k-MRxKP0dYLIWG-VaOxCfW3pnUlHd9K3i7djOQ.jpg?auto=webp&s=fcb5eabe0aa112fe44cf9f4ba48ca01f355e61ec",
    "comments": [
        ">“The Bill will be brought in the ongoing session but there are many ifs and buts…so the implementation is unlikely before the next Lok Sabha election. Most probably, it will take place only after the delimitation (which is expected to be held in 2026) but the process will begin soon,” said a top source familiar with the developments."
    ],
    "cleaned_text": "womens bill buzz rollout likely delimitation probably union cabinet held unscheduled meeting monday evening said cleared pathbreaking legislation sources said ",
    "cleaned_title": "womens bill buzz rollout likely delimitation probably",
    "cleaned_selftext": "union cabinet held unscheduled meeting monday evening said cleared pathbreaking legislation sources said",
    "cleaned_comments": "bill brought ongoing session many ifs butsso implementation unlikely next lok sabha election probably take place delimitation expected held process begin soon said top source familiar developments",
    "light_cleaned_title": "Women’s Bill Buzz: Rollout likely after delimitation, probably in 2029",
    "light_cleaned_selftext": "The Union Cabinet, which held an unscheduled meeting Monday evening, is said to have cleared the path-breaking legislation, sources said.",
    "light_cleaned_comments": ">“The Bill will be brought in the ongoing session but there are many ifs and buts…so the implementation is unlikely before the next Lok Sabha election. Most probably, it will take place only after the delimitation (which is expected to be held in 2026) but the process will begin soon,” said a top source familiar with the developments."
}