{
    "id": "15q38vv",
    "title": "I received a pizza with dead insects inside from Domino's. They apologized and promised to credit some points to my account. Do you think this is fair or should I proceed with other necessary actions? If so, please guide me.",
    "url": "https://www.reddit.com/r/india/comments/15q38vv/i_received_a_pizza_with_dead_insects_inside_from/",
    "selftext": "Just to make things clear, the insects were in the box, not in or on the pizza, still disgusting though.  \nThese are the images:  [image1](https://imgur.com/3tdeFac)  [image2](https://imgur.com/5N1eIHH)\n\n&#x200B;\n\n  \n",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691944023.0,
    "convurl": "https://external-preview.redd.it/zUjtkJVKBz7Fq9ZPwRiEep6nTlHwglu3QdhYU-A2yns.jpg?auto=webp&s=064e2514c063987016377cbd02ca06aefb70f495",
    "comments": [
        "What are other options? \n\nLike full money back & a fresh pizza? That would be a minimum for me.",
        "Sure, I will ask for a full refund."
    ],
    "cleaned_text": "received pizza dead insects inside dominos apologized promised credit points account think fair proceed necessary actions please guide make things clear insects box pizza still disgusting though images imagehttpsimgurcomtdefac imagehttpsimgurcomneihh xb ",
    "cleaned_title": "received pizza dead insects inside dominos apologized promised credit points account think fair proceed necessary actions please guide",
    "cleaned_selftext": "make things clear insects box pizza still disgusting though images imagehttpsimgurcomtdefac imagehttpsimgurcomneihh xb",
    "cleaned_comments": "options like full money back fresh pizza would minimum sure ask full refund",
    "light_cleaned_title": "I received a pizza with dead insects inside from Domino's. They apologized and promised to credit some points to my account. Do you think this is fair or should I proceed with other necessary actions? If so, please guide me.",
    "light_cleaned_selftext": "Just to make things clear, the insects were in the box, not in or on the pizza, still disgusting though. These are the images: [image1](https://imgur.com/3tdeFac) [image2](https://imgur.com/5N1eIHH) &#x200B;",
    "light_cleaned_comments": "What are other options? Like full money back & a fresh pizza? That would be a minimum for me. Sure, I will ask for a full refund."
}