{
    "id": "1g0fphl",
    "title": "Curbing misinformation or chilling free speech? Navigating India’s legal response\n",
    "url": "https://www.reddit.com/r/india/comments/1g0fphl/curbing_misinformation_or_chilling_free_speech/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/iivzoxleowtd1.png?width=1600&format=png&auto=webp&s=c8733ba4644a813a6c08340ee2d0098a27f0888a)\n\n# tl;dr\n\nWhile addressing concerns about the aggressive crackdown on misinformation by law enforcement agencies, the Madras High Court recently ruled that not all cases of sharing misinformation warrant legal action, especially if they do not pose an immediate threat to public order. In this blogpost, we examine the legality of arrests for sharing misinformation, the risks to freedom of speech and expression, and the need to balance fundamental rights with public order.\n\n# Important Documents \n\n1. Madras HC Order dated 09.08.2024 ([Link](https://drive.google.com/file/d/1QX0AqIHXIKOs6nrkGDB6P1ChFWn-U5Ta/view?usp=sharing))\n\n# Why should you care? \n\nThe [increasing](https://carnegieendowment.org/research/2024/07/india-thailand-social-media-moderation) legal crackdown on misinformation in today’s digital landscape raises serious concerns about the violation of fundamental rights to free speech and liberty. While the Indian Constitution permits reasonable restrictions on freedom of speech and expression under Article 19(2), using criminal prosecution or preventive detention for every instance of misinformation is excessive and counterproductive. Such actions require clear evidence of a genuine threat to public order, as simply sharing unverified information does not justify detention. This approach risks undermining democratic discourse and core constitutional values, highlighting the need for a balanced response that safeguards individual freedoms while addressing misinformation. \n\n# Background \n\nOn May 12, 2024, the Greater Chennai Police issued a detention order against an individual classified as a “Goonda” under State law for allegedly circulating false documents on social media about a tender process. This arrest prompted the filing of a Habeas Corpus Petition, which was reviewed by the Madras High Court. After adjudication, the Court issued a pivotal [order](https://drive.google.com/file/d/1QX0AqIHXIKOs6nrkGDB6P1ChFWn-U5Ta/view?usp=sharing) regarding the prosecution of cases involving the sharing of content on social media platforms. The Court emphasised that criminal charges should not be applied to every instance of sharing false information, particularly when it does not pose an immediate threat to public order. \n\nSimilar instances of arrests for sharing misinformation have been increasingly reported, particularly in the context of political and social issues (see [here](https://timesofindia.indiatimes.com/city/thiruvananthapuram/youtuber-arrested-in-kerala-for-fake-news-on-evms/articleshow/108999629.cms), [here](https://timesofindia.indiatimes.com/city/madurai/two-held-for-fake-news-on-child-kidnappings/articleshow/108280841.cms),  [here](https://www.thehindu.com/news/cities/bangalore/x-user-from-goa-arrested-for-spreading-misinformation-on-social-media-manipulating-siddaramaiahs-post/article68193269.ece), and [here](https://scroll.in/latest/1068550/lawyer-booked-for-sharing-youtuber-dhruv-rathees-video-criticising-modi-in-whatsapp-group)). The most concerning aspect of these arrests is that they often occur without a thorough examination of the intent of the individuals involved. Many of these cases appear to be driven by a broad interpretation of what constitutes misinformation, and on the grounds of disturbing public order which leads to arrests that may not consider whether the individual had disrupted public order, had malicious intent, or was simply expressing an opinion. Moreover, the lack of clear laws defining misinformation results in arbitrary arrests under laws like the Unlawful Activities (Prevention) (“**UAPA**”) Act, 1967, the Information Technology (“**IT**”) Act, 2000, and other criminal statutes. This raises concerns about the potential misuse of legal frameworks and suppression of legitimate dissent. The Madras High Court's ruling on this critical issue emphasises the need for a nuanced approach, advocating that legal action should only target cases where misinformation significantly threatens public safety to balance the right to liberty and free expression with public order. \n\n\n\n# ‘Public order’ or a catch-all for misuse\n\nThe lack of a clear definition of \"public order\" as an exception to free speech under Article 19(1)(a) has led to patchy protections, allowing Union and state governments to use it as a shield to justify actions that violate fundamental rights. The lack of clarity is particularly troubling in the context of online expression, where social media has become a primary forum for sharing opinions. In many [cases](https://www.hrw.org/news/2023/10/13/india-arrests-raids-target-critics-government), individuals have been arrested for posting opinions that authorities deem problematic or critical of the government. Though the definition of ‘public order’ is not provided in any statute, the courts have defined and interpreted its scope from time to time. \n\nThe Supreme Court in [*Ramji Lal Modi* v. *the State of Uttar Prades*](https://main.sci.gov.in/judgment/judis/656.pdf)*h* for the first time defined the scope of public order and applied the “calculated tendency” test to judge if it was disturbed. In the landmark case of [*Dr. Ram Manohar Lohia* v. *State of Bihar*](https://main.sci.gov.in/jonew/judis/2897.pdf),  the Supreme Court explained that ‘public order’ refers to more serious disturbances that affect the community at large, not just minor issues. The Supreme Court deviated from the previous interpretations of public order by applying the ‘close proximity test’ and stating that “every breach of the peace does not lead to public disorder.” Even though *Ram Manohar Lohia* still holds the fort on this issue, the protection accorded by the Supreme Court has been patchy at best as on several occasions (see [here](https://main.sci.gov.in/jonew/judis/28963.pdf), and [here](https://api.sci.gov.in/supremecourt/2003/22125/22125_2003_Order_20-Sep-2017.pdf)), the restriction on freedom of speech and expression has been upheld for hurting the sentiments of certain communities. \n\nIn the incumbent ruling, the Madras High Court also defined the scope of public order by stating that the term needs clear boundaries to prevent its misuse. It held that public order should not cover every minor disturbance and the arrests based on vague allegations of disturbing public order are not legal. It held that there must be a real threat of widespread disruption to prompt such action. The Madras High Court while specifically dealing with the opinions and content shared on social media, which is generally put under the umbrella of disturbing public order, said :\n\n“*Can the voices of everyone be strangulated to curb these small groups from spreading unpleasant opinions? The people consuming information on social media are the best judges of these views and opinions. The Constitutional Institutions cannot indulge in a process to influence the views of the people. Actions of the Institution speak for themselves and the views may come and go.*”\n\n# Unjust arrests: a need for caution\n\nIt has been[ observed](https://www.hrw.org/report/2016/05/25/stifling-dissent/criminalization-peaceful-expression-india) that the constant threat of arrest and potential imprisonment can deter people from speaking out. Even with a solid defence, an accused has to endure a lengthy and costly process, while complainants face few consequences if their claims are unfounded. The Madras High Court determined that the grounds for preventive detention in this case were inadequate. It was stressed that unless there is clear evidence of a serious threat to public order, mere criticism or dissent, especially on social media, should not justify preventive detention. These laws should be used sparingly and only when absolutely necessary. Relying on the case of  [*Pramod Singla* v. *Union of India*](https://indiankanoon.org/doc/123047365/) where the Supreme Court warned against the potential misuse of preventive detention laws, the Court emphasised that protecting individual rights is a key constitutional duty that is meant to prevent the misuse of State power. \n\n# Tug of War: Free Speech vs. Misinformation\n\nThe Madras High Court noted that the State should avoid cracking down on opinions that are based on false assumptions and biased views. This reflects American free speech [jurisprudence principles](https://www.americanbar.org/groups/crsj/publications/human_rights_magazine_home/the-ongoing-challenge-to-define-free-speech/counterspeech-in-response-to-free-speech/#:~:text=The%20Court%20has%20increasingly%20strongly,if%20it%20is%20deeply%20loathed), particularly viewpoint neutrality, and the emergency principle. Viewpoint neutrality means that the government cannot punish speech just because it’s considered hateful or unacceptable. The emergency principle states that the government cannot suppress speech unless it poses a \"clear and present danger.\" The debate over regulating hate speech is ongoing: some advocate for regulation, while others support viewpoint neutrality and the emergency principle. By stating, “T*he choice to consume content is always at the disposal of the viewer*,” the Madras High Court leans toward encouraging counter-speech rather than excessive government control.  \n\nA similar position was reflected in the dissenting opinion of Justice G.S. Patel of the Bombay High Court in [*Kunal Kamra and Ors.* v. *Union of India and Ors.*](https://www.livelaw.in/pdf_upload/kunal-kamra-split-verdict-as-per-j-patel-519755.pdf) challenging the constitution of Fact-Check Units by the State:\n\n“*We should not forget that social media ‘users’ do not just post content. They also consume it. They are readers as much as they are writers (or forwarders, or ‘posters’, or whatever the term might be). The point that Mr. Seervai makes is, I believe, that it is not for any one agency to decide — in the marketplace of ideas — what a reader should or should not consume, or how he or she should make up his mind.*”\n\n# Agree to disagree \n\nThe \"marketplace of ideas\" is a space that encourages discussion, dissent, and debate, recognizing that many different opinions are valuable rather than just one accepted viewpoint. Disagreement and debate are essential to freedom of speech, making this marketplace thrive on diverse thoughts and the challenges that come with them. Engaging in this space means being open to discomfort and unfamiliar ideas, requiring civil discourse even if agreement is not always possible. While the marketplace promotes free expression, it also allows for the spread of false or misleading information alongside valid opinions. The key challenge is to address misinformation without limiting free speech, which demands careful management to ensure that efforts to correct falsehoods do not lead to excessive censorship. The idea of public order should not be misused to suppress speech that is merely controversial or uncomfortable. Overly aggressive attempts like arrests to control misinformation can unfairly target legitimate opinions and dissent. Instead of resorting to broad censorship and preventive detentions, the focus should be on encouraging counter-speech and fostering an environment where diverse viewpoints can be openly debated.\n\n# Finding the Balance\n\nThe Madras High Court ruling reminds us that protecting fundamental rights should always be at the heart of any efforts to tackle misinformation. Overstepping in this area can silence genuine voices and weaken democracy and public trust. As we face challenges in the digital age, it is important for both – the government and citizens – to focus on upholding our constitutional values. Dealing with misinformation should not come at the expense of our democratic freedoms. Instead, it should involve targeted actions that address genuine threats without compromising the core principles enshrined in our Constitution. \n\n  \nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)\n\n",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 3,
    "created_utc": 1728556225.0,
    "convurl": "https://b.thumbs.redditmedia.com/DcOd3d_K4HM2DU9dFljNr-kk1X_7CcBv9rk4qPiQNzA.jpg",
    "comments": [
        "the damage that mis information and fake forwards do are tremendous and until such time the masses, learn some ethics and etiquette, having these restrictions are appropriate.",
        "Hard no. Human rights are paramount and losing or giving away ground in the free speech debate is akin to losing democracy.",
        "admitting fake news peddlers to distort and destroy truth is equally bad and a dent to democracy. there can be no guarantees in a regime that perpetuates false hood."
    ],
    "cleaned_text": "curbing misinformation chilling free speech navigating indias legal response iff needs support ever details end posthttpspreviewredditiivzoxleowtdpngwidthformatpngautowebpscbaaaceedafa tldr addressing concerns aggressive crackdown misinformation law enforcement agencies madras high court recently ruled cases sharing misinformation warrant legal action especially pose immediate threat public order blogpost examine legality arrests sharing misinformation risks freedom speech expression need balance fundamental rights public order important documents madras hc order dated linkhttpsdrivegooglecomfiledqxaqihxikosnrkgdbpchfwnutaviewuspsharing care increasinghttpscarnegieendowmentorgresearchindiathailandsocialmediamoderation legal crackdown misinformation todays digital landscape raises serious concerns violation fundamental rights free speech liberty indian constitution permits reasonable restrictions freedom speech expression article using criminal prosecution preventive detention every instance misinformation excessive counterproductive actions require clear evidence genuine threat public order simply sharing unverified information justify detention approach risks undermining democratic discourse core constitutional values highlighting need balanced response safeguards individual freedoms addressing misinformation background may greater chennai police issued detention order individual classified goonda state law allegedly circulating false documents social media tender process arrest prompted filing habeas corpus petition reviewed madras high court adjudication court issued pivotal orderhttpsdrivegooglecomfiledqxaqihxikosnrkgdbpchfwnutaviewuspsharing regarding prosecution cases involving sharing content social media platforms court emphasised criminal charges applied every instance sharing false information particularly pose immediate threat public order similar instances arrests sharing misinformation increasingly reported particularly context political social issues see herehttpstimesofindiaindiatimescomcitythiruvananthapuramyoutuberarrestedinkeralaforfakenewsonevmsarticleshowcms herehttpstimesofindiaindiatimescomcitymaduraitwoheldforfakenewsonchildkidnappingsarticleshowcms herehttpswwwthehinducomnewscitiesbangalorexuserfromgoaarrestedforspreadingmisinformationonsocialmediamanipulatingsiddaramaiahspostarticleece herehttpsscrollinlatestlawyerbookedforsharingyoutuberdhruvratheesvideocriticisingmodiinwhatsappgroup concerning aspect arrests often occur without thorough examination intent individuals involved many cases appear driven broad interpretation constitutes misinformation grounds disturbing public order leads arrests may consider whether individual disrupted public order malicious intent simply expressing opinion moreover lack clear laws defining misinformation results arbitrary arrests laws like unlawful activities prevention uapa act information technology act criminal statutes raises concerns potential misuse legal frameworks suppression legitimate dissent madras high courts ruling critical issue emphasises need nuanced approach advocating legal action target cases misinformation significantly threatens public safety balance right liberty free expression public order public order catchall misuse lack clear definition public order exception free speech article led patchy protections allowing union state governments use shield justify actions violate fundamental rights lack clarity particularly troubling context online expression social media become primary forum sharing opinions many caseshttpswwwhrworgnewsindiaarrestsraidstargetcriticsgovernment individuals arrested posting opinions authorities deem problematic critical government though definition public order provided statute courts defined interpreted scope time time supreme court ramji lal modi v state uttar pradeshttpsmainscigovinjudgmentjudispdfh first time defined scope public order applied calculated tendency test judge disturbed landmark case dr ram manohar lohia v state biharhttpsmainscigovinjonewjudispdf supreme court explained public order refers serious disturbances affect community large minor issues supreme court deviated previous interpretations public order applying close proximity test stating every breach peace lead public disorder even though ram manohar lohia still holds fort issue protection accorded supreme court patchy best several occasions see herehttpsmainscigovinjonewjudispdf herehttpsapiscigovinsupremecourtorderseppdf restriction freedom speech expression upheld hurting sentiments certain communities incumbent ruling madras high court also defined scope public order stating term needs clear boundaries prevent misuse held public order cover every minor disturbance arrests based vague allegations disturbing public order legal held must real threat widespread disruption prompt action madras high court specifically dealing opinions content shared social media generally put umbrella disturbing public order said voices everyone strangulated curb small groups spreading unpleasant opinions people consuming information social media best judges views opinions constitutional institutions indulge process influence views people actions institution speak views may come go unjust arrests need caution observedhttpswwwhrworgreportstiflingdissentcriminalizationpeacefulexpressionindia constant threat arrest potential imprisonment deter people speaking even solid defence accused endure lengthy costly process complainants face consequences claims unfounded madras high court determined grounds preventive detention case inadequate stressed unless clear evidence serious threat public order mere criticism dissent especially social media justify preventive detention laws used sparingly absolutely necessary relying case pramod singla v union indiahttpsindiankanoonorgdoc supreme court warned potential misuse preventive detention laws court emphasised protecting individual rights key constitutional duty meant prevent misuse state power tug war free speech vs misinformation madras high court noted state avoid cracking opinions based false assumptions biased views reflects american free speech jurisprudence principleshttpswwwamericanbarorggroupscrsjpublicationshumanrightsmagazinehometheongoingchallengetodefinefreespeechcounterspeechinresponsetofreespeechtextthecourthasincreasinglystronglyifitisdeeplyloathed particularly viewpoint neutrality emergency principle viewpoint neutrality means government punish speech considered hateful unacceptable emergency principle states government suppress speech unless poses clear present danger debate regulating hate speech ongoing advocate regulation others support viewpoint neutrality emergency principle stating choice consume content always disposal viewer madras high court leans toward encouraging counterspeech rather excessive government control similar position reflected dissenting opinion justice gs patel bombay high court kunal kamra ors v union india orshttpswwwlivelawinpdfuploadkunalkamrasplitverdictasperjpatelpdf challenging constitution factcheck units state forget social media users post content also consume readers much writers forwarders posters whatever term might point mr seervai makes believe one agency decide marketplace ideas reader consume make mind agree disagree marketplace ideas space encourages discussion dissent debate recognizing many different opinions valuable rather one accepted viewpoint disagreement debate essential freedom speech making marketplace thrive diverse thoughts challenges come engaging space means open discomfort unfamiliar ideas requiring civil discourse even agreement always possible marketplace promotes free expression also allows spread false misleading information alongside valid opinions key challenge address misinformation without limiting free speech demands careful management ensure efforts correct falsehoods lead excessive censorship idea public order misused suppress speech merely controversial uncomfortable overly aggressive attempts like arrests control misinformation unfairly target legitimate opinions dissent instead resorting broad censorship preventive detentions focus encouraging counterspeech fostering environment diverse viewpoints openly debated finding balance madras high court ruling reminds us protecting fundamental rights always heart efforts tackle misinformation overstepping area silence genuine voices weaken democracy public trust face challenges digital age important government citizens focus upholding constitutional values dealing misinformation come expense democratic freedoms instead involve targeted actions address genuine threats without compromising core principles enshrined constitution help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "curbing misinformation chilling free speech navigating indias legal response",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditiivzoxleowtdpngwidthformatpngautowebpscbaaaceedafa tldr addressing concerns aggressive crackdown misinformation law enforcement agencies madras high court recently ruled cases sharing misinformation warrant legal action especially pose immediate threat public order blogpost examine legality arrests sharing misinformation risks freedom speech expression need balance fundamental rights public order important documents madras hc order dated linkhttpsdrivegooglecomfiledqxaqihxikosnrkgdbpchfwnutaviewuspsharing care increasinghttpscarnegieendowmentorgresearchindiathailandsocialmediamoderation legal crackdown misinformation todays digital landscape raises serious concerns violation fundamental rights free speech liberty indian constitution permits reasonable restrictions freedom speech expression article using criminal prosecution preventive detention every instance misinformation excessive counterproductive actions require clear evidence genuine threat public order simply sharing unverified information justify detention approach risks undermining democratic discourse core constitutional values highlighting need balanced response safeguards individual freedoms addressing misinformation background may greater chennai police issued detention order individual classified goonda state law allegedly circulating false documents social media tender process arrest prompted filing habeas corpus petition reviewed madras high court adjudication court issued pivotal orderhttpsdrivegooglecomfiledqxaqihxikosnrkgdbpchfwnutaviewuspsharing regarding prosecution cases involving sharing content social media platforms court emphasised criminal charges applied every instance sharing false information particularly pose immediate threat public order similar instances arrests sharing misinformation increasingly reported particularly context political social issues see herehttpstimesofindiaindiatimescomcitythiruvananthapuramyoutuberarrestedinkeralaforfakenewsonevmsarticleshowcms herehttpstimesofindiaindiatimescomcitymaduraitwoheldforfakenewsonchildkidnappingsarticleshowcms herehttpswwwthehinducomnewscitiesbangalorexuserfromgoaarrestedforspreadingmisinformationonsocialmediamanipulatingsiddaramaiahspostarticleece herehttpsscrollinlatestlawyerbookedforsharingyoutuberdhruvratheesvideocriticisingmodiinwhatsappgroup concerning aspect arrests often occur without thorough examination intent individuals involved many cases appear driven broad interpretation constitutes misinformation grounds disturbing public order leads arrests may consider whether individual disrupted public order malicious intent simply expressing opinion moreover lack clear laws defining misinformation results arbitrary arrests laws like unlawful activities prevention uapa act information technology act criminal statutes raises concerns potential misuse legal frameworks suppression legitimate dissent madras high courts ruling critical issue emphasises need nuanced approach advocating legal action target cases misinformation significantly threatens public safety balance right liberty free expression public order public order catchall misuse lack clear definition public order exception free speech article led patchy protections allowing union state governments use shield justify actions violate fundamental rights lack clarity particularly troubling context online expression social media become primary forum sharing opinions many caseshttpswwwhrworgnewsindiaarrestsraidstargetcriticsgovernment individuals arrested posting opinions authorities deem problematic critical government though definition public order provided statute courts defined interpreted scope time time supreme court ramji lal modi v state uttar pradeshttpsmainscigovinjudgmentjudispdfh first time defined scope public order applied calculated tendency test judge disturbed landmark case dr ram manohar lohia v state biharhttpsmainscigovinjonewjudispdf supreme court explained public order refers serious disturbances affect community large minor issues supreme court deviated previous interpretations public order applying close proximity test stating every breach peace lead public disorder even though ram manohar lohia still holds fort issue protection accorded supreme court patchy best several occasions see herehttpsmainscigovinjonewjudispdf herehttpsapiscigovinsupremecourtorderseppdf restriction freedom speech expression upheld hurting sentiments certain communities incumbent ruling madras high court also defined scope public order stating term needs clear boundaries prevent misuse held public order cover every minor disturbance arrests based vague allegations disturbing public order legal held must real threat widespread disruption prompt action madras high court specifically dealing opinions content shared social media generally put umbrella disturbing public order said voices everyone strangulated curb small groups spreading unpleasant opinions people consuming information social media best judges views opinions constitutional institutions indulge process influence views people actions institution speak views may come go unjust arrests need caution observedhttpswwwhrworgreportstiflingdissentcriminalizationpeacefulexpressionindia constant threat arrest potential imprisonment deter people speaking even solid defence accused endure lengthy costly process complainants face consequences claims unfounded madras high court determined grounds preventive detention case inadequate stressed unless clear evidence serious threat public order mere criticism dissent especially social media justify preventive detention laws used sparingly absolutely necessary relying case pramod singla v union indiahttpsindiankanoonorgdoc supreme court warned potential misuse preventive detention laws court emphasised protecting individual rights key constitutional duty meant prevent misuse state power tug war free speech vs misinformation madras high court noted state avoid cracking opinions based false assumptions biased views reflects american free speech jurisprudence principleshttpswwwamericanbarorggroupscrsjpublicationshumanrightsmagazinehometheongoingchallengetodefinefreespeechcounterspeechinresponsetofreespeechtextthecourthasincreasinglystronglyifitisdeeplyloathed particularly viewpoint neutrality emergency principle viewpoint neutrality means government punish speech considered hateful unacceptable emergency principle states government suppress speech unless poses clear present danger debate regulating hate speech ongoing advocate regulation others support viewpoint neutrality emergency principle stating choice consume content always disposal viewer madras high court leans toward encouraging counterspeech rather excessive government control similar position reflected dissenting opinion justice gs patel bombay high court kunal kamra ors v union india orshttpswwwlivelawinpdfuploadkunalkamrasplitverdictasperjpatelpdf challenging constitution factcheck units state forget social media users post content also consume readers much writers forwarders posters whatever term might point mr seervai makes believe one agency decide marketplace ideas reader consume make mind agree disagree marketplace ideas space encourages discussion dissent debate recognizing many different opinions valuable rather one accepted viewpoint disagreement debate essential freedom speech making marketplace thrive diverse thoughts challenges come engaging space means open discomfort unfamiliar ideas requiring civil discourse even agreement always possible marketplace promotes free expression also allows spread false misleading information alongside valid opinions key challenge address misinformation without limiting free speech demands careful management ensure efforts correct falsehoods lead excessive censorship idea public order misused suppress speech merely controversial uncomfortable overly aggressive attempts like arrests control misinformation unfairly target legitimate opinions dissent instead resorting broad censorship preventive detentions focus encouraging counterspeech fostering environment diverse viewpoints openly debated finding balance madras high court ruling reminds us protecting fundamental rights always heart efforts tackle misinformation overstepping area silence genuine voices weaken democracy public trust face challenges digital age important government citizens focus upholding constitutional values dealing misinformation come expense democratic freedoms instead involve targeted actions address genuine threats without compromising core principles enshrined constitution help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "damage mis information fake forwards tremendous time masses learn ethics etiquette restrictions appropriate hard human rights paramount losing giving away ground free speech debate akin losing democracy admitting fake news peddlers distort destroy truth equally bad dent democracy guarantees regime perpetuates false hood",
    "light_cleaned_title": "Curbing misinformation or chilling free speech? Navigating India’s legal response",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/iivzoxleowtd1.png?width=1600&format=png&auto=webp&s=c8733ba4644a813a6c08340ee2d0098a27f0888a) # tl;dr While addressing concerns about the aggressive crackdown on misinformation by law enforcement agencies, the Madras High Court recently ruled that not all cases of sharing misinformation warrant legal action, especially if they do not pose an immediate threat to public order. In this blogpost, we examine the legality of arrests for sharing misinformation, the risks to freedom of speech and expression, and the need to balance fundamental rights with public order. # Important Documents 1. Madras HC Order dated 09.08.2024 ([Link](https://drive.google.com/file/d/1QX0AqIHXIKOs6nrkGDB6P1ChFWn-U5Ta/view?usp=sharing)) # Why should you care? The [increasing](https://carnegieendowment.org/research/2024/07/india-thailand-social-media-moderation) legal crackdown on misinformation in today’s digital landscape raises serious concerns about the violation of fundamental rights to free speech and liberty. While the Indian Constitution permits reasonable restrictions on freedom of speech and expression under Article 19(2), using criminal prosecution or preventive detention for every instance of misinformation is excessive and counterproductive. Such actions require clear evidence of a genuine threat to public order, as simply sharing unverified information does not justify detention. This approach risks undermining democratic discourse and core constitutional values, highlighting the need for a balanced response that safeguards individual freedoms while addressing misinformation. # Background On May 12, 2024, the Greater Chennai Police issued a detention order against an individual classified as a “Goonda” under State law for allegedly circulating false documents on social media about a tender process. This arrest prompted the filing of a Habeas Corpus Petition, which was reviewed by the Madras High Court. After adjudication, the Court issued a pivotal [order](https://drive.google.com/file/d/1QX0AqIHXIKOs6nrkGDB6P1ChFWn-U5Ta/view?usp=sharing) regarding the prosecution of cases involving the sharing of content on social media platforms. The Court emphasised that criminal charges should not be applied to every instance of sharing false information, particularly when it does not pose an immediate threat to public order. Similar instances of arrests for sharing misinformation have been increasingly reported, particularly in the context of political and social issues (see [here](https://timesofindia.indiatimes.com/city/thiruvananthapuram/youtuber-arrested-in-kerala-for-fake-news-on-evms/articleshow/108999629.cms), [here](https://timesofindia.indiatimes.com/city/madurai/two-held-for-fake-news-on-child-kidnappings/articleshow/108280841.cms), [here](https://www.thehindu.com/news/cities/bangalore/x-user-from-goa-arrested-for-spreading-misinformation-on-social-media-manipulating-siddaramaiahs-post/article68193269.ece), and [here](https://scroll.in/latest/1068550/lawyer-booked-for-sharing-youtuber-dhruv-rathees-video-criticising-modi-in-whatsapp-group)). The most concerning aspect of these arrests is that they often occur without a thorough examination of the intent of the individuals involved. Many of these cases appear to be driven by a broad interpretation of what constitutes misinformation, and on the grounds of disturbing public order which leads to arrests that may not consider whether the individual had disrupted public order, had malicious intent, or was simply expressing an opinion. Moreover, the lack of clear laws defining misinformation results in arbitrary arrests under laws like the Unlawful Activities (Prevention) (“**UAPA**”) Act, 1967, the Information Technology (“**IT**”) Act, 2000, and other criminal statutes. This raises concerns about the potential misuse of legal frameworks and suppression of legitimate dissent. The Madras High Court's ruling on this critical issue emphasises the need for a nuanced approach, advocating that legal action should only target cases where misinformation significantly threatens public safety to balance the right to liberty and free expression with public order. # ‘Public order’ or a catch-all for misuse The lack of a clear definition of \"public order\" as an exception to free speech under Article 19(1)(a) has led to patchy protections, allowing Union and state governments to use it as a shield to justify actions that violate fundamental rights. The lack of clarity is particularly troubling in the context of online expression, where social media has become a primary forum for sharing opinions. In many [cases](https://www.hrw.org/news/2023/10/13/india-arrests-raids-target-critics-government), individuals have been arrested for posting opinions that authorities deem problematic or critical of the government. Though the definition of ‘public order’ is not provided in any statute, the courts have defined and interpreted its scope from time to time. The Supreme Court in [*Ramji Lal Modi* v. *the State of Uttar Prades*](https://main.sci.gov.in/judgment/judis/656.pdf)*h* for the first time defined the scope of public order and applied the “calculated tendency” test to judge if it was disturbed. In the landmark case of [*Dr. Ram Manohar Lohia* v. *State of Bihar*](https://main.sci.gov.in/jonew/judis/2897.pdf), the Supreme Court explained that ‘public order’ refers to more serious disturbances that affect the community at large, not just minor issues. The Supreme Court deviated from the previous interpretations of public order by applying the ‘close proximity test’ and stating that “every breach of the peace does not lead to public disorder.” Even though *Ram Manohar Lohia* still holds the fort on this issue, the protection accorded by the Supreme Court has been patchy at best as on several occasions (see [here](https://main.sci.gov.in/jonew/judis/28963.pdf), and [here](https://api.sci.gov.in/supremecourt/2003/22125/22125_2003_Order_20-Sep-2017.pdf)), the restriction on freedom of speech and expression has been upheld for hurting the sentiments of certain communities. In the incumbent ruling, the Madras High Court also defined the scope of public order by stating that the term needs clear boundaries to prevent its misuse. It held that public order should not cover every minor disturbance and the arrests based on vague allegations of disturbing public order are not legal. It held that there must be a real threat of widespread disruption to prompt such action. The Madras High Court while specifically dealing with the opinions and content shared on social media, which is generally put under the umbrella of disturbing public order, said : “*Can the voices of everyone be strangulated to curb these small groups from spreading unpleasant opinions? The people consuming information on social media are the best judges of these views and opinions. The Constitutional Institutions cannot indulge in a process to influence the views of the people. Actions of the Institution speak for themselves and the views may come and go.*” # Unjust arrests: a need for caution It has been[ observed](https://www.hrw.org/report/2016/05/25/stifling-dissent/criminalization-peaceful-expression-india) that the constant threat of arrest and potential imprisonment can deter people from speaking out. Even with a solid defence, an accused has to endure a lengthy and costly process, while complainants face few consequences if their claims are unfounded. The Madras High Court determined that the grounds for preventive detention in this case were inadequate. It was stressed that unless there is clear evidence of a serious threat to public order, mere criticism or dissent, especially on social media, should not justify preventive detention. These laws should be used sparingly and only when absolutely necessary. Relying on the case of [*Pramod Singla* v. *Union of India*](https://indiankanoon.org/doc/123047365/) where the Supreme Court warned against the potential misuse of preventive detention laws, the Court emphasised that protecting individual rights is a key constitutional duty that is meant to prevent the misuse of State power. # Tug of War: Free Speech vs. Misinformation The Madras High Court noted that the State should avoid cracking down on opinions that are based on false assumptions and biased views. This reflects American free speech [jurisprudence principles](https://www.americanbar.org/groups/crsj/publications/human_rights_magazine_home/the-ongoing-challenge-to-define-free-speech/counterspeech-in-response-to-free-speech/#:~:text=The%20Court%20has%20increasingly%20strongly,if%20it%20is%20deeply%20loathed), particularly viewpoint neutrality, and the emergency principle. Viewpoint neutrality means that the government cannot punish speech just because it’s considered hateful or unacceptable. The emergency principle states that the government cannot suppress speech unless it poses a \"clear and present danger.\" The debate over regulating hate speech is ongoing: some advocate for regulation, while others support viewpoint neutrality and the emergency principle. By stating, “T*he choice to consume content is always at the disposal of the viewer*,” the Madras High Court leans toward encouraging counter-speech rather than excessive government control. A similar position was reflected in the dissenting opinion of Justice G.S. Patel of the Bombay High Court in [*Kunal Kamra and Ors.* v. *Union of India and Ors.*](https://www.livelaw.in/pdf_upload/kunal-kamra-split-verdict-as-per-j-patel-519755.pdf) challenging the constitution of Fact-Check Units by the State: “*We should not forget that social media ‘users’ do not just post content. They also consume it. They are readers as much as they are writers (or forwarders, or ‘posters’, or whatever the term might be). The point that Mr. Seervai makes is, I believe, that it is not for any one agency to decide — in the marketplace of ideas — what a reader should or should not consume, or how he or she should make up his mind.*” # Agree to disagree The \"marketplace of ideas\" is a space that encourages discussion, dissent, and debate, recognizing that many different opinions are valuable rather than just one accepted viewpoint. Disagreement and debate are essential to freedom of speech, making this marketplace thrive on diverse thoughts and the challenges that come with them. Engaging in this space means being open to discomfort and unfamiliar ideas, requiring civil discourse even if agreement is not always possible. While the marketplace promotes free expression, it also allows for the spread of false or misleading information alongside valid opinions. The key challenge is to address misinformation without limiting free speech, which demands careful management to ensure that efforts to correct falsehoods do not lead to excessive censorship. The idea of public order should not be misused to suppress speech that is merely controversial or uncomfortable. Overly aggressive attempts like arrests to control misinformation can unfairly target legitimate opinions and dissent. Instead of resorting to broad censorship and preventive detentions, the focus should be on encouraging counter-speech and fostering an environment where diverse viewpoints can be openly debated. # Finding the Balance The Madras High Court ruling reminds us that protecting fundamental rights should always be at the heart of any efforts to tackle misinformation. Overstepping in this area can silence genuine voices and weaken democracy and public trust. As we face challenges in the digital age, it is important for both – the government and citizens – to focus on upholding our constitutional values. Dealing with misinformation should not come at the expense of our democratic freedoms. Instead, it should involve targeted actions that address genuine threats without compromising the core principles enshrined in our Constitution. Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "the damage that mis information and fake forwards do are tremendous and until such time the masses, learn some ethics and etiquette, having these restrictions are appropriate. Hard no. Human rights are paramount and losing or giving away ground in the free speech debate is akin to losing democracy. admitting fake news peddlers to distort and destroy truth is equally bad and a dent to democracy. there can be no guarantees in a regime that perpetuates false hood."
}