{
    "id": "15d8gxx",
    "title": "Sanitation investments, water pollution and health: Lessons from India",
    "url": "https://voxdev.org/topic/infrastructure-urbanisation/sanitation-investments-water-pollution-and-health-lessons-india",
    "selftext": "This study on latrine construction in India is fascinating. It's frustrating to see policymakers not thinking about the long-term consequences of their actions. It reminds me of Mao's Industrialization drive, where millions of people died. We need policymakers to take a more comprehensive approach to problem-solving. The untreated run-off from latrines causes pollution and creates long-term issues.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1690679834.0,
    "convurl": "https://external-preview.redd.it/F-Gjv1LCEEY213Q2qVbcVxBG83PdR-iGXpVuzAneJA4.jpg?auto=webp&s=fe112adbf9eddd875fce552d5b272795206c2a0f",
    "comments": [],
    "cleaned_text": "sanitation investments water pollution health lessons india study latrine construction india fascinating frustrating see policymakers thinking longterm consequences actions reminds maos industrialization drive millions people died need policymakers take comprehensive approach problemsolving untreated runoff latrines causes pollution creates longterm issues ",
    "cleaned_title": "sanitation investments water pollution health lessons india",
    "cleaned_selftext": "study latrine construction india fascinating frustrating see policymakers thinking longterm consequences actions reminds maos industrialization drive millions people died need policymakers take comprehensive approach problemsolving untreated runoff latrines causes pollution creates longterm issues",
    "cleaned_comments": "",
    "light_cleaned_title": "Sanitation investments, water pollution and health: Lessons from India",
    "light_cleaned_selftext": "This study on latrine construction in India is fascinating. It's frustrating to see policymakers not thinking about the long-term consequences of their actions. It reminds me of Mao's Industrialization drive, where millions of people died. We need policymakers to take a more comprehensive approach to problem-solving. The untreated run-off from latrines causes pollution and creates long-term issues.",
    "light_cleaned_comments": ""
}