{
    "id": "1969rcb",
    "title": "Problem is not with the current gov or past gov, it's the people",
    "url": "https://x.com/IndianTechGuide/status/1746375091796292053?s=20",
    "selftext": "Sone ka katora bhi dedo, mangenge bheekh hi. No wonder every intelligent person wants to leave this country and get out",
    "flair": "Rant / Vent",
    "score": 55,
    "num_comments": 39,
    "created_utc": 1705215049.0,
    "convurl": "https://external-preview.redd.it/8jn_qIelYZglgY_DgPyprp0gtnNYGdohg0rTwiAPyyA.jpg?auto=webp&s=5c0556568f73c59dfd066d0677cd179f96ed4c26",
    "comments": [
        "I don't think it's so simple. You can't convince me that constant misinformation from the government and media apparatus doesn't play a damaging role. \n\nThe system manufactures consent. The onus of a damaged system is not on the people.",
        "That's a different topic altogether everybody does that call it marketing/PR/propaganda whatever that happens everywhere, but here the fact that we have the freedom to damage the property like that ...isn't it unfair towards the government?? It's so easy to blame everything on them but we gotta see other side of the story too. So many people would have worked their ass off for this project for what??to see all these Tobacco stains??",
        "There’s not even a zilch of civic sense in people. I don’t know why people in our country love to live around filth.",
        "That's exactly what I hate about democracy, it kills the ability to take strong decisions. Imagine this happening in China , Russia or any gulf country",
        "The government should employ adequate cleaning staff. Tax money is currently being wasted",
        "So basically tobacco shouldn't be banned or the people who spat on government properties shouldn't be heavily taxed... instead we should hire more people to clean it.. that's what you're saying right??😑",
        "OP completely ignored european democracies which are clean and people have civic sense!!!\n\nThis is not a democracy issue. This is civic sense issue. Literally,  autocratic governments usually fair worse in terms of corruption. If there is any consolation, look at USSR.",
        "You're missing the point what the post is about, it about treating these individuals rather than blaming everything on the government. And the fact that having a democracy just makes it difficult to create a civic sense in these people.",
        " “One of the penalties of refusing to participate in politics is that you end up being governed by your inferiors.”  \n― **Plat**",
        "I understand that. And I agree to the point that when it comes to public property, we cannot blame govt alone.\n\nBut my point is, inculcating civic sense has nothing to do with democracy. Example, assume an autocratic state like USSR with rampant corruption, you'd still see idiots with license after paying 2k and no test. And you are back to square one with a tyrant as a leader.",
        "Literal Shithole country.",
        "This is the mindset that has screwed this country beyond repair.",
        "But most of them adopted democracy much later. Mere republic is not democracy. In Europe, when age of enlightenment came, they were under monarchy. Japan saw growth due to Meiji restoration. Nearly every government has a dictatorial phase where decision has been made against people wishes for long term betterment",
        "🤣🤣🤣",
        "Democracy has no fault in it. Indians generally live in filth. This is a civic issue on personal level. People learn this from their home. Indians casually litter wherever they are. \n\nFor example: If someone buys a pack of chips, their hand will offload the packet as soon as the chips end. This is filthy.",
        "Such massive infrastructure construction boom and still \"Tax Money is being wasted\"??? And anyways these things are on people more than the govt. People in India lack civic sense. ",
        "We need a just leader which can't be possible in democracy because every leader has to pander to some group here",
        "Hmm yes, Germany, such a filth. Yuck. You seriously talking bruv?",
        "Do you by any chance also are okay with Modi becoming the king of India or something ",
        "Can't disagree.",
        "You're right to some extent but after seeing posts from California, pennsylvania, Paris, major parts of Italy, London and Lisbon...i think it's a very common issue tbh and only strong penalty is required in order to create it",
        "Yeah, and that group can be children who wants go study, people who wants to work, people who want survive but are unable to. But politics in India thinks only by birth association such as religion and caste are groups. There are problems faced by most that can be focused and can be classified as groups",
        "Yeah, it's all going to corrupt politicians pockets",
        "Just create a single party government like a cricket team where the best of the best politicians from their respective field take charge, no voting , no PR....hell I'm even down for an AI Goverment once AGI is achieved.",
        "Some sane voice",
        "Germany is a democratic country, do you even know the similarity between the countries i mentioned \"bruv\"??",
        "Yet there exists many people like you who are not influenced by that misinformation. Is this not an evidence that people choose to get influenced by the misinformation?",
        "Matlab Govt se koi umeed he nahi logo ko.",
        "I never mentioned anything about any politician...your hate for a particular person/party has made you blind",
        "Yeah, they are being dictated by the govt. I'm giving example of Germany as a democratic country with really good socio-economic condition.",
        "This is a privileged take. I have had a good educational grounding and have the means to resort to alternative sources for news and everything. \n\nWhat about people who DON'T have the means?",
        "Hold your horses there il Douche",
        "It’s the attitude of “i will look after myself only”.",
        "Or what?? Gonna make me participate in your pride March??🤡",
        "When a startup or a company fails, the final burnt is faced by its leaders for not being able to manage their team well. Luckily for companies, they can choose their people and sadly for government they can't. But nonetheless the responsibility and blame for this conduct lies with government, afterall Mr. Modi is quick to jump to take credit whenever good things happen lol. \nHowever, the real question here is what do we do when we see such situations? Well we turn our face away with disgust, point our fingers at government ( like I did ), or to blame our fellow Indians for their lack of civic sense. Instead of shifting blame if we take matters in our own hands and make it our duty to clean such places when we see them, perhaps India will be a lot cleaner and such incidents will also decrease. But that's easier said then done hehe.",
        "There is a great pratchett quote about this “And so the children of the revolution were faced with the age-old problem: it wasn't that you had the wrong kind of government, which was obvious, but that you had the wrong kind of people.”",
        "Why were roadside parking and photo-shooting allowed in an expressway having 100kmph speed limit? \n\nWhats next? Chapris will flock the bridge to make reels?",
        "Dekho dank joke maara. \n\nIDM aage se far right pe he"
    ],
    "cleaned_text": "problem current gov past gov people sone ka katora bhi dedo mangenge bheekh hi wonder every intelligent person wants leave country get ",
    "cleaned_title": "problem current gov past gov people",
    "cleaned_selftext": "sone ka katora bhi dedo mangenge bheekh hi wonder every intelligent person wants leave country get",
    "cleaned_comments": "dont think simple cant convince constant misinformation government media apparatus doesnt play damaging role system manufactures consent onus damaged system people thats different topic altogether everybody call marketingprpropaganda whatever happens everywhere fact freedom damage property like isnt unfair towards government easy blame everything got ta see side story many people would worked ass project whatto see tobacco stains theres even zilch civic sense people dont know people country love live around filth thats exactly hate democracy kills ability take strong decisions imagine happening china russia gulf country government employ adequate cleaning staff tax money currently wasted basically tobacco shouldnt banned people spat government properties shouldnt heavily taxed instead hire people clean thats youre saying right op completely ignored european democracies clean people civic sense democracy issue civic sense issue literally autocratic governments usually fair worse terms corruption consolation look ussr youre missing point post treating individuals rather blaming everything government fact democracy makes difficult create civic sense people one penalties refusing participate politics end governed inferiors plat understand agree point comes public property blame govt alone point inculcating civic sense nothing democracy example assume autocratic state like ussr rampant corruption youd still see idiots license paying k test back square one tyrant leader literal shithole country mindset screwed country beyond repair adopted democracy much later mere republic democracy europe age enlightenment came monarchy japan saw growth due meiji restoration nearly every government dictatorial phase decision made people wishes long term betterment democracy fault indians generally live filth civic issue personal level people learn home indians casually litter wherever example someone buys pack chips hand offload packet soon chips end filthy massive infrastructure construction boom still tax money wasted anyways things people govt people india lack civic sense need leader cant possible democracy every leader pander group hmm yes germany filth yuck seriously talking bruv chance also okay modi becoming king india something cant disagree youre right extent seeing posts california pennsylvania paris major parts italy london lisboni think common issue tbh strong penalty required order create yeah group children wants go study people wants work people want survive unable politics india thinks birth association religion caste groups problems faced focused classified groups yeah going corrupt politicians pockets create single party government like cricket team best best politicians respective field take charge voting prhell im even ai goverment agi achieved sane voice germany democratic country even know similarity countries mentioned bruv yet exists many people like influenced misinformation evidence people choose get influenced misinformation matlab govt se koi umeed nahi logo ko never mentioned anything politicianyour hate particular personparty made blind yeah dictated govt im giving example germany democratic country really good socioeconomic condition privileged take good educational grounding means resort alternative sources news everything people dont means hold horses il douche attitude look gon na make participate pride march startup company fails final burnt faced leaders able manage team well luckily companies choose people sadly government cant nonetheless responsibility blame conduct lies government afterall mr modi quick jump take credit whenever good things happen lol however real question see situations well turn face away disgust point fingers government like blame fellow indians lack civic sense instead shifting blame take matters hands make duty clean places see perhaps india lot cleaner incidents also decrease thats easier said done hehe great pratchett quote children revolution faced ageold problem wasnt wrong kind government obvious wrong kind people roadside parking photoshooting allowed expressway kmph speed limit whats next chapris flock bridge make reels dekho dank joke maara idm aage se far right pe",
    "light_cleaned_title": "Problem is not with the current gov or past gov, it's the people",
    "light_cleaned_selftext": "Sone ka katora bhi dedo, mangenge bheekh hi. No wonder every intelligent person wants to leave this country and get out",
    "light_cleaned_comments": "I don't think it's so simple. You can't convince me that constant misinformation from the government and media apparatus doesn't play a damaging role. The system manufactures consent. The onus of a damaged system is not on the people. That's a different topic altogether everybody does that call it marketing/PR/propaganda whatever that happens everywhere, but here the fact that we have the freedom to damage the property like that ...isn't it unfair towards the government?? It's so easy to blame everything on them but we gotta see other side of the story too. So many people would have worked their ass off for this project for what??to see all these Tobacco stains?? There’s not even a zilch of civic sense in people. I don’t know why people in our country love to live around filth. That's exactly what I hate about democracy, it kills the ability to take strong decisions. Imagine this happening in China , Russia or any gulf country The government should employ adequate cleaning staff. Tax money is currently being wasted So basically tobacco shouldn't be banned or the people who spat on government properties shouldn't be heavily taxed... instead we should hire more people to clean it.. that's what you're saying right??😑 OP completely ignored european democracies which are clean and people have civic sense!!! This is not a democracy issue. This is civic sense issue. Literally, autocratic governments usually fair worse in terms of corruption. If there is any consolation, look at USSR. You're missing the point what the post is about, it about treating these individuals rather than blaming everything on the government. And the fact that having a democracy just makes it difficult to create a civic sense in these people. “One of the penalties of refusing to participate in politics is that you end up being governed by your inferiors.” ― **Plat** I understand that. And I agree to the point that when it comes to public property, we cannot blame govt alone. But my point is, inculcating civic sense has nothing to do with democracy. Example, assume an autocratic state like USSR with rampant corruption, you'd still see idiots with license after paying 2k and no test. And you are back to square one with a tyrant as a leader. Literal Shithole country. This is the mindset that has screwed this country beyond repair. But most of them adopted democracy much later. Mere republic is not democracy. In Europe, when age of enlightenment came, they were under monarchy. Japan saw growth due to Meiji restoration. Nearly every government has a dictatorial phase where decision has been made against people wishes for long term betterment 🤣🤣🤣 Democracy has no fault in it. Indians generally live in filth. This is a civic issue on personal level. People learn this from their home. Indians casually litter wherever they are. For example: If someone buys a pack of chips, their hand will offload the packet as soon as the chips end. This is filthy. Such massive infrastructure construction boom and still \"Tax Money is being wasted\"??? And anyways these things are on people more than the govt. People in India lack civic sense. We need a just leader which can't be possible in democracy because every leader has to pander to some group here Hmm yes, Germany, such a filth. Yuck. You seriously talking bruv? Do you by any chance also are okay with Modi becoming the king of India or something Can't disagree. You're right to some extent but after seeing posts from California, pennsylvania, Paris, major parts of Italy, London and Lisbon...i think it's a very common issue tbh and only strong penalty is required in order to create it Yeah, and that group can be children who wants go study, people who wants to work, people who want survive but are unable to. But politics in India thinks only by birth association such as religion and caste are groups. There are problems faced by most that can be focused and can be classified as groups Yeah, it's all going to corrupt politicians pockets Just create a single party government like a cricket team where the best of the best politicians from their respective field take charge, no voting , no PR....hell I'm even down for an AI Goverment once AGI is achieved. Some sane voice Germany is a democratic country, do you even know the similarity between the countries i mentioned \"bruv\"?? Yet there exists many people like you who are not influenced by that misinformation. Is this not an evidence that people choose to get influenced by the misinformation? Matlab Govt se koi umeed he nahi logo ko. I never mentioned anything about any politician...your hate for a particular person/party has made you blind Yeah, they are being dictated by the govt. I'm giving example of Germany as a democratic country with really good socio-economic condition. This is a privileged take. I have had a good educational grounding and have the means to resort to alternative sources for news and everything. What about people who DON'T have the means? Hold your horses there il Douche It’s the attitude of “i will look after myself only”. Or what?? Gonna make me participate in your pride March??🤡 When a startup or a company fails, the final burnt is faced by its leaders for not being able to manage their team well. Luckily for companies, they can choose their people and sadly for government they can't. But nonetheless the responsibility and blame for this conduct lies with government, afterall Mr. Modi is quick to jump to take credit whenever good things happen lol. However, the real question here is what do we do when we see such situations? Well we turn our face away with disgust, point our fingers at government ( like I did ), or to blame our fellow Indians for their lack of civic sense. Instead of shifting blame if we take matters in our own hands and make it our duty to clean such places when we see them, perhaps India will be a lot cleaner and such incidents will also decrease. But that's easier said then done hehe. There is a great pratchett quote about this “And so the children of the revolution were faced with the age-old problem: it wasn't that you had the wrong kind of government, which was obvious, but that you had the wrong kind of people.” Why were roadside parking and photo-shooting allowed in an expressway having 100kmph speed limit? Whats next? Chapris will flock the bridge to make reels? Dekho dank joke maara. IDM aage se far right pe he"
}