{
    "id": "14d5hcz",
    "title": "Please help me in filling this market research regarding agriculture digitalization",
    "url": "https://www.reddit.com/r/india/comments/14d5hcz/please_help_me_in_filling_this_market_research/",
    "selftext": "[https://forms.gle/HexuRi2uuhvq6SM19](https://forms.gle/HexuRi2uuhvq6SM19)\n\n[https://forms.gle/HexuRi2uuhvq6SM19](https://forms.gle/HexuRi2uuhvq6SM19)\n\nThis a survey about agriculture digitalization. We are not collecting your personal data\n\nYour response brings confidence and the information provided by you is used for statistical  purposes",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1687152428.0,
    "convurl": "https://external-preview.redd.it/-Tor1gorzwZb6wz5aOJeJ1_mYJc2Hu6xjq3P6P5Xy1A.jpg?auto=webp&v=enabled&s=9103c7c236f52eaf5f20f9bff75edea14f283b9c",
    "comments": [],
    "cleaned_text": "please help filling market research regarding agriculture digitalization httpsformsglehexuriuuhvqsmhttpsformsglehexuriuuhvqsm httpsformsglehexuriuuhvqsmhttpsformsglehexuriuuhvqsm survey agriculture digitalization collecting personal data response brings confidence information provided used statistical purposes ",
    "cleaned_title": "please help filling market research regarding agriculture digitalization",
    "cleaned_selftext": "httpsformsglehexuriuuhvqsmhttpsformsglehexuriuuhvqsm httpsformsglehexuriuuhvqsmhttpsformsglehexuriuuhvqsm survey agriculture digitalization collecting personal data response brings confidence information provided used statistical purposes",
    "cleaned_comments": "",
    "light_cleaned_title": "Please help me in filling this market research regarding agriculture digitalization",
    "light_cleaned_selftext": "[https://forms.gle/HexuRi2uuhvq6SM19](https://forms.gle/HexuRi2uuhvq6SM19) [https://forms.gle/HexuRi2uuhvq6SM19](https://forms.gle/HexuRi2uuhvq6SM19) This a survey about agriculture digitalization. We are not collecting your personal data Your response brings confidence and the information provided by you is used for statistical purposes",
    "light_cleaned_comments": ""
}