{
    "id": "159d21j",
    "title": "We should boycott German Shepherd (Dhruv Rathee).",
    "url": "https://www.reddit.com/r/india/comments/159d21j/we_should_boycott_german_shepherd_dhruv_rathee/",
    "selftext": "German Rathee has been manipulating the audience for years, using biased articles. I've provided some links that exposed this shrewd manipulator.\n\n [Destroying Dhruv Rathee - YouTube](https://www.youtube.com/watch?v=JM6sJNaNdWk&ab_channel=EngineerXplains) \n\n [Destroying Dhruv Rathee Part - 2 #EducationISimportant - YouTube](https://www.youtube.com/watch?v=xd0-sIv1CPM&ab_channel=EngineerXplains) \n\n [THE GERMAN STORY | LAKSHAY CHAUDHARY - YouTube](https://www.youtube.com/watch?v=TLKMOAD1tVM&ab_channel=LakshayChaudhary) ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690301852.0,
    "convurl": "https://external-preview.redd.it/XLbaCPQuWrrv7e4IMSqZwVXTfJg6Anyim8BkDsJqDiA.jpg?auto=webp&s=6f83c3909bf04eb09d15fcb3e7c91400ca868979",
    "comments": [
        "Sorry but bringing someone like LC here disregards the whole point of your post.",
        "I know he doesn't make mature content, but in this video, he provided some evidence-based and logical points. I think you should at least bother by watching the video and then tell me what you think about the video.",
        "Lot of fallacies in your video.. also provide evidence on the description",
        "ab lakshay chaudhary ki baat sunne ki naubat aa gyi 🤮",
        "The way we are using YouTube is frightening. Not only WhatsApp, you tube now controls public opinion and often these videos are extremely convincing. \n\nI never thought I'd say this but we need to go back to newspapers now- the few decent ones that survived this wave of polarisation.",
        "If there are a lot of fallacies in the videos, then Dhruv Rathee's videos are a stack of fallacies. Evidence is already provided in those videos.",
        "Well don't watch the LC videos then, I already provided 2 links above the LC ones. I think you should never judge something without watching it first.",
        "This is also a fallacy.. if I am talking about you why are you redirecting to druv ?",
        "Exactly, cunning manipulators like German Rathee use biased and unreputed articles to prove their points and quote \"Education is important\". I know that no government is perfect and pointing out every right winger as \"Andhbhakt\" and \"Illiterate\" shows illiteracy itself. He was showing that Surgical Strike was fake. It's surprising how he can manipulate such a large no.of people so easily.",
        "Because my whole post is directed towards Dhruv.",
        "But my comment is directed towards your video",
        "I'll rather listen to a choking pigeon than listen to LC",
        "If you share on YouTube. The audience there  literally don't care doing their own research and just watch to fulfill their cravings.. when you post on reddit at least add links so that I can do a fair argument..",
        "All of DR subscribers are blind. You've gained all the wisdom from these videos.  \n\n\nNow lease bestow us with 3 YouTube timestamped links & tell us in simple English what's the issue/error in that segment & we'll surely understand that better.",
        "If we go by your logic that a YouTuber with a viewership of few millions and who is manipulating people by feeding them misinformation and biased content deserves to be boycotted, then the prime minister of this country who does the same thing to 1.4 billion people should be put behind bars for the rest of whatever life he has remaining.",
        "Wrong sub. r/chaddispeaks thoda age se left hai, bhai. And Lakshay Chaudhary, really?\n\nYikes!",
        "According to the same logic, Mamta Banerjee, Rahul Gandhi, Sonia Gandhi and Arvind Kejriwal should be imprisoned for life.",
        "I already mentioned the links to the videos that will show you the exact clips you are searching for.",
        "At least he doesn't repeat what he has been already told by people belonging to the political party he supports.",
        "Yeah he doesn't repeat because he makes shit up",
        "I'm proving my points using the videos. If you want to present a fair argument, point out the mistakes in those videos : )",
        "No. I want DR's videos links with your explanation, not these people's judgmental videos.\n\n&#x200B;\n\n>  It's surprising how he can manipulate such a large no.of people so easily. \n\nOtherwise it'll be you proving your own point which you said in a comment.",
        "But they are not prime Ministers",
        "Where did he say surgical strike fake.. share me the link",
        "Well I watched the videos and I agree that he is a aap supporter but he uploads like 4 videos in a month and only one of them is political , I have started following him a year ago and now a days I avoid watching the political once but other video on different topics are still knowledgeble - science,  history and stuff ( not talking about indian political history cause its still politics ) and I am with Dhruv on his religious point of view. I am a hindu but still against bigotry , religions are meant to inspire and teach people , not spread hate and still against the fact that they use 'him being in germany ' as an abuse cause as long as he is indian , he can state his points from wherever he wants to. Other than that , I agree that he supports AAP and most of the points on the video. ( I watched engineer xplains , not LC )"
    ],
    "cleaned_text": "boycott german shepherd dhruv rathee german rathee manipulating audience years using biased articles ive provided links exposed shrewd manipulator destroying dhruv rathee youtubehttpswwwyoutubecomwatchvjmsjnandwkabchannelengineerxplains destroying dhruv rathee part educationisimportant youtubehttpswwwyoutubecomwatchvxdsivcpmabchannelengineerxplains german story lakshay chaudhary youtubehttpswwwyoutubecomwatchvtlkmoadtvmabchannellakshaychaudhary ",
    "cleaned_title": "boycott german shepherd dhruv rathee",
    "cleaned_selftext": "german rathee manipulating audience years using biased articles ive provided links exposed shrewd manipulator destroying dhruv rathee youtubehttpswwwyoutubecomwatchvjmsjnandwkabchannelengineerxplains destroying dhruv rathee part educationisimportant youtubehttpswwwyoutubecomwatchvxdsivcpmabchannelengineerxplains german story lakshay chaudhary youtubehttpswwwyoutubecomwatchvtlkmoadtvmabchannellakshaychaudhary",
    "cleaned_comments": "sorry bringing someone like lc disregards whole point post know doesnt make mature content video provided evidencebased logical points think least bother watching video tell think video lot fallacies video also provide evidence description ab lakshay chaudhary ki baat sunne ki naubat aa gyi way using youtube frightening whatsapp tube controls public opinion often videos extremely convincing never thought id say need go back newspapers decent ones survived wave polarisation lot fallacies videos dhruv rathees videos stack fallacies evidence already provided videos well dont watch lc videos already provided links lc ones think never judge something without watching first also fallacy talking redirecting druv exactly cunning manipulators like german rathee use biased unreputed articles prove points quote education important know government perfect pointing every right winger andhbhakt illiterate shows illiteracy showing surgical strike fake surprising manipulate large noof people easily whole post directed towards dhruv comment directed towards video ill rather listen choking pigeon listen lc share youtube audience literally dont care research watch fulfill cravings post reddit least add links fair argument dr subscribers blind youve gained wisdom videos lease bestow us youtube timestamped links tell us simple english whats issueerror segment well surely understand better go logic youtuber viewership millions manipulating people feeding misinformation biased content deserves boycotted prime minister country thing billion people put behind bars rest whatever life remaining wrong sub rchaddispeaks thoda age se left hai bhai lakshay chaudhary really yikes according logic mamta banerjee rahul gandhi sonia gandhi arvind kejriwal imprisoned life already mentioned links videos show exact clips searching least doesnt repeat already told people belonging political party supports yeah doesnt repeat makes shit im proving points using videos want present fair argument point mistakes videos want drs videos links explanation peoples judgmental videos xb surprising manipulate large noof people easily otherwise itll proving point said comment prime ministers say surgical strike fake share link well watched videos agree aap supporter uploads like videos month one political started following year ago days avoid watching political video different topics still knowledgeble science history stuff talking indian political history cause still politics dhruv religious point view hindu still bigotry religions meant inspire teach people spread hate still fact use germany abuse cause long indian state points wherever wants agree supports aap points video watched engineer xplains lc",
    "light_cleaned_title": "We should boycott German Shepherd (Dhruv Rathee).",
    "light_cleaned_selftext": "German Rathee has been manipulating the audience for years, using biased articles. I've provided some links that exposed this shrewd manipulator. [Destroying Dhruv Rathee - YouTube](https://www.youtube.com/watch?v=JM6sJNaNdWk&ab_channel=EngineerXplains) [Destroying Dhruv Rathee Part - 2 #EducationISimportant - YouTube](https://www.youtube.com/watch?v=xd0-sIv1CPM&ab_channel=EngineerXplains) [THE GERMAN STORY | LAKSHAY CHAUDHARY - YouTube](https://www.youtube.com/watch?v=TLKMOAD1tVM&ab_channel=LakshayChaudhary)",
    "light_cleaned_comments": "Sorry but bringing someone like LC here disregards the whole point of your post. I know he doesn't make mature content, but in this video, he provided some evidence-based and logical points. I think you should at least bother by watching the video and then tell me what you think about the video. Lot of fallacies in your video.. also provide evidence on the description ab lakshay chaudhary ki baat sunne ki naubat aa gyi 🤮 The way we are using YouTube is frightening. Not only WhatsApp, you tube now controls public opinion and often these videos are extremely convincing. I never thought I'd say this but we need to go back to newspapers now- the few decent ones that survived this wave of polarisation. If there are a lot of fallacies in the videos, then Dhruv Rathee's videos are a stack of fallacies. Evidence is already provided in those videos. Well don't watch the LC videos then, I already provided 2 links above the LC ones. I think you should never judge something without watching it first. This is also a fallacy.. if I am talking about you why are you redirecting to druv ? Exactly, cunning manipulators like German Rathee use biased and unreputed articles to prove their points and quote \"Education is important\". I know that no government is perfect and pointing out every right winger as \"Andhbhakt\" and \"Illiterate\" shows illiteracy itself. He was showing that Surgical Strike was fake. It's surprising how he can manipulate such a large no.of people so easily. Because my whole post is directed towards Dhruv. But my comment is directed towards your video I'll rather listen to a choking pigeon than listen to LC If you share on YouTube. The audience there literally don't care doing their own research and just watch to fulfill their cravings.. when you post on reddit at least add links so that I can do a fair argument.. All of DR subscribers are blind. You've gained all the wisdom from these videos. Now lease bestow us with 3 YouTube timestamped links & tell us in simple English what's the issue/error in that segment & we'll surely understand that better. If we go by your logic that a YouTuber with a viewership of few millions and who is manipulating people by feeding them misinformation and biased content deserves to be boycotted, then the prime minister of this country who does the same thing to 1.4 billion people should be put behind bars for the rest of whatever life he has remaining. Wrong sub. r/chaddispeaks thoda age se left hai, bhai. And Lakshay Chaudhary, really? Yikes! According to the same logic, Mamta Banerjee, Rahul Gandhi, Sonia Gandhi and Arvind Kejriwal should be imprisoned for life. I already mentioned the links to the videos that will show you the exact clips you are searching for. At least he doesn't repeat what he has been already told by people belonging to the political party he supports. Yeah he doesn't repeat because he makes shit up I'm proving my points using the videos. If you want to present a fair argument, point out the mistakes in those videos : ) No. I want DR's videos links with your explanation, not these people's judgmental videos. &#x200B; > It's surprising how he can manipulate such a large no.of people so easily. Otherwise it'll be you proving your own point which you said in a comment. But they are not prime Ministers Where did he say surgical strike fake.. share me the link Well I watched the videos and I agree that he is a aap supporter but he uploads like 4 videos in a month and only one of them is political , I have started following him a year ago and now a days I avoid watching the political once but other video on different topics are still knowledgeble - science, history and stuff ( not talking about indian political history cause its still politics ) and I am with Dhruv on his religious point of view. I am a hindu but still against bigotry , religions are meant to inspire and teach people , not spread hate and still against the fact that they use 'him being in germany ' as an abuse cause as long as he is indian , he can state his points from wherever he wants to. Other than that , I agree that he supports AAP and most of the points on the video. ( I watched engineer xplains , not LC )"
}