{
    "id": "15bpxpz",
    "title": "This is really sad. How insensitive have we become.",
    "url": "https://www.indiatoday.in/india/story/uttar-pradesh-news-kanpur-gst-officers-man-dies-of-shock-after-sons-death-2411408-2023-07-25",
    "selftext": "This should never have happened.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1690527548.0,
    "convurl": "https://external-preview.redd.it/kHLdyL0h8WTsV7Mpd7pY5BkxBYsjGyvvqsd7BKZ1R84.jpg?auto=webp&s=a32a11d037c2f64c58149ef986302b8c56f5cb46",
    "comments": [
        "Those officers should be sent to prison for 10yrs",
        "I don't know what the solution to this is. They certainly were following the law when they ceased the vehicle. They could've arranged another vehicle for him to visit the son. No need to detain the driver.",
        "No one is wrong in this. The officers were doing their job. This is just unfortunate.",
        "Again indian officer trying to act like they are some kind of big boss \nWe should stop giving them these high status showing them there place",
        "Were they? Are they legally allowed to detain someone from Friday to Sunday? Knowing India, I'm sure they were just looking for some bribes.",
        "RIP 🙏"
    ],
    "cleaned_text": "really sad insensitive become never happened ",
    "cleaned_title": "really sad insensitive become",
    "cleaned_selftext": "never happened",
    "cleaned_comments": "officers sent prison yrs dont know solution certainly following law ceased vehicle couldve arranged another vehicle visit son need detain driver one wrong officers job unfortunate indian officer trying act like kind big boss stop giving high status showing place legally allowed detain someone friday sunday knowing india im sure looking bribes rip",
    "light_cleaned_title": "This is really sad. How insensitive have we become.",
    "light_cleaned_selftext": "This should never have happened.",
    "light_cleaned_comments": "Those officers should be sent to prison for 10yrs I don't know what the solution to this is. They certainly were following the law when they ceased the vehicle. They could've arranged another vehicle for him to visit the son. No need to detain the driver. No one is wrong in this. The officers were doing their job. This is just unfortunate. Again indian officer trying to act like they are some kind of big boss We should stop giving them these high status showing them there place Were they? Are they legally allowed to detain someone from Friday to Sunday? Knowing India, I'm sure they were just looking for some bribes. RIP 🙏"
}