{
    "id": "1cn7w6a",
    "title": "Claims of 3.2% unemployment exposes government willingness to paint a Rosie picture of India before Elections. But the reality is catastrophic! ",
    "url": "https://youtu.be/FFdJiicujZo",
    "selftext": "Youth Without Jobs! How Unemployment in India can Bring Down Indian Economy Growth | Soch Samvaad",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 3,
    "created_utc": 1715183376.0,
    "convurl": "https://external-preview.redd.it/N0SpGH5cbFsQwFv92csN_MrpMErybPzlgUICSxiCpng.jpg?auto=webp&s=13b842174e6e1872f66b33e252d697aaa2a4285b",
    "comments": [
        "***The Modi government either manipulates data, delays it, withholds it and/or withdraws it.***\n\n**Youth Unemployment**\n\nThe Modi government still needs to share the complete breakdown of Youth Unemployment. Based on the partial data the government has shared (with no breakup) and the historical available breakdown, I can determine that Youth Unemployment, as reported by the Modi government, is below the number reported by CMIE.\n\nTo elaborate, the historical breakup tells me that the 15-24 age group had an unemployment rate of 12% \\[1\\]. For 2023, per CMIE, **Youth Unemployment has increased to 45%** \\[2\\]. However, the Modi government states that Youth Unemployment (15-29) was 10% in 2023 \\[3\\].\n\nhttps://preview.redd.it/bufkc94q88zc1.png?width=899&format=png&auto=webp&s=8d2d91d8cf99bbcc140d7172110f966720479bad\n\nNow, one of you may argue that the unemployment rate for the 15-24 age group is very different from that of the 15-29 age group. Then, I will point out the historical numbers. In FY12, when Youth Unemployment for 14-24 was about 12%, the same year, the number for the 15-29 age group was 15%. Not that different!\n\n\\[1\\] [https://www.ies.gov.in/pdfs/sunita-sanghi-and-a-srija.pdf](https://www.ies.gov.in/pdfs/sunita-sanghi-and-a-srija.pdf)\n\n\\[2\\] [https://www.cmie.com/kommon/bin/sr.php?kall=warticle&dt=20230926184023&msec=816](https://www.cmie.com/kommon/bin/sr.php?kall=warticle&dt=20230926184023&msec=816)\n\n\\[3\\] [https://dge.gov.in/dge/sites/default/files/2024-01/2376.pdf](https://dge.gov.in/dge/sites/default/files/2024-01/2376.pdf)",
        "There's another view to look at it.\n\nhttps://preview.redd.it/4sk0q37v98zc1.png?width=784&format=png&auto=webp&s=9078a21370fc591c3de95db81028ce834dad5924\n\nFrom Economic survey, total 2.9 crore students are in Higher Secondary, and same number is getting added each year.  \nEither before or after graduation, these folks will need Jobs.  \n+ of the 3.9 crore 10th Board students, 13% drop out - Another 50 lakhs  \n+ 3 crore current unemployed (3.2%)\n\nThese 6.5 crore people need jobs.  \nAlso, there are other folks who are in agriculture and may move to other jobs.  \n  \nEstimates may vary, but The problem is very deep.",
        "Unemployment is real. Growth is only in books easy to manipulate"
    ],
    "cleaned_text": "claims unemployment exposes government willingness paint rosie picture india elections reality catastrophic youth without jobs unemployment india bring indian economy growth soch samvaad ",
    "cleaned_title": "claims unemployment exposes government willingness paint rosie picture india elections reality catastrophic",
    "cleaned_selftext": "youth without jobs unemployment india bring indian economy growth soch samvaad",
    "cleaned_comments": "modi government either manipulates data delays withholds andor withdraws youth unemployment modi government still needs share complete breakdown youth unemployment based partial data government shared breakup historical available breakdown determine youth unemployment reported modi government number reported cmie elaborate historical breakup tells age group unemployment rate per cmie youth unemployment increased however modi government states youth unemployment one may argue unemployment rate age group different age group point historical numbers fy youth unemployment year number age group different httpswwwiesgovinpdfssunitasanghiandasrijapdfhttpswwwiesgovinpdfssunitasanghiandasrijapdf httpswwwcmiecomkommonbinsrphpkallwarticledtmsechttpswwwcmiecomkommonbinsrphpkallwarticledtmsec httpsdgegovindgesitesdefaultfilespdfhttpsdgegovindgesitesdefaultfilespdf theres another view look economic survey total crore students higher secondary number getting added year either graduation folks need jobs crore th board students drop another lakhs crore current unemployed crore people need jobs also folks agriculture may move jobs estimates may vary problem deep unemployment real growth books easy manipulate",
    "light_cleaned_title": "Claims of 3.2% unemployment exposes government willingness to paint a Rosie picture of India before Elections. But the reality is catastrophic!",
    "light_cleaned_selftext": "Youth Without Jobs! How Unemployment in India can Bring Down Indian Economy Growth | Soch Samvaad",
    "light_cleaned_comments": "***The Modi government either manipulates data, delays it, withholds it and/or withdraws it.*** **Youth Unemployment** The Modi government still needs to share the complete breakdown of Youth Unemployment. Based on the partial data the government has shared (with no breakup) and the historical available breakdown, I can determine that Youth Unemployment, as reported by the Modi government, is below the number reported by CMIE. To elaborate, the historical breakup tells me that the 15-24 age group had an unemployment rate of 12% \\[1\\]. For 2023, per CMIE, **Youth Unemployment has increased to 45%** \\[2\\]. However, the Modi government states that Youth Unemployment (15-29) was 10% in 2023 \\[3\\]. Now, one of you may argue that the unemployment rate for the 15-24 age group is very different from that of the 15-29 age group. Then, I will point out the historical numbers. In FY12, when Youth Unemployment for 14-24 was about 12%, the same year, the number for the 15-29 age group was 15%. Not that different! \\[1\\] [https://www.ies.gov.in/pdfs/sunita-sanghi-and-a-srija.pdf](https://www.ies.gov.in/pdfs/sunita-sanghi-and-a-srija.pdf) \\[2\\] [https://www.cmie.com/kommon/bin/sr.php?kall=warticle&dt=20230926184023&msec=816](https://www.cmie.com/kommon/bin/sr.php?kall=warticle&dt=20230926184023&msec=816) \\[3\\] [https://dge.gov.in/dge/sites/default/files/2024-01/2376.pdf](https://dge.gov.in/dge/sites/default/files/2024-01/2376.pdf) There's another view to look at it. From Economic survey, total 2.9 crore students are in Higher Secondary, and same number is getting added each year. Either before or after graduation, these folks will need Jobs. + of the 3.9 crore 10th Board students, 13% drop out - Another 50 lakhs + 3 crore current unemployed (3.2%) These 6.5 crore people need jobs. Also, there are other folks who are in agriculture and may move to other jobs. Estimates may vary, but The problem is very deep. Unemployment is real. Growth is only in books easy to manipulate"
}