{
    "id": "16ymc0h",
    "title": "Telegram fraud update",
    "url": "https://www.reddit.com/gallery/16ymc0h",
    "selftext": "Updated Version of telegram/part-time job Fraud. \n\nIf you have encountered these fraudsters before, they lure the victim directly connecting through whatsapp and then putting in the telegram group for tasks and awarding the money by giving simple tasks. Then afterwards they lure you in a bigger plan of money deposit and earn more. \n\nI recently encountered a new way (maybe older) of luring you into the scam. I am listing some key points and attaching some proofs and screenshots for your references.\n\nKey points:\n\n1) You will see a photo (with attached link) on instagram or facebook. In which they clearly show you that this is a part time job and below there is a amazon logo. [ss-1 from insta and ss-2 from facebook ]\n\n2) After clicking the link you will redirect to either whatsapp or telegram, here the process is kinda same but with different job details like helping merchants, etc. \n\n3) Here the person will give you a link to register yourself to a work account, in that account you will see some cash (range from 80-250). [ss-3 link for work account ss-4 work account ]\n\n4) Now the tasks begins from here, they will ask you to start the process by depositing cash depends on the task. (attaching some screenshots) [ss-5 initial tasks]\n\nGuys I'm drafting this for future references.\n\nFirst and foremost thing is that, only Fraudsters will ask you money for a part time/full time jobs. \n\n**Only for educational and awareness purposes.\n\n#Be_Aware #Be_Vigilant",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696321988.0,
    "convurl": "https://i.redd.it/5x8gkl168yrb1.jpg",
    "comments": [
        "These accounts target college group chats to lure teens. However people now simply call out these accounts in the Group chat naming the MLM or frauds and awareness is being raised..",
        "How about we 10 people scam them of small amounts",
        "I like the idea of"
    ],
    "cleaned_text": "telegram fraud update updated version telegramparttime job fraud encountered fraudsters lure victim directly connecting whatsapp putting telegram group tasks awarding money giving simple tasks afterwards lure bigger plan money deposit earn recently encountered new way maybe older luring scam listing key points attaching proofs screenshots references key points see photo attached link instagram facebook clearly show part time job amazon logo ss insta ss facebook clicking link redirect either whatsapp telegram process kinda different job details like helping merchants etc person give link register work account account see cash range ss link work account ss work account tasks begins ask start process depositing cash depends task attaching screenshots ss initial tasks guys im drafting future references first foremost thing fraudsters ask money part timefull time jobs educational awareness purposes beaware bevigilant ",
    "cleaned_title": "telegram fraud update",
    "cleaned_selftext": "updated version telegramparttime job fraud encountered fraudsters lure victim directly connecting whatsapp putting telegram group tasks awarding money giving simple tasks afterwards lure bigger plan money deposit earn recently encountered new way maybe older luring scam listing key points attaching proofs screenshots references key points see photo attached link instagram facebook clearly show part time job amazon logo ss insta ss facebook clicking link redirect either whatsapp telegram process kinda different job details like helping merchants etc person give link register work account account see cash range ss link work account ss work account tasks begins ask start process depositing cash depends task attaching screenshots ss initial tasks guys im drafting future references first foremost thing fraudsters ask money part timefull time jobs educational awareness purposes beaware bevigilant",
    "cleaned_comments": "accounts target college group chats lure teens however people simply call accounts group chat naming mlm frauds awareness raised people scam small amounts like idea",
    "light_cleaned_title": "Telegram fraud update",
    "light_cleaned_selftext": "Updated Version of telegram/part-time job Fraud. If you have encountered these fraudsters before, they lure the victim directly connecting through whatsapp and then putting in the telegram group for tasks and awarding the money by giving simple tasks. Then afterwards they lure you in a bigger plan of money deposit and earn more. I recently encountered a new way (maybe older) of luring you into the scam. I am listing some key points and attaching some proofs and screenshots for your references. Key points: 1) You will see a photo (with attached link) on instagram or facebook. In which they clearly show you that this is a part time job and below there is a amazon logo. [ss-1 from insta and ss-2 from facebook ] 2) After clicking the link you will redirect to either whatsapp or telegram, here the process is kinda same but with different job details like helping merchants, etc. 3) Here the person will give you a link to register yourself to a work account, in that account you will see some cash (range from 80-250). [ss-3 link for work account ss-4 work account ] 4) Now the tasks begins from here, they will ask you to start the process by depositing cash depends on the task. (attaching some screenshots) [ss-5 initial tasks] Guys I'm drafting this for future references. First and foremost thing is that, only Fraudsters will ask you money for a part time/full time jobs. **Only for educational and awareness purposes. #Be_Aware #Be_Vigilant",
    "light_cleaned_comments": "These accounts target college group chats to lure teens. However people now simply call out these accounts in the Group chat naming the MLM or frauds and awareness is being raised.. How about we 10 people scam them of small amounts I like the idea of"
}