{
    "id": "1hn79m9",
    "title": "Bar objects to MP High Court Chief Justice SK Kait removing temple from official residence",
    "url": "https://www.barandbench.com/news/bar-objects-mp-high-court-chief-justice-sk-kait-removing-temple-official-residence",
    "selftext": "*\"The said bungalow and the temple are government property, the reconstruction of that temple is also being done from time to time with government money because most of the Chief Justice and employees who believe in Sanatan Dharma have been living in the bungalow. Therefore, they do not have to waste their precious time by going far away to perform their religious worship, hence the said temple is a very important means to make life happy, peaceful and beautiful,\"* the bar body said in its letter.",
    "flair": "Law & Courts",
    "score": 19,
    "num_comments": 1,
    "created_utc": 1735275126.0,
    "convurl": "https://external-preview.redd.it/hJ4_KdFRwuIGl5LyNzrRTjpDjCTvf5LMVC08SentiUU.jpg?auto=webp&s=ee0f4967f7e5c167f2a2d5e1dd8f634f97cff129",
    "comments": [
        "Sounds like a rare non-hindutvavadi  non-BJP CJ. Bobde, Khanwilkar, and Hemant were all hindutvavadi pro-BJP judges."
    ],
    "cleaned_text": "bar objects mp high court chief justice sk kait removing temple official residence said bungalow temple government property reconstruction temple also done time time government money chief justice employees believe sanatan dharma living bungalow therefore waste precious time going far away perform religious worship hence said temple important means make life happy peaceful beautiful bar body said letter ",
    "cleaned_title": "bar objects mp high court chief justice sk kait removing temple official residence",
    "cleaned_selftext": "said bungalow temple government property reconstruction temple also done time time government money chief justice employees believe sanatan dharma living bungalow therefore waste precious time going far away perform religious worship hence said temple important means make life happy peaceful beautiful bar body said letter",
    "cleaned_comments": "sounds like rare nonhindutvavadi nonbjp cj bobde khanwilkar hemant hindutvavadi probjp judges",
    "light_cleaned_title": "Bar objects to MP High Court Chief Justice SK Kait removing temple from official residence",
    "light_cleaned_selftext": "*\"The said bungalow and the temple are government property, the reconstruction of that temple is also being done from time to time with government money because most of the Chief Justice and employees who believe in Sanatan Dharma have been living in the bungalow. Therefore, they do not have to waste their precious time by going far away to perform their religious worship, hence the said temple is a very important means to make life happy, peaceful and beautiful,\"* the bar body said in its letter.",
    "light_cleaned_comments": "Sounds like a rare non-hindutvavadi non-BJP CJ. Bobde, Khanwilkar, and Hemant were all hindutvavadi pro-BJP judges."
}