{
    "id": "1crmqjs",
    "title": "Deep fake alert! ",
    "url": "https://v.redd.it/kirb7hcbmc0d1",
    "selftext": "Scamsters sponsoring deep fake videos on @facebook India. Featuring Mukesh Ambani, Nandan Nilekani, Narayana Murthy and Rajdeep Sardesai. \n\nSeems too real. You just need to listen to the diction of each of the speakers to know it's not them. And in addition doesn't look like it's been created by Indians (again cue from how they said the names, and Indians rarely speak in terms of millions) \n\nThis came up on my Dad's Facebook feed. Obviously a lot of non tech savvy people could fall prey. ",
    "flair": "Crime",
    "score": 61,
    "num_comments": 7,
    "created_utc": 1715673551.0,
    "convurl": "https://external-preview.redd.it/aDNrcXp0M2JtYzBkMZqDnll1xx41M4rQKgZtW2vyT_EXKP9VFxckmCdQcDc5.png?format=pjpg&auto=webp&s=0a881ec3a3c90634dcc7ee6a01d21cf16e73af11",
    "comments": [
        "Saw the same last month with Sam Altman in a zoom call with other open AI employees. Took me a while to understand it was a deepfake. My parents are so screwed.",
        "🤣🤣🤥",
        "What happened? What did your parents do?",
        "Irony is if u ever report them facebook reply it's not a scam they can't remove this..",
        "Poco phone walle kidr hai",
        "My parents invested believing it’s true. It’s so tough to ensure and explain parents the concept of deep fake videos ."
    ],
    "cleaned_text": "deep fake alert scamsters sponsoring deep fake videos facebook india featuring mukesh ambani nandan nilekani narayana murthy rajdeep sardesai seems real need listen diction speakers know addition doesnt look like created indians cue said names indians rarely speak terms millions came dads facebook feed obviously lot non tech savvy people could fall prey ",
    "cleaned_title": "deep fake alert",
    "cleaned_selftext": "scamsters sponsoring deep fake videos facebook india featuring mukesh ambani nandan nilekani narayana murthy rajdeep sardesai seems real need listen diction speakers know addition doesnt look like created indians cue said names indians rarely speak terms millions came dads facebook feed obviously lot non tech savvy people could fall prey",
    "cleaned_comments": "saw last month sam altman zoom call open ai employees took understand deepfake parents screwed happened parents irony u ever report facebook reply scam cant remove poco phone walle kidr hai parents invested believing true tough ensure explain parents concept deep fake videos",
    "light_cleaned_title": "Deep fake alert!",
    "light_cleaned_selftext": "Scamsters sponsoring deep fake videos on @facebook India. Featuring Mukesh Ambani, Nandan Nilekani, Narayana Murthy and Rajdeep Sardesai. Seems too real. You just need to listen to the diction of each of the speakers to know it's not them. And in addition doesn't look like it's been created by Indians (again cue from how they said the names, and Indians rarely speak in terms of millions) This came up on my Dad's Facebook feed. Obviously a lot of non tech savvy people could fall prey.",
    "light_cleaned_comments": "Saw the same last month with Sam Altman in a zoom call with other open AI employees. Took me a while to understand it was a deepfake. My parents are so screwed. 🤣🤣🤥 What happened? What did your parents do? Irony is if u ever report them facebook reply it's not a scam they can't remove this.. Poco phone walle kidr hai My parents invested believing it’s true. It’s so tough to ensure and explain parents the concept of deep fake videos ."
}