{
    "id": "13g851u",
    "title": "Scam messages on whatsapp",
    "url": "https://www.reddit.com/r/india/comments/13g851u/scam_messages_on_whatsapp/",
    "selftext": "Been getting a lot of these lately from different countries, a new number on every other day. Anyone else dealt with this shit? What should I do other than blocking every single number? It's so frustrating. I don't want to change my number.\n\nhttps://preview.redd.it/n1wt9epf5jza1.png?width=1118&format=png&auto=webp&v=enabled&s=2ae86aeda4f24ded5641d702d1d7325967f68387",
    "flair": "AskIndia",
    "score": 12,
    "num_comments": 10,
    "created_utc": 1683955084.0,
    "convurl": "https://b.thumbs.redditmedia.com/DKWX8z0NlDSmDZrFJEjMPSp7GNlnWSl5WuQkIVUFBCk.jpg",
    "comments": [
        "LOL everytime I get these, I say yes and they make you do simple task like follow 2 accounts on Ig and send screenshot. Once its day they pay you 150-300. As soon I get the money, I block them haha",
        "Yep. Getting voice calls and messages. I ignore them.",
        "wait....They PAID you? So it's not a scam?",
        "I don't know how to respond to this idea.",
        "yeah, did the same at the beginning, but now it's getting out of hand",
        "lol it is, but initially they pay you to win your trust. Once they have paid 150-300 they will ask you to do prepaid tasks which involve giving them money and then they say, they will double it/ give you more than you gave them. Thats when you block them and flee with whatever they gave you haha",
        "damn, im gonna try it once",
        "Update: They actually did pay me. asked for my bank account number and IFSC and their \"receptionist\" actually paid me. TF?",
        "LOL and now they will pay you once more, just keep doing the tasks ( must be like the ig profiles) and dont send them any money in lieu of prepaid merchant tasks. Just earn 150/300 again, cash it out and block them X)"
    ],
    "cleaned_text": "scam messages whatsapp getting lot lately different countries new number every day anyone else dealt shit blocking every single number frustrating dont want change number ",
    "cleaned_title": "scam messages whatsapp",
    "cleaned_selftext": "getting lot lately different countries new number every day anyone else dealt shit blocking every single number frustrating dont want change number",
    "cleaned_comments": "lol everytime get say yes make simple task like follow accounts ig send screenshot day pay soon get money block haha yep getting voice calls messages ignore waitthey paid scam dont know respond idea yeah beginning getting hand lol initially pay win trust paid ask prepaid tasks involve giving money say double give gave thats block flee whatever gave haha damn im gon na try update actually pay asked bank account number ifsc receptionist actually paid tf lol pay keep tasks must like ig profiles dont send money lieu prepaid merchant tasks earn cash block x",
    "light_cleaned_title": "Scam messages on whatsapp",
    "light_cleaned_selftext": "Been getting a lot of these lately from different countries, a new number on every other day. Anyone else dealt with this shit? What should I do other than blocking every single number? It's so frustrating. I don't want to change my number.",
    "light_cleaned_comments": "LOL everytime I get these, I say yes and they make you do simple task like follow 2 accounts on Ig and send screenshot. Once its day they pay you 150-300. As soon I get the money, I block them haha Yep. Getting voice calls and messages. I ignore them. wait....They PAID you? So it's not a scam? I don't know how to respond to this idea. yeah, did the same at the beginning, but now it's getting out of hand lol it is, but initially they pay you to win your trust. Once they have paid 150-300 they will ask you to do prepaid tasks which involve giving them money and then they say, they will double it/ give you more than you gave them. Thats when you block them and flee with whatever they gave you haha damn, im gonna try it once Update: They actually did pay me. asked for my bank account number and IFSC and their \"receptionist\" actually paid me. TF? LOL and now they will pay you once more, just keep doing the tasks ( must be like the ig profiles) and dont send them any money in lieu of prepaid merchant tasks. Just earn 150/300 again, cash it out and block them X)"
}