{
    "id": "15mia5a",
    "title": "Adminstration of IIIT Una",
    "url": "https://www.reddit.com/gallery/15mia5a",
    "selftext": "This is how they want to avoid complaint and at a same time they are asking students not to share information reg. Institute to family. WTF",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691594429.0,
    "convurl": "https://i.redd.it/b3em2c2qq3hb1.png",
    "comments": [
        "Actually it's mail received to all the students",
        "I am guessing pretty soon they'll add point e to the rules  on not posting college problems on social media.",
        "Glad that I chose IIIT Nagpur over Una :)",
        "This is correct from the administration. I want to see more of these, directed towards the majority, why should only minority face such dictatorship.",
        "What happened to you ?",
        "I am just angry thats all.",
        "All the best but maybe you are just unaware, I mean these types of situations might be there also",
        "Nagpur mai zyaada hai plus hostel issue..."
    ],
    "cleaned_text": "adminstration iiit una want avoid complaint time asking students share information reg institute family wtf ",
    "cleaned_title": "adminstration iiit una",
    "cleaned_selftext": "want avoid complaint time asking students share information reg institute family wtf",
    "cleaned_comments": "actually mail received students guessing pretty soon theyll add point e rules posting college problems social media glad chose iiit nagpur una correct administration want see directed towards majority minority face dictatorship happened angry thats best maybe unaware mean types situations might also nagpur mai zyaada hai plus hostel issue",
    "light_cleaned_title": "Adminstration of IIIT Una",
    "light_cleaned_selftext": "This is how they want to avoid complaint and at a same time they are asking students not to share information reg. Institute to family. WTF",
    "light_cleaned_comments": "Actually it's mail received to all the students I am guessing pretty soon they'll add point e to the rules on not posting college problems on social media. Glad that I chose IIIT Nagpur over Una :) This is correct from the administration. I want to see more of these, directed towards the majority, why should only minority face such dictatorship. What happened to you ? I am just angry thats all. All the best but maybe you are just unaware, I mean these types of situations might be there also Nagpur mai zyaada hai plus hostel issue..."
}