{
    "id": "13p0mp6",
    "title": "American from California seeking legit ashram",
    "url": "https://www.reddit.com/r/india/comments/13p0mp6/american_from_california_seeking_legit_ashram/",
    "selftext": "Hey r/india, I’m looking for an ashram in India to stay at for two weeks while in traveling in your country. \n\nI do a lot of meditation. Just seeking a daily schedule at an ashram for maybe two weeks that I can stay at while I’m in India traveling around. \n\nFound one in Rishikesh that looks legit but from what I’ve read here it doesn’t exist they’re all a scam..? \n\nThis is what I’ve found: https://www.sadhakagrama.org/daily-ashram-schedule/\n\nAny recommendations for places to learn more about meditation and yoga and live a more religious / spiritual experience at an ashram? \n\nThanks so much <3",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 8,
    "created_utc": 1684783833.0,
    "convurl": "https://external-preview.redd.it/DWsitKVGoDPXAgqqlyoqp3lpQC31nIuTOY1pti92_Nk.jpg?auto=webp&v=enabled&s=5157a1fb81fd90f7ee0b5aba813fb8fb00cca881",
    "comments": [
        "Vast Majority of them are scams , go there only if someone who you know & has been there recommends it to you, or else stay away.",
        "How about using that money and trying to actually help someone for real? Most of these ashrams are very sketchy places, but it's your money, your choice.",
        "Don’t.",
        "Does it have to be India? There's a Hindu monastery in Kauai - gives you complete Ashram experience. Plus the weather is India - like, minus the smog and honking."
    ],
    "cleaned_text": "american california seeking legit ashram hey rindia im looking ashram india stay two weeks traveling country lot meditation seeking daily schedule ashram maybe two weeks stay im india traveling around found one rishikesh looks legit ive read doesnt exist theyre scam ive found recommendations places learn meditation yoga live religious spiritual experience ashram thanks much ",
    "cleaned_title": "american california seeking legit ashram",
    "cleaned_selftext": "hey rindia im looking ashram india stay two weeks traveling country lot meditation seeking daily schedule ashram maybe two weeks stay im india traveling around found one rishikesh looks legit ive read doesnt exist theyre scam ive found recommendations places learn meditation yoga live religious spiritual experience ashram thanks much",
    "cleaned_comments": "vast majority scams go someone know recommends else stay away using money trying actually help someone real ashrams sketchy places money choice dont india theres hindu monastery kauai gives complete ashram experience plus weather india like minus smog honking",
    "light_cleaned_title": "American from California seeking legit ashram",
    "light_cleaned_selftext": "Hey r/india, I’m looking for an ashram in India to stay at for two weeks while in traveling in your country. I do a lot of meditation. Just seeking a daily schedule at an ashram for maybe two weeks that I can stay at while I’m in India traveling around. Found one in Rishikesh that looks legit but from what I’ve read here it doesn’t exist they’re all a scam..? This is what I’ve found: Any recommendations for places to learn more about meditation and yoga and live a more religious / spiritual experience at an ashram? Thanks so much <3",
    "light_cleaned_comments": "Vast Majority of them are scams , go there only if someone who you know & has been there recommends it to you, or else stay away. How about using that money and trying to actually help someone for real? Most of these ashrams are very sketchy places, but it's your money, your choice. Don’t. Does it have to be India? There's a Hindu monastery in Kauai - gives you complete Ashram experience. Plus the weather is India - like, minus the smog and honking."
}