{
    "id": "15js1oc",
    "title": "India's tech companies are trash",
    "url": "https://www.reddit.com/r/india/comments/15js1oc/indias_tech_companies_are_trash/",
    "selftext": "*As an extension to* [u/eventonly](https://www.reddit.com/u/eventonly/)'s [post on OTPs](https://imgur.com/a/oLJDGU2)*, here's my extension.*\n\n**Security, Ethics & Good Design don't exist in Indian tech.**\n\nNo one gives an option to permanently delete the account & data. No easy option to update mobile number or email. Passwords don't exist, only OTPs. TOTP based 2 Factor Authentication seems like rocket science for Indian companies to implement. Consent? What's that. We'll spam your email & inbox without giving an option to easily opt out. No! Our website doesn't work, download the app because it requires 10 unnecessary permissions & gives us more of your data.\n\nAccounts aren't allowed to be deleted or easily updated. The moment you stop using any of your mobile numbers, it'll be deactivated & transferred to a random stranger by the telecom company. Now with a single OTP, the stranger can access your accounts, addresses, phone numbers, email IDs saved in shopping apps & so much of your life's history that's saved everywhere. Any sane person knows how risky this is.\n\nNow your data is with that person & that person (if innocent) can't delete the account to give themselves a fresh account to start with. You are at risk because your data is in the open, the innocent new subscriber is stuck with your old account & history.\n\nThe surprising thing? The average consumer doesn't give a s\\*\\*t, then cries about fraud happening with them because 50K could be deducted with a single OTP.\n\nThis isn't to say that I hate all of them, but it's a user's constructive feedback who expects their data to be secured.\n\nJust like a crime doesn't have to be a crime only when the law declares it as such, good principles & user's rights in products don't have to be implemented only when a law like GDPR comes to India which is near impossible.\n\nKudos to the rare companies like Zerodha, Zoho & a handful others who have implemented these well.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691334859.0,
    "convurl": "https://external-preview.redd.it/gCwNe2nK79aJHqWpz7pTH5tXwKD923MoTi0ULGy8Gow.jpg?auto=webp&s=7931d768e9801865d110ad8f63f1753c9f4fb16f",
    "comments": [
        "Get 400rs free in your groww app just download through my link\n\nhttps://app.groww.in/v3cO/s3k3nzd2",
        "Do they at least give a warning before a number is provided to another customer? While purchasing a SIM, we do provide an alternate number.\n\nBtw, agree with what you are saying but till that happens, there are platforms like Doosra which provide you a virtual number that can be deleted etc. (Paid)",
        "It's herd mentality - every Indian website copies other Indian website. Nobody has even thought about making better website. Result of bankrupt mentality coming from a broken ratta-maro education system.\n\nOh, also if you absolutely *must* have indian telephone numbers, you are leaving out most of NRI and almost all of European and North American population, effectively cutting off a huge potential revenue stream. \n\nAs they say - can't fix stupid.",
        "Login via OTP has to be the most idiotic way of logging into to an app/website. I hate it to the core.\n\nSadly, it's become a norm now. So not only are you opening yourself for spam calls and sms by way of providing your mobile number to login, you are also out of luck if your number is deactivated or given to someone else."
    ],
    "cleaned_text": "indias tech companies trash extension ueventonlyhttpswwwredditcomueventonlys post otpshttpsimgurcomaoljdgu heres extension security ethics good design dont exist indian tech one gives option permanently delete account data easy option update mobile number email passwords dont exist otps totp based factor authentication seems like rocket science indian companies implement consent whats well spam email inbox without giving option easily opt website doesnt work download app requires unnecessary permissions gives us data accounts arent allowed deleted easily updated moment stop using mobile numbers itll deactivated transferred random stranger telecom company single otp stranger access accounts addresses phone numbers email ids saved shopping apps much lifes history thats saved everywhere sane person knows risky data person person innocent cant delete account give fresh account start risk data open innocent new subscriber stuck old account history surprising thing average consumer doesnt give st cries fraud happening k could deducted single otp isnt say hate users constructive feedback expects data secured like crime doesnt crime law declares good principles users rights products dont implemented law like gdpr comes india near impossible kudos rare companies like zerodha zoho handful others implemented well ",
    "cleaned_title": "indias tech companies trash",
    "cleaned_selftext": "extension ueventonlyhttpswwwredditcomueventonlys post otpshttpsimgurcomaoljdgu heres extension security ethics good design dont exist indian tech one gives option permanently delete account data easy option update mobile number email passwords dont exist otps totp based factor authentication seems like rocket science indian companies implement consent whats well spam email inbox without giving option easily opt website doesnt work download app requires unnecessary permissions gives us data accounts arent allowed deleted easily updated moment stop using mobile numbers itll deactivated transferred random stranger telecom company single otp stranger access accounts addresses phone numbers email ids saved shopping apps much lifes history thats saved everywhere sane person knows risky data person person innocent cant delete account give fresh account start risk data open innocent new subscriber stuck old account history surprising thing average consumer doesnt give st cries fraud happening k could deducted single otp isnt say hate users constructive feedback expects data secured like crime doesnt crime law declares good principles users rights products dont implemented law like gdpr comes india near impossible kudos rare companies like zerodha zoho handful others implemented well",
    "cleaned_comments": "get rs free groww app download link least give warning number provided another customer purchasing sim provide alternate number btw agree saying till happens platforms like doosra provide virtual number deleted etc paid herd mentality every indian website copies indian website nobody even thought making better website result bankrupt mentality coming broken rattamaro education system oh also absolutely must indian telephone numbers leaving nri almost european north american population effectively cutting huge potential revenue stream say cant fix stupid login via otp idiotic way logging appwebsite hate core sadly become norm opening spam calls sms way providing mobile number login also luck number deactivated given someone else",
    "light_cleaned_title": "India's tech companies are trash",
    "light_cleaned_selftext": "*As an extension to* [u/eventonly](https://www.reddit.com/u/eventonly/)'s [post on OTPs](https://imgur.com/a/oLJDGU2)*, here's my extension.* **Security, Ethics & Good Design don't exist in Indian tech.** No one gives an option to permanently delete the account & data. No easy option to update mobile number or email. Passwords don't exist, only OTPs. TOTP based 2 Factor Authentication seems like rocket science for Indian companies to implement. Consent? What's that. We'll spam your email & inbox without giving an option to easily opt out. No! Our website doesn't work, download the app because it requires 10 unnecessary permissions & gives us more of your data. Accounts aren't allowed to be deleted or easily updated. The moment you stop using any of your mobile numbers, it'll be deactivated & transferred to a random stranger by the telecom company. Now with a single OTP, the stranger can access your accounts, addresses, phone numbers, email IDs saved in shopping apps & so much of your life's history that's saved everywhere. Any sane person knows how risky this is. Now your data is with that person & that person (if innocent) can't delete the account to give themselves a fresh account to start with. You are at risk because your data is in the open, the innocent new subscriber is stuck with your old account & history. The surprising thing? The average consumer doesn't give a s\\*\\*t, then cries about fraud happening with them because 50K could be deducted with a single OTP. This isn't to say that I hate all of them, but it's a user's constructive feedback who expects their data to be secured. Just like a crime doesn't have to be a crime only when the law declares it as such, good principles & user's rights in products don't have to be implemented only when a law like GDPR comes to India which is near impossible. Kudos to the rare companies like Zerodha, Zoho & a handful others who have implemented these well.",
    "light_cleaned_comments": "Get 400rs free in your groww app just download through my link Do they at least give a warning before a number is provided to another customer? While purchasing a SIM, we do provide an alternate number. Btw, agree with what you are saying but till that happens, there are platforms like Doosra which provide you a virtual number that can be deleted etc. (Paid) It's herd mentality - every Indian website copies other Indian website. Nobody has even thought about making better website. Result of bankrupt mentality coming from a broken ratta-maro education system. Oh, also if you absolutely *must* have indian telephone numbers, you are leaving out most of NRI and almost all of European and North American population, effectively cutting off a huge potential revenue stream. As they say - can't fix stupid. Login via OTP has to be the most idiotic way of logging into to an app/website. I hate it to the core. Sadly, it's become a norm now. So not only are you opening yourself for spam calls and sms by way of providing your mobile number to login, you are also out of luck if your number is deactivated or given to someone else."
}