{
    "id": "16j7s80",
    "title": "Shall he dance the tango of enlightenment in her private lesson waltz, or wander lost in the chaotic mazes of ignorance's carnival?",
    "url": "https://www.reddit.com/r/india/comments/16j7s80/shall_he_dance_the_tango_of_enlightenment_in_her/",
    "selftext": "Title :  \nAh, the curious case of India and Bangladesh – where one sees friendship and the other seems to have a bit of an identity crisis, considering itself the neighborhood consultant. If Modi wants to learn the art of staying in power, he might as well attend \"Hasina's Eternal Leadership Academy.\" After all, she's been mastering it since 2009, while Modi's just a rookie since 2014.   \n\n\nAre India's musings confined to sending roses to Russia, or do they secretly crave a new neighbour vying for the \"Supreme Leader's Got Talent\" competition? In the world's dictator fashion show, who will strut their authoritarian stuff next door?\n\nSource   \n[https://en.wikipedia.org/wiki/Narendra\\_Modi#:\\~:text=Narendra%20Damodardas%20Modi%20(Gujarati%3A%20%5B,Parliament%20(MP)%20for%20Varanasi](https://en.wikipedia.org/wiki/Narendra_Modi#:~:text=Narendra%20Damodardas%20Modi%20(Gujarati%3A%20%5B,Parliament%20(MP)%20for%20Varanasi).\n\n[https://en.wikipedia.org/wiki/Sheikh\\_Hasina](https://en.wikipedia.org/wiki/Sheikh_Hasina)  \n",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694767345.0,
    "convurl": "https://external-preview.redd.it/oQcQzBdXeYwa0g1duCIzzMLHALN518NSFk_LejEvjZ8.jpg?auto=webp&s=ce414b5e4a967a89045af2e3c3e6a93fbfa00dba",
    "comments": [],
    "cleaned_text": "shall dance tango enlightenment private lesson waltz wander lost chaotic mazes ignorances carnival title ah curious case india bangladesh one sees friendship seems bit identity crisis considering neighborhood consultant modi wants learn art staying power might well attend hasinas eternal leadership academy shes mastering since modis rookie since indias musings confined sending roses russia secretly crave new neighbour vying supreme leaders got talent competition worlds dictator fashion show strut authoritarian stuff next door source httpsenwikipediaorgwikinarendramoditextnarendradamodardasmodigujaratiabparliamentmpforvaranasihttpsenwikipediaorgwikinarendramoditextnarendradamodardasmodigujaratiabparliamentmpforvaranasi httpsenwikipediaorgwikisheikhhasinahttpsenwikipediaorgwikisheikhhasina ",
    "cleaned_title": "shall dance tango enlightenment private lesson waltz wander lost chaotic mazes ignorances carnival",
    "cleaned_selftext": "title ah curious case india bangladesh one sees friendship seems bit identity crisis considering neighborhood consultant modi wants learn art staying power might well attend hasinas eternal leadership academy shes mastering since modis rookie since indias musings confined sending roses russia secretly crave new neighbour vying supreme leaders got talent competition worlds dictator fashion show strut authoritarian stuff next door source httpsenwikipediaorgwikinarendramoditextnarendradamodardasmodigujaratiabparliamentmpforvaranasihttpsenwikipediaorgwikinarendramoditextnarendradamodardasmodigujaratiabparliamentmpforvaranasi httpsenwikipediaorgwikisheikhhasinahttpsenwikipediaorgwikisheikhhasina",
    "cleaned_comments": "",
    "light_cleaned_title": "Shall he dance the tango of enlightenment in her private lesson waltz, or wander lost in the chaotic mazes of ignorance's carnival?",
    "light_cleaned_selftext": "Title : Ah, the curious case of India and Bangladesh – where one sees friendship and the other seems to have a bit of an identity crisis, considering itself the neighborhood consultant. If Modi wants to learn the art of staying in power, he might as well attend \"Hasina's Eternal Leadership Academy.\" After all, she's been mastering it since 2009, while Modi's just a rookie since 2014. Are India's musings confined to sending roses to Russia, or do they secretly crave a new neighbour vying for the \"Supreme Leader's Got Talent\" competition? In the world's dictator fashion show, who will strut their authoritarian stuff next door? Source [https://en.wikipedia.org/wiki/Narendra\\_Modi#:\\~:text=Narendra%20Damodardas%20Modi%20(Gujarati%3A%20%5B,Parliament%20(MP)%20for%20Varanasi](https://en.wikipedia.org/wiki/Narendra_Modi#:~:text=Narendra%20Damodardas%20Modi%20(Gujarati%3A%20%5B,Parliament%20(MP)%20for%20Varanasi). [https://en.wikipedia.org/wiki/Sheikh\\_Hasina](https://en.wikipedia.org/wiki/Sheikh_Hasina)",
    "light_cleaned_comments": ""
}