{
    "id": "14chkyk",
    "title": "Is the Society Becoming Female Dominant?",
    "url": "https://www.reddit.com/r/india/comments/14chkyk/is_the_society_becoming_female_dominant/",
    "selftext": "Is the Society Becoming Female Dominant? Are we loosing control of society to the women?  Is the Society Being Overtaken by Women? What are your views?  Share Your Perspective in my Survey! A survey as part of the Gender Sensitization course at college.\n\nI invite you to participate in my exciting survey on the evolving dynamics of our society. I am exploring the thought-provoking question: Is the Society Becoming Female Dominant? This is your chance to make your voice heard and contribute to the ongoing conversation about gender equality and empowerment.\n\nI  appreciate if you can take part in this survey and help me and my group with our project at college. Thank you\n\nLink to the Survey-[https://forms.gle/tm5EquZFrxs8566R8](https://forms.gle/tm5EquZFrxs8566R8)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 33,
    "created_utc": 1687085802.0,
    "convurl": "https://external-preview.redd.it/A0nin68QT05jaF8o_Q4CbAD5Mtdlu_TiiVIQGMKpD8U.jpg?auto=webp&v=enabled&s=f9d03cc71649d7ce057e46b28422a43fc9bd4292",
    "comments": [
        "wow... lame",
        "I think it is being dominated by stupidity from both men and women(girls and boys who are yet to develop their brains completely)\n\nSee the downvotes would prove it. Go Go GO!!",
        "Exactly.",
        "You should post this on r/TwoXIndia as well",
        "Although I cannot agree with your opinion, I would appreciate if you can take a look at the form attached, it aims to understand a rather important topic.",
        "They will tear him apart. It is Sunday- everybody will be just waiting for a bait lmao",
        "lol",
        "Take a screenshot of your original comment and remove the downvotes line. I think that would be more effective.",
        "Yeah. I feel like we shouldn't really take this survey seriously until OP posts it there. He really would get meaningful responses there.",
        "You guys getting dominated by females? Where do I sign up?",
        "Lol 😂 🤣🤣",
        "It is not even becoming equal for both men and women, forget becoming female dominant.\n\nCertain things have also gotten worse than they were in the past like women's unemployment and dowry. Less women are working now than they were in the past, only about 30% of women are doing paid work. Dowry is also much more common than it was in the past, now 80-90% of Hindu weddings involve dowry.",
        "Due to feminism , females are becoming more masculine but hence they are getting trapped in love Jihad . Its my theory .",
        "Side eyeeee",
        "Dowry is less common now than it was even 10 years ago, you just didn't know about it. \n\nAlso what you are talking about is low workforce participation of Women and not Unemployment. In households where there is no need for a second income, women are less motivated to have jobs. And who can blame them, working long hours for little money as envisioned by our Capitalist Society is a tiresome chore. Household chores are way less exhausting than 8-9 hours of manual labour.",
        "What is Sunday - Monday for people without jobs",
        "Certain laws are definitely in blind favour of women and are misused to no end. \n\nSuch as maintenance and Domestic Violence.\n\nMaintenance should be allowed only for women without any education or income, that too bare sustenance, 10K a month Max for wife and 10K a month for each child. To ensure divorced women don't have to struggle to survive and also discouraging marriage for the sole purpose of divorce. \n\nSecondly Filing False cases of DV should be treated as Extortion under IPC and carry a 3 year prison sentence.",
        "😂😂",
        "Look up some stats. Dowry rates have increased significantly. \n\nWomen don't quit because they want to, they are mostly forced by their family or husband to quit their job. Housewives are more likely to die due to suicide than someone who's working. Women who are not working are more desirable to men. Women mostly don't want to quit their jobs but quit out of pressure. If household chores are less exhausting then why don't men do them? the majority of men can't do household chores and even if the wife is working they still expect her to do everything.",
        "Could you also please do the survey?  \n[https://forms.gle/tm5EquZFrxs8566R8](https://forms.gle/tm5EquZFrxs8566R8)",
        "Have you ever wondered why only less than 20% of women work? The official number of female taxpayers is somewhere like 18-20% \n\nIt is because of ONLY ONE thing/notion - \"before a wedding, a girl is the responsibility of father and after the wedding, she is the responsibility of husband\"\n\nIndian courts, including the Supreme court, constantly reinforce this notion. It is because of this notion, wives \"demand\" maintenance and courts grant the maintenance\n\nWith this notion, females and their family have to ensure that they get married to a man with good salary. If marriage doesn't work, she will get maintenance from courts. If marriage works, then also all good - Females will say they will take care of household work... Where washing is done by Washing machine and they have maids or servants for cleaning, cooking etc\n\nJust imagine if this notion was absent, then what would happen. Females will also have to think about getting a job like males do. And when that happens, females would strive to get a job before marriage\n\nNow, it is a common understanding that the probability of giving dowry in the wedding of a working girl is lesser than that of the non-working girl\n\nSame goes with female foeticide, domestic violence, reporting of rape and almost all the bad things or crimes associated with females in India\n\n\nAnother perspective on dowry is like this...\n\nTake all the dowry cases filed in India in the last 10 years.. atleast in 80% of the cases, you will find that the wife has alleged that husband and his family demanded dowry before wedding and yet the girl and her family still went ahead with the wedding. It is like i know that the other party wants dowry but still i married him and now i am \"surprised\" or \"harassed\" because the other party is asking for dowry.\nBy the way, in all these 80% cases, the wife would be alleging that the husband and family would have demanded an exorbitant amount of dowry or some luxury car and the bride would have paid some amount with a promise to pay remaining in few days/months and/or given Fortuner instead of Mercedes/Audi etc\n\nMy question is simple - why didn't the girl and her family back out of the wedding when the dowry demand was made? Were they expecting some change of heart OR some miracle? Unfortunately, not even the Indian courts ask this question. They mechanically assume that the girl's allegations are true\n\nAnother aspect....if a groom is asking for 25L/50L/1Cr as cash at the time of wedding, then he is asking for dowry\nBut if a wife is asking for 25L/50L/1Cr as maintenance/alimony for giving divorce in court, then it is considered her \"right\"? Why shouldn't it considered as extortion?\n\n\nAnother thing which i have observed personally in many weddings is if a groom doesn't want or accepts dowry, then the bride and her family members \"assume\" that the groom has something wrong in his past. Simply put, bride and her family wants to give dowry\n\n\nSo if you ask me, in a nutshell, all the bad things/crimes associated with females in today's world can be significantly reduced if the concept of maintenance is addressed properly\n\nIf you ask me, wives should not get maintenance unless she has stayed for minimum 5 years with the husband and if she has stayed for 5 years without any breaks, then she should get max 1 month of maintenance per 1 year of cohabitation. And this is applicable for non-working women or women who left their jobs to take care of children. And this 1 month of maintenance per year of cohabitation would put pressure on the wife to get a job. Anyways, there are organisations who run special hiring for women with career breaks - what is stopping these women to opt for these hiring programs and integrate in working force again. \n\nIn the long run, either the Indian Judiciary should allow prenuptial agreements or ban maintenance altogether. That way, females will always be working and earning and hence it will be difficult for anyone including the husbands to take them for granted.\n\nIf Females really want to be considered equal to Males, they have to first forego all the benefits and entitlements they have as females. You can't be considered equal if you keep getting benefits\n\n\nI will give you a real life example - You can Google to verify my claims. Read the life story of Neena Gupta, a veteran actress. She became pregnant and her boyfriend/father of her child was Vivian Richards who asked Neena Gupta to abort the child. But Neena Gupta went ahead with the child and raised that child. This was possible only because Neena Gupta was working and was financially independent.\nThis was in the era around 1980 when gender determination was legal in India and advertisements used to be run by clinics saying pay XYZ amount now to avoid dowry in the future\n\nJust reverse the situation and put a non-working and dependent wife in a similar situation. Can a wife avoid abortion if her husband or his family force her?",
        "The woman's family wants them to marry someone 'good' and most of those grooms take dowry. In fact the more they earn the more dowry they take. The woman's parents want someone with money to marry so they are fine paying dowry for the sake of this. \n\nI'm all for prenups but maintenance after marriage is needed. I'm also for women paying alimony or child support after divorce if she earns more and men don't take dowry or are abusive. If a man's family takes dowry then he should pay maintenance, if he doesn't want to then he shouldn't ask for dowry or ask his wife to quit her job.  \n\nWhat if the husband is abusive and forces her to quit her job? She can't stay for 5 years for the sake of maintenance. This will be different if she's earning but outright banning it can't be done.",
        "If the husband is abusive, she will know in the first year and she can walk out of the marriage and find a job. \n\nBy the way, forcing a wife to leave her job is also considered domestic violence or harassment. If she is earning, she can walk out of the marriage instead of leaving the job.\n\nAnd what about divorces where wives were abusive and harassed husband? Aren't husbands humans too?\n\nIf there are children from marriage, then it is the responsibility of both the parents not only husbands. A lot of divorces happen because of incompatibility between husband and wife.\n\n\nI am against maintenance for lifetime. Put a limit on the time period. I can show many cases where wife stayed for 5 days after wedding and then left the house and got maintenance for life. Even if you don't agree with the minimum 5 year limit on maintenance, Courts and government can't run lifetime pension for the wife at the expense of husband. There has to be a limit on the maximum number of months a wife is eligible for maintenance. For example, children are eligible for maintenance till they attain 18 years of age. But if a wife gets divorced at the age of 25 say, she is eligible for 50 years of maintenance assuming she lives till 75 years of age.\n\nIf the husband is at fault, there are criminal laws and women use them to file cases on the husband to the extent that the supreme court has called it  \"Legal Terrorism\". But where r the criminal laws to prosecute wife if they have harassed husband? Why aren't all the laws gender neutral?\n\nIn a way, you are saying a wife should NOT be staying with an abusive husband but she should be ok to get money from him? Is that what you call equality?\nThat's exactly the survey the OP has posted about.\n\n\nAnd your first statement about finding a \"good\" and \"earning\" husband is what I am talking about. Why can't the girl earning good enough herself before and after the wedding? What is stopping her?\n\nAlso, if a guy and his family is asking for dowry, why has she to marry that good earning guy? If the girl is earning herself, then she can decide whom she wants to marry. \n\nEffectively, you are supporting my point that a girl and her family has following 3 options:\n\nOption 1- Give high dowry to high earning guy and be harassed for more dowry later\nOption 2- Select a low earning guy and live happily without being harassed for dowry\nOption 3- Don't marry and stay single\n\nIf you see, of all the 3 options, Option 1 is the worse and yet most of the girls and their families will choose that option. My point is simple - Girl and their families can't claim innocence if they knowingly married a guy who has asked for dowry\n\nOption 2 and 3 require the girl to be working as well which they will do only if they want to work\n\nIf you ask me, if a sufficient number of girls refuse to marry dowry seeker guys, then the demand for dowry will reduce over time because these dowry seeker guys will also have a choice between Dowry less marriage OR remaining unmarried",
        "I also mentioned in that reply that I believe even women should pay alimony if they earns more. Even if the roles were switched I believe the same thing should happen. If the wife was abusive to the husband and she earns more then she should pay alimony. \n\nI said it depends on the case, I don't agree with a complete ban on maintenance or a 5 year waiting period. It should be on a case to case basis, there is no one size fits all. I'm not saying that the husband should pay alimony in every case nor am I saying that alimony shouldn't be given at all.\n\nAbuse is not always visible initially, and it doesn't always start in the first year of marriage.",
        "Bro did he just say feminism=love jihad? \n\nCan you please explain me how would that work?",
        "Given the choice bw long working hours and being a homemaker i too would choose being a homemaker, but if i become a homemaker who will earn money for me? No woman would ever marry a guy who doesn't earn a single rupee. A job isn't an achievement or a privilege it's working all day for pennies so that someone else can buy a fifth bungalow.\n\nBeing a homemaker is safer and easier, Suicide Rates for men >>>> Suicide Rates for Women.",
        "And exactly this is my point... Why it has to be conditional on who earns more and who earns less? \n\nMaintenance, in India, is conditional on case by case basis atleast for the last 2 generations, i.e. last 20-40 years.\n\nI have NOT suggested a complete ban on maintenance. My only point is it cannot be lifelong\n\nPut a limit on the number of months for maintenance\n\nWhat state do you want a woman to be? Remain dependent on maintenance from husband for life OR become earning and financially independent on her own\n\n\nHere, maintenance means maintenance for wife. I am in favour of changing maintenance for children till they attain 18 years of age",
        "It really depends on the case whether to have a limit or not.",
        "Then no limit should be in the rarest of the rare cases. It should be an exception not a rule.",
        "Women don't always choose to be a homemaker. Having a career gives people freedom and autonomy, and even if the guy doesn't earn a lot he still asks wife to leave her job. I'm not saying that a guy shouldn't earn but if he and his wife are earning similar they still don't do household work and childcare. Women do want to work, not everyone wants to be a housewife. Housewives don't have as much freedom and fall victim to domestic violence and abuse more than working women. \n\nThere are women who are willing to work and earn more than their husbands but even then they are pressured to quit their jobs.\n\nSuicide rate for housewives>>> suicide rate for working women (I'm not talking about men in this, why are you bringing it up)"
    ],
    "cleaned_text": "society becoming female dominant society becoming female dominant loosing control society women society overtaken women views share perspective survey survey part gender sensitization course college invite participate exciting survey evolving dynamics society exploring thoughtprovoking question society becoming female dominant chance make voice heard contribute ongoing conversation gender equality empowerment appreciate take part survey help group project college thank link surveyhttpsformsgletmequzfrxsrhttpsformsgletmequzfrxsr ",
    "cleaned_title": "society becoming female dominant",
    "cleaned_selftext": "society becoming female dominant loosing control society women society overtaken women views share perspective survey survey part gender sensitization course college invite participate exciting survey evolving dynamics society exploring thoughtprovoking question society becoming female dominant chance make voice heard contribute ongoing conversation gender equality empowerment appreciate take part survey help group project college thank link surveyhttpsformsgletmequzfrxsrhttpsformsgletmequzfrxsr",
    "cleaned_comments": "wow lame think dominated stupidity men womengirls boys yet develop brains completely see downvotes would prove go go go exactly post rtwoxindia well although agree opinion would appreciate take look form attached aims understand rather important topic tear apart sunday everybody waiting bait lmao lol take screenshot original comment remove downvotes line think would effective yeah feel like shouldnt really take survey seriously op posts really would get meaningful responses guys getting dominated females sign lol even becoming equal men women forget becoming female dominant certain things also gotten worse past like womens unemployment dowry less women working past women paid work dowry also much common past hindu weddings involve dowry due feminism females becoming masculine hence getting trapped love jihad theory side eyeeee dowry less common even years ago didnt know also talking low workforce participation women unemployment households need second income women less motivated jobs blame working long hours little money envisioned capitalist society tiresome chore household chores way less exhausting hours manual labour sunday monday people without jobs certain laws definitely blind favour women misused end maintenance domestic violence maintenance allowed women without education income bare sustenance k month max wife k month child ensure divorced women dont struggle survive also discouraging marriage sole purpose divorce secondly filing false cases dv treated extortion ipc carry year prison sentence look stats dowry rates increased significantly women dont quit want mostly forced family husband quit job housewives likely die due suicide someone whos working women working desirable men women mostly dont want quit jobs quit pressure household chores less exhausting dont men majority men cant household chores even wife working still expect everything could also please survey httpsformsgletmequzfrxsrhttpsformsgletmequzfrxsr ever wondered less women work official number female taxpayers somewhere like one thingnotion wedding girl responsibility father wedding responsibility husband indian courts including supreme court constantly reinforce notion notion wives demand maintenance courts grant maintenance notion females family ensure get married man good salary marriage doesnt work get maintenance courts marriage works also good females say take care household work washing done washing machine maids servants cleaning cooking etc imagine notion absent would happen females also think getting job like males happens females would strive get job marriage common understanding probability giving dowry wedding working girl lesser nonworking girl goes female foeticide domestic violence reporting rape almost bad things crimes associated females india another perspective dowry like take dowry cases filed india last years atleast cases find wife alleged husband family demanded dowry wedding yet girl family still went ahead wedding like know party wants dowry still married surprised harassed party asking dowry way cases wife would alleging husband family would demanded exorbitant amount dowry luxury car bride would paid amount promise pay remaining daysmonths andor given fortuner instead mercedesaudi etc question simple didnt girl family back wedding dowry demand made expecting change heart miracle unfortunately even indian courts ask question mechanically assume girls allegations true another aspectif groom asking llcr cash time wedding asking dowry wife asking llcr maintenancealimony giving divorce court considered right shouldnt considered extortion another thing observed personally many weddings groom doesnt want accepts dowry bride family members assume groom something wrong past simply put bride family wants give dowry ask nutshell bad thingscrimes associated females todays world significantly reduced concept maintenance addressed properly ask wives get maintenance unless stayed minimum years husband stayed years without breaks get max month maintenance per year cohabitation applicable nonworking women women left jobs take care children month maintenance per year cohabitation would put pressure wife get job anyways organisations run special hiring women career breaks stopping women opt hiring programs integrate working force long run either indian judiciary allow prenuptial agreements ban maintenance altogether way females always working earning hence difficult anyone including husbands take granted females really want considered equal males first forego benefits entitlements females cant considered equal keep getting benefits give real life example google verify claims read life story neena gupta veteran actress became pregnant boyfriendfather child vivian richards asked neena gupta abort child neena gupta went ahead child raised child possible neena gupta working financially independent era around gender determination legal india advertisements used run clinics saying pay xyz amount avoid dowry future reverse situation put nonworking dependent wife similar situation wife avoid abortion husband family force womans family wants marry someone good grooms take dowry fact earn dowry take womans parents want someone money marry fine paying dowry sake im prenups maintenance marriage needed im also women paying alimony child support divorce earns men dont take dowry abusive mans family takes dowry pay maintenance doesnt want shouldnt ask dowry ask wife quit job husband abusive forces quit job cant stay years sake maintenance different shes earning outright banning cant done husband abusive know first year walk marriage find job way forcing wife leave job also considered domestic violence harassment earning walk marriage instead leaving job divorces wives abusive harassed husband arent husbands humans children marriage responsibility parents husbands lot divorces happen incompatibility husband wife maintenance lifetime put limit time period show many cases wife stayed days wedding left house got maintenance life even dont agree minimum year limit maintenance courts government cant run lifetime pension wife expense husband limit maximum number months wife eligible maintenance example children eligible maintenance till attain years age wife gets divorced age say eligible years maintenance assuming lives till years age husband fault criminal laws women use file cases husband extent supreme court called legal terrorism r criminal laws prosecute wife harassed husband arent laws gender neutral way saying wife staying abusive husband ok get money call equality thats exactly survey op posted first statement finding good earning husband talking cant girl earning good enough wedding stopping also guy family asking dowry marry good earning guy girl earning decide wants marry effectively supporting point girl family following options option give high dowry high earning guy harassed dowry later option select low earning guy live happily without harassed dowry option dont marry stay single see options option worse yet girls families choose option point simple girl families cant claim innocence knowingly married guy asked dowry option require girl working well want work ask sufficient number girls refuse marry dowry seeker guys demand dowry reduce time dowry seeker guys also choice dowry less marriage remaining unmarried also mentioned reply believe even women pay alimony earns even roles switched believe thing happen wife abusive husband earns pay alimony said depends case dont agree complete ban maintenance year waiting period case case basis one size fits im saying husband pay alimony every case saying alimony shouldnt given abuse always visible initially doesnt always start first year marriage bro say feminismlove jihad please explain would work given choice bw long working hours homemaker would choose homemaker become homemaker earn money woman would ever marry guy doesnt earn single rupee job isnt achievement privilege working day pennies someone else buy fifth bungalow homemaker safer easier suicide rates men suicide rates women exactly point conditional earns earns less maintenance india conditional case case basis atleast last generations ie last years suggested complete ban maintenance point lifelong put limit number months maintenance state want woman remain dependent maintenance husband life become earning financially independent maintenance means maintenance wife favour changing maintenance children till attain years age really depends case whether limit limit rarest rare cases exception rule women dont always choose homemaker career gives people freedom autonomy even guy doesnt earn lot still asks wife leave job im saying guy shouldnt earn wife earning similar still dont household work childcare women want work everyone wants housewife housewives dont much freedom fall victim domestic violence abuse working women women willing work earn husbands even pressured quit jobs suicide rate housewives suicide rate working women im talking men bringing",
    "light_cleaned_title": "Is the Society Becoming Female Dominant?",
    "light_cleaned_selftext": "Is the Society Becoming Female Dominant? Are we loosing control of society to the women? Is the Society Being Overtaken by Women? What are your views? Share Your Perspective in my Survey! A survey as part of the Gender Sensitization course at college. I invite you to participate in my exciting survey on the evolving dynamics of our society. I am exploring the thought-provoking question: Is the Society Becoming Female Dominant? This is your chance to make your voice heard and contribute to the ongoing conversation about gender equality and empowerment. I appreciate if you can take part in this survey and help me and my group with our project at college. Thank you Link to the Survey-[https://forms.gle/tm5EquZFrxs8566R8](https://forms.gle/tm5EquZFrxs8566R8)",
    "light_cleaned_comments": "wow... lame I think it is being dominated by stupidity from both men and women(girls and boys who are yet to develop their brains completely) See the downvotes would prove it. Go Go GO!! Exactly. You should post this on r/TwoXIndia as well Although I cannot agree with your opinion, I would appreciate if you can take a look at the form attached, it aims to understand a rather important topic. They will tear him apart. It is Sunday- everybody will be just waiting for a bait lmao lol Take a screenshot of your original comment and remove the downvotes line. I think that would be more effective. Yeah. I feel like we shouldn't really take this survey seriously until OP posts it there. He really would get meaningful responses there. You guys getting dominated by females? Where do I sign up? Lol 😂 🤣🤣 It is not even becoming equal for both men and women, forget becoming female dominant. Certain things have also gotten worse than they were in the past like women's unemployment and dowry. Less women are working now than they were in the past, only about 30% of women are doing paid work. Dowry is also much more common than it was in the past, now 80-90% of Hindu weddings involve dowry. Due to feminism , females are becoming more masculine but hence they are getting trapped in love Jihad . Its my theory . Side eyeeee Dowry is less common now than it was even 10 years ago, you just didn't know about it. Also what you are talking about is low workforce participation of Women and not Unemployment. In households where there is no need for a second income, women are less motivated to have jobs. And who can blame them, working long hours for little money as envisioned by our Capitalist Society is a tiresome chore. Household chores are way less exhausting than 8-9 hours of manual labour. What is Sunday - Monday for people without jobs Certain laws are definitely in blind favour of women and are misused to no end. Such as maintenance and Domestic Violence. Maintenance should be allowed only for women without any education or income, that too bare sustenance, 10K a month Max for wife and 10K a month for each child. To ensure divorced women don't have to struggle to survive and also discouraging marriage for the sole purpose of divorce. Secondly Filing False cases of DV should be treated as Extortion under IPC and carry a 3 year prison sentence. 😂😂 Look up some stats. Dowry rates have increased significantly. Women don't quit because they want to, they are mostly forced by their family or husband to quit their job. Housewives are more likely to die due to suicide than someone who's working. Women who are not working are more desirable to men. Women mostly don't want to quit their jobs but quit out of pressure. If household chores are less exhausting then why don't men do them? the majority of men can't do household chores and even if the wife is working they still expect her to do everything. Could you also please do the survey? [https://forms.gle/tm5EquZFrxs8566R8](https://forms.gle/tm5EquZFrxs8566R8) Have you ever wondered why only less than 20% of women work? The official number of female taxpayers is somewhere like 18-20% It is because of ONLY ONE thing/notion - \"before a wedding, a girl is the responsibility of father and after the wedding, she is the responsibility of husband\" Indian courts, including the Supreme court, constantly reinforce this notion. It is because of this notion, wives \"demand\" maintenance and courts grant the maintenance With this notion, females and their family have to ensure that they get married to a man with good salary. If marriage doesn't work, she will get maintenance from courts. If marriage works, then also all good - Females will say they will take care of household work... Where washing is done by Washing machine and they have maids or servants for cleaning, cooking etc Just imagine if this notion was absent, then what would happen. Females will also have to think about getting a job like males do. And when that happens, females would strive to get a job before marriage Now, it is a common understanding that the probability of giving dowry in the wedding of a working girl is lesser than that of the non-working girl Same goes with female foeticide, domestic violence, reporting of rape and almost all the bad things or crimes associated with females in India Another perspective on dowry is like this... Take all the dowry cases filed in India in the last 10 years.. atleast in 80% of the cases, you will find that the wife has alleged that husband and his family demanded dowry before wedding and yet the girl and her family still went ahead with the wedding. It is like i know that the other party wants dowry but still i married him and now i am \"surprised\" or \"harassed\" because the other party is asking for dowry. By the way, in all these 80% cases, the wife would be alleging that the husband and family would have demanded an exorbitant amount of dowry or some luxury car and the bride would have paid some amount with a promise to pay remaining in few days/months and/or given Fortuner instead of Mercedes/Audi etc My question is simple - why didn't the girl and her family back out of the wedding when the dowry demand was made? Were they expecting some change of heart OR some miracle? Unfortunately, not even the Indian courts ask this question. They mechanically assume that the girl's allegations are true Another aspect....if a groom is asking for 25L/50L/1Cr as cash at the time of wedding, then he is asking for dowry But if a wife is asking for 25L/50L/1Cr as maintenance/alimony for giving divorce in court, then it is considered her \"right\"? Why shouldn't it considered as extortion? Another thing which i have observed personally in many weddings is if a groom doesn't want or accepts dowry, then the bride and her family members \"assume\" that the groom has something wrong in his past. Simply put, bride and her family wants to give dowry So if you ask me, in a nutshell, all the bad things/crimes associated with females in today's world can be significantly reduced if the concept of maintenance is addressed properly If you ask me, wives should not get maintenance unless she has stayed for minimum 5 years with the husband and if she has stayed for 5 years without any breaks, then she should get max 1 month of maintenance per 1 year of cohabitation. And this is applicable for non-working women or women who left their jobs to take care of children. And this 1 month of maintenance per year of cohabitation would put pressure on the wife to get a job. Anyways, there are organisations who run special hiring for women with career breaks - what is stopping these women to opt for these hiring programs and integrate in working force again. In the long run, either the Indian Judiciary should allow prenuptial agreements or ban maintenance altogether. That way, females will always be working and earning and hence it will be difficult for anyone including the husbands to take them for granted. If Females really want to be considered equal to Males, they have to first forego all the benefits and entitlements they have as females. You can't be considered equal if you keep getting benefits I will give you a real life example - You can Google to verify my claims. Read the life story of Neena Gupta, a veteran actress. She became pregnant and her boyfriend/father of her child was Vivian Richards who asked Neena Gupta to abort the child. But Neena Gupta went ahead with the child and raised that child. This was possible only because Neena Gupta was working and was financially independent. This was in the era around 1980 when gender determination was legal in India and advertisements used to be run by clinics saying pay XYZ amount now to avoid dowry in the future Just reverse the situation and put a non-working and dependent wife in a similar situation. Can a wife avoid abortion if her husband or his family force her? The woman's family wants them to marry someone 'good' and most of those grooms take dowry. In fact the more they earn the more dowry they take. The woman's parents want someone with money to marry so they are fine paying dowry for the sake of this. I'm all for prenups but maintenance after marriage is needed. I'm also for women paying alimony or child support after divorce if she earns more and men don't take dowry or are abusive. If a man's family takes dowry then he should pay maintenance, if he doesn't want to then he shouldn't ask for dowry or ask his wife to quit her job. What if the husband is abusive and forces her to quit her job? She can't stay for 5 years for the sake of maintenance. This will be different if she's earning but outright banning it can't be done. If the husband is abusive, she will know in the first year and she can walk out of the marriage and find a job. By the way, forcing a wife to leave her job is also considered domestic violence or harassment. If she is earning, she can walk out of the marriage instead of leaving the job. And what about divorces where wives were abusive and harassed husband? Aren't husbands humans too? If there are children from marriage, then it is the responsibility of both the parents not only husbands. A lot of divorces happen because of incompatibility between husband and wife. I am against maintenance for lifetime. Put a limit on the time period. I can show many cases where wife stayed for 5 days after wedding and then left the house and got maintenance for life. Even if you don't agree with the minimum 5 year limit on maintenance, Courts and government can't run lifetime pension for the wife at the expense of husband. There has to be a limit on the maximum number of months a wife is eligible for maintenance. For example, children are eligible for maintenance till they attain 18 years of age. But if a wife gets divorced at the age of 25 say, she is eligible for 50 years of maintenance assuming she lives till 75 years of age. If the husband is at fault, there are criminal laws and women use them to file cases on the husband to the extent that the supreme court has called it \"Legal Terrorism\". But where r the criminal laws to prosecute wife if they have harassed husband? Why aren't all the laws gender neutral? In a way, you are saying a wife should NOT be staying with an abusive husband but she should be ok to get money from him? Is that what you call equality? That's exactly the survey the OP has posted about. And your first statement about finding a \"good\" and \"earning\" husband is what I am talking about. Why can't the girl earning good enough herself before and after the wedding? What is stopping her? Also, if a guy and his family is asking for dowry, why has she to marry that good earning guy? If the girl is earning herself, then she can decide whom she wants to marry. Effectively, you are supporting my point that a girl and her family has following 3 options: Option 1- Give high dowry to high earning guy and be harassed for more dowry later Option 2- Select a low earning guy and live happily without being harassed for dowry Option 3- Don't marry and stay single If you see, of all the 3 options, Option 1 is the worse and yet most of the girls and their families will choose that option. My point is simple - Girl and their families can't claim innocence if they knowingly married a guy who has asked for dowry Option 2 and 3 require the girl to be working as well which they will do only if they want to work If you ask me, if a sufficient number of girls refuse to marry dowry seeker guys, then the demand for dowry will reduce over time because these dowry seeker guys will also have a choice between Dowry less marriage OR remaining unmarried I also mentioned in that reply that I believe even women should pay alimony if they earns more. Even if the roles were switched I believe the same thing should happen. If the wife was abusive to the husband and she earns more then she should pay alimony. I said it depends on the case, I don't agree with a complete ban on maintenance or a 5 year waiting period. It should be on a case to case basis, there is no one size fits all. I'm not saying that the husband should pay alimony in every case nor am I saying that alimony shouldn't be given at all. Abuse is not always visible initially, and it doesn't always start in the first year of marriage. Bro did he just say feminism=love jihad? Can you please explain me how would that work? Given the choice bw long working hours and being a homemaker i too would choose being a homemaker, but if i become a homemaker who will earn money for me? No woman would ever marry a guy who doesn't earn a single rupee. A job isn't an achievement or a privilege it's working all day for pennies so that someone else can buy a fifth bungalow. Being a homemaker is safer and easier, Suicide Rates for men >>>> Suicide Rates for Women. And exactly this is my point... Why it has to be conditional on who earns more and who earns less? Maintenance, in India, is conditional on case by case basis atleast for the last 2 generations, i.e. last 20-40 years. I have NOT suggested a complete ban on maintenance. My only point is it cannot be lifelong Put a limit on the number of months for maintenance What state do you want a woman to be? Remain dependent on maintenance from husband for life OR become earning and financially independent on her own Here, maintenance means maintenance for wife. I am in favour of changing maintenance for children till they attain 18 years of age It really depends on the case whether to have a limit or not. Then no limit should be in the rarest of the rare cases. It should be an exception not a rule. Women don't always choose to be a homemaker. Having a career gives people freedom and autonomy, and even if the guy doesn't earn a lot he still asks wife to leave her job. I'm not saying that a guy shouldn't earn but if he and his wife are earning similar they still don't do household work and childcare. Women do want to work, not everyone wants to be a housewife. Housewives don't have as much freedom and fall victim to domestic violence and abuse more than working women. There are women who are willing to work and earn more than their husbands but even then they are pressured to quit their jobs. Suicide rate for housewives>>> suicide rate for working women (I'm not talking about men in this, why are you bringing it up)"
}