{
    "id": "jx03kq",
    "title": "Ensuring security and the protection of privacy in data centres",
    "url": "https://www.reddit.com/r/india/comments/jx03kq/ensuring_security_and_the_protection_of_privacy/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/tqy14p5v66061.png?width=1600&amp;format=png&amp;auto=webp&amp;s=5f48a982137c624653087773d564b552880a7e97\n\n### Tl;dr\n\nIFF has submitted it's comments on the Ministry of Electronics and Information Technology's [**Draft Data Centre Policy 2020**](https://www.meity.gov.in/writereaddata/files/Draft%20Data%20Centre%20Policy%20-%2003112020_v5.5.pdf). In our comments, we specified four issues that we felt the draft policy must address: firstly, that data centres must implement robust security protocols; secondly, that data centres must ensure that the digital rights of users are not violated; thirdly, firm and unambiguous regulatory oversight must provided; and lastly, that data centres should not be brought under the ambit of the Essential Services Maintenance Act, 1968 (ESMA).\n\n### Draft Data Centre Policy\n\nAs the modern indian economy moves further towards digitalisation, upgrading the country's data capacities and enabling the rapid growth of data facilities takes on vital importance. However, to ensure that this truly done in a manner that best serves the nation, it is crucial that rights of the users (i.e. citizens) be safeguarded.\n\nSeveral leaks have plagues the country in recent times. According to the Indian government, 2019 witnessed 1,05,849 cyber security incidents  in just the first five months. 2019 and 2020 (til August) saw 54 and 37 Central and state government websites hacked respectively. Leaks in Aadhar data, banking data, and credit card information have also increased. Even nuclear plants, such as the one in Kudankulam, have been shown to be vulnerable. Furthermore, as the COVID-19 pandemic driven move towards working from home proceeds further, enterprises too feel that digital infrastructure has to be upgraded to deal with new security challenges, as 66% of Indian firms have reported at least one data breach since they shifted to working from home. Given that organisations faced a cost of Rs. 14 crore on average per data breach in 2019-20, it is clear that data security processes need further tightening and regulation.\n\nAn additional factor to be considered here is Personal Data Protection Bill, 2019, as the regulation of the operations of data centres will certainly come under the ambit of this bill. The bill faced multiple criticisms both inside and outside Parliament, as certain clauses of the Bill proved to be contentious - especially since they differed from the recommendations of the Justice Srikrishna Committee - and so the bill was sent to a Standing Committee for review. The key issues in the bill included the exemptions given to the government for the processing of data, the composition of the proposed Data Protection Authority, and the non-consensual processing of data. A [**private member bill**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view) introduced by MP Dr. D Ravikumar, for example, is an alternative that addresses these issues.\n\nIn light of this, it is imperative that strict guidelines for ensuring the security and privacy of users be protected, as these will ensure that the data of swathes of citizens is safe. Additionally, a firm and strictly defined regulatory framework should be laid down, and the fundamental right to expression of data centre workers not be tampered with. Doing will so will not only ensure that the growth of India's digital infrastructure benefits citizens but also cement India's position as a global hub for digital infrastructure.\n\n### Our submissions\n\n* **Security:** The draft policy does not specify any security standards that data centres must adhere to, or may be prescribed in future by the Data Protection Authority. There is a tangible need to address this given the several big data leaks that have plagued the country recently. This is a situation exacerbated by the fact that due to the COVID-19 pandemic many companies have moved towards a work-from-home set-up, which has meant a greater degree of digitalisation and so a greater need to ensure digital security. In light of this, we feel it is important for the Policy to firmly lay down, at the very least, a broad framework for ensuring the protection of data.\n* **Privacy and digital rights:** The policy does not mention the method in which data centres will ensure they protect the digital rights of users. If it is contemplated that such issues are to be covered under the proposed Data Protection Bill, 2019, then a method for ensuring compliance with the same must be specified.\n* **Need for firm regulatory oversight:** There should be a clear and unequivocal acknowledgement within the policy for oversight by the Data Protection Authority contemplated by the impending Personal Data Protection Bill, 2019. Here ideally the primary mandate of the Inter-Ministerial Empowered Committee (along with the Data Centre Facilitation Unit) should be confined to facilitating the ease of doing business and any overlap with the Data Protection Authority should be limited.\n* **Imposition of Essential Services Maintenance Act:** While we recognise the importance of digital infrastructure for both the modern economy and modern governance, we feel that the inclusion of data centres under Essential Services Maintenance Act, 1968 (ESMA) may be a step too far. The draft polict does not provide sufficient arguments for why data centres should be considered essential. Additionally, employees’ right to freedom of expression is fundamental, and ESMA puts significant curbs on it. The Act has already faced criticism, especially for its granting of power to arrest without a warrant.\n\n[**We need your help and support in protecting your privacy and digital rights. Support us through one time donations or becoming a member with us. Donate today!**](https://internetfreedom.in/donate)\n\n[internetfreedom.in/donate](https://t.co/C0zpW5E6TK)",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 2,
    "created_utc": 1605780162,
    "convurl": "https://b.thumbs.redditmedia.com/GQqHEsXL80RKMKutoyZVHkDS2q5eoAQ21vz-RoEnBBM.jpg",
    "comments": [
        "What, no five foot thick wall this time? \n\nhttps://www.thehindu.com/news/national/aadhaar-data-safe-behind-five-feet-thick-walls-centre-tells-supreme-court/article23313608.ece"
    ],
    "cleaned_text": "ensuring security protection privacy data centres ampxb tldr iff submitted comments ministry electronics information technologys draft data centre policy httpswwwmeitygovinwritereaddatafilesdraftdatacentrepolicyvpdf comments specified four issues felt draft policy must address firstly data centres must implement robust security protocols secondly data centres must ensure digital rights users violated thirdly firm unambiguous regulatory oversight must provided lastly data centres brought ambit essential services maintenance act esma draft data centre policy modern indian economy moves towards digitalisation upgrading countrys data capacities enabling rapid growth data facilities takes vital importance however ensure truly done manner best serves nation crucial rights users ie citizens safeguarded several leaks plagues country recent times according indian government witnessed cyber security incidents first five months til august saw central state government websites hacked respectively leaks aadhar data banking data credit card information also increased even nuclear plants one kudankulam shown vulnerable furthermore covid pandemic driven move towards working home proceeds enterprises feel digital infrastructure upgraded deal new security challenges indian firms reported least one data breach since shifted working home given organisations faced cost rs crore average per data breach clear data security processes need tightening regulation additional factor considered personal data protection bill regulation operations data centres certainly come ambit bill bill faced multiple criticisms inside outside parliament certain clauses bill proved contentious especially since differed recommendations justice srikrishna committee bill sent standing committee review key issues bill included exemptions given government processing data composition proposed data protection authority nonconsensual processing data private member billhttpsdrivegooglecomfileddreqeflssokuvkvctuypeview introduced mp dr ravikumar example alternative addresses issues light imperative strict guidelines ensuring security privacy users protected ensure data swathes citizens safe additionally firm strictly defined regulatory framework laid fundamental right expression data centre workers tampered ensure growth indias digital infrastructure benefits citizens also cement indias position global hub digital infrastructure submissions security draft policy specify security standards data centres must adhere may prescribed future data protection authority tangible need address given several big data leaks plagued country recently situation exacerbated fact due covid pandemic many companies moved towards workfromhome setup meant greater degree digitalisation greater need ensure digital security light feel important policy firmly lay least broad framework ensuring protection data privacy digital rights policy mention method data centres ensure protect digital rights users contemplated issues covered proposed data protection bill method ensuring compliance must specified need firm regulatory oversight clear unequivocal acknowledgement within policy oversight data protection authority contemplated impending personal data protection bill ideally primary mandate interministerial empowered committee along data centre facilitation unit confined facilitating ease business overlap data protection authority limited imposition essential services maintenance act recognise importance digital infrastructure modern economy modern governance feel inclusion data centres essential services maintenance act esma may step far draft polict provide sufficient arguments data centres considered essential additionally employees right freedom expression fundamental esma puts significant curbs act already faced criticism especially granting power arrest without warrant need help support protecting privacy digital rights support us one time donations becoming member us donate todayhttpsinternetfreedomindonate internetfreedomindonatehttpstcoczpwetk ",
    "cleaned_title": "ensuring security protection privacy data centres",
    "cleaned_selftext": "ampxb tldr iff submitted comments ministry electronics information technologys draft data centre policy httpswwwmeitygovinwritereaddatafilesdraftdatacentrepolicyvpdf comments specified four issues felt draft policy must address firstly data centres must implement robust security protocols secondly data centres must ensure digital rights users violated thirdly firm unambiguous regulatory oversight must provided lastly data centres brought ambit essential services maintenance act esma draft data centre policy modern indian economy moves towards digitalisation upgrading countrys data capacities enabling rapid growth data facilities takes vital importance however ensure truly done manner best serves nation crucial rights users ie citizens safeguarded several leaks plagues country recent times according indian government witnessed cyber security incidents first five months til august saw central state government websites hacked respectively leaks aadhar data banking data credit card information also increased even nuclear plants one kudankulam shown vulnerable furthermore covid pandemic driven move towards working home proceeds enterprises feel digital infrastructure upgraded deal new security challenges indian firms reported least one data breach since shifted working home given organisations faced cost rs crore average per data breach clear data security processes need tightening regulation additional factor considered personal data protection bill regulation operations data centres certainly come ambit bill bill faced multiple criticisms inside outside parliament certain clauses bill proved contentious especially since differed recommendations justice srikrishna committee bill sent standing committee review key issues bill included exemptions given government processing data composition proposed data protection authority nonconsensual processing data private member billhttpsdrivegooglecomfileddreqeflssokuvkvctuypeview introduced mp dr ravikumar example alternative addresses issues light imperative strict guidelines ensuring security privacy users protected ensure data swathes citizens safe additionally firm strictly defined regulatory framework laid fundamental right expression data centre workers tampered ensure growth indias digital infrastructure benefits citizens also cement indias position global hub digital infrastructure submissions security draft policy specify security standards data centres must adhere may prescribed future data protection authority tangible need address given several big data leaks plagued country recently situation exacerbated fact due covid pandemic many companies moved towards workfromhome setup meant greater degree digitalisation greater need ensure digital security light feel important policy firmly lay least broad framework ensuring protection data privacy digital rights policy mention method data centres ensure protect digital rights users contemplated issues covered proposed data protection bill method ensuring compliance must specified need firm regulatory oversight clear unequivocal acknowledgement within policy oversight data protection authority contemplated impending personal data protection bill ideally primary mandate interministerial empowered committee along data centre facilitation unit confined facilitating ease business overlap data protection authority limited imposition essential services maintenance act recognise importance digital infrastructure modern economy modern governance feel inclusion data centres essential services maintenance act esma may step far draft polict provide sufficient arguments data centres considered essential additionally employees right freedom expression fundamental esma puts significant curbs act already faced criticism especially granting power arrest without warrant need help support protecting privacy digital rights support us one time donations becoming member us donate todayhttpsinternetfreedomindonate internetfreedomindonatehttpstcoczpwetk",
    "cleaned_comments": "five foot thick wall time",
    "light_cleaned_title": "Ensuring security and the protection of privacy in data centres",
    "light_cleaned_selftext": "### Tl;dr IFF has submitted it's comments on the Ministry of Electronics and Information Technology's [**Draft Data Centre Policy 2020**](https://www.meity.gov.in/writereaddata/files/Draft%20Data%20Centre%20Policy%20-%2003112020_v5.5.pdf). In our comments, we specified four issues that we felt the draft policy must address: firstly, that data centres must implement robust security protocols; secondly, that data centres must ensure that the digital rights of users are not violated; thirdly, firm and unambiguous regulatory oversight must provided; and lastly, that data centres should not be brought under the ambit of the Essential Services Maintenance Act, 1968 (ESMA). ### Draft Data Centre Policy As the modern indian economy moves further towards digitalisation, upgrading the country's data capacities and enabling the rapid growth of data facilities takes on vital importance. However, to ensure that this truly done in a manner that best serves the nation, it is crucial that rights of the users (i.e. citizens) be safeguarded. Several leaks have plagues the country in recent times. According to the Indian government, 2019 witnessed 1,05,849 cyber security incidents in just the first five months. 2019 and 2020 (til August) saw 54 and 37 Central and state government websites hacked respectively. Leaks in Aadhar data, banking data, and credit card information have also increased. Even nuclear plants, such as the one in Kudankulam, have been shown to be vulnerable. Furthermore, as the COVID-19 pandemic driven move towards working from home proceeds further, enterprises too feel that digital infrastructure has to be upgraded to deal with new security challenges, as 66% of Indian firms have reported at least one data breach since they shifted to working from home. Given that organisations faced a cost of Rs. 14 crore on average per data breach in 2019-20, it is clear that data security processes need further tightening and regulation. An additional factor to be considered here is Personal Data Protection Bill, 2019, as the regulation of the operations of data centres will certainly come under the ambit of this bill. The bill faced multiple criticisms both inside and outside Parliament, as certain clauses of the Bill proved to be contentious - especially since they differed from the recommendations of the Justice Srikrishna Committee - and so the bill was sent to a Standing Committee for review. The key issues in the bill included the exemptions given to the government for the processing of data, the composition of the proposed Data Protection Authority, and the non-consensual processing of data. A [**private member bill**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view) introduced by MP Dr. D Ravikumar, for example, is an alternative that addresses these issues. In light of this, it is imperative that strict guidelines for ensuring the security and privacy of users be protected, as these will ensure that the data of swathes of citizens is safe. Additionally, a firm and strictly defined regulatory framework should be laid down, and the fundamental right to expression of data centre workers not be tampered with. Doing will so will not only ensure that the growth of India's digital infrastructure benefits citizens but also cement India's position as a global hub for digital infrastructure. ### Our submissions * **Security:** The draft policy does not specify any security standards that data centres must adhere to, or may be prescribed in future by the Data Protection Authority. There is a tangible need to address this given the several big data leaks that have plagued the country recently. This is a situation exacerbated by the fact that due to the COVID-19 pandemic many companies have moved towards a work-from-home set-up, which has meant a greater degree of digitalisation and so a greater need to ensure digital security. In light of this, we feel it is important for the Policy to firmly lay down, at the very least, a broad framework for ensuring the protection of data. * **Privacy and digital rights:** The policy does not mention the method in which data centres will ensure they protect the digital rights of users. If it is contemplated that such issues are to be covered under the proposed Data Protection Bill, 2019, then a method for ensuring compliance with the same must be specified. * **Need for firm regulatory oversight:** There should be a clear and unequivocal acknowledgement within the policy for oversight by the Data Protection Authority contemplated by the impending Personal Data Protection Bill, 2019. Here ideally the primary mandate of the Inter-Ministerial Empowered Committee (along with the Data Centre Facilitation Unit) should be confined to facilitating the ease of doing business and any overlap with the Data Protection Authority should be limited. * **Imposition of Essential Services Maintenance Act:** While we recognise the importance of digital infrastructure for both the modern economy and modern governance, we feel that the inclusion of data centres under Essential Services Maintenance Act, 1968 (ESMA) may be a step too far. The draft polict does not provide sufficient arguments for why data centres should be considered essential. Additionally, employees’ right to freedom of expression is fundamental, and ESMA puts significant curbs on it. The Act has already faced criticism, especially for its granting of power to arrest without a warrant. [**We need your help and support in protecting your privacy and digital rights. Support us through one time donations or becoming a member with us. Donate today!**](https://internetfreedom.in/donate) [internetfreedom.in/donate](https://t.co/C0zpW5E6TK)",
    "light_cleaned_comments": "What, no five foot thick wall this time?"
}