{
    "id": "1cgrlrp",
    "title": "Meiteis abusing Indian Army",
    "url": "https://v.redd.it/9136d9of1mxc1",
    "selftext": "The Indian Army arrested 10 armed Meiteis militants but the Meira Paibis (Meitei women) came out in the streets and blocked the roads. \n\nLocal MLA and Minister came; negotiated with the Indian Army and was let go of the armed militants.",
    "flair": "Crime",
    "score": 25,
    "num_comments": 6,
    "created_utc": 1714480062.0,
    "convurl": "https://external-preview.redd.it/dXo4YjQ5amYxbXhjManCbGF6tp6FWEhloAlZekDMSDrfOSrxgyZdXxZgPfYJ.png?format=pjpg&auto=webp&s=6e70783a5430cf9f7aac70314c1d03b60035c26c",
    "comments": [
        "Source:\n\nhttps://twitter.com/vijaita/status/1785272734815244604?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\n\nhttps://m.youtube.com/watch?v=xthstxJhnvM\n\nhttps://www.eastmojo.com/manipur/2024/04/30/manipur-meira-paibis-clash-with-indian-army-in-bishnupur/\n\nTheir arms and weapons were handed back to the armed militia. Meiteis called these armed militia as village volunteers. Likewise, Kukis called their armed militia as village volunteers. They are all mixed.",
        "Kids shouting at guys with guns. LOL. I think the video demonstrates the Army's patience.",
        "Imagine deploying army on your own citizens.",
        "Shoot at sight",
        "Madarchut??? Damn new word",
        "Behan ke lodon ko pta nahi hai army gand mae danda kaise ghusati hai",
        "that tells more about army if they let the culprits let free.",
        "Abey gaali toh dhang se bolna sikh lo madarchodo",
        "And here is our friendly Kuki brothers. Pointing guns.\n\nhttps://x.com/MalayaKhuman/status/1790782045913768284",
        "These kids are just cussing, Kuki militants are point guns at the Indian Army/ paramilitary. And they retreated.\n\nhttps://x.com/MalayaKhuman/status/1790782045913768284/mediaViewer?currentTweet=1790782045913768284&currentTweetUser=MalayaKhuman",
        "Exactly!\n\nMeitei brothers brought Light Machine Guns in front of the CM’s bungalow and had a show down too.\n\nNo difference between Kukis and Meiteis.",
        "What's madarchut?? 😂"
    ],
    "cleaned_text": "meiteis abusing indian army indian army arrested armed meiteis militants meira paibis meitei women came streets blocked roads local mla minister came negotiated indian army let go armed militants ",
    "cleaned_title": "meiteis abusing indian army",
    "cleaned_selftext": "indian army arrested armed meiteis militants meira paibis meitei women came streets blocked roads local mla minister came negotiated indian army let go armed militants",
    "cleaned_comments": "source arms weapons handed back armed militia meiteis called armed militia village volunteers likewise kukis called armed militia village volunteers mixed kids shouting guys guns lol think video demonstrates armys patience imagine deploying army citizens shoot sight madarchut damn new word behan ke lodon ko pta nahi hai army gand mae danda kaise ghusati hai tells army let culprits let free abey gaali toh dhang se bolna sikh lo madarchodo friendly kuki brothers pointing guns kids cussing kuki militants point guns indian army paramilitary retreated exactly meitei brothers brought light machine guns front cms bungalow show difference kukis meiteis whats madarchut",
    "light_cleaned_title": "Meiteis abusing Indian Army",
    "light_cleaned_selftext": "The Indian Army arrested 10 armed Meiteis militants but the Meira Paibis (Meitei women) came out in the streets and blocked the roads. Local MLA and Minister came; negotiated with the Indian Army and was let go of the armed militants.",
    "light_cleaned_comments": "Source: Their arms and weapons were handed back to the armed militia. Meiteis called these armed militia as village volunteers. Likewise, Kukis called their armed militia as village volunteers. They are all mixed. Kids shouting at guys with guns. LOL. I think the video demonstrates the Army's patience. Imagine deploying army on your own citizens. Shoot at sight Madarchut??? Damn new word Behan ke lodon ko pta nahi hai army gand mae danda kaise ghusati hai that tells more about army if they let the culprits let free. Abey gaali toh dhang se bolna sikh lo madarchodo And here is our friendly Kuki brothers. Pointing guns. These kids are just cussing, Kuki militants are point guns at the Indian Army/ paramilitary. And they retreated. Exactly! Meitei brothers brought Light Machine Guns in front of the CM’s bungalow and had a show down too. No difference between Kukis and Meiteis. What's madarchut?? 😂"
}