{
    "id": "12yb13v",
    "title": "Tripura: Hindu vlogger attacked by BJP leaders over Eid video promoting harmony",
    "url": "https://maktoobmedia.com/latest-news/tripura-hindu-vlogger-attacked-by-bjp-leaders-over-eid-video-promoting-harmony/",
    "selftext": "Bapan Nandi, a 23-year-old vlogger from the Khupilong area of Tripura, was attacked by local leaders of the Bharatiya Janata Party (BJP) after posting a four-minute video on Eid and a song about the festival that promoted communal harmony.",
    "flair": "Crime",
    "score": 167,
    "num_comments": 19,
    "created_utc": 1682405327.0,
    "convurl": "https://external-preview.redd.it/fI9coFI9TErQyXmtzwqiHfS1MdSRYujHtNY3ZlflSbg.jpg?auto=webp&v=enabled&s=fd5c25eddd201b5c6e22cba12d9a024f07453abc",
    "comments": [
        "How dare you promote friendship, love and harmony?\n\n/s",
        "BJP hindu nationalists have tentacles in every part of India it seems and nobody wants to admit it because everyone supports BJP.",
        "[here is the stomach churning video](https://twitter.com/naman_ltt/status/1650761572761960448?t=EXKKnbX4HM8_Sh0PcEdnpg&s=19)",
        "You know im actually glad he wasn't lynched. 😔",
        "BJP \"leaders\"",
        "Sanghis showing their True Culchar as always.",
        "Idiots will still support BJP. Because of its agenda.",
        "Tripura is under BJP Control with little opposition. It is the ideal BJP State.",
        "Sad to see",
        "Admin should pin this on top.",
        "Abuse of power is becoming shameless and glorified by these jerkoffs, supposedly promoting religion. Fucking Aunty needs to get laid to find a real god",
        "https://twitter.com/dintentdata/status/1650791815115857920?s=20\n\nThe news is proven to be misleading. Just because your bias is satisfied, You shouldn't stop verifying it first.",
        ">The news is proven to be misleading.\n\nAnd where's the proof?",
        "https://twitter.com/dintentdata/status/1650791815115857920?s=20",
        "So, I'm supposed to believe a random Twitter handle over multiple news outlets? Where's the proof? I don't see any in those tweets.\n\nEdit: [It's pretty clear that this is an OPIndia level of fact checker.](https://twitter.com/dintentdata/status/1634889073826627585)",
        "Communal Harmony is against BJP business model.",
        "But who will make this sacrifice for the country?"
    ],
    "cleaned_text": "tripura hindu vlogger attacked bjp leaders eid video promoting harmony bapan nandi yearold vlogger khupilong area tripura attacked local leaders bharatiya janata party bjp posting fourminute video eid song festival promoted communal harmony ",
    "cleaned_title": "tripura hindu vlogger attacked bjp leaders eid video promoting harmony",
    "cleaned_selftext": "bapan nandi yearold vlogger khupilong area tripura attacked local leaders bharatiya janata party bjp posting fourminute video eid song festival promoted communal harmony",
    "cleaned_comments": "dare promote friendship love harmony bjp hindu nationalists tentacles every part india seems nobody wants admit everyone supports bjp stomach churning videohttpstwittercomnamanlttstatustexkknbxhmshpcednpgs know im actually glad wasnt lynched bjp leaders sanghis showing true culchar always idiots still support bjp agenda tripura bjp control little opposition ideal bjp state sad see admin pin top abuse power becoming shameless glorified jerkoffs supposedly promoting religion fucking aunty needs get laid find real god news proven misleading bias satisfied shouldnt stop verifying first news proven misleading wheres proof im supposed believe random twitter handle multiple news outlets wheres proof dont see tweets edit pretty clear opindia level fact checkerhttpstwittercomdintentdatastatus communal harmony bjp business model make sacrifice country",
    "light_cleaned_title": "Tripura: Hindu vlogger attacked by BJP leaders over Eid video promoting harmony",
    "light_cleaned_selftext": "Bapan Nandi, a 23-year-old vlogger from the Khupilong area of Tripura, was attacked by local leaders of the Bharatiya Janata Party (BJP) after posting a four-minute video on Eid and a song about the festival that promoted communal harmony.",
    "light_cleaned_comments": "How dare you promote friendship, love and harmony? /s BJP hindu nationalists have tentacles in every part of India it seems and nobody wants to admit it because everyone supports BJP. [here is the stomach churning video](https://twitter.com/naman_ltt/status/1650761572761960448?t=EXKKnbX4HM8_Sh0PcEdnpg&s=19) You know im actually glad he wasn't lynched. 😔 BJP \"leaders\" Sanghis showing their True Culchar as always. Idiots will still support BJP. Because of its agenda. Tripura is under BJP Control with little opposition. It is the ideal BJP State. Sad to see Admin should pin this on top. Abuse of power is becoming shameless and glorified by these jerkoffs, supposedly promoting religion. Fucking Aunty needs to get laid to find a real god The news is proven to be misleading. Just because your bias is satisfied, You shouldn't stop verifying it first. >The news is proven to be misleading. And where's the proof? So, I'm supposed to believe a random Twitter handle over multiple news outlets? Where's the proof? I don't see any in those tweets. Edit: [It's pretty clear that this is an OPIndia level of fact checker.](https://twitter.com/dintentdata/status/1634889073826627585) Communal Harmony is against BJP business model. But who will make this sacrifice for the country?"
}