{
    "id": "1aw00s5",
    "title": "Medical Report Busts Police Claim of 'No Pellet Guns Used' Against Farmers",
    "url": "https://www.thequint.com/news/india/farmers-protest-haryana-police-used-pellet-guns-to-target-protesting-farmers-medical-report-busts-dgps-claim#read-more",
    "selftext": "Haryana Director General of Police (DGP), Shatrujeet Kapur, while speaking to The Hindu on 18 February denied the use of pellet guns against farmers protesting at the Punjab-Haryana Khanauri Border over demand for a Minimum Support Prince (MSP) guarantee law.\n\nThe Quint, however, has exclusively accessed the medical report of a protesting farmer who was admitted to the Government Medical College and Rajendra Hospital in Patiala with pellet injuries.",
    "flair": "Law & Courts",
    "score": 301,
    "num_comments": 31,
    "created_utc": 1708481080.0,
    "convurl": "https://external-preview.redd.it/iWDnq2601mpRw-CqpkMJ3yH3ngL3-9tuA0qnsDGonzE.jpg?auto=webp&s=d67cd46d3b7a7290680c1a8a160e0a252f245238",
    "comments": [
        "From the article:\n\nThe Quint corroborated the contents of the report with a senior doctor in Delhi at a renowned private hospital. \"Going by the contents of the medical report, one can safely say that the patient sustained pellet injuries,\" said the doctor, who wanted to remain anonymous.\n\nMahesh Choudhary, media coordinator of the Kisan Majdoor Morcha, the organising body of the current protests alleged to The Quint that a large number of protesting farmers have suffered pellet injuries. \"We're still in the process of collating data on how many people have been injured by pellet guns. They (police and authorities) have turned this area on a war-zone. There are people who've lost sight in the process,\" he claimed.",
        "The Quint can reach for medical reports for pellet injury in delhi but can't reach for medical reports of sandeshkhali women or did they?",
        "Can private citizens buy pellet guns? Asking for a friend. They have annoying pigeons in their home.",
        "Yes. Air rifle with pellets. I need to buy it for the pigeons too. Mfks shit and are loud af",
        "Did you bother opening the wing website to check what they reached and what they didn't?",
        "I mean come on they are biased. We knew that from the beginning",
        "Only bjp can reach an imaginary place, which doesn't exist anywhere but in their heads.",
        "If you can't fault them then denigrate them. \n\nWe know this strategy from the beginning. Also everyone knows, who is biased and who's not. And yeah, we all know it from the beginning too.",
        "Need for the rats in my building. Thinking of making business by shooting rats. Don't worry I'll only shoot the head.",
        "What anti-social friend you have.\n\nYour \"friend\" can buy pigeon-net to keep them away. \n\nPellet gun & pellets are expensive & only Rapid Force Police can afford it. Since they have lots of taxpayers money anyway.",
        "Yes, you know a lot of things but refuse to look at reality around you. ",
        "Indeed true. \n\nLike some politicians  dont talk of manipur because that cow cant be milked, sandeshkhali seems like it cant be milked too",
        "Fuck you little shits",
        "I am saying journalists should act equally but see from your own comment that you are politicising the issue and support one side story",
        "So you are outright denying the situation, congratulations for your thoughts. I don't hope it happens to you.",
        "Look at these soros lalloos born from propaganda itself",
        "True. Sorry for politicizing directly. \n\nMaybe this is what i wanted to point out.\n\nJournalists  milk the issue that would be more beneficial for them.\n\n\n Maybe this is how they think\n\n\n1. Northeast people dying- too far, looks like chinese  , we dont care\n\n2. Sandeshkhali- definitely something happened  but farmer protests more important. Even uf mamata opponent of modi\n\n3. Farmer protests delhi-  they have seiged the city, the people are dying from hunger , people are being killed, khalistani sentiments \n\nWhy does this look like the thought process of class of politicians and journalists  are same???",
        "Why don't you share it here lets see how unbiased they are",
        "If I can respond to you in BJP terms - \"I don't need a certificate from you on my thoughts or actions\".\n\nHad to say that one.\n\nThe \"situation\" is nothing but propaganda & malignation of anyone trying to oppose BJP.\n\nThere is threat to democracy but BJP itself.",
        "Lol you're a joke bro. Like the party of rapists and thieves youre a slave to.",
        "Congratulations on admitting that you decided they didn't reach sandeshkhali without bothering to check. Own your inner prejudice. ",
        "Also everyone knows quint is a left leaning media. And yes no one has this time to denigrate them. That is the most stupid sentence in the entire humankind. I myself used to be a guy who used to watch it and even supported them with my funds until 2022. I am much of a different person now. You will eventually learn that too",
        "I'm a Data Scientist bro.\n\nAnd a better one, who understands Statistics & the inferences you can draw from your samples.\n\nThe best of all, the biggest limitation of regression is that it how can be digress you completely from progression!\n\nSo, if BJP is far right & autocratic then everything else that includes parties, own people, farmers, doctors, everything becomes one or the other form of left.\n\nIts Us vs them. Only this time, if you're not with them, they're going to make you do it - through whatever means. \nSo do everyone a favour and stop bending down to BJP, simply through the vote.\n\nBut vote through either vvpat (as a physical proof or record of vote) or ballot paper.\n\nIf the Election Commission can't secure Ballot paper votes in Bihar then how can they secure EVM votes. Do the circumstances change?",
        "*Samyukta Kisan Morcha (SKM)*\n\nPress Statement 21st February, 2024, New Delhi\n \n*SKM Strongly Protests the Brutal Police Repression and Murder of Farmer in the Punjab Border* \n\n*The Prime Minister and the Executive Not Implementing the Agreement with Farmers Responsible for the Causality and the Present Crisis* \n\n*The NCC and GB Meeting of SKM  on 22nd February 2024 Will Take Decisive Action to Advance the Struggle*  \n\nSKM strongly protested the brutal police repression and murder of a farmer Shubkaran Singh (23) of Ballo Village, Bhatinda district in the Police firing in the Haryana Punjab border. As per the report available around fifteen people have been seriously injured in the repression. This is a brutal assault on bread earners from farmer families when they were protesting only for the implementation of the written promises made by the Prime Minister.\n\nThe Prime Minister and the Executive that failed to implement the agreement with SKM signed on 9th December 2021 are solely responsible for the present crisis and the causality.    \n\nThe SKM taking the state of affairs in the Punjab border with due seriousness and the National Coordination Committee and the General Body meeting on 22nd February 2024 will discuss the situation comprehensively and take decisive action to advance the struggle.\n\nIssued by\n\n*Media Cell | Samyukta Kisan Morcha*",
        "Press Release\n\nThe Platform of Central Trade Unions issued the following statement today 21st February 2024.\n\n* Trade Unions strongly condemn the brutal killing of young farmer and injuries to dozens, \n\n* Declares to observe 23rd February as Black day all over India\n\nThe platform of Central Trade Unions express strong condemnation of the unprecedented and unprovoked force and oppression on the farmers at Khanauri and Shambhu borders by the Haryana police and Central forces today. One young life is lost, Shubhkaran Singh son of Charanjit Singh of Ballo village died of severe head injury and dozens of farmers have sustained injuries at Khanauri and Shambhu border. There have been use of cane charge, plastic bullets and tear gas shells on the farmers whose fault is that they wanted to reach the capital city of the country to demand from the government to fulfill the promises given to farmers at the time of taking back three farm laws based on which they lifted protest from Delhi borders.\nWhile congratulating the workers and farmers for successful action on 16th February a joint call given by the Samyukta Kisan Morcha (SKM)  and the platform of Central Trade Unions, independent Federations/Associations for a  nationwide mass mobilisation alongwith Industrial/Sectoral Strike and Grameen Bharat Bandh, notes that this success of the movement has made the rulers in the centre nervous. The ruling regime in the centre and their party ruling in states are conspiring to use all means to crush any opposition and are inclined to use all kinds of unlawful actions.\nWe call upon the unions of all sectors organised and unorganized  to observe 23rd February as Black day and organise nationwide protests, wear black badges, have lunch hour protests, protest dharnas, processions, torchlight/candle light protests in whatever form they can express their anguish on the ruthless approach of Central Government towards workers and farmers of the country.\nIn the meanwhile we reiterate to continue the workers-farmers unity developed in course of time and would go in solidarity  action with any future  call by the SKM to fight back this anti-worker, anti-farmer, and anti-national government which is promoting corporate communal nexus.\n\nThe platform of Central Trade Unions, independent Federations Associations\nINTUC AITUC HMS CITU AIUTUC TUCC   SEWA AICCTU LPF UTUC",
        "I wish someone cared about the middle class who pays most taxes in the country insted of doing this us vs them scenario. \n\nNo disrespect to you but I think you should step between people and learn how things actually work.\n\nAnd tell me why did we went from farmers protest to ballot paper. \n\nBihar has a different scenario,all states have it different. For me I will support BJP because of them the public life has gotten a bit easier (I have went to UP and stayed in Lucknow things are different now),\n\nYou keep bringing this US Vs Them narrative but you fail to do the same thing what your kind does,and that is to know why people let's not say bend but trust BJP. \n\nYOU FAIL TO UNDERSTAND THAT. \n\nYou bring stupid arguments like religion and thinking that the whole middle class the largest supporters OF BJP are stupid and illiterate the moment they stop supporting BJP. I was tired of all this shit that's why I had a change of heart in 2022.",
        "Do we have evidence that it was in-fact police who fired pallets? If we do then yea that’s so shitty and sad. If not then it could be planted 🤷🏻‍♀️",
        "Achha"
    ],
    "cleaned_text": "medical report busts police claim pellet guns used farmers haryana director general police dgp shatrujeet kapur speaking hindu february denied use pellet guns farmers protesting punjabharyana khanauri border demand minimum support prince msp guarantee law quint however exclusively accessed medical report protesting farmer admitted government medical college rajendra hospital patiala pellet injuries ",
    "cleaned_title": "medical report busts police claim pellet guns used farmers",
    "cleaned_selftext": "haryana director general police dgp shatrujeet kapur speaking hindu february denied use pellet guns farmers protesting punjabharyana khanauri border demand minimum support prince msp guarantee law quint however exclusively accessed medical report protesting farmer admitted government medical college rajendra hospital patiala pellet injuries",
    "cleaned_comments": "article quint corroborated contents report senior doctor delhi renowned private hospital going contents medical report one safely say patient sustained pellet injuries said doctor wanted remain anonymous mahesh choudhary media coordinator kisan majdoor morcha organising body current protests alleged quint large number protesting farmers suffered pellet injuries still process collating data many people injured pellet guns police authorities turned area warzone people whove lost sight process claimed quint reach medical reports pellet injury delhi cant reach medical reports sandeshkhali women private citizens buy pellet guns asking friend annoying pigeons home yes air rifle pellets need buy pigeons mfks shit loud af bother opening wing website check reached didnt mean come biased knew beginning bjp reach imaginary place doesnt exist anywhere heads cant fault denigrate know strategy beginning also everyone knows biased whos yeah know beginning need rats building thinking making business shooting rats dont worry ill shoot head antisocial friend friend buy pigeonnet keep away pellet gun pellets expensive rapid force police afford since lots taxpayers money anyway yes know lot things refuse look reality around indeed true like politicians dont talk manipur cow cant milked sandeshkhali seems like cant milked fuck little shits saying journalists act equally see comment politicising issue support one side story outright denying situation congratulations thoughts dont hope happens look soros lalloos born propaganda true sorry politicizing directly maybe wanted point journalists milk issue would beneficial maybe think northeast people dying far looks like chinese dont care sandeshkhali definitely something happened farmer protests important even uf mamata opponent modi farmer protests delhi seiged city people dying hunger people killed khalistani sentiments look like thought process class politicians journalists dont share lets see unbiased respond bjp terms dont need certificate thoughts actions say one situation nothing propaganda malignation anyone trying oppose bjp threat democracy bjp lol youre joke bro like party rapists thieves youre slave congratulations admitting decided didnt reach sandeshkhali without bothering check inner prejudice also everyone knows quint left leaning media yes one time denigrate stupid sentence entire humankind used guy used watch even supported funds much different person eventually learn im data scientist bro better one understands statistics inferences draw samples best biggest limitation regression digress completely progression bjp far right autocratic everything else includes parties people farmers doctors everything becomes one form left us vs time youre theyre going make whatever means everyone favour stop bending bjp simply vote vote either vvpat physical proof record vote ballot paper election commission cant secure ballot paper votes bihar secure evm votes circumstances change samyukta kisan morcha skm press statement st february new delhi skm strongly protests brutal police repression murder farmer punjab border prime minister executive implementing agreement farmers responsible causality present crisis ncc gb meeting skm nd february take decisive action advance struggle skm strongly protested brutal police repression murder farmer shubkaran singh ballo village bhatinda district police firing haryana punjab border per report available around fifteen people seriously injured repression brutal assault bread earners farmer families protesting implementation written promises made prime minister prime minister executive failed implement agreement skm signed th december solely responsible present crisis causality skm taking state affairs punjab border due seriousness national coordination committee general body meeting nd february discuss situation comprehensively take decisive action advance struggle issued media cell samyukta kisan morcha press release platform central trade unions issued following statement today st february trade unions strongly condemn brutal killing young farmer injuries dozens declares observe rd february black day india platform central trade unions express strong condemnation unprecedented unprovoked force oppression farmers khanauri shambhu borders haryana police central forces today one young life lost shubhkaran singh son charanjit singh ballo village died severe head injury dozens farmers sustained injuries khanauri shambhu border use cane charge plastic bullets tear gas shells farmers whose fault wanted reach capital city country demand government fulfill promises given farmers time taking back three farm laws based lifted protest delhi borders congratulating workers farmers successful action th february joint call given samyukta kisan morcha skm platform central trade unions independent federationsassociations nationwide mass mobilisation alongwith industrialsectoral strike grameen bharat bandh notes success movement made rulers centre nervous ruling regime centre party ruling states conspiring use means crush opposition inclined use kinds unlawful actions call upon unions sectors organised unorganized observe rd february black day organise nationwide protests wear black badges lunch hour protests protest dharnas processions torchlightcandle light protests whatever form express anguish ruthless approach central government towards workers farmers country meanwhile reiterate continue workersfarmers unity developed course time would go solidarity action future call skm fight back antiworker antifarmer antinational government promoting corporate communal nexus platform central trade unions independent federations associations intuc aituc hms citu aiutuc tucc sewa aicctu lpf utuc wish someone cared middle class pays taxes country insted us vs scenario disrespect think step people learn things actually work tell went farmers protest ballot paper bihar different scenarioall states different support bjp public life gotten bit easier went stayed lucknow things different keep bringing us vs narrative fail thing kind doesand know people lets say bend trust bjp fail understand bring stupid arguments like religion thinking whole middle class largest supporters bjp stupid illiterate moment stop supporting bjp tired shit thats change heart evidence infact police fired pallets yea thats shitty sad could planted achha",
    "light_cleaned_title": "Medical Report Busts Police Claim of 'No Pellet Guns Used' Against Farmers",
    "light_cleaned_selftext": "Haryana Director General of Police (DGP), Shatrujeet Kapur, while speaking to The Hindu on 18 February denied the use of pellet guns against farmers protesting at the Punjab-Haryana Khanauri Border over demand for a Minimum Support Prince (MSP) guarantee law. The Quint, however, has exclusively accessed the medical report of a protesting farmer who was admitted to the Government Medical College and Rajendra Hospital in Patiala with pellet injuries.",
    "light_cleaned_comments": "From the article: The Quint corroborated the contents of the report with a senior doctor in Delhi at a renowned private hospital. \"Going by the contents of the medical report, one can safely say that the patient sustained pellet injuries,\" said the doctor, who wanted to remain anonymous. Mahesh Choudhary, media coordinator of the Kisan Majdoor Morcha, the organising body of the current protests alleged to The Quint that a large number of protesting farmers have suffered pellet injuries. \"We're still in the process of collating data on how many people have been injured by pellet guns. They (police and authorities) have turned this area on a war-zone. There are people who've lost sight in the process,\" he claimed. The Quint can reach for medical reports for pellet injury in delhi but can't reach for medical reports of sandeshkhali women or did they? Can private citizens buy pellet guns? Asking for a friend. They have annoying pigeons in their home. Yes. Air rifle with pellets. I need to buy it for the pigeons too. Mfks shit and are loud af Did you bother opening the wing website to check what they reached and what they didn't? I mean come on they are biased. We knew that from the beginning Only bjp can reach an imaginary place, which doesn't exist anywhere but in their heads. If you can't fault them then denigrate them. We know this strategy from the beginning. Also everyone knows, who is biased and who's not. And yeah, we all know it from the beginning too. Need for the rats in my building. Thinking of making business by shooting rats. Don't worry I'll only shoot the head. What anti-social friend you have. Your \"friend\" can buy pigeon-net to keep them away. Pellet gun & pellets are expensive & only Rapid Force Police can afford it. Since they have lots of taxpayers money anyway. Yes, you know a lot of things but refuse to look at reality around you. Indeed true. Like some politicians dont talk of manipur because that cow cant be milked, sandeshkhali seems like it cant be milked too Fuck you little shits I am saying journalists should act equally but see from your own comment that you are politicising the issue and support one side story So you are outright denying the situation, congratulations for your thoughts. I don't hope it happens to you. Look at these soros lalloos born from propaganda itself True. Sorry for politicizing directly. Maybe this is what i wanted to point out. Journalists milk the issue that would be more beneficial for them. Maybe this is how they think 1. Northeast people dying- too far, looks like chinese , we dont care 2. Sandeshkhali- definitely something happened but farmer protests more important. Even uf mamata opponent of modi 3. Farmer protests delhi- they have seiged the city, the people are dying from hunger , people are being killed, khalistani sentiments Why does this look like the thought process of class of politicians and journalists are same??? Why don't you share it here lets see how unbiased they are If I can respond to you in BJP terms - \"I don't need a certificate from you on my thoughts or actions\". Had to say that one. The \"situation\" is nothing but propaganda & malignation of anyone trying to oppose BJP. There is threat to democracy but BJP itself. Lol you're a joke bro. Like the party of rapists and thieves youre a slave to. Congratulations on admitting that you decided they didn't reach sandeshkhali without bothering to check. Own your inner prejudice. Also everyone knows quint is a left leaning media. And yes no one has this time to denigrate them. That is the most stupid sentence in the entire humankind. I myself used to be a guy who used to watch it and even supported them with my funds until 2022. I am much of a different person now. You will eventually learn that too I'm a Data Scientist bro. And a better one, who understands Statistics & the inferences you can draw from your samples. The best of all, the biggest limitation of regression is that it how can be digress you completely from progression! So, if BJP is far right & autocratic then everything else that includes parties, own people, farmers, doctors, everything becomes one or the other form of left. Its Us vs them. Only this time, if you're not with them, they're going to make you do it - through whatever means. So do everyone a favour and stop bending down to BJP, simply through the vote. But vote through either vvpat (as a physical proof or record of vote) or ballot paper. If the Election Commission can't secure Ballot paper votes in Bihar then how can they secure EVM votes. Do the circumstances change? *Samyukta Kisan Morcha (SKM)* Press Statement 21st February, 2024, New Delhi *SKM Strongly Protests the Brutal Police Repression and Murder of Farmer in the Punjab Border* *The Prime Minister and the Executive Not Implementing the Agreement with Farmers Responsible for the Causality and the Present Crisis* *The NCC and GB Meeting of SKM on 22nd February 2024 Will Take Decisive Action to Advance the Struggle* SKM strongly protested the brutal police repression and murder of a farmer Shubkaran Singh (23) of Ballo Village, Bhatinda district in the Police firing in the Haryana Punjab border. As per the report available around fifteen people have been seriously injured in the repression. This is a brutal assault on bread earners from farmer families when they were protesting only for the implementation of the written promises made by the Prime Minister. The Prime Minister and the Executive that failed to implement the agreement with SKM signed on 9th December 2021 are solely responsible for the present crisis and the causality. The SKM taking the state of affairs in the Punjab border with due seriousness and the National Coordination Committee and the General Body meeting on 22nd February 2024 will discuss the situation comprehensively and take decisive action to advance the struggle. Issued by *Media Cell | Samyukta Kisan Morcha* Press Release The Platform of Central Trade Unions issued the following statement today 21st February 2024. * Trade Unions strongly condemn the brutal killing of young farmer and injuries to dozens, * Declares to observe 23rd February as Black day all over India The platform of Central Trade Unions express strong condemnation of the unprecedented and unprovoked force and oppression on the farmers at Khanauri and Shambhu borders by the Haryana police and Central forces today. One young life is lost, Shubhkaran Singh son of Charanjit Singh of Ballo village died of severe head injury and dozens of farmers have sustained injuries at Khanauri and Shambhu border. There have been use of cane charge, plastic bullets and tear gas shells on the farmers whose fault is that they wanted to reach the capital city of the country to demand from the government to fulfill the promises given to farmers at the time of taking back three farm laws based on which they lifted protest from Delhi borders. While congratulating the workers and farmers for successful action on 16th February a joint call given by the Samyukta Kisan Morcha (SKM) and the platform of Central Trade Unions, independent Federations/Associations for a nationwide mass mobilisation alongwith Industrial/Sectoral Strike and Grameen Bharat Bandh, notes that this success of the movement has made the rulers in the centre nervous. The ruling regime in the centre and their party ruling in states are conspiring to use all means to crush any opposition and are inclined to use all kinds of unlawful actions. We call upon the unions of all sectors organised and unorganized to observe 23rd February as Black day and organise nationwide protests, wear black badges, have lunch hour protests, protest dharnas, processions, torchlight/candle light protests in whatever form they can express their anguish on the ruthless approach of Central Government towards workers and farmers of the country. In the meanwhile we reiterate to continue the workers-farmers unity developed in course of time and would go in solidarity action with any future call by the SKM to fight back this anti-worker, anti-farmer, and anti-national government which is promoting corporate communal nexus. The platform of Central Trade Unions, independent Federations Associations INTUC AITUC HMS CITU AIUTUC TUCC SEWA AICCTU LPF UTUC I wish someone cared about the middle class who pays most taxes in the country insted of doing this us vs them scenario. No disrespect to you but I think you should step between people and learn how things actually work. And tell me why did we went from farmers protest to ballot paper. Bihar has a different scenario,all states have it different. For me I will support BJP because of them the public life has gotten a bit easier (I have went to UP and stayed in Lucknow things are different now), You keep bringing this US Vs Them narrative but you fail to do the same thing what your kind does,and that is to know why people let's not say bend but trust BJP. YOU FAIL TO UNDERSTAND THAT. You bring stupid arguments like religion and thinking that the whole middle class the largest supporters OF BJP are stupid and illiterate the moment they stop supporting BJP. I was tired of all this shit that's why I had a change of heart in 2022. Do we have evidence that it was in-fact police who fired pallets? If we do then yea that’s so shitty and sad. If not then it could be planted 🤷🏻‍♀️ Achha"
}