{
    "id": "145s63n",
    "title": "Ajio scam. Don't order from there.",
    "url": "https://www.reddit.com/r/india/comments/145s63n/ajio_scam_dont_order_from_there/",
    "selftext": "My friend ordered Aquazzura heels on Ajio. They cost an arm and a leg. Ajio delivered fake Aquazzura heels without any authenticity certificate/tags, and refuse to accept the return because there are no tags. Their customer support team is not helpful, and they aren't issuing a refund.\n\nThis is not a new thing. My friend found out around 50 different complaints against Ajio on twitter, just from the past 10 days. She has also tweeted the same.\n\nhttps://twitter.com/wahiladkiyaar/status/1667386306337591297\n\nPathetic experience from a Reliance owned brand.",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 7,
    "created_utc": 1686377188.0,
    "convurl": "https://external-preview.redd.it/FtB-DhUK0-JIcfXNmlVhjiUJyLzh9lamj-ytiYeRBoA.jpg?auto=webp&v=enabled&s=7bfec2481de3c6baf51db72bac542f24c55d813e",
    "comments": [
        "Ajio is a marketplace. You need to be careful who you buy it from.",
        "Damn!!! And here I had my cart full of things I wish I could afford. Didn't know they could be fakes.",
        "Ajio customer support is one of the worst. It feels like I'm talking to a mentally retarded bot.",
        "I ordered kurta pajama from them, they literally sent old newspaper, I wasn't at home so my brother accepted it...I made unboxing video and fought for a month to get a refund insisting to file a case with consumer forum.",
        "Ajio's lame UI is enough for me to understand they have knock-offs. Same with Nykaafashion.",
        "Hey! I also received a product with no tag. And I don’t think delivery guy would accept the return without tag. Did your issue get resolved?",
        "I ordered a co ord set from Ajio recently. Apparently it is a non returnable item (written in very small words- not even readable). The product quality is as good as a handkerchief. The sizing is pathetic and now Ajio is not willing to accept return. Brand name is Nomad. Did not expect from Ajio \n\nAnybody else face this issue? How can I reach out to consumer forum? Also be careful while ordering",
        "Oh my god. I never had such experiences but I am so scared reading all your experiences "
    ],
    "cleaned_text": "ajio scam dont order friend ordered aquazzura heels ajio cost arm leg ajio delivered fake aquazzura heels without authenticity certificatetags refuse accept return tags customer support team helpful arent issuing refund new thing friend found around different complaints ajio twitter past days also tweeted pathetic experience reliance owned brand ",
    "cleaned_title": "ajio scam dont order",
    "cleaned_selftext": "friend ordered aquazzura heels ajio cost arm leg ajio delivered fake aquazzura heels without authenticity certificatetags refuse accept return tags customer support team helpful arent issuing refund new thing friend found around different complaints ajio twitter past days also tweeted pathetic experience reliance owned brand",
    "cleaned_comments": "ajio marketplace need careful buy damn cart full things wish could afford didnt know could fakes ajio customer support one worst feels like im talking mentally retarded bot ordered kurta pajama literally sent old newspaper wasnt home brother accepted iti made unboxing video fought month get refund insisting file case consumer forum ajios lame ui enough understand knockoffs nykaafashion hey also received product tag dont think delivery guy would accept return without tag issue get resolved ordered co ord set ajio recently apparently non returnable item written small words even readable product quality good handkerchief sizing pathetic ajio willing accept return brand name nomad expect ajio anybody else face issue reach consumer forum also careful ordering oh god never experiences scared reading experiences",
    "light_cleaned_title": "Ajio scam. Don't order from there.",
    "light_cleaned_selftext": "My friend ordered Aquazzura heels on Ajio. They cost an arm and a leg. Ajio delivered fake Aquazzura heels without any authenticity certificate/tags, and refuse to accept the return because there are no tags. Their customer support team is not helpful, and they aren't issuing a refund. This is not a new thing. My friend found out around 50 different complaints against Ajio on twitter, just from the past 10 days. She has also tweeted the same. Pathetic experience from a Reliance owned brand.",
    "light_cleaned_comments": "Ajio is a marketplace. You need to be careful who you buy it from. Damn!!! And here I had my cart full of things I wish I could afford. Didn't know they could be fakes. Ajio customer support is one of the worst. It feels like I'm talking to a mentally retarded bot. I ordered kurta pajama from them, they literally sent old newspaper, I wasn't at home so my brother accepted it...I made unboxing video and fought for a month to get a refund insisting to file a case with consumer forum. Ajio's lame UI is enough for me to understand they have knock-offs. Same with Nykaafashion. Hey! I also received a product with no tag. And I don’t think delivery guy would accept the return without tag. Did your issue get resolved? I ordered a co ord set from Ajio recently. Apparently it is a non returnable item (written in very small words- not even readable). The product quality is as good as a handkerchief. The sizing is pathetic and now Ajio is not willing to accept return. Brand name is Nomad. Did not expect from Ajio Anybody else face this issue? How can I reach out to consumer forum? Also be careful while ordering Oh my god. I never had such experiences but I am so scared reading all your experiences"
}