{
    "id": "1djq2my",
    "title": "Education Ministry orders cancellation of UGC-NET",
    "url": "https://www.thehindu.com/education/education-ministry-orders-cancellation-of-ugc-net/article68309323.ece",
    "selftext": "Exam happened yesterday. ",
    "flair": "Crime",
    "score": 48,
    "num_comments": 11,
    "created_utc": 1718821164.0,
    "convurl": "https://external-preview.redd.it/NWAM1FHrHXI6tkIB9HsbGYZl89Oi5EvtFID-lgJ4RWQ.jpg?auto=webp&s=f625811fc8d923496333237cc0239c6377268975",
    "comments": [
        "oh my god",
        "Knew this. Yesterday I was going to post about my hunch of some problems with the exam. I am still baffled by their decision to conduct exams on OMR instead of computer-based which is going on for so long. I mean why would you regress.\n\n  \nThen yesterday many weird things happened in exam. They didn't collect anyone's admit card, again a first. Instructions on admit card ask you to put your thumb print and bring it, still they just said we don't need it. At this point it's not incompetence but malevolence and corruption. Modi and co have eaten every single institute in govt like termites.",
        "Omggg I had the same hunch. My mother and I were discussing this day before yesterday. I mean why would you go back to OMR. The whole experience seemed so weird and fishy this time.",
        "There was a telegram screenshot saying that solutions are available for ₹10,000",
        "NTA had one job, just one.",
        "They didn't take admit cards during CUET PG in my centre as well. I always thought they just forgot but now-",
        "Now they have two.",
        "Yeah, it's not forgetting. When students asked during NET exam they just said we don't need it. Now the point is why are they asking us to bring it with thumb print and all.",
        "Also they are not giving carbon copy of OMR which i have never seen in my life. It just seems like they are doing it so they can fudge numbers and all."
    ],
    "cleaned_text": "education ministry orders cancellation ugcnet exam happened yesterday ",
    "cleaned_title": "education ministry orders cancellation ugcnet",
    "cleaned_selftext": "exam happened yesterday",
    "cleaned_comments": "oh god knew yesterday going post hunch problems exam still baffled decision conduct exams omr instead computerbased going long mean would regress yesterday many weird things happened exam didnt collect anyones admit card first instructions admit card ask put thumb print bring still said dont need point incompetence malevolence corruption modi co eaten every single institute govt like termites omggg hunch mother discussing day yesterday mean would go back omr whole experience seemed weird fishy time telegram screenshot saying solutions available nta one job one didnt take admit cards cuet pg centre well always thought forgot two yeah forgetting students asked net exam said dont need point asking us bring thumb print also giving carbon copy omr never seen life seems like fudge numbers",
    "light_cleaned_title": "Education Ministry orders cancellation of UGC-NET",
    "light_cleaned_selftext": "Exam happened yesterday.",
    "light_cleaned_comments": "oh my god Knew this. Yesterday I was going to post about my hunch of some problems with the exam. I am still baffled by their decision to conduct exams on OMR instead of computer-based which is going on for so long. I mean why would you regress. Then yesterday many weird things happened in exam. They didn't collect anyone's admit card, again a first. Instructions on admit card ask you to put your thumb print and bring it, still they just said we don't need it. At this point it's not incompetence but malevolence and corruption. Modi and co have eaten every single institute in govt like termites. Omggg I had the same hunch. My mother and I were discussing this day before yesterday. I mean why would you go back to OMR. The whole experience seemed so weird and fishy this time. There was a telegram screenshot saying that solutions are available for ₹10,000 NTA had one job, just one. They didn't take admit cards during CUET PG in my centre as well. I always thought they just forgot but now- Now they have two. Yeah, it's not forgetting. When students asked during NET exam they just said we don't need it. Now the point is why are they asking us to bring it with thumb print and all. Also they are not giving carbon copy of OMR which i have never seen in my life. It just seems like they are doing it so they can fudge numbers and all."
}