{
    "id": "vk3pof",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/vk3pof/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 15,
    "num_comments": 13,
    "created_utc": 1656120609,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Just saw the film Ludo. Enjoyed those 2hrs entirely. Haven't seen a better Hindi movie in recent memory.",
        "Started Love, Death &amp; Robots. Highly recommend it if you're into the absurd and sci-fi.",
        "Huge fan of the show. S3 was really good. This show helps partially fill my black mirror tv series cravings.",
        "Currently at season 1, getting there, will binge this weekend.\n\nI love black mirror dude! I'm just waiting for my brain to forget the show somehow so I watch it again lol.",
        "watching the boys s03 and the show is amazing. karl urban and tony star has done phenomenal jobs with their acting but i miss aya cash on the show tho. after a bit of rusty s02 this season picked on very amazing actually. totally recommend.",
        "Nice, enjoy the ride!\nHaha, don't we all wish the same. Also, if you read books, you can try Exhalation by Ted Chiang. It's a set of short sci-fi stories and guaranteed BM vibes.",
        "**For All Mankind** is an amazing show, if you like space sci-fi drama like Apollo 13 then you should definitely give this show a try.",
        "I'm not much of reader. But will check it out since you mention it's short. Thanks.",
        "~Greta gerwig's Little women (4.7/5)[ life story of four ambitious women living in the same household] \n\nand ladybird (3.6/5) [story of a 17 year old young women from a small place trying to have the best highschool experience and also trying to get into a College in a big city]\n\n\n~ Call me by your name (4.5/5) [ love story , discovering their emotions and seperation]\n\n\n~ Maid (4.5/5) [Netflix webseries about a single mother trying to make a better future for herself and her child]\n\n\n~ 7 days (3.5/5) [ story of two indian American individuals whose respective parents set them up for an arranged marriage]\n\n~ Abbott elementary (4.6/5) [ tv show involving the story of a group of teachers of an elementary school and their day to day struggles in school and their personal lives, comedy]\n\n~ Heartstopper (4/5) [ Netflix webseries cute high school love story]\n\n\n~ young royals (4/5) [ Netflix webseries love story b/w a commoner and a royal person going to the same school and their day to day struggles]",
        "ZODIAC!",
        "Latest episode was kick-ass! The look on HL was so satisfying to watch.",
        "It blew me away, i absolutely fell in love with this show. Jibaro and sonny's edge are some of my personal favourite.",
        "Gullak series on Sony LIV..."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "saw film ludo enjoyed hrs entirely havent seen better hindi movie recent memory started love death amp robots highly recommend youre absurd scifi huge fan show really good show helps partially fill black mirror tv series cravings currently season getting binge weekend love black mirror dude im waiting brain forget show somehow watch lol watching boys show amazing karl urban tony star done phenomenal jobs acting miss aya cash show tho bit rusty season picked amazing actually totally recommend nice enjoy ride haha dont wish also read books try exhalation ted chiang set short scifi stories guaranteed bm vibes mankind amazing show like space scifi drama like apollo definitely give show try im much reader check since mention short thanks greta gerwigs little women life story four ambitious women living household ladybird story year old young women small place trying best highschool experience also trying get college big city call name love story discovering emotions seperation maid netflix webseries single mother trying make better future child days story two indian american individuals whose respective parents set arranged marriage abbott elementary tv show involving story group teachers elementary school day day struggles school personal lives comedy heartstopper netflix webseries cute high school love story young royals netflix webseries love story bw commoner royal person going school day day struggles zodiac latest episode kickass look hl satisfying watch blew away absolutely fell love show jibaro sonnys edge personal favourite gullak series sony liv",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Just saw the film Ludo. Enjoyed those 2hrs entirely. Haven't seen a better Hindi movie in recent memory. Started Love, Death &amp; Robots. Highly recommend it if you're into the absurd and sci-fi. Huge fan of the show. S3 was really good. This show helps partially fill my black mirror tv series cravings. Currently at season 1, getting there, will binge this weekend. I love black mirror dude! I'm just waiting for my brain to forget the show somehow so I watch it again lol. watching the boys s03 and the show is amazing. karl urban and tony star has done phenomenal jobs with their acting but i miss aya cash on the show tho. after a bit of rusty s02 this season picked on very amazing actually. totally recommend. Nice, enjoy the ride! Haha, don't we all wish the same. Also, if you read books, you can try Exhalation by Ted Chiang. It's a set of short sci-fi stories and guaranteed BM vibes. **For All Mankind** is an amazing show, if you like space sci-fi drama like Apollo 13 then you should definitely give this show a try. I'm not much of reader. But will check it out since you mention it's short. Thanks. ~Greta gerwig's Little women (4.7/5)[ life story of four ambitious women living in the same household] and ladybird (3.6/5) [story of a 17 year old young women from a small place trying to have the best highschool experience and also trying to get into a College in a big city] ~ Call me by your name (4.5/5) [ love story , discovering their emotions and seperation] ~ Maid (4.5/5) [Netflix webseries about a single mother trying to make a better future for herself and her child] ~ 7 days (3.5/5) [ story of two indian American individuals whose respective parents set them up for an arranged marriage] ~ Abbott elementary (4.6/5) [ tv show involving the story of a group of teachers of an elementary school and their day to day struggles in school and their personal lives, comedy] ~ Heartstopper (4/5) [ Netflix webseries cute high school love story] ~ young royals (4/5) [ Netflix webseries love story b/w a commoner and a royal person going to the same school and their day to day struggles] ZODIAC! Latest episode was kick-ass! The look on HL was so satisfying to watch. It blew me away, i absolutely fell in love with this show. Jibaro and sonny's edge are some of my personal favourite. Gullak series on Sony LIV..."
}