{
    "id": "1gh0pn5",
    "title": "Release Viability Gap Funding to Vizhinjam port as grant, not loan, Kerala Chief Minister requests Centre ",
    "url": "https://www.thehindubusinessline.com/economy/logistics/release-viability-gap-funding-to-vizhinjam-port-as-grant-not-loan-kerala-chief-minister-requests-centre/article68818591.ece",
    "selftext": "It’s disappointing how the central government treats states differently based on politics. The Vizhinjam Port project is vital for the economy and could help save foreign currency reserves by boosting trade. Yet, support seems more about political views than national interest.",
    "flair": "Policy/Economy",
    "score": 40,
    "num_comments": 2,
    "created_utc": 1730449905.0,
    "convurl": "https://external-preview.redd.it/wJajJ0WwcIFYHZLUKONjFk9UoYJvGBg4q8wG-gWs2vg.jpg?auto=webp&s=6702babf74933af4eecc29ea468ebd27cbb13401",
    "comments": [
        "Pulling shit like that and get surprised when hostility occurs about staying together",
        "Funnily enough the example Kerala is giving of another port is in Tamil Nadu, where Modi govt. gave grant. Seems like they have more of working relationship with DMK."
    ],
    "cleaned_text": "release viability gap funding vizhinjam port grant loan kerala chief minister requests centre disappointing central government treats states differently based politics vizhinjam port project vital economy could help save foreign currency reserves boosting trade yet support seems political views national interest ",
    "cleaned_title": "release viability gap funding vizhinjam port grant loan kerala chief minister requests centre",
    "cleaned_selftext": "disappointing central government treats states differently based politics vizhinjam port project vital economy could help save foreign currency reserves boosting trade yet support seems political views national interest",
    "cleaned_comments": "pulling shit like get surprised hostility occurs staying together funnily enough example kerala giving another port tamil nadu modi govt gave grant seems like working relationship dmk",
    "light_cleaned_title": "Release Viability Gap Funding to Vizhinjam port as grant, not loan, Kerala Chief Minister requests Centre",
    "light_cleaned_selftext": "It’s disappointing how the central government treats states differently based on politics. The Vizhinjam Port project is vital for the economy and could help save foreign currency reserves by boosting trade. Yet, support seems more about political views than national interest.",
    "light_cleaned_comments": "Pulling shit like that and get surprised when hostility occurs about staying together Funnily enough the example Kerala is giving of another port is in Tamil Nadu, where Modi govt. gave grant. Seems like they have more of working relationship with DMK."
}