{
    "id": "1dub22n",
    "title": "Delhi HC tells X to comply with directive to remove Congress leaders’ tweets against Rajat Sharma",
    "url": "https://bestmediainfo.com/mediainfo/mediainfo-digital/delhi-hc-tells-x-to-comply-with-directive-to-remove-congress-leaders-tweets-against-rajat-sharma-4792290",
    "selftext": "Just wow. ",
    "flair": "Law & Courts",
    "score": 22,
    "num_comments": 4,
    "created_utc": 1720002551.0,
    "convurl": "https://external-preview.redd.it/O_oYRW8UPj4UnIqK44dRp2eYdn4KR5DZbl4b7HxHRPs.jpg?auto=webp&s=879910f537acfc056b6b40ab1cd780d2e71cc31c",
    "comments": [
        "I am curious, what can the HC or Indian Judiciary do in case X refuses to comply with their directives? I mean, it's a multi-billion dollar company. Would they summon Elon Musk? Does he even fall under their jurisdiction? Genuinely curious.",
        "the dictator passed a law last time that big media companies need to have a indian representative in india. whenever the media company doesnt listen, they just arrest one of the Indian representatives",
        "Yeah maximum they can suspend services of twitter from India."
    ],
    "cleaned_text": "delhi hc tells x comply directive remove congress leaders tweets rajat sharma wow ",
    "cleaned_title": "delhi hc tells x comply directive remove congress leaders tweets rajat sharma",
    "cleaned_selftext": "wow",
    "cleaned_comments": "curious hc indian judiciary case x refuses comply directives mean multibillion dollar company would summon elon musk even fall jurisdiction genuinely curious dictator passed law last time big media companies need indian representative india whenever media company doesnt listen arrest one indian representatives yeah maximum suspend services twitter india",
    "light_cleaned_title": "Delhi HC tells X to comply with directive to remove Congress leaders’ tweets against Rajat Sharma",
    "light_cleaned_selftext": "Just wow.",
    "light_cleaned_comments": "I am curious, what can the HC or Indian Judiciary do in case X refuses to comply with their directives? I mean, it's a multi-billion dollar company. Would they summon Elon Musk? Does he even fall under their jurisdiction? Genuinely curious. the dictator passed a law last time that big media companies need to have a indian representative in india. whenever the media company doesnt listen, they just arrest one of the Indian representatives Yeah maximum they can suspend services of twitter from India."
}