{
    "id": "1hj6p0l",
    "title": "New GST rates for popcorn | 5% for ready-to-eat, 12% for pre-packaged, 18% for caramel, say sources - CNBC TV18",
    "url": "https://www.cnbctv18.com/economy/gst-council-meet-new-tax-rates-popcorn-expensive-up-to-18-pc-caramel-salted-19527780.htm",
    "selftext": "Time to tax all other popcorn flavours at 28% in the next GST meeting.",
    "flair": "Policy/Economy",
    "score": 193,
    "num_comments": 43,
    "created_utc": 1734774559.0,
    "convurl": "https://external-preview.redd.it/lp7XgxnWZAkLpnME5IA03x1tf7UE_bw9cra3yhZlTYg.jpg?auto=webp&s=f4e66e467f6a889eb8f9c48e404dd834b720fb49",
    "comments": [
        "Rare W, screw caramel popcorn.",
        "GST will make corn cry and pop.",
        "So these guys sat in a meeting.. Tasted a variety of pop corn to see which one tasted more expensive and which one is for the masses?",
        "Simplifying the taxes.\nSoon it will be palm oil based ice cream will be 5% but real milk ice cream will be 18%.",
        "This deserves applause! In a time of great economic concern with slowing gdp, high inflation, high unemployment, and falling rupee, it’s heartening to see the government tackle the problem head first and come up with these amazing measures /s \n\n( P.S can’t wait for the WhatsApp forwards explaining how this is a masterstroke )",
        "Please give me whatever kind drugs they are on. Please!!!",
        "Coming soon, temple darshan is taxed at 18% for regular pooja and 25% for special pooja.",
        "They have too much time on their hands",
        "Tax on each chemo meds are around 2,000. Should be glad tax is not increased as it is a rich man disease or something.",
        "Truly!",
        "Thank you Modi ji",
        "Nirmala tai hai lost her mind completely, next move is to tax breathing air",
        "That would be great. Commercialization of temples is gross.",
        "Man what clownery lol. Just follow any western country and make a standard sales tax on all goods instead of nitpicking every item on a case by case basis. This takes so much time and manpower away. It puts more burden on businesses to juggle so many products with different taxes.",
        "Matlab PVR wali abh 500₹ touch karegi?",
        "💯",
        "https://preview.redd.it/xeaw9e8lo88e1.jpeg?width=1080&format=pjpg&auto=webp&s=edecdd19db193515a1d8e46147589d15fb3bf9bc\n\nHahah.... Even a mobile keyboard is not allowing 🙏🏽 Thank you 😊",
        "Caramel = western man's sweet hence 18 percent like cake... You might say it's mithai and should be 5 percent... But no, anything which sounds western will get 18 percent...\nNirmala tai has cctv cameras on sweet shops to see if gulab jamun syrup becomes too thick and caramel like, slight over hearing and bhaaaM you get hut with 18 percent",
        "More like this;\n\nMinister 1 - This popcorn is too good. What's the flavour? \n\nOthers - Carmels... Caramela... Carumal....\n\nMinister 1 - Got it. Foreign stuff for reach people, you bhikharis can't even pronounce it. 18% GST!",
        "Coming soon - popcorn that's served fresh - 18% GST. Popcorn that was made 3 weeks ago and infested with insects - 5% GST.",
        "PVR offers mixed popcorn too. How it will be charged? Will we count individual kernels?",
        "The entire point is license raj",
        "What will happen if you mix caramel and salted?",
        "That drug will be taxed at 35%",
        "You see how caramel is an imported substance so by taxing it higher the Govt is pushing people to consume desh ka namak wala popcorn which will keep our wealth within the country. \nThis will help us beat china as they are the 90% exporters of caramel. \nEat desh ka namak wala popcorn and become aatmanirbhar. \n\n\n**I tried**",
        "As with BJP, that’s what get",
        "Which is what D Srinivasan was stressing about.\n\nhttps://timesofindia.indiatimes.com/india/bjp-tn-chief-annamalai-reacts-after-video-of-bizmans-apology-to-fm-sitharaman-over-cream-roll-question-goes-viral/amp_articleshow/113319121.cms",
        "Popcorn is junk food so by taxing it at 18% they are encouraging you to eat healthy food and also Carmel is sweet which is bad for teeth and you have to dentist, by making it taxed at 18%, they are saving your money what a master stroke /s",
        "Not sure why people are so up in arms against this. Caramel popcorn has higher GST because it has high sugar content, just like carbonated drinks. The idea is to discourage people from consuming high sugar content foods. If you think caramel popcorn is too expensive because of this, then good - the policy is working.\n\nIt is an accepted public health driven policy in many parts of the developed world to levy higher taxes on food products with higher sugar content. Diabetes is a massive drain on any nation’s resources.",
        "I almost never go to movies and if I do , I don't purchase anything in intervals. As long as we don't purchase from them and demand low tax or no tax , they will reverse their decision",
        "😂😂😂",
        "Mai itna Caramel popcorn 🍿 nahi khatiji",
        "Air purifiers are already at 28%",
        "They don’t care, deep breath 18%, light breath 12%, holding breath 5%",
        "More Indians eat laddoo and jalebi than caramel popcorn. What's the GST on those?",
        "Popcorn salt march - India 2024 colourized",
        "make it opposite it will be good for health.",
        "caramelise popcorn at home 6% tax saved.",
        "Jaldi jaldi alag condom flavour ke liye alag tax hoga",
        "Caramel se kya dushmani hai bhai!",
        "They make these laws to screw citizens \r\n\r\nThis gives licence to government department to harass citizens.",
        "What dirt does she have over our PM and others that keeps them from firing her already?",
        "Baby mujhe toh strawberry chahiye tha.\nHaa baby, aaj chat masala flavor SE kaam chala do na, gst ke paise nahi hai"
    ],
    "cleaned_text": "new gst rates popcorn readytoeat prepackaged caramel say sources cnbc tv time tax popcorn flavours next gst meeting ",
    "cleaned_title": "new gst rates popcorn readytoeat prepackaged caramel say sources cnbc tv",
    "cleaned_selftext": "time tax popcorn flavours next gst meeting",
    "cleaned_comments": "rare w screw caramel popcorn gst make corn cry pop guys sat meeting tasted variety pop corn see one tasted expensive one masses simplifying taxes soon palm oil based ice cream real milk ice cream deserves applause time great economic concern slowing gdp high inflation high unemployment falling rupee heartening see government tackle problem head first come amazing measures ps cant wait whatsapp forwards explaining masterstroke please give whatever kind drugs please coming soon temple darshan taxed regular pooja special pooja much time hands tax chemo meds around glad tax increased rich man disease something truly thank modi ji nirmala tai hai lost mind completely next move tax breathing air would great commercialization temples gross man clownery lol follow western country make standard sales tax goods instead nitpicking every item case case basis takes much time manpower away puts burden businesses juggle many products different taxes matlab pvr wali abh touch karegi hahah even mobile keyboard allowing thank caramel western mans sweet hence percent like cake might say mithai percent anything sounds western get percent nirmala tai cctv cameras sweet shops see gulab jamun syrup becomes thick caramel like slight hearing bhaaam get hut percent like minister popcorn good whats flavour others carmels caramela carumal minister got foreign stuff reach people bhikharis cant even pronounce gst coming soon popcorn thats served fresh gst popcorn made weeks ago infested insects gst pvr offers mixed popcorn charged count individual kernels entire point license raj happen mix caramel salted drug taxed see caramel imported substance taxing higher govt pushing people consume desh ka namak wala popcorn keep wealth within country help us beat china exporters caramel eat desh ka namak wala popcorn become aatmanirbhar tried bjp thats get srinivasan stressing popcorn junk food taxing encouraging eat healthy food also carmel sweet bad teeth dentist making taxed saving money master stroke sure people arms caramel popcorn higher gst high sugar content like carbonated drinks idea discourage people consuming high sugar content foods think caramel popcorn expensive good policy working accepted public health driven policy many parts developed world levy higher taxes food products higher sugar content diabetes massive drain nations resources almost never go movies dont purchase anything intervals long dont purchase demand low tax tax reverse decision mai itna caramel popcorn nahi khatiji air purifiers already dont care deep breath light breath holding breath indians eat laddoo jalebi caramel popcorn whats gst popcorn salt march india colourized make opposite good health caramelise popcorn home tax saved jaldi jaldi alag condom flavour ke liye alag tax hoga caramel se kya dushmani hai bhai make laws screw citizens gives licence government department harass citizens dirt pm others keeps firing already baby mujhe toh strawberry chahiye tha haa baby aaj chat masala flavor se kaam chala na gst ke paise nahi hai",
    "light_cleaned_title": "New GST rates for popcorn | 5% for ready-to-eat, 12% for pre-packaged, 18% for caramel, say sources - CNBC TV18",
    "light_cleaned_selftext": "Time to tax all other popcorn flavours at 28% in the next GST meeting.",
    "light_cleaned_comments": "Rare W, screw caramel popcorn. GST will make corn cry and pop. So these guys sat in a meeting.. Tasted a variety of pop corn to see which one tasted more expensive and which one is for the masses? Simplifying the taxes. Soon it will be palm oil based ice cream will be 5% but real milk ice cream will be 18%. This deserves applause! In a time of great economic concern with slowing gdp, high inflation, high unemployment, and falling rupee, it’s heartening to see the government tackle the problem head first and come up with these amazing measures /s ( P.S can’t wait for the WhatsApp forwards explaining how this is a masterstroke ) Please give me whatever kind drugs they are on. Please!!! Coming soon, temple darshan is taxed at 18% for regular pooja and 25% for special pooja. They have too much time on their hands Tax on each chemo meds are around 2,000. Should be glad tax is not increased as it is a rich man disease or something. Truly! Thank you Modi ji Nirmala tai hai lost her mind completely, next move is to tax breathing air That would be great. Commercialization of temples is gross. Man what clownery lol. Just follow any western country and make a standard sales tax on all goods instead of nitpicking every item on a case by case basis. This takes so much time and manpower away. It puts more burden on businesses to juggle so many products with different taxes. Matlab PVR wali abh 500₹ touch karegi? 💯 Hahah.... Even a mobile keyboard is not allowing 🙏🏽 Thank you 😊 Caramel = western man's sweet hence 18 percent like cake... You might say it's mithai and should be 5 percent... But no, anything which sounds western will get 18 percent... Nirmala tai has cctv cameras on sweet shops to see if gulab jamun syrup becomes too thick and caramel like, slight over hearing and bhaaaM you get hut with 18 percent More like this; Minister 1 - This popcorn is too good. What's the flavour? Others - Carmels... Caramela... Carumal.... Minister 1 - Got it. Foreign stuff for reach people, you bhikharis can't even pronounce it. 18% GST! Coming soon - popcorn that's served fresh - 18% GST. Popcorn that was made 3 weeks ago and infested with insects - 5% GST. PVR offers mixed popcorn too. How it will be charged? Will we count individual kernels? The entire point is license raj What will happen if you mix caramel and salted? That drug will be taxed at 35% You see how caramel is an imported substance so by taxing it higher the Govt is pushing people to consume desh ka namak wala popcorn which will keep our wealth within the country. This will help us beat china as they are the 90% exporters of caramel. Eat desh ka namak wala popcorn and become aatmanirbhar. **I tried** As with BJP, that’s what get Which is what D Srinivasan was stressing about. Popcorn is junk food so by taxing it at 18% they are encouraging you to eat healthy food and also Carmel is sweet which is bad for teeth and you have to dentist, by making it taxed at 18%, they are saving your money what a master stroke /s Not sure why people are so up in arms against this. Caramel popcorn has higher GST because it has high sugar content, just like carbonated drinks. The idea is to discourage people from consuming high sugar content foods. If you think caramel popcorn is too expensive because of this, then good - the policy is working. It is an accepted public health driven policy in many parts of the developed world to levy higher taxes on food products with higher sugar content. Diabetes is a massive drain on any nation’s resources. I almost never go to movies and if I do , I don't purchase anything in intervals. As long as we don't purchase from them and demand low tax or no tax , they will reverse their decision 😂😂😂 Mai itna Caramel popcorn 🍿 nahi khatiji Air purifiers are already at 28% They don’t care, deep breath 18%, light breath 12%, holding breath 5% More Indians eat laddoo and jalebi than caramel popcorn. What's the GST on those? Popcorn salt march - India 2024 colourized make it opposite it will be good for health. caramelise popcorn at home 6% tax saved. Jaldi jaldi alag condom flavour ke liye alag tax hoga Caramel se kya dushmani hai bhai! They make these laws to screw citizens This gives licence to government department to harass citizens. What dirt does she have over our PM and others that keeps them from firing her already? Baby mujhe toh strawberry chahiye tha. Haa baby, aaj chat masala flavor SE kaam chala do na, gst ke paise nahi hai"
}