{
    "id": "1dsd74s",
    "title": "Centre likely to amend BNS to include section on sexual crimes against men, transgender people",
    "url": "https://www.thehindu.com/news/national/centre-likely-to-amend-bns-to-include-section-on-sexual-crimes-against-men-transgender-people/article68352479.ece",
    "selftext": "As new criminal laws take effect on Monday, Union officials say States can also amend some BNSS provisions; new software patch to allow FIRs to be filed in Tamil, Marathi, other regional languages",
    "flair": "Crime",
    "score": 11,
    "num_comments": 4,
    "created_utc": 1719785950.0,
    "convurl": "https://external-preview.redd.it/dmf9aq-sq0eMYn3mkc6AEpf7aPlgDsNh_RCwkowXhdU.jpg?auto=webp&s=13ea3165caf7deb590fa5259d401fd06dfec49ad",
    "comments": [
        "Good news! \nI know its expecting too much from this government, but now only if they can also work towards removing draconian laws like sedition law and the inclusion of fake news under sec 153b.",
        "It is good.  \n\nWe need to ensure equity for all parties.",
        "Very naive of you to think they'll remove sedition laws.",
        "Sc had put a stay on sedition, maybe they will do the same again? Let’s see"
    ],
    "cleaned_text": "centre likely amend bns include section sexual crimes men transgender people new criminal laws take effect monday union officials say states also amend bnss provisions new software patch allow firs filed tamil marathi regional languages ",
    "cleaned_title": "centre likely amend bns include section sexual crimes men transgender people",
    "cleaned_selftext": "new criminal laws take effect monday union officials say states also amend bnss provisions new software patch allow firs filed tamil marathi regional languages",
    "cleaned_comments": "good news know expecting much government also work towards removing draconian laws like sedition law inclusion fake news sec b good need ensure equity parties naive think theyll remove sedition laws sc put stay sedition maybe lets see",
    "light_cleaned_title": "Centre likely to amend BNS to include section on sexual crimes against men, transgender people",
    "light_cleaned_selftext": "As new criminal laws take effect on Monday, Union officials say States can also amend some BNSS provisions; new software patch to allow FIRs to be filed in Tamil, Marathi, other regional languages",
    "light_cleaned_comments": "Good news! I know its expecting too much from this government, but now only if they can also work towards removing draconian laws like sedition law and the inclusion of fake news under sec 153b. It is good. We need to ensure equity for all parties. Very naive of you to think they'll remove sedition laws. Sc had put a stay on sedition, maybe they will do the same again? Let’s see"
}