{
    "id": "13xgh98",
    "title": "BSS questions Isro chief claims, asks why Isro hasn’t used tech from Vedas to build rockets, satellites",
    "url": "https://www.reddit.com/r/india/comments/13xgh98/bss_questions_isro_chief_claims_asks_why_isro/",
    "selftext": "The Breakthrough Science Society (BSS), a collective of scientists and researchers, on Tuesday urged public figures, including administrators of scientific organisations to reflect the ethos of science in their discourse, while terming a recent statement about science in ancient India by Isro chairman S Somanath “an unrealistic claim”.\n\nSource: https://m.timesofindia.com/home/science/bss-questions-isro-chief-claims-asks-why-isro-hasnt-used-tech-from-vedas-to-build-rockets-satellites/articleshow/100627397.cms",
    "flair": "Politics",
    "score": 60,
    "num_comments": 7,
    "created_utc": 1685623046.0,
    "convurl": "https://external-preview.redd.it/IdK4kRsaaEbpyJPUSUGUrVusAogUOJO5lB5eU6LuloY.jpg?auto=webp&v=enabled&s=fa54fa7fcc77e9d7f239ed5755e429aa8af0d2c9",
    "comments": [
        "In the Ramayan, Hanuman was able to jump/fly from India to Lanka. Let's drop all the Bhakts from a plane and see if they can fly or jump to Lanka. If they are successful, on behalf of ISRO, I promise the technology will be delivered. If they fail and drown in the ocean, no questions asked.",
        "Chaddis will probably say “reeee invaders destroyed all that hidden knowledge of Bharat”.\n\nOnly way to deal with Chaddis is to laugh at their faces and move on.",
        "Bro people there are suffering enough"
    ],
    "cleaned_text": "bss questions isro chief claims asks isro hasnt used tech vedas build rockets satellites breakthrough science society bss collective scientists researchers tuesday urged public figures including administrators scientific organisations reflect ethos science discourse terming recent statement science ancient india isro chairman somanath unrealistic claim source ",
    "cleaned_title": "bss questions isro chief claims asks isro hasnt used tech vedas build rockets satellites",
    "cleaned_selftext": "breakthrough science society bss collective scientists researchers tuesday urged public figures including administrators scientific organisations reflect ethos science discourse terming recent statement science ancient india isro chairman somanath unrealistic claim source",
    "cleaned_comments": "ramayan hanuman able jumpfly india lanka lets drop bhakts plane see fly jump lanka successful behalf isro promise technology delivered fail drown ocean questions asked chaddis probably say reeee invaders destroyed hidden knowledge bharat way deal chaddis laugh faces move bro people suffering enough",
    "light_cleaned_title": "BSS questions Isro chief claims, asks why Isro hasn’t used tech from Vedas to build rockets, satellites",
    "light_cleaned_selftext": "The Breakthrough Science Society (BSS), a collective of scientists and researchers, on Tuesday urged public figures, including administrators of scientific organisations to reflect the ethos of science in their discourse, while terming a recent statement about science in ancient India by Isro chairman S Somanath “an unrealistic claim”. Source:",
    "light_cleaned_comments": "In the Ramayan, Hanuman was able to jump/fly from India to Lanka. Let's drop all the Bhakts from a plane and see if they can fly or jump to Lanka. If they are successful, on behalf of ISRO, I promise the technology will be delivered. If they fail and drown in the ocean, no questions asked. Chaddis will probably say “reeee invaders destroyed all that hidden knowledge of Bharat”. Only way to deal with Chaddis is to laugh at their faces and move on. Bro people there are suffering enough"
}