{
    "id": "16f0b4g",
    "title": "“Is desh ka naam India hai—aur India hee rahega.”—Vallabhbai Patel.",
    "url": "https://www.reddit.com/r/india/comments/16f0b4g/is_desh_ka_naam_india_haiaur_india_hee/",
    "selftext": "In this movie, Sardar, Patel makes known the indelible identity of the land is tied to the name, India. Foes of India tried at the inception to strip us of it. They weren’t successful.\n\nThey are trying again.\n\nhttps://youtu.be/cIIojuICvdE?si=nIsVwjfNFTHNSdmg\n\n[Please **scroll to 1:22:15**, where one of major our founding fathers responsible for the Indian Union makes a clear and unequivocal statement about this].",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694352514.0,
    "convurl": "https://external-preview.redd.it/j9XVy0qeOo4_WBNXQdu78RcRL5il60b4wGWK4DPAO4k.jpg?auto=webp&s=4f9809c3a3e846e1446e822fc2025d14dd98a3e6",
    "comments": [
        "I am not supporting the supposed name change but what you have shared is a bit out of context.\n\nJinah was opposed to the name India because it would make it appear that India is the main country from which Pakistan split off instead of a country that split into two countries. He argued that since the name India came from the Indus Valley civilization, and much of the sites of the civilization were going to be in Pakistan, Bharat did not have exclusive rights to the name India. \n\nPatel's comments about the name India stemmed from the above conflict. They weren't in the context of India vs Bharat.",
        "I appreciate your response.\n\nBut the point I wanted to make is that Jinnah didn’t want “India” to be the name of the new country. \n\nJinnah could have proposed “Bharat” or any other,—even then Vallabhai Patel’s  argument would still be valid. \n\nWe are the sole bearers and beneficiaries of that name and everything in history associated with that name. And this must continue in perpetuity.\n\nAfter over seven-and-a-half decades as a free nation bearing that name, we are being forced to accept one over the other.\n\nMuch as I cherish and value *Bharat* and the history of it,—*India* and being *Indian* is my main identity.\n\nNever have I felt so robbed and powerless to do anything.",
        "I understand. \n\nI am not a Hindi speaker, I have never been a practicing Hindu or a Nationalist.\n\nWhat I can relate to and feel pride about is Nehruvian Socialism, a country separate from the conflict of the cold war, a country separate from the evils of capitalism and extremist communism. India represents that. It also represents a country founded on the ideals of the likes of Ambedkar, standing upto the evils of Indian Culture and Religious practices. \n\nThere is enough good in the ancient India too to be proud of 'Bharat' but Bharat has always been the name of the land on which many empires stood. It wasn't a country till India, what the people of this country, the founders of the country and the constitution stands for is represented by India."
    ],
    "cleaned_text": "desh ka naam india haiaur india hee rahegavallabhbai patel movie sardar patel makes known indelible identity land tied name india foes india tried inception strip us werent successful trying please scroll one major founding fathers responsible indian union makes clear unequivocal statement ",
    "cleaned_title": "desh ka naam india haiaur india hee rahegavallabhbai patel",
    "cleaned_selftext": "movie sardar patel makes known indelible identity land tied name india foes india tried inception strip us werent successful trying please scroll one major founding fathers responsible indian union makes clear unequivocal statement",
    "cleaned_comments": "supporting supposed name change shared bit context jinah opposed name india would make appear india main country pakistan split instead country split two countries argued since name india came indus valley civilization much sites civilization going pakistan bharat exclusive rights name india patels comments name india stemmed conflict werent context india vs bharat appreciate response point wanted make jinnah didnt want india name new country jinnah could proposed bharat othereven vallabhai patels argument would still valid sole bearers beneficiaries name everything history associated name must continue perpetuity sevenandahalf decades free nation bearing name forced accept one much cherish value bharat history itindia indian main identity never felt robbed powerless anything understand hindi speaker never practicing hindu nationalist relate feel pride nehruvian socialism country separate conflict cold war country separate evils capitalism extremist communism india represents also represents country founded ideals likes ambedkar standing upto evils indian culture religious practices enough good ancient india proud bharat bharat always name land many empires stood wasnt country till india people country founders country constitution stands represented india",
    "light_cleaned_title": "“Is desh ka naam India hai—aur India hee rahega.”—Vallabhbai Patel.",
    "light_cleaned_selftext": "In this movie, Sardar, Patel makes known the indelible identity of the land is tied to the name, India. Foes of India tried at the inception to strip us of it. They weren’t successful. They are trying again. [Please **scroll to 1:22:15**, where one of major our founding fathers responsible for the Indian Union makes a clear and unequivocal statement about this].",
    "light_cleaned_comments": "I am not supporting the supposed name change but what you have shared is a bit out of context. Jinah was opposed to the name India because it would make it appear that India is the main country from which Pakistan split off instead of a country that split into two countries. He argued that since the name India came from the Indus Valley civilization, and much of the sites of the civilization were going to be in Pakistan, Bharat did not have exclusive rights to the name India. Patel's comments about the name India stemmed from the above conflict. They weren't in the context of India vs Bharat. I appreciate your response. But the point I wanted to make is that Jinnah didn’t want “India” to be the name of the new country. Jinnah could have proposed “Bharat” or any other,—even then Vallabhai Patel’s argument would still be valid. We are the sole bearers and beneficiaries of that name and everything in history associated with that name. And this must continue in perpetuity. After over seven-and-a-half decades as a free nation bearing that name, we are being forced to accept one over the other. Much as I cherish and value *Bharat* and the history of it,—*India* and being *Indian* is my main identity. Never have I felt so robbed and powerless to do anything. I understand. I am not a Hindi speaker, I have never been a practicing Hindu or a Nationalist. What I can relate to and feel pride about is Nehruvian Socialism, a country separate from the conflict of the cold war, a country separate from the evils of capitalism and extremist communism. India represents that. It also represents a country founded on the ideals of the likes of Ambedkar, standing upto the evils of Indian Culture and Religious practices. There is enough good in the ancient India too to be proud of 'Bharat' but Bharat has always been the name of the land on which many empires stood. It wasn't a country till India, what the people of this country, the founders of the country and the constitution stands for is represented by India."
}