{
    "id": "1e1h1ii",
    "title": "Beware of OTT Subscription Scams on Instagram!",
    "url": "https://www.reddit.com/r/india/comments/1e1h1ii/beware_of_ott_subscription_scams_on_instagram/",
    "selftext": "Hey Reddit family,   \nI wanted to share an incident that happened to me recently to help others avoid falling for similar scams.\n\n**TL;DR:** I tried purchasing a cheap Netflix subscription from an Instagram reseller, suspected it was a scam, confirmed my suspicions after losing some money, and want to warn others about these scams.\n\n---\n\nSo, recently, for the last couple of weeks, I was getting ads on Instagram and even on my WhatsApp (from some resellers) to buy OTT platform subscriptions at a cheap rate. Today, I finally decided to try this out. Although I suspected it was a scam, I thought, \"Let's give it a try and see how they usually scam people.\"\n\nMy search started on Instagram. I liked a couple of posts that said \"Buy OTT at a cheaper rate.\" After liking a few, I refreshed my feed on Instagram, and guess what? Instagram started suggesting sponsored posts from such accounts. Feels like beggars have now become rich, haven't they? Still, I checked a few posts and saw this account on Instagram with the ID \"ottbuycheap31.\" This guy that goes by the name \"Deepak Kumar Mahato\" (as per his GPAY account) offered the cheapest rates among all the ads I saw on Instagram. He also had around 1.8k followers, and the account was created in 2023. So, I thought, \"Let's experiment with this guy.\" I messaged him, and he sent me the Netflix plans list:\n\n* 6 Months - 4K Quality - 4 Screens - Just @ ₹299\n\nHe even claimed that the activation would be done on a private email (seemed pretty impossible), but still... let's give it a try.\n\nI clarified all the details: the duration, the quality, the number of screens, and the price. Initially, I paid him just ₹199 to see if he would run away with the money. Pretty blunt move, but I thought, \"Why not check it?\" He had mentioned the price for Netflix was ₹299.\n\n“Okay, he hasn’t blocked me yet,” I thought. So, I sent him the remaining ₹100. Now, I was waiting for him to block me... but guess what, he didn't. He told me to wait for 10 minutes, and he would activate it on my email. I sent him my email.\n\nFor a moment, I wondered, \"Is he really going to do it? If yes, how? I mean, Netflix isn't that cheap in any other country either...\"\n\n10 minutes later, he messaged, \"I am trying to do the payment, but it's asking for GST. I need ₹67 more.\"\n\nI mean, who asks for GST for a scam service? Pretty privileged scammer, I would say. Nevermind, I hesitated at first, but to proceed further, I gave him the ₹67 and BOOM. He was gone.\n\nThe account changed to \"Instagram User\" in a fraction of a second. I checked from my ALT account, and he was active there. I got blocked, which I already knew from the start.\n\nI did this because I was curious after getting these messages for almost a year, and today I finally thought to give it a try. Although I knew it was a scam, as such things never exist, I still gave it a try (with the least risk involved).\n\nMaybe this post will educate others to stay away from such scams, even if they seem 100% trustworthy. If you want Netflix, better share the password and create a common group to rotate the home account. But never trust such sellers.\n\nFor proof, I have attached a long screenshot that has my chat with him on Instagram, his QR code (created on a website called \"FamApp\", which is like an online bank account that gives you a UPI ID and a card), and also my payment to him on Google Pay. I will not hide his name. Why should I? If he can scam innocent people without any shame, why can't we expose his name (even if it's fake) on social media?\n\nBe safe, guys :)\n\nScreenshot Here:\n\nhttps://preview.redd.it/u8wahr8b53cd1.png?width=578&format=png&auto=webp&s=7b0b9c60b4a8674bcf4d72f1884b69a0583c2c88\n\n",
    "flair": "Crime",
    "score": 8,
    "num_comments": 6,
    "created_utc": 1720789087.0,
    "convurl": "https://b.thumbs.redditmedia.com/i5BILOuVTIAjqByDfvfnT1i8bafnHlBCEWaPKXpobxM.jpg",
    "comments": [
        "It makes sense to learn a lifetime lesson in 360/- .\n\nNowadays it seems like everyone is a scammer 😔😔😔",
        "Send me Rs 500 i will mass block him. /s",
        "Chindi chori karoge tho yahi hoga!",
        "Its on you",
        "Not all OTT Subscribtion ones are scam I've seen so many people buy it on reddit and they get what they paid for you cancheck Indianthriftstore or indianthriftcorner sub 👍",
        "Why do all these qhen you can just do the black seas..?\n\n\n☠️☠️☠️"
    ],
    "cleaned_text": "beware ott subscription scams instagram hey reddit family wanted share incident happened recently help others avoid falling similar scams tldr tried purchasing cheap netflix subscription instagram reseller suspected scam confirmed suspicions losing money want warn others scams recently last couple weeks getting ads instagram even whatsapp resellers buy ott platform subscriptions cheap rate today finally decided try although suspected scam thought lets give try see usually scam people search started instagram liked couple posts said buy ott cheaper rate liking refreshed feed instagram guess instagram started suggesting sponsored posts accounts feels like beggars become rich havent still checked posts saw account instagram id ottbuycheap guy goes name deepak kumar mahato per gpay account offered cheapest rates among ads saw instagram also around k followers account created thought lets experiment guy messaged sent netflix plans list months k quality screens even claimed activation would done private email seemed pretty impossible still lets give try clarified details duration quality number screens price initially paid see would run away money pretty blunt move thought check mentioned price netflix okay hasnt blocked yet thought sent remaining waiting block guess didnt told wait minutes would activate email sent email moment wondered really going yes mean netflix isnt cheap country either minutes later messaged trying payment asking gst need mean asks gst scam service pretty privileged scammer would say nevermind hesitated first proceed gave boom gone account changed instagram user fraction second checked alt account active got blocked already knew start curious getting messages almost year today finally thought give try although knew scam things never exist still gave try least risk involved maybe post educate others stay away scams even seem trustworthy want netflix better share password create common group rotate home account never trust sellers proof attached long screenshot chat instagram qr code created website called famapp like online bank account gives upi id card also payment google pay hide name scam innocent people without shame cant expose name even fake social media safe guys screenshot ",
    "cleaned_title": "beware ott subscription scams instagram",
    "cleaned_selftext": "hey reddit family wanted share incident happened recently help others avoid falling similar scams tldr tried purchasing cheap netflix subscription instagram reseller suspected scam confirmed suspicions losing money want warn others scams recently last couple weeks getting ads instagram even whatsapp resellers buy ott platform subscriptions cheap rate today finally decided try although suspected scam thought lets give try see usually scam people search started instagram liked couple posts said buy ott cheaper rate liking refreshed feed instagram guess instagram started suggesting sponsored posts accounts feels like beggars become rich havent still checked posts saw account instagram id ottbuycheap guy goes name deepak kumar mahato per gpay account offered cheapest rates among ads saw instagram also around k followers account created thought lets experiment guy messaged sent netflix plans list months k quality screens even claimed activation would done private email seemed pretty impossible still lets give try clarified details duration quality number screens price initially paid see would run away money pretty blunt move thought check mentioned price netflix okay hasnt blocked yet thought sent remaining waiting block guess didnt told wait minutes would activate email sent email moment wondered really going yes mean netflix isnt cheap country either minutes later messaged trying payment asking gst need mean asks gst scam service pretty privileged scammer would say nevermind hesitated first proceed gave boom gone account changed instagram user fraction second checked alt account active got blocked already knew start curious getting messages almost year today finally thought give try although knew scam things never exist still gave try least risk involved maybe post educate others stay away scams even seem trustworthy want netflix better share password create common group rotate home account never trust sellers proof attached long screenshot chat instagram qr code created website called famapp like online bank account gives upi id card also payment google pay hide name scam innocent people without shame cant expose name even fake social media safe guys screenshot",
    "cleaned_comments": "makes sense learn lifetime lesson nowadays seems like everyone scammer send rs mass block chindi chori karoge tho yahi hoga ott subscribtion ones scam ive seen many people buy reddit get paid cancheck indianthriftstore indianthriftcorner sub qhen black seas",
    "light_cleaned_title": "Beware of OTT Subscription Scams on Instagram!",
    "light_cleaned_selftext": "Hey Reddit family, I wanted to share an incident that happened to me recently to help others avoid falling for similar scams. **TL;DR:** I tried purchasing a cheap Netflix subscription from an Instagram reseller, suspected it was a scam, confirmed my suspicions after losing some money, and want to warn others about these scams. --- So, recently, for the last couple of weeks, I was getting ads on Instagram and even on my WhatsApp (from some resellers) to buy OTT platform subscriptions at a cheap rate. Today, I finally decided to try this out. Although I suspected it was a scam, I thought, \"Let's give it a try and see how they usually scam people.\" My search started on Instagram. I liked a couple of posts that said \"Buy OTT at a cheaper rate.\" After liking a few, I refreshed my feed on Instagram, and guess what? Instagram started suggesting sponsored posts from such accounts. Feels like beggars have now become rich, haven't they? Still, I checked a few posts and saw this account on Instagram with the ID \"ottbuycheap31.\" This guy that goes by the name \"Deepak Kumar Mahato\" (as per his GPAY account) offered the cheapest rates among all the ads I saw on Instagram. He also had around 1.8k followers, and the account was created in 2023. So, I thought, \"Let's experiment with this guy.\" I messaged him, and he sent me the Netflix plans list: * 6 Months - 4K Quality - 4 Screens - Just @ ₹299 He even claimed that the activation would be done on a private email (seemed pretty impossible), but still... let's give it a try. I clarified all the details: the duration, the quality, the number of screens, and the price. Initially, I paid him just ₹199 to see if he would run away with the money. Pretty blunt move, but I thought, \"Why not check it?\" He had mentioned the price for Netflix was ₹299. “Okay, he hasn’t blocked me yet,” I thought. So, I sent him the remaining ₹100. Now, I was waiting for him to block me... but guess what, he didn't. He told me to wait for 10 minutes, and he would activate it on my email. I sent him my email. For a moment, I wondered, \"Is he really going to do it? If yes, how? I mean, Netflix isn't that cheap in any other country either...\" 10 minutes later, he messaged, \"I am trying to do the payment, but it's asking for GST. I need ₹67 more.\" I mean, who asks for GST for a scam service? Pretty privileged scammer, I would say. Nevermind, I hesitated at first, but to proceed further, I gave him the ₹67 and BOOM. He was gone. The account changed to \"Instagram User\" in a fraction of a second. I checked from my ALT account, and he was active there. I got blocked, which I already knew from the start. I did this because I was curious after getting these messages for almost a year, and today I finally thought to give it a try. Although I knew it was a scam, as such things never exist, I still gave it a try (with the least risk involved). Maybe this post will educate others to stay away from such scams, even if they seem 100% trustworthy. If you want Netflix, better share the password and create a common group to rotate the home account. But never trust such sellers. For proof, I have attached a long screenshot that has my chat with him on Instagram, his QR code (created on a website called \"FamApp\", which is like an online bank account that gives you a UPI ID and a card), and also my payment to him on Google Pay. I will not hide his name. Why should I? If he can scam innocent people without any shame, why can't we expose his name (even if it's fake) on social media? Be safe, guys :) Screenshot Here:",
    "light_cleaned_comments": "It makes sense to learn a lifetime lesson in 360/- . Nowadays it seems like everyone is a scammer 😔😔😔 Send me Rs 500 i will mass block him. /s Chindi chori karoge tho yahi hoga! Its on you Not all OTT Subscribtion ones are scam I've seen so many people buy it on reddit and they get what they paid for you cancheck Indianthriftstore or indianthriftcorner sub 👍 Why do all these qhen you can just do the black seas..? ☠️☠️☠️"
}