{
    "id": "1azojds",
    "title": "How The Modi Govt Is Trying To Silence Critics In The Diaspora By Banning Them From India",
    "url": "https://article-14.com/post/how-the-modi-govt-is-trying-to-silence-critics-in-the-diaspora-by-banning-them-from-india-65c98c934673f",
    "selftext": "I guess that is one way to shut down criticism. ",
    "flair": "Law & Courts",
    "score": 37,
    "num_comments": 10,
    "created_utc": 1708869508.0,
    "convurl": "https://external-preview.redd.it/VOvmXwlGsjgrOBBtUIs4dGNeDOcXys7oTijJ4Gu6PtQ.jpg?auto=webp&s=7b69ba7f7146c421ba9d64336fc7c1a0c6b5b7b2",
    "comments": [
        "But i thought india is better than china , it has freedom of speech and best economy in the warld /s",
        "If you read the reason it says that freedom of speech is only for Citizens. Everyone else should shut up.\n\nThey even deported a French journalist the other day who lived in India for 20 years.\n\nLet's see what the court says.",
        "“You are henceforth banned from Pyongyang!”",
        "Mother of democracy etc.",
        "Constitutional rights are for citizens only. OCI’s aren’t citizens.",
        "That’s not fair",
        "New IT laws are here. Even social media isn't safe anymore. I just hope reddit won't comply with it and don't share user data with government. I have no hope with Fb, meta, twitter.",
        "Not all, only a few rights are for only citizens, others are in general for all the person.\n\n Regardless, having or hosting any person within a nation is a privilege of the hosting nation and it's government, no one has right for the same and GoI was perfectly in position to shut her down. Anyone who has specific problems with it can challenge it in courts (and get thrown away then again make a post on reddit) or overturn the government."
    ],
    "cleaned_text": "modi govt trying silence critics diaspora banning india guess one way shut criticism ",
    "cleaned_title": "modi govt trying silence critics diaspora banning india",
    "cleaned_selftext": "guess one way shut criticism",
    "cleaned_comments": "thought india better china freedom speech best economy warld read reason says freedom speech citizens everyone else shut even deported french journalist day lived india years lets see court says henceforth banned pyongyang mother democracy etc constitutional rights citizens ocis arent citizens thats fair new laws even social media isnt safe anymore hope reddit wont comply dont share user data government hope fb meta twitter rights citizens others general person regardless hosting person within nation privilege hosting nation government one right goi perfectly position shut anyone specific problems challenge courts get thrown away make post reddit overturn government",
    "light_cleaned_title": "How The Modi Govt Is Trying To Silence Critics In The Diaspora By Banning Them From India",
    "light_cleaned_selftext": "I guess that is one way to shut down criticism.",
    "light_cleaned_comments": "But i thought india is better than china , it has freedom of speech and best economy in the warld /s If you read the reason it says that freedom of speech is only for Citizens. Everyone else should shut up. They even deported a French journalist the other day who lived in India for 20 years. Let's see what the court says. “You are henceforth banned from Pyongyang!” Mother of democracy etc. Constitutional rights are for citizens only. OCI’s aren’t citizens. That’s not fair New IT laws are here. Even social media isn't safe anymore. I just hope reddit won't comply with it and don't share user data with government. I have no hope with Fb, meta, twitter. Not all, only a few rights are for only citizens, others are in general for all the person. Regardless, having or hosting any person within a nation is a privilege of the hosting nation and it's government, no one has right for the same and GoI was perfectly in position to shut her down. Anyone who has specific problems with it can challenge it in courts (and get thrown away then again make a post on reddit) or overturn the government."
}