{
    "id": "13cnh1h",
    "title": "Crocs made a fake video to gaslight and cheat me!",
    "url": "https://www.reddit.com/r/india/comments/13cnh1h/crocs_made_a_fake_video_to_gaslight_and_cheat_me/",
    "selftext": "Apologies in advance for the long post. \n\nI know this sounds incredulous but hear me out. I had ordered a pair of clogs and some jibbitz for my kid on 21st April. \n\nWhen I received my order i received only the clogs. I didn't think much of it and thought the jibbitz will be delivered seperately. Later when I checked my order details I realised that the jibbitz were marked as delivered too so I called up their customer care who were extremely rude and even hung up on me but did ask me to email their customer support. \n\nI emailed Crocs customer support and that's when the saga began. They asked me for an unboxing video (really) and promised to do an investigation. I obviously did not have any unboxing video so I asked for proof that the jibbitz were packed at their end. They sent me some pictures of their packing center where the jibbitz in question were clearly visible. \n\nAt this point I didn't think to check the date and time stamp (more on this later). I then told them it was not possible as I opened the package myself and there were no jibbitz. \n\nThey then copy pasted their older message. I was livid at this point because what they were implying was that I was lying and I was too invested and angry at this point to give up. I told them to send me a packing video from their end to prove themselves since they thought it was appropriate to ask for an unboxing video and I also threatened legal action for insinuating that I was dishonest and trying to cheat them of a few jibbitz.\n\n Anyways they did send me a video and this was when I actually checked the time stamp. The video was quite hilarious by itself as there were two people packing orders however the one packing my order was showing everything he packed to the camera, the other one was just packing normally. \n\nLike i said i checked the date and time stamp which was 24th April 17:13. I knew something was off because if they had actually sent me the package as shown in the video I should have received the jibbitz. At this point I was questioning myself if i had somehow thrown away the jibbitz but i knew that all i had actually received were the clogs.\n\n I checked my call records and realised I had first called the customer care on 25th which meant that i would have probably received the package on 24th as I hadn't immediately actioned the missing jibbitz. I looked for more evidence on when the product was actually delivered to me and all I had was the tracking number on my order but no details as to who the delivery partner was . \n\nI then emailed Crocs back and asked about the delivery partner. They replied with the usual copy pasted message that they had investigated yada yada but did send me the logistics partner's name which was Bluedart. \n\nThis was all I needed, i tracked the order on Bluedart and you won't believe but the product was delivered to me at 13:15 on 24th April before it was packed as per the video sent to me by Crocs. Bluedart had also picked the package from them on 22nd, 2 whole days before they packed my order. \n\nI cannot understand why someone like Crocs would go to the extent of creating a fake video to prove that I am wrong and they were right. I mean it was just a few jibbitz at the end of the day. \n\nThe worst part is if they were going the extra mile and making a fake video to prove that I was lying then atleast do it well, fake the date on the CCTV recording too..so half baked! I do have all the receipts - will edit with imgur links the fake video sent by Crocs and blue dart's tracking details. Do note the time stamps on them. \n\nI have emailed them back highlighting their appalling behaviour and the shocking fake video they created and while i await their response, I just want the word to get out on this. At this point I have also given up on the jibbitz but i am shocked at the level of gaslighting and thought I should write about it and share with all of you.\n\nEdits\n\nhttps://imgur.io/a/IeRuZlC\nLink to the fake video created and sent by crocs. Do note the date and time stamp\n\nhttps://imgur.io/a/OdQEFf8\nLink to Bluedart tracking details. Do note the delivery date and time. Bluedart has managed to deliver the package to me before Crocs even packed it later that day. 😂\n\nPlease feel free to share this post especially with your media friends. I would love for this to get blown up. TIA!\n\nUpdate - Posted on Twitter\n https://twitter.com/Ninxster/status/1656167322175037440?t=78-mnZAFkdAQGheKGU-Bpw&s=19\n\nPlease do share! Thank you.\n\nUpdate \n\nHave registered my grievance with the National Consumer Helpline as advised by many of you. Have uploaded the evidence and now awaiting resolution. The NCH is absolutely amazing, helpful and efficient. So happy that we have something that works so well in our country :)",
    "flair": "Rant / Vent",
    "score": 480,
    "num_comments": 139,
    "created_utc": 1683633180.0,
    "convurl": "https://external-preview.redd.it/y_bNI4Xb2fbWL0PG6jFdIRslLqvSsgwfYO4-UBnhCe0.jpg?auto=webp&v=enabled&s=18f3ec333dc5fe4dddc1981a14c34ac6bb87b9fa",
    "comments": [
        "A person ordered some perfume from nykaa worth 3000₹. But they sent him a spanner and a remote. Unfortunately he did not film the unboxing and has no proof. nykaa is now refusing to initiate refund. \n\nTldr: take video of unboxing an online ordered package as proof of received items. \n\nDo not accept tampered or broken seal boxes.",
        "The fact that the video is fake is so blatantly obvious. He is showing the items on camera while the other guy is packing stuff without showing anything. It was obviously created after you messaged them.",
        "I don’t understand why people buy crocs. Everyone seems to love it. I bought in on the hype and realised its just cheap plastic footwear. I sweat on my feet and walk in that same sweat, once I removed them in office and slipped and fell in front of my staff from my own wet slippy feet.",
        "I know right ...i don't understand why they went to such lengths for a few jibbitz 😂",
        "Hype gets the worst of us. I almost jumped on the hype wagon and almost bought those budget smartwatch you would get for 1500 rupees. Glad I thought twice and dodged a bullet. My friend bought one and now he regrets it since most of the budget watches are basically rebadged Chinese watches.",
        "Since I do regular 6 km walks, I've worn down two crocs soles till they had holes. They cut my feet at places. The black ones get scalding hot in the sun. They let in too many stones. I looked at a third pair which seemed to avoid the problems but I could buy two pairs good sneakers for 6k.",
        "Stop emailing customer support. Instead, write a nice email to the head office. Your problem should get solved.",
        "Caught Red handed",
        "Why don't Indians do a tldr after a long post? No way I'm gonna read the crap without having a summary to convincing me to.",
        "What's jibbitz?",
        "Great question...i wouldn't have known either if I wasn't a parent. It's those little characters and shapes that can be attached to your crocs. Not a classy look for adults :)",
        "The heading kind of implies that ..",
        "Shoes plus accessories were ordered. Received shoes. Upon contacting CS about missing accessories OP was sent a packing video of the package timestamped a whole 1 hour after it was already delivered.",
        "The tags kinda thing which you put in the holes of clogs to make it look more attractive",
        "that's bloody insane lmao. email head office nicely, I would be really surprised if you didn't get your money back & another shipment sent out to you.",
        "Thanks for the info. I didn't know they are called jibbitz 😅.                    \n\nOne suggestion, please use paragraphs .",
        "Yea I googled it later. Thanks",
        "It really has turned into some comedy sketch 😂. They sent me the video this morning and the tracking details in the afternoon. I will wait for their reply to my mail and if i don't hear from them will definitely escalate. Thanks.",
        "Hopefully i will never have to type such a big wall of text again, but if i do ..will definitely keep it in mind. Thank you.",
        "Will definitely escalate if i don't hear back from them.",
        "Why don't you just @ their Twitter. Works for the 99% of us!",
        "This is so weird. Even childish.  if they didn't want to send you the jizzbits they could have just said we investigated, nothing went wrong. You would have hated them, but it would have been the end of it. Making a fake video is just wild. Even a small time insta seller would not try stuff like this.",
        "I don't use any SM except reddit . Hopefully they will reply with an apology and send the missing jibbitz. If not will try and get one of friends to tweet on my behalf. The video was only sent to me this morning so it's all quite fresh. Besides the shock i also had a laugh when I saw the time stamp so thought I should share :)",
        "Ok fair.\n\nAlthough you should. I'm pretty confident that directly raising it with crocs on Twitter would be faster, much much faster.",
        "Absolutely! I have no idea what they were thinking!!!",
        "The very reason I film unboxing of every single package I receive even when it's priced at 1 INR.",
        "It's great that you didn't give up after they sent you the fake video.\nI do online shopping a lot and it is really infuriating when customer care give stereotype answers and responses.\nSometimes even if the questions are different , their answers are always the same.",
        "Don't bother with contacting them again. They've given you enough grounds to believe they're acting in bad faith and engaging in some kind of fraud. Take it straight to consumer court. Call the helpline. Tell them what's happened. Responses through that medium are quick and time bound. And if they continue to act in bad faith you can always see them in court.",
        "Thanks ...it was the making me out to be a liar that infuriated me and I got super invested. Them sending me (fake) evidence that they had sent me the complete order when I know that they hadn't made me super persistent :)",
        "Thanks for the advice!",
        "Sorry I have no sympathy with people who buy crocs",
        "OP try to register your complaint with consumer forum too helped me a lot in past",
        "Thanks for the advice!",
        "Lmao a crocs store sold me a used pair and refused to exchange it for a different size. I raised hell with their customer support and ultimately got my way.",
        "American companies are known to be penny wise and pound foolish.",
        "This is the standard dialogue of most of the customer care executives that we checked our warehouse and now we should check with the delivery people. \n\nHalf of the people give up after this as who has the time to find the helpline no. then wait till your number comes.\n\nAmazon solves most of the issues & gives instant refund  but then we can't order expensive stuff from there as there are lot of sellers selling fake products in original packing.",
        "Because i use crocs for bathing, walking in my house, outside my house, malls, anywhere and everywhere. They look decent and are comfortable",
        "Care to elaborate?",
        "Man this gives me more reason to use my credit card instead of blindly using upi or cash. My credit card gives me the option to open up a dispute with the merchant and with the proof you have, I’m sure I would have got my money back in no time.",
        "This is the problem of a trustless society. So many customers cheat sellers, so many sellers cheat customers it’s hard for anyone to trust anyone.",
        "A 100₹ Hawaii chappal from roadside lasts longer than crocs. I left mine in the sun for a day after washing them and a few days later it developed cracks. I learned my lesson. Come on,  I mean it's not even something special that offers something others can't. It's just retarded overpriced footwear. I don't understand why people in India even buy that shit when we have way better alternatives available.",
        "Man please do make a part 2 of this mean while also complain on consumer portal.",
        "Lol will definitely update with what Crocs have to say about their ghastly childish behaviour 😂. They were pretty quick with their email replies until my last email to them with all the evidence about their lies..... all surprisingly furnished by them 😂.\nThanks for the advice!",
        "Also threaten the customer care guy with legal action and that you would complain about him to his seniors and HR.",
        "How do you register a complaint in the consumer forum?",
        "Share it on LinkedIn and tag the CEO, Brand and Sales Head.",
        "Thanks for the advice :)",
        "/s",
        "on which website did you order",
        "I bought crocs for 4.5K and returned them after trying them on. Got the same thing from Relaxo for 350 ₹.",
        "Take legal action. These people deserve some heat",
        "On crocs.in :)",
        "Worst shoes for someone with hyper hidrosis",
        "I am serious. LinkedIn is the new customer service portal. I have been able to get response and resolution from tech leads and sales leads on LinkedIn on queries that their customer service people are unable to resolve.",
        "thanks. I'm goona buy at offline showroom then",
        "Hey, post this on Twitter and shame them",
        "Jizzbits 💀",
        "https://consumerhelpline.gov.in/index.php",
        "This was fun to ready. Wanna know what happens next. Please do update us.\n\nThank you",
        "What the f is jibbitz?",
        "Exactly dude 😂 why are they playing such cheap dirty game",
        "Why only one person is flash packing the crocs into cctv and other persons are packing so silently like they want to steal 🤣🤣",
        "😂😂😂 I guess that's how you pack after the product is already delivered",
        "Thank you...will definitely update :)",
        "Copy pasting my reply to the same question earlier - Great question...i wouldn't have known either if I wasn't a parent. It's those little characters and shapes that can be attached to your crocs. Not a classy look for adults :)",
        "🤣",
        "Hats off to your diligence and persistence! Do complain at all the forums and social media sites as possible. Very Unprofessional of them  , cheaters and liars😈",
        "Lol 😅",
        "First mistake was to buy crocs",
        "Thank you :) ....will definitely escalate this.",
        "Tldr?",
        "I hope people blow this up, this is so outrages coming from a huge company such as crocs.",
        "Hi op , please make a account on Twitter and tag them , I swear they will try to tire you out on customer care , with public support and people making a joke out of the company they will reach out to you for the missing items and probably fire the employees so that this doesn't happen again , there are many instances of this working",
        "A kind commenter did it for me, here you go - \"Shoes plus accessories were ordered. Received shoes. Upon contacting CS about missing accessories OP was sent a packing video of the package timestamped a whole 1 hour after it was already delivered.\"",
        "I hope so too! It's extremely unethical and no one knows how many prepaid customers they might have fobbed off like this.",
        "Thanks for the advice, i will. \nAs funny as it all is it's completely unacceptable that a large corporation like Crocs can do something like this. If i was working at Crocs... heads would definitely be rolling.",
        "Thanks for this. I quoted you in a reply to another commentator. Wasn't sure if you would like to be tagged so didn't.",
        "Absolutely. also please keep us updated I'm invested in this now lol",
        ">jizzbits \n\nwhy?",
        "😂 Done!",
        "I prefer amazon. Better customer support. And if you don't like them you can ask for a refund. No such option with an offline store.",
        "Mention in the email you will pursue on NCH/Umang with the proofs. Often the mention is enough for companies to back down. And then still go on to make the complaint.",
        "The plastic ones are so obviously made from recycled trash. Keep them in the sun and they will become yellow and brittle",
        "Why don't you go to consumer court?",
        "Register a consumer grievance first. I had a quick response (not customer care department) from zomato and air asia only after doing this. They will take every one for granted until someone holds them accountable. I don't even understand what kind of management would allow their staff to do something like this.\n\nI hope you don't settle for a refund or replacement after being called a lier",
        " \n\nWow, that's truly an infuriating experience you had with Crocs! It's disheartening to hear practices. The lengths they went to create a fake video to prove you wrong are astonishing and unprofessional.   \nIt may be worth considering consulting with a legal professional who can provide you with appropriate guidance based on the evidence you have. They can assess the situation and advise you on the best course of action to seek a resolution and hold Crocs accountable for their deceptive practices.   \nYou may think it's not worth it but I think you should hold them accountable for the mental stress and harassment.",
        "man. Escalate. Why are u holding up? Like value your time man. Those clowns are not doing their job properly , cheating and on top of all that gas lighting. Its a good thing you are informing us so that we can be careful, but it wud slightly more productive if you complaint the top office , so they think twice brfore fckin with customers",
        "Will do. Don't worry I am a hard ball and won't let them get away easy :)",
        "Complaint on consumer forum ingram online. It'll be resolved.",
        "I completely agree with you and I won't let them off easy. They just took it too far to prove that I was being dishonest. Thanks for commenting!",
        "Absolutely..I won't let them off easy. I absolutely value my time and they took it too far. They were very prompt with their email responses and the packing video was sent to me just this morning, followed by the tracking details. They haven't replied to my last mail sent before i posted here. It's elections in Karnataka and I want this to have a big impact so holding my horses for now. Posted to reddit to get the message out in the meanwhile. Thanks for sharing your thoughts, escalate I definitely will :)",
        "Just complaint to consumer forum and send them notice of it.",
        "If the package was delivered by blue dart there is no way it was stolen in transit it's the best delivery service out there. The seller didn't send it to you and is blatantly lying.",
        "Absolutely and despite being such a large entity decided to go to great lengths by creating a fake video to prove that they are right and I am wrong ...and all for some bits of plastic. Shameless!!  🤬.",
        "Probably covering their asses.",
        "I am too invested in this...i don't even care for the damn jibbitz. I will expose this everywhere i possibly can. Thank for your advice!",
        "So the Spiderman on my kids crocs are jibbitz?\n\nAlso, just buy the generic ones on any ecomm site, instead of OG Crocs. It's the same stuff for 3x less. Probably no jibbits though.",
        "Yes that's the one. Thanks for your advice:)",
        "Lol by making a fake video and forgetting to change the date and time stamp ...rookie mistake :)",
        "Edited it as suggested..hope it's easier to read now :)",
        "What was your mode of payment ?",
        "Prepaid with my CC.",
        "Whoever is behind this not just a cheat but a stupid too. They could just go back and check when they packed and shipped in their records and then edit the cctv date 🤣 They just edited to one day before you called without using common sense. Good for us though. All the solid proof is right there on platter.\n\nWhat if they have done this or do this on bigger orders too and edit smartly? Unethical people can go to any lengths. Best to not order from Crocs website I presume.",
        "Absolutely..they literally gave me all the evidence i need themselves. Complete rookies!!",
        "not the same crocs right? xD",
        "why do you like crocs",
        "You can raise the dispute with CC and get the money . I would rather suggest taking them to the consumer court and get some good cash from them instead . Oh don't forget to shit on their Twitter",
        "Definitely, thanks for the great advice!",
        "I hope this story gets picked up by some media outlet or at least gets blown out in twitter or facebook. These blood sucking vampires must be made a public laughing stock.",
        "Leather shoes are best for people with hyperhidrosis... I use them myself",
        "What's jibbitz?",
        "Anyone with the non-imgur mirror link of the video? For some reason, neither my android devices nor the apples ones are able to play or load imgur links from reddit.",
        "What a bunch of jagoffs, it would take a few seconds to give you the credit for the missing item. Instead they make a fake video. The douchebag who made this should be sacked asap",
        "File police complaint,FIR won't be loged but chances are complaint could be registered. Share it with them and they will compensate you to the extend damange costed.",
        "Let me know if you are still facing issues and we can figure a way for you to view their incredible fake video :)",
        "All for a few jibbitz which would have cost them peanuts in any case. It's incredible that they went to these extreme lengths 😂.",
        "Thanks for the advice!",
        "Unfortunately, yes. Imgur just doesn’t open for me.",
        "Here is a wetransfer link to the video. Hope it works for you.  https://we.tl/t-hk0r1qXjmz",
        "Lmao, man. This is as ridiculous as it gets. Creating a fake video to gaslight you but couldn't spend that much effort in actually ensuring all your stuff was delivered. I hope it creates a buzz on social media.",
        "I know right....it's almost unbelievable 😂",
        "Social media naming and shaming with the uncontestable proofs attached, should generate a lot of heat. It's not about the mistake, it's the ridiculous cover up that deserves someone losing their job",
        "File a case in Consumer court",
        "sue them, easy money LMFAO",
        ">It's the same stuff for 3x less.\n\nAlthough crocs are overpriced it's not the same stuff as those cheap pairs. Plastic quality is much better. It dries up faster and generates less heat. I have found only Bata comes 2nd to these.",
        "Those become stinky too.. i love regular running/casual shoes from any good brand like adidas, nike that come with breathable soft fabric",
        "Will be tweeting this shortly with Crocs US in copy. Will update with the Twitter link...please do share if possible.",
        "Which website did you buy from?",
        "Crocs.in",
        "Thank you for this. I am on a call with them right now and I can't believe how amazing and efficient they are. :) I need to upload all my evidence now ...will keep you and everyone else updated on this.",
        "Saw",
        "Yes they are very efficient, I registered a complaint against Unacademy and within a week Unacademy’s legal dept reached out to me",
        "Hope it got resolved to your satisfaction.",
        "Hey, do you have the contact details of their head office? These f\\*\\*kers lied to me with false information regarding the compatibility of Jibbitz with the Crocs Literide model. When I asked them to clip it to the clog, they were like, these wont fit your shoe's sir. I had already made the payment and they refused to give back a refund.",
        "Get the email address from their website"
    ],
    "cleaned_text": "crocs made fake video gaslight cheat apologies advance long post know sounds incredulous hear ordered pair clogs jibbitz kid st april received order received clogs didnt think much thought jibbitz delivered seperately later checked order details realised jibbitz marked delivered called customer care extremely rude even hung ask email customer support emailed crocs customer support thats saga began asked unboxing video really promised investigation obviously unboxing video asked proof jibbitz packed end sent pictures packing center jibbitz question clearly visible point didnt think check date time stamp later told possible opened package jibbitz copy pasted older message livid point implying lying invested angry point give told send packing video end prove since thought appropriate ask unboxing video also threatened legal action insinuating dishonest trying cheat jibbitz anyways send video actually checked time stamp video quite hilarious two people packing orders however one packing order showing everything packed camera one packing normally like said checked date time stamp th april knew something actually sent package shown video received jibbitz point questioning somehow thrown away jibbitz knew actually received clogs checked call records realised first called customer care th meant would probably received package th hadnt immediately actioned missing jibbitz looked evidence product actually delivered tracking number order details delivery partner emailed crocs back asked delivery partner replied usual copy pasted message investigated yada yada send logistics partners name bluedart needed tracked order bluedart wont believe product delivered th april packed per video sent crocs bluedart also picked package nd whole days packed order understand someone like crocs would go extent creating fake video prove wrong right mean jibbitz end day worst part going extra mile making fake video prove lying atleast well fake date cctv recording tooso half baked receipts edit imgur links fake video sent crocs blue darts tracking details note time stamps emailed back highlighting appalling behaviour shocking fake video created await response want word get point also given jibbitz shocked level gaslighting thought write share edits link fake video created sent crocs note date time stamp link bluedart tracking details note delivery date time bluedart managed deliver package crocs even packed later day please feel free share post especially media friends would love get blown tia update posted twitter please share thank update registered grievance national consumer helpline advised many uploaded evidence awaiting resolution nch absolutely amazing helpful efficient happy something works well country ",
    "cleaned_title": "crocs made fake video gaslight cheat",
    "cleaned_selftext": "apologies advance long post know sounds incredulous hear ordered pair clogs jibbitz kid st april received order received clogs didnt think much thought jibbitz delivered seperately later checked order details realised jibbitz marked delivered called customer care extremely rude even hung ask email customer support emailed crocs customer support thats saga began asked unboxing video really promised investigation obviously unboxing video asked proof jibbitz packed end sent pictures packing center jibbitz question clearly visible point didnt think check date time stamp later told possible opened package jibbitz copy pasted older message livid point implying lying invested angry point give told send packing video end prove since thought appropriate ask unboxing video also threatened legal action insinuating dishonest trying cheat jibbitz anyways send video actually checked time stamp video quite hilarious two people packing orders however one packing order showing everything packed camera one packing normally like said checked date time stamp th april knew something actually sent package shown video received jibbitz point questioning somehow thrown away jibbitz knew actually received clogs checked call records realised first called customer care th meant would probably received package th hadnt immediately actioned missing jibbitz looked evidence product actually delivered tracking number order details delivery partner emailed crocs back asked delivery partner replied usual copy pasted message investigated yada yada send logistics partners name bluedart needed tracked order bluedart wont believe product delivered th april packed per video sent crocs bluedart also picked package nd whole days packed order understand someone like crocs would go extent creating fake video prove wrong right mean jibbitz end day worst part going extra mile making fake video prove lying atleast well fake date cctv recording tooso half baked receipts edit imgur links fake video sent crocs blue darts tracking details note time stamps emailed back highlighting appalling behaviour shocking fake video created await response want word get point also given jibbitz shocked level gaslighting thought write share edits link fake video created sent crocs note date time stamp link bluedart tracking details note delivery date time bluedart managed deliver package crocs even packed later day please feel free share post especially media friends would love get blown tia update posted twitter please share thank update registered grievance national consumer helpline advised many uploaded evidence awaiting resolution nch absolutely amazing helpful efficient happy something works well country",
    "cleaned_comments": "person ordered perfume nykaa worth sent spanner remote unfortunately film unboxing proof nykaa refusing initiate refund tldr take video unboxing online ordered package proof received items accept tampered broken seal boxes fact video fake blatantly obvious showing items camera guy packing stuff without showing anything obviously created messaged dont understand people buy crocs everyone seems love bought hype realised cheap plastic footwear sweat feet walk sweat removed office slipped fell front staff wet slippy feet know right dont understand went lengths jibbitz hype gets worst us almost jumped hype wagon almost bought budget smartwatch would get rupees glad thought twice dodged bullet friend bought one regrets since budget watches basically rebadged chinese watches since regular km walks ive worn two crocs soles till holes cut feet places black ones get scalding hot sun let many stones looked third pair seemed avoid problems could buy two pairs good sneakers k stop emailing customer support instead write nice email head office problem get solved caught red handed dont indians tldr long post way im gon na read crap without summary convincing whats jibbitz great questioni wouldnt known either wasnt parent little characters shapes attached crocs classy look adults heading kind implies shoes plus accessories ordered received shoes upon contacting cs missing accessories op sent packing video package timestamped whole hour already delivered tags kinda thing put holes clogs make look attractive thats bloody insane lmao email head office nicely would really surprised didnt get money back another shipment sent thanks info didnt know called jibbitz one suggestion please use paragraphs yea googled later thanks really turned comedy sketch sent video morning tracking details afternoon wait reply mail dont hear definitely escalate thanks hopefully never type big wall text definitely keep mind thank definitely escalate dont hear back dont twitter works us weird even childish didnt want send jizzbits could said investigated nothing went wrong would hated would end making fake video wild even small time insta seller would try stuff like dont use sm except reddit hopefully reply apology send missing jibbitz try get one friends tweet behalf video sent morning quite fresh besides shock also laugh saw time stamp thought share ok fair although im pretty confident directly raising crocs twitter would faster much much faster absolutely idea thinking reason film unboxing every single package receive even priced inr great didnt give sent fake video online shopping lot really infuriating customer care give stereotype answers responses sometimes even questions different answers always dont bother contacting theyve given enough grounds believe theyre acting bad faith engaging kind fraud take straight consumer court call helpline tell whats happened responses medium quick time bound continue act bad faith always see court thanks making liar infuriated got super invested sending fake evidence sent complete order know hadnt made super persistent thanks advice sorry sympathy people buy crocs op try register complaint consumer forum helped lot past thanks advice lmao crocs store sold used pair refused exchange different size raised hell customer support ultimately got way american companies known penny wise pound foolish standard dialogue customer care executives checked warehouse check delivery people half people give time find helpline wait till number comes amazon solves issues gives instant refund cant order expensive stuff lot sellers selling fake products original packing use crocs bathing walking house outside house malls anywhere everywhere look decent comfortable care elaborate man gives reason use credit card instead blindly using upi cash credit card gives option open dispute merchant proof im sure would got money back time problem trustless society many customers cheat sellers many sellers cheat customers hard anyone trust anyone hawaii chappal roadside lasts longer crocs left mine sun day washing days later developed cracks learned lesson come mean even something special offers something others cant retarded overpriced footwear dont understand people india even buy shit way better alternatives available man please make part mean also complain consumer portal lol definitely update crocs say ghastly childish behaviour pretty quick email replies last email evidence lies surprisingly furnished thanks advice also threaten customer care guy legal action would complain seniors hr register complaint consumer forum share linkedin tag ceo brand sales head thanks advice website order bought crocs k returned trying got thing relaxo take legal action people deserve heat crocsin worst shoes someone hyper hidrosis serious linkedin new customer service portal able get response resolution tech leads sales leads linkedin queries customer service people unable resolve thanks im goona buy offline showroom hey post twitter shame jizzbits fun ready wan na know happens next please update us thank f jibbitz exactly dude playing cheap dirty game one person flash packing crocs cctv persons packing silently like want steal guess thats pack product already delivered thank youwill definitely update copy pasting reply question earlier great questioni wouldnt known either wasnt parent little characters shapes attached crocs classy look adults hats diligence persistence complain forums social media sites possible unprofessional cheaters liars lol first mistake buy crocs thank definitely escalate tldr hope people blow outrages coming huge company crocs hi op please make account twitter tag swear try tire customer care public support people making joke company reach missing items probably fire employees doesnt happen many instances working kind commenter go shoes plus accessories ordered received shoes upon contacting cs missing accessories op sent packing video package timestamped whole hour already delivered hope extremely unethical one knows many prepaid customers might fobbed like thanks advice funny completely unacceptable large corporation like crocs something like working crocs heads would definitely rolling thanks quoted reply another commentator wasnt sure would like tagged didnt absolutely also please keep us updated im invested lol jizzbits done prefer amazon better customer support dont like ask refund option offline store mention email pursue nchumang proofs often mention enough companies back still go make complaint plastic ones obviously made recycled trash keep sun become yellow brittle dont go consumer court register consumer grievance first quick response customer care department zomato air asia take every one granted someone holds accountable dont even understand kind management would allow staff something like hope dont settle refund replacement called lier wow thats truly infuriating experience crocs disheartening hear practices lengths went create fake video prove wrong astonishing unprofessional may worth considering consulting legal professional provide appropriate guidance based evidence assess situation advise best course action seek resolution hold crocs accountable deceptive practices may think worth think hold accountable mental stress harassment man escalate u holding like value time man clowns job properly cheating top gas lighting good thing informing us careful wud slightly productive complaint top office think twice brfore fckin customers dont worry hard ball wont let get away easy complaint consumer forum ingram online itll resolved completely agree wont let easy took far prove dishonest thanks commenting absolutelyi wont let easy absolutely value time took far prompt email responses packing video sent morning followed tracking details havent replied last mail sent posted elections karnataka want big impact holding horses posted reddit get message meanwhile thanks sharing thoughts escalate definitely complaint consumer forum send notice package delivered blue dart way stolen transit best delivery service seller didnt send blatantly lying absolutely despite large entity decided go great lengths creating fake video prove right wrong bits plastic shameless probably covering asses invested thisi dont even care damn jibbitz expose everywhere possibly thank advice spiderman kids crocs jibbitz also buy generic ones ecomm site instead og crocs stuff x less probably jibbits though yes thats one thanks advice lol making fake video forgetting change date time stamp rookie mistake edited suggestedhope easier read mode payment prepaid cc whoever behind cheat stupid could go back check packed shipped records edit cctv date edited one day called without using common sense good us though solid proof right platter done bigger orders edit smartly unethical people go lengths best order crocs website presume absolutelythey literally gave evidence need complete rookies crocs right xd like crocs raise dispute cc get money would rather suggest taking consumer court get good cash instead oh dont forget shit twitter definitely thanks great advice hope story gets picked media outlet least gets blown twitter facebook blood sucking vampires must made public laughing stock leather shoes best people hyperhidrosis use whats jibbitz anyone nonimgur mirror link video reason neither android devices apples ones able play load imgur links reddit bunch jagoffs would take seconds give credit missing item instead make fake video douchebag made sacked asap file police complaintfir wont loged chances complaint could registered share compensate extend damange costed let know still facing issues figure way view incredible fake video jibbitz would cost peanuts case incredible went extreme lengths thanks advice unfortunately yes imgur doesnt open wetransfer link video hope works lmao man ridiculous gets creating fake video gaslight couldnt spend much effort actually ensuring stuff delivered hope creates buzz social media know rightits almost unbelievable social media naming shaming uncontestable proofs attached generate lot heat mistake ridiculous cover deserves someone losing job file case consumer court sue easy money lmfao stuff x less although crocs overpriced stuff cheap pairs plastic quality much better dries faster generates less heat found bata comes nd become stinky love regular runningcasual shoes good brand like adidas nike come breathable soft fabric tweeting shortly crocs us copy update twitter linkplease share possible website buy crocsin thank call right cant believe amazing efficient need upload evidence keep everyone else updated saw yes efficient registered complaint unacademy within week unacademys legal dept reached hope got resolved satisfaction hey contact details head office fkers lied false information regarding compatibility jibbitz crocs literide model asked clip clog like wont fit shoes sir already made payment refused give back refund get email address website",
    "light_cleaned_title": "Crocs made a fake video to gaslight and cheat me!",
    "light_cleaned_selftext": "Apologies in advance for the long post. I know this sounds incredulous but hear me out. I had ordered a pair of clogs and some jibbitz for my kid on 21st April. When I received my order i received only the clogs. I didn't think much of it and thought the jibbitz will be delivered seperately. Later when I checked my order details I realised that the jibbitz were marked as delivered too so I called up their customer care who were extremely rude and even hung up on me but did ask me to email their customer support. I emailed Crocs customer support and that's when the saga began. They asked me for an unboxing video (really) and promised to do an investigation. I obviously did not have any unboxing video so I asked for proof that the jibbitz were packed at their end. They sent me some pictures of their packing center where the jibbitz in question were clearly visible. At this point I didn't think to check the date and time stamp (more on this later). I then told them it was not possible as I opened the package myself and there were no jibbitz. They then copy pasted their older message. I was livid at this point because what they were implying was that I was lying and I was too invested and angry at this point to give up. I told them to send me a packing video from their end to prove themselves since they thought it was appropriate to ask for an unboxing video and I also threatened legal action for insinuating that I was dishonest and trying to cheat them of a few jibbitz. Anyways they did send me a video and this was when I actually checked the time stamp. The video was quite hilarious by itself as there were two people packing orders however the one packing my order was showing everything he packed to the camera, the other one was just packing normally. Like i said i checked the date and time stamp which was 24th April 17:13. I knew something was off because if they had actually sent me the package as shown in the video I should have received the jibbitz. At this point I was questioning myself if i had somehow thrown away the jibbitz but i knew that all i had actually received were the clogs. I checked my call records and realised I had first called the customer care on 25th which meant that i would have probably received the package on 24th as I hadn't immediately actioned the missing jibbitz. I looked for more evidence on when the product was actually delivered to me and all I had was the tracking number on my order but no details as to who the delivery partner was . I then emailed Crocs back and asked about the delivery partner. They replied with the usual copy pasted message that they had investigated yada yada but did send me the logistics partner's name which was Bluedart. This was all I needed, i tracked the order on Bluedart and you won't believe but the product was delivered to me at 13:15 on 24th April before it was packed as per the video sent to me by Crocs. Bluedart had also picked the package from them on 22nd, 2 whole days before they packed my order. I cannot understand why someone like Crocs would go to the extent of creating a fake video to prove that I am wrong and they were right. I mean it was just a few jibbitz at the end of the day. The worst part is if they were going the extra mile and making a fake video to prove that I was lying then atleast do it well, fake the date on the CCTV recording too..so half baked! I do have all the receipts - will edit with imgur links the fake video sent by Crocs and blue dart's tracking details. Do note the time stamps on them. I have emailed them back highlighting their appalling behaviour and the shocking fake video they created and while i await their response, I just want the word to get out on this. At this point I have also given up on the jibbitz but i am shocked at the level of gaslighting and thought I should write about it and share with all of you. Edits Link to the fake video created and sent by crocs. Do note the date and time stamp Link to Bluedart tracking details. Do note the delivery date and time. Bluedart has managed to deliver the package to me before Crocs even packed it later that day. 😂 Please feel free to share this post especially with your media friends. I would love for this to get blown up. TIA! Update - Posted on Twitter Please do share! Thank you. Update Have registered my grievance with the National Consumer Helpline as advised by many of you. Have uploaded the evidence and now awaiting resolution. The NCH is absolutely amazing, helpful and efficient. So happy that we have something that works so well in our country :)",
    "light_cleaned_comments": "A person ordered some perfume from nykaa worth 3000₹. But they sent him a spanner and a remote. Unfortunately he did not film the unboxing and has no proof. nykaa is now refusing to initiate refund. Tldr: take video of unboxing an online ordered package as proof of received items. Do not accept tampered or broken seal boxes. The fact that the video is fake is so blatantly obvious. He is showing the items on camera while the other guy is packing stuff without showing anything. It was obviously created after you messaged them. I don’t understand why people buy crocs. Everyone seems to love it. I bought in on the hype and realised its just cheap plastic footwear. I sweat on my feet and walk in that same sweat, once I removed them in office and slipped and fell in front of my staff from my own wet slippy feet. I know right ...i don't understand why they went to such lengths for a few jibbitz 😂 Hype gets the worst of us. I almost jumped on the hype wagon and almost bought those budget smartwatch you would get for 1500 rupees. Glad I thought twice and dodged a bullet. My friend bought one and now he regrets it since most of the budget watches are basically rebadged Chinese watches. Since I do regular 6 km walks, I've worn down two crocs soles till they had holes. They cut my feet at places. The black ones get scalding hot in the sun. They let in too many stones. I looked at a third pair which seemed to avoid the problems but I could buy two pairs good sneakers for 6k. Stop emailing customer support. Instead, write a nice email to the head office. Your problem should get solved. Caught Red handed Why don't Indians do a tldr after a long post? No way I'm gonna read the crap without having a summary to convincing me to. What's jibbitz? Great question...i wouldn't have known either if I wasn't a parent. It's those little characters and shapes that can be attached to your crocs. Not a classy look for adults :) The heading kind of implies that .. Shoes plus accessories were ordered. Received shoes. Upon contacting CS about missing accessories OP was sent a packing video of the package timestamped a whole 1 hour after it was already delivered. The tags kinda thing which you put in the holes of clogs to make it look more attractive that's bloody insane lmao. email head office nicely, I would be really surprised if you didn't get your money back & another shipment sent out to you. Thanks for the info. I didn't know they are called jibbitz 😅. One suggestion, please use paragraphs . Yea I googled it later. Thanks It really has turned into some comedy sketch 😂. They sent me the video this morning and the tracking details in the afternoon. I will wait for their reply to my mail and if i don't hear from them will definitely escalate. Thanks. Hopefully i will never have to type such a big wall of text again, but if i do ..will definitely keep it in mind. Thank you. Will definitely escalate if i don't hear back from them. Why don't you just @ their Twitter. Works for the 99% of us! This is so weird. Even childish. if they didn't want to send you the jizzbits they could have just said we investigated, nothing went wrong. You would have hated them, but it would have been the end of it. Making a fake video is just wild. Even a small time insta seller would not try stuff like this. I don't use any SM except reddit . Hopefully they will reply with an apology and send the missing jibbitz. If not will try and get one of friends to tweet on my behalf. The video was only sent to me this morning so it's all quite fresh. Besides the shock i also had a laugh when I saw the time stamp so thought I should share :) Ok fair. Although you should. I'm pretty confident that directly raising it with crocs on Twitter would be faster, much much faster. Absolutely! I have no idea what they were thinking!!! The very reason I film unboxing of every single package I receive even when it's priced at 1 INR. It's great that you didn't give up after they sent you the fake video. I do online shopping a lot and it is really infuriating when customer care give stereotype answers and responses. Sometimes even if the questions are different , their answers are always the same. Don't bother with contacting them again. They've given you enough grounds to believe they're acting in bad faith and engaging in some kind of fraud. Take it straight to consumer court. Call the helpline. Tell them what's happened. Responses through that medium are quick and time bound. And if they continue to act in bad faith you can always see them in court. Thanks ...it was the making me out to be a liar that infuriated me and I got super invested. Them sending me (fake) evidence that they had sent me the complete order when I know that they hadn't made me super persistent :) Thanks for the advice! Sorry I have no sympathy with people who buy crocs OP try to register your complaint with consumer forum too helped me a lot in past Thanks for the advice! Lmao a crocs store sold me a used pair and refused to exchange it for a different size. I raised hell with their customer support and ultimately got my way. American companies are known to be penny wise and pound foolish. This is the standard dialogue of most of the customer care executives that we checked our warehouse and now we should check with the delivery people. Half of the people give up after this as who has the time to find the helpline no. then wait till your number comes. Amazon solves most of the issues & gives instant refund but then we can't order expensive stuff from there as there are lot of sellers selling fake products in original packing. Because i use crocs for bathing, walking in my house, outside my house, malls, anywhere and everywhere. They look decent and are comfortable Care to elaborate? Man this gives me more reason to use my credit card instead of blindly using upi or cash. My credit card gives me the option to open up a dispute with the merchant and with the proof you have, I’m sure I would have got my money back in no time. This is the problem of a trustless society. So many customers cheat sellers, so many sellers cheat customers it’s hard for anyone to trust anyone. A 100₹ Hawaii chappal from roadside lasts longer than crocs. I left mine in the sun for a day after washing them and a few days later it developed cracks. I learned my lesson. Come on, I mean it's not even something special that offers something others can't. It's just retarded overpriced footwear. I don't understand why people in India even buy that shit when we have way better alternatives available. Man please do make a part 2 of this mean while also complain on consumer portal. Lol will definitely update with what Crocs have to say about their ghastly childish behaviour 😂. They were pretty quick with their email replies until my last email to them with all the evidence about their lies..... all surprisingly furnished by them 😂. Thanks for the advice! Also threaten the customer care guy with legal action and that you would complain about him to his seniors and HR. How do you register a complaint in the consumer forum? Share it on LinkedIn and tag the CEO, Brand and Sales Head. Thanks for the advice :) /s on which website did you order I bought crocs for 4.5K and returned them after trying them on. Got the same thing from Relaxo for 350 ₹. Take legal action. These people deserve some heat On crocs.in :) Worst shoes for someone with hyper hidrosis I am serious. LinkedIn is the new customer service portal. I have been able to get response and resolution from tech leads and sales leads on LinkedIn on queries that their customer service people are unable to resolve. thanks. I'm goona buy at offline showroom then Hey, post this on Twitter and shame them Jizzbits 💀 This was fun to ready. Wanna know what happens next. Please do update us. Thank you What the f is jibbitz? Exactly dude 😂 why are they playing such cheap dirty game Why only one person is flash packing the crocs into cctv and other persons are packing so silently like they want to steal 🤣🤣 😂😂😂 I guess that's how you pack after the product is already delivered Thank you...will definitely update :) Copy pasting my reply to the same question earlier - Great question...i wouldn't have known either if I wasn't a parent. It's those little characters and shapes that can be attached to your crocs. Not a classy look for adults :) 🤣 Hats off to your diligence and persistence! Do complain at all the forums and social media sites as possible. Very Unprofessional of them , cheaters and liars😈 Lol 😅 First mistake was to buy crocs Thank you :) ....will definitely escalate this. Tldr? I hope people blow this up, this is so outrages coming from a huge company such as crocs. Hi op , please make a account on Twitter and tag them , I swear they will try to tire you out on customer care , with public support and people making a joke out of the company they will reach out to you for the missing items and probably fire the employees so that this doesn't happen again , there are many instances of this working A kind commenter did it for me, here you go - \"Shoes plus accessories were ordered. Received shoes. Upon contacting CS about missing accessories OP was sent a packing video of the package timestamped a whole 1 hour after it was already delivered.\" I hope so too! It's extremely unethical and no one knows how many prepaid customers they might have fobbed off like this. Thanks for the advice, i will. As funny as it all is it's completely unacceptable that a large corporation like Crocs can do something like this. If i was working at Crocs... heads would definitely be rolling. Thanks for this. I quoted you in a reply to another commentator. Wasn't sure if you would like to be tagged so didn't. Absolutely. also please keep us updated I'm invested in this now lol >jizzbits why? 😂 Done! I prefer amazon. Better customer support. And if you don't like them you can ask for a refund. No such option with an offline store. Mention in the email you will pursue on NCH/Umang with the proofs. Often the mention is enough for companies to back down. And then still go on to make the complaint. The plastic ones are so obviously made from recycled trash. Keep them in the sun and they will become yellow and brittle Why don't you go to consumer court? Register a consumer grievance first. I had a quick response (not customer care department) from zomato and air asia only after doing this. They will take every one for granted until someone holds them accountable. I don't even understand what kind of management would allow their staff to do something like this. I hope you don't settle for a refund or replacement after being called a lier Wow, that's truly an infuriating experience you had with Crocs! It's disheartening to hear practices. The lengths they went to create a fake video to prove you wrong are astonishing and unprofessional. It may be worth considering consulting with a legal professional who can provide you with appropriate guidance based on the evidence you have. They can assess the situation and advise you on the best course of action to seek a resolution and hold Crocs accountable for their deceptive practices. You may think it's not worth it but I think you should hold them accountable for the mental stress and harassment. man. Escalate. Why are u holding up? Like value your time man. Those clowns are not doing their job properly , cheating and on top of all that gas lighting. Its a good thing you are informing us so that we can be careful, but it wud slightly more productive if you complaint the top office , so they think twice brfore fckin with customers Will do. Don't worry I am a hard ball and won't let them get away easy :) Complaint on consumer forum ingram online. It'll be resolved. I completely agree with you and I won't let them off easy. They just took it too far to prove that I was being dishonest. Thanks for commenting! Absolutely..I won't let them off easy. I absolutely value my time and they took it too far. They were very prompt with their email responses and the packing video was sent to me just this morning, followed by the tracking details. They haven't replied to my last mail sent before i posted here. It's elections in Karnataka and I want this to have a big impact so holding my horses for now. Posted to reddit to get the message out in the meanwhile. Thanks for sharing your thoughts, escalate I definitely will :) Just complaint to consumer forum and send them notice of it. If the package was delivered by blue dart there is no way it was stolen in transit it's the best delivery service out there. The seller didn't send it to you and is blatantly lying. Absolutely and despite being such a large entity decided to go to great lengths by creating a fake video to prove that they are right and I am wrong ...and all for some bits of plastic. Shameless!! 🤬. Probably covering their asses. I am too invested in this...i don't even care for the damn jibbitz. I will expose this everywhere i possibly can. Thank for your advice! So the Spiderman on my kids crocs are jibbitz? Also, just buy the generic ones on any ecomm site, instead of OG Crocs. It's the same stuff for 3x less. Probably no jibbits though. Yes that's the one. Thanks for your advice:) Lol by making a fake video and forgetting to change the date and time stamp ...rookie mistake :) Edited it as suggested..hope it's easier to read now :) What was your mode of payment ? Prepaid with my CC. Whoever is behind this not just a cheat but a stupid too. They could just go back and check when they packed and shipped in their records and then edit the cctv date 🤣 They just edited to one day before you called without using common sense. Good for us though. All the solid proof is right there on platter. What if they have done this or do this on bigger orders too and edit smartly? Unethical people can go to any lengths. Best to not order from Crocs website I presume. Absolutely..they literally gave me all the evidence i need themselves. Complete rookies!! not the same crocs right? xD why do you like crocs You can raise the dispute with CC and get the money . I would rather suggest taking them to the consumer court and get some good cash from them instead . Oh don't forget to shit on their Twitter Definitely, thanks for the great advice! I hope this story gets picked up by some media outlet or at least gets blown out in twitter or facebook. These blood sucking vampires must be made a public laughing stock. Leather shoes are best for people with hyperhidrosis... I use them myself What's jibbitz? Anyone with the non-imgur mirror link of the video? For some reason, neither my android devices nor the apples ones are able to play or load imgur links from reddit. What a bunch of jagoffs, it would take a few seconds to give you the credit for the missing item. Instead they make a fake video. The douchebag who made this should be sacked asap File police complaint,FIR won't be loged but chances are complaint could be registered. Share it with them and they will compensate you to the extend damange costed. Let me know if you are still facing issues and we can figure a way for you to view their incredible fake video :) All for a few jibbitz which would have cost them peanuts in any case. It's incredible that they went to these extreme lengths 😂. Thanks for the advice! Unfortunately, yes. Imgur just doesn’t open for me. Here is a wetransfer link to the video. Hope it works for you. Lmao, man. This is as ridiculous as it gets. Creating a fake video to gaslight you but couldn't spend that much effort in actually ensuring all your stuff was delivered. I hope it creates a buzz on social media. I know right....it's almost unbelievable 😂 Social media naming and shaming with the uncontestable proofs attached, should generate a lot of heat. It's not about the mistake, it's the ridiculous cover up that deserves someone losing their job File a case in Consumer court sue them, easy money LMFAO >It's the same stuff for 3x less. Although crocs are overpriced it's not the same stuff as those cheap pairs. Plastic quality is much better. It dries up faster and generates less heat. I have found only Bata comes 2nd to these. Those become stinky too.. i love regular running/casual shoes from any good brand like adidas, nike that come with breathable soft fabric Will be tweeting this shortly with Crocs US in copy. Will update with the Twitter link...please do share if possible. Which website did you buy from? Crocs.in Thank you for this. I am on a call with them right now and I can't believe how amazing and efficient they are. :) I need to upload all my evidence now ...will keep you and everyone else updated on this. Saw Yes they are very efficient, I registered a complaint against Unacademy and within a week Unacademy’s legal dept reached out to me Hope it got resolved to your satisfaction. Hey, do you have the contact details of their head office? These f\\*\\*kers lied to me with false information regarding the compatibility of Jibbitz with the Crocs Literide model. When I asked them to clip it to the clog, they were like, these wont fit your shoe's sir. I had already made the payment and they refused to give back a refund. Get the email address from their website"
}