{
    "id": "1cb21oe",
    "title": "Why do we do the “Quarterly Members’ & Donors’ calls” / For all the johnny-come-lately`s | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1cb21oe/why_do_we_do_the_quarterly_members_donors_calls/",
    "selftext": "&#x200B;\n\n[ ](https://preview.redd.it/dyajbwnnq7wc1.jpg?width=1280&format=pjpg&auto=webp&s=edec8fb2e38463fa9cba973e21b7e2568601d286)\n\n*Come, say hi & ask us many questions in our Quarterly Member’s Call for 2024 on Thursday, 25th April 2024 at 5:30 PM IST.* \n\n \n\n## Who are we?\n\nThe Internet Freedom Foundation (IFF), is an impact-oriented and award-winning Indian digital rights advocacy organisation.\n\nWe seek to ensure that technology respects human rights. Born out of the SaveTheInternet movement, over the last seven years, IFF has worked to advance constitutional rights in a shared, collective vision for a free and open internet. We're committed to defending and expanding  fundamental rights as India gets more digitally connected. As part of  this mandate, we strategically engage with courts, regulators, and other  legal institutions across India. We work across a wide range of issues  with expertise in internet shutdowns, website blocking, data protection, surveillance reform and intermediary liability.\n\nIFF’s primary  objective has been to bring together campaigners, policy experts, lawyers, technologists and artists to build an open, safe and  progressive digital ecosystem that respects human rights. IFF adopts a  framework of civic literacy and engagement through online campaigning  channelled towards institutional change. We regularly engage with  courts, parliamentary bodies and government agencies over a broad range of digital rights issues. IFF strengthens its work with principles of  collaboration and unleashing the power of being a community-centric  organization. Through this structure, IFF has been able to successfully  work on a range of digital rights issues through a variety of  approaches.  \n\n## Radical Transparency\n\nAs  a tiny, donor-funded organisation which relies upon contributions from  the people of India, your support and faith can only be maintained with  greater transparency about our financial needs, fund inflows, and  expenses. And we do this by \n\n* Proactively publishing monthly financial disclosures, with income and expenditure figures. ([here](https://forum.internetfreedom.in/t/financial-disclosure-2023/3368?ref=static.internetfreedom.in)) \n* Publishing tax reports, filings and documents related to board governance. ([here](https://internetfreedom.in/transparency-and-finances/?ref=static.internetfreedom.in)) \n* Hosting quarterly members’ and donors’ calls to touch base with our biggest cheerleaders, YOU GUYS! ([here](https://youtube.com/playlist?list=PLgcwCSsOJipovlZ5S6VdoKF_MsBgmCQ8J&si=wBn0oaN6ZN4fJRvZ&ref=static.internetfreedom.in)) \n\n## What goes on in these “Quarterly Members’ and Donors’ calls and why do we host them? \n\nWhile  a lot of you are familiar with IFF’s quarterly members’ and donors’  calls, we wanted to talk a moment to explain why we do these calls. \n\nAs  a small donor-funded organisation, supported by Indian citizens like  you, we strongly believe that your faith in our work can only be  maintained with greater transparency. \n\n### What are you funding? \n\nIn  our quarterly calls, we walk you, our community, through what your  money and support are going towards, what we have been working on for  the last quarter, issues that we are closely following, critical  developments that shape our digital rights landscape, and our responses  to them. \n\nThe presentation part of the call is live-streamed  through our social media channels, but as a member/donor, YOU get a  chance to engage directly with the IFF staff and the community. Every  quarter, all our supporters get to hop on the call and ask us questions,  give their input/feedback, and hold us accountable! \n\n## 2024, the election szn, and beyond. \n\nBetween  April 19 and June 4, 2024, 96 crore Indian voters will elect the 18th  Lok Sabha in the largest-ever election in the world. Concurrently,  elections will also take place for the Legislative Assemblies in  multiple states and by-elections for 35 seats in 16 states.\n\nThe stakes for our democracy are higher than ever[ and we’re keeping our eyes](https://freeandfair.in/?ref=static.internetfreedom.in) on the ways in which technology is shaping electoral processes and outcomes.\n\nAs  the avenues of democratic civic spaces of resistance continue  shrinking, we need to participate in democracy in deeper and more  meaningful ways. Engaging with our community is critical for us to grow  and stay transparent about our work and vision, not only in the digital  rights scape but generally in our rights-centric advocacy efforts. \n\nYour  support is what makes our collective vision for a transparent,  accountable and free internet possible. Following feedback from our  community, we’ve also revamped our subscription tiers to make supporting  our work even easier!\n\n&#x200B;\n\n## Join us! \n\nWe’re hosting our second Quarterly  Member’s Call for 2024 on Thursday, 25th April 2024 at 5:30 PM IST.  Members & Donors - check your inboxes for an invite! \n\nPlease mark your calendar and join us for this fun and insightful conversation  with IFF staffers and meet the inaugural cohort of the [Freedom Innovation Fellows](https://internetfreedom.in/iffs-freedom-innovation-fellowship/?ref=static.internetfreedom.in).\n\nWe will also live-stream the call on [Twitter](https://twitter.com/i/broadcasts/1OyJAWdrzEyKb?ref=static.internetfreedom.in) and [YouTube](https://www.youtube.com/live/0yX1VL8gY44?feature=shared&ref=static.internetfreedom.in) if you’re not a member ([become one?](https://internetfreedom.in/donate/?ref=static.internetfreedom.in)). ",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1713871233.0,
    "convurl": "https://external-preview.redd.it/Cdnov9rjkJfd15S12qPZyRBcq1MK3DjT1b1J4rXFxsg.jpg",
    "comments": [],
    "cleaned_text": "quarterly members donors calls johnnycomelatelys internet freedom foundation xb httpspreviewredditdyajbwnnqwcjpgwidthformatpjpgautowebpsedecfbefacbaebed come say hi ask us many questions quarterly members call thursday th april pm ist internet freedom foundation iff impactoriented awardwinning indian digital rights advocacy organisation seek ensure technology respects human rights born savetheinternet movement last seven years iff worked advance constitutional rights shared collective vision free open internet committed defending expanding fundamental rights india gets digitally connected part mandate strategically engage courts regulators legal institutions across india work across wide range issues expertise internet shutdowns website blocking data protection surveillance reform intermediary liability iffs primary objective bring together campaigners policy experts lawyers technologists artists build open safe progressive digital ecosystem respects human rights iff adopts framework civic literacy engagement online campaigning channelled towards institutional change regularly engage courts parliamentary bodies government agencies broad range digital rights issues iff strengthens work principles collaboration unleashing power communitycentric organization structure iff able successfully work range digital rights issues variety approaches radical transparency tiny donorfunded organisation relies upon contributions people india support faith maintained greater transparency financial needs fund inflows expenses proactively publishing monthly financial disclosures income expenditure figures herehttpsforuminternetfreedomintfinancialdisclosurerefstaticinternetfreedomin publishing tax reports filings documents related board governance herehttpsinternetfreedomintransparencyandfinancesrefstaticinternetfreedomin hosting quarterly members donors calls touch base biggest cheerleaders guys herehttpsyoutubecomplaylistlistplgcwcssojipovlzsvdokfmsbgmcqjsiwbnoanznfjrvzrefstaticinternetfreedomin goes quarterly members donors calls host lot familiar iffs quarterly members donors calls wanted talk moment explain calls small donorfunded organisation supported indian citizens like strongly believe faith work maintained greater transparency funding quarterly calls walk community money support going towards working last quarter issues closely following critical developments shape digital rights landscape responses presentation part call livestreamed social media channels memberdonor get chance engage directly iff staff community every quarter supporters get hop call ask us questions give inputfeedback hold us accountable election szn beyond april june crore indian voters elect th lok sabha largestever election world concurrently elections also take place legislative assemblies multiple states byelections seats states stakes democracy higher ever keeping eyeshttpsfreeandfairinrefstaticinternetfreedomin ways technology shaping electoral processes outcomes avenues democratic civic spaces resistance continue shrinking need participate democracy deeper meaningful ways engaging community critical us grow stay transparent work vision digital rights scape generally rightscentric advocacy efforts support makes collective vision transparent accountable free internet possible following feedback community weve also revamped subscription tiers make supporting work even easier xb join us hosting second quarterly members call thursday th april pm ist members donors check inboxes invite please mark calendar join us fun insightful conversation iff staffers meet inaugural cohort freedom innovation fellowshttpsinternetfreedominiffsfreedominnovationfellowshiprefstaticinternetfreedomin also livestream call twitterhttpstwittercomibroadcastsoyjawdrzeykbrefstaticinternetfreedomin youtubehttpswwwyoutubecomliveyxvlgyfeaturesharedrefstaticinternetfreedomin youre member become onehttpsinternetfreedomindonaterefstaticinternetfreedomin ",
    "cleaned_title": "quarterly members donors calls johnnycomelatelys internet freedom foundation",
    "cleaned_selftext": "xb httpspreviewredditdyajbwnnqwcjpgwidthformatpjpgautowebpsedecfbefacbaebed come say hi ask us many questions quarterly members call thursday th april pm ist internet freedom foundation iff impactoriented awardwinning indian digital rights advocacy organisation seek ensure technology respects human rights born savetheinternet movement last seven years iff worked advance constitutional rights shared collective vision free open internet committed defending expanding fundamental rights india gets digitally connected part mandate strategically engage courts regulators legal institutions across india work across wide range issues expertise internet shutdowns website blocking data protection surveillance reform intermediary liability iffs primary objective bring together campaigners policy experts lawyers technologists artists build open safe progressive digital ecosystem respects human rights iff adopts framework civic literacy engagement online campaigning channelled towards institutional change regularly engage courts parliamentary bodies government agencies broad range digital rights issues iff strengthens work principles collaboration unleashing power communitycentric organization structure iff able successfully work range digital rights issues variety approaches radical transparency tiny donorfunded organisation relies upon contributions people india support faith maintained greater transparency financial needs fund inflows expenses proactively publishing monthly financial disclosures income expenditure figures herehttpsforuminternetfreedomintfinancialdisclosurerefstaticinternetfreedomin publishing tax reports filings documents related board governance herehttpsinternetfreedomintransparencyandfinancesrefstaticinternetfreedomin hosting quarterly members donors calls touch base biggest cheerleaders guys herehttpsyoutubecomplaylistlistplgcwcssojipovlzsvdokfmsbgmcqjsiwbnoanznfjrvzrefstaticinternetfreedomin goes quarterly members donors calls host lot familiar iffs quarterly members donors calls wanted talk moment explain calls small donorfunded organisation supported indian citizens like strongly believe faith work maintained greater transparency funding quarterly calls walk community money support going towards working last quarter issues closely following critical developments shape digital rights landscape responses presentation part call livestreamed social media channels memberdonor get chance engage directly iff staff community every quarter supporters get hop call ask us questions give inputfeedback hold us accountable election szn beyond april june crore indian voters elect th lok sabha largestever election world concurrently elections also take place legislative assemblies multiple states byelections seats states stakes democracy higher ever keeping eyeshttpsfreeandfairinrefstaticinternetfreedomin ways technology shaping electoral processes outcomes avenues democratic civic spaces resistance continue shrinking need participate democracy deeper meaningful ways engaging community critical us grow stay transparent work vision digital rights scape generally rightscentric advocacy efforts support makes collective vision transparent accountable free internet possible following feedback community weve also revamped subscription tiers make supporting work even easier xb join us hosting second quarterly members call thursday th april pm ist members donors check inboxes invite please mark calendar join us fun insightful conversation iff staffers meet inaugural cohort freedom innovation fellowshttpsinternetfreedominiffsfreedominnovationfellowshiprefstaticinternetfreedomin also livestream call twitterhttpstwittercomibroadcastsoyjawdrzeykbrefstaticinternetfreedomin youtubehttpswwwyoutubecomliveyxvlgyfeaturesharedrefstaticinternetfreedomin youre member become onehttpsinternetfreedomindonaterefstaticinternetfreedomin",
    "cleaned_comments": "",
    "light_cleaned_title": "Why do we do the “Quarterly Members’ & Donors’ calls” / For all the johnny-come-lately`s | Internet Freedom Foundation",
    "light_cleaned_selftext": "&#x200B; [ ](https://preview.redd.it/dyajbwnnq7wc1.jpg?width=1280&format=pjpg&auto=webp&s=edec8fb2e38463fa9cba973e21b7e2568601d286) *Come, say hi & ask us many questions in our Quarterly Member’s Call for 2024 on Thursday, 25th April 2024 at 5:30 PM IST.* ## Who are we? The Internet Freedom Foundation (IFF), is an impact-oriented and award-winning Indian digital rights advocacy organisation. We seek to ensure that technology respects human rights. Born out of the SaveTheInternet movement, over the last seven years, IFF has worked to advance constitutional rights in a shared, collective vision for a free and open internet. We're committed to defending and expanding fundamental rights as India gets more digitally connected. As part of this mandate, we strategically engage with courts, regulators, and other legal institutions across India. We work across a wide range of issues with expertise in internet shutdowns, website blocking, data protection, surveillance reform and intermediary liability. IFF’s primary objective has been to bring together campaigners, policy experts, lawyers, technologists and artists to build an open, safe and progressive digital ecosystem that respects human rights. IFF adopts a framework of civic literacy and engagement through online campaigning channelled towards institutional change. We regularly engage with courts, parliamentary bodies and government agencies over a broad range of digital rights issues. IFF strengthens its work with principles of collaboration and unleashing the power of being a community-centric organization. Through this structure, IFF has been able to successfully work on a range of digital rights issues through a variety of approaches. ## Radical Transparency As a tiny, donor-funded organisation which relies upon contributions from the people of India, your support and faith can only be maintained with greater transparency about our financial needs, fund inflows, and expenses. And we do this by * Proactively publishing monthly financial disclosures, with income and expenditure figures. ([here](https://forum.internetfreedom.in/t/financial-disclosure-2023/3368?ref=static.internetfreedom.in)) * Publishing tax reports, filings and documents related to board governance. ([here](https://internetfreedom.in/transparency-and-finances/?ref=static.internetfreedom.in)) * Hosting quarterly members’ and donors’ calls to touch base with our biggest cheerleaders, YOU GUYS! ([here](https://youtube.com/playlist?list=PLgcwCSsOJipovlZ5S6VdoKF_MsBgmCQ8J&si=wBn0oaN6ZN4fJRvZ&ref=static.internetfreedom.in)) ## What goes on in these “Quarterly Members’ and Donors’ calls and why do we host them? While a lot of you are familiar with IFF’s quarterly members’ and donors’ calls, we wanted to talk a moment to explain why we do these calls. As a small donor-funded organisation, supported by Indian citizens like you, we strongly believe that your faith in our work can only be maintained with greater transparency. ### What are you funding? In our quarterly calls, we walk you, our community, through what your money and support are going towards, what we have been working on for the last quarter, issues that we are closely following, critical developments that shape our digital rights landscape, and our responses to them. The presentation part of the call is live-streamed through our social media channels, but as a member/donor, YOU get a chance to engage directly with the IFF staff and the community. Every quarter, all our supporters get to hop on the call and ask us questions, give their input/feedback, and hold us accountable! ## 2024, the election szn, and beyond. Between April 19 and June 4, 2024, 96 crore Indian voters will elect the 18th Lok Sabha in the largest-ever election in the world. Concurrently, elections will also take place for the Legislative Assemblies in multiple states and by-elections for 35 seats in 16 states. The stakes for our democracy are higher than ever[ and we’re keeping our eyes](https://freeandfair.in/?ref=static.internetfreedom.in) on the ways in which technology is shaping electoral processes and outcomes. As the avenues of democratic civic spaces of resistance continue shrinking, we need to participate in democracy in deeper and more meaningful ways. Engaging with our community is critical for us to grow and stay transparent about our work and vision, not only in the digital rights scape but generally in our rights-centric advocacy efforts. Your support is what makes our collective vision for a transparent, accountable and free internet possible. Following feedback from our community, we’ve also revamped our subscription tiers to make supporting our work even easier! &#x200B; ## Join us! We’re hosting our second Quarterly Member’s Call for 2024 on Thursday, 25th April 2024 at 5:30 PM IST. Members & Donors - check your inboxes for an invite! Please mark your calendar and join us for this fun and insightful conversation with IFF staffers and meet the inaugural cohort of the [Freedom Innovation Fellows](https://internetfreedom.in/iffs-freedom-innovation-fellowship/?ref=static.internetfreedom.in). We will also live-stream the call on [Twitter](https://twitter.com/i/broadcasts/1OyJAWdrzEyKb?ref=static.internetfreedom.in) and [YouTube](https://www.youtube.com/live/0yX1VL8gY44?feature=shared&ref=static.internetfreedom.in) if you’re not a member ([become one?](https://internetfreedom.in/donate/?ref=static.internetfreedom.in)).",
    "light_cleaned_comments": ""
}