{
    "id": "1898ujd",
    "title": "Akshay Kumar already made a movie on rescuing trapped miners",
    "url": "https://i.redd.it/1he3yueu4x3c1.jpg",
    "selftext": "Lolololol..... Just The other day I was discussing with my friends that since the trapped miners have successfully been rescued. And GUESS WHAT.....??!!",
    "flair": "Politics",
    "score": 623,
    "num_comments": 54,
    "created_utc": 1701538934.0,
    "convurl": "https://i.redd.it/1he3yueu4x3c1.jpg",
    "comments": [
        "https://en.m.wikipedia.org/wiki/Mission_Raniganj",
        "Akshay Kumar when there is real life based film opportunity\n\nhttps://preview.redd.it/lt5jyjrj7x3c1.jpeg?width=1080&format=pjpg&auto=webp&s=a92a6a47a062452d5a8d6f8f92dceaff5c9bbaac",
        "I mean it’s based on 1989’s collapse and all that. But damn was I shocked",
        "He'll make another don't worry.",
        "Akshay Kumar never runs out of ideas",
        "Phir se karega",
        "more like never runs out of ways to portray himself as \"Indian\" and not \"Canadian\"",
        "Hmm... *my conspiracy senses are tingling*",
        "miners ko bahar nikalne se pehle akshay paaji ki movie ready thi!Iss bar movie 10 dino mein hi khatam kar di shayad😂",
        "There was a time before that the movie was made after an event like this happened to show how the whole thing took place. \n\nFor Akshay Kumar exclusively they have to create a scenario after the movie has released.\n\nYeh ulta kab hua?",
        "This happened in real life dude. This is an actual case happened in Chattisgarh. \n\nSource: my uncle who was mine incharge there.",
        "This is another incident, this happened in real life. The mere fact that these miners got stuck in uttarkashi nearing to the movie release is a mere coincidence.",
        "I don't see any different between johhny sins and this fool",
        "I know, I was so confused when Netflix started playing the trailer automatically! I didn't know if it was the news or what.",
        "Or is it.....",
        "What the fuck, did he film this in a day?",
        "Kya keh rha hai bhai💀",
        "How naive are you dude. Go check the Wikipedia page that the OP has shared.",
        "https://m.timesofindia.com/india/silkyara-tunnel-collapsed-20-times-in-past-5-years/articleshow/105637134.cms\n\nIt has already collapsed 20 times in the past five years.\n\nFor those who didn't see that coming.",
        "So Akki boy saw it coming .... And started preparing for the role",
        "Yeah maybe he already knows but the government managed to keep it secret.\n\nEven today you can't find a single news channel talking about this",
        "That movie has a combination of bad acting, direction and dialogues!",
        "Were the people trapped in Uttarkashi miners? &nbsp; They were digging a tunnel for a road, right?",
        "He's not Canadian anymore, fyi.\n\nhttps://www.hindustantimes.com/entertainment/bollywood/akshay-kumar-gets-indian-citizenship-shares-proof-on-twitter-101692081610166.html",
        "Deja vu",
        "If it is an old film, he will make a sequel.",
        "If it is an old film, he will make a sequel.",
        "If it is an old film, he will make a sequel.",
        "If it is an old film, he will make a sequel.",
        "Actually Yash Chopra made it in way back in 1979 [Kaala Patthar](https://en.wikipedia.org/wiki/Kaala_Patthar) - about rat hole miners!",
        "Did he also paint the tunnel with Kesari of Vimal pan masala?",
        "That doesn't change anything",
        "I couldn't believe how much the movie was celebrating jugad nonstop, without concern whatsoever for systematic failures.",
        "The new one will star John Abraham.",
        "the whole mine story was to promote the movie /s",
        "someone said they weren’t really trapped, it was just movie shooting which got too much attention\\\nso they had to keep stuck",
        "Is there sarcasm here or is everyone just plain dumb. This is another incident 💀",
        "We know it's about another incident.... The point is that we all were discussing how Akshay Kumar is always ready to steal the limelight of real life heroes by making mediocre movies on their achievements. In this instance as well while the recent tunnel collapse incident became quite popular we assumed that AK will make a movie about it in no time .... But as it turns out he has already made one based on another similar incident.",
        "Australian played a Canadian but every body believes he's American ( Hugh Jackman as Wolverine)\n\nNow, Desi version...\nCanadian played an Australian but now he's Indian. (Ak)",
        "Raniganj sequel baby!",
        "Obviously they were trapped purposely to promote the movie\n\n/s",
        "Yes it does.",
        "So 20 sequel franchisee for akki",
        "Yeah.  I don't see why not.",
        "This movie would've been so grim if the rescue didn't go well. What was Akshay thinking?",
        "that's real pro-activeness",
        "r/whoosh",
        "Can't wait for the next one on the recent tunnel collapse and rescue 😬",
        "This movie is not based on uttkarshi omg how dumb can people really be?",
        "Yes but do you think this a coincidence that something like this happend and a movie like this launched.",
        "☝🏻🤓",
        "Dude this is Black Mirror S06E01 happening to the miners as we speak"
    ],
    "cleaned_text": "akshay kumar already made movie rescuing trapped miners lolololol day discussing friends since trapped miners successfully rescued guess ",
    "cleaned_title": "akshay kumar already made movie rescuing trapped miners",
    "cleaned_selftext": "lolololol day discussing friends since trapped miners successfully rescued guess",
    "cleaned_comments": "akshay kumar real life based film opportunity mean based collapse damn shocked hell make another dont worry akshay kumar never runs ideas phir se karega like never runs ways portray indian canadian hmm conspiracy senses tingling miners ko bahar nikalne se pehle akshay paaji ki movie ready thiiss bar movie dino mein hi khatam kar di shayad time movie made event like happened show whole thing took place akshay kumar exclusively create scenario movie released yeh ulta kab hua happened real life dude actual case happened chattisgarh source uncle mine incharge another incident happened real life mere fact miners got stuck uttarkashi nearing movie release mere coincidence dont see different johhny sins fool know confused netflix started playing trailer automatically didnt know news fuck film day kya keh rha hai bhai naive dude go check wikipedia page op shared already collapsed times past five years didnt see coming akki boy saw coming started preparing role yeah maybe already knows government managed keep secret even today cant find single news channel talking movie combination bad acting direction dialogues people trapped uttarkashi miners nbsp digging tunnel road right hes canadian anymore fyi deja vu old film make sequel old film make sequel old film make sequel old film make sequel actually yash chopra made way back kaala pattharhttpsenwikipediaorgwikikaalapatthar rat hole miners also paint tunnel kesari vimal pan masala doesnt change anything couldnt believe much movie celebrating jugad nonstop without concern whatsoever systematic failures new one star john abraham whole mine story promote movie someone said werent really trapped movie shooting got much attention keep stuck sarcasm everyone plain dumb another incident know another incident point discussing akshay kumar always ready steal limelight real life heroes making mediocre movies achievements instance well recent tunnel collapse incident became quite popular assumed ak make movie time turns already made one based another similar incident australian played canadian every body believes hes american hugh jackman wolverine desi version canadian played australian hes indian ak raniganj sequel baby obviously trapped purposely promote movie yes sequel franchisee akki yeah dont see movie wouldve grim rescue didnt go well akshay thinking thats real proactiveness rwhoosh cant wait next one recent tunnel collapse rescue movie based uttkarshi omg dumb people really yes think coincidence something like happend movie like launched dude black mirror se happening miners speak",
    "light_cleaned_title": "Akshay Kumar already made a movie on rescuing trapped miners",
    "light_cleaned_selftext": "Lolololol..... Just The other day I was discussing with my friends that since the trapped miners have successfully been rescued. And GUESS WHAT.....??!!",
    "light_cleaned_comments": "Akshay Kumar when there is real life based film opportunity I mean it’s based on 1989’s collapse and all that. But damn was I shocked He'll make another don't worry. Akshay Kumar never runs out of ideas Phir se karega more like never runs out of ways to portray himself as \"Indian\" and not \"Canadian\" Hmm... *my conspiracy senses are tingling* miners ko bahar nikalne se pehle akshay paaji ki movie ready thi!Iss bar movie 10 dino mein hi khatam kar di shayad😂 There was a time before that the movie was made after an event like this happened to show how the whole thing took place. For Akshay Kumar exclusively they have to create a scenario after the movie has released. Yeh ulta kab hua? This happened in real life dude. This is an actual case happened in Chattisgarh. Source: my uncle who was mine incharge there. This is another incident, this happened in real life. The mere fact that these miners got stuck in uttarkashi nearing to the movie release is a mere coincidence. I don't see any different between johhny sins and this fool I know, I was so confused when Netflix started playing the trailer automatically! I didn't know if it was the news or what. Or is it..... What the fuck, did he film this in a day? Kya keh rha hai bhai💀 How naive are you dude. Go check the Wikipedia page that the OP has shared. It has already collapsed 20 times in the past five years. For those who didn't see that coming. So Akki boy saw it coming .... And started preparing for the role Yeah maybe he already knows but the government managed to keep it secret. Even today you can't find a single news channel talking about this That movie has a combination of bad acting, direction and dialogues! Were the people trapped in Uttarkashi miners? &nbsp; They were digging a tunnel for a road, right? He's not Canadian anymore, fyi. Deja vu If it is an old film, he will make a sequel. If it is an old film, he will make a sequel. If it is an old film, he will make a sequel. If it is an old film, he will make a sequel. Actually Yash Chopra made it in way back in 1979 [Kaala Patthar](https://en.wikipedia.org/wiki/Kaala_Patthar) - about rat hole miners! Did he also paint the tunnel with Kesari of Vimal pan masala? That doesn't change anything I couldn't believe how much the movie was celebrating jugad nonstop, without concern whatsoever for systematic failures. The new one will star John Abraham. the whole mine story was to promote the movie /s someone said they weren’t really trapped, it was just movie shooting which got too much attention\\ so they had to keep stuck Is there sarcasm here or is everyone just plain dumb. This is another incident 💀 We know it's about another incident.... The point is that we all were discussing how Akshay Kumar is always ready to steal the limelight of real life heroes by making mediocre movies on their achievements. In this instance as well while the recent tunnel collapse incident became quite popular we assumed that AK will make a movie about it in no time .... But as it turns out he has already made one based on another similar incident. Australian played a Canadian but every body believes he's American ( Hugh Jackman as Wolverine) Now, Desi version... Canadian played an Australian but now he's Indian. (Ak) Raniganj sequel baby! Obviously they were trapped purposely to promote the movie /s Yes it does. So 20 sequel franchisee for akki Yeah. I don't see why not. This movie would've been so grim if the rescue didn't go well. What was Akshay thinking? that's real pro-activeness r/whoosh Can't wait for the next one on the recent tunnel collapse and rescue 😬 This movie is not based on uttkarshi omg how dumb can people really be? Yes but do you think this a coincidence that something like this happend and a movie like this launched. ☝🏻🤓 Dude this is Black Mirror S06E01 happening to the miners as we speak"
}