{
    "id": "1bzfbrj",
    "title": "Richest 21 individual Indians have more wealth than poorest 700,000,000 Indians(700mill, 70cr). They also pay lesser tax in form of direct corporate tax than poorest’s contribution via GST while using Tax Havens and getting tax cuts.",
    "url": "https://www.reddit.com/gallery/1bzfbrj",
    "selftext": "Twitter thread - https://x.com/aiyub_dawood/status/1777499638675001636?s=46\n\nThread reader thread - https://threadreaderapp.com/thread/1777499638675001636.html",
    "flair": "Policy/Economy",
    "score": 316,
    "num_comments": 80,
    "created_utc": 1712625025.0,
    "convurl": "https://i.redd.it/cf36d7ihtctc1.jpg",
    "comments": [
        "“As per Oxfam Report, 2023, the top 1% in India now owns more than 40.5% of the total wealth in 2021, while the bottom 50% of the population has around only 3% of the total wealth. The richest 21 Indians have more wealth than bottom 70 Crore of the population.\n\n\nThe working class in India has been badly affected by the economic policies of the Modi government, which can be illustrated by the promise he made to double farm income, when he came to power. But, what has happened to the promise now? The government has backtracked from its promise of granting MSP and farm loan waivers. What is at offer is merely Rs, 6,000 annual income support under Kisan Nidhi Scheme, while farming input costs rise exorbitantly. This is especially at a time when a farmer is not getting just prices for their produce, which, for most crops, are less than 1/3rd of the prevailing market prices. Farmers are unable to recover even input costs on crops production.\n\n\nMajority of the people are being pushed to pauperization and are becoming dependent on precarious jobs euphemized as ‘self-employed’ for survival. This is reflected in India’s position on the Global Hunger Index where the country stands at 111th position amongst 125 countries and 141st on per capita income of countries of world. The number of hungry Indians increased to 35 crore in 2022 from 19 crore in 2018.”\n\nOther sources - https://timesofindia.indiatimes.com/india/richest-21-indian-billionaires-have-more-wealth-than-700-million-indians-oxfam-report/articleshow/97012528.cms\n\nhttps://liberation.org.in/index.php/liberation-2024-january/indian-economy-tall-growth-claims-vs-ground-reality#:~:text=As%20per%20Oxfam%20Report%2C%202023,70%20Crore%20of%20the%20population",
        "Hey you commie! Respecc our great wealth-creators, respecc those who feed you! Jay Jay Ambani, jay jay adani! /s",
        "Are but no msp to farmer saar , 21 lakh crore saaar…",
        "Amrit Kaal phor aaall",
        "F### them .they defend these rich guys like their life is dependent on it",
        "In case you thought.  You are living in a democracy.\nThis is help you to see what is true...",
        "Even middle class is like daily wager unless they have a tenured job.",
        "Hey but when those 21 get their kids married they'll throw bashes that will create employment for artisans in their hometowns which will eradicate poverty.",
        "Yes bicker about it and still promote nationalism and centralization",
        "India has the lowest social mobility in the world if I recall correctly. \n\ni.e if you are born poor/ socially downtrodden, you will likely remain so. \n\nBirth lottery indeed.",
        "They also employ a large portion of employable workforce. No one considers why companies are subsidized or compensated on taxes. It's because that encourages companies on spending their profits on their company + workforce, leading to more jobs.",
        "Life, not so sure but their political careers are definitely dependent on them. Crony capitalism.",
        "Sab moh maya hai.",
        "All I can say is \n\nThank you Modi ji! for widening the income inequality",
        "No one got your sarcasm sad bruh",
        "Yep all workers share more similarities between themselves than the ruling-oligarch class yet are made to fight other working class Indians on basis of religion and caste due to leaders who exploit these differences to their advantage. This is democracy of India for past many decades",
        "Check the 3rd and 4th screenshot and the 2nd source I attached in my comment.\n\nThe value the labour and farmer class provide by building the economy is nothing compared to the benefits or welfares or jobs or salaries they get. They are exploited badly",
        "People who are commenting that it increases Job creation. I recently made a comment on the same thing, and I'll add more bits to it.\n\n\nWhile you're right to a certain extent you're not completely right. It's not as easy as that. It's a complex issue. Because by this logic we should not tax the rich people at all since it'll help the economy and tax only poor people since they don't create jobs. Why is National Income a part of an economic measurement? It indicates jobs creation, improvement in standard of living but if it's concentrated to the richest people then is the economy improving at all?\n\n\nMy second point is the idea that an increase in tax on corporates necessarily leads to less jobs is true but not entirely true. If it increases over a limit then it might not be financially beneficial for the rich people and they might take their shops somewhere else but not before they stop earning profits. Moreover the tax that is earned if disturbed to poor people and used to improve infrastructure will lead to an increase in demand in the economy and that would mean industries increasing their supply to meet the demand and eventually job creation. \n\n\nA mature business is very unlikely to set up their shops somewhere else that easily.\n\n\n\nIf rich gets money this money doesn't necessarily result in increase in job creation. In fact, if a poor person earns 100 rupees, it'll result in more GDP increase than if you give this 100 rupees to a poor person. Why?\n\nA poor person gets money then they are more likely to spend it. When poor people increase their expenditure it results in increase in demand and to meet this increase in demand, supply is increased and probably jobs will eb created.\n\nBut when a rich person gets money, they will not be spending it to increase the supply because there is no demand. A rich person's basic expenses are already met and they are not likely to spend it on basic amenities. \n\n\nYou can't be too aggressive and too relaxed since both are detrimental to the economy.",
        "I am talking bout muh public \n\nMuh Tata (opium empire ) muh birla muh Sudha moorthi \n\nF### them .they deserve to get looted all the way to the end",
        "Wtf? The system is rigged against them and right from young age they are taught to worship people who are more successful whether that's actors, politicians, businessman or whatever. You are really blaming the victims for this?",
        "They aren't victims .they have the soul of a slave . Even when they are free they will find chains to bind them",
        "Welcome to capitalism baby",
        "So glad I left India while I could. I still pay \\~35% of my salary as taxes but there is 24x7 water, electricity, safety, never stand in queues, and everything can be done online from home. I hope India stops oppressing the poor like this one day.",
        "Anyone who wants decentralisation in India wants to live under landlords \n\n\nYou too sir",
        "Farmer class ?? Are you a dehati \n\nIndian farmer class grows shit compared to say an Israeli one .they choke Delhi with smoke and deplete the earth with sugarcane farming",
        "We need a large-scale wealth distribution program like post WW2 China where wealth hoarders are publicly shamed and stripped off their wealth. Only Rahul Gandhi offers India a pathway to this kind of equitable distribution of wealth. Vote wisely.",
        "French revolution NOW",
        "And average Indian lays taxes for reservations for reserved and pension for govt employees , no guarantee for electricity,  water and safety , that's our own \"responsibility\"",
        "I think with confidence in developing the nation provides subsidies and low tax cuts on corporates. \nPublic essentials are obviously not going to go down. \nOr could be corruption.",
        "Try it  lets see what happens",
        "Go back to license Raaj then",
        "Yeah and people still complain about freebies. Lol.\n\nPoor people aren't eating your money, you are getting broad day light robbed by the wealthy.",
        "Can't buy in your point. I already own my land and live in a communist ground.",
        "Is it really the lowest? Will it get worse or better?",
        "Dont. Central power will stay .can't let the nation go back into ten dynasties and 200 kingdoms period",
        "What can we do?",
        "I'm kidding man. /s",
        "Bruh! Add '\\\\s'...",
        "Blud not everyone is like that.",
        "Where did you go ?",
        "You haven't been to a proper dehat yet",
        "Time for nationalisation and social mobility policies",
        "The progress of any society depends on the progress of education in that society. ~ Dr. B. R Ambedkar \n\nLet's educate ourselves and others too. And obviously the obvious, not vote for Modi. Let's stop pretending we don't have a choice. \n\nRight now, the main issue is press freedom so questions are raised. Anything Opposition is better to improve press freedom.",
        "Modi is following what Russia and South Korea did. Hand over assets to a few in the hope that they will let the funds flow down.\n\nRussia for oligarchs who made billions overnight and spent it on yachts and London homes\n\nSouth Korea: Country has prospered due to some innovative companies like Samsung, Hyundai but the common people there slog and there’s a very high level of corruption to keep these few where they are. Very little competition",
        "No mw if only we set us our caste and differences and just mobbed up on those in power. There are not enough guns and goons and police to stop us. ",
        "What point is this post trying to make? Why is the middle class blamed when the Ambanis, Adanis, miners, politician steal so much from both the middle-class and the poor? \n\nBtw, the 'middle-class' isn't a monolith. I've seen olenty of people criticise the wealthy and the elite.",
        "what country did you go to bro, im moving out aswell",
        "india is 76 out of 82 just barely above pakistan and bangladesh but hey lets celebrate we atleast beat pakistan again xD\n\n[https://en.wikipedia.org/wiki/Global\\_Social\\_Mobility\\_Index](https://en.wikipedia.org/wiki/Global_Social_Mobility_Index)",
        "What's more, every single person in power goes full propulsion so the status quo remains the same!",
        "License raj isn't socialism lol.",
        "We need to annihilate caste to bring about class consciousness \n\nAmbedkar’s solution for that was leaving Hinduism as a whole since caste is intertwined with this religion and follow Buddhism which once was a social revolution against caste but Hindu Kings eventually did counter revolution and brought it back\n\nAnyone has a better idea?",
        "Middle class is not blamed here at all, it’s saying middle class are misguided by the rich and political class to hate on poor people for welfare in the name of freebies while both middle and poor classes are exploited by top 1% of population creating a rift in the name of caste, religion etc",
        "The middle class of India doesn't hate 'poor people' for their welfare. You'll find that a vast portion of the middle class is borderline poor themselves. The hate comes from the top, not the middle.",
        "The wealthy control the narrative for the middle claass to always be angry at the poor all the while thry siphon off resources from both",
        "Source??",
        "I posted in this comment - https://www.reddit.com/r/india/s/CPxOOGpWdl",
        "USA.",
        "Red state or blue ?",
        "Very red. But it really doesn't matter as my job is state-neutral."
    ],
    "cleaned_text": "richest individual indians wealth poorest indiansmill cr also pay lesser tax form direct corporate tax poorests contribution via gst using tax havens getting tax cuts twitter thread thread reader thread ",
    "cleaned_title": "richest individual indians wealth poorest indiansmill cr also pay lesser tax form direct corporate tax poorests contribution via gst using tax havens getting tax cuts",
    "cleaned_selftext": "twitter thread thread reader thread",
    "cleaned_comments": "per oxfam report top india owns total wealth bottom population around total wealth richest indians wealth bottom crore population working class india badly affected economic policies modi government illustrated promise made double farm income came power happened promise government backtracked promise granting msp farm loan waivers offer merely rs annual income support kisan nidhi scheme farming input costs rise exorbitantly especially time farmer getting prices produce crops less rd prevailing market prices farmers unable recover even input costs crops production majority people pushed pauperization becoming dependent precarious jobs euphemized selfemployed survival reflected indias position global hunger index country stands th position amongst countries st per capita income countries world number hungry indians increased crore crore sources hey commie respecc great wealthcreators respecc feed jay jay ambani jay jay adani msp farmer saar lakh crore saaar amrit kaal phor aaall f defend rich guys like life dependent case thought living democracy help see true even middle class like daily wager unless tenured job hey get kids married theyll throw bashes create employment artisans hometowns eradicate poverty yes bicker still promote nationalism centralization india lowest social mobility world recall correctly ie born poor socially downtrodden likely remain birth lottery indeed also employ large portion employable workforce one considers companies subsidized compensated taxes encourages companies spending profits company workforce leading jobs life sure political careers definitely dependent crony capitalism sab moh maya hai say thank modi ji widening income inequality one got sarcasm sad bruh yep workers share similarities rulingoligarch class yet made fight working class indians basis religion caste due leaders exploit differences advantage democracy india past many decades check rd th screenshot nd source attached comment value labour farmer class provide building economy nothing compared benefits welfares jobs salaries get exploited badly people commenting increases job creation recently made comment thing ill add bits youre right certain extent youre completely right easy complex issue logic tax rich people since itll help economy tax poor people since dont create jobs national income part economic measurement indicates jobs creation improvement standard living concentrated richest people economy improving second point idea increase tax corporates necessarily leads less jobs true entirely true increases limit might financially beneficial rich people might take shops somewhere else stop earning profits moreover tax earned disturbed poor people used improve infrastructure lead increase demand economy would mean industries increasing supply meet demand eventually job creation mature business unlikely set shops somewhere else easily rich gets money money doesnt necessarily result increase job creation fact poor person earns rupees itll result gdp increase give rupees poor person poor person gets money likely spend poor people increase expenditure results increase demand meet increase demand supply increased probably jobs eb created rich person gets money spending increase supply demand rich persons basic expenses already met likely spend basic amenities cant aggressive relaxed since detrimental economy talking bout muh public muh tata opium empire muh birla muh sudha moorthi f deserve get looted way end wtf system rigged right young age taught worship people successful whether thats actors politicians businessman whatever really blaming victims arent victims soul slave even free find chains bind welcome capitalism baby glad left india could still pay salary taxes x water electricity safety never stand queues everything done online home hope india stops oppressing poor like one day anyone wants decentralisation india wants live landlords sir farmer class dehati indian farmer class grows shit compared say israeli one choke delhi smoke deplete earth sugarcane farming need largescale wealth distribution program like post ww china wealth hoarders publicly shamed stripped wealth rahul gandhi offers india pathway kind equitable distribution wealth vote wisely french revolution average indian lays taxes reservations reserved pension govt employees guarantee electricity water safety thats responsibility think confidence developing nation provides subsidies low tax cuts corporates public essentials obviously going go could corruption try lets see happens go back license raaj yeah people still complain freebies lol poor people arent eating money getting broad day light robbed wealthy cant buy point already land live communist ground really lowest get worse better dont central power stay cant let nation go back ten dynasties kingdoms period im kidding man bruh add blud everyone like go havent proper dehat yet time nationalisation social mobility policies progress society depends progress education society dr b r ambedkar lets educate others obviously obvious vote modi lets stop pretending dont choice right main issue press freedom questions raised anything opposition better improve press freedom modi following russia south korea hand assets hope let funds flow russia oligarchs made billions overnight spent yachts london homes south korea country prospered due innovative companies like samsung hyundai common people slog theres high level corruption keep little competition mw set us caste differences mobbed power enough guns goons police stop us point post trying make middle class blamed ambanis adanis miners politician steal much middleclass poor btw middleclass isnt monolith ive seen olenty people criticise wealthy elite country go bro im moving aswell india barely pakistan bangladesh hey lets celebrate atleast beat pakistan xd httpsenwikipediaorgwikiglobalsocialmobilityindexhttpsenwikipediaorgwikiglobalsocialmobilityindex whats every single person power goes full propulsion status quo remains license raj isnt socialism lol need annihilate caste bring class consciousness ambedkars solution leaving hinduism whole since caste intertwined religion follow buddhism social revolution caste hindu kings eventually counter revolution brought back anyone better idea middle class blamed saying middle class misguided rich political class hate poor people welfare name freebies middle poor classes exploited top population creating rift name caste religion etc middle class india doesnt hate poor people welfare youll find vast portion middle class borderline poor hate comes top middle wealthy control narrative middle claass always angry poor thry siphon resources source posted comment usa red state blue red really doesnt matter job stateneutral",
    "light_cleaned_title": "Richest 21 individual Indians have more wealth than poorest 700,000,000 Indians(700mill, 70cr). They also pay lesser tax in form of direct corporate tax than poorest’s contribution via GST while using Tax Havens and getting tax cuts.",
    "light_cleaned_selftext": "Twitter thread - Thread reader thread -",
    "light_cleaned_comments": "“As per Oxfam Report, 2023, the top 1% in India now owns more than 40.5% of the total wealth in 2021, while the bottom 50% of the population has around only 3% of the total wealth. The richest 21 Indians have more wealth than bottom 70 Crore of the population. The working class in India has been badly affected by the economic policies of the Modi government, which can be illustrated by the promise he made to double farm income, when he came to power. But, what has happened to the promise now? The government has backtracked from its promise of granting MSP and farm loan waivers. What is at offer is merely Rs, 6,000 annual income support under Kisan Nidhi Scheme, while farming input costs rise exorbitantly. This is especially at a time when a farmer is not getting just prices for their produce, which, for most crops, are less than 1/3rd of the prevailing market prices. Farmers are unable to recover even input costs on crops production. Majority of the people are being pushed to pauperization and are becoming dependent on precarious jobs euphemized as ‘self-employed’ for survival. This is reflected in India’s position on the Global Hunger Index where the country stands at 111th position amongst 125 countries and 141st on per capita income of countries of world. The number of hungry Indians increased to 35 crore in 2022 from 19 crore in 2018.” Other sources - Hey you commie! Respecc our great wealth-creators, respecc those who feed you! Jay Jay Ambani, jay jay adani! /s Are but no msp to farmer saar , 21 lakh crore saaar… Amrit Kaal phor aaall F### them .they defend these rich guys like their life is dependent on it In case you thought. You are living in a democracy. This is help you to see what is true... Even middle class is like daily wager unless they have a tenured job. Hey but when those 21 get their kids married they'll throw bashes that will create employment for artisans in their hometowns which will eradicate poverty. Yes bicker about it and still promote nationalism and centralization India has the lowest social mobility in the world if I recall correctly. i.e if you are born poor/ socially downtrodden, you will likely remain so. Birth lottery indeed. They also employ a large portion of employable workforce. No one considers why companies are subsidized or compensated on taxes. It's because that encourages companies on spending their profits on their company + workforce, leading to more jobs. Life, not so sure but their political careers are definitely dependent on them. Crony capitalism. Sab moh maya hai. All I can say is Thank you Modi ji! for widening the income inequality No one got your sarcasm sad bruh Yep all workers share more similarities between themselves than the ruling-oligarch class yet are made to fight other working class Indians on basis of religion and caste due to leaders who exploit these differences to their advantage. This is democracy of India for past many decades Check the 3rd and 4th screenshot and the 2nd source I attached in my comment. The value the labour and farmer class provide by building the economy is nothing compared to the benefits or welfares or jobs or salaries they get. They are exploited badly People who are commenting that it increases Job creation. I recently made a comment on the same thing, and I'll add more bits to it. While you're right to a certain extent you're not completely right. It's not as easy as that. It's a complex issue. Because by this logic we should not tax the rich people at all since it'll help the economy and tax only poor people since they don't create jobs. Why is National Income a part of an economic measurement? It indicates jobs creation, improvement in standard of living but if it's concentrated to the richest people then is the economy improving at all? My second point is the idea that an increase in tax on corporates necessarily leads to less jobs is true but not entirely true. If it increases over a limit then it might not be financially beneficial for the rich people and they might take their shops somewhere else but not before they stop earning profits. Moreover the tax that is earned if disturbed to poor people and used to improve infrastructure will lead to an increase in demand in the economy and that would mean industries increasing their supply to meet the demand and eventually job creation. A mature business is very unlikely to set up their shops somewhere else that easily. If rich gets money this money doesn't necessarily result in increase in job creation. In fact, if a poor person earns 100 rupees, it'll result in more GDP increase than if you give this 100 rupees to a poor person. Why? A poor person gets money then they are more likely to spend it. When poor people increase their expenditure it results in increase in demand and to meet this increase in demand, supply is increased and probably jobs will eb created. But when a rich person gets money, they will not be spending it to increase the supply because there is no demand. A rich person's basic expenses are already met and they are not likely to spend it on basic amenities. You can't be too aggressive and too relaxed since both are detrimental to the economy. I am talking bout muh public Muh Tata (opium empire ) muh birla muh Sudha moorthi F### them .they deserve to get looted all the way to the end Wtf? The system is rigged against them and right from young age they are taught to worship people who are more successful whether that's actors, politicians, businessman or whatever. You are really blaming the victims for this? They aren't victims .they have the soul of a slave . Even when they are free they will find chains to bind them Welcome to capitalism baby So glad I left India while I could. I still pay \\~35% of my salary as taxes but there is 24x7 water, electricity, safety, never stand in queues, and everything can be done online from home. I hope India stops oppressing the poor like this one day. Anyone who wants decentralisation in India wants to live under landlords You too sir Farmer class ?? Are you a dehati Indian farmer class grows shit compared to say an Israeli one .they choke Delhi with smoke and deplete the earth with sugarcane farming We need a large-scale wealth distribution program like post WW2 China where wealth hoarders are publicly shamed and stripped off their wealth. Only Rahul Gandhi offers India a pathway to this kind of equitable distribution of wealth. Vote wisely. French revolution NOW And average Indian lays taxes for reservations for reserved and pension for govt employees , no guarantee for electricity, water and safety , that's our own \"responsibility\" I think with confidence in developing the nation provides subsidies and low tax cuts on corporates. Public essentials are obviously not going to go down. Or could be corruption. Try it lets see what happens Go back to license Raaj then Yeah and people still complain about freebies. Lol. Poor people aren't eating your money, you are getting broad day light robbed by the wealthy. Can't buy in your point. I already own my land and live in a communist ground. Is it really the lowest? Will it get worse or better? Dont. Central power will stay .can't let the nation go back into ten dynasties and 200 kingdoms period What can we do? I'm kidding man. /s Bruh! Add '\\\\s'... Blud not everyone is like that. Where did you go ? You haven't been to a proper dehat yet Time for nationalisation and social mobility policies The progress of any society depends on the progress of education in that society. ~ Dr. B. R Ambedkar Let's educate ourselves and others too. And obviously the obvious, not vote for Modi. Let's stop pretending we don't have a choice. Right now, the main issue is press freedom so questions are raised. Anything Opposition is better to improve press freedom. Modi is following what Russia and South Korea did. Hand over assets to a few in the hope that they will let the funds flow down. Russia for oligarchs who made billions overnight and spent it on yachts and London homes South Korea: Country has prospered due to some innovative companies like Samsung, Hyundai but the common people there slog and there’s a very high level of corruption to keep these few where they are. Very little competition No mw if only we set us our caste and differences and just mobbed up on those in power. There are not enough guns and goons and police to stop us. What point is this post trying to make? Why is the middle class blamed when the Ambanis, Adanis, miners, politician steal so much from both the middle-class and the poor? Btw, the 'middle-class' isn't a monolith. I've seen olenty of people criticise the wealthy and the elite. what country did you go to bro, im moving out aswell india is 76 out of 82 just barely above pakistan and bangladesh but hey lets celebrate we atleast beat pakistan again xD [https://en.wikipedia.org/wiki/Global\\_Social\\_Mobility\\_Index](https://en.wikipedia.org/wiki/Global_Social_Mobility_Index) What's more, every single person in power goes full propulsion so the status quo remains the same! License raj isn't socialism lol. We need to annihilate caste to bring about class consciousness Ambedkar’s solution for that was leaving Hinduism as a whole since caste is intertwined with this religion and follow Buddhism which once was a social revolution against caste but Hindu Kings eventually did counter revolution and brought it back Anyone has a better idea? Middle class is not blamed here at all, it’s saying middle class are misguided by the rich and political class to hate on poor people for welfare in the name of freebies while both middle and poor classes are exploited by top 1% of population creating a rift in the name of caste, religion etc The middle class of India doesn't hate 'poor people' for their welfare. You'll find that a vast portion of the middle class is borderline poor themselves. The hate comes from the top, not the middle. The wealthy control the narrative for the middle claass to always be angry at the poor all the while thry siphon off resources from both Source?? I posted in this comment - USA. Red state or blue ? Very red. But it really doesn't matter as my job is state-neutral."
}