{
    "id": "12dvrbi",
    "title": "Suggest the type of water purifier to use at home based on the water test results that I just got.",
    "url": "https://www.reddit.com/gallery/12dvrbi",
    "selftext": "Basically the title. \nWater source: Well water\nLocation: Kerala",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 13,
    "created_utc": 1680810654.0,
    "convurl": "https://i.redd.it/goekjdzhjbsa1.jpg",
    "comments": [
        "If budget and amc are available always choose the best option, RO + UV. But if you wanna go according to influencer talk, UV+ UF may suffice. \n\nIf you feel bad about wasting water with RO -  reuse the wasted water for cleaning mopping flushing etc.",
        "People says RO is not good for health. How true is it",
        "Yeah...I've seen people saying if TDS count is below 500 (WHO standard) then no need of RO.\n\nIn my water test result. TdS is just above 100 and turbidity is too high. So I'm planning to buy uv uf filter. Correct me if I am wrong.",
        "Any purifier that does uv+uf filtration. Don't go for ro based filters for waters with such high turbidity, maintenance costs will be higher.",
        "Yes a lot of influencers say this, quite a common myth. There are zero health issues related to reverse osmosis.",
        "Anywhere i can research this myth about RO",
        "There are no peer reviewed scientific research papers proving the health hazards of RO water. \n\nThere are a few bad studies, unsurprisingly from India but anyone with highschool/10th biology knowledge could break those down.\n\nLink: [Association of Vitamin B12 Deficiency and Use of Reverse Osmosis Processed Water for Drinking: A Cross-Sectional Study from Western India](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4948445/)  (you don't even need to open the link, the title would be enough) \n\nIf you don't get it then here's a gist: the study finds correlation(not causation) in between RO water consumers and B12 deficiency. This study has been used all over to demonise RO. But if you know most Indians are deficient in B12 and chromium anyways.    \nAnd chromium + B12 aren't supposed to be taken from water. They are available in a lot higher quantities in grains, meats, and veggies. Any fruit will have %s thousands higher than what you can get in water, even wheat can easily cover ur RDA. \n\nOn the other hand RO can filter out metals like Arsenic quite easily. I dunno what city you are from but in my city (lucknow) groundwater has small amounts of arsenic in it. (Most underground water, if dug deep, will have Arsenic and other metals in it). What I'm saying is, if you have a deficiency in a mineral or compound/vitamins get yourself checked and modify your diet accordingly, water shouldn't be your primary source of minerals + vitamins. \n\n\nA new myth is that RO water is acidic and hence can't be \"digested\" by the body. This is also seen with the rise in marketing around Alkaline water. All these claims assume your body cannot regulate the pH of water (spoiler: it can). \n\nAnother fan favorite theory is that if you fall ill from water borne diseases you'll gain a lot of immunity from it. This is basically - what doesn't kill you makes you stronger. Here's a breakdown of that by [Kurzgesagt](https://youtu.be/M-K7mxdN62M), I could blabber bout it but video format is more interesting.",
        "Hey did you decided which water purifier you will buy? I am also planning to buy.",
        "The [ZeroB UV Grande 2x UV UF water purifier](https://www.zerobonline.com/product/uv-grande-2x-uv-uf-water-purifier/) is a cutting-edge water filtration system designed to provide safe and clean drinking water for your home or office. The purifier combines two advanced purification technologies, UV and UF, to remove impurities, bacteria, and viruses from your water supply.\n\nIn addition, the ZeroB UV Grande 2x UV UF water purifier is easy to install and maintain, making it an ideal choice for households and offices looking for a reliable and efficient water filtration system. With its advanced technology, high-quality construction, and user-friendly features, this water purifier is sure to provide you with clean and safe drinking water for years to come.",
        "Yes, bought Aquagaurd regal for under 10k.\nBought it from a home appliance shop near me.",
        "What if water is hard?",
        "I don't know if any purifiers removes hardness but to remove hardness you need to subject the water to zeolite treatment.",
        "Which one would you suggest …. Right now",
        "You can opt for Livpure RO subscription, it covers for all RO related expenses. You just need to subscribe to it. Click here to know more :- https://lsh.care/c043o\n\nYou can also use my referral code RA3YY5 for Rs 100/- discount."
    ],
    "cleaned_text": "suggest type water purifier use home based water test results got basically title water source well water location kerala ",
    "cleaned_title": "suggest type water purifier use home based water test results got",
    "cleaned_selftext": "basically title water source well water location kerala",
    "cleaned_comments": "budget amc available always choose best option ro uv wan na go according influencer talk uv uf may suffice feel bad wasting water ro reuse wasted water cleaning mopping flushing etc people says ro good health true yeahive seen people saying tds count standard need ro water test result tds turbidity high im planning buy uv uf filter correct wrong purifier uvuf filtration dont go ro based filters waters high turbidity maintenance costs higher yes lot influencers say quite common myth zero health issues related reverse osmosis anywhere research myth ro peer reviewed scientific research papers proving health hazards ro water bad studies unsurprisingly india anyone highschoolth biology knowledge could break link association vitamin b deficiency use reverse osmosis processed water drinking crosssectional study western indiahttpswwwncbinlmnihgovpmcarticlespmc dont even need open link title would enough dont get heres gist study finds correlationnot causation ro water consumers b deficiency study used demonise ro know indians deficient b chromium anyways chromium b arent supposed taken water available lot higher quantities grains meats veggies fruit thousands higher get water even wheat easily cover ur rda hand ro filter metals like arsenic quite easily dunno city city lucknow groundwater small amounts arsenic underground water dug deep arsenic metals im saying deficiency mineral compoundvitamins get checked modify diet accordingly water shouldnt primary source minerals vitamins new myth ro water acidic hence cant digested body also seen rise marketing around alkaline water claims assume body regulate ph water spoiler another fan favorite theory fall ill water borne diseases youll gain lot immunity basically doesnt kill makes stronger heres breakdown kurzgesagthttpsyoutubemkmxdnm could blabber bout video format interesting hey decided water purifier buy also planning buy zerob uv grande x uv uf water purifierhttpswwwzerobonlinecomproductuvgrandexuvufwaterpurifier cuttingedge water filtration system designed provide safe clean drinking water home office purifier combines two advanced purification technologies uv uf remove impurities bacteria viruses water supply addition zerob uv grande x uv uf water purifier easy install maintain making ideal choice households offices looking reliable efficient water filtration system advanced technology highquality construction userfriendly features water purifier sure provide clean safe drinking water years come yes bought aquagaurd regal k bought home appliance shop near water hard dont know purifiers removes hardness remove hardness need subject water zeolite treatment one would suggest right opt livpure ro subscription covers ro related expenses need subscribe click know also use referral code rayy rs discount",
    "light_cleaned_title": "Suggest the type of water purifier to use at home based on the water test results that I just got.",
    "light_cleaned_selftext": "Basically the title. Water source: Well water Location: Kerala",
    "light_cleaned_comments": "If budget and amc are available always choose the best option, RO + UV. But if you wanna go according to influencer talk, UV+ UF may suffice. If you feel bad about wasting water with RO - reuse the wasted water for cleaning mopping flushing etc. People says RO is not good for health. How true is it Yeah...I've seen people saying if TDS count is below 500 (WHO standard) then no need of RO. In my water test result. TdS is just above 100 and turbidity is too high. So I'm planning to buy uv uf filter. Correct me if I am wrong. Any purifier that does uv+uf filtration. Don't go for ro based filters for waters with such high turbidity, maintenance costs will be higher. Yes a lot of influencers say this, quite a common myth. There are zero health issues related to reverse osmosis. Anywhere i can research this myth about RO There are no peer reviewed scientific research papers proving the health hazards of RO water. There are a few bad studies, unsurprisingly from India but anyone with highschool/10th biology knowledge could break those down. Link: [Association of Vitamin B12 Deficiency and Use of Reverse Osmosis Processed Water for Drinking: A Cross-Sectional Study from Western India](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4948445/) (you don't even need to open the link, the title would be enough) If you don't get it then here's a gist: the study finds correlation(not causation) in between RO water consumers and B12 deficiency. This study has been used all over to demonise RO. But if you know most Indians are deficient in B12 and chromium anyways. And chromium + B12 aren't supposed to be taken from water. They are available in a lot higher quantities in grains, meats, and veggies. Any fruit will have %s thousands higher than what you can get in water, even wheat can easily cover ur RDA. On the other hand RO can filter out metals like Arsenic quite easily. I dunno what city you are from but in my city (lucknow) groundwater has small amounts of arsenic in it. (Most underground water, if dug deep, will have Arsenic and other metals in it). What I'm saying is, if you have a deficiency in a mineral or compound/vitamins get yourself checked and modify your diet accordingly, water shouldn't be your primary source of minerals + vitamins. A new myth is that RO water is acidic and hence can't be \"digested\" by the body. This is also seen with the rise in marketing around Alkaline water. All these claims assume your body cannot regulate the pH of water (spoiler: it can). Another fan favorite theory is that if you fall ill from water borne diseases you'll gain a lot of immunity from it. This is basically - what doesn't kill you makes you stronger. Here's a breakdown of that by [Kurzgesagt](https://youtu.be/M-K7mxdN62M), I could blabber bout it but video format is more interesting. Hey did you decided which water purifier you will buy? I am also planning to buy. The [ZeroB UV Grande 2x UV UF water purifier](https://www.zerobonline.com/product/uv-grande-2x-uv-uf-water-purifier/) is a cutting-edge water filtration system designed to provide safe and clean drinking water for your home or office. The purifier combines two advanced purification technologies, UV and UF, to remove impurities, bacteria, and viruses from your water supply. In addition, the ZeroB UV Grande 2x UV UF water purifier is easy to install and maintain, making it an ideal choice for households and offices looking for a reliable and efficient water filtration system. With its advanced technology, high-quality construction, and user-friendly features, this water purifier is sure to provide you with clean and safe drinking water for years to come. Yes, bought Aquagaurd regal for under 10k. Bought it from a home appliance shop near me. What if water is hard? I don't know if any purifiers removes hardness but to remove hardness you need to subject the water to zeolite treatment. Which one would you suggest …. Right now You can opt for Livpure RO subscription, it covers for all RO related expenses. You just need to subscribe to it. Click here to know more :- You can also use my referral code RA3YY5 for Rs 100/- discount."
}