{
    "id": "18hbx48",
    "title": "Make in India \"miracle\"",
    "url": "https://www.reddit.com/r/india/comments/18hbx48/make_in_india_miracle/",
    "selftext": "&#x200B;\n\n[Manufacturing, value added \\(&#37; of GDP\\) - India](https://preview.redd.it/mj5k3tcwq06c1.png?width=882&format=png&auto=webp&s=361ea8e8ec4dbf37162543a0a684bb7c394f5291)\n\n[https://data.worldbank.org/indicator/NV.IND.MANF.ZS?locations=IN](https://data.worldbank.org/indicator/NV.IND.MANF.ZS?locations=IN)\n\nThe data is from the world bank. Despite all the hooha and Vishwaguru's promise of Make in India, this is the reality which the government hides and any criticism is considered as anti-national by them. It should be accepted by now that manufacturing won't take place in India and there is time bomb waiting to explode in the Indian economic miracle. ",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 5,
    "created_utc": 1702454601.0,
    "convurl": "https://b.thumbs.redditmedia.com/KpQwyv-grBF4n_xEoCcw5yPRZJugaT5qLCv4G8Ina4o.jpg",
    "comments": [
        "Y-axis is  % Manufaturing in GDP - Not absolute value of Manufacturing output.\n\nIt just means, Services and Agri sectors grew faster than Manufacturing.\n\n&#x200B;\n\nHere is the better graph:\n\n[https://www.macrotrends.net/countries/IND/india/manufacturing-output](https://www.macrotrends.net/countries/IND/india/manufacturing-output)\n\nBut, Yes - India needs more manufacturing."
    ],
    "cleaned_text": "make india miracle xb manufacturing value added gdp indiahttpspreviewredditmjktcwqcpngwidthformatpngautowebpseaeecdbfaabbcf httpsdataworldbankorgindicatornvindmanfzslocationsinhttpsdataworldbankorgindicatornvindmanfzslocationsin data world bank despite hooha vishwagurus promise make india reality government hides criticism considered antinational accepted manufacturing wont take place india time bomb waiting explode indian economic miracle ",
    "cleaned_title": "make india miracle",
    "cleaned_selftext": "xb manufacturing value added gdp indiahttpspreviewredditmjktcwqcpngwidthformatpngautowebpseaeecdbfaabbcf httpsdataworldbankorgindicatornvindmanfzslocationsinhttpsdataworldbankorgindicatornvindmanfzslocationsin data world bank despite hooha vishwagurus promise make india reality government hides criticism considered antinational accepted manufacturing wont take place india time bomb waiting explode indian economic miracle",
    "cleaned_comments": "yaxis manufaturing gdp absolute value manufacturing output means services agri sectors grew faster manufacturing xb better graph httpswwwmacrotrendsnetcountriesindindiamanufacturingoutputhttpswwwmacrotrendsnetcountriesindindiamanufacturingoutput yes india needs manufacturing",
    "light_cleaned_title": "Make in India \"miracle\"",
    "light_cleaned_selftext": "&#x200B; [Manufacturing, value added \\(&#37; of GDP\\) - India](https://preview.redd.it/mj5k3tcwq06c1.png?width=882&format=png&auto=webp&s=361ea8e8ec4dbf37162543a0a684bb7c394f5291) [https://data.worldbank.org/indicator/NV.IND.MANF.ZS?locations=IN](https://data.worldbank.org/indicator/NV.IND.MANF.ZS?locations=IN) The data is from the world bank. Despite all the hooha and Vishwaguru's promise of Make in India, this is the reality which the government hides and any criticism is considered as anti-national by them. It should be accepted by now that manufacturing won't take place in India and there is time bomb waiting to explode in the Indian economic miracle.",
    "light_cleaned_comments": "Y-axis is % Manufaturing in GDP - Not absolute value of Manufacturing output. It just means, Services and Agri sectors grew faster than Manufacturing. &#x200B; Here is the better graph: [https://www.macrotrends.net/countries/IND/india/manufacturing-output](https://www.macrotrends.net/countries/IND/india/manufacturing-output) But, Yes - India needs more manufacturing."
}