{
    "id": "1cko449",
    "title": "Spotify is getting desperate ",
    "url": "https://i.redd.it/1hwi6gs43lyc1.png",
    "selftext": "Devs trying their best to make it as unussable as possible ",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 6,
    "created_utc": 1714904364.0,
    "convurl": "https://i.redd.it/1hwi6gs43lyc1.png",
    "comments": [
        "You can get their premium for free if you use myntra. I got it a couple of months ago and life is smooth since then",
        "Could you please elaborate?",
        "If you(or someone around) you used made some orders from myntra recently, then you can check the insider section of the myntra app which will have a free Spotify premium code",
        "That's awesome if true!",
        "Yup, I have been using it since the last 8 months",
        "https://preview.redd.it/hb8fszqd7lyc1.jpeg?width=749&format=pjpg&auto=webp&s=44b9a173c1269c435a3f4319876f66eca45ff6ce"
    ],
    "cleaned_text": "spotify getting desperate devs trying best make unussable possible ",
    "cleaned_title": "spotify getting desperate",
    "cleaned_selftext": "devs trying best make unussable possible",
    "cleaned_comments": "get premium free use myntra got couple months ago life smooth since could please elaborate youor someone around used made orders myntra recently check insider section myntra app free spotify premium code thats awesome true yup using since last months",
    "light_cleaned_title": "Spotify is getting desperate",
    "light_cleaned_selftext": "Devs trying their best to make it as unussable as possible",
    "light_cleaned_comments": "You can get their premium for free if you use myntra. I got it a couple of months ago and life is smooth since then Could you please elaborate? If you(or someone around) you used made some orders from myntra recently, then you can check the insider section of the myntra app which will have a free Spotify premium code That's awesome if true! Yup, I have been using it since the last 8 months"
}