{
    "id": "jeipi6",
    "title": "Read IFF's Comments on TRAI's Consultation Paper on Broadband Access and Connectivity",
    "url": "https://www.reddit.com/r/india/comments/jeipi6/read_iffs_comments_on_trais_consultation_paper_on/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/7x7rzcfoi6u51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=4572d1f57be71b5711399082c0940dd6281bd76e\n\n# tl;dr\n\nIFF has submitted comments pursuant to the Telecom Regulatory Authority of India’s [**Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed**](https://trai.gov.in/consultation-paper-roadmap-promote-broadband-connectivity-and-enhanced-broadband-speed). In our comments, we highlighted the need to revamp the policy and regulatory initiatives surrounding the broadband infrastructure in the country to ensure that every citizen has access to the internet irrespective of their geographical location or social and economic status.   \n\n\n# Access to Internet is Essential\n\nThe right to access the internet has not yet been recognized as a fundamental right. However, in *Anuradha Bhasin v. Union of India* it was held that the internet is a medium to exercise fundamental rights provided by the Constitution of India. The judgement states that expressing one’s views or conducting one’s business through the internet are protected under Articles 19(1)(a) and 19(1)(g) of the Constitution respectively. However, does the Government have a positive obligation to provide access to the internet?  \n\n\nThe National Digital Communications Policy (NDCP), 2018 seeks to unlock the transformative power of digital communications networks - to achieve the goal of digital empowerment and improved well-being of the people of India. To this end the NDCP attempts to outline a set of goals, initiatives, strategies and intended policy outcomes. This policy has three missions, the first of which is “Connect India: Creating Robust Digital Communications Infrastructure”. The aim of this mission is to promote Broadband for All as a tool for socio-economic development, while ensuring service quality and environmental sustainability.   \n\n\nTo achieve this, we need to ensure that broadband infrastructure caters not only to needs based on connectivity and geography but also serves to alleviate sections of the society who have traditionally not been able to enjoy the benefits of access to the internet. Focused efforts need to be made by the Authority to ensure that special measures are taken to account for social conditions which have acted as a deterrent to access such as gender, caste or economic status.   \n\n\n# Our submissions\n\nThe paper touches upon various issues pertaining to broadband access and connectivity. Below we have summarized two of our main submissions.\n\n## 1. Need for updation of current definition\n\nIn our submissions, we highlight the lacuna that exists in the current framing of the definition of the term “broadband” and suggest necessary changes to ensure that it covers all of “Bharat”. Revision of the current definition is needed acutely and moving forward a process of constant revision should be put in place to ensure that the definition keeps pace with developments across the world.   \n\n\nPresently, the definition of broadband talks only about download speed which leaves much to be desired in terms of setting adequate standards which would help India achieve the goals of the NDCP-2018. India has a large digital economy which relies on synchronous digital communication. Upload speeds are vital to economic growth, cultural production and IOT devices. We have noticed that ISPs restrict and throttle upload speeds which impedes innovation and growth. To account for a fuller, complete advancement of the rights of users our recommendations is for broadband speeds to be a definition inclusive of upload speeds as well. Additionally, the definition should include download as well as upload speed to correspond to the dynamic use of the internet in the present scenario wherein the internet is used not only to consume information (download) but also to connect with peers and share information (upload).   \n\n\nTherefore, we suggested that “broadband” can be defined as: “Broadband is a data connection that is able to support interactive services including Internet access and has the capability of providing download and upload speeds which fall into one of the four categories mentioned herein to an individual subscriber from the point of presence (POP) of the service provider intending to provide Broadband service. The four categories of broadband speed are:  \n\n\n1. Normal - 512 KBp/s to 2 MBp/s download speed , 256 KBp/s to 1 MBp/s upload speed\n2. Good - 2 MBp/s to 20 MBp/s download speed , 1 MBp/s to 10 MBp/s upload speed\n3. Fast - 20 MBp/s to 50 MBp/s download speed , 10 MBp/s to 25 MBp/s upload speed\n4. Superfast - 50 MBp/s download speed and above, 25 MBp/s upload speed and above.   \n\n\n## 2. Need for development of broadband infrastructure\n\nWe also highlight the need to ensure that not only policy but also the accompanying infrastructure is developed in a way that constant updation is made possible. The Authority needs to envisage a way in which the development of infrastructure is done keeping in mind a public and private sector partnership.  Therefore, we submitted that the government adopts the “Dig Smart” approach for broadband infrastructure creation and highlight the multiple possibilities for cross-sector infrastructure development and sharing.   \n\n\nThe “Dig Smart” approach has been developed by the Fiber To The Home (FTTH) Council in the United States of America in their paper titled ‘[**FTTH Council Dig Smart: Best Practices for Cities and States Adopting Dig Once Policies**](https://www.ncbroadband.gov/community-broadband-playbook/nc-broadband-playbook-dig-once-policy-best-practices/open)’. The Dig Smart policy entails the “governments installing conduit whenever there is underground construction in the public right of way -- whether that construction is for installing new utility equipment, repairs, or road work. The government then has the opportunity to lease that conduit to broadband providers that are interested in deploying fiber networks to the community. This approach benefits the community by facilitating broadband entry and by giving the government an ongoing revenue source. In fact, as (they) will show, these revenues can more than make up for the initial capital expense. While some governments may be hesitant to pay for conduit themselves because of its short-term budget impact, they can recoup that investment over time while also creating significant benefits from the community.”  \n\n\nThese comments were drafted by IFF staff with the help of software engineer [**Gargi Sharma**](https://gs0510.github.io/about/).  \n\n\n# Important Documents\n\n1. IFF’s comments on TRAI's Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed dated October 19, 2020 ([**link**](https://drive.google.com/file/d/1WVmJ-qLjGwG8tYe0kpV1IsntgVj7wRmm/view?usp=sharing))\n2. TRAI’s Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed dated August 20, 2020 ([**link**](https://trai.gov.in/consultation-paper-roadmap-promote-broadband-connectivity-and-enhanced-broadband-speed))",
    "flair": "Policy/Economy",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1603168961,
    "convurl": "https://b.thumbs.redditmedia.com/aVwP5R3pzvgmrSqMq7XKbTsi4mjh9RCTCcI6eP-tbqo.jpg",
    "comments": [],
    "cleaned_text": "read iffs comments trais consultation paper broadband access connectivity ampxb tldr iff submitted comments pursuant telecom regulatory authority indias consultation paper roadmap promote broadband connectivity enhanced broadband speedhttpstraigovinconsultationpaperroadmappromotebroadbandconnectivityandenhancedbroadbandspeed comments highlighted need revamp policy regulatory initiatives surrounding broadband infrastructure country ensure every citizen access internet irrespective geographical location social economic status access internet essential right access internet yet recognized fundamental right however anuradha bhasin v union india held internet medium exercise fundamental rights provided constitution india judgement states expressing ones views conducting ones business internet protected articles g constitution respectively however government positive obligation provide access internet national digital communications policy ndcp seeks unlock transformative power digital communications networks achieve goal digital empowerment improved wellbeing people india end ndcp attempts outline set goals initiatives strategies intended policy outcomes policy three missions first connect india creating robust digital communications infrastructure aim mission promote broadband tool socioeconomic development ensuring service quality environmental sustainability achieve need ensure broadband infrastructure caters needs based connectivity geography also serves alleviate sections society traditionally able enjoy benefits access internet focused efforts need made authority ensure special measures taken account social conditions acted deterrent access gender caste economic status submissions paper touches upon various issues pertaining broadband access connectivity summarized two main submissions need updation current definition submissions highlight lacuna exists current framing definition term broadband suggest necessary changes ensure covers bharat revision current definition needed acutely moving forward process constant revision put place ensure definition keeps pace developments across world presently definition broadband talks download speed leaves much desired terms setting adequate standards would help india achieve goals ndcp india large digital economy relies synchronous digital communication upload speeds vital economic growth cultural production iot devices noticed isps restrict throttle upload speeds impedes innovation growth account fuller complete advancement rights users recommendations broadband speeds definition inclusive upload speeds well additionally definition include download well upload speed correspond dynamic use internet present scenario wherein internet used consume information download also connect peers share information upload therefore suggested broadband defined broadband data connection able support interactive services including internet access capability providing download upload speeds fall one four categories mentioned herein individual subscriber point presence pop service provider intending provide broadband service four categories broadband speed normal kbps mbps download speed kbps mbps upload speed good mbps mbps download speed mbps mbps upload speed fast mbps mbps download speed mbps mbps upload speed superfast mbps download speed mbps upload speed need development broadband infrastructure also highlight need ensure policy also accompanying infrastructure developed way constant updation made possible authority needs envisage way development infrastructure done keeping mind public private sector partnership therefore submitted government adopts dig smart approach broadband infrastructure creation highlight multiple possibilities crosssector infrastructure development sharing dig smart approach developed fiber home ftth council united states america paper titled ftth council dig smart best practices cities states adopting dig policieshttpswwwncbroadbandgovcommunitybroadbandplaybookncbroadbandplaybookdigoncepolicybestpracticesopen dig smart policy entails governments installing conduit whenever underground construction public right way whether construction installing new utility equipment repairs road work government opportunity lease conduit broadband providers interested deploying fiber networks community approach benefits community facilitating broadband entry giving government ongoing revenue source fact show revenues make initial capital expense governments may hesitant pay conduit shortterm budget impact recoup investment time also creating significant benefits community comments drafted iff staff help software engineer gargi sharmahttpsgsgithubioabout important documents iffs comments trais consultation paper roadmap promote broadband connectivity enhanced broadband speed dated october linkhttpsdrivegooglecomfiledwvmjqljgwgtyekpvisntgvjwrmmviewuspsharing trais consultation paper roadmap promote broadband connectivity enhanced broadband speed dated august linkhttpstraigovinconsultationpaperroadmappromotebroadbandconnectivityandenhancedbroadbandspeed ",
    "cleaned_title": "read iffs comments trais consultation paper broadband access connectivity",
    "cleaned_selftext": "ampxb tldr iff submitted comments pursuant telecom regulatory authority indias consultation paper roadmap promote broadband connectivity enhanced broadband speedhttpstraigovinconsultationpaperroadmappromotebroadbandconnectivityandenhancedbroadbandspeed comments highlighted need revamp policy regulatory initiatives surrounding broadband infrastructure country ensure every citizen access internet irrespective geographical location social economic status access internet essential right access internet yet recognized fundamental right however anuradha bhasin v union india held internet medium exercise fundamental rights provided constitution india judgement states expressing ones views conducting ones business internet protected articles g constitution respectively however government positive obligation provide access internet national digital communications policy ndcp seeks unlock transformative power digital communications networks achieve goal digital empowerment improved wellbeing people india end ndcp attempts outline set goals initiatives strategies intended policy outcomes policy three missions first connect india creating robust digital communications infrastructure aim mission promote broadband tool socioeconomic development ensuring service quality environmental sustainability achieve need ensure broadband infrastructure caters needs based connectivity geography also serves alleviate sections society traditionally able enjoy benefits access internet focused efforts need made authority ensure special measures taken account social conditions acted deterrent access gender caste economic status submissions paper touches upon various issues pertaining broadband access connectivity summarized two main submissions need updation current definition submissions highlight lacuna exists current framing definition term broadband suggest necessary changes ensure covers bharat revision current definition needed acutely moving forward process constant revision put place ensure definition keeps pace developments across world presently definition broadband talks download speed leaves much desired terms setting adequate standards would help india achieve goals ndcp india large digital economy relies synchronous digital communication upload speeds vital economic growth cultural production iot devices noticed isps restrict throttle upload speeds impedes innovation growth account fuller complete advancement rights users recommendations broadband speeds definition inclusive upload speeds well additionally definition include download well upload speed correspond dynamic use internet present scenario wherein internet used consume information download also connect peers share information upload therefore suggested broadband defined broadband data connection able support interactive services including internet access capability providing download upload speeds fall one four categories mentioned herein individual subscriber point presence pop service provider intending provide broadband service four categories broadband speed normal kbps mbps download speed kbps mbps upload speed good mbps mbps download speed mbps mbps upload speed fast mbps mbps download speed mbps mbps upload speed superfast mbps download speed mbps upload speed need development broadband infrastructure also highlight need ensure policy also accompanying infrastructure developed way constant updation made possible authority needs envisage way development infrastructure done keeping mind public private sector partnership therefore submitted government adopts dig smart approach broadband infrastructure creation highlight multiple possibilities crosssector infrastructure development sharing dig smart approach developed fiber home ftth council united states america paper titled ftth council dig smart best practices cities states adopting dig policieshttpswwwncbroadbandgovcommunitybroadbandplaybookncbroadbandplaybookdigoncepolicybestpracticesopen dig smart policy entails governments installing conduit whenever underground construction public right way whether construction installing new utility equipment repairs road work government opportunity lease conduit broadband providers interested deploying fiber networks community approach benefits community facilitating broadband entry giving government ongoing revenue source fact show revenues make initial capital expense governments may hesitant pay conduit shortterm budget impact recoup investment time also creating significant benefits community comments drafted iff staff help software engineer gargi sharmahttpsgsgithubioabout important documents iffs comments trais consultation paper roadmap promote broadband connectivity enhanced broadband speed dated october linkhttpsdrivegooglecomfiledwvmjqljgwgtyekpvisntgvjwrmmviewuspsharing trais consultation paper roadmap promote broadband connectivity enhanced broadband speed dated august linkhttpstraigovinconsultationpaperroadmappromotebroadbandconnectivityandenhancedbroadbandspeed",
    "cleaned_comments": "",
    "light_cleaned_title": "Read IFF's Comments on TRAI's Consultation Paper on Broadband Access and Connectivity",
    "light_cleaned_selftext": "# tl;dr IFF has submitted comments pursuant to the Telecom Regulatory Authority of India’s [**Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed**](https://trai.gov.in/consultation-paper-roadmap-promote-broadband-connectivity-and-enhanced-broadband-speed). In our comments, we highlighted the need to revamp the policy and regulatory initiatives surrounding the broadband infrastructure in the country to ensure that every citizen has access to the internet irrespective of their geographical location or social and economic status. # Access to Internet is Essential The right to access the internet has not yet been recognized as a fundamental right. However, in *Anuradha Bhasin v. Union of India* it was held that the internet is a medium to exercise fundamental rights provided by the Constitution of India. The judgement states that expressing one’s views or conducting one’s business through the internet are protected under Articles 19(1)(a) and 19(1)(g) of the Constitution respectively. However, does the Government have a positive obligation to provide access to the internet? The National Digital Communications Policy (NDCP), 2018 seeks to unlock the transformative power of digital communications networks - to achieve the goal of digital empowerment and improved well-being of the people of India. To this end the NDCP attempts to outline a set of goals, initiatives, strategies and intended policy outcomes. This policy has three missions, the first of which is “Connect India: Creating Robust Digital Communications Infrastructure”. The aim of this mission is to promote Broadband for All as a tool for socio-economic development, while ensuring service quality and environmental sustainability. To achieve this, we need to ensure that broadband infrastructure caters not only to needs based on connectivity and geography but also serves to alleviate sections of the society who have traditionally not been able to enjoy the benefits of access to the internet. Focused efforts need to be made by the Authority to ensure that special measures are taken to account for social conditions which have acted as a deterrent to access such as gender, caste or economic status. # Our submissions The paper touches upon various issues pertaining to broadband access and connectivity. Below we have summarized two of our main submissions. ## 1. Need for updation of current definition In our submissions, we highlight the lacuna that exists in the current framing of the definition of the term “broadband” and suggest necessary changes to ensure that it covers all of “Bharat”. Revision of the current definition is needed acutely and moving forward a process of constant revision should be put in place to ensure that the definition keeps pace with developments across the world. Presently, the definition of broadband talks only about download speed which leaves much to be desired in terms of setting adequate standards which would help India achieve the goals of the NDCP-2018. India has a large digital economy which relies on synchronous digital communication. Upload speeds are vital to economic growth, cultural production and IOT devices. We have noticed that ISPs restrict and throttle upload speeds which impedes innovation and growth. To account for a fuller, complete advancement of the rights of users our recommendations is for broadband speeds to be a definition inclusive of upload speeds as well. Additionally, the definition should include download as well as upload speed to correspond to the dynamic use of the internet in the present scenario wherein the internet is used not only to consume information (download) but also to connect with peers and share information (upload). Therefore, we suggested that “broadband” can be defined as: “Broadband is a data connection that is able to support interactive services including Internet access and has the capability of providing download and upload speeds which fall into one of the four categories mentioned herein to an individual subscriber from the point of presence (POP) of the service provider intending to provide Broadband service. The four categories of broadband speed are: 1. Normal - 512 KBp/s to 2 MBp/s download speed , 256 KBp/s to 1 MBp/s upload speed 2. Good - 2 MBp/s to 20 MBp/s download speed , 1 MBp/s to 10 MBp/s upload speed 3. Fast - 20 MBp/s to 50 MBp/s download speed , 10 MBp/s to 25 MBp/s upload speed 4. Superfast - 50 MBp/s download speed and above, 25 MBp/s upload speed and above. ## 2. Need for development of broadband infrastructure We also highlight the need to ensure that not only policy but also the accompanying infrastructure is developed in a way that constant updation is made possible. The Authority needs to envisage a way in which the development of infrastructure is done keeping in mind a public and private sector partnership. Therefore, we submitted that the government adopts the “Dig Smart” approach for broadband infrastructure creation and highlight the multiple possibilities for cross-sector infrastructure development and sharing. The “Dig Smart” approach has been developed by the Fiber To The Home (FTTH) Council in the United States of America in their paper titled ‘[**FTTH Council Dig Smart: Best Practices for Cities and States Adopting Dig Once Policies**](https://www.ncbroadband.gov/community-broadband-playbook/nc-broadband-playbook-dig-once-policy-best-practices/open)’. The Dig Smart policy entails the “governments installing conduit whenever there is underground construction in the public right of way -- whether that construction is for installing new utility equipment, repairs, or road work. The government then has the opportunity to lease that conduit to broadband providers that are interested in deploying fiber networks to the community. This approach benefits the community by facilitating broadband entry and by giving the government an ongoing revenue source. In fact, as (they) will show, these revenues can more than make up for the initial capital expense. While some governments may be hesitant to pay for conduit themselves because of its short-term budget impact, they can recoup that investment over time while also creating significant benefits from the community.” These comments were drafted by IFF staff with the help of software engineer [**Gargi Sharma**](https://gs0510.github.io/about/). # Important Documents 1. IFF’s comments on TRAI's Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed dated October 19, 2020 ([**link**](https://drive.google.com/file/d/1WVmJ-qLjGwG8tYe0kpV1IsntgVj7wRmm/view?usp=sharing)) 2. TRAI’s Consultation Paper on Roadmap to Promote Broadband Connectivity and Enhanced Broadband Speed dated August 20, 2020 ([**link**](https://trai.gov.in/consultation-paper-roadmap-promote-broadband-connectivity-and-enhanced-broadband-speed))",
    "light_cleaned_comments": ""
}