{
    "id": "12a91mt",
    "title": "[HELP] Does anyone know what to do when your parcel is at customs but none contacted you?",
    "url": "https://www.reddit.com/r/india/comments/12a91mt/help_does_anyone_know_what_to_do_when_your_parcel/",
    "selftext": "Pardon me if this isn't the right forum, let me know which subreddit should I go for this.\n\nA friend gifted me a wrist watch of 8k from [rschrono.com](https://rschrono.com). It is at the Bangalore customs, the delivery partner is India Post. I did not receive any communication from the customs or India Post regarding the shipment. I'm clueless how to get it. It was free shipping.\n\n* What is the right customs duty charge? Is it even there?\n* If there is a charge, where do I pay this?\n* How to ensure that the parcel moves forward?",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 9,
    "created_utc": 1680495121.0,
    "convurl": "https://external-preview.redd.it/Yp9HfK3VLNy_X_CwRCT2r9SY0MstLx9zDt5aKLPRzWw.jpg?auto=webp&v=enabled&s=728cd47794e8a165ae0c45c44324a3ff7a6b8c85",
    "comments": [
        "I tried all sorts of google searches but I found mixed views, some say I have to pay around 30%, some say 50% and some say I dont. I tried contacting banaglore customs, their number is invalid. :)",
        "If you have the tracking number, you will know where your package is. If it is stuck with the Bangalore customs, you will get a letter or visit by your postman to pay the taxes, if any, for releasing the package. It takes time, so wait for it.",
        "thank you for the information, it really helps. I can see that it is stuck, should I visit the post office to speed things up, I have to travel out of bangalore for a few weeks.",
        "Don't think they'll speed it up for you. What you can do is call your respective post office, speak to the post master there and get clarification on how things will move.",
        "Will do this today :) thanks",
        "You need to prepare for the worst, ordered 70 euros  cosmetics stuff n I was charged with 40 %  duty \n\nYour package probably  was scheduled for customs to be examined n duty to be calculated as determined by the custom official discretion, they probably have backlog hence the delay, you need contact the seller, if it's delayed long, they probably give you the accurate update \n\nAlways opt for paypal if you are shopping overseas , it's very risky with these stuff",
        "Had my parcel stuck in Delhi Customs for 3 months with no communication, and here is what I did.\n\nTried random support numbers, till someone helpful redirected me to the right authority/phone number.\n\nOn call, they told me to email the bill and invoice numbers, a couple of weeks and my package still didn't move, so I asked them if I can come in person and resolve it.\n\nWent in person, with all gst and documents printed and talked to the custom officers. My package was shipped the next day.\n\n\nCustom charge depends upon the cost of item, and the type of item. You will need to pay the charge when the courier delivers you the item",
        "Thanks everyone for your help and support. I would like to share an update on this. \n\nI received the parcel last month, it was stuck at the Customs for sometime. I met the officer at Foreign Post Office Bangalore and got it forward. I had to share the invoice to their officials over email for clearance. \n\nThe clearance process took around a week (possibly due to holidays) they mentioned 4-5 working days to me. \n\nSince it was shipped via India post, I had to pay Rs 4108 to the delivery executive at my door step. They accepted the payment via UPI and cash. This amount was in lieu of custom duty. \n\nYes, the product was fine and packaging was good. \n\nPlease let me know if you have any other queries.",
        "Hi, could you tell me the exact address of the post office you visited in person? One of my parcels is stuck there and no one is responding."
    ],
    "cleaned_text": "help anyone know parcel customs none contacted pardon isnt right forum let know subreddit go friend gifted wrist watch k rschronocomhttpsrschronocom bangalore customs delivery partner india post receive communication customs india post regarding shipment im clueless get free shipping right customs duty charge even charge pay ensure parcel moves forward ",
    "cleaned_title": "help anyone know parcel customs none contacted",
    "cleaned_selftext": "pardon isnt right forum let know subreddit go friend gifted wrist watch k rschronocomhttpsrschronocom bangalore customs delivery partner india post receive communication customs india post regarding shipment im clueless get free shipping right customs duty charge even charge pay ensure parcel moves forward",
    "cleaned_comments": "tried sorts google searches found mixed views say pay around say say dont tried contacting banaglore customs number invalid tracking number know package stuck bangalore customs get letter visit postman pay taxes releasing package takes time wait thank information really helps see stuck visit post office speed things travel bangalore weeks dont think theyll speed call respective post office speak post master get clarification things move today thanks need prepare worst ordered euros cosmetics stuff n charged duty package probably scheduled customs examined n duty calculated determined custom official discretion probably backlog hence delay need contact seller delayed long probably give accurate update always opt paypal shopping overseas risky stuff parcel stuck delhi customs months communication tried random support numbers till someone helpful redirected right authorityphone number call told email bill invoice numbers couple weeks package still didnt move asked come person resolve went person gst documents printed talked custom officers package shipped next day custom charge depends upon cost item type item need pay charge courier delivers item thanks everyone help support would like share update received parcel last month stuck customs sometime met officer foreign post office bangalore got forward share invoice officials email clearance clearance process took around week possibly due holidays mentioned working days since shipped via india post pay rs delivery executive door step accepted payment via upi cash amount lieu custom duty yes product fine packaging good please let know queries hi could tell exact address post office visited person one parcels stuck one responding",
    "light_cleaned_title": "[HELP] Does anyone know what to do when your parcel is at customs but none contacted you?",
    "light_cleaned_selftext": "Pardon me if this isn't the right forum, let me know which subreddit should I go for this. A friend gifted me a wrist watch of 8k from [rschrono.com](https://rschrono.com). It is at the Bangalore customs, the delivery partner is India Post. I did not receive any communication from the customs or India Post regarding the shipment. I'm clueless how to get it. It was free shipping. * What is the right customs duty charge? Is it even there? * If there is a charge, where do I pay this? * How to ensure that the parcel moves forward?",
    "light_cleaned_comments": "I tried all sorts of google searches but I found mixed views, some say I have to pay around 30%, some say 50% and some say I dont. I tried contacting banaglore customs, their number is invalid. :) If you have the tracking number, you will know where your package is. If it is stuck with the Bangalore customs, you will get a letter or visit by your postman to pay the taxes, if any, for releasing the package. It takes time, so wait for it. thank you for the information, it really helps. I can see that it is stuck, should I visit the post office to speed things up, I have to travel out of bangalore for a few weeks. Don't think they'll speed it up for you. What you can do is call your respective post office, speak to the post master there and get clarification on how things will move. Will do this today :) thanks You need to prepare for the worst, ordered 70 euros cosmetics stuff n I was charged with 40 % duty Your package probably was scheduled for customs to be examined n duty to be calculated as determined by the custom official discretion, they probably have backlog hence the delay, you need contact the seller, if it's delayed long, they probably give you the accurate update Always opt for paypal if you are shopping overseas , it's very risky with these stuff Had my parcel stuck in Delhi Customs for 3 months with no communication, and here is what I did. Tried random support numbers, till someone helpful redirected me to the right authority/phone number. On call, they told me to email the bill and invoice numbers, a couple of weeks and my package still didn't move, so I asked them if I can come in person and resolve it. Went in person, with all gst and documents printed and talked to the custom officers. My package was shipped the next day. Custom charge depends upon the cost of item, and the type of item. You will need to pay the charge when the courier delivers you the item Thanks everyone for your help and support. I would like to share an update on this. I received the parcel last month, it was stuck at the Customs for sometime. I met the officer at Foreign Post Office Bangalore and got it forward. I had to share the invoice to their officials over email for clearance. The clearance process took around a week (possibly due to holidays) they mentioned 4-5 working days to me. Since it was shipped via India post, I had to pay Rs 4108 to the delivery executive at my door step. They accepted the payment via UPI and cash. This amount was in lieu of custom duty. Yes, the product was fine and packaging was good. Please let me know if you have any other queries. Hi, could you tell me the exact address of the post office you visited in person? One of my parcels is stuck there and no one is responding."
}