{
    "id": "1azplyp",
    "title": "INLD Haryana unit chief Nafe Singh Rathee shot dead in Jhajjar",
    "url": "https://i.redd.it/jraqslebvqkc1.jpeg",
    "selftext": "Article: https://www.hindustantimes.com/india-news/inld-haryana-unit-chief-nafe-singh-rathee-shot-dead-in-jhajjar-101708869546503-amp.html",
    "flair": "Crime",
    "score": 78,
    "num_comments": 6,
    "created_utc": 1708872504.0,
    "convurl": "https://i.redd.it/jraqslebvqkc1.jpeg",
    "comments": [
        "Bhai Jhajjar , Bahadurgarh and Gurgaon ka scene bhot kharab hai and no one is scared of the cops anymore .",
        "Jatta da muqabala.\n\nIt's property related. Nafe Singh Rathee (INLD) has a property dispute with Jagdish Rathee (BJP) who was killed last year [1]\n\nWhen your farmland suddenly becomes worth millions of dollars, bullets fly. \n\nSame thing in Outer Bangalore and Hyderabad as well. \n\n[1] - https://indianexpress.com/article/cities/chandigarh/jagdish-rathi-suicide-by-consuming-poison-6-book-8378877/",
        "It's always been bad. In fact, it's definetly better now than in the 90s or early 2000s when urban development was new. ",
        "Yes.I remember years ago a BJP councillor was killed in his home by gunmen in Dichao Kalan near Najafgarh",
        "Rathee? This name is on fire these days",
        "https://preview.redd.it/ca8evsprrvkc1.jpeg?width=1536&format=pjpg&auto=webp&s=4451382aa888c52dcdedf400a14bb240799cfd74"
    ],
    "cleaned_text": "inld haryana unit chief nafe singh rathee shot dead jhajjar article ",
    "cleaned_title": "inld haryana unit chief nafe singh rathee shot dead jhajjar",
    "cleaned_selftext": "article",
    "cleaned_comments": "bhai jhajjar bahadurgarh gurgaon ka scene bhot kharab hai one scared cops anymore jatta da muqabala property related nafe singh rathee inld property dispute jagdish rathee bjp killed last year farmland suddenly becomes worth millions dollars bullets fly thing outer bangalore hyderabad well always bad fact definetly better early urban development new yesi remember years ago bjp councillor killed home gunmen dichao kalan near najafgarh rathee name fire days",
    "light_cleaned_title": "INLD Haryana unit chief Nafe Singh Rathee shot dead in Jhajjar",
    "light_cleaned_selftext": "Article:",
    "light_cleaned_comments": "Bhai Jhajjar , Bahadurgarh and Gurgaon ka scene bhot kharab hai and no one is scared of the cops anymore . Jatta da muqabala. It's property related. Nafe Singh Rathee (INLD) has a property dispute with Jagdish Rathee (BJP) who was killed last year [1] When your farmland suddenly becomes worth millions of dollars, bullets fly. Same thing in Outer Bangalore and Hyderabad as well. [1] - It's always been bad. In fact, it's definetly better now than in the 90s or early 2000s when urban development was new. Yes.I remember years ago a BJP councillor was killed in his home by gunmen in Dichao Kalan near Najafgarh Rathee? This name is on fire these days"
}