{
    "id": "t3vpcq",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/t3vpcq/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 15,
    "num_comments": 30,
    "created_utc": 1646098215,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Playing titalfall 2 campaign. So far it's been fun.",
        "Been playing Horizon Zero dawn and A way out. Horizon zero dawn is beautiful, the lantern ceremony paired with the dialogues by the matriarchs and the music made it way too emotional.  \n\n\nAbout A way out, the game is fun to play due to it's requirement for a 2nd player and the game seems ez af, would recommend it to almost everyone who wants to chill with their friends/partners.",
        "Yo i loved that game",
        "I tried planetside 2 over the last month. Absolute epic battles, never seen anything like that before.          \n\nThen tried Destiny 2. What a beautiful game. Downloaded it for PvP, but ended up mostly playing PvE. \n\nHad to delete both games because I was wasting too much time.    \n\nFinally, I tried Orbiter 2016. Its quite difficult to setup. But after that, its great. Managed to go to the moon, though I haven't landed yet. Will stick to Earth-moon system for now and master it before going to Mars. The author made it open source last year.",
        "Completed CoD : Modern Warfare 3 in beginning of this month. Haven't played anything since. Thinking of playing the witcher.",
        "Rocket League.. Diamond player now 👌",
        "I am gonna take a moment to point out how Elden ring - aside from stuttering - is very well optimized, runs at 45+~fps on my rtx 3050 xps 15 at medium/high 1200p. \n\nI downloaded it as a benchmarking tool, I am actually playing the game right now lmao.",
        "Wanna play together ? I'm champ",
        "Ps player or pc Or xbox?",
        "Xbox",
        "Pokemon scarlet and violet got announced exited for that after playing Pokemon legends Arceus",
        "Yeah runs well on 16gb and also playable at 8gb",
        "Horizon forbidden west\n\nLoved the first one, but this one was a bit of a letdown, too much of the same imo.\n\nThe first 2/3rds is too similar to the original, only in the final third is there something really different.\n\nAlso played the intro to cp2077, will prolly move onto that this week",
        "Wish I could play it for the first time again",
        "Halo Infinite campaign",
        "Ayo how is no one talking about Elden ring yet?!",
        "A board game- codename\nAvailable online too. Do play it guys. Minimum 4 people needed",
        "Exactly the same feelings, just rushed through it (thanks to Elden ring in the back of my mind maybe) but it didn’t hit the same as zero dawn. I’m still looking forward to the VR game tho",
        "GOTY contender already and I’m like 5 hours in lol",
        "The Witcher 3 is a must play.",
        "Such a great game. I had thoroughly enjoyed playing it.",
        "Yeah I heard it's great to play. I haven't played any witcher games yet but I am really eager to play it and complete the whole series. It's a RPG right? Any other RPG's you suggest.",
        "I have been playing it xD it's amazing",
        "Not that hyped :/ \nSeems like a sword and shield\nBut yeah i pray the games get good like before",
        "The Mass Effect series is also pretty awesome. Part one might show it's age but still worth it. Part 2 and 3 are awesome. You could try Witcher 2 as well. The first Witcher is too old now. The Deus Ex series also comes to mind. Really good. These are all action RPGs with strong story and world building.",
        "The great thing about the Witcher is the choices. There is no good path or bad path. It's all grey and all your choices have consequences. Choices like \"throw this baby into the fire\". Don't want to spoil. In the first Witcher I remember having to choose between evil villagers and a witch. The characters are well written. Brilliant voice acting.",
        "It sounds really exciting.",
        "Thanks for your recommendation. I'll look into them.",
        "Have you played Pla it's more like Pla than sword and shield and lighting engine in the trailer was very good yeah the same team which worked on sword and shield is developing it",
        "Played all of them so yeah played Plat",
        "Elden Ring, I am almost 200 hours in and my word this game is phenomenal, almost the best one I have ever played and I have played a lot of them."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "playing titalfall campaign far fun playing horizon zero dawn way horizon zero dawn beautiful lantern ceremony paired dialogues matriarchs music made way emotional way game fun play due requirement nd player game seems ez af would recommend almost everyone wants chill friendspartners yo loved game tried planetside last month absolute epic battles never seen anything like tried destiny beautiful game downloaded pvp ended mostly playing pve delete games wasting much time finally tried orbiter quite difficult setup great managed go moon though havent landed yet stick earthmoon system master going mars author made open source last year completed cod modern warfare beginning month havent played anything since thinking playing witcher rocket league diamond player gon na take moment point elden ring aside stuttering well optimized runs fps rtx xps mediumhigh p downloaded benchmarking tool actually playing game right lmao wan na play together im champ ps player pc xbox xbox pokemon scarlet violet got announced exited playing pokemon legends arceus yeah runs well gb also playable gb horizon forbidden west loved first one one bit letdown much imo first rds similar original final third something really different also played intro cp prolly move onto week wish could play first time halo infinite campaign ayo one talking elden ring yet board game codename available online play guys minimum people needed exactly feelings rushed thanks elden ring back mind maybe didnt hit zero dawn im still looking forward vr game tho goty contender already im like hours lol witcher must play great game thoroughly enjoyed playing yeah heard great play havent played witcher games yet really eager play complete whole series rpg right rpgs suggest playing xd amazing hyped seems like sword shield yeah pray games get good like mass effect series also pretty awesome part one might show age still worth part awesome could try witcher well first witcher old deus ex series also comes mind really good action rpgs strong story world building great thing witcher choices good path bad path grey choices consequences choices like throw baby fire dont want spoil first witcher remember choose evil villagers witch characters well written brilliant voice acting sounds really exciting thanks recommendation ill look played pla like pla sword shield lighting engine trailer good yeah team worked sword shield developing played yeah played plat elden ring almost hours word game phenomenal almost best one ever played played lot",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Playing titalfall 2 campaign. So far it's been fun. Been playing Horizon Zero dawn and A way out. Horizon zero dawn is beautiful, the lantern ceremony paired with the dialogues by the matriarchs and the music made it way too emotional. About A way out, the game is fun to play due to it's requirement for a 2nd player and the game seems ez af, would recommend it to almost everyone who wants to chill with their friends/partners. Yo i loved that game I tried planetside 2 over the last month. Absolute epic battles, never seen anything like that before. Then tried Destiny 2. What a beautiful game. Downloaded it for PvP, but ended up mostly playing PvE. Had to delete both games because I was wasting too much time. Finally, I tried Orbiter 2016. Its quite difficult to setup. But after that, its great. Managed to go to the moon, though I haven't landed yet. Will stick to Earth-moon system for now and master it before going to Mars. The author made it open source last year. Completed CoD : Modern Warfare 3 in beginning of this month. Haven't played anything since. Thinking of playing the witcher. Rocket League.. Diamond player now 👌 I am gonna take a moment to point out how Elden ring - aside from stuttering - is very well optimized, runs at 45+~fps on my rtx 3050 xps 15 at medium/high 1200p. I downloaded it as a benchmarking tool, I am actually playing the game right now lmao. Wanna play together ? I'm champ Ps player or pc Or xbox? Xbox Pokemon scarlet and violet got announced exited for that after playing Pokemon legends Arceus Yeah runs well on 16gb and also playable at 8gb Horizon forbidden west Loved the first one, but this one was a bit of a letdown, too much of the same imo. The first 2/3rds is too similar to the original, only in the final third is there something really different. Also played the intro to cp2077, will prolly move onto that this week Wish I could play it for the first time again Halo Infinite campaign Ayo how is no one talking about Elden ring yet?! A board game- codename Available online too. Do play it guys. Minimum 4 people needed Exactly the same feelings, just rushed through it (thanks to Elden ring in the back of my mind maybe) but it didn’t hit the same as zero dawn. I’m still looking forward to the VR game tho GOTY contender already and I’m like 5 hours in lol The Witcher 3 is a must play. Such a great game. I had thoroughly enjoyed playing it. Yeah I heard it's great to play. I haven't played any witcher games yet but I am really eager to play it and complete the whole series. It's a RPG right? Any other RPG's you suggest. I have been playing it xD it's amazing Not that hyped :/ Seems like a sword and shield But yeah i pray the games get good like before The Mass Effect series is also pretty awesome. Part one might show it's age but still worth it. Part 2 and 3 are awesome. You could try Witcher 2 as well. The first Witcher is too old now. The Deus Ex series also comes to mind. Really good. These are all action RPGs with strong story and world building. The great thing about the Witcher is the choices. There is no good path or bad path. It's all grey and all your choices have consequences. Choices like \"throw this baby into the fire\". Don't want to spoil. In the first Witcher I remember having to choose between evil villagers and a witch. The characters are well written. Brilliant voice acting. It sounds really exciting. Thanks for your recommendation. I'll look into them. Have you played Pla it's more like Pla than sword and shield and lighting engine in the trailer was very good yeah the same team which worked on sword and shield is developing it Played all of them so yeah played Plat Elden Ring, I am almost 200 hours in and my word this game is phenomenal, almost the best one I have ever played and I have played a lot of them."
}