{
    "id": "14ij3tu",
    "title": "Democracy in India isn't in danger or collapsing. Human rights in India is a different story",
    "url": "https://www.reddit.com/r/india/comments/14ij3tu/democracy_in_india_isnt_in_danger_or_collapsing/",
    "selftext": "In Freedom House's Freedom in the World report, India scores 33 out of 40 in \"political rights\", and in The Economist's Democracy Index, India scores 8.67 out of 10 in \"electoral process and pluralism\" and 7.50 out of 10 in \"functioning of government\". Yes, these scores have come down since 2014, but in no way to the extent that would indicate India's democracy is collapsing.\n\nWhat should be talked about is how violations of human rights by the Indian government have increased under Modi's BJP.\n\nhttps://www.hrw.org/world-report/2023/country-chapters/india\n\nhttps://www.amnesty.org/en/location/asia-and-the-pacific/south-asia/india/report-india/",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687689576.0,
    "convurl": "https://external-preview.redd.it/TY9xIb8wpIJoPjjOZs8WauFfBXFhEm-zQ1gzXAMzXNE.jpg?auto=webp&v=enabled&s=1373cf3f75ae0a795c290a3014289479597dd657",
    "comments": [],
    "cleaned_text": "democracy india isnt danger collapsing human rights india different story freedom houses freedom world report india scores political rights economists democracy index india scores electoral process pluralism functioning government yes scores come since way extent would indicate indias democracy collapsing talked violations human rights indian government increased modis bjp ",
    "cleaned_title": "democracy india isnt danger collapsing human rights india different story",
    "cleaned_selftext": "freedom houses freedom world report india scores political rights economists democracy index india scores electoral process pluralism functioning government yes scores come since way extent would indicate indias democracy collapsing talked violations human rights indian government increased modis bjp",
    "cleaned_comments": "",
    "light_cleaned_title": "Democracy in India isn't in danger or collapsing. Human rights in India is a different story",
    "light_cleaned_selftext": "In Freedom House's Freedom in the World report, India scores 33 out of 40 in \"political rights\", and in The Economist's Democracy Index, India scores 8.67 out of 10 in \"electoral process and pluralism\" and 7.50 out of 10 in \"functioning of government\". Yes, these scores have come down since 2014, but in no way to the extent that would indicate India's democracy is collapsing. What should be talked about is how violations of human rights by the Indian government have increased under Modi's BJP.",
    "light_cleaned_comments": ""
}