{
    "id": "1eod72u",
    "title": "Initial autopsy points to sexual assault, murder of woman trainee doctor found in Kolkata Hospital",
    "url": "https://www.deccanherald.com/india/west-bengal/initial-autopsy-points-to-sexual-assault-murder-of-woman-trainee-doctor-found-in-kolkata-hospital-3145015",
    "selftext": "A second year post graduate trainee was raped and murdered while on duty in a premiere goverment medical college in Kolkata. Is this what we have descended to as a society? ",
    "flair": "Crime",
    "score": 207,
    "num_comments": 7,
    "created_utc": 1723242951.0,
    "convurl": "https://external-preview.redd.it/i7Q0UaZJHVpySswIALO4I2_K1CAoIFg-4Lu4PPDvibY.jpg?auto=webp&s=6c3e55e769bf198a9b081447cb7d0444a8dc18c7",
    "comments": [
        "A sad of state of affairs for women in India.",
        "Truly sickening if that’s what really happened",
        "The college authorities are apparently trying to suppress the whole thing. As a doctor myself, this is disheartening. Is this the society I’m supposed to treat? Fucking thankless pigs. \nPlease dont let this news die out guys. Spread the word.",
        "Mamta didi would be proud",
        "Unlike other professions, hospitals have people who are doctors in the chain of command, why these people wh",
        "Education doesnt make you a good person I guess."
    ],
    "cleaned_text": "initial autopsy points sexual assault murder woman trainee doctor found kolkata hospital second year post graduate trainee raped murdered duty premiere goverment medical college kolkata descended society ",
    "cleaned_title": "initial autopsy points sexual assault murder woman trainee doctor found kolkata hospital",
    "cleaned_selftext": "second year post graduate trainee raped murdered duty premiere goverment medical college kolkata descended society",
    "cleaned_comments": "sad state affairs women india truly sickening thats really happened college authorities apparently trying suppress whole thing doctor disheartening society im supposed treat fucking thankless pigs please dont let news die guys spread word mamta didi would proud unlike professions hospitals people doctors chain command people wh education doesnt make good person guess",
    "light_cleaned_title": "Initial autopsy points to sexual assault, murder of woman trainee doctor found in Kolkata Hospital",
    "light_cleaned_selftext": "A second year post graduate trainee was raped and murdered while on duty in a premiere goverment medical college in Kolkata. Is this what we have descended to as a society?",
    "light_cleaned_comments": "A sad of state of affairs for women in India. Truly sickening if that’s what really happened The college authorities are apparently trying to suppress the whole thing. As a doctor myself, this is disheartening. Is this the society I’m supposed to treat? Fucking thankless pigs. Please dont let this news die out guys. Spread the word. Mamta didi would be proud Unlike other professions, hospitals have people who are doctors in the chain of command, why these people wh Education doesnt make you a good person I guess."
}