{
    "id": "16t6s65",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/16t6s65/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&s=a1c77fa439c6564d49fe03ebbbb17f7912ce8d58",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695778210.0,
    "convurl": "https://b.thumbs.redditmedia.com/m_ShovQiTlZxA9OoTUUQhOcU8YUleyjqaX1Ezeq7SyI.jpg",
    "comments": [
        "This is a great thread, I hope people find each other whom they can relate to and find a way to fight again. It's not easy today, it is not easy tomorrow but it will surely be easy someday. ❤hang in there.",
        "I think my sister (32f) is having anger issues. Yesterday, she slapped herself 5-6 times and pulled her hair when she had an argument with my mother. She also threw things on the floor like phone and a cup, spilling all the milk.She reacts everytime and never ready to listen to anyone. She has one girl 2.5 yrs old and one boy 9 months old. How can I help her?",
        "It depends how close you are to her, I mean what's your relationship with her. Do guys vibe with each other? If yes, talk to her. Make her feel safe that she can be vulnerable with you. What happened that made her to outburst and throw things around leading to traumatizing her own little toddlers? Be careful in not losing yourself over trying to fix her. She can only be fixed if she wants to work on herself. Try to talk to her husband. What role does he play in all of this? How does he handle when she angers and outbursts around him? There are so many things that play a role here. Take it one by one."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "great thread hope people find relate find way fight easy today easy tomorrow surely easy someday hang think sister f anger issues yesterday slapped times pulled hair argument mother also threw things floor like phone cup spilling milkshe reacts everytime never ready listen anyone one girl yrs old one boy months old help depends close mean whats relationship guys vibe yes talk make feel safe vulnerable happened made outburst throw things around leading traumatizing little toddlers careful losing trying fix fixed wants work try talk husband role play handle angers outbursts around many things play role take one one",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "This is a great thread, I hope people find each other whom they can relate to and find a way to fight again. It's not easy today, it is not easy tomorrow but it will surely be easy someday. ❤hang in there. I think my sister (32f) is having anger issues. Yesterday, she slapped herself 5-6 times and pulled her hair when she had an argument with my mother. She also threw things on the floor like phone and a cup, spilling all the milk.She reacts everytime and never ready to listen to anyone. She has one girl 2.5 yrs old and one boy 9 months old. How can I help her? It depends how close you are to her, I mean what's your relationship with her. Do guys vibe with each other? If yes, talk to her. Make her feel safe that she can be vulnerable with you. What happened that made her to outburst and throw things around leading to traumatizing her own little toddlers? Be careful in not losing yourself over trying to fix her. She can only be fixed if she wants to work on herself. Try to talk to her husband. What role does he play in all of this? How does he handle when she angers and outbursts around him? There are so many things that play a role here. Take it one by one."
}