{
    "id": "12hdu9o",
    "title": "Each scam has their own unique process to fool people",
    "url": "https://www.reddit.com/gallery/12hdu9o",
    "selftext": "Just got texted by random number and got offered remote online easy job, obviously it is a scam. \n\nWhat's worse is that the person behind this is an Indian, these people don't realise the sufferings they cause to people who got scammed.\n\nNote: Beware of online jobs and if any job you find is easy and pay is good then be careful.",
    "flair": "Crime",
    "score": 43,
    "num_comments": 37,
    "created_utc": 1681120614.0,
    "convurl": "https://i.redd.it/rdsqopc551ta1.jpg",
    "comments": [
        "The image is original content that is taken from my own mobile, it is a screenshot but it is not a screenshot of social media posts or comments nor is it an ai generated art.\n\nThis post is meant to spread awareness of scams for fellow Indians",
        "I feel you should buy a burner phone just for these antics. Funny these folks are.",
        "Lol nice suggestion, but they would usually text me in my main number which I do not like.",
        "Yeah got similar like this a week ago. Blocked them.",
        "PSA. These guys give you joining bonus on 150rs. Dont forget to collect it. Take their mosny and ghost.",
        "Each scam has their own unique process to gain trust of people.",
        "To click links you can use alternate number.",
        "They give you 150rs 2 times. Then ask to pay some money for higher returning tasks.",
        "Yes, this is a scam. I lost 40k in this scheme. This is how it happened:\n\nThe same message was sent to me, like 3 videos, get Rs.150. I did as asked and received rs.150.\n\nI got excited, then after some more likes, they added me to the telegram group, where you like videos and then do a prepaid task.\n\nThere are even fake transaction screenshots to gain your trust that people are actually receiving money.\n\nIn the first 2-3 prepaid task, the amount will be not that much.\n\nEach prepaid task consists of 2-4 tasks, every time the is increased in each task.\n\nWhen you will do your first prepaid task, you will agree with the conditions, then first, they will ask you to submit rs.1000, then you will see the profits after completing the first task, then it will rs.700 or 800, you will again see profits, then as first prepaid task is complete they will do send the money to you with profits.\n\nthen after such 2-3 prepaid tasks, they will add you to the VIP group.\n\nNow, here is the main game played, once you agree to go ahead, first the amount will be low like rs.5k or rs.7k, once you pay it, and complete the task, you will see profits, then they will suddenly increase the amount to Rs.50000. now you have to submit Rs.40000 more to complete 2nd task, even if you manage do pay this amount, in the third round they will ask to submit Rs.150000, and we all know it is not a small amount,\n\nNow, as we will not be able to pay this much amount because mostly the victims are students, the money is stuck and lost.\n\nSO, PLEASE DO NOT PROCEED WITH THIS TELEGRAM SCHEME. BE AWARE AND SPREAD THIS TO EVERYONE SO THEY ARE SAFE AND SECURE.",
        "Nowadays, even beggars & poor people find creative ways to get more than a buck or two.",
        "Indian youth fails to understand that the amount of money doing 24 hours of unskilled work is equal to the amount of money doing 10 minutes of skilled work.\nScammers take advantage of this fact.\nSo, gaining skills >>>>> making money doing unskilled jobs",
        "I received similar text messages on WhatsApp from such a similar combination of contact details(masquerading as an American woman with a business profile). I declined the offer after sensing a scam in the mentioned tasks. \n\nNevertheless, I couldn't figure out how these people get  my contact details ?(I frequently deny sharing my actual phone number with strangers and businesses(online and offline) unless absolutely necessary ).",
        "So you're saying that I can first get some money from them and then block them?",
        "Thank You 🙀",
        "I got the same message, played along and got 150rs then as soon as they added me to their telegram channel I blocked the number.",
        "Yes. Done it. My friend did it. My brother did it. It's like we ran the scam here.",
        "Bro how can I talk with the scammer i need some money too",
        "Gaining skills takes hours and hours.",
        "They'll message you. Just do the first 3 and get the 150 and block them 💀",
        "Leaked databases are sold pretty cheap.",
        "Report this in cyber crime portal. Dont ignore it, you know this is scam others might not.\n\nI already reported 4 numbers like this.",
        "How do they pay? Via UPI?",
        "Same thing happened with me last week. I'm very selective in giving my number too. But last i recall i gave my number to my bank cashier who was gonna call me month end, said wanted to meet some targets. I gave it thinking it's bank and official place 10 days later i get the message. So seriously don't know if that bank employee leaked it or not.",
        "Yes. Do this exactly. I didn't do the prepaid thing cos I'm not dumb. But made 750 off of em. That's fine with me. Hahaha.",
        "Yes.",
        "It's sad you still didn't get my point.\n\nSpending time on learning skills will only yield better and more returns in future as compared to doing unskilled work alone.",
        "I agree with you and understand what youre saying. I was adding that its easier to do nothing than acquire skills. This stops plenty.",
        "I would happily take it especially if it is Amazon gift cards. They r untraceable",
        "I wish I saw your message early or something I lost a huge amount. I'm in a very worst situation all I think about is die. God what ve I done.",
        "How much did you lose bro?",
        "2 lakh. \n\nGoogle Maps: United Human\n\nNew Delhi\n\nUnited Human Rights Federation\n\nThis is what I gathered from them. Above is their company name. \nPlease be aware of them! Whenever I heard these type of scams I laughed like who ll give money to Stragers. Now it happened to me. So please be aware of telegram scams.",
        "Nope. Only bank",
        "People who get scammed with such beginner level scams should delete their reddit."
    ],
    "cleaned_text": "scam unique process fool people got texted random number got offered remote online easy job obviously scam whats worse person behind indian people dont realise sufferings cause people got scammed note beware online jobs job find easy pay good careful ",
    "cleaned_title": "scam unique process fool people",
    "cleaned_selftext": "got texted random number got offered remote online easy job obviously scam whats worse person behind indian people dont realise sufferings cause people got scammed note beware online jobs job find easy pay good careful",
    "cleaned_comments": "image original content taken mobile screenshot screenshot social media posts comments ai generated art post meant spread awareness scams fellow indians feel buy burner phone antics funny folks lol nice suggestion would usually text main number like yeah got similar like week ago blocked psa guys give joining bonus rs dont forget collect take mosny ghost scam unique process gain trust people click links use alternate number give rs times ask pay money higher returning tasks yes scam lost k scheme happened message sent like videos get rs asked received rs got excited likes added telegram group like videos prepaid task even fake transaction screenshots gain trust people actually receiving money first prepaid task amount much prepaid task consists tasks every time increased task first prepaid task agree conditions first ask submit rs see profits completing first task rs see profits first prepaid task complete send money profits prepaid tasks add vip group main game played agree go ahead first amount low like rsk rsk pay complete task see profits suddenly increase amount rs submit rs complete nd task even manage pay amount third round ask submit rs know small amount able pay much amount mostly victims students money stuck lost please proceed telegram scheme aware spread everyone safe secure nowadays even beggars poor people find creative ways get buck two indian youth fails understand amount money hours unskilled work equal amount money minutes skilled work scammers take advantage fact gaining skills making money unskilled jobs received similar text messages whatsapp similar combination contact detailsmasquerading american woman business profile declined offer sensing scam mentioned tasks nevertheless couldnt figure people get contact details frequently deny sharing actual phone number strangers businessesonline offline unless absolutely necessary youre saying first get money block thank got message played along got rs soon added telegram channel blocked number yes done friend brother like ran scam bro talk scammer need money gaining skills takes hours hours theyll message first get block leaked databases sold pretty cheap report cyber crime portal dont ignore know scam others might already reported numbers like pay via upi thing happened last week im selective giving number last recall gave number bank cashier gon na call month end said wanted meet targets gave thinking bank official place days later get message seriously dont know bank employee leaked yes exactly didnt prepaid thing cos im dumb made em thats fine hahaha yes sad still didnt get point spending time learning skills yield better returns future compared unskilled work alone agree understand youre saying adding easier nothing acquire skills stops plenty would happily take especially amazon gift cards r untraceable wish saw message early something lost huge amount im worst situation think die god done much lose bro lakh google maps united human new delhi united human rights federation gathered company name please aware whenever heard type scams laughed like give money stragers happened please aware telegram scams nope bank people get scammed beginner level scams delete reddit",
    "light_cleaned_title": "Each scam has their own unique process to fool people",
    "light_cleaned_selftext": "Just got texted by random number and got offered remote online easy job, obviously it is a scam. What's worse is that the person behind this is an Indian, these people don't realise the sufferings they cause to people who got scammed. Note: Beware of online jobs and if any job you find is easy and pay is good then be careful.",
    "light_cleaned_comments": "The image is original content that is taken from my own mobile, it is a screenshot but it is not a screenshot of social media posts or comments nor is it an ai generated art. This post is meant to spread awareness of scams for fellow Indians I feel you should buy a burner phone just for these antics. Funny these folks are. Lol nice suggestion, but they would usually text me in my main number which I do not like. Yeah got similar like this a week ago. Blocked them. PSA. These guys give you joining bonus on 150rs. Dont forget to collect it. Take their mosny and ghost. Each scam has their own unique process to gain trust of people. To click links you can use alternate number. They give you 150rs 2 times. Then ask to pay some money for higher returning tasks. Yes, this is a scam. I lost 40k in this scheme. This is how it happened: The same message was sent to me, like 3 videos, get Rs.150. I did as asked and received rs.150. I got excited, then after some more likes, they added me to the telegram group, where you like videos and then do a prepaid task. There are even fake transaction screenshots to gain your trust that people are actually receiving money. In the first 2-3 prepaid task, the amount will be not that much. Each prepaid task consists of 2-4 tasks, every time the is increased in each task. When you will do your first prepaid task, you will agree with the conditions, then first, they will ask you to submit rs.1000, then you will see the profits after completing the first task, then it will rs.700 or 800, you will again see profits, then as first prepaid task is complete they will do send the money to you with profits. then after such 2-3 prepaid tasks, they will add you to the VIP group. Now, here is the main game played, once you agree to go ahead, first the amount will be low like rs.5k or rs.7k, once you pay it, and complete the task, you will see profits, then they will suddenly increase the amount to Rs.50000. now you have to submit Rs.40000 more to complete 2nd task, even if you manage do pay this amount, in the third round they will ask to submit Rs.150000, and we all know it is not a small amount, Now, as we will not be able to pay this much amount because mostly the victims are students, the money is stuck and lost. SO, PLEASE DO NOT PROCEED WITH THIS TELEGRAM SCHEME. BE AWARE AND SPREAD THIS TO EVERYONE SO THEY ARE SAFE AND SECURE. Nowadays, even beggars & poor people find creative ways to get more than a buck or two. Indian youth fails to understand that the amount of money doing 24 hours of unskilled work is equal to the amount of money doing 10 minutes of skilled work. Scammers take advantage of this fact. So, gaining skills >>>>> making money doing unskilled jobs I received similar text messages on WhatsApp from such a similar combination of contact details(masquerading as an American woman with a business profile). I declined the offer after sensing a scam in the mentioned tasks. Nevertheless, I couldn't figure out how these people get my contact details ?(I frequently deny sharing my actual phone number with strangers and businesses(online and offline) unless absolutely necessary ). So you're saying that I can first get some money from them and then block them? Thank You 🙀 I got the same message, played along and got 150rs then as soon as they added me to their telegram channel I blocked the number. Yes. Done it. My friend did it. My brother did it. It's like we ran the scam here. Bro how can I talk with the scammer i need some money too Gaining skills takes hours and hours. They'll message you. Just do the first 3 and get the 150 and block them 💀 Leaked databases are sold pretty cheap. Report this in cyber crime portal. Dont ignore it, you know this is scam others might not. I already reported 4 numbers like this. How do they pay? Via UPI? Same thing happened with me last week. I'm very selective in giving my number too. But last i recall i gave my number to my bank cashier who was gonna call me month end, said wanted to meet some targets. I gave it thinking it's bank and official place 10 days later i get the message. So seriously don't know if that bank employee leaked it or not. Yes. Do this exactly. I didn't do the prepaid thing cos I'm not dumb. But made 750 off of em. That's fine with me. Hahaha. Yes. It's sad you still didn't get my point. Spending time on learning skills will only yield better and more returns in future as compared to doing unskilled work alone. I agree with you and understand what youre saying. I was adding that its easier to do nothing than acquire skills. This stops plenty. I would happily take it especially if it is Amazon gift cards. They r untraceable I wish I saw your message early or something I lost a huge amount. I'm in a very worst situation all I think about is die. God what ve I done. How much did you lose bro? 2 lakh. Google Maps: United Human New Delhi United Human Rights Federation This is what I gathered from them. Above is their company name. Please be aware of them! Whenever I heard these type of scams I laughed like who ll give money to Stragers. Now it happened to me. So please be aware of telegram scams. Nope. Only bank People who get scammed with such beginner level scams should delete their reddit."
}