{
    "id": "154kca5",
    "title": "Take action or we will: SC to govt on Manipur video",
    "url": "https://www.rediff.com/news/report/take-action-or-we-will-sc-to-govt-on-manipur-video/20230720.htm",
    "selftext": "https://www.rediff.com/news/report/take-action-or-we-will-sc-to-govt-on-manipur-video/20230720.htm",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689839389.0,
    "convurl": "https://external-preview.redd.it/jhFeOLDkA3PQzvUCQ1eMxgL-xPLTBXEWbQ6SMjeoe8E.jpg?auto=webp&s=61418ecc6dc0e3a8716ac24b06a8001c4a5de234",
    "comments": [
        "Modi has already taken action. He expressed his outrage and has asked ALL states to provide security to women. Matter closed\n\nNothing that Modi will do now will suffice. The women who have suffered can never get back their lives. This is all on Modi",
        "Words words words words words.\nThe best time to do anything was about two months ago.\n\nJust because the internet was blocked does not mean that gov and institutions did not know the ground reality. Now that everyone is neck deep in shit they start pointing fingers.\n\nGimme a break",
        "I would like to state the Kejriwal meme *toh kar na* here. Take action, mofo government isn't doing shit!",
        "Modi has tweeted about it and other BJP members so thats an action."
    ],
    "cleaned_text": "take action sc govt manipur video  ",
    "cleaned_title": "take action sc govt manipur video",
    "cleaned_selftext": "",
    "cleaned_comments": "modi already taken action expressed outrage asked states provide security women matter closed nothing modi suffice women suffered never get back lives modi words words words words words best time anything two months ago internet blocked mean gov institutions know ground reality everyone neck deep shit start pointing fingers gim break would like state kejriwal meme toh kar na take action mofo government isnt shit modi tweeted bjp members thats action",
    "light_cleaned_title": "Take action or we will: SC to govt on Manipur video",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Modi has already taken action. He expressed his outrage and has asked ALL states to provide security to women. Matter closed Nothing that Modi will do now will suffice. The women who have suffered can never get back their lives. This is all on Modi Words words words words words. The best time to do anything was about two months ago. Just because the internet was blocked does not mean that gov and institutions did not know the ground reality. Now that everyone is neck deep in shit they start pointing fingers. Gimme a break I would like to state the Kejriwal meme *toh kar na* here. Take action, mofo government isn't doing shit! Modi has tweeted about it and other BJP members so thats an action."
}