{
    "id": "15vbfi5",
    "title": "Got a message that they will file a case on me under 138 of NI 1881, for dishonour of EMI. But I haven't taken any EMI",
    "url": "https://www.reddit.com/r/india/comments/15vbfi5/got_a_message_that_they_will_file_a_case_on_me/",
    "selftext": "https://ibb.co/17ckGq3\nhttps://ibb.co/QCgmhdJ\n\nSo I got a message on WhatsApp: \n\n> Dear BANK Costumer \nyou have delayed/defaulted in repayment of BANK. We may file criminal proceedings u/s 138 of N.I. Act, 1881, for dishonor of EMIs, and it may leads to Jail for up to 2 years & fine. Contact  for Payment/Settlement of the case. visit nearest BRANCH in Cash.\n\nCONTACT = 8779xxxx X MISHRA (MANAGER)\n\nBut I have not taken any EMI, I got a call to somedays ago asking if I am Y person, when I denied they asked ; if I know the Y person, I denied again and they cut the call. I ignored it thinking of it as some kind of scam or etc \n\nBut then I remember Y, when I bought this number 2 years ago, this name appeared on Truecaller. Maybe my number was someone else , I had got some random people messages too asking if I am Y. But now it is too much \n\nAm I in trouble? Because he haven't paid his EMI honestly I don't know what is happening. I am a 21 years student, Living with their parents. \n\nAnd what can I do?",
    "flair": "AskIndia",
    "score": 35,
    "num_comments": 55,
    "created_utc": 1692436975.0,
    "convurl": "https://external-preview.redd.it/oXF4Pt1IPU5abFiNVnWecsjzNTJ3cGe8iD_We6EuR7Q.jpg?auto=webp&s=c4b77a7efd51f030752864298171bc003b570253",
    "comments": [
        "My first thoughts were that it could be a scam. Or someone else with your present number might have had it in the past.",
        "No bank would ask you to contact Mishra. The message wording looks like it's a scam.",
        "Yeh same, but the question rise how the scammer know that specific name",
        "I wish",
        "bank will not mesage you on whatsapp. and even if they did they'll take your name. and if it is not your name. you're free.  just call the customer care of the said bank and tell them this problem. might be good to contact any nearest branch manager, he'll be of help. you can also contact ombudsman on rbi.",
        "They haven't mentioned any bank name too, I guess this is the biggest sign \n\nIt's a scam I guess",
        "The branch manager will try and contact you everywhere if you have defaulted on a loan. WhatsApp email linked in fb.",
        "I think I should make a call scam or not everything will be clear",
        "Relax , if you aren’t the same person you can surely chill ..\n\nYou may not even be worried about it yet if you want to cover all your tracks .. Maybe only if you want :\n\n1). Run a civil report - 500 rupees for entire year .. it details all your loans etc .. which I believe would be NIL.\n2). Call the guy , tell him the number belongs to you and EMI belongs to probably old guy  .. \n\nAsk his official email I’d and tell him with a free shot of CIBIL of the loan page only .. only if needed.",
        "Yes it is. maybe you can check your cibil score. \nI do not know about that much,  but if you don't pay your loans on time it affects your cibil score.",
        "But they'll mention bank name too? \nright? \nin this case no mention of bank",
        "It’s not a scam but these are recovery agents. You need not worry. Talk to the bank and get this sorted. You can get bank details from the recovery agent.",
        "Scammers will message you on whatsapp. Not government officials or your bank.",
        "May be a scam.\nIn any case, Do not call numbers on WhatsApp. Just block it. \n\nVisit cibil and take a credit report, if  there are any loans open, find out. From that report. \n\n\nGo to bank info on your passbook/statements\nOr cards\nOr visit branch",
        ">Dear BANK Costumer you have delayed/defaulted in repayment of BANK\n\nCustomer not costumer. That typo means it is definitely a scam, don't overthink.",
        "Costumer😁",
        "OP I would like to know more about your line of work. Do you make costumes for bank employees - dear bank costumer?",
        "Scam",
        "It's an amateurish scam. Spelling is a give away as is payment in cash. \n\nHowever please remember the following:-\n\n\n1. Loan is given to a person not a phone no.\n\n2. Any case will require a plaintiff and defendant both of whom have to be legal entities. \n\n3. Before any proceedings are initiated, the other party must be given notice which would be the loan taker \n\n4. You must be personally named in a summons if you need to be present in court.\n\n5. The plaintiff must prove the case i.e. he has to prove that a loan was given. It was given to X , Y is an alias of X or X acted on behalf of Y.",
        "As another pointed out, best to check Cibil. Sometimes some loantakers will use fake phone number or address and recovery agents will call or arrive at your door. Happened to me when I had gotten PAN card done from a sketchy shop. \n\nA lot of third party services can check credit score for you once a month in exchange for privacy I guess. I use paisabazaar personally because they query all four consumer credit agencies and many banks half update info on non-CIibil agencies. If privacy is a concern Cibil on their site provides one free report every year. Other agencies had difficult manual processes.",
        "100% scam.",
        "SCAM",
        "Relax, It's a scam. Bank never sends WhatsApp messages for emi payment and threatens with criminal case.  Just block number",
        "No. The sms was correct. Maybe OP goes to the bank in a costume.",
        "You are in big trouble if you are a “costumer”. If not, you’re good chill.",
        "Fraud, 1st clie, who calls themselves \"legal department\"? Legal department of what?",
        "Let them file the case, happened with me, they never file case, lol. Its scam",
        "No matter what you do, do not respond or entertain the call or messages that come to you. Only believe the communications that come from trustworthy sources, customer service that you called, not the one you received. Or visit the bank.",
        "Don't respond. Next time they call you, cuss them out",
        "Bro do not call the number whatsoever. Do not share your name or any details. Do not pick their calls. If they contact you again go to your bank. Show them the message. They'll help. This is almost certainly a scam. Banks do not contact on Whattsapp. And any lapse in emi is mailed to your address in passbook.\n\nLets say the person previously using your number had a emi. The EMI would be charged from his account, linked to his aadhar card. His address would be verified and associated to the account. \n\nYour phone number is not your bank account. \n\nDON'T BE STUPID",
        "Be confident. These scamsters feed on the lack of confidence of the Indian banking/financial customers. If you have not taken any loan, then be assertive. Don't be meek and afraid. If possible, block this number and report it to the cybercrime cell. That will help others.",
        "No bank every contacts you through WhatsApp. They message you on your number. Go to the nearest branch of said bank and talk to people there.",
        "Well doubt there is anything they will be able to do if there is loan attached to your Aadhar/PAN. Just cause they have your number they can’t do shit about it. Honestly these banks and lenders have some really shady people working for them. I am been getting bothered by Tata Capital left, right and center from past 10-12 years. Someone has took a loan of over 3 crore and registered my number over there. I have messaged, called, emailed Tata like zillion times but they just refuse to budge. Now that I am not living in india I just let them call me repeatedly and don’t even bother to answer any of it.",
        "from truecaller, you mentioned in the post",
        "It's a fake.",
        "Scam",
        "100% scam.\n\nIdentity is not based on phone number. They can not threaten you just because someone else owned your phone number a few months ago.\n\nBanks never talk on whatsapp as someone said earlier. They either use email or regular postal service for this kind of information.\n\nI haven't been to India in a while but it looks like a number of businesses have started using Whatsapp as one of the channels of communication in India. This is completely unheard of the west and I think it should stay the same in India too atleast in case of banking or any other financial services.",
        "There are all types of managers with varying level of communication skills especially in psbs. So it isn't out of realm of possibilities",
        "I agree, but options sre limited in case of no concrete information.",
        "Yeah call them and clarify. Don't give any of your details or download some app.",
        "i too am wearing costumes fellow human",
        "yeah fuck Mishra",
        "Lmao 🤣🤣",
        "Bro just look at number of grammatical or spelling mistakes😂😂😂",
        "Before recovery agents contact you,the employees in the particular branch of the bank will inform about the default if it is legitimate. Just mark spam and ignore.",
        "Scam",
        "Banks cannot directly initiate criminal proceedings for EMI default. Read this\n\nhttps://www.google.com/amp/s/economictimes.indiatimes.com/blogs/et-commentary/how-a-loan-default-in-itself-doesnt-amount-to-criminal-liability/\n\nThe way it's worded, and the fact that it was sent on WhatsApp, indicates this is a scam. If you haven't taken a loan, just ignore it. They can't do anything against you just because you hold a particular phone number.",
        "It's a scam bro. Let it go.",
        "aye vedya bc scam hai  \nkyu khali peeli gand fat vaa ra hai  \nle vada pav kha",
        "Even my aunty is facing something similar and she is getting calls from the bank. Someone took a mobile loan on behalf of her from Bangalore and she lives in Mumbai. She never visited Banglore or knew anyone there.",
        "\nThe moment you see a typo like “customer spelled costumer” you should know.",
        "Lodde ka EMI bol ke phone cut krde bro🤌",
        "Block the number. It's a SCAM. If you miss a EMI, the manager will himself call you. You don't need to contact anyone.",
        "Sometimes it's \"leagal department\"",
        "Lol😆",
        "It’s an obvious scam. Usually if a bank has to collect from you they will refer to you by your name and not use generic words like Bank Costumer. Plus the obvious spelling mistake and the fact that they have communicated through WhatsApp is a clear giveaway that this is a scam"
    ],
    "cleaned_text": "got message file case ni dishonour emi havent taken emi got message whatsapp dear bank costumer delayeddefaulted repayment bank may file criminal proceedings us ni act dishonor emis may leads jail years fine contact paymentsettlement case visit nearest branch cash contact xxxx x mishra manager taken emi got call somedays ago asking person denied asked know person denied cut call ignored thinking kind scam etc remember bought number years ago name appeared truecaller maybe number someone else got random people messages asking much trouble havent paid emi honestly dont know happening years student living parents ",
    "cleaned_title": "got message file case ni dishonour emi havent taken emi",
    "cleaned_selftext": "got message whatsapp dear bank costumer delayeddefaulted repayment bank may file criminal proceedings us ni act dishonor emis may leads jail years fine contact paymentsettlement case visit nearest branch cash contact xxxx x mishra manager taken emi got call somedays ago asking person denied asked know person denied cut call ignored thinking kind scam etc remember bought number years ago name appeared truecaller maybe number someone else got random people messages asking much trouble havent paid emi honestly dont know happening years student living parents",
    "cleaned_comments": "first thoughts could scam someone else present number might past bank would ask contact mishra message wording looks like scam yeh question rise scammer know specific name wish bank mesage whatsapp even theyll take name name youre free call customer care said bank tell problem might good contact nearest branch manager hell help also contact ombudsman rbi havent mentioned bank name guess biggest sign scam guess branch manager try contact everywhere defaulted loan whatsapp email linked fb think make call scam everything clear relax arent person surely chill may even worried yet want cover tracks maybe want run civil report rupees entire year details loans etc believe would nil call guy tell number belongs emi belongs probably old guy ask official email id tell free shot cibil loan page needed yes maybe check cibil score know much dont pay loans time affects cibil score theyll mention bank name right case mention bank scam recovery agents need worry talk bank get sorted get bank details recovery agent scammers message whatsapp government officials bank may scam case call numbers whatsapp block visit cibil take credit report loans open find report go bank info passbookstatements cards visit branch dear bank costumer delayeddefaulted repayment bank customer costumer typo means definitely scam dont overthink costumer op would like know line work make costumes bank employees dear bank costumer scam amateurish scam spelling give away payment cash however please remember following loan given person phone case require plaintiff defendant legal entities proceedings initiated party must given notice would loan taker must personally named summons need present court plaintiff must prove case ie prove loan given given x alias x x acted behalf another pointed best check cibil sometimes loantakers use fake phone number address recovery agents call arrive door happened gotten pan card done sketchy shop lot third party services check credit score month exchange privacy guess use paisabazaar personally query four consumer credit agencies many banks half update info nonciibil agencies privacy concern cibil site provides one free report every year agencies difficult manual processes scam scam relax scam bank never sends whatsapp messages emi payment threatens criminal case block number sms correct maybe op goes bank costume big trouble costumer youre good chill fraud st clie calls legal department legal department let file case happened never file case lol scam matter respond entertain call messages come believe communications come trustworthy sources customer service called one received visit bank dont respond next time call cuss bro call number whatsoever share name details pick calls contact go bank show message theyll help almost certainly scam banks contact whattsapp lapse emi mailed address passbook lets say person previously using number emi emi would charged account linked aadhar card address would verified associated account phone number bank account dont stupid confident scamsters feed lack confidence indian bankingfinancial customers taken loan assertive dont meek afraid possible block number report cybercrime cell help others bank every contacts whatsapp message number go nearest branch said bank talk people well doubt anything able loan attached aadharpan cause number cant shit honestly banks lenders really shady people working getting bothered tata capital left right center past years someone took loan crore registered number messaged called emailed tata like zillion times refuse budge living india let call repeatedly dont even bother answer truecaller mentioned post fake scam scam identity based phone number threaten someone else owned phone number months ago banks never talk whatsapp someone said earlier either use email regular postal service kind information havent india looks like number businesses started using whatsapp one channels communication india completely unheard west think stay india atleast case banking financial services types managers varying level communication skills especially psbs isnt realm possibilities agree options sre limited case concrete information yeah call clarify dont give details download app wearing costumes fellow human yeah fuck mishra lmao bro look number grammatical spelling mistakes recovery agents contact youthe employees particular branch bank inform default legitimate mark spam ignore scam banks directly initiate criminal proceedings emi default read way worded fact sent whatsapp indicates scam havent taken loan ignore cant anything hold particular phone number scam bro let go aye vedya bc scam hai kyu khali peeli gand fat vaa ra hai le vada pav kha even aunty facing something similar getting calls bank someone took mobile loan behalf bangalore lives mumbai never visited banglore knew anyone moment see typo like customer spelled costumer know lodde ka emi bol ke phone cut krde bro block number scam miss emi manager call dont need contact anyone sometimes leagal department lol obvious scam usually bank collect refer name use generic words like bank costumer plus obvious spelling mistake fact communicated whatsapp clear giveaway scam",
    "light_cleaned_title": "Got a message that they will file a case on me under 138 of NI 1881, for dishonour of EMI. But I haven't taken any EMI",
    "light_cleaned_selftext": "So I got a message on WhatsApp: > Dear BANK Costumer you have delayed/defaulted in repayment of BANK. We may file criminal proceedings u/s 138 of N.I. Act, 1881, for dishonor of EMIs, and it may leads to Jail for up to 2 years & fine. Contact for Payment/Settlement of the case. visit nearest BRANCH in Cash. CONTACT = 8779xxxx X MISHRA (MANAGER) But I have not taken any EMI, I got a call to somedays ago asking if I am Y person, when I denied they asked ; if I know the Y person, I denied again and they cut the call. I ignored it thinking of it as some kind of scam or etc But then I remember Y, when I bought this number 2 years ago, this name appeared on Truecaller. Maybe my number was someone else , I had got some random people messages too asking if I am Y. But now it is too much Am I in trouble? Because he haven't paid his EMI honestly I don't know what is happening. I am a 21 years student, Living with their parents. And what can I do?",
    "light_cleaned_comments": "My first thoughts were that it could be a scam. Or someone else with your present number might have had it in the past. No bank would ask you to contact Mishra. The message wording looks like it's a scam. Yeh same, but the question rise how the scammer know that specific name I wish bank will not mesage you on whatsapp. and even if they did they'll take your name. and if it is not your name. you're free. just call the customer care of the said bank and tell them this problem. might be good to contact any nearest branch manager, he'll be of help. you can also contact ombudsman on rbi. They haven't mentioned any bank name too, I guess this is the biggest sign It's a scam I guess The branch manager will try and contact you everywhere if you have defaulted on a loan. WhatsApp email linked in fb. I think I should make a call scam or not everything will be clear Relax , if you aren’t the same person you can surely chill .. You may not even be worried about it yet if you want to cover all your tracks .. Maybe only if you want : 1). Run a civil report - 500 rupees for entire year .. it details all your loans etc .. which I believe would be NIL. 2). Call the guy , tell him the number belongs to you and EMI belongs to probably old guy .. Ask his official email I’d and tell him with a free shot of CIBIL of the loan page only .. only if needed. Yes it is. maybe you can check your cibil score. I do not know about that much, but if you don't pay your loans on time it affects your cibil score. But they'll mention bank name too? right? in this case no mention of bank It’s not a scam but these are recovery agents. You need not worry. Talk to the bank and get this sorted. You can get bank details from the recovery agent. Scammers will message you on whatsapp. Not government officials or your bank. May be a scam. In any case, Do not call numbers on WhatsApp. Just block it. Visit cibil and take a credit report, if there are any loans open, find out. From that report. Go to bank info on your passbook/statements Or cards Or visit branch >Dear BANK Costumer you have delayed/defaulted in repayment of BANK Customer not costumer. That typo means it is definitely a scam, don't overthink. Costumer😁 OP I would like to know more about your line of work. Do you make costumes for bank employees - dear bank costumer? Scam It's an amateurish scam. Spelling is a give away as is payment in cash. However please remember the following:- 1. Loan is given to a person not a phone no. 2. Any case will require a plaintiff and defendant both of whom have to be legal entities. 3. Before any proceedings are initiated, the other party must be given notice which would be the loan taker 4. You must be personally named in a summons if you need to be present in court. 5. The plaintiff must prove the case i.e. he has to prove that a loan was given. It was given to X , Y is an alias of X or X acted on behalf of Y. As another pointed out, best to check Cibil. Sometimes some loantakers will use fake phone number or address and recovery agents will call or arrive at your door. Happened to me when I had gotten PAN card done from a sketchy shop. A lot of third party services can check credit score for you once a month in exchange for privacy I guess. I use paisabazaar personally because they query all four consumer credit agencies and many banks half update info on non-CIibil agencies. If privacy is a concern Cibil on their site provides one free report every year. Other agencies had difficult manual processes. 100% scam. SCAM Relax, It's a scam. Bank never sends WhatsApp messages for emi payment and threatens with criminal case. Just block number No. The sms was correct. Maybe OP goes to the bank in a costume. You are in big trouble if you are a “costumer”. If not, you’re good chill. Fraud, 1st clie, who calls themselves \"legal department\"? Legal department of what? Let them file the case, happened with me, they never file case, lol. Its scam No matter what you do, do not respond or entertain the call or messages that come to you. Only believe the communications that come from trustworthy sources, customer service that you called, not the one you received. Or visit the bank. Don't respond. Next time they call you, cuss them out Bro do not call the number whatsoever. Do not share your name or any details. Do not pick their calls. If they contact you again go to your bank. Show them the message. They'll help. This is almost certainly a scam. Banks do not contact on Whattsapp. And any lapse in emi is mailed to your address in passbook. Lets say the person previously using your number had a emi. The EMI would be charged from his account, linked to his aadhar card. His address would be verified and associated to the account. Your phone number is not your bank account. DON'T BE STUPID Be confident. These scamsters feed on the lack of confidence of the Indian banking/financial customers. If you have not taken any loan, then be assertive. Don't be meek and afraid. If possible, block this number and report it to the cybercrime cell. That will help others. No bank every contacts you through WhatsApp. They message you on your number. Go to the nearest branch of said bank and talk to people there. Well doubt there is anything they will be able to do if there is loan attached to your Aadhar/PAN. Just cause they have your number they can’t do shit about it. Honestly these banks and lenders have some really shady people working for them. I am been getting bothered by Tata Capital left, right and center from past 10-12 years. Someone has took a loan of over 3 crore and registered my number over there. I have messaged, called, emailed Tata like zillion times but they just refuse to budge. Now that I am not living in india I just let them call me repeatedly and don’t even bother to answer any of it. from truecaller, you mentioned in the post It's a fake. Scam 100% scam. Identity is not based on phone number. They can not threaten you just because someone else owned your phone number a few months ago. Banks never talk on whatsapp as someone said earlier. They either use email or regular postal service for this kind of information. I haven't been to India in a while but it looks like a number of businesses have started using Whatsapp as one of the channels of communication in India. This is completely unheard of the west and I think it should stay the same in India too atleast in case of banking or any other financial services. There are all types of managers with varying level of communication skills especially in psbs. So it isn't out of realm of possibilities I agree, but options sre limited in case of no concrete information. Yeah call them and clarify. Don't give any of your details or download some app. i too am wearing costumes fellow human yeah fuck Mishra Lmao 🤣🤣 Bro just look at number of grammatical or spelling mistakes😂😂😂 Before recovery agents contact you,the employees in the particular branch of the bank will inform about the default if it is legitimate. Just mark spam and ignore. Scam Banks cannot directly initiate criminal proceedings for EMI default. Read this The way it's worded, and the fact that it was sent on WhatsApp, indicates this is a scam. If you haven't taken a loan, just ignore it. They can't do anything against you just because you hold a particular phone number. It's a scam bro. Let it go. aye vedya bc scam hai kyu khali peeli gand fat vaa ra hai le vada pav kha Even my aunty is facing something similar and she is getting calls from the bank. Someone took a mobile loan on behalf of her from Bangalore and she lives in Mumbai. She never visited Banglore or knew anyone there. The moment you see a typo like “customer spelled costumer” you should know. Lodde ka EMI bol ke phone cut krde bro🤌 Block the number. It's a SCAM. If you miss a EMI, the manager will himself call you. You don't need to contact anyone. Sometimes it's \"leagal department\" Lol😆 It’s an obvious scam. Usually if a bank has to collect from you they will refer to you by your name and not use generic words like Bank Costumer. Plus the obvious spelling mistake and the fact that they have communicated through WhatsApp is a clear giveaway that this is a scam"
}