{
    "id": "18anpx6",
    "title": "people (politically inclined) are trying to wedge a gap between north and south india",
    "url": "https://www.reddit.com/gallery/18anpx6",
    "selftext": "I'm just afraid that this type of nasty politics is going to be very dangerous in the near future and pushing north and south india apart can follow in the footsteps of partition. What are your thoughts",
    "flair": "Politics",
    "score": 10,
    "num_comments": 9,
    "created_utc": 1701706885.0,
    "convurl": "https://i.redd.it/djngdnl80b4c1.jpg",
    "comments": [
        "It's all been there just that it's being used as an excuse (after loosing  the elections  ) , if they keep up with this lame excuse they'll  loose South as well .",
        "India ka nahi to South India ko divide karke waha ka pm to ban he jayega Rahul Gandhi\n\n/S",
        "This needs to be condemned by everyone. \n\n\nIt is through these ways narratives are planted in people's minds and if such ideas are allowed to bloom they WILL hurt us in the longer run.",
        "Liberal kidhar gayie ab",
        "sore loosers. If they go about callling north dung belt, then good luck winning here.",
        "Telangana"
    ],
    "cleaned_text": "people politically inclined trying wedge gap north south india im afraid type nasty politics going dangerous near future pushing north south india apart follow footsteps partition thoughts ",
    "cleaned_title": "people politically inclined trying wedge gap north south india",
    "cleaned_selftext": "im afraid type nasty politics going dangerous near future pushing north south india apart follow footsteps partition thoughts",
    "cleaned_comments": "used excuse loosing elections keep lame excuse theyll loose south well india ka nahi south india ko divide karke waha ka pm ban jayega rahul gandhi needs condemned everyone ways narratives planted peoples minds ideas allowed bloom hurt us longer run liberal kidhar gayie ab sore loosers go callling north dung belt good luck winning telangana",
    "light_cleaned_title": "people (politically inclined) are trying to wedge a gap between north and south india",
    "light_cleaned_selftext": "I'm just afraid that this type of nasty politics is going to be very dangerous in the near future and pushing north and south india apart can follow in the footsteps of partition. What are your thoughts",
    "light_cleaned_comments": "It's all been there just that it's being used as an excuse (after loosing the elections ) , if they keep up with this lame excuse they'll loose South as well . India ka nahi to South India ko divide karke waha ka pm to ban he jayega Rahul Gandhi /S This needs to be condemned by everyone. It is through these ways narratives are planted in people's minds and if such ideas are allowed to bloom they WILL hurt us in the longer run. Liberal kidhar gayie ab sore loosers. If they go about callling north dung belt, then good luck winning here. Telangana"
}