{
    "id": "1he965o",
    "title": "Horrible Experience with Buying a Bluestar Portable AC from Croma",
    "url": "https://www.reddit.com/r/india/comments/1he965o/horrible_experience_with_buying_a_bluestar/",
    "selftext": "https://preview.redd.it/2ulz32koxu6e1.png?width=1225&format=png&auto=webp&s=db8db9d2e489076ddca14bbbb2e423267a37561f\n\n  \n  \ni bought a bluestar portable ac from croma in october 2023. since its just a portable ac, i unboxed it and set up the exhaust myself, and started using it the same day. but as soon as i turned it on, it made this loud, weird sound that instantly made me feel something was wrong.\n\ni called croma for a replacement, but they refused, saying that because i installed it myself, they couldn’t help me. they just told me to contact bluestar’s customer service instead.\n\nwhen i called bluestar, they told me that i have to pay for repairs if the issue was caused by faulty installation . A technician came to my house, opened up the AC and found that one of the fan blades (one fan was black and another was blue i think) was broken. he confirmed it wasn’t my fault, so bluestar replaced and repaired the fan for free.\n\nA week later, two guys showed up to replace the fan. they didn’t seem confident in what they were doing, but they eventually got it installed. when they turned the ac on, it seemed fine , no weird noise anymore. i thought the problem was solved.\n\nbut that’s when things got worse. after a few days, the sound started coming back, just a little at first, but it got worse every day. then the AC started jerking a bit every time the compressor turned on or off.\n\ni called bluestar service again, and they sent a technician. he told me the noise was “normal.” by then, the noise wasn’t too bad yet, and the jerking wasn’t as extreme, so i thought maybe i was overthinking it. but i was still confused on how could this be normal ?\n\ni kept using it, even though the noise and jerking were getting worse. eventually, it got so bad that the AC was jerking violently everytime the comressor turned on or off.I called bluestar again. this time, the same guy came back. after checking the ac, he admitted something wasn’t right.\n\nHe opened it up and found that the previous guys who replaced the fan hadn’t installed some screws (or maybe nuts, i’m not sure). this had weakened the frame, which was causing all the vibrations and noise. he tightened things up and said he had \"contained the issue.\" when he turned the AC on, the vibration was reduced a little but not completely gone. i was not sure, but he insisted and he said it should be fine now and left.\n\nfor the next few days, the vibration was slightly better, but then it started getting worse again. by this time, the noise was unbearable, and the AC was jerking so hard it was honestly scary. it felt like it was falling apart every time the compressor started or stopped. on top of that, the same loud sound i heard the first day was back.\n\ni called bluestar again, and this time they sent a different technician. he found that the fan was broken again and said the vibration might be because of that, i tried explain about the technitian forgeting to install some screws . he told me he’d replace the fan and then check what is happening with the frame but that it would take about a week for the replacement part to arrive.\n\nthat replacement never came. at this point,i lost all hope with this AC. i didn’t even want to call back anymore because i knew that even if they replaced the fan, the weak frame and constant issues wouldn’t go away.\n\nAll this happened by 10 months into warranty period. \n\nnow it’s been two months since the warranty expired. i’ve just given up. the whole process has been exhausting, and i don’t have the energy to call bluestar again and try to explain everything. i’m honestly done with this AC. imagine, i had zero interest in even trying to remind bluestar that the fan never arrived. may be i wanted it to be a lesson for me to always do more research before buying a product.\n\nI really think, bluestar is something you should never consider if you have any other option, even if it a bit costlier.\n\nHope bluestar or chroma sees this.\n\n\n\n\n\n",
    "flair": "Rant / Vent",
    "score": 13,
    "num_comments": 8,
    "created_utc": 1734201180.0,
    "convurl": "https://a.thumbs.redditmedia.com/Q4BsTfVuRoppe_KqFwKUUtSJ9XCJrulzBiq-xb9tGJ8.jpg",
    "comments": [
        "sell it off mate. not worth the trouble",
        "Got your local AC guy to have a look. Many times they are better than the company dudes. Cost might work out much lesser than a new AC",
        "Mistake was buying from Croma.",
        "\nYou made two big mistakes: first, buying an offline store product like Chroma or Valueplus, and second, wasting money on an Indian brand.\n\nBrands like Bluestar, Voltas, and Godrej are nothing but garbage. They have no history of making complex home appliances, they import low-quality junk from China, rebrand it, and don’t even bother with proper quality checks. Their failure rates are the highest. These brands are mostly dumped into government offices because corruption ensures such trash gets chosen.\n\nIf your budget allows for an international brand, NEVER settle for an Indian brand. They will NEVER meet your expectations, and their poor quality, endless problems, and shoddy fit and finish will NEVER let you live in peace.",
        "Croma is shit. A local electronic shop would have sold you a better product than Croma.",
        "If you are buying from Croma, Reliance Digital etc, ALWAYS wait for them to install.\n\nSometimes it can feel stupid but business policy is business policy. Just because you and me are competent enough to install products doesn't mean Croma can trust everybody. Both Croma and Reliance Digital clearly mention to wait for installation guys to come, unbox the product and install it.",
        "Should have waited for the concerned person to come and install it.\n\nThere is a reason they tell us in the showroom that only the company rep should install it especially for these reasons",
        "i agree. i was really ecited and dint think about the consquences. Thats the reason, i didnt push for replacement from bluestar after croma rejected replacement.  definitely a bad move on my part."
    ],
    "cleaned_text": "horrible experience buying bluestar portable ac croma bought bluestar portable ac croma october since portable ac unboxed set exhaust started using day soon turned made loud weird sound instantly made feel something wrong called croma replacement refused saying installed couldnt help told contact bluestars customer service instead called bluestar told pay repairs issue caused faulty installation technician came house opened ac found one fan blades one fan black another blue think broken confirmed wasnt fault bluestar replaced repaired fan free week later two guys showed replace fan didnt seem confident eventually got installed turned ac seemed fine weird noise anymore thought problem solved thats things got worse days sound started coming back little first got worse every day ac started jerking bit every time compressor turned called bluestar service sent technician told noise normal noise wasnt bad yet jerking wasnt extreme thought maybe overthinking still confused could normal kept using even though noise jerking getting worse eventually got bad ac jerking violently everytime comressor turned offi called bluestar time guy came back checking ac admitted something wasnt right opened found previous guys replaced fan hadnt installed screws maybe nuts im sure weakened frame causing vibrations noise tightened things said contained issue turned ac vibration reduced little completely gone sure insisted said fine left next days vibration slightly better started getting worse time noise unbearable ac jerking hard honestly scary felt like falling apart every time compressor started stopped top loud sound heard first day back called bluestar time sent different technician found fan broken said vibration might tried explain technitian forgeting install screws told hed replace fan check happening frame would take week replacement part arrive replacement never came pointi lost hope ac didnt even want call back anymore knew even replaced fan weak frame constant issues wouldnt go away happened months warranty period two months since warranty expired ive given whole process exhausting dont energy call bluestar try explain everything im honestly done ac imagine zero interest even trying remind bluestar fan never arrived may wanted lesson always research buying product really think bluestar something never consider option even bit costlier hope bluestar chroma sees ",
    "cleaned_title": "horrible experience buying bluestar portable ac croma",
    "cleaned_selftext": "bought bluestar portable ac croma october since portable ac unboxed set exhaust started using day soon turned made loud weird sound instantly made feel something wrong called croma replacement refused saying installed couldnt help told contact bluestars customer service instead called bluestar told pay repairs issue caused faulty installation technician came house opened ac found one fan blades one fan black another blue think broken confirmed wasnt fault bluestar replaced repaired fan free week later two guys showed replace fan didnt seem confident eventually got installed turned ac seemed fine weird noise anymore thought problem solved thats things got worse days sound started coming back little first got worse every day ac started jerking bit every time compressor turned called bluestar service sent technician told noise normal noise wasnt bad yet jerking wasnt extreme thought maybe overthinking still confused could normal kept using even though noise jerking getting worse eventually got bad ac jerking violently everytime comressor turned offi called bluestar time guy came back checking ac admitted something wasnt right opened found previous guys replaced fan hadnt installed screws maybe nuts im sure weakened frame causing vibrations noise tightened things said contained issue turned ac vibration reduced little completely gone sure insisted said fine left next days vibration slightly better started getting worse time noise unbearable ac jerking hard honestly scary felt like falling apart every time compressor started stopped top loud sound heard first day back called bluestar time sent different technician found fan broken said vibration might tried explain technitian forgeting install screws told hed replace fan check happening frame would take week replacement part arrive replacement never came pointi lost hope ac didnt even want call back anymore knew even replaced fan weak frame constant issues wouldnt go away happened months warranty period two months since warranty expired ive given whole process exhausting dont energy call bluestar try explain everything im honestly done ac imagine zero interest even trying remind bluestar fan never arrived may wanted lesson always research buying product really think bluestar something never consider option even bit costlier hope bluestar chroma sees",
    "cleaned_comments": "sell mate worth trouble got local ac guy look many times better company dudes cost might work much lesser new ac mistake buying croma made two big mistakes first buying offline store product like chroma valueplus second wasting money indian brand brands like bluestar voltas godrej nothing garbage history making complex home appliances import lowquality junk china rebrand dont even bother proper quality checks failure rates highest brands mostly dumped government offices corruption ensures trash gets chosen budget allows international brand never settle indian brand never meet expectations poor quality endless problems shoddy fit finish never let live peace croma shit local electronic shop would sold better product croma buying croma reliance digital etc always wait install sometimes feel stupid business policy business policy competent enough install products doesnt mean croma trust everybody croma reliance digital clearly mention wait installation guys come unbox product install waited concerned person come install reason tell us showroom company rep install especially reasons agree really ecited dint think consquences thats reason didnt push replacement bluestar croma rejected replacement definitely bad move part",
    "light_cleaned_title": "Horrible Experience with Buying a Bluestar Portable AC from Croma",
    "light_cleaned_selftext": "i bought a bluestar portable ac from croma in october 2023. since its just a portable ac, i unboxed it and set up the exhaust myself, and started using it the same day. but as soon as i turned it on, it made this loud, weird sound that instantly made me feel something was wrong. i called croma for a replacement, but they refused, saying that because i installed it myself, they couldn’t help me. they just told me to contact bluestar’s customer service instead. when i called bluestar, they told me that i have to pay for repairs if the issue was caused by faulty installation . A technician came to my house, opened up the AC and found that one of the fan blades (one fan was black and another was blue i think) was broken. he confirmed it wasn’t my fault, so bluestar replaced and repaired the fan for free. A week later, two guys showed up to replace the fan. they didn’t seem confident in what they were doing, but they eventually got it installed. when they turned the ac on, it seemed fine , no weird noise anymore. i thought the problem was solved. but that’s when things got worse. after a few days, the sound started coming back, just a little at first, but it got worse every day. then the AC started jerking a bit every time the compressor turned on or off. i called bluestar service again, and they sent a technician. he told me the noise was “normal.” by then, the noise wasn’t too bad yet, and the jerking wasn’t as extreme, so i thought maybe i was overthinking it. but i was still confused on how could this be normal ? i kept using it, even though the noise and jerking were getting worse. eventually, it got so bad that the AC was jerking violently everytime the comressor turned on or off.I called bluestar again. this time, the same guy came back. after checking the ac, he admitted something wasn’t right. He opened it up and found that the previous guys who replaced the fan hadn’t installed some screws (or maybe nuts, i’m not sure). this had weakened the frame, which was causing all the vibrations and noise. he tightened things up and said he had \"contained the issue.\" when he turned the AC on, the vibration was reduced a little but not completely gone. i was not sure, but he insisted and he said it should be fine now and left. for the next few days, the vibration was slightly better, but then it started getting worse again. by this time, the noise was unbearable, and the AC was jerking so hard it was honestly scary. it felt like it was falling apart every time the compressor started or stopped. on top of that, the same loud sound i heard the first day was back. i called bluestar again, and this time they sent a different technician. he found that the fan was broken again and said the vibration might be because of that, i tried explain about the technitian forgeting to install some screws . he told me he’d replace the fan and then check what is happening with the frame but that it would take about a week for the replacement part to arrive. that replacement never came. at this point,i lost all hope with this AC. i didn’t even want to call back anymore because i knew that even if they replaced the fan, the weak frame and constant issues wouldn’t go away. All this happened by 10 months into warranty period. now it’s been two months since the warranty expired. i’ve just given up. the whole process has been exhausting, and i don’t have the energy to call bluestar again and try to explain everything. i’m honestly done with this AC. imagine, i had zero interest in even trying to remind bluestar that the fan never arrived. may be i wanted it to be a lesson for me to always do more research before buying a product. I really think, bluestar is something you should never consider if you have any other option, even if it a bit costlier. Hope bluestar or chroma sees this.",
    "light_cleaned_comments": "sell it off mate. not worth the trouble Got your local AC guy to have a look. Many times they are better than the company dudes. Cost might work out much lesser than a new AC Mistake was buying from Croma. You made two big mistakes: first, buying an offline store product like Chroma or Valueplus, and second, wasting money on an Indian brand. Brands like Bluestar, Voltas, and Godrej are nothing but garbage. They have no history of making complex home appliances, they import low-quality junk from China, rebrand it, and don’t even bother with proper quality checks. Their failure rates are the highest. These brands are mostly dumped into government offices because corruption ensures such trash gets chosen. If your budget allows for an international brand, NEVER settle for an Indian brand. They will NEVER meet your expectations, and their poor quality, endless problems, and shoddy fit and finish will NEVER let you live in peace. Croma is shit. A local electronic shop would have sold you a better product than Croma. If you are buying from Croma, Reliance Digital etc, ALWAYS wait for them to install. Sometimes it can feel stupid but business policy is business policy. Just because you and me are competent enough to install products doesn't mean Croma can trust everybody. Both Croma and Reliance Digital clearly mention to wait for installation guys to come, unbox the product and install it. Should have waited for the concerned person to come and install it. There is a reason they tell us in the showroom that only the company rep should install it especially for these reasons i agree. i was really ecited and dint think about the consquences. Thats the reason, i didnt push for replacement from bluestar after croma rejected replacement. definitely a bad move on my part."
}