{
    "id": "16lxvzh",
    "title": "Wary of giving OBC handle to BJP in Bengal, Mamata out of sync with INDIA on caste census",
    "url": "https://indianexpress.com/article/political-pulse/obc-handle-bjp-west-bengal-mamata-india-caste-census-8945395/",
    "selftext": "Amid rising pressure from INDIA bloc for backing caste census, TMC leaders are set to discuss it with Mamata after her return from Spain in order to finalise the party’s stand on the issue",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695049218.0,
    "convurl": "https://external-preview.redd.it/I97xZf24aK8I4zcg018BH1mWMIHWX-AO2tsBqb_8nzw.jpg?auto=webp&s=e6dfb1564792fba6d24a61ecf0f3fadcb30f96f5",
    "comments": [
        ">TMC leader Sougata Roy told The Indian Express: “Our leader Mamata Banerjee has already said that we are opposed to the caste census. We believe that such census will create division among the people.” He, however, added that “We believe everything can be sorted out (within INDIA) at the negotiation table.”\n\n>TMC sources said Mamata has reservations on the caste census, adding that “she believes such a census may yield political dividends to the parties in the Hindi heartland, but may cause damage to the TMC”.\n\n>A TMC leader said, “In Bengal, politics does not revolve around caste. If we support caste census that would, by extension, mean we are supporting caste-based politics, which would damage our standing and image in Bengal. However, we also need to continue with the INDIA alliance against the BJP. So a final decision on the caste census will be taken by our supremo Mamata Banerjee, who is now visiting Spain to attract business for Bengal. She will return to Kolkata on September 23 following which we are expecting to finalise our position.”"
    ],
    "cleaned_text": "wary giving obc handle bjp bengal mamata sync india caste census amid rising pressure india bloc backing caste census tmc leaders set discuss mamata return spain order finalise partys stand issue ",
    "cleaned_title": "wary giving obc handle bjp bengal mamata sync india caste census",
    "cleaned_selftext": "amid rising pressure india bloc backing caste census tmc leaders set discuss mamata return spain order finalise partys stand issue",
    "cleaned_comments": "tmc leader sougata roy told indian express leader mamata banerjee already said opposed caste census believe census create division among people however added believe everything sorted within india negotiation table tmc sources said mamata reservations caste census adding believes census may yield political dividends parties hindi heartland may cause damage tmc tmc leader said bengal politics revolve around caste support caste census would extension mean supporting castebased politics would damage standing image bengal however also need continue india alliance bjp final decision caste census taken supremo mamata banerjee visiting spain attract business bengal return kolkata september following expecting finalise position",
    "light_cleaned_title": "Wary of giving OBC handle to BJP in Bengal, Mamata out of sync with INDIA on caste census",
    "light_cleaned_selftext": "Amid rising pressure from INDIA bloc for backing caste census, TMC leaders are set to discuss it with Mamata after her return from Spain in order to finalise the party’s stand on the issue",
    "light_cleaned_comments": ">TMC leader Sougata Roy told The Indian Express: “Our leader Mamata Banerjee has already said that we are opposed to the caste census. We believe that such census will create division among the people.” He, however, added that “We believe everything can be sorted out (within INDIA) at the negotiation table.” >TMC sources said Mamata has reservations on the caste census, adding that “she believes such a census may yield political dividends to the parties in the Hindi heartland, but may cause damage to the TMC”. >A TMC leader said, “In Bengal, politics does not revolve around caste. If we support caste census that would, by extension, mean we are supporting caste-based politics, which would damage our standing and image in Bengal. However, we also need to continue with the INDIA alliance against the BJP. So a final decision on the caste census will be taken by our supremo Mamata Banerjee, who is now visiting Spain to attract business for Bengal. She will return to Kolkata on September 23 following which we are expecting to finalise our position.”"
}