{
    "id": "18srwy0",
    "title": "Apple reportedly faces pressure in India after sending out warnings of state-sponsored hacking",
    "url": "https://www.engadget.com/apple-reportedly-faces-pressure-in-india-after-sending-out-warnings-of-state-sponsored-hacking-073036597.html",
    "selftext": "I remember seeing quite the social media turmoil the day it happened, and haven’t seen much else since then.\n\n How does such a fundamental breach of privacy goes unanswered?",
    "flair": "Politics",
    "score": 156,
    "num_comments": 8,
    "created_utc": 1703763360.0,
    "convurl": "https://external-preview.redd.it/c6Jp2Ioz9fZ8syqDHeWyXE9NGKucY1vK8P8EmWstxLo.jpg?auto=webp&s=4397b1266f2476dd0bd014f464e9e822a6d8851d",
    "comments": [
        "Which rock have you been living under that this comes as a surprise to you",
        "Fair enough. It just seems like quiet acceptance is the norm now, very odd to see. Guess my question sounded rhetorical.",
        "We have acquiesed by force, not by choice.",
        "Now they'll call Apple aunty nashnul 🤡",
        "Phoren conspiracy to dephame Vishwaguru saaar",
        "Nah….acquiesced by vote collectively ……. We get a government that reflects our values 😒",
        "We don't like apple, this is a country of mangoes."
    ],
    "cleaned_text": "apple reportedly faces pressure india sending warnings statesponsored hacking remember seeing quite social media turmoil day happened havent seen much else since fundamental breach privacy goes unanswered ",
    "cleaned_title": "apple reportedly faces pressure india sending warnings statesponsored hacking",
    "cleaned_selftext": "remember seeing quite social media turmoil day happened havent seen much else since fundamental breach privacy goes unanswered",
    "cleaned_comments": "rock living comes surprise fair enough seems like quiet acceptance norm odd see guess question sounded rhetorical acquiesed force choice theyll call apple aunty nashnul phoren conspiracy dephame vishwaguru saaar nahacquiesced vote collectively get government reflects values dont like apple country mangoes",
    "light_cleaned_title": "Apple reportedly faces pressure in India after sending out warnings of state-sponsored hacking",
    "light_cleaned_selftext": "I remember seeing quite the social media turmoil the day it happened, and haven’t seen much else since then. How does such a fundamental breach of privacy goes unanswered?",
    "light_cleaned_comments": "Which rock have you been living under that this comes as a surprise to you Fair enough. It just seems like quiet acceptance is the norm now, very odd to see. Guess my question sounded rhetorical. We have acquiesed by force, not by choice. Now they'll call Apple aunty nashnul 🤡 Phoren conspiracy to dephame Vishwaguru saaar Nah….acquiesced by vote collectively ……. We get a government that reflects our values 😒 We don't like apple, this is a country of mangoes."
}