{
    "id": "15nugfb",
    "title": "Bilkis case convicts were out of jail for over 1,000 days each before release [2022]",
    "url": "https://i.redd.it/qsgb7le6tdhb1.jpg",
    "selftext": "https://www.deccanherald.com/amp/story/india%2Fbilkis-bano-case-convicts-got-over-1000-leaves-each-from-jail-before-release-1154902.html\n\nhttps://indianexpress.com/article/cities/ahmedabad/bilkis-bano-case-convicts-were-out-of-jail-for-over-1000-days-each-before-release-8216993/lite/\n\nvia [@chinmayi on Twitter](https://twitter.com/chinmayi)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691716323.0,
    "convurl": "https://i.redd.it/qsgb7le6tdhb1.jpg",
    "comments": [
        "https://twitter.com/chinmayi/status/1689567686685249536",
        "They are Gujarat's 'heroes'...should not be surprising.",
        "Unbelievable!!! So much for beti bachao and flying kisses!!!",
        "Opposition bhi kuch nahi kar sakta jab Tak media support nahi karega. We are doomed",
        "Ram rahim is out, cutting cakes with swords",
        "This makes my blood boil\n It wasn't enough that they kept coming and going as they pleased ..they had to let them go free and garland them",
        "New India 🇮🇳",
        "It’s all fun and games, until they come for you…\nRip your foetus and kill it with a rock.",
        "Thank you Modiji 🫡",
        "Shame on those who defend violence and rape!",
        "And Umar Khalid has been in jail for 3 years now."
    ],
    "cleaned_text": "bilkis case convicts jail days release via chinmayi twitterhttpstwittercomchinmayi ",
    "cleaned_title": "bilkis case convicts jail days release",
    "cleaned_selftext": "via chinmayi twitterhttpstwittercomchinmayi",
    "cleaned_comments": "gujarats heroesshould surprising unbelievable much beti bachao flying kisses opposition bhi kuch nahi kar sakta jab tak media support nahi karega doomed ram rahim cutting cakes swords makes blood boil wasnt enough kept coming going pleased let go free garland new india fun games come rip foetus kill rock thank modiji shame defend violence rape umar khalid jail years",
    "light_cleaned_title": "Bilkis case convicts were out of jail for over 1,000 days each before release [2022]",
    "light_cleaned_selftext": "via [@chinmayi on Twitter](https://twitter.com/chinmayi)",
    "light_cleaned_comments": "They are Gujarat's 'heroes'...should not be surprising. Unbelievable!!! So much for beti bachao and flying kisses!!! Opposition bhi kuch nahi kar sakta jab Tak media support nahi karega. We are doomed Ram rahim is out, cutting cakes with swords This makes my blood boil It wasn't enough that they kept coming and going as they pleased ..they had to let them go free and garland them New India 🇮🇳 It’s all fun and games, until they come for you… Rip your foetus and kill it with a rock. Thank you Modiji 🫡 Shame on those who defend violence and rape! And Umar Khalid has been in jail for 3 years now."
}