{
    "id": "1do6w60",
    "title": "\"Jai Hindu Rashtra.\" - BJP MP Chhatrapal Singh Gangwar during Oath taking",
    "url": "https://v.redd.it/rcms3ete6q8d1",
    "selftext": "Surprised it took “ANI” more than an hour to report compared to Owaisi’s ‘Hail Palestine’ being reported under 30 minutes. ",
    "flair": "Crime",
    "score": 241,
    "num_comments": 74,
    "created_utc": 1719324485.0,
    "convurl": "https://external-preview.redd.it/N3N5NDh6aGU2cThkMeM4jJki_zhWsdMvSWbqOKptDVbxniYlHyLWgllxIyk3.png?format=pjpg&auto=webp&s=ce36a0c61366a377fba994cc80fd7d08885111d6",
    "comments": [
        "Bhai iski sakal dekh kai aur gussa ati hai mereko ek bhi kaam nahi kia hoga isnee pata nahi iss bar kaisai jeet gaya mainai tho india ko vote dala tha",
        "Deshdrohi.",
        "Wait. Wait a min....!!",
        "Wtf is happening in this country \nFuc* bjp",
        "Better a Hindu Rashtra than someone like Owaisi who can't be even for his own country. Fucker.",
        "Straight to jail",
        "The idea of Hindu rashtra is quite opposite to the idea of the country this guy got elected from. People like these shouldn't be allowed in parliament. \n\nOwaisi was also stupid but there is no Palestine or India there can be both but in terms of Hindu rashtra it will come at the cost of India.",
        "Imagine if a Sikh would have said Jai Khalistan, these people would have lost their shit. They are as much anti nationals as khalistanis are. Also ig parliamentary privileges cover their oaths also.",
        "Taking oath on the very constitution that prohibits this! What a disgraceful moment! This guy's membership must be annulled.",
        "You know what is interesting.\n\nA secular country is part of the basic structure doctrine, which is understood to be unchangable as long as the Indian constitution is legitimate, as in only changable by revolution.\n\nHe is suggesting that we change that.\n\nWhile what Owaisi said could be interpreted as his stance on India's foreign policy.\n\nWhat he said is most certainly SEDITION.",
        "This",
        "Shame Shame Shame",
        "The basic structure doctrine is something the Supreme Court pulled out of its ass. It has no constitutional basis.\n\nParliament with a two thirds majority can amend the constitution to eliminate references to secularism. And if the court objects Parliament can impeach them. Heck they probably should have for their bullshit over the NJAC verdict.\n\nEither way, it doesn't need a revolution.\n\nAnd I'm not advocating for getting rid of it. It's why it's important to vote and why having some basic respect and understanding of liberal values is essential in this country. Though sadly we seem to be going in the opposite direction",
        "Now you are pulling this out of your ass. While I agree the basic structure doctrine is a judicial invention but that doesn't mean parliament can do away with it just by having a two third majority. The parliament gets its powers from the constitution and not the other way around. Parliament cannot use its limited amending powers to change the entire constitution. Only a constituent assembly could do that. This is the broad basis of basic structure doctrine.\nAnd secondly the impeachment of an SC judge doesn't work like you mentioned. Parliament can't impeach a judge just because he/she objects to a law or an amendment. How could such a system work where the judiciary can't even check a legislative or executive overreach. There are proper grounds mentioned in the constitution for removal of judge viz. Proved incapacity and misbehavior.",
        "Not that it matters, but who was in response to whom? Owaisi to him or him to Owaisi?",
        ">Now you are pulling this out of your ass. While I agree the basic structure doctrine is a judicial invention but that doesn't mean parliament can do away with it just by having a two third majority. \n\nThat's exactly what it means.\n\n>The parliament gets its powers from the constitution and not the other way around. \n\nYes. And the constitution grants *only* Parliament the power to amend the constitution. Because the constitution is *meant* to be a living document. Not bound to the morality and dictates of mid 20th century politics.\n\n>Parliament cannot use its limited amending powers to change the entire constitution. \n\nThey absolutely can. Any aspect of the constitution can be amended by the power of constitutional amendment. The constitution places **no limits** on the power of amendment if Parliament has the requisite majority, save for the bit about needing the consent of states on issues that affect them. You're welcome to open the constitution and prove me wrong.\n\n>Only a constituent assembly could do that. \n\nThe constituent assembly was empowered by preconstitutional statute. There is no legal basis for a constituent assembly to be convened under the constitution today. Heck the only reference to one is in the preamble which simply describes how the constitution was adopted.\n\n>This is the broad basis of basic structure doctrine. \n\nThere is *zero* basis for the doctrine. The people of India are sovereign in India. Parliament are their directly elected representatives, unlike the judiciary and executive. It is Parliament which is vested as the power to have final determination on what the text of the constitution says. There are no limits on this sovereign exercise of the people's authority via there representatives. By definition, sovereignty isn't limited or constrained. The body that constrains another is the sovereign. So if the power of the people and their representatives were constrained, then that body would be the sovereign. For the SC to claim it can constrain the people and their representatives would imply they are the sovereigns in India.\n\n>And secondly the impeachment of an SC judge doesn't work like you mentioned. Parliament can't impeach a judge just because he/she objects to a law or an amendment. \n\nThey absolutely can. The constitution does not tell Parliament what they are allowed to consider misbehavior or incapacity\n\n>A Judge of the Supreme Court shall not be removed from his office except by an order of the President passed after an address by each House of Parliament supported by a majority of the total membership of that House and by a majority of not less than two-thirds of the members of that House present and voting has been presented to the President in the same session for such removal on the **ground of proved misbehaviour or incapacity.** \n\nThat is the text of the constitution. If two thirds of Parliament have determined that a judge must be removed, then they are free to do so. In the context of impeachment proved misbehavior is simply for what Parliament considers proved. Neither misbehavior nor incapacity are defined in the constitution. No external body is allowed by the constitution to interfere with Parliament's impeachment powers. If you disagree, you're welcome to cite the constitutional provision which conflicts with A124 on limiting Parliament. You are *only* allowed to cite constitutional provisions. Not the made up words of some dumbass on the bench who thinks he can override the constitution as the SC frequently does.\n\nMoreover acting in violation of their constitutional mandate and infringing on the sovereignty of the people of India is a valid reason to impeach a court and judges gone rogue.\n\n>How could such a system work where the judiciary can't even check a legislative or executive overreach. \n\nThe judiciary is fully entitled to check legislative overreach when that overreach is in violation of the constitution. Your problem is you're thinking in absolutes. That if the courts cannot check Parliament exercising its absolute powers, then it cannot exercise those powers at all. That's not how it works. If Parliament passes any law that conflicts with the constitution, the court is allowed to check that. If Parliament creates a constitutional conflict via an amendment that results in contrary outcomes, then the courts also have authority to step in. Thus for instance, the resolution of JK which the court engaged with since there were ambiguities in the established text of the constitution.\n\nWhat the court is not allowed to do is exceed their own constitutional mandate. And so yes, under the text of the constitution, no power is allowed to interfere with Parliament amending the constitution. The SC's basic structure doctrine is unconstitutional, and frankly an attack on the sovereignty of the Indian people. That Parliament has allowed it to exist by refraining from legislatively attacking it doesn't change its inherently unconstitutional nature or Parliament's power to end it tomorrow and the court if it wishes.\n\nAnd just to be clear, not only can Parliament, with a 2/3 majority, impeach the judges, if they believe it necessary, they are free to abolish the SC itself if they want. As long as they do it properly via constitutional amendment, they are free to change any aspect of the constitution.\n\nThat doesn't mean there is no check on Parliament. There is. It isn't by unelected judges however. It is by the people of India. They, and they alone, can check these actions by refusing to give sanction to a two-thirds majority empowered to act via elections. Parliament consists of India's elected representatives, elected via direct and indirect elections. If they, together, act to amend the constitution, they are exercising the powers delegated to them by the sovereign people of India. Not the permission of an unelected, unaccountable judiciary.\n\n>There are proper grounds mentioned in the constitution for removal of judge viz. Proved incapacity and misbehavior.",
        "Jai palestine ke bad ab ye jai hindu rashtra.... attention seekers. People should recognise them for their work but these people create controversy and remain trendy. Useless politicians. People voted for these idiots, never vote for them again.",
        "Bhai Bharat Hindu rashtra nahi hai. Agar hai tho kya baaki logo ko maar dena hai?",
        "People are losing shit over Jai Palestine XD",
        "Desh-drohi is the new Desh-premi",
        "Jai hindu rashtra and jai Palestine.....\nThey have made this parliament into a fucking JOKE...",
        "Owasi is bjp b team. \n\nHe is there to spew hatred so bjp’s existence has a meaning",
        "Lol. Cancel him. Delete his X account.",
        "mujhe laga “Jai Hind Rashtra” bola mein bada confused the replies dekh kar. fir wapas dekha toh pata chal hindu rashtra bola",
        "\"Jai palastine\" was disgraceful too. Nobody in their right mind would defend this or that.",
        "Jai Palestine is stupid and weird yes, but this guy is straight up saying anti national shit in parliament.",
        "How is \"Hindu Rashtra\" any better than Khalistan?",
        "Then cancel Owaisi's membership also ! I mean at least this guy this speaking the obvious, Owaisi is literally supporting a foreign country over his own nation.",
        "Owaisi's comment was not needed too! But that doesnt dishonor/ disgrace to our constitution because India's foreign policy (as per Shri S Jaishankar) is always to support 2 state policy- both Israel & Palestine. We have good relations with both of them.",
        "Yes, cancel both.",
        "When you are in an Indian parliament taking oath as an MP you aren't supposed to be cheering for another nation.Shows that he is more loyal to his ummah than to India. Any Muslim would be. Constitution is secondary to them. By giving preference to another nation over your own you are sending out a clear message. In an Indian parliament when it comes to taking oath for an Indian cause, why invoke Palestine? It doesn't matter what our foreign policy is. Otherwise our foreign minister would be cheering for literally every other nation when he took oath lol. ",
        "You do understand Owaisi got prominence because of bjp right.\n\nWe should be shutting both of them instead of justifying BJP actions with Owaisi’s or fighting over who should be shut first."
    ],
    "cleaned_text": "jai hindu rashtra bjp mp chhatrapal singh gangwar oath taking surprised took ani hour report compared owaisis hail palestine reported minutes ",
    "cleaned_title": "jai hindu rashtra bjp mp chhatrapal singh gangwar oath taking",
    "cleaned_selftext": "surprised took ani hour report compared owaisis hail palestine reported minutes",
    "cleaned_comments": "bhai iski sakal dekh kai aur gussa ati hai mereko ek bhi kaam nahi kia hoga isnee pata nahi iss bar kaisai jeet gaya mainai tho india ko vote dala tha deshdrohi wait wait min wtf happening country fuc bjp better hindu rashtra someone like owaisi cant even country fucker straight jail idea hindu rashtra quite opposite idea country guy got elected people like shouldnt allowed parliament owaisi also stupid palestine india terms hindu rashtra come cost india imagine sikh would said jai khalistan people would lost shit much anti nationals khalistanis also ig parliamentary privileges cover oaths also taking oath constitution prohibits disgraceful moment guys membership must annulled know interesting secular country part basic structure doctrine understood unchangable long indian constitution legitimate changable revolution suggesting change owaisi said could interpreted stance indias foreign policy said certainly sedition shame shame shame basic structure doctrine something supreme court pulled ass constitutional basis parliament two thirds majority amend constitution eliminate references secularism court objects parliament impeach heck probably bullshit njac verdict either way doesnt need revolution im advocating getting rid important vote basic respect understanding liberal values essential country though sadly seem going opposite direction pulling ass agree basic structure doctrine judicial invention doesnt mean parliament away two third majority parliament gets powers constitution way around parliament use limited amending powers change entire constitution constituent assembly could broad basis basic structure doctrine secondly impeachment sc judge doesnt work like mentioned parliament cant impeach judge heshe objects law amendment could system work judiciary cant even check legislative executive overreach proper grounds mentioned constitution removal judge viz proved incapacity misbehavior matters response owaisi owaisi pulling ass agree basic structure doctrine judicial invention doesnt mean parliament away two third majority thats exactly means parliament gets powers constitution way around yes constitution grants parliament power amend constitution constitution meant living document bound morality dictates mid th century politics parliament use limited amending powers change entire constitution absolutely aspect constitution amended power constitutional amendment constitution places limits power amendment parliament requisite majority save bit needing consent states issues affect youre welcome open constitution prove wrong constituent assembly could constituent assembly empowered preconstitutional statute legal basis constituent assembly convened constitution today heck reference one preamble simply describes constitution adopted broad basis basic structure doctrine zero basis doctrine people india sovereign india parliament directly elected representatives unlike judiciary executive parliament vested power final determination text constitution says limits sovereign exercise peoples authority via representatives definition sovereignty isnt limited constrained body constrains another sovereign power people representatives constrained body would sovereign sc claim constrain people representatives would imply sovereigns india secondly impeachment sc judge doesnt work like mentioned parliament cant impeach judge heshe objects law amendment absolutely constitution tell parliament allowed consider misbehavior incapacity judge supreme court shall removed office except order president passed address house parliament supported majority total membership house majority less twothirds members house present voting presented president session removal ground proved misbehaviour incapacity text constitution two thirds parliament determined judge must removed free context impeachment proved misbehavior simply parliament considers proved neither misbehavior incapacity defined constitution external body allowed constitution interfere parliaments impeachment powers disagree youre welcome cite constitutional provision conflicts limiting parliament allowed cite constitutional provisions made words dumbass bench thinks override constitution sc frequently moreover acting violation constitutional mandate infringing sovereignty people india valid reason impeach court judges gone rogue could system work judiciary cant even check legislative executive overreach judiciary fully entitled check legislative overreach overreach violation constitution problem youre thinking absolutes courts check parliament exercising absolute powers exercise powers thats works parliament passes law conflicts constitution court allowed check parliament creates constitutional conflict via amendment results contrary outcomes courts also authority step thus instance resolution jk court engaged since ambiguities established text constitution court allowed exceed constitutional mandate yes text constitution power allowed interfere parliament amending constitution scs basic structure doctrine unconstitutional frankly attack sovereignty indian people parliament allowed exist refraining legislatively attacking doesnt change inherently unconstitutional nature parliaments power end tomorrow court wishes clear parliament majority impeach judges believe necessary free abolish sc want long properly via constitutional amendment free change aspect constitution doesnt mean check parliament isnt unelected judges however people india alone check actions refusing give sanction twothirds majority empowered act via elections parliament consists indias elected representatives elected via direct indirect elections together act amend constitution exercising powers delegated sovereign people india permission unelected unaccountable judiciary proper grounds mentioned constitution removal judge viz proved incapacity misbehavior jai palestine ke bad ab ye jai hindu rashtra attention seekers people recognise work people create controversy remain trendy useless politicians people voted idiots never vote bhai bharat hindu rashtra nahi hai agar hai tho kya baaki logo ko maar dena hai people losing shit jai palestine xd deshdrohi new deshpremi jai hindu rashtra jai palestine made parliament fucking joke owasi bjp b team spew hatred bjps existence meaning lol cancel delete x account mujhe laga jai hind rashtra bola mein bada confused replies dekh kar fir wapas dekha toh pata chal hindu rashtra bola jai palastine disgraceful nobody right mind would defend jai palestine stupid weird yes guy straight saying anti national shit parliament hindu rashtra better khalistan cancel owaisis membership also mean least guy speaking obvious owaisi literally supporting foreign country nation owaisis comment needed doesnt dishonor disgrace constitution indias foreign policy per shri jaishankar always support state policy israel palestine good relations yes cancel indian parliament taking oath mp arent supposed cheering another nationshows loyal ummah india muslim would constitution secondary giving preference another nation sending clear message indian parliament comes taking oath indian cause invoke palestine doesnt matter foreign policy otherwise foreign minister would cheering literally every nation took oath lol understand owaisi got prominence bjp right shutting instead justifying bjp actions owaisis fighting shut first",
    "light_cleaned_title": "\"Jai Hindu Rashtra.\" - BJP MP Chhatrapal Singh Gangwar during Oath taking",
    "light_cleaned_selftext": "Surprised it took “ANI” more than an hour to report compared to Owaisi’s ‘Hail Palestine’ being reported under 30 minutes.",
    "light_cleaned_comments": "Bhai iski sakal dekh kai aur gussa ati hai mereko ek bhi kaam nahi kia hoga isnee pata nahi iss bar kaisai jeet gaya mainai tho india ko vote dala tha Deshdrohi. Wait. Wait a min....!! Wtf is happening in this country Fuc* bjp Better a Hindu Rashtra than someone like Owaisi who can't be even for his own country. Fucker. Straight to jail The idea of Hindu rashtra is quite opposite to the idea of the country this guy got elected from. People like these shouldn't be allowed in parliament. Owaisi was also stupid but there is no Palestine or India there can be both but in terms of Hindu rashtra it will come at the cost of India. Imagine if a Sikh would have said Jai Khalistan, these people would have lost their shit. They are as much anti nationals as khalistanis are. Also ig parliamentary privileges cover their oaths also. Taking oath on the very constitution that prohibits this! What a disgraceful moment! This guy's membership must be annulled. You know what is interesting. A secular country is part of the basic structure doctrine, which is understood to be unchangable as long as the Indian constitution is legitimate, as in only changable by revolution. He is suggesting that we change that. While what Owaisi said could be interpreted as his stance on India's foreign policy. What he said is most certainly SEDITION. This Shame Shame Shame The basic structure doctrine is something the Supreme Court pulled out of its ass. It has no constitutional basis. Parliament with a two thirds majority can amend the constitution to eliminate references to secularism. And if the court objects Parliament can impeach them. Heck they probably should have for their bullshit over the NJAC verdict. Either way, it doesn't need a revolution. And I'm not advocating for getting rid of it. It's why it's important to vote and why having some basic respect and understanding of liberal values is essential in this country. Though sadly we seem to be going in the opposite direction Now you are pulling this out of your ass. While I agree the basic structure doctrine is a judicial invention but that doesn't mean parliament can do away with it just by having a two third majority. The parliament gets its powers from the constitution and not the other way around. Parliament cannot use its limited amending powers to change the entire constitution. Only a constituent assembly could do that. This is the broad basis of basic structure doctrine. And secondly the impeachment of an SC judge doesn't work like you mentioned. Parliament can't impeach a judge just because he/she objects to a law or an amendment. How could such a system work where the judiciary can't even check a legislative or executive overreach. There are proper grounds mentioned in the constitution for removal of judge viz. Proved incapacity and misbehavior. Not that it matters, but who was in response to whom? Owaisi to him or him to Owaisi? >Now you are pulling this out of your ass. While I agree the basic structure doctrine is a judicial invention but that doesn't mean parliament can do away with it just by having a two third majority. That's exactly what it means. >The parliament gets its powers from the constitution and not the other way around. Yes. And the constitution grants *only* Parliament the power to amend the constitution. Because the constitution is *meant* to be a living document. Not bound to the morality and dictates of mid 20th century politics. >Parliament cannot use its limited amending powers to change the entire constitution. They absolutely can. Any aspect of the constitution can be amended by the power of constitutional amendment. The constitution places **no limits** on the power of amendment if Parliament has the requisite majority, save for the bit about needing the consent of states on issues that affect them. You're welcome to open the constitution and prove me wrong. >Only a constituent assembly could do that. The constituent assembly was empowered by preconstitutional statute. There is no legal basis for a constituent assembly to be convened under the constitution today. Heck the only reference to one is in the preamble which simply describes how the constitution was adopted. >This is the broad basis of basic structure doctrine. There is *zero* basis for the doctrine. The people of India are sovereign in India. Parliament are their directly elected representatives, unlike the judiciary and executive. It is Parliament which is vested as the power to have final determination on what the text of the constitution says. There are no limits on this sovereign exercise of the people's authority via there representatives. By definition, sovereignty isn't limited or constrained. The body that constrains another is the sovereign. So if the power of the people and their representatives were constrained, then that body would be the sovereign. For the SC to claim it can constrain the people and their representatives would imply they are the sovereigns in India. >And secondly the impeachment of an SC judge doesn't work like you mentioned. Parliament can't impeach a judge just because he/she objects to a law or an amendment. They absolutely can. The constitution does not tell Parliament what they are allowed to consider misbehavior or incapacity >A Judge of the Supreme Court shall not be removed from his office except by an order of the President passed after an address by each House of Parliament supported by a majority of the total membership of that House and by a majority of not less than two-thirds of the members of that House present and voting has been presented to the President in the same session for such removal on the **ground of proved misbehaviour or incapacity.** That is the text of the constitution. If two thirds of Parliament have determined that a judge must be removed, then they are free to do so. In the context of impeachment proved misbehavior is simply for what Parliament considers proved. Neither misbehavior nor incapacity are defined in the constitution. No external body is allowed by the constitution to interfere with Parliament's impeachment powers. If you disagree, you're welcome to cite the constitutional provision which conflicts with A124 on limiting Parliament. You are *only* allowed to cite constitutional provisions. Not the made up words of some dumbass on the bench who thinks he can override the constitution as the SC frequently does. Moreover acting in violation of their constitutional mandate and infringing on the sovereignty of the people of India is a valid reason to impeach a court and judges gone rogue. >How could such a system work where the judiciary can't even check a legislative or executive overreach. The judiciary is fully entitled to check legislative overreach when that overreach is in violation of the constitution. Your problem is you're thinking in absolutes. That if the courts cannot check Parliament exercising its absolute powers, then it cannot exercise those powers at all. That's not how it works. If Parliament passes any law that conflicts with the constitution, the court is allowed to check that. If Parliament creates a constitutional conflict via an amendment that results in contrary outcomes, then the courts also have authority to step in. Thus for instance, the resolution of JK which the court engaged with since there were ambiguities in the established text of the constitution. What the court is not allowed to do is exceed their own constitutional mandate. And so yes, under the text of the constitution, no power is allowed to interfere with Parliament amending the constitution. The SC's basic structure doctrine is unconstitutional, and frankly an attack on the sovereignty of the Indian people. That Parliament has allowed it to exist by refraining from legislatively attacking it doesn't change its inherently unconstitutional nature or Parliament's power to end it tomorrow and the court if it wishes. And just to be clear, not only can Parliament, with a 2/3 majority, impeach the judges, if they believe it necessary, they are free to abolish the SC itself if they want. As long as they do it properly via constitutional amendment, they are free to change any aspect of the constitution. That doesn't mean there is no check on Parliament. There is. It isn't by unelected judges however. It is by the people of India. They, and they alone, can check these actions by refusing to give sanction to a two-thirds majority empowered to act via elections. Parliament consists of India's elected representatives, elected via direct and indirect elections. If they, together, act to amend the constitution, they are exercising the powers delegated to them by the sovereign people of India. Not the permission of an unelected, unaccountable judiciary. >There are proper grounds mentioned in the constitution for removal of judge viz. Proved incapacity and misbehavior. Jai palestine ke bad ab ye jai hindu rashtra.... attention seekers. People should recognise them for their work but these people create controversy and remain trendy. Useless politicians. People voted for these idiots, never vote for them again. Bhai Bharat Hindu rashtra nahi hai. Agar hai tho kya baaki logo ko maar dena hai? People are losing shit over Jai Palestine XD Desh-drohi is the new Desh-premi Jai hindu rashtra and jai Palestine..... They have made this parliament into a fucking JOKE... Owasi is bjp b team. He is there to spew hatred so bjp’s existence has a meaning Lol. Cancel him. Delete his X account. mujhe laga “Jai Hind Rashtra” bola mein bada confused the replies dekh kar. fir wapas dekha toh pata chal hindu rashtra bola \"Jai palastine\" was disgraceful too. Nobody in their right mind would defend this or that. Jai Palestine is stupid and weird yes, but this guy is straight up saying anti national shit in parliament. How is \"Hindu Rashtra\" any better than Khalistan? Then cancel Owaisi's membership also ! I mean at least this guy this speaking the obvious, Owaisi is literally supporting a foreign country over his own nation. Owaisi's comment was not needed too! But that doesnt dishonor/ disgrace to our constitution because India's foreign policy (as per Shri S Jaishankar) is always to support 2 state policy- both Israel & Palestine. We have good relations with both of them. Yes, cancel both. When you are in an Indian parliament taking oath as an MP you aren't supposed to be cheering for another nation.Shows that he is more loyal to his ummah than to India. Any Muslim would be. Constitution is secondary to them. By giving preference to another nation over your own you are sending out a clear message. In an Indian parliament when it comes to taking oath for an Indian cause, why invoke Palestine? It doesn't matter what our foreign policy is. Otherwise our foreign minister would be cheering for literally every other nation when he took oath lol. You do understand Owaisi got prominence because of bjp right. We should be shutting both of them instead of justifying BJP actions with Owaisi’s or fighting over who should be shut first."
}