{
    "id": "15o1u7i",
    "title": "Getting ready for the 2024 elections",
    "url": "https://i.redd.it/yad4ybtwmfhb1.png",
    "selftext": "The selection committee to consist of the PM, Cabinet Minister of PM's choice and Leader of opposition. The odds are already 2:1. We know what to expect when they remove the CJI out of the committee to appoint the CEC right before the elections. SC had recommended this, but who gives heed to the SC?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691738430.0,
    "convurl": "https://i.redd.it/yad4ybtwmfhb1.png",
    "comments": [
        "Could anyone elaborate how removing this power from the CJI can benefit the country's election procedures???   There must be some logical reason right ?",
        "The recent judgement was because there was no law for this. SC ordered what it did to be applicable till parliament makes a law. So technically there isn't much of a change",
        "What? \n\nCorrect me if I'm wrong but it used to be the unilateral decision of just the PMO? \n\nCJI was never included in the decision making by the Supreme Court in 2015. The CJI isn't even an elected authority.\n\nThis bill makes the current system of including the opposition party leader much much much better than what we had for 75 years.",
        "The info is appreciated 👍"
    ],
    "cleaned_text": "getting ready elections selection committee consist pm cabinet minister pms choice leader opposition odds already know expect remove cji committee appoint cec right elections sc recommended gives heed sc ",
    "cleaned_title": "getting ready elections",
    "cleaned_selftext": "selection committee consist pm cabinet minister pms choice leader opposition odds already know expect remove cji committee appoint cec right elections sc recommended gives heed sc",
    "cleaned_comments": "could anyone elaborate removing power cji benefit countrys election procedures must logical reason right recent judgement law sc ordered applicable till parliament makes law technically isnt much change correct im wrong used unilateral decision pmo cji never included decision making supreme court cji isnt even elected authority bill makes current system including opposition party leader much much much better years info appreciated",
    "light_cleaned_title": "Getting ready for the 2024 elections",
    "light_cleaned_selftext": "The selection committee to consist of the PM, Cabinet Minister of PM's choice and Leader of opposition. The odds are already 2:1. We know what to expect when they remove the CJI out of the committee to appoint the CEC right before the elections. SC had recommended this, but who gives heed to the SC?",
    "light_cleaned_comments": "Could anyone elaborate how removing this power from the CJI can benefit the country's election procedures??? There must be some logical reason right ? The recent judgement was because there was no law for this. SC ordered what it did to be applicable till parliament makes a law. So technically there isn't much of a change What? Correct me if I'm wrong but it used to be the unilateral decision of just the PMO? CJI was never included in the decision making by the Supreme Court in 2015. The CJI isn't even an elected authority. This bill makes the current system of including the opposition party leader much much much better than what we had for 75 years. The info is appreciated 👍"
}