{
    "id": "145s2eo",
    "title": "NCERT asserts right to modify textbooks, rejects former advisors’ request for name removal",
    "url": "https://indianexpress.com/article/education/ncert-asserts-right-modify-textbooks-rejects-former-advisors-request-name-removal-8655469/",
    "selftext": " NCERT asserted that it owns the copyright to all educational material and that the \"withdrawal of association by any one member is out of the question,\" given that the textbooks are the product of a collective effort.",
    "flair": "Politics",
    "score": 108,
    "num_comments": 6,
    "created_utc": 1686376866.0,
    "convurl": "https://external-preview.redd.it/NmgO6BQ0ahf2QMEglj3LH_izIDcKHaNX6AnAvoIfGRQ.jpg?auto=webp&v=enabled&s=2882d00b0db65dc0359e2d584eecccb345a1a222",
    "comments": [
        "So they're saying that they can associate former contributor's names to any bs they bring in because they have copyright",
        "Ship of Thesus moment right here...",
        "So they don't give a F about consent of advisors",
        "Now they should go to court for defamation. This is unlawful association of their name with illegitimate content. This will require them to prove in court that this content is not endorsed by them and is incorrect in their expert opinion. I really hope they do it.",
        "Agreed",
        "[Can't be forced to introduce textbooks we no longer recognise: Yogendra Yadav, Suhas Palshikar to NCERT](https://www.deccanherald.com/national/cant-be-forced-to-introduce-textbooks-we-no-longer-recognise-yogendra-yadav-suhas-palshikar-to-ncert-1226654.html)"
    ],
    "cleaned_text": "ncert asserts right modify textbooks rejects former advisors request name removal ncert asserted owns copyright educational material withdrawal association one member question given textbooks product collective effort ",
    "cleaned_title": "ncert asserts right modify textbooks rejects former advisors request name removal",
    "cleaned_selftext": "ncert asserted owns copyright educational material withdrawal association one member question given textbooks product collective effort",
    "cleaned_comments": "theyre saying associate former contributors names bs bring copyright ship thesus moment right dont give f consent advisors go court defamation unlawful association name illegitimate content require prove court content endorsed incorrect expert opinion really hope agreed cant forced introduce textbooks longer recognise yogendra yadav suhas palshikar ncerthttpswwwdeccanheraldcomnationalcantbeforcedtointroducetextbookswenolongerrecogniseyogendrayadavsuhaspalshikartoncerthtml",
    "light_cleaned_title": "NCERT asserts right to modify textbooks, rejects former advisors’ request for name removal",
    "light_cleaned_selftext": "NCERT asserted that it owns the copyright to all educational material and that the \"withdrawal of association by any one member is out of the question,\" given that the textbooks are the product of a collective effort.",
    "light_cleaned_comments": "So they're saying that they can associate former contributor's names to any bs they bring in because they have copyright Ship of Thesus moment right here... So they don't give a F about consent of advisors Now they should go to court for defamation. This is unlawful association of their name with illegitimate content. This will require them to prove in court that this content is not endorsed by them and is incorrect in their expert opinion. I really hope they do it. Agreed [Can't be forced to introduce textbooks we no longer recognise: Yogendra Yadav, Suhas Palshikar to NCERT](https://www.deccanherald.com/national/cant-be-forced-to-introduce-textbooks-we-no-longer-recognise-yogendra-yadav-suhas-palshikar-to-ncert-1226654.html)"
}