{
    "id": "16gtj0e",
    "title": "Denounce mahatvakanksha, matbhed & manbhed – AAP’s success formula for INDIA bloc",
    "url": "https://theprint.in/politics/denounce-mahatvakanksha-matbhed-manbhed-aaps-success-formula-for-india-bloc/1758931/",
    "selftext": "The 28-party Opposition alliance will hold its highest decision-making body’s meeting in Delhi on Wednesday to talk about seat sharing, rallies etc.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694530553.0,
    "convurl": "https://external-preview.redd.it/1gjdjpsFtrYqvfojHg9Y7BWHEjwusiypiCUQ3vbq8Bs.jpg?auto=webp&s=46b4665bb69f9785bd449fb3c87a081812acb8bf",
    "comments": [
        ">Aam Aadmi Party (AAP) said Tuesday that all members will have to sacrifice three things to make the coalition successful – mahatvakanksha (ambition), matbhed (difference of opinion) and manbhed (difference of thought).\n\n>Chadha’s remarks came on the eve of INDIA’s first coordination committee meeting in Delhi on Wednesday, which he said would discuss issues to be taken to the people and the way forward.\n\n>The 28-party INDIA bloc has so far held three meetings, and the 14-member committee – the top decision-making body of the alliance – was formed in their last conclave in Mumbai.\n\n>The first committee meeting will focus on finalising campaigns and rallies to be held in the coming days, Rashtriya Janata Dal (RJD) leader Manoj Jha said on Monday.\n\n>Jha said the results of the recent by-polls in seven assembly seats – in which the Opposition won four and the BJP three – show that a narrative was getting built in favour of the INDIA bloc.\n\n>He added: “The meeting on the 13th is important, meetings of the different sub-groups have been held, like that of the social media committee, campaign committee, and research committee. The deliberations held in these meetings will get a stamp of approval. A final shape will be given to the agenda on Wednesday… What will be the programmes, where will campaigns be held etc.”"
    ],
    "cleaned_text": "denounce mahatvakanksha matbhed manbhed aaps success formula india bloc party opposition alliance hold highest decisionmaking bodys meeting delhi wednesday talk seat sharing rallies etc ",
    "cleaned_title": "denounce mahatvakanksha matbhed manbhed aaps success formula india bloc",
    "cleaned_selftext": "party opposition alliance hold highest decisionmaking bodys meeting delhi wednesday talk seat sharing rallies etc",
    "cleaned_comments": "aam aadmi party aap said tuesday members sacrifice three things make coalition successful mahatvakanksha ambition matbhed difference opinion manbhed difference thought chadhas remarks came eve indias first coordination committee meeting delhi wednesday said would discuss issues taken people way forward party india bloc far held three meetings member committee top decisionmaking body alliance formed last conclave mumbai first committee meeting focus finalising campaigns rallies held coming days rashtriya janata dal rjd leader manoj jha said monday jha said results recent bypolls seven assembly seats opposition four bjp three show narrative getting built favour india bloc added meeting th important meetings different subgroups held like social media committee campaign committee research committee deliberations held meetings get stamp approval final shape given agenda wednesday programmes campaigns held etc",
    "light_cleaned_title": "Denounce mahatvakanksha, matbhed & manbhed – AAP’s success formula for INDIA bloc",
    "light_cleaned_selftext": "The 28-party Opposition alliance will hold its highest decision-making body’s meeting in Delhi on Wednesday to talk about seat sharing, rallies etc.",
    "light_cleaned_comments": ">Aam Aadmi Party (AAP) said Tuesday that all members will have to sacrifice three things to make the coalition successful – mahatvakanksha (ambition), matbhed (difference of opinion) and manbhed (difference of thought). >Chadha’s remarks came on the eve of INDIA’s first coordination committee meeting in Delhi on Wednesday, which he said would discuss issues to be taken to the people and the way forward. >The 28-party INDIA bloc has so far held three meetings, and the 14-member committee – the top decision-making body of the alliance – was formed in their last conclave in Mumbai. >The first committee meeting will focus on finalising campaigns and rallies to be held in the coming days, Rashtriya Janata Dal (RJD) leader Manoj Jha said on Monday. >Jha said the results of the recent by-polls in seven assembly seats – in which the Opposition won four and the BJP three – show that a narrative was getting built in favour of the INDIA bloc. >He added: “The meeting on the 13th is important, meetings of the different sub-groups have been held, like that of the social media committee, campaign committee, and research committee. The deliberations held in these meetings will get a stamp of approval. A final shape will be given to the agenda on Wednesday… What will be the programmes, where will campaigns be held etc.”"
}