{
    "id": "10w9q3f",
    "title": "Scam being conducted from the official email id of the Tamil Nadu Commercial Taxes Department",
    "url": "https://www.reddit.com/r/india/comments/10w9q3f/scam_being_conducted_from_the_official_email_id/",
    "selftext": "So today I got this email from the official email id of [ctd.tn.gov.in](https://ctd.tn.gov.in) and out of curiosity (and some free time 😜) I replied to that email but I forgot to check that the reply to email id marked in the email is to that scammer's Gmail id. In reply to my \"What?\" email he replied with four paragraph essay of his.\n\nI am waiting to get a reply from the scammer to the latest mail I sent him further investigating how to get the 4.9 million pounds that he is promising me he will share with me once I am established as the next of kin for Late Mrs. Laura S. Greg.\n\nPlease let me know whether any of you got such mail or encountered such scams from the official email ids. And whom should I notify or complaint to about this. \n\nP.S.: I've sent a mail to the Complaints/ Grievance Cell of the Commercial Taxes Department, Tamil Nadu and waiting for their reply. And I know what I am doing when it comes to such scams but the only mistake now I did is that I replied from my personal email id so that will be fun in the future.\n\n[The first email is from the official Tamil Nadu Commercial Taxes Department email id](https://preview.redd.it/arwnjmlg9tga1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6d2077e3ec430ce5f7a882d27093134f7454371d)\n\n[This one is from a Gmail id](https://preview.redd.it/lmsnwps59tga1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d279aa37910da27ada063bf43f9662b6661a3fca)",
    "flair": "AskIndia",
    "score": 30,
    "num_comments": 4,
    "created_utc": 1675795868,
    "convurl": "https://a.thumbs.redditmedia.com/qEMJQgTmQhCuX_Kh9UmAIxnznca821WGWft06ts1ZA8.jpg",
    "comments": [
        "Case of e-mail spoofing. Nothing official about that mail id.",
        "Yeah, that is not the official email address of anyone. Just someone trying to be clever via email spoofing. It will not pass SPF, DKIM, or DMARC checks.",
        "I remember, I got a scammed email from a lady that her husband died and she wants her money to someone worthy like me. \n\nI replied how her husband died, we exchanged 3-4 emails. It was funny.",
        "Planning to the same thing. But that scammer hasn't replied to me yet 😂"
    ],
    "cleaned_text": "scam conducted official email id tamil nadu commercial taxes department today got email official email id ctdtngovinhttpsctdtngovin curiosity free time replied email forgot check reply email id marked email scammers gmail id reply email replied four paragraph essay waiting get reply scammer latest mail sent investigating get million pounds promising share established next kin late mrs laura greg please let know whether got mail encountered scams official email ids notify complaint ps ive sent mail complaints grievance cell commercial taxes department tamil nadu waiting reply know comes scams mistake replied personal email id fun future first email official tamil nadu commercial taxes department email idhttpspreviewredditarwnjmlgtgajpgwidthampformatpjpgampautowebpampvenabledampsdeeccefadfd one gmail idhttpspreviewredditlmsnwpstgajpgwidthampformatpjpgampautowebpampvenabledampsdaadaadabffbafca ",
    "cleaned_title": "scam conducted official email id tamil nadu commercial taxes department",
    "cleaned_selftext": "today got email official email id ctdtngovinhttpsctdtngovin curiosity free time replied email forgot check reply email id marked email scammers gmail id reply email replied four paragraph essay waiting get reply scammer latest mail sent investigating get million pounds promising share established next kin late mrs laura greg please let know whether got mail encountered scams official email ids notify complaint ps ive sent mail complaints grievance cell commercial taxes department tamil nadu waiting reply know comes scams mistake replied personal email id fun future first email official tamil nadu commercial taxes department email idhttpspreviewredditarwnjmlgtgajpgwidthampformatpjpgampautowebpampvenabledampsdeeccefadfd one gmail idhttpspreviewredditlmsnwpstgajpgwidthampformatpjpgampautowebpampvenabledampsdaadaadabffbafca",
    "cleaned_comments": "case email spoofing nothing official mail id yeah official email address anyone someone trying clever via email spoofing pass spf dkim dmarc checks remember got scammed email lady husband died wants money someone worthy like replied husband died exchanged emails funny planning thing scammer hasnt replied yet",
    "light_cleaned_title": "Scam being conducted from the official email id of the Tamil Nadu Commercial Taxes Department",
    "light_cleaned_selftext": "So today I got this email from the official email id of [ctd.tn.gov.in](https://ctd.tn.gov.in) and out of curiosity (and some free time 😜) I replied to that email but I forgot to check that the reply to email id marked in the email is to that scammer's Gmail id. In reply to my \"What?\" email he replied with four paragraph essay of his. I am waiting to get a reply from the scammer to the latest mail I sent him further investigating how to get the 4.9 million pounds that he is promising me he will share with me once I am established as the next of kin for Late Mrs. Laura S. Greg. Please let me know whether any of you got such mail or encountered such scams from the official email ids. And whom should I notify or complaint to about this. P.S.: I've sent a mail to the Complaints/ Grievance Cell of the Commercial Taxes Department, Tamil Nadu and waiting for their reply. And I know what I am doing when it comes to such scams but the only mistake now I did is that I replied from my personal email id so that will be fun in the future. [The first email is from the official Tamil Nadu Commercial Taxes Department email id](https://preview.redd.it/arwnjmlg9tga1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6d2077e3ec430ce5f7a882d27093134f7454371d) [This one is from a Gmail id](https://preview.redd.it/lmsnwps59tga1.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d279aa37910da27ada063bf43f9662b6661a3fca)",
    "light_cleaned_comments": "Case of e-mail spoofing. Nothing official about that mail id. Yeah, that is not the official email address of anyone. Just someone trying to be clever via email spoofing. It will not pass SPF, DKIM, or DMARC checks. I remember, I got a scammed email from a lady that her husband died and she wants her money to someone worthy like me. I replied how her husband died, we exchanged 3-4 emails. It was funny. Planning to the same thing. But that scammer hasn't replied to me yet 😂"
}