{
    "id": "16jjyh1",
    "title": "Ecosystem, not price play: Why the made in India iPhone costs an arm and a leg in India",
    "url": "https://www.moneycontrol.com/news/business/ecosystem-not-price-play-why-the-made-in-india-iphone-costs-an-arm-and-a-leg-in-india-11373141.html/amp#amp_tf=From%20%251%24s&aoh=16947991849239&csi=0&referrer=https%3A%2F%2Fwww.google.com",
    "selftext": "Read the article. I am surprised why no one is disgusted by Apple's pricing policy. They openly say that we'll milk those who wanna get milked. And how the fuck does ecosystem creation lead to a higher cost? This argument has absolutely no logic!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 52,
    "created_utc": 1694800075.0,
    "convurl": "https://external-preview.redd.it/ClmeZpfguPu1QrDc-ho7H3XmvHdHj75PJoaoIIekqk8.jpg?auto=webp&s=50e2bccb1116125fa2a73b1bbab4b27b4146bf00",
    "comments": [
        "Yeah, Apple has been giving such stupid reasons for years at this point, yet people keep buying their stuff so as long as they continue growing this isn't gonna stop",
        "I really don't understand why it should lower prices. Part of the reason why many Indians buy it is it is a wealth indicator. If they lower the prices, I think that would be bad .",
        "iPhones are not a necessity. They are a luxury. They can price it whatever they want. We don't have to be disgusted by it. Just buy a different phone and move on with your day.",
        "Don’t buy.",
        "Nobody needs an iPhone.\n\nIt's basically a luxury product.\n\nLet them price it according to their wishes.",
        "For me it’s the build quality and software support of the product. \n\nI got an almost new iPhone 12 last year after the 14 was out for 35K. I’ll keep it till 2026.\n\nI own the cheapest MacBook there is and it’s going strong for last 3 years and will probably last me next 7 years and so before the hardware would start to show its age.  I think it was 80k at the time after store discounts. \n\nIn both cases, the value you get out of your money is way more in comparison to other offerings in the market. And yes, buying speced out apple products is stupid. 25k for 8GB extra ram, no thank you!",
        "Gold is also a luxury product, but no jeweller claims to sell their gold at 10k/g because they want to create an ecosystem or some bullshit, while the same gold is available at 6k/g with other jewellers. This is exactly what Apple means by I'll milk you if you wanna get milked.",
        "Woh unka fayda dekhenge, apna thodi.\nWaise bhi bhangar recycle karke products bana rahe hai ab, they making more money than we can think.",
        "I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price  and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting.",
        "I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price  and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting.",
        "Samsung is better i dont want apple to treat me like a kid and only allow things their way.",
        "If reading the article is so difficult, I suggest you read the rant written  under the article. It's not breaking news that iPhones are costly. I too have an iPhone 12 Pro from 2 years ago.\n\nI don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price  and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting.",
        "The same reason why rolls Royce is priced that high",
        "I did read it. Again they have a right to price as they see fit, up to users to buy or not.",
        "GST. \n\nUS Doesn't have a pan-country tax like GST. So they give a list price and then taxation depends from state to state.",
        "Buy Micromax, No need to give arm, leg, and milk. /s",
        "What are you on about. The non pro models practically cost the same in India compared to their US counterparts + 18% GST.\n\nPro models are not assembled in India so they have an import duty + GST.\n\nThere is nothing shady going on here.",
        "iPhone is a premium product and they price it accordingly. It's the same for every company. Premium products are priced higher. Idk why you are upset about that",
        "I hate it that made in India goods costs more than buying it outside India. And I am amazed that people here finds no problem with it. Building a PC or even upgrading a PC is very expensive. Any electronic items are very expensive. Some OEMs sell their top tier products 2x the prices of what it costs outside India.",
        "You care way too much about the pricing model of a product that is not an essential commodity and frankly isn't hurting anybody. It's just a phone. Annoyance is one thing, but disgust? Feels like too strong an emotion for something of this nature.",
        "Is the Rolls Royce priced 20% higher in the UK (country of manufacture)? If it is so, I suppose they would blame it on taxes and logistics costs rather than giving such a lame reason that we want to earn more profits from you.",
        "Guys, this is what limited knowledge does to a person. I used to also think like this retard but see I am not a retard and I verify news and stuffs. Simple Google search can tell this person that in India it’s post tax, in US it’s pre tax. Obviously some price difference is there but if you are buying an iPhone it’s not much of a difference (if you can afford it and Not for just show off with EMIs).",
        "For most people this represents a huge leap in umderstanding",
        "Here's a bright idea:\n\nDon't buy this clunky juvenile crap.\n\nGet a classy machine instead.",
        "Base iPhone costs the same in India as USA and less than in Europe. 999$ is pre-tax price in the US and here you get tax included. And the pro model doesn't get assembled here so they cost more because of import duties included.",
        "If reading the article is so difficult for both your brain cells, I suggest you read the rant written  under the article. It's not breaking news that iPhones are costly. I too have an iPhone 12 Pro from 2 years ago.\n\nI don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price  and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting.",
        "It’s not priced higher. It’s the same exact price before tax.",
        "Macbook Pro from 2015 still going strong. \n\nTheir products also hold value longer if in good condition. People love to say how can anyone spend XXXX amount on a new iphone every couple years, forgetting that you can exchange or sell your old one for significant amount, which isn't usually the case with cheap androids. \n\nNot an apple fan-boy by any measure. I miss my LG phone with built in DAC and headphone jack, but then LG stopped making phones completely...",
        "Who hurt you. Do some fucken math first. Blame the govt if the taxes are too high here.",
        "Stop copy pasting this drivel in every reply",
        "Is Apple putting the blame on taxes? They just said that you're too stupid so we'll charge you 1.5 lakh for a phone that costs 1.1 lakh in Dubai and Hong Kong. Fuck it! Too many Apple bhakts here to argue. You people are so stupid that if I stock iPhone 15 with me and sell the same at 2 lakh you'll gladly buy them because this is exactly what Apple is doing. I should also exploit you dumbfucks for my profit.",
        "Go take your meds man. You sound batshit crazy.",
        "If you want to buy a phone in higher price range there are not many option\n\nMostly chinese co mobile are very low quality with 2 yr life at the most amd chinese data fishing free\n\nOne plus and other having screen glitch\n\nSamsung is trusted brand with good quality mobile but it has also started chanrging exorbitantly and nothing in mobile specification to back that high pricing except its flagship models al are using very slow obsolete processers",
        "Do you even understand GST, Stamp duty? Etc? Don't use your half baked knowledge to make a silly argument. 99% of comments here pointed out what's making it expensive. And yet you don't seem to understand. Next time take a break from commenting and read dammit.",
        "Totally agree",
        "Iphone 15 is made in india\nIphone 15 pros are still made in china\n\nThe cost of regular iphone is same as that of the phones in usa\n\n$799 < Rs. 79000 yes but the cost $799 is pre tax cost in usa each state of theirs have a 6-10% tax on phones while the tax in india is 18%.\n\nApple is not charging you more for made in india phone its the taxes here. Adjust with taxes and you’ll see they cost the same",
        "Iphone 15 is made in india Iphone 15 pros are still made in china\n\nThe cost of regular iphone is same as that of the phones in usa\n\n$799 < Rs. 79990 yes but the cost $799 is pre tax cost in usa each state of theirs have a 6-10% tax on phones while the Rs. 79990  includes 18% gst you don’t pay anything on top\n\nApple is not charging you more for made in india phone its the taxes here. Adjust with taxes and you’ll see they cost the same",
        "I don't know why you're disgusted with this. This is capitalism, plain and simple. If people are going to buy the phone for 78K, selling it for 58K makes no sense. Yes, you could attract a larger market but that is clearly not what Apple wants to do because they want to retain their premium brand image. They even gave the example of BMW and Mercedes as having a similar strategy.",
        "Dude is crying about 20% higher price and does not understand 18% GST on US price which is pre tax.",
        "Yes bro. There's no country in the world other than USA.",
        "Then buy it from those countries if you can’t afford in this two countries. \nIt’s an optional luxury device, and not necessarily need, no one is forcing.",
        "Rolls Royce has significantly better quality of materials and craftsmanship and engineering behind it. Better comparison would be gucci or Louis Vuitton"
    ],
    "cleaned_text": "ecosystem price play made india iphone costs arm leg india read article surprised one disgusted apples pricing policy openly say well milk wan na get milked fuck ecosystem creation lead higher cost argument absolutely logic ",
    "cleaned_title": "ecosystem price play made india iphone costs arm leg india",
    "cleaned_selftext": "read article surprised one disgusted apples pricing policy openly say well milk wan na get milked fuck ecosystem creation lead higher cost argument absolutely logic",
    "cleaned_comments": "yeah apple giving stupid reasons years point yet people keep buying stuff long continue growing isnt gon na stop really dont understand lower prices part reason many indians buy wealth indicator lower prices think would bad iphones necessity luxury price whatever want dont disgusted buy different phone move day dont buy nobody needs iphone basically luxury product let price according wishes build quality software support product got almost new iphone last year k ill keep till cheapest macbook going strong last years probably last next years hardware would start show age think k time store discounts cases value get money way comparison offerings market yes buying speced apple products stupid k gb extra ram thank gold also luxury product jeweller claims sell gold kg want create ecosystem bullshit gold available kg jewellers exactly apple means ill milk wan na get milked woh unka fayda dekhenge apna thodi waise bhi bhangar recycle karke products bana rahe hai ab making money think dont care sell lakh priced almost higher india want know indians collectively stupid well buy something market price even manufacturers give bullshit reason higher price shifted blame indian taxes would understandable saying want earn profit developed countries downright disgusting dont care sell lakh priced almost higher india want know indians collectively stupid well buy something market price even manufacturers give bullshit reason higher price shifted blame indian taxes would understandable saying want earn profit developed countries downright disgusting samsung better dont want apple treat like kid allow things way reading article difficult suggest read rant written article breaking news iphones costly iphone pro years ago dont care sell lakh priced almost higher india want know indians collectively stupid well buy something market price even manufacturers give bullshit reason higher price shifted blame indian taxes would understandable saying want earn profit developed countries downright disgusting reason rolls royce priced high read right price see fit users buy gst us doesnt pancountry tax like gst give list price taxation depends state state buy micromax need give arm leg milk non pro models practically cost india compared us counterparts gst pro models assembled india import duty gst nothing shady going iphone premium product price accordingly every company premium products priced higher idk upset hate made india goods costs buying outside india amazed people finds problem building pc even upgrading pc expensive electronic items expensive oems sell top tier products x prices costs outside india care way much pricing model product essential commodity frankly isnt hurting anybody phone annoyance one thing disgust feels like strong emotion something nature rolls royce priced higher uk country manufacture suppose would blame taxes logistics costs rather giving lame reason want earn profits guys limited knowledge person used also think like retard see retard verify news stuffs simple google search tell person india post tax us pre tax obviously price difference buying iphone much difference afford show emis people represents huge leap umderstanding heres bright idea dont buy clunky juvenile crap get classy machine instead base iphone costs india usa less europe pretax price us get tax included pro model doesnt get assembled cost import duties included reading article difficult brain cells suggest read rant written article breaking news iphones costly iphone pro years ago dont care sell lakh priced almost higher india want know indians collectively stupid well buy something market price even manufacturers give bullshit reason higher price shifted blame indian taxes would understandable saying want earn profit developed countries downright disgusting priced higher exact price tax macbook pro still going strong products also hold value longer good condition people love say anyone spend xxxx amount new iphone every couple years forgetting exchange sell old one significant amount isnt usually case cheap androids apple fanboy measure miss lg phone built dac headphone jack lg stopped making phones completely hurt fucken math first blame govt taxes high stop copy pasting drivel every reply apple putting blame taxes said youre stupid well charge lakh phone costs lakh dubai hong kong fuck many apple bhakts argue people stupid stock iphone sell lakh youll gladly buy exactly apple also exploit dumbfucks profit go take meds man sound batshit crazy want buy phone higher price range many option mostly chinese co mobile low quality yr life amd chinese data fishing free one plus screen glitch samsung trusted brand good quality mobile also started chanrging exorbitantly nothing mobile specification back high pricing except flagship models al using slow obsolete processers even understand gst stamp duty etc dont use half baked knowledge make silly argument comments pointed whats making expensive yet dont seem understand next time take break commenting read dammit totally agree iphone made india iphone pros still made china cost regular iphone phones usa rs yes cost pre tax cost usa state tax phones tax india apple charging made india phone taxes adjust taxes youll see cost iphone made india iphone pros still made china cost regular iphone phones usa rs yes cost pre tax cost usa state tax phones rs includes gst dont pay anything top apple charging made india phone taxes adjust taxes youll see cost dont know youre disgusted capitalism plain simple people going buy phone k selling k makes sense yes could attract larger market clearly apple wants want retain premium brand image even gave example bmw mercedes similar strategy dude crying higher price understand gst us price pre tax yes bro theres country world usa buy countries cant afford two countries optional luxury device necessarily need one forcing rolls royce significantly better quality materials craftsmanship engineering behind better comparison would gucci louis vuitton",
    "light_cleaned_title": "Ecosystem, not price play: Why the made in India iPhone costs an arm and a leg in India",
    "light_cleaned_selftext": "Read the article. I am surprised why no one is disgusted by Apple's pricing policy. They openly say that we'll milk those who wanna get milked. And how the fuck does ecosystem creation lead to a higher cost? This argument has absolutely no logic!",
    "light_cleaned_comments": "Yeah, Apple has been giving such stupid reasons for years at this point, yet people keep buying their stuff so as long as they continue growing this isn't gonna stop I really don't understand why it should lower prices. Part of the reason why many Indians buy it is it is a wealth indicator. If they lower the prices, I think that would be bad . iPhones are not a necessity. They are a luxury. They can price it whatever they want. We don't have to be disgusted by it. Just buy a different phone and move on with your day. Don’t buy. Nobody needs an iPhone. It's basically a luxury product. Let them price it according to their wishes. For me it’s the build quality and software support of the product. I got an almost new iPhone 12 last year after the 14 was out for 35K. I’ll keep it till 2026. I own the cheapest MacBook there is and it’s going strong for last 3 years and will probably last me next 7 years and so before the hardware would start to show its age. I think it was 80k at the time after store discounts. In both cases, the value you get out of your money is way more in comparison to other offerings in the market. And yes, buying speced out apple products is stupid. 25k for 8GB extra ram, no thank you! Gold is also a luxury product, but no jeweller claims to sell their gold at 10k/g because they want to create an ecosystem or some bullshit, while the same gold is available at 6k/g with other jewellers. This is exactly what Apple means by I'll milk you if you wanna get milked. Woh unka fayda dekhenge, apna thodi. Waise bhi bhangar recycle karke products bana rahe hai ab, they making more money than we can think. I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting. I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting. Samsung is better i dont want apple to treat me like a kid and only allow things their way. If reading the article is so difficult, I suggest you read the rant written under the article. It's not breaking news that iPhones are costly. I too have an iPhone 12 Pro from 2 years ago. I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting. The same reason why rolls Royce is priced that high I did read it. Again they have a right to price as they see fit, up to users to buy or not. GST. US Doesn't have a pan-country tax like GST. So they give a list price and then taxation depends from state to state. Buy Micromax, No need to give arm, leg, and milk. /s What are you on about. The non pro models practically cost the same in India compared to their US counterparts + 18% GST. Pro models are not assembled in India so they have an import duty + GST. There is nothing shady going on here. iPhone is a premium product and they price it accordingly. It's the same for every company. Premium products are priced higher. Idk why you are upset about that I hate it that made in India goods costs more than buying it outside India. And I am amazed that people here finds no problem with it. Building a PC or even upgrading a PC is very expensive. Any electronic items are very expensive. Some OEMs sell their top tier products 2x the prices of what it costs outside India. You care way too much about the pricing model of a product that is not an essential commodity and frankly isn't hurting anybody. It's just a phone. Annoyance is one thing, but disgust? Feels like too strong an emotion for something of this nature. Is the Rolls Royce priced 20% higher in the UK (country of manufacture)? If it is so, I suppose they would blame it on taxes and logistics costs rather than giving such a lame reason that we want to earn more profits from you. Guys, this is what limited knowledge does to a person. I used to also think like this retard but see I am not a retard and I verify news and stuffs. Simple Google search can tell this person that in India it’s post tax, in US it’s pre tax. Obviously some price difference is there but if you are buying an iPhone it’s not much of a difference (if you can afford it and Not for just show off with EMIs). For most people this represents a huge leap in umderstanding Here's a bright idea: Don't buy this clunky juvenile crap. Get a classy machine instead. Base iPhone costs the same in India as USA and less than in Europe. 999$ is pre-tax price in the US and here you get tax included. And the pro model doesn't get assembled here so they cost more because of import duties included. If reading the article is so difficult for both your brain cells, I suggest you read the rant written under the article. It's not breaking news that iPhones are costly. I too have an iPhone 12 Pro from 2 years ago. I don't care if they sell it at 10 lakh, but why is it priced almost 20% higher in India is what I want to know. Are we as Indians collectively stupid that we'll buy something at 120% the market price and even the manufacturers give some bullshit reason for the higher price. If they had shifted the blame on Indian taxes, it would have been understandable, but saying I want to earn more profit from you and not from developed countries is downright disgusting. It’s not priced higher. It’s the same exact price before tax. Macbook Pro from 2015 still going strong. Their products also hold value longer if in good condition. People love to say how can anyone spend XXXX amount on a new iphone every couple years, forgetting that you can exchange or sell your old one for significant amount, which isn't usually the case with cheap androids. Not an apple fan-boy by any measure. I miss my LG phone with built in DAC and headphone jack, but then LG stopped making phones completely... Who hurt you. Do some fucken math first. Blame the govt if the taxes are too high here. Stop copy pasting this drivel in every reply Is Apple putting the blame on taxes? They just said that you're too stupid so we'll charge you 1.5 lakh for a phone that costs 1.1 lakh in Dubai and Hong Kong. Fuck it! Too many Apple bhakts here to argue. You people are so stupid that if I stock iPhone 15 with me and sell the same at 2 lakh you'll gladly buy them because this is exactly what Apple is doing. I should also exploit you dumbfucks for my profit. Go take your meds man. You sound batshit crazy. If you want to buy a phone in higher price range there are not many option Mostly chinese co mobile are very low quality with 2 yr life at the most amd chinese data fishing free One plus and other having screen glitch Samsung is trusted brand with good quality mobile but it has also started chanrging exorbitantly and nothing in mobile specification to back that high pricing except its flagship models al are using very slow obsolete processers Do you even understand GST, Stamp duty? Etc? Don't use your half baked knowledge to make a silly argument. 99% of comments here pointed out what's making it expensive. And yet you don't seem to understand. Next time take a break from commenting and read dammit. Totally agree Iphone 15 is made in india Iphone 15 pros are still made in china The cost of regular iphone is same as that of the phones in usa $799 < Rs. 79000 yes but the cost $799 is pre tax cost in usa each state of theirs have a 6-10% tax on phones while the tax in india is 18%. Apple is not charging you more for made in india phone its the taxes here. Adjust with taxes and you’ll see they cost the same Iphone 15 is made in india Iphone 15 pros are still made in china The cost of regular iphone is same as that of the phones in usa $799 < Rs. 79990 yes but the cost $799 is pre tax cost in usa each state of theirs have a 6-10% tax on phones while the Rs. 79990 includes 18% gst you don’t pay anything on top Apple is not charging you more for made in india phone its the taxes here. Adjust with taxes and you’ll see they cost the same I don't know why you're disgusted with this. This is capitalism, plain and simple. If people are going to buy the phone for 78K, selling it for 58K makes no sense. Yes, you could attract a larger market but that is clearly not what Apple wants to do because they want to retain their premium brand image. They even gave the example of BMW and Mercedes as having a similar strategy. Dude is crying about 20% higher price and does not understand 18% GST on US price which is pre tax. Yes bro. There's no country in the world other than USA. Then buy it from those countries if you can’t afford in this two countries. It’s an optional luxury device, and not necessarily need, no one is forcing. Rolls Royce has significantly better quality of materials and craftsmanship and engineering behind it. Better comparison would be gucci or Louis Vuitton"
}