{
    "id": "mmgz8d",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/mmgz8d/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or YOUR COMPANY is HIRING:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**The Career Thread is posted every two weeks on Thursday mornings.**\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 30,
    "num_comments": 25,
    "created_utc": 1617845419,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Skills : Android, Data Visualisation, Python, Java, Firebase, AI\nProtfolio :AI, ML\nLocation : Delhi, Bangalore, Chandigarh, J and K\nContact : Email /DM",
        "So one thing I've been trying to get a good grasp on lately is comp ranges. I know 1.6lpm is a big meme here and all, but lacking something like levels.fyi I'm having a hard time understanding what's a reasonable target to negotiate for. It kind of bit me when I was negotiating recently and I went slightly above what they considered reasonable. It's fine and all, and I ended up getting a good deal anyway, but I wanted to know what kind of comp ranges are \"expected\" for different experience levels. Thanks in advance!",
        "Hiring! Looking for candidates with Oracle database, Postgres, XML or web application servers experience from a computer science or engineering educational background.\nLocation: Gurgaon\nDM me for more details. Thanks",
        "are you recruiting or showcasing your skills?",
        "First-generation litigating lawyer. Possess about 10 years experience in civil, mercantile litigation.  Based out of New Delhi and have recently gone into independent practice w.e.f. May 2020. I am looking out for retainerships with private entities and organisations having disputes related work, as well as general legal advisory work which they may wish to outsource. On an unrelated note, I am also very keen to work, even on a pro bono basis, in the field of animal conservation and environmental preservation. Please DM me if anyone can assist. Thanks.",
        "It would be useful if you mention your field and years of experience etc",
        "Software, 2 years, but I meant more in general - like what is the expectation for someone with ~5, 10 etc. Sort of like what levels.fyi does.",
        "There isn't a general hard number. Every company has their range/band for a specific position. \n\nFor Software Development Engineer - in Infosys it may be 4-6 lakhs for 2 years. For Microsoft it may be 18-26 lakhs.\n\nWhich companies are you targeting?",
        "Use Glassdoor for this",
        "Go on glass door or payscale.com and search for what your designation in the company you are applying for. It helps if the position has mass hiring as there are multiple data points to consider.\n\nTake the median and quote about 30% higher than that. In India and almost everywhere the Recruiters try to get you to commit a figure first. That ideally puts you at a disadvantage while negotiating. This method of quoting a figure higher than their expectation actually will turn them on their head. Also, make sure you know how much you think you are worth. If you think, you should be making 1L per month (and glassdoor is in a similar range) then make sure you stick to that number.\n\nIn a successful negotiation, both parties will always come out feeling they could have gotten more.",
        "I have the same profile looking for jobs in Thane/Bhiwandi location",
        "I generally target working for small to mid sized startups, and for companies like that there just isn't reliable salary data on Glassdoor. I try to calibrate with what bigger companies offer, but my expectation is that a VC backed startup should be paying slightly above market, so I wanted to see what others have seen in that kind of environment.",
        "As mentioned in a sibling comment, small to mid sized startups, usually funded.",
        "People who left their jobs without paying bond and without getting the relieving letter, did you ever face difficulty in your career later on in life?",
        "Pinging people on LinkedIn and hoping they disclose salary to random strangers is your best bet 😂",
        "Interested... what's the job profile?",
        "Hey folks, anyone settled in Germany or know about Germany, how to pursue Higher studies after completing B. Tech from Kerala, I wanted to know the possibilities and what are the procedures for that.\nP. S : Much appreciated for your time",
        "Looking for job in Procurement:\n\n1. 2.8 years of experience in end-to-end procurement (SAP MM)\n2. Location: Bengaluru\n3. Contact: DM/mail",
        "Check youtube, there are lot of videos on this topic",
        "Can anyone tell me what SAP MM stream is? I got it as my stream in MNC, is there any future for this stream?",
        "My company is hiring devs with Java and python experience. Big fintech. DM for deets.",
        "VC backed companies used to pay higher. Now everyone wants to be \"competitive\" after softbank has had to scale down.",
        "Obviously showcasing my skills, please refer to template provided.",
        "Looking for bloggers/content writers for a personal project. This is not going to be regular agency-kind pay. So looking for someone who wants some pocket money on the sides.",
        "\"Why are you booing me, I'm right\""
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings",
    "cleaned_comments": "skills android data visualisation python java firebase ai protfolio ai ml location delhi bangalore chandigarh j k contact email dm one thing ive trying get good grasp lately comp ranges know lpm big meme lacking something like levelsfyi im hard time understanding whats reasonable target negotiate kind bit negotiating recently went slightly considered reasonable fine ended getting good deal anyway wanted know kind comp ranges expected different experience levels thanks advance hiring looking candidates oracle database postgres xml web application servers experience computer science engineering educational background location gurgaon dm details thanks recruiting showcasing skills firstgeneration litigating lawyer possess years experience civil mercantile litigation based new delhi recently gone independent practice wef may looking retainerships private entities organisations disputes related work well general legal advisory work may wish outsource unrelated note also keen work even pro bono basis field animal conservation environmental preservation please dm anyone assist thanks would useful mention field years experience etc software years meant general like expectation someone etc sort like levelsfyi isnt general hard number every company rangeband specific position software development engineer infosys may lakhs years microsoft may lakhs companies targeting use glassdoor go glass door payscalecom search designation company applying helps position mass hiring multiple data points consider take median quote higher india almost everywhere recruiters try get commit figure first ideally puts disadvantage negotiating method quoting figure higher expectation actually turn head also make sure know much think worth think making l per month glassdoor similar range make sure stick number successful negotiation parties always come feeling could gotten profile looking jobs thanebhiwandi location generally target working small mid sized startups companies like isnt reliable salary data glassdoor try calibrate bigger companies offer expectation vc backed startup paying slightly market wanted see others seen kind environment mentioned sibling comment small mid sized startups usually funded people left jobs without paying bond without getting relieving letter ever face difficulty career later life pinging people linkedin hoping disclose salary random strangers best bet interested whats job profile hey folks anyone settled germany know germany pursue higher studies completing b tech kerala wanted know possibilities procedures p much appreciated time looking job procurement years experience endtoend procurement sap mm location bengaluru contact dmmail check youtube lot videos topic anyone tell sap mm stream got stream mnc future stream company hiring devs java python experience big fintech dm deets vc backed companies used pay higher everyone wants competitive softbank scale obviously showcasing skills please refer template provided looking bloggerscontent writers personal project going regular agencykind pay looking someone wants pocket money sides booing im right",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or YOUR COMPANY is HIRING:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **The Career Thread is posted every two weeks on Thursday mornings.**",
    "light_cleaned_comments": "Skills : Android, Data Visualisation, Python, Java, Firebase, AI Protfolio :AI, ML Location : Delhi, Bangalore, Chandigarh, J and K Contact : Email /DM So one thing I've been trying to get a good grasp on lately is comp ranges. I know 1.6lpm is a big meme here and all, but lacking something like levels.fyi I'm having a hard time understanding what's a reasonable target to negotiate for. It kind of bit me when I was negotiating recently and I went slightly above what they considered reasonable. It's fine and all, and I ended up getting a good deal anyway, but I wanted to know what kind of comp ranges are \"expected\" for different experience levels. Thanks in advance! Hiring! Looking for candidates with Oracle database, Postgres, XML or web application servers experience from a computer science or engineering educational background. Location: Gurgaon DM me for more details. Thanks are you recruiting or showcasing your skills? First-generation litigating lawyer. Possess about 10 years experience in civil, mercantile litigation. Based out of New Delhi and have recently gone into independent practice w.e.f. May 2020. I am looking out for retainerships with private entities and organisations having disputes related work, as well as general legal advisory work which they may wish to outsource. On an unrelated note, I am also very keen to work, even on a pro bono basis, in the field of animal conservation and environmental preservation. Please DM me if anyone can assist. Thanks. It would be useful if you mention your field and years of experience etc Software, 2 years, but I meant more in general - like what is the expectation for someone with ~5, 10 etc. Sort of like what levels.fyi does. There isn't a general hard number. Every company has their range/band for a specific position. For Software Development Engineer - in Infosys it may be 4-6 lakhs for 2 years. For Microsoft it may be 18-26 lakhs. Which companies are you targeting? Use Glassdoor for this Go on glass door or payscale.com and search for what your designation in the company you are applying for. It helps if the position has mass hiring as there are multiple data points to consider. Take the median and quote about 30% higher than that. In India and almost everywhere the Recruiters try to get you to commit a figure first. That ideally puts you at a disadvantage while negotiating. This method of quoting a figure higher than their expectation actually will turn them on their head. Also, make sure you know how much you think you are worth. If you think, you should be making 1L per month (and glassdoor is in a similar range) then make sure you stick to that number. In a successful negotiation, both parties will always come out feeling they could have gotten more. I have the same profile looking for jobs in Thane/Bhiwandi location I generally target working for small to mid sized startups, and for companies like that there just isn't reliable salary data on Glassdoor. I try to calibrate with what bigger companies offer, but my expectation is that a VC backed startup should be paying slightly above market, so I wanted to see what others have seen in that kind of environment. As mentioned in a sibling comment, small to mid sized startups, usually funded. People who left their jobs without paying bond and without getting the relieving letter, did you ever face difficulty in your career later on in life? Pinging people on LinkedIn and hoping they disclose salary to random strangers is your best bet 😂 Interested... what's the job profile? Hey folks, anyone settled in Germany or know about Germany, how to pursue Higher studies after completing B. Tech from Kerala, I wanted to know the possibilities and what are the procedures for that. P. S : Much appreciated for your time Looking for job in Procurement: 1. 2.8 years of experience in end-to-end procurement (SAP MM) 2. Location: Bengaluru 3. Contact: DM/mail Check youtube, there are lot of videos on this topic Can anyone tell me what SAP MM stream is? I got it as my stream in MNC, is there any future for this stream? My company is hiring devs with Java and python experience. Big fintech. DM for deets. VC backed companies used to pay higher. Now everyone wants to be \"competitive\" after softbank has had to scale down. Obviously showcasing my skills, please refer to template provided. Looking for bloggers/content writers for a personal project. This is not going to be regular agency-kind pay. So looking for someone who wants some pocket money on the sides. \"Why are you booing me, I'm right\""
}