{
    "id": "1atvt0c",
    "title": "India perform good on some aspects of economy under Modi govt. Let us give credit where it is due. Though there are some aspects where the govt needs to improve (like HDI, employment, healthcare). But overall, there was not much difference between UPA and NDA regimes. So be hopeful.",
    "url": "https://www.reddit.com/r/india/comments/1atvt0c/india_perform_good_on_some_aspects_of_economy/",
    "selftext": "Source article\n\n[https://www.thehindu.com/business/budget/decoding-indias-economic-realities-comparing-the-state-of-the-economy-under-the-nda-and-upa-governments/article67835050.ece](https://www.thehindu.com/business/budget/decoding-indias-economic-realities-comparing-the-state-of-the-economy-under-the-nda-and-upa-governments/article67835050.ece)\n\nHere are my notes\n\nUPA was good\n\n1. NDA1 reduced expenditure on capex, subsidies, defence, education and rural development\n2. NDA2 reduced expenditure on education, defence and subsidies on fuel and fertilizer fell (as % of GDP)\n3. non-tax revenues worsened \n4. corporate tax collections fell\n5. Manufacturing sector\n6. both export and import growth declined\n7. remittance inflows decreased \n8. NPA write-offs were large\n9. Inflation adjusted Net National Income is 50% (UPA) vs 43% (NDA)\n10. Unemployment  \n\n\nNDA was good\n\n1. NDA2 did better on capex, food subsidy, agriculture, and urban and rural development\n2. gross tax revenues\n3. individual income taxpayers increased \n4. decline in import-export improved the external trade balance\n5. FDI inflows increased\n6. NPA reduced  \n\n\nBoth same  \nHealth expenditure",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1708267964.0,
    "convurl": "https://external-preview.redd.it/lnHWLx3eqmT1biUmoI1si-et1wtgktfZd53EQXwU4gw.jpg?auto=webp&s=2f3e04b2dcffb0aaa922f63d1a80ed9befe13a80",
    "comments": [
        "Well that's kind of the point. \n\nA country of India's size (Population + Capital) with basic housekeeping is going to fare decently on the economic front with ups and downs. Everyone knows that. \n\nWhat's concerning is the social cost of having this government. Repairing that and restoring a functional democracy is going to be a steep task.",
        "That is your opinion. Isn't it?"
    ],
    "cleaned_text": "india perform good aspects economy modi govt let us give credit due though aspects govt needs improve like hdi employment healthcare overall much difference upa nda regimes hopeful source article httpswwwthehinducombusinessbudgetdecodingindiaseconomicrealitiescomparingthestateoftheeconomyunderthendaandupagovernmentsarticleecehttpswwwthehinducombusinessbudgetdecodingindiaseconomicrealitiescomparingthestateoftheeconomyunderthendaandupagovernmentsarticleece notes upa good nda reduced expenditure capex subsidies defence education rural development nda reduced expenditure education defence subsidies fuel fertilizer fell gdp nontax revenues worsened corporate tax collections fell manufacturing sector export import growth declined remittance inflows decreased npa writeoffs large inflation adjusted net national income upa vs nda unemployment nda good nda better capex food subsidy agriculture urban rural development gross tax revenues individual income taxpayers increased decline importexport improved external trade balance fdi inflows increased npa reduced health expenditure ",
    "cleaned_title": "india perform good aspects economy modi govt let us give credit due though aspects govt needs improve like hdi employment healthcare overall much difference upa nda regimes hopeful",
    "cleaned_selftext": "source article httpswwwthehinducombusinessbudgetdecodingindiaseconomicrealitiescomparingthestateoftheeconomyunderthendaandupagovernmentsarticleecehttpswwwthehinducombusinessbudgetdecodingindiaseconomicrealitiescomparingthestateoftheeconomyunderthendaandupagovernmentsarticleece notes upa good nda reduced expenditure capex subsidies defence education rural development nda reduced expenditure education defence subsidies fuel fertilizer fell gdp nontax revenues worsened corporate tax collections fell manufacturing sector export import growth declined remittance inflows decreased npa writeoffs large inflation adjusted net national income upa vs nda unemployment nda good nda better capex food subsidy agriculture urban rural development gross tax revenues individual income taxpayers increased decline importexport improved external trade balance fdi inflows increased npa reduced health expenditure",
    "cleaned_comments": "well thats kind point country indias size population capital basic housekeeping going fare decently economic front ups downs everyone knows whats concerning social cost government repairing restoring functional democracy going steep task opinion isnt",
    "light_cleaned_title": "India perform good on some aspects of economy under Modi govt. Let us give credit where it is due. Though there are some aspects where the govt needs to improve (like HDI, employment, healthcare). But overall, there was not much difference between UPA and NDA regimes. So be hopeful.",
    "light_cleaned_selftext": "Source article [https://www.thehindu.com/business/budget/decoding-indias-economic-realities-comparing-the-state-of-the-economy-under-the-nda-and-upa-governments/article67835050.ece](https://www.thehindu.com/business/budget/decoding-indias-economic-realities-comparing-the-state-of-the-economy-under-the-nda-and-upa-governments/article67835050.ece) Here are my notes UPA was good 1. NDA1 reduced expenditure on capex, subsidies, defence, education and rural development 2. NDA2 reduced expenditure on education, defence and subsidies on fuel and fertilizer fell (as % of GDP) 3. non-tax revenues worsened 4. corporate tax collections fell 5. Manufacturing sector 6. both export and import growth declined 7. remittance inflows decreased 8. NPA write-offs were large 9. Inflation adjusted Net National Income is 50% (UPA) vs 43% (NDA) 10. Unemployment NDA was good 1. NDA2 did better on capex, food subsidy, agriculture, and urban and rural development 2. gross tax revenues 3. individual income taxpayers increased 4. decline in import-export improved the external trade balance 5. FDI inflows increased 6. NPA reduced Both same Health expenditure",
    "light_cleaned_comments": "Well that's kind of the point. A country of India's size (Population + Capital) with basic housekeeping is going to fare decently on the economic front with ups and downs. Everyone knows that. What's concerning is the social cost of having this government. Repairing that and restoring a functional democracy is going to be a steep task. That is your opinion. Isn't it?"
}