{
    "id": "1576ftb",
    "title": "Challan sent to court for disposal. What to do next?",
    "url": "https://www.reddit.com/r/india/comments/1576ftb/challan_sent_to_court_for_disposal_what_to_do_next/",
    "selftext": "I had a pending challan from 19th June, 2022.\n\nI  tried paying it off online once but payment didn't got successful,  after that Pay button was disabled for 2-3 days (shitty govt. website).\n\nToday I got the SMS that my challan has been sent to court for disposal.\n\nI checked online and it is giving me below status.\n\n*\"The  challan is not sent to Virtual Court because payment initiated. So  challan will be disposed in the mentioned regular court.\"*\n\nWebsite is showing blank Court Name and Court Address.\n\nHow do I pay this off to avoid further trouble?\n\nLocation - Noida\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/9r3acp1ylndb1.png?width=2852&format=png&auto=webp&s=5e25de2cdce5192c79bb1b36f06492922b7f989e",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690091575.0,
    "convurl": "https://b.thumbs.redditmedia.com/u2bgeoBPXQ6QQFRD_NsprfHN7lGneo5Hf6VnRFTfSas.jpg",
    "comments": [
        "Hi,\n\nFaced the same problem. How did you get it resolved?",
        "Not resolved till now.",
        "Any update on this?",
        "Any update on how to solve?",
        "Update?",
        "Any updates ?",
        "It is showing the same status. Park+ app has the option to settle challan. They are charging 1000 for lawyer. You can settle from there.",
        "Hello, I am in the exact same situation as you were then. Suggest what I can do?\nWhere to see the court hearing date? Where to pay fine now? I can find these answers anywhere. Please help.",
        "They are charging 1500rs here in Gujarat. Can you elaborate on your experience with the park+ app? Were you required to visit the court?",
        "I have not opted for it",
        "How did you get it resolved?",
        "It is still pending.",
        "Oh."
    ],
    "cleaned_text": "challan sent court disposal next pending challan th june tried paying online payment didnt got successful pay button disabled days shitty govt website today got sms challan sent court disposal checked online giving status challan sent virtual court payment initiated challan disposed mentioned regular court website showing blank court name court address pay avoid trouble location noida xb xb ",
    "cleaned_title": "challan sent court disposal next",
    "cleaned_selftext": "pending challan th june tried paying online payment didnt got successful pay button disabled days shitty govt website today got sms challan sent court disposal checked online giving status challan sent virtual court payment initiated challan disposed mentioned regular court website showing blank court name court address pay avoid trouble location noida xb xb",
    "cleaned_comments": "hi faced problem get resolved resolved till update update solve update updates showing status park app option settle challan charging lawyer settle hello exact situation suggest see court hearing date pay fine find answers anywhere please help charging rs gujarat elaborate experience park app required visit court opted get resolved still pending oh",
    "light_cleaned_title": "Challan sent to court for disposal. What to do next?",
    "light_cleaned_selftext": "I had a pending challan from 19th June, 2022. I tried paying it off online once but payment didn't got successful, after that Pay button was disabled for 2-3 days (shitty govt. website). Today I got the SMS that my challan has been sent to court for disposal. I checked online and it is giving me below status. *\"The challan is not sent to Virtual Court because payment initiated. So challan will be disposed in the mentioned regular court.\"* Website is showing blank Court Name and Court Address. How do I pay this off to avoid further trouble? Location - Noida &#x200B; &#x200B;",
    "light_cleaned_comments": "Hi, Faced the same problem. How did you get it resolved? Not resolved till now. Any update on this? Any update on how to solve? Update? Any updates ? It is showing the same status. Park+ app has the option to settle challan. They are charging 1000 for lawyer. You can settle from there. Hello, I am in the exact same situation as you were then. Suggest what I can do? Where to see the court hearing date? Where to pay fine now? I can find these answers anywhere. Please help. They are charging 1500rs here in Gujarat. Can you elaborate on your experience with the park+ app? Were you required to visit the court? I have not opted for it How did you get it resolved? It is still pending. Oh."
}