{
    "id": "12w463a",
    "title": "SMS bombing harassment",
    "url": "https://www.reddit.com/r/india/comments/12w463a/sms_bombing_harassment/",
    "selftext": "So recently I've become a victim of SMS \n/Call bombing after getting an individual removed from a WhatsApp group\n\nHere's an article about the same:\n\nhttps://indianexpress.com/article/technology/tech-news-technology/sms-bombing-what-is-it-and-how-to-stay-safe-8050074/\n\n\"SMS Bombing is an attack where a large number of messages are sent to a particular number in a very short period of time, to harass a user or disrupt the normal working of a device.\n\nOne of our colleagues recently woke up to hundreds of OTP messages from food delivery platforms like Zomato, Zepto, and Licious, all within a span of a few hours. He had just become the victim of what is called SMS Bombing where a user’s number is bombarded with a large number of messages or even OTP calls within a very short period of time with a clear intention to harass a user and disrupt the normal working of a device.\"\n\nThis individual has gone above and beyond to keep the tabs open and keep the scripts activate for which I've received thousands of SMS and dozens of calls.\n\nThis seems to be a fairly prevalent issue around so I wanted to ask the r/India community what are my options to make this stop other than keep blocking numbers and SMS gateways. I've already \"blacklisted\" my number in several of these sites but also seems these can be run as scripts locally.\n\nIs there any lawyer or person here who might be able to help on the same?",
    "flair": "Crime",
    "score": 16,
    "num_comments": 10,
    "created_utc": 1682245933.0,
    "convurl": "https://external-preview.redd.it/e6E-WzA847bUFIVw-sTSulvTqhdyePkkMbJuxXD8vpo.jpg?auto=webp&v=enabled&s=637d4aeb2030391965a5828b5e3cb7a6c84ea35e",
    "comments": [
        "No idea how to stop someone else from doing it, I don't think there's a way though.\n\nWe've done this during the online classes scene initially, it's actually very simple. Just a harmless way to disrupt classes at the time, it was in consensus as it was not at all helpful.",
        "There's a certain app for this, you have to download it and then there's a option to secure your number then it won't happen.",
        "The problem is there's multiple websites offering this. Seems like scripts running from your browser doing calls to these services.\nAlso these can be run local scripts you can run from your computer therefore bypassing any option of \"blacklisting\" your number.",
        "What App?",
        "SMS bomber",
        "Have 2 numbers, one for public use and one for family and personal use. This has helped me a million times.",
        "There's an option in Truecaller to block calls from unknown numbers. Is there an option for sms? Pls check.\n\nIf there's the option, and it's free, use it. If it's a paid option, either get premium for some time, or use Truecaller mod apk.\n\nIf there isn't, either switch your phone off for some time or file a complaint to cybercrime dept."
    ],
    "cleaned_text": "sms bombing harassment recently ive become victim sms call bombing getting individual removed whatsapp group heres article sms bombing attack large number messages sent particular number short period time harass user disrupt normal working device one colleagues recently woke hundreds otp messages food delivery platforms like zomato zepto licious within span hours become victim called sms bombing users number bombarded large number messages even otp calls within short period time clear intention harass user disrupt normal working device individual gone beyond keep tabs open keep scripts activate ive received thousands sms dozens calls seems fairly prevalent issue around wanted ask rindia community options make stop keep blocking numbers sms gateways ive already blacklisted number several sites also seems run scripts locally lawyer person might able help ",
    "cleaned_title": "sms bombing harassment",
    "cleaned_selftext": "recently ive become victim sms call bombing getting individual removed whatsapp group heres article sms bombing attack large number messages sent particular number short period time harass user disrupt normal working device one colleagues recently woke hundreds otp messages food delivery platforms like zomato zepto licious within span hours become victim called sms bombing users number bombarded large number messages even otp calls within short period time clear intention harass user disrupt normal working device individual gone beyond keep tabs open keep scripts activate ive received thousands sms dozens calls seems fairly prevalent issue around wanted ask rindia community options make stop keep blocking numbers sms gateways ive already blacklisted number several sites also seems run scripts locally lawyer person might able help",
    "cleaned_comments": "idea stop someone else dont think theres way though weve done online classes scene initially actually simple harmless way disrupt classes time consensus helpful theres certain app download theres option secure number wont happen problem theres multiple websites offering seems like scripts running browser calls services also run local scripts run computer therefore bypassing option blacklisting number app sms bomber numbers one public use one family personal use helped million times theres option truecaller block calls unknown numbers option sms pls check theres option free use paid option either get premium time use truecaller mod apk isnt either switch phone time file complaint cybercrime dept",
    "light_cleaned_title": "SMS bombing harassment",
    "light_cleaned_selftext": "So recently I've become a victim of SMS /Call bombing after getting an individual removed from a WhatsApp group Here's an article about the same: \"SMS Bombing is an attack where a large number of messages are sent to a particular number in a very short period of time, to harass a user or disrupt the normal working of a device. One of our colleagues recently woke up to hundreds of OTP messages from food delivery platforms like Zomato, Zepto, and Licious, all within a span of a few hours. He had just become the victim of what is called SMS Bombing where a user’s number is bombarded with a large number of messages or even OTP calls within a very short period of time with a clear intention to harass a user and disrupt the normal working of a device.\" This individual has gone above and beyond to keep the tabs open and keep the scripts activate for which I've received thousands of SMS and dozens of calls. This seems to be a fairly prevalent issue around so I wanted to ask the r/India community what are my options to make this stop other than keep blocking numbers and SMS gateways. I've already \"blacklisted\" my number in several of these sites but also seems these can be run as scripts locally. Is there any lawyer or person here who might be able to help on the same?",
    "light_cleaned_comments": "No idea how to stop someone else from doing it, I don't think there's a way though. We've done this during the online classes scene initially, it's actually very simple. Just a harmless way to disrupt classes at the time, it was in consensus as it was not at all helpful. There's a certain app for this, you have to download it and then there's a option to secure your number then it won't happen. The problem is there's multiple websites offering this. Seems like scripts running from your browser doing calls to these services. Also these can be run local scripts you can run from your computer therefore bypassing any option of \"blacklisting\" your number. What App? SMS bomber Have 2 numbers, one for public use and one for family and personal use. This has helped me a million times. There's an option in Truecaller to block calls from unknown numbers. Is there an option for sms? Pls check. If there's the option, and it's free, use it. If it's a paid option, either get premium for some time, or use Truecaller mod apk. If there isn't, either switch your phone off for some time or file a complaint to cybercrime dept."
}