{
    "id": "16na2n8",
    "title": "Opposition finds common ground on Women’s Reservation Bill pushback, demands OBC quota",
    "url": "https://indianexpress.com/article/political-pulse/opposition-womens-reservation-bill-obc-quota-8947360/",
    "selftext": "Congress failed to push Bill through in 2010 over quota-within-quota demand but now aligned with other INDIA parties on the issue, Sonia may open for party in Lok Sabha debate on Wednesday.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 18,
    "created_utc": 1695178152.0,
    "convurl": "https://external-preview.redd.it/rOyREUx9X7MQf7zeIQMDayv4LM_eAZF3IGBUgbNm7BY.jpg?auto=webp&s=e60b5cc8b65182a609cc028949d69dc65785ccb4",
    "comments": [
        ">The parties said the Bill was a “huge betrayal” of the hopes of women as the implementation date had been kept vague and criticised the government for not providing quota for backward classes.\n\n>The Congress marked a complete turnaround from its position in 2010 when it failed to push the Bill through in the Lok Sabha — it was approved by the Rajya Sabha — because of stiff opposition from the Samajwadi Party (SP) and the Rashtriya Janata Dal (RJD) over their demand for quota within quota for Other Backward Classes (OBCs) and minorities. On Tuesday, as parties belonging to the INDIA alliance heaved a collective sigh of relief on finding points to criticise in the Bill, the Congress demanded reservation for OBCs. The demand is in sync with the larger Opposition bloc’s caste census demand and the social justice rhetoric could become one of the potent weapons in the Opposition’s arsenal for 2024.\n\n>While most parties, including the Congress, will not oppose the Bill, the Opposition is set to demand reservation for OBCs during the discussion on the Bill in Parliament\n\n>Congress president and Leader of the Opposition in the Rajya Sabha Mallikarjun Kharge set the stage for the OBC quota demand during his speech in the House on Tuesday. “Backward classes ko isme thodi si aage peeche hone ka sambhav isliye hai ki unless Constitutional amendment one-third backward ko dene ka nahi hota … toh naturally, wahan ke mahilao ko nahin milta. Agar aap nahi karenge toh sirf un backward classes ko anyay hoga (The backward classes may suffer in this because unless the Constitutional amendment provides one-third quota to the OBCs, their women will not benefit from it. If you don’t do that, it will amount to injustice to the backward classes),” Kharge said in the presence of Prime Minister Narendra Modi.",
        "[Today in Politics: Sonia Gandhi likely to open for Congress in women’s quota Bill debate, party sharpens social justice pitch](https://indianexpress.com/article/political-pulse/today-in-politics-sonia-gandhi-congress-in-womens-quota-bill-debate-party-sharpens-social-justice-pitch-8947745/)\n\n>The Congress’s shift in stand is not a sudden one and has been in the making for some time. The INDIA parties are likely to tie in the OBC quota demand in the women’s quota Bill with their push for a caste census. In short, it seems social justice will be one of the Opposition alliance’s chief weapons in the run-up to the parliamentary elections in 2024. This politics of social justice and OBC consolidation, or Mandal 2.0 as some political commentators have put it, will be the INDIA parties’ answer to the BJP’s Hindutva plank.\n\n>During the election campaign in Karnataka earlier this year, Congress leader Rahul Gandhi gave the slogan “Jitni abaadi, utna haq (however much the population, that much rights)”, giving his own spin to the slogan that Bahujan Samaj Party (BSP) founder Kanshi Ram first put across: “Jiski jitni sankhya bhaari, uski utni hissedari (Share as per one’s strength).” By making a case for a caste census, Rahul lent his voice to the demand of Hindi heartland parties such as the Janata Dal (United), RJD, and SP.\n\n>The social justice push also makes sense for the Opposition parties as the BJP is uncomfortable with the idea of a caste census as it could open a Pandora’s box and see various caste groups start demanding reservation according to their population. The BJP fears a division on caste lines weakening the very idea of an overarching Hindu unity.",
        "> The backward classes may suffer in this because unless the Constitutional amendment provides one-third quota to the OBCs, their women will not benefit from it. If you don’t do that, it will amount to injustice to the backward classes\n\nCurrently, there is no quota for OBC itself. Why does quota for women need to depend on OBC getting quota? We all know everyone wants to pass this bill, but only when they are in power because of the impact with the biggest voting bloc, women.",
        "The article clearly states that it is in line with opposition's social/caste welfare push.\n\nObc reservation does exist in some elections, recently UP made it for local ones if I remember correctly \n\nBut yeah again, this bill requires census and delimitation to come into full effect. One the govt itself is delaying for no reason and the other will see huge pushback",
        "good. I wish there was an additional trangender quota",
        "That's just no one implementing court's orders. Maybe because they're an insignificant minority for them",
        "> The article clearly states that it is in line with opposition's social/caste welfare push.\n\nIt shouldn't be blocking for women's reservation. \n\n> Obc reservation does exist in some elections, recently UP made it for local ones if I remember correctly\n\nYeah, to get more votes from OBC community.\n\n> https://www.deccanchronicle.com/nation/politics/160923/obc-reservations-in-parliament-assemblies-on-card-in-special-session.html\n\n> This phenomenon was essentially due to the decline of the Congress — a party dominated by upper castes — and to the rise of regional parties, primarily supported by large, dominant OBC groups. In 1989, the proportion of OBCs in the Lok Sabha had jumped from 11 per cent to 21 per cent, and continued to grow in the post-Mandal phase until 2004, when it peaked at 26 per cent. In parallel, the representation of upper castes persistently fell, from 49 per cent in 1984 to 37 per cent in 1989 and 34 per cent in 2004. The gap between OBCs and upper caste MPs returned from the Hindi-speaking belt had never been so small. The 2009 general elections marked a reversal of that trend, as upper caste representation shot up to 43 per cent, and the share of OBCs fell to 18 per cent.\n\nOBC percentage was 26 against what is assumed 40% of the population. And, it is down to 18, does it really require 25% reservation? It seems more like our formula to win seats no longer works and we don't want to appease other voting blocs so just give us certain percentage of seats. It isn't like women that at its peak is 14% in Parliament and before last elections was under 10% and in all assemblies it has been under 13% always. Or SC/ST which wouldn't get 10 seats combined without representation. If reservation for OBC needs to be done, it should at party level, make all national parties and coalitions to have 25% or 33% OBC candidates. They could do that for women as well, but women are mostly put as stand-ins currently.",
        "It sad. We wont get an opportunity like this again, atleast for a very long time.",
        "No one will be blocking it during votes, it will get large support. Which is still useless due the conditions required.\n\nI'll let caste census data answer the specific balances\n\nIts all about votes anyways, religion, caste and now gender. Why is a census needed for women's reservation? You're making it 1/3rd while its common knowledge that their population just below and around 1/2 everywhere.  Why does it need delimitation? You could implement it right now and then let the reserved seats increase with delimitation, if it happens.\n\nUP took the decision just a month before for obc reservation in local polls.\n\n\nCongress did infact decide to follow 50% sc st obc women and youth in their bodies. I think they did implement it in their recent organisation changes",
        "The only way I see it happening is when one side decides to use the hijra community's significance in hindu culture to make a narrative for reservation",
        "> Congress did infact decide to follow 50% sc st obc women and youth in their bodies. I think they did implement it in their recent organisation changes\n\nWell, needs to be mandated for everyone else as well. Not just out of choice for party and its leaders.",
        "Quota factory"
    ],
    "cleaned_text": "opposition finds common ground womens reservation bill pushback demands obc quota congress failed push bill quotawithinquota demand aligned india parties issue sonia may open party lok sabha debate wednesday ",
    "cleaned_title": "opposition finds common ground womens reservation bill pushback demands obc quota",
    "cleaned_selftext": "congress failed push bill quotawithinquota demand aligned india parties issue sonia may open party lok sabha debate wednesday",
    "cleaned_comments": "parties said bill huge betrayal hopes women implementation date kept vague criticised government providing quota backward classes congress marked complete turnaround position failed push bill lok sabha approved rajya sabha stiff opposition samajwadi party sp rashtriya janata dal rjd demand quota within quota backward classes obcs minorities tuesday parties belonging india alliance heaved collective sigh relief finding points criticise bill congress demanded reservation obcs demand sync larger opposition blocs caste census demand social justice rhetoric could become one potent weapons oppositions arsenal parties including congress oppose bill opposition set demand reservation obcs discussion bill parliament congress president leader opposition rajya sabha mallikarjun kharge set stage obc quota demand speech house tuesday backward classes ko isme thodi si aage peeche hone ka sambhav isliye hai ki unless constitutional amendment onethird backward ko dene ka nahi hota toh naturally wahan ke mahilao ko nahin milta agar aap nahi karenge toh sirf un backward classes ko anyay hoga backward classes may suffer unless constitutional amendment provides onethird quota obcs women benefit dont amount injustice backward classes kharge said presence prime minister narendra modi today politics sonia gandhi likely open congress womens quota bill debate party sharpens social justice pitchhttpsindianexpresscomarticlepoliticalpulsetodayinpoliticssoniagandhicongressinwomensquotabilldebatepartysharpenssocialjusticepitch congresss shift stand sudden one making time india parties likely tie obc quota demand womens quota bill push caste census short seems social justice one opposition alliances chief weapons runup parliamentary elections politics social justice obc consolidation mandal political commentators put india parties answer bjps hindutva plank election campaign karnataka earlier year congress leader rahul gandhi gave slogan jitni abaadi utna haq however much population much rights giving spin slogan bahujan samaj party bsp founder kanshi ram first put across jiski jitni sankhya bhaari uski utni hissedari share per ones strength making case caste census rahul lent voice demand hindi heartland parties janata dal united rjd sp social justice push also makes sense opposition parties bjp uncomfortable idea caste census could open pandoras box see various caste groups start demanding reservation according population bjp fears division caste lines weakening idea overarching hindu unity backward classes may suffer unless constitutional amendment provides onethird quota obcs women benefit dont amount injustice backward classes currently quota obc quota women need depend obc getting quota know everyone wants pass bill power impact biggest voting bloc women article clearly states line oppositions socialcaste welfare push obc reservation exist elections recently made local ones remember correctly yeah bill requires census delimitation come full effect one govt delaying reason see huge pushback good wish additional trangender quota thats one implementing courts orders maybe theyre insignificant minority article clearly states line oppositions socialcaste welfare push shouldnt blocking womens reservation obc reservation exist elections recently made local ones remember correctly yeah get votes obc community phenomenon essentially due decline congress party dominated upper castes rise regional parties primarily supported large dominant obc groups proportion obcs lok sabha jumped per cent per cent continued grow postmandal phase peaked per cent parallel representation upper castes persistently fell per cent per cent per cent gap obcs upper caste mps returned hindispeaking belt never small general elections marked reversal trend upper caste representation shot per cent share obcs fell per cent obc percentage assumed population really require reservation seems like formula win seats longer works dont want appease voting blocs give us certain percentage seats isnt like women peak parliament last elections assemblies always scst wouldnt get seats combined without representation reservation obc needs done party level make national parties coalitions obc candidates could women well women mostly put standins currently sad wont get opportunity like atleast long time one blocking votes get large support still useless due conditions required ill let caste census data answer specific balances votes anyways religion caste gender census needed womens reservation youre making rd common knowledge population around everywhere need delimitation could implement right let reserved seats increase delimitation happens took decision month obc reservation local polls congress infact decide follow sc st obc women youth bodies think implement recent organisation changes way see happening one side decides use hijra communitys significance hindu culture make narrative reservation congress infact decide follow sc st obc women youth bodies think implement recent organisation changes well needs mandated everyone else well choice party leaders quota factory",
    "light_cleaned_title": "Opposition finds common ground on Women’s Reservation Bill pushback, demands OBC quota",
    "light_cleaned_selftext": "Congress failed to push Bill through in 2010 over quota-within-quota demand but now aligned with other INDIA parties on the issue, Sonia may open for party in Lok Sabha debate on Wednesday.",
    "light_cleaned_comments": ">The parties said the Bill was a “huge betrayal” of the hopes of women as the implementation date had been kept vague and criticised the government for not providing quota for backward classes. >The Congress marked a complete turnaround from its position in 2010 when it failed to push the Bill through in the Lok Sabha — it was approved by the Rajya Sabha — because of stiff opposition from the Samajwadi Party (SP) and the Rashtriya Janata Dal (RJD) over their demand for quota within quota for Other Backward Classes (OBCs) and minorities. On Tuesday, as parties belonging to the INDIA alliance heaved a collective sigh of relief on finding points to criticise in the Bill, the Congress demanded reservation for OBCs. The demand is in sync with the larger Opposition bloc’s caste census demand and the social justice rhetoric could become one of the potent weapons in the Opposition’s arsenal for 2024. >While most parties, including the Congress, will not oppose the Bill, the Opposition is set to demand reservation for OBCs during the discussion on the Bill in Parliament >Congress president and Leader of the Opposition in the Rajya Sabha Mallikarjun Kharge set the stage for the OBC quota demand during his speech in the House on Tuesday. “Backward classes ko isme thodi si aage peeche hone ka sambhav isliye hai ki unless Constitutional amendment one-third backward ko dene ka nahi hota … toh naturally, wahan ke mahilao ko nahin milta. Agar aap nahi karenge toh sirf un backward classes ko anyay hoga (The backward classes may suffer in this because unless the Constitutional amendment provides one-third quota to the OBCs, their women will not benefit from it. If you don’t do that, it will amount to injustice to the backward classes),” Kharge said in the presence of Prime Minister Narendra Modi. [Today in Politics: Sonia Gandhi likely to open for Congress in women’s quota Bill debate, party sharpens social justice pitch](https://indianexpress.com/article/political-pulse/today-in-politics-sonia-gandhi-congress-in-womens-quota-bill-debate-party-sharpens-social-justice-pitch-8947745/) >The Congress’s shift in stand is not a sudden one and has been in the making for some time. The INDIA parties are likely to tie in the OBC quota demand in the women’s quota Bill with their push for a caste census. In short, it seems social justice will be one of the Opposition alliance’s chief weapons in the run-up to the parliamentary elections in 2024. This politics of social justice and OBC consolidation, or Mandal 2.0 as some political commentators have put it, will be the INDIA parties’ answer to the BJP’s Hindutva plank. >During the election campaign in Karnataka earlier this year, Congress leader Rahul Gandhi gave the slogan “Jitni abaadi, utna haq (however much the population, that much rights)”, giving his own spin to the slogan that Bahujan Samaj Party (BSP) founder Kanshi Ram first put across: “Jiski jitni sankhya bhaari, uski utni hissedari (Share as per one’s strength).” By making a case for a caste census, Rahul lent his voice to the demand of Hindi heartland parties such as the Janata Dal (United), RJD, and SP. >The social justice push also makes sense for the Opposition parties as the BJP is uncomfortable with the idea of a caste census as it could open a Pandora’s box and see various caste groups start demanding reservation according to their population. The BJP fears a division on caste lines weakening the very idea of an overarching Hindu unity. > The backward classes may suffer in this because unless the Constitutional amendment provides one-third quota to the OBCs, their women will not benefit from it. If you don’t do that, it will amount to injustice to the backward classes Currently, there is no quota for OBC itself. Why does quota for women need to depend on OBC getting quota? We all know everyone wants to pass this bill, but only when they are in power because of the impact with the biggest voting bloc, women. The article clearly states that it is in line with opposition's social/caste welfare push. Obc reservation does exist in some elections, recently UP made it for local ones if I remember correctly But yeah again, this bill requires census and delimitation to come into full effect. One the govt itself is delaying for no reason and the other will see huge pushback good. I wish there was an additional trangender quota That's just no one implementing court's orders. Maybe because they're an insignificant minority for them > The article clearly states that it is in line with opposition's social/caste welfare push. It shouldn't be blocking for women's reservation. > Obc reservation does exist in some elections, recently UP made it for local ones if I remember correctly Yeah, to get more votes from OBC community. > > This phenomenon was essentially due to the decline of the Congress — a party dominated by upper castes — and to the rise of regional parties, primarily supported by large, dominant OBC groups. In 1989, the proportion of OBCs in the Lok Sabha had jumped from 11 per cent to 21 per cent, and continued to grow in the post-Mandal phase until 2004, when it peaked at 26 per cent. In parallel, the representation of upper castes persistently fell, from 49 per cent in 1984 to 37 per cent in 1989 and 34 per cent in 2004. The gap between OBCs and upper caste MPs returned from the Hindi-speaking belt had never been so small. The 2009 general elections marked a reversal of that trend, as upper caste representation shot up to 43 per cent, and the share of OBCs fell to 18 per cent. OBC percentage was 26 against what is assumed 40% of the population. And, it is down to 18, does it really require 25% reservation? It seems more like our formula to win seats no longer works and we don't want to appease other voting blocs so just give us certain percentage of seats. It isn't like women that at its peak is 14% in Parliament and before last elections was under 10% and in all assemblies it has been under 13% always. Or SC/ST which wouldn't get 10 seats combined without representation. If reservation for OBC needs to be done, it should at party level, make all national parties and coalitions to have 25% or 33% OBC candidates. They could do that for women as well, but women are mostly put as stand-ins currently. It sad. We wont get an opportunity like this again, atleast for a very long time. No one will be blocking it during votes, it will get large support. Which is still useless due the conditions required. I'll let caste census data answer the specific balances Its all about votes anyways, religion, caste and now gender. Why is a census needed for women's reservation? You're making it 1/3rd while its common knowledge that their population just below and around 1/2 everywhere. Why does it need delimitation? You could implement it right now and then let the reserved seats increase with delimitation, if it happens. UP took the decision just a month before for obc reservation in local polls. Congress did infact decide to follow 50% sc st obc women and youth in their bodies. I think they did implement it in their recent organisation changes The only way I see it happening is when one side decides to use the hijra community's significance in hindu culture to make a narrative for reservation > Congress did infact decide to follow 50% sc st obc women and youth in their bodies. I think they did implement it in their recent organisation changes Well, needs to be mandated for everyone else as well. Not just out of choice for party and its leaders. Quota factory"
}