{
    "id": "11nmkyc",
    "title": "Self-employed women are considered high risk for life insurance in India!",
    "url": "https://www.reddit.com/r/india/comments/11nmkyc/selfemployed_women_are_considered_high_risk_for/",
    "selftext": "I came across a HDFC Life page with all the various forms they make people fill up when applying for term insurance. Most of them are understandable (e.g., medical conditions, racing, etc..). However, i noticed that they have a separate form for \"Self Employed Female\". Mind you, there is no form for \"Self Employed Male\". \n\nAlso, for some reason they seem to think the only professions women can get into is \"Tuition teaching\" or \"Beauty Parlors\". Is this just a way to assess the value of the individual's income (if so, why only women?), or is this just a sexist bias?\n\nLink: [https://onlineinsurance.hdfclife.com/questionnaires?appManager=Y](https://onlineinsurance.hdfclife.com/questionnaires?appManager=Y)\n\nAttaching screenshots of the form if the link isn't accessible.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/olhqhnaycwma1.png?width=765&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=45e76fba4665049c84ccce0200ae7c75eb9d3df3\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ho77a6n0dwma1.png?width=728&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8a2ca6e2a97477bfd7d2a3caa8b1b47ae9b448dd\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xojigyl2dwma1.png?width=780&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d646774db09c8c51779732bcdad3bb409dba266f",
    "flair": "Rant / Vent",
    "score": 68,
    "num_comments": 19,
    "created_utc": 1678447706,
    "convurl": "https://b.thumbs.redditmedia.com/Hv3b7laaHVGuNU8KRo0JzHTZfGZgK5T_AAWvJh2sHIA.jpg",
    "comments": [
        "I have seen that they make it especially difficult to get term insurance. Add that to the inherent sexism, and you get this!",
        "Tweet and shame HDFC Life.",
        "It will be too bad if someone protest-deleted their twitter account due to the overpowering musk in that platform, wouldn't it? \n\nDammnn...",
        "aww man, this is saddening",
        "An insurance premium is based on multiple factors such as age, gender, profession, region etc. These factors are then studied and coupled with historical data then categorised into different levels of risk.\n\nRegarding specific profession in the questionnaire, the process is same, the questionnaire is developed around the querries they get. If they get mass query from self employed women, who happen to be in the mentioned professions, they just put it on the questionnaire so that the women feels comfortable in filling out the form and thus gaining them a customer.\n\nUnfortunately, this category is historically proven as a high risk category as per data from para 1 so they are handed over a different form.\n\nHDFC is a for-profit company, they have investors (including the general public) who demand a return on their investment. They will sell insurance to a dead body if they see some profit. So please stop whining that HDFC is being sexist. They are not running a charity. They are just being smart and avoiding losses.",
        "what?\n\nthat makes no sense but tweet it to them. Everyone else will pressure them to either \n\na) come out with a self-employed male form\nb) revise their policies",
        "Maybe I didn't comprehend your comment right,but musk would not delete your tweet in this case",
        "I mean it could be the patriarchy or it could what the actuary really calculated for this group.",
        "I meant i deleted my Twitter 😅",
        "I meant i deleted my Twitter 😅",
        "Up to you what you want to do about it. Doesn't take long to create another account.",
        "Oh okay",
        "Why are they doing this??",
        "Id advise you to go for LIC tech term insurance. Much much better rates.",
        "As compared to men, women have many more options for self employment that are informal and invisible to the tax radar. The ones listed in the form like tuitions, beauty parlors, tailoring run from homes are examples of that. Heck, even MLM scams get claimed as self employment. \n\nThey do not register their business or for GST and often they do not pay income tax either. Courts have also ruled that certain kinds these jobs that women do from homes should not be considered commercial activity.\n\nThe form is specifically for women who are involved in those kinds of self employment. The form clearly states that at the top that its to be filled by women who have income from specific jobs.",
        "I agree with the cold hard logic :)",
        "At the end of the day, this is an actuarial question. As another redditor pointed out, they might have gotten a large number of queries from women in these professions, that might have triggered this. \n\nWhat stands out here is that this isn't part of the original form, and is specially triggered if you're a woman. A male equivalent will be small scale real estate brokerage business (informal income, often in cash, often goes unaccounted). My problem is the blatant sexism that would just get them sued for discrimination in a few other countries.\n\nIf you want another example, check out their form for \"housewives\". This isn't wokeness. If you want to think of it another way, This just shows that (out of other things) men don't have a way of getting insurance if they aren't the bread winner in the family."
    ],
    "cleaned_text": "selfemployed women considered high risk life insurance india came across hdfc life page various forms make people fill applying term insurance understandable eg medical conditions racing etc however noticed separate form self employed female mind form self employed male also reason seem think professions women get tuition teaching beauty parlors way assess value individuals income women sexist bias link httpsonlineinsurancehdfclifecomquestionnairesappmanageryhttpsonlineinsurancehdfclifecomquestionnairesappmanagery attaching screenshots form link isnt accessible ampxb ampxb ampxb ",
    "cleaned_title": "selfemployed women considered high risk life insurance india",
    "cleaned_selftext": "came across hdfc life page various forms make people fill applying term insurance understandable eg medical conditions racing etc however noticed separate form self employed female mind form self employed male also reason seem think professions women get tuition teaching beauty parlors way assess value individuals income women sexist bias link httpsonlineinsurancehdfclifecomquestionnairesappmanageryhttpsonlineinsurancehdfclifecomquestionnairesappmanagery attaching screenshots form link isnt accessible ampxb ampxb ampxb",
    "cleaned_comments": "seen make especially difficult get term insurance add inherent sexism get tweet shame hdfc life bad someone protestdeleted twitter account due overpowering musk platform wouldnt dammnn aww man saddening insurance premium based multiple factors age gender profession region etc factors studied coupled historical data categorised different levels risk regarding specific profession questionnaire process questionnaire developed around querries get get mass query self employed women happen mentioned professions put questionnaire women feels comfortable filling form thus gaining customer unfortunately category historically proven high risk category per data para handed different form hdfc forprofit company investors including general public demand return investment sell insurance dead body see profit please stop whining hdfc sexist running charity smart avoiding losses makes sense tweet everyone else pressure either come selfemployed male form b revise policies maybe didnt comprehend comment rightbut musk would delete tweet case mean could patriarchy could actuary really calculated group meant deleted twitter meant deleted twitter want doesnt take long create another account oh okay id advise go lic tech term insurance much much better rates compared men women many options self employment informal invisible tax radar ones listed form like tuitions beauty parlors tailoring run homes examples heck even mlm scams get claimed self employment register business gst often pay income tax either courts also ruled certain kinds jobs women homes considered commercial activity form specifically women involved kinds self employment form clearly states top filled women income specific jobs agree cold hard logic end day actuarial question another redditor pointed might gotten large number queries women professions might triggered stands isnt part original form specially triggered youre woman male equivalent small scale real estate brokerage business informal income often cash often goes unaccounted problem blatant sexism would get sued discrimination countries want another example check form housewives isnt wokeness want think another way shows things men dont way getting insurance arent bread winner family",
    "light_cleaned_title": "Self-employed women are considered high risk for life insurance in India!",
    "light_cleaned_selftext": "I came across a HDFC Life page with all the various forms they make people fill up when applying for term insurance. Most of them are understandable (e.g., medical conditions, racing, etc..). However, i noticed that they have a separate form for \"Self Employed Female\". Mind you, there is no form for \"Self Employed Male\". Also, for some reason they seem to think the only professions women can get into is \"Tuition teaching\" or \"Beauty Parlors\". Is this just a way to assess the value of the individual's income (if so, why only women?), or is this just a sexist bias? Link: [https://onlineinsurance.hdfclife.com/questionnaires?appManager=Y](https://onlineinsurance.hdfclife.com/questionnaires?appManager=Y) Attaching screenshots of the form if the link isn't accessible.",
    "light_cleaned_comments": "I have seen that they make it especially difficult to get term insurance. Add that to the inherent sexism, and you get this! Tweet and shame HDFC Life. It will be too bad if someone protest-deleted their twitter account due to the overpowering musk in that platform, wouldn't it? Dammnn... aww man, this is saddening An insurance premium is based on multiple factors such as age, gender, profession, region etc. These factors are then studied and coupled with historical data then categorised into different levels of risk. Regarding specific profession in the questionnaire, the process is same, the questionnaire is developed around the querries they get. If they get mass query from self employed women, who happen to be in the mentioned professions, they just put it on the questionnaire so that the women feels comfortable in filling out the form and thus gaining them a customer. Unfortunately, this category is historically proven as a high risk category as per data from para 1 so they are handed over a different form. HDFC is a for-profit company, they have investors (including the general public) who demand a return on their investment. They will sell insurance to a dead body if they see some profit. So please stop whining that HDFC is being sexist. They are not running a charity. They are just being smart and avoiding losses. what? that makes no sense but tweet it to them. Everyone else will pressure them to either a) come out with a self-employed male form b) revise their policies Maybe I didn't comprehend your comment right,but musk would not delete your tweet in this case I mean it could be the patriarchy or it could what the actuary really calculated for this group. I meant i deleted my Twitter 😅 I meant i deleted my Twitter 😅 Up to you what you want to do about it. Doesn't take long to create another account. Oh okay Why are they doing this?? Id advise you to go for LIC tech term insurance. Much much better rates. As compared to men, women have many more options for self employment that are informal and invisible to the tax radar. The ones listed in the form like tuitions, beauty parlors, tailoring run from homes are examples of that. Heck, even MLM scams get claimed as self employment. They do not register their business or for GST and often they do not pay income tax either. Courts have also ruled that certain kinds these jobs that women do from homes should not be considered commercial activity. The form is specifically for women who are involved in those kinds of self employment. The form clearly states that at the top that its to be filled by women who have income from specific jobs. I agree with the cold hard logic :) At the end of the day, this is an actuarial question. As another redditor pointed out, they might have gotten a large number of queries from women in these professions, that might have triggered this. What stands out here is that this isn't part of the original form, and is specially triggered if you're a woman. A male equivalent will be small scale real estate brokerage business (informal income, often in cash, often goes unaccounted). My problem is the blatant sexism that would just get them sued for discrimination in a few other countries. If you want another example, check out their form for \"housewives\". This isn't wokeness. If you want to think of it another way, This just shows that (out of other things) men don't have a way of getting insurance if they aren't the bread winner in the family."
}