{
    "id": "17tlbbh",
    "title": "Perks of joining this union.",
    "url": "https://www.reddit.com/gallery/17tlbbh",
    "selftext": "1st pic:- The Golden Chariot Train was under control of The Karnataka State Tourism Development Corporation Limited (KSTDC). The hosts are wearing Karnataka attires.\n\n2nd pic:- IRCTC took over from KSTDC in 2019. Look how they silently replaced our indentity and  Marwadified it. \n\nI'm starting to think joining this Union was the biggest loss of Kannadigas and Karnataka.",
    "flair": "Rant / Vent",
    "score": 285,
    "num_comments": 98,
    "created_utc": 1699799220.0,
    "convurl": "https://i.redd.it/5gytn60sfxzb1.jpg",
    "comments": [
        "Source\n\nhttps://twitter.com/IRCTCofficial/status/1370986915026010115?t=VpapE_EqCsJjtm-nOWlMdA&s=19",
        "I get ur point and also they have to maintain uniformity across the country and what they select is defined by the then ruler of the country. Yes ruler",
        "Who controls the ruler?",
        "Congratulations and the award for the BigO 2023 goes to you for getting offended on something on Diwali",
        "Indian \"rulers\" could not handle any kind of diversity anymore. They want to paint everything the same in name of nationalism. Gave this country from so called \"nationalists\"",
        "What you said in your last line is true for every state other than UP Bihar.",
        "Replace the government",
        "Either ways, both attires look like shit. Who cares.",
        "1st night rail?",
        "It's just a uniform, relax \n\nIf such a small thing would've made our founding fathers think of seceding from the Union then today we would've been 1000 different states constantly in a state of war over every other issue. \n\nGrow a pair and start thinking about how to bring the change from within, this secession talk is all bullshit and waste of time.",
        "The Grand Budapest station?",
        "Kodava dress looks more intimidating so India went back to the dress that their white sahibs are used to seeing their servants wear. Golden chariot is clearly not for Indians.",
        "So you are saying there is no such thing as a local identity and culture and it's ok to paint everything in the same brush just because somebody at the top thinks it is to do so. \nI don't know why the cow belt Hindi speaking population of our country realize that we are a multicultural population. We are more like Europe. The beauty of this country lies in it diversity and other current government is leaving no stone unturned to kill it.",
        "I would have given more value to your rant if Marwadis were the national dominant culture of the \"Union\" like you make them out to be. But they are not that and hence most of your point falls apart.",
        "Why was it taken over by IRCTC? Why did the Karnataka government agree to it?",
        "They don't like the diversity we have...",
        "The way they took our local banks by guit tripping us in the name of 'Nationalism'.",
        "Then Why did it find it's way to Karnataka tourism sector? It doesn't matter whether they are dominant but they certainly replaced our identity.",
        "En katheno. We need a strong local government. Unfortunately we only have JDS makkala paksha which is useless. Hope to see a young local party someday.",
        "Yeah that's pretty evident the way this country has been run post independence. Everyone has to speak same language, no one should question Delhi overlords if u do you r a anti nashunal.",
        "JDS avrdu  yavdu strong ideals illa. They just hop on different political ideals it depends how much  gain from it. Bcz of them national parties have field day in Karnataka.",
        "They asked things to be modified. They heard it as marwadified",
        "Joining? Not like anyone had a choice here",
        "They would have used military I know but we should've perished instead of being slaves to the Union.",
        "It looks great to see people of Karnataka are atleast raising the issue. In my state they worship the union rulers the same way they used to do the British. They even think the culture promoted by the union is kind of the more superior english translation of our own culture. Our Film industry perished over the years the music industry is dying very fast too because of this mindset. Guess the state.",
        "Unity in diversity is just a joke looks like…",
        "Start a revolution for secession movement then",
        "Was travelling by a train whivh goes from mh to punjab,the train hadfew instructions in punjabi bt none in marathi. Politicians of my state should sppeak against lack of representation and funding for mh.",
        "Adhe..waste they are.",
        "Wtf is this post? Are you that insecure about your cultural identity that a uniform change makes you question the union? \n\nPeople like you are the reason the Brits were able to divide and conquer. Absolutely embarrassing and deeply insulting to the Kannadigas who fought for a free and united India.",
        "In current times, ruler is too small. Bhakts consider the current leader to be the one true God king, I wouldn't be surprised if one of them puts his photo in their Pooja room soon.",
        "Where are you from? Which state?",
        "Ummm, wouldn't 90% of the people going from MH to PUNJAB be either Punjabi or probably rajasthan, haryana & MP. \n\nThe other three are Hindi states, and Hindi is an official language so it would definitely be there along with English, so doesn't it make SENSE to have Punjabi as the third one, since the people travelling on it are PUNJABI?\n\nGo check a train coming from Punjab to Maharashtra and then complain to your state politicians.",
        "From India",
        "Maharashtra?",
        "Wow India is a state, clearly we got some ncert educated UP bhaiyya in the room. Also the pro Hindi UP and Bihar Bhaiyyas were the first to bow down and surrender to EVERY invader. Aryans , Muslims, British. Everyone came and UP surrendered their as 😂. Most of them had to first take UP and then figure out how to take over rest of India. \n\nBecause UP Bhaiyyas have no regional culture of their own and no history coz well like I said, every invader basically made slaves out of UP, even today metro cities hire tons of labour from UP. So of course , you will try to blame and shane everyone who's against the generalization of India.\n\nUP so pathetic in its own culture and history that Lucknow Nawabs, which was the most obvious name for your IPL team, but NO! We will do Lucknow 'Super Giants' 😂, angrez chale gaye lekin gulam bj dena bhuul ni paya. \n\nSo a bhaiyya lecturing on divide and conquer is the last thing anyone gives a fuck about.",
        "So this is respect India Union gives to such Kannadigas?",
        "Looks like I touched a nerve 😂\n\nYou can assume where I’m from all you want, doesn’t change the fact that kids like you will forever complain and cry.",
        "Btw I am being critical of OP here , who is making ludicrous statements",
        "What did the uniforms look like earlier?",
        "1st pic",
        "karnataka bros should learn these things from tamil peeps. I'm sure there would be chaos if it had happened to them, no offence",
        "They are not complaining about having punjabi but rather lack of marathi, you would have understood if you were mature.",
        "Ohh thanks yeah definitely looks way better than the new one",
        "I have to agree with you that OP shouldn't be blaming the union here. It's because of the union what Bangalore is today, without it I don't think that was possible. \n\nAlso culture whitewashing is not unique to K'taka but an issue in every state and every state should be vocal about it, I am all for more power and autonomy to states but questioning union cannot be the way. \n\nAt this point in India having doubts about union, secularism, FoS, constitution is very dangerous.",
        "Bihar has so much diversity in terms of languages, and local cultural heritage. All gone in favour of Hindi and other North Indian cultural imports.",
        "So leaning towards secessionist tendencies over the smallest trivial issues is okay now? \nI'm from North Karnataka where the 2nd turban (peta) is more representative of our culture than South Karnataka turban, so should we call for our separate state? \nIt's a disgrace that these kinda posts thrive in this sub which literally is called r/india. I know we as people have various issues with central government, inter-state rivalry and many other issues but we should all strive to overcome them just like brothers/ sisters.",
        "Maybe KSTDC should have run it properly without huge losses in the first place.",
        "Why do u need uniformity, it's boring.  Imagine.every train train being a different experience,.that's what tourists would want. Not the same thing everywhere.",
        "Imagine everyone in different uniform. Will look odd. They cant assign an uniform for each train will create problems in scheduling the resources and manage the said uniformity",
        "This was probably done under BJP rule .",
        "Ok, I stand corrected, logic has left this country.\n\n1. I know they are complaining about the absence of Marathi, that's why i explained why Punjabi made sense.\n2. Flight attendants are trained professionals, trains have billboards, apne privilege se thoda bahar aao\n3.the many people you think are Marathi is not the majority is exactly what I'm saying\n\nHence I said go check a train coming from Punjab to Maharashtra, it will have a different train number, coach number and different instructions.\n\nPeople going to different states for work purposes would also know Hindi English which is already there. But sure, I'm immature sorry for offending your maratha pride. We should also name all trains passing through Maharashtra as Chhatrapati Shivaji Maharaj trains.",
        "Someone needs to tell them wearing salwar-pants hybrid makes them look like khardashian.",
        "Only sensible comment",
        "sorry but thats a stupid argument to say the least.",
        "Looks like we found the IRCTC babu",
        "Issue with trains is that the language/signs etc depend on the zone/division it is being run by and they follow the 3 language formula. \n\nIn this case it does not matter if train originates from MH, if it is run by a PB division there will not be any Marathi on the train.",
        "Mp or guj ?",
        "The same happens in every state which is not a Hindi-speaking region. Mass protests need to be carried out to send a clear message to the Union Government. Pushing a language is one thing, pushing a whole culture is another. What kind of colonial mindset is this!",
        "Oh yes this I realised just after commenting and I agree with you.",
        "A core tenet of the Hindutva project is building a single unified Hindu identity. This is why there is Hindi imposition. This is why there is anti-muslim polarization. This is why there is erasure of regional hindu identity. \n\nTo support hindutva is to support of culling of our diversity",
        "Do you mean seperate country when you say seperate state? \n\nBecause, Bifurcation of a state is not secession.",
        "I too am from north Karnataka, the Mysore peta is a signature Karnataka style although originating from south Karnataka. I am not a fashion expert but looking at the second photo, the attire looks to me very Gujrati/Marwari.\nWhy do you think discussing or preference of certain dressing style would lead to secessionism? \nSuch extreme sensitization of even the mildest criticism is not beneficial for a union like ours.\nThis is the Hallmark of the current ruling central government. \nI am glad that they no more rule Karnataka.",
        "Criticism is fine but the OP literally is talking about 'Union' and 'Centre being rulers' like we don't live in a parliamentary democracy but a dictatorial state. I don't give a shit about this government but taking such a trivial issue to question the integrity of our country is utterly stupid.",
        "Truv",
        "Stop lying that is not North Karnataka's Attire.",
        "Ours is a \"flawed\" parliamentary democracy. Mere having elections every 5 years doesn't qualify for a proper functioning democracy. For that, all 4 pillars of our democracy should be robust. Alas in our country, we know that's far from the truth.",
        "I don't need to lie, I'm from Belagavi and we wear Pagdi (Maratha style) which is closer to the Marwari turban than the Kodagu styled one. But that's not the point I'm making, the point is no need to do inflammatory and so divisive over such a stupid trivial issue. Let's criticise but with civility and harmony, like how two brothers/ sisters would disagree.",
        "Sure let's try to make it better as ONE country, rather than saying let's separate altogether.",
        "Yet time and again Karnataka ends up voting for these right wing assholes. If not then corrupt congress who are the other side of same coin. Look within.",
        "lol. handled this well. I've observed this too often where people treat me differently after learning I'm not from the north, because my hindi is good. It's so obvious",
        "looks like he touched a nerve boy",
        "You sound like East India company",
        "I love the diversity and multiculturalism of our nation \n\nAnd what the current government is doing, certainly it's wrong \n\nBut throwing a fit and talking about secession over a dress change is a huge over reaction"
    ],
    "cleaned_text": "perks joining union st pic golden chariot train control karnataka state tourism development corporation limited kstdc hosts wearing karnataka attires nd pic irctc took kstdc look silently replaced indentity marwadified im starting think joining union biggest loss kannadigas karnataka ",
    "cleaned_title": "perks joining union",
    "cleaned_selftext": "st pic golden chariot train control karnataka state tourism development corporation limited kstdc hosts wearing karnataka attires nd pic irctc took kstdc look silently replaced indentity marwadified im starting think joining union biggest loss kannadigas karnataka",
    "cleaned_comments": "source get ur point also maintain uniformity across country select defined ruler country yes ruler controls ruler congratulations award bigo goes getting offended something diwali indian rulers could handle kind diversity anymore want paint everything name nationalism gave country called nationalists said last line true every state bihar replace government either ways attires look like shit cares st night rail uniform relax small thing wouldve made founding fathers think seceding union today wouldve different states constantly state war every issue grow pair start thinking bring change within secession talk bullshit waste time grand budapest station kodava dress looks intimidating india went back dress white sahibs used seeing servants wear golden chariot clearly indians saying thing local identity culture ok paint everything brush somebody top thinks dont know cow belt hindi speaking population country realize multicultural population like europe beauty country lies diversity current government leaving stone unturned kill would given value rant marwadis national dominant culture union like make hence point falls apart taken irctc karnataka government agree dont like diversity way took local banks guit tripping us name nationalism find way karnataka tourism sector doesnt matter whether dominant certainly replaced identity en katheno need strong local government unfortunately jds makkala paksha useless hope see young local party someday yeah thats pretty evident way country run post independence everyone speak language one question delhi overlords u r anti nashunal jds avrdu yavdu strong ideals illa hop different political ideals depends much gain bcz national parties field day karnataka asked things modified heard marwadified joining like anyone choice would used military know shouldve perished instead slaves union looks great see people karnataka atleast raising issue state worship union rulers way used british even think culture promoted union kind superior english translation culture film industry perished years music industry dying fast mindset guess state unity diversity joke looks like start revolution secession movement travelling train whivh goes mh punjabthe train hadfew instructions punjabi bt none marathi politicians state sppeak lack representation funding mh adhewaste wtf post insecure cultural identity uniform change makes question union people like reason brits able divide conquer absolutely embarrassing deeply insulting kannadigas fought free united india current times ruler small bhakts consider current leader one true god king wouldnt surprised one puts photo pooja room soon state ummm wouldnt people going mh punjab either punjabi probably rajasthan haryana mp three hindi states hindi official language would definitely along english doesnt make sense punjabi third one since people travelling punjabi go check train coming punjab maharashtra complain state politicians india maharashtra wow india state clearly got ncert educated bhaiyya room also pro hindi bihar bhaiyyas first bow surrender every invader aryans muslims british everyone came surrendered first take figure take rest india bhaiyyas regional culture history coz well like said every invader basically made slaves even today metro cities hire tons labour course try blame shane everyone whos generalization india pathetic culture history lucknow nawabs obvious name ipl team lucknow super giants angrez chale gaye lekin gulam bj dena bhuul ni paya bhaiyya lecturing divide conquer last thing anyone gives fuck respect india union gives kannadigas looks like touched nerve assume im want doesnt change fact kids like forever complain cry btw critical op making ludicrous statements uniforms look like earlier st pic karnataka bros learn things tamil peeps im sure would chaos happened offence complaining punjabi rather lack marathi would understood mature ohh thanks yeah definitely looks way better new one agree op shouldnt blaming union union bangalore today without dont think possible also culture whitewashing unique ktaka issue every state every state vocal power autonomy states questioning union way point india doubts union secularism fos constitution dangerous bihar much diversity terms languages local cultural heritage gone favour hindi north indian cultural imports leaning towards secessionist tendencies smallest trivial issues okay im north karnataka nd turban peta representative culture south karnataka turban call separate state disgrace kinda posts thrive sub literally called rindia know people various issues central government interstate rivalry many issues strive overcome like brothers sisters maybe kstdc run properly without huge losses first place u need uniformity boring imagineevery train train different experiencethats tourists would want thing everywhere imagine everyone different uniform look odd cant assign uniform train create problems scheduling resources manage said uniformity probably done bjp rule ok stand corrected logic left country know complaining absence marathi thats explained punjabi made sense flight attendants trained professionals trains billboards apne privilege se thoda bahar aao many people think marathi majority exactly im saying hence said go check train coming punjab maharashtra different train number coach number different instructions people going different states work purposes would also know hindi english already sure im immature sorry offending maratha pride also name trains passing maharashtra chhatrapati shivaji maharaj trains someone needs tell wearing salwarpants hybrid makes look like khardashian sensible comment sorry thats stupid argument say least looks like found irctc babu issue trains languagesigns etc depend zonedivision run follow language formula case matter train originates mh run pb division marathi train mp guj happens every state hindispeaking region mass protests need carried send clear message union government pushing language one thing pushing whole culture another kind colonial mindset oh yes realised commenting agree core tenet hindutva project building single unified hindu identity hindi imposition antimuslim polarization erasure regional hindu identity support hindutva support culling diversity mean seperate country say seperate state bifurcation state secession north karnataka mysore peta signature karnataka style although originating south karnataka fashion expert looking second photo attire looks gujratimarwari think discussing preference certain dressing style would lead secessionism extreme sensitization even mildest criticism beneficial union like hallmark current ruling central government glad rule karnataka criticism fine op literally talking union centre rulers like dont live parliamentary democracy dictatorial state dont give shit government taking trivial issue question integrity country utterly stupid truv stop lying north karnatakas attire flawed parliamentary democracy mere elections every years doesnt qualify proper functioning democracy pillars democracy robust alas country know thats far truth dont need lie im belagavi wear pagdi maratha style closer marwari turban kodagu styled one thats point im making point need inflammatory divisive stupid trivial issue lets criticise civility harmony like two brothers sisters would disagree sure lets try make better one country rather saying lets separate altogether yet time karnataka ends voting right wing assholes corrupt congress side coin look within lol handled well ive observed often people treat differently learning im north hindi good obvious looks like touched nerve boy sound like east india company love diversity multiculturalism nation current government certainly wrong throwing fit talking secession dress change huge reaction",
    "light_cleaned_title": "Perks of joining this union.",
    "light_cleaned_selftext": "1st pic:- The Golden Chariot Train was under control of The Karnataka State Tourism Development Corporation Limited (KSTDC). The hosts are wearing Karnataka attires. 2nd pic:- IRCTC took over from KSTDC in 2019. Look how they silently replaced our indentity and Marwadified it. I'm starting to think joining this Union was the biggest loss of Kannadigas and Karnataka.",
    "light_cleaned_comments": "Source I get ur point and also they have to maintain uniformity across the country and what they select is defined by the then ruler of the country. Yes ruler Who controls the ruler? Congratulations and the award for the BigO 2023 goes to you for getting offended on something on Diwali Indian \"rulers\" could not handle any kind of diversity anymore. They want to paint everything the same in name of nationalism. Gave this country from so called \"nationalists\" What you said in your last line is true for every state other than UP Bihar. Replace the government Either ways, both attires look like shit. Who cares. 1st night rail? It's just a uniform, relax If such a small thing would've made our founding fathers think of seceding from the Union then today we would've been 1000 different states constantly in a state of war over every other issue. Grow a pair and start thinking about how to bring the change from within, this secession talk is all bullshit and waste of time. The Grand Budapest station? Kodava dress looks more intimidating so India went back to the dress that their white sahibs are used to seeing their servants wear. Golden chariot is clearly not for Indians. So you are saying there is no such thing as a local identity and culture and it's ok to paint everything in the same brush just because somebody at the top thinks it is to do so. I don't know why the cow belt Hindi speaking population of our country realize that we are a multicultural population. We are more like Europe. The beauty of this country lies in it diversity and other current government is leaving no stone unturned to kill it. I would have given more value to your rant if Marwadis were the national dominant culture of the \"Union\" like you make them out to be. But they are not that and hence most of your point falls apart. Why was it taken over by IRCTC? Why did the Karnataka government agree to it? They don't like the diversity we have... The way they took our local banks by guit tripping us in the name of 'Nationalism'. Then Why did it find it's way to Karnataka tourism sector? It doesn't matter whether they are dominant but they certainly replaced our identity. En katheno. We need a strong local government. Unfortunately we only have JDS makkala paksha which is useless. Hope to see a young local party someday. Yeah that's pretty evident the way this country has been run post independence. Everyone has to speak same language, no one should question Delhi overlords if u do you r a anti nashunal. JDS avrdu yavdu strong ideals illa. They just hop on different political ideals it depends how much gain from it. Bcz of them national parties have field day in Karnataka. They asked things to be modified. They heard it as marwadified Joining? Not like anyone had a choice here They would have used military I know but we should've perished instead of being slaves to the Union. It looks great to see people of Karnataka are atleast raising the issue. In my state they worship the union rulers the same way they used to do the British. They even think the culture promoted by the union is kind of the more superior english translation of our own culture. Our Film industry perished over the years the music industry is dying very fast too because of this mindset. Guess the state. Unity in diversity is just a joke looks like… Start a revolution for secession movement then Was travelling by a train whivh goes from mh to punjab,the train hadfew instructions in punjabi bt none in marathi. Politicians of my state should sppeak against lack of representation and funding for mh. Adhe..waste they are. Wtf is this post? Are you that insecure about your cultural identity that a uniform change makes you question the union? People like you are the reason the Brits were able to divide and conquer. Absolutely embarrassing and deeply insulting to the Kannadigas who fought for a free and united India. In current times, ruler is too small. Bhakts consider the current leader to be the one true God king, I wouldn't be surprised if one of them puts his photo in their Pooja room soon. Where are you from? Which state? Ummm, wouldn't 90% of the people going from MH to PUNJAB be either Punjabi or probably rajasthan, haryana & MP. The other three are Hindi states, and Hindi is an official language so it would definitely be there along with English, so doesn't it make SENSE to have Punjabi as the third one, since the people travelling on it are PUNJABI? Go check a train coming from Punjab to Maharashtra and then complain to your state politicians. From India Maharashtra? Wow India is a state, clearly we got some ncert educated UP bhaiyya in the room. Also the pro Hindi UP and Bihar Bhaiyyas were the first to bow down and surrender to EVERY invader. Aryans , Muslims, British. Everyone came and UP surrendered their as 😂. Most of them had to first take UP and then figure out how to take over rest of India. Because UP Bhaiyyas have no regional culture of their own and no history coz well like I said, every invader basically made slaves out of UP, even today metro cities hire tons of labour from UP. So of course , you will try to blame and shane everyone who's against the generalization of India. UP so pathetic in its own culture and history that Lucknow Nawabs, which was the most obvious name for your IPL team, but NO! We will do Lucknow 'Super Giants' 😂, angrez chale gaye lekin gulam bj dena bhuul ni paya. So a bhaiyya lecturing on divide and conquer is the last thing anyone gives a fuck about. So this is respect India Union gives to such Kannadigas? Looks like I touched a nerve 😂 You can assume where I’m from all you want, doesn’t change the fact that kids like you will forever complain and cry. Btw I am being critical of OP here , who is making ludicrous statements What did the uniforms look like earlier? 1st pic karnataka bros should learn these things from tamil peeps. I'm sure there would be chaos if it had happened to them, no offence They are not complaining about having punjabi but rather lack of marathi, you would have understood if you were mature. Ohh thanks yeah definitely looks way better than the new one I have to agree with you that OP shouldn't be blaming the union here. It's because of the union what Bangalore is today, without it I don't think that was possible. Also culture whitewashing is not unique to K'taka but an issue in every state and every state should be vocal about it, I am all for more power and autonomy to states but questioning union cannot be the way. At this point in India having doubts about union, secularism, FoS, constitution is very dangerous. Bihar has so much diversity in terms of languages, and local cultural heritage. All gone in favour of Hindi and other North Indian cultural imports. So leaning towards secessionist tendencies over the smallest trivial issues is okay now? I'm from North Karnataka where the 2nd turban (peta) is more representative of our culture than South Karnataka turban, so should we call for our separate state? It's a disgrace that these kinda posts thrive in this sub which literally is called r/india. I know we as people have various issues with central government, inter-state rivalry and many other issues but we should all strive to overcome them just like brothers/ sisters. Maybe KSTDC should have run it properly without huge losses in the first place. Why do u need uniformity, it's boring. Imagine.every train train being a different experience,.that's what tourists would want. Not the same thing everywhere. Imagine everyone in different uniform. Will look odd. They cant assign an uniform for each train will create problems in scheduling the resources and manage the said uniformity This was probably done under BJP rule . Ok, I stand corrected, logic has left this country. 1. I know they are complaining about the absence of Marathi, that's why i explained why Punjabi made sense. 2. Flight attendants are trained professionals, trains have billboards, apne privilege se thoda bahar aao 3.the many people you think are Marathi is not the majority is exactly what I'm saying Hence I said go check a train coming from Punjab to Maharashtra, it will have a different train number, coach number and different instructions. People going to different states for work purposes would also know Hindi English which is already there. But sure, I'm immature sorry for offending your maratha pride. We should also name all trains passing through Maharashtra as Chhatrapati Shivaji Maharaj trains. Someone needs to tell them wearing salwar-pants hybrid makes them look like khardashian. Only sensible comment sorry but thats a stupid argument to say the least. Looks like we found the IRCTC babu Issue with trains is that the language/signs etc depend on the zone/division it is being run by and they follow the 3 language formula. In this case it does not matter if train originates from MH, if it is run by a PB division there will not be any Marathi on the train. Mp or guj ? The same happens in every state which is not a Hindi-speaking region. Mass protests need to be carried out to send a clear message to the Union Government. Pushing a language is one thing, pushing a whole culture is another. What kind of colonial mindset is this! Oh yes this I realised just after commenting and I agree with you. A core tenet of the Hindutva project is building a single unified Hindu identity. This is why there is Hindi imposition. This is why there is anti-muslim polarization. This is why there is erasure of regional hindu identity. To support hindutva is to support of culling of our diversity Do you mean seperate country when you say seperate state? Because, Bifurcation of a state is not secession. I too am from north Karnataka, the Mysore peta is a signature Karnataka style although originating from south Karnataka. I am not a fashion expert but looking at the second photo, the attire looks to me very Gujrati/Marwari. Why do you think discussing or preference of certain dressing style would lead to secessionism? Such extreme sensitization of even the mildest criticism is not beneficial for a union like ours. This is the Hallmark of the current ruling central government. I am glad that they no more rule Karnataka. Criticism is fine but the OP literally is talking about 'Union' and 'Centre being rulers' like we don't live in a parliamentary democracy but a dictatorial state. I don't give a shit about this government but taking such a trivial issue to question the integrity of our country is utterly stupid. Truv Stop lying that is not North Karnataka's Attire. Ours is a \"flawed\" parliamentary democracy. Mere having elections every 5 years doesn't qualify for a proper functioning democracy. For that, all 4 pillars of our democracy should be robust. Alas in our country, we know that's far from the truth. I don't need to lie, I'm from Belagavi and we wear Pagdi (Maratha style) which is closer to the Marwari turban than the Kodagu styled one. But that's not the point I'm making, the point is no need to do inflammatory and so divisive over such a stupid trivial issue. Let's criticise but with civility and harmony, like how two brothers/ sisters would disagree. Sure let's try to make it better as ONE country, rather than saying let's separate altogether. Yet time and again Karnataka ends up voting for these right wing assholes. If not then corrupt congress who are the other side of same coin. Look within. lol. handled this well. I've observed this too often where people treat me differently after learning I'm not from the north, because my hindi is good. It's so obvious looks like he touched a nerve boy You sound like East India company I love the diversity and multiculturalism of our nation And what the current government is doing, certainly it's wrong But throwing a fit and talking about secession over a dress change is a huge over reaction"
}