{
    "id": "1507tso",
    "title": "Self-defense in road rage cases - lawyers, police, politicians, please help!",
    "url": "https://www.reddit.com/r/india/comments/1507tso/selfdefense_in_road_rage_cases_lawyers_police/",
    "selftext": "In the backdrop of the Bengaluru incident of road rage, where a bunch of goons chased after and beat up someone for simply honking at them, I would like to know what our legal options for self-defense are. Link to incident: [https://timesofindia.indiatimes.com/videos/toi-original/caught-on-cam-car-damaged-in-road-rage-incident-in-bengaluru/videoshow/101743873.cms](https://timesofindia.indiatimes.com/videos/toi-original/caught-on-cam-car-damaged-in-road-rage-incident-in-bengaluru/videoshow/101743873.cms)\n\nHow helpful are the police in this regard?\n\nHow do we defend ourselves until the police come? What are some legal self-defense weapons that don't require licenses/documentation etc.?\n\nWhat if the offenders get bail and come to threaten the complainant or carry out more violence?\n\nA lot of us are genuinely scared. \n\nIf there are any lawyers, police people, or politicians out here, I humbly request you to please respond to my questions!\n\nYour answers will be genuinely appreciated.\n\n\\- an ordinary Bengaluru resident",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689414801.0,
    "convurl": "https://external-preview.redd.it/LN8PM3VxLFTgOKWMpwYYRDCW7fpnQDnxRtxlK-Kj1LE.jpg?auto=webp&s=55dd4f48d84af1142bfc5b2bfd5313486cb8c83f",
    "comments": [
        "My title meets your requirements. Please don't remove this post!",
        "Similar queries have been answered on r/LegalAdviceIndia \n\nAdditionally, I reckon that the above sub would be a better place for getting suitable answers.",
        "I suppose guns help solve this immediately. Tax payers need to be given guns. As it is we get shit in return and zero security. Might as well frikin shoot the balls off of anyone who tries to frck around.",
        "Pepper spray",
        "Do you want school shootings? Because that’s exactly how you get school shootings.",
        "I genuinely believe that Indians should learn how to sucker punch for self defence.",
        "One needs to make themselves as strong as possible to deal with such challenging situations.\n\nThere is no one answer, but in a seriously dysfunctional & unequal law & order society, we need to take every step we can to look out for ourselves & our loved ones. \n\nElse, we risk becoming a statistic on the crime ratio/chart of our society.",
        "The first rule is to never, ever, ever get out of the car or unlock the doors. You're safe inside your vehicle. Try to leave the situation immediately if you can and drive straight to a police station or a public crowded place."
    ],
    "cleaned_text": "selfdefense road rage cases lawyers police politicians please help backdrop bengaluru incident road rage bunch goons chased beat someone simply honking would like know legal options selfdefense link incident httpstimesofindiaindiatimescomvideostoioriginalcaughtoncamcardamagedinroadrageincidentinbengaluruvideoshowcmshttpstimesofindiaindiatimescomvideostoioriginalcaughtoncamcardamagedinroadrageincidentinbengaluruvideoshowcms helpful police regard defend police come legal selfdefense weapons dont require licensesdocumentation etc offenders get bail come threaten complainant carry violence lot us genuinely scared lawyers police people politicians humbly request please respond questions answers genuinely appreciated ordinary bengaluru resident ",
    "cleaned_title": "selfdefense road rage cases lawyers police politicians please help",
    "cleaned_selftext": "backdrop bengaluru incident road rage bunch goons chased beat someone simply honking would like know legal options selfdefense link incident httpstimesofindiaindiatimescomvideostoioriginalcaughtoncamcardamagedinroadrageincidentinbengaluruvideoshowcmshttpstimesofindiaindiatimescomvideostoioriginalcaughtoncamcardamagedinroadrageincidentinbengaluruvideoshowcms helpful police regard defend police come legal selfdefense weapons dont require licensesdocumentation etc offenders get bail come threaten complainant carry violence lot us genuinely scared lawyers police people politicians humbly request please respond questions answers genuinely appreciated ordinary bengaluru resident",
    "cleaned_comments": "title meets requirements please dont remove post similar queries answered rlegaladviceindia additionally reckon sub would better place getting suitable answers suppose guns help solve immediately tax payers need given guns get shit return zero security might well frikin shoot balls anyone tries frck around pepper spray want school shootings thats exactly get school shootings genuinely believe indians learn sucker punch self defence one needs make strong possible deal challenging situations one answer seriously dysfunctional unequal law order society need take every step look loved ones else risk becoming statistic crime ratiochart society first rule never ever ever get car unlock doors youre safe inside vehicle try leave situation immediately drive straight police station public crowded place",
    "light_cleaned_title": "Self-defense in road rage cases - lawyers, police, politicians, please help!",
    "light_cleaned_selftext": "In the backdrop of the Bengaluru incident of road rage, where a bunch of goons chased after and beat up someone for simply honking at them, I would like to know what our legal options for self-defense are. Link to incident: [https://timesofindia.indiatimes.com/videos/toi-original/caught-on-cam-car-damaged-in-road-rage-incident-in-bengaluru/videoshow/101743873.cms](https://timesofindia.indiatimes.com/videos/toi-original/caught-on-cam-car-damaged-in-road-rage-incident-in-bengaluru/videoshow/101743873.cms) How helpful are the police in this regard? How do we defend ourselves until the police come? What are some legal self-defense weapons that don't require licenses/documentation etc.? What if the offenders get bail and come to threaten the complainant or carry out more violence? A lot of us are genuinely scared. If there are any lawyers, police people, or politicians out here, I humbly request you to please respond to my questions! Your answers will be genuinely appreciated. \\- an ordinary Bengaluru resident",
    "light_cleaned_comments": "My title meets your requirements. Please don't remove this post! Similar queries have been answered on r/LegalAdviceIndia Additionally, I reckon that the above sub would be a better place for getting suitable answers. I suppose guns help solve this immediately. Tax payers need to be given guns. As it is we get shit in return and zero security. Might as well frikin shoot the balls off of anyone who tries to frck around. Pepper spray Do you want school shootings? Because that’s exactly how you get school shootings. I genuinely believe that Indians should learn how to sucker punch for self defence. One needs to make themselves as strong as possible to deal with such challenging situations. There is no one answer, but in a seriously dysfunctional & unequal law & order society, we need to take every step we can to look out for ourselves & our loved ones. Else, we risk becoming a statistic on the crime ratio/chart of our society. The first rule is to never, ever, ever get out of the car or unlock the doors. You're safe inside your vehicle. Try to leave the situation immediately if you can and drive straight to a police station or a public crowded place."
}