{
    "id": "1co491v",
    "title": "Now Aadhar card can be used as ATM, even you can get money at your doorstep!!",
    "url": "https://timesofindia.indiatimes.com/business/financial-literacy/banking/what-is-an-aadhaar-atm-how-to-access-india-post-payments-bank-aeps-services-from-home-for-urgent-cash-needs/amp_articleshow/109165161.cms",
    "selftext": "Now you can use your Aadhar as ATM for withdrawal of money from Aadhar linked Bank Account. Even money can be delivered at your doorstep through Dak Sewa/Postman.\n\nhttps://x.com/ippbonline/status/1777287832970858532?s=46",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1715279363.0,
    "convurl": "https://external-preview.redd.it/KaublYGWAf2Wmt2l-x_Df5Xdk-CUUpt2VIn9UekW8CA.jpg?auto=webp&s=008614f9eb0001b3ca711eef8cda15c7222bcde0",
    "comments": [
        "Scammers finding out new ways to scam.",
        "Nice, now my bank details will also be leaked when the next mass adhar leak happens. Now that's progress !",
        "My grandparents have always used adhaar to take out money from banks..!",
        "Do people not know about AEPS.\n\nAdhaar enabled payment system. It takes biometric as consent to withdraw money, very useful in tier 2,3 and rural India.\n\nAs far as privacy goes, lol, I was at Paytm for a while, if you're using UPI,doesn't matter which app, iOS or Android, I could know exactly down to the last coordinate where you visit and shop from.\n\nPlus your mobile number, bank account details and more. But that's no reason to be scared in these times, every company knows this. \n\nJust remember if you have to enter your UPI pin, You are OR will be sending money OUT OF YOUR ACCOUNT"
    ],
    "cleaned_text": "aadhar card used atm even get money doorstep use aadhar atm withdrawal money aadhar linked bank account even money delivered doorstep dak sewapostman ",
    "cleaned_title": "aadhar card used atm even get money doorstep",
    "cleaned_selftext": "use aadhar atm withdrawal money aadhar linked bank account even money delivered doorstep dak sewapostman",
    "cleaned_comments": "scammers finding new ways scam nice bank details also leaked next mass adhar leak happens thats progress grandparents always used adhaar take money banks people know aeps adhaar enabled payment system takes biometric consent withdraw money useful tier rural india far privacy goes lol paytm youre using upidoesnt matter app ios android could know exactly last coordinate visit shop plus mobile number bank account details thats reason scared times every company knows remember enter upi pin sending money account",
    "light_cleaned_title": "Now Aadhar card can be used as ATM, even you can get money at your doorstep!!",
    "light_cleaned_selftext": "Now you can use your Aadhar as ATM for withdrawal of money from Aadhar linked Bank Account. Even money can be delivered at your doorstep through Dak Sewa/Postman.",
    "light_cleaned_comments": "Scammers finding out new ways to scam. Nice, now my bank details will also be leaked when the next mass adhar leak happens. Now that's progress ! My grandparents have always used adhaar to take out money from banks..! Do people not know about AEPS. Adhaar enabled payment system. It takes biometric as consent to withdraw money, very useful in tier 2,3 and rural India. As far as privacy goes, lol, I was at Paytm for a while, if you're using UPI,doesn't matter which app, iOS or Android, I could know exactly down to the last coordinate where you visit and shop from. Plus your mobile number, bank account details and more. But that's no reason to be scared in these times, every company knows this. Just remember if you have to enter your UPI pin, You are OR will be sending money OUT OF YOUR ACCOUNT"
}