{
    "id": "15u9kal",
    "title": "How do we know the theories or history lessons on social media are legit?",
    "url": "https://twitter.com/Starboy2079/status/1692115198621167969?s=20",
    "selftext": "I was going through twitter and noticed a thread. It's a big thread with so much information which no one knows basically. It's a narrative from 1900s with no sources but names.\n\nThis kind of information is circulated throughout social media. I am not sure if it is a legit information or just a propaganda. I want to understand how to fact check these posts.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1692331242.0,
    "convurl": "https://external-preview.redd.it/sgRIC7_1kTP1uBra1cPGgYjQnhxNBrA31WNiTedxojA.jpg?auto=webp&s=043dce3383b4b53c4ca5f56f0d0b2714ad893ba5",
    "comments": [
        "Simple rule - if they aren't from established people in academia, most likely they are elaborate conspiracy theories.",
        "So the theme of the thread is that Gandhi was a \"bad person.\"\n\nSome things there are fairly easily verifiable. Like:\n\n&nbsp;\n\n**Books**\n\nThe book by Ashwin Desai and Goolam Vahed exists. Both are legit academics and the book is published by Stanford Press, which means it has likely undergone fact checking and academic peer reviews.\n\nMost such academic books aren't accessible to ordinary folk like us. One must have access to the global library network via their university. But in this case, we're lucky because a pirated version's available on libgen.\n\nIn that book, they try to draw conclusions about Gandhi's racist attitudes towards the indigenous blacks of S.Africa using different pieces of evidence.\n\n&nbsp;\n\n**archive.org**\n\nOne evidence is Gandhi's Green Pamphlet manifesto which justified better treatment of Indians in S.Africa and which is available from archive.org: https://archive.org/search?query=green+pamphlet\n\nThere, he does cite the superior culture of [Brahmanism](https://ia800702.us.archive.org/21/items/dli.the-green-pamphlet/the-green-pamphlet.pdf) and India as reasons to not treat Indians on par with the blacks whom he calls Kaffirs. He says:\n\n> The\nimpression, which is but too prevalent both in the Transvaal and this Colony, that the quiet and altogether\ninoffensive 'Arab' shopkeeper, and the equally harmless Indian, who carries his pack of dainty wares from\nhouse to house, is a 'coolie', is due largely to an indolent ignorance as to the race whence they sprang. \n\n> When\none reflects that the conception of Brahminism, with its poetic and mysterious mythology, took its rise in the\nland of the 'coolie trader', that in that land, twenty-four centuries ago, the almost divine Buddha taught and\npractised the glorious doctrine of self-sacrifice, and that it was from the plains and mountains of that weird old\ncountry that are derived the fundamental truths of the very language we speak, **one cannot but help regretting\nthat the children of such a race should be treated as the equals of the children of black heathendom and outer\ndarkness.**\n\nSo those points are legit and we can say Gandhi revealed a racist attitude about the blacks. \n\nDid the attitude continue or did he redeem himself later? That kind of summary over time usually goes in a conclusion chapter toward the end. Indeed, in the last chapter and last paras, the authors conclude that he never changed his attitude and kept the struggle of Indians in SA separate from those of the blacks throughout.\n\n&nbsp;\n\n**Using AI for fact checking**\n\nBut such convenient conclusions aren't always available. In that case, some knowledge of coding and technology can be  useful. \n\nAI like GPT-4 are capable of analyzing and answering questions. So we can split up a book chapter wise using software like PDFBox and then use GPT-4 API to ask questions about each chapter like:\n\n> What does Gandhi say about blacks or \"kaffirs\" in this text extract:\n\nor \n\n> Does Gandhi say anything positive about blacks or \"kaffirs\" in this text extract:\n\n&nbsp;\n\n**Conspiracy theory**\n\nThe rest of the thread is all kinds of connections with Rhodes, Rothschild, Kallenbach, Bhagat Singh, homosexuality, Zionism. He tries to mesh possibly true factoids with a lot of weak speculations about intentions and mindsets through weak coincidences. \n\nSome factoids like the Blavatsky-Theosophical society influence have been theorized [elsewhere](https://theprint.in/opinion/woman-behind-fake-mahatmas-who-made-hume-set-up-congress/743425/)\n\nBut all the rest is weak associations and speculations which are quite characteristic of rightwing conspiracy theories to malign their ideological opponents. \n\nI wouldn't waste time fact checking those because coincidences don't always correlate with intentions. \n\n&nbsp;\n\n**Principle**\n\nFor understanding intentions, I mainly look for consistency in thought and actions. In this case, it's easy because Gandhi himself wrote about his thoughts and actions.",
        "If its on the specific topic, look up Prof. Vinay Lal's writings on Gandhi and black people. He is an academic historian unlike the twitter ones.",
        "Not specifically on one post but as a whole.",
        "ye banda solid wala pro-bjp hai \n\nkoi kuch bhi likhe lekin sach likho desh ke heet me kisi party ke heet me mat likho",
        "One can't know."
    ],
    "cleaned_text": "know theories history lessons social media legit going twitter noticed thread big thread much information one knows basically narrative sources names kind information circulated throughout social media sure legit information propaganda want understand fact check posts ",
    "cleaned_title": "know theories history lessons social media legit",
    "cleaned_selftext": "going twitter noticed thread big thread much information one knows basically narrative sources names kind information circulated throughout social media sure legit information propaganda want understand fact check posts",
    "cleaned_comments": "simple rule arent established people academia likely elaborate conspiracy theories theme thread gandhi bad person things fairly easily verifiable like nbsp books book ashwin desai goolam vahed exists legit academics book published stanford press means likely undergone fact checking academic peer reviews academic books arent accessible ordinary folk like us one must access global library network via university case lucky pirated versions available libgen book try draw conclusions gandhis racist attitudes towards indigenous blacks safrica using different pieces evidence nbsp archiveorg one evidence gandhis green pamphlet manifesto justified better treatment indians safrica available archiveorg cite superior culture brahmanismhttpsiausarchiveorgitemsdlithegreenpamphletthegreenpamphletpdf india reasons treat indians par blacks calls kaffirs says impression prevalent transvaal colony quiet altogether inoffensive arab shopkeeper equally harmless indian carries pack dainty wares house house coolie due largely indolent ignorance race whence sprang one reflects conception brahminism poetic mysterious mythology took rise land coolie trader land twentyfour centuries ago almost divine buddha taught practised glorious doctrine selfsacrifice plains mountains weird old country derived fundamental truths language speak one help regretting children race treated equals children black heathendom outer darkness points legit say gandhi revealed racist attitude blacks attitude continue redeem later kind summary time usually goes conclusion chapter toward end indeed last chapter last paras authors conclude never changed attitude kept struggle indians sa separate blacks throughout nbsp using ai fact checking convenient conclusions arent always available case knowledge coding technology useful ai like gpt capable analyzing answering questions split book chapter wise using software like pdfbox use gpt api ask questions chapter like gandhi say blacks kaffirs text extract gandhi say anything positive blacks kaffirs text extract nbsp conspiracy theory rest thread kinds connections rhodes rothschild kallenbach bhagat singh homosexuality zionism tries mesh possibly true factoids lot weak speculations intentions mindsets weak coincidences factoids like blavatskytheosophical society influence theorized elsewherehttpstheprintinopinionwomanbehindfakemahatmaswhomadehumesetupcongress rest weak associations speculations quite characteristic rightwing conspiracy theories malign ideological opponents wouldnt waste time fact checking coincidences dont always correlate intentions nbsp principle understanding intentions mainly look consistency thought actions case easy gandhi wrote thoughts actions specific topic look prof vinay lals writings gandhi black people academic historian unlike twitter ones specifically one post whole ye banda solid wala probjp hai koi kuch bhi likhe lekin sach likho desh ke heet kisi party ke heet mat likho one cant know",
    "light_cleaned_title": "How do we know the theories or history lessons on social media are legit?",
    "light_cleaned_selftext": "I was going through twitter and noticed a thread. It's a big thread with so much information which no one knows basically. It's a narrative from 1900s with no sources but names. This kind of information is circulated throughout social media. I am not sure if it is a legit information or just a propaganda. I want to understand how to fact check these posts.",
    "light_cleaned_comments": "Simple rule - if they aren't from established people in academia, most likely they are elaborate conspiracy theories. So the theme of the thread is that Gandhi was a \"bad person.\" Some things there are fairly easily verifiable. Like: &nbsp; **Books** The book by Ashwin Desai and Goolam Vahed exists. Both are legit academics and the book is published by Stanford Press, which means it has likely undergone fact checking and academic peer reviews. Most such academic books aren't accessible to ordinary folk like us. One must have access to the global library network via their university. But in this case, we're lucky because a pirated version's available on libgen. In that book, they try to draw conclusions about Gandhi's racist attitudes towards the indigenous blacks of S.Africa using different pieces of evidence. &nbsp; **archive.org** One evidence is Gandhi's Green Pamphlet manifesto which justified better treatment of Indians in S.Africa and which is available from archive.org: There, he does cite the superior culture of [Brahmanism](https://ia800702.us.archive.org/21/items/dli.the-green-pamphlet/the-green-pamphlet.pdf) and India as reasons to not treat Indians on par with the blacks whom he calls Kaffirs. He says: > The impression, which is but too prevalent both in the Transvaal and this Colony, that the quiet and altogether inoffensive 'Arab' shopkeeper, and the equally harmless Indian, who carries his pack of dainty wares from house to house, is a 'coolie', is due largely to an indolent ignorance as to the race whence they sprang. > When one reflects that the conception of Brahminism, with its poetic and mysterious mythology, took its rise in the land of the 'coolie trader', that in that land, twenty-four centuries ago, the almost divine Buddha taught and practised the glorious doctrine of self-sacrifice, and that it was from the plains and mountains of that weird old country that are derived the fundamental truths of the very language we speak, **one cannot but help regretting that the children of such a race should be treated as the equals of the children of black heathendom and outer darkness.** So those points are legit and we can say Gandhi revealed a racist attitude about the blacks. Did the attitude continue or did he redeem himself later? That kind of summary over time usually goes in a conclusion chapter toward the end. Indeed, in the last chapter and last paras, the authors conclude that he never changed his attitude and kept the struggle of Indians in SA separate from those of the blacks throughout. &nbsp; **Using AI for fact checking** But such convenient conclusions aren't always available. In that case, some knowledge of coding and technology can be useful. AI like GPT-4 are capable of analyzing and answering questions. So we can split up a book chapter wise using software like PDFBox and then use GPT-4 API to ask questions about each chapter like: > What does Gandhi say about blacks or \"kaffirs\" in this text extract: or > Does Gandhi say anything positive about blacks or \"kaffirs\" in this text extract: &nbsp; **Conspiracy theory** The rest of the thread is all kinds of connections with Rhodes, Rothschild, Kallenbach, Bhagat Singh, homosexuality, Zionism. He tries to mesh possibly true factoids with a lot of weak speculations about intentions and mindsets through weak coincidences. Some factoids like the Blavatsky-Theosophical society influence have been theorized [elsewhere](https://theprint.in/opinion/woman-behind-fake-mahatmas-who-made-hume-set-up-congress/743425/) But all the rest is weak associations and speculations which are quite characteristic of rightwing conspiracy theories to malign their ideological opponents. I wouldn't waste time fact checking those because coincidences don't always correlate with intentions. &nbsp; **Principle** For understanding intentions, I mainly look for consistency in thought and actions. In this case, it's easy because Gandhi himself wrote about his thoughts and actions. If its on the specific topic, look up Prof. Vinay Lal's writings on Gandhi and black people. He is an academic historian unlike the twitter ones. Not specifically on one post but as a whole. ye banda solid wala pro-bjp hai koi kuch bhi likhe lekin sach likho desh ke heet me kisi party ke heet me mat likho One can't know."
}