{
    "id": "14q2y9k",
    "title": "Supreme Court’s Constitution Bench to take up petitions challenging abrogation of special status under Article 370 on July 11",
    "url": "https://www.thehindu.com/news/national/supreme-courts-constitution-bench-to-take-up-petitions-challenging-abrogation-of-article-370-on-july-11/article67037736.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fsupreme-courts-constitution-bench-to-take-up-petitions-challenging-abrogation-of-article-370-on-july-11%2Farticle67037736.ece",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1688439570.0,
    "convurl": "https://external-preview.redd.it/JYJEUynmKm-MRGPyMUfWCyi7queQLhknqtGhATApwus.jpg?auto=webp&s=7e3a2f6b2bf1a9dcaf52e3e256cefa97ee61e74f",
    "comments": [
        ">The five-judge Bench, besides the CJI, would have Justices Sanjay Kishan Kaul, Sanjeev Khanna, B.R. Gavai and Surya Kant as Associate Judges. The five judges are the senior most in the court and also members of the Supreme Court Collegium. Justices Khanna, Gavai and Kant are in line to be CJIs as per seniority norm in the future.\n\nJustice Kaul will retire on December 25th this year",
        "It's already a fait accompli. The latter 3 judges are all quite pro-govt; most likely this bench will say there was nothing unconstitutional and ensure all future legal challenges are blocked. \n\nAnd in the highly unlikely event that the bench doesn't approve, Modi will simply pass an ordinance - or even a new law - anyway, overruling the SC just like he did in the Delhi case.\n\nSo there's only one final outcome out of all this.",
        "I'm guessing a EWS case like 2-3 split. And yes they'll reject any future challenges",
        "Wait a minute... That doesn't sound like a democracy."
    ],
    "cleaned_text": "supreme courts constitution bench take petitions challenging abrogation special status article july  ",
    "cleaned_title": "supreme courts constitution bench take petitions challenging abrogation special status article july",
    "cleaned_selftext": "",
    "cleaned_comments": "fivejudge bench besides cji would justices sanjay kishan kaul sanjeev khanna br gavai surya kant associate judges five judges senior court also members supreme court collegium justices khanna gavai kant line cjis per seniority norm future justice kaul retire december th year already fait accompli latter judges quite progovt likely bench say nothing unconstitutional ensure future legal challenges blocked highly unlikely event bench doesnt approve modi simply pass ordinance even new law anyway overruling sc like delhi case theres one final outcome im guessing ews case like split yes theyll reject future challenges wait minute doesnt sound like democracy",
    "light_cleaned_title": "Supreme Court’s Constitution Bench to take up petitions challenging abrogation of special status under Article 370 on July 11",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">The five-judge Bench, besides the CJI, would have Justices Sanjay Kishan Kaul, Sanjeev Khanna, B.R. Gavai and Surya Kant as Associate Judges. The five judges are the senior most in the court and also members of the Supreme Court Collegium. Justices Khanna, Gavai and Kant are in line to be CJIs as per seniority norm in the future. Justice Kaul will retire on December 25th this year It's already a fait accompli. The latter 3 judges are all quite pro-govt; most likely this bench will say there was nothing unconstitutional and ensure all future legal challenges are blocked. And in the highly unlikely event that the bench doesn't approve, Modi will simply pass an ordinance - or even a new law - anyway, overruling the SC just like he did in the Delhi case. So there's only one final outcome out of all this. I'm guessing a EWS case like 2-3 split. And yes they'll reject any future challenges Wait a minute... That doesn't sound like a democracy."
}