{
    "id": "138xvq4",
    "title": "Gaana plus Subscription Fraud by Gaana",
    "url": "https://www.reddit.com/r/india/comments/138xvq4/gaana_plus_subscription_fraud_by_gaana/",
    "selftext": "I subscribed for Gaana a year back, the yearly Gaana plus, I hardly use it now. So I wanted to unsubscribe and Cancel the plan but I am just not able to. Every time I try it shows message \"Cancellation fails\". Now money for another year is gone but I want to cancel plan soon so I don't have to face it again. Any idea who to contact? I have been writing emails to all IDs I get from search engines about this but no response so far.\n\n&#x200B;\n\nhttps://preview.redd.it/3vii8hy082ya1.png?width=1456&format=png&auto=webp&v=enabled&s=ff9684d10471630c3e419cdffa1d508c9bddf372",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 5,
    "created_utc": 1683312970.0,
    "convurl": "https://b.thumbs.redditmedia.com/rkeE1kLLmTwkSqHY8KlCuYABg6M6RIc-FrjjXUlpFYo.jpg",
    "comments": [
        "If you used credit card, you can check and Remove autopay mandates, if using upi, you can do the same",
        "Go to your netbanking account and cancel the mandate. After that they'll not be able to debit money.",
        "Support@gaana.com check privacy and TnC",
        "I did something for the next installments. I removed the account from Google Play store entirely. Because if I tried to remove the card from playstore it asked me to add another card if I want to remove this one. So basically I just deleted Google playstore account and made a new one."
    ],
    "cleaned_text": "gaana plus subscription fraud gaana subscribed gaana year back yearly gaana plus hardly use wanted unsubscribe cancel plan able every time try shows message cancellation fails money another year gone want cancel plan soon dont face idea contact writing emails ids get search engines response far xb ",
    "cleaned_title": "gaana plus subscription fraud gaana",
    "cleaned_selftext": "subscribed gaana year back yearly gaana plus hardly use wanted unsubscribe cancel plan able every time try shows message cancellation fails money another year gone want cancel plan soon dont face idea contact writing emails ids get search engines response far xb",
    "cleaned_comments": "used credit card check remove autopay mandates using upi go netbanking account cancel mandate theyll able debit money supportgaanacom check privacy tnc something next installments removed account google play store entirely tried remove card playstore asked add another card want remove one basically deleted google playstore account made new one",
    "light_cleaned_title": "Gaana plus Subscription Fraud by Gaana",
    "light_cleaned_selftext": "I subscribed for Gaana a year back, the yearly Gaana plus, I hardly use it now. So I wanted to unsubscribe and Cancel the plan but I am just not able to. Every time I try it shows message \"Cancellation fails\". Now money for another year is gone but I want to cancel plan soon so I don't have to face it again. Any idea who to contact? I have been writing emails to all IDs I get from search engines about this but no response so far. &#x200B;",
    "light_cleaned_comments": "If you used credit card, you can check and Remove autopay mandates, if using upi, you can do the same Go to your netbanking account and cancel the mandate. After that they'll not be able to debit money. Support@gaana.com check privacy and TnC I did something for the next installments. I removed the account from Google Play store entirely. Because if I tried to remove the card from playstore it asked me to add another card if I want to remove this one. So basically I just deleted Google playstore account and made a new one."
}