{
    "id": "1cwaeyy",
    "title": "A 17yo rich kid in Pune killed 2 people while drunk driving and got away with it in a day. People of pune need your help.",
    "url": "https://www.reddit.com/r/india/comments/1cwaeyy/a_17yo_rich_kid_in_pune_killed_2_people_while/",
    "selftext": "Last sunday, 19th May 2024, Anish Awadiya and Ashwini Koshta were struck and killed by Vedant Agarwal, 17, who was driving a Porshe Taycan (with no license plate) under the influence of alcohol. Vedant Agarwal is the son of well known builder Vishal Agarwal, the owner of Brahma Realty and Infrastructure. Due to his connections with the police and politicians, Vedant got out on bail in under a day. The lawyer representing him, Adv Prashant Patil, has been associated with the likes of people like Jacqueline Fernandez, Suraj Pancholi and many others.\n\nVedant, along with 2 of his friends were seen partying in nearby clubs in Kalyani Nagar. They returned to their car drunk at 3:15AM, and Vedant forced his driver to let him drive the car, even though the driver kept asking him to not do it. The Agarwal family is now trying to shift the blame on the innocent driver, making it look like he was the one who was driving when the accident took place. According to law, Vedants father too should be facing prosecution and jailtime.\n\nThe deceased, Anish and Ashwini, came from Madhya Pradesh in search of job opportunities and were working in IT companies. There is very little coverage about the victims and their backgrounds. Imagine what their families must be going through. Pune police has failed miserably in providing them justice.\n\nWe demand justice for the victims' families, and we refuse to let the influence of wealth and connections overshadow the gravity of this tragedy. We request you all to please share news regarding this story or this post on your social media handles. Twitter, Facebook, Linkedin, Whatsapp groups, anything works. Even though we have all lost faith in the local government, we can write letters to activists, police departments, and public representatives, and demand strict action. Protests have taken place in Kalyani Nagar and surrounding areas. People in the locality held a condolence meet for the victims' families too, but again there is very little coverage so they're struggling to make their voices heard. We can help by joining them or reposting tweets about them.\n\nSome news articles covering this story:\n\n[https://x.com/punekarnews/status/1792163897333653543](https://x.com/punekarnews/status/1792163897333653543)\n\n[https://www.aninews.in/news/national/general-news/juvenile-accused-in-pune-car-accident-granted-bail-with-conditions20240519222406/](https://www.aninews.in/news/national/general-news/juvenile-accused-in-pune-car-accident-granted-bail-with-conditions20240519222406/)\n\n[https://www.punekarnews.in/pune-was-minor-boy-saved-after-influential-intervention-in-fatal-porsche-accident-case/](https://www.punekarnews.in/pune-was-minor-boy-saved-after-influential-intervention-in-fatal-porsche-accident-case/)",
    "flair": "Crime",
    "score": 7720,
    "num_comments": 354,
    "created_utc": 1716193045.0,
    "convurl": "https://external-preview.redd.it/9ap3jKwtnE-jvIak33UTG303N0yWQwWYXuXO-PzXha4.jpg?auto=webp&s=617acc08ddc1a593bc0fd2e5e102b0009f70522a",
    "comments": [
        "He didn’t “get away with it”, he’s just on bail while the case is under investigation.\n\nBail has no effect on whether he’s convicted and  sentencing.",
        "He will get away with it, you really think he’s gonna get prosecuted the right way?",
        "Dude, if the accused has ability to hamper investigation or alter it course in any way then bail should be denied.",
        "I agree, but his influence is making police erase evidence about him, guaranteeing he or his family won't be getting prosecuted",
        "By this logic bail shouldn’t exist at all.",
        "Aaj ki sad reality. Bas paisa bolta h aur kuch nai. If you can have money you can practically get away with anything be it murder like this guy or Salman or anant ambani or manupulationg stock prices and destroying thousands of people like adani. This list can go on and on. Law, justice, order, government,judiciary everything is crippled in front of money. \nOnly thing having value in today's world is money and just money.",
        "Jail me daalo koi chote chode ko. You should not be allowed to get away with murder.",
        "Sure, and the courts decide whether there is a possibility of hampering or not. \n\nIf you want to say the courts are biased and corrupt, we can agree on that.\n\nBut I'm not sure in this case, if there is any probability of hampering of evidence",
        "All that money they earn, I hope they choke on it.",
        "Essay likhne ke liye suggest kar rahi hai police ise 🤡. Disgusting, log mar gaye aur nawabzade ko pharak hi nahi.",
        "Kyu itna tension le rahe ho jisko Jana tha wo chale gaye. Paisa kamao ayashi Karo aur khush raho kya Raha hai protest mai",
        "How can je be on bail umderage drunk driver",
        "This is culpable homiside",
        "Ha aur kal ye log hame aur hamare parivar valo ko uda denge tab kya kare?",
        "Isi liye to bolra hu powerful Bano baki tumhari marzi",
        "Sharing on multiple platforms or sub like Bangalore and major city we have some impact and no main stream are covering other then some pune pages and small news\nAdvice to share entire thing to all sub",
        "Same case happened few years back were father made shut all mouth with money but these it's not \nLet's work for justice",
        "Gang join Karlu?",
        "Yeah they are choking, someone else's mouth with that.",
        "Guys guys relax he’s just a child. Who knows if he has some kind of mental issues or depression ? Putting him inside the jail is just gonna kill another soul and also it’s not gonna solve anything . Let that kids father take care of the victims family . And the child who did the murder ,He’s gonna have lots of regrets right now and if he pulls through it then he can save a lot of life’s  and maybe one day he will save 100s of life’s .",
        "How do you know this? Did the DGP come and tell you personally?",
        "\"The police has put out a statement saying no alcohol was found in the blood sample of the boy\"\n\n\nAs if that made it ok to kill a person because you are speeding",
        "/s?",
        "i tried posting on r/mumbai and r/bangalore but they aren't approving the post for some reason",
        "How do you know? Did all the judges up to the SC come and inform you personally?",
        "I have posted check once in Bangalore sub",
        "I can confirm he won't be punished. I know this from years of living in Indian society. Also 3 DGPs came to my home thrice and told me personally.\n\nAny more of your \"questions\" I can help with?",
        "Ye judge, police aur politician sab ameero k dalle hai.",
        "A red hot iron rod must be inserted in both Vedant and his fucker dad's ass.",
        ">Putting him inside the jail is just gonna kill another soul\n\nYou're right, jail should be fun for people who kill others\n\n>Let that kids father take care of the victims family\n\nHe could have done that by raising a better kid rather than buying him a Porsche to go out drinking\n\n>And the child who did the murder ,He’s gonna have lots of regrets right now\n\nIs there any evidence he feels bad about it? A decent person would turn themselves in rather than get sprung out on bail by his rich dad\n\n>and if he pulls through it then he can save a lot of life’s and maybe one day he will save 100s of life’s .\n\nYes, rich people make the world a better place, sure bro",
        "Imagine a poor person killing someone and being let out on bail.",
        "You just jealous a dad got a 17 year old a Porsche",
        "Try him as an adult and send him to jail. Hope the dumbfuck parents also go to prison.",
        "That's usually what happens. He'll absolutely dip and leave the country. Imagine this was your family and the perp getting special treatment.",
        "Yeah he’ll travel to Germany now to meet another guy from Karnataka",
        "A rich kid in Ahmedabad killed like 10 people while driving. He's out free.",
        "He doesn't anyways. His parents do.",
        "this is a tragic case that highlights the injustice when wealth and conections can sway the legal system. it's appaling that the young man responsible was able to avoid proper punishment so easily. the victims' families must be devastaed, and it's important that their stories are not forgotten. i hope the social media campaign and protests can bring more attention to this case and pressure the authorities to deliver true justice.",
        "This shifting blame onto the drive premise is straight out of the book Age of Vice.",
        "Agreed man. Jailing is not enough. Should hang him when he turns 18. But it's still not enough as he claimed 2 lives but his life can only be claimed once.",
        "Dude… lmao 🤣",
        "Meanwhile court's punishment for the 17 yo criminal:\n\nWrite essay on accidents and serve with Pune police for 15 days.",
        "They will plant a driver in vehicle too in some time",
        "Mob shud have done the justice there itself.. Now the poolice is threatening the eyewitness also...",
        "10-15 years jail then hanging sounds good.",
        "If people like Modis causd 2002 event are roaming freely why cant a 17 year under aged guy ?",
        "He gave others mental issues so he shouldn't be allowed to pull through. We need to increase his mental issues by  putting him in jail and solitary confinement from time to time.",
        "Ahhhhh what a beautiful mindset no wonder the country is like this 😂",
        "People on Instagram taking the kids side saying stuff like \"bike Wale ki galti nhi dikhti\" or \"poor peoples are jealous\" \nWTF ?",
        "Well revenge is not just a Indian thing. If revenge sounds mean to you just call it returning the favour. 😄😄",
        "how is this related to blore?",
        "We the citizens, slog our asses off and pay taxes should speak up. Let's show these bastards our power. Please spread the word.",
        "Didn't a similar thing (albeit with no casualties) also happen with one of the Ambani kids?",
        "Also a soul for a soul would have finished the trade. But since the guy took two souls torturing his one is justified.",
        "Very mature of you",
        "Kaahe ka minor. 6 mahine me major ho jaega.",
        "Thanks for agreeing. As they say revenge does not bring back the dead but it makes living a little bit easier.",
        "Definitely 😂",
        "Now he will party in The US or any European country..",
        "Thanks for agreeing to the quote too.",
        "10-15 years means the dude can easily come out citing he has served a lot, why kill him and all.",
        "Of course 😂🤝",
        "Well if he has just taken one soul one could argue the trade was finished. But since he took two his also needs to be taken.",
        "really sad 💔",
        "Having a porsche doesn't make an already terrible person a better human being.",
        "Pune people need to walk out and vote this illegal government out. They can help themselves...",
        "cfbr\n\nI stand with the protest.",
        "Why the parents",
        "Probably bots",
        "You'll have to take revenge extrajudicially if you want him to pay. Highly unlikely he'll be convicted.",
        "That dickhead was given pizza, burger and royal treatment in the police station. Maybe, those officers in duty even have him bjs for a few pieces of meat.",
        "Link to the post on insta?",
        "Letting their underaged child use a vehicle (a supercar that too). Even if they have a LL they need to be under someone's supervision. The parents are equally responsible for this. Not to mention the children being exposed to alcohol (and definitely other narcotics).",
        "Because as a parents, you aren't supposed to give your kids let\n1) drive\n2) have alcohol before 18(21-25 in some states)",
        "Nah this mfr ain't getting away with this. Common man lives every fucking day in fear while these people have no fear even after killing innocents. An example needs to be set.",
        "The Indian Express\nMinor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy\n1 hour ago\n\nHindustan Times\nPune Porsche deaths: JJB bail order asks minor driver to write essay on accident\n5 hours ago\n\nNDTV\nCCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2\n31 minutes ago",
        "This is just failure of Indian justice system, times like these that kids needs to be careful showing his face in public...",
        "I suggest you reach out to r/st_broseph (a social worker and redditor from bangalore) if they have people in Pune who can help.",
        "The Indian Express\nMinor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy\n1 hour ago\n\nHindustan Times\nPune Porsche deaths: JJB bail order asks minor driver to write essay on accident\n5 hours ago\n\nNDTV\nCCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2\n31 minutes ago\n\nIt worked. They found evidence against him. They are interrogating restaurant owner and father for allowing under 18 to drink and giving car to kid, respectively.",
        "The Indian Express\nMinor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy\n1 hour ago\n\nHindustan Times\nPune Porsche deaths: JJB bail order asks minor driver to write essay on accident\n5 hours ago\n\nNDTV\nCCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2\n31 minutes ago\n\nIt worked. They found evidence against him. They are interrogating restaurant owner and father for allowing under 18 to drink and giving car to kid, respectively.",
        "but in this case, they had sent a driver with him, and the parents can always plead that they didn't know their son was drinking. ik they probably knew all that, but they can always lie they didn't and get themselves out of it",
        "Bots ?",
        "achhe din",
        "Then there's still non-plate car, probably on name of dad is used to drive on road. It's highly illegal too.",
        "Why does he look like he is 30?",
        "I hope the victims get justice, unlike in the Salman Khan and Ambani case.",
        "Yep, [happened with Akash Ambani](https://www.forbes.com/sites/naazneenkarmali/2014/01/02/the-curious-incident-of-mukesh-ambanis-aston-martin-in-the-night-time/?sh=3a0f084812c1) (nobody ended up dead fortunately).",
        "I saw a video on insta where people were destroying his car, and all the people in the comments section were like “Saale gareeb khud ko milti nahi tho dusro ki tod rahe hai”, like bro if it was any of your family member u would want to burn their whole house down",
        "I hope this news doesn't die out until justice is served. Don't let rich people get away with this.",
        "I think we need vigilante in our country.",
        "It's still their fault. It's their car and their child. Ultimately these are really irresponsible parents. Like who even decided to teach them how to drive to begin with? Fucking morons",
        "Lmao, as if all this will help😂😂",
        "Sounds like Ethan Couch",
        "And the movie/book “white tiger”",
        "Write a fucking essay wtf \n\nLike he just was caught driving drunk and even in that case he should be jailed for a min of 1 month",
        "Lol mil gaya uske ghar ka kutta",
        "Pune Car Accident Case: The juvenile accused who was arrested by Pune Police has been granted bail by the Juvenile Justice Board on certain conditions which include, the accused should work with the traffic police of Yerawada for 15 days, accused should write an essay on accident, should get treatment from the concerned doctor to help him quit drinking and should take psychiatric counselling and submit the report: Accused Advocate Prashant Patil",
        "Writing an essay should make it alright \n- the judge apparently\n\nLike wtf",
        "I hope people don't let him leave the country.",
        "wtf is wrong with you",
        "Are you that naive",
        "Pls try posting in r/chennai",
        "cfbr",
        "If you can't out bribe the police you got no shot. Hell starting a seeking justice might get the family of the victims blamed. India can be messed up sometimes",
        "With out luck it would end up being some religious fanatic. Oh wait, we actually have those. \n\nWhat we need are systemic changes which will take time and effort to bring about. Not as easy as wishing for someone operating outside judicial bounds, who for some reason won't go after the 'right' kind of people",
        "Man if I were the parents of the people that lost their lives I would make it my mission to hunt down this kid and give him what he deserves and if possible the dad as well. People like these do not deserve to exist.",
        "The Motor Vehicles Act, 1988 has been amended with a new Section 199 (A), which covers ‘offences by juveniles’.\n\nAccording to the latest amendment, the Court shall presume that the usage of the vehicle by the minor was done so with the full knowledge of the parent/guardian or the owner of the vehicle. Following this, the imprisonment sentence may extend up to 3 years along with a fine of up to Rs 25,000 for the guilty party. However, if the minor that has been caught possesses a learner’s permit (and is accompanied by an adult), this punishment will not apply.",
        "When the poor do mistakes: lock him up, he's a nuisance to society, he should not have a future, he should be put in jail immediately.\n\nWhen some rich kid does mistakes: oh but he's a boy from a good family, he has a future. We must help him learn from his mistakes and give him the help he needs. How about counselling and treatment?\n\n\nWho is giving counselling and treatment to the friends and family of the deceased?",
        "RIP to the deceased people and I hope justice is served as soon as possible.",
        "https://www.punekarnews.in/porsche-accident-pune-police-register-fir-against-cosie-blak-club-owners-and-minor-boys-father/",
        "Cross post, this is up a good ways on /r/all now",
        "Why would they test his blood then? Do they normally test the blood of passengers?",
        "Well, will you say the same for everyone else who is put under our legal system? How about those who did sexual abuse and such under the effects of alcohol? Or societal conditioning?\n\nIt's okay to study the causes and maybe try to bring about systemic change that benefits everyone. But saying this for someone with all that money and power is not in good taste and frankly, ignorant.",
        "I don't think that's the punishment, it's just phrasing, like he had to record a statement of the events.",
        "He was let out on bail and was just asked to write an essay!!! Tf even schools and colleges have more severe punishments than this .",
        "17 yr olds don't have driver's license. I'd pity the fool who got a Porsche as a handout from his dad.",
        "In India, judiciary is for rich people. Poor only suffer. It’s a bitter truth.",
        "Don't take him seriously,I do not take a person seriously who fking justifies two murders.",
        "Now are we going to let it be this way? This system that has been a bitter truth for our parents and grandparents and now us? Fuck it, if it applies to this kid, then it applies to the future generation too. Are we going to let it be a bitter truth?",
        "wealth seems to have a heavy hand in justice sometimes. reminds me of the gatsby scenario, just real life and much sadder. hope the families get the peace they deserve and the community keeps pushing for visibility.",
        "We all know what the outcome is going to be, the police don’t care, the courts won’t care and soon people will forget and won’t care.",
        "Most of the citizens want to change it, including me.",
        "Actually the whole system is for the rich and by the rich.",
        "What’s stopping a good old fashioned lynching?",
        "Because he must be drinking a lot since a younger age",
        "What type of hormones are they adding to alcohol in India?",
        "That's what 17yo looks like in India?\nDude looks 50",
        "They already did that....an NCP leader here has made this statement",
        "The White Tiger story in real life",
        "He got out in 15 hours!!  Just wanted to confirm the guy who gave the  17 year old a car and the pub that served alcohol for underage person are both doing well. They are not harmed by police or judiciary",
        "The only way is vigilantism.",
        "This is so enraging. There is no value for innocent lives in this country. Cops, Government & the fucking legal system only favors the one who has money. \n\nThe dialogue from Rang De Basanti is & will always remain true \"Yeh India hai India, yaha aisa hi hota aya hai & aisa hi hota rahega\".",
        "Ye to ameer bacchon ka right of passage hai, I’m surprised people are still surprised by these things, this is what our country is.",
        "This case like many other cases is a slap on the face of common people of this country where they are saying that the rich will do whatever they want, including killing common people and the entire ecosystem comprising of police, politicians and judges will not let anything happen to the rich. \n\nHad the rapists of Nirbhaya belonged to rich and influential families, police would have successfully proved that no rape happened.",
        "India 🤷",
        "They are not choking on it. They continue to live lavishly killing people directly and indirectly. Karma is dead",
        "He is out on bail and has to write an essay about accidents...Indian police and judiciary is a joke.",
        "https://youtube.com/shorts/gOH9wHM-UUw?si=GJRxr1n4yxfBxNps\nI am watching his channel from when is created he covers such news and finally he did\nNow right wing is taking part as opposition MLA involved in case",
        "Just take him out",
        "What power?",
        "Life is so very cheap in India, it makes me so sad & angry at the same time that 2 innocent people had to lose their lives because a stupid drunk spoilt brat didn't know how to drive properly \n\nI have no hopes from the justice system and politicians since they all have sold their conscience to greed of money\n\nOnly continued massive public outrage and protests can work in this situation",
        "He won’t get away with murder there so he is not. Only in India",
        "His dad is bigger culprit than him. His father deserves much more punishment. \n\nIf he had put some time learning his kid some values and ethics, he would become more responsible. Which father allows his kid to drink at 17?",
        "i know it is their fault, obviously. i said from a legal point of view and finding loopholes. there are no laws that say parents will go to jail if a child commits a mistake.",
        "In some time the story will become that the two deceased were at fault as they hit a pole and this Porsche just happened to be passing by. 😂 \nThe officers and the judiciary should collectively resign if they have a shred of integrity left. At least wear a dog leash if you’re going to be a pet to someone in power.",
        "Without alcohol - it is an accident.\nWith alcohol - it is murder.",
        "Real ID se aao selmon bhoi",
        "So you can actually test for Gamma-Glutamyl Transferase in the blood, which will stay elevated for much longer in the blood stream, especially after binge drinking. Unfortunately, it's not accurate enough to show that they were drinking in that moment.",
        "I misread r/India as r/Indiana and all I could think was \"Wow this is terrible but Indiana sure has a large Indian population! Haven't heard of Pune I wonder if it's primarily an immigrant community. It's still crazy that every single person involved is also Indian...wait...\"",
        "Although in reality, they'll continue to live comfortably for the rest of their lives, without ever having to worry about anything ever.",
        "They'd definitely find loopholes. But the vehicle belongs to them and they willingly left their child with it.",
        "When justice is subverted as a practice, mob justice becomes inevitable.\n\nThose helping Vedant Agarwal to evade punishment under the law invite him to face punishment at the hands of an angry mob. The law is safer.",
        "If a 17 year old is behaving like an adult then he should be punished like an adult.",
        "Oh classic case of money are the solution.",
        "Porsche taycan is not a supercar, it’s an EV",
        "Super car/high performance idk call it what you want.",
        "Then that makes it even worse 😕 that he was in full control of his senses and his reckless driving killed them. He should be tried as an adult and at a minimum manslaughter charges and the maximum years permissible under the (flawed) law.",
        "until people demonstrate in front of the judges house and name and shame him nothings going to change, and dont give the excuse that its the law, thousands of underage prisoners are made to rot in borstals and even adult prisons without bail for much lesser offences",
        "His pic is not available anywhere that’s the victim",
        "Good point.",
        "If the police arentampering with evidence it's going to be very difficult. Best of luck",
        "Badlapur movie comes to mind",
        "A co-worker of mine (in the US) is married to an Indian woman he met in college here. He's been to India multiple times to visit her family. He says that Indians have a completely different view of the value of human life than is generally held in the West - that only wealthy, accomplished Indians are considered 'valuable' and valued.",
        "Ummm rich and corrupt asf type",
        "Thats even more reason to arrest! He consciously drove over two ppl. Thats manslaughter. If nothing was wrong with the vehicle then was it intentional? He needs to go to prison regardless ",
        "Same kind who defend their murderer son. \n\n\nGood people dont defend mosnters. Blood on the ground is much thicker than blood in the veins and when blood is spilled and its clear who was wrong. Even parents need to know when you let justice take place. \n\n\nDefend your son appropriately give him the resources to survive prison if you feel obligation to your murderer child. But do not stand in the way of justice. Do not try to claim your child was innocent and shift blame onto others.",
        "Civil disobedience. Protesting on the streets. Not just one day, like the farmer's protests.",
        "Pune police and politicians are too corrupt!!",
        "So infuriating impunety",
        "Rich people don't 'earn' money. They make it off the backs of the poor.",
        "That's for charging a much trivial 304a(death by negligence) instead of 304 for culpable homicide not amounting to murder. \n\n304a is triable by magistrate court hence punishment will be much lesser and also its easier to get acquittal.\n\nI've seen this happen multiple times.",
        "I request people of Pune to put his face, his family's face, his alllll details in public. Atleast the face na!!!! ",
        "Enjoying your Ram Raj guys?",
        "Of course advocate “Patel” sold his soul for money that’s what they are known for anyways…. They will sell anything for money",
        "No, but we got to learn that apparently india is on the next stage of a two tier society.",
        "Any event of the police catching you, they will take you for medical check up. In case you claim that police tortured you.",
        "India is going down. It’ll take 100s of years of change in mentality of the public to be able to avoid such instances. Complaining or sharing anything online never works nowadays. \n\nIt’s nest to keep your head down and focus on earning more money.",
        "Sad to say but nothing will happen eventually. He will leave the country soon. Pune police is extremely corrupt and on the payroll of the few super powerful people like Vishal Agarwal, among others.",
        "Does it matter? It's enough to be pedantic but people have died, for all I care you could be driving a Maruti Suzuki, so long you don't violate 17 different sections of the IPC(rip)",
        "William Zanzinger",
        "What is drive premise",
        "Driving recklessly and overspeeding way beyond the speed limit also falls under involuntary manslaughter  and not accident.",
        "You can see how privilege works just by looking at their surname. Agarwal (Bania) gets away with mowing down poor migrants. Can't wait to hear how this rich brat gets his license reinstated in a few months.",
        "Indian legal and police system sparring no efforts in favoring the rich.",
        "[Study traffic rules, write essay on road accidents: Bail conditions for teen who killed two with Porsche](https://www.barandbench.com/news/bail-conditions-teen-killed-two-with-porsche)\n\nDude got away with a fcking essay.",
        "This needs to be higher up. It was just a matter of luck 10 years back tha no one got hurt. History will keep repeating itself every 10 years or sooner unless action is taken.",
        "Nothing is going to happen. A woman from a rich family plowed through an entire family including kids in broad daylight in pune and she got away Scot free.",
        "Human life has no value in India.",
        "Like the wrestler's protest?",
        "Good luck with it. We have the same thing in the US.\n\nRich or well-connected people can gt away with literally anything with no consequences and there is nothing anybody can do about it.",
        "If I remember correctly, there were casualties. \n\nYou wouldn't have news articles about a minor crash by Ambani's son unless they were pushed by his PR folks to divert attention from the real story.",
        "Why does he look like he's on his 40's?",
        "Link?",
        "\n>Due to his connections with the police and politicians, Vedant got out on bail in under a day.\n\nIs getting out on bail the same thing as getting away with a crime now?",
        "Lol, nothing is gonna happen \n\nPolice are just pretending to do their job to get a bigger payday from the builder father. Politician will just take money from the builder and suppress the case.",
        "The drunk kid shuld have died too cuz now hes out on bail and its a big fuck you to the victims who died and their family",
        "Please contact Morgan and Morgan attorneys at law. We will help you solve this predicament immediately.",
        "Victims families will get paid out and they will drop the case",
        "Rise up and fuck that Brahmin up.\n\nWhy do y'all let them do this to you?",
        "He is a minor, he wont be punsihed harshly, hardly a few months imprisonment. At max.",
        "In germany they start drinking at at 15 and the country is 10x safer than india",
        "Realistically what can I do to help bring justice? Awareness of this case? Protest?",
        "hey thanks for the lead, we're organising a protest as of right now so I'll get someone from the team to contact you",
        "Title is misleading, it should be spoiled kid of rich person. I really feel AI should take over humanity now. MOFOS need rational law implementation fully.",
        "Who is the vehicle registered to? I bet daddy’s company. Sue them as it’s a company vehicle",
        "Pune Police has become so shameful it is beyond our imagination. Of course they did not find any alcohol cause the test was done 12+ hours after the incident. He needs to be tried like an adult and the people of Pune and the country should not stop until the victims families have found justice. Builder kids are a true menace in this country and if they continue to get away with things this will never stop.",
        "That makes more sense.",
        "Reminds me of this incident - [https://www.youtube.com/watch?v=HuU1phIxxyY](https://www.youtube.com/watch?v=HuU1phIxxyY)\n\nNot that I am advocating anything here but...just.. a reference.",
        "Crime is there too\n\nThere's cartel , mafia and Russian gangs active there",
        "Protest should be outside the bramha reality office or their project sites",
        "Ja Na Ga … fucking money talks!",
        "Wtf. He has killed two people. This is not right.",
        "Banking my hopes on this case coming through. There's enough public wrath. The momentum shouldn't go though. If the investigation is airtight and the evidence is collected well enough, they have a good enough case at their hands. This boy should be behind bars.",
        "Whats wrong with vigilante justice here?",
        "[https://youtube.com/shorts/uhPzfae2N4A?feature=shared](https://youtube.com/shorts/uhPzfae2N4A?feature=shared)  \n\n# 17-yr old minor boy Son [#BrahmaRealty](https://www.youtube.com/hashtag/brahmarealty/shorts) chairman in [#pune](https://www.youtube.com/hashtag/pune/shorts) [#VedantAgarwal](https://www.youtube.com/hashtag/vedantagarwal/shorts) kills 2 people.",
        "Anyone got the CCTV footage of the pub/club where he was partying .. these evidences will be destroyed soon so if anyone in Pune can secure or release them  it willl help the case",
        "Everything about this case is wild. Look at the amount of crimes:\n\n1. Underage drinking\n2. Driving under the influence of alcohol\n3. Driving at over 200kmph\n4. Killing two innocent people\n5. Number plates removed from car immediately\n6. Mob beat the kid who was pulled out from the driver seat, yet they tried to claim the driver was at the wheel\n7. Special holiday court grants bail on a Sunday morning\n8. Blood alcohol sample tampered with\n9. Police orders pizza for the boy at the station\n10. Police claims they tried to charge him as an adult, and send him to jail awaiting trial but court said no, indicating court is paid off\n11. Criminal negligence by father allowing him to drive underage and go drinking\n\n\nThe list of crimes are endless. What the actual hell. I have never seen anything this blatant. We don't even know how many more crimes will they commit to save this murderous psychopath",
        "As well as his parents and if there is even a slight preferential treatment the police, the MLA Sunil Tingre should also be behind bars",
        "Already done. Lawyer is on national tv claiming there was a different driver.",
        "OP Fwiw please be careful when using the names of minors. It's probably fine on Reddit as long as your account follows the proper hygiene and can't be traced back to you.\n\n\n\n\nRich people have good lawyers and they can easily accuse you of harassing a minor.\n\n\n\n\nThe rich have always had a different judicial system to answer to, this true in India and the world. Thoughts and prayers with the family of the victims, Om Shanti. They're not going to get justice but maybe they're able to get adequate financial compensation, that's the best that we can hope for here.",
        "Read about Ethan Couch, same case as this. He got away too. Money matters even if you are living in Europe or usa",
        "This needs more visibility",
        "Don't undermine insta and Twitter people",
        "That can go either way depending on arguments. With alcohol it is confirmed.",
        "Come to India. Unparalelled beauty and wealth. Surrounded by a dump. Your blonde white female friends will be relentlessly groped, and everyone is trying to scam or rob you the entire time. Not to worry.. its just human feces every ten steps.\n\nReal talk I can't wait to never go back.",
        "Come to India. Unparalelled beauty and wealth. Surrounded by a dump. Your blonde white female friends will be relentlessly groped, and everyone is trying to scam or rob you the entire time. Whas",
        "Man they should really set some more laws regarding these driving related death scenarios. Set a precedent and prosecute according to that. No more non-malicious intent needs to be proved. Fuck these people seriously, same for the Tathya Patel incident. Prayers for the family who lost their young kids. Is there a gofundme page for them?",
        "Lol. Nothing new here. Most of such cases get settled out of court. \n\nThe one making the most noise gets paid to shut up. The police get paid to purposefully mishandle evidence.The defence lawyer gets paid to bribe the victim's families.\n\nSometimes the builder will \"donate\" to ruling parties to get the judge or public prosecutor a good position.\n\nAnd, finally the victim's family receives the least compensation, if at all.\n\nThe builder daddy is going to be paying crores in bribes. That's the best punishment he's going to get.",
        "If no alcohol has been found then why does he need to take counseling and write essays on quitting alcohol? \n\nFucking sold government and the whole system. There is no investment in shifting the mindset of the youth on NOT drinking and driving. In India it is considered uncool if the guy doesn’t drive after drinking. As if biology doesn’t affect their human bodies!!  The day when general public e.g. teenagers and youngsters will start seeing that drinking and driving is sheer irresponsible, then the change will come. It is already the case in the most developed countries.\n\nOh shit I just compared India to developed countries/ the west, and did the unthinkable!! Still, the people will find justification on how it is still ok within the Indian context..here we go..3,2,1.. 🙄",
        "Exactly!",
        "I believe he is just out on bail. The court case is still to take place. Please correct me if I'm wrong.",
        "Whicj insta post?",
        "Then gather a party and protest. Whats stopping ya",
        "This country's protesting instincts died long ago. Farmer's protest was one of its kind, the regime took more than one year to hear them, during which 700-800 farmers even died. The country is going downhill with just chestbeating and showpiece patriotism and jingoism. Actual public welfare, issues and protests have taken a backseat. \"Protest\" word itself has been demonised.(Remember andolanjeevi remarks from our PM himself, that too in parliament ffs) Goons have taken over, sane voices are not being acknowledged and also demonised. Intellectualism is being looked down upon. The junta has lost it's spine. Collective, cooperative and in sync voice from the public is a dream now for our country for, god knows, how many years in future.",
        "Has anyone observed that how did this guy got bail on sunday when the courts are closed.",
        "These things keep reminding of the illusion that is propagated to us that people are equal. No people are not equal infront of the law or society. We subconsciously value lives differently. It’s tragic. And I wish we had a better legal system. This kid is 17, so legally they can’t do anything to him. He shall face no consequences whatsoever. We don’t have a provision like the US where u can try a minor as an adult. The law will treat him as a juvenile and he will get away with this.",
        "Will do. Wanna join?",
        "Don’t let your country become another Russia.",
        "No, it was his WEALTH that made it okay for him to kill people. \n\nWelcome to capitalism",
        "The most corrupt of em all pune police no ethics nothing for a small amount of money they can change the case from murder to accidental",
        "Nah i aint living there. :)",
        "Well if he was accepted in any college in the US or UK, it will be revoked.",
        "Did they even do the test within 12hrs?",
        "I am actually more surprised that he didn't die at that speed, he and the driver beside him were uninjured.",
        "What kind of ideal world do you all live in? Anybody who loves someone else will always justify the other's action claiming baccha hai yeh bas ya aisi galti sabse hoti hai",
        "Share the video plz",
        "It's more about justice and maintaining law and order in society at large. If we let depressed kids get away with murders, what's next? School shootings? Law is not about one individual it's about whole society. If someone's allowed to get away with murders it's gonna make people lose trust in the whole system and soon it'll be anarchy.",
        "Who's the kid's father ?",
        "None. Alcohol itself is enough to cause the liver to stop digesting free radicals that cause ageing.",
        "No, if you love someone you wont let them commit evil in your families name.\n\nPeople justify their child, not because of love.\n\nThey justify because otherwise it brings shame to them.",
        "The whole system is flawed. I’m actually more scared when the cops are involved rather when they aren’t",
        "Can I just say he got a punishment of 15 days of service with yerwada traffic police and an sassy on accident. For killing 2 fucking people and running away for 1 km or so. Hit and run as well. That's all I have to say.",
        "Hope a high-profile lawyer takes this up as a PIL and fights for justice!",
        "He is the accused right? And this is manslaughter/accident investigation. So yes, they should test for alcohol and substances asap. Even for passengers. You don't know how the final investigation will unfold. Everyone present at the crime scene will likely have statements. And statements of drunk people would probably have lesser merit.",
        "Without licence its murder",
        "Salmon Bhoi ❤️",
        "insta and twitter “people”",
        "tbh I don’t see the issue at all. Good for the kid! His dad has done a lot to get where he is and he’s reaping the benefits. As for the dead people, it’s unfortunate, and avoidable. But it doesn’t matter that much.",
        "Even reddit these days",
        "How are 7., 9. and 10. Crimes?\n\nHe is a juvenile, court has every right to reject trying him as an adult.",
        "Only money talks in this country. Nothing else but money.",
        "Hopefully it's sarcasm",
        "I hate it how easily they got away with it , just because our police and  judiciary is on sale",
        "What's so shocking about this? This is how the system has been working. It will just continue like this. Money and background is always above law.",
        "They did 9. Ordering pizza to reduce his alcohol reading in the breathalyser",
        "This is a failure of society in general. Nobody cares. People will bow down to money and political power. Religion, morality, virtue etc are used only for patronizing.",
        "Poor human life*",
        "Where are the what about gang? What about the victims going out so late at night partying? \n\nRules are all hogwash and meant for the poor and powerless middle class and lower class",
        "https://x.com/incognito_qfs/status/1792761457781674076?s=46&t=mBnuGT4vnWbu-HKEJc6S-g\n\n\nPolice say that alcohol test is negative. But in this case he clearly is drinking alcohol. Now the lawyer will say like it was lemonade or water to defend him.\n\nRIP indian judiciary",
        "Bik gayi hai gormint",
        "I think everyone from pune should come on street to protest and demand his arrest. Imagine if a little religious/caste sentiments are heart a whole community comes up and floods the streets. Similar thing should happen to award the justice those two innocent souls deserve.",
        "Thing is there are pills that could remove alcohol content from blood.\n\nhttps://www.newindianexpress.com/states/kerala/2019/Aug/04/sriram-might-have-taken-pills-to-erase-alcohol-traces-in-blood-say-reports-2014181.html",
        "Power protects power. The people of Pune, now that ever before, have to take to the streets. **Only in unity, will Pune find it's justice**.",
        "It’s sad how everyone even in pune society is ignoring it and they are unfazed. Punishment was a comedy",
        "Enjoy Achhe din people!!!",
        "Ameer baap k bigadi hui nalayak aulaad",
        "what?",
        "You can do much more but that's not the point. They will tamper with the blood sample itself",
        "Means sayin, driver was driving the car.",
        "I heard some news in the morning that the Driver’s father has been arrested. Idk if thats true, any updates on this?",
        "My point is that his blood was drawn because he was the one driving.",
        "sadly, alot of ppl do... I'm the same age and in Pune, and I can assure you if I conduct a survey amongst ppl i know, I'd get more guys who drink than not.",
        "Paisa hai to badi badi baate :)",
        "That's patently wrong. Consuming pizza or any food after consuming drinks will not reduce BAC levels",
        "Maut se kamm saza kaise ho sakti hai aise logo ke liye?",
        "These are some reason I feel pathetic to be an Indian citizen. Obviously it will die out in no time.",
        "Accidents happen. People get killed in accidents. He wasn’t set out purposely to murder these people. Law has to take its own course. Why are you guys spewing mob mentality?",
        "Well drunk driver killing someone and a sober one killing someone have different sentences",
        "This is really disappointing and I have lost all faith in our joke judiciary and justice system. We all criticise our government all the time, but it’s high time we demand a change in our judiciary system which is favouring the rich and the powerful like this. Where is the justice? Can you believe it!? He killed two people, and was given a bail in few hours after writing a fucking essay.. wow.. will justice ever be served in this country?",
        "Are you really saying because they've made so much money, they should enjoy the benefits like running people over and walking out free?\nGod help this country, bootlicking the rich is in our veins",
        "I once happened to hit a drunk guy on motorbike on a road where he was driving without light. I stopped the car went on to check him a lot of people came to check on him. And that guy was in the influence of alcohol and it was no mistake of mine that I hit him luckily he only escaped with scratches and was not dead. You cannot completely deny the fact that people are now driving in the influence of alcohol at night whether they are middle class or rich.",
        "okay I’m not a bootlicker. Secondly, you have no idea how much I actually relate to that! I was driving when a guy I dislike (opp from school) decided to speed by my car and flip me off. I then got out of the car, my brother drove it, and we ended up crashing into the guy. He had a brain concussion and a few fractures etc, hospitalised for a few weeks, nothing too bad. \n\nMy dad’s connections with the local politicians and police got my brother (17) and I both out unscathed, no FIR filed, ruled off as accident.  It wasn’t our fault obviously but the circumstances were in a position to jeopardise our future (visa cancellation). So yeah I do think we should have exceptions made! If ur here to shit talk me, go speak to the wall",
        "It’s crazy how you’re judging me so quickly without even knowing me. r/India in a nutshell!",
        "Why is bar owner arrested if police couldn't find trace of alcohol in the boy's blood? 🤨",
        "Is there a goFundMe for the victim's families? They might need it for legal.\n\nI am not letting this one go.",
        "Kalyani nagar and Koregaon park is a hub of drunk driving....I have atleast seen 5-6 accidents there....Pune traffic is one of the most corrupt in the country",
        "Video of him drinking with his friends: https://x.com/i/status/1792758201680847016\n\nWhy tf did he got bail? Even that on a Sunday??\n1. He drank alcohol while being underage \n2. He was driving while being underage \n3. He was driving while being under the influence\n4. He killed 2 innocent souls!",
        "Sala Paisa hoto kya kya nahi ho sakta iss duniya Mai 😭",
        "Frankly these are the simple things that I never like to invest money in India. \n\n\nThe law is followed blindly and misinterpreted to benefit the rich and when it comes to the common man,\n\n\n laws are broken to oppress him.",
        "Law\n\nArrest the Driver and charge him for manslaughter. Jail him for 20-30 years\nArrest the Father for irresponsible guardianship for letting a minor drive the car. Jail him for 10 years\nLifetime financial support for both families that lost son/daughter. This should come from Perpetrators family fund. \nFine to the dealership to allow car to be driven without registration. Fine goes to the family\nCancel the dealership license for 5 years.\nArrest the Bar owner who served liquor to minor. \nCancel the license to sell liquor.\nFine the bar owner and Fine goes to the family \nFind these Juvenile Board members and Reprimand them.\nFix the laws of this country. Take UAE and Singapore as an example. ",
        "that’s not in people’s hands. Govt will ket him leave for free",
        "There's a blind man taking notes somewhere",
        "You are right my friend. A broken judicial system encourages vigilante justice.",
        "Perhaps he is also getting a diplomatic passport to go on a holiday.",
        "His blood was drawn because he's the accused as per the FIR.",
        "The kid should be punished, father at least 20 years",
        "\"If you are rich you can f*** the country\"",
        "There seems to be a video doing the rounds of Twitter which show the boy drinking in a bar with his friends.",
        "Yes, no shit, that was my point....",
        "Requesting everyone to reshare it.",
        "Bro, it sounds bad, but that’s one of the reason why I wanna be stinking rich",
        "Pretty certain that some driver will come forward to claim the responsibility for the accident.",
        "Your terminology was incorrect. It is hard for me to judge what you are trying to say if you use wrong words.",
        "It is actually worse that he killed two people in his full senses",
        "I think you just misunderstood the comment in context to the chain of comments above it. Somebody claimed it was their intent to accuse another person of being a driver. Yet from the start they tested the blood of this person which suggests that they are assuming he was the driver.",
        "The guy's 16",
        "The lawyer of the accused wants to spin a tale of who was actually driving. The police, even if they are in the pockets of this lawyer, will need to investigate the accused. If the police don't draw his blood, then the courts can punish them for not following procedure. The fact that the police followed procedure does not indicate if they are or aren't in the pockets.\n\nSecondly, let's assume the accused is guilty and the lawyer wants to get him out. He wants the blood tested to forge it and help his case. I believe your point comes from this scenario. But even then, one cannot assume he is guilty. Because Even a non guilty party will try their best to gather evidence. \n\nSo neither the police nor the lawyers actions suggest anything from this blood draw.",
        "Hats off to our so called justice system… only because he is from a rich family he is writing essay.. he killed 2 people.. bhai law sbke ke liye same hona chiye.. but ye incident ke baad yahi dikhta ki law bhi bika skta hai.. hats off really clapping for our law…",
        "THEN THAT WILL BE A FUCKIN MURDER",
        "they might be lying. policemen love to save rich kids’ ass.",
        "I hope ur never rich",
        "What ambani case?",
        "Don't forget the drunk state, driving under influence when he shouldn't be allowed to do either driving or drinking",
        "If a person kills someone sober that is okay?\nLife is so cheap?\n\nWhat about driving under age?",
        "Exactly. I rest my case.",
        "Curious to know - what did Anant Ambani do?",
        "Do u think protesting might help : my idea :💡 if there is any rich kid who is willing to help they can find out by bringing to concern persons and let know how he got away with that and bribing the same people to put that person in jail. Ps : This only for the rich kids whose concern is to bring justice.",
        "It makes it worse",
        "Did y'all watch Dhruv's new video?",
        "Salmon bhoi sends his regards"
    ],
    "cleaned_text": "yo rich kid pune killed people drunk driving got away day people pune need help last sunday th may anish awadiya ashwini koshta struck killed vedant agarwal driving porshe taycan license plate influence alcohol vedant agarwal son well known builder vishal agarwal owner brahma realty infrastructure due connections police politicians vedant got bail day lawyer representing adv prashant patil associated likes people like jacqueline fernandez suraj pancholi many others vedant along friends seen partying nearby clubs kalyani nagar returned car drunk vedant forced driver let drive car even though driver kept asking agarwal family trying shift blame innocent driver making look like one driving accident took place according law vedants father facing prosecution jailtime deceased anish ashwini came madhya pradesh search job opportunities working companies little coverage victims backgrounds imagine families must going pune police failed miserably providing justice demand justice victims families refuse let influence wealth connections overshadow gravity tragedy request please share news regarding story post social media handles twitter facebook linkedin whatsapp groups anything works even though lost faith local government write letters activists police departments public representatives demand strict action protests taken place kalyani nagar surrounding areas people locality held condolence meet victims families little coverage theyre struggling make voices heard help joining reposting tweets news articles covering story httpsxcompunekarnewsstatushttpsxcompunekarnewsstatus httpswwwaninewsinnewsnationalgeneralnewsjuvenileaccusedinpunecaraccidentgrantedbailwithconditionshttpswwwaninewsinnewsnationalgeneralnewsjuvenileaccusedinpunecaraccidentgrantedbailwithconditions httpswwwpunekarnewsinpunewasminorboysavedafterinfluentialinterventioninfatalporscheaccidentcasehttpswwwpunekarnewsinpunewasminorboysavedafterinfluentialinterventioninfatalporscheaccidentcase ",
    "cleaned_title": "yo rich kid pune killed people drunk driving got away day people pune need help",
    "cleaned_selftext": "last sunday th may anish awadiya ashwini koshta struck killed vedant agarwal driving porshe taycan license plate influence alcohol vedant agarwal son well known builder vishal agarwal owner brahma realty infrastructure due connections police politicians vedant got bail day lawyer representing adv prashant patil associated likes people like jacqueline fernandez suraj pancholi many others vedant along friends seen partying nearby clubs kalyani nagar returned car drunk vedant forced driver let drive car even though driver kept asking agarwal family trying shift blame innocent driver making look like one driving accident took place according law vedants father facing prosecution jailtime deceased anish ashwini came madhya pradesh search job opportunities working companies little coverage victims backgrounds imagine families must going pune police failed miserably providing justice demand justice victims families refuse let influence wealth connections overshadow gravity tragedy request please share news regarding story post social media handles twitter facebook linkedin whatsapp groups anything works even though lost faith local government write letters activists police departments public representatives demand strict action protests taken place kalyani nagar surrounding areas people locality held condolence meet victims families little coverage theyre struggling make voices heard help joining reposting tweets news articles covering story httpsxcompunekarnewsstatushttpsxcompunekarnewsstatus httpswwwaninewsinnewsnationalgeneralnewsjuvenileaccusedinpunecaraccidentgrantedbailwithconditionshttpswwwaninewsinnewsnationalgeneralnewsjuvenileaccusedinpunecaraccidentgrantedbailwithconditions httpswwwpunekarnewsinpunewasminorboysavedafterinfluentialinterventioninfatalporscheaccidentcasehttpswwwpunekarnewsinpunewasminorboysavedafterinfluentialinterventioninfatalporscheaccidentcase",
    "cleaned_comments": "didnt get away hes bail case investigation bail effect whether hes convicted sentencing get away really think hes gon na get prosecuted right way dude accused ability hamper investigation alter course way bail denied agree influence making police erase evidence guaranteeing family wont getting prosecuted logic bail shouldnt exist aaj ki sad reality bas paisa bolta h aur kuch nai money practically get away anything murder like guy salman anant ambani manupulationg stock prices destroying thousands people like adani list go law justice order governmentjudiciary everything crippled front money thing value todays world money money jail daalo koi chote chode ko allowed get away murder sure courts decide whether possibility hampering want say courts biased corrupt agree im sure case probability hampering evidence money earn hope choke essay likhne ke liye suggest kar rahi hai police ise disgusting log mar gaye aur nawabzade ko pharak hi nahi kyu itna tension le rahe ho jisko jana tha wo chale gaye paisa kamao ayashi karo aur khush raho kya raha hai protest mai je bail umderage drunk driver culpable homiside ha aur kal ye log hame aur hamare parivar valo ko uda denge tab kya kare isi liye bolra hu powerful bano baki tumhari marzi sharing multiple platforms sub like bangalore major city impact main stream covering pune pages small news advice share entire thing sub case happened years back father made shut mouth money lets work justice gang join karlu yeah choking someone elses mouth guys guys relax hes child knows kind mental issues depression putting inside jail gon na kill another soul also gon na solve anything let kids father take care victims family child murder hes gon na lots regrets right pulls save lot lifes maybe one day save lifes know dgp come tell personally police put statement saying alcohol found blood sample boy made ok kill person speeding tried posting rmumbai rbangalore arent approving post reason know judges sc come inform personally posted check bangalore sub confirm wont punished know years living indian society also dgps came home thrice told personally questions help ye judge police aur politician sab ameero k dalle hai red hot iron rod must inserted vedant fucker dads ass putting inside jail gon na kill another soul youre right jail fun people kill others let kids father take care victims family could done raising better kid rather buying porsche go drinking child murder hes gon na lots regrets right evidence feels bad decent person would turn rather get sprung bail rich dad pulls save lot lifes maybe one day save lifes yes rich people make world better place sure bro imagine poor person killing someone let bail jealous dad got year old porsche try adult send jail hope dumbfuck parents also go prison thats usually happens hell absolutely dip leave country imagine family perp getting special treatment yeah hell travel germany meet another guy karnataka rich kid ahmedabad killed like people driving hes free doesnt anyways parents tragic case highlights injustice wealth conections sway legal system appaling young man responsible able avoid proper punishment easily victims families must devastaed important stories forgotten hope social media campaign protests bring attention case pressure authorities deliver true justice shifting blame onto drive premise straight book age vice agreed man jailing enough hang turns still enough claimed lives life claimed dude lmao meanwhile courts punishment yo criminal write essay accidents serve pune police days plant driver vehicle time mob shud done justice poolice threatening eyewitness also years jail hanging sounds good people like modis causd event roaming freely cant year aged guy gave others mental issues shouldnt allowed pull need increase mental issues putting jail solitary confinement time time ahhhhh beautiful mindset wonder country like people instagram taking kids side saying stuff like bike wale ki galti nhi dikhti poor peoples jealous wtf well revenge indian thing revenge sounds mean call returning favour related blore citizens slog asses pay taxes speak lets show bastards power please spread word didnt similar thing albeit casualties also happen one ambani kids also soul soul would finished trade since guy took two souls torturing one justified mature kaahe ka minor mahine major ho jaega thanks agreeing say revenge bring back dead makes living little bit easier definitely party us european country thanks agreeing quote years means dude easily come citing served lot kill course well taken one soul one could argue trade finished since took two also needs taken really sad porsche doesnt make already terrible person better human pune people need walk vote illegal government help cfbr stand protest parents probably bots youll take revenge extrajudicially want pay highly unlikely hell convicted dickhead given pizza burger royal treatment police station maybe officers duty even bjs pieces meat link post insta letting underaged child use vehicle supercar even need someones supervision parents equally responsible mention children exposed alcohol definitely narcotics parents arent supposed give kids let drive alcohol states nah mfr aint getting away common man lives every fucking day fear people fear even killing innocents example needs set indian express minor drunk confirms police probe father aware drinking driving without license says boy hour ago hindustan times pune porsche deaths jjb bail order asks minor driver write essay accident hours ago ndtv cctv shows pune teen drinking pub porsche accident killed minutes ago failure indian justice system times like kids needs careful showing face public suggest reach rstbroseph social worker redditor bangalore people pune help indian express minor drunk confirms police probe father aware drinking driving without license says boy hour ago hindustan times pune porsche deaths jjb bail order asks minor driver write essay accident hours ago ndtv cctv shows pune teen drinking pub porsche accident killed minutes ago worked found evidence interrogating restaurant owner father allowing drink giving car kid respectively indian express minor drunk confirms police probe father aware drinking driving without license says boy hour ago hindustan times pune porsche deaths jjb bail order asks minor driver write essay accident hours ago ndtv cctv shows pune teen drinking pub porsche accident killed minutes ago worked found evidence interrogating restaurant owner father allowing drink giving car kid respectively case sent driver parents always plead didnt know son drinking ik probably knew always lie didnt get bots achhe din theres still nonplate car probably name dad used drive road highly illegal look like hope victims get justice unlike salman khan ambani case yep happened akash ambanihttpswwwforbescomsitesnaazneenkarmalithecuriousincidentofmukeshambanisastonmartininthenighttimeshafc nobody ended dead fortunately saw video insta people destroying car people comments section like saale gareeb khud ko milti nahi tho dusro ki tod rahe hai like bro family member u would want burn whole house hope news doesnt die justice served dont let rich people get away think need vigilante country still fault car child ultimately really irresponsible parents like even decided teach drive begin fucking morons lmao help sounds like ethan couch moviebook white tiger write fucking essay wtf like caught driving drunk even case jailed min month lol mil gaya uske ghar ka kutta pune car accident case juvenile accused arrested pune police granted bail juvenile justice board certain conditions include accused work traffic police yerawada days accused write essay accident get treatment concerned doctor help quit drinking take psychiatric counselling submit report accused advocate prashant patil writing essay make alright judge apparently like wtf hope people dont let leave country wtf wrong naive pls try posting rchennai cfbr cant bribe police got shot hell starting seeking justice might get family victims blamed india messed sometimes luck would end religious fanatic oh wait actually need systemic changes take time effort bring easy wishing someone operating outside judicial bounds reason wont go right kind people man parents people lost lives would make mission hunt kid give deserves possible dad well people like deserve exist motor vehicles act amended new section covers offences juveniles according latest amendment court shall presume usage vehicle minor done full knowledge parentguardian owner vehicle following imprisonment sentence may extend years along fine rs guilty party however minor caught possesses learners permit accompanied adult punishment apply poor mistakes lock hes nuisance society future put jail immediately rich kid mistakes oh hes boy good family future must help learn mistakes give help needs counselling treatment giving counselling treatment friends family deceased rip deceased people hope justice served soon possible cross post good ways rall would test blood normally test blood passengers well say everyone else put legal system sexual abuse effects alcohol societal conditioning okay study causes maybe try bring systemic change benefits everyone saying someone money power good taste frankly ignorant dont think thats punishment phrasing like record statement events let bail asked write essay tf even schools colleges severe punishments yr olds dont drivers license id pity fool got porsche handout dad india judiciary rich people poor suffer bitter truth dont take seriouslyi take person seriously fking justifies two murders going let way system bitter truth parents grandparents us fuck applies kid applies future generation going let bitter truth wealth seems heavy hand justice sometimes reminds gatsby scenario real life much sadder hope families get peace deserve community keeps pushing visibility know outcome going police dont care courts wont care soon people forget wont care citizens want change including actually whole system rich rich whats stopping good old fashioned lynching must drinking lot since younger age type hormones adding alcohol india thats yo looks like india dude looks already thatan ncp leader made statement white tiger story real life got hours wanted confirm guy gave year old car pub served alcohol underage person well harmed police judiciary way vigilantism enraging value innocent lives country cops government fucking legal system favors one money dialogue rang de basanti always remain true yeh india hai india yaha aisa hi hota aya hai aisa hi hota rahega ye ameer bacchon ka right passage hai im surprised people still surprised things country case like many cases slap face common people country saying rich whatever want including killing common people entire ecosystem comprising police politicians judges let anything happen rich rapists nirbhaya belonged rich influential families police would successfully proved rape happened india choking continue live lavishly killing people directly indirectly karma dead bail write essay accidentsindian police judiciary joke watching channel created covers news finally right wing taking part opposition mla involved case take power life cheap india makes sad angry time innocent people lose lives stupid drunk spoilt brat didnt know drive properly hopes justice system politicians since sold conscience greed money continued massive public outrage protests work situation wont get away murder india dad bigger culprit father deserves much punishment put time learning kid values ethics would become responsible father allows kid drink know fault obviously said legal point view finding loopholes laws say parents go jail child commits mistake time story become two deceased fault hit pole porsche happened passing officers judiciary collectively resign shred integrity left least wear dog leash youre going pet someone power without alcohol accident alcohol murder real id se aao selmon bhoi actually test gammaglutamyl transferase blood stay elevated much longer blood stream especially binge drinking unfortunately accurate enough show drinking moment misread rindia rindiana could think wow terrible indiana sure large indian population havent heard pune wonder primarily immigrant community still crazy every single person involved also indianwait although reality theyll continue live comfortably rest lives without ever worry anything ever theyd definitely find loopholes vehicle belongs willingly left child justice subverted practice mob justice becomes inevitable helping vedant agarwal evade punishment law invite face punishment hands angry mob law safer year old behaving like adult punished like adult oh classic case money solution porsche taycan supercar ev super carhigh performance idk call want makes even worse full control senses reckless driving killed tried adult minimum manslaughter charges maximum years permissible flawed law people demonstrate front judges house name shame nothings going change dont give excuse law thousands underage prisoners made rot borstals even adult prisons without bail much lesser offences pic available anywhere thats victim good point police arentampering evidence going difficult best luck badlapur movie comes mind coworker mine us married indian woman met college hes india multiple times visit family says indians completely different view value human life generally held west wealthy accomplished indians considered valuable valued ummm rich corrupt asf type thats even reason arrest consciously drove two ppl thats manslaughter nothing wrong vehicle intentional needs go prison regardless kind defend murderer son good people dont defend mosnters blood ground much thicker blood veins blood spilled clear wrong even parents need know let justice take place defend son appropriately give resources survive prison feel obligation murderer child stand way justice try claim child innocent shift blame onto others civil disobedience protesting streets one day like farmers protests pune police politicians corrupt infuriating impunety rich people dont earn money make backs poor thats charging much trivial adeath negligence instead culpable homicide amounting murder triable magistrate court hence punishment much lesser also easier get acquittal ive seen happen multiple times request people pune put face familys face alllll details public atleast face na enjoying ram raj guys course advocate patel sold soul money thats known anyways sell anything money got learn apparently india next stage two tier society event police catching take medical check case claim police tortured india going itll take years change mentality public able avoid instances complaining sharing anything online never works nowadays nest keep head focus earning money sad say nothing happen eventually leave country soon pune police extremely corrupt payroll super powerful people like vishal agarwal among others matter enough pedantic people died care could driving maruti suzuki long dont violate different sections ipcrip william zanzinger drive premise driving recklessly overspeeding way beyond speed limit also falls involuntary manslaughter accident see privilege works looking surname agarwal bania gets away mowing poor migrants cant wait hear rich brat gets license reinstated months indian legal police system sparring efforts favoring rich study traffic rules write essay road accidents bail conditions teen killed two porschehttpswwwbarandbenchcomnewsbailconditionsteenkilledtwowithporsche dude got away fcking essay needs higher matter luck years back tha one got hurt history keep repeating every years sooner unless action taken nothing going happen woman rich family plowed entire family including kids broad daylight pune got away scot free human life value india like wrestlers protest good luck thing us rich wellconnected people gt away literally anything consequences nothing anybody remember correctly casualties wouldnt news articles minor crash ambanis son unless pushed pr folks divert attention real story look like hes link due connections police politicians vedant got bail day getting bail thing getting away crime lol nothing gon na happen police pretending job get bigger payday builder father politician take money builder suppress case drunk kid shuld died cuz hes bail big fuck victims died family please contact morgan morgan attorneys law help solve predicament immediately victims families get paid drop case rise fuck brahmin yall let minor wont punsihed harshly hardly months imprisonment max germany start drinking country x safer india realistically help bring justice awareness case protest hey thanks lead organising protest right ill get someone team contact title misleading spoiled kid rich person really feel ai take humanity mofos need rational law implementation fully vehicle registered bet daddys company sue company vehicle pune police become shameful beyond imagination course find alcohol cause test done hours incident needs tried like adult people pune country stop victims families found justice builder kids true menace country continue get away things never stop makes sense reminds incident httpswwwyoutubecomwatchvhuuphixxyyhttpswwwyoutubecomwatchvhuuphixxyy advocating anything butjust reference crime theres cartel mafia russian gangs active protest outside bramha reality office project sites ja na ga fucking money talks wtf killed two people right banking hopes case coming theres enough public wrath momentum shouldnt go though investigation airtight evidence collected well enough good enough case hands boy behind bars whats wrong vigilante justice httpsyoutubecomshortsuhpzfaenafeaturesharedhttpsyoutubecomshortsuhpzfaenafeatureshared yr old minor boy son brahmarealtyhttpswwwyoutubecomhashtagbrahmarealtyshorts chairman punehttpswwwyoutubecomhashtagpuneshorts vedantagarwalhttpswwwyoutubecomhashtagvedantagarwalshorts kills people anyone got cctv footage pubclub partying evidences destroyed soon anyone pune secure release willl help case everything case wild look amount crimes underage drinking driving influence alcohol driving kmph killing two innocent people number plates removed car immediately mob beat kid pulled driver seat yet tried claim driver wheel special holiday court grants bail sunday morning blood alcohol sample tampered police orders pizza boy station police claims tried charge adult send jail awaiting trial court said indicating court paid criminal negligence father allowing drive underage go drinking list crimes endless actual hell never seen anything blatant dont even know many crimes commit save murderous psychopath well parents even slight preferential treatment police mla sunil tingre also behind bars already done lawyer national tv claiming different driver op fwiw please careful using names minors probably fine reddit long account follows proper hygiene cant traced back rich people good lawyers easily accuse harassing minor rich always different judicial system answer true india world thoughts prayers family victims om shanti theyre going get justice maybe theyre able get adequate financial compensation thats best hope read ethan couch case got away money matters even living europe usa needs visibility dont undermine insta twitter people go either way depending arguments alcohol confirmed come india unparalelled beauty wealth surrounded dump blonde white female friends relentlessly groped everyone trying scam rob entire time worry human feces every ten steps real talk cant wait never go back come india unparalelled beauty wealth surrounded dump blonde white female friends relentlessly groped everyone trying scam rob entire time whas man really set laws regarding driving related death scenarios set precedent prosecute according nonmalicious intent needs proved fuck people seriously tathya patel incident prayers family lost young kids gofundme page lol nothing new cases get settled court one making noise gets paid shut police get paid purposefully mishandle evidencethe defence lawyer gets paid bribe victims families sometimes builder donate ruling parties get judge public prosecutor good position finally victims family receives least compensation builder daddy going paying crores bribes thats best punishment hes going get alcohol found need take counseling write essays quitting alcohol fucking sold government whole system investment shifting mindset youth drinking driving india considered uncool guy doesnt drive drinking biology doesnt affect human bodies day general public eg teenagers youngsters start seeing drinking driving sheer irresponsible change come already case developed countries oh shit compared india developed countries west unthinkable still people find justification still ok within indian contexthere go exactly believe bail court case still take place please correct im wrong whicj insta post gather party protest whats stopping ya countrys protesting instincts died long ago farmers protest one kind regime took one year hear farmers even died country going downhill chestbeating showpiece patriotism jingoism actual public welfare issues protests taken backseat protest word demonisedremember andolanjeevi remarks pm parliament ffs goons taken sane voices acknowledged also demonised intellectualism looked upon junta lost spine collective cooperative sync voice public dream country god knows many years future anyone observed guy got bail sunday courts closed things keep reminding illusion propagated us people equal people equal infront law society subconsciously value lives differently tragic wish better legal system kid legally cant anything shall face consequences whatsoever dont provision like us u try minor adult law treat juvenile get away wan na join dont let country become another russia wealth made okay kill people welcome capitalism corrupt em pune police ethics nothing small amount money change case murder accidental nah aint living well accepted college us uk revoked even test within hrs actually surprised didnt die speed driver beside uninjured kind ideal world live anybody loves someone else always justify others action claiming baccha hai yeh bas ya aisi galti sabse hoti hai share video plz justice maintaining law order society large let depressed kids get away murders whats next school shootings law one individual whole society someones allowed get away murders gon na make people lose trust whole system soon itll anarchy whos kids father none alcohol enough cause liver stop digesting free radicals cause ageing love someone wont let commit evil families name people justify child love justify otherwise brings shame whole system flawed im actually scared cops involved rather arent say got punishment days service yerwada traffic police sassy accident killing fucking people running away km hit run well thats say hope highprofile lawyer takes pil fights justice accused right manslaughteraccident investigation yes test alcohol substances asap even passengers dont know final investigation unfold everyone present crime scene likely statements statements drunk people would probably lesser merit without licence murder salmon bhoi insta twitter people tbh dont see issue good kid dad done lot get hes reaping benefits dead people unfortunate avoidable doesnt matter much even reddit days crimes juvenile court every right reject trying adult money talks country nothing else money hopefully sarcasm hate easily got away police judiciary sale whats shocking system working continue like money background always law ordering pizza reduce alcohol reading breathalyser failure society general nobody cares people bow money political power religion morality virtue etc used patronizing poor human life gang victims going late night partying rules hogwash meant poor powerless middle class lower class police say alcohol test negative case clearly drinking alcohol lawyer say like lemonade water defend rip indian judiciary bik gayi hai gormint think everyone pune come street protest demand arrest imagine little religiouscaste sentiments heart whole community comes floods streets similar thing happen award justice two innocent souls deserve thing pills could remove alcohol content blood power protects power people pune ever take streets unity pune find justice sad everyone even pune society ignoring unfazed punishment comedy enjoy achhe din people ameer baap k bigadi hui nalayak aulaad much thats point tamper blood sample means sayin driver driving car heard news morning drivers father arrested idk thats true updates point blood drawn one driving sadly alot ppl im age pune assure conduct survey amongst ppl know id get guys drink paisa hai badi badi baate thats patently wrong consuming pizza food consuming drinks reduce bac levels maut se kamm saza kaise ho sakti hai aise logo ke liye reason feel pathetic indian citizen obviously die time accidents happen people get killed accidents wasnt set purposely murder people law take course guys spewing mob mentality well drunk driver killing someone sober one killing someone different sentences really disappointing lost faith joke judiciary justice system criticise government time high time demand change judiciary system favouring rich powerful like justice believe killed two people given bail hours writing fucking essay wow justice ever served country really saying theyve made much money enjoy benefits like running people walking free god help country bootlicking rich veins happened hit drunk guy motorbike road driving without light stopped car went check lot people came check guy influence alcohol mistake mine hit luckily escaped scratches dead completely deny fact people driving influence alcohol night whether middle class rich okay im bootlicker secondly idea much actually relate driving guy dislike opp school decided speed car flip got car brother drove ended crashing guy brain concussion fractures etc hospitalised weeks nothing bad dads connections local politicians police got brother unscathed fir filed ruled accident wasnt fault obviously circumstances position jeopardise future visa cancellation yeah think exceptions made ur shit talk go speak wall crazy youre judging quickly without even knowing rindia nutshell bar owner arrested police couldnt find trace alcohol boys blood gofundme victims families might need legal letting one go kalyani nagar koregaon park hub drunk drivingi atleast seen accidents therepune traffic one corrupt country video drinking friends tf got bail even sunday drank alcohol underage driving underage driving influence killed innocent souls sala paisa hoto kya kya nahi ho sakta iss duniya mai frankly simple things never like invest money india law followed blindly misinterpreted benefit rich comes common man laws broken oppress law arrest driver charge manslaughter jail years arrest father irresponsible guardianship letting minor drive car jail years lifetime financial support families lost sondaughter come perpetrators family fund fine dealership allow car driven without registration fine goes family cancel dealership license years arrest bar owner served liquor minor cancel license sell liquor fine bar owner fine goes family find juvenile board members reprimand fix laws country take uae singapore example thats peoples hands govt ket leave free theres blind man taking notes somewhere right friend broken judicial system encourages vigilante justice perhaps also getting diplomatic passport go holiday blood drawn hes accused per fir kid punished father least years rich f country seems video rounds twitter show boy drinking bar friends yes shit point requesting everyone reshare bro sounds bad thats one reason wan na stinking rich pretty certain driver come forward claim responsibility accident terminology incorrect hard judge trying say use wrong words actually worse killed two people full senses think misunderstood comment context chain comments somebody claimed intent accuse another person driver yet start tested blood person suggests assuming driver guys lawyer accused wants spin tale actually driving police even pockets lawyer need investigate accused police dont draw blood courts punish following procedure fact police followed procedure indicate arent pockets secondly lets assume accused guilty lawyer wants get wants blood tested forge help case believe point comes scenario even one assume guilty even non guilty party try best gather evidence neither police lawyers actions suggest anything blood draw hats called justice system rich family writing essay killed people bhai law sbke ke liye hona chiye ye incident ke baad yahi dikhta ki law bhi bika skta hai hats really clapping law fuckin murder might lying policemen love save rich kids ass hope ur never rich ambani case dont forget drunk state driving influence shouldnt allowed either driving drinking person kills someone sober okay life cheap driving age exactly rest case curious know anant ambani u think protesting might help idea rich kid willing help find bringing concern persons let know got away bribing people put person jail ps rich kids whose concern bring justice makes worse yall watch dhruvs new video salmon bhoi sends regards",
    "light_cleaned_title": "A 17yo rich kid in Pune killed 2 people while drunk driving and got away with it in a day. People of pune need your help.",
    "light_cleaned_selftext": "Last sunday, 19th May 2024, Anish Awadiya and Ashwini Koshta were struck and killed by Vedant Agarwal, 17, who was driving a Porshe Taycan (with no license plate) under the influence of alcohol. Vedant Agarwal is the son of well known builder Vishal Agarwal, the owner of Brahma Realty and Infrastructure. Due to his connections with the police and politicians, Vedant got out on bail in under a day. The lawyer representing him, Adv Prashant Patil, has been associated with the likes of people like Jacqueline Fernandez, Suraj Pancholi and many others. Vedant, along with 2 of his friends were seen partying in nearby clubs in Kalyani Nagar. They returned to their car drunk at 3:15AM, and Vedant forced his driver to let him drive the car, even though the driver kept asking him to not do it. The Agarwal family is now trying to shift the blame on the innocent driver, making it look like he was the one who was driving when the accident took place. According to law, Vedants father too should be facing prosecution and jailtime. The deceased, Anish and Ashwini, came from Madhya Pradesh in search of job opportunities and were working in IT companies. There is very little coverage about the victims and their backgrounds. Imagine what their families must be going through. Pune police has failed miserably in providing them justice. We demand justice for the victims' families, and we refuse to let the influence of wealth and connections overshadow the gravity of this tragedy. We request you all to please share news regarding this story or this post on your social media handles. Twitter, Facebook, Linkedin, Whatsapp groups, anything works. Even though we have all lost faith in the local government, we can write letters to activists, police departments, and public representatives, and demand strict action. Protests have taken place in Kalyani Nagar and surrounding areas. People in the locality held a condolence meet for the victims' families too, but again there is very little coverage so they're struggling to make their voices heard. We can help by joining them or reposting tweets about them. Some news articles covering this story: [https://x.com/punekarnews/status/1792163897333653543](https://x.com/punekarnews/status/1792163897333653543) [https://www.aninews.in/news/national/general-news/juvenile-accused-in-pune-car-accident-granted-bail-with-conditions20240519222406/](https://www.aninews.in/news/national/general-news/juvenile-accused-in-pune-car-accident-granted-bail-with-conditions20240519222406/) [https://www.punekarnews.in/pune-was-minor-boy-saved-after-influential-intervention-in-fatal-porsche-accident-case/](https://www.punekarnews.in/pune-was-minor-boy-saved-after-influential-intervention-in-fatal-porsche-accident-case/)",
    "light_cleaned_comments": "He didn’t “get away with it”, he’s just on bail while the case is under investigation. Bail has no effect on whether he’s convicted and sentencing. He will get away with it, you really think he’s gonna get prosecuted the right way? Dude, if the accused has ability to hamper investigation or alter it course in any way then bail should be denied. I agree, but his influence is making police erase evidence about him, guaranteeing he or his family won't be getting prosecuted By this logic bail shouldn’t exist at all. Aaj ki sad reality. Bas paisa bolta h aur kuch nai. If you can have money you can practically get away with anything be it murder like this guy or Salman or anant ambani or manupulationg stock prices and destroying thousands of people like adani. This list can go on and on. Law, justice, order, government,judiciary everything is crippled in front of money. Only thing having value in today's world is money and just money. Jail me daalo koi chote chode ko. You should not be allowed to get away with murder. Sure, and the courts decide whether there is a possibility of hampering or not. If you want to say the courts are biased and corrupt, we can agree on that. But I'm not sure in this case, if there is any probability of hampering of evidence All that money they earn, I hope they choke on it. Essay likhne ke liye suggest kar rahi hai police ise 🤡. Disgusting, log mar gaye aur nawabzade ko pharak hi nahi. Kyu itna tension le rahe ho jisko Jana tha wo chale gaye. Paisa kamao ayashi Karo aur khush raho kya Raha hai protest mai How can je be on bail umderage drunk driver This is culpable homiside Ha aur kal ye log hame aur hamare parivar valo ko uda denge tab kya kare? Isi liye to bolra hu powerful Bano baki tumhari marzi Sharing on multiple platforms or sub like Bangalore and major city we have some impact and no main stream are covering other then some pune pages and small news Advice to share entire thing to all sub Same case happened few years back were father made shut all mouth with money but these it's not Let's work for justice Gang join Karlu? Yeah they are choking, someone else's mouth with that. Guys guys relax he’s just a child. Who knows if he has some kind of mental issues or depression ? Putting him inside the jail is just gonna kill another soul and also it’s not gonna solve anything . Let that kids father take care of the victims family . And the child who did the murder ,He’s gonna have lots of regrets right now and if he pulls through it then he can save a lot of life’s and maybe one day he will save 100s of life’s . How do you know this? Did the DGP come and tell you personally? \"The police has put out a statement saying no alcohol was found in the blood sample of the boy\" As if that made it ok to kill a person because you are speeding /s? i tried posting on r/mumbai and r/bangalore but they aren't approving the post for some reason How do you know? Did all the judges up to the SC come and inform you personally? I have posted check once in Bangalore sub I can confirm he won't be punished. I know this from years of living in Indian society. Also 3 DGPs came to my home thrice and told me personally. Any more of your \"questions\" I can help with? Ye judge, police aur politician sab ameero k dalle hai. A red hot iron rod must be inserted in both Vedant and his fucker dad's ass. >Putting him inside the jail is just gonna kill another soul You're right, jail should be fun for people who kill others >Let that kids father take care of the victims family He could have done that by raising a better kid rather than buying him a Porsche to go out drinking >And the child who did the murder ,He’s gonna have lots of regrets right now Is there any evidence he feels bad about it? A decent person would turn themselves in rather than get sprung out on bail by his rich dad >and if he pulls through it then he can save a lot of life’s and maybe one day he will save 100s of life’s . Yes, rich people make the world a better place, sure bro Imagine a poor person killing someone and being let out on bail. You just jealous a dad got a 17 year old a Porsche Try him as an adult and send him to jail. Hope the dumbfuck parents also go to prison. That's usually what happens. He'll absolutely dip and leave the country. Imagine this was your family and the perp getting special treatment. Yeah he’ll travel to Germany now to meet another guy from Karnataka A rich kid in Ahmedabad killed like 10 people while driving. He's out free. He doesn't anyways. His parents do. this is a tragic case that highlights the injustice when wealth and conections can sway the legal system. it's appaling that the young man responsible was able to avoid proper punishment so easily. the victims' families must be devastaed, and it's important that their stories are not forgotten. i hope the social media campaign and protests can bring more attention to this case and pressure the authorities to deliver true justice. This shifting blame onto the drive premise is straight out of the book Age of Vice. Agreed man. Jailing is not enough. Should hang him when he turns 18. But it's still not enough as he claimed 2 lives but his life can only be claimed once. Dude… lmao 🤣 Meanwhile court's punishment for the 17 yo criminal: Write essay on accidents and serve with Pune police for 15 days. They will plant a driver in vehicle too in some time Mob shud have done the justice there itself.. Now the poolice is threatening the eyewitness also... 10-15 years jail then hanging sounds good. If people like Modis causd 2002 event are roaming freely why cant a 17 year under aged guy ? He gave others mental issues so he shouldn't be allowed to pull through. We need to increase his mental issues by putting him in jail and solitary confinement from time to time. Ahhhhh what a beautiful mindset no wonder the country is like this 😂 People on Instagram taking the kids side saying stuff like \"bike Wale ki galti nhi dikhti\" or \"poor peoples are jealous\" WTF ? Well revenge is not just a Indian thing. If revenge sounds mean to you just call it returning the favour. 😄😄 how is this related to blore? We the citizens, slog our asses off and pay taxes should speak up. Let's show these bastards our power. Please spread the word. Didn't a similar thing (albeit with no casualties) also happen with one of the Ambani kids? Also a soul for a soul would have finished the trade. But since the guy took two souls torturing his one is justified. Very mature of you Kaahe ka minor. 6 mahine me major ho jaega. Thanks for agreeing. As they say revenge does not bring back the dead but it makes living a little bit easier. Definitely 😂 Now he will party in The US or any European country.. Thanks for agreeing to the quote too. 10-15 years means the dude can easily come out citing he has served a lot, why kill him and all. Of course 😂🤝 Well if he has just taken one soul one could argue the trade was finished. But since he took two his also needs to be taken. really sad 💔 Having a porsche doesn't make an already terrible person a better human being. Pune people need to walk out and vote this illegal government out. They can help themselves... cfbr I stand with the protest. Why the parents Probably bots You'll have to take revenge extrajudicially if you want him to pay. Highly unlikely he'll be convicted. That dickhead was given pizza, burger and royal treatment in the police station. Maybe, those officers in duty even have him bjs for a few pieces of meat. Link to the post on insta? Letting their underaged child use a vehicle (a supercar that too). Even if they have a LL they need to be under someone's supervision. The parents are equally responsible for this. Not to mention the children being exposed to alcohol (and definitely other narcotics). Because as a parents, you aren't supposed to give your kids let 1) drive 2) have alcohol before 18(21-25 in some states) Nah this mfr ain't getting away with this. Common man lives every fucking day in fear while these people have no fear even after killing innocents. An example needs to be set. The Indian Express Minor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy 1 hour ago Hindustan Times Pune Porsche deaths: JJB bail order asks minor driver to write essay on accident 5 hours ago NDTV CCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2 31 minutes ago This is just failure of Indian justice system, times like these that kids needs to be careful showing his face in public... I suggest you reach out to r/st_broseph (a social worker and redditor from bangalore) if they have people in Pune who can help. The Indian Express Minor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy 1 hour ago Hindustan Times Pune Porsche deaths: JJB bail order asks minor driver to write essay on accident 5 hours ago NDTV CCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2 31 minutes ago It worked. They found evidence against him. They are interrogating restaurant owner and father for allowing under 18 to drink and giving car to kid, respectively. The Indian Express Minor was drunk, confirms police probe; ‘Father was aware I was drinking, driving without license,’ says boy 1 hour ago Hindustan Times Pune Porsche deaths: JJB bail order asks minor driver to write essay on accident 5 hours ago NDTV CCTV Shows Pune Teen Drinking In Pub Before Porsche Accident That Killed 2 31 minutes ago It worked. They found evidence against him. They are interrogating restaurant owner and father for allowing under 18 to drink and giving car to kid, respectively. but in this case, they had sent a driver with him, and the parents can always plead that they didn't know their son was drinking. ik they probably knew all that, but they can always lie they didn't and get themselves out of it Bots ? achhe din Then there's still non-plate car, probably on name of dad is used to drive on road. It's highly illegal too. Why does he look like he is 30? I hope the victims get justice, unlike in the Salman Khan and Ambani case. Yep, [happened with Akash Ambani](https://www.forbes.com/sites/naazneenkarmali/2014/01/02/the-curious-incident-of-mukesh-ambanis-aston-martin-in-the-night-time/?sh=3a0f084812c1) (nobody ended up dead fortunately). I saw a video on insta where people were destroying his car, and all the people in the comments section were like “Saale gareeb khud ko milti nahi tho dusro ki tod rahe hai”, like bro if it was any of your family member u would want to burn their whole house down I hope this news doesn't die out until justice is served. Don't let rich people get away with this. I think we need vigilante in our country. It's still their fault. It's their car and their child. Ultimately these are really irresponsible parents. Like who even decided to teach them how to drive to begin with? Fucking morons Lmao, as if all this will help😂😂 Sounds like Ethan Couch And the movie/book “white tiger” Write a fucking essay wtf Like he just was caught driving drunk and even in that case he should be jailed for a min of 1 month Lol mil gaya uske ghar ka kutta Pune Car Accident Case: The juvenile accused who was arrested by Pune Police has been granted bail by the Juvenile Justice Board on certain conditions which include, the accused should work with the traffic police of Yerawada for 15 days, accused should write an essay on accident, should get treatment from the concerned doctor to help him quit drinking and should take psychiatric counselling and submit the report: Accused Advocate Prashant Patil Writing an essay should make it alright - the judge apparently Like wtf I hope people don't let him leave the country. wtf is wrong with you Are you that naive Pls try posting in r/chennai cfbr If you can't out bribe the police you got no shot. Hell starting a seeking justice might get the family of the victims blamed. India can be messed up sometimes With out luck it would end up being some religious fanatic. Oh wait, we actually have those. What we need are systemic changes which will take time and effort to bring about. Not as easy as wishing for someone operating outside judicial bounds, who for some reason won't go after the 'right' kind of people Man if I were the parents of the people that lost their lives I would make it my mission to hunt down this kid and give him what he deserves and if possible the dad as well. People like these do not deserve to exist. The Motor Vehicles Act, 1988 has been amended with a new Section 199 (A), which covers ‘offences by juveniles’. According to the latest amendment, the Court shall presume that the usage of the vehicle by the minor was done so with the full knowledge of the parent/guardian or the owner of the vehicle. Following this, the imprisonment sentence may extend up to 3 years along with a fine of up to Rs 25,000 for the guilty party. However, if the minor that has been caught possesses a learner’s permit (and is accompanied by an adult), this punishment will not apply. When the poor do mistakes: lock him up, he's a nuisance to society, he should not have a future, he should be put in jail immediately. When some rich kid does mistakes: oh but he's a boy from a good family, he has a future. We must help him learn from his mistakes and give him the help he needs. How about counselling and treatment? Who is giving counselling and treatment to the friends and family of the deceased? RIP to the deceased people and I hope justice is served as soon as possible. Cross post, this is up a good ways on /r/all now Why would they test his blood then? Do they normally test the blood of passengers? Well, will you say the same for everyone else who is put under our legal system? How about those who did sexual abuse and such under the effects of alcohol? Or societal conditioning? It's okay to study the causes and maybe try to bring about systemic change that benefits everyone. But saying this for someone with all that money and power is not in good taste and frankly, ignorant. I don't think that's the punishment, it's just phrasing, like he had to record a statement of the events. He was let out on bail and was just asked to write an essay!!! Tf even schools and colleges have more severe punishments than this . 17 yr olds don't have driver's license. I'd pity the fool who got a Porsche as a handout from his dad. In India, judiciary is for rich people. Poor only suffer. It’s a bitter truth. Don't take him seriously,I do not take a person seriously who fking justifies two murders. Now are we going to let it be this way? This system that has been a bitter truth for our parents and grandparents and now us? Fuck it, if it applies to this kid, then it applies to the future generation too. Are we going to let it be a bitter truth? wealth seems to have a heavy hand in justice sometimes. reminds me of the gatsby scenario, just real life and much sadder. hope the families get the peace they deserve and the community keeps pushing for visibility. We all know what the outcome is going to be, the police don’t care, the courts won’t care and soon people will forget and won’t care. Most of the citizens want to change it, including me. Actually the whole system is for the rich and by the rich. What’s stopping a good old fashioned lynching? Because he must be drinking a lot since a younger age What type of hormones are they adding to alcohol in India? That's what 17yo looks like in India? Dude looks 50 They already did that....an NCP leader here has made this statement The White Tiger story in real life He got out in 15 hours!! Just wanted to confirm the guy who gave the 17 year old a car and the pub that served alcohol for underage person are both doing well. They are not harmed by police or judiciary The only way is vigilantism. This is so enraging. There is no value for innocent lives in this country. Cops, Government & the fucking legal system only favors the one who has money. The dialogue from Rang De Basanti is & will always remain true \"Yeh India hai India, yaha aisa hi hota aya hai & aisa hi hota rahega\". Ye to ameer bacchon ka right of passage hai, I’m surprised people are still surprised by these things, this is what our country is. This case like many other cases is a slap on the face of common people of this country where they are saying that the rich will do whatever they want, including killing common people and the entire ecosystem comprising of police, politicians and judges will not let anything happen to the rich. Had the rapists of Nirbhaya belonged to rich and influential families, police would have successfully proved that no rape happened. India 🤷 They are not choking on it. They continue to live lavishly killing people directly and indirectly. Karma is dead He is out on bail and has to write an essay about accidents...Indian police and judiciary is a joke. I am watching his channel from when is created he covers such news and finally he did Now right wing is taking part as opposition MLA involved in case Just take him out What power? Life is so very cheap in India, it makes me so sad & angry at the same time that 2 innocent people had to lose their lives because a stupid drunk spoilt brat didn't know how to drive properly I have no hopes from the justice system and politicians since they all have sold their conscience to greed of money Only continued massive public outrage and protests can work in this situation He won’t get away with murder there so he is not. Only in India His dad is bigger culprit than him. His father deserves much more punishment. If he had put some time learning his kid some values and ethics, he would become more responsible. Which father allows his kid to drink at 17? i know it is their fault, obviously. i said from a legal point of view and finding loopholes. there are no laws that say parents will go to jail if a child commits a mistake. In some time the story will become that the two deceased were at fault as they hit a pole and this Porsche just happened to be passing by. 😂 The officers and the judiciary should collectively resign if they have a shred of integrity left. At least wear a dog leash if you’re going to be a pet to someone in power. Without alcohol - it is an accident. With alcohol - it is murder. Real ID se aao selmon bhoi So you can actually test for Gamma-Glutamyl Transferase in the blood, which will stay elevated for much longer in the blood stream, especially after binge drinking. Unfortunately, it's not accurate enough to show that they were drinking in that moment. I misread r/India as r/Indiana and all I could think was \"Wow this is terrible but Indiana sure has a large Indian population! Haven't heard of Pune I wonder if it's primarily an immigrant community. It's still crazy that every single person involved is also Indian...wait...\" Although in reality, they'll continue to live comfortably for the rest of their lives, without ever having to worry about anything ever. They'd definitely find loopholes. But the vehicle belongs to them and they willingly left their child with it. When justice is subverted as a practice, mob justice becomes inevitable. Those helping Vedant Agarwal to evade punishment under the law invite him to face punishment at the hands of an angry mob. The law is safer. If a 17 year old is behaving like an adult then he should be punished like an adult. Oh classic case of money are the solution. Porsche taycan is not a supercar, it’s an EV Super car/high performance idk call it what you want. Then that makes it even worse 😕 that he was in full control of his senses and his reckless driving killed them. He should be tried as an adult and at a minimum manslaughter charges and the maximum years permissible under the (flawed) law. until people demonstrate in front of the judges house and name and shame him nothings going to change, and dont give the excuse that its the law, thousands of underage prisoners are made to rot in borstals and even adult prisons without bail for much lesser offences His pic is not available anywhere that’s the victim Good point. If the police arentampering with evidence it's going to be very difficult. Best of luck Badlapur movie comes to mind A co-worker of mine (in the US) is married to an Indian woman he met in college here. He's been to India multiple times to visit her family. He says that Indians have a completely different view of the value of human life than is generally held in the West - that only wealthy, accomplished Indians are considered 'valuable' and valued. Ummm rich and corrupt asf type Thats even more reason to arrest! He consciously drove over two ppl. Thats manslaughter. If nothing was wrong with the vehicle then was it intentional? He needs to go to prison regardless Same kind who defend their murderer son. Good people dont defend mosnters. Blood on the ground is much thicker than blood in the veins and when blood is spilled and its clear who was wrong. Even parents need to know when you let justice take place. Defend your son appropriately give him the resources to survive prison if you feel obligation to your murderer child. But do not stand in the way of justice. Do not try to claim your child was innocent and shift blame onto others. Civil disobedience. Protesting on the streets. Not just one day, like the farmer's protests. Pune police and politicians are too corrupt!! So infuriating impunety Rich people don't 'earn' money. They make it off the backs of the poor. That's for charging a much trivial 304a(death by negligence) instead of 304 for culpable homicide not amounting to murder. 304a is triable by magistrate court hence punishment will be much lesser and also its easier to get acquittal. I've seen this happen multiple times. I request people of Pune to put his face, his family's face, his alllll details in public. Atleast the face na!!!! Enjoying your Ram Raj guys? Of course advocate “Patel” sold his soul for money that’s what they are known for anyways…. They will sell anything for money No, but we got to learn that apparently india is on the next stage of a two tier society. Any event of the police catching you, they will take you for medical check up. In case you claim that police tortured you. India is going down. It’ll take 100s of years of change in mentality of the public to be able to avoid such instances. Complaining or sharing anything online never works nowadays. It’s nest to keep your head down and focus on earning more money. Sad to say but nothing will happen eventually. He will leave the country soon. Pune police is extremely corrupt and on the payroll of the few super powerful people like Vishal Agarwal, among others. Does it matter? It's enough to be pedantic but people have died, for all I care you could be driving a Maruti Suzuki, so long you don't violate 17 different sections of the IPC(rip) William Zanzinger What is drive premise Driving recklessly and overspeeding way beyond the speed limit also falls under involuntary manslaughter and not accident. You can see how privilege works just by looking at their surname. Agarwal (Bania) gets away with mowing down poor migrants. Can't wait to hear how this rich brat gets his license reinstated in a few months. Indian legal and police system sparring no efforts in favoring the rich. [Study traffic rules, write essay on road accidents: Bail conditions for teen who killed two with Porsche](https://www.barandbench.com/news/bail-conditions-teen-killed-two-with-porsche) Dude got away with a fcking essay. This needs to be higher up. It was just a matter of luck 10 years back tha no one got hurt. History will keep repeating itself every 10 years or sooner unless action is taken. Nothing is going to happen. A woman from a rich family plowed through an entire family including kids in broad daylight in pune and she got away Scot free. Human life has no value in India. Like the wrestler's protest? Good luck with it. We have the same thing in the US. Rich or well-connected people can gt away with literally anything with no consequences and there is nothing anybody can do about it. If I remember correctly, there were casualties. You wouldn't have news articles about a minor crash by Ambani's son unless they were pushed by his PR folks to divert attention from the real story. Why does he look like he's on his 40's? Link? >Due to his connections with the police and politicians, Vedant got out on bail in under a day. Is getting out on bail the same thing as getting away with a crime now? Lol, nothing is gonna happen Police are just pretending to do their job to get a bigger payday from the builder father. Politician will just take money from the builder and suppress the case. The drunk kid shuld have died too cuz now hes out on bail and its a big fuck you to the victims who died and their family Please contact Morgan and Morgan attorneys at law. We will help you solve this predicament immediately. Victims families will get paid out and they will drop the case Rise up and fuck that Brahmin up. Why do y'all let them do this to you? He is a minor, he wont be punsihed harshly, hardly a few months imprisonment. At max. In germany they start drinking at at 15 and the country is 10x safer than india Realistically what can I do to help bring justice? Awareness of this case? Protest? hey thanks for the lead, we're organising a protest as of right now so I'll get someone from the team to contact you Title is misleading, it should be spoiled kid of rich person. I really feel AI should take over humanity now. MOFOS need rational law implementation fully. Who is the vehicle registered to? I bet daddy’s company. Sue them as it’s a company vehicle Pune Police has become so shameful it is beyond our imagination. Of course they did not find any alcohol cause the test was done 12+ hours after the incident. He needs to be tried like an adult and the people of Pune and the country should not stop until the victims families have found justice. Builder kids are a true menace in this country and if they continue to get away with things this will never stop. That makes more sense. Reminds me of this incident - [https://www.youtube.com/watch?v=HuU1phIxxyY](https://www.youtube.com/watch?v=HuU1phIxxyY) Not that I am advocating anything here but...just.. a reference. Crime is there too There's cartel , mafia and Russian gangs active there Protest should be outside the bramha reality office or their project sites Ja Na Ga … fucking money talks! Wtf. He has killed two people. This is not right. Banking my hopes on this case coming through. There's enough public wrath. The momentum shouldn't go though. If the investigation is airtight and the evidence is collected well enough, they have a good enough case at their hands. This boy should be behind bars. Whats wrong with vigilante justice here? [https://youtube.com/shorts/uhPzfae2N4A?feature=shared](https://youtube.com/shorts/uhPzfae2N4A?feature=shared) # 17-yr old minor boy Son [#BrahmaRealty](https://www.youtube.com/hashtag/brahmarealty/shorts) chairman in [#pune](https://www.youtube.com/hashtag/pune/shorts) [#VedantAgarwal](https://www.youtube.com/hashtag/vedantagarwal/shorts) kills 2 people. Anyone got the CCTV footage of the pub/club where he was partying .. these evidences will be destroyed soon so if anyone in Pune can secure or release them it willl help the case Everything about this case is wild. Look at the amount of crimes: 1. Underage drinking 2. Driving under the influence of alcohol 3. Driving at over 200kmph 4. Killing two innocent people 5. Number plates removed from car immediately 6. Mob beat the kid who was pulled out from the driver seat, yet they tried to claim the driver was at the wheel 7. Special holiday court grants bail on a Sunday morning 8. Blood alcohol sample tampered with 9. Police orders pizza for the boy at the station 10. Police claims they tried to charge him as an adult, and send him to jail awaiting trial but court said no, indicating court is paid off 11. Criminal negligence by father allowing him to drive underage and go drinking The list of crimes are endless. What the actual hell. I have never seen anything this blatant. We don't even know how many more crimes will they commit to save this murderous psychopath As well as his parents and if there is even a slight preferential treatment the police, the MLA Sunil Tingre should also be behind bars Already done. Lawyer is on national tv claiming there was a different driver. OP Fwiw please be careful when using the names of minors. It's probably fine on Reddit as long as your account follows the proper hygiene and can't be traced back to you. Rich people have good lawyers and they can easily accuse you of harassing a minor. The rich have always had a different judicial system to answer to, this true in India and the world. Thoughts and prayers with the family of the victims, Om Shanti. They're not going to get justice but maybe they're able to get adequate financial compensation, that's the best that we can hope for here. Read about Ethan Couch, same case as this. He got away too. Money matters even if you are living in Europe or usa This needs more visibility Don't undermine insta and Twitter people That can go either way depending on arguments. With alcohol it is confirmed. Come to India. Unparalelled beauty and wealth. Surrounded by a dump. Your blonde white female friends will be relentlessly groped, and everyone is trying to scam or rob you the entire time. Not to worry.. its just human feces every ten steps. Real talk I can't wait to never go back. Come to India. Unparalelled beauty and wealth. Surrounded by a dump. Your blonde white female friends will be relentlessly groped, and everyone is trying to scam or rob you the entire time. Whas Man they should really set some more laws regarding these driving related death scenarios. Set a precedent and prosecute according to that. No more non-malicious intent needs to be proved. Fuck these people seriously, same for the Tathya Patel incident. Prayers for the family who lost their young kids. Is there a gofundme page for them? Lol. Nothing new here. Most of such cases get settled out of court. The one making the most noise gets paid to shut up. The police get paid to purposefully mishandle evidence.The defence lawyer gets paid to bribe the victim's families. Sometimes the builder will \"donate\" to ruling parties to get the judge or public prosecutor a good position. And, finally the victim's family receives the least compensation, if at all. The builder daddy is going to be paying crores in bribes. That's the best punishment he's going to get. If no alcohol has been found then why does he need to take counseling and write essays on quitting alcohol? Fucking sold government and the whole system. There is no investment in shifting the mindset of the youth on NOT drinking and driving. In India it is considered uncool if the guy doesn’t drive after drinking. As if biology doesn’t affect their human bodies!! The day when general public e.g. teenagers and youngsters will start seeing that drinking and driving is sheer irresponsible, then the change will come. It is already the case in the most developed countries. Oh shit I just compared India to developed countries/ the west, and did the unthinkable!! Still, the people will find justification on how it is still ok within the Indian context..here we go..3,2,1.. 🙄 Exactly! I believe he is just out on bail. The court case is still to take place. Please correct me if I'm wrong. Whicj insta post? Then gather a party and protest. Whats stopping ya This country's protesting instincts died long ago. Farmer's protest was one of its kind, the regime took more than one year to hear them, during which 700-800 farmers even died. The country is going downhill with just chestbeating and showpiece patriotism and jingoism. Actual public welfare, issues and protests have taken a backseat. \"Protest\" word itself has been demonised.(Remember andolanjeevi remarks from our PM himself, that too in parliament ffs) Goons have taken over, sane voices are not being acknowledged and also demonised. Intellectualism is being looked down upon. The junta has lost it's spine. Collective, cooperative and in sync voice from the public is a dream now for our country for, god knows, how many years in future. Has anyone observed that how did this guy got bail on sunday when the courts are closed. These things keep reminding of the illusion that is propagated to us that people are equal. No people are not equal infront of the law or society. We subconsciously value lives differently. It’s tragic. And I wish we had a better legal system. This kid is 17, so legally they can’t do anything to him. He shall face no consequences whatsoever. We don’t have a provision like the US where u can try a minor as an adult. The law will treat him as a juvenile and he will get away with this. Will do. Wanna join? Don’t let your country become another Russia. No, it was his WEALTH that made it okay for him to kill people. Welcome to capitalism The most corrupt of em all pune police no ethics nothing for a small amount of money they can change the case from murder to accidental Nah i aint living there. :) Well if he was accepted in any college in the US or UK, it will be revoked. Did they even do the test within 12hrs? I am actually more surprised that he didn't die at that speed, he and the driver beside him were uninjured. What kind of ideal world do you all live in? Anybody who loves someone else will always justify the other's action claiming baccha hai yeh bas ya aisi galti sabse hoti hai Share the video plz It's more about justice and maintaining law and order in society at large. If we let depressed kids get away with murders, what's next? School shootings? Law is not about one individual it's about whole society. If someone's allowed to get away with murders it's gonna make people lose trust in the whole system and soon it'll be anarchy. Who's the kid's father ? None. Alcohol itself is enough to cause the liver to stop digesting free radicals that cause ageing. No, if you love someone you wont let them commit evil in your families name. People justify their child, not because of love. They justify because otherwise it brings shame to them. The whole system is flawed. I’m actually more scared when the cops are involved rather when they aren’t Can I just say he got a punishment of 15 days of service with yerwada traffic police and an sassy on accident. For killing 2 fucking people and running away for 1 km or so. Hit and run as well. That's all I have to say. Hope a high-profile lawyer takes this up as a PIL and fights for justice! He is the accused right? And this is manslaughter/accident investigation. So yes, they should test for alcohol and substances asap. Even for passengers. You don't know how the final investigation will unfold. Everyone present at the crime scene will likely have statements. And statements of drunk people would probably have lesser merit. Without licence its murder Salmon Bhoi ❤️ insta and twitter “people” tbh I don’t see the issue at all. Good for the kid! His dad has done a lot to get where he is and he’s reaping the benefits. As for the dead people, it’s unfortunate, and avoidable. But it doesn’t matter that much. Even reddit these days How are 7., 9. and 10. Crimes? He is a juvenile, court has every right to reject trying him as an adult. Only money talks in this country. Nothing else but money. Hopefully it's sarcasm I hate it how easily they got away with it , just because our police and judiciary is on sale What's so shocking about this? This is how the system has been working. It will just continue like this. Money and background is always above law. They did 9. Ordering pizza to reduce his alcohol reading in the breathalyser This is a failure of society in general. Nobody cares. People will bow down to money and political power. Religion, morality, virtue etc are used only for patronizing. Poor human life* Where are the what about gang? What about the victims going out so late at night partying? Rules are all hogwash and meant for the poor and powerless middle class and lower class Police say that alcohol test is negative. But in this case he clearly is drinking alcohol. Now the lawyer will say like it was lemonade or water to defend him. RIP indian judiciary Bik gayi hai gormint I think everyone from pune should come on street to protest and demand his arrest. Imagine if a little religious/caste sentiments are heart a whole community comes up and floods the streets. Similar thing should happen to award the justice those two innocent souls deserve. Thing is there are pills that could remove alcohol content from blood. Power protects power. The people of Pune, now that ever before, have to take to the streets. **Only in unity, will Pune find it's justice**. It’s sad how everyone even in pune society is ignoring it and they are unfazed. Punishment was a comedy Enjoy Achhe din people!!! Ameer baap k bigadi hui nalayak aulaad what? You can do much more but that's not the point. They will tamper with the blood sample itself Means sayin, driver was driving the car. I heard some news in the morning that the Driver’s father has been arrested. Idk if thats true, any updates on this? My point is that his blood was drawn because he was the one driving. sadly, alot of ppl do... I'm the same age and in Pune, and I can assure you if I conduct a survey amongst ppl i know, I'd get more guys who drink than not. Paisa hai to badi badi baate :) That's patently wrong. Consuming pizza or any food after consuming drinks will not reduce BAC levels Maut se kamm saza kaise ho sakti hai aise logo ke liye? These are some reason I feel pathetic to be an Indian citizen. Obviously it will die out in no time. Accidents happen. People get killed in accidents. He wasn’t set out purposely to murder these people. Law has to take its own course. Why are you guys spewing mob mentality? Well drunk driver killing someone and a sober one killing someone have different sentences This is really disappointing and I have lost all faith in our joke judiciary and justice system. We all criticise our government all the time, but it’s high time we demand a change in our judiciary system which is favouring the rich and the powerful like this. Where is the justice? Can you believe it!? He killed two people, and was given a bail in few hours after writing a fucking essay.. wow.. will justice ever be served in this country? Are you really saying because they've made so much money, they should enjoy the benefits like running people over and walking out free? God help this country, bootlicking the rich is in our veins I once happened to hit a drunk guy on motorbike on a road where he was driving without light. I stopped the car went on to check him a lot of people came to check on him. And that guy was in the influence of alcohol and it was no mistake of mine that I hit him luckily he only escaped with scratches and was not dead. You cannot completely deny the fact that people are now driving in the influence of alcohol at night whether they are middle class or rich. okay I’m not a bootlicker. Secondly, you have no idea how much I actually relate to that! I was driving when a guy I dislike (opp from school) decided to speed by my car and flip me off. I then got out of the car, my brother drove it, and we ended up crashing into the guy. He had a brain concussion and a few fractures etc, hospitalised for a few weeks, nothing too bad. My dad’s connections with the local politicians and police got my brother (17) and I both out unscathed, no FIR filed, ruled off as accident. It wasn’t our fault obviously but the circumstances were in a position to jeopardise our future (visa cancellation). So yeah I do think we should have exceptions made! If ur here to shit talk me, go speak to the wall It’s crazy how you’re judging me so quickly without even knowing me. r/India in a nutshell! Why is bar owner arrested if police couldn't find trace of alcohol in the boy's blood? 🤨 Is there a goFundMe for the victim's families? They might need it for legal. I am not letting this one go. Kalyani nagar and Koregaon park is a hub of drunk driving....I have atleast seen 5-6 accidents there....Pune traffic is one of the most corrupt in the country Video of him drinking with his friends: Why tf did he got bail? Even that on a Sunday?? 1. He drank alcohol while being underage 2. He was driving while being underage 3. He was driving while being under the influence 4. He killed 2 innocent souls! Sala Paisa hoto kya kya nahi ho sakta iss duniya Mai 😭 Frankly these are the simple things that I never like to invest money in India. The law is followed blindly and misinterpreted to benefit the rich and when it comes to the common man, laws are broken to oppress him. Law Arrest the Driver and charge him for manslaughter. Jail him for 20-30 years Arrest the Father for irresponsible guardianship for letting a minor drive the car. Jail him for 10 years Lifetime financial support for both families that lost son/daughter. This should come from Perpetrators family fund. Fine to the dealership to allow car to be driven without registration. Fine goes to the family Cancel the dealership license for 5 years. Arrest the Bar owner who served liquor to minor. Cancel the license to sell liquor. Fine the bar owner and Fine goes to the family Find these Juvenile Board members and Reprimand them. Fix the laws of this country. Take UAE and Singapore as an example. that’s not in people’s hands. Govt will ket him leave for free There's a blind man taking notes somewhere You are right my friend. A broken judicial system encourages vigilante justice. Perhaps he is also getting a diplomatic passport to go on a holiday. His blood was drawn because he's the accused as per the FIR. The kid should be punished, father at least 20 years \"If you are rich you can f*** the country\" There seems to be a video doing the rounds of Twitter which show the boy drinking in a bar with his friends. Yes, no shit, that was my point.... Requesting everyone to reshare it. Bro, it sounds bad, but that’s one of the reason why I wanna be stinking rich Pretty certain that some driver will come forward to claim the responsibility for the accident. Your terminology was incorrect. It is hard for me to judge what you are trying to say if you use wrong words. It is actually worse that he killed two people in his full senses I think you just misunderstood the comment in context to the chain of comments above it. Somebody claimed it was their intent to accuse another person of being a driver. Yet from the start they tested the blood of this person which suggests that they are assuming he was the driver. The guy's 16 The lawyer of the accused wants to spin a tale of who was actually driving. The police, even if they are in the pockets of this lawyer, will need to investigate the accused. If the police don't draw his blood, then the courts can punish them for not following procedure. The fact that the police followed procedure does not indicate if they are or aren't in the pockets. Secondly, let's assume the accused is guilty and the lawyer wants to get him out. He wants the blood tested to forge it and help his case. I believe your point comes from this scenario. But even then, one cannot assume he is guilty. Because Even a non guilty party will try their best to gather evidence. So neither the police nor the lawyers actions suggest anything from this blood draw. Hats off to our so called justice system… only because he is from a rich family he is writing essay.. he killed 2 people.. bhai law sbke ke liye same hona chiye.. but ye incident ke baad yahi dikhta ki law bhi bika skta hai.. hats off really clapping for our law… THEN THAT WILL BE A FUCKIN MURDER they might be lying. policemen love to save rich kids’ ass. I hope ur never rich What ambani case? Don't forget the drunk state, driving under influence when he shouldn't be allowed to do either driving or drinking If a person kills someone sober that is okay? Life is so cheap? What about driving under age? Exactly. I rest my case. Curious to know - what did Anant Ambani do? Do u think protesting might help : my idea :💡 if there is any rich kid who is willing to help they can find out by bringing to concern persons and let know how he got away with that and bribing the same people to put that person in jail. Ps : This only for the rich kids whose concern is to bring justice. It makes it worse Did y'all watch Dhruv's new video? Salmon bhoi sends his regards"
}