{
    "id": "s9qoxv",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/s9qoxv/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 19,
    "num_comments": 69,
    "created_utc": 1642815014,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "If you're looking some something animated \n\nWatch jujutsu Kaisen",
        "Watched Red Rocket a week back and man what a film. Full of chaotic energy, hustle and features hell of a performance by Simon Rex.",
        "Anyone else watching Beatles Get Back and loving John Lennon's humour",
        "Ozark S4 is outttt",
        "I watched two movies \n\n\nDeath of Stalin- it's so comical yet grim the whole time I was sure I'm going to hell for laughing at this\nSpoiler- &gt;!Stalin dies tho!&lt;\n\n\nMe and Earl and the dying girl - a coming to age movie I liked the male lead and his awkward personality. Going to read the book it was based on. It left me hollow for days",
        "I watched Station Eleven and absolutely loved it. \nWill watch Asghar Farhadi's - A Hero today. \nAlso will watch Maid (2021).",
        "Please recommend me some good podcast (exclude gossip, fictional stories, motivational)",
        "found an interesting sounding documentary while browsing qbittor.\n\n[https://docuwiki.net/index.php?title=The\\_Secret\\_History\\_of\\_our\\_Evolution:\\_Series\\_1](https://docuwiki.net/index.php?title=The_Secret_History_of_our_Evolution:_Series_1)\n\n&gt;We are truly a time machine.  \nEach of our body's organs appeared and evolved on a timeline that science can now reestablish.  \nWe had genitalia before we had ears, and eyes before we had limbs.\n\nhere is a 2 min preview:\n\n[https://curiositystream.com/video/2091](https://curiositystream.com/video/2091)",
        "Hidden Brain - on behavioral science\n\nFreakanomics radio\n\n99% Invisible",
        "The official podcast (it's like radio interviews of gta but IRL)\nSome ordinary podcast (if you want to hear a very diverse group of people talk about diverse subject)",
        "Finished cobra Kai S4, felt meh",
        "I think it was pretty good.... Just Miguel's story took a backseat but i think they will pick it up in season 5.",
        "Dota dragon's blood",
        "damn, ty. both seem great recommendations to me",
        "AoT final season baby!\n\nalso, excited for rocket boys. So I will rewatch October sky today (based on a book also named rocket boys). imo October sky is one of the best jake gyllenhaal movies.",
        "Is it concluded yet ?",
        "One more part still remaining",
        "- 30 animals that made us smarter\n- Revisionist history",
        "Watched Garuda Gamana Vrishabha Vahana. A welll made kannada gangster flick. Very nice visuals. Its a bit graphic though",
        "Been eyeing red rocket for a while. Imma watch it tomorrow then we'll discuss.",
        "Henry VIII - oversimplified",
        "The music though, pure fire.",
        "Finished in a day.",
        "Me too.",
        "The Last Podcast on the Left. It's about pop culture and crime. But it's mostly just 3 friends talking about gnarly guy stuff. And they're quite funny.",
        "Lorry driving lesson scene is funny.",
        "My yearly re-watch of True Detective season 1 has started. Probably the single greatest piece of television.",
        "Agree, my fav is Sojugada Soojumallige",
        "Haha yeah, one of those lighter moments in the movie",
        "It's not on Netflix, is it?",
        "It's on Hotstar",
        "+1. I would want to ask this to you, How do you rate Fargo S1 as you like TD S1?",
        "Back to \"Band of Brothers\" after a decade.",
        "Gundala and Impetigore.. Excellent comic fantasy (original 'Minnal Murali' inspiration ') and folk horror\n\nLanguage :Indonesian",
        "Watched Pushpa, it was too good",
        "How do you get so much time? What do you do?",
        "TD S1&gt; F S1",
        "The maid is brutal. Station eleven is beautiful",
        "fargo s1 is best minisseries ever  imo",
        "Binge caught upto Ranking of Kings in a single day\n\nLoving it!!",
        "The main character is uber based",
        "For all the anime watchers here,i insist that you give Sonny Boy and ODDTAXI a chance if you haven't already,can confirm after binging them\nThat they are one of the best anime out there!",
        "Watched Line of Duty this weekend. No idea why I hadn't watched it before.\n\nIf you're looking for an edge of the seat police procedural crime thriller, this is it. 9/10",
        "Loved the movie. Not sure how a non mangalorean would like it though",
        "unrealistic movie",
        "Best war based drama imo.",
        "How is Minnal Murali inspired from it?",
        "I liked S2 more",
        "What's the last one about?",
        "*99% Invisible is a sound-rich, narrative podcast hosted by Roman Mars*   \n*about all the thought that goes into the things we don’t think about —*   \n*the unnoticed architecture and design that shape our world*\n\nhttps://99percentinvisible.org/about/the-show/",
        "I have weekends off!",
        "Lightning superpower",
        "That's it? Not really an inspiration then. Even Flash got his powers through lightning",
        "Saw black book, pretty good movie. Come very close to enemy at the gates for me.",
        "I am not from karnataka and I liked it very much :)",
        "Earlier I liked s2 more, but lorne malvo is enigmatic.",
        "I finally got to watch 'The Father'. It was a masterfully crafted movie that'll make you see through the eyes of a person who lives with dementia. The movie is at times confusing, but that is the intention of the maker, to show how life can be confusing for a person with such a condition. The entire cast, especially Anthony Hopkins ofcourse, was brilliant. Despite all the hype around the movie, it still managed to deliver on my fairly high expectation.",
        "Got into Community. Loving it!",
        "It's really good. Top notch television. But to me TD S1 holds a special place",
        "Started watching Ted Lasso..quite endearing and hilarious in parts",
        "I love oversimplified!",
        "Ant Jordan Peterson podcast,  selective Joe Rogan podcasts.",
        "yeah they're great, a lot of fun with cute animation. Another one I'd recommend is Kraut. The dude is very funny, I recently saw his video on india v pakistan. You should check that out.",
        "Sure",
        "Cool. How'd you find it?",
        "Gald you liked it! Actually, i was watching while i read your comment so thought of recommending.",
        "I saw its trailer somehow but then forgot about it. But then karsten runquist on yt put it on his year's best films list. Still haven't seen the movie though, probably gonna watch Mass (2021) first.",
        "Mass is devastatingly good.",
        "Nice, I'm excited. Did you watch Pig btw? That was great too.",
        "Yes, it was a nice film. Nic Cage performance in Pig was something special."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "youre looking something animated watch jujutsu kaisen watched red rocket week back man film full chaotic energy hustle features hell performance simon rex anyone else watching beatles get back loving john lennons humour ozark outttt watched two movies death stalin comical yet grim whole time sure im going hell laughing spoiler gtstalin dies tholt earl dying girl coming age movie liked male lead awkward personality going read book based left hollow days watched station eleven absolutely loved watch asghar farhadis hero today also watch maid please recommend good podcast exclude gossip fictional stories motivational found interesting sounding documentary browsing qbittor httpsdocuwikinetindexphptitlethesecrethistoryofourevolutionserieshttpsdocuwikinetindexphptitlethesecrethistoryofourevolutionseries gtwe truly time machine bodys organs appeared evolved timeline science reestablish genitalia ears eyes limbs min preview httpscuriositystreamcomvideohttpscuriositystreamcomvideo hidden brain behavioral science freakanomics radio invisible official podcast like radio interviews gta irl ordinary podcast want hear diverse group people talk diverse subject finished cobra kai felt meh think pretty good miguels story took backseat think pick season dota dragons blood damn ty seem great recommendations aot final season baby also excited rocket boys rewatch october sky today based book also named rocket boys imo october sky one best jake gyllenhaal movies concluded yet one part still remaining animals made us smarter revisionist history watched garuda gamana vrishabha vahana welll made kannada gangster flick nice visuals bit graphic though eyeing red rocket imma watch tomorrow well discuss henry viii oversimplified music though pure fire finished day last podcast left pop culture crime mostly friends talking gnarly guy stuff theyre quite funny lorry driving lesson scene funny yearly rewatch true detective season started probably single greatest piece television agree fav sojugada soojumallige haha yeah one lighter moments movie netflix hotstar would want ask rate fargo like td back band brothers decade gundala impetigore excellent comic fantasy original minnal murali inspiration folk horror language indonesian watched pushpa good get much time td sgt f maid brutal station eleven beautiful fargo best minisseries ever imo binge caught upto ranking kings single day loving main character uber based anime watchers herei insist give sonny boy oddtaxi chance havent alreadycan confirm binging one best anime watched line duty weekend idea hadnt watched youre looking edge seat police procedural crime thriller loved movie sure non mangalorean would like though unrealistic movie best war based drama imo minnal murali inspired liked whats last one invisible soundrich narrative podcast hosted roman mars thought goes things dont think unnoticed architecture design shape world weekends lightning superpower thats really inspiration even flash got powers lightning saw black book pretty good movie come close enemy gates karnataka liked much earlier liked lorne malvo enigmatic finally got watch father masterfully crafted movie thatll make see eyes person lives dementia movie times confusing intention maker show life confusing person condition entire cast especially anthony hopkins ofcourse brilliant despite hype around movie still managed deliver fairly high expectation got community loving really good top notch television td holds special place started watching ted lassoquite endearing hilarious parts love oversimplified ant jordan peterson podcast selective joe rogan podcasts yeah theyre great lot fun cute animation another one id recommend kraut dude funny recently saw video india v pakistan check sure cool howd find gald liked actually watching read comment thought recommending saw trailer somehow forgot karsten runquist yt put years best films list still havent seen movie though probably gon na watch mass first mass devastatingly good nice im excited watch pig btw great yes nice film nic cage performance pig something special",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "If you're looking some something animated Watch jujutsu Kaisen Watched Red Rocket a week back and man what a film. Full of chaotic energy, hustle and features hell of a performance by Simon Rex. Anyone else watching Beatles Get Back and loving John Lennon's humour Ozark S4 is outttt I watched two movies Death of Stalin- it's so comical yet grim the whole time I was sure I'm going to hell for laughing at this Spoiler- &gt;!Stalin dies tho!&lt; Me and Earl and the dying girl - a coming to age movie I liked the male lead and his awkward personality. Going to read the book it was based on. It left me hollow for days I watched Station Eleven and absolutely loved it. Will watch Asghar Farhadi's - A Hero today. Also will watch Maid (2021). Please recommend me some good podcast (exclude gossip, fictional stories, motivational) found an interesting sounding documentary while browsing qbittor. [https://docuwiki.net/index.php?title=The\\_Secret\\_History\\_of\\_our\\_Evolution:\\_Series\\_1](https://docuwiki.net/index.php?title=The_Secret_History_of_our_Evolution:_Series_1) &gt;We are truly a time machine. Each of our body's organs appeared and evolved on a timeline that science can now reestablish. We had genitalia before we had ears, and eyes before we had limbs. here is a 2 min preview: [https://curiositystream.com/video/2091](https://curiositystream.com/video/2091) Hidden Brain - on behavioral science Freakanomics radio 99% Invisible The official podcast (it's like radio interviews of gta but IRL) Some ordinary podcast (if you want to hear a very diverse group of people talk about diverse subject) Finished cobra Kai S4, felt meh I think it was pretty good.... Just Miguel's story took a backseat but i think they will pick it up in season 5. Dota dragon's blood damn, ty. both seem great recommendations to me AoT final season baby! also, excited for rocket boys. So I will rewatch October sky today (based on a book also named rocket boys). imo October sky is one of the best jake gyllenhaal movies. Is it concluded yet ? One more part still remaining - 30 animals that made us smarter - Revisionist history Watched Garuda Gamana Vrishabha Vahana. A welll made kannada gangster flick. Very nice visuals. Its a bit graphic though Been eyeing red rocket for a while. Imma watch it tomorrow then we'll discuss. Henry VIII - oversimplified The music though, pure fire. Finished in a day. Me too. The Last Podcast on the Left. It's about pop culture and crime. But it's mostly just 3 friends talking about gnarly guy stuff. And they're quite funny. Lorry driving lesson scene is funny. My yearly re-watch of True Detective season 1 has started. Probably the single greatest piece of television. Agree, my fav is Sojugada Soojumallige Haha yeah, one of those lighter moments in the movie It's not on Netflix, is it? It's on Hotstar +1. I would want to ask this to you, How do you rate Fargo S1 as you like TD S1? Back to \"Band of Brothers\" after a decade. Gundala and Impetigore.. Excellent comic fantasy (original 'Minnal Murali' inspiration ') and folk horror Language :Indonesian Watched Pushpa, it was too good How do you get so much time? What do you do? TD S1&gt; F S1 The maid is brutal. Station eleven is beautiful fargo s1 is best minisseries ever imo Binge caught upto Ranking of Kings in a single day Loving it!! The main character is uber based For all the anime watchers here,i insist that you give Sonny Boy and ODDTAXI a chance if you haven't already,can confirm after binging them That they are one of the best anime out there! Watched Line of Duty this weekend. No idea why I hadn't watched it before. If you're looking for an edge of the seat police procedural crime thriller, this is it. 9/10 Loved the movie. Not sure how a non mangalorean would like it though unrealistic movie Best war based drama imo. How is Minnal Murali inspired from it? I liked S2 more What's the last one about? *99% Invisible is a sound-rich, narrative podcast hosted by Roman Mars* *about all the thought that goes into the things we don’t think about —* *the unnoticed architecture and design that shape our world* I have weekends off! Lightning superpower That's it? Not really an inspiration then. Even Flash got his powers through lightning Saw black book, pretty good movie. Come very close to enemy at the gates for me. I am not from karnataka and I liked it very much :) Earlier I liked s2 more, but lorne malvo is enigmatic. I finally got to watch 'The Father'. It was a masterfully crafted movie that'll make you see through the eyes of a person who lives with dementia. The movie is at times confusing, but that is the intention of the maker, to show how life can be confusing for a person with such a condition. The entire cast, especially Anthony Hopkins ofcourse, was brilliant. Despite all the hype around the movie, it still managed to deliver on my fairly high expectation. Got into Community. Loving it! It's really good. Top notch television. But to me TD S1 holds a special place Started watching Ted Lasso..quite endearing and hilarious in parts I love oversimplified! Ant Jordan Peterson podcast, selective Joe Rogan podcasts. yeah they're great, a lot of fun with cute animation. Another one I'd recommend is Kraut. The dude is very funny, I recently saw his video on india v pakistan. You should check that out. Sure Cool. How'd you find it? Gald you liked it! Actually, i was watching while i read your comment so thought of recommending. I saw its trailer somehow but then forgot about it. But then karsten runquist on yt put it on his year's best films list. Still haven't seen the movie though, probably gonna watch Mass (2021) first. Mass is devastatingly good. Nice, I'm excited. Did you watch Pig btw? That was great too. Yes, it was a nice film. Nic Cage performance in Pig was something special."
}