{
    "id": "1ef53ah",
    "title": "[Repost] Update on the Pune Porsche Crash Case",
    "url": "https://www.reddit.com/r/india/comments/1ef53ah/repost_update_on_the_pune_porsche_crash_case/",
    "selftext": "We forget too quickly. The internet was screaming to give justice by punishing the allegedly drunk kid who allegedly was driving and allegedly crashed into two innocent people. The kid who was released even before the bodies of victims were cremated by their [families](https://www.thequint.com/news/india/pune-porsche-car-accident-victim-aneesh-awdhiya-mother-savita-justice-minor-punishment). Then there were attempts to sabotage the evidences and bail conditions which became a field day for memes.\n\nBut then we got new things to talk about. The Ambani weddings, the Olympics and what not.\n\nHere are some recent articles on what happened after the internet forgot:\n\n1. No name of teen in the 900-page chargesheet filed by police recently - [Times Now Article](https://www.timesnownews.com/pune/pune-news-porsche-crash-case-in-900-page-chargesheet-filed-by-police-against-7-accused-teen-not-mentioned-article-112048568)\n2. Accused submits the required essay on July 3 (For reference car crash was on May 19 and the order for bail was given on June 25) - [Indian Express Article](https://indianexpress.com/article/cities/pune/minor-in-porsche-case-complies-with-bail-conditions-submits-essay-on-road-accidents-9433586/#:~:text=In%20the%20early%20hours%20of,Aneesh%20Awadhiya%20and%20Ashwini%20Koshta) - Yes the memes came before the essay did.\n3. Maharashtra Women and Child Development Panel recommends actions against JJB members (people who gave bail and bail conditions) for lapses in procedures - [The Hindu Article](https://www.thehindu.com/news/national/maharashtra/porsche-crash-wcd-panel-recommends-action-against-jjb-members-for-procedural-lapses-in-bail-to-minor/article68413896.ece)\n\nBy the time the order of any judicial authority comes, the internet would have forgotten, as always. Most people who wrote full length essays on twitter and \"10 things to learn from Pune Crash\" on LinkedIn wont even bother to know what happened after. If the internet had not pressured the local authorities to act, who knows if the case even made it out of Pune, let alone a national issue.",
    "flair": "Crime",
    "score": 1224,
    "num_comments": 46,
    "created_utc": 1722273369.0,
    "convurl": "https://external-preview.redd.it/9F3vV0-gQ29H7CshStp6pX-4Vflv2vnYTqPnlv-VYWo.jpg?auto=webp&s=4d0ff7719a1dd7200c80322c2065c07acbbd17fd",
    "comments": [
        "This is what the value of life has become in our country. It’s disgusting to see that we (myself included) have never referred to the case by the name of the victim but the brand of the car instead. \nWe are just a news flash, a headline for a day, maybe two, lucky if it’s three.\nPathetic state of affairs.",
        "pune people as usual good only for big talks, they dont even have the balls to protest in front of the jjb judges house",
        "Sadly, this country was always a shithole infra wise now it is lawless as well.",
        "all humans are evil",
        "This was inevitable, they have so so much money. Soon that B will fly outside the country.",
        "https://en.wikipedia.org/wiki/2024_Pune_Porsche_car_crash",
        "it was a hellhole lawlessness wise too, it's just that we couldn't see it because of lack of social media",
        "As stated in the report, he is being tried separately. Also, parents are among the 7 charged in the case.\n\nKinda misleading headlines.",
        "Man only if it were the US or some other  country, this guy would be serving a life sentence. Absolutely pathetic.",
        "Genie: you will have a wikipedia page about you.\nKid: yay!\n\nThe page:",
        "Why did high court give relief to the family? When it comes to higher courts media is reluctant to criticize their decisions  fearing repercussions",
        "Laws do exist in this country.. but only for the poor & middle class. \nThe system works to protect the rich. \nThat’s the state of this country. \n\nAn incident that happened with me - I was driving one night on a highway and I overtook a fortuner that was moving rather slowly on the right lane (supposed to be the fast lane). \nThat fortuner guy took this personally and came behind me for my life. Cutting and overtaking dangerously, while abusing & taunting me. \nMy wife was in the car and she was expecting.. we were shit scared for our lives. \nThe fortuner guy suddenly stopped in front of my car and those guys got out of the car. Luckily I had a bit of space to swerve and escape, and before they could get back inside their car and follow me, I lost them. \nI am still scared to think what would’ve happened that night. \nThe fortuner had a sticker of a political party on front and back screen.. so I’m sure if me and my wife had been killed that day, there would’ve been no repercussions.\nThat was the day I realised, the country where I pay lakhs of rupees in taxes, can’t guarantee my safety, nor would they punish the wrongdoers. \nThe next day I started applying jobs abroad and moved out. \nRoad accidents and road rage happens everywhere but the judiciary should be able to punish the people who do the wrong things so they’re scared to do it. These guys (who are rich or politically connected) feel like they can do anything and get away with it. No where in the world should this be ok. \n\nBut this is the state of things in our country. And don’t think anything will change at least for the next two generations. It might get worse before it gets better, but hopefully one day it will.",
        "What pains me is that people caught transporting meat can be lynched before verifying if it’s beef but others can mow down humans and get off scot free in broad daylight.\nWhat a country we live in!! \nThe Gods must be wondering why they made us!",
        "It was only used as a meme material ( and bar bar ek meme dekh kar bore hojate h log isliye chalagaya ye topic ab kisi ko ghanta kuch farak nhi padhta h )",
        "A pretty bad idea, but we need vigilante hacker groups like Anonymous in India. If the judiciary and executive committees can't do stuff, I bet these folks definitely could.",
        "Pay 50% taxes and forget about it",
        "In my opinion (so feel to disagree) this is a systematic problem where it’s become easy to rig the system with money. And systematic problems require a thorough clean up, such vigilante groups may cause an uproar every now and then but won’t really solve anything.\nRemember the data leaks on panama papers, swiss accounts and so on, do you remember any of those? Did anything happen cause of them?",
        "Had it not been for that essay punishment, 99% people wouldn't even be aware of that accident.",
        ">This is what the value of life has become in our country.\n\nIts always been like this.",
        "Please x-post this on r/Maharashtra too.",
        "What did you expect ??\n\nMaine toh bola hi tha ye niklega. \n\nWe either need aparchit or we need bandit queen, because someday people will take laws into their own hands.",
        "Oh gosh this has so much worse things",
        "So what can we do. Any action plans?",
        "This porche case and that prajwal revanna case...\nNoone is talking about it",
        "/By the time the order of any judicial authority comes, the internet would have forgotten, as always.",
        "This has always been the case.",
        "so sorry that happened to you. and +1 for laws only existing for poor and middle class people. similar story i have, sibling and grandparent were injured heavily in an almost hit and run by a drunk student who was speeding and also not on the correct side of the road. police never did a drug or alcohol test on him even though witnesses reported him being visibly drunk. they made up theories that he never took a road witnesses reported him taking because their theory would've made it impossible for him to be speeding as there was a turn. been more than 2 years, we are still awaiting his punishment despite my own parent being an advocate. guy is chilling out abroad with no repercussions for the lives that he ruined",
        "Galti humari hai, hum log bahut jaldi used-to ho jaate hain. Ek aisa haadsa hota hai toh channel badal-badalke saara maajra dekh liya, SMS kiya, phone kiya, shukar manaya ki hum log bach gaye aur fir hum us situation se ladne ke bajaaye, uske saath adjust karna shuru kar dete hain\n\n~ A Wednesday",
        "lol no!! Read more on this",
        "From wiki:  \n   \n> The juvenile's 77-year-old grandfather is accused of abducting the driver who was present at the time of the accident and forcing him to take the blame.    \n      \n>  The blood alcohol test of the minor was delayed by more than 8 hours - enough time for alcohol to be flushed out of the body.  \n   \n> Two senior doctors from the Sassoon Hospital were arrested for replacing blood samples taken from the accused.\n   \n> The minor was allegedly served pizzas and burgers while under custody.  \n    \n> On 25 June, after a plea from the maternal aunt of the accused, the Bombay High Court directed the police to release the accused, declaring the previous remand order illegal and for the accused to be under the care and custody of the aunt.  \n    \nWhat a joke system. 😞",
        "Not really Caitlin Jenner killed a Roman in a car crash too and nothing happened to her.  Power works everywhere",
        "Unlivable day by day",
        "Our constitution is one of the best constitutions in the world without any doubt but the value for it is utterly down.\n\nMany Indians together will destroy the dignity of India for sure and with that being said I can truly accept the fact that now India has become one of the worst countries in the world. \n\nAll credit goes to anachronism and illiterates.\nBtw my definition of illiterates is different as I call illiterate to those who are without wisdom or ethics. \n\nIn india, mostly everyone lacks that fact that's why that 70% LITERATE population is actually nearby 10-20%.\n\nAnyways, I'm planning on leaving this country ASAP because who knows what can happen to you in this filthy place.....",
        "I’m saying in general, there are chances. Power works everywhere.",
        "When you have 1000Cr or more money, you’re essentially above the law. You can buy anyone.",
        "The fact that I have mutuals with this idiot is so much better. They’re defending him ,while  his ex is shitting on him",
        "Ik I shouldn't be saying this but I really hope someone should sue him with false cases. Ik this is wrong, but 'bure loge ke saath bura hona chahiye.'",
        "Why would anyone defend him?",
        "We are in the eastern version of Wild Wild West.\n\nErratic Eccentric East.",
        "Because they see themselves in him. \n‘He was drunk, it was a small mistake’",
        "Unfortunately we Indians being cowards have let down the families of the victims. Just remember that tomorrow if this happens to you or your family member no one will raise a voice for you either.",
        "No, no, no!!! They don’t think they can getaway with anything… they KNOW they can get away with anything!!! \nJai Hind.",
        "Yes and most of the times they do get away with it. The MLAs, MPs, their connections kind of rule the place where they are elected while they should serve the people. See them parading around in their fortuners with 12 bouncer like bodyguards and people falling on their feet. This worship culture should end.",
        "You get your answer when you reply to the question: how do the netas afford those bodyguards and other perks",
        "Same will happen to rowdy actor Darshan in Bangalore",
        "no god may have brought popcorn because they never imagined this would be this circus that anyone would like to buy ticket for.  \nwish i have 1 poison that i can pour into every primary school child which will stay in their veins for 50 yrs.  \npoison would be  'Adarsh Insaan''"
    ],
    "cleaned_text": "repost update pune porsche crash case forget quickly internet screaming give justice punishing allegedly drunk kid allegedly driving allegedly crashed two innocent people kid released even bodies victims cremated familieshttpswwwthequintcomnewsindiapuneporschecaraccidentvictimaneeshawdhiyamothersavitajusticeminorpunishment attempts sabotage evidences bail conditions became field day memes got new things talk ambani weddings olympics recent articles happened internet forgot name teen page chargesheet filed police recently times articlehttpswwwtimesnownewscompunepunenewsporschecrashcaseinpagechargesheetfiledbypoliceagainstaccusedteennotmentionedarticle accused submits required essay july reference car crash may order bail given june indian express articlehttpsindianexpresscomarticlecitiespuneminorinporschecasecomplieswithbailconditionssubmitsessayonroadaccidentstextintheearlyhoursofaneeshawadhiyaandashwinikoshta yes memes came essay maharashtra women child development panel recommends actions jjb members people gave bail bail conditions lapses procedures hindu articlehttpswwwthehinducomnewsnationalmaharashtraporschecrashwcdpanelrecommendsactionagainstjjbmembersforprocedurallapsesinbailtominorarticleece time order judicial authority comes internet would forgotten always people wrote full length essays twitter things learn pune crash linkedin wont even bother know happened internet pressured local authorities act knows case even made pune let alone national issue ",
    "cleaned_title": "repost update pune porsche crash case",
    "cleaned_selftext": "forget quickly internet screaming give justice punishing allegedly drunk kid allegedly driving allegedly crashed two innocent people kid released even bodies victims cremated familieshttpswwwthequintcomnewsindiapuneporschecaraccidentvictimaneeshawdhiyamothersavitajusticeminorpunishment attempts sabotage evidences bail conditions became field day memes got new things talk ambani weddings olympics recent articles happened internet forgot name teen page chargesheet filed police recently times articlehttpswwwtimesnownewscompunepunenewsporschecrashcaseinpagechargesheetfiledbypoliceagainstaccusedteennotmentionedarticle accused submits required essay july reference car crash may order bail given june indian express articlehttpsindianexpresscomarticlecitiespuneminorinporschecasecomplieswithbailconditionssubmitsessayonroadaccidentstextintheearlyhoursofaneeshawadhiyaandashwinikoshta yes memes came essay maharashtra women child development panel recommends actions jjb members people gave bail bail conditions lapses procedures hindu articlehttpswwwthehinducomnewsnationalmaharashtraporschecrashwcdpanelrecommendsactionagainstjjbmembersforprocedurallapsesinbailtominorarticleece time order judicial authority comes internet would forgotten always people wrote full length essays twitter things learn pune crash linkedin wont even bother know happened internet pressured local authorities act knows case even made pune let alone national issue",
    "cleaned_comments": "value life become country disgusting see included never referred case name victim brand car instead news flash headline day maybe two lucky three pathetic state affairs pune people usual good big talks dont even balls protest front jjb judges house sadly country always shithole infra wise lawless well humans evil inevitable much money soon b fly outside country hellhole lawlessness wise couldnt see lack social media stated report tried separately also parents among charged case kinda misleading headlines man us country guy would serving life sentence absolutely pathetic genie wikipedia page kid yay page high court give relief family comes higher courts media reluctant criticize decisions fearing repercussions laws exist country poor middle class system works protect rich thats state country incident happened driving one night highway overtook fortuner moving rather slowly right lane supposed fast lane fortuner guy took personally came behind life cutting overtaking dangerously abusing taunting wife car expecting shit scared lives fortuner guy suddenly stopped front car guys got car luckily bit space swerve escape could get back inside car follow lost still scared think wouldve happened night fortuner sticker political party front back screen im sure wife killed day wouldve repercussions day realised country pay lakhs rupees taxes cant guarantee safety would punish wrongdoers next day started applying jobs abroad moved road accidents road rage happens everywhere judiciary able punish people wrong things theyre scared guys rich politically connected feel like anything get away world ok state things country dont think anything change least next two generations might get worse gets better hopefully one day pains people caught transporting meat lynched verifying beef others mow humans get scot free broad daylight country live gods must wondering made us used meme material bar bar ek meme dekh kar bore hojate h log isliye chalagaya ye topic ab kisi ko ghanta kuch farak nhi padhta h pretty bad idea need vigilante hacker groups like anonymous india judiciary executive committees cant stuff bet folks definitely could pay taxes forget opinion feel disagree systematic problem become easy rig system money systematic problems require thorough clean vigilante groups may cause uproar every wont really solve anything remember data leaks panama papers swiss accounts remember anything happen cause essay punishment people wouldnt even aware accident value life become country always like please xpost rmaharashtra expect maine toh bola hi tha ye niklega either need aparchit need bandit queen someday people take laws hands oh gosh much worse things action plans porche case prajwal revanna case noone talking time order judicial authority comes internet would forgotten always always case sorry happened laws existing poor middle class people similar story sibling grandparent injured heavily almost hit run drunk student speeding also correct side road police never drug alcohol test even though witnesses reported visibly drunk made theories never took road witnesses reported taking theory wouldve made impossible speeding turn years still awaiting punishment despite parent advocate guy chilling abroad repercussions lives ruined galti humari hai hum log bahut jaldi usedto ho jaate hain ek aisa haadsa hota hai toh channel badalbadalke saara maajra dekh liya sms kiya phone kiya shukar manaya ki hum log bach gaye aur fir hum us situation se ladne ke bajaaye uske saath adjust karna shuru kar dete hain wednesday lol read wiki juveniles yearold grandfather accused abducting driver present time accident forcing take blame blood alcohol test minor delayed hours enough time alcohol flushed body two senior doctors sassoon hospital arrested replacing blood samples taken accused minor allegedly served pizzas burgers custody june plea maternal aunt accused bombay high court directed police release accused declaring previous remand order illegal accused care custody aunt joke system really caitlin jenner killed roman car crash nothing happened power works everywhere unlivable day day constitution one best constitutions world without doubt value utterly many indians together destroy dignity india sure said truly accept fact india become one worst countries world credit goes anachronism illiterates btw definition illiterates different call illiterate without wisdom ethics india mostly everyone lacks fact thats literate population actually nearby anyways im planning leaving country asap knows happen filthy place im saying general chances power works everywhere cr money youre essentially law buy anyone fact mutuals idiot much better theyre defending ex shitting ik shouldnt saying really hope someone sue false cases ik wrong bure loge ke saath bura hona chahiye would anyone defend eastern version wild wild west erratic eccentric east see drunk small mistake unfortunately indians cowards let families victims remember tomorrow happens family member one raise voice either dont think getaway anything know get away anything jai hind yes times get away mlas mps connections kind rule place elected serve people see parading around fortuners bouncer like bodyguards people falling feet worship culture end get answer reply question netas afford bodyguards perks happen rowdy actor darshan bangalore god may brought popcorn never imagined would circus anyone would like buy ticket wish poison pour every primary school child stay veins yrs poison would adarsh insaan",
    "light_cleaned_title": "[Repost] Update on the Pune Porsche Crash Case",
    "light_cleaned_selftext": "We forget too quickly. The internet was screaming to give justice by punishing the allegedly drunk kid who allegedly was driving and allegedly crashed into two innocent people. The kid who was released even before the bodies of victims were cremated by their [families](https://www.thequint.com/news/india/pune-porsche-car-accident-victim-aneesh-awdhiya-mother-savita-justice-minor-punishment). Then there were attempts to sabotage the evidences and bail conditions which became a field day for memes. But then we got new things to talk about. The Ambani weddings, the Olympics and what not. Here are some recent articles on what happened after the internet forgot: 1. No name of teen in the 900-page chargesheet filed by police recently - [Times Now Article](https://www.timesnownews.com/pune/pune-news-porsche-crash-case-in-900-page-chargesheet-filed-by-police-against-7-accused-teen-not-mentioned-article-112048568) 2. Accused submits the required essay on July 3 (For reference car crash was on May 19 and the order for bail was given on June 25) - [Indian Express Article](https://indianexpress.com/article/cities/pune/minor-in-porsche-case-complies-with-bail-conditions-submits-essay-on-road-accidents-9433586/#:~:text=In%20the%20early%20hours%20of,Aneesh%20Awadhiya%20and%20Ashwini%20Koshta) - Yes the memes came before the essay did. 3. Maharashtra Women and Child Development Panel recommends actions against JJB members (people who gave bail and bail conditions) for lapses in procedures - [The Hindu Article](https://www.thehindu.com/news/national/maharashtra/porsche-crash-wcd-panel-recommends-action-against-jjb-members-for-procedural-lapses-in-bail-to-minor/article68413896.ece) By the time the order of any judicial authority comes, the internet would have forgotten, as always. Most people who wrote full length essays on twitter and \"10 things to learn from Pune Crash\" on LinkedIn wont even bother to know what happened after. If the internet had not pressured the local authorities to act, who knows if the case even made it out of Pune, let alone a national issue.",
    "light_cleaned_comments": "This is what the value of life has become in our country. It’s disgusting to see that we (myself included) have never referred to the case by the name of the victim but the brand of the car instead. We are just a news flash, a headline for a day, maybe two, lucky if it’s three. Pathetic state of affairs. pune people as usual good only for big talks, they dont even have the balls to protest in front of the jjb judges house Sadly, this country was always a shithole infra wise now it is lawless as well. all humans are evil This was inevitable, they have so so much money. Soon that B will fly outside the country. it was a hellhole lawlessness wise too, it's just that we couldn't see it because of lack of social media As stated in the report, he is being tried separately. Also, parents are among the 7 charged in the case. Kinda misleading headlines. Man only if it were the US or some other country, this guy would be serving a life sentence. Absolutely pathetic. Genie: you will have a wikipedia page about you. Kid: yay! The page: Why did high court give relief to the family? When it comes to higher courts media is reluctant to criticize their decisions fearing repercussions Laws do exist in this country.. but only for the poor & middle class. The system works to protect the rich. That’s the state of this country. An incident that happened with me - I was driving one night on a highway and I overtook a fortuner that was moving rather slowly on the right lane (supposed to be the fast lane). That fortuner guy took this personally and came behind me for my life. Cutting and overtaking dangerously, while abusing & taunting me. My wife was in the car and she was expecting.. we were shit scared for our lives. The fortuner guy suddenly stopped in front of my car and those guys got out of the car. Luckily I had a bit of space to swerve and escape, and before they could get back inside their car and follow me, I lost them. I am still scared to think what would’ve happened that night. The fortuner had a sticker of a political party on front and back screen.. so I’m sure if me and my wife had been killed that day, there would’ve been no repercussions. That was the day I realised, the country where I pay lakhs of rupees in taxes, can’t guarantee my safety, nor would they punish the wrongdoers. The next day I started applying jobs abroad and moved out. Road accidents and road rage happens everywhere but the judiciary should be able to punish the people who do the wrong things so they’re scared to do it. These guys (who are rich or politically connected) feel like they can do anything and get away with it. No where in the world should this be ok. But this is the state of things in our country. And don’t think anything will change at least for the next two generations. It might get worse before it gets better, but hopefully one day it will. What pains me is that people caught transporting meat can be lynched before verifying if it’s beef but others can mow down humans and get off scot free in broad daylight. What a country we live in!! The Gods must be wondering why they made us! It was only used as a meme material ( and bar bar ek meme dekh kar bore hojate h log isliye chalagaya ye topic ab kisi ko ghanta kuch farak nhi padhta h ) A pretty bad idea, but we need vigilante hacker groups like Anonymous in India. If the judiciary and executive committees can't do stuff, I bet these folks definitely could. Pay 50% taxes and forget about it In my opinion (so feel to disagree) this is a systematic problem where it’s become easy to rig the system with money. And systematic problems require a thorough clean up, such vigilante groups may cause an uproar every now and then but won’t really solve anything. Remember the data leaks on panama papers, swiss accounts and so on, do you remember any of those? Did anything happen cause of them? Had it not been for that essay punishment, 99% people wouldn't even be aware of that accident. >This is what the value of life has become in our country. Its always been like this. Please x-post this on r/Maharashtra too. What did you expect ?? Maine toh bola hi tha ye niklega. We either need aparchit or we need bandit queen, because someday people will take laws into their own hands. Oh gosh this has so much worse things So what can we do. Any action plans? This porche case and that prajwal revanna case... Noone is talking about it /By the time the order of any judicial authority comes, the internet would have forgotten, as always. This has always been the case. so sorry that happened to you. and +1 for laws only existing for poor and middle class people. similar story i have, sibling and grandparent were injured heavily in an almost hit and run by a drunk student who was speeding and also not on the correct side of the road. police never did a drug or alcohol test on him even though witnesses reported him being visibly drunk. they made up theories that he never took a road witnesses reported him taking because their theory would've made it impossible for him to be speeding as there was a turn. been more than 2 years, we are still awaiting his punishment despite my own parent being an advocate. guy is chilling out abroad with no repercussions for the lives that he ruined Galti humari hai, hum log bahut jaldi used-to ho jaate hain. Ek aisa haadsa hota hai toh channel badal-badalke saara maajra dekh liya, SMS kiya, phone kiya, shukar manaya ki hum log bach gaye aur fir hum us situation se ladne ke bajaaye, uske saath adjust karna shuru kar dete hain ~ A Wednesday lol no!! Read more on this From wiki: > The juvenile's 77-year-old grandfather is accused of abducting the driver who was present at the time of the accident and forcing him to take the blame. > The blood alcohol test of the minor was delayed by more than 8 hours - enough time for alcohol to be flushed out of the body. > Two senior doctors from the Sassoon Hospital were arrested for replacing blood samples taken from the accused. > The minor was allegedly served pizzas and burgers while under custody. > On 25 June, after a plea from the maternal aunt of the accused, the Bombay High Court directed the police to release the accused, declaring the previous remand order illegal and for the accused to be under the care and custody of the aunt. What a joke system. 😞 Not really Caitlin Jenner killed a Roman in a car crash too and nothing happened to her. Power works everywhere Unlivable day by day Our constitution is one of the best constitutions in the world without any doubt but the value for it is utterly down. Many Indians together will destroy the dignity of India for sure and with that being said I can truly accept the fact that now India has become one of the worst countries in the world. All credit goes to anachronism and illiterates. Btw my definition of illiterates is different as I call illiterate to those who are without wisdom or ethics. In india, mostly everyone lacks that fact that's why that 70% LITERATE population is actually nearby 10-20%. Anyways, I'm planning on leaving this country ASAP because who knows what can happen to you in this filthy place..... I’m saying in general, there are chances. Power works everywhere. When you have 1000Cr or more money, you’re essentially above the law. You can buy anyone. The fact that I have mutuals with this idiot is so much better. They’re defending him ,while his ex is shitting on him Ik I shouldn't be saying this but I really hope someone should sue him with false cases. Ik this is wrong, but 'bure loge ke saath bura hona chahiye.' Why would anyone defend him? We are in the eastern version of Wild Wild West. Erratic Eccentric East. Because they see themselves in him. ‘He was drunk, it was a small mistake’ Unfortunately we Indians being cowards have let down the families of the victims. Just remember that tomorrow if this happens to you or your family member no one will raise a voice for you either. No, no, no!!! They don’t think they can getaway with anything… they KNOW they can get away with anything!!! Jai Hind. Yes and most of the times they do get away with it. The MLAs, MPs, their connections kind of rule the place where they are elected while they should serve the people. See them parading around in their fortuners with 12 bouncer like bodyguards and people falling on their feet. This worship culture should end. You get your answer when you reply to the question: how do the netas afford those bodyguards and other perks Same will happen to rowdy actor Darshan in Bangalore no god may have brought popcorn because they never imagined this would be this circus that anyone would like to buy ticket for. wish i have 1 poison that i can pour into every primary school child which will stay in their veins for 50 yrs. poison would be 'Adarsh Insaan''"
}