{
    "id": "1e5h0bn",
    "title": "Got scammed 10x by UBER motto, charged for a failed transaction which happened 5 years back. ",
    "url": "https://www.reddit.com/gallery/1e5h0bn",
    "selftext": "Brutally scammed by UBER moto, paid 10x the original amount.\nTook a uber moto which showed a fare of Rs67, when the driver ended the ride it displayed Rs 685 on his side.\nWhile I argued that I would only pay the amount (Rs 67) which was visible only on my screen he showed me I had previous dues which I clearly don't remember of because I have used the app frequently and was never notified of the dues.\n\nHad to pay him the amount since I was alone and it was not worth arguing, assuming the customer care would help me if I raised a ticket. Unfortunately UBER has the worst customer care, for next 48 hours they kept apologizing and guaranting to offer better services, but never solved my issue. They clearly mentioned they could do nothing from their side.\nAfter raising another ticket they send me a break down that I had failed a transaction for my UBER eats order in 2019,like 5 years.\n\nI wonder why I was never informed from UBER that I had to owe them money. While I clearly don't remember using UBER eats 必",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 4,
    "created_utc": 1721219453.0,
    "convurl": "https://i.redd.it/maedenh4p2dd1.jpg",
    "comments": [
        "U can be petty and go to consumer court.",
        "Ha toh khilaya tha 5 saal agey tab toh tumne mauj manaya tha. Ab toh dena bhi parega na?",
        "Arey why have they waited 5 years,have been using uber to book rides frequently,never did they add this fare?And I have never used uber eats before 不不",
        "不不"
    ],
    "cleaned_text": "got scammed x uber motto charged failed transaction happened years back brutally scammed uber moto paid x original amount took uber moto showed fare rs driver ended ride displayed rs side argued would pay amount rs visible screen showed previous dues clearly dont remember used app frequently never notified dues pay amount since alone worth arguing assuming customer care would help raised ticket unfortunately uber worst customer care next hours kept apologizing guaranting offer better services never solved issue clearly mentioned could nothing side raising another ticket send break failed transaction uber eats order like years wonder never informed uber owe money clearly dont remember using uber eats ",
    "cleaned_title": "got scammed x uber motto charged failed transaction happened years back",
    "cleaned_selftext": "brutally scammed uber moto paid x original amount took uber moto showed fare rs driver ended ride displayed rs side argued would pay amount rs visible screen showed previous dues clearly dont remember used app frequently never notified dues pay amount since alone worth arguing assuming customer care would help raised ticket unfortunately uber worst customer care next hours kept apologizing guaranting offer better services never solved issue clearly mentioned could nothing side raising another ticket send break failed transaction uber eats order like years wonder never informed uber owe money clearly dont remember using uber eats",
    "cleaned_comments": "u petty go consumer court ha toh khilaya tha saal agey tab toh tumne mauj manaya tha ab toh dena bhi parega na arey waited yearshave using uber book rides frequentlynever add fareand never used uber eats",
    "light_cleaned_title": "Got scammed 10x by UBER motto, charged for a failed transaction which happened 5 years back.",
    "light_cleaned_selftext": "Brutally scammed by UBER moto, paid 10x the original amount. Took a uber moto which showed a fare of Rs67, when the driver ended the ride it displayed Rs 685 on his side. While I argued that I would only pay the amount (Rs 67) which was visible only on my screen he showed me I had previous dues which I clearly don't remember of because I have used the app frequently and was never notified of the dues. Had to pay him the amount since I was alone and it was not worth arguing, assuming the customer care would help me if I raised a ticket. Unfortunately UBER has the worst customer care, for next 48 hours they kept apologizing and guaranting to offer better services, but never solved my issue. They clearly mentioned they could do nothing from their side. After raising another ticket they send me a break down that I had failed a transaction for my UBER eats order in 2019,like 5 years. I wonder why I was never informed from UBER that I had to owe them money. While I clearly don't remember using UBER eats 必",
    "light_cleaned_comments": "U can be petty and go to consumer court. Ha toh khilaya tha 5 saal agey tab toh tumne mauj manaya tha. Ab toh dena bhi parega na? Arey why have they waited 5 years,have been using uber to book rides frequently,never did they add this fare?And I have never used uber eats before 不不 不不"
}