{
    "id": "12wi2va",
    "title": "Why are whistleblowers being harassed rather than being protected? Story",
    "url": "https://twitter.com/theliverdr/status/1649463651290730497?s=46&t=MYveCFFZB2m3TMhk_YI_Xw",
    "selftext": "Delhi police working for protein drink makers!",
    "flair": "AskIndia",
    "score": 313,
    "num_comments": 28,
    "created_utc": 1682269078.0,
    "convurl": "https://external-preview.redd.it/ZYKtet84w-XWDy1V7npjgGJatwT-Zye9LuClbKJh25U.jpg?auto=webp&v=enabled&s=395a887c1d2d45ae307951eb45cdc124d3b3eb2e",
    "comments": [
        "Just heard this the other day\n\n*dalli police, dalli police*",
        "Legend has it, that Delhi police is still looking for Komal Sharma",
        "hey, you do the right thing, the devil will send a gift.",
        "Can we atleast get the full story before judging anyone?",
        "Is the owner someone influential enough to get senior ranking pulis involved?",
        "Never trusted any supplement provider. On research papers Whey did makes sense, but from practical POV, natural products like Milk and Eggs provide more bang for the buck so to speak",
        "What kind of country do you think we are? A just and democratic one?",
        "Are muscleblaze protien fine, I think there lab test are successful.",
        "VishwaGuru ka Vardaan hai ye… Tum ise Abhishaap samajhta hai murkh… Jihadi hai Tu… Tere Ghar ko Bulldozer se todke tera “situation in two people meet” karaenge !!! PUN !!!!",
        "Please click the twitter link for detailed story",
        "[Bhaiyyon, ye dekho phuddu police](https://youtu.be/KjS3GfQwd6U?t=56).",
        "My dad was a whistleblower. Dude had been promoted 7 times to the C suite in 12 years.\n\nHe found board members doing fraud. His entire career was blocked for over 3 years as he was “suspended with benefits”. \n\nHe got his job back years later, but he no longer had any interest. They took a dude with immense passion and a lot of awards and recognition and took it all out of him.\n\nIt’s just not worth it. Lie, cheat and have no shame.",
        "In the aftermath of IAC movement this govt enacted a really weak Whistleblowers Protection law (only for govt wrongs, CVC the main body) but vacillated in enforcing it. It has not been notified even now. Whistleblowers are seen as snitch in our institutions. People involved in institutions try to save their own even in case of gross misconduct and wrongs.",
        "Atleast read the thread.\n\nThese people are clearly doing lab tests to find out issues with protein supplements being sold in the market.\n\nThere are new brands popping up everyday and no regulations/testing agency controls them.",
        "Is twitter not limited to 160 characters anymore?",
        "If you're looking to increase your protein intake holding all other variables constant, whey is probably going to be the cheapest and most practical option. One scoop of whey is much easier than eating 4 egg whites or 3-4 glasses of milk, not to mention the additional macros that you need to account for.\n\nYou should still get most of your protein from whole foods, but there's nothing wrong with a scoop of good quality whey. There are plenty of reputable supplement providers that have been tested thoroughly.",
        " Arpit Mangal guy from All about nutrition/Trustified.The person who exposes bs of such companies.\n\nI remember top influential guys like Jeremy Buendia, Ravneer were responsible for big muscles's growth in such small time frame",
        "\"In the west, whistleblowers are like Voldemort - you are literally not allowed to say their name, but in India, they're like Rahul - *Naam toh suna hoga*\"\n\n- On Air with AIB",
        "Twitter blue subscription gets rid of that limit.",
        "Government works for ultra rich and not for common man. This is known fact (atleast in India )",
        "Seems so. One does not start a protein supplement company just 2 years after graduating from a no name college without significant financial or political muscle.",
        ">cheapest and most practical option\n\nPractical, yes. Cheapest, Hell no.\n\nA single scoop (\\~25g protein) of any reliable brand (ON) costs about Rs100. 4 eggs give similar amounts and cost about Rs 25 (Rs 60 if you only eat whites). Chicken is by far the most economical and practical option.\n\nSupplements are practical if your protein requirement is quite high (>150g/day) and you have to control calorie intake. And if you are a vegetarian with lots of money.",
        "Eggs are a lot more work than just tossing a scoop into a shaker. There are plenty of excellent whey brands at rs 2000/kilo. Also, some people are vegetarian/can't handle eggs in their diet. I had to choke down 8-10 egg whites a day in college to hit my macros and actually recover from my training, it was pretty terrible for me and arguably just as bad for my unfortunate roommate. Never going back to that.\n\nI'm not saying whey/casein is a must have, I'm saying demonising or discarding it as an option is foolish. It's a good, convenient option for many people.",
        ">There are plenty of excellent whey brands at rs 2000/kilo\n\nPlease do share the brand names.\n\nAlso, even Rs 2000/kg is still Rs 60 for a scoop. Quite expensive.\n\nI am not demonising supplements. As I mentioned in my last sentence, they are a good option for vegetarians with a lot of money. Hitting 120g+ using a protein diet will require 2/3 scoops + other food. That's over Rs 200 per day just for protein.",
        "There is no Whistleblower protection in India",
        "Because whistle blowers are non trustworthy backstabbing people"
    ],
    "cleaned_text": "whistleblowers harassed rather protected story delhi police working protein drink makers ",
    "cleaned_title": "whistleblowers harassed rather protected story",
    "cleaned_selftext": "delhi police working protein drink makers",
    "cleaned_comments": "heard day dalli police dalli police legend delhi police still looking komal sharma hey right thing devil send gift atleast get full story judging anyone owner someone influential enough get senior ranking pulis involved never trusted supplement provider research papers whey makes sense practical pov natural products like milk eggs provide bang buck speak kind country think democratic one muscleblaze protien fine think lab test successful vishwaguru ka vardaan hai ye tum ise abhishaap samajhta hai murkh jihadi hai tu tere ghar ko bulldozer se todke tera situation two people meet karaenge pun please click twitter link detailed story bhaiyyon ye dekho phuddu policehttpsyoutubekjsgfqwdut dad whistleblower dude promoted times c suite years found board members fraud entire career blocked years suspended benefits got job back years later longer interest took dude immense passion lot awards recognition took worth lie cheat shame aftermath iac movement govt enacted really weak whistleblowers protection law govt wrongs cvc main body vacillated enforcing notified even whistleblowers seen snitch institutions people involved institutions try save even case gross misconduct wrongs atleast read thread people clearly lab tests find issues protein supplements sold market new brands popping everyday regulationstesting agency controls twitter limited characters anymore youre looking increase protein intake holding variables constant whey probably going cheapest practical option one scoop whey much easier eating egg whites glasses milk mention additional macros need account still get protein whole foods theres nothing wrong scoop good quality whey plenty reputable supplement providers tested thoroughly arpit mangal guy nutritiontrustifiedthe person exposes bs companies remember top influential guys like jeremy buendia ravneer responsible big muscless growth small time frame west whistleblowers like voldemort literally allowed say name india theyre like rahul naam toh suna hoga air aib twitter blue subscription gets rid limit government works ultra rich common man known fact atleast india seems one start protein supplement company years graduating name college without significant financial political muscle cheapest practical option practical yes cheapest hell single scoop g protein reliable brand costs rs eggs give similar amounts cost rs rs eat whites chicken far economical practical option supplements practical protein requirement quite high gday control calorie intake vegetarian lots money eggs lot work tossing scoop shaker plenty excellent whey brands rs kilo also people vegetariancant handle eggs diet choke egg whites day college hit macros actually recover training pretty terrible arguably bad unfortunate roommate never going back im saying wheycasein must im saying demonising discarding option foolish good convenient option many people plenty excellent whey brands rs kilo please share brand names also even rs kg still rs scoop quite expensive demonising supplements mentioned last sentence good option vegetarians lot money hitting g using protein diet require scoops food thats rs per day protein whistleblower protection india whistle blowers non trustworthy backstabbing people",
    "light_cleaned_title": "Why are whistleblowers being harassed rather than being protected? Story",
    "light_cleaned_selftext": "Delhi police working for protein drink makers!",
    "light_cleaned_comments": "Just heard this the other day *dalli police, dalli police* Legend has it, that Delhi police is still looking for Komal Sharma hey, you do the right thing, the devil will send a gift. Can we atleast get the full story before judging anyone? Is the owner someone influential enough to get senior ranking pulis involved? Never trusted any supplement provider. On research papers Whey did makes sense, but from practical POV, natural products like Milk and Eggs provide more bang for the buck so to speak What kind of country do you think we are? A just and democratic one? Are muscleblaze protien fine, I think there lab test are successful. VishwaGuru ka Vardaan hai ye… Tum ise Abhishaap samajhta hai murkh… Jihadi hai Tu… Tere Ghar ko Bulldozer se todke tera “situation in two people meet” karaenge !!! PUN !!!! Please click the twitter link for detailed story [Bhaiyyon, ye dekho phuddu police](https://youtu.be/KjS3GfQwd6U?t=56). My dad was a whistleblower. Dude had been promoted 7 times to the C suite in 12 years. He found board members doing fraud. His entire career was blocked for over 3 years as he was “suspended with benefits”. He got his job back years later, but he no longer had any interest. They took a dude with immense passion and a lot of awards and recognition and took it all out of him. It’s just not worth it. Lie, cheat and have no shame. In the aftermath of IAC movement this govt enacted a really weak Whistleblowers Protection law (only for govt wrongs, CVC the main body) but vacillated in enforcing it. It has not been notified even now. Whistleblowers are seen as snitch in our institutions. People involved in institutions try to save their own even in case of gross misconduct and wrongs. Atleast read the thread. These people are clearly doing lab tests to find out issues with protein supplements being sold in the market. There are new brands popping up everyday and no regulations/testing agency controls them. Is twitter not limited to 160 characters anymore? If you're looking to increase your protein intake holding all other variables constant, whey is probably going to be the cheapest and most practical option. One scoop of whey is much easier than eating 4 egg whites or 3-4 glasses of milk, not to mention the additional macros that you need to account for. You should still get most of your protein from whole foods, but there's nothing wrong with a scoop of good quality whey. There are plenty of reputable supplement providers that have been tested thoroughly. Arpit Mangal guy from All about nutrition/Trustified.The person who exposes bs of such companies. I remember top influential guys like Jeremy Buendia, Ravneer were responsible for big muscles's growth in such small time frame \"In the west, whistleblowers are like Voldemort - you are literally not allowed to say their name, but in India, they're like Rahul - *Naam toh suna hoga*\" - On Air with AIB Twitter blue subscription gets rid of that limit. Government works for ultra rich and not for common man. This is known fact (atleast in India ) Seems so. One does not start a protein supplement company just 2 years after graduating from a no name college without significant financial or political muscle. >cheapest and most practical option Practical, yes. Cheapest, Hell no. A single scoop (\\~25g protein) of any reliable brand (ON) costs about Rs100. 4 eggs give similar amounts and cost about Rs 25 (Rs 60 if you only eat whites). Chicken is by far the most economical and practical option. Supplements are practical if your protein requirement is quite high (>150g/day) and you have to control calorie intake. And if you are a vegetarian with lots of money. Eggs are a lot more work than just tossing a scoop into a shaker. There are plenty of excellent whey brands at rs 2000/kilo. Also, some people are vegetarian/can't handle eggs in their diet. I had to choke down 8-10 egg whites a day in college to hit my macros and actually recover from my training, it was pretty terrible for me and arguably just as bad for my unfortunate roommate. Never going back to that. I'm not saying whey/casein is a must have, I'm saying demonising or discarding it as an option is foolish. It's a good, convenient option for many people. >There are plenty of excellent whey brands at rs 2000/kilo Please do share the brand names. Also, even Rs 2000/kg is still Rs 60 for a scoop. Quite expensive. I am not demonising supplements. As I mentioned in my last sentence, they are a good option for vegetarians with a lot of money. Hitting 120g+ using a protein diet will require 2/3 scoops + other food. That's over Rs 200 per day just for protein. There is no Whistleblower protection in India Because whistle blowers are non trustworthy backstabbing people"
}