{
    "id": "1d3x176",
    "title": "I wish I could K**l a Muslim Infant",
    "url": "https://www.reddit.com/gallery/1d3x176",
    "selftext": "A group on Instagram fantasizing about SAing distraught mothers from Gaza. Truly a bright future awaits us...\n\nI don't understand what drives this much hate? Even an ardent Islam opposer like Macron is speaking out against Israel now but for some reason Indian RW is the only group with blinding hate",
    "flair": "Crime",
    "score": 49,
    "num_comments": 35,
    "created_utc": 1717048586.0,
    "convurl": "https://i.redd.it/xa54sowz6i3d1.jpg",
    "comments": [
        "Let them cook.... i like where this is going",
        "damn...that's so fcked up . This is where our kattar Hinduism has reached so far. OfCourse most Indians support Israel  in this situation but having these thoughts that too on the distraught mothers amidst this living hell, they are no better than terrorists",
        "when we see anything divisive:\n\nreport + block + ignore/ forget the hate message.",
        "Where do you think this is going? Just curious",
        "Bro what is wrong with you?",
        "Instagram must require aadhar card registration and comments and group chats must be monitored by the app, insta comments and group chats are plainly evil and vile, people show their true selves when they are able to post it online",
        "Nothing.....",
        "Somewhere blissful and peaceful. I land with no muslim aka terrorists",
        "Loser",
        "Oh my god how do you know that??",
        "Kindly post uncensored version of the chat",
        "I am glad I have never been on Insta, and don't ever plan to be either. I can really do without such filth in my life",
        "Psychopath",
        "What the fuck is this",
        "Hate filled degeneracy",
        "Report it",
        "bad idea man, I don't even like using my mobile number for making accounts for social media, specially for company like facebook.",
        "You think that sh!t ever works?",
        "Thanks to anonymity on the internet, people can be the worst version of themselves and get away with it",
        "Don't waste your time trying to talk and argue with these people. Having lost the ability to think independently, they can only spew hatred.",
        "It's just sad people like this exist man.",
        "Yeah man these people have their humanity",
        "Keep dreaming,son.",
        "People are inherently capable of Evil. You need to just tell them \"Its right\" \"It's Justice\" and if good number of people start believing you, you now have a army of fools who will commit any crime in the name of good.",
        "Mazhab nahi sikhata aapas me bair rakhna? \n\nJust like terrorists don't have a religion, these comments do not have a religion. These are just random shittiest souls on earth.",
        "These are definately hindus disguised as muslims sensing these messages from some other country.",
        "Their hate has crossed a level where they don't know anything about the good teachings of that religion. They are like criminals who haven't committed any crime yet. Humanity is getting lost, and ego-driven wars are ongoing.",
        "They will simply migrate over to other apps such as discord",
        "Instagram is a platform for sole purpose of spreading hate and bigotry, it must be monitored or restricted",
        "It most likely won't help and just make it worse for people who didn't do anything. Think of these site like tool, most people will use hammer how it should be used for nailing nails or removing nails, but someone can misuse it for other thing bad or just wrong, we won't monitoring everyone who uses a hammer or restrict it for people to buy. \n\nEven if we do just that the person misusing a tool will just change it's tool."
    ],
    "cleaned_text": "wish could kl muslim infant group instagram fantasizing saing distraught mothers gaza truly bright future awaits us dont understand drives much hate even ardent islam opposer like macron speaking israel reason indian rw group blinding hate ",
    "cleaned_title": "wish could kl muslim infant",
    "cleaned_selftext": "group instagram fantasizing saing distraught mothers gaza truly bright future awaits us dont understand drives much hate even ardent islam opposer like macron speaking israel reason indian rw group blinding hate",
    "cleaned_comments": "let cook like going damnthats fcked kattar hinduism reached far ofcourse indians support israel situation thoughts distraught mothers amidst living hell better terrorists see anything divisive report block ignore forget hate message think going curious bro wrong instagram must require aadhar card registration comments group chats must monitored app insta comments group chats plainly evil vile people show true selves able post online nothing somewhere blissful peaceful land muslim aka terrorists loser oh god know kindly post uncensored version chat glad never insta dont ever plan either really without filth life psychopath fuck hate filled degeneracy report bad idea man dont even like using mobile number making accounts social media specially company like facebook think sht ever works thanks anonymity internet people worst version get away dont waste time trying talk argue people lost ability think independently spew hatred sad people like exist man yeah man people humanity keep dreamingson people inherently capable evil need tell right justice good number people start believing army fools commit crime name good mazhab nahi sikhata aapas bair rakhna like terrorists dont religion comments religion random shittiest souls earth definately hindus disguised muslims sensing messages country hate crossed level dont know anything good teachings religion like criminals havent committed crime yet humanity getting lost egodriven wars ongoing simply migrate apps discord instagram platform sole purpose spreading hate bigotry must monitored restricted likely wont help make worse people didnt anything think site like tool people use hammer used nailing nails removing nails someone misuse thing bad wrong wont monitoring everyone uses hammer restrict people buy even person misusing tool change tool",
    "light_cleaned_title": "I wish I could K**l a Muslim Infant",
    "light_cleaned_selftext": "A group on Instagram fantasizing about SAing distraught mothers from Gaza. Truly a bright future awaits us... I don't understand what drives this much hate? Even an ardent Islam opposer like Macron is speaking out against Israel now but for some reason Indian RW is the only group with blinding hate",
    "light_cleaned_comments": "Let them cook.... i like where this is going damn...that's so fcked up . This is where our kattar Hinduism has reached so far. OfCourse most Indians support Israel in this situation but having these thoughts that too on the distraught mothers amidst this living hell, they are no better than terrorists when we see anything divisive: report + block + ignore/ forget the hate message. Where do you think this is going? Just curious Bro what is wrong with you? Instagram must require aadhar card registration and comments and group chats must be monitored by the app, insta comments and group chats are plainly evil and vile, people show their true selves when they are able to post it online Nothing..... Somewhere blissful and peaceful. I land with no muslim aka terrorists Loser Oh my god how do you know that?? Kindly post uncensored version of the chat I am glad I have never been on Insta, and don't ever plan to be either. I can really do without such filth in my life Psychopath What the fuck is this Hate filled degeneracy Report it bad idea man, I don't even like using my mobile number for making accounts for social media, specially for company like facebook. You think that sh!t ever works? Thanks to anonymity on the internet, people can be the worst version of themselves and get away with it Don't waste your time trying to talk and argue with these people. Having lost the ability to think independently, they can only spew hatred. It's just sad people like this exist man. Yeah man these people have their humanity Keep dreaming,son. People are inherently capable of Evil. You need to just tell them \"Its right\" \"It's Justice\" and if good number of people start believing you, you now have a army of fools who will commit any crime in the name of good. Mazhab nahi sikhata aapas me bair rakhna? Just like terrorists don't have a religion, these comments do not have a religion. These are just random shittiest souls on earth. These are definately hindus disguised as muslims sensing these messages from some other country. Their hate has crossed a level where they don't know anything about the good teachings of that religion. They are like criminals who haven't committed any crime yet. Humanity is getting lost, and ego-driven wars are ongoing. They will simply migrate over to other apps such as discord Instagram is a platform for sole purpose of spreading hate and bigotry, it must be monitored or restricted It most likely won't help and just make it worse for people who didn't do anything. Think of these site like tool, most people will use hammer how it should be used for nailing nails or removing nails, but someone can misuse it for other thing bad or just wrong, we won't monitoring everyone who uses a hammer or restrict it for people to buy. Even if we do just that the person misusing a tool will just change it's tool."
}