{
    "id": "12tol4n",
    "title": "I see a lot of people wanting depopulation here.",
    "url": "https://www.reddit.com/r/india/comments/12tol4n/i_see_a_lot_of_people_wanting_depopulation_here/",
    "selftext": "as the title says, i find it a little bit concerning that people advocate for this to happen, which in my opinion is very strange. So i wanted to provide a counter argument to some of the people who genuinely want the population to rapidly decrease.\n\n1. Our population is already under replacement, so i think this is the best scenario it could have been, as the government hasn't crumbled handling it all yet, and it will reach a plateau eventually.\n\n2.Placing laws such as china's one child policy , would absolutely crush future generations with an excess amount of elderly to take care of but not enough of the working & spending population (20s 30s 40s i think)\n\n3. The most important to me, and often feels like what is the core issue here, yet what people are avoiding in favour of these bandage solutions. Rising income inequality.\nI am not educated enough to explain this topic without butchering it so please read this [report](https://www.oxfam.org/en/india-extreme-inequality-numbers).\ni think our priorities should be adjusted.\nwe can still work with this much population.",
    "flair": "Politics",
    "score": 138,
    "num_comments": 90,
    "created_utc": 1682046751.0,
    "convurl": "https://external-preview.redd.it/0nlWeD3EqBJrmu8a0i9DNboeSU4xS-HFt37j5aL5Ygw.jpg?auto=webp&v=enabled&s=f89e7bfee2a7efdaf70b5db7c0eac41a6feb81ce",
    "comments": [
        "What do you mean under replacement?",
        "Total fertility rate (TFR) has reached 2.1. I think he means that.",
        "I've got a feeling urban India will go the Japan way in the next 30 years, and personally speaking I'll never have kids either but rural India will be unbothered by anything and keep living the way they've been.",
        "So in simple terms  population is said to be at replacement when total births in a year = total deaths basically the number of people stay constant as those who die get replaced by new borns\n\nUnder replacement means rate of births per 1000 is less then rate of deaths per 1000 people\n\nMeaning population is decreasing",
        "We are about to catch a big fat L",
        "everyone already knows that if there were better job opportunities and income distribution then it's fine but everyone also knows that it's not gonna happen",
        "why are there so many ppl anyway 8 fucking billion?  gahdamn bruh chill",
        "The problem is TFR is not the same for every Religion and Community.\n\nPeople are worried more because of that.\n\nEdit - People have problems with hearing facts it seems.",
        "The current generation is mentally exhausted with the never ending race and fight for basic facilities, lack of decent standard of living, the toxic hate campaigns on internet finding new ways to divide the society every day. \n\nHuman connections are getting diluted, isolation and loneliness are at peaks. With all this procreation and raising Kids is something very few can manage and look forward to. Add to this the unhealed trauma many are carrying right from childhood. \n\nIt's not about Depopulation as an concept, it's slowly the inevitable reality.",
        "Indias greatest strength against china is our youth outnumber the old\n\nKeep pumping hinterland folks, keep humping, we need the numbers\n\nNow it’s up to the government and industrialists to leverage this strength for the betterment of the country",
        "Arguments can be made both ways. Should there be more population just to take care of old people. What about the inequality, quality of life who are already here. The density of our country is already too high and real estate is already not reachable for someone making 30k a month.",
        "Just say you hate muslims instead of hedging and people like YOU are the reason the country is going to hell in hateful basket.",
        "If you decide to provide a 'counter argument', then it is your duty to be extremely clear and unambiguous in your language and points. Unfortunately, your post is vague and doesn't entirely explain your thoughts or views. \n\nTum bolna kya chah rahe ho????",
        "![gif](giphy|26ueYUlPAmUkTBAM8)",
        "It's an absolute moronic thinking that India's population shouldn't be reduced.\n\nWe should remember that India is really really poor country. Average income for citizens are still unde 2500 dollar (this includes billionaire like Ambani adani etc). We are no Japan, Singapore or even China. India failed to capitalise the industrial power like china due to stupid socialist policies and licence raj. Now comes the age of automation and AI. Are we going to win this time. I guess no ! . Out of this 1.3 billion the best are leaving the country to US and other countries. Our overpopulation is mostly contributed by shithole states like U.P and Bihar were average income is even less than 75 thousand rupees !!!.\n\nThe best thing to do is slow down the damn population.",
        ">Is this really a reason to have more than one kid? Like, seriously? Is the ultimate wet dream of Indian parents is that their kids can take care of them?\n\nThis not for parents to have children to take care of them in future, but there would be a need for future taxpayers and workers in the economy. Better way to say this would be an economy needs younger population to thrive as old do not work more and require pensions and healthcare. With declining birth rates sustaining the pensions would be a problem. This would lead to increase in retirement age which the general population does not want.  \n\n\nEdit: This being said India’s TFR is somewhere between 2.0-2.1 which is at replacement region. Basically, if left alone population will stagnant and reduce in the future. What we need to concentrate now is own improving youth emplyment, education, healthcare and infrastructure. We should plan such that people should stop leaving and start contributing to economy here.",
        "That's because a few people are hoarding real estate and jacking up the price.",
        "Don't worry guys, i am on it. I'll have 10 kids to bring our fertility rate back up.",
        "You know that under replacement thing isn't going to make a dent on any of ours quality of lives right? That will impact us in 50-60 years, by that time most of us would be old farts and even then the population would be insanely high. \n\nPeople are frustrated because there's way too much competition for earning basic necessities in India. A degree can't land you a job, go outside of STEM and you can't guarantee you'd be able to feed yourself for the next 10-20 years. Can you guarantee jobs for all in India? The western countries are able to because they have less people and more jobs. Sure they have competition too but a hard working person will be able to live a comfortable life there. But not in India. Indians love to talk and say that all fields are equal but in practice we know that tech is the only field that matters here. Get into arts and see how difficult it is for them to survive especially in this economy.",
        "Lack of hobbies lol",
        "Nothing is strange about depopulation. The total fertility rate in Korea, Singapore, Japan and many developed economies is less than 1.5 - you can always create immigration policies (to get the right pool of highly skilled and blue collar migrants) Similar thing is happening with the North Indian migration to South India.\n\nWith more education comes more empowerment. With increased expenses, demanding careers , increasing cost of healthcare and more importantly traditional gender roles, where a man simply puts the burden of raising a kid on a woman - many women are choosing to have less or no children. Nothing is inherently wrong in that. \n\nThere are bigger disasters like climate change which are upon us not some issues like depopulation - which doesn’t affect anyone.\n\nIt took us 20 centuries to create a Billion - in 120 years we reached 8 Billion. So no - we can easily go back to less population",
        "I volunteer as tribute",
        "haha equal income distribution under capitalism (laughs to sadness)",
        "Welcome back to Capitalism!",
        "Lack of education and people with lower socioeconomic status thinking more people = more income",
        "A family regardless of their religion, if they're socially low, they'll have more children. You bigot",
        "What the use if we are under replacement ? We should be 5-6 times under replacement. For a country of our size somewhere between 300-400 million people is the right number. This will essentially destroy reservation systems and caste problems as all of us need to come together and make value to increase our GDP",
        "Check this post then https://swarajyamag.com/insta/it-will-be-a-muslim-majority-nation-right-in-your-face-canadian-muslim-admits-reproducing-more-for-demographic-power-demands-sharia",
        "Yes, one man is everyone.",
        "Most people never think beyond whatever was spoonfed to them in school. Hence this insistence that depopulation is a solution to everything",
        "So much wrong here... firstly India is quite a state held economy even now so saying that it's capitalist is inaccurate.\n\n2ndly equal income distribution doesn't mean better lives objectively...you can have low income distribution for all too....just like Bihar has. So don't eulogise something without considering it's ACTUAL consequences",
        "This is what happened in conservative developed Asian countries like Korea, Singapore & Hong Kong too and will most likely happen in India albeit slowly. \n\nIndia is still a very conservative society and will need to accept men/women choosing to be single or not have kids. Even urban cities have a long way to go I think. \n\nPersonally, I don’t want to take responsibility for raising a kid and it’s unfair on my partner to raise the child alone. A lot of us men are supporting our partners and choosing to be child free",
        "Richest 1% own 40.5% of India's wealth.",
        "Hahahaha! \n\nTell me anything incorrect about my Comment ! Instead of name calling. 😅",
        "Capitalism is defined as a economic system where the means of production are owned by private people, 99% of production is done by private businesses, and very little by the state yes the state regulates and taxes the economy but barely participates in it, so we can say that india is a capitalist or mixed system at max\n\nequal distribution of income is quite literally the best way to distribute income, it doesent guarentee happiness but if there is a way to distribute money for maximum happiness it is equal distribution or pretty close to it, marginal utility applies to money too.   \n\n\ni have no idea what an eulogy is google's definition doesent really apply in your usage so yeah...",
        ">so we can say that india is a capitalist or mixed system at max\n\nNo lol...India is a socialist economy just by the restrictions the government puts in businesses and prevents free movement of capital. And no 99% won't be the accurate number state is still very much involved\n\nNot to mention that before 1991 most of India's economic sectors were monopolised and private players were heavily regulated and that's not even subjective. And this tenure saw India's economy slumping and falling behind than that of Asian tigers\n\n>equal distribution of income is quite literally the best way to distribute income\n\nWhy does a person need to work if I'd get someone else's money?\n\n>i have no idea what an eulogy is\n\nI never said eulogy...I said eulogise very different words.",
        "yeah yeah eulogise i googled it and it didnt really make sense in the sentence which is why i asked,\n\nindia is NOT socialist, socialism is when the means of production are owned by society or most of the times the govt.\n\nthe means of production means factories, farms etc. basically anything that helps in the process of production, in india these are owned by private indivisuals therefore india is not a socialist economy. restrictions dont make socialism, ownership does, restrictions make a mixed economy\n\nNot to mention that before 1991 most of India's economic sectors were monopolised and private players were heavily regulated and that's not even subjective. And this tenure saw India's economy slumping and falling behind than that of Asian tigers , not sure how this is relevant to my comment\n\nWhy does a person need to work if I'd get someone else's money?i realiste that, which is why is said, OR PRETTY CLOSE TO IT.\n\nside note:  most of India's economic sectors were monopolisedmonopolies arent necessarily a bad thing, for example without a monopoly it would be impossible to avoid employing child labour (assuming there are no restrictions and there is \"free movement of capital\")anyone that chooses to employ not child labourers would have to price their products higher and therefore be out of a job if he/she does not do so. not  to mention higher profits lead to more expansion so naturally people that employ child labourers would expand\n\nin a monopoly however there would be no competition and therfore no need to employe child labourers",
        ">yeah yeah eulogise i googled it and it didnt really make sense in the sentence which is why i asked\n\nIt does make sense... eulogising equality of income distribution as if it's a virtue is not necessarily good coz everybody can be equally poor.\n\n\n>india is NOT socialist, socialism is when the means of production are owned by society or most of the times the govt.\n\nLol and it's not owned by the government? India literally has PSUs. India has public owned banks, public insurer etc. \n\n>restrictions dont make socialism, ownership does, restrictions make a mixed economy\n\nThey do... socialism means goverment intervention in economy and the restrictions are government intervention in economy.\n\n>the means of production means factories, farms etc. basically anything that helps in the process of production\n\nIndia own PSUs infact had monopoly over many industries till 1991, farms are heavily state regulated via the Mandi system.\n\n>most of India's economic sectors were monopolisedmonopolies arent necessarily a bad thing, for example without a monopoly it would be impossible to avoid employing child labour\n\nLol firstly India didn't end child labor with that, secondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy.\n\n>not to mention higher profits lead to more expansion so naturally people that employ child labourers would expand\n\nThat's not true, capitalistic countries don't have child labor and it's NOT natural why would you let your child be employed in dangerous places? \nAnd as far as places like coffee shop etc. is concerned, teenagers SHOULD be able to have these  jobs it teaches a lot.\n\n>in a monopoly however there would be no competition and therfore no need to employe child labourers\n\nThat's SUCH an oversimplification which doesn't even address the issues, no competition means no innovation, means no one would have the incentive to work and be better.\n\nAnd again just making child labor an issue and you're forgetting that there are many other issues.",
        "It does make sense... eulogising equality of income distribution as if it's a virtue is not necessarily good coz everybody can be equally poor.ahh thanks for the clarification, what i actually meant is that if we have a set amount of resources and we want to maximise happiness distributing money almost equally will lead to maximum happiness, obviously if we dont have much of resources like bihar we cant do much about it, but unequal distribution would make it even worse.\n\nLol and it's not owned by the government? India literally has PSUs. India has public owned banks, public insurer etc.yes thats true, which is why it can be called a mixed economy, not socialismjust because 15% (rough guess no actual data) of businesses are owned by the govt does not make it socialism, all of the means of production have to be owned by govt for it to be socialism.\n\nLol firstly India didn't end child labor with that, secondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy.i was using child labour as an example, you can replace child labour with any bad thing you want for eg. paying workers shit, unethical business practices, giving bribes etc. etc. besides competition wastes a ton of resources that india cannot afford, why have 2 research labs separately reasearching the samething, when instead if they worker together they could get double the results.\n\nsecondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy.im not sure where you're getting this from, i mean youre literally just throwing it out there with no justification or sources, but anyway i would like the remind you the soviet union ws the first country to send a man to space and the first to send a manmade object to space and the first to send a living being to space. and it did all that while having less than 50 hours a week or working time (ILO data).\n\nmeans no one would have the incentive to work and be betterah yes the classic, well this can easily be remedied by having pay grades, you take the mean of working output of the workers of a certain proffession for example fishermen, lets say its 100 fishes per hour per fishermanyou give say 25% more fishes you get 25% more money simple. and if you give 25% less, you get 25% less",
        "I do not know why people think More Population = More workers. \n\nYou know criminals are part of population too? \n\nUnless we have high literacy and employment rate, more population is basically adding burden to the country. \n\nThe main issue I have with these conclusions is that these metrics are measured across whole country, when you should measure them on state by state (and go to district level for large states like UP) and decide policies there)",
        ">what i actually meant is that if we have a set amount of resources and we want to maximise happiness distributing money almost equally will lead to maximum happiness, obviously if we dont have much of resources like bihar we cant do much about it, but unequal distribution would make it even worse.\n\nIt's NOT a set amount of resources especially as far as income is convenient we constantly make more which is how world poverty has reduced from like 95% in early 1900s to basically 5-10% now.\n\n>etc.yes thats true, which is why it can be called a mixed economy, not socialismjust because 15% (rough guess no actual data) of businesses are owned by the govt does not make it socialism, all of the means of production have to be owned by govt for it to be socialism\n\nWhen the government owned most of the economy we faced shortages, long lines and bad quality of goods which depleted our resources and made our situation worse than it was before. \n\nNot to mention that government STILL intervenes massively in the economy. India ranks poorly in individual economic freedom index.\n\n>i was using child labour as an example, you can replace child labour with any bad thing you want for eg. paying workers shit, unethical business practices, giving bribes etc. etc. \n\nAnything take anything and it was a recipe for disaster, wages are not so simplistic where you can pay a sweeper a salary higher than they deserve and expect for this model to be sustainable. And you do realise bribery happens in government offices right? More government more corruption and more unethical practices.\n\n>besides competition wastes a ton of resources that india cannot afford, why have 2 research labs separately reasearching the samething, when instead if they worker together they could get double the results.\n\nCoz that's NOT how things work...most resources are wasted under government monopolies who can't accurately allocate resources.\n\nAnd competition is what makes innovation possible, two labs researching separately might come up with different solutions with one being better and ultimately benefiting us. Having one lab crushes this spirit and innovation altogether. Knowing you don't have to do anything to stay in business removes the necessary incentives.\n\nSimilar to what happened in India pre-1991 all innovation you see has happened in capitalistic countries NOT socialist countries.\n\n>m not sure where you're getting this from, i mean youre literally just throwing it out there with no justification or sources, but anyway i would like the remind you the soviet union ws the first country to send a man to space and the first to send a manmade object to space and the first to send a living being to space. and it did all that while having less than 50 hours a week or working time (ILO data).\n\nAnd what happened to it in the end? You do realise that it was the space and arms race that was one of the major reasons for the fall of the Soviet union.\n\nAnd it had long queues for food, shortages and a police state that would kill you for thinking anything that's different from the party line.",
        "> 1.Our population is already under replacement,\n\nNope. don't agree. it's India 2023 remember ? maybe in 2055...",
        "No, replacement of fertility means 2 parents are giving birth to two people, which leads to the population trending towards steady state in long terms.\n\nIndia will not reach population plateau for another 30 years even though the TFR is around 2 now"
    ],
    "cleaned_text": "see lot people wanting depopulation title says find little bit concerning people advocate happen opinion strange wanted provide counter argument people genuinely want population rapidly decrease population already replacement think best scenario could government hasnt crumbled handling yet reach plateau eventually placing laws chinas one child policy would absolutely crush future generations excess amount elderly take care enough working spending population think important often feels like core issue yet people avoiding favour bandage solutions rising income inequality educated enough explain topic without butchering please read reporthttpswwwoxfamorgenindiaextremeinequalitynumbers think priorities adjusted still work much population ",
    "cleaned_title": "see lot people wanting depopulation",
    "cleaned_selftext": "title says find little bit concerning people advocate happen opinion strange wanted provide counter argument people genuinely want population rapidly decrease population already replacement think best scenario could government hasnt crumbled handling yet reach plateau eventually placing laws chinas one child policy would absolutely crush future generations excess amount elderly take care enough working spending population think important often feels like core issue yet people avoiding favour bandage solutions rising income inequality educated enough explain topic without butchering please read reporthttpswwwoxfamorgenindiaextremeinequalitynumbers think priorities adjusted still work much population",
    "cleaned_comments": "mean replacement total fertility rate tfr reached think means ive got feeling urban india go japan way next years personally speaking ill never kids either rural india unbothered anything keep living way theyve simple terms population said replacement total births year total deaths basically number people stay constant die get replaced new borns replacement means rate births per less rate deaths per people meaning population decreasing catch big fat l everyone already knows better job opportunities income distribution fine everyone also knows gon na happen many ppl anyway fucking billion gahdamn bruh chill problem tfr every religion community people worried edit people problems hearing facts seems current generation mentally exhausted never ending race fight basic facilities lack decent standard living toxic hate campaigns internet finding new ways divide society every day human connections getting diluted isolation loneliness peaks procreation raising kids something manage look forward add unhealed trauma many carrying right childhood depopulation concept slowly inevitable reality indias greatest strength china youth outnumber old keep pumping hinterland folks keep humping need numbers government industrialists leverage strength betterment country arguments made ways population take care old people inequality quality life already density country already high real estate already reachable someone making k month say hate muslims instead hedging people like reason country going hell hateful basket decide provide counter argument duty extremely clear unambiguous language points unfortunately post vague doesnt entirely explain thoughts views tum bolna kya chah rahe ho gifgiphyueyulpamuktbam absolute moronic thinking indias population shouldnt reduced remember india really really poor country average income citizens still unde dollar includes billionaire like ambani adani etc japan singapore even china india failed capitalise industrial power like china due stupid socialist policies licence raj comes age automation ai going win time guess billion best leaving country us countries overpopulation mostly contributed shithole states like bihar average income even less thousand rupees best thing slow damn population really reason one kid like seriously ultimate wet dream indian parents kids take care parents children take care future would need future taxpayers workers economy better way say would economy needs younger population thrive old work require pensions healthcare declining birth rates sustaining pensions would problem would lead increase retirement age general population want edit said indias tfr somewhere replacement region basically left alone population stagnant reduce future need concentrate improving youth emplyment education healthcare infrastructure plan people stop leaving start contributing economy thats people hoarding real estate jacking price dont worry guys ill kids bring fertility rate back know replacement thing isnt going make dent quality lives right impact us years time us would old farts even population would insanely high people frustrated theres way much competition earning basic necessities india degree cant land job go outside stem cant guarantee youd able feed next years guarantee jobs india western countries able less people jobs sure competition hard working person able live comfortable life india indians love talk say fields equal practice know tech field matters get arts see difficult survive especially economy lack hobbies lol nothing strange depopulation total fertility rate korea singapore japan many developed economies less always create immigration policies get right pool highly skilled blue collar migrants similar thing happening north indian migration south india education comes empowerment increased expenses demanding careers increasing cost healthcare importantly traditional gender roles man simply puts burden raising kid woman many women choosing less children nothing inherently wrong bigger disasters like climate change upon us issues like depopulation doesnt affect anyone took us centuries create billion years reached billion easily go back less population volunteer tribute haha equal income distribution capitalism laughs sadness welcome back capitalism lack education people lower socioeconomic status thinking people income family regardless religion theyre socially low theyll children bigot use replacement times replacement country size somewhere million people right number essentially destroy reservation systems caste problems us need come together make value increase gdp check post yes one man everyone people never think beyond whatever spoonfed school hence insistence depopulation solution everything much wrong firstly india quite state held economy even saying capitalist inaccurate ndly equal income distribution doesnt mean better lives objectivelyyou low income distribution toojust like bihar dont eulogise something without considering actual consequences happened conservative developed asian countries like korea singapore hong kong likely happen india albeit slowly india still conservative society need accept menwomen choosing single kids even urban cities long way go think personally dont want take responsibility raising kid unfair partner raise child alone lot us men supporting partners choosing child free richest indias wealth hahahaha tell anything incorrect comment instead name calling capitalism defined economic system means production owned private people production done private businesses little state yes state regulates taxes economy barely participates say india capitalist mixed system max equal distribution income quite literally best way distribute income doesent guarentee happiness way distribute money maximum happiness equal distribution pretty close marginal utility applies money idea eulogy googles definition doesent really apply usage yeah say india capitalist mixed system max lolindia socialist economy restrictions government puts businesses prevents free movement capital wont accurate number state still much involved mention indias economic sectors monopolised private players heavily regulated thats even subjective tenure saw indias economy slumping falling behind asian tigers equal distribution income quite literally best way distribute income person need work id get someone elses money idea eulogy never said eulogyi said eulogise different words yeah yeah eulogise googled didnt really make sense sentence asked india socialist socialism means production owned society times govt means production means factories farms etc basically anything helps process production india owned private indivisuals therefore india socialist economy restrictions dont make socialism ownership restrictions make mixed economy mention indias economic sectors monopolised private players heavily regulated thats even subjective tenure saw indias economy slumping falling behind asian tigers sure relevant comment person need work id get someone elses moneyi realiste said pretty close side note indias economic sectors monopolisedmonopolies arent necessarily bad thing example without monopoly would impossible avoid employing child labour assuming restrictions free movement capitalanyone chooses employ child labourers would price products higher therefore job heshe mention higher profits lead expansion naturally people employ child labourers would expand monopoly however would competition therfore need employe child labourers yeah yeah eulogise googled didnt really make sense sentence asked make sense eulogising equality income distribution virtue necessarily good coz everybody equally poor india socialist socialism means production owned society times govt lol owned government india literally psus india public owned banks public insurer etc restrictions dont make socialism ownership restrictions make mixed economy socialism means goverment intervention economy restrictions government intervention economy means production means factories farms etc basically anything helps process production india psus infact monopoly many industries till farms heavily state regulated via mandi system indias economic sectors monopolisedmonopolies arent necessarily bad thing example without monopoly would impossible avoid employing child labour lol firstly india didnt end child labor secondly monopolies restrict innovation produce shoddy goods dictatorial behaviours part seems remotely good mention monopolising economy ultimately lead low rate growth absence infrastructure absence jobs basically everything bad economy mention higher profits lead expansion naturally people employ child labourers would expand thats true capitalistic countries dont child labor natural would let child employed dangerous places far places like coffee shop etc concerned teenagers able jobs teaches lot monopoly however would competition therfore need employe child labourers thats oversimplification doesnt even address issues competition means innovation means one would incentive work better making child labor issue youre forgetting many issues make sense eulogising equality income distribution virtue necessarily good coz everybody equally poorahh thanks clarification actually meant set amount resources want maximise happiness distributing money almost equally lead maximum happiness obviously dont much resources like bihar cant much unequal distribution would make even worse lol owned government india literally psus india public owned banks public insurer etcyes thats true called mixed economy socialismjust rough guess actual data businesses owned govt make socialism means production owned govt socialism lol firstly india didnt end child labor secondly monopolies restrict innovation produce shoddy goods dictatorial behaviours part seems remotely good mention monopolising economy ultimately lead low rate growth absence infrastructure absence jobs basically everything bad economyi using child labour example replace child labour bad thing want eg paying workers shit unethical business practices giving bribes etc etc besides competition wastes ton resources india afford research labs separately reasearching samething instead worker together could get double results secondly monopolies restrict innovation produce shoddy goods dictatorial behaviours part seems remotely good mention monopolising economy ultimately lead low rate growth absence infrastructure absence jobs basically everything bad economyim sure youre getting mean youre literally throwing justification sources anyway would like remind soviet union ws first country send man space first send manmade object space first send living space less hours week working time ilo data means one would incentive work betterah yes classic well easily remedied pay grades take mean working output workers certain proffession example fishermen lets say fishes per hour per fishermanyou give say fishes get money simple give less get less know people think population workers know criminals part population unless high literacy employment rate population basically adding burden country main issue conclusions metrics measured across whole country measure state state go district level large states like decide policies actually meant set amount resources want maximise happiness distributing money almost equally lead maximum happiness obviously dont much resources like bihar cant much unequal distribution would make even worse set amount resources especially far income convenient constantly make world poverty reduced like early basically etcyes thats true called mixed economy socialismjust rough guess actual data businesses owned govt make socialism means production owned govt socialism government owned economy faced shortages long lines bad quality goods depleted resources made situation worse mention government still intervenes massively economy india ranks poorly individual economic freedom index using child labour example replace child labour bad thing want eg paying workers shit unethical business practices giving bribes etc etc anything take anything recipe disaster wages simplistic pay sweeper salary higher deserve expect model sustainable realise bribery happens government offices right government corruption unethical practices besides competition wastes ton resources india afford research labs separately reasearching samething instead worker together could get double results coz thats things workmost resources wasted government monopolies cant accurately allocate resources competition makes innovation possible two labs researching separately might come different solutions one better ultimately benefiting us one lab crushes spirit innovation altogether knowing dont anything stay business removes necessary incentives similar happened india pre innovation see happened capitalistic countries socialist countries sure youre getting mean youre literally throwing justification sources anyway would like remind soviet union ws first country send man space first send manmade object space first send living space less hours week working time ilo data happened end realise space arms race one major reasons fall soviet union long queues food shortages police state would kill thinking anything thats different party line population already replacement nope dont agree india remember maybe replacement fertility means parents giving birth two people leads population trending towards steady state long terms india reach population plateau another years even though tfr around",
    "light_cleaned_title": "I see a lot of people wanting depopulation here.",
    "light_cleaned_selftext": "as the title says, i find it a little bit concerning that people advocate for this to happen, which in my opinion is very strange. So i wanted to provide a counter argument to some of the people who genuinely want the population to rapidly decrease. 1. Our population is already under replacement, so i think this is the best scenario it could have been, as the government hasn't crumbled handling it all yet, and it will reach a plateau eventually. 2.Placing laws such as china's one child policy , would absolutely crush future generations with an excess amount of elderly to take care of but not enough of the working & spending population (20s 30s 40s i think) 3. The most important to me, and often feels like what is the core issue here, yet what people are avoiding in favour of these bandage solutions. Rising income inequality. I am not educated enough to explain this topic without butchering it so please read this [report](https://www.oxfam.org/en/india-extreme-inequality-numbers). i think our priorities should be adjusted. we can still work with this much population.",
    "light_cleaned_comments": "What do you mean under replacement? Total fertility rate (TFR) has reached 2.1. I think he means that. I've got a feeling urban India will go the Japan way in the next 30 years, and personally speaking I'll never have kids either but rural India will be unbothered by anything and keep living the way they've been. So in simple terms population is said to be at replacement when total births in a year = total deaths basically the number of people stay constant as those who die get replaced by new borns Under replacement means rate of births per 1000 is less then rate of deaths per 1000 people Meaning population is decreasing We are about to catch a big fat L everyone already knows that if there were better job opportunities and income distribution then it's fine but everyone also knows that it's not gonna happen why are there so many ppl anyway 8 fucking billion? gahdamn bruh chill The problem is TFR is not the same for every Religion and Community. People are worried more because of that. Edit - People have problems with hearing facts it seems. The current generation is mentally exhausted with the never ending race and fight for basic facilities, lack of decent standard of living, the toxic hate campaigns on internet finding new ways to divide the society every day. Human connections are getting diluted, isolation and loneliness are at peaks. With all this procreation and raising Kids is something very few can manage and look forward to. Add to this the unhealed trauma many are carrying right from childhood. It's not about Depopulation as an concept, it's slowly the inevitable reality. Indias greatest strength against china is our youth outnumber the old Keep pumping hinterland folks, keep humping, we need the numbers Now it’s up to the government and industrialists to leverage this strength for the betterment of the country Arguments can be made both ways. Should there be more population just to take care of old people. What about the inequality, quality of life who are already here. The density of our country is already too high and real estate is already not reachable for someone making 30k a month. Just say you hate muslims instead of hedging and people like YOU are the reason the country is going to hell in hateful basket. If you decide to provide a 'counter argument', then it is your duty to be extremely clear and unambiguous in your language and points. Unfortunately, your post is vague and doesn't entirely explain your thoughts or views. Tum bolna kya chah rahe ho???? ![gif](giphy|26ueYUlPAmUkTBAM8) It's an absolute moronic thinking that India's population shouldn't be reduced. We should remember that India is really really poor country. Average income for citizens are still unde 2500 dollar (this includes billionaire like Ambani adani etc). We are no Japan, Singapore or even China. India failed to capitalise the industrial power like china due to stupid socialist policies and licence raj. Now comes the age of automation and AI. Are we going to win this time. I guess no ! . Out of this 1.3 billion the best are leaving the country to US and other countries. Our overpopulation is mostly contributed by shithole states like U.P and Bihar were average income is even less than 75 thousand rupees !!!. The best thing to do is slow down the damn population. >Is this really a reason to have more than one kid? Like, seriously? Is the ultimate wet dream of Indian parents is that their kids can take care of them? This not for parents to have children to take care of them in future, but there would be a need for future taxpayers and workers in the economy. Better way to say this would be an economy needs younger population to thrive as old do not work more and require pensions and healthcare. With declining birth rates sustaining the pensions would be a problem. This would lead to increase in retirement age which the general population does not want. Edit: This being said India’s TFR is somewhere between 2.0-2.1 which is at replacement region. Basically, if left alone population will stagnant and reduce in the future. What we need to concentrate now is own improving youth emplyment, education, healthcare and infrastructure. We should plan such that people should stop leaving and start contributing to economy here. That's because a few people are hoarding real estate and jacking up the price. Don't worry guys, i am on it. I'll have 10 kids to bring our fertility rate back up. You know that under replacement thing isn't going to make a dent on any of ours quality of lives right? That will impact us in 50-60 years, by that time most of us would be old farts and even then the population would be insanely high. People are frustrated because there's way too much competition for earning basic necessities in India. A degree can't land you a job, go outside of STEM and you can't guarantee you'd be able to feed yourself for the next 10-20 years. Can you guarantee jobs for all in India? The western countries are able to because they have less people and more jobs. Sure they have competition too but a hard working person will be able to live a comfortable life there. But not in India. Indians love to talk and say that all fields are equal but in practice we know that tech is the only field that matters here. Get into arts and see how difficult it is for them to survive especially in this economy. Lack of hobbies lol Nothing is strange about depopulation. The total fertility rate in Korea, Singapore, Japan and many developed economies is less than 1.5 - you can always create immigration policies (to get the right pool of highly skilled and blue collar migrants) Similar thing is happening with the North Indian migration to South India. With more education comes more empowerment. With increased expenses, demanding careers , increasing cost of healthcare and more importantly traditional gender roles, where a man simply puts the burden of raising a kid on a woman - many women are choosing to have less or no children. Nothing is inherently wrong in that. There are bigger disasters like climate change which are upon us not some issues like depopulation - which doesn’t affect anyone. It took us 20 centuries to create a Billion - in 120 years we reached 8 Billion. So no - we can easily go back to less population I volunteer as tribute haha equal income distribution under capitalism (laughs to sadness) Welcome back to Capitalism! Lack of education and people with lower socioeconomic status thinking more people = more income A family regardless of their religion, if they're socially low, they'll have more children. You bigot What the use if we are under replacement ? We should be 5-6 times under replacement. For a country of our size somewhere between 300-400 million people is the right number. This will essentially destroy reservation systems and caste problems as all of us need to come together and make value to increase our GDP Check this post then Yes, one man is everyone. Most people never think beyond whatever was spoonfed to them in school. Hence this insistence that depopulation is a solution to everything So much wrong here... firstly India is quite a state held economy even now so saying that it's capitalist is inaccurate. 2ndly equal income distribution doesn't mean better lives objectively...you can have low income distribution for all too....just like Bihar has. So don't eulogise something without considering it's ACTUAL consequences This is what happened in conservative developed Asian countries like Korea, Singapore & Hong Kong too and will most likely happen in India albeit slowly. India is still a very conservative society and will need to accept men/women choosing to be single or not have kids. Even urban cities have a long way to go I think. Personally, I don’t want to take responsibility for raising a kid and it’s unfair on my partner to raise the child alone. A lot of us men are supporting our partners and choosing to be child free Richest 1% own 40.5% of India's wealth. Hahahaha! Tell me anything incorrect about my Comment ! Instead of name calling. 😅 Capitalism is defined as a economic system where the means of production are owned by private people, 99% of production is done by private businesses, and very little by the state yes the state regulates and taxes the economy but barely participates in it, so we can say that india is a capitalist or mixed system at max equal distribution of income is quite literally the best way to distribute income, it doesent guarentee happiness but if there is a way to distribute money for maximum happiness it is equal distribution or pretty close to it, marginal utility applies to money too. i have no idea what an eulogy is google's definition doesent really apply in your usage so yeah... >so we can say that india is a capitalist or mixed system at max No lol...India is a socialist economy just by the restrictions the government puts in businesses and prevents free movement of capital. And no 99% won't be the accurate number state is still very much involved Not to mention that before 1991 most of India's economic sectors were monopolised and private players were heavily regulated and that's not even subjective. And this tenure saw India's economy slumping and falling behind than that of Asian tigers >equal distribution of income is quite literally the best way to distribute income Why does a person need to work if I'd get someone else's money? >i have no idea what an eulogy is I never said eulogy...I said eulogise very different words. yeah yeah eulogise i googled it and it didnt really make sense in the sentence which is why i asked, india is NOT socialist, socialism is when the means of production are owned by society or most of the times the govt. the means of production means factories, farms etc. basically anything that helps in the process of production, in india these are owned by private indivisuals therefore india is not a socialist economy. restrictions dont make socialism, ownership does, restrictions make a mixed economy Not to mention that before 1991 most of India's economic sectors were monopolised and private players were heavily regulated and that's not even subjective. And this tenure saw India's economy slumping and falling behind than that of Asian tigers , not sure how this is relevant to my comment Why does a person need to work if I'd get someone else's money?i realiste that, which is why is said, OR PRETTY CLOSE TO IT. side note: most of India's economic sectors were monopolisedmonopolies arent necessarily a bad thing, for example without a monopoly it would be impossible to avoid employing child labour (assuming there are no restrictions and there is \"free movement of capital\")anyone that chooses to employ not child labourers would have to price their products higher and therefore be out of a job if he/she does not do so. not to mention higher profits lead to more expansion so naturally people that employ child labourers would expand in a monopoly however there would be no competition and therfore no need to employe child labourers >yeah yeah eulogise i googled it and it didnt really make sense in the sentence which is why i asked It does make sense... eulogising equality of income distribution as if it's a virtue is not necessarily good coz everybody can be equally poor. >india is NOT socialist, socialism is when the means of production are owned by society or most of the times the govt. Lol and it's not owned by the government? India literally has PSUs. India has public owned banks, public insurer etc. >restrictions dont make socialism, ownership does, restrictions make a mixed economy They do... socialism means goverment intervention in economy and the restrictions are government intervention in economy. >the means of production means factories, farms etc. basically anything that helps in the process of production India own PSUs infact had monopoly over many industries till 1991, farms are heavily state regulated via the Mandi system. >most of India's economic sectors were monopolisedmonopolies arent necessarily a bad thing, for example without a monopoly it would be impossible to avoid employing child labour Lol firstly India didn't end child labor with that, secondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy. >not to mention higher profits lead to more expansion so naturally people that employ child labourers would expand That's not true, capitalistic countries don't have child labor and it's NOT natural why would you let your child be employed in dangerous places? And as far as places like coffee shop etc. is concerned, teenagers SHOULD be able to have these jobs it teaches a lot. >in a monopoly however there would be no competition and therfore no need to employe child labourers That's SUCH an oversimplification which doesn't even address the issues, no competition means no innovation, means no one would have the incentive to work and be better. And again just making child labor an issue and you're forgetting that there are many other issues. It does make sense... eulogising equality of income distribution as if it's a virtue is not necessarily good coz everybody can be equally poor.ahh thanks for the clarification, what i actually meant is that if we have a set amount of resources and we want to maximise happiness distributing money almost equally will lead to maximum happiness, obviously if we dont have much of resources like bihar we cant do much about it, but unequal distribution would make it even worse. Lol and it's not owned by the government? India literally has PSUs. India has public owned banks, public insurer etc.yes thats true, which is why it can be called a mixed economy, not socialismjust because 15% (rough guess no actual data) of businesses are owned by the govt does not make it socialism, all of the means of production have to be owned by govt for it to be socialism. Lol firstly India didn't end child labor with that, secondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy.i was using child labour as an example, you can replace child labour with any bad thing you want for eg. paying workers shit, unethical business practices, giving bribes etc. etc. besides competition wastes a ton of resources that india cannot afford, why have 2 research labs separately reasearching the samething, when instead if they worker together they could get double the results. secondly monopolies restrict innovation, produce shoddy goods and have dictatorial behaviours what part of it seems remotely good here? Not to mention that monopolising the economy ultimately lead to low rate of growth, absence of infrastructure, absence of jobs and basically everything bad about the economy.im not sure where you're getting this from, i mean youre literally just throwing it out there with no justification or sources, but anyway i would like the remind you the soviet union ws the first country to send a man to space and the first to send a manmade object to space and the first to send a living being to space. and it did all that while having less than 50 hours a week or working time (ILO data). means no one would have the incentive to work and be betterah yes the classic, well this can easily be remedied by having pay grades, you take the mean of working output of the workers of a certain proffession for example fishermen, lets say its 100 fishes per hour per fishermanyou give say 25% more fishes you get 25% more money simple. and if you give 25% less, you get 25% less I do not know why people think More Population = More workers. You know criminals are part of population too? Unless we have high literacy and employment rate, more population is basically adding burden to the country. The main issue I have with these conclusions is that these metrics are measured across whole country, when you should measure them on state by state (and go to district level for large states like UP) and decide policies there) >what i actually meant is that if we have a set amount of resources and we want to maximise happiness distributing money almost equally will lead to maximum happiness, obviously if we dont have much of resources like bihar we cant do much about it, but unequal distribution would make it even worse. It's NOT a set amount of resources especially as far as income is convenient we constantly make more which is how world poverty has reduced from like 95% in early 1900s to basically 5-10% now. >etc.yes thats true, which is why it can be called a mixed economy, not socialismjust because 15% (rough guess no actual data) of businesses are owned by the govt does not make it socialism, all of the means of production have to be owned by govt for it to be socialism When the government owned most of the economy we faced shortages, long lines and bad quality of goods which depleted our resources and made our situation worse than it was before. Not to mention that government STILL intervenes massively in the economy. India ranks poorly in individual economic freedom index. >i was using child labour as an example, you can replace child labour with any bad thing you want for eg. paying workers shit, unethical business practices, giving bribes etc. etc. Anything take anything and it was a recipe for disaster, wages are not so simplistic where you can pay a sweeper a salary higher than they deserve and expect for this model to be sustainable. And you do realise bribery happens in government offices right? More government more corruption and more unethical practices. >besides competition wastes a ton of resources that india cannot afford, why have 2 research labs separately reasearching the samething, when instead if they worker together they could get double the results. Coz that's NOT how things work...most resources are wasted under government monopolies who can't accurately allocate resources. And competition is what makes innovation possible, two labs researching separately might come up with different solutions with one being better and ultimately benefiting us. Having one lab crushes this spirit and innovation altogether. Knowing you don't have to do anything to stay in business removes the necessary incentives. Similar to what happened in India pre-1991 all innovation you see has happened in capitalistic countries NOT socialist countries. >m not sure where you're getting this from, i mean youre literally just throwing it out there with no justification or sources, but anyway i would like the remind you the soviet union ws the first country to send a man to space and the first to send a manmade object to space and the first to send a living being to space. and it did all that while having less than 50 hours a week or working time (ILO data). And what happened to it in the end? You do realise that it was the space and arms race that was one of the major reasons for the fall of the Soviet union. And it had long queues for food, shortages and a police state that would kill you for thinking anything that's different from the party line. > 1.Our population is already under replacement, Nope. don't agree. it's India 2023 remember ? maybe in 2055... No, replacement of fertility means 2 parents are giving birth to two people, which leads to the population trending towards steady state in long terms. India will not reach population plateau for another 30 years even though the TFR is around 2 now"
}