{
    "id": "17sqswt",
    "title": "JioMart has scammed me for 87k and is not refunding it.",
    "url": "https://www.reddit.com/gallery/17sqswt",
    "selftext": "First mistake I did was buying an Apple Watch Ultra from JioMart. \n\nI received a wrong product, I received this Watch 8 Melbon Astra. Immediately I was worried and I went to customer service via chat and previously I had refunds go through when the product was damaged such as oats so I thought I will just return this and get replacement/refund. \n\nFast-Forward 1 week later,\nOver 25 customer service agents contacted\n10+ emails to customer support, customer support head,\nEven A consumer complaint/grievance,\n\nAnd still nothing. They have kept the return request on hold. First they said 3 days, then 4, now it’s a week. I don’t know what else to do. Someone help me. What do I do. I have the invoice for the original purchase, I don’t know what to do.\n\nNo one is doing anything, every chat agent keep saying give us more time give us more time. How much more do they want?",
    "flair": "Rant / Vent",
    "score": 2849,
    "num_comments": 408,
    "created_utc": 1699694084.0,
    "convurl": "https://i.redd.it/stf2mhn5rozb1.jpg",
    "comments": [
        "Consumer court",
        "> First mistake I did was buying an Apple Watch Ultra from JioMart.\n\nThe mistake is not buying from Apple store/ website.",
        "Not telling this too OP but people should generally buy AirPods and Apple Watch from the official store.",
        "Unboxing video? if no..\nThen you are screwed..\n\nAlso why not buy from reliance digital/Apple why JioMart?",
        "Why I bought from Amazon and flipkart the import date was a bit old but apart from that the device had no issues and warranty from Apple..\nApple stores has no/low discounts so I don't want to buy from there...",
        "Do you have unboxing video?",
        "There's always two sides of a coin. I guess you don't have any proof either other than playing victim card.",
        "Is there any barcode/ jio mart label on that box?",
        "I understand your situation bt jio Mart se Apple watch q buy Kiya ??? Official Apple site se lete",
        "If you can't afford to buy a apple product from a apple store, you are not ready for the apple life.",
        "If you have ordered through credit card, please file a chargeback/raise dispute with your bank.",
        "Who tf order's apple watch ultra from a grocery mart/s",
        "I never understand, why people buy expensive stuff online? Huh!",
        "trying to save 1000 ₹ for a 1 lakh phone aint worth man",
        "post on twitter and try to get as much attention as possible they won't listen otherwise",
        "I still don't understand why people don't buy this costly stuff from walk-in stores, like now Reliance Digital would be definitely available in any of the Tier 1-2-3 cities nowadays",
        "Who buys from JioMart ? It’s a MotaBhai product pushed by Gobhi. \n\nThe only products I can tolerate by Jio are Jio Sim and Jio Fiber.",
        "Tag their head honchos in LinkedIn and Twitter. Worked for me when I had ordered a JIO VR srt before IPL and it did not get delivered even after IPL was over.",
        "They may be giving more discount",
        "Couple of things:\n\n1. Always buy expensive stuff from physical stores by going in person, not online. People would scam god if they could get away with it\n2. Always record unboxing for electronics and expensive items. My friend once bought a phone and unboxed it right at store after paying. We were recording it and the box inside looked a bit weird, as if it was repacked. The phone had a slight scratch on the side, barely visible but we got it on recording. In the same recording, we also got the store and the sales person. They first denied responsibility, asked us to go to service center but then when we said we will put this video online tagging Samsung(the brand) and mentioning store name, they quickly cancelled the purchase, gave my friend another unit and gave him a discount for another unit he bought then.",
        "How does this work my good sir? Could you explain? And does it hit your CIBIL.?",
        "Anything named jio by reliance is just fraud, i can trust on fraudkart once but not jio",
        "Who tf buys this expensive shit from jio mart\n\nWhy not prefer an apple store or Amazon??????",
        "It’s like 5k with the Amazon card",
        "what was benefit over apple store, amazon or offline ?",
        "It costs the same 🙄",
        "i have zero problem with amazon, but with scamcar,scammart,snapdeal,meesho blah blah even if its 10k discount dont go for it",
        "Absolutely",
        "Arey kya sab ek h gyaan de rhe ho k why bought from jiomart. Ab toh usne khareed liya, kuch nhi ho skta uska.. Aage kya krna h wo batao",
        "Lol what? It costs the same and maybe there are some discounts on jiomart.",
        "You never? It's convenient that's why.",
        "It's basically a he said she said now. You can only hope that they do some internal investigation and find the culprit. \n\nImagine someone ordering that Mariegold watch and he receives an Apple watch.",
        "It's not even sarcastic as it is the truth. But I hope OP gets refund we all make mistakes to save an extra buck.",
        "😂😂😂",
        "I've bought some expensive stuff only but it's from a good site. Not jiomart.",
        "Idk about CIBIL but the bank will instantly redact the transaction cause it's THEIR money that you've used to purchased, not yours.",
        "For real. Like you are buying 90k watch and lazy af to not buy it from store..? Or apple official website..? Come on dude. I hate to say this but you kinda deserve this unless you have valid reason like….none. There is no valid reason. You could have gone with apple.com. Easy peasy.",
        "Toh reliable jagah se order Karo na, at this point I don't get people who would order products worth more than they can afford to lose from anywhere other than Amazon. And even then only from the reliable sellers on Amazon. 🤦🏻‍♂️",
        "“MELBON”",
        "Exactly. Dude paid the exact price on the apple.in too",
        "There's Amazon and then there's anything else.",
        "Still not worth it",
        "I’m sorry to say, but most folks don’t trust JioMart with their onions and tomatoes. And here you are, buying a 87k watch - which is actually the same price on the official Apple India site - from them. \n\nIt’s going to be hard for you to prove. They will likely say you replaced it etc. that’s the reason why seasoned e-commerce players like Flipkart now have open box delivery.",
        "May I ask why you went for the Ultra? Other than the fact that you’re probably rich, just to get some perspective here.",
        "It’s 89k on Apple. Looks like OP paid 87k on jio. Crazy risk for little discount",
        "I'd rather pay some extra than trust any online seller, especially Jio for this kind of stuff \n\nEither Amazon or offline.",
        "Yes, atleast a genuine site.",
        "It does not. It will be like punishing the victim. Source: I used to work for their parent company",
        "Jiomart and reliance digital, they all belong to the same shit right?",
        "Yeah, the materialistic life.",
        "What is the recourse if someone pulls this stunt in a dept store after buying a tv/fridge",
        "I always get flabbergasted seeing people getting scammed in the weirdest way possible.\nHow can you trust a 0% appealing shop page and risking all the 87k for just a 2k discount",
        "I wont go as far as saying he deserved it bro",
        "Wow. The price is so much more than the price in the US. Are all Apple products this expensive in India? Doesn’t make sense.",
        "happy diwali",
        "I also don’t wanna but ask yourself am i wrong to say that..? And be honest with yourself.",
        "Always buy Apple products from their offline authorised resellers. (Not even online)\n\nIt cost you more I agree but it saves you a lot of hassles like this.",
        "JioCinema",
        "Did you buy through credit card? Initiate a chargeback if that's the case. Do it through the bank website, if you contact bank support, they themselves will keep stalling and defending the seller.\n\nAlso, why did you purchase through Jiomart when you can buy it directly from Apple for the exact same price?",
        "That was a shitshow + they didn’t even have return policy. I faced the same issue.",
        "Yeah, when it's the exact same price that too. Although I checked Jiomart and it seems Reliance Retail is officially selling it..........so yeah.",
        "Bhai isme Gobhi (Modi?) Kaha se aa gaya?",
        "There's an investigation..........the store's bank will investigate, then your bank will investigate (and ask details), and then if either party is dissatisfied, then VISA/Mastercard will investigate.\n\nI guess they contact you at some point. I initiated a chargeback for Flipkart giving me a defective Pixel 6a, haven't heard crap about it so far.",
        "You can post the entire incident on twitter with pictures, and then tag the official JioMart handle. Gives the customer service more incentive to help you faster",
        "It's not like a veto. If you have enough proof and such the bank reverts the transaction along with a penalty on the seller. But at the same time the seller's given a short period of time to refute it as well. So it usually goes like that.",
        "Yes?",
        "Can't trust anything in this country, law and order has completely gone to crap.\n\nEverything's going to get worse unless we kick out these Sanghis from power.",
        "More like the naive life. Apple fans blindly pay large sums of money for questionable quality.........to be fair, plenty of other \"premium\" products are exorbitantly priced.",
        "If you paid via credit card, raise a chargeback request",
        "Always remember apple price is almost almost same as everywhere so just don’t get trapped . I knw it very well coz I am dealing with apple",
        "Flipkart also does the same scams. They didn't offer open box delivery in my case either.",
        "Or Apple directly........they sell for the exact same price.",
        "High import taxes, sales taxes. Must send more money to BJP's Swiss bank account, damnit!",
        "What about the new made in India iPhones are they priced sensibly?",
        "JIO customer service is their to serve the interests of the company.\n\nThey are not there to serve the customer.",
        "Thank you for your generous contribution towards Nita Ambani's diwali gift, that Rolls Royce car. /s\n\nFile a case in consumer court. No one else can help you",
        "Don’t go for it ESPECIALLY if it has a 10k discount. It’s a definite scam then",
        "Post it on X (formerly twitter) and share the link here. The community will retweet it.",
        "That's why I never open these websites even for dal,channa 😂",
        "Sorry I just wanted to repeat again what a thousand people have repeated again and again as nobody reads anyone's comments and we all just feed our own egos by correcting you. \nSo once again...\nYOU ARE INCORRECT AND I AM CORRECT AND YOU AND EVERYONE HERE NOW  KNOWS I AM SMART!!!",
        "I doubt it. They'll still be overpriced. We are only meant to shut up and be cheap labour to make devices for others who get amazing discounts (just see US discounts sometimes) while we get crazy exorbitant prices and lowest wages.",
        "Try raising this on Twitter..\n\nI would have never personal spend such a big purchase on jio Mart doesn't look reliable to me.",
        "https://consumerhelpline.gov.in/#smc",
        "Lots of comments on this post saying he/she deserved it , should have bought it from the official Apple store. People seem to be missing the point that it is the fiduciary duty of the online platforms to sell genuine and defect free products. In my opinion, OP was right to buy it from Jio Mart even if it was to save 500 bucks. I would suggest be patient and try posting about it on Twitter/ LinkedIn, post the link here so we all can help you gain traction and if nothing works, take these bastards to court.",
        "At what point did you think \"yeah lemme order one lakh worth of order from internet\" and not realize \"Who's gonna help me if things go south\"",
        "One thing I learnt the hard way was to not buy expensive electronics online. You may get 4-5k discount but that ain't worth the hassle if you get delivered the wrong product or damaged product. Especially these days you hear a lot of scams happening from the delivery of products being outsourced by these companies.\n\nYou want a discount? Try visiting stores like croma or Vijay sales during festive period and ask them for offers. \n\nI had ordered my phone off Amazon. I got a wrong phone first time around. Then they replaced the phone, the box was already opened, the device I received had a dent and did not match the imei number on box. All this process took me almost a month to resolve. I had given away my old phone at the time of delivery. This led to me being without a phone for almost an entire month.",
        "Amazon is less risky but not risk free…\n\n\nI have seen people ordering genuine things & then place a return request and hand out fake replacement of the genuine item to the collection guy.\n\nI make it a point to not buy things which have major value coming from its brand name from online sites.\n\nGenerally the authorised resellers also have some discounts with cards so theres that. I bought my ipad air 5 with a 5k discount from ivenus with hdfc credit card.\n\nSure the online sites would offer cheaper deals but I prefer to buy my precious things from shops only.",
        "Gareeb Ameer",
        " Bhai jiomart wale rations to sahi se de nhi patey.\nI ordered many times from them and they always misses some item in grocery while delivering.",
        "Agreed, I was talking about his “Apple life” cmt",
        "The title should be \"I scammed myself by ordering a 90k product from Jiomart\", I wouldn't trust Jiomart for even a 500rs order & you out here blowing 90k without a second thought 🤦‍♂️.",
        "Chargeback",
        "this is why I bought my over 1L laptop from Asus website directly. I could risk to save few money from amazon/flipkart, but still will be taking my chances. Better buy from the product site directly and be safe with all the warranty and stuff.",
        "twitter pe tag karke dekho",
        "Put it on Twitter and approach consumer court.",
        "No, Amazon is far superior in this regard. We just need to be sensible enough to record the unboxing. I have had bought laptops, phones and accessories from them with zero issues.\n\nAvoid flipkart/jiomart/croma online at all cost",
        "In general avoid buying online. Period.",
        "Yes. This.   \nSlightly off-topic but I recently did this with Fireboltt company. Firstly they refused to refund and neither did they have the same model of the smart watch. So they sent me a different model. \n\nAfter a lot of back and forth, they didn't agree to refund my money. So I sent them a legal notice through my lawyer and suddenly they agreed to a refund.  \n\n\nSo maybe, you don't have to go all the way through, just send them a legal notice and talk to them via email or call that you have sent them a legal notice and they will have to respond soon to that.",
        "Jiomart takes usually a month to sort any refunds, hold tight , and you will explain your case 10 times before some progress but you will get the refund, I think and I hope",
        "Amazon is the only source you can trust for getting stuffs online. Period.",
        "If I am you, I will file F I R for cheating, fraud, breach of trust. I know pandu may not cooperate by claiming it as civil dispute. Then I will file complaint to local magistrate.\n\nIt is difficult to prove that you actually have received wrong item but criminal case that too against directors of JIO (read: bambanis) will compel JIO & they will offer refund immediately. I have done this against flopkart & had impleaded pansal & co",
        "Consumer court is the best option. I had a damaged macbook charging magsafe port and apple was not accepting it, so I filed a case and apple agreed to an out of court settlement. They gave me a new sealed piece in return for my old one, the whole saga took like a week, so ya go to court ASAP and make sure you take print outs of all mail communications you have made",
        "Next time if you get this urge to shop online. Book it on Croma and visit the store for delivery. Much better experience.",
        "Hey contact getmyrefund from twitter. They might help you in this case.",
        "Lawyer up",
        "In that cause I hope you flat out refused to take delivery",
        "I've had bad issue with Amazon as well. Sending something meaningless for some other part. Or delaying a product for over weeks. Telling it from experience. You might have got lucky to not experience. It is less than Flipkart and jiomart but it is still there.",
        "Lodge a consumer court complaint, mark their CEO on every twitter interaction, be it daily 15-20 threads. Find out their management, CEO email ids, write a proper worded email with your entire concern, including orderid and names of people who have talked to you over call, twitter or in person.\n\nFollowup, 10 twitter replies, 10 emails per day. Ask them for a callback.\n\nThousands of Indians lodge complaints daily, you need to go berserk to get eyes on you.\n\nSame happened with me on flipkart with an apple watch, got every single rupee back without any court case and without any proof.",
        "parchun ki dukaan se apple watch kaun leta hai bhai.",
        "It’s a myth that if you buy from the brand website you’ll get impeccable RMA experience. While if you buy from Amazon you’ll get company warranty as well as your product is basically amazons responsibility within the warranty period. I tried RMA for a game controller but couldn’t get through to the company through telephone and email, instead i called amazon and they arranged for return and gave me a full refund that too 3 months after purchase",
        "Dont buy expensive electronics from Jiomart, infact avoid buying any electronic items from Jiomart if you can. Speaking from experience....I bought Logitech webcam from them. When the package arrived, the box was old and crumpled. It was evident the box was lying around for a couple of years crushed under other items. The webcam flat out did not detect for the first few times. Then after a few tries, it finally started working.  It was clear that it was either a very old product or had been returned by someone.",
        "Maybe discounts? Thats how people still buy from flopkart and then get scammed after all. If discounts were the reason, then it would be really bad financial planning to risk entire money spent for some measly 10% discounts. For high cost purchases, I spend days to confirm if sellers are trustable and then buy, even then I record the whole delivery to unboxing.",
        "wtf is this logic ?",
        "You guys are buying from JioMart? WTF",
        "Amazon is also fine. Make sure seller is RK World Infocom or Appario.",
        "Yo bro, try contacting national consumer helpline, if nothing works they do a good job of getting things done, once MakeMyTrip didn't refunded my flight cancellation for 1 month, i contacted them and i got it in 2 days, try 8t out :)",
        "Amazon has a lot of scammer issues too, just not to the extent of the rest. If you search for Samsung flagship phones, tablets, watches on Amazon for example, it's filled with imported or used pieces sold as new. But amazon has superior support than the rest; especially if account is trustworthy.",
        "https://consumerhelpline.gov.in\n\n1800114000\n\nGo here.\nFile complaint.\nAdd necessary details.\nBtw choose company right or if you are unsure, call the number and let the agent handle the write up.",
        "How much does it cost to send a legal notice? Never sent any but ny past 2 consumer complaints failed, amounting to 5500 and 8700. Never bothered about legal notices because I assumed they would be costly. It would be good to know an estimate atleast.",
        "I bought my motorcycle worth 1.45 ex showroom from Flipkart 🙂",
        "This works really well to me multiple times. Indeed just a threat of taking the issue to court via an email would do wonders",
        "If you wanna buy any premium from online, try Tata Cliq",
        "Issue is outside of top brands, many of the direct stores can employ bad logistics and the logistic guys can pull some scam. Still unboxing video should help out but you never know.",
        "Always look for savings. That’s a must.",
        "First file a police complaint. Not the court. The cops will do their job of collecting all the evidence.",
        "I might be wrong, Jiomart isn't a retailer but an aggregator. So some sellers could go scamming. Reliance Digital is a proper retailer for diffferent brands.",
        "OP - The likelihood that this will get resolved is slim. But you have learnt a very important lesson and that my friend goes way beyond that the money you have lost here. Everyone does stupid things, it’s part of life. I don’t know your financial situation, and if this loss will impact you or not, but I do know the person who cheated you will pay one day. Maybe more dearly than this. Karma sucks. Definitely give your 100% to get your money my friend, other than that, know that we have all been there in one form or the other. And, we have learnt from our mistakes.",
        "Why the hell would you buy for that much from jio Mart?",
        "I appreciate you writing that your mistake was buying from Jiomart. I hope you win this and get reimbursement.",
        "Some upgraded debit cards have chargeback too.",
        "Yes pls purchase att electronics from electronic shop nearby you.if you get any issues it's easy to resolve them.",
        "Jio is an official retailer for Apple. So OP was not wrong here",
        "The mistake is doing any kind of expensive business with this group of companies",
        "Why waste so much money on stupid watch?",
        "You definitely won a lottery",
        "did you record a video before unboxing it?",
        "Yep, Jiomart is likely an aggregator. Reliance Digital is actually great.  Their customer service is solid and they for big items, they really come down on price to get you to buy.",
        "Did u record the unboxing of the product ??",
        "No bro, It’s not OP’s fault. Jio is trusted. It’s JioMart and the product title and image is of an Apple Watch. \nThough thanks to OP we know now that even JioMart sucks",
        "Appario is the most unreliable seller on the platform, once I ordered AirPods for myself but instead got some random fakes. Had to take the entire thing to consumer court in order to get a refund",
        "This is why I alea pay cash upon delivery",
        "Where these companies win is most of us individuals don't wanna go with so much of work and brain teasing. I recently got scammed on one of these and didn't wanted to go through all of that procedure. Best way is to not order expensive things online",
        "How much it costed you to send legal notice",
        "Dekh, Ambani ki company ke barey me shikayat dekh kar AutoModerator ki bhi fat gayi!",
        "People think Unboxing video is only on YT channels\n\nNo it's a basic requirement now",
        "Jiomart is an official reseller, so it's not really his fault.",
        "I think you're missing the point here. Of course online platforms *should* sell authentic and defect free products, but the fact is that not all do, and it's our duty as consumers (who have limited resources and time) to choose the ones that are reliable. Saying this is not saying that JioMart is free of culpability, but rather asking OP to be more prudent in making their decisions in the future.",
        "Was it home delivered in a csrton or did you pick it from showroom?\n\nIf it is the later, you dont have a point..",
        "How do I go about doing this",
        "Jio Mart is not official retailer... Reliance Digital is official retailer of Apple.",
        "Unfortunately I’ve used debit",
        "Mostly depends on advocate, for cheap fees find small advocate but ask friends to get it. Because advocate might take big fat fees",
        "lol, this has nothing to do with who's in power. It's an integrity issue, and regardless of who's running the government shit like this will continue happening till civic sense improves.",
        "To everyone who is buying any product upwards 10K+ especially small items like phones and watches, always make a opening video. With so many bastards selling fake stuff and replacing costly products, you make yourself safe and have a hard proof",
        "Yes",
        "Does JioMart have 3rd party sellers like Amazon?\n\nAlways look at seller ratings before placing an order.",
        "I do some hiking and trekking so it’s better for outdoors being completely independent from the iPhone",
        "Jio Mart got the worst customer support",
        "Good! As an American it's so nice to see one of you get scammed by your own, I sincerely hope this becomes a plague in your life, you all deserve it. \n\nOr do you think your culture should only scam Americans over the phone?",
        "Email to their CEO. Or some higher up first. Then goto consumer forum onlinr",
        "I have filed one alr it’s stuck at ‘in progress’",
        "If you have an upgraded debit card, you should still be able to.",
        "DM me I'll send one for you for free.",
        "Thank you everyone for the advice.\nI’ve filed a consumer complaint 3 days back already. \nI’m looking into consumer court as suggested by many people. Unfortunately I didn’t take an unboxing video in excitement. Chances look slim but I hope to solve this :(",
        "lol you fucking loser",
        "For Lenovo u are mostly better off on their official site they have some very good discounts and deals",
        "Depends on your lawyer. Mine was a family friend so he did it for free. Also, it's not a complicated process from what I've seen. You can draft a notice by looking at some templates online and just have send it to them on email and also a hard copy via post.\nBut it's a mandatory step. You can't directly file a case as far as I know. You first have to send them a notice. If they fail to respond to it in a given time frame or their response is unsatisfactory, you can go ahead with the case.\nMost companies will not fight back and just refund you the amount because this will only cost them more as they know they are on the wrong side here. They pull of this shit because they know people won't go to the court as it's a hassle.\nYou will get your money back OP. Don't worry 👍🏽\n\nIf you are not able to do the above process for some reason, let me know I will help you with it.",
        "Yes. I think we somehow need to make average consumers aware of this.",
        "Don't worry your countrymen and women are still the stupidest people on earth. 🤣",
        "Never, (n)ever buy an apple product from anywhere except Apple store, apple website, or authorised store. Everything else cannot be trusted.",
        "Ppl doesnt even trust jiomart for small electronic items and you ordered apple watch ultra 2 from that . Looks like your brain was just in sonpapdi before that.  I suggest head to court as they will not replace it any how . You would have got much more discount around 4k-8k from bank offers and dealer offers from unicorn , inspire etc . Hope to see Better shopping in future",
        "JioMart has one of the worst customer care services. Will only recommend in buying small goods and basic groceries. It's not good for expensive stuff",
        "If you paid with credit card. Raise chargeback request",
        "It's kinda shitty to say OP deserved this. Jio is a big name in India, and you don't really need a reason to choose to buy from there. Be nice.",
        "Post on Twitter and tag these people. Ask everyone to retweet your post. It catches a lot of attention",
        "Credit card chargeback",
        "Flipkart is also a big name in India, you see the scams flipkart is doing right..? And that’s my opinion plus said “op kinda deserve this” i used kinda cos i know it’s not his fault that jio gave him something else but it’s his fault for not buying it from apple store cos there’s not even any discount or anything. He is buying for same price.",
        "You can file a complaint at consumer forum..it’s quite simple and you can do it yourself from the web page. I have had lenskart issue me a refund after filing in forum..if forum doesn’t work then send a legal notice and go straight to consumer court",
        "Theek hi to hain, just different box 💀",
        "What's the issue with Croma online? I used it a few times and have had no issues till now.",
        "Thanks a lot! I will try to initiate my claims.",
        "They scammed me of 4K. Those pigs attract you with low prices. I had baught grossaries. And none got delivered.",
        "If the payment was made through Credit Card, Raise a dispute with bank and request for chargeback.",
        "Ye toh Instagram m like share comment karne m bi mil jati",
        "Have u raised the issue on Twitter??",
        "Bhai pr jio Mart se ye kon leta hai yaar.\nTamatar aur bhindi lene ke liya sahi hai bs.",
        "Been in the same boat before when I got scammed on Amazon. Fake/wrong apple watches are more common on Amazon than it seems. And customer support becomes helpless in the end.\n\nHave learnt my lesson to buy any 10k or above products from retail stores. And if it's bought online, make sure to record and open it in front of the delivery or returns guy.",
        "See, I hate it when people hold buyers accountable because of their choice rather than the big corporations who are responsible. OP doesn't 'kinda' deserve this at all.",
        "Like you send them mail or what?",
        "god. when you're talking about an amount over eighty thousand rupees, is 2k really that important 😭 this could've been avoided",
        "Yes. An email and a hard copy via post.",
        "Go straight to r/legaladviceindia",
        "I was looking to buy apple watch 8/9 online should I go for it?",
        "Last hope consumer court",
        "You can buy from reputed sellers like Appario and others which are mentioned in some comments here.",
        "Give them one final warning, of they fail to comply or refund you, then move to the consumer court with all the evidence and chat snippets, you will definitely win not only your money but also compensation for the hassle that you've been put through",
        "I also got scammed by a scam seller in amazon, think about it lol amazon!! Have been in 30+ or so agents calling forwarding and them just abruptly ending the call lol after putting me on hold mine is a small amount of 5k but still it's a lot, i think it would be better to make a legal court order for this its not small money,people even put cases for 10rs lmao  \nBetter make them pay fine too for the amount of time they wasted im sure u will get it too",
        "If you’re willing to spend over 80K on a watch, then why is 2K that big of a deal lol",
        "Consumer Guidance Society of India. You may call them, they will hear you out and provide an email address. You will have to also mention what sort of outcome you hope to achieve. Will take time but you will get compensated or a replacement + damages if you seek it.",
        "I am currently facing this issue with Flipkart and Samsung. Around 40 calls and emails . No proper resolution.\nI don't even live in a city so going to a service centre is like a 4 hr trip for me. Heck, that's why I placed order online in the first place. I feel it's time to switch to offline mode of shopping!",
        "Why would you buy it from fucking jiomart ??",
        "How is JioMart trusted? It’s an aggregator not a direct retailer so you have no idea who you are “buying from JioMart”\n\nI’m not saying OP deserved to get scammed or anything- but anything expensive from any aggregator (including Amazon) should be avoided or at least unboxed on video",
        "The first mistake was buying Apple watch second was buying such an expensive thing only third mistake was not recording the unboxing of the product...",
        "NEVER buy anything from JioMart. They have the worst customer support team and also they refund the amount to their Jio Wallet without asking customer the mode of refund.",
        "The font in the first image looks like a cheap untrusted website. No wonder jiomart isn't trustworthy",
        "You know that Appario is Amazon, right?",
        "It’s been 1 hour. Chill out",
        "He was saving 2k for the strap",
        "Scamming is also contributing to Indian economy. Feeling pharaud, Jai Hind!",
        "I honestly wonder why anybody would spend 90k on a piece of plastic encased in aluminum, called a ‘smart’ watch. Irony is real here.",
        "Post every thing on twitter and tag reliance in the post i’ve seen this work with other people before maybe it could help you",
        "Go to Twitter, tag JioMart and start nagging. Do at least 3 times a days. You should be in their recent tweets always. Tag their ceo, cto management.",
        "This need more upvotes.",
        "Appario was Amazon proxy. However, Twitter/X is filled with recent posts about fake stuff being sold by Appario. So, I'd recommend caution with Appario",
        "File a consumer complaint in consumer forum and you’ll be assigned a lawyer explain your issue to your lawyer and they will send a legal notice to the company… and file for compensation also. Thank You.. same thing happened with me but with flipkart after 3 months nothing happened I filed a consumer complaint and hence i got my refund",
        "Tf bro \"deserved\" it for using a well known store that most people assume is safe? Expecting atleast original products from one of the biggest retail outlets is in no way lazy or stupid lol.",
        "Hmm, well I am a daredevil who shops from Flipkart so....",
        "It is if you are buying this much expensive product from “jio mart”. I am not celebrating or shit because op got fucked up. I am just telling how stupid this was to order from “jiomart”, you could get the same “same” thing from apple store. \n And i said “kinda” comeo don’t use “tf” if you can’t read the fuckin sentence properly. The “kinda” is showing that it’s not op’s mistake that he got wrong product, he got fucked up by order one from jiomart.",
        "Flipkart not recommended. I ordered AirPods Pro type c 2 gen. It came with a lot of scratches but Flipkart denied to replace or return.",
        "Looks like someone learned a very valuable lesson hahahahaha..... if you don't have a video of unboxing forget about it...jiomart srsly bruh?",
        "Should have bought an expensive product from the official store. This is totally on you that you choose to buy such an expensive item online and that too from an online portal that has a mixed bag credibility. I think you deserve it.",
        "Bro I need help I resently send legal notice to Fampay app",
        "Ask them to share the IMEI number of the device. They should have it. Tell youll file a police complaint against the store and if they didn’t do anything then they should share the IMEI number",
        "Amazon. Only Amazon is the decent 3rd party shopping website. I’ve ordered fairly expensive gadgets running up to lacs. I’ve had exactly 1 case where I got a fake item and that was years ago. \n\nAmazon rectified the situation right away. \n\nI would never trust Flipkart or Jio.",
        "Apple has their official online store in India now \n\nStick to that for Apple products",
        "Jiomart is an absolute scam. Once scammed me for just 400 rs , sent a different item. \n\nTheir customer support is worse than bsnl and when i posted on twitter, they just simply blocked my account and stopped responding.",
        "That's like saying Mukesh is official retailer, Neeta, Aakash & Isha ar not 🤣",
        "Just report at",
        "File a chargeback with your bank, upload all necessary documents and take screenshots of your communication with jiomart support(the more the better for proving your case). Tc",
        "I'd chargeback the shit out of them from my credit card.",
        "Consumer court has got your back you can simply file the complaint online without going out ever, I did it with Airtel and my issue was resolved.",
        "Raise complaint on consumer portal",
        "It's difficult to ignore the fact nowadays customers are also scamming they get first copy from market and buy original from online stores and they you know how they scam.",
        "Consumer court i can help",
        "You are dumb. Maybe stop paying internet bills and buy almonds or something to sharpen your brain. I see like 5+ daily posts of online scams from Amazon and flipkart, Jio Myntra are same as well.",
        "Do you have video evidence unboxing video? IDK I don't trust people online they might be faking they can be scammer themselves. If you are genuine & didn't fake this then you are a fool for not making an unboxing video some products get replaced inbetween transit by some scummy delivery agents",
        "Yes, same thing happened to me they are the scammer and do not refund the amount.",
        "The same happened with me which is why I am not surprised. Although the amount was nothing as compared to 87k . But jio Mart is known for scamming its customers. The same happened with many friends and relatives of mine.",
        "Link pls",
        "Jio Mart is just platform like Amazon , usually it's not the app but the retailer on app .\n\nThey aren't sending these products directly from their warehouse .",
        "Bc latest laptops wh bhi discounted price me offline store wle rkhte nhi h…to new faadu latops discount k saath lha se lene ka?",
        "Jiomart sucks",
        "That's the issue now. Appario was the only trustable seller in Amazon and now they have started doing this scummy shit.",
        "From this ,now i m worried, i wanted to buy iphone 13(which is priced high on apple store) and an acer nitro laptop….from where should i buy ? Offline wle discounts amazon jitna dete nhi, and latest laptop bhi rkhte nhi..",
        "Chhoti ganga bol kar naale main kudwa dia bhai ko",
        "I really don’t get why people but Apple products from stores other than Apple Stores.",
        "You should check this service out https://voxya.com/\n\nI have heard they are very efficient",
        "If you’re getting massive discounts for newer models of Apple products, it is too good to be true.",
        "I'm seeing a lot of comments saying to buy from official apple store, but you can buy from Amazon too. Amazon and Apple have a thing where only Amazon sells Apple products, third party sellers aren't allowed. Not sure how well this is implemented in practice but generally you don't get anything other than the original product when buying from Amazon. This also means that even if it's \"cheaper\" on Amazon than the official Apple stores, Apple has a say on the final price on Amazon.   \nFlipkart has no such deal, neither does Jiomart obviously. So yeah, Apple store or Amazon, or go to the semi official offline Apple stores like unicorn or ivenus. Stores like Reliance Digital or Croma are good too.   \nHope you get your money back.",
        "Did you send or want to send?",
        "Atleast get it from Croma",
        "Consumer court. I'd also try and escalate it and speak to the highest levels. Also when you're speaking don't be crass, speak in a composed professional yet stern manner, this actually shifts the authority and they will tend to be more receptive. I'm positive you can get this sorted out without the court option. Usually in a high value item transaction such as this, matter won't be resolved by simply accepting returns. Because electronics are where most of the fraud happens. So it requires a lot of manual intervention and speaking with the seller as well. So it kind of depends on how the seller is responding. Once they identify where the fraud took place, origin of item or delivery, the responsible entity would be identified to give you a replacement (most likely) or a refund (last option). So no this won't be settled in a week, expect at least 2 to 3 weeks. \n\nConsumer court will not speed up the process but it will guarantee you a return provided you have not committed the fraud. And as always fucking buy from the OEM if they have the presence in India.",
        "send it to me too bro even i didn't get apple watch i got a wall clock packed in apple box pl thanx in advance",
        "Nothing can be done its Ambani 😂",
        "Try writing to the grievance and nodal officer on mail regarding our issue and make sure the tone of the email is threatening.",
        "I think Smartwatch as a gadget is a scam because the best smartwatch is like a phone but not better than the phone available at that price point.",
        "One valid grievance registered on NCH (National Consumer Helpline) and the company will come back to its wits. Tried and tested.",
        "Person who can buy watch of 90k don’t really care about discounts.",
        "wow. right now only Amazon is good it seems",
        "These companies are not afraid of law and have no regard to law. They just rob Peter to pa Paul",
        "Middle class if he’s fond of Apple products and upper middle class can easily buy the watch. Rich ppl wear Richard Mille watches",
        "Just for an info. This is the original value of this product. https://www.flipkart.com/kapil-smartwatch-serie-8-kd99-ultra-2023/p/itm4342dba021df1 .",
        "Middle class ppl who are fond of Apple products can get on installments and upper middle class ppl can easily buy it. Rich ppl wear watches like Richard Mille",
        "Jiomart is shit obv your loss is bigger than mine , i ordered a keypad phone on jiomart and the screen was cracked so i put it on return , there was not progress for days after 10 days of filing return i contacted the coustomer care and they told me that it usually takes around 15 days , and now its been 34 days and its still stuck , contact the coustomer care and they say we will hasten it up but no action taken...",
        "india hi ek scam hai",
        "Buy it offline\n\nIf you can afford an 87k watch then you can spend a few more",
        "Take 10 mins and write everything that happened. Add photos of receipts and images of products received. Give the details of the company and the consumer help people do the rest. Sit back and relax. You will get your money back. \n\nhttps://consumerhelpline.gov.in/\n\nI know people might say it’s not going to work. But I had a situation with a broadband provider who took my money and didn’t install the connection.\n\nI waited for another week and filed a complaint. Their regional head called and apologised to take the complaint back. Another one is with an online store(I bought a printer) from a growing startup and they fucked up. I didn’t receive anything for 25 days and I had taken the same route. Money got credited in 48 hours.\n\nIt can take couple of days and don’t panic. When the consumer help people call you explain everything in detail and they will kick asses day in and out.\n\nLet us know how it goes. Cheers mate!",
        "Nah LoL they do care about consumer court but you gotta be persistent about it my fam is full of lawyers and we just scare the shit outta them when ever something like this happens and they do take action tbh",
        "Happened same with me for a 2K jacket and since 2 months same reply that give us 4-5 days and all...... Contacting them is waste of time because they won't do anything better you should do something else",
        "True Appario sell trash to people, back in COVID I ordered 2 ptron wired earphones. Just after return window closed one of the earphone had one-side speaker problem. Then I used the other Earphone and it wasn't working. At first both were working fine, Then I had to throw them in scrap.",
        "Yup. I live in dubai. Here amazon has good reputation of apple products. In dubai, to remove 3P vendors from apple’s sales channel, it has collaborated with a few retail and online companies. Amazon is the only official online distributer who sources products directly from apple. Rest other online channels rely on the other 3P vendors or international vendors to get their apple products.\n\nLong story short, always buy apple products from amazon, if you want to buy them online",
        "National consumer helpline. Take screenshots of everything and put in a complaint. That’s how I got my refund from nykaa, bose and ikea.",
        "Got to wait for @WuTangOriginal mate.",
        "https://consumerhelpline.gov.in\n\nI assure you that once you file a case, your query will be solved within next 4-5 days",
        "This is nothing to do with Modi who seems to live rent-free in your head. This happens in poor countries who have been oppressed in history a lot. Most scammers operating in Europe are from ex-USSR countries. It's not because of \"Stalin did this\" or \"Kruschev did that\" they just don't see anything wrong in it because \"it's his fault to get scammed, life is shit for everyone\" that's the mentality there and in India, Nigeria, etc. \n\nSad but it will take more generations to change it. Countries like Poland and Czechia got rich fairly quick and have no issues with that.",
        "Hasnt helped me. They simply replied that the 'seller did not reply' to their communication and closed it.",
        "Yes, thanks for reminding! I had almost filled their form and left it midway. A little backstory on my concern. I was looking for some prescription veterinary diet for my dog who was sick and I found this only site selling it. I had tried everything before that. Out of desperation I ordered the items worth 8700 from here.https://www.thepetcare.in/ They delayed the order by 22 days and when the order came, it was an empty box, like their usual scams. I complained that very week on NCH. Later when I was on my way on filling this on voxya, my dog passed away. I dropped everything then and I was just let this incident out of mind. It didn't matter anymore. I am still full of revenge, because I had specifically told them that, \"my dogs life depended on them\" and without any mercy they still went ahead and scammed me. The could have refunded and said sorry we can't help you if they had any humanity in them. I tracked this guy, who is the founder, on linkedin, facebook and tagged him and put out some notices for other pet parents. He went to the extent to comment and abuse me on my posts. So many things happened, but my dogs death put an end to the anger and I felt I didn't have the energy to use on this guy anymore. But from what I had seen, this guy was part of several startup incubation programs and he was being endorsed by them. I remember having reached out to them to let them know that they are harboring criminals under their umbrella.",
        "Indian grocery mart, i would like to add.",
        "Who is the seller, might I ask?",
        "It was this https://www.thepetcare.in/",
        "Documentation helps.\n\nStart a mail thread. Use chatgpt to summarize you ask ( while asking chatgpt to act as lawyer writing this and put all you have gone through there, you will get good start to your mail) \n\nYou would have complaint number. Make sure you quote that. If not, make sure you get a complaint number.\n\nAfterwards,  it's simply about keep at it consistently in the same mail thread.\n\nThe days comes when that complaint being open itself get escalated inside the system. Internal team would not care about you, but a complaint number which is being unresolved week-over-week would create Internal pressure in their internal team. Consider not people, but process as your weapon.\n\nI have done this with zomato, fab hotels. It took time, but got them resolved. Monetary value involved in your case is higher. So after a while you can start online FIR and consumer court complaint ( ask here back on reddit om which to choose and how to start one by just using online mode for these conversations ).\n\nStart a Twitter thread for the same. And just keep on adding on your same thread after each conversation from them. Tagging appropriate folks and changing, adding different variety of folks ( consumer court, media houses, random celebrity just to keep the whole thread visibility.)\n\nIt about patience. The same trouble that you don't want, same company also doesn't want.\n\nParallely start the same complaint on credit card folks too. This would help you get added pressure. Pay the card bill and then start complaint, so that you don't get tagged as someone who hasn't paid bill, but someone who just trying to get their help. ( start a different reddit question to get help on how to start this)\n\n\n\nLet time work for you. That's what patience is all about. You will be surprised how time and keep track in mail, visibility to world via Twitter thread would help you.\n\n\nGood luck. And again.. patience.",
        "Lmaoo",
        "LINKEDIN!",
        "You need a lawyer.",
        "The seller's registered address was fake. They didn't respond to calls or mails. They are still active after doing 1000s of scams.",
        "What happens is people order stuff, then return duplicate items. These items go back into inventory, and then unsuspecting buyers get fakes.",
        "ChatGPT could be savior in drafting",
        "Put it up on X and tag it to Mukesh Ambani's X account. It will work out immediately for you.",
        "Hope you get your money back op! And do record a video during unboxing of any costly product from next time on....",
        "That’s his first mistake.\n\nApple almost never gives discount. If there is more discount than normal, there is a reason why.",
        "You are a scammer. Simple.",
        "Use ChatGPT to draft",
        "I see. I was just curious because these watches are so expensive and fragile to an extend, I wouldn’t be able to do any extensive outdoor activity peacefully thinking I’ll damage it somehow. Either way I would have preferred any Garmin watch any day as they are far more accurate and built for tough conditions considering the money being spent. \n\nBut yeah in the end it comes down to personal preference especially with the eco system. Hope you get your issue sorted.",
        "Idk why you're being downvote for the real talk.",
        "I also faced a bad situation with LTONLINE.COM, I was very skeptical when I had been filing complaint with https://consumerhelpline.gov.in/. But surprisingly, one of the executives contacted me within two days and collected all details from me. Within one week the seller directly contacted me and send me the keys for a software purchased from him. From his voice, he was frightened and begging for taking back my complaint. Don't worry bro, please file a complaint with this link. You will get your issue resolved.",
        "Already sent 15 days ago let's see what will happen on 16",
        "Ambani ka number dhund 😂",
        "Cause people are stupid enough to believe that they get A grade quality products for \"deep discounts\", think that insane amount of packaging and transportation behind e commerce is good for our environment, do not understand the value of building relations with your nearby physical store.",
        "Always take a video of opening the package (Use a small tripod or ask someone to record the video) as evidence for such types of scenarios. You never know if you will end up receiving a stone in the box. If your complaint is genuine then someone at the packaging facility may have switched your product intentionally. \n\nConvincing customer service without evidence can be very difficult to catch the crook who may be working for them. Many cases like this of products being switched/ stone in the box from online retailers have been reported. \n\nIf Jio is not ready to solve your issue then you will need to approach the Consumer Court for grievance redressal.",
        "Law and order are there, but how much do the people obey such laws",
        "damn! Can’t believe Jio mart could ever do this! 87k bruh that’s a lott💀",
        "Take legal action against them and believe me it is much more easier & affordable than you think.   \n\n\n1. Send a Legal Notice to company through a lawyer.   \nThere are many online portals that can send Legal Notice on your behalf and a few are quite affordable as they charge less than Rs.1400. There are good chances that you will get attention and most probably resolution just by sending legal notice.   \n\n2. But if you don't get any resolution by sending notice then the next step is to approach consumer court and file case. This step is lengthy and may take upto  1.5 years to get relief. But please note that most of the consumer cases are settled out of court as companies will try to save their reputation! So, again chances are better for consumers.\n\nDisclaimer : I am associated with a legal platform engaged in resolving consumer complaints.",
        "The mistake is buying a 80+K watch what the fuck was OP thinking lol",
        "Try filing complain in consumer court.",
        "Good job. Recently bought Macbook air M1 from Apple directly. Could have gone with Amazon but i am not taking any risks for a ₹1L product for 3-4k. I did get free airpods as a part of student discount, but in any case i wasn't going with Amazon at any cost. \"Make an unboxing video\" except it's an electronic item and the damage can be internal, the video will be completely useless in that case.",
        "I see, they have pretty good google ranking/SERP for popular dog feed too. Some products are being featured in non sponsored google shopping tab. Since they are getting ranked so high, it is very likely more people will be soon in your position. They need to be stopped.\n\nHave you escalated the case on edaakhil.nic.in ?",
        "The biggest bastards of the e-commerce space — Reliance",
        "Not a lawyer, but I have plenty of experience with consumer protection matters. Two things you should do.\n\n1. Find out the contact details of the grievance officer for jio mart and send them a legal notice. Under the law (Consumer Protection Act 2019, and E-commerce Roles 2020) they are required to have one and they are required to respond to you within 48 hours. Don't worry about getting a lawyer to draft the notice. You just need to clearly articulate the problem and the steps you have gone through so far. Include the dates of your interactions with their customer support. Attach images, invoice etc. Anything to make your argument stronger. End the notice with some lines to the effect of \"This clearly a deficiency of service and unfair trade practice under the Consumer Protection Act 2019. Further, JioMart has failed to do the due diligence of the seller that is mandatory under the Information Technology Act 2000 and the E-commerce Rules 2020. I want a full refund and formal apology from JioMart by <date> <time>. If JioMart fails to do so, I will file a complaint in the consumer court and the Central Consumer Protection Authority.\" Make sure you include the words \"legal notice\", \"deficiency of service\" and \"unfair trade practice\" in your subject line and in the body of the email in several places. 9 out of 10 chance that they'll just refund your money in 2-5 days.\n\n2. Another you can do is to file an online complaint through the National Consumer Helpline. https://consumerhelpline.gov.in/\nThey also have a toll free telephone number and a WhatsApp interface.\n\nThere's a third thing you can do, which is to write to the consumer affairs dept directly. You can find the email ids from the who's who page of the department website. The people you want to contact are the JS and AS in charge of eCommerce. If you're reading this as of 11th Nov 2023, that would be Mr Anupam Mishra and Ms Nidhi Khare respectively. This one is a very low success rate strategy though. You are likely to get results from the two measures I recommended above.\n\n\nGood luck! Don't let the bastards grind you down!",
        "Tag reliance shareholders and Tim Apple",
        "just me or 87k for apple watch is still crazy",
        "Do you meet the criteria for raising a chargeback dispute through your payment provider?",
        "If you go to chrome or reliance digital in my city and show the amazon price they will quote you the same or less price thats somehow a rule here",
        "Sue the living hell out of them lol. You might get more than they could bargain for",
        "GO TO THE NATIONAL CONSUMER HELPLINE IMMEDIATELY. They are extremely efficient and helpful and the best part is this is completely  digital. Attach the proper proofs (receipts, invoices, relevant images) and file your complaint. Before you go to this step you can also inform the companny customer care thhat you will be taking this step. Sometimes mentioning this itself streamlines the resolution. If you couldn't get a proper resolution then go ahead with the national consumer helpline and the problem will be resolved asap. Also, Fuck Jio's ecommerce division. I had a problem with Ajio where the delivery guy stole my packages and did not respond to our calls. (picked our call at first and then claimed to be in Rajasthan and sttopped picking our calls after that). When we complained about this to the customare care section we were met with such a horrendous display of absolute lack of empathy. Finally we threatened them with national consumer helpine which prompted them to give us a date by which they were supposed to refund us. They failed to comply with their own deadline and we went with the national cocnnsumer helpline. The refund couldn't have been quicker and my Ajio account was banned :). Doesn't matter tho wouldn't shop from them again.",
        "Isse acha flipkart ya amazon se leta open box delivery hai usme",
        "Nope, they are not the same. \n\nReliance Digital is a seller. JioMart is a website where any \"company\" can sell you shit. \n\nReliance Digital is actually very good. They have great service and everything. \n\nJioMart is shit. You never know whom you're buying from.",
        "Tweet it and post the link on the post so that we can retweet etc",
        "If its the same price on manufacturer website… why do people try third party sites? Especially for big ticket purchases? This is something i never understood.",
        "Online shopping had come to this now? Can t even open box without record?",
        "Please file this complaint by registering into Ministry of Consumer Affairs, Govt of india's dedicated consumer online platform through link https://consumerhelpline.gov.in/user/signup.php or telephonically at helpline no. 1800 11 4000.",
        "Try filing chargeback.",
        "Raise a ticket through NCH.",
        "Like amazon?",
        "You don't give up. Write about this in 'Mouthshut' or similar sites. The company will have to respond.",
        "Feel like quality control checks aren't being done on returned items unless the scam is so good that it passes all visual checks.",
        "No. I didn't pursue edaakhil because I felt it would end up like NCH, with no resolution.",
        "That's why I don't buy above 50k products from online stores.",
        "There is also the fact that if third party seller also sells same sku and its also fulfilled and stocked at amazon warehouse, third party sellers fake stuff will get mixed with appario stuff.,",
        "Again bs, don’t listen to his advice. Buy only from official site or store",
        "Grok**",
        "Fucking sue them",
        "Goddamn bruh, that's horrible. Hope you are recovering well, it's difficult. Just don't put your mental health dependent on the outcome of this fight, but do fight them, being in an industry where time is of the essence and providing such abysmal service is criminal. Make their life hell.",
        "buying a 90k watch, you might have got scammed in life.",
        "Melbon ☠️💀",
        "Yes, if its an expensive item, you have to film the real unboxing so that your case is watertight. \nStart from the packaging and film everything. \nI buy a lot of electronic items from all the big 3, have been scammed out of a 4tb hdd on flipkart, but got my money back because I filmed it. Also, I contacted flipkart team on Twitter DM. They were helpful.",
        "They have to provide a solution or a satisfactory answer within 48hrs of you raising the request, but now it's late, you can file a complaint now",
        "OP doesn't \"kinda\" deserve this at all. Now, I would suggest to the OP to be aware enough to film the complete unboxing experience by clearly showing the untampered outer packaging and proceeding further. Then he can just upload the video to social media so it's not his word against jio's.",
        "That was absolutely reprehensible, you should mention the road where the store is if not directly. And dont delete that video, you might want to caution your friends and family.",
        "Thanks for posting, that's really encouraging and I'm bookmarking this.",
        "Dont waste your another second contacting the jio mart help. As its been over a week . The only solution is go to your district consumer court and lodge a case against them.\nThey will refund your full amount and will give you the desired apple watch for free.",
        "Lol who buys from jio Mart that too a luxury product",
        "Fiduciary duty, I like that, it's true. It's why  platform is even allowed to conduct business, they have to have consumer protection in order to be allowed to do business.",
        "Hey there is a national consumer helpline. You can just upload your grievience there",
        "Iam wondering how did an Apple watch cost almost 90k in the first place",
        "This is 1",
        "If u have paid through credit card , just inform them u have been scammed and put a chargeback request",
        "yes file a complain in consumer court",
        "Yes, Thats him. No ofcourse not, I would do it just to give him trouble. This money doesn't matter to me now. Its been sometime. I tried my best to shame him. I found out about his college too. He is from GIET Gunpur, Odisha. I reached out to one of his batchmates and told about him. Wanted to hurt his social circle, but couldn't reach much. Its was just personal revenge for me. He was such a shitty human to pet parent who was already losing their dog. As for my Goldie, she was destined to die as her previous owner had left her untreated with a liver infection on the street, she was terminally ill, I was just getting her more time as she was a genuinely happy dog despite all the hardships she had been through. She is still in our hearts as a dog who happily hopped her way across the rainbow bridge.",
        "Why didn’t you buy from Croma, reliance digital or the Apple Store bro",
        "r/LegalAdviceIndia might help",
        "Get yourself a cyber insurance guys!",
        "Jio providing good telecom services doesn't automatically make it trustable in other fields.",
        "I THINK YOU NEEDED TO BE SCAMMED.",
        "Make it dirty",
        "Wake up babe(r/indiagaming) new flipkart just dropped",
        "> Jio is trusted.\n\nSpeak for yourself.",
        "Bro, just buy from retail if you are spending more than 5k unless its a reputed source.",
        "Why not choose Amazon, or least Flipkart… they have much better standards for online shopping, Reliance is better for offline shopping..",
        "Uv been scammed by the employees.",
        "Croma me chale jata buy krne",
        "yeah, they do. there's a lot of stuff sold by reliance retail themselves, but also  a lot of shit that is not. although there are no seller ratings shown (and very few product ratings too tbh), one is always better off looking at the seller name before buying from there.",
        "true. i've had to return some clothes before and after initiating return, there was absolutely no update for around two weeks. i called the customer service and they told me that it is underway, but there was still no update. i didn't actively pursue the return because i didn't have any major issue with the products, but after several days i got a message from delhivery about the return pickup. it took several more days for the pickup to actually happen (and i blame this on delhivery, it's very typical of them) but once it did, it again took arround ten days with no updates whatsoever until i got the notification for the refund. \n\ni did however recently have a bad experience with a jiomart return. the same thing as before, return initiated but no update, then the delhivery message but no pickup. however, this time when i checked the app, it was marked as \"return rejected\". i called the customer care around three or four times, wrote to them and the customer service head around thrice as well. they assured me pickup had been rescheduled and it would take place, but to my surprise the ticket had been closed without any update or resolution again. i again contacted them multiple times and recieved positive replies, only to be told on the last email that they'd crossed the \"maximum attempts\" for the ticket and would not process the return (despite it being completely their technical faults). i was very pissed, but couldn't really do much. this whole fiasco took around a month, and i really hope that's not how it goes for op.",
        "If you already have a history of similar refunds then you are likely to be suspected as a scammer, these online stores get a bunch of those daily just saw a news about guy who refunded 20L worth of products from Amazon with x customer support agents help.",
        "> doesn't jiomart have open box delivery stuff?\n\nnope, at least not in my experience. they just courier it to you via delhivery.",
        "Rs. 500/- to 50k or more depending on the case. \n\nFind someone to file consumer court case, If you haven't been able to do it correctly.",
        "Bro, but what about the cost of sending legal notices? How to get that back?\n\nYou just bought a product and because of the incompetency/fraud of the people working for the platform, you have to go through so much hassle and pain and time just to get your money back?\n\nDoesn't seem fair.",
        "Who tf buys a 90k watch and that too from jio mart bruv",
        "Consumer complaint.",
        "Send me too.",
        "Who even buys from Jio Mart?",
        "yes with me too they are scammers",
        "Taking the real risk, bro😁🤣",
        "Had it gone as planned you would have had an Apple Watch. You basically were scamming yourself and someone beat you to it.",
        "Their customer service is shit . I once ordered 2 packs of cheese wo saale 1 deke gye aur fir customer support walle phone utha ke raazi ni ho re",
        "Why would you busy it from.jio.mart..why not Amazon",
        "Well it's India. You're not getting your money back.... They need it",
        "Hmm",
        "Keep calling costumer care and pressuring them. Ask for supervisor and always talk to the supervisor. I had something similar and I used to call them at least twice a day. After a week or so they accepted the return and refunded me.",
        "The best thing you can do for all these expensive purchases are using your credit card for payment and filing a dispute in case of such fakes. I have successfully done the same against Flipkart for selling fake camera lens.",
        "Flipkart sells Motorcycles ? Wtf",
        "Dude put in LinkedIn  tag the CEO manager whoever is involved. Post the invoice too.",
        "That’s sad bro. Hard lesson. Shoot video from taking delivery to unboxing, always! You would have received refund. But now, there’s not much you can do! Seller or delivery partner scammed you!",
        "Just 3 days back I've ordered Jio phone Prima 4G phone and now skeptical whether it'll be real one or not.",
        "Yes, Purchased my xpulse on Flipkart. Picked up the bike the next day from the allocated Dealer. They have partnership with Hero Motocorp. This was one reason why I ditched my plan for Himalayan. I was getting 13k discount on the ex showroom.",
        "First mail them by threatening to file a case in the Consumer court and also post this thing on Twitter and give this info to some youtubers on insta who will listen to you if that also doesn't work. Go to the consumer court to punish these scammers.",
        "You deserved it for buying an Apple product from JioMart instead of Apple’s own website. 😌",
        "Dispute the credit card charge?",
        "You just wasted 87k just on a watch",
        "Did you win the chargeback?",
        "Like I said, I haven't heard anything yet. Bank sent me a message 1 month after I initiated, saying some investigation will take 30 days or something. It's already been 2 months since the return was rejected. These processes are slow, and it's easy for Flipkart and others to just scam you and get away with it.",
        "Bombard their linkedIn, Instagram, consumer court is not free and takes time. Also if you live in one of the cities, where they have an office like Bengaluru, please visit their office. I would have created a ruckus if it were me, 90k ke saath saath apne haath ki ghadi bhi dete ye log. Also if you can spend 87k don’t be cheapo for a few hundred extra discount",
        "Bro don't trust online platform for high value purchases. Always go to authorised physical stores even it costs more.",
        "Twitter and other social media platforms",
        "Never buy anything from jiomart . noted",
        "Bro, it's jio Mart, like why",
        "Buying an 90k device from jio Mart what were you thinking?? I wouldn't but that from Amazon even. either you should get it from apple official website of offline stores, I know this ain't gonna help now but is someone is seeing my comment y'all should keep in mind",
        "People forget from time to time, that India has never been safe for online shopping.\nIt was uplifted by Amazon with it's customer centric policies and people started trusting in online shopping.\nEven Flipkart was not able to do it at that time.\n\nI still remember 10 years back I wanted to order RAM online and my father used to say, it's not safe ordering online.\n\nSo, take caution if you are ordering on any other site other than Amazon. Amazon has best customer services.\nEven Flipkart will not resolve your issues.\n\nAnd avoid big purchases if product is not available on amazon.",
        "Take to twitter and find JioMart and start commenting on their each and every post with your complaint and tag Jiomart. I have seen most brands would respond on twitter rather than conventional channels.",
        "OP In which state you are? I might get you to contact the highest authority via Linkedin. I have worked at jiomart in punjab. I’m a former employee of Reliance",
        "What is the difference between WORSHIP and SADHNA?\n\nFor More information read the Book  GYAN GANGA 📚\n🎯TO ORDER A FREE BOOK 🎯\n✏️NAME\n✏️DISTRICT \n✏️STATE\n✏️PIN CODE \n✏️MOBILE NUMBER",
        "at my location it's fees is less than 100₹ and you can represent your case",
        "Dude, life is not fair.   \nI would rather spend Rs.1500 more to save my investment in the product than waste it completely as the product is defective/useless. Moreover, when you take legal action there are chances you get connected to someone in the company at higher level and they can offer discount / gifts to make you happy.",
        "Though you can do the same but they are just a platform to re-discuss the matter with the SAME customer support team than anything else! If they fail to get any reply or any help, they will ultimately ask you to take Legal Action! So, what the whole point of wasting efforts & time?",
        "Hey, I've used it 5 times. And it has been resolved all 5 times. It can be used against the company as proof incase you goto court",
        "Thats great!  \nWhen you go to court even your emails and company chat or support tickets are a valid proof. So, I will still not waste my time in collecting more proofs when I already have a clear case of deficiency in service or unfair trade practice.",
        "Again I've always seen that things get resolved when I raise a complaint on nch. I didn't have to go to court. \n\nWhy do you need to goto court of there's a chance of fixing it before",
        "With due respect, I am not advocating going to Court.   \nI am simply suggesting taking legal action by sending Legal Notice through a lawyer. Thats a pre-step of approaching consumer court!",
        "With online purchases we have to be very carefull. Even the suppliers are scammed by customers and courier partners and the online portals do nothing. Has happened on Meesho also.",
        "That cost money, this doesn't. You can approach lawyer post no resolution here\n\n20-21 there are like 6.7 lakh dockets raised on their systems. I think it's fair enough to use this before you need to approach a lawyer",
        "You can check the image here\nhttps://ibb.co/ZGSzX11",
        "Check websites of Jio mart or Reliance digital or Reliance retail you can find a greviance email on their websites. I think you can mail directly to CEO aur head of customer support.",
        "File a case with all the documents in the consumer court. Also you can post a message on twitter explaining your problem and tagging in directly the CEO of Jiomart. That's it.. Problem solved. Do it and get your problem solved. Don't delay. As a first step, you can just post the message on twitter with ceo and other top officials of Jiomart...Your 87K is not a small amount and when you post on twitter whole India will look at it and your refund will be very fast...This should 100% work and but if you are unlucky and If it doesn't work, Go to consumer court... I know this is little painful but losing 87K is more painful...If you go to consumer court, you will definitely get a refund or replacement and also the monetary compensation for the mental struggle you have undergone all through this period.",
        "Fee taken is directly proportional to the extent of strong words used in the Notice along with legal knowledge of the lawyer",
        "Guys I will draft for you for 500 rupees I am a legal intern",
        "1- File a charge back from your credit card company .\n\n2- File a complaint at [https://consumerhelpline.gov.in](https://consumerhelpline.gov.in) ( Upload all the screenshots of email communication)\n\ntake the screenshot of the complaint email it to E commerce company.   \n\n\nThis is how i got my refund from Unacadmy , trust me it is tougher than Jiomart.",
        "Pursuing edaakhil wouldn't hurt, never gone through that route. Maybe someone can shed a light",
        "Online shopping for me is only Amazon.. I don't buy anything from any other online shopping app other than Amazon..",
        "Yes, like Amazon.   \n\n\nBut Amazon has \"safe\" sellers like Appario. I don't buy expensive stuff from amazon unless it is sold by Appario. For expensive electronics, I would trust Vijay Sales and Reliance Digital way more than any online store.",
        "Complain to National Consumer Helpline online. They solve it within 48 hours.",
        "file FIR complaint towards mukesh ambani for his different products which is not given then escalate matter to consumer court then head towards supreme court for emailing them directly then watch it!!",
        "Quick question:\nDoes the Consumer court charge money? I filed one against Amazon(long story) but the amount I filed for was less than 3K. I got a WhatsApp from a lawyer working with consumer court and he's asking me for 299 INR. Is this legit or what? His profile on WhatsApp seems legit.",
        "Grok asks for a Premium account on X  :/",
        "Telangana",
        "To raise a complaint against JioMart, you can follow these steps:\n\n\n1. Customer Support:0620-0770-780 Start by contacting JioMart's customer support team. They are usually the first point of contact for resolving any issues or complaints. You can reach out to them through various channels such as phone, email, or live chat. Check JioMart's website or your order confirmation for the contact details.\n\n\n2. Clearly Explain the Issue: When communicating your complaint to JioMart's customer support, make sure to provide a clear and detailed explanation of the problem you are facing. Include relevant information such as your order number, date of purchase, and any supporting evidence like receipts or screenshots.\n\n\n3. Maintain Documentation: Keep a record of all communication with JioMart, including dates, times, and the names of the customer support representatives you interact with. This documentation will be useful if you need to escalate the complaint later.\n\n\n4. Escalate the Complaint: If you don't receive a satisfactory response from the customer support team or your issue remains unresolved, you can escalate your complaint to a higher level within JioMart's hierarchy. Ask to speak with a supervisor or a manager who may have more authority to address your concern.\n\n\n5. Contact Consumer Forums: If your complaint is still not resolved, you can consider filing a complaint with relevant consumer forums or regulatory authorities in your country. These organizations are responsible for protecting consumer rights and can intervene on your behalf.\n\n\n6. Seek Legal Advice: In certain situations, particularly if you have suffered significant financial loss or harm due to JioMart's actions, you may want to consult with a lawyer who specializes in consumer law. They can guide you on the legal options available and help you navigate the process.\n\n\nRemember to remain calm and composed throughout the complaint resolution process. Clearly articulating your issue and maintaining a record of your communication will significantly improve your chances of getting a satisfactory resolution.",
        "In case of complete cancellation of order, delivery fee will be refunded 801-1896721 to you along with the product amount you paid. In case of return of already delivered product, delivery fee will not be refunded, only product amount will be refunded. 801-1896721",
        "In such cases, Return request can be initiated post 801-1896721 receipt of the products. The amount shall be refunded to you through the same mode of payment (in case of Prepaid) or via credit to your store credit account (in case of COD) which can be used for subsequent purchases.801-1896721",
        "In case of complete cancellation of order, delivery fee will be refunded to you along with the 801-1896721 product amount you paid. In case of return of already delivered product, delivery fee will not be refunded, only product amount will be refunded. 801-1896721",
        "If you are unsatisfied with a purchase from Reliance JioMART and wish to request a refund, you can contact their customer service team through their website or mobile app.801-1896721 Provide details of your order and reason for the refund request, and they will assist you in processing the refund if applicable.",
        "To talk to an Jiomart executive through the 198 helpline, you can try the following steps:\n\n\nDial 0637~2293–165 from your Jiomart mobile phone. This is the customer care helpline number for Jiomart in India.\n\n\nListen to the automated voice prompts carefully. The menu options may have changed, so follow the instructions provided.\n\n\nIn some cases, you may need to press a specific number or stay on the line without selecting any option to connect to a customer care executive. Listen to the available options carefully to find the one that allows you to speak with a representative.\n\n\nBe prepared to wait on hold as there may be a queue of callers ahead of you. Customer care lines can sometimes be busy, so patience will be necessary.\n\n\nOnce connected to a customer care executive, clearly explain the reason for your call and provide any necessary details or account information they may ask for. This will help them understand your query or concern better and provide you with the appropriate assistance.\n\n\nIf you are unable to reach an executive through the 198 helpline or if the process has changed, I recommend visiting Jiomart's official website or contacting their customer support through their official channels to inquire about the best way to speak with an executive order to get.",
        "First mistake I did was buying an Apple Watch Ultra from JioMart.\n\nI received a wrong product, I received this Watch 6372<293-165 Melbon Astra. Immediately I was worried and I went to customer service via chat and previously I had refunds go through when the product was damaged such as oats so I thought I will just return this and get replacement/refund.\n\nFast-Forward 1 week later, Over 25 customer service agents contacted 10+ emails to customer support, customer support head, Even A consumer complaint/grievance,\n\nAnd still nothing. They have kept the return request on hold. First they said 3 days, then 4, now it’s a week. I don’t know what else to do. Someone help me. What do I do. I have the invoice for the original purchase, I don’t know what to do.\n\nNo one is doing anything, every chat agent keep saying give us more time give us more time. How much more do they want?hshd",
        "To raise a complaint with Jiomart, you can follow these steps:\n\n\nContact Jiomart Support:07439-106-971 The first step is to reach out to Jiomart customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint.\n\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively.\n\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\n\nRemember to remain polite and provide accurate information throughout the process. Jiomart customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution.cgctch",
        "To file a complaint with Jiomart, you can follow these steps:\n\n\nContact Jiomart Customer Support: 06372-293-165.The first step is to reach out to Jiomart's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint.\n\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively.\n\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Jiomart. You can reach out to customer support again or try to escalate the issue through their social media channels.\n\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\n\nRemember to remain polite and provide accurate information throughout the process.customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.cgxghc",
        "To raise a complaint with Jiomart, you can follow these steps:\n\nContact Jiomart Support:06372-293-165 The first step is to reach out to Jiomart customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint.\n\nProvide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced.\n\nBe Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint.\n\nAttach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively.\n\nRequest a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate.\n\nFollow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with . You can reach out to customer support again or try to escalate the issue through their social media channels.\n\nUtilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation.\n\nRemember to remain polite and provide accurate information throughout the process. Jiomart customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution.cgctch",
        "If paid via VISA or Mastercard raise a charge back claiming wrong product delivered",
        "The bastard Ambani family became rich just by looting the customers & he is the one of the main reason that we indians lost trust on indian companies.",
        "did u get your money back?"
    ],
    "cleaned_text": "jiomart scammed k refunding first mistake buying apple watch ultra jiomart received wrong product received watch melbon astra immediately worried went customer service via chat previously refunds go product damaged oats thought return get replacementrefund fastforward week later customer service agents contacted emails customer support customer support head even consumer complaintgrievance still nothing kept return request hold first said days week dont know else someone help invoice original purchase dont know one anything every chat agent keep saying give us time give us time much want ",
    "cleaned_title": "jiomart scammed k refunding",
    "cleaned_selftext": "first mistake buying apple watch ultra jiomart received wrong product received watch melbon astra immediately worried went customer service via chat previously refunds go product damaged oats thought return get replacementrefund fastforward week later customer service agents contacted emails customer support customer support head even consumer complaintgrievance still nothing kept return request hold first said days week dont know else someone help invoice original purchase dont know one anything every chat agent keep saying give us time give us time much want",
    "cleaned_comments": "consumer court first mistake buying apple watch ultra jiomart mistake buying apple store website telling op people generally buy airpods apple watch official store unboxing video screwed also buy reliance digitalapple jiomart bought amazon flipkart import date bit old apart device issues warranty apple apple stores nolow discounts dont want buy unboxing video theres always two sides coin guess dont proof either playing victim card barcode jio mart label box understand situation bt jio mart se apple watch q buy kiya official apple site se lete cant afford buy apple product apple store ready apple life ordered credit card please file chargebackraise dispute bank tf orders apple watch ultra grocery marts never understand people buy expensive stuff online huh trying save lakh phone aint worth man post twitter try get much attention possible wont listen otherwise still dont understand people dont buy costly stuff walkin stores like reliance digital would definitely available tier cities nowadays buys jiomart motabhai product pushed gobhi products tolerate jio jio sim jio fiber tag head honchos linkedin twitter worked ordered jio vr srt ipl get delivered even ipl may giving discount couple things always buy expensive stuff physical stores going person online people would scam god could get away always record unboxing electronics expensive items friend bought phone unboxed right store paying recording box inside looked bit weird repacked phone slight scratch side barely visible got recording recording also got store sales person first denied responsibility asked us go service center said put video online tagging samsungthe brand mentioning store name quickly cancelled purchase gave friend another unit gave discount another unit bought work good sir could explain hit cibil anything named jio reliance fraud trust fraudkart jio tf buys expensive shit jio mart prefer apple store amazon like k amazon card benefit apple store amazon offline costs zero problem amazon scamcarscammartsnapdealmeesho blah blah even k discount dont go absolutely arey kya sab ek h gyaan de rhe ho k bought jiomart ab toh usne khareed liya kuch nhi ho skta uska aage kya krna h wo batao lol costs maybe discounts jiomart never convenient thats basically said said hope internal investigation find culprit imagine someone ordering mariegold watch receives apple watch even sarcastic truth hope op gets refund make mistakes save extra buck ive bought expensive stuff good site jiomart idk cibil bank instantly redact transaction cause money youve used purchased real like buying k watch lazy af buy store apple official website come dude hate say kinda deserve unless valid reason likenone valid reason could gone applecom easy peasy toh reliable jagah se order karo na point dont get people would order products worth afford lose anywhere amazon even reliable sellers amazon melbon exactly dude paid exact price applein theres amazon theres anything else still worth im sorry say folks dont trust jiomart onions tomatoes buying k watch actually price official apple india site going hard prove likely say replaced etc thats reason seasoned ecommerce players like flipkart open box delivery may ask went ultra fact youre probably rich get perspective k apple looks like op paid k jio crazy risk little discount id rather pay extra trust online seller especially jio kind stuff either amazon offline yes atleast genuine site like punishing victim source used work parent company jiomart reliance digital belong shit right yeah materialistic life recourse someone pulls stunt dept store buying tvfridge always get flabbergasted seeing people getting scammed weirdest way possible trust appealing shop page risking k k discount wont go far saying deserved bro wow price much price us apple products expensive india doesnt make sense happy diwali also dont wan na ask wrong say honest always buy apple products offline authorised resellers even online cost agree saves lot hassles like jiocinema buy credit card initiate chargeback thats case bank website contact bank support keep stalling defending seller also purchase jiomart buy directly apple exact price shitshow didnt even return policy faced issue yeah exact price although checked jiomart seems reliance retail officially selling itso yeah bhai isme gobhi modi kaha se aa gaya theres investigationthe stores bank investigate bank investigate ask details either party dissatisfied visamastercard investigate guess contact point initiated chargeback flipkart giving defective pixel havent heard crap far post entire incident twitter pictures tag official jiomart handle gives customer service incentive help faster like veto enough proof bank reverts transaction along penalty seller time sellers given short period time refute well usually goes like yes cant trust anything country law order completely gone crap everythings going get worse unless kick sanghis power like naive life apple fans blindly pay large sums money questionable qualityto fair plenty premium products exorbitantly priced paid via credit card raise chargeback request always remember apple price almost almost everywhere dont get trapped knw well coz dealing apple flipkart also scams didnt offer open box delivery case either apple directlythey sell exact price high import taxes sales taxes must send money bjps swiss bank account damnit new made india iphones priced sensibly jio customer service serve interests company serve customer thank generous contribution towards nita ambanis diwali gift rolls royce car file case consumer court one else help dont go especially k discount definite scam post x formerly twitter share link community retweet thats never open websites even dalchanna sorry wanted repeat thousand people repeated nobody reads anyones comments feed egos correcting incorrect correct everyone knows smart doubt theyll still overpriced meant shut cheap labour make devices others get amazing discounts see us discounts sometimes get crazy exorbitant prices lowest wages try raising twitter would never personal spend big purchase jio mart doesnt look reliable lots comments post saying heshe deserved bought official apple store people seem missing point fiduciary duty online platforms sell genuine defect free products opinion op right buy jio mart even save bucks would suggest patient try posting twitter linkedin post link help gain traction nothing works take bastards court point think yeah lem order one lakh worth order internet realize whos gon na help things go south one thing learnt hard way buy expensive electronics online may get k discount aint worth hassle get delivered wrong product damaged product especially days hear lot scams happening delivery products outsourced companies want discount try visiting stores like croma vijay sales festive period ask offers ordered phone amazon got wrong phone first time around replaced phone box already opened device received dent match imei number box process took almost month resolve given away old phone time delivery led without phone almost entire month amazon less risky risk free seen people ordering genuine things place return request hand fake replacement genuine item collection guy make point buy things major value coming brand name online sites generally authorised resellers also discounts cards theres bought ipad air k discount ivenus hdfc credit card sure online sites would offer cheaper deals prefer buy precious things shops gareeb ameer bhai jiomart wale rations sahi se de nhi patey ordered many times always misses item grocery delivering agreed talking apple life cmt title scammed ordering k product jiomart wouldnt trust jiomart even rs order blowing k without second thought chargeback bought l laptop asus website directly could risk save money amazonflipkart still taking chances better buy product site directly safe warranty stuff twitter pe tag karke dekho put twitter approach consumer court amazon far superior regard need sensible enough record unboxing bought laptops phones accessories zero issues avoid flipkartjiomartcroma online cost general avoid buying online period yes slightly offtopic recently fireboltt company firstly refused refund neither model smart watch sent different model lot back forth didnt agree refund money sent legal notice lawyer suddenly agreed refund maybe dont go way send legal notice talk via email call sent legal notice respond soon jiomart takes usually month sort refunds hold tight explain case times progress get refund think hope amazon source trust getting stuffs online period file f r cheating fraud breach trust know pandu may cooperate claiming civil dispute file complaint local magistrate difficult prove actually received wrong item criminal case directors jio read bambanis compel jio offer refund immediately done flopkart impleaded pansal co consumer court best option damaged macbook charging magsafe port apple accepting filed case apple agreed court settlement gave new sealed piece return old one whole saga took like week ya go court asap make sure take print outs mail communications made next time get urge shop online book croma visit store delivery much better experience hey contact getmyrefund twitter might help case lawyer cause hope flat refused take delivery ive bad issue amazon well sending something meaningless part delaying product weeks telling experience might got lucky experience less flipkart jiomart still lodge consumer court complaint mark ceo every twitter interaction daily threads find management ceo email ids write proper worded email entire concern including orderid names people talked call twitter person followup twitter replies emails per day ask callback thousands indians lodge complaints daily need go berserk get eyes happened flipkart apple watch got every single rupee back without court case without proof parchun ki dukaan se apple watch kaun leta hai bhai myth buy brand website youll get impeccable rma experience buy amazon youll get company warranty well product basically amazons responsibility within warranty period tried rma game controller couldnt get company telephone email instead called amazon arranged return gave full refund months purchase dont buy expensive electronics jiomart infact avoid buying electronic items jiomart speaking experiencei bought logitech webcam package arrived box old crumpled evident box lying around couple years crushed items webcam flat detect first times tries finally started working clear either old product returned someone maybe discounts thats people still buy flopkart get scammed discounts reason would really bad financial planning risk entire money spent measly discounts high cost purchases spend days confirm sellers trustable buy even record whole delivery unboxing wtf logic guys buying jiomart wtf amazon also fine make sure seller rk world infocom appario yo bro try contacting national consumer helpline nothing works good job getting things done makemytrip didnt refunded flight cancellation month contacted got days try amazon lot scammer issues extent rest search samsung flagship phones tablets watches amazon example filled imported used pieces sold new amazon superior support rest especially account trustworthy go file complaint add necessary details btw choose company right unsure call number let agent handle write much cost send legal notice never sent ny past consumer complaints failed amounting never bothered legal notices assumed would costly would good know estimate atleast bought motorcycle worth ex showroom flipkart works really well multiple times indeed threat taking issue court via email would wonders wan na buy premium online try tata cliq issue outside top brands many direct stores employ bad logistics logistic guys pull scam still unboxing video help never know always look savings thats must first file police complaint court cops job collecting evidence might wrong jiomart isnt retailer aggregator sellers could go scamming reliance digital proper retailer diffferent brands op likelihood get resolved slim learnt important lesson friend goes way beyond money lost everyone stupid things part life dont know financial situation loss impact know person cheated pay one day maybe dearly karma sucks definitely give get money friend know one form learnt mistakes hell would buy much jio mart appreciate writing mistake buying jiomart hope win get reimbursement upgraded debit cards chargeback yes pls purchase att electronics electronic shop nearby youif get issues easy resolve jio official retailer apple op wrong mistake kind expensive business group companies waste much money stupid watch definitely lottery record video unboxing yep jiomart likely aggregator reliance digital actually great customer service solid big items really come price get buy u record unboxing product bro ops fault jio trusted jiomart product title image apple watch though thanks op know even jiomart sucks appario unreliable seller platform ordered airpods instead got random fakes take entire thing consumer court order get refund alea pay cash upon delivery companies win us individuals dont wan na go much work brain teasing recently got scammed one didnt wanted go procedure best way order expensive things online much costed send legal notice dekh ambani ki company ke barey shikayat dekh kar automoderator ki bhi fat gayi people think unboxing video yt channels basic requirement jiomart official reseller really fault think youre missing point course online platforms sell authentic defect free products fact duty consumers limited resources time choose ones reliable saying saying jiomart free culpability rather asking op prudent making decisions future home delivered csrton pick showroom later dont point go jio mart official retailer reliance digital official retailer apple unfortunately ive used debit mostly depends advocate cheap fees find small advocate ask friends get advocate might take big fat fees lol nothing whos power integrity issue regardless whos running government shit like continue happening till civic sense improves everyone buying product upwards k especially small items like phones watches always make opening video many bastards selling fake stuff replacing costly products make safe hard proof yes jiomart rd party sellers like amazon always look seller ratings placing order hiking trekking better outdoors completely independent iphone jio mart got worst customer support good american nice see one get scammed sincerely hope becomes plague life deserve think culture scam americans phone email ceo higher first goto consumer forum onlinr filed one alr stuck progress upgraded debit card still able dm ill send one free thank everyone advice ive filed consumer complaint days back already im looking consumer court suggested many people unfortunately didnt take unboxing video excitement chances look slim hope solve lol fucking loser lenovo u mostly better official site good discounts deals depends lawyer mine family friend free also complicated process ive seen draft notice looking templates online send email also hard copy via post mandatory step cant directly file case far know first send notice fail respond given time frame response unsatisfactory go ahead case companies fight back refund amount cost know wrong side pull shit know people wont go court hassle get money back op dont worry able process reason let know help yes think somehow need make average consumers aware dont worry countrymen women still stupidest people earth never never buy apple product anywhere except apple store apple website authorised store everything else trusted ppl doesnt even trust jiomart small electronic items ordered apple watch ultra looks like brain sonpapdi suggest head court replace would got much discount around kk bank offers dealer offers unicorn inspire etc hope see better shopping future jiomart one worst customer care services recommend buying small goods basic groceries good expensive stuff paid credit card raise chargeback request kinda shitty say op deserved jio big name india dont really need reason choose buy nice post twitter tag people ask everyone retweet post catches lot attention credit card chargeback flipkart also big name india see scams flipkart right thats opinion plus said op kinda deserve used kinda cos know fault jio gave something else fault buying apple store cos theres even discount anything buying price file complaint consumer forumits quite simple web page lenskart issue refund filing forumif forum doesnt work send legal notice go straight consumer court theek hi hain different box whats issue croma online used times issues till thanks lot try initiate claims scammed k pigs attract low prices baught grossaries none got delivered payment made credit card raise dispute bank request chargeback ye toh instagram like share comment karne bi mil jati u raised issue twitter bhai pr jio mart se ye kon leta hai yaar tamatar aur bhindi lene ke liya sahi hai bs boat got scammed amazon fakewrong apple watches common amazon seems customer support becomes helpless end learnt lesson buy k products retail stores bought online make sure record open front delivery returns guy see hate people hold buyers accountable choice rather big corporations responsible op doesnt kinda deserve like send mail god youre talking amount eighty thousand rupees k really important couldve avoided yes email hard copy via post go straight rlegaladviceindia looking buy apple watch online go last hope consumer court buy reputed sellers like appario others mentioned comments give one final warning fail comply refund move consumer court evidence chat snippets definitely win money also compensation hassle youve put also got scammed scam seller amazon think lol amazon agents calling forwarding abruptly ending call lol putting hold mine small amount k still lot think would better make legal court order small moneypeople even put cases rs lmao better make pay fine amount time wasted im sure u get youre willing spend k watch k big deal lol consumer guidance society india may call hear provide email address also mention sort outcome hope achieve take time get compensated replacement damages seek currently facing issue flipkart samsung around calls emails proper resolution dont even live city going service centre like hr trip heck thats placed order online first place feel time switch offline mode shopping would buy fucking jiomart jiomart trusted aggregator direct retailer idea buying jiomart im saying op deserved get scammed anything anything expensive aggregator including amazon avoided least unboxed video first mistake buying apple watch second buying expensive thing third mistake recording unboxing product never buy anything jiomart worst customer support team also refund amount jio wallet without asking customer mode refund font first image looks like cheap untrusted website wonder jiomart isnt trustworthy know appario amazon right hour chill saving k strap scamming also contributing indian economy feeling pharaud jai hind honestly wonder anybody would spend k piece plastic encased aluminum called smart watch irony real post every thing twitter tag reliance post ive seen work people maybe could help go twitter tag jiomart start nagging least times days recent tweets always tag ceo cto management need upvotes appario amazon proxy however twitterx filled recent posts fake stuff sold appario id recommend caution appario file consumer complaint consumer forum youll assigned lawyer explain issue lawyer send legal notice company file compensation also thank thing happened flipkart months nothing happened filed consumer complaint hence got refund tf bro deserved using well known store people assume safe expecting atleast original products one biggest retail outlets way lazy stupid lol hmm well daredevil shops flipkart buying much expensive product jio mart celebrating shit op got fucked telling stupid order jiomart could get thing apple store said kinda comeo dont use tf cant read fuckin sentence properly kinda showing ops mistake got wrong product got fucked order one jiomart flipkart recommended ordered airpods pro type c gen came lot scratches flipkart denied replace return looks like someone learned valuable lesson hahahahaha dont video unboxing forget itjiomart srsly bruh bought expensive product official store totally choose buy expensive item online online portal mixed bag credibility think deserve bro need help resently send legal notice fampay app ask share imei number device tell youll file police complaint store didnt anything share imei number amazon amazon decent rd party shopping website ive ordered fairly expensive gadgets running lacs ive exactly case got fake item years ago amazon rectified situation right away would never trust flipkart jio apple official online store india stick apple products jiomart absolute scam scammed rs sent different item customer support worse bsnl posted twitter simply blocked account stopped responding thats like saying mukesh official retailer neeta aakash isha ar report file chargeback bank upload necessary documents take screenshots communication jiomart supportthe better proving case tc id chargeback shit credit card consumer court got back simply file complaint online without going ever airtel issue resolved raise complaint consumer portal difficult ignore fact nowadays customers also scamming get first copy market buy original online stores know scam consumer court help dumb maybe stop paying internet bills buy almonds something sharpen brain see like daily posts online scams amazon flipkart jio myntra well video evidence unboxing video idk dont trust people online might faking scammer genuine didnt fake fool making unboxing video products get replaced inbetween transit scummy delivery agents yes thing happened scammer refund amount happened surprised although amount nothing compared k jio mart known scamming customers happened many friends relatives mine link pls jio mart platform like amazon usually app retailer app arent sending products directly warehouse bc latest laptops wh bhi discounted price offline store wle rkhte nhi hto new faadu latops discount k saath lha se lene ka jiomart sucks thats issue appario trustable seller amazon started scummy shit worried wanted buy iphone priced high apple store acer nitro laptopfrom buy offline wle discounts amazon jitna dete nhi latest laptop bhi rkhte nhi chhoti ganga bol kar naale main kudwa dia bhai ko really dont get people apple products stores apple stores check service heard efficient youre getting massive discounts newer models apple products good true im seeing lot comments saying buy official apple store buy amazon amazon apple thing amazon sells apple products third party sellers arent allowed sure well implemented practice generally dont get anything original product buying amazon also means even cheaper amazon official apple stores apple say final price amazon flipkart deal neither jiomart obviously yeah apple store amazon go semi official offline apple stores like unicorn ivenus stores like reliance digital croma good hope get money back send want send atleast get croma consumer court id also try escalate speak highest levels also youre speaking dont crass speak composed professional yet stern manner actually shifts authority tend receptive im positive get sorted without court option usually high value item transaction matter wont resolved simply accepting returns electronics fraud happens requires lot manual intervention speaking seller well kind depends seller responding identify fraud took place origin item delivery responsible entity would identified give replacement likely refund last option wont settled week expect least weeks consumer court speed process guarantee return provided committed fraud always fucking buy oem presence india send bro even didnt get apple watch got wall clock packed apple box pl thanx advance nothing done ambani try writing grievance nodal officer mail regarding issue make sure tone email threatening think smartwatch gadget scam best smartwatch like phone better phone available price point one valid grievance registered nch national consumer helpline company come back wits tried tested person buy watch k dont really care discounts wow right amazon good seems companies afraid law regard law rob peter pa paul middle class hes fond apple products upper middle class easily buy watch rich ppl wear richard mille watches info original value product middle class ppl fond apple products get installments upper middle class ppl easily buy rich ppl wear watches like richard mille jiomart shit obv loss bigger mine ordered keypad phone jiomart screen cracked put return progress days days filing return contacted coustomer care told usually takes around days days still stuck contact coustomer care say hasten action taken india hi ek scam hai buy offline afford k watch spend take mins write everything happened add photos receipts images products received give details company consumer help people rest sit back relax get money back know people might say going work situation broadband provider took money didnt install connection waited another week filed complaint regional head called apologised take complaint back another one online storei bought printer growing startup fucked didnt receive anything days taken route money got credited hours take couple days dont panic consumer help people call explain everything detail kick asses day let us know goes cheers mate nah lol care consumer court got ta persistent fam full lawyers scare shit outta ever something like happens take action tbh happened k jacket since months reply give us days contacting waste time wont anything better something else true appario sell trash people back covid ordered ptron wired earphones return window closed one earphone oneside speaker problem used earphone wasnt working first working fine throw scrap yup live dubai amazon good reputation apple products dubai remove p vendors apples sales channel collaborated retail online companies amazon official online distributer sources products directly apple rest online channels rely p vendors international vendors get apple products long story short always buy apple products amazon want buy online national consumer helpline take screenshots everything put complaint thats got refund nykaa bose ikea got wait wutangoriginal mate assure file case query solved within next days nothing modi seems live rentfree head happens poor countries oppressed history lot scammers operating europe exussr countries stalin kruschev dont see anything wrong fault get scammed life shit everyone thats mentality india nigeria etc sad take generations change countries like poland czechia got rich fairly quick issues hasnt helped simply replied seller reply communication closed yes thanks reminding almost filled form left midway little backstory concern looking prescription veterinary diet dog sick found site selling tried everything desperation ordered items worth herehttpswwwthepetcarein delayed order days order came empty box like usual scams complained week nch later way filling voxya dog passed away dropped everything let incident mind didnt matter anymore still full revenge specifically told dogs life depended without mercy still went ahead scammed could refunded said sorry cant help humanity tracked guy founder linkedin facebook tagged put notices pet parents went extent comment abuse posts many things happened dogs death put end anger felt didnt energy use guy anymore seen guy part several startup incubation programs endorsed remember reached let know harboring criminals umbrella indian grocery mart would like add seller might ask documentation helps start mail thread use chatgpt summarize ask asking chatgpt act lawyer writing put gone get good start mail would complaint number make sure quote make sure get complaint number afterwards simply keep consistently mail thread days comes complaint open get escalated inside system internal team would care complaint number unresolved weekoverweek would create internal pressure internal team consider people process weapon done zomato fab hotels took time got resolved monetary value involved case higher start online fir consumer court complaint ask back reddit om choose start one using online mode conversations start twitter thread keep adding thread conversation tagging appropriate folks changing adding different variety folks consumer court media houses random celebrity keep whole thread visibility patience trouble dont want company also doesnt want parallely start complaint credit card folks would help get added pressure pay card bill start complaint dont get tagged someone hasnt paid bill someone trying get help start different reddit question get help start let time work thats patience surprised time keep track mail visibility world via twitter thread would help good luck patience lmaoo linkedin need lawyer sellers registered address fake didnt respond calls mails still active scams happens people order stuff return duplicate items items go back inventory unsuspecting buyers get fakes chatgpt could savior drafting put x tag mukesh ambanis x account work immediately hope get money back op record video unboxing costly product next time thats first mistake apple almost never gives discount discount normal reason scammer simple use chatgpt draft see curious watches expensive fragile extend wouldnt able extensive outdoor activity peacefully thinking ill damage somehow either way would preferred garmin watch day far accurate built tough conditions considering money spent yeah end comes personal preference especially eco system hope get issue sorted idk youre downvote real talk also faced bad situation ltonlinecom skeptical filing complaint surprisingly one executives contacted within two days collected details within one week seller directly contacted send keys software purchased voice frightened begging taking back complaint dont worry bro please file complaint link get issue resolved already sent days ago lets see happen ambani ka number dhund cause people stupid enough believe get grade quality products deep discounts think insane amount packaging transportation behind e commerce good environment understand value building relations nearby physical store always take video opening package use small tripod ask someone record video evidence types scenarios never know end receiving stone box complaint genuine someone packaging facility may switched product intentionally convincing customer service without evidence difficult catch crook may working many cases like products switched stone box online retailers reported jio ready solve issue need approach consumer court grievance redressal law order much people obey laws damn cant believe jio mart could ever k bruh thats lott take legal action believe much easier affordable think send legal notice company lawyer many online portals send legal notice behalf quite affordable charge less rs good chances get attention probably resolution sending legal notice dont get resolution sending notice next step approach consumer court file case step lengthy may take upto years get relief please note consumer cases settled court companies try save reputation chances better consumers disclaimer associated legal platform engaged resolving consumer complaints mistake buying k watch fuck op thinking lol try filing complain consumer court good job recently bought macbook air apple directly could gone amazon taking risks l product k get free airpods part student discount case wasnt going amazon cost make unboxing video except electronic item damage internal video completely useless case see pretty good google rankingserp popular dog feed products featured non sponsored google shopping tab since getting ranked high likely people soon position need stopped escalated case edaakhilnicin biggest bastards ecommerce space reliance lawyer plenty experience consumer protection matters two things find contact details grievance officer jio mart send legal notice law consumer protection act ecommerce roles required one required respond within hours dont worry getting lawyer draft notice need clearly articulate problem steps gone far include dates interactions customer support attach images invoice etc anything make argument stronger end notice lines effect clearly deficiency service unfair trade practice consumer protection act jiomart failed due diligence seller mandatory information technology act ecommerce rules want full refund formal apology jiomart date time jiomart fails file complaint consumer court central consumer protection authority make sure include words legal notice deficiency service unfair trade practice subject line body email several places chance theyll refund money days another file online complaint national consumer helpline also toll free telephone number whatsapp interface theres third thing write consumer affairs dept directly find email ids whos page department website people want contact js charge ecommerce youre reading th nov would mr anupam mishra ms nidhi khare respectively one low success rate strategy though likely get results two measures recommended good luck dont let bastards grind tag reliance shareholders tim apple k apple watch still crazy meet criteria raising chargeback dispute payment provider go chrome reliance digital city show amazon price quote less price thats somehow rule sue living hell lol might get could bargain go national consumer helpline immediately extremely efficient helpful best part completely digital attach proper proofs receipts invoices relevant images file complaint go step also inform companny customer care thhat taking step sometimes mentioning streamlines resolution couldnt get proper resolution go ahead national consumer helpline problem resolved asap also fuck jios ecommerce division problem ajio delivery guy stole packages respond calls picked call first claimed rajasthan sttopped picking calls complained customare care section met horrendous display absolute lack empathy finally threatened national consumer helpine prompted give us date supposed refund us failed comply deadline went national cocnnsumer helpline refund couldnt quicker ajio account banned doesnt matter tho wouldnt shop isse acha flipkart ya amazon se leta open box delivery hai usme nope reliance digital seller jiomart website company sell shit reliance digital actually good great service everything jiomart shit never know youre buying tweet post link post retweet etc price manufacturer website people try third party sites especially big ticket purchases something never understood online shopping come even open box without record please file complaint registering ministry consumer affairs govt indias dedicated consumer online platform link telephonically helpline try filing chargeback raise ticket nch like amazon dont give write mouthshut similar sites company respond feel like quality control checks arent done returned items unless scam good passes visual checks didnt pursue edaakhil felt would end like nch resolution thats dont buy k products online stores also fact third party seller also sells sku also fulfilled stocked amazon warehouse third party sellers fake stuff get mixed appario stuff bs dont listen advice buy official site store grok fucking sue goddamn bruh thats horrible hope recovering well difficult dont put mental health dependent outcome fight fight industry time essence providing abysmal service criminal make life hell buying k watch might got scammed life melbon yes expensive item film real unboxing case watertight start packaging film everything buy lot electronic items big scammed tb hdd flipkart got money back filmed also contacted flipkart team twitter dm helpful provide solution satisfactory answer within hrs raising request late file complaint op doesnt kinda deserve would suggest op aware enough film complete unboxing experience clearly showing untampered outer packaging proceeding upload video social media word jios absolutely reprehensible mention road store directly dont delete video might want caution friends family thanks posting thats really encouraging im bookmarking dont waste another second contacting jio mart help week solution go district consumer court lodge case refund full amount give desired apple watch free lol buys jio mart luxury product fiduciary duty like true platform even allowed conduct business consumer protection order allowed business hey national consumer helpline upload grievience iam wondering apple watch cost almost k first place u paid credit card inform u scammed put chargeback request yes file complain consumer court yes thats ofcourse would give trouble money doesnt matter sometime tried best shame found college giet gunpur odisha reached one batchmates told wanted hurt social circle couldnt reach much personal revenge shitty human pet parent already losing dog goldie destined die previous owner left untreated liver infection street terminally ill getting time genuinely happy dog despite hardships still hearts dog happily hopped way across rainbow bridge didnt buy croma reliance digital apple store bro rlegaladviceindia might help get cyber insurance guys jio providing good telecom services doesnt automatically make trustable fields think needed scammed make dirty wake baberindiagaming new flipkart dropped jio trusted speak bro buy retail spending k unless reputed source choose amazon least flipkart much better standards online shopping reliance better offline shopping uv scammed employees croma chale jata buy krne yeah theres lot stuff sold reliance retail also lot shit although seller ratings shown product ratings tbh one always better looking seller name buying true ive return clothes initiating return absolutely update around two weeks called customer service told underway still update didnt actively pursue return didnt major issue products several days got message delhivery return pickup took several days pickup actually happen blame delhivery typical took arround ten days updates whatsoever got notification refund however recently bad experience jiomart return thing return initiated update delhivery message pickup however time checked app marked return rejected called customer care around three four times wrote customer service head around thrice well assured pickup rescheduled would take place surprise ticket closed without update resolution contacted multiple times recieved positive replies told last email theyd crossed maximum attempts ticket would process return despite completely technical faults pissed couldnt really much whole fiasco took around month really hope thats goes op already history similar refunds likely suspected scammer online stores get bunch daily saw news guy refunded l worth products amazon x customer support agents help doesnt jiomart open box delivery stuff nope least experience courier via delhivery rs k depending case find someone file consumer court case havent able correctly bro cost sending legal notices get back bought product incompetencyfraud people working platform go much hassle pain time get money back doesnt seem fair tf buys k watch jio mart bruv consumer complaint send even buys jio mart yes scammers taking real risk bro gone planned would apple watch basically scamming someone beat customer service shit ordered packs cheese wo saale deke gye aur fir customer support walle phone utha ke raazi ni ho would busy fromjiomartwhy amazon well india youre getting money back need hmm keep calling costumer care pressuring ask supervisor always talk supervisor something similar used call least twice day week accepted return refunded best thing expensive purchases using credit card payment filing dispute case fakes successfully done flipkart selling fake camera lens flipkart sells motorcycles wtf dude put linkedin tag ceo manager whoever involved post invoice thats sad bro hard lesson shoot video taking delivery unboxing always would received refund theres much seller delivery partner scammed days back ive ordered jio phone prima g phone skeptical whether itll real one yes purchased xpulse flipkart picked bike next day allocated dealer partnership hero motocorp one reason ditched plan himalayan getting k discount ex showroom first mail threatening file case consumer court also post thing twitter give info youtubers insta listen also doesnt work go consumer court punish scammers deserved buying apple product jiomart instead apples website dispute credit card charge wasted k watch win chargeback like said havent heard anything yet bank sent message month initiated saying investigation take days something already months since return rejected processes slow easy flipkart others scam get away bombard linkedin instagram consumer court free takes time also live one cities office like bengaluru please visit office would created ruckus k ke saath saath apne haath ki ghadi bhi dete ye log also spend k dont cheapo hundred extra discount bro dont trust online platform high value purchases always go authorised physical stores even costs twitter social media platforms never buy anything jiomart noted bro jio mart like buying k device jio mart thinking wouldnt amazon even either get apple official website offline stores know aint gon na help someone seeing comment yall keep mind people forget time time india never safe online shopping uplifted amazon customer centric policies people started trusting online shopping even flipkart able time still remember years back wanted order ram online father used say safe ordering online take caution ordering site amazon amazon best customer services even flipkart resolve issues avoid big purchases product available amazon take twitter find jiomart start commenting every post complaint tag jiomart seen brands would respond twitter rather conventional channels op state might get contact highest authority via linkedin worked jiomart punjab im former employee reliance difference worship sadhna information read book gyan ganga order free book name district state pin code mobile number location fees less represent case dude life fair would rather spend rs save investment product waste completely product defectiveuseless moreover take legal action chances get connected someone company higher level offer discount gifts make happy though platform rediscuss matter customer support team anything else fail get reply help ultimately ask take legal action whole point wasting efforts time hey ive used times resolved times used company proof incase goto court thats great go court even emails company chat support tickets valid proof still waste time collecting proofs already clear case deficiency service unfair trade practice ive always seen things get resolved raise complaint nch didnt go court need goto court theres chance fixing due respect advocating going court simply suggesting taking legal action sending legal notice lawyer thats prestep approaching consumer court online purchases carefull even suppliers scammed customers courier partners online portals nothing happened meesho also cost money doesnt approach lawyer post resolution like lakh dockets raised systems think fair enough use need approach lawyer check image check websites jio mart reliance digital reliance retail find greviance email websites think mail directly ceo aur head customer support file case documents consumer court also post message twitter explaining problem tagging directly ceo jiomart thats problem solved get problem solved dont delay first step post message twitter ceo top officials jiomartyour k small amount post twitter whole india look refund fastthis work unlucky doesnt work go consumer court know little painful losing k painfulif go consumer court definitely get refund replacement also monetary compensation mental struggle undergone period fee taken directly proportional extent strong words used notice along legal knowledge lawyer guys draft rupees legal intern file charge back credit card company file complaint httpsconsumerhelplinegovinhttpsconsumerhelplinegovin upload screenshots email communication take screenshot complaint email e commerce company got refund unacadmy trust tougher jiomart pursuing edaakhil wouldnt hurt never gone route maybe someone shed light online shopping amazon dont buy anything online shopping app amazon yes like amazon amazon safe sellers like appario dont buy expensive stuff amazon unless sold appario expensive electronics would trust vijay sales reliance digital way online store complain national consumer helpline online solve within hours file fir complaint towards mukesh ambani different products given escalate matter consumer court head towards supreme court emailing directly watch quick question consumer court charge money filed one amazonlong story amount filed less k got whatsapp lawyer working consumer court hes asking inr legit profile whatsapp seems legit grok asks premium account x telangana raise complaint jiomart follow steps customer support start contacting jiomarts customer support team usually first point contact resolving issues complaints reach various channels phone email live chat check jiomarts website order confirmation contact details clearly explain issue communicating complaint jiomarts customer support make sure provide clear detailed explanation problem facing include relevant information order number date purchase supporting evidence like receipts screenshots maintain documentation keep record communication jiomart including dates times names customer support representatives interact documentation useful need escalate complaint later escalate complaint dont receive satisfactory response customer support team issue remains unresolved escalate complaint higher level within jiomarts hierarchy ask speak supervisor manager may authority address concern contact consumer forums complaint still resolved consider filing complaint relevant consumer forums regulatory authorities country organizations responsible protecting consumer rights intervene behalf seek legal advice certain situations particularly suffered significant financial loss harm due jiomarts actions may want consult lawyer specializes consumer law guide legal options available help navigate process remember remain calm composed throughout complaint resolution process clearly articulating issue maintaining record communication significantly improve chances getting satisfactory resolution case complete cancellation order delivery fee refunded along product amount paid case return already delivered product delivery fee refunded product amount refunded cases return request initiated post receipt products amount shall refunded mode payment case prepaid via credit store credit account case cod used subsequent purchases case complete cancellation order delivery fee refunded along product amount paid case return already delivered product delivery fee refunded product amount refunded unsatisfied purchase reliance jiomart wish request refund contact customer service team website mobile app provide details order reason refund request assist processing refund applicable talk jiomart executive helpline try following steps dial jiomart mobile phone customer care helpline number jiomart india listen automated voice prompts carefully menu options may changed follow instructions provided cases may need press specific number stay line without selecting option connect customer care executive listen available options carefully find one allows speak representative prepared wait hold may queue callers ahead customer care lines sometimes busy patience necessary connected customer care executive clearly explain reason call provide necessary details account information may ask help understand query concern better provide appropriate assistance unable reach executive helpline process changed recommend visiting jiomarts official website contacting customer support official channels inquire best way speak executive order get first mistake buying apple watch ultra jiomart received wrong product received watch melbon astra immediately worried went customer service via chat previously refunds go product damaged oats thought return get replacementrefund fastforward week later customer service agents contacted emails customer support customer support head even consumer complaintgrievance still nothing kept return request hold first said days week dont know else someone help invoice original purchase dont know one anything every chat agent keep saying give us time give us time much wanthshd raise complaint jiomart follow steps contact jiomart support first step reach jiomart customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced jiomart order service provide specific information went wrong affected experience details provide better help jiomart understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help jiomart investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following swiggy reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching jiomart official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process jiomart customer support team assist clearly communicating complaint increase chances satisfactory resolutioncgctch file complaint jiomart follow steps contact jiomart customer support first step reach jiomarts customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced jiomart order service provide specific information went wrong affected experience details provide better help jiomart understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help jiomart investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following jiomart reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching jiomart official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout processcustomer support team assist clearly communicating complaint increase chances satisfactory resolution acgxghc raise complaint jiomart follow steps contact jiomart support first step reach jiomart customer support team app website look help contact us section usually includes options chat support representative submit complaint provide relevant details contacting customer support provide necessary details related complaint may include order number date time incident restaurant involved clear description issue faced specific clear clearly explain problem experienced jiomart order service provide specific information went wrong affected experience details provide better help jiomart understand address complaint attach evidence evidence supporting complaint order screenshots photos receipts make sure attach submitting complaint strengthen case help jiomart investigate issue effectively request resolution clearly state expect resolution complaint could refund coupon form compensation deem appropriate follow dont receive satisfactory response within reasonable timeframe consider following reach customer support try escalate issue social media channels utilize social media complaint remains unresolved consider reaching jiomart official social media accounts twitter facebook publicly share complaint companies often pay attention public complaints may respond promptly protect reputation remember remain polite provide accurate information throughout process jiomart customer support team assist clearly communicating complaint increase chances satisfactory resolutioncgctch paid via visa mastercard raise charge back claiming wrong product delivered bastard ambani family became rich looting customers one main reason indians lost trust indian companies u get money back",
    "light_cleaned_title": "JioMart has scammed me for 87k and is not refunding it.",
    "light_cleaned_selftext": "First mistake I did was buying an Apple Watch Ultra from JioMart. I received a wrong product, I received this Watch 8 Melbon Astra. Immediately I was worried and I went to customer service via chat and previously I had refunds go through when the product was damaged such as oats so I thought I will just return this and get replacement/refund. Fast-Forward 1 week later, Over 25 customer service agents contacted 10+ emails to customer support, customer support head, Even A consumer complaint/grievance, And still nothing. They have kept the return request on hold. First they said 3 days, then 4, now it’s a week. I don’t know what else to do. Someone help me. What do I do. I have the invoice for the original purchase, I don’t know what to do. No one is doing anything, every chat agent keep saying give us more time give us more time. How much more do they want?",
    "light_cleaned_comments": "Consumer court > First mistake I did was buying an Apple Watch Ultra from JioMart. The mistake is not buying from Apple store/ website. Not telling this too OP but people should generally buy AirPods and Apple Watch from the official store. Unboxing video? if no.. Then you are screwed.. Also why not buy from reliance digital/Apple why JioMart? Why I bought from Amazon and flipkart the import date was a bit old but apart from that the device had no issues and warranty from Apple.. Apple stores has no/low discounts so I don't want to buy from there... Do you have unboxing video? There's always two sides of a coin. I guess you don't have any proof either other than playing victim card. Is there any barcode/ jio mart label on that box? I understand your situation bt jio Mart se Apple watch q buy Kiya ??? Official Apple site se lete If you can't afford to buy a apple product from a apple store, you are not ready for the apple life. If you have ordered through credit card, please file a chargeback/raise dispute with your bank. Who tf order's apple watch ultra from a grocery mart/s I never understand, why people buy expensive stuff online? Huh! trying to save 1000 ₹ for a 1 lakh phone aint worth man post on twitter and try to get as much attention as possible they won't listen otherwise I still don't understand why people don't buy this costly stuff from walk-in stores, like now Reliance Digital would be definitely available in any of the Tier 1-2-3 cities nowadays Who buys from JioMart ? It’s a MotaBhai product pushed by Gobhi. The only products I can tolerate by Jio are Jio Sim and Jio Fiber. Tag their head honchos in LinkedIn and Twitter. Worked for me when I had ordered a JIO VR srt before IPL and it did not get delivered even after IPL was over. They may be giving more discount Couple of things: 1. Always buy expensive stuff from physical stores by going in person, not online. People would scam god if they could get away with it 2. Always record unboxing for electronics and expensive items. My friend once bought a phone and unboxed it right at store after paying. We were recording it and the box inside looked a bit weird, as if it was repacked. The phone had a slight scratch on the side, barely visible but we got it on recording. In the same recording, we also got the store and the sales person. They first denied responsibility, asked us to go to service center but then when we said we will put this video online tagging Samsung(the brand) and mentioning store name, they quickly cancelled the purchase, gave my friend another unit and gave him a discount for another unit he bought then. How does this work my good sir? Could you explain? And does it hit your CIBIL.? Anything named jio by reliance is just fraud, i can trust on fraudkart once but not jio Who tf buys this expensive shit from jio mart Why not prefer an apple store or Amazon?????? It’s like 5k with the Amazon card what was benefit over apple store, amazon or offline ? It costs the same 🙄 i have zero problem with amazon, but with scamcar,scammart,snapdeal,meesho blah blah even if its 10k discount dont go for it Absolutely Arey kya sab ek h gyaan de rhe ho k why bought from jiomart. Ab toh usne khareed liya, kuch nhi ho skta uska.. Aage kya krna h wo batao Lol what? It costs the same and maybe there are some discounts on jiomart. You never? It's convenient that's why. It's basically a he said she said now. You can only hope that they do some internal investigation and find the culprit. Imagine someone ordering that Mariegold watch and he receives an Apple watch. It's not even sarcastic as it is the truth. But I hope OP gets refund we all make mistakes to save an extra buck. 😂😂😂 I've bought some expensive stuff only but it's from a good site. Not jiomart. Idk about CIBIL but the bank will instantly redact the transaction cause it's THEIR money that you've used to purchased, not yours. For real. Like you are buying 90k watch and lazy af to not buy it from store..? Or apple official website..? Come on dude. I hate to say this but you kinda deserve this unless you have valid reason like….none. There is no valid reason. You could have gone with apple.com. Easy peasy. Toh reliable jagah se order Karo na, at this point I don't get people who would order products worth more than they can afford to lose from anywhere other than Amazon. And even then only from the reliable sellers on Amazon. 🤦🏻‍♂️ “MELBON” Exactly. Dude paid the exact price on the apple.in too There's Amazon and then there's anything else. Still not worth it I’m sorry to say, but most folks don’t trust JioMart with their onions and tomatoes. And here you are, buying a 87k watch - which is actually the same price on the official Apple India site - from them. It’s going to be hard for you to prove. They will likely say you replaced it etc. that’s the reason why seasoned e-commerce players like Flipkart now have open box delivery. May I ask why you went for the Ultra? Other than the fact that you’re probably rich, just to get some perspective here. It’s 89k on Apple. Looks like OP paid 87k on jio. Crazy risk for little discount I'd rather pay some extra than trust any online seller, especially Jio for this kind of stuff Either Amazon or offline. Yes, atleast a genuine site. It does not. It will be like punishing the victim. Source: I used to work for their parent company Jiomart and reliance digital, they all belong to the same shit right? Yeah, the materialistic life. What is the recourse if someone pulls this stunt in a dept store after buying a tv/fridge I always get flabbergasted seeing people getting scammed in the weirdest way possible. How can you trust a 0% appealing shop page and risking all the 87k for just a 2k discount I wont go as far as saying he deserved it bro Wow. The price is so much more than the price in the US. Are all Apple products this expensive in India? Doesn’t make sense. happy diwali I also don’t wanna but ask yourself am i wrong to say that..? And be honest with yourself. Always buy Apple products from their offline authorised resellers. (Not even online) It cost you more I agree but it saves you a lot of hassles like this. JioCinema Did you buy through credit card? Initiate a chargeback if that's the case. Do it through the bank website, if you contact bank support, they themselves will keep stalling and defending the seller. Also, why did you purchase through Jiomart when you can buy it directly from Apple for the exact same price? That was a shitshow + they didn’t even have return policy. I faced the same issue. Yeah, when it's the exact same price that too. Although I checked Jiomart and it seems Reliance Retail is officially selling it..........so yeah. Bhai isme Gobhi (Modi?) Kaha se aa gaya? There's an investigation..........the store's bank will investigate, then your bank will investigate (and ask details), and then if either party is dissatisfied, then VISA/Mastercard will investigate. I guess they contact you at some point. I initiated a chargeback for Flipkart giving me a defective Pixel 6a, haven't heard crap about it so far. You can post the entire incident on twitter with pictures, and then tag the official JioMart handle. Gives the customer service more incentive to help you faster It's not like a veto. If you have enough proof and such the bank reverts the transaction along with a penalty on the seller. But at the same time the seller's given a short period of time to refute it as well. So it usually goes like that. Yes? Can't trust anything in this country, law and order has completely gone to crap. Everything's going to get worse unless we kick out these Sanghis from power. More like the naive life. Apple fans blindly pay large sums of money for questionable quality.........to be fair, plenty of other \"premium\" products are exorbitantly priced. If you paid via credit card, raise a chargeback request Always remember apple price is almost almost same as everywhere so just don’t get trapped . I knw it very well coz I am dealing with apple Flipkart also does the same scams. They didn't offer open box delivery in my case either. Or Apple directly........they sell for the exact same price. High import taxes, sales taxes. Must send more money to BJP's Swiss bank account, damnit! What about the new made in India iPhones are they priced sensibly? JIO customer service is their to serve the interests of the company. They are not there to serve the customer. Thank you for your generous contribution towards Nita Ambani's diwali gift, that Rolls Royce car. /s File a case in consumer court. No one else can help you Don’t go for it ESPECIALLY if it has a 10k discount. It’s a definite scam then Post it on X (formerly twitter) and share the link here. The community will retweet it. That's why I never open these websites even for dal,channa 😂 Sorry I just wanted to repeat again what a thousand people have repeated again and again as nobody reads anyone's comments and we all just feed our own egos by correcting you. So once again... YOU ARE INCORRECT AND I AM CORRECT AND YOU AND EVERYONE HERE NOW KNOWS I AM SMART!!! I doubt it. They'll still be overpriced. We are only meant to shut up and be cheap labour to make devices for others who get amazing discounts (just see US discounts sometimes) while we get crazy exorbitant prices and lowest wages. Try raising this on Twitter.. I would have never personal spend such a big purchase on jio Mart doesn't look reliable to me. Lots of comments on this post saying he/she deserved it , should have bought it from the official Apple store. People seem to be missing the point that it is the fiduciary duty of the online platforms to sell genuine and defect free products. In my opinion, OP was right to buy it from Jio Mart even if it was to save 500 bucks. I would suggest be patient and try posting about it on Twitter/ LinkedIn, post the link here so we all can help you gain traction and if nothing works, take these bastards to court. At what point did you think \"yeah lemme order one lakh worth of order from internet\" and not realize \"Who's gonna help me if things go south\" One thing I learnt the hard way was to not buy expensive electronics online. You may get 4-5k discount but that ain't worth the hassle if you get delivered the wrong product or damaged product. Especially these days you hear a lot of scams happening from the delivery of products being outsourced by these companies. You want a discount? Try visiting stores like croma or Vijay sales during festive period and ask them for offers. I had ordered my phone off Amazon. I got a wrong phone first time around. Then they replaced the phone, the box was already opened, the device I received had a dent and did not match the imei number on box. All this process took me almost a month to resolve. I had given away my old phone at the time of delivery. This led to me being without a phone for almost an entire month. Amazon is less risky but not risk free… I have seen people ordering genuine things & then place a return request and hand out fake replacement of the genuine item to the collection guy. I make it a point to not buy things which have major value coming from its brand name from online sites. Generally the authorised resellers also have some discounts with cards so theres that. I bought my ipad air 5 with a 5k discount from ivenus with hdfc credit card. Sure the online sites would offer cheaper deals but I prefer to buy my precious things from shops only. Gareeb Ameer Bhai jiomart wale rations to sahi se de nhi patey. I ordered many times from them and they always misses some item in grocery while delivering. Agreed, I was talking about his “Apple life” cmt The title should be \"I scammed myself by ordering a 90k product from Jiomart\", I wouldn't trust Jiomart for even a 500rs order & you out here blowing 90k without a second thought 🤦‍♂️. Chargeback this is why I bought my over 1L laptop from Asus website directly. I could risk to save few money from amazon/flipkart, but still will be taking my chances. Better buy from the product site directly and be safe with all the warranty and stuff. twitter pe tag karke dekho Put it on Twitter and approach consumer court. No, Amazon is far superior in this regard. We just need to be sensible enough to record the unboxing. I have had bought laptops, phones and accessories from them with zero issues. Avoid flipkart/jiomart/croma online at all cost In general avoid buying online. Period. Yes. This. Slightly off-topic but I recently did this with Fireboltt company. Firstly they refused to refund and neither did they have the same model of the smart watch. So they sent me a different model. After a lot of back and forth, they didn't agree to refund my money. So I sent them a legal notice through my lawyer and suddenly they agreed to a refund. So maybe, you don't have to go all the way through, just send them a legal notice and talk to them via email or call that you have sent them a legal notice and they will have to respond soon to that. Jiomart takes usually a month to sort any refunds, hold tight , and you will explain your case 10 times before some progress but you will get the refund, I think and I hope Amazon is the only source you can trust for getting stuffs online. Period. If I am you, I will file F I R for cheating, fraud, breach of trust. I know pandu may not cooperate by claiming it as civil dispute. Then I will file complaint to local magistrate. It is difficult to prove that you actually have received wrong item but criminal case that too against directors of JIO (read: bambanis) will compel JIO & they will offer refund immediately. I have done this against flopkart & had impleaded pansal & co Consumer court is the best option. I had a damaged macbook charging magsafe port and apple was not accepting it, so I filed a case and apple agreed to an out of court settlement. They gave me a new sealed piece in return for my old one, the whole saga took like a week, so ya go to court ASAP and make sure you take print outs of all mail communications you have made Next time if you get this urge to shop online. Book it on Croma and visit the store for delivery. Much better experience. Hey contact getmyrefund from twitter. They might help you in this case. Lawyer up In that cause I hope you flat out refused to take delivery I've had bad issue with Amazon as well. Sending something meaningless for some other part. Or delaying a product for over weeks. Telling it from experience. You might have got lucky to not experience. It is less than Flipkart and jiomart but it is still there. Lodge a consumer court complaint, mark their CEO on every twitter interaction, be it daily 15-20 threads. Find out their management, CEO email ids, write a proper worded email with your entire concern, including orderid and names of people who have talked to you over call, twitter or in person. Followup, 10 twitter replies, 10 emails per day. Ask them for a callback. Thousands of Indians lodge complaints daily, you need to go berserk to get eyes on you. Same happened with me on flipkart with an apple watch, got every single rupee back without any court case and without any proof. parchun ki dukaan se apple watch kaun leta hai bhai. It’s a myth that if you buy from the brand website you’ll get impeccable RMA experience. While if you buy from Amazon you’ll get company warranty as well as your product is basically amazons responsibility within the warranty period. I tried RMA for a game controller but couldn’t get through to the company through telephone and email, instead i called amazon and they arranged for return and gave me a full refund that too 3 months after purchase Dont buy expensive electronics from Jiomart, infact avoid buying any electronic items from Jiomart if you can. Speaking from experience....I bought Logitech webcam from them. When the package arrived, the box was old and crumpled. It was evident the box was lying around for a couple of years crushed under other items. The webcam flat out did not detect for the first few times. Then after a few tries, it finally started working. It was clear that it was either a very old product or had been returned by someone. Maybe discounts? Thats how people still buy from flopkart and then get scammed after all. If discounts were the reason, then it would be really bad financial planning to risk entire money spent for some measly 10% discounts. For high cost purchases, I spend days to confirm if sellers are trustable and then buy, even then I record the whole delivery to unboxing. wtf is this logic ? You guys are buying from JioMart? WTF Amazon is also fine. Make sure seller is RK World Infocom or Appario. Yo bro, try contacting national consumer helpline, if nothing works they do a good job of getting things done, once MakeMyTrip didn't refunded my flight cancellation for 1 month, i contacted them and i got it in 2 days, try 8t out :) Amazon has a lot of scammer issues too, just not to the extent of the rest. If you search for Samsung flagship phones, tablets, watches on Amazon for example, it's filled with imported or used pieces sold as new. But amazon has superior support than the rest; especially if account is trustworthy. 1800114000 Go here. File complaint. Add necessary details. Btw choose company right or if you are unsure, call the number and let the agent handle the write up. How much does it cost to send a legal notice? Never sent any but ny past 2 consumer complaints failed, amounting to 5500 and 8700. Never bothered about legal notices because I assumed they would be costly. It would be good to know an estimate atleast. I bought my motorcycle worth 1.45 ex showroom from Flipkart 🙂 This works really well to me multiple times. Indeed just a threat of taking the issue to court via an email would do wonders If you wanna buy any premium from online, try Tata Cliq Issue is outside of top brands, many of the direct stores can employ bad logistics and the logistic guys can pull some scam. Still unboxing video should help out but you never know. Always look for savings. That’s a must. First file a police complaint. Not the court. The cops will do their job of collecting all the evidence. I might be wrong, Jiomart isn't a retailer but an aggregator. So some sellers could go scamming. Reliance Digital is a proper retailer for diffferent brands. OP - The likelihood that this will get resolved is slim. But you have learnt a very important lesson and that my friend goes way beyond that the money you have lost here. Everyone does stupid things, it’s part of life. I don’t know your financial situation, and if this loss will impact you or not, but I do know the person who cheated you will pay one day. Maybe more dearly than this. Karma sucks. Definitely give your 100% to get your money my friend, other than that, know that we have all been there in one form or the other. And, we have learnt from our mistakes. Why the hell would you buy for that much from jio Mart? I appreciate you writing that your mistake was buying from Jiomart. I hope you win this and get reimbursement. Some upgraded debit cards have chargeback too. Yes pls purchase att electronics from electronic shop nearby you.if you get any issues it's easy to resolve them. Jio is an official retailer for Apple. So OP was not wrong here The mistake is doing any kind of expensive business with this group of companies Why waste so much money on stupid watch? You definitely won a lottery did you record a video before unboxing it? Yep, Jiomart is likely an aggregator. Reliance Digital is actually great. Their customer service is solid and they for big items, they really come down on price to get you to buy. Did u record the unboxing of the product ?? No bro, It’s not OP’s fault. Jio is trusted. It’s JioMart and the product title and image is of an Apple Watch. Though thanks to OP we know now that even JioMart sucks Appario is the most unreliable seller on the platform, once I ordered AirPods for myself but instead got some random fakes. Had to take the entire thing to consumer court in order to get a refund This is why I alea pay cash upon delivery Where these companies win is most of us individuals don't wanna go with so much of work and brain teasing. I recently got scammed on one of these and didn't wanted to go through all of that procedure. Best way is to not order expensive things online How much it costed you to send legal notice Dekh, Ambani ki company ke barey me shikayat dekh kar AutoModerator ki bhi fat gayi! People think Unboxing video is only on YT channels No it's a basic requirement now Jiomart is an official reseller, so it's not really his fault. I think you're missing the point here. Of course online platforms *should* sell authentic and defect free products, but the fact is that not all do, and it's our duty as consumers (who have limited resources and time) to choose the ones that are reliable. Saying this is not saying that JioMart is free of culpability, but rather asking OP to be more prudent in making their decisions in the future. Was it home delivered in a csrton or did you pick it from showroom? If it is the later, you dont have a point.. How do I go about doing this Jio Mart is not official retailer... Reliance Digital is official retailer of Apple. Unfortunately I’ve used debit Mostly depends on advocate, for cheap fees find small advocate but ask friends to get it. Because advocate might take big fat fees lol, this has nothing to do with who's in power. It's an integrity issue, and regardless of who's running the government shit like this will continue happening till civic sense improves. To everyone who is buying any product upwards 10K+ especially small items like phones and watches, always make a opening video. With so many bastards selling fake stuff and replacing costly products, you make yourself safe and have a hard proof Yes Does JioMart have 3rd party sellers like Amazon? Always look at seller ratings before placing an order. I do some hiking and trekking so it’s better for outdoors being completely independent from the iPhone Jio Mart got the worst customer support Good! As an American it's so nice to see one of you get scammed by your own, I sincerely hope this becomes a plague in your life, you all deserve it. Or do you think your culture should only scam Americans over the phone? Email to their CEO. Or some higher up first. Then goto consumer forum onlinr I have filed one alr it’s stuck at ‘in progress’ If you have an upgraded debit card, you should still be able to. DM me I'll send one for you for free. Thank you everyone for the advice. I’ve filed a consumer complaint 3 days back already. I’m looking into consumer court as suggested by many people. Unfortunately I didn’t take an unboxing video in excitement. Chances look slim but I hope to solve this :( lol you fucking loser For Lenovo u are mostly better off on their official site they have some very good discounts and deals Depends on your lawyer. Mine was a family friend so he did it for free. Also, it's not a complicated process from what I've seen. You can draft a notice by looking at some templates online and just have send it to them on email and also a hard copy via post. But it's a mandatory step. You can't directly file a case as far as I know. You first have to send them a notice. If they fail to respond to it in a given time frame or their response is unsatisfactory, you can go ahead with the case. Most companies will not fight back and just refund you the amount because this will only cost them more as they know they are on the wrong side here. They pull of this shit because they know people won't go to the court as it's a hassle. You will get your money back OP. Don't worry 👍🏽 If you are not able to do the above process for some reason, let me know I will help you with it. Yes. I think we somehow need to make average consumers aware of this. Don't worry your countrymen and women are still the stupidest people on earth. 🤣 Never, (n)ever buy an apple product from anywhere except Apple store, apple website, or authorised store. Everything else cannot be trusted. Ppl doesnt even trust jiomart for small electronic items and you ordered apple watch ultra 2 from that . Looks like your brain was just in sonpapdi before that. I suggest head to court as they will not replace it any how . You would have got much more discount around 4k-8k from bank offers and dealer offers from unicorn , inspire etc . Hope to see Better shopping in future JioMart has one of the worst customer care services. Will only recommend in buying small goods and basic groceries. It's not good for expensive stuff If you paid with credit card. Raise chargeback request It's kinda shitty to say OP deserved this. Jio is a big name in India, and you don't really need a reason to choose to buy from there. Be nice. Post on Twitter and tag these people. Ask everyone to retweet your post. It catches a lot of attention Credit card chargeback Flipkart is also a big name in India, you see the scams flipkart is doing right..? And that’s my opinion plus said “op kinda deserve this” i used kinda cos i know it’s not his fault that jio gave him something else but it’s his fault for not buying it from apple store cos there’s not even any discount or anything. He is buying for same price. You can file a complaint at consumer forum..it’s quite simple and you can do it yourself from the web page. I have had lenskart issue me a refund after filing in forum..if forum doesn’t work then send a legal notice and go straight to consumer court Theek hi to hain, just different box 💀 What's the issue with Croma online? I used it a few times and have had no issues till now. Thanks a lot! I will try to initiate my claims. They scammed me of 4K. Those pigs attract you with low prices. I had baught grossaries. And none got delivered. If the payment was made through Credit Card, Raise a dispute with bank and request for chargeback. Ye toh Instagram m like share comment karne m bi mil jati Have u raised the issue on Twitter?? Bhai pr jio Mart se ye kon leta hai yaar. Tamatar aur bhindi lene ke liya sahi hai bs. Been in the same boat before when I got scammed on Amazon. Fake/wrong apple watches are more common on Amazon than it seems. And customer support becomes helpless in the end. Have learnt my lesson to buy any 10k or above products from retail stores. And if it's bought online, make sure to record and open it in front of the delivery or returns guy. See, I hate it when people hold buyers accountable because of their choice rather than the big corporations who are responsible. OP doesn't 'kinda' deserve this at all. Like you send them mail or what? god. when you're talking about an amount over eighty thousand rupees, is 2k really that important 😭 this could've been avoided Yes. An email and a hard copy via post. Go straight to r/legaladviceindia I was looking to buy apple watch 8/9 online should I go for it? Last hope consumer court You can buy from reputed sellers like Appario and others which are mentioned in some comments here. Give them one final warning, of they fail to comply or refund you, then move to the consumer court with all the evidence and chat snippets, you will definitely win not only your money but also compensation for the hassle that you've been put through I also got scammed by a scam seller in amazon, think about it lol amazon!! Have been in 30+ or so agents calling forwarding and them just abruptly ending the call lol after putting me on hold mine is a small amount of 5k but still it's a lot, i think it would be better to make a legal court order for this its not small money,people even put cases for 10rs lmao Better make them pay fine too for the amount of time they wasted im sure u will get it too If you’re willing to spend over 80K on a watch, then why is 2K that big of a deal lol Consumer Guidance Society of India. You may call them, they will hear you out and provide an email address. You will have to also mention what sort of outcome you hope to achieve. Will take time but you will get compensated or a replacement + damages if you seek it. I am currently facing this issue with Flipkart and Samsung. Around 40 calls and emails . No proper resolution. I don't even live in a city so going to a service centre is like a 4 hr trip for me. Heck, that's why I placed order online in the first place. I feel it's time to switch to offline mode of shopping! Why would you buy it from fucking jiomart ?? How is JioMart trusted? It’s an aggregator not a direct retailer so you have no idea who you are “buying from JioMart” I’m not saying OP deserved to get scammed or anything- but anything expensive from any aggregator (including Amazon) should be avoided or at least unboxed on video The first mistake was buying Apple watch second was buying such an expensive thing only third mistake was not recording the unboxing of the product... NEVER buy anything from JioMart. They have the worst customer support team and also they refund the amount to their Jio Wallet without asking customer the mode of refund. The font in the first image looks like a cheap untrusted website. No wonder jiomart isn't trustworthy You know that Appario is Amazon, right? It’s been 1 hour. Chill out He was saving 2k for the strap Scamming is also contributing to Indian economy. Feeling pharaud, Jai Hind! I honestly wonder why anybody would spend 90k on a piece of plastic encased in aluminum, called a ‘smart’ watch. Irony is real here. Post every thing on twitter and tag reliance in the post i’ve seen this work with other people before maybe it could help you Go to Twitter, tag JioMart and start nagging. Do at least 3 times a days. You should be in their recent tweets always. Tag their ceo, cto management. This need more upvotes. Appario was Amazon proxy. However, Twitter/X is filled with recent posts about fake stuff being sold by Appario. So, I'd recommend caution with Appario File a consumer complaint in consumer forum and you’ll be assigned a lawyer explain your issue to your lawyer and they will send a legal notice to the company… and file for compensation also. Thank You.. same thing happened with me but with flipkart after 3 months nothing happened I filed a consumer complaint and hence i got my refund Tf bro \"deserved\" it for using a well known store that most people assume is safe? Expecting atleast original products from one of the biggest retail outlets is in no way lazy or stupid lol. Hmm, well I am a daredevil who shops from Flipkart so.... It is if you are buying this much expensive product from “jio mart”. I am not celebrating or shit because op got fucked up. I am just telling how stupid this was to order from “jiomart”, you could get the same “same” thing from apple store. And i said “kinda” comeo don’t use “tf” if you can’t read the fuckin sentence properly. The “kinda” is showing that it’s not op’s mistake that he got wrong product, he got fucked up by order one from jiomart. Flipkart not recommended. I ordered AirPods Pro type c 2 gen. It came with a lot of scratches but Flipkart denied to replace or return. Looks like someone learned a very valuable lesson hahahahaha..... if you don't have a video of unboxing forget about it...jiomart srsly bruh? Should have bought an expensive product from the official store. This is totally on you that you choose to buy such an expensive item online and that too from an online portal that has a mixed bag credibility. I think you deserve it. Bro I need help I resently send legal notice to Fampay app Ask them to share the IMEI number of the device. They should have it. Tell youll file a police complaint against the store and if they didn’t do anything then they should share the IMEI number Amazon. Only Amazon is the decent 3rd party shopping website. I’ve ordered fairly expensive gadgets running up to lacs. I’ve had exactly 1 case where I got a fake item and that was years ago. Amazon rectified the situation right away. I would never trust Flipkart or Jio. Apple has their official online store in India now Stick to that for Apple products Jiomart is an absolute scam. Once scammed me for just 400 rs , sent a different item. Their customer support is worse than bsnl and when i posted on twitter, they just simply blocked my account and stopped responding. That's like saying Mukesh is official retailer, Neeta, Aakash & Isha ar not 🤣 Just report at File a chargeback with your bank, upload all necessary documents and take screenshots of your communication with jiomart support(the more the better for proving your case). Tc I'd chargeback the shit out of them from my credit card. Consumer court has got your back you can simply file the complaint online without going out ever, I did it with Airtel and my issue was resolved. Raise complaint on consumer portal It's difficult to ignore the fact nowadays customers are also scamming they get first copy from market and buy original from online stores and they you know how they scam. Consumer court i can help You are dumb. Maybe stop paying internet bills and buy almonds or something to sharpen your brain. I see like 5+ daily posts of online scams from Amazon and flipkart, Jio Myntra are same as well. Do you have video evidence unboxing video? IDK I don't trust people online they might be faking they can be scammer themselves. If you are genuine & didn't fake this then you are a fool for not making an unboxing video some products get replaced inbetween transit by some scummy delivery agents Yes, same thing happened to me they are the scammer and do not refund the amount. The same happened with me which is why I am not surprised. Although the amount was nothing as compared to 87k . But jio Mart is known for scamming its customers. The same happened with many friends and relatives of mine. Link pls Jio Mart is just platform like Amazon , usually it's not the app but the retailer on app . They aren't sending these products directly from their warehouse . Bc latest laptops wh bhi discounted price me offline store wle rkhte nhi h…to new faadu latops discount k saath lha se lene ka? Jiomart sucks That's the issue now. Appario was the only trustable seller in Amazon and now they have started doing this scummy shit. From this ,now i m worried, i wanted to buy iphone 13(which is priced high on apple store) and an acer nitro laptop….from where should i buy ? Offline wle discounts amazon jitna dete nhi, and latest laptop bhi rkhte nhi.. Chhoti ganga bol kar naale main kudwa dia bhai ko I really don’t get why people but Apple products from stores other than Apple Stores. You should check this service out I have heard they are very efficient If you’re getting massive discounts for newer models of Apple products, it is too good to be true. I'm seeing a lot of comments saying to buy from official apple store, but you can buy from Amazon too. Amazon and Apple have a thing where only Amazon sells Apple products, third party sellers aren't allowed. Not sure how well this is implemented in practice but generally you don't get anything other than the original product when buying from Amazon. This also means that even if it's \"cheaper\" on Amazon than the official Apple stores, Apple has a say on the final price on Amazon. Flipkart has no such deal, neither does Jiomart obviously. So yeah, Apple store or Amazon, or go to the semi official offline Apple stores like unicorn or ivenus. Stores like Reliance Digital or Croma are good too. Hope you get your money back. Did you send or want to send? Atleast get it from Croma Consumer court. I'd also try and escalate it and speak to the highest levels. Also when you're speaking don't be crass, speak in a composed professional yet stern manner, this actually shifts the authority and they will tend to be more receptive. I'm positive you can get this sorted out without the court option. Usually in a high value item transaction such as this, matter won't be resolved by simply accepting returns. Because electronics are where most of the fraud happens. So it requires a lot of manual intervention and speaking with the seller as well. So it kind of depends on how the seller is responding. Once they identify where the fraud took place, origin of item or delivery, the responsible entity would be identified to give you a replacement (most likely) or a refund (last option). So no this won't be settled in a week, expect at least 2 to 3 weeks. Consumer court will not speed up the process but it will guarantee you a return provided you have not committed the fraud. And as always fucking buy from the OEM if they have the presence in India. send it to me too bro even i didn't get apple watch i got a wall clock packed in apple box pl thanx in advance Nothing can be done its Ambani 😂 Try writing to the grievance and nodal officer on mail regarding our issue and make sure the tone of the email is threatening. I think Smartwatch as a gadget is a scam because the best smartwatch is like a phone but not better than the phone available at that price point. One valid grievance registered on NCH (National Consumer Helpline) and the company will come back to its wits. Tried and tested. Person who can buy watch of 90k don’t really care about discounts. wow. right now only Amazon is good it seems These companies are not afraid of law and have no regard to law. They just rob Peter to pa Paul Middle class if he’s fond of Apple products and upper middle class can easily buy the watch. Rich ppl wear Richard Mille watches Just for an info. This is the original value of this product. . Middle class ppl who are fond of Apple products can get on installments and upper middle class ppl can easily buy it. Rich ppl wear watches like Richard Mille Jiomart is shit obv your loss is bigger than mine , i ordered a keypad phone on jiomart and the screen was cracked so i put it on return , there was not progress for days after 10 days of filing return i contacted the coustomer care and they told me that it usually takes around 15 days , and now its been 34 days and its still stuck , contact the coustomer care and they say we will hasten it up but no action taken... india hi ek scam hai Buy it offline If you can afford an 87k watch then you can spend a few more Take 10 mins and write everything that happened. Add photos of receipts and images of products received. Give the details of the company and the consumer help people do the rest. Sit back and relax. You will get your money back. I know people might say it’s not going to work. But I had a situation with a broadband provider who took my money and didn’t install the connection. I waited for another week and filed a complaint. Their regional head called and apologised to take the complaint back. Another one is with an online store(I bought a printer) from a growing startup and they fucked up. I didn’t receive anything for 25 days and I had taken the same route. Money got credited in 48 hours. It can take couple of days and don’t panic. When the consumer help people call you explain everything in detail and they will kick asses day in and out. Let us know how it goes. Cheers mate! Nah LoL they do care about consumer court but you gotta be persistent about it my fam is full of lawyers and we just scare the shit outta them when ever something like this happens and they do take action tbh Happened same with me for a 2K jacket and since 2 months same reply that give us 4-5 days and all...... Contacting them is waste of time because they won't do anything better you should do something else True Appario sell trash to people, back in COVID I ordered 2 ptron wired earphones. Just after return window closed one of the earphone had one-side speaker problem. Then I used the other Earphone and it wasn't working. At first both were working fine, Then I had to throw them in scrap. Yup. I live in dubai. Here amazon has good reputation of apple products. In dubai, to remove 3P vendors from apple’s sales channel, it has collaborated with a few retail and online companies. Amazon is the only official online distributer who sources products directly from apple. Rest other online channels rely on the other 3P vendors or international vendors to get their apple products. Long story short, always buy apple products from amazon, if you want to buy them online National consumer helpline. Take screenshots of everything and put in a complaint. That’s how I got my refund from nykaa, bose and ikea. Got to wait for @WuTangOriginal mate. I assure you that once you file a case, your query will be solved within next 4-5 days This is nothing to do with Modi who seems to live rent-free in your head. This happens in poor countries who have been oppressed in history a lot. Most scammers operating in Europe are from ex-USSR countries. It's not because of \"Stalin did this\" or \"Kruschev did that\" they just don't see anything wrong in it because \"it's his fault to get scammed, life is shit for everyone\" that's the mentality there and in India, Nigeria, etc. Sad but it will take more generations to change it. Countries like Poland and Czechia got rich fairly quick and have no issues with that. Hasnt helped me. They simply replied that the 'seller did not reply' to their communication and closed it. Yes, thanks for reminding! I had almost filled their form and left it midway. A little backstory on my concern. I was looking for some prescription veterinary diet for my dog who was sick and I found this only site selling it. I had tried everything before that. Out of desperation I ordered the items worth 8700 from here.https://www.thepetcare.in/ They delayed the order by 22 days and when the order came, it was an empty box, like their usual scams. I complained that very week on NCH. Later when I was on my way on filling this on voxya, my dog passed away. I dropped everything then and I was just let this incident out of mind. It didn't matter anymore. I am still full of revenge, because I had specifically told them that, \"my dogs life depended on them\" and without any mercy they still went ahead and scammed me. The could have refunded and said sorry we can't help you if they had any humanity in them. I tracked this guy, who is the founder, on linkedin, facebook and tagged him and put out some notices for other pet parents. He went to the extent to comment and abuse me on my posts. So many things happened, but my dogs death put an end to the anger and I felt I didn't have the energy to use on this guy anymore. But from what I had seen, this guy was part of several startup incubation programs and he was being endorsed by them. I remember having reached out to them to let them know that they are harboring criminals under their umbrella. Indian grocery mart, i would like to add. Who is the seller, might I ask? It was this Documentation helps. Start a mail thread. Use chatgpt to summarize you ask ( while asking chatgpt to act as lawyer writing this and put all you have gone through there, you will get good start to your mail) You would have complaint number. Make sure you quote that. If not, make sure you get a complaint number. Afterwards, it's simply about keep at it consistently in the same mail thread. The days comes when that complaint being open itself get escalated inside the system. Internal team would not care about you, but a complaint number which is being unresolved week-over-week would create Internal pressure in their internal team. Consider not people, but process as your weapon. I have done this with zomato, fab hotels. It took time, but got them resolved. Monetary value involved in your case is higher. So after a while you can start online FIR and consumer court complaint ( ask here back on reddit om which to choose and how to start one by just using online mode for these conversations ). Start a Twitter thread for the same. And just keep on adding on your same thread after each conversation from them. Tagging appropriate folks and changing, adding different variety of folks ( consumer court, media houses, random celebrity just to keep the whole thread visibility.) It about patience. The same trouble that you don't want, same company also doesn't want. Parallely start the same complaint on credit card folks too. This would help you get added pressure. Pay the card bill and then start complaint, so that you don't get tagged as someone who hasn't paid bill, but someone who just trying to get their help. ( start a different reddit question to get help on how to start this) Let time work for you. That's what patience is all about. You will be surprised how time and keep track in mail, visibility to world via Twitter thread would help you. Good luck. And again.. patience. Lmaoo LINKEDIN! You need a lawyer. The seller's registered address was fake. They didn't respond to calls or mails. They are still active after doing 1000s of scams. What happens is people order stuff, then return duplicate items. These items go back into inventory, and then unsuspecting buyers get fakes. ChatGPT could be savior in drafting Put it up on X and tag it to Mukesh Ambani's X account. It will work out immediately for you. Hope you get your money back op! And do record a video during unboxing of any costly product from next time on.... That’s his first mistake. Apple almost never gives discount. If there is more discount than normal, there is a reason why. You are a scammer. Simple. Use ChatGPT to draft I see. I was just curious because these watches are so expensive and fragile to an extend, I wouldn’t be able to do any extensive outdoor activity peacefully thinking I’ll damage it somehow. Either way I would have preferred any Garmin watch any day as they are far more accurate and built for tough conditions considering the money being spent. But yeah in the end it comes down to personal preference especially with the eco system. Hope you get your issue sorted. Idk why you're being downvote for the real talk. I also faced a bad situation with LTONLINE.COM, I was very skeptical when I had been filing complaint with But surprisingly, one of the executives contacted me within two days and collected all details from me. Within one week the seller directly contacted me and send me the keys for a software purchased from him. From his voice, he was frightened and begging for taking back my complaint. Don't worry bro, please file a complaint with this link. You will get your issue resolved. Already sent 15 days ago let's see what will happen on 16 Ambani ka number dhund 😂 Cause people are stupid enough to believe that they get A grade quality products for \"deep discounts\", think that insane amount of packaging and transportation behind e commerce is good for our environment, do not understand the value of building relations with your nearby physical store. Always take a video of opening the package (Use a small tripod or ask someone to record the video) as evidence for such types of scenarios. You never know if you will end up receiving a stone in the box. If your complaint is genuine then someone at the packaging facility may have switched your product intentionally. Convincing customer service without evidence can be very difficult to catch the crook who may be working for them. Many cases like this of products being switched/ stone in the box from online retailers have been reported. If Jio is not ready to solve your issue then you will need to approach the Consumer Court for grievance redressal. Law and order are there, but how much do the people obey such laws damn! Can’t believe Jio mart could ever do this! 87k bruh that’s a lott💀 Take legal action against them and believe me it is much more easier & affordable than you think. 1. Send a Legal Notice to company through a lawyer. There are many online portals that can send Legal Notice on your behalf and a few are quite affordable as they charge less than Rs.1400. There are good chances that you will get attention and most probably resolution just by sending legal notice. 2. But if you don't get any resolution by sending notice then the next step is to approach consumer court and file case. This step is lengthy and may take upto 1.5 years to get relief. But please note that most of the consumer cases are settled out of court as companies will try to save their reputation! So, again chances are better for consumers. Disclaimer : I am associated with a legal platform engaged in resolving consumer complaints. The mistake is buying a 80+K watch what the fuck was OP thinking lol Try filing complain in consumer court. Good job. Recently bought Macbook air M1 from Apple directly. Could have gone with Amazon but i am not taking any risks for a ₹1L product for 3-4k. I did get free airpods as a part of student discount, but in any case i wasn't going with Amazon at any cost. \"Make an unboxing video\" except it's an electronic item and the damage can be internal, the video will be completely useless in that case. I see, they have pretty good google ranking/SERP for popular dog feed too. Some products are being featured in non sponsored google shopping tab. Since they are getting ranked so high, it is very likely more people will be soon in your position. They need to be stopped. Have you escalated the case on edaakhil.nic.in ? The biggest bastards of the e-commerce space — Reliance Not a lawyer, but I have plenty of experience with consumer protection matters. Two things you should do. 1. Find out the contact details of the grievance officer for jio mart and send them a legal notice. Under the law (Consumer Protection Act 2019, and E-commerce Roles 2020) they are required to have one and they are required to respond to you within 48 hours. Don't worry about getting a lawyer to draft the notice. You just need to clearly articulate the problem and the steps you have gone through so far. Include the dates of your interactions with their customer support. Attach images, invoice etc. Anything to make your argument stronger. End the notice with some lines to the effect of \"This clearly a deficiency of service and unfair trade practice under the Consumer Protection Act 2019. Further, JioMart has failed to do the due diligence of the seller that is mandatory under the Information Technology Act 2000 and the E-commerce Rules 2020. I want a full refund and formal apology from JioMart by <date> <time>. If JioMart fails to do so, I will file a complaint in the consumer court and the Central Consumer Protection Authority.\" Make sure you include the words \"legal notice\", \"deficiency of service\" and \"unfair trade practice\" in your subject line and in the body of the email in several places. 9 out of 10 chance that they'll just refund your money in 2-5 days. 2. Another you can do is to file an online complaint through the National Consumer Helpline. They also have a toll free telephone number and a WhatsApp interface. There's a third thing you can do, which is to write to the consumer affairs dept directly. You can find the email ids from the who's who page of the department website. The people you want to contact are the JS and AS in charge of eCommerce. If you're reading this as of 11th Nov 2023, that would be Mr Anupam Mishra and Ms Nidhi Khare respectively. This one is a very low success rate strategy though. You are likely to get results from the two measures I recommended above. Good luck! Don't let the bastards grind you down! Tag reliance shareholders and Tim Apple just me or 87k for apple watch is still crazy Do you meet the criteria for raising a chargeback dispute through your payment provider? If you go to chrome or reliance digital in my city and show the amazon price they will quote you the same or less price thats somehow a rule here Sue the living hell out of them lol. You might get more than they could bargain for GO TO THE NATIONAL CONSUMER HELPLINE IMMEDIATELY. They are extremely efficient and helpful and the best part is this is completely digital. Attach the proper proofs (receipts, invoices, relevant images) and file your complaint. Before you go to this step you can also inform the companny customer care thhat you will be taking this step. Sometimes mentioning this itself streamlines the resolution. If you couldn't get a proper resolution then go ahead with the national consumer helpline and the problem will be resolved asap. Also, Fuck Jio's ecommerce division. I had a problem with Ajio where the delivery guy stole my packages and did not respond to our calls. (picked our call at first and then claimed to be in Rajasthan and sttopped picking our calls after that). When we complained about this to the customare care section we were met with such a horrendous display of absolute lack of empathy. Finally we threatened them with national consumer helpine which prompted them to give us a date by which they were supposed to refund us. They failed to comply with their own deadline and we went with the national cocnnsumer helpline. The refund couldn't have been quicker and my Ajio account was banned :). Doesn't matter tho wouldn't shop from them again. Isse acha flipkart ya amazon se leta open box delivery hai usme Nope, they are not the same. Reliance Digital is a seller. JioMart is a website where any \"company\" can sell you shit. Reliance Digital is actually very good. They have great service and everything. JioMart is shit. You never know whom you're buying from. Tweet it and post the link on the post so that we can retweet etc If its the same price on manufacturer website… why do people try third party sites? Especially for big ticket purchases? This is something i never understood. Online shopping had come to this now? Can t even open box without record? Please file this complaint by registering into Ministry of Consumer Affairs, Govt of india's dedicated consumer online platform through link or telephonically at helpline no. 1800 11 4000. Try filing chargeback. Raise a ticket through NCH. Like amazon? You don't give up. Write about this in 'Mouthshut' or similar sites. The company will have to respond. Feel like quality control checks aren't being done on returned items unless the scam is so good that it passes all visual checks. No. I didn't pursue edaakhil because I felt it would end up like NCH, with no resolution. That's why I don't buy above 50k products from online stores. There is also the fact that if third party seller also sells same sku and its also fulfilled and stocked at amazon warehouse, third party sellers fake stuff will get mixed with appario stuff., Again bs, don’t listen to his advice. Buy only from official site or store Grok** Fucking sue them Goddamn bruh, that's horrible. Hope you are recovering well, it's difficult. Just don't put your mental health dependent on the outcome of this fight, but do fight them, being in an industry where time is of the essence and providing such abysmal service is criminal. Make their life hell. buying a 90k watch, you might have got scammed in life. Melbon ☠️💀 Yes, if its an expensive item, you have to film the real unboxing so that your case is watertight. Start from the packaging and film everything. I buy a lot of electronic items from all the big 3, have been scammed out of a 4tb hdd on flipkart, but got my money back because I filmed it. Also, I contacted flipkart team on Twitter DM. They were helpful. They have to provide a solution or a satisfactory answer within 48hrs of you raising the request, but now it's late, you can file a complaint now OP doesn't \"kinda\" deserve this at all. Now, I would suggest to the OP to be aware enough to film the complete unboxing experience by clearly showing the untampered outer packaging and proceeding further. Then he can just upload the video to social media so it's not his word against jio's. That was absolutely reprehensible, you should mention the road where the store is if not directly. And dont delete that video, you might want to caution your friends and family. Thanks for posting, that's really encouraging and I'm bookmarking this. Dont waste your another second contacting the jio mart help. As its been over a week . The only solution is go to your district consumer court and lodge a case against them. They will refund your full amount and will give you the desired apple watch for free. Lol who buys from jio Mart that too a luxury product Fiduciary duty, I like that, it's true. It's why platform is even allowed to conduct business, they have to have consumer protection in order to be allowed to do business. Hey there is a national consumer helpline. You can just upload your grievience there Iam wondering how did an Apple watch cost almost 90k in the first place This is 1 If u have paid through credit card , just inform them u have been scammed and put a chargeback request yes file a complain in consumer court Yes, Thats him. No ofcourse not, I would do it just to give him trouble. This money doesn't matter to me now. Its been sometime. I tried my best to shame him. I found out about his college too. He is from GIET Gunpur, Odisha. I reached out to one of his batchmates and told about him. Wanted to hurt his social circle, but couldn't reach much. Its was just personal revenge for me. He was such a shitty human to pet parent who was already losing their dog. As for my Goldie, she was destined to die as her previous owner had left her untreated with a liver infection on the street, she was terminally ill, I was just getting her more time as she was a genuinely happy dog despite all the hardships she had been through. She is still in our hearts as a dog who happily hopped her way across the rainbow bridge. Why didn’t you buy from Croma, reliance digital or the Apple Store bro r/LegalAdviceIndia might help Get yourself a cyber insurance guys! Jio providing good telecom services doesn't automatically make it trustable in other fields. I THINK YOU NEEDED TO BE SCAMMED. Make it dirty Wake up babe(r/indiagaming) new flipkart just dropped > Jio is trusted. Speak for yourself. Bro, just buy from retail if you are spending more than 5k unless its a reputed source. Why not choose Amazon, or least Flipkart… they have much better standards for online shopping, Reliance is better for offline shopping.. Uv been scammed by the employees. Croma me chale jata buy krne yeah, they do. there's a lot of stuff sold by reliance retail themselves, but also a lot of shit that is not. although there are no seller ratings shown (and very few product ratings too tbh), one is always better off looking at the seller name before buying from there. true. i've had to return some clothes before and after initiating return, there was absolutely no update for around two weeks. i called the customer service and they told me that it is underway, but there was still no update. i didn't actively pursue the return because i didn't have any major issue with the products, but after several days i got a message from delhivery about the return pickup. it took several more days for the pickup to actually happen (and i blame this on delhivery, it's very typical of them) but once it did, it again took arround ten days with no updates whatsoever until i got the notification for the refund. i did however recently have a bad experience with a jiomart return. the same thing as before, return initiated but no update, then the delhivery message but no pickup. however, this time when i checked the app, it was marked as \"return rejected\". i called the customer care around three or four times, wrote to them and the customer service head around thrice as well. they assured me pickup had been rescheduled and it would take place, but to my surprise the ticket had been closed without any update or resolution again. i again contacted them multiple times and recieved positive replies, only to be told on the last email that they'd crossed the \"maximum attempts\" for the ticket and would not process the return (despite it being completely their technical faults). i was very pissed, but couldn't really do much. this whole fiasco took around a month, and i really hope that's not how it goes for op. If you already have a history of similar refunds then you are likely to be suspected as a scammer, these online stores get a bunch of those daily just saw a news about guy who refunded 20L worth of products from Amazon with x customer support agents help. > doesn't jiomart have open box delivery stuff? nope, at least not in my experience. they just courier it to you via delhivery. Rs. 500/- to 50k or more depending on the case. Find someone to file consumer court case, If you haven't been able to do it correctly. Bro, but what about the cost of sending legal notices? How to get that back? You just bought a product and because of the incompetency/fraud of the people working for the platform, you have to go through so much hassle and pain and time just to get your money back? Doesn't seem fair. Who tf buys a 90k watch and that too from jio mart bruv Consumer complaint. Send me too. Who even buys from Jio Mart? yes with me too they are scammers Taking the real risk, bro😁🤣 Had it gone as planned you would have had an Apple Watch. You basically were scamming yourself and someone beat you to it. Their customer service is shit . I once ordered 2 packs of cheese wo saale 1 deke gye aur fir customer support walle phone utha ke raazi ni ho re Why would you busy it from.jio.mart..why not Amazon Well it's India. You're not getting your money back.... They need it Hmm Keep calling costumer care and pressuring them. Ask for supervisor and always talk to the supervisor. I had something similar and I used to call them at least twice a day. After a week or so they accepted the return and refunded me. The best thing you can do for all these expensive purchases are using your credit card for payment and filing a dispute in case of such fakes. I have successfully done the same against Flipkart for selling fake camera lens. Flipkart sells Motorcycles ? Wtf Dude put in LinkedIn tag the CEO manager whoever is involved. Post the invoice too. That’s sad bro. Hard lesson. Shoot video from taking delivery to unboxing, always! You would have received refund. But now, there’s not much you can do! Seller or delivery partner scammed you! Just 3 days back I've ordered Jio phone Prima 4G phone and now skeptical whether it'll be real one or not. Yes, Purchased my xpulse on Flipkart. Picked up the bike the next day from the allocated Dealer. They have partnership with Hero Motocorp. This was one reason why I ditched my plan for Himalayan. I was getting 13k discount on the ex showroom. First mail them by threatening to file a case in the Consumer court and also post this thing on Twitter and give this info to some youtubers on insta who will listen to you if that also doesn't work. Go to the consumer court to punish these scammers. You deserved it for buying an Apple product from JioMart instead of Apple’s own website. 😌 Dispute the credit card charge? You just wasted 87k just on a watch Did you win the chargeback? Like I said, I haven't heard anything yet. Bank sent me a message 1 month after I initiated, saying some investigation will take 30 days or something. It's already been 2 months since the return was rejected. These processes are slow, and it's easy for Flipkart and others to just scam you and get away with it. Bombard their linkedIn, Instagram, consumer court is not free and takes time. Also if you live in one of the cities, where they have an office like Bengaluru, please visit their office. I would have created a ruckus if it were me, 90k ke saath saath apne haath ki ghadi bhi dete ye log. Also if you can spend 87k don’t be cheapo for a few hundred extra discount Bro don't trust online platform for high value purchases. Always go to authorised physical stores even it costs more. Twitter and other social media platforms Never buy anything from jiomart . noted Bro, it's jio Mart, like why Buying an 90k device from jio Mart what were you thinking?? I wouldn't but that from Amazon even. either you should get it from apple official website of offline stores, I know this ain't gonna help now but is someone is seeing my comment y'all should keep in mind People forget from time to time, that India has never been safe for online shopping. It was uplifted by Amazon with it's customer centric policies and people started trusting in online shopping. Even Flipkart was not able to do it at that time. I still remember 10 years back I wanted to order RAM online and my father used to say, it's not safe ordering online. So, take caution if you are ordering on any other site other than Amazon. Amazon has best customer services. Even Flipkart will not resolve your issues. And avoid big purchases if product is not available on amazon. Take to twitter and find JioMart and start commenting on their each and every post with your complaint and tag Jiomart. I have seen most brands would respond on twitter rather than conventional channels. OP In which state you are? I might get you to contact the highest authority via Linkedin. I have worked at jiomart in punjab. I’m a former employee of Reliance What is the difference between WORSHIP and SADHNA? For More information read the Book GYAN GANGA 📚 🎯TO ORDER A FREE BOOK 🎯 ✏️NAME ✏️DISTRICT ✏️STATE ✏️PIN CODE ✏️MOBILE NUMBER at my location it's fees is less than 100₹ and you can represent your case Dude, life is not fair. I would rather spend Rs.1500 more to save my investment in the product than waste it completely as the product is defective/useless. Moreover, when you take legal action there are chances you get connected to someone in the company at higher level and they can offer discount / gifts to make you happy. Though you can do the same but they are just a platform to re-discuss the matter with the SAME customer support team than anything else! If they fail to get any reply or any help, they will ultimately ask you to take Legal Action! So, what the whole point of wasting efforts & time? Hey, I've used it 5 times. And it has been resolved all 5 times. It can be used against the company as proof incase you goto court Thats great! When you go to court even your emails and company chat or support tickets are a valid proof. So, I will still not waste my time in collecting more proofs when I already have a clear case of deficiency in service or unfair trade practice. Again I've always seen that things get resolved when I raise a complaint on nch. I didn't have to go to court. Why do you need to goto court of there's a chance of fixing it before With due respect, I am not advocating going to Court. I am simply suggesting taking legal action by sending Legal Notice through a lawyer. Thats a pre-step of approaching consumer court! With online purchases we have to be very carefull. Even the suppliers are scammed by customers and courier partners and the online portals do nothing. Has happened on Meesho also. That cost money, this doesn't. You can approach lawyer post no resolution here 20-21 there are like 6.7 lakh dockets raised on their systems. I think it's fair enough to use this before you need to approach a lawyer You can check the image here Check websites of Jio mart or Reliance digital or Reliance retail you can find a greviance email on their websites. I think you can mail directly to CEO aur head of customer support. File a case with all the documents in the consumer court. Also you can post a message on twitter explaining your problem and tagging in directly the CEO of Jiomart. That's it.. Problem solved. Do it and get your problem solved. Don't delay. As a first step, you can just post the message on twitter with ceo and other top officials of Jiomart...Your 87K is not a small amount and when you post on twitter whole India will look at it and your refund will be very fast...This should 100% work and but if you are unlucky and If it doesn't work, Go to consumer court... I know this is little painful but losing 87K is more painful...If you go to consumer court, you will definitely get a refund or replacement and also the monetary compensation for the mental struggle you have undergone all through this period. Fee taken is directly proportional to the extent of strong words used in the Notice along with legal knowledge of the lawyer Guys I will draft for you for 500 rupees I am a legal intern 1- File a charge back from your credit card company . 2- File a complaint at [https://consumerhelpline.gov.in](https://consumerhelpline.gov.in) ( Upload all the screenshots of email communication) take the screenshot of the complaint email it to E commerce company. This is how i got my refund from Unacadmy , trust me it is tougher than Jiomart. Pursuing edaakhil wouldn't hurt, never gone through that route. Maybe someone can shed a light Online shopping for me is only Amazon.. I don't buy anything from any other online shopping app other than Amazon.. Yes, like Amazon. But Amazon has \"safe\" sellers like Appario. I don't buy expensive stuff from amazon unless it is sold by Appario. For expensive electronics, I would trust Vijay Sales and Reliance Digital way more than any online store. Complain to National Consumer Helpline online. They solve it within 48 hours. file FIR complaint towards mukesh ambani for his different products which is not given then escalate matter to consumer court then head towards supreme court for emailing them directly then watch it!! Quick question: Does the Consumer court charge money? I filed one against Amazon(long story) but the amount I filed for was less than 3K. I got a WhatsApp from a lawyer working with consumer court and he's asking me for 299 INR. Is this legit or what? His profile on WhatsApp seems legit. Grok asks for a Premium account on X :/ Telangana To raise a complaint against JioMart, you can follow these steps: 1. Customer Support:0620-0770-780 Start by contacting JioMart's customer support team. They are usually the first point of contact for resolving any issues or complaints. You can reach out to them through various channels such as phone, email, or live chat. Check JioMart's website or your order confirmation for the contact details. 2. Clearly Explain the Issue: When communicating your complaint to JioMart's customer support, make sure to provide a clear and detailed explanation of the problem you are facing. Include relevant information such as your order number, date of purchase, and any supporting evidence like receipts or screenshots. 3. Maintain Documentation: Keep a record of all communication with JioMart, including dates, times, and the names of the customer support representatives you interact with. This documentation will be useful if you need to escalate the complaint later. 4. Escalate the Complaint: If you don't receive a satisfactory response from the customer support team or your issue remains unresolved, you can escalate your complaint to a higher level within JioMart's hierarchy. Ask to speak with a supervisor or a manager who may have more authority to address your concern. 5. Contact Consumer Forums: If your complaint is still not resolved, you can consider filing a complaint with relevant consumer forums or regulatory authorities in your country. These organizations are responsible for protecting consumer rights and can intervene on your behalf. 6. Seek Legal Advice: In certain situations, particularly if you have suffered significant financial loss or harm due to JioMart's actions, you may want to consult with a lawyer who specializes in consumer law. They can guide you on the legal options available and help you navigate the process. Remember to remain calm and composed throughout the complaint resolution process. Clearly articulating your issue and maintaining a record of your communication will significantly improve your chances of getting a satisfactory resolution. In case of complete cancellation of order, delivery fee will be refunded 801-1896721 to you along with the product amount you paid. In case of return of already delivered product, delivery fee will not be refunded, only product amount will be refunded. 801-1896721 In such cases, Return request can be initiated post 801-1896721 receipt of the products. The amount shall be refunded to you through the same mode of payment (in case of Prepaid) or via credit to your store credit account (in case of COD) which can be used for subsequent purchases.801-1896721 In case of complete cancellation of order, delivery fee will be refunded to you along with the 801-1896721 product amount you paid. In case of return of already delivered product, delivery fee will not be refunded, only product amount will be refunded. 801-1896721 If you are unsatisfied with a purchase from Reliance JioMART and wish to request a refund, you can contact their customer service team through their website or mobile app.801-1896721 Provide details of your order and reason for the refund request, and they will assist you in processing the refund if applicable. To talk to an Jiomart executive through the 198 helpline, you can try the following steps: Dial 0637~2293–165 from your Jiomart mobile phone. This is the customer care helpline number for Jiomart in India. Listen to the automated voice prompts carefully. The menu options may have changed, so follow the instructions provided. In some cases, you may need to press a specific number or stay on the line without selecting any option to connect to a customer care executive. Listen to the available options carefully to find the one that allows you to speak with a representative. Be prepared to wait on hold as there may be a queue of callers ahead of you. Customer care lines can sometimes be busy, so patience will be necessary. Once connected to a customer care executive, clearly explain the reason for your call and provide any necessary details or account information they may ask for. This will help them understand your query or concern better and provide you with the appropriate assistance. If you are unable to reach an executive through the 198 helpline or if the process has changed, I recommend visiting Jiomart's official website or contacting their customer support through their official channels to inquire about the best way to speak with an executive order to get. First mistake I did was buying an Apple Watch Ultra from JioMart. I received a wrong product, I received this Watch 6372<293-165 Melbon Astra. Immediately I was worried and I went to customer service via chat and previously I had refunds go through when the product was damaged such as oats so I thought I will just return this and get replacement/refund. Fast-Forward 1 week later, Over 25 customer service agents contacted 10+ emails to customer support, customer support head, Even A consumer complaint/grievance, And still nothing. They have kept the return request on hold. First they said 3 days, then 4, now it’s a week. I don’t know what else to do. Someone help me. What do I do. I have the invoice for the original purchase, I don’t know what to do. No one is doing anything, every chat agent keep saying give us more time give us more time. How much more do they want?hshd To raise a complaint with Jiomart, you can follow these steps: Contact Jiomart Support:07439-106-971 The first step is to reach out to Jiomart customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Swiggy. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Jiomart customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution.cgctch To file a complaint with Jiomart, you can follow these steps: Contact Jiomart Customer Support: 06372-293-165.The first step is to reach out to Jiomart's customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with Jiomart. You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process.customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution and I have a.cgxghc To raise a complaint with Jiomart, you can follow these steps: Contact Jiomart Support:06372-293-165 The first step is to reach out to Jiomart customer support team. You can do this through their app or website. Look for the \"Help\" or \"Contact Us\" section, which usually includes options to chat with a support representative or submit a complaint. Provide Relevant Details: When contacting customer support, provide them with all the necessary details related to your complaint. This may include the order number, date and time of the incident, the restaurant involved, and a clear description of the issue you faced. Be Specific and Clear: Clearly explain the problem you experienced with your Jiomart order or service. Provide specific information about what went wrong and how it affected your experience. The more details you can provide, the better it will help Jiomart understand and address your complaint. Attach Evidence: If you have any evidence supporting your complaint, such as order screenshots, photos, or receipts, make sure to attach them while submitting your complaint. This can strengthen your case and help Jiomart investigate the issue more effectively. Request a Resolution: Clearly state what you expect as a resolution to your complaint. It could be a refund, a coupon, or any other form of compensation that you deem appropriate. Follow Up: If you don't receive a satisfactory response within a reasonable timeframe, consider following up with . You can reach out to customer support again or try to escalate the issue through their social media channels. Utilize Social Media: If your complaint remains unresolved, you can consider reaching out to Jiomart official social media accounts (such as Twitter or Facebook) and publicly share your complaint. Companies often pay attention to public complaints and may respond more promptly to protect their reputation. Remember to remain polite and provide accurate information throughout the process. Jiomart customer support team is there to assist you, and by clearly communicating your complaint, you increase the chances of a satisfactory resolution.cgctch If paid via VISA or Mastercard raise a charge back claiming wrong product delivered The bastard Ambani family became rich just by looting the customers & he is the one of the main reason that we indians lost trust on indian companies. did u get your money back?"
}